[
    {
        "year": "2021",
        "name": "22nd IPCO 2021",
        "info": "Atlanta, GA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ipco/2021",
                "sub_name": "Integer Programming and Combinatorial Optimization - 22nd International Conference, IPCO 2021, Atlanta, GA, USA, May 19-21, 2021, Proceedings.",
                "count": 33,
                "papers": [
                    "Improving the Approximation Ratio for Capacitated Vehicle Routing.",
                    "Online k-Taxi via Double Coverage and Time-Reverse Primal-Dual.",
                    "Approximating the Discrete Time-Cost Tradeoff Problem with Bounded Depth.",
                    "Sum-of-Squares Hierarchies for Binary Polynomial Optimization.",
                    "Complexity, Exactness, and Rationality in Polynomial Optimization.",
                    "On the Geometry of Symmetry Breaking Inequalities.",
                    "Affinely Representable Lattices, Stable Matchings, and Choice Functions.",
                    "A Finite Time Combinatorial Algorithm for Instantaneous Dynamic Equilibrium Flows.",
                    "A Combinatorial Algorithm for Computing the Degree of the Determinant of a Generic Partitioned Polynomial Matrix with $2\\, \\times \\, 2$ Submatrices.",
                    "On the Implementation and Strengthening of Intersection Cuts for QCQPs.",
                    "Lifting Convex Inequalities for Bipartite Bilinear Programs.",
                    "A Computational Status Update for Exact Rational Mixed Integer Programming.",
                    "New Exact Techniques Applied to a Class of Network Flow Formulations.",
                    "Multi-cover Inequalities for Totally-Ordered Multiple Knapsack Sets.",
                    "Semi-streaming Algorithms for Submodular Matroid Intersection.",
                    "Pfaffian Pairs and Parities: Counting on Linear Matroid Intersection and Parity Problems.",
                    "On the Recognition of a, b, c-Modular Matrices.",
                    "On the Power of Static Assignment Policies for Robust Facility Location Problems.",
                    "Robust k-Center with Two Types of Radii.",
                    "Speed-Robust Scheduling - Sand, Bricks, and Rocks.",
                    "The Double Exponential Runtime is Tight for 2-Stage Stochastic ILPs.",
                    "Fast Quantum Subroutines for the Simplex Method.",
                    "Maximum Weight Disjoint Paths in Outerplanar Graphs via Single-Tree Cut Approximators.",
                    "A Tight Approximation Algorithm for the Cluster Vertex Deletion Problem.",
                    "Fixed Parameter Approximation Scheme for Min-Max k-Cut.",
                    "Computational Aspects of Relaxation Complexity.",
                    "Complexity of Branch-and-Bound and Cutting Planes in Mixed-Integer Optimization - II.",
                    "Face Dimensions of General-Purpose Cutting Planes for Mixed-Integer Linear Programs.",
                    "Proximity Bounds for Random Integer Programs.",
                    "On the Integrality Gap of Binary Integer Programs with Gaussian Data.",
                    "Linear Regression with Mismatched Data: A Provably Optimal Local Search Algorithm.",
                    "A New Integer Programming Formulation of the Graphical Traveling Salesman Problem.",
                    "Implications, Conflicts, and Reductions for Steiner Trees."
                ]
            }
        ]
    },
    {
        "year": "2020",
        "name": "21st IPCO 2020",
        "info": "London, UK",
        "venues": [
            {
                "sub_name_abbr": "conf/ipco/2020",
                "sub_name": "Integer Programming and Combinatorial Optimization - 21st International Conference, IPCO 2020, London, UK, June 8-10, 2020, Proceedings.",
                "count": 33,
                "papers": [
                    "Idealness of k-wise Intersecting Families.",
                    "Flexible Graph Connectivity.",
                    "Faster Algorithms for Next Breakpoint and Max Value for Parametric Global Minimum Cuts.",
                    "Optimizing Sparsity over Lattices and Semigroups.",
                    "A Technique for Obtaining True Approximations for k-Center with Covering Constraints.",
                    "Tight Approximation Bounds for Maximum Multi-coverage.",
                    "Implementing Automatic Benders Decomposition in a Modern MIP Solver.",
                    "Improved Approximation Algorithms for Inventory Problems.",
                    "Extended Formulations for Stable Set Polytopes of Graphs Without Two Disjoint Odd Cycles.",
                    "On a Generalization of the Chvátal-Gomory Closure.",
                    "Algorithms for Flows over Time with Scheduling Costs.",
                    "Integer Plane Multiflow Maximisation: Flow-Cut Gap and One-Quarter-Approximation.",
                    "Stochastic Makespan Minimization in Structured Set Systems (Extended Abstract).",
                    "Continuous Facility Location on Graphs.",
                    "Recognizing Even-Cycle and Even-Cut Matroids.",
                    "A Combinatorial Algorithm for Computing the Rank of a Generic Partitioned Matrix with 2 ˟ 2 Submatrices.",
                    "Fair Colorful k-Center Clustering.",
                    "Popular Branchings and Their Dual Certificates.",
                    "Sparse Graphs and an Augmentation Problem.",
                    "About the Complexity of Two-Stage Stochastic IPs.",
                    "Packing Under Convex Quadratic Constraints.",
                    "Weighted Triangle-Free 2-Matching Problem with Edge-Disjoint Forbidden Triangles.",
                    "Single Source Unsplittable Flows with Arc-Wise Lower and Upper Bounds.",
                    "Maximal Quadratic-Free Sets.",
                    "On Generalized Surrogate Duality in Mixed-Integer Nonlinear Programming.",
                    "The Integrality Number of an Integer Program.",
                    "Persistency of Linear Programming Relaxations for the Stable Set Problem.",
                    "Constructing Lattice-Free Gradient Polyhedra in Dimension Two.",
                    "Sequence Independent Lifting for the Set of Submodular Maximization Problem.",
                    "A Fast (2 + 2/7)-Approximation Algorithm for Capacitated Cycle Covering.",
                    "Graph Coloring Lower Bounds from Decision Diagrams.",
                    "On Convex Hulls of Epigraphs of QCQPs.",
                    "On the Convexification of Constrained Quadratic Optimization Problems with Indicator Variables."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "20th IPCO 2019",
        "info": "Ann Arbor, Michigan, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ipco/2019",
                "sub_name": "Integer Programming and Combinatorial Optimization - 20th International Conference, IPCO 2019, Ann Arbor, MI, USA, May 22-24, 2019, Proceedings.",
                "count": 33,
                "papers": [
                    "Identically Self-blocking Clutters.",
                    "Min-Max Correlation Clustering via MultiCut.",
                    "Strong Mixed-Integer Programming Formulations for Trained Neural Networks.",
                    "Extended Formulations from Communication Protocols in Output-Efficient Time.",
                    "Sub-Symmetry-Breaking Inequalities for ILP with Structured Symmetry.",
                    "Intersection Cuts for Polynomial Optimization.",
                    "Fixed-Order Scheduling on Parallel Machines.",
                    "Online Submodular Maximization: Beating 1/2 Made Simple.",
                    "Improving the Integrality Gap for Multiway Cut.",
                    "\\ell _1 -sparsity Approximation Bounds for Packing Integer Programs.",
                    "A General Framework for Handling Commitment in Online Throughput Maximization.",
                    "Lower Bounds and a New Exact Approach for the Bilevel Knapsack with Interdiction Constraints.",
                    "On Friedmann's Subexponential Lower Bound for Zadeh's Pivot Rule.",
                    "Tight Approximation Ratio for Minimum Maximal Matching.",
                    "Integer Programming and Incidence Treedepth.",
                    "A Bundle Approach for SDPs with Exact Subgraph Constraints.",
                    "Dynamic Flows with Adaptive Route Choice.",
                    "The Markovian Price of Information.",
                    "On Perturbation Spaces of Minimal Valid Functions: Inverse Semigroup Theory and Equivariant Decomposition Theorem.",
                    "On Compact Representations of Voronoi Cells of Lattices.",
                    "An Efficient Characterization of Submodular Spanning Tree Games.",
                    "The Asymmetric Traveling Salesman Path LP Has Constant Integrality Ratio.",
                    "Approximate Multi-matroid Intersection via Iterative Refinement.",
                    "An Exact Algorithm for Robust Influence Maximization.",
                    "A New Contraction Technique with Applications to Congruency-Constrained Cuts.",
                    "Sparsity of Integer Solutions in the Average Case.",
                    "A Generic Exact Solver for Vehicle Routing and Related Problems.",
                    "Earliest Arrival Transshipments in Networks with Multiple Sinks.",
                    "Intersection Cuts for Factorable MINLP.",
                    "Linear Programming Using Limited-Precision Oracles.",
                    "Computing the Nucleolus of Weighted Cooperative Matching Games in Polynomial Time.",
                    "Breaking Symmetries to Rescue Sum of Squares: The Case of Makespan Scheduling.",
                    "Random Projections for Quadratic Programs over a Euclidean Ball."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "19th IPCO 2017",
        "info": "Waterloo, ON, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/ipco/2017",
                "sub_name": "Integer Programming and Combinatorial Optimization - 19th International Conference, IPCO 2017, Waterloo, ON, Canada, June 26-28, 2017, Proceedings.",
                "count": 36,
                "papers": [
                    "The Two-Point Fano and Ideal Binary Clutters.",
                    "On Scheduling Coflows - (Extended Abstract).",
                    "Integrality Gaps of Integer Knapsack Problems.",
                    "An Improved Integrality Gap for the Călinescu-Karloff-Rabani Relaxation for Multiway Cut.",
                    "Approximation of Corner Polyhedra with Families of Intersection Cuts.",
                    "The Structure of the Infinite Models in Integer Programming.",
                    "Mixed-Integer Linear Representability, Disjunctions, and Variable Elimination.",
                    "Deterministic Fully Dynamic Approximate Vertex Cover and Fractional Matching in O(1) Amortized Update Time.",
                    "Cutting Planes from Wide Split Disjunctions.",
                    "The Saleman's Improved Tours for Fundamental Classes.",
                    "The Heterogeneous Capacitated k-Center Problem.",
                    "Local Guarantees in Graph Cuts and Clustering.",
                    "Verifying Integer Programming Results.",
                    "Long Term Behavior of Dynamic Equilibria in Fluid Queuing Networks.",
                    "A 4/5 - Approximation Algorithm for the Maximum Traveling Salesman Problem.",
                    "Minimizing Multimodular Functions and Allocating Capacity in Bike-Sharing Systems.",
                    "Compact, Provably-Good LPs for Orienteering and Regret-Bounded Vehicle Routing.",
                    "Discrete Newton's Algorithm for Parametric Submodular Function Minimization.",
                    "Stochastic Online Scheduling on Unrelated Machines.",
                    "Online Matroid Intersection: Beating Half for Random Arrival.",
                    "Number Balancing is as Hard as Minkowski's Theorem and Shortest Vector.",
                    "An Improved Deterministic Rescaling for Linear Programming Algorithms.",
                    "Min-Max Theorems for Packing and Covering Odd (u, v)-trails.",
                    "Breaking 1 - 1/e Barrier for Non-preemptive Throughput Maximization.",
                    "A Quasi-Polynomial Approximation for the Restricted Assignment Problem.",
                    "Adaptive Submodular Ranking.",
                    "On the Notions of Facets, Weak Facets, and Extreme Functions of the Gomory-Johnson Infinite Group Problem.",
                    "Minimum Birkhoff-von Neumann Decomposition.",
                    "Maximum Matching in the Online Batch-Arrival Model.",
                    "Budget Feasible Mechanisms on Matroids.",
                    "Deterministic Discrepancy Minimization via the Multiplicative Weight Update Method.",
                    "Mixed-Integer Convex Representability.",
                    "High Degree Sum of Squares Proofs, Bienstock-Zuckerberg Hierarchy and CG Cuts.",
                    "Enumeration of Integer Points in Projections of Unbounded Polyhedra.",
                    "Excluded t-Factors in Bipartite Graphs: A Unified Framework for Nonbipartite Matchings and Restricted 2-Matchings.",
                    "Equilibrium Computation in Atomic Splittable Singleton Congestion Games."
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "18th IPCO 2016",
        "info": "Liège, Belgium",
        "venues": [
            {
                "sub_name_abbr": "conf/ipco/2016",
                "sub_name": "Integer Programming and Combinatorial Optimization - 18th International Conference, IPCO 2016, Liège, Belgium, June 1-3, 2016, Proceedings.",
                "count": 33,
                "papers": [
                    "On Approximation Algorithms for Concave Mixed-Integer Quadratic Programming.",
                    "Centerpoints: A Link Between Optimization and Convex Geometry.",
                    "Rescaled Coordinate Descent Methods for Linear Programming.",
                    "Approximating Min-Cost Chain-Constrained Spanning Trees: A Reduction from Weighted to Unweighted Problems.",
                    "Max-Cut Under Graph Constraints.",
                    "Sparsest Cut in Planar Graphs, Maximum Concurrent Flows and Their Connections with the Max-Cut Problem.",
                    "Intersection Cuts for Bilevel Optimization.",
                    "Exact Algorithms for the Chance-Constrained Vehicle Routing Problem.",
                    "Extended Formulations in Mixed-Integer Convex Programming.",
                    "k-Trails: Recognition, Complexity, and Approximations.",
                    "Better s-t-Tours by Gao Trees.",
                    "Popular Edges and Dominant Matchings.",
                    "Semidefinite and Linear Programming Integrality Gaps for Scheduling Identical Machines.",
                    "Stabilizing Network Bargaining Games by Blocking Players.",
                    "Round-Robin Tournaments Generated by the Circle Method Have Maximum Carry-Over.",
                    "Extreme Functions with an Arbitrary Number of Slopes.",
                    "Minimal Cut-Generating Functions are Nearly Extreme.",
                    "On the Mixed Binary Representability of Ellipsoidal Regions.",
                    "Constant Factor Approximation for ATSP with Two Edge Weights - (Extended Abstract).",
                    "Improved Approximation Algorithms for Hitting 3-Vertex Paths.",
                    "Improved Approximations for Cubic Bipartite and Cubic TSP.",
                    "An Approximation Algorithm for Uniform Capacitated k-Median Problem with 1+\\epsilon Capacity Violation.",
                    "Valid Inequalities for Separable Concave Constraints with Indicator Variables.",
                    "A Polyhedral Approach to Online Bipartite Matching.",
                    "On Some Polytopes Contained in the 0, 1 Hypercube that Have a Small Chvátal Rank.",
                    "Robust Monotone Submodular Function Maximization.",
                    "Maximizing Monotone Submodular Functions over the Integer Lattice.",
                    "Submodular Unsplittable Flow on Trees.",
                    "Strong Reductions for Extended Formulations.",
                    "Sum-of-Squares Hierarchy Lower Bounds for Symmetric Formulations.",
                    "Approximation-Friendly Discrepancy Rounding.",
                    "Deciding Emptiness of the Gomory-Chvátal Closure is NP-Complete, Even for a Rational Polyhedron Containing No Integer Point.",
                    "On the Quantile Cut Closure of Chance-Constrained Problems."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "17th IPCO 2014",
        "info": "Bonn, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/ipco/2014",
                "sub_name": "Integer Programming and Combinatorial Optimization - 17th International Conference, IPCO 2014, Bonn, Germany, June 23-25, 2014. Proceedings.",
                "count": 34,
                "papers": [
                    "The Cycling Property for the Clutter of Odd st-Walks.",
                    "On Simplex Pivoting Rules and Complexity Theory.",
                    "A Strongly Polynomial Time Algorithm for Multicriteria Global Minimum Cuts.",
                    "Integer Programs with Prescribed Number of Solutions and a Weighted Version of Doignon-Bell-Scarf's Theorem.",
                    "Centrality of Trees for Capacitated k-Center.",
                    "Sequence Independent, Simultaneous and Multidimensional Lifting of Generalized Flow Covers for the Semi-Continuous Knapsack Problem with Generalized Upper Bounds Constraints.",
                    "On the Unique-Lifting Property.",
                    "Maximum Weighted Induced Bipartite Subgraphs and Acyclic Subgraphs of Planar Cubic Graphs.",
                    "n-Step Cycle Inequalities: Facets for Continuous n-Mixing Set and Strong Cuts for Multi-Module Capacitated Lot-Sizing Problem.",
                    "On the Adaptivity Gap of Stochastic Orienteering.",
                    "A Utility Equivalence Theorem for Concave Functions.",
                    "Network Improvement for Equilibrium Routing.",
                    "Finding Small Stabilizers for Unstable Graphs.",
                    "The Triangle Splitting Method for Biobjective Mixed Integer Programming.",
                    "Cut Generation through Binarization.",
                    "A $\\frac{5}{4}$ -Approximation for Subcubic 2EC Using Circulations.",
                    "Box-Constrained Mixed-Integer Polynomial Optimization Using Separable Underestimators.",
                    "Submodular Maximization Meets Streaming: Matchings, Matroids, and More.",
                    "The All-or-Nothing Flow Problem in Directed Graphs with Symmetric Demand Pairs.",
                    "Reverse Split Rank.",
                    "Strong LP Formulations for Scheduling Splittable Jobs on Unrelated Machines.",
                    "How Good Are Sparse Cutting-Planes?",
                    "Short Tours through Large Linear Forests.",
                    "Linear Programming Hierarchies Suffice for Directed Steiner Tree.",
                    "An Improved Approximation Algorithm for the Stable Marriage Problem with One-Sided Ties.",
                    "Simple Extensions of Polytopes.",
                    "Lower Bounds on the Sizes of Integer Programs without Additional Variables.",
                    "On the Configuration LP for Maximum Budgeted Allocation.",
                    "Two-Term Disjunctions on the Second-Order Cone.",
                    "Coupled and k-Sided Placements: Generalizing Generalized Assignment.",
                    "A Unified Algorithm for Degree Bounded Survivable Network Design.",
                    "Scheduling and Fixed-Parameter Tractability.",
                    "Improved Branch-Cut-and-Price for Capacitated Vehicle Routing.",
                    "Claw-Free t-Perfect Graphs Can Be Recognised in Polynomial Time."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "16th IPCO 2013",
        "info": "Valparaíso, Chile",
        "venues": [
            {
                "sub_name_abbr": "conf/ipco/2013",
                "sub_name": "Integer Programming and Combinatorial Optimization - 16th International Conference, IPCO 2013, Valparaíso, Chile, March 18-20, 2013. Proceedings.",
                "count": 33,
                "papers": [
                    "On the Structure of Reduced Kernel Lattice Bases.",
                    "All-or-Nothing Generalized Assignment with Application to Scheduling Advertising Campaigns.",
                    "Constant Integrality Gap LP Formulations of Unsplittable Flow on a Path.",
                    "Intersection Cuts for Mixed Integer Conic Quadratic Sets.",
                    "Content Placement via the Exponential Potential Function Method.",
                    "Equivariant Perturbation in Gomory and Johnson's Infinite Group Problem: II. The Unimodular Two-Dimensional Case.",
                    "Blocking Optimal Arborescences.",
                    "Minimum Clique Cover in Claw-Free Perfect Graphs and the Weak Edmonds-Johnson Property.",
                    "A Complexity and Approximability Study of the Bilevel Knapsack Problem.",
                    "Matroid and Knapsack Center Problems.",
                    "Cut-Generating Functions.",
                    "Reverse Chvátal-Gomory Rank.",
                    "On Some Generalizations of the Split Closure.",
                    "Packing Interdiction and Partial Covering Problems.",
                    "On Valid Inequalities for Quadratic Programming with Continuous Variables and Binary Indicators.",
                    "An Improved Integrality Gap for Asymmetric TSP Paths.",
                    "Single Commodity-Flow Algorithms for Lifts of Graphic and Co-graphic Matroids.",
                    "A Stochastic Probing Problem with Applications.",
                    "Thrifty Algorithms for Multistage Robust Optimization.",
                    "Shallow-Light Steiner Arborescences with Vertex Delays.",
                    "Two Dimensional Optimal Mechanism Design for a Sequencing Problem.",
                    "Advances on Matroid Secretary Problems: Free Order Model and Laminar Case.",
                    "A Polynomial-Time Algorithm to Check Closedness of Simple Second Order Mixed-Integer Sets.",
                    "The Complexity of Scheduling for p-Norms of Flow and Stretch - (Extended Abstract).",
                    "The Euclidean k-Supplier Problem.",
                    "Facial Structure and Representation of Integer Hulls of Convex Sets.",
                    "An Efficient Polynomial-Time Approximation Scheme for the Joint Replenishment Problem.",
                    "Chain-Constrained Spanning Trees.",
                    "A Simpler Proof for $O(\\textrm{Congestion} + \\textrm{Dilation})$ Packet Routing.",
                    "0/1 Polytopes with Quadratic Chvátal Rank.",
                    "Eight-Fifth Approximation for the Path TSP.",
                    "Fast Deterministic Algorithms for Matrix Completion Problems.",
                    "Approximating the Configuration-LP for Minimizing Weighted Sum of Completion Times on Unrelated Machines."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "15th IPCO 2011",
        "info": "New York, NY, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ipco/2011",
                "sub_name": "Integer Programming and Combinatoral Optimization - 15th International Conference, IPCO 2011, New York, NY, USA, June 15-17, 2011. Proceedings.",
                "count": 33,
                "papers": [
                    "An Excluded Minor Characterization of Seymour Graphs.",
                    "Complexity Analyses of Bienstock-Zuckerberg and Lasserre Relaxations on the Matching and Stable Set Polytopes.",
                    "A Probabilistic Analysis of the Strength of the Split and Triangle Closures.",
                    "Partial Convexification of General MIPs by Dantzig-Wolfe Reformulation.",
                    "Lift-and-Project Cuts for Mixed Integer Convex Programs.",
                    "TSP on Cubic and Subcubic Graphs.",
                    "Approximability of Capacitated Network Design.",
                    "Facility Location with Client Latencies: Linear Programming Based Techniques for Minimum Latency Problems.",
                    "An Exact Rational Mixed-Integer Programming Solver.",
                    "Valid Inequalities for the Pooling Problem with Binary Variables.",
                    "On the Chvátal-Gomory Closure of a Compact Convex Set.",
                    "Design and Verify: A New Scheme for Generating Cutting-Planes.",
                    "Contact Center Scheduling with Strict Resource Requirements.",
                    "Set Covering with Ordered Replacement: Additive and Multiplicative Gaps.",
                    "Backdoor Branching.",
                    "A Subexponential Lower Bound for Zadeh's Pivoting Rule for Solving Linear Programs and Games.",
                    "An Iterative Scheme for Valid Polynomial Inequality Generation in Binary Polynomial Programming.",
                    "A New Approach to the Stable Set Problem Based on Ellipsoids.",
                    "Capacitated Vehicle Routing with Non-uniform Speeds.",
                    "Approximation Algorithms for Single and Multi-Commodity Connected Facility Location.",
                    "Safe Lower Bounds for Graph Coloring.",
                    "Computing the Maximum Degree of Minors in Mixed Polynomial Matrices via Combinatorial Relaxation.",
                    "Constructing Extended Formulations from Reflection Relations.",
                    "Integrality Gaps of Linear and Semi-Definite Programming Relaxations for Knapsack.",
                    "Degree Bounded Forest Covering.",
                    "A Primal-Dual Algorithm for Weighted Abstract Cut Packing.",
                    "Convexification Techniques for Linear Complementarity Constraints.",
                    "Iterative Packing for Demand and Hypergraph Matching.",
                    "Universal Packet Routing with Arbitrary Bandwidths and Transit Times.",
                    "A Layered Graph Model and an Adaptive Layers Framework to Solve Delay-Constrained Minimum Tree Problems.",
                    "Jump Number of Two-Directional Orthogonal Ray Graphs.",
                    "Optimal Matching Forests and Valuated Delta-Matroids.",
                    "Fixed-Charge Transportation on a Path: Linear Programming Formulations."
                ]
            }
        ]
    },
    {
        "year": "2010",
        "name": "14th IPCO 2010",
        "info": "Lausanne, Switzerland",
        "venues": [
            {
                "sub_name_abbr": "conf/ipco/2010",
                "sub_name": "Integer Programming and Combinatorial Optimization, 14th International Conference, IPCO 2010, Lausanne, Switzerland, June 9-11, 2010. Proceedings.",
                "count": 34,
                "papers": [
                    "Solving LP Relaxations of Large-Scale Precedence Constrained Problems.",
                    "Computing Minimum Multiway Cuts in Hypergraphs from Hypertree Packings.",
                    "Eigenvalue Techniques for Convex Objective, Nonconvex Optimization Problems.",
                    "Restricted b-Matchings in Degree-Bounded Graphs.",
                    "Zero-Coefficient Cuts.",
                    "Prize-Collecting Steiner Network Problems.",
                    "On Lifting Integer Variables in Minimal Inequalities.",
                    "Efficient Edge Splitting-Off Algorithms Maintaining All-Pairs Edge-Connectivities.",
                    "On Generalizations of Network Design Problems with Degree Bounds.",
                    "A Polyhedral Study of the Mixed Integer Cut.",
                    "Symmetry Matters for the Sizes of Extended Formulations.",
                    "A 3-Approximation for Facility Location with Uniform Capacities.",
                    "Secretary Problems via Linear Programming.",
                    "Branched Polyhedral Systems.",
                    "Hitting Diamonds and Growing Cacti.",
                    "Approximability of 3- and 4-Hop Bounded Disjoint Paths Problems.",
                    "A Polynomial-Time Algorithm for Optimizing over N-Fold 4-Block Decomposable Integer Programs.",
                    "Universal Sequencing on a Single Machine.",
                    "Fault-Tolerant Facility Location: A Randomized Dependent LP-Rounding Algorithm.",
                    "Integer Quadratic Quasi-polyhedra.",
                    "An Integer Programming and Decomposition Approach to General Chance-Constrained Mathematical Programs.",
                    "An Effective Branch-and-Bound Algorithm for Convex Quadratic Integer Programming.",
                    "Extending SDP Integrality Gaps to Sherali-Adams with Applications to Quadratic Programming and MaxCutGain.",
                    "The Price of Collusion in Series-Parallel Networks.",
                    "The Chvátal-Gomory Closure of an Ellipsoid Is a Polyhedron.",
                    "A Pumping Algorithm for Ergodic Stochastic Mean Payoff Games with Perfect Information.",
                    "On Column-Restricted and Priority Covering Integer Programs.",
                    "On k-Column Sparse Packing Programs.",
                    "Hypergraphic LP Relaxations for Steiner Trees.",
                    "Efficient Deterministic Algorithms for Finding a Minimum Cycle Basis in Undirected Graphs.",
                    "Efficient Algorithms for Average Completion Time Scheduling.",
                    "Experiments with Two Row Tableau Cuts.",
                    "An OPT + 1 Algorithm for the Cutting Stock Problem with Constant Number of Object Lengths.",
                    "On the Rank of Cutting-Plane Proof Systems."
                ]
            }
        ]
    },
    {
        "year": "2008",
        "name": "13th IPCO 2008",
        "info": "Bertinoro, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/ipco/2008",
                "sub_name": "Integer Programming and Combinatorial Optimization, 13th International Conference, IPCO 2008, Bertinoro, Italy, May 26-28, 2008, Proceedings.",
                "count": 32,
                "papers": [
                    "Perspective Relaxation of Mixed Integer Nonlinear Programs with Indicator Variables.",
                    "Disjunctive Cuts for Non-convex Mixed Integer Quadratically Constrained Programs.",
                    "The Air Traffic Flow Management Problem: An Integer Optimization Approach.",
                    "The Induced Disjoint Paths Problem.",
                    "A Weighted Kt, t-Free t-Factor Algorithm for Bipartite Graphs.",
                    "A New Algorithm for the Maximum Weighted Stable Set Problem in Claw-Free Graphs.",
                    "A Polynomial Algorithm for Weighted Abstract Flow.",
                    "A Comparative Study of Linear and Semidefinite Branch-and-Cut Methods for Solving the Minimum Graph Bisection Problem.",
                    "Binary Positive Semidefinite Matrices and Associated Integer Polytopes.",
                    "Vertex Cover Resists SDPs Tightened by Local Hypermetric Inequalities.",
                    "Tight Bounds for Permutation Flow Shop Scheduling.",
                    "The Stochastic Machine Replenishment Problem.",
                    "A Polynomial Time Approximation Scheme for the Square Packing Problem.",
                    "Modeling Disjunctive Constraints with a Logarithmic Number of Binary Variables and Constraints.",
                    "Computing with Multi-row Gomory Cuts.",
                    "Constraint Orbital Branching.",
                    "A Fast, Simpler Algorithm for the Matroid Parity Problem.",
                    "Degree Bounded Matroids and Submodular Flows.",
                    "Budgeted Matching and Budgeted Matroid Intersection Via the Gasoline Puzzle.",
                    "Primal-Dual Schema for Capacitated Covering Problems.",
                    "Offline and Online Facility Leasing.",
                    "Importance Sampling via Load-Balanced Facility Location.",
                    "A Constant Approximation Algorithm for the a prioriTraveling Salesman Problem.",
                    "New Geometry-Inspired Relaxations and Algorithms for the Metric Steiner Tree Problem.",
                    "Min Sum Edge Coloring in Multigraphs Via Configuration LP.",
                    "An Improved Algorithm for Finding Cycles Through Elements.",
                    "The Stable Roommates Problem with Choice Functions.",
                    "A New Approach to Splitting-Off.",
                    "Can Pure Cutting Plane Algorithms Work?.",
                    "The Mixing Set with Divisible Capacities.",
                    "A Polynomial Time Algorithm for the Stochastic Uncapacitated Lot-Sizing Problem with Backlogging.",
                    "Lifting Integer Variables in Minimal Inequalities Corresponding to Lattice-Free Triangles."
                ]
            }
        ]
    },
    {
        "year": "2007",
        "name": "12th IPCO 2007",
        "info": "Ithaca, NY, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ipco/2007",
                "sub_name": "Integer Programming and Combinatorial Optimization, 12th International IPCO Conference, Ithaca, NY, USA, June 25-27, 2007, Proceedings.",
                "count": 36,
                "papers": [
                    "Inequalities from Two Rows of a Simplex Tableau.",
                    "Cuts for Conic Mixed-Integer Programming.",
                    "Sequential-Merge Facets for Two-Dimensional Group Problems.",
                    "Triangle-Free Simple 2-Matchings in Subcubic Graphs (Extended Abstract).",
                    "The Smoothed Number of Pareto Optimal Solutions in Bicriteria Integer Optimization.",
                    "Finding a Polytope from Its Graph in Polynomial Time.",
                    "Orbitopal Fixing.",
                    "New Variants of Lift-and-Project Cut Generation from the LP Tableau: Open Source Implementation and Testing.",
                    "Orbital Branching.",
                    "Distinct Triangle Areas in a Planar Point Set.",
                    "Scheduling with Precedence Constraints of Low Fractional Dimension.",
                    "Approximation Algorithms for 2-Stage Stochastic Scheduling Problems.",
                    "On Integer Programming and the Branch-Width of the Constraint Matrix.",
                    "Matching Problems in Polymatroids Without Double Circuits.",
                    "Maximizing a Submodular Set Function Subject to a Matroid Constraint (Extended Abstract).",
                    "On a Generalization of the Master Cyclic Group Polyhedron.",
                    "A Framework to Derive Multidimensional Superadditive Lifting Functions and Its Applications.",
                    "On the Exact Separation of Mixed Integer Knapsack Cuts.",
                    "A Faster Strongly Polynomial Time Algorithm for Submodular Function Minimization.",
                    "On Convex Minimization over Base Polytopes.",
                    "Computational Geometric Approach to Submodular Function Minimization for Multiclass Queueing Systems.",
                    "Generating Multiple Solutions for Mixed Integer Programming Problems.",
                    "A Branch and Bound Algorithm for Max-Cut Based on Combining Semidefinite and Polyhedral Relaxations.",
                    "DINS, a MIP Improvement Heuristic.",
                    "Mixed-Integer Vertex Covers on Bipartite Graphs.",
                    "On the MIR Closure of Polyhedra.",
                    "The Intersection of Continuous Mixing Polyhedra and the Continuous Mixing Polyhedron with Flows.",
                    "Simple Explicit Formula for Counting Lattice Points of Polyhedra.",
                    "Characterizations of Total Dual Integrality.",
                    "Sign-Solvable Linear Complementarity Problems.",
                    "An Integer Programming Approach for Linear Programs with Probabilistic Constraints.",
                    "Infrastructure Leasing Problems.",
                    "Robust Combinatorial Optimization with Exponential Scenarios.",
                    "Approximation Algorithms for the Multi-item Capacitated Lot-Sizing Problem Via Flow-Cover Inequalities.",
                    "Optimal Efficiency Guarantees for Network Design Mechanisms.",
                    "The Set Connector Problem in Graphs."
                ]
            }
        ]
    },
    {
        "year": "2005",
        "name": "11th IPCO 2005",
        "info": "Berlin, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/ipco/2005",
                "sub_name": "Integer Programming and Combinatorial Optimization, 11th International IPCO Conference, Berlin, Germany, June 8-10, 2005, Proceedings.",
                "count": 34,
                "papers": [
                    "Mixed-Integer Cuts from Cyclic Groups.",
                    "Optimizing over the First Chvàtal Closure.",
                    "Sequential Pairing of Mixed Integer Inequalities.",
                    "Approximate Min-max Relations for Odd Cycles in Planar Graphs.",
                    "Disjoint Cycles: Integrality Gap, Hardness, and Approximation.",
                    "A Combinatorial Algorithm to Find a Maximum Even Factor.",
                    "Improved Approximation Schemes for Linear Programming Relaxations of Combinatorial Optimization Problems.",
                    "On the Approximability of the Minimum Congestion Unsplittable Shortest Path Routing Problem.",
                    "Inventory and Facility Location Models with Market Selection.",
                    "On Approximating Complex Quadratic Optimization Problems via Semidefinite Programming Relaxations.",
                    "Semidefinite Bounds for the Stability Number of a Graph via Sums of Squares of Polynomials.",
                    "Approximation Algorithms for Semidefinite Packing Problems with Applications to Maxcut and Graph Coloring.",
                    "On the Inefficiency of Equilibria in Congestion Games.",
                    "Unrelated Parallel Machine Scheduling with Resource Dependent Processing Times.",
                    "LP-Based Online Scheduling: From Single to Parallel Machines.",
                    "Unique Sink Orientations of Grids.",
                    "Jumping Doesn't Help in Abstract Cubes.",
                    "Computing the Inertia from Sign Patterns.",
                    "Randomized Relaxation Methods for the Maximum Feasible Subsystem Problem.",
                    "On Clique Separators, Nearly Chordal Graphs, and the Maximum Weight Stable Set Problem.",
                    "Smoothed Analysis of Integer Programming.",
                    "Circular Ones Matrices and the Stable Set Polytope of Quasi-Line Graphs.",
                    "Approximation Algorithms for Stochastic Inventory Control Models.",
                    "On Two-Stage Stochastic Minimum Spanning Trees.",
                    "Combinatorial Analysis of Generic Matrix Pencils.",
                    "Power Optimization for Connectivity Problems.",
                    "Packing Steiner Forests.",
                    "Bidimensional Packing by Bilinear Programming.",
                    "On the Linfinity-Norm of Extreme Points for Crossing Supermodular Directed Network LPs.",
                    "Virtual Private Network Design: A Proof of the Tree Routing Conjecture on Ring Networks.",
                    "Approximation Algorithms for the Minimum Cardinality Two-Connected Spanning Subgraph Problem.",
                    "Using Grammars to Generate Very Large Scale Neighborhoods for the Traveling Salesman Problem and Other Sequencing Problems.",
                    "A Study of Domino-Parity and k-Parity Constraints for the TSP.",
                    "Not Every GTSP Facet Induces an STSP Facet."
                ]
            }
        ]
    },
    {
        "year": "2004",
        "name": "10th IPCO 2004",
        "info": "New York, NY, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ipco/2004",
                "sub_name": "Integer Programming and Combinatorial Optimization, 10th International IPCO Conference, New York, NY, USA, June 7-11, 2004, Proceedings.",
                "count": 32,
                "papers": [
                    "Robust Branch-and-Cut-and-Price for the Capacitated Vehicle Routing Problem.",
                    "Metric Inequalities and the Network Loading Problem.",
                    "Valid Inequalities Based on Simple Mixed-Integer Sets.",
                    "The Price of Anarchy when Costs Are Non-separable and Asymmetric.",
                    "Computational Complexity, Fairness, and the Price of Anarchy of the Maximum Latency Problem: Extended Abstract.",
                    "Polynomial Time Algorithm for Determining Optimal Strategies in Cyclic Games.",
                    "A Robust Optimization Approach to Supply Chain Management.",
                    "Hedging Uncertainty: Approximation Algorithms for Stochastic Optimization Problems.",
                    "Scheduling an Industrial Production Facility.",
                    "Three Min-Max Theorems Concerning Cyclic Orders of Strong Digraphs.",
                    "A TDI Description of Restricted 2-Matching Polytopes.",
                    "Enumerating Minimal Dicuts and Strongly Connected Subgraphs and Related Geometric Problems.",
                    "Semi-continuous Cuts for Mixed-Integer Programming.",
                    "Combinatorial Benders' Cuts.",
                    "A Faster Exact Separation Algorithm for Blossom Inequalities.",
                    "LP-based Approximation Algorithms for Capacitated Facility Location.",
                    "A Multi-exchange Local Search Algorithm for the Capacitated Facility Location Problem: (Extended Abstract).",
                    "Separable Concave Optimization Approximately Equals Piecewise Linear Optimization.",
                    "Three Kinds of Integer Programming Algorithms Based on Barvinok's Rational Functions.",
                    "The Path-Packing Structure of Graphs.",
                    "More on a Binary-Encoded Coloring Formulation.",
                    "Single Machine Scheduling with Precedence Constraints: Extended Abstract.",
                    "The Constrained Minimum Weighted Sum of Job Completion Times Problem.",
                    "Near-Optimum Global Routing with Coupling, Delay Bounds, and Power Consumption.",
                    "A Flow-Based Method for Improving the Expansion or Conductance of Graph Cuts.",
                    "All Rational Polytopes Are Transportation Polytopes and All Polytopal Integer Sets Are Contingency Tables.",
                    "A Capacity Scaling Algorithm for M-convex Submodular Flow.",
                    "Integer Concave Cocirculations and Honeycombs.",
                    "Minsquare Factors and Maxfix Covers of Graphs.",
                    "Low-Dimensional Faces of Random 0/1-Polytopes.",
                    "On Polyhedra Related to Even Factors.",
                    "Optimizing over Semimetric Polytopes."
                ]
            }
        ]
    },
    {
        "year": "2002",
        "name": "9th IPCO 2002",
        "info": "Cambridge, MA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ipco/2002",
                "sub_name": "Integer Programming and Combinatorial Optimization, 9th International IPCO Conference, Cambridge, MA, USA, May 27-29, 2002, Proceedings.",
                "count": 33,
                "papers": [
                    "A Faster Scaling Algorithm for Minimizing Submodular Functions.",
                    "A Generalization of Edmonds' Matching and Matroid Intersection Algorithms.",
                    "A Coordinatewise Domain Scaling Algorithm for M-convex Function Minimization.",
                    "The Quickest Multicommodity Flow Problem.",
                    "A New Min-Cut Max-Flow Ratio for Multicommodity Flows.",
                    "Improved Rounding Techniques for the MAX 2-SAT and MAX DI-CUT Problems.",
                    "Finding the Exact Integrality Gap for Small Traveling Salesman Problems.",
                    "Polynomial-Time Separation of Simple Comb Inequalities.",
                    "A New Approach to Cactus Construction Applied to TSP Support Graphs.",
                    "Split Closure and Intersection Cuts.",
                    "An Exponential Lower Bound on the Length of Some Classes of Branch-and-Cut Proofs.",
                    "Lifted Inequalities for 0-1 Mixed Integer Programming: Basic Theory and Algorithms.",
                    "On a Lemma of Scarf.",
                    "A Short Proof of Seymour's Characterization of the Matroids with the Max-Flow Min-Cut Property.",
                    "Integer Programming and Arrovian Social Welfare Functions.",
                    "Integrated Logistics: Approximation Algorithms Combining Facility Location and Network Design.",
                    "The Minimum Latency Problem Is NP-Hard for Weighted Trees.",
                    "An Improved Approximation Algorithm for the Metric Uncapacitated Facility Location Problem.",
                    "A Polyhedral Approach to Surface Reconstruction from Planar Contours.",
                    "The Semidefinite Relaxation of the k -Partition Polytope Is Strong.",
                    "A Polyhedral Study of the Cardinality Constrained Knapsack Problem.",
                    "A PTAS for Minimizing Total Completion Time of Bounded Batch Scheduling.",
                    "An Approximation Scheme for the Two-Stage, Two-Dimensional Bin Packing Problem.",
                    "On Preemptive Resource Constrained Scheduling: Polynomial-Time Approximation Schemes.",
                    "Hard Equality Constrained Integer Knapsacks.",
                    "The Distribution of Values in the Quadratic Assignment Problem.",
                    "A New Subadditive Approach to Integer Programming.",
                    "Improved Approximation Algorithms for Resource Allocation.",
                    "Approximating the Advertisement Placement Problem.",
                    "Algorithms for Minimizing Response Time in Broadcast Scheduling.",
                    "Building Edge-Failure Resilient Networks.",
                    "The Demand Matching Problem.",
                    "The Single-Sink Buy-at-Bulk LP Has Constant Integrality Gap."
                ]
            }
        ]
    },
    {
        "year": "2001",
        "name": "8th IPCO 2001",
        "info": "Utrecht, The Netherlands",
        "venues": [
            {
                "sub_name_abbr": "conf/ipco/2001",
                "sub_name": "Integer Programming and Combinatorial Optimization, 8th International IPCO Conference, Utrecht, The Netherlands, June 13-15, 2001, Proceedings.",
                "count": 32,
                "papers": [
                    "Two O (log* k)-Approximation Algorithms for the Asymmetric k-Center Problem.",
                    "Strongly Polynomial Algorithms for the Unsplittable Flow Problem.",
                    "Edge Covers of Setpairs and the Iterative Rounding Method.",
                    "The Asymptotic Performance Ratio of an On-Line Algorithm for Uniform Parallel Machine Scheduling with Release Dates.",
                    "Approximate k-MSTs and k-Steiner Trees via the Primal-Dual Method and Lagrangean Relaxation.",
                    "On the Rank of Mixed 0, 1 Polyhedra.",
                    "Fast 2-Variable Integer Programming.",
                    "Approximating k-Spanner Problems for k>2.",
                    "A Matroid Generalization of the Stable Matching Polytope.",
                    "A 2-Approximation for Minimum Cost {0, 1, 2} Vertex Connectivity.",
                    "Combined Connectivity Augmentation and Orientation Problems.",
                    "An Extension of a Theorem of Henneberg and Laman.",
                    "Bisubmodular Function Minimization.",
                    "On the Integrality Gap of a Natural Formulation of the Single-Sink Buy-at-Bulk Network Design Problem.",
                    "Circuit Mengerian Directed Graphs.",
                    "Integral Polyhedra Related to Even Cycle and Even Cut Matroids.",
                    "A Unified Framework for Obtaining Improved Approximation Algorithms for Maximum Graph Bisection Problems.",
                    "Synthesis of 2-Commodity Flow Networks.",
                    "Bounds for Deterministic Periodic Routing Sequences.",
                    "Cutting Planes for Mixed 0-1 Semidefinite Programs.",
                    "Independence Free Graphs and Vertex Connectivity Augmentation.",
                    "The Throughput of Sequential Testing.",
                    "An Explicit Exact SDP Relaxation for Nonlinear 0-1 Programs.",
                    "Pruning by Isomorphism in Branch-and-Cut.",
                    "Facets, Algorithms, and Polyhedral Characterizations for a Multi-item Production Planning Model with Setup Times.",
                    "Fences Are Futile: On Relaxations for the Linear Ordering Problem.",
                    "Generating Cuts from Multiple-Term Disjunctions.",
                    "A (2+epsilon)-Approximation Algorithm for Generalized Preemptive Open Shop Problem with Minsum Objective.",
                    "Performance Guarantees of Local Search for Multiprocessor Scheduling.",
                    "Connected Joins in Graphs.",
                    "Two NP-Hardness Results for Preemptive Minsum Scheduling of Unrelated Parallel Machines.",
                    "Approximation Algorithms for the Minimum Bends Traveling Salesman Problem."
                ]
            }
        ]
    },
    {
        "year": "1999",
        "name": "7th IPCO 1999",
        "info": "Graz, Austria",
        "venues": [
            {
                "sub_name_abbr": "conf/ipco/1999",
                "sub_name": "Integer Programming and Combinatorial Optimization, 7th International IPCO Conference, Graz, Austria, June 9-11, 1999, Proceedings.",
                "count": 33,
                "papers": [
                    "Market Split and Basis Reduction: Towards a Solution of the Cornuéjols-Dawande Instances.",
                    "Approximation Algorithms for Maximum Coverage and Max Cut with Given Sizes of Parts.",
                    "Solving the Convex Cost Integer Dual Network Flow Problem.",
                    "Some Structural and Algorithmic Properties of the Maximum Feasible Subsystem Problem.",
                    "Valid Inequalities for Problems with Additive Variable Upper Bounds.",
                    "A Min-Max Theorem on Feedback Vertex Sets.",
                    "On the Separation of Maximally Violated mod-k Cuts.",
                    "Improved Approximation Algorithms for Capacitated Facility Location Problems.",
                    "Optimal 3-Terminal Cuts and Linear Programming.",
                    "Semidefinite Programming Methods for the Symmetric Traveling Salesman Problem.",
                    "Bounds on the Chvátal Rank of Polytopes in the 0/1-Cube.",
                    "Universally Maximum Flow with Piecewise-Constant Capacities.",
                    "Critical Extreme Points of the 2-Edge Connected Spanning Subgraph Polytope.",
                    "An Orientation Theorem with Parity Conditions.",
                    "Parity Constrained k-Edge-Connected Orientations.",
                    "Approximation Algorithms for MAX 4-SAT and Rounding Procedures for Semidefinite Programs.",
                    "On the Chvátal Rank of Certain Inequalities.",
                    "The Square-Free 2-Factor Problem in Bipartite Graphs.",
                    "The m-Cost ATSP.",
                    "A Strongly Polynomial Cut Canceling Algorithm for the Submodular Flow Problem.",
                    "Edge-Splitting Problems with Demands.",
                    "Integral Polyhedra Associated with Certain Submodular Functions Defined on 012-Vectors.",
                    "Optimal Compaction of Orthogonal Grid Drawings.",
                    "On the Number of Iterations for Dantzig-Wolfe Optimization and Packing-Covering Approximation Algorithms.",
                    "Experimental Evaluation of Approximation Algorithms for Single-Source Unsplittable Flow.",
                    "Approximation Algorithms for a Directed Network Design Problem.",
                    "Optimizing over All Combinatorial Embeddings of a Planar Graph.",
                    "A Fast Algorithm for Computing Minimum 3-Way and 4-Way Cuts.",
                    "Scheduling Two Machines with Release Times.",
                    "An Introduction to Empty Lattice Simplices.",
                    "On Optimal Ear-Decompositions of Graphs.",
                    "Gale-Shapley Stable Marriage Problem Revisited: Strategic Issues and Applications.",
                    "Vertex-Disjoint Packing of Two Steiner Trees: Polyhedra and Branch-and-Cut."
                ]
            }
        ]
    },
    {
        "year": "1998",
        "name": "6th IPCO 1998",
        "info": "Houston, Texas, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ipco/1998",
                "sub_name": "Integer Programming and Combinatorial Optimization, 6th International IPCO Conference, Houston, Texas, USA, June 22-24, 1998, Proceedings.",
                "count": 32,
                "papers": [
                    "The Packing Property.",
                    "A Characterization of Weakly Bipartite Graphs.",
                    "Bipartite Designs.",
                    "Characterizing Noninteger Polyhedra with 0-1 Constraints.",
                    "A Theorem of Truemper.",
                    "The Generalized Stable Set Problem for Claw-Free Bidirected Graphs.",
                    "On a Min-max Theorem of Cacti.",
                    "Edge-Splitting and Edge-Connectivity Augmentation in Planar Graphs.",
                    "A New Bound for the 2-Edge Connected Subgraph Problem.",
                    "An Improved Approximation Algorithm for Minimum Size 2-Edge Connected Spanning Subgraphs.",
                    "Multicuts in Unweighted Graphs with Bounded Degree and Bounded Tree-Width.",
                    "Approximating Disjoint-Path Problems Using Greedy Algorithms and Packing Integer Programs.",
                    "Approximation Algorithms for the Mixed Postman Problem.",
                    "Improved Approximation Algorithms for Uncapitated Facility Location.",
                    "The Maximum Traveling Salesman Problem Under Polyhedral Norms.",
                    "Polyhedral Combinatorics of Benzenoid Problems.",
                    "Consecutive Ones and a Betweenness Problem in Computational Biology.",
                    "Solving a Linear Diophantine Equation with Lower and Upper Bounds on the Variables.",
                    "The Intersection of Knapsack Polyhedra and Extensions.",
                    "New Classes of Lower Bounds for Bin Packing Problems.",
                    "Solving Integer and Disjunctive Programs by Lift and Project.",
                    "A Class of Hard Small 0-1 Programs.",
                    "Building Chain and Cactus Representations of All Minimum Cuts from Hao-Orlin in the Same Asymptotic Run Time.",
                    "Simple Generalized Maximum Flow Algorithms.",
                    "The Pseudoflow Algorithm and the Pseudoflow-Based Simplex for the Maximum Flow Problem.",
                    "An Implementation of a Combinatorial Approximation Algorithm for Minimum-Cost Multicommodity Flow.",
                    "Non-approximability Results for Scheduling Problems with Minsum Criteria.",
                    "Approximation Bounds for a General Class of Precedence Constrained Parallel Machine Scheduling Problems.",
                    "An Efficient Approximation Algorithm for Minimizing Makespan on Uniformly Related Machines.",
                    "On the Relationship Between Combinatorial and LP-Based Approaches to NP-Hard Scheduling Problems.",
                    "Polyhedral Combinatorics of Quadratic Assignment Problems with Less Objects than Locations.",
                    "Incorporating Inequality Constraints in the Spectral Bundle Method."
                ]
            }
        ]
    },
    {
        "year": "1996",
        "name": "5th IPCO 1996",
        "info": "Vancouver, BC, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/ipco/1996",
                "sub_name": "Integer Programming and Combinatorial Optimization, 5th International IPCO Conference, Vancouver, British Columbia, Canada, June 3-5, 1996, Proceedings.",
                "count": 36,
                "papers": [
                    "Colourful Linear Programming.",
                    "Test Sets and Inequalities for Integer Programs.",
                    "An Optimal, Stable Continued Fraction Algorithm.",
                    "Algorithms and Extended Formulations for One and Two Facility Network Design.",
                    "Integer Muticommodity Flow Problems.",
                    "A Heuristic Algorithm for the Set Covering Problem.",
                    "A epsilon-Relaxation Method for Generalized Separable Convex Cost Network Flow Problems.",
                    "Finding Real-Valued Single-Source Shortest Paths.",
                    "A Network-Flow Technique for Finding Low-Weight Bounded-Degree Spanning Trees.",
                    "Approximating k-Set Cover and Complementary Graph Coloring.",
                    "On Minimum 3-Cuts and Approximating k-Cuts Using Cut Trees.",
                    "Primal-Dual Approximation Algorithms for Feedback Problems.",
                    "Cone-LP's and Semidefinite Programs: Geometry.",
                    "Quadratic Knapsack Relaxations Using Cutting Planes.",
                    "A Semidefinite Bound for Mixing Rates of Markov Chains.",
                    "The Quadratic Assignment Problem with a Monotone Anti-Monge and a Symmetric Toeplitz Matrix: Easy and Hard Cases.",
                    "On Optimizing Multiplications of Sparse Matrices.",
                    "Continuous Relaxations for Constrained Maximum-Entropy Sampling.",
                    "A Submodular Optimization Problem with Side Constraints.",
                    "Convexity and Steinitz's Exchange Property.",
                    "On Ideal Clutters, Metrics and Multiflows.",
                    "A Supermodular Relaxation for Scheduling with Release Dates.",
                    "Scheduling to Minimize Total Weighted Completion Time: Performance Guarantees of LP-Based Heuristics and Lower Bounds.",
                    "Implementation of a Linear Time Algorithm for Certain Generalized Traveling Salesman Problems.",
                    "On Dependent Randomized Rounding Algorithms.",
                    "Coloring Bipartite Hypergraphs.",
                    "Improved Randomized Approximation Algorithms for Lot-Sizing Problems.",
                    "Minimizing Total Completion Time in a Two-Machine Flowshop: Analysis of Special Cases.",
                    "A New Approach to Computing Optimal Schedules for the Job-Shop Scheduling Problem.",
                    "Optimal On-Line Algorithms for Single-Machine Scheduling.",
                    "The Strongest Facets of the Acyclic Subgraph Polytope Are Unknown.",
                    "Transitive Packing.",
                    "A Polyhedral Approach to the Feedback Vertex Set Problem.",
                    "Separating over Classes of TSP Inequalities Defined by 0 Node-Lifting in Polynominal Time.",
                    "Separating Maximally Violated Comb Inequalities in Planar Graphs.",
                    "The Travelling Salesman and the PQ-Tree."
                ]
            }
        ]
    },
    {
        "year": "1995",
        "name": "4th IPCO 1995",
        "info": "Copenhagen, Denmark",
        "venues": [
            {
                "sub_name_abbr": "conf/ipco/1995",
                "sub_name": "Integer Programming and Combinatorial Optimization, 4th International IPCO Conference, Copenhagen, Denmark, May 29-31, 1995, Proceedings.",
                "count": 36,
                "papers": [
                    "Improved Approximation Algorithms for MAX k-CUT and MAX BISECTION.",
                    "Approximating Minimum Feedback Sets and Multi-Cuts in Directed Graphs.",
                    "Nonlinear Formulations and Improved Randomized Approximation Algorithms for Multicut Problems.",
                    "Separating Clique Tree and Bipartition Inequalities in Polynominal Time.",
                    "The Interval Order Polytope of a Digraph.",
                    "Separation Problems for the Stable Set Polytope.",
                    "Computational Study of a Family of Mixed-Integer Quadratic Programming Problems.",
                    "A Minimal Algorithm for the Bounded Knapsack Problem.",
                    "A Framework for Tightening 0-1 Programs Based on Extensions of Pure 0-1 KP and SS Problems.",
                    "Combining Semidefinite and Polyhedral Relaxations for Integer Programs.",
                    "Distributed Near-Optimal Matching.",
                    "The Random Linear Bottleneck Assignment Problem.",
                    "On Implementing Push-Relabel Method for the Maximum Flow Problem.",
                    "Use of Hidden Network Structure in the Set Partitioning Problem.",
                    "Generalized Max Flows and Augmenting Paths.",
                    "Oriented Matroid Polytopes and Polyhedral Fans are Signable.",
                    "On Combinatorial Properties of Binary Spaces.",
                    "Coverings and Delta-Coverings.",
                    "The Topological Structure of Maximal Lattice Free Convex Bodies: The General Case.",
                    "The Hilbert Basis of the Cut Cone over the Complete Graph K6.",
                    "GRIN: An Implementation of Gröbner Bases for Integer Programming.",
                    "Scheduling Jobs of Equal Length: Complexity, Facets and Computational Results.",
                    "Formulating a Scheduling Problem with Almost Identical Jobs by Using Positional Completion Times.",
                    "Scheduling Unit Jobs with Compatible Release Dates on Parallel Machines with Nonstationary Speeds.",
                    "A Mickey-Mouse Decomposition Theorem.",
                    "Minimum Cost Dynamic Flows: The Series-Parallel Case.",
                    "(0, ±1) Ideal Matrices.",
                    "Embedding Graphs in the Torus in Linear Time.",
                    "A Characterization of Seymour Graphs.",
                    "The Markov Chain of Colourings.",
                    "Packing Algorithms for Arborescences (and Spanning Trees) in Capacitated Graphs.",
                    "A Faster Edge Splitting Algorithm in Multigraphs and its Application to the Edge-Connectivity Augmentation Problem.",
                    "How to Make a Strongly Connected Digraph Two-Connected.",
                    "Polyhedra and Optimization in Connection with a Weak Majorization Ordering.",
                    "Combining and Strengthening Gomory Cuts.",
                    "Sequence Independent Lifting of Cover Inequalities."
                ]
            }
        ]
    },
    {
        "year": "1993",
        "name": "3rd IPCO 1993",
        "info": "Erice, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/ipco/1993",
                "sub_name": "Proceedings of the 3rd Integer Programming and Combinatorial Optimization Conference, Erice, Italy, April 29 - May 1, 1993.",
                "count": 35,
                "papers": [
                    "The complex of maximal lattice free simplices.",
                    "Optimal solution and value of parametric integer programs.",
                    "On the monotonization of polyhedra.",
                    "When cycles collapse: A general approximation technique for constrained two-connectivity problems.",
                    "An efficient approximation algorithm for the survivable network design problem.",
                    "Optimal and almost optimal algorithms for connectivity augmentation problems.",
                    "An approximation algorithm for weighted itk-polymatroids and the Steiner tree problem in graphs.",
                    "Dynamic algorithms for optimization problems in bounded tree-width graphs.",
                    "Cycles of prescribed modularity in planar digraphs.",
                    "Sequential and parallel algorithms for edge-coloring series-parallel multigraphs.",
                    "Computing the optimum stock size.",
                    "On a characterization of the minimum assignment and matching in the independent random model.",
                    "An analysis of a Monte Carlo algorithm for estimating the permanent.",
                    "A spectral approach to bandwidth and separator problems in graphs.",
                    "Stronger Lagrangian bounds by use of slack variables: applications to machine scheduling problems.",
                    "Solving integer programs with Fenchel cutting planes and preprocessing.",
                    "On the geodesic-structure of graphs: a polyhedral approach to metric decomposition.",
                    "On the (integral) maximum tw flow in vertex and edge capacitated planar graphs.",
                    "An efficient implementation of a scaling minimum-cost flow algorithm.",
                    "Formulations for the stable set polytope of a claw-free graph.",
                    "A polyhedron with all s-t cuts as vertices, and adjacency of cuts.",
                    "Using path inequalities in a branch and cut code for the symmetric traveling salesman problem.",
                    "A new \\frac34-approximation algorithm for MAX SAT.",
                    "A nearly best-possible approximation algorithm for node-weighted Steiner trees.",
                    "A primal-dual parallel approximation technique applied to weighted set and vertex cover.",
                    "Canceling most helpful total submodular cuts for submodular flow.",
                    "Conservation laws, extended polymatroids and multi-armed bandit problems: a unified approach to ind exable systems.",
                    "A general class of greedily solvable linear programs.",
                    "Delta-polymatroids and an extension of Edmonds-Giles' TDI scheme.",
                    "On Lovász's cathedral theorem.",
                    "Nearly uniform scheduling of file transfers.",
                    "Circuit packings on surfaces with at most three cross-caps.",
                    "Routing in grid graphs by cutting planes.",
                    "On the transitive acyclic subdigraph polytope.",
                    "Solving the maximum weight planar subgraph."
                ]
            }
        ]
    },
    {
        "year": "1992",
        "name": "2nd IPCO 1992",
        "info": "Pittsburgh, PA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ipco/1992",
                "sub_name": "Proceedings of the 2nd Integer Programming and Combinatorial Optimization Conference, Pittsburgh, PA, USA, May 1992.",
                "count": 33,
                "papers": [
                    "Polyhedral Description of Trees and Arborescences.",
                    "The K-Edge Connected Spanning Subgraph Polyhedron.",
                    "On 2-Connected Subgraph Polytopes.",
                    "Simple and Fast Algorithms for Linear and Integer Programs with Two Variables Per Inequality.",
                    "Efficient Enumeration of Grid Points in a Polygon and its Application to Integer Programming.",
                    "Random Walks, Totally Unimodular Matrices and a Randomised Dual Simplex Algorithm.",
                    "On Multiflow Problems.",
                    "Effective Lower Bounds for Crossing Number, Bisection Width and Balanced Vertex Separator in Terms of Symmetry.",
                    "Recognition and Representation of Proper Circular Arc Graphs.",
                    "New Lower and Upper Bounds for Scheduling Around a Small Common Due Date.",
                    "Generic Scheduling Polyhedra and a New Mixed-Integer Formulation for Single-Machine Scheduling.",
                    "Network Design with Divisible Capacities: Aggregated Flow and Knapsack Subproblems.",
                    "Mixed-Integer Column Generation Algorithms and the Probabilistic Maximum Satisfiability Problem.",
                    "An Exact Algorithm for Makespan Minimisation on Unrelated Parallel Machines.",
                    "A Separation Routine for the Set Covering Polytope.",
                    "A Complexity Index for Satisfiability Problems.",
                    "A Polynomial Time Dual Algorithm for the Euclidean Multifacility Location Problem.",
                    "A Criterion of Polynomial-Time Solvability for the Network Location Problem.",
                    "Subgraph Degree-Sequence Polyhedra.",
                    "Three Facet-Lifting Theorems for the Asymmetric Traveling Salesman Polytope.",
                    "The Metric Polytope.",
                    "An Exact Characterization of Greedy Structures.",
                    "Extended Polymatroids: Properties and Optimization.",
                    "Optimization Problems on Matroids and Exponential Sums.",
                    "Algorithms and Min-max Theorems for Certain Multiway Cuts.",
                    "Nasty TSP Instances for Farthest Insertion.",
                    "Forcing Colorations and the Strong Perfect Graph Conjecture.",
                    "Fast Parallel Algorithms for Bipartite Matching.",
                    "Combinatorial Optimization with Semi-Definite Matrices.",
                    "An Interior Point Approach to a Tensor Optimization Problem with Application to Upper Bounds in Integer Quadratic Optimization Problems.",
                    "A Lot-Sizing Problem on Trees, Related to Network Design.",
                    "A Technique for Speeding up the Solution of the Lagrangian Dual.",
                    "When is the Assignment Bound Tight for the Asymmetric Traveling Salesman Problem?"
                ]
            }
        ]
    },
    {
        "year": "1990",
        "name": "1st IPCO 1990",
        "info": "Waterloo, Ontorio, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/ipco/1990",
                "sub_name": "Proceedings of the 1st Integer Programming and Combinatorial Optimization Conference, Waterloo, Ontorio, Canada, May 28-30 1990.",
                "count": 37,
                "papers": [
                    "Polynomially Solvable Cases of the Simple Plant Location Problem.",
                    "A Genetic Algorithm for the Assembly Line Balancing Problem.",
                    "On Identifying in Polynomial Time Violated Subtour Elimination and Precedence Forcing Constraints for the Sequential Ordering Problem.",
                    "Factoring Cartesian-Product Graphs at Logarithmic Cost per Edge.",
                    "Finding Out Whether a Valid Inequality is Facet Defining.",
                    "Some Provably Hard Crossing Number Problems.",
                    "Polyhedral Results for the Precedence-Constrained Knapsack Problem.",
                    "Modular Arithmetic and Randomization for Exact Matroid Problems.",
                    "Ancestor Tree for Arbitrary Multi-Terminal Cut Functions.",
                    "The Graphical Asymmetric Traveling Salesman Polyhedron.",
                    "A Decomposition Theorem for Balanced Matrices.",
                    "New Results on Facets of the Cut Cone.",
                    "The Fastest Algorithm for the Pert Problem with AND-and OR-Nodes (The New-Product-New-Technology Problem).",
                    "Probabilistic Analysis of the Generalised Assignment Problem.",
                    "On the Clique-Rank and the Coloration of Perfect Graphs.",
                    "Conservative Weightings and Ear-Decompositions of Graphs.",
                    "A Survey of Some Results in Discrete Optimisation.",
                    "Bounds for the Quadratic Assignment Problems Using Continuous Optimization Techniques.",
                    "Near-Optimal Sequencing with Precedence Constraints.",
                    "On the Impossibility of Strongly Polynomial Algorithms for the Allocation Problem and its Extensions.",
                    "Shellability of Oriented Matroids.",
                    "Minimizing Maximum Earliness and Maximum Lateness on a Single Machine.",
                    "O(m\\cdotn) Isomorphism Algorithms for Circular-Arc Graphs and Circle Graphs.",
                    "Column Generation Methods for Probabilistic Logic.",
                    "Computational Experience with an Interior Point Algorithm on the Satisfiability Problem.",
                    "An Interior-Point Approach to NP-Complete Problems.",
                    "Flow in Planar Graphs with Vertex Capacities.",
                    "On the Radon Number of the Integer Lattice.",
                    "Vertex Disjoint Channel Routing on Two Layers.",
                    "Perfection, Parity, Planarity, and Packing Paths.",
                    "Max-Balanced Flows.",
                    "Hilbert Bases, Caratheodory's Theorem and Combinatorial Optimization.",
                    "Stability Critical Graphs and Even Subdivisions of K_4.",
                    "Integer Solution to Synthesis of Communication Networks.",
                    "Scheduling Multiple Variable-Speed Machines.",
                    "Dual Decomposition of Single Machine Scheduling Problems.",
                    "A Theory of Alternating Paths and Blossoms for Proving Correctness of the O(\\surdVE) General Graph Matching Algorithm."
                ]
            }
        ]
    }
]