[
    {
        "year": "2021",
        "name": "32nd ISAAC 2021",
        "info": "Fukuoka, Japan",
        "venues": [
            {
                "sub_name_abbr": "conf/isaac/2021",
                "sub_name": "32nd International Symposium on Algorithms and Computation, ISAAC 2021, December 6-8, 2021, Fukuoka, Japan.",
                "count": 75,
                "papers": [
                    "Front Matter, Table of Contents, Preface, Conference Organization.",
                    "Streaming Pattern Matching (Invited Talk).",
                    "Spanning Properties of Variants of the Delaunay Graph (Invited Talk).",
                    "Subquadratic Algorithms for Some 3Sum-Hard Geometric Problems in the Algebraic Decision Tree Model.",
                    "Approximate Maximum Halfspace Discrepancy.",
                    "The VC-Dimension of Limited Visibility Terrains.",
                    "Clustering with Neighborhoods.",
                    "Approximating Longest Spanning Tree with Neighborhoods.",
                    "Self-Improving Voronoi Construction for a Hidden Mixture of Product Distributions.",
                    "Connected Coordinated Motion Planning with Bounded Stretch.",
                    "Enclosing Depth and Other Depth Measures.",
                    "Illuminating the x-Axis by α-Floodlights.",
                    "On Geometric Priority Set Cover Problems.",
                    "The Complexity of Sharing a Pizza.",
                    "Dynamic Data Structures for k-Nearest Neighbor Queries.",
                    "Preference-Based Trajectory Clustering - An Application of Geometric Hitting Sets.",
                    "Efficiently Partitioning the Edges of a 1-Planar Graph into a Planar Graph and a Forest.",
                    "On the Kernel and Related Problems in Interval Digraphs.",
                    "Interval Query Problem on Cube-Free Median Graphs.",
                    "Untangling Circular Drawings: Algorithms and Complexity.",
                    "Algorithms and Complexity on Indexing Elastic Founder Graphs.",
                    "Partitioning H-Free Graphs of Bounded Diameter.",
                    "Clique-Based Separators for Geometric Intersection Graphs.",
                    "Near-Optimal Distance Oracles for Vertex-Labeled Planar Graphs.",
                    "A Characterization of Individualization-Refinement Trees.",
                    "Truly Subquadratic Exact Distance Oracles with Constant Query Time for Planar Graphs.",
                    "Interval Edge Coloring of Bipartite Graphs with Small Vertex Degrees.",
                    "Selected Neighbor Degree Forest Realization.",
                    "MAX CUT in Weighted Random Intersection Graphs and Discrepancy of Sparse Random Set Systems.",
                    "The Impact of Geometry on Monochrome Regions in the Flip Schelling Process.",
                    "Piecewise-Linear Farthest-Site Voronoi Diagrams.",
                    "Effective Resistance and Capacitance in Simplicial Complexes and a Quantum Algorithm.",
                    "Anonymity-Preserving Space Partitions.",
                    "Impatient PPSZ - A Faster Algorithm for CSP.",
                    "Fine-Grained Meta-Theorems for Vertex Integrity.",
                    "Essentially Tight Kernels For (Weakly) Closed Graphs.",
                    "Filling Crosswords Is Very Hard.",
                    "Grid Recognition: Classical and Parameterized Computational Perspectives.",
                    "An Improved Approximation Algorithm for the Matching Augmentation Problem.",
                    "Multimodal Transportation with Ridesharing of Personal Vehicles.",
                    "Algorithms for Normalized Multiple Sequence Alignments.",
                    "Separated Red Blue Center Clustering.",
                    "On the Extended TSP Problem.",
                    "Probabilistic Analysis of Euclidean Capacitated Vehicle Routing.",
                    "Exact and Approximation Algorithms for Many-To-Many Point Matching in the Plane.",
                    "Augmenting Graphs to Minimize the Radius.",
                    "Linear-Time Approximation Scheme for k-Means Clustering of Axis-Parallel Affine Subspaces.",
                    "Feedback Vertex Set on Geometric Intersection Graphs.",
                    "Streaming Algorithms for Graph k-Matching with Optimal or Near-Optimal Update Time.",
                    "Making Three out of Two: Three-Way Online Correlated Selection.",
                    "Tight Competitive Analyses of Online Car-Sharing Problems.",
                    "Skeletons and Minimum Energy Scheduling.",
                    "Machine Covering in the Random-Order Model.",
                    "Nearly-Tight Lower Bounds for Set Cover and Network Design with Deadlines/Delay.",
                    "Cryptographic Hardness Under Projections for Time-Bounded Kolmogorov Complexity.",
                    "Identity Testing Under Label Mismatch.",
                    "Unique-Neighbor-Like Expansion and Group-Independent Cosystolic Expansion.",
                    "Group Evacuation on a Line by Agents with Different Communication Abilities.",
                    "Lower Bounds for Induced Cycle Detection in Distributed Computing.",
                    "Distributed Approximations of f-Matchings and b-Matchings in Graphs of Sub-Logarithmic Expansion.",
                    "Inverse Suffix Array Queries for 2-Dimensional Pattern Matching in Near-Compact Space.",
                    "Dynamic Boolean Formula Evaluation.",
                    "Shortest Beer Path Queries in Outerplanar Graphs.",
                    "Space-Efficient Algorithms for Reachability in Directed Geometric Graphs.",
                    "Repetition- and Linearity-Aware Rank/Select Dictionaries.",
                    "Pattern Masking for Dictionary Matching.",
                    "Resilient Level Ancestor, Bottleneck, and Lowest Common Ancestor Queries in Dynamic Trees.",
                    "Computing Shapley Values for Mean Width in 3-D.",
                    "Simple Envy-Free and Truthful Mechanisms for Cake Cutting with a Small Number of Cuts.",
                    "Adaptive Regularized Submodular Maximization.",
                    "Γ-Graphic Delta-Matroids and Their Applications.",
                    "An Approximation Algorithm for Maximum Stable Matching with Ties and Constraints.",
                    "A Faster Algorithm for Maximum Flow in Directed Planar Graphs with Vertex Capacities.",
                    "Maximum-Weight Matching in Sliding Windows and Beyond.",
                    "Quantum Advantage with Shallow Circuits Under Arbitrary Corruption."
                ]
            }
        ]
    },
    {
        "year": "2020",
        "name": "31st ISAAC 2020",
        "info": "Hong Kong [virtual]",
        "venues": [
            {
                "sub_name_abbr": "conf/isaac/2020",
                "sub_name": "31st International Symposium on Algorithms and Computation, ISAAC 2020, December 14-18, 2020, Hong Kong, China (Virtual Conference).",
                "count": 66,
                "papers": [
                    "Front Matter, Table of Contents, Preface, Conference Organization.",
                    "How to Decompose a Graph into a Tree-Like Structure (Invited Talk).",
                    "Worst-Case Optimal Join Algorithms (Invited Talk).",
                    "(In)approximability of Maximum Minimal FVS.",
                    "A Faster Subquadratic Algorithm for the Longest Common Increasing Subsequence Problem.",
                    "A Unified Framework of FPT Approximation Algorithms for Clustering Problems.",
                    "A Reduction of the Dynamic Time Warping Distance to the Longest Increasing Subsequence Length.",
                    "Algorithms and Complexity for Geodetic Sets on Planar and Chordal Graphs.",
                    "An SPQR-Tree-Like Embedding Representation for Level Planarity.",
                    "Approximating the Packedness of Polygonal Curves.",
                    "Approximation Algorithms for Generalized Path Scheduling.",
                    "Approximations for Throughput Maximization.",
                    "Arithmetic Expression Construction.",
                    "Between Shapes, Using the Hausdorff Distance.",
                    "Bi-Criteria Approximation Algorithms for Load Balancing on Unrelated Machines with Costs.",
                    "Cake Cutting: An Envy-Free and Truthful Mechanism with a Small Number of Cuts.",
                    "Compact Routing in Unit Disk Graphs.",
                    "Complexity of Retrograde and Helpmate Chess Problems: Even Cooperative Chess Is Hard.",
                    "Complexity of Scheduling Few Types of Jobs on Related and Unrelated Machines.",
                    "Complexity of Stability.",
                    "Computing Dense and Sparse Subgraphs of Weakly Closed Graphs.",
                    "Constant-Factor Approximation Algorithms for the Parity-Constrained Facility Location Problem.",
                    "Contracting to a Longest Path in H-Free Graphs.",
                    "Counting 4-Patterns in Permutations Is Equivalent to Counting 4-Cycles in Graphs.",
                    "Discriminating Codes in Geometric Setups.",
                    "Distance Oracles for Interval Graphs via Breadth-First Rank/Select in Succinct Trees.",
                    "Diverse Pairs of Matchings.",
                    "Efficient Labeling for Reachability in Directed Acyclic Graphs.",
                    "Efficiently Computing All Delaunay Triangles Occurring over All Contiguous Subsequences.",
                    "Enumerating Range Modes.",
                    "Finding Temporal Paths Under Waiting Time Constraints.",
                    "Flexible List Colorings in Graphs with Special Degeneracy Conditions.",
                    "Geometric Pattern Matching Reduces to k-SUM.",
                    "Gourds: A Sliding-Block Puzzle with Turning.",
                    "Improved FPT Algorithms for Deletion to Forest-Like Structures.",
                    "Indexing Isodirectional Pointer Sequences.",
                    "Length-Bounded Cuts: Proper Interval Graphs and Structural Parameters.",
                    "Linear Transformations Between Dominating Sets in the TAR-Model.",
                    "Linear-Time Algorithms for Computing Twinless Strong Articulation Points and Related Problems.",
                    "Market Pricing for Matroid Rank Valuations.",
                    "Minimization and Parameterized Variants of Vertex Partition Problems on Graphs.",
                    "Multicommodity Flows in Planar Graphs with Demands on Faces.",
                    "Multiparty Selection.",
                    "Multistage s-t Path: Confronting Similarity with Dissimilarity in Temporal Graphs.",
                    "On Girth and the Parameterized Complexity of Token Sliding and Token Jumping.",
                    "Online Primal-Dual Algorithms with Configuration Linear Programs.",
                    "Partial Function Extension with Applications to Learning and Property Testing.",
                    "Quantum-Inspired Algorithms for Solving Low-Rank Linear Equation Systems with Logarithmic Dependence on the Dimension.",
                    "Random Access in Persistent Strings.",
                    "Recency Queries with Succinct Representation.",
                    "Recursed Is Not Recursive: A Jarring Result.",
                    "Shared vs Private Randomness in Distributed Interactive Proofs.",
                    "Shortest-Path Queries in Geometric Networks.",
                    "Signal Passing Self-Assembly Simulates Tile Automata.",
                    "Size, Depth and Energy of Threshold Circuits Computing Parity Function.",
                    "Sorting by Prefix Block-Interchanges.",
                    "Space Hardness of Solving Structured Linear Systems.",
                    "Sparse Hop Spanners for Unit Disk Graphs.",
                    "Sparsification Lower Bounds for List H-Coloring.",
                    "The Complexity of Connectivity Problems in Forbidden-Transition Graphs And Edge-Colored Graphs.",
                    "The Online Broadcast Range-Assignment Problem.",
                    "The k-Server Problem with Delays on the Uniform Metric Space.",
                    "Towards Constant-Factor Approximation for Chordal / Distance-Hereditary Vertex Deletion.",
                    "Update Query Time Trade-Off for Dynamic Suffix Arrays.",
                    "Weakly Submodular Function Maximization Using Local Submodularity Ratio.",
                    "Wear Leveling Revisited."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "30th ISAAC 2019",
        "info": "Shanghai, China",
        "venues": [
            {
                "sub_name_abbr": "conf/isaac/2019",
                "sub_name": "30th International Symposium on Algorithms and Computation, ISAAC 2019, December 8-11, 2019, Shanghai University of Finance and Economics, Shanghai, China.",
                "count": 65,
                "papers": [
                    "Front Matter, Table of Contents, Preface, Symposium Organization.",
                    "Graph Searches and Their End Vertices.",
                    "Lower Bound for Non-Adaptive Estimation of the Number of Defective Items.",
                    "A Polynomial-Delay Algorithm for Enumerating Connectors Under Various Connectivity Conditions.",
                    "Top Tree Compression of Tries.",
                    "Two Phase Transitions in Two-Way Bootstrap Percolation.",
                    "Sliding Window Property Testing for Regular Languages.",
                    "On the Hardness of Set Disjointness and Set Intersection with Bounded Universe.",
                    "Gathering and Election by Mobile Robots in a Continuous Cycle.",
                    "Strategy-Proof Approximation Algorithms for the Stable Marriage Problem with Ties and Incomplete Lists.",
                    "Online Multidimensional Packing Problems in the Random-Order Model.",
                    "Approximate Euclidean Shortest Paths in Polygonal Domains.",
                    "Reachability in High Treewidth Graphs.",
                    "Approximate Pricing in Networks: How to Boost the Betweenness and Revenue of a Node.",
                    "Slaying Hydrae: Improved Bounds for Generalized k-Server in Uniform Metrics.",
                    "Measure and Conquer for Max Hamming Distance XSAT.",
                    "Cyclability in Graph Classes.",
                    "Complexity of Linear Operators.",
                    "New Results for the k-Secretary Problem.",
                    "Triangle Estimation Using Tripartite Independent Set Queries.",
                    "Step-By-Step Community Detection in Volume-Regular Graphs.",
                    "Blocking Dominating Sets for H-Free Graphs via Edge Contractions.",
                    "Internal Dictionary Matching.",
                    "Approximating the Geometric Edit Distance.",
                    "On Adaptivity Gaps of Influence Maximization Under the Independent Cascade Model with Full-Adoption Feedback.",
                    "Minimum-Width Double-Strip and Parallelogram Annulus.",
                    "Small Candidate Set for Translational Pattern Search.",
                    "The Weighted k-Center Problem in Trees for Fixed k.",
                    "Online Knapsack Problems with a Resource Buffer.",
                    "Local Cliques in ER-Perturbed Random Geometric Graphs.",
                    "Local Routing in Sparse and Lightweight Geometric Graphs.",
                    "Searching for Cryptogenography Upper Bounds via Sum of Square Programming.",
                    "On the Complexity of Lattice Puzzles.",
                    "The I/O Complexity of Hybrid Algorithms for Square Matrix Multiplication.",
                    "Accurate MapReduce Algorithms for k-Median and k-Means in General Metric Spaces.",
                    "On Optimal Balance in B-Trees: What Does It Cost to Stay in Perfect Shape?",
                    "How Does Object Fatness Impact the Complexity of Packing in d Dimensions?",
                    "On One-Round Discrete Voronoi Games.",
                    "On Explicit Branching Programs for the Rectangular Determinant and Permanent Polynomials.",
                    "A Competitive Algorithm for Random-Order Stochastic Virtual Circuit Routing.",
                    "An Improved Data Structure for Left-Right Maximal Generic Words Problem.",
                    "Parameterized Complexity Classification of Deletion to List Matrix-Partition for Low-Order Matrices.",
                    "The Generalized Microscopic Image Reconstruction Problem.",
                    "Stabilization Time in Minority Processes.",
                    "Parameterized Complexity of Stable Roommates with Ties and Incomplete Lists Through the Lens of Graph Parameters.",
                    "Path and Ancestor Queries over Trees with Multidimensional Weight Vectors.",
                    "A 21/16-Approximation for the Minimum 3-Path Partition Problem.",
                    "Efficiently Realizing Interval Sequences.",
                    "Efficient Interactive Proofs for Linear Algebra.",
                    "When Maximum Stable Set Can Be Solved in FPT Time.",
                    "The k-Fréchet Distance: How to Walk Your Dog While Teleporting.",
                    "New Applications of Nearest-Neighbor Chains: Euclidean TSP and Motorcycle Graphs.",
                    "Efficient Circuit Simulation in MapReduce.",
                    "Concurrent Distributed Serving with Mobile Servers.",
                    "Tracking Paths in Planar Graphs.",
                    "Distance Measures for Embedded Graphs.",
                    "Online Algorithms for Warehouse Management.",
                    "On Approximate Range Mode and Range Selection.",
                    "External Memory Planar Point Location with Fast Updates.",
                    "Minimizing and Computing the Inverse Geodesic Length on Trees.",
                    "Result-Sensitive Binary Search with Noisy Information.",
                    "Improved Algorithms for Clustering with Outliers.",
                    "Unbounded Regions of High-Order Voronoi Diagrams of Lines and Segments in Higher Dimensions.",
                    "Neighborhood Inclusions for Minimal Dominating Sets Enumeration: Linear and Polynomial Delay Algorithms in P7-Free and P8-Free Chordal Graphs.",
                    "Dual-Mode Greedy Algorithms Can Save Energy."
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "29th ISAAC 2018",
        "info": "Jiaoxi, Yilan, Taiwan",
        "venues": [
            {
                "sub_name_abbr": "conf/isaac/2018",
                "sub_name": "29th International Symposium on Algorithms and Computation, ISAAC 2018, December 16-19, 2018, Jiaoxi, Yilan, Taiwan.",
                "count": 74,
                "papers": [
                    "Front Matter, Table of Contents, Preface, Conference Organization.",
                    "Going Beyond Traditional Characterizations in the Age of Big Data and Network Sciences (Invited Talk).",
                    "Approximate Matchings in Massive Graphs via Local Structure (Invited Talk).",
                    "Exploiting Sparsity for Bipartite Hamiltonicity.",
                    "Opinion Forming in Erdös-Rényi Random Graph and Expanders.",
                    "Colouring (P_r+P_s)-Free Graphs.",
                    "The Use of a Pruned Modular Decomposition for Maximum Matching Algorithms on Some Graph Classes.",
                    "A Novel Algorithm for the All-Best-Swap-Edge Problem on Tree Spanners.",
                    "Efficient Enumeration of Dominating Sets for Sparse Graphs.",
                    "Complexity of Unordered CNF Games.",
                    "Half-Duplex Communication Complexity.",
                    "On the Complexity of Stable Fractional Hypergraph Matching.",
                    "Deciding the Closure of Inconsistent Rooted Triples Is NP-Complete.",
                    "Computing Vertex-Disjoint Paths in Large Graphs Using MAOs.",
                    "An O(n^2 log^2 n) Time Algorithm for Minmax Regret Minsum Sink on Path Networks.",
                    "Computing Optimal Shortcuts for Networks.",
                    "Algorithmic Channel Design.",
                    "Counting Connected Subgraphs with Maximum-Degree-Aware Sieving.",
                    "Target Set Selection in Dense Graph Classes.",
                    "Counting Shortest Two Disjoint Paths in Cubic Planar Graphs with an NC Algorithm.",
                    "Data-Compression for Parametrized Counting Problems on Sparse Graphs.",
                    "Planar Maximum Matching: Towards a Parallel Algorithm.",
                    "Distributed Approximation Algorithms for the Minimum Dominating Set in K_h-Minor-Free Graphs.",
                    "Proving the Turing Universality of Oritatami Co-Transcriptional Folding.",
                    "Cluster Editing in Multi-Layer and Temporal Graphs.",
                    "Parameterized Query Complexity of Hitting Set Using Stability of Sunflowers.",
                    "Approximate Minimum-Weight Matching with Outliers Under Translation.",
                    "New and Improved Algorithms for Unordered Tree Inclusion.",
                    "Beyond-Planarity: Turán-Type Results for Non-Planar Bipartite Graphs.",
                    "A Dichotomy Result for Cyclic-Order Traversing Games.",
                    "The b-Matching Problem in Distance-Hereditary Graphs and Beyond.",
                    "New Algorithms for Edge Induced König-Egerváry Subgraph Based on Gallai-Edmonds Decomposition.",
                    "Computing Approximate Statistical Discrepancy.",
                    "Diversity Maximization in Doubling Metrics.",
                    "On Polynomial Time Constructions of Minimum Height Decision Tree.",
                    "Improved Algorithms for the Shortest Vector Problem and the Closest Vector Problem in the Infinity Norm.",
                    "An Adaptive Version of Brandes' Algorithm for Betweenness Centrality.",
                    "Algorithms for Coloring Reconfiguration Under Recolorability Constraints.",
                    "A Cut Tree Representation for Pendant Pairs.",
                    "Polyline Drawings with Topological Constraints.",
                    "Almost Optimal Algorithms for Diameter-Optimally Augmenting Trees.",
                    "Approximation Algorithms for Facial Cycles in Planar Embeddings.",
                    "An Algorithm for the Maximum Weight Strongly Stable Matching Problem.",
                    "Approximation Algorithm for Vertex Cover with Multiple Covering Constraints.",
                    "Correlation Clustering Generalized.",
                    "Partitioning Vectors into Quadruples: Worst-Case Analysis of a Matching-Based Algorithm.",
                    "Coresets for Fuzzy K-Means with Applications.",
                    "Streaming Algorithms for Planar Convex Hulls.",
                    "Deterministic Treasure Hunt in the Plane with Angular Hints.",
                    "Competitive Searching for a Line on a Line Arrangement.",
                    "Stabbing Pairwise Intersecting Disks by Five Points.",
                    "Point Location in Incremental Planar Subdivisions.",
                    "Convex Partial Transversals of Planar Regions.",
                    "Extending the Centerpoint Theorem to Multiple Points.",
                    "Approximate Query Processing over Static Sets and Sliding Windows.",
                    "Multi-Finger Binary Search Trees.",
                    "On Counting Oracles for Path Problems.",
                    "Reconstructing Phylogenetic Tree From Multipartite Quartet System.",
                    "Rectilinear Link Diameter and Radius in a Rectilinear Polygonal Domain.",
                    "Minimizing Distance-to-Sight in Polygonal Domains.",
                    "Partially Walking a Polygon.",
                    "Stabbing Rectangles by Line Segments - How Decomposition Reduces the Shallow-Cell Complexity.",
                    "Impatient Online Matching.",
                    "Extensions of Self-Improving Sorters.",
                    "Online Scheduling of Car-Sharing Requests Between Two Locations with Many Cars and Flexible Advance Bookings.",
                    "Packing Returning Secretaries.",
                    "Simple 2^f-Color Choice Dictionaries.",
                    "Succinct Data Structures for Chordal Graphs.",
                    "Tree Path Majority Data Structures.",
                    "Encoding Two-Dimensional Range Top-k Queries Revisited.",
                    "Longest Unbordered Factor in Quasilinear Time.",
                    "Packing Sporadic Real-Time Tasks on Identical Multiprocessor Systems.",
                    "A Relaxed FPTAS for Chance-Constrained Knapsack.",
                    "Covering Clients with Types and Budgets."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "28th ISAAC 2017",
        "info": "Phuket, Thailand",
        "venues": [
            {
                "sub_name_abbr": "conf/isaac/2017",
                "sub_name": "28th International Symposium on Algorithms and Computation, ISAAC 2017, December 9-12, 2017, Phuket, Thailand.",
                "count": 68,
                "papers": [
                    "Front Matter, Table of Contents, Preface, External Reviewers.",
                    "Weighted Linear Matroid Parity.",
                    "Computational Philosophy: On Fairness in Automated Decision Making.",
                    "Faster Algorithms for Growing Prioritized Disks and Rectangles.",
                    "Placing your Coins on a Shelf.",
                    "On the Number of p4-Tilings by an n-Omino.",
                    "Network Optimization on Partitioned Pairs of Points.",
                    "Voronoi Diagrams for Parallel Halflines and Line Segments in Space.",
                    "Faster Algorithms for Half-Integral T-Path Packing.",
                    "Shortcuts for the Circle.",
                    "Routing in Polygonal Domains.",
                    "Tilt Assembly: Algorithms for Micro-Factories that Build Objects with Uniform External Forces.",
                    "A Simple Greedy Algorithm for Dynamic Graph Orientation.",
                    "Crossing Number for Graphs with Bounded~Pathwidth.",
                    "An Improved Algorithm for Computing All the Best Swap Edges of a Tree Spanner.",
                    "Decomposing a Graph into Shortest Paths with Bounded Eccentricity.",
                    "Independent Feedback Vertex Set for P_5-free Graphs.",
                    "On the Convergence Time of a Natural Dynamics for Linear Programming.",
                    "Routing on the Visibility Graph.",
                    "An FPTAS of Minimizing Total Weighted Completion Time on Single Machine with Position Constraint.",
                    "An Efficient Fixed-Parameter Algorithm for the 2-Plex Bipartition Problem.",
                    "Smart Contract Execution - the (+-)-Biased Ballot Problem.",
                    "Study of a Combinatorial Game in Graphs Through Linear Programming.",
                    "On Maximal Cliques with Connectivity Constraints in Directed Graphs.",
                    "Square-Contact Representations of Partial 2-Trees and Triconnected Simply-Nested Graphs.",
                    "Faster DBScan and HDBScan in Low-Dimensional Euclidean Spaces.",
                    "Fully-Dynamic and Kinetic Conflict-Free Coloring of Intervals with Respect to Points.",
                    "Dynamic Conflict-Free Colorings in the Plane.",
                    "Temporal Hierarchical Clustering.",
                    "Agnostically Learning Boolean Functions with Finite Polynomial Representation.",
                    "Succinct Color Searching in One Dimension.",
                    "Conflict-Free Coloring of Intersection Graphs.",
                    "On Using Toeplitz and Circulant Matrices for Johnson-Lindenstrauss Transforms.",
                    "Almost Linear Time Computation of Maximal Repetitions in Run Length Encoded Strings.",
                    "Embedding Graphs into Embedded Graphs.",
                    "Structural Pattern Matching - Succinctly.",
                    "On Structural Parameterizations of the Edge Disjoint Paths Problem.",
                    "Barrier Coverage with Non-uniform Lengths to Minimize Aggregate Movements.",
                    "Sorting with Recurrent Comparison Errors.",
                    "Dominance Product and High-Dimensional Closest Pair under L_infty.",
                    "Orthogonal Vectors Indexing.",
                    "Non-approximability and Polylogarithmic Approximations of the Single-Sink Unsplittable and Confluent Dynamic Flow Problems.",
                    "Range-Efficient Consistent Sampling and Locality-Sensitive Hashing for Polygons.",
                    "Maximum Induced Matching Algorithms via Vertex Ordering Characterizations.",
                    "On-the-Fly Array Initialization in Less Space.",
                    "On Directed Covering and Domination Problems.",
                    "Settlement Fund Circulation Problem.",
                    "An Efficient Sum Query Algorithm for Distance-based Locally Dominating Functions.",
                    "Complexity of the Multi-Service Center Problem.",
                    "Improved Algorithms for Scheduling Unsplittable Flows on Paths.",
                    "Structural Parameters, Tight Bounds, and Approximation for (k, r)-Center.",
                    "Optimal Matroid Partitioning Problems.",
                    "Improved Bounds for Online Dominating Sets of Trees.",
                    "Maximizing the Strong Triadic Closure in Split Graphs and Proper Interval Graphs.",
                    "Non-Crossing Geometric Steiner Arborescences.",
                    "Precedence-Constrained Min Sum Set Cover.",
                    "Jointly Stable Matchings.",
                    "Fast Compressed Self-Indexes with Deterministic Linear-Time Construction.",
                    "Satisfiability Algorithm for Syntactic Read-$k$-times Branching Programs.",
                    "Fully Dynamic Connectivity Oracles under General Vertex Updates.",
                    "Finding Pairwise Intersections of Rectangles in a Query Rectangle.",
                    "A New Balanced Subdivision of a Simple Polygon for Time-Space Trade-off Algorithms.",
                    "Complexity of Coloring Reconfiguration under Recolorability Constraints.",
                    "Approximate Nearest Neighbors Search Without False Negatives For l_2 For c>sqrt{loglog{n}}.",
                    "Tight Approximation for Partial Vertex Cover with Hard Capacities.",
                    "Hybrid VCSPs with Crisp and Valued Conservative Templates.",
                    "A (1.4 + epsilon)-Approximation Algorithm for the 2-Max-Duo Problem.",
                    "Envy-free Matchings with Lower Quotas."
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "27th ISAAC 2016",
        "info": "Sydney, Australia",
        "venues": [
            {
                "sub_name_abbr": "conf/isaac/2016",
                "sub_name": "27th International Symposium on Algorithms and Computation, ISAAC 2016, December 12-14, 2016, Sydney, Australia.",
                "count": 65,
                "papers": [
                    "Front Matter, Table of Contents, Preface, Program Committee, External Reviewers.",
                    "Towards Processing of Big Graphs: from Theory, Algorithm to System (Invited Talk).",
                    "Compressed and Searchable Indexes for Highly Similar Strings (Invited Talk).",
                    "Streaming Verification of Graph Properties.",
                    "Building Clusters with Lower-Bounded Sizes.",
                    "Simultaneous Feedback Edge Set: A Parameterized Perspective.",
                    "Kernels for Deletion to Classes of Acyclic Digraphs.",
                    "An Efficient Algorithm for Placing Electric Vehicle Charging Stations.",
                    "Finding k Simple Shortest Paths and Cycles.",
                    "Packing Short Plane Spanning Trees in Complete Geometric Graphs.",
                    "Reconstruction of Weakly Simple Polygons from their Edges.",
                    "Approximating Smallest Containers for Packing Three-Dimensional Convex Objects.",
                    "Mind the Gap: Essentially Optimal Algorithms for Online Dictionary Matching with One Gap.",
                    "Clustered Planarity with Pipes.",
                    "L_1 Geodesic Farthest Neighbors in a Simple Polygon and Related Problems.",
                    "Approximate Clustering via Metric Partitioning.",
                    "Hard Communication Channels for Steganography.",
                    "On r-Guarding Thin Orthogonal Polygons.",
                    "Dynamic Relative Compression, Dynamic Partial Sums, and Substring Concatenation.",
                    "Towards Plane Spanners of Degree 3.",
                    "Degree-Constrained Orientation of Maximum Satisfaction: Graph Classes and Parameterized Complexity.",
                    "Online Packet Scheduling with Bounded Delay and Lookahead.",
                    "Biconnectivity, Chain Decomposition and st-Numbering Using O(n) Bits.",
                    "On (1, epsilon)-Restricted Max-Min Fair Allocation Problem.",
                    "All-Pairs Shortest Paths in Unit-Disk Graphs in Slightly Subquadratic Time.",
                    "Sink Evacuation on Trees with Dynamic Confluent Flows.",
                    "Adaptivity vs. Postselection, and Hardness Amplification for Polynomial Approximation.",
                    "Search on a Line by Byzantine Robots.",
                    "Bipartite Matching with Linear Edge Weights.",
                    "Raising Permutations to Powers in Place.",
                    "Space-Efficient Plane-Sweep Algorithms.",
                    "Linear Kernels and Linear-Time Algorithms for Finding Large Cuts.",
                    "Universal Guard Problems.",
                    "Fast Approximation Algorithms for the Generalized Survivable Network Design Problem.",
                    "Space-Time Trade-Offs for the Shortest Unique Substring Problem.",
                    "The Subset Assignment Problem for Data Placement in Caches.",
                    "A Gap Trichotomy for Boolean Constraint Problems: Extending Schaefer's Theorem.",
                    "Sliding Tokens on a Cactus.",
                    "Complexity of Distributions and Average-Case Hardness.",
                    "Computing the Pattern Waiting Time: A Revisit of the Intuitive Approach.",
                    "O(f) Bi-Approximation for Capacitated Covering with Hard Capacities.",
                    "Surrogate Optimization for p-Norms.",
                    "Optimal Composition Ordering Problems for Piecewise Linear Functions.",
                    "Additive Approximation Algorithms for Modularity Maximization.",
                    "The Densest Subgraph Problem with a Convex/Concave Size Function.",
                    "On the Classes of Interval Graphs of Limited Nesting and Count of Lengths.",
                    "Pattern Matching and Consensus Problems on Weighted Sequences and Profiles.",
                    "Hierarchical Time-Dependent Oracles.",
                    "A Refined Definition for Groups of Moving Entities and its Computation.",
                    "A Sidetrack-Based Algorithm for Finding the k Shortest Simple Paths in a Directed Graph.",
                    "On the Complexity of Matching Cut in Graphs of Fixed Diameter.",
                    "On the Optimality of Tape Merge of Two Lists with Similar Size.",
                    "Dispersing Points on Intervals.",
                    "Optimal Nonpreemptive Scheduling in a Smart Grid Model.",
                    "Distributed and Robust Support Vector Machine.",
                    "Single Machine Scheduling with Job-Dependent Machine Deterioration.",
                    "Approximation Algorithms for Capacitated k-Travelling Repairmen Problems.",
                    "Scaling and Proximity Properties of Integrally Convex Functions.",
                    "Assigning Weights to Minimize the Covering Radius in the Plane.",
                    "A Near-Optimal Algorithm for Finding an Optimal Shortcut of a Tree.",
                    "Approximate Shortest Distances Among Smooth Obstacles in 3D.",
                    "An Improved Tax Scheme for Selfish Routing.",
                    "A Linear-Time Algorithm for Integral Multiterminal Flows in Trees.",
                    "Shortest Disjoint S-Paths Via Weighted Linear Matroid Parity.",
                    "The (1|1)-Centroid Problem on the Plane Concerning Distance Constraints."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "26th ISAAC 2015",
        "info": "Nagoya, Japan",
        "venues": [
            {
                "sub_name_abbr": "conf/isaac/2015",
                "sub_name": "Algorithms and Computation - 26th International Symposium, ISAAC 2015, Nagoya, Japan, December 9-11, 2015, Proceedings.",
                "count": 65,
                "papers": [
                    "An Optimal Algorithm for Tiling the Plane with a Translated Polyomino.",
                    "Adaptive Point Location in Planar Convex Subdivisions.",
                    "Competitive Local Routing with Constraints.",
                    "Navigating Weighted Regions with Scattered Skinny Tetrahedra.",
                    "On the Succinct Representation of Unlabeled Permutations.",
                    "How to Select the Top k Elements from Evolving Data?",
                    "Optimal Search Trees with 2-Way Comparisons.",
                    "Multidimensional Range Selection.",
                    "On the Minimum Cost Range Assignment Problem.",
                    "On the Approximability of the Minimum Rainbow Subgraph Problem and Other Related Problems.",
                    "General Caching Is Hard: Even with Small Pages.",
                    "The Secretary Problem with a Choice Function.",
                    "The Benefit of Recombination in Noisy Evolutionary Search.",
                    "Algorithmic Learning for Steganography: Proper Learning of k-term DNF Formulas from Positive Samples.",
                    "Obtaining a Triangular Matrix by Independent Row-Column Permutations.",
                    "Many-to-one Matchings with Lower Quotas: Algorithms and Complexity.",
                    "Minimizing the Maximum Moving Cost of Interval Coverage.",
                    "Heuristic Time Hierarchies via Hierarchies for Sampling Distributions.",
                    "Unbounded Discrepancy of Deterministic Random Walks on Grids.",
                    "Trading off Worst and Expected Cost in Decision Tree Problems.",
                    "Sliding Token on Bipartite Permutation Graphs.",
                    "Output-Polynomial Enumeration on Graphs of Bounded (Local) Linear MIM-Width.",
                    "Minimum Degree Up to Local Complementation: Bounds, Parameterized Complexity, and Exact Algorithms.",
                    "Exact and FPT Algorithms for Max-Conflict Free Coloring in Hypergraphs.",
                    "Geometric Matching Algorithms for Two Realistic Terrains.",
                    "Size-Dependent Tile Self-Assembly: Constant-Height Rectangles and Stability.",
                    "The 2-Center Problem in a Simple Polygon.",
                    "Choice Is Hard.",
                    "Fully Dynamic Betweenness Centrality.",
                    "When Patrolmen Become Corrupted: Monitoring a Graph Using Faulty Mobile Robots.",
                    "Cops and Robbers on String Graphs.",
                    "Min-Power Covering Problems.",
                    "Minimizing the Diameter of a Spanning Tree for Imprecise Points.",
                    "Model-Based Classification of Trajectories.",
                    "Linear-Time Algorithms for the Farthest-Segment Voronoi Diagram and Related Tree Structures.",
                    "Unfolding Orthogonal Polyhedra with Linear Refinement.",
                    "Colored Non-crossing Euclidean Steiner Forest.",
                    "On a Generalization of Nemhauser and Trotter's Local Optimization Theorem.",
                    "Approximation Algorithms in the Successive Hitting Set Model.",
                    "Generating Random Hyperbolic Graphs in Subquadratic Time.",
                    "Provable Efficiency of Contraction Hierarchies with Randomized Preprocessing.",
                    "Randomized Minmax Regret for Combinatorial Optimization Under Uncertainty.",
                    "An Optimal Algorithm for Reconstructing Point Set Order Types from Radial Orderings.",
                    "Improved Approximation for Fréchet Distance on c-packed Curves Matching Conditional Lower Bounds.",
                    "Computing the Gromov-Hausdorff Distance for Metric Trees.",
                    "The VC-Dimension of Visibility on the Boundary of a Simple Polygon.",
                    "Quantum Bit Commitment with Application in Quantum Zero-Knowledge Proof (Extended Abstract).",
                    "Effectiveness of Structural Restrictions for Hybrid CSPs.",
                    "Polynomial-Time Isomorphism Test of Groups that are Tame Extensions - (Extended Abstract).",
                    "Quantum Algorithm for Triangle Finding in Sparse Graphs.",
                    "On Hardness of the Joint Crossing Number.",
                    "An O(n^ε ) Space and Polynomial Time Algorithm for Reachability in Directed Layered Planar Graphs.",
                    "Constant Query Time (1+\\epsilon ) -Approximate Distance Oracle for Planar Graphs.",
                    "Partitioning Graph Drawings and Triangulated Simple Polygons into Greedily Routable Regions.",
                    "A New Approximate Min-Max Theorem with Applications in Cryptography.",
                    "Give Me Another One!",
                    "On the Complexity of Computing Prime Tables.",
                    "Game Values and Computational Complexity: An Analysis via Black-White Combinatorial Games.",
                    "Run Generation Revisited: What Goes Up May or May Not Come Down.",
                    "Streaming Verification in Data Analysis.",
                    "All-Around Near-Optimal Solutions for the Online Bin Packing Problem.",
                    "Serving Online Requests with Mobile Servers.",
                    "An In-place Framework for Exact and Approximate Shortest Unique Substring Queries.",
                    "Inferring Strings from Full Abelian Periods.",
                    "Toehold DNA Languages are Regular."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "25th ISAAC 2014",
        "info": "Jeonju, Korea",
        "venues": [
            {
                "sub_name_abbr": "conf/isaac/2014",
                "sub_name": "Algorithms and Computation - 25th International Symposium, ISAAC 2014, Jeonju, Korea, December 15-17, 2014, Proceedings.",
                "count": 60,
                "papers": [
                    "Line-Constrained k -Median, k -Means, and k -Center Problems in the Plane.",
                    "Reconstructing Point Set Order Typesfrom Radial Orderings.",
                    "A Randomized Divide and Conquer Algorithm for Higher-Order Abstract Voronoi Diagrams.",
                    "Average-Case Complexity of the Min-Sum Matrix Product Problem.",
                    "Efficiently Correcting Matrix Products.",
                    "3D Rectangulations and Geometric Matrix Multiplication.",
                    "Enumeration of Maximum Common Subtree Isomorphisms with Polynomial-Delay.",
                    "Efficient Enumeration of Induced Subtrees in a K-Degenerate Graph.",
                    "An Efficient Method for Indexing All Topological Orders of a Directed Graph.",
                    "Planar Matchings for Weighted Straight Skeletons.",
                    "Orienting Dynamic Graphs, with Applications to Maximal Matchings and Adjacency Queries.",
                    "Dynamic and Multi-Functional Labeling Schemes.",
                    "Hashing and Indexing: Succinct DataStructures and Smoothed Analysis.",
                    "Top- k Term-Proximity in Succinct Space.",
                    "The Power and Limitations of Static Binary Search Trees with Lazy Finger.",
                    "Minimum-Cost b -Edge Dominating Sets on Trees.",
                    "Fixed-Parameter Tractability of Token Jumping on Planar Graphs.",
                    "Covering Problems for Partial Words and for Indeterminate Strings.",
                    "Dynamic Interval Scheduling for Multiple Machines.",
                    "Throughput Maximization in Multiprocessor Speed-Scaling.",
                    "Speed-Scaling with No Preemptions.",
                    "A Short Implicant of a CNF Formula with Many Satisfying Assignments.",
                    "On the Computational Complexity of Vertex Integrity and Component Order Connectivity.",
                    "Co-Clustering Under the Maximum Norm.",
                    "The Price of Order.",
                    "Range Queries on Uncertain Data.",
                    "On the Most Likely Voronoi Diagramand Nearest Neighbor Searching.",
                    "An Improved Approximation Algorithm for the Minimum Common Integer Partition Problem.",
                    "Positive Semidefinite Relaxation and Approximation Algorithm for Triple Patterning Lithography.",
                    "An FPTAS for the Volume Computationof 0-1 Knapsack Polytopes Based on Approximate Convolution Integral.",
                    "Polynomial-Time Algorithm for Sliding Tokens on Trees.",
                    "Minimal Obstructions for Partial Representations of Interval Graphs.",
                    "Faster Algorithms for Computing the R* Consensus Tree.",
                    "Complexity and Kernels for Bipartition into Degree-bounded Induced Graphs.",
                    "Faster Existential FO Model Checking on Posets.",
                    "Vertex Cover Reconfiguration and Beyond.",
                    "Approximating the Maximum Internal Spanning Tree Problem via a Maximum Path-Cycle Cover.",
                    "Approximation Algorithms Inspired by Kernelization Methods.",
                    "An 5/4-Approximation Algorithm for Sorting Permutations by Short Block Moves.",
                    "Lower Bounds for On-line Graph Colorings.",
                    "An On-line Competitive Algorithm for Coloring P_8 -free Bipartite Graphs.",
                    "Bounds on Double-Sided Myopic Algorithms for Unconstrained Non-monotoneSubmodular Maximization.",
                    "Tradeoff Between Label Space and Auxiliary Space for Representation of Equivalence Classes.",
                    "Depth-First Search Using O(n) Bits.",
                    "Dynamic Path Counting and Reporting in Linear Space.",
                    "Linear-Time Algorithms for Proportional Apportionment.",
                    "Rank-Maximal Matchings - Structure and Algorithms.",
                    "The Generalized Popular Condensation Problem.",
                    "Dirichlet Eigenvalues, Local Random Walks, and Analyzing Clusters in Graphs.",
                    "Planar Embeddings with Small and Uniform Faces.",
                    "Scheduling Unit Jobs with a Common Deadline to Minimize the Sum of Weighted Completion Times and Rejection Penalties.",
                    "Solving Multi-choice Secretary Problem in Parallel: An Optimal Observation-Selection Protocol.",
                    "A Geometric Approach to Graph Isomorphism.",
                    "Concentrated Hitting Times of Randomized Search Heuristics with Variable Drift.",
                    "Euclidean TSP with Few Inner Points in Linear Space.",
                    "Bottleneck Partial-Matching Voronoi Diagrams and Applications.",
                    "Ham-Sandwich Cuts for Abstract Order Types.",
                    "Graph Orientation and Flows over Time.",
                    "A Simple Efficient Interior Point Method for Min-Cost Flow.",
                    "Decremental All-Pairs ALL Shortest Paths and Betweenness Centrality."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "24th ISAAC 2013",
        "info": "Hong Kong, China",
        "venues": [
            {
                "sub_name_abbr": "conf/isaac/2013",
                "sub_name": "Algorithms and Computation - 24th International Symposium, ISAAC 2013, Hong Kong, China, December 16-18, 2013, Proceedings.",
                "count": 68,
                "papers": [
                    "Market Approach to Social Ads: The MyLikes Example and Related Problems.",
                    "Geodesic-Preserving Polygon Simplification.",
                    "Space-Efficient and Data-Sensitive Polygon Reconstruction Algorithms from Visibility Angle Information.",
                    "On the Edge Crossing Properties of Euclidean Minimum Weight Laman Graphs.",
                    "Structure and Computation of Straight Skeletons in 3-Space.",
                    "Pattern Matching with Non Overlapping Reversals - Approximation and On-line Algorithms.",
                    "Single and Multiple Consecutive Permutation Motif Search.",
                    "Beating $\\mathcal{O}(nm)$ in Approximate LZW-Compressed Pattern Matching.",
                    "Less Space: Indexing for Queries with Wildcards.",
                    "On Determining Deep Holes of Generalized Reed-Solomon Codes.",
                    "Isomorphism on Subgraph-Closed Graph Classes: A Complexity Dichotomy and Intermediate Graph Classes.",
                    "Determinantal Complexities and Field Extensions.",
                    "Algorithms to Measure Diversity and Clustering in Social Networks through Dot Product Graphs.",
                    "Sublinear-Time Algorithms for Monomer-Dimer Systems on Bounded Degree Graphs.",
                    "The Complexity of Finding a Large Subgraph under Anonymity Constraints.",
                    "On the Number of Edges of Fan-Crossing Free Graphs.",
                    "Cops and Robbers on Intersection Graphs.",
                    "SEFE with No Mapping via Large Induced Outerplane Graphs in Plane Graphs.",
                    "Hardness and Algorithms for Variants of Line Graphs of Directed Graphs.",
                    "Performance Guarantees for Scheduling Algorithms under Perturbed Machine Speeds.",
                    "Better Bounds for Online k-Frame Throughput Maximization in Network Switches.",
                    "The Solvable Cases of a Scheduling Algorithm.",
                    "Exact Sublinear Binomial Sampling.",
                    "Trivial, Tractable, Hard. A Not So Sudden Complexity Jump in Neighborhood Restricted CNF Formulas.",
                    "Dynamic Point Labeling is Strongly PSPACE-Complete.",
                    "Unsatisfiable CNF Formulas contain Many Conflicts.",
                    "Pursuit Evasion on Polyhedral Surfaces.",
                    "Algorithms for Tolerated Tverberg Partitions.",
                    "Abstract Voronoi Diagrams with Disconnected Regions.",
                    "Terrain Visibility with Multiple Viewpoints.",
                    "Exact Algorithms for Maximum Independent Set.",
                    "On the Enumeration and Counting of Minimal Dominating sets in Interval and Permutation Graphs.",
                    "Testing Mutual Duality of Planar Graphs.",
                    "Effective and Efficient Data Reduction for the Subset Interconnection Design Problem.",
                    "Myhill-Nerode Methods for Hypergraphs.",
                    "Augmenting Graphs to Minimize the Diameter.",
                    "Top-k Document Retrieval in Compact Space and Near-Optimal Time.",
                    "Faster, Space-Efficient Selection Algorithms in Read-Only Memory for Integers.",
                    "Trajectory-Based Dynamic Map Labeling.",
                    "Asynchronous Rumor Spreading on Random Graphs.",
                    "Unit Cost Buyback Problem.",
                    "Faster Rumor Spreading with Multiple Calls.",
                    "Approximating the Value of a Concurrent Reachability Game in the Polynomial Time Hierarchy.",
                    "Computing a Walrasian Equilibrium in Iterative Auctions with Multiple Differentiated Items.",
                    "New Results on the Online Pricing Problem.",
                    "RAM-Efficient External Memory Sorting.",
                    "Succinct Data Structures for Representing Equivalence Classes.",
                    "Sliding Bloom Filters.",
                    "Vertex-Weighted Matching in Two-Directional Orthogonal Ray Graphs.",
                    "Bounded Representations of Interval and Proper Interval Graphs.",
                    "Detecting and Counting Small Pattern Graphs.",
                    "An O *(1.1939 n ) Time Algorithm for Minimum Weighted Dominating Induced Matching.",
                    "New Inapproximability Bounds for TSP.",
                    "Smoothed Analysis of the 2-Opt Heuristic for the TSP: Polynomial Bounds for Gaussian Noise.",
                    "Tight Approximation Bounds for Connectivity with a Color-Spanning Set.",
                    "The Train Delivery Problem Revisited.",
                    "The Distance 4-Sector of Two Points Is Unique.",
                    "The Number of Different Unfoldings of Polyhedra.",
                    "Computing the Smallest Color-Spanning Axis-Parallel Square.",
                    "Euclidean Traveling Salesman Tours through Stochastic Neighborhoods.",
                    "Detecting and Characterizing Small Dense Bipartite-Like Subgraphs by the Bipartiteness Ratio Measure.",
                    "Approximate Čech Complex in Low and High Dimensions.",
                    "Model Counting for Formulas of Bounded Clique-Width.",
                    "Computing Plurality Points and Condorcet Points in Euclidean Space.",
                    "Computing Minimum Tile Sets to Self-Assemble Color Patterns.",
                    "A Probabilistic Analysis of Kademlia Networks.",
                    "Approximating the Generalized Minimum Manhattan Network Problem.",
                    "Minmax Regret 1-Facility Location on Uncertain Path Networks."
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "23rd ISAAC 2012",
        "info": "Taipei, Taiwan",
        "venues": [
            {
                "sub_name_abbr": "conf/isaac/2012",
                "sub_name": "Algorithms and Computation - 23rd International Symposium, ISAAC 2012, Taipei, Taiwan, December 19-21, 2012. Proceedings.",
                "count": 71,
                "papers": [
                    "Future Directions in Computer Science Research.",
                    "Combinatorial Geometry and Approximation Algorithms.",
                    "Origami Robots and Star Trek Replicators.",
                    "Strong Conflict-Free Coloring for Intervals.",
                    "Closing Complexity Gaps for Coloring Problems on H-Free Graphs.",
                    "Randomly Coloring Regular Bipartite Graphs and Graphs with Bounded Common Neighbors.",
                    "Reconfiguration of List L(2, 1)-Labelings in a Graph.",
                    "An 8/3 Lower Bound for Online Dynamic Bin Packing.",
                    "Computing k-center over Streaming Data for Small k.",
                    "Precision vs Confidence Tradeoffs for ℓ2-Based Frequency Estimation in Data Streams.",
                    "Competitive Design and Analysis for Machine-Minimizing Job Scheduling Problem.",
                    "A Partially Ordered Structure and a Generalization of the Canonical Partition for General Graphs with Perfect Matchings.",
                    "Fast and Simple Fully-Dynamic Cut Tree Construction.",
                    "Green Scheduling, Flows and Matchings.",
                    "Popular and Clan-Popular b-Matchings.",
                    "Kernelization and Parameterized Complexity of Star Editing and Union Editing.",
                    "On the Advice Complexity of Buffer Management.",
                    "On the Complexity of the Maximum Common Subgraph Problem for Partial k-Trees of Bounded Degree.",
                    "Speeding Up Shortest Path Algorithms.",
                    "How Many Potatoes Are in a Mesh?",
                    "On Higher Order Voronoi Diagrams of Line Segments.",
                    "On the Farthest Line-Segment Voronoi Diagram.",
                    "Computing the Longest Common Subsequence of Two Run-Length Encoded Strings.",
                    "Efficient Counting of Square Substrings in a Tree.",
                    "A General Method for Improving Insertion-Based Adaptive Sorting.",
                    "Counting Partitions of Graphs.",
                    "Constant Unary Constraints and Symmetric Real-Weighted Counting CSPs.",
                    "Interval Scheduling and Colorful Independent Sets.",
                    "More on a Problem of Zarankiewicz.",
                    "Efficient Dominating and Edge Dominating Sets for Graphs and Hypergraphs.",
                    "On the Hyperbolicity of Small-World and Tree-Like Random Graphs.",
                    "On the Neighbourhood Helly of Some Graph Classes and Applications to the Enumeration of Minimal Dominating Sets.",
                    "Induced Immersions.",
                    "Rectilinear Covering for Imprecise Input Points - (Extended Abstract).",
                    "Robust Nonparametric Data Approximation of Point Sets via Data Reduction.",
                    "Optimal Point Movement for Covering Circular Regions.",
                    "Solving Circular Integral Block Decomposition in Polynomial Time.",
                    "The Canadian Traveller Problem Revisited.",
                    "Vehicle Scheduling on a Graph Revisited.",
                    "A 4.31-Approximation for the Geometric Unique Coverage Problem on Unit Disks.",
                    "The Minimum Vulnerability Problem.",
                    "A Strongly Polynomial Time Algorithm for the Shortest Path Problem on Coherent Planar Periodic Graphs.",
                    "Cubic Augmentation of Planar Graphs.",
                    "On the Number of Upward Planar Orientations of Maximal Planar Graphs.",
                    "Universal Point Subsets for Planar Graphs.",
                    "Abstract Flows over Time: A First Step towards Solving Dynamic Packing Problems.",
                    "Extending Partial Representations of Subclasses of Chordal Graphs.",
                    "Isomorphism for Graphs of Bounded Connected-Path-Distance-Width.",
                    "Algorithmic Aspects of the Intersection and Overlap Numbers of a Graph.",
                    "Linear Layouts in Submodular Systems.",
                    "Segmental Mapping and Distance for Rooted Labeled Ordered Trees.",
                    "Detecting Induced Minors in AT-Free Graphs.",
                    "Degree-Constrained Orientations of Embedded Graphs.",
                    "Interval Graph Representation with Given Interval and Intersection Lengths.",
                    "Finger Search in the Implicit Model.",
                    "A Framework for Succinct Labeled Ordinal Trees over Large Alphabets.",
                    "A Space-Efficient Framework for Dynamic Point Location.",
                    "Selection in the Presence of Memory Faults, with Applications to In-place Resilient Sorting.",
                    "An Improved Algorithm for Static 3D Dominance Reporting in the Pointer Machine.",
                    "The Multi-Service Center Problem.",
                    "Computing Minmax Regret 1-Median on a Tree Network with Positive/Negative Vertex Weights.",
                    "Fence Patrolling by Mobile Agents with Distinct Speeds.",
                    "Weak Visibility Queries of Line Segments in Simple Polygons.",
                    "Beyond Homothetic Polygons: Recognition and Maximum Clique.",
                    "Area Bounds of Rectilinear Polygons Realized by Angle Sequences.",
                    "A Time-Efficient Output-Sensitive Quantum Algorithm for Boolean Matrix Multiplication.",
                    "On Almost Disjunct Matrices for Group Testing.",
                    "Parameterized Clique on Scale-Free Networks.",
                    "Multi-unit Auctions with Budgets and Non-uniform Valuations.",
                    "Efficient Computation of Power Indices for Weighted Majority Games.",
                    "Revenue Maximization in a Bayesian Double Auction Market."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "22nd ISAAC 2011",
        "info": "Yokohama, Japan",
        "venues": [
            {
                "sub_name_abbr": "conf/isaac/2011",
                "sub_name": "Algorithms and Computation - 22nd International Symposium, ISAAC 2011, Yokohama, Japan, December 5-8, 2011. Proceedings.",
                "count": 78,
                "papers": [
                    "Algorithm Engineering for Route Planning - An Update -.",
                    "Semidefinite Programming and Approximation Algorithms: A Survey.",
                    "The School Bus Problem on Trees.",
                    "Improved Approximations for Buy-at-Bulk and Shallow-Light k-Steiner Trees and (k, 2)-Subgraph.",
                    "Improved Approximation Algorithms for Routing Shop Scheduling.",
                    "Contraction-Based Steiner Tree Approximations in Practice.",
                    "Covering and Piercing Disks with Two Centers.",
                    "Generating Realistic Roofs over a Rectilinear Polygon.",
                    "Computing the Visibility Polygon Using Few Variables.",
                    "Minimizing Interference in Ad-Hoc Networks with Bounded Communication Radius.",
                    "Hamiltonian Paths in the Square of a Tree.",
                    "Dominating Induced Matchings for P 7-free Graphs in Linear Time.",
                    "Finding Contractions and Induced Minors in Chordal Graphs via Disjoint Paths.",
                    "Recognizing Polar Planar Graphs Using New Results for Monopolarity.",
                    "Robustness of Minimum Cost Arborescences.",
                    "Path Queries in Weighted Trees.",
                    "Dynamic Range Majority Data Structures.",
                    "Dynamic Range Selection in Linear Space.",
                    "A Dynamic Stabbing-Max Data Structure with Sub-Logarithmic Query Time.",
                    "Encoding 2D Range Maximum Queries.",
                    "Diameter and Broadcast Time of Random Geometric Graphs in Arbitrary Dimensions.",
                    "Broadcasting in Heterogeneous Tree Networks with Uncertainty.",
                    "Optimal File Distribution in Peer-to-Peer Networks.",
                    "Animal Testing.",
                    "Cutting Out Polygons with a Circular Saw.",
                    "Fast Fréchet Queries.",
                    "Angle-Restricted Steiner Arborescences for Flow Map Layout.",
                    "Treemaps with Bounded Aspect Ratio.",
                    "Simultaneous Embedding of Embedded Planar Graphs.",
                    "Linear-Time Algorithms for Hole-Free Rectilinear Proportional Contact Graph Representations.",
                    "Fully Retroactive Approximate Range and Nearest Neighbor Searching.",
                    "Compact Representation of Posets.",
                    "Explicit Array-Based Compact Data Structures for Triangulations.",
                    "Space-Efficient Data-Analysis Queries on Grids.",
                    "A Polynomial Kernel for Feedback Arc Set on Bipartite Tournaments.",
                    "Fixed-Parameter Complexity of Feedback Vertex Set in Bipartite Tournaments.",
                    "Parameterized Algorithms for Inclusion of Linear Matchings.",
                    "Computational Study on Bidimensionality Theory Based Algorithm for Longest Path Problem.",
                    "Sorting, Searching, and Simulation in the MapReduce Framework.",
                    "External-Memory Multimaps.",
                    "External Memory Orthogonal Range Reporting with Fast Updates.",
                    "Analysis of Speedups in Parallel Evolutionary Algorithms for Combinatorial Optimization - (Extended Abstract).",
                    "Verifying Nash Equilibria in PageRank Games on Undirected Web Graphs.",
                    "Improved Collaborative Filtering.",
                    "Asymptotic Modularity of Some Graph Classes.",
                    "Program Size and Temperature in Self-Assembly.",
                    "Optimization, Randomized Approximability, and Boolean Constraint Satisfaction Problems.",
                    "Lower Bounds for Myopic DPLL Algorithms with a Cut Heuristic.",
                    "Algorithm for Single Allocation Problem on Hub-and-Spoke Networks in 2-Dimensional Plane.",
                    "Packing-Based Approximation Algorithm for the k-Set Cover Problem.",
                    "Capacitated Domination: Constant Factor Approximations for Planar Graphs.",
                    "On Power-Law Distributed Balls in Bins and Its Applications to View Size Estimation.",
                    "A Randomized Algorithm for Finding Frequent Elements in Streams Using O(loglogN) Space.",
                    "A Nearly-Quadratic Gap between Adaptive and Non-adaptive Property Testers - (Extended Abstract).",
                    "Online Linear Optimization over Permutations.",
                    "On the Best Possible Competitive Ratio for Multislope Ski Rental.",
                    "Input-Thrifty Extrema Testing.",
                    "Edit Distance to Monotonicity in Sliding Windows.",
                    "Folding Equilateral Plane Graphs.",
                    "Efficient Algorithms for the Weighted k-Center Problem on a Real Line.",
                    "Outlier Respecting Points Approximation.",
                    "An Improved Algorithm for Reconstructing a Simple Polygon from the Visibility Angles.",
                    "The Parameterized Complexity of Local Search for TSP, More Refined.",
                    "On the Parameterized Complexity of Consensus Clustering.",
                    "Two Fixed-Parameter Algorithms for the Cocoloring Problem.",
                    "Parameterized Complexity of the Firefighter Problem.",
                    "Faster Approximate Pattern Matching in Compressed Repetitive Texts.",
                    "A New Algorithm for the Characteristic String Problem under Loose Similarity Criteria.",
                    "Succinct Indexes for Circular Patterns.",
                    "Range LCP.",
                    "Computing Knapsack Solutions with Cardinality Robustness.",
                    "Max-Throughput for (Conservative) k-of-n Testing.",
                    "Closest Periodic Vectors in L p Spaces.",
                    "Maximum Weight Digital Regions Decomposable into Digital Star-Shaped Regions.",
                    "Finding Maximum Sum Segments in Sequences with Uncertainty.",
                    "Algorithms for Building Consensus MUL-trees.",
                    "Adaptive Phenotype Testing for AND/OR Items.",
                    "An Index Structure for Spaced Seed Search."
                ]
            }
        ]
    },
    {
        "year": "2010",
        "name": "21st ISAAC 2010",
        "info": "Jeju Island, Korea",
        "venues": [
            {
                "sub_name_abbr": "conf/isaac/2010-1",
                "sub_name": "Algorithms and Computation - 21st International Symposium, ISAAC 2010, Jeju Island, Korea, December 15-17, 2010, Proceedings, Part I.",
                "count": 40,
                "papers": [
                    "Regular Labelings and Geometric Structures.",
                    "Algorithmic Aspects of Secure Computation and Communication.",
                    "Faster Algorithms for Feedback Arc Set Tournament, Kemeny Rank Aggregation and Betweenness Tournament.",
                    "A 3/2-Approximation Algorithm for Generalized Steiner Trees in Complete Graphs with Edge Lengths 1 and 2.",
                    "Approximate Periodicity.",
                    "Approximating the Average Stretch Factor of Geometric Graphs.",
                    "Satisfiability with Index Dependency.",
                    "Anonymous Fuzzy Identity-Based Encryption for Similarity Search.",
                    "Improved Randomized Algorithms for 3-SAT.",
                    "Quantum Counterfeit Coin Problems.",
                    "Priority Range Trees.",
                    "Should Static Search Trees Ever Be Unbalanced?",
                    "Levelwise Mesh Sparsification for Shortest Path Queries.",
                    "Unit-Time Predecessor Queries on Massive Data Sets.",
                    "Popularity at Minimum Cost.",
                    "Structural and Complexity Aspects of Line Systems of Graphs.",
                    "Neighbor Systems, Jump Systems, and Bisubmodular Polyhedra.",
                    "Generating Trees on Multisets.",
                    "Seidel Minor, Permutation Graphs and Combinatorial Properties.",
                    "Simultaneous Interval Graphs.",
                    "Unbalanced Graph Partitioning.",
                    "On the Intersection of Tolerance and Cocomparability Graphs.",
                    "Flows in One-Crossing-Minor-Free Graphs.",
                    "From Holant to #CSP and Back: Dichotomy for Holantc Problems.",
                    "Computing Sparse Multiples of Polynomials.",
                    "Fractal Parallelism: Solving SAT in Bounded Space and Time.",
                    "Interpretation of Stream Programs: Characterizing Type 2 Polynomial Time Complexity.",
                    "New Upper Bounds on the Average PTF Density of Boolean Functions.",
                    "An Optimal Algorithm for Computing Angle-Constrained Spanners.",
                    "Approximating Minimum Bending Energy Path in a Simple Corridor.",
                    "Analysis of an Iterated Local Search Algorithm for Vertex Coloring.",
                    "Bounded Max-colorings of Graphs.",
                    "Parameterized Algorithms for Boxicity.",
                    "On Tractable Cases of Target Set Selection.",
                    "Combining Two Worlds: Parameterised Approximation for Vertex Cover.",
                    "Listing All Maximal Cliques in Sparse Graphs in Near-Optimal Time.",
                    "Lower Bounds for Howard's Algorithm for Finding Minimum Mean-Cost Cycles.",
                    "Solving Two-Stage Stochastic Steiner Tree Problems by Two-Stage Branch-and-Cut.",
                    "An Optimal Algorithm for Single Maximum Coverage Location on Trees and Related Problems.",
                    "A Faster Algorithm for the Maximum Even Factor Problem."
                ]
            },
            {
                "sub_name_abbr": "conf/isaac/2010-2",
                "sub_name": "Algorithms and Computation - 21st International Symposium, ISAAC 2010, Jeju Island, Korea, December 15-17, 2010, Proceedings, Part II.",
                "count": 39,
                "papers": [
                    "D2-Tree: A New Overlay with Deterministic Bounds.",
                    "Efficient Indexes for the Positional Pattern Matching Problem and Two Related Problems over Small Alphabets.",
                    "Dynamic Range Reporting in External Memory.",
                    "A Cache-Oblivious Implicit Dictionary with the Working Set Property.",
                    "The (p, q)-total Labeling Problem for Trees.",
                    "Drawing a Tree as a Minimum Spanning Tree Approximation.",
                    "k-cyclic Orientations of Graphs.",
                    "Improved Bounds on the Planar Branchwidth with Respect to the Largest Grid Minor Size.",
                    "Maximum Overlap of Convex Polytopes under Translation.",
                    "Approximate Shortest Homotopic Paths in Weighted Regions.",
                    "Spanning Ratio and Maximum Detour of Rectilinear Paths in the L1 Plane.",
                    "Approximation and Hardness Results for the Maximum Edge q-coloring Problem.",
                    "3-Colouring AT-Free Graphs in Polynomial Time.",
                    "On Coloring Graphs without Induced Forests.",
                    "On the Approximability of the Maximum Interval Constrained Coloring Problem.",
                    "Approximability of Constrained LCS.",
                    "Approximation Algorithms for the Multi-Vehicle Scheduling Problem.",
                    "On Greedy Algorithms for Decision Trees.",
                    "Single and Multiple Device DSA Problem, Complexities and Online Algorithms.",
                    "The Onion Diagram: A Voronoi-Like Tessellation of a Planar Line Space and Its Applications - (Extended Abstract).",
                    "Improved Online Algorithms for 1-Space Bounded 2-Dimensional Bin Packing.",
                    "On the Continuous CNN Problem.",
                    "Policies for Periodic Packet Routing.",
                    "Increasing Speed Scheduling and Flow Scheduling.",
                    "A Tighter Analysis of Work Stealing.",
                    "Approximating the Traveling Tournament Problem with Maximum Tour Length 2.",
                    "Alphabet Partitioning for Compressed Rank/Select and Applications.",
                    "Entropy-Bounded Representation of Point Grids.",
                    "Identifying Approximate Palindromes in Run-Length Encoded Strings.",
                    "Minimum Cost Partitions of Trees with Supply and Demand.",
                    "Computing the (t, k)-Diagnosability of Component-Composition Graphs and Its Application.",
                    "Why Depth-First Search Efficiently Identifies Two and Three-Connected Graphs.",
                    "Beyond Good Shapes: Diffusion-Based Graph Partitioning Is Relaxed Cut Optimization.",
                    "Induced Subgraph Isomorphism on Interval and Proper Interval Graphs.",
                    "Testing Simultaneous Planarity When the Common Graph Is 2-Connected.",
                    "Computing the Discrete Fréchet Distance with Imprecise Input.",
                    "Connectivity Graphs of Uncertainty Regions.",
                    "pi/2-Angle Yao Graphs Are Spanners.",
                    "Identifying Shapes Using Self-assembly - (Extended Abstract)."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "20th ISAAC 2009",
        "info": "Honolulu, Hawaii, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/isaac/2009",
                "sub_name": "Algorithms and Computation, 20th International Symposium, ISAAC 2009, Honolulu, Hawaii, USA, December 16-18, 2009. Proceedings.",
                "count": 122,
                "papers": [
                    "Bubblesort and Juggling Sequences.",
                    "A Proof of the Molecular Conjecture.",
                    "Exact Algorithms for Dominating Clique Problems.",
                    "Enumerating Stereoisomers of Tree Structured Molecules Using Dynamic Programming.",
                    "Exact Algorithms for the Bottleneck Steiner Tree Problem.",
                    "Exact Algorithms for Set Multicover and Multiset Multicover Problems.",
                    "Practical Discrete Unit Disk Cover Using an Exact Line-Separable Algorithm.",
                    "Divide-and-Conquer Algorithms for Partitioning Hypergraphs and Submodular Systems.",
                    "On Protein Structure Alignment under Distance Constraint.",
                    "A Structural Lemma in 2-Dimensional Packing, and Its Implications on Approximability.",
                    "Max-Coloring Paths: Tight Bounds and Extensions.",
                    "Fréchet Distance Problems in Weighted Regions.",
                    "The Complexity of Solving Stochastic Games on Graphs.",
                    "Computational Complexity of Cast Puzzles.",
                    "New Bounds on the Average Distance from the Fermat-Weber Center of a Planar Convex Body.",
                    "Reconstructing Numbers from Pairwise Function Values.",
                    "Hilbert's Thirteenth Problem and Circuit Complexity.",
                    "Interval Stabbing Problems in Small Integer Ranges.",
                    "Online Sorted Range Reporting.",
                    "Data Structures for Approximate Orthogonal Range Counting.",
                    "Dynamic 3-Sided Planar Range Queries with Expected Doubly Logarithmic Time.",
                    "Untangled Monotonic Chains and Adaptive Range Search.",
                    "Geodesic Spanners on Polyhedral Surfaces.",
                    "Approximating Points by a Piecewise Linear Function: I.",
                    "Approximating Points by a Piecewise Linear Function: II. Dealing with Outliers.",
                    "Computing the Map of Geometric Minimal Cuts.",
                    "On the Camera Placement Problem.",
                    "Graph Orientations with Set Connectivity Requirements.",
                    "A Linear Vertex Kernel for Maximum Internal Spanning Tree.",
                    "Geometric Minimum Diameter Minimum Cost Spanning Tree Problem.",
                    "On Shortest Disjoint Paths in Planar Graphs.",
                    "An Optimal Labeling for Node Connectivity.",
                    "SOFA: Strategyproof Online Frequency Allocation for Multihop Wireless Networks.",
                    "1-Bounded Space Algorithms for 2-Dimensional Bin Packing.",
                    "On the Advice Complexity of Online Problems.",
                    "Online Knapsack Problems with Limited Cuts.",
                    "Online paging for flash memory devices.",
                    "Shifting Strategy for Geometric Graphs without Geometry.",
                    "Approximation Algorithms for Variable Voltage Processors: Min Energy, Max Throughput and Online Heuristics.",
                    "Approximation Algorithms for Min-Max Path Cover Problems with Service Handling Time.",
                    "Minimum Covering with Travel Cost.",
                    "Route-Enabling Graph Orientation Problems.",
                    "Complexity of Approximating the Vertex Centroid of a Polyhedron.",
                    "Popular Matchings with Variable Job Capacities.",
                    "On the Tightness of the Buhrman-Cleve-Wigderson Simulation.",
                    "Bounds on Contention Management Algorithms.",
                    "Algorithmic Folding Complexity.",
                    "Min-Energy Scheduling for Aligned Jobs in Accelerate Model.",
                    "Posi-modular Systems with Modulotone Requirements under Permutation Constraints.",
                    "Generalized Reduction to Compute Toric Ideals.",
                    "Linear and Sublinear Time Algorithms for Basis of Abelian Groups.",
                    "Good Programming in Transactional Memory.",
                    "Induced Packing of Odd Cycles in a Planar Graph.",
                    "On the Infinitesimal Rigidity of Bar-and-Slider Frameworks.",
                    "Exploration of Periodically Varying Graphs.",
                    "Parameterized Complexity of Arc-Weighted Directed Steiner Problems.",
                    "Worst Case Analysis for Pickup and Delivery Problems with Consecutive Pickups and Deliveries.",
                    "Minimum Cycle Bases of Weighted Outerplanar Graphs.",
                    "Bandwidth on AT-Free Graphs.",
                    "Editing Graphs into Disjoint Unions of Dense Clusters.",
                    "A Certifying Algorithm for 3-Colorability of P5-Free Graphs.",
                    "Parameterizing Cut Sets in a Graph by the Number of Their Components.",
                    "Inapproximability of Maximal Strip Recovery.",
                    "The Complexity of Perfect Matching Problems on Dense Hypergraphs.",
                    "On Lower Bounds for Constant Width Arithmetic Circuits.",
                    "Spending Is Not Easier Than Trading: On the Computational Equivalence of Fisher and Arrow-Debreu Equilibria.",
                    "The Identity Correspondence Problem and Its Applications.",
                    "Fast Distributed Approximation Algorithm for the Maximum Matching Problem in Bounded Arboricity Graphs.",
                    "An Improved Approximation Algorithm for the Traveling Tournament Problem.",
                    "The Fault-Tolerant Facility Allocation Problem.",
                    "Tighter Approximation Bounds for Minimum CDS in Wireless Ad Hoc Networks.",
                    "Maximal Strip Recovery Problem with Gaps: Hardness and Approximation Algorithms.",
                    "The Directed Hausdorff Distance between Imprecise Point Sets.",
                    "Computing Multidimensional Persistence.",
                    "Locating an Obnoxious Line among Planar Objects.",
                    "Finding Fullerene Patches in Polynomial Time.",
                    "Convex Drawings of Internally Triconnected Plane Graphs on O(n2) Grids.",
                    "A Self-stabilizing and Local Delaunay Graph Construction.",
                    "Succinct Greedy Geometric Routing in the Euclidean Plane.",
                    "Electric Routing and Concurrent Flow Cutting.",
                    "A Polynomial-Time Algorithm for the Universally Quickest Transshipment Problem in a Certain Class of Dynamic Networks with Uniform Path-Lengths.",
                    "Strong Robustness of Randomized Rumor Spreading Protocols.",
                    "Data Structures for Range Median Queries.",
                    "Deletion without Rebalancing in Multiway Search Trees.",
                    "Counting in the Presence of Memory Faults.",
                    "A Simple, Fast, and Compact Static Dictionary.",
                    "Reconstructing Polygons from Scanner Data.",
                    "Computing Large Matchings in Planar Graphs with Fixed Minimum Degree.",
                    "Crossing-Free Acyclic Hamiltonian Path Completion for Planar st-Digraphs.",
                    "Covering a Graph with a Constrained Forest (Extended Abstract).",
                    "Tri-Edge-Connectivity Augmentation for Planar Straight Line Graphs.",
                    "Upward Star-Shaped Polyhedral Graphs.",
                    "Conditional Hardness of Approximating Satisfiable Max 3CSP-q.",
                    "The Roles of Advice to One-Tape Linear-Time Turing Machines and Finite Automata (Extended Abstract).",
                    "Of Choices, Failures and Asynchrony: The Many Faces of Set Agreement.",
                    "Step-Assembly with a Constant Number of Tile Types.",
                    "Lower Bounds on Fast Searching.",
                    "Approximation Algorithms for the Firefighter Problem: Cuts over Time and Submodularity.",
                    "Constant-Factor Approximations of Branch-Decomposition and Largest Grid Minor of Planar Graphs in O(n1 + ε) Time.",
                    "PTAS for k-Tour Cover Problem on the Plane for Moderately Large Values of k.",
                    "Optimal Randomized Algorithm for the Density Selection Problem.",
                    "New Results on Simple Stochastic Games.",
                    "Worst-Case and Smoothed Analysis of k-Means Clustering with Bregman Divergences.",
                    "Succinct Index for Dynamic Dictionary Matching.",
                    "Range Non-overlapping Indexing.",
                    "Querying Two Boundary Points for Shortest Paths in a Polygonal Domain.",
                    "Pattern Matching for 321-Avoiding Permutations.",
                    "Folding a Better Checkerboard.",
                    "Finding All Approximate Gapped Palindromes.",
                    "General Pseudo-random Generators from Weaker Models of Computation.",
                    "Random Generation and Enumeration of Bipartite Permutation Graphs.",
                    "A Combinatorial Algorithm for Horn Programs.",
                    "Online Maximum Directed Cut.",
                    "Maintaining Nets and Net Trees under Incremental Motion.",
                    "Distributed Scheduling of Parallel Hybrid Computations.",
                    "I/O-Efficient Contour Tree Simplification.",
                    "Algorithms for Computing the Maximum Weight Region Decomposable into Elementary Shapes.",
                    "I/O and Space-Efficient Path Traversal in Planar Graphs.",
                    "Improved Algorithms for Finding Consistent Superstrings Based on a New Graph Model.",
                    "Two-Vertex Connectivity Augmentations for Graphs with a Partition Constraint (Extended Abstract).",
                    "Computing a Smallest Multi-labeled Phylogenetic Tree from Rooted Triplets.",
                    "On Partitioning a Graph into Two Connected Subgraphs."
                ]
            }
        ]
    },
    {
        "year": "2008",
        "name": "19th ISAAC 2008",
        "info": "Gold Coast, Australia",
        "venues": [
            {
                "sub_name_abbr": "conf/isaac/2008",
                "sub_name": "Algorithms and Computation, 19th International Symposium, ISAAC 2008, Gold Coast, Australia, December 15-17, 2008. Proceedings.",
                "count": 81,
                "papers": [
                    "Constant-Working-Space Algorithms: How Fast Can We Solve Problems without Using Any Extra Array?.",
                    "Some Constrained Notions of Planarity.",
                    "Reachability Problems on Directed Graphs.",
                    "Greedy Construction of 2-Approximation Minimum Manhattan Network.",
                    "The Complexity of Minimum Convex Coloring.",
                    "On the Complexity of Reconfiguration Problems.",
                    "Multiobjective Disk Cover Admits a PTAS.",
                    "Data Stream Algorithms via Expander Graphs.",
                    "Improving the Competitive Ratio of the Online OVSF Code Assignment Problem.",
                    "Optimal Key Tree Structure for Deleting Two or More Leaves.",
                    "Comparing First-Fit and Next-Fit for Online Edge Coloring.",
                    "Selecting Sums in Arrays.",
                    "Succinct and I/O Efficient Data Structures for Traversal in Trees.",
                    "Space-Time Tradeoffs for Longest-Common-Prefix Array Computation.",
                    "Power Domination in O*(1.7548n) Using Reference Search Trees.",
                    "The Isolation Game: A Game of Distances.",
                    "On a Non-cooperative Model for Wavelength Assignment in Multifiber Optical Networks.",
                    "The Complexity of Rationalizing Matchings.",
                    "A Game Theoretic Approach for Efficient Graph Coloring.",
                    "Partitioning a Weighted Tree to Subtrees of Almost Uniform Size.",
                    "An Improved Divide-and-Conquer Algorithm for Finding All Minimum k-Way Cuts.",
                    "On the Algorithmic Effectiveness of Digraph Decompositions and Complexity Measures.",
                    "An Efficient Scaling Algorithm for the Minimum Weight Bibranching Problem.",
                    "The Balanced Edge Cover Problem.",
                    "Firefighting on Trees: (1-1/e)-Approximation, Fixed Parameter Tractability and a Subexponential Algorithm.",
                    "A New Algorithm for Finding Trees with Many Leaves.",
                    "Faster Parameterized Algorithms for Minimum Fill-In.",
                    "Graph Layout Problems Parameterized by Vertex Cover.",
                    "A Linear Kernel for the k-Disjoint Cycle Problem on Planar Graphs.",
                    "How to Guard a Graph?.",
                    "Tree Decontamination with Temporary Immunity.",
                    "Reconfiguration of Cube-Style Modular Robots Using O(logn) Parallel Moves.",
                    "Squaring the Circle with Weak Mobile Robots.",
                    "Evaluation of General Set Expressions.",
                    "Computing with Priced Information: When the Value Makes the Price.",
                    "Deductive Inference for the Interiors and Exteriors of Horn Theories.",
                    "Leaf Powers and Their Properties: Using the Trees.",
                    "Deterministic Sparse Column Based Matrix Reconstruction via Greedy Approximation of SVD.",
                    "Minimizing Total Flow-Time: The Unrelated Case.",
                    "Approximating the Volume of Unions and Intersections of High-Dimensional Geometric Objects.",
                    "Space-Efficient Informational Redundancy.",
                    "Minkowski Sum Selection and Finding.",
                    "Constructing the Simplest Possible Phylogenetic Network from Triplets.",
                    "New Results on Optimizing Rooted Triplets Consistency.",
                    "A Method to Overcome Computer Word Size Limitation in Bit-Parallel Pattern Matching.",
                    "Inducing Polygons of Line Arrangements.",
                    "Free-Form Surface Partition in 3-D.",
                    "Approximate Nearest Neighbor Search under Translation Invariant Hausdorff Distance.",
                    "Preprocessing Imprecise Points and Splitting Triangulations.",
                    "Efficient Output-Sensitive Construction of Reeb Graphs.",
                    "Signature Theory in Holographic Algorithms.",
                    "The Complexity of SPP Formula Minimization.",
                    "Understanding a Non-trivial Cellular Automaton by Finding Its Simplest Underlying Communication Protocol.",
                    "Negation-Limited Inverters of Linear Size.",
                    "3-Message NP Arguments in the BPK Model with Optimal Soundness and Zero-Knowledge.",
                    "A Complete Approximation Algorithm for Shortest Bounded-Curvature Paths.",
                    "Detecting Commuting Patterns by Clustering Subtrajectories.",
                    "On the Stretch Factor of Convex Delaunay Graphs.",
                    "Covering a Simple Polygon by Monotone Directions.",
                    "On the Stability of Web Crawling and Web Search.",
                    "Average Update Times for Fully-Dynamic All-Pairs Shortest Paths.",
                    "Computing Frequency Dominators and Related Problems.",
                    "Computing Best Swaps in Optimal Tree Spanners.",
                    "Covering a Point Set by Two Disjoint Rectangles.",
                    "Computing the Maximum Detour of a Plane Graph in Subquadratic Time.",
                    "Finding Long Paths, Cycles and Circuits.",
                    "Computing Best and Worst Shortcuts of Graphs Embedded in Metric Spaces.",
                    "On Labeled Traveling Salesman Problems.",
                    "Navigating in a Graph by Aid of Its Spanning Tree.",
                    "Single Vehicle Scheduling Problems on Path/Tree/Cycle Networks with Release and Handling Times.",
                    "Bidirectional Core-Based Routing in Dynamic Time-Dependent Road Networks.",
                    "Bandwidth of Bipartite Permutation Graphs.",
                    "König Deletion Sets and Vertex Covers above the Matching Size.",
                    "Independent Sets of Maximum Weight in Apple-Free Graphs.",
                    "Enumeration of Perfect Sequences of Chordal Graph.",
                    "From Tree-Width to Clique-Width: Excluding a Unit Interval Graph.",
                    "New Results on the Most Significant Bit of Integer Multiplication.",
                    "Sorting with Complete Networks of Stacks.",
                    "Quantum Query Complexity of Boolean Functions with Small On-Sets.",
                    "Unbounded-Error Quantum Query Complexity.",
                    "Super-Exponential Size Advantage of Quantum Finite Automata with Mixed States."
                ]
            }
        ]
    },
    {
        "year": "2007",
        "name": "18th ISAAC 2007",
        "info": "Sendai, Japan",
        "venues": [
            {
                "sub_name_abbr": "conf/isaac/2007",
                "sub_name": "Algorithms and Computation, 18th International Symposium, ISAAC 2007, Sendai, Japan, December 17-19, 2007, Proceedings.",
                "count": 79,
                "papers": [
                    "Modeling and Analyzing Massive Terrain Data Sets.",
                    "Coloring Triangle-Free Graphs on Surfaces.",
                    "Integer Representation and Counting in the Bit Probe Model.",
                    "Minimum Degree Orderings.",
                    "Greedy Approximation for Source Location Problem with Vertex-Connectivity Requirements in Undirected Graphs.",
                    "Dynamic Distance Hereditary Graphs Using Split Decomposition.",
                    "Unifying Two Graph Decompositions with Modular Decomposition.",
                    "Escaping Off-Line Searchers and a Discrete Isoperimetric Theorem.",
                    "Geometric Spanner of Segments.",
                    "Dilation-Optimal Edge Deletion in Polygonal Cycles.",
                    "Unbounded-Error Classical and Quantum Communication Complexity.",
                    "A Spectral Method for MAX2SAT in the Planted Solution Model.",
                    "On the Expressive Power of Planar Perfect Matching and Permanents of Bounded Treewidth Matrices.",
                    "The 1-Versus-2 Queries Problem Revisited.",
                    "Approximating the Crossing Number of Toroidal Graphs.",
                    "Width-Optimal Visibility Representations of Plane Graphs.",
                    "Computing Upward Topological Book Embeddings of Upward Planar Digraphs.",
                    "Algorithms for the Hypergraph and the Minor Crossing Number Problems.",
                    "On Mixing and Edge Expansion Properties in Randomized Broadcasting.",
                    "Linear Reconfiguration of Cube-Style Modular Robots.",
                    "Fast Message Dissemination in Random Geometric Ad-Hoc Radio Networks.",
                    "Sensor Network Gossiping or How to Break the Broadcast Lower Bound.",
                    "On the Complexity of the \"Most General\" Undirected Firing Squad Synchronization Problem.",
                    "Capacitated Domination Problem.",
                    "The Complexity of Finding Subgraphs Whose Matching Number Equals the Vertex Cover Number.",
                    "New Bounds for the Nearly Equitable Edge Coloring Problem.",
                    "Approximation to the Minimum Cost Edge Installation Problem.",
                    "Approximability of Packing Disjoint Cycles.",
                    "Succinct Representation of Labeled Graphs.",
                    "More Efficient Algorithms and Analyses for Unequal Letter Cost Prefix-Free Coding.",
                    "Kinetic Maintenance of Mobile k-Centres on Trees.",
                    "Checking Value-Sensitive Data Structures in Sublinear Space.",
                    "Manipulation in Games.",
                    "Using Nash Implementation to Achieve Better Frugality Ratios.",
                    "The Price of Nash Equilibria in Multicast Transmissions Games.",
                    "An Efficient Algorithm for Enumerating Pseudo Cliques.",
                    "Fast Adaptive Diagnosis with a Minimum Number of Tests.",
                    "Dynamic Structures for Top- k Queries on Uncertain Data.",
                    "Separating Populations with Wide Data: A Spectral Analysis.",
                    "A Constant-Competitive Algorithm for Online OVSF Code Assignment.",
                    "Average-Case Analysis of Online Topological Ordering.",
                    "Energy Efficient Deadline Scheduling in Two Processor Systems.",
                    "On the Relative Dominance of Paging Algorithms.",
                    "I/O-Efficient Map Overlay and Point Location in Low-Density Subdivisions.",
                    "Geometric Streaming Algorithms with a Sorting Primitive.",
                    "External Memory Range Reporting on a Grid.",
                    "Approximate Range Searching in External Memory.",
                    "Faster Treasure Hunt and Better Strongly Universal Exploration Sequences.",
                    "Hardness and Approximation of Traffic Grooming.",
                    "Depth of Field and Cautious-Greedy Routing in Social Networks.",
                    "Locating Facilities on a Network to Minimize Their Average Service Radius.",
                    "Faster Combinatorial Algorithms for Determinant and Pfaffian.",
                    "A Polynomial-Time-Delay and Polynomial-Space Algorithm for Enumeration Problems in Multi-criteria Optimization.",
                    "The Parameterized Complexity of the Unique Coverage Problem.",
                    "Bounded Tree-Width and CSP-Related Problems.",
                    "Covering Points by Unit Disks of Fixed Location.",
                    "Geodesic Disks and Clustering in a Simple Polygon.",
                    "An O ( n 2log n ) Time Algorithm for Computing Shortest Paths Amidst Growing Discs in the Plane.",
                    "Optimal Triangulation with Steiner Points.",
                    "New Algorithm for Field Splitting in Radiation Therapy.",
                    "In-Place Algorithm for Image Rotation.",
                    "Higher Order Voronoi Diagrams of Segments for VLSI Critical Area Extraction.",
                    "Distributed Relationship Schemes for Trees.",
                    "Fast Evaluation of Union-Intersection Expressions.",
                    "A Sub-cubic Time Algorithm for the k -Maximum Subarray Problem.",
                    "Compressing Spatio-temporal Trajectories.",
                    "Finding Popular Places.",
                    "Maintaining Extremal Points and Its Applications to Deciding Optimal Orientations.",
                    "The Monomial Ideal Membership Problem and Polynomial Identity Testing.",
                    "On the Fault Testing for Reversible Circuits.",
                    "The Space Complexity of k -Tree Isomorphism.",
                    "Algorithms for Computing the Length-Constrained Max-Score Segments with Applications to DNA Copy Number Data Analysis.",
                    "Space Efficient Indexes for String Matching with Don't Cares.",
                    "2-Stage Fault Tolerant Interval Group Testing.",
                    "Approximate String Matching with Swap and Mismatch.",
                    "Minimum Fill-In and Treewidth of Split+ ke and Split+ kv Graphs.",
                    "Weighted Treewidth Algorithmic Techniques and Results.",
                    "Spanning Trees with Many Leaves in Regular Bipartite Graphs.",
                    "Problem Kernels for NP-Complete Edge Deletion Problems: Split and Related Graphs."
                ]
            }
        ]
    },
    {
        "year": "2006",
        "name": "17th ISAAC 2006",
        "info": "Kolkata, India",
        "venues": [
            {
                "sub_name_abbr": "conf/isaac/2006",
                "sub_name": "Algorithms and Computation, 17th International Symposium, ISAAC 2006, Kolkata, India, December 18-20, 2006, Proceedings.",
                "count": 75,
                "papers": [
                    "Stable Matching Problems.",
                    "Delaunay Meshing of Surfaces.",
                    "Algorithmic Graph Minor Theory: Improved Grid Minor Bounds and Wagner's Contraction.",
                    "Branching and Treewidth Based Exact Algorithms.",
                    "Deterministic Splitter Finding in a Stream with Constant Storage and Guarantees.",
                    "Optimal Algorithms for Tower of Hanoi Problems with Relaxed Placement Rules.",
                    "Flexible Word Design and Graph Labeling.",
                    "Frequency Allocation Problems for Linear Cellular Networks.",
                    "Finite-State Online Algorithms and Their Automated Competitive Analysis.",
                    "Offline Sorting Buffers on Line.",
                    "Approximating Tree Edit Distance Through String Edit Distance.",
                    "A 6-Approximation Algorithm for Computing Smallest Common AoN-Supertree with Application to the Reconstruction of Glycan Trees.",
                    "Improved Approximation for Single-Sink Buy-at-Bulk.",
                    "Approximability of Partitioning Graphs with Supply and Demand.",
                    "Convex Grid Drawings of Plane Graphs with Rectangular Contours.",
                    "Algorithms on Graphs with Small Dominating Targets.",
                    "Efficient Algorithms for Weighted Rank-Maximal Matchings and Related Problems.",
                    "On Estimating Path Aggregates over Streaming Graphs.",
                    "Diamond Triangulations Contain Spanners of Bounded Degree.",
                    "Optimal Construction of the City Voronoi Diagram.",
                    "Relations Between Two Common Types of Rectangular Tilings.",
                    "Quality Tetrahedral Mesh Generation for Macromolecules.",
                    "On Approximating the TSP with Intersecting Neighborhoods.",
                    "Negation-Limited Complexity of Parity and Inverters.",
                    "The Complexity of Quasigroup Isomorphism and the Minimum Generating Set Problem.",
                    "Inverse HAMILTONIAN CYCLE and Inverse 3-D MATCHING Are coNP-Complete.",
                    "Parameterized Problems on Coincidence Graphs.",
                    "On 2-Query Codeword Testing with Near-Perfect Completeness.",
                    "Poketree: A Dynamically Competitive Data Structure with Good Worst-Case Performance.",
                    "Efficient Algorithms for the Optimal-Ratio Region Detection Problems in Discrete Geometry with Applications.",
                    "On Locating Disjoint Segments with Maximum Sum of Densities.",
                    "Two-Tier Relaxed Heaps.",
                    "The Interval Liar Game.",
                    "How Much Independent Should Individual Contacts Be to Form a Small-World?",
                    "Faster Centralized Communication in Radio Networks.",
                    "On the Runtime and Robustness of Randomized Broadcasting.",
                    "Local Search in Evolutionary Algorithms: The Impact of the Local Search Frequency.",
                    "Non-cooperative Facility Location and Covering Games.",
                    "Optimal Algorithms for the Path/Tree-Shaped Facility Location Problems in Trees.",
                    "Multiobjective Optimization: Improved FPTAS for Shortest Paths and Non-linear Objectives with Applications.",
                    "Algorithms for Computing Variants of the Longest Common Subsequence Problem.",
                    "Constructing Labeling Schemes Through Universal Matrices.",
                    "Making Arbitrary Graphs Transitively Orientable: Minimal Comparability Completions.",
                    "Analyzing Disturbed Diffusion on Networks.",
                    "Exact Algorithms for Finding the Minimum Independent Dominating Set in Graphs.",
                    "On Isomorphism and Canonization of Tournaments and Hypertournaments.",
                    "Efficient Algorithms for the Sum Selection Problem and K Maximum Sums Problem.",
                    "Deterministic Random Walks on the Two-Dimensional Grid.",
                    "Improving Time and Space Complexity for Compressed Pattern Matching.",
                    "Improved Multi-unit Auction Clearing Algorithms with Interval (Multiple-Choice) Knapsack Problems.",
                    "A Simple Message Passing Algorithm for Graph Partitioning Problems.",
                    "Minimal Interval Completion Through Graph Exploration.",
                    "Balanced Cut Approximation in Random Geometric Graphs.",
                    "Improved Algorithms for the Minmax-Regret 1-Center Problem.",
                    "On Approximating the Maximum Simple Sharing Problem.",
                    "Approximation Scheme for Lowest Outdegree Orientation and Graph Density Measures.",
                    "Improved Approximation Algorithms for Maximum Resource Bin Packing and Lazy Bin Covering Problems.",
                    "Partitioning the Nodes of a Graph to Minimize the Sum of Subgraph Radii.",
                    "Efficient Prüfer-Like Coding and Counting Labelled Hypertrees.",
                    "Intuitive Algorithms and t-Vertex Cover.",
                    "Politician's Firefighting.",
                    "Runtime Analysis of a Simple Ant Colony Optimization Algorithm.",
                    "Lower Bounds on the Deterministic and Quantum Communication Complexities of Hamming-Distance Problems.",
                    "Resources Required for Preparing Graph States.",
                    "Online Multi-path Routing in a Maze.",
                    "On the On-Line k-Truck Problem with Benefit Maximization.",
                    "Energy-Efficient Broadcast Scheduling for Speed-Controlled Transmission Channels.",
                    "Online Packet Admission and Oblivious Routing in Sensor Networks.",
                    "Field Splitting Problems in Intensity-Modulated Radiation Therapy.",
                    "Shape Rectangularization Problems in Intensity-Modulated Radiation Therapy.",
                    "A New Approximation Algorithm for Multidimensional Rectangle Tiling.",
                    "Tessellation of Quadratic Elements.",
                    "Effective Elections for Anonymous Mobile Agents.",
                    "Gathering Asynchronous Oblivious Mobile Robots in a Ring.",
                    "Provably Secure Steganography and the Complexity of Sampling."
                ]
            }
        ]
    },
    {
        "year": "2005",
        "name": "16th ISAAC 2005",
        "info": "Sanya, Hainan, China",
        "venues": [
            {
                "sub_name_abbr": "conf/isaac/2005",
                "sub_name": "Algorithms and Computation, 16th International Symposium, ISAAC 2005, Sanya, Hainan, China, December 19-21, 2005, Proceedings.",
                "count": 116,
                "papers": [
                    "Algorithmic Problems in Wireless Ad Hoc Networks.",
                    "Probability and Recursion.",
                    "Embedding Point Sets into Plane Graphs of Small Dilation.",
                    "The Layered Net Surface Problems in Discrete Geometry and Medical Image Segmentation.",
                    "Separability with Outliers.",
                    "Casting an Object with a Core.",
                    "Sparse Geometric Graphs with Small Dilation.",
                    "Multiple Polyline to Polygon Matching.",
                    "Minimizing a Monotone Concave Function with Laminar Covering Constraints.",
                    "Almost Optimal Solutions for Bin Coloring Problems.",
                    "GEN-LARAC: A Generalized Approach to the Constrained Shortest Path Problem Under Multiple Additive Constraints.",
                    "Simultaneous Matchings.",
                    "An Optimization Problem Related to VoD Broadcasting.",
                    "A Min-Max Relation on Packing Feedback Vertex Sets.",
                    "Average Case Analysis for Tree Labelling Schemes.",
                    "Revisiting T. Uno and M. Yagiura's Algorithm .",
                    "Generating Cut Conjunctions and Bridge Avoiding Extensions in Graphs.",
                    "Orthogonal Drawings of Series-Parallel Graphs with Minimum Bends.",
                    "Bisecting a Four-Connected Graph with Three Resource Sets.",
                    "Laminar Structure of Ptolemaic Graphs and Its Applications.",
                    "On the Complexity of the G-Reconstruction Problem.",
                    "Hybrid Voting Protocols and Hardness of Manipulation.",
                    "On the Complexity of Rocchio's Similarity-Based Relevance Feedback Algorithm.",
                    "Correlation Clustering and Consensus Clustering.",
                    "An Approximation Algorithm for Scheduling Malleable Tasks Under General Precedence Constraints.",
                    "A 1.5-Approximation of the Minimal Manhattan Network Problem.",
                    "Hardness and Approximation of Octilinear Steiner Trees.",
                    "Dense Subgraph Problems with Output-Density Conditions.",
                    "A Complete Characterization of Tolerable Adversary Structures for Secure Point-to-Point Transmissions Without Feedback.",
                    "Network Game with Attacker and Protector Entities.",
                    "SkipTree: A Scalable Range-Queryable Distributed Data Structure for Multidimensional Data.",
                    "The Phase Matrix.",
                    "ISB-Tree: A New Indexing Scheme with Efficient Expected Behaviour.",
                    "External Data Structures for Shortest Path Queries on Planar Digraphs.",
                    "Improved Approximate String Matching Using Compressed Suffix Data Structures.",
                    "Monitoring Continuous Band-Join Queries over Dynamic Data.",
                    "Approximate Colored Range Queries.",
                    "Complexity and Approximation of the Minimum Recombination Haplotype Configuration Problem.",
                    "Space Efficient Algorithms for Ordered Tree Comparison.",
                    "A 1.75-Approximation Algorithm for Unsigned Translocation Distance.",
                    "Fast Algorithms for Computing the Tripartition-Based Distance Between Phylogenetic Networks.",
                    "Improved Algorithms for Largest Cardinality 2-Interval Pattern Problem.",
                    "Preemptive Semi-online Scheduling on Parallel Machines with Inexact Partial Information.",
                    "On-Line Computation and Maximum-Weighted Hereditary Subgraph Problems.",
                    "A Novel Adaptive Learning Algorithm for Stock Market Prediction.",
                    "Uniformization of Discrete Data.",
                    "A Practical Algorithm for the Computation of Market Equilibrium with Logarithmic Utility Functions.",
                    "Boosting Spectral Partitioning by Sampling and Iteration.",
                    "Smoothed Analysis of Binary Search Trees.",
                    "Simple and Efficient Greedy Algorithms for Hamilton Cycles in Random Intersection Graphs.",
                    "Counting Distinct Items over Update Streams.",
                    "Randomized Algorithm for the Sum Selection Problem.",
                    "An Improved Interval Routing Scheme for Almost All Networks Based on Dominating Cliques.",
                    "Basic Computations in Wireless Networks.",
                    "A Simple Optimal Randomized Algorithm for Sorting on the PDM.",
                    "Efficient Parallel Algorithms for Constructing a k-Tree Center and a k-Tree Core of a Tree Network.",
                    "A Tight Bound on the Number of Mobile Servers to Guarantee the Mutual Transferability Among Dominating Configurations.",
                    "Bounding the Number of Minimal Dominating Sets: A Measure and Conquer Approach.",
                    "Collective Tree Spanners in Graphs with Bounded Genus, Chordality, Tree-Width, or Clique-Width.",
                    "Sampling Unlabeled Biconnected Planar Graphs.",
                    "Configurations with Few Crossings in Topological Graphs.",
                    "On Bounded Load Routings for Modeling k-Regular Connection Topologies.",
                    "On the Complexity of Global Constraint Satisfaction.",
                    "Polynomial Space Suffices for Deciding Nash Equilibria Properties for Extensive Games with Large Trees, .",
                    "An Improved O(1.234m)-Time Deterministic Algorithm for SAT.",
                    "Solving Minimum Weight Exact Satisfiability in Time O(20.2441n).",
                    "Efficient Algorithms for Finding a Longest Common Increasing Subsequence.",
                    "Decision Making Based on Approximate and Smoothed Pareto Curves.",
                    "Computing Optimal Solutions for the min 3-set covering Problem.",
                    "Efficient Algorithms for the Weighted 2-Center Problem in a Cactus Graph.",
                    "Algorithms for Local Forest Similarity.",
                    "Fast Algorithms for Finding Disjoint Subsequences with Extremal Densities.",
                    "A Polynomial Space and Polynomial Delay Algorithm for Enumeration of Maximal Motifs in a Sequence.",
                    "5-th Phylogenetic Root Construction for Strictly Chordal Graphs.",
                    "Recursion Theoretic Operators for Function Complexity Classes.",
                    "From Balls and Bins to Points and Vertices.",
                    "Simulating Undirected st-Connectivity Algorithms on Uniform JAGs and NNJAGs.",
                    "Upper Bounds on the Computational Power of an Optical Model of Computation.",
                    "Complexity of the Min-Max (Regret) Versions of Cut Problems.",
                    "Improved Algorithms for the k Maximum-Sums Problems.",
                    "Network Load Games.",
                    "Minimum Entropy Coloring.",
                    "Algorithms for Max Hamming Exact Satisfiability.",
                    "Counting Stable Strategies in Random Evolutionary Games.",
                    "Exact and Approximation Algorithms for Computing the Dilation Spectrum of Paths, Trees, and Cycles.",
                    "On the Computation of Colored Domino Tilings of Simple and Non-simple Orthogonal Polygons.",
                    "Optimal Paths for Mutually Visible Agents.",
                    "Stacking and Bundling Two Convex Polygons.",
                    "Algorithms for Range-Aggregate Query Problems Involving Geometric Aggregation Operations.",
                    "A (2-c*(1/sqrt(N)))-Approximation Algorithm for the Stable Marriage Problem.",
                    "Approximating the Traffic Grooming Problem.",
                    "Scheduling to Minimize Makespan with Time-Dependent Processing Times.",
                    "On Complexity and Approximability of the Labeled Maximum/Perfect Matching Problems.",
                    "Finding a Weight-Constrained Maximum-Density Subtree in a Tree.",
                    "Finding Two Disjoint Paths in a Network with Normalized alpha+-MIN-SUM Objective Function.",
                    "Sensitivity Analysis of Minimum Spanning Trees in Sub-inverse-Ackermann Time.",
                    "Approximation Algorithms for Layered Multicast Scheduling.",
                    "Minimum Weight Triangulation by Cutting Out Triangles.",
                    "Multi-directional Width-Bounded Geometric Separator and Protein Folding.",
                    "Shortest Paths and Voronoi Diagrams with Transportation Networks Under General Distances.",
                    "Approximation Algorithms for Computing the Earth Mover's Distance Under Transformations.",
                    "Fast k-Means Algorithms with Constant Approximation.",
                    "On Efficient Weighted Rectangle Packing with Large Resources.",
                    "On Routing in VLSI Design and Communication Networks.",
                    "The Capacitated Traveling Salesman Problem with Pickups and Deliveries on a Tree.",
                    "Distance Labeling in Hyperbolic Graphs.",
                    "Multi-source Trees: Algorithms for Minimizing Eccentricity Cost Metrics.",
                    "Edge-Pancyclicity of Twisted Cubes.",
                    "Combinatorial Network Abstraction by Trees and Distances.",
                    "Drawing Phylogenetic Trees.",
                    "Localized and Compact Data-Structure for Comparability Graphs.",
                    "Representation of Graphs by OBDDs.",
                    "Space-Efficient Construction of LZ-Index.",
                    "Longest Increasing Subsequences in Windows Based on Canonical Antichain Partition.",
                    "Pareto Optimality in House Allocation Problems.",
                    "Generalized Geometric Approaches for Leaf Sequencing Problems in Radiation Therapy."
                ]
            }
        ]
    },
    {
        "year": "2004",
        "name": "15th ISAAC 2004",
        "info": "HongKong, China",
        "venues": [
            {
                "sub_name_abbr": "conf/isaac/2004",
                "sub_name": "Algorithms and Computation, 15th International Symposium, ISAAC 2004, Hong Kong, China, December 20-22, 2004, Proceedings.",
                "count": 78,
                "papers": [
                    "Puzzles, Art, and Magic with Algorithms.",
                    "The ABCs of AVDs: Geometric Retrieval Made Simple.",
                    "Pareto Optimality in House Allocation Problems.",
                    "Property-Preserving Data Reconstruction.",
                    "On the Monotone Circuit Complexity of Quadratic Boolean Functions.",
                    "Generalized Function Matching.",
                    "Approximate Distance Oracles for Graphs with Dense Clusters.",
                    "Multicriteria Global Minimum Cuts.",
                    "Polyline Fitting of Planar Points Under Min-sum Criteria.",
                    "A Generalization of Magic Squares with Applications to Digital Halftoning.",
                    "Voronoi Diagrams with a Transportation Network on the Euclidean Plane.",
                    "Structural Alignment of Two RNA Sequences with Lagrangian Relaxation.",
                    "Poly-APX- and PTAS-Completeness in Standard and Differential Approximation.",
                    "Efficient Algorithms for k Maximum Sums.",
                    "Equipartitions of Measures by 2-Fans.",
                    "Augmenting the Edge-Connectivity of a Spider Tree.",
                    "On Nash Equilibria for Multicast Transmissions in Ad-Hoc Wireless Networks.",
                    "Structural Similarity in Graphs (A Relaxation Approach for Role Assignment).",
                    "Flexibility of Steiner Trees in Uniform Orientation Metrics.",
                    "Random Access to Advice Strings and Collapsing Results.",
                    "Bounding the Payment of Approximate Truthful Mechanisms.",
                    "The Polymatroid Steiner Problems.",
                    "Geometric Optimization Problems Over Sliding Windows.",
                    "On-Line Windows Scheduling of Temporary Items.",
                    "Generalized Geometric Approaches for Leaf Sequencing Problems in Radiation Therapy.",
                    "An Efficient Exact Algorithm for the Minimum Ultrametric Tree Problem.",
                    "On the Range Maximum-Sum Segment Query Problem.",
                    "An Efficient Algorithm for Finding Maximum Cycle Packings in Reducible Flow Graphs.",
                    "Efficient Job Scheduling Algorithms with Multi-type Contentions.",
                    "Superimposing Voronoi Complexes for Shape Deformation.",
                    "On Partial Lifting and the Elliptic Curve Discrete Logarithm Problem.",
                    "Guarding Art Galleries by Guarding Witnesses.",
                    "On p-Norm Based Locality Measures of Space-Filling Curves.",
                    "Composability of Infinite-State Activity Automata.",
                    "Error Compensation in Leaf Root Problems.",
                    "On Compact and Efficient Routing in Certain Graph Classes.",
                    "Randomized Insertion and Deletion in Point Quad Trees.",
                    "Diagnosis in the Presence of Intermittent Faults.",
                    "Three-Round Adaptive Diagnosis in Binary n-Cubes.",
                    "Fast Algorithms for Comparison of Similar Unordered Trees.",
                    "GCD of Random Linear Forms.",
                    "On the Hardness and Easiness of Random 4-SAT Formulas.",
                    "Minimum Common String Partition Problem: Hardness and Approximations.",
                    "On the Complexity of Network Synchronization.",
                    "Counting Spanning Trees and Other Structures in Non-constant-jump Circulant Graphs.",
                    "Adaptive Spatial Partitioning for Multidimensional Data Streams.",
                    "Paired Pointset Traversal.",
                    "Approximated Two Choices in Randomized Load Balancing.",
                    "Space-Efficient and Fast Algorithms for Multidimensional Dominance Reporting and Counting.",
                    "Local Gapped Subforest Alignment and Its Application in Finding RNA Structural Motifs.",
                    "The Maximum Agreement of Two Nested Phylogenetic Networks.",
                    "Sequences of Radius k: How to Fetch Many Huge Objects into Small Memory for Pairwise Computations.",
                    "New Bounds on Map Labeling with Circular Labels.",
                    "Optimal Buffer Management via Resource Augmentation.",
                    "Oriented Paths in Mixed Graphs.",
                    "Polynomial Deterministic Rendezvous in Arbitrary Graphs.",
                    "Distributions of Points and Large Quadrangles.",
                    "Cutting Out Polygons with Lines and Rays.",
                    "Advantages of Backward Searching - Efficient Secondary Memory and Distributed Implementation of Compressed Suffix Arrays.",
                    "Inner Rectangular Drawings of Plane Graphs.",
                    "Approximating the Minmax Subtree Cover Problem in a Cactus.",
                    "Boundary-Optimal Triangulation Flooding.",
                    "Exact Computation of Polynomial Zeros Expressible by Square Roots.",
                    "Many-to-many Disjoint Path Covers in a Graph with Faulty Elements.",
                    "An O(n log n)-Time Algorithm for the Maximum Constrained Agreement Subtree Problem for Binary Trees.",
                    "Planning the Transportation of Multiple Commodities in Bidirectional Pipeline Networks.",
                    "Efficient Algorithms for the Hotlink Assignment Problem: The Worst Case Search.",
                    "Dynamic Tree Cross Products.",
                    "Spanners, Weak Spanners, and Power Spanners for Wireless Networks.",
                    "Techniques for Indexing and Querying Temporal Observations for a Collection of Objects.",
                    "Approximation Algorithms for the Consecutive Ones Submatrix Problem on Sparse Matrices.",
                    "The Two-Guard Problem Revisited and Its Generalization.",
                    "Canonical Data Structure for Interval Probe Graphs.",
                    "Efficient Algorithms for the Longest Path Problem.",
                    "Randomized Algorithms for Motif Detection.",
                    "Weighted Coloring on Planar, Bipartite and Split Graphs: Complexity and Improved Approximation.",
                    "Sweeping Graphs with Large Clique Number.",
                    "A Slightly Improved Sub-Cubic Algorithm for the All Pairs Shortest Paths Problem with Real Edge Lengths."
                ]
            }
        ]
    },
    {
        "year": "2003",
        "name": "14th ISAAC 2003",
        "info": "Kyoto, Japan",
        "venues": [
            {
                "sub_name_abbr": "conf/isaac/2003",
                "sub_name": "Algorithms and Computation, 14th International Symposium, ISAAC 2003, Kyoto, Japan, December 15-17, 2003, Proceedings.",
                "count": 75,
                "papers": [
                    "Interactive Proofs for Quantum Computation.",
                    "Drawing Plane Graphs.",
                    "Linear Time Algorithm for Approximating a Curve by a Single-Peaked Curve.",
                    "A Dynamic Dictionary for Priced Information with Application.",
                    "Voronoi Diagram in the Flow Field.",
                    "Polygonal Path Approximation: A Query Based Approach.",
                    "A Vertex Incremental Approach for Dynamically Maintaining Chordal Graphs.",
                    "Finding the Maximum Common Subgraph of a Partial k-Tree and a Graph with a Polynomially Bounded Number of Spanning Trees.",
                    "Hotlink Enhancement Algorithms for Web Directories: (Extended Abstract).",
                    "Finding a Length-Constrained Maximum-Density Path in a Tree.",
                    "The Intractability of Computing the Hamming Distance.",
                    "Infinitely-Often Autoreducible Sets.",
                    "Limiting Negations in Bounded-Depth Circuits: An Extension of Markov's Theorem.",
                    "Computational Complexity Measures of Multipartite Quantum Entanglement.",
                    "A New Simple Algorithm for the Maximum-Weight Independent Set Problem on Circle Graphs.",
                    "Polynomial Time 2-Approximation Algorithms for the Minmax Subtree Cover Problem.",
                    "Labeled Search Trees and Amortized Analysis: Improved Upper Bounds for NP-Hard Problems.",
                    "A New Translation from Semi-extended Regular Expressions into NFAs and Its Application to an Approximate Matching Problem.",
                    "The Quantum Query Complexity of 0-1 Knapsack and Associated Claw Problems.",
                    "Non-interactive Quantum Perfect and Statistical Zero-Knowledge.",
                    "Quantum Merlin-Arthur Proof Systems: Are Multiple Merlins More Helpful to Arthur?",
                    "A Faster Lattice Reduction Method Using Quantum Search.",
                    "Three Sorting Algorithms Using Priority Queues.",
                    "Lower Bounds on Correction Networks.",
                    "Approximate Regular Expression Searching with Arbitrary Integer Weights.",
                    "Constructing Compressed Suffix Arrays with Large Alphabets.",
                    "On the Geometric Dilation of Finite Point Sets.",
                    "On Computing All Immobilizing Grasps of a Simple Polygon with Few Contacts.",
                    "Optimal Point Set Projections onto Regular Grids.",
                    "An Approximation Algorithm for Dissecting a Rectangle into Rectangles with Specified Areas.",
                    "A Faster Algorithm for Two-Variable Integer Programming.",
                    "Efficient Algorithms for Generation of Combinatorial Covering Suites.",
                    "A Better Approximation for the Two-Machine Flowshop Scheduling Problem with Time Lags.",
                    "On Minimizing Average Weighted Completion Time: A PTAS for the Job Shop Problem with Release Dates.",
                    "Online Scheduling of Parallel Jobs with Dependencies on 2-Dimensional Meshes.",
                    "Efficient Algorithms for Descendent Subtrees Comparison of Phylogenetic Trees with Applications to Co-evolutionary Classifications in Bacterial Genome.",
                    "Settling the Intractability of Multiple Alignment.",
                    "Efficient Algorithms for Optimizing Whole Genome Alignment with Noise.",
                    "Segmenting Doughnut-Shaped Objects in Medical Images.",
                    "On the Locality Properties of Space-Filling Curves.",
                    "Geometric Restrictions on Producible Polygonal Protein Chains.",
                    "Symmetric Layout of Disconnected Graphs.",
                    "Approximation Hardness of Minimum Edge Dominating Set and Minimum Maximal Matching.",
                    "Enumerating Global Roundings of an Outerplanar Graph.",
                    "Augmenting Forests to Meet Odd Diameter Requirements.",
                    "On the Existence and Determination of Satisfactory Partitions in a Graph.",
                    "A Turn Function Scheme Realized in the Asynchronous Single-Writer/Multi-reader Shared Memory Model.",
                    "An Optimal Parallel Algorithm for c-Vertex-Ranking of Trees.",
                    "The Student-Project Allocation Problem.",
                    "Algorithms for Enumerating Circuits in Matroids.",
                    "A Generalized Gale-Shapley Algorithm for a Discrete-Concave Stable-Marriage Model.",
                    "Succinct Data Structures for Searchable Partial Sums.",
                    "Range Mode and Range Median Queries on Lists and Trees.",
                    "Quasi-Perfect Minimally Adaptive q-ary Search with Unreliable Tests.",
                    "New Ways to Construct Binary Search Trees.",
                    "Improved Approximation Algorithms for Optimization Problems in Graphs with Superlogarithmic Treewidth.",
                    "Biconnectivity on Symbolically Represented Graphs: A Linear Solution.",
                    "A Dynamic Data Structure for Maintaining Disjoint Paths Information in Digraphs.",
                    "Deterministic Algorithm for the t-Threshold Set Problem.",
                    "Energy-Efficient Wireless Network Design.",
                    "Wavelength Conversion in Shortest-Path All-Optical Networks.",
                    "A Heuristic for the Stacker Crane Problem on Trees Which Is Almost Surely Exact.",
                    "Flexible Train Rostering.",
                    "Counting Complexity Classes over the Reals I: The Additive Case.",
                    "Some Properties of One-Pebble Turing Machines with Sublogarithmic Space.",
                    "Hypergraph Decomposition and Secret Sharing.",
                    "A Promising Key Agreement Protocol.",
                    "Rapid Mixing of Several Markov Chains for a Hard-Core Model.",
                    "Polynomial Time Approximate Sampler for Discretized Dirichlet Distribution.",
                    "Fair Cost Allocations under Conflicts - A Game-Theoretic Point of View.",
                    "Equilibria for Networks with Malicious Users.",
                    "Quasi-optimal Arithmetic for Quaternion Polynomials.",
                    "Upper Bounds on the Complexity of Some Galois Theory Problems.",
                    "Unfolded Modular Multiplication.",
                    "Gauss Period, Sparse Polynomial, Redundant Basis, and Efficient Exponentiation for a Class of Finite Fields with Small Characteristic."
                ]
            }
        ]
    },
    {
        "year": "2002",
        "name": "13th ISAAC 2002",
        "info": "Vancouver, BC, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/isaac/2002",
                "sub_name": "Algorithms and Computation, 13th International Symposium, ISAAC 2002 Vancouver, BC, Canada, November 21-23, 2002, Proceedings.",
                "count": 57,
                "papers": [
                    "Biased Skip Lists.",
                    "Space-Efficient Data Structures for Flexible Text Retrieval Systems.",
                    "Key Independent Optimality.",
                    "On the Comparison-Addition Complexity of All-Pairs Shortest Paths.",
                    "On the Clique-Width of Graphs in Hereditary Classes.",
                    "The Probability of a Rendezvous is Minimal in Complete Graphs.",
                    "On the Minimum Volume of a Perturbed Unit Cube.",
                    "Non-Delaunay-Based Curve Reconstruction.",
                    "Cutting a Country for Smallest Square Fit.",
                    "On the Emptiness Problem for Two-Way NFA with One Reversal-Bounded Counter.",
                    "Quantum Multi-prover Interactive Proof Systems with Limited Prior Entanglement.",
                    "Some Remarks on the L-Conjecture.",
                    "A Framework for Network Reliability Problems on Graphs of Bounded Treewidth.",
                    "A Faster Approximation Algorithm for 2-Edge-Connectivity Augmentation.",
                    "Tree Spanners on Chordal Graphs: Complexity, Algorithms, Open Problems.",
                    "An Asymptotic Fully Polynomial Time Approximation Scheme for Bin Covering.",
                    "Improved Approximation Algorithms for Max-2SAT with Cardinality Constraint.",
                    "A Better Approximation for the Two-Stage Assembly Scheduling Problem with Two Machines at the First Stage.",
                    "Queaps.",
                    "Funnel Heap - A Cache Oblivious Priority Queue.",
                    "Characterizing History Independent Data Structures.",
                    "Faster Fixed Parameter Tractable Algorithms for Undirected Feedback Vertex Set.",
                    "An O(pn + 1.151p)-Algorithm for p-Profit Cover and Its Practical Implications for Vertex Cover.",
                    "Exponential Speedup of Fixed-Parameter Algorithms on K3, 3-Minor-Free or K5-Minor-Free Graphs.",
                    "Casting a Polyhedron with Directional Uncertainty.",
                    "Hierarchy of Surface Models and Irreducible Triangulation.",
                    "Algorithms and Complexity for Tetrahedralization Detections.",
                    "Average-Case Communication-Optimal Parallel Parenthesis Matching.",
                    "Optimal F-Reliable Protocols for the Do-All Problem on Single-Hop Wireless Networks.",
                    "New Results for Energy-Efficient Broadcasting in Wireless Networks.",
                    "An Improved Algorithm for the Minimum Manhattan Network Problem.",
                    "Approximate Distance Oracles Revisited.",
                    "Flat-State Connectivity of Linkages under Dihedral Motions.",
                    "Project Scheduling with Irregular Costs: Complexity, Approximability, and Algorithms.",
                    "Scheduling of Independent Dedicated Multiprocessor Tasks.",
                    "On the Approximability of Multiprocessor Task Scheduling Problems.",
                    "Bounded-Degree Independent Sets in Planar Graphs.",
                    "Minimum Edge Ranking Spanning Trees of Threshold Graphs.",
                    "File Transfer Tree Problems.",
                    "Approximation Algorithms for Some Parameterized Counting Problems.",
                    "Approximating MIN k-SAT.",
                    "Average-Case Competitive Analyses for Ski-Rental Problems.",
                    "On the Clique Problem in Intersection Graphs of Ellipses.",
                    "A Geometric Approach to Boolean Matrix Multiplication.",
                    "The Min-Max Voronoi Diagram of Polygons and Applications in VLSI Manufacturing.",
                    "Improved Distance Oracles for Avoiding Link-Failure.",
                    "Probabilistic Algorithms for the Wakeup Problem in Single-Hop Radio Networks.",
                    "A Simple, Memory-Efficient Bounded Concurrent Timestamping Algorithm.",
                    "Crossing Minimization for Symmetries.",
                    "Simultaneous Embedding of a Planar Graph and Its Dual on the Grid.",
                    "Meaningful Information.",
                    "Market Clearing with Supply and Demand Curves.",
                    "Partitioning Trees of Supply and Demand.",
                    "Maximizing a Voronoi Region: The Convex Case.",
                    "Random Tries.",
                    "Expected Acceptance Counts for Finite Automata with Almost Uniform Input.",
                    "Monotone Drawings of Planar Graphs."
                ]
            }
        ]
    },
    {
        "year": "2001",
        "name": "12th ISAAC 2001",
        "info": "Christchurch, New Zealand",
        "venues": [
            {
                "sub_name_abbr": "conf/isaac/2001",
                "sub_name": "Algorithms and Computation, 12th International Symposium, ISAAC 2001, Christchurch, New Zealand, December 19-21, 2001, Proceedings.",
                "count": 65,
                "papers": [
                    "Chain Reconfiguration. The INs and Outs, Ups and Downs of Moving Polygons and Polygonal Linkages.",
                    "Application of M-Convex Submodular Flow Problem to Mathematical Economics.",
                    "A Polynomial Time Approximation Scheme for Minimizing Total Completion Time of Unbounded Batch Scheduling.",
                    "A Polynomial Time Approximation Scheme for the Multi-vehicle Scheduling Problem on a Path with Release and Handling Times.",
                    "Semi-normal Schedulings: Improvement on Goemans' Algorithm.",
                    "Balanced Scheduling toward Loss-Free Packet Queuing and Delay Fairness.",
                    "Broadcasting with Universal Lists Revisited: Using Competitive Analysis.",
                    "On Adaptive Fault Diagnosis for Multiprocessor Systems.",
                    "On-Line Multicasting in All-Optical Networks.",
                    "Enumerating Floorplans with n Rooms.",
                    "On Min-Max Cycle Bases.",
                    "On the Minimum Local-Vertex-Connectivity Augmentation in Graphs.",
                    "Counting Graph Isomorphisms among Chordal Graphs with Restricted Clique Number.",
                    "Quantum Algorithms for Intersection and Proximity Problems.",
                    "BUSHWHACK: An Approximation Algorithm for Minimal Paths through Pseudo-Euclidean Spaces.",
                    "Approximation of Minimum Triangulation for Polyhedron with Bounded Degrees.",
                    "Tree-Approximations for the Weighted Cost-Distance Problem.",
                    "Necessary and Sufficient Numbers of Cards for Sharing Secret Keys on Hierarchical Groups.",
                    "Generic Algorithms and Key Agreement Protocols Based on Group Actions.",
                    "Baire Category and Nowhere Differentiability for Feasible Real Functions.",
                    "Translation among CNFs, Characteristic Models and Ordered Binary Decision Diagrams.",
                    "On Removing the Pushdown Stack in Reachability Constructions.",
                    "A New Recognition Algorithm for Extended Regular Expressions.",
                    "Polynomial-Time Algorithms for the Equivalence for One-Way Quantum Finite Automata.",
                    "An Index for the Data Size to Extract Decomposable Structures in LAD.",
                    "Parameterized Complexity: The Main Ideas and Some Research Frontiers.",
                    "Tight Bounds on Maximal and Maximum Matchings.",
                    "Recognition and Orientation Algorithms for P4-Comparability Graphs.",
                    "Efficient Algorithms for k-Terminal Cuts on Planar Graphs.",
                    "Polynomial Time Algorithms for Edge-Connectivity Augmentation of Hamiltonian Paths.",
                    "Algorithms for Pattern Involvement in Permutations.",
                    "A Fast Algorithm for Enumerating Bipartite Perfect Matchings.",
                    "On-Line Scheduling a Batch Processing System to Minimize Total Weighted Job Completion Time.",
                    "On the Complexity of Train Assignment Problems.",
                    "A Combinatorial Toolbox for Protein Sequence Design and Landscape Analysis in the Grand Canonical Model.",
                    "Complexity of Comparing Hidden Markov Models.",
                    "DNA Self-Assembly For Constructing 3D Boxes.",
                    "Exact Solutions for CLOSEST STRING and Related Problems.",
                    "Topological Peeling and Implementation.",
                    "Image Segmentation with Monotonicity and Smoothness Constraints.",
                    "Optimization Algorithms for Sweeping a Polygonal Region with Mobile Guards.",
                    "Approximation of a Geometric Set Covering Problem.",
                    "Shortest Path Algorithms: Engineering Aspects.",
                    "Efficient Algorithms for Weighted Colorings of Series-Parallel Graphs.",
                    "Go with the Winners Algorithms for Cliques in Random Graphs.",
                    "Complexity of Partial Covers of Graphs.",
                    "On Game-Theoretic Models of Networks.",
                    "The Complexity of Some Basic Problems for Dynamic Process Graphs.",
                    "Delay Optimizations in Quorum Consensus.",
                    "Randomized Shared Queues Applied to Distributed Optimization Algorithms.",
                    "Multiprocess Time Queue.",
                    "Labeling Points with Weights.",
                    "Small Convex Quadrangulations of Point Sets.",
                    "How to Color a Checkerboard with a Given Distribution - Matrix Rounding Achieving Low 2×2-Discrepancy.",
                    "Labeling Subway Lines.",
                    "Complexity Study on Two Clustering Problems.",
                    "A Modified Greedy Algorithm for the Set Cover Problem with Weights 1 and 2.",
                    "A Unified Framework for Approximating Multiway Partition Problems.",
                    "On-Line Algorithms for Cardinality Constrained Bin Packing Problems.",
                    "Suffix Vector: A Space-Efficient Suffix Tree Representation.",
                    "Fragmentary Pattern Matching: Complexity, Algorithms and Applications for Analyzing Classic Literary Works.",
                    "Computing the Quartet Distance between Evolutionary Trees in Time O(n log2 n).",
                    "The Cent-dian Path Problem on Tree Networks.",
                    "Approximate Hotlink Assignment.",
                    "Efficient Algorithms for Two Generalized 2-Median Problems on Trees."
                ]
            }
        ]
    },
    {
        "year": "2000",
        "name": "11th ISAAC 2000",
        "info": "Taipei, Taiwan",
        "venues": [
            {
                "sub_name_abbr": "conf/isaac/2000",
                "sub_name": "Algorithms and Computation, 11th International Conference, ISAAC 2000, Taipei, Taiwan, December 18-20, 2000, Proceedings.",
                "count": 48,
                "papers": [
                    "Voronoi-Based Systems of Coordinates and Surface Reconstruction.",
                    "Essentially Every Unimodular Matrix Defines and Expander.",
                    "Strategies for Hotlink Assignments.",
                    "A New Competitive Analysis of Randomized Caching.",
                    "Online Routing in Convex Subdivisions.",
                    "A Simple Linear-Time Approximation Algorithm for Multi-processor Job Scheduling on Four Processors.",
                    "Classification of Various Neighborhood Operations for the Nurse Scheduling Problem.",
                    "Optimal Bid Sequences for Multiple-Object Auctions with Unequal Budgets.",
                    "coping with Delays and Time-Outs in Binary Search Procedures.",
                    "Some Formal Analysis of Roccio's Similarity-Based Relvance Feedback Algorithm.",
                    "Reasoning with Ordered Binary Decision Diagrams.",
                    "On Approximating Minimum Vertex Cover for Graphs with Perfect Matching.",
                    "A 2-Approximation Algorithm for Path Coloring on Trees of Rings.",
                    "An Approximate Algorithm for the Weighted Hamiltonian Path Completion Problem on a Tree.",
                    "Finding Independent Spanning Trees in Partial k-Trees.",
                    "On Efficient Fixed Parameter Algorithms for WEIGHTED VERTEX COVER.",
                    "Constructive Linear Time Algorithms for Small Cutwidth and Carving-Width.",
                    "Approximation Algorithms for the Maximum Power Consumption Problem on Combinatorial Circuits.",
                    "A Simple and Quick Approximation Algorithm for Traveling Salesman Problem in the Plane.",
                    "Simple Algorithms for a Weighted Interval Selection Problem.",
                    "Efficient Minus and Signed Domination in Graphs.",
                    "Convex Grid Drwaings of Four-Connected Plane Graphs.",
                    "An Algorithm for Finding Three Dimensional Symmetry in Series Parallel Digraphs.",
                    "Undecidability Results for Monoids with Linear-Time Decidable Word Problems.",
                    "Secret Key Exchange Using Random Deals of Cards on Hierarchical Structures.",
                    "Derandomizing Arthur-Merlin Games under Uniform Assumptions.",
                    "A Near Optimal Algorithm for Vertex Connectivity Augmentation.",
                    "Simultaneous Augmentation of Two Graphs to an l-Edge-Connected Graph and a Biconnected Graph.",
                    "Location Problems Based on Node-Connectivity and Edge-Connectivity between Nodes and Node-Subsets.",
                    "An Intuitive and Effective New Representation for Interconnection Network Structures.",
                    "Randomized Leader Election Protocols in Radio Networks with No Collision Detection.",
                    "Deterministic Broadcasting Time with Partial Knowledge of the Network.",
                    "Minimizing Makespan in Batch Machine Scheduling.",
                    "Preemptive Parallel Task Scheduling in O(n)+Poly(m) Time.",
                    "Compressed Text Databases with Efficient Query Algorithms Based on the Compressed Suffix Array.",
                    "A Better Lower Bound for Two-Circle Point Labeling.",
                    "Voronoi Diagram of a Circle Set Constructed from Voronoi Diagram of a Point Set.",
                    "An Improved Algorithm for Subdivision Traversal without Extra Storage.",
                    "Generalized H-Coloring of Graphs.",
                    "Finding a Two-Core of a Tree in Linear Time.",
                    "Unbalanced and Hierarchical Bipartite Matchings with Applications to Labeled Tree Comparison.",
                    "Optimal Beam Penetrations in Two and Three Dimensions.",
                    "Searching a Simple Polygon by a k-Searcher.",
                    "Characterization of Rooms Searchable by Two Guards.",
                    "Improved Phylogeny Comparisons: Non-shared Edges, Nearest Neighbor Interchanges, and Subtree Transfers.",
                    "Phylogenetic k-Root and Steiner k-Root.",
                    "Maintenance of a Percing Set for Intervals with Applications.",
                    "Optimal Polygon Cover Problems and Applcations."
                ]
            }
        ]
    },
    {
        "year": "1999",
        "name": "10th ISAAC 1999",
        "info": "Chennai, India",
        "venues": [
            {
                "sub_name_abbr": "conf/isaac/1999",
                "sub_name": "Algorithms and Computation, 10th International Symposium, ISAAC '99, Chennai, India, December 16-18, 1999, Proceedings.",
                "count": 44,
                "papers": [
                    "The Engineering of Some Bipartite Matching Programs.",
                    "General Splay: A Basic Theory and Calculus.",
                    "Static Dictionaries Supporting Rank.",
                    "Multiple Spin-Block Decisions.",
                    "Asynchronous Random Polling Dynamic Load Balancing.",
                    "Simple Approximation Algorithms for MAXNAESP and Hypergraph 2-colorability.",
                    "Hardness of Approximating Independent Domination in Circle Graphs.",
                    "Constant-Factor Approximation Algorithms for Domination Problems on Circle Graphs.",
                    "Ordered Binary Decision Diagrams as Knowledge-Bases.",
                    "Hard Tasks for Weak Robots: The Role of Common Knowledge in Pattern Formation by Autonomous Mobile Robots.",
                    "On-Line Load Balancing of Temporary Tasks Revisited.",
                    "Online Routing in Triangulations.",
                    "The Query Complexity of Program Checking by Constant-Depth Circuits.",
                    "Tree-Like Resolution Is Superpolynomially Slower Than DAG-Like Resolution for the Pigeonhole Principle.",
                    "Efficient Approximation Algorithms for Multi-label Map Labeling.",
                    "Approximation Algorithms in Batch Processing.",
                    "LexBFS-Ordering in Asteroidal Triple-Free Graphs.",
                    "Parallel Algorithms for Shortest Paths and Related Problems on Trapezoid Graphs.",
                    "Approximation Algorithms for Some Clustering and Classification Problems.",
                    "How Many People Can Hide in a Terrain?",
                    "Carrying Umbrellas: An Online Relocation Problem on Graphs.",
                    "Survivable Networks with Bounded Delay: The Edge Failure Case.",
                    "Energy-Efficient Initialization Protocols for Ad-hoc Radio Networks.",
                    "Constructing the Suffix Tree of a Tree with a Large Alphabet.",
                    "An O(1) Time Algorithm for Generating Multiset Permutations.",
                    "Upper Bounds for MaxSat: Further Improved.",
                    "A Linear Time Algorithm for Recognizing Regular Boolean Functions.",
                    "Station Layouts in the Presence of Location Constraints.",
                    "Reverse Center Location Problem.",
                    "Performance Comparison of Linear Sieve and Cubic Sieve Algorithms for Discrete Logarithms over Prime Fields.",
                    "External Memory Algorithms for Outerplanar Graphs.",
                    "A New Approximation Algorithm for the Capacitated Vehicle Routing Problem on a Tree.",
                    "Approximation Algorithms for Channel Assignment with Constraints.",
                    "Algorithms for Finding Noncrossing Steiner Forests in Plane Graphs.",
                    "A Linear Algorithm for Finding Total Colorings of Partial k-Trees.",
                    "Topology-Oriented Approach to Robust Geometric Computation.",
                    "Approximating Multicast Congestion.",
                    "Approximating the Minimum k-way Cut in a Graph via Minimum 3-way Cuts.",
                    "Online Scheduling of Parallel Communications with Individual Deadlines.",
                    "A Faster Algorithm for Finding Disjoint Paths in Grids.",
                    "Output-Sensitive Algorithms for Uniform Partitions of Points.",
                    "Convexifying Monotone Polygons.",
                    "Bisecting Two Subsets in 3-Connected Graphs.",
                    "Generalized Maximum Independent Sets for Trees in Subquadratic Time."
                ]
            }
        ]
    },
    {
        "year": "1998",
        "name": "9th ISAAC 1998",
        "info": "Taejon, Korea",
        "venues": [
            {
                "sub_name_abbr": "conf/isaac/1998",
                "sub_name": "Algorithms and Computation, 9th International Symposium, ISAAC '98, Taejon, Korea, December 14-16, 1998, Proceedings.",
                "count": 49,
                "papers": [
                    "The Discrepancy Method.",
                    "Implementing Algorithms and Data Structures: An Educational and Research Perspective.",
                    "Linfinity Voronoi Diagrams and Applications to VLSI Layout and Manufacturing.",
                    "Facility Location on Terrains.",
                    "Computing Weighted Rectilinear Median and Center Set in the Presence of Obstacles.",
                    "Maximizing Agreement with a Classification by Bounded or Unbounded Number of Associated Words.",
                    "Disjunctions of Horn Theories and Their Cores.",
                    "Checking Programs Discreetly: Demonstrating Result-Correctness Efficiently while Concealing it.",
                    "Two-Layer Planarization in Graph Drawing.",
                    "Computing Orthogonal Drawings in a Variable Embedding Setting.",
                    "Dynamic Grid Embedding with Few Bends and Changes.",
                    "Two New Families of List Update Algorithms.",
                    "An Optimal Algorithm for On-Line Palletizing at Delivery Industry.",
                    "On-Line Scheduling of Parallel Jobs with Runtime Restrictions.",
                    "Testing the Quality of Manufactured Disks and Cylinders.",
                    "Casting with Skewed Ejection Direction.",
                    "Repairing Flaws in a Picture Based on a Geometric Representation of a Digital Image.",
                    "K-Edge and 3-Vertex Connectivity Augmentation in an Arbitrary Multigraph.",
                    "Polyhedral Structure of Submodular and Posi-modular Systems.",
                    "Maximizing the Number of Connections in Optical Tree Networks.",
                    "Selecting the k Largest Elements with Parity Tests.",
                    "Randomized K-Dimensional Binary Search Trees.",
                    "Randomized O (log log n)-Round Leader Election Protocols in Packet Radio Networks.",
                    "Random Regular Graphs with Edge Faults: Expansion through Cores.",
                    "A Quantum Polynomial Time Algorithm in Worst Case for Simon's Problem.",
                    "Generalized Graph Colorability and Compressibility of Boolean Formulae.",
                    "On the Complexity of Free Monoid Morphisms.",
                    "Characterization of Efficiently Solvable Problems on Distance-Hereditary Graphs.",
                    "Fast Algorithms for Independent Domination and Efficient Domination in Trapezoid Graphs.",
                    "Finding Planar Geometric Automorphisms in Planar Graphs.",
                    "A New Approach for Speeding Up Enumeration Algorithms.",
                    "Hamiltonian Decomposition of Recursive Circulants.",
                    "Convertibility among Grid Filling Curves.",
                    "Generalized Self-Approaching Curves.",
                    "The Steiner Tree Problem in Lambda4-geometry Plane.",
                    "Approximation and Exact Algorithms for RNA Secondary Structure Prediction and Recognition of Stochastic Context-Free Languages.",
                    "On the Multiple Gene Duplication Problem.",
                    "Visibility Queries in Simple Polygons and Applications.",
                    "Quadtree Decomposition, Steiner Triangulation, and Ray Shooting.",
                    "Optimality and Integer Programming Formulations of Triangulations in General Dimension.",
                    "Space-Efficient Approximation Algorithms for MAXCUT and COLORING Semidefinite Programs.",
                    "A Capacitated Vehicle Routing Problem on a Tree.",
                    "Approximation Algorithms for Some Optimum Communication Spanning Tree Problems.",
                    "The Edge-Disjoint Paths Problem is NP-Complete for Partial k-Trees.",
                    "Inapproximability Results for Guarding Polygons without Holes.",
                    "The Inapproximability of Non NP-hard Optimization Problems.",
                    "An Efficient NC Algorithm for a Sparse k-Edge-Connectivity Certificate.",
                    "A Parallel Algorithm for Sampling Matchings from an Almost Uniform Distribution.",
                    "Optimal Approximate Agreement with Omission Faults."
                ]
            }
        ]
    },
    {
        "year": "1997",
        "name": "8th ISAAC 1997",
        "info": "Singapore",
        "venues": [
            {
                "sub_name_abbr": "conf/isaac/1997",
                "sub_name": "Algorithms and Computation, 8th International Symposium, ISAAC '97, Singapore, December 17-19, 1997, Proceedings.",
                "count": 44,
                "papers": [
                    "Solving NP-hard Combinatorial Problems in the Practical Sense (Abstract).",
                    "Airline Crew-Scheduling Problem with Many Irregular Flights.",
                    "Practical Approach to a Facility Location Problem for Large-Scale Logistics.",
                    "Hard Instance Generation for SAT (Extended Abstract).",
                    "Playing Tetris on Meshes and Multi-Dimensional SHEARSORT.",
                    "Formulation of the Addition-Shift-Sequence Problem and Its Complexity.",
                    "Weighted and Unweighted Selection Algorithms for k Sorted Sequences.",
                    "An Adaptive Distributed Fault-Tolerant Routing Algorithm for the Star Graph.",
                    "Multi-Color Routing in the Undirected Hypercube.",
                    "Competitive Source Routing on Tori and Meshes.",
                    "Algorithms for Enumerating All Perfect, Maximum and Maximal Matchings in Bipartite Graphs.",
                    "Augmenting Edge and Vertex Connectivities Simultaneously.",
                    "Two-Face Horn Extensions.",
                    "Decremental Maintenance of Reachability in Hypergraphs and Minimum Models of Horn Formulae.",
                    "Algorithmic Analysis of Multithreaded Algorithms (Abstract).",
                    "A Characterization of Planar Graphs by Pseudo-Line Arrangements.",
                    "Optimal Fault-Tolerant Broadcasting in Trees (Extended Abstract).",
                    "A Theoretical Framework of Hybrid Approaches to MAX SAT.",
                    "Exponential Lower Bounds on the Size of OBDDs Representing Integer Divistion.",
                    "On-Line Versus Off-Line in Money-Making Strategies with BROKERAGE.",
                    "Decision-Making by Hierarchies of Discordant Agents.",
                    "A New Efficient Off-line Anonymous Cash Scheme.",
                    "Approximating Unweighted Connectivity Problems in Parallel.",
                    "A Randomized Linear Work EREW PRAM Algorithm to Find a Minimum Spanning Forest.",
                    "Efficient Parallel Algorithms for Planar st-Graphs.",
                    "Peg-Solitaire, String Rewriting Systems and Finite Automata.",
                    "On the Size of Probabilistic Formulae.",
                    "Homophonic Coding with Logarithmic Memory Size.",
                    "Complexity and Modeling Aspects of Mesh Refinement into Quadrilaterals.",
                    "Topology Oriented vs. Exact Arithmetic - Experience in Implementing the Three-Dimensional Convex Hull Algorithm.",
                    "The Complexity of Learning Branches and Strategies from Queries.",
                    "Singularities Make Spatial Join Scheduling Hard.",
                    "A Faster One-Dimensional Topological Compaction Algorithm.",
                    "Algorithms for Finding Optimal Disjoint Paths Around a Rectangle.",
                    "An Algorithm for Finding a Region with the Minimum Lotal L1 from Prescribed Terminals.",
                    "On Defect Sets in Bipartite Graphs (Extended Abstract).",
                    "Dynamic Programming on Distance-Hereditary Graphs.",
                    "On the Equivalence in Complexity among Basic Problems on Bipartite and Parity Graphs.",
                    "All-Cavity Maximum Matchings.",
                    "Fast Algorithms for Computing beta-Skeletons and Their Relatives.",
                    "A Branch-and-Cut Approach for Minimum Weight Triangulation.",
                    "An Efficient Approximation Scheme for the Subset-Sum Problem.",
                    "Competitive Call Control in Mobile Networks.",
                    "Generalized Swap-with-Parent Schemes for Self-Organizing Sequential Linear Lists."
                ]
            }
        ]
    },
    {
        "year": "1996",
        "name": "7th ISAAC 1996",
        "info": "Osaka, Japan",
        "venues": [
            {
                "sub_name_abbr": "conf/isaac/1996",
                "sub_name": "Algorithms and Computation, 7th International Symposium, ISAAC '96, Osaka, Japan, December 16-18, 1996, Proceedings.",
                "count": 44,
                "papers": [
                    "Applications of a Numbering Scheme for Polygonal Obstacles in the Plane.",
                    "Incremental Convex Hull Algorithms Are Not Output Sensitive.",
                    "Separating and Shattering Long Line Segments.",
                    "Optimal Line Bipartitions of Point Sets.",
                    "Interval Finding and Its Application to Data Mining.",
                    "On the Approximability of the Steiner Tree Problem in Phylogeny.",
                    "Approximation and Special Cases of Common Subtrees and Editing Distance.",
                    "Two-Dimensional Dynamic Dictionary Matching.",
                    "Discovering Unbounded Unions of Regular Pattern Languages from Positive Examples (Extended Abstract).",
                    "Extremal Problems for Geometric Hypergraphs.",
                    "Computing Fair and Bottleneck Matchings in Geormetric Graphs.",
                    "Computing the Maximum Overlap of Two Convex Polygons Under Translations.",
                    "OBDDs of a Monotone Function and of Its Prime Implicants.",
                    "Algorithms for Maximum Matching and Minimum Fill-in on Chordal Bipartite Graphs.",
                    "Graph Searching on Chordal Graphs.",
                    "An Algorithm for Enumerating all Directed Spanning Trees in a Directed Graph.",
                    "Vertex Ranking of Asteroidal Triple-Free Graphs.",
                    "Recursively Divisible Problems.",
                    "StUSPACE(log n) <= DSPACE(log²n / log log n).",
                    "Finding Edge-Disjoint Paths in Partial k-Trees (Extended Abstract).",
                    "Optimal Augmentation for Bipartite Componentwise Biconnectiviy in Linear Time (Extended Abstract).",
                    "Towards More Precise Parallel Biconnectivity Approximation.",
                    "The Complexity of Probabilistic versus Deterministic Finite Automata.",
                    "Bounded Length UCFG Equivalence.",
                    "The Steiner Minimal Tree Problem in the lambda-Geormetry Plane.",
                    "A Study of the LMT-Skeleton.",
                    "A New Subgraph of Minimum Weight Triangulations.",
                    "Dynamic Tree Routing under the \"Matching with Consumption\" Model.",
                    "Dimension-Exchange Token Distribution on the Mesh and the Torus.",
                    "Directed Hamiltonian Packing in d-Dimensional Meshes and Its Application (Extended Abstract).",
                    "k-Pairs Non-Crossing Shortest Paths in a Simple Polygon.",
                    "Minimum Convex Partition of a Polygon with Holes by Cuts in Given Directions.",
                    "Efficient List Ranking on the Reconfigurable Mesh, with Applications.",
                    "Periodic Merging Networks.",
                    "Minimum Wavelength in an All-Optical Ring Network.",
                    "Competitive Analysis of On-Line Disk Scheduling.",
                    "Scheduling Interval Ordered Tasks with Non-Uniform Deadlines.",
                    "Cryptographic Weaknesses in the Round Transformation Used in a Block Cipher with Provable Immunity Against Linear Cryptanalysis (Extended Abstract).",
                    "The Multi-variable Modular Polynomial and Its Applications to Cryptography.",
                    "Bounds and Algorithms for a Practical Task Allocation Model (Extended Abstract).",
                    "Scheduling Algorithms for Strict Multithreaded Computations.",
                    "On Multi-threaded Paging.",
                    "A Fast and Efficient Homophonic Coding Algorithm.",
                    "An Improvement of the Digital Cash Protocol of Okamoto and Ohta."
                ]
            }
        ]
    },
    {
        "year": "1995",
        "name": "6th ISAAC 1995",
        "info": "Cairns, Australia",
        "venues": [
            {
                "sub_name_abbr": "conf/isaac/1995",
                "sub_name": "Algorithms and Computation, 6th International Symposium, ISAAC '95, Cairns, Australia, December 4-6, 1995, Proceedings.",
                "count": 48,
                "papers": [
                    "Algorithmic Problems Arising from Genome Informatics (Abstract).",
                    "An Approximation Algorithm for Alphabet Indexing Problem.",
                    "A Fast and Space - Economical Algorithm for Length - Limited Coding.",
                    "Computing in Linear Time a Chord from Which a Simple Polygon is Weakly Internally Visible.",
                    "Competitive Searching in Polygons - Beyond Generalised Streets.",
                    "Finding a Shortest Pair of Paths on the Plane with Obstacles and Crossing Areas.",
                    "Logspace Verifiers, NC, and NP.",
                    "Structure in Average Case Complexity.",
                    "Some Geometric Lower Bounds.",
                    "The I/O - Complexity of Ordered Binary - Decision Diagram Manipulation.",
                    "Two Arc Disjoint Paths in Eulerian Diagraphs.",
                    "Finding Dense Subgraphs.",
                    "finding Smallest Supertrees.",
                    "Weighted Domination on Cocomparability Graphs.",
                    "The Parallel Complexity of Approximating the High Degree Subgraph Problem.",
                    "Constant Ratio Approximations of the Weighted Feedback Vertex Set Problem for Undirected Graphs.",
                    "Greedy Approximations of Independent Sets in Low Degree Graphs.",
                    "Practical Logic (Abstract).",
                    "An Approximation Algorithm for MAX 3-SAT.",
                    "Learning of Restricted RNLC Graph Languages.",
                    "Optimal Information Delivery.",
                    "On the Complexity of Testing for Catastrophic Faults.",
                    "Scheduling Parallel Tasks with Individual Deadlines.",
                    "Orders of Gauss Periods in Finite Fields.",
                    "A Hard Problem That is Almost Always Easy.",
                    "Computing the Tutte Polynomial of a Graph of Moderate Size.",
                    "More Efficient Parallel Flow Algorithms.",
                    "Linear-time In-place Selection in Less than 3n Comparisons.",
                    "Heap Construction: Optimal in Both Worst and Average Cases?",
                    "Fast Approximate Dictionary Matching.",
                    "Undirected Vertex-Connectivity Structure and Smallest Four-Vertex-Connectivity Augmentation.",
                    "Searching for a Monotone Function by Independent Threshold Queries.",
                    "A Fast and Simple Algorithm for Identifying 2-Monotonic Positive Boolean Functions.",
                    "Deciding Bisimulation and Trace Equivalences for Systems with Many Identical Processes.",
                    "Should Amdahl's Law Be Repealed? (Abstract).",
                    "Embeddings of Hyper-Rings in Hypercubes.",
                    "A Fast Algorithm for Computing Optimal Rectilinear Steiner Trees for Extremal Point Sets.",
                    "Algorithms for Finding f-Colorings of Partial k-Trees.",
                    "Spanning Closed Trail and Hamiltonian Cycle in Grid Graphs.",
                    "A Linear Time Algorithm For Finding Maximal Planar Subgraphs.",
                    "Illumination with Orthogonal Floodlights.",
                    "No Quadrangulation is Extremely Odd.",
                    "Finding the Medial Axis of a Simple Polygon in Linear Time.",
                    "The First Subquadratic Algorithm for Complete Linkage Clustering.",
                    "Matching Nuts and Bolts Faster.",
                    "Linear matching-time algorithm for the directed graph isomorphism problem.",
                    "A Resource Assignment Problem on Graphs.",
                    "NC Algorithms for Partitioning Sparse Graphs into Induced Forests with an Application."
                ]
            }
        ]
    },
    {
        "year": "1994",
        "name": "5th ISAAC 1994",
        "info": "Beijing, China",
        "venues": [
            {
                "sub_name_abbr": "conf/isaac/1994",
                "sub_name": "Algorithms and Computation, 5th International Symposium, ISAAC '94, Beijing, P. R. China, August 25-27, 1994, Proceedings.",
                "count": 79,
                "papers": [
                    "Polynomial Equations-Solving and its Applications.",
                    "Quasi-Random Combinatorial Structures (Abstract).",
                    "Hamiltonian Abstract Voronoi Diagrams in Linear Time.",
                    "Every Set of Disjoint Line Segments Admits a Binary Tree.",
                    "The Traveling Cameraman Problem, with Applications to Automatic Optical Inspection.",
                    "On Determining the Congruity of Point Sets in Higher Dimensions.",
                    "On Random Hard Sets for NP.",
                    "Computing Solutions Uniquely collapses the Polynomial Hierarchy.",
                    "Verifying the Determinant in Parallel.",
                    "Hardness of Approximating Graph Transformation Problem.",
                    "Randomized Wait-Free Naming.",
                    "Unifying Themes for Network Selection.",
                    "Robust Asynchronous Algorithms in Networks with a Fault Detection Ring.",
                    "Distributed Algorithms for Finding Small Cycle Covers in Arbitrary Networks.",
                    "A Neural Network Model for Quadratic Programming with Simple Upper and Lower Bounds and its Application to Linear Programming.",
                    "Analysis of the Convergency of Topology Preserving Neural Networks on Learning.",
                    "On Helping and Interactive Proof Systems.",
                    "Average Time Complexity of the SAT 1.2 Algorithm.",
                    "Average Cost to Produce Partial Orders.",
                    "Two Notes on Low-Density Subset Sum Algorithms.",
                    "Rotation Distance, Triangulations of Planar Surfaces and Hyperbolic Geometry.",
                    "Finitely Representables Spatial Objects and Efficient Computation.",
                    "Computing All Small Cuts in Undirected Networks.",
                    "Edge-Coloring and f-Coloring for Various Classes of Graphs.",
                    "Edge-Disjoint Paths in Permutation Graphs.",
                    "Minimum Augmentation to k-Edge-Connect Specified Vertices of a Graph.",
                    "Algorthmic Chernoff-Hoeffding Inequalitiers in Integer Programming.",
                    "Approximate Pattern Matching with Samples.",
                    "An Efficient Optimal Algorithm for Minimizing the Overall Communication Cost in Replicated Data Management.",
                    "Multispace Search: A New Optimization Approach.",
                    "Realizing Degree Sequences in Parallel.",
                    "Efficient Sequential and Parallel Algorithms for the Negative Cycle Problem.",
                    "Fast and Efficient Operations on Parallel Priority Queues.",
                    "Heaps with Bits.",
                    "Components and Projections of Curves over Finite Fields.",
                    "On the Approximation of Finding Various Minimal, Maximal, and Consistent Sequences.",
                    "A Linear-Time Algorithm for Computing Characteristic Strings.",
                    "The Maximum Latency and Identification of Positive Boolean Functions.",
                    "Fast Deterministic Hot-Potato Routing on Processor Arrays.",
                    "k-Pairwise Cluster Fault Tolerant Routing in Hypercubes.",
                    "On Steiner Minimal Trees in Grid Graphs and Its Application to VLSI Routing.",
                    "Optimal Routing of Permutations on Rings.",
                    "Resource Bounded Randomness and Weakly Complete Problems.",
                    "Deterministic w Automata vis-a-vis Deterministic Buchi Automata.",
                    "Quantum Computation and NP-Complete Problems.",
                    "Separability and One-Way Functions.",
                    "On the Approximation of Largest Common Subtrees and Largest Common Point Sets.",
                    "An Approximation Scheme for Some Steiner Tree Problems in the Plane.",
                    "A Chain Decomposition Algorithm for the Proof of a Property on Minimum Weight Triangulations.",
                    "The Generating Algorithm for Quasi-Full Steiner Trees.",
                    "Analysing Deletions in Competitive Self-Adjusting Linear List.",
                    "Are Fibonacci Heaps Optimal?",
                    "Simple and Efficient Graph Compression Schemes for Dense and Complement Graphs.",
                    "Improved Algorithms for Coloring Random Graphs.",
                    "On the Parallel Complexity of Solving Recurrence Equations.",
                    "Extended Graph Connectivity and Its Gradually Increasing Parallel Complexity.",
                    "Parallel h-v Drawings of Binary Trees.",
                    "An Efficient Parallel Strategy for Recognizing Series-Parallel Graphs.",
                    "Orthogonal Queries in Segments and Triangles.",
                    "Further Computational Geometry in Secondary Memory.",
                    "Shortest Safari Routes in Simple Polygon.",
                    "On Greedy Tetrahedralization of Points in 3D.",
                    "The Totally-Perfect Bipartite Graph and Its Construction.",
                    "k-Best Cuts for Circular-Arc Graphs.",
                    "Revisiting Circular Arc Graphs.",
                    "Weighted Irredundance of Interval Graphs.",
                    "A Reordering Operation for an Ordered Binary Decision Diagram and an Extended Framework for Combinatorics of Graphs.",
                    "On the Size of Ordered Binary Decision Diagrams Representing Threshold Functions.",
                    "Nonuniform Lowness and Strong Nonuniform Lowness.",
                    "Definition and Existence of Super Complexity Cores.",
                    "Efficient Algorithms for Assigning Chain-Like Tasks on a Chain-Like Network Computer.",
                    "Manpower Scheduling with Shift Change Constraints.",
                    "Fast Algorithms for Transversal Matroid Intersection Problems.",
                    "A Convex Hull Algorithm on Coarse-Grained Multiprocessors.",
                    "A Multiway Merging Network.",
                    "Reporting and Counting Intersections of Lines within a Polygon.",
                    "A New Problem in String Searching.",
                    "Achieving the Shortest Clock Period by Inserting the Minimum Amount of Delay.",
                    "A Randomized Algorithm to Finite Automata Public Key Cryptosystem."
                ]
            }
        ]
    },
    {
        "year": "1993",
        "name": "4th ISAAC 1993",
        "info": "Hong Kong",
        "venues": [
            {
                "sub_name_abbr": "conf/isaac/1993",
                "sub_name": "Algorithms and Computation, 4th International Symposium, ISAAC '93, Hong Kong, December 15-17, 1993, Proceedings.",
                "count": 57,
                "papers": [
                    "Reaching a Goal with Directional Uncertainty.",
                    "Constructing Degree-3 Spanners with Other Sparseness Properties.",
                    "Remembering Conflicts in History Yields Dynamic Algorithms.",
                    "Coloring Random Graphs in Polynomial Expected Time.",
                    "Graphical Degree Sequence Problems with Connectivity Requirements.",
                    "How to Treat Delete Requests in Semi-Online Problems.",
                    "Finding the Shortest Watchman Route in a Simple Polygon.",
                    "Constructing Shortest Watchman Routes by Divide-and-Conquer.",
                    "A Graph Coloring Result and Its Consequences for Some Guarding Problems.",
                    "The Maximum k-Dependent and f-Dependent Set Problem.",
                    "Finding Shortest Non-Crossing Rectilinear Paths in Plane Regions.",
                    "Treewidth of Circle Graphs.",
                    "A Framework for Constructing Heap-Like Structures In-Place.",
                    "Double-Ended Binomial Queues.",
                    "A Simple Balanced Search Tree with O(1) Worst-Case Update Time.",
                    "Mapping Dynamic Data and Algorithm Structures into Product Networks.",
                    "Permutation Routing on Reconfigurable Meshes.",
                    "Adaptive and Oblivious Algorithms for D-Cube Permutation Routing.",
                    "On Quadratic Lattice Approximations.",
                    "A 2or3-Approximation of the Matroid Matching Problem.",
                    "Using Fractal Geometry for Solving Divide-and-Conquer Recurrences.",
                    "Simple Combinatorial Gray Codes Constructed by Reversing Sublists.",
                    "Time Space Tradeoffs (Getting Closer to the Barrier?).",
                    "Separating Exponentially Ambiguous NFA from Polynomially Ambiguous NFA.",
                    "Threshold Computation and Cryptographic Security.",
                    "On the Power of Reading and Writing Simultaneously in Parallel Computation.",
                    "Relativizing Complexity Classes With Random Oracles.",
                    "An Introduction to Perpetual Gossiping.",
                    "A Probabilistic Selection Network with Butterfly Networks.",
                    "Optimal Group Gossiping in Hypercubes Under Wormhole Routing Model.",
                    "Optimal Linear Broadcast Routing with Capacity Limitations.",
                    "Multicommodity Flows: A Survey of Recent Research.",
                    "Parallel Construction of Canonical Ordering and Convex Drawing of Triconnected Planar Graphs.",
                    "Number Theory Helps Line Detection in Digital Images.",
                    "Optimally Computing the Shortest Weakly Visible Subedge of a Simple Polygon.",
                    "Multicommodity Flows in Even, Planar Networks.",
                    "Linear Time Algorithms for Disjoint Two-Face Paths Problems in Planar Graphs.",
                    "Robot Mapping: Foot-Prints versus Tokens.",
                    "Recent Developments on the Approximability of Combinatorial Problems.",
                    "On the Relationship among Cryptographic Physical Assumptions.",
                    "Separating Complexity Classes Related to Bounded Alternating omega-Branching Programs.",
                    "The Complexity of the Optimal Variable Ordering Problems of Shared Binary Decision Diagrams.",
                    "On Horn Envelopes and Hypergraph Transversals.",
                    "Page Migration Algorithms Using Work Functions.",
                    "Memory Paging for Connectivity and Path Problems in Graphs.",
                    "Randomized Competitive Algorithms for Successful and Unsuccessful Search on Self-adjusting Linear Lists.",
                    "Randomized On-line Algorithms for the Page Replication Problem.",
                    "New Algorithms for Minimizing the Longest Wire Length during Circuit Compaction.",
                    "Parallel Algorithms for Single-Layer Channel Routing.",
                    "Consecutive Interval Query and Dynamic Programming on Intervals.",
                    "An Improved Algorithm for the Traveler's Problem.",
                    "Vehicle Scheduling on a Tree with Release and Handling Times.",
                    "Scheduling Algorithms for a Chain-like Task System.",
                    "Weighted Independent Perfect Domination on Cocomparability Graphs.",
                    "Plane Sweep Algorithms for the Polygonal Approximation Problems with Applications.",
                    "Optimal Rectilinear Steiner Tree for Extremal Point Sets.",
                    "Faster Approximation Algorithms for the Rectilinear Steiner Tree Problem."
                ]
            }
        ]
    },
    {
        "year": "1992",
        "name": "3rd ISAAC 1992",
        "info": "Nagoya, Japan",
        "venues": [
            {
                "sub_name_abbr": "conf/isaac/1992",
                "sub_name": "Algorithms and Computation, Third International Symposium, ISAAC '92, Nagoya, Japan, December 16-18, 1992, Proceedings.",
                "count": 51,
                "papers": [
                    "Methods in Parallel Algorithmics and Who May Need to Know Them?",
                    "Rectilinear Paths among Rectilinear Obstacles.",
                    "Linear Time Algorithms for k-cutwidth Problem.",
                    "The k-Edge-Connectivity Augmentation Problem of Weighted Graphs.",
                    "Principal Lattice of Partition of submodular functions on Graphs: Fast algorithms for Principal Partition and Generic Rigidity.",
                    "The Application of the Searching over Separators Strategy to Solve Some NP-Complete Problems on Planar Graphs.",
                    "Parallel and On-line Graph Coloring Algorithms.",
                    "Competitive Analysis of the Round Robin Algorithm.",
                    "Competitive Analysis of the On-line Algorithms for Multiple Stacks Sysytems.",
                    "Self-Adjusting Augmented Search Trees.",
                    "Alhorithms for a Class of Min-Cut and Max-Cut Problem.",
                    "Algorithms for Rectilinear Optimal Multicast Tree Problem.",
                    "Approximating Treewidth and Pathwidth of some Classes of Perfect Graphs.",
                    "Graph Spanners and Connectivity.",
                    "Randomized Range-Maxima inNearly-Constant Parallel Time.",
                    "Fault-Tolerant Broadcasting in Binary Jumping Networks.",
                    "Routing Problems on the Mesh of Buses.",
                    "Selection Networks with 8n log2n Size and O(log n) Depth.",
                    "Relativizations of the P =?NP and other Problems: Some Developments in Structural Complexity Theory.",
                    "Boolean Circuit Complexity.",
                    "Searching a Solid Pseudo 3-Sided Orthoconvex Grid.",
                    "An Efficient Parallel Algorithm for Geometrically Characterising Drawings of a Class of 3-D Objects.",
                    "Topologically Consistent Algorithms Realted to Convex Polyhedra.",
                    "Characterizing and Recognizing Visibility Graphs of Funnel-Shaped Polygons.",
                    "On the Complexity of Composite Numbers.",
                    "On Malign Input Distributions for Algorithms.",
                    "Lowness and the Complexity of Sparse and Tally Descriptions.",
                    "Honest Iteration Schemes of Randomizing Algorithms.",
                    "Approximating Vertices of a Convex Polygon with Grid Points in the Polygon.",
                    "Algorithms for Determining the Geometrical Congruity in Two and Three Dimensions.",
                    "On the Relationship among Constrained Geometric Structures.",
                    "Generating Small Convergent Systems Can Be Extremely Hard.",
                    "Chew's Theorem Revisited -Uniquely Normalizing Property of Nonlinear Term Rewriting Systems-.",
                    "Higher Order Communication Processes with Value-Passing, Assignment and Return of Results.",
                    "Searching Informed Game Trees.",
                    "How to Generate Realistic Sample Problems for Network Optimization.",
                    "Generalized Assignment Problems.",
                    "Recognizing an Envelope of Lines in Linear Time.",
                    "Approximation of Polygonal Curves with Minimum Number of Line Segments.",
                    "Wiring Knock-Knee Layouts: A Global Appoach.",
                    "Algorithms for Finding Non-Crossing Paths with Minimum Total Length in Plane Graphs.",
                    "On Symmetry of Information and Polynomial Time Invertibility.",
                    "On Probabilistic ACC Circuits with an Exact-Threshold Output Gate.",
                    "Computational and Statistical Indistinguishabilities.",
                    "On Symmetric Differences of NP-hard Sets with Weakly-P-Selective Sets.",
                    "Rstricted Track Assignment with Applications.",
                    "A Simple Test for the Consecutive Ones Property.",
                    "The Longest Common Subsequence Problem for Small Alphabet Size Between Many Strings.",
                    "The Implicit Dictionary Problem Revisited.",
                    "Sorting In-Place with a Worst Case Complexity of n log n-1.3n + O(logn) Comparisons and epsilon n log n + O(1) Transports.",
                    "Sorting and/by Merging Finger Trees."
                ]
            }
        ]
    },
    {
        "year": "1991",
        "name": "2nd ISAAC 1991",
        "info": "Taipei, Taiwan",
        "venues": []
    },
    {
        "year": "1990",
        "name": "1st ISAAC 1990",
        "info": "Tokyo, Japan",
        "venues": []
    }
]