[
    {
        "name": "JCOMPLEXITY",
        "year": "2022",
        "info": "2022: Volumes\n68,\n69,\n70,",
        "count": 23,
        "papers": [
            "A promenade through correct test sequences I: Degree of constructible sets, Bézout's Inequality and density.",
            "On the oracle complexity of smooth strongly convex minimization.",
            "Adaptive regularization for nonconvex optimization using inexact function values and randomly perturbed derivatives.",
            "On a central algorithm for calculation of the inverse of the harmonic oscillator in the spaces of orbits.",
            "The VC-dimension of axis-parallel boxes on the Torus.",
            "Optimal pointwise sampling for L2 approximation.",
            "Changes of the Editorial Board.",
            "Michaela Szölgyenyi is the winner of the 2021 Joseph F. Traub Information-Based Complexity Young Researcher Award.",
            "Nominations for 2022 Joseph F. Traub Information-Based Complexity Young Researcher Award.",
            "Approximation by quasi-interpolation operators and Smolyak's algorithm.",
            "Complexity and tractability for a class of elliptic partial integro-differential equations.",
            "Convergence rates of support vector machines regression for functional data.",
            "Nuclear embeddings in general vector-valued sequence spaces with an application to Sobolev embeddings of function spaces on quasi-bounded domains.",
            "Lower bounds of cowidths and widths of multiplier operators.",
            "Weaker convergence criteria for Traub's method.",
            "Best Paper Award of the Journal of Complexity.",
            "On a partition with a lower expected L2-discrepancy than classical jittered sampling.",
            "Spectral flatness and the volume of intersections of p-ellipsoids.",
            "On the power of standard information for tractability for L2-approximation in the average case setting.",
            "Asymptotic analysis in multivariate average case approximation with Gaussian kernels.",
            "Influence of numerical discretizations on hitting probabilities for linear stochastic parabolic systems.",
            "Online gradient descent algorithms for functional data learning.",
            "Star discrepancy subset selection: Problem formulation and efficient approaches for low dimensions."
        ]
    },
    {
        "name": "JCOMPLEXITY",
        "year": "2021",
        "info": "2021: Volumes\n62,\n63,\n64,\n65,\n66,\n67",
        "count": 42,
        "papers": [
            "Fast computation of generic bivariate resultants.",
            "Quasi-Monte Carlo and ε-truncation dimension in ANOVA spaces.",
            "Instances of computational optimal recovery: Refined approximability models.",
            "The radii of sections of origin-symmetric convex bodies and their applications.",
            "Optimal subsampling for large-scale quantile regression.",
            "A closer look at covering number bounds for Gaussian kernels.",
            "Changes of the Editorial Board.",
            "David Krieg is the winner of the 2020 Joseph F. Traub Information-Based Complexity Young Researcher Award.",
            "Nominations for 2021 Joseph F. Traub Information-Based Complexity Young Researcher Award.",
            "Multi-task Learning in vector-valued reproducing kernel Banach spaces with the ℓ1 norm.",
            "The recovery of ridge functions on the hypercube suffers from the curse of dimensionality.",
            "Improved dispersion bounds for modified Fibonacci lattices.",
            "How anisotropic mixed smoothness affects the decay of singular numbers for Sobolev embeddings.",
            "A note on Korobov lattice rules for integration of analytic functions.",
            "Tractability for Volterra problems of the second kind with convolution kernels.",
            "On the complexity of extending the convergence ball of Wang's method for finding a zero of a derivative.",
            "Estimates for n-widths of sets of smooth functions on complex spheres.",
            "Non-convergence of stochastic gradient descent in the training of deep neural networks.",
            "On the complexity of fitted toral dynamics.",
            "Noisy polynomial interpolation modulo prime powers.",
            "Dense computability structures.",
            "Lower bounds for the error of quadrature formulas for Hilbert spaces.",
            "On optimal recovery in L2.",
            "Bounds for discrepancies in the Hamming space.",
            "Estimates of the asymptotic Nikolskii constants for spherical polynomials.",
            "Randomized Runge-Kutta method - Stability and convergence under inexact information.",
            "V. N. Temlyakov, M. Ullrich and T. Ullrich are the winners of the 2021 Joseph F. Traub Prize for Achievement in Information-Based Complexity.",
            "Digit-by-digit and component-by-component constructions of lattice rules for periodic functions with unknown smoothness.",
            "A note on (s, t)-weak tractability of the weighted star discrepancy of regular grids.",
            "Homotopy techniques for solving sparse column support determinantal polynomial systems.",
            "Regularization in a functional reproducing kernel Hilbert space.",
            "Optimal prediction for high-dimensional functional quantile regression in reproducing kernel Hilbert spaces.",
            "Function values are enough for L2-approximation: Part II.",
            "Robust pairwise learning with Huber loss.",
            "Tractability of approximation in the weighted Korobov space in the worst-case setting - a complete picture.",
            "Deterministic computation of the characteristic polynomial in the time of matrix multiplication.",
            "A note on EC-tractability of multivariate approximation in weighted Korobov spaces for the standard information class.",
            "Fast amortized multi-point evaluation.",
            "Bounds on Kolmogorov widths and sampling recovery for classes with small mixed smoothness.",
            "On the relation of the spectral test to isotropic discrepancy and Lq-approximation in Sobolev spaces.",
            "A quasi-Monte Carlo data compression algorithm for machine learning.",
            "On negative dependence properties of Latin hypercube samples and scrambled nets."
        ]
    },
    {
        "name": "JCOMPLEXITY",
        "year": "2020",
        "info": "2020: Volumes\n56,\n57,\n58,\n59,\n60,\n61",
        "count": 36,
        "papers": [
            "Fast multivariate multi-point evaluation revisited.",
            "Estimates of efficiency for two methods of stable numerical summation of smooth functions.",
            "On the complexity of extending the convergence region for Traub's method.",
            "Influence of the regularity of the test functions for weak convergence in numerical discretization of SPDEs.",
            "Optimal learning rates for distribution regression.",
            "Absolute value information for IBC problems.",
            "Stolarsky's invariance principle for projective spaces.",
            "On the optimality of the trigonometric system.",
            "Lower error bounds for the stochastic gradient descent optimization algorithm: Sharp convergence rates for slowly and fast decaying learning rates.",
            "ε-superposition and truncation dimensions in average and probabilistic settings for ∞-variate linear problems.",
            "Counting points on hyperelliptic curves with explicit real multiplication in arbitrary genus.",
            "On local analysis.",
            "Information based complexity for high dimensional sparse functions.",
            "A note on isotropic discrepancy and spectral test of lattice point sets.",
            "Optimal approximation order of piecewise constants on convex partitions.",
            "A note on the complexity of a phaseless polynomial interpolation.",
            "Sampling schemes and recovery algorithms for functions of few coordinate variables.",
            "Gauss-Newton methods with approximate projections for solving constrained nonlinear least squares problems.",
            "Iterative hard thresholding for compressed data separation.",
            "Exponential convergence of adaptive quarklet approximation.",
            "The Diamond ensemble: A constructive set of spherical points with small logarithmic energy.",
            "On the power of standard information for L2-approximation in the average case setting.",
            "Editorial board announcements.",
            "Heping Wang and Guiqiao Xu are the winners of the IBC Award 2020.",
            "On the worst-case error of least squares algorithms for L2-approximation with high probability.",
            "Strongly asymptotically optimal schemes for the strong approximation of stochastic differential equations with respect to the supremum error.",
            "Complexity of approximating Hölder classes from information with varying Gaussian noise.",
            "Directed evaluation.",
            "Computing syzygies in finite dimension using fast linear algebra.",
            "Algorithms and complexity for functions on general domains.",
            "Tractability properties of the discrepancy in Orlicz norms.",
            "On the fixed volume discrepancy of the Fibonacci sets in the integral norms.",
            "Expected dispersion of uniformly distributed points.",
            "Positive-Definite Functions, Exponential Sums and the Greedy Algorithm: a Curious Phenomenon.",
            "Exponential tractability of linear weighted tensor product problems in the worst-case setting for arbitrary linear functionals.",
            "Guest editors' preface."
        ]
    },
    {
        "name": "JCOMPLEXITY",
        "year": "2019",
        "info": "2019: Volumes\n50,\n51,\n52,\n53,\n54,\n55",
        "count": 40,
        "papers": [
            "Approximation numbers of Sobolev and Gevrey type embeddings on the sphere and on the ball - Preasymptotics, asymptotics, and tractability.",
            "The curse of dimensionality for numerical integration on general domains.",
            "A non-uniform discretization of stochastic heat equations with multiplicative noise on the unit sphere.",
            "Nonparametric regression using needlet kernels for spherical data.",
            "On explicit order 1.5 approximations with varying coefficients: The case of super-linear diffusion coefficients.",
            "Uniform recovery of high-dimensional Cr-functions.",
            "Function approximation with zonal function networks with activation functions analogous to the rectified linear unit functions.",
            "On the bit complexity of polynomial system solving.",
            "The minimal k-dispersion of point sets in high dimensions.",
            "Optimal pattern matching algorithms.",
            "Simple characterizations of exponential tractability for linear multivariate problems.",
            "IHP Meeting Special Issue.",
            "ABC on IBC.",
            "Asymptotic analysis of average case approximation complexity of additive random fields.",
            "Quantitative bounds for concentration-of-measure inequalities and empirical regression: The independent case.",
            "Some properties of block-radial functions and Schrödinger type operators with block-radial potentials.",
            "Mixed-level column augmented uniform designs.",
            "Solvable integration problems and optimal sample size selection.",
            "Optimality of orders one to three and beyond: Characterization and evaluation complexity in constrained nonconvex optimization.",
            "Tractability of multivariate approximation over weighted standard Sobolev spaces.",
            "Upper and lower estimates for numerical integration errors on spheres of arbitrary dimension.",
            "How complex is a random picture?",
            "Generalized adaptive versus nonadaptive recovery from noisy information.",
            "The isotropic constant of random polytopes with vertices on convex surfaces.",
            "Random bit multilevel algorithms for stochastic differential equations.",
            "Sharp estimates for approximation numbers of non-periodic Sobolev embeddings.",
            "Approximation complexity of sums of random processes.",
            "Generalized Kung-Traub method and its multi-step iteration in Banach spaces.",
            "Construction of highly redundant incoherent unit norm tight frames as a union of orthonormal bases.",
            "Normal numbers and nested perfect necklaces.",
            "Faster polynomial multiplication over finite fields using cyclotomic coefficient rings.",
            "Embeddings for infinite-dimensional integration and L2-approximation with increasing smoothness.",
            "Central limit theorems for multilevel Monte Carlo methods.",
            "Sampling discretization error of integral norms for function classes.",
            "Extremal distributions of discrepancy functions.",
            "A nonlocal functional promoting low-discrepancy point sets.",
            "Accelerated tower arithmetic.",
            "EC-tractability of approximation problems in function spaces defined over products of simplices.",
            "A note about EC-(s, t)-weak tractability of multivariate approximation with analytic Korobov kernels.",
            "EC-(s, t)-weak tractability of multivariate linear problems in the average case setting."
        ]
    },
    {
        "name": "JCOMPLEXITY",
        "year": "2018",
        "info": "2018: Volumes\n44,\n45,\n46,\n47,\n48,\n49",
        "count": 38,
        "papers": [
            "New Members of the Editorial Board.",
            "Takashi Goda and Larisa Yaroslavtseva share the 2017 Joseph F. Traub Information-Based Complexity Young Researcher Award.",
            "2018 Joseph F. Traub Information-Based Complexity Young Researcher Award: Nomination deadline: Sept. 30 2018.",
            "A topological view on algebraic computation models.",
            "A metric result for special sequences related to the Halton sequences.",
            "Tensor power sequences and the approximation of tensor product operators.",
            "Multivariate approximation for analytic functions with Gaussian kernels.",
            "Optimization approaches to quadrature: New characterizations of Gaussian quadrature on the line and quadrature with few nodes on plane algebraic curves, on the plane and in higher dimensions.",
            "(s, t)-weak tractability of Euler and Wiener integrated processes.",
            "On the linear independence of shifted powers.",
            "Semicomputable manifolds in computable topological spaces.",
            "On the dispersion of sparse grids.",
            "An upper bound on the minimal dispersion.",
            "Changes of the Editorial Board.",
            "Weak-norm posterior contraction rate of the 4DVAR method for linear severely ill-posed problems.",
            "Covering and separation of Chebyshev points for non-integrable Riesz potentials.",
            "Metric estimates and membership complexity for Archimedean amoebae and tropical hypersurfaces.",
            "ε-dimension in infinite dimensional hyperbolic cross approximation and application to parametric elliptic PDEs.",
            "Monte Carlo methods for uniform approximation on periodic Sobolev spaces with mixed smoothness.",
            "Tractability properties of the weighted star discrepancy of regular grids.",
            "Gaussian polytopes: A cumulant-based approach.",
            "Generalization properties of doubly stochastic learning algorithms.",
            "Novel results for the anisotropic sparse grid quadrature.",
            "Asymptotically tight worst case complexity bounds for initial-value problems with nonadaptive information.",
            "Universal discretization.",
            "Points on manifolds with asymptotically optimal covering radius.",
            "Breaking the curse for uniform approximation in Hilbert spaces via Monte Carlo methods.",
            "Modular composition via factorization.",
            "Gelfand numbers related to structured sparsity and Besov space embeddings with small mixed smoothness.",
            "The rank of random regular digraphs of constant degree.",
            "Recovery of derivatives for functions defined on the semiaxis.",
            "An upper bound on the smallest singular value of a square random matrix.",
            "On the complexity of computing the Lq norm.",
            "Average case (s, t)-weak tractability of non-homogeneous tensor product problems.",
            "On the linear complexity for multidimensional sequences.",
            "A fast and efficient composite Newton-Chebyshev method for systems of nonlinear equations.",
            "Identity testing and interpolation from high powers of polynomials of large degree over finite fields.",
            "Analysis of regularized least squares for functional linear regression model."
        ]
    },
    {
        "name": "JCOMPLEXITY",
        "year": "2017",
        "info": "2017: Volumes\n38,\n39,\n40,\n41,\n42,\n43",
        "count": 43,
        "papers": [
            "Some personal things about Joseph Traub.",
            "In Memory of Joseph F. Traub (1932-2015).",
            "Complexity of certain nonlinear two-point BVPs with Neumann boundary conditions.",
            "On combined component-by-component constructions of lattice point sets.",
            "A note on equivalence of anchored and ANOVA spaces; lower bounds.",
            "Product rules are optimal for numerical integration in classical smoothness spaces.",
            "Complexity of linear ill-posed problems in Hilbert space.",
            "A new characterization of (s, t)-weak tractability.",
            "Mario Hefter Wins the 2016 Joseph F. Traub Information-Based Complexity Young Researcher Award.",
            "2017 Joseph F. Traub Information-Based Complexity Young Researcher Award: Nomination deadline: Sept. 30 2017.",
            "The exact information-based complexity of smooth convex minimization.",
            "Adaptive approximation of the minimum of Brownian motion.",
            "Lower bounds by Birkhoff interpolation.",
            "Super-polynomial convergence and tractability of multivariate integration for infinitely times differentiable functions.",
            "On the Petras algorithm for verified integration of piecewise analytic functions.",
            "Preasymptotics and asymptotics of approximation numbers of anisotropic Sobolev embeddings.",
            "On second order orthogonal Latin hypercube designs.",
            "Winners of the 2016 Best Paper Award.",
            "(s, lnκ)-weak tractability of linear problems.",
            "Local adaption for approximation and minimization of univariate functions.",
            "An algebraic proof of the real number PCP theorem.",
            "Equivalence of weighted anchored and ANOVA spaces of functions with mixed smoothness of order one in Lp.",
            "Complexity of Banach space valued and parametric stochastic Itô integration.",
            "2017 Joseph F. Traub Prize for Achievement in Information-Based Complexity.",
            "On the computation of rational points of a hypersurface over a finite field.",
            "Gelfand numbers of embeddings of mixed Besov spaces.",
            "Łojasiewicz inequalities with explicit exponents for smallest singular value functions.",
            "On the Davenport-Mahler bound.",
            "Average-case complexity without the black swans.",
            "L∞-Approximation in Korobov spaces with exponential weights.",
            "Stable splittings of Hilbert spaces of functions of infinitely many variables.",
            "On non-polynomial lower error bounds for adaptive strong approximation of SDEs.",
            "Fast perfect simulation of Vervaat perpetuities.",
            "On the complexity of Anosov saddle transitions.",
            "Fast, deterministic computation of the Hermite normal form and determinant of a polynomial matrix.",
            "On the condition of the zeros of characteristic polynomials.",
            "Orthogonal projectors onto spaces of periodic splines.",
            "Small superposition dimension and active set construction for multivariate integration under modest error demand.",
            "Lebesgue constants for polyhedral sets and polynomial interpolation on Lissajous-Chebyshev nodes.",
            "Construction of uniform designs via an adjusted threshold accepting algorithm.",
            "Extended Traub-Woźniakowski convergence and complexity of Newton iteration in Banach space.",
            "Multi-task learning via linear functional strategy.",
            "Average case tractability of a multivariate approximation problem."
        ]
    },
    {
        "name": "JCOMPLEXITY",
        "year": "2016",
        "info": "2016: Volumes\n32, \n33,\n34,\n35,\n36,\n37",
        "count": 48,
        "papers": [
            "The Future of the Journal of Complexity.",
            "Mario Ullrich Wins the 2015 Joseph F. Traub Information-Based Complexity Young Researcher Award.",
            "On equivalence of weighted anchored and ANOVA spaces of functions with mixed smoothness of order one in L1 or L∞.",
            "Stability of the elastic net estimator.",
            "Optimal recovery of Besov classes of generalized smoothness and Sobolev classes on the sphere.",
            "Optimal recovery of operators and multidimensional Carlson type inequalities.",
            "On a projection-corrected component-by-component construction.",
            "Lower bounds for the approximation with variation-diminishing splines.",
            "New explicit-in-dimension estimates for the cardinality of high-dimensional hyperbolic crosses and approximation of functions having mixed smoothness.",
            "Approximation of piecewise Hölder functions from inexact information.",
            "Low-discrepancy sequences for piecewise smooth functions on the two-dimensional torus.",
            "On the convergence rate and some applications of regularized ranking algorithms.",
            "Digital nets with infinite digit expansions and construction of folded digital nets for quasi-Monte Carlo integration.",
            "Hyperbolic cross approximation in infinite dimensions.",
            "Enlarging the domain of starting points for Newton's method under center conditions on the first Fréchet-derivative.",
            "The maximum rate of convergence for the approximation of the fractional Lévy area at a single point.",
            "General convergence theorems for iterative processes and applications to the Weierstrass root-finding method.",
            "Lp- and -discrepancy of the symmetrized van der Corput sequence and modified Hammersley point sets in arbitrary bases.",
            "Open type quasi-Monte Carlo integration based on Halton sequences in weighted Sobolev spaces.",
            "Equivalence of anchored and ANOVA spaces via interpolation.",
            "On the discrepancy of jittered sampling.",
            "Thomas Müller-Gronbach, Klaus Ritter and Larisa Yaroslavtseva share the 2015 Best Paper Award.",
            "Nominations for 2016 Information-Based Complexity Young Researcher Award.",
            "Quiz games as a model for information hiding.",
            "A simplified criterion for quasi-polynomial tractability of approximation of random elements and its applications.",
            "A note on tractability of multivariate analytic problems.",
            "New lower bound estimates for quadratures of bounded analytic functions.",
            "An improved lower bound for the L2-discrepancy.",
            "A softly optimal Monte Carlo algorithm for solving bivariate polynomial systems over the integers.",
            "Optimal sampling points in reproducing kernel Hilbert spaces.",
            "Self-convexity and curvature.",
            "Newton's method on generalized Banach spaces.",
            "Linearization of nonlinear filter generators and its application to cryptanalysis of stream ciphers.",
            "A novel feedforward-feedback suboptimal control of linear time-delay systems.",
            "Very low truncation dimension for high dimensional integration under modest error demand.",
            "Linear and nonlinear approximation of spherical radial basis function networks.",
            "Optimal recovery of integral operators and its applications.",
            "Corrigendum to \"Multivariate approximation by translates of the Korobov function on Smolyak grids\" [J. Complexity 29 (2013) 424-437].",
            "Even faster integer multiplication.",
            "Average sampling numbers of multivariate periodic function spaces with a Gaussian measure.",
            "Weyl and Bernstein numbers of embeddings of Sobolev spaces with dominating mixed smoothness.",
            "Estimates for the entropy numbers of embedding operators of function spaces on sets with tree-like structure: Some limiting cases.",
            "Computing with polynomial ordinary differential equations.",
            "Multi-penalty regularization in learning theory.",
            "Tent-transformed lattice rules for integration and approximation of multivariate non-periodic functions.",
            "On the robustness of regularized pairwise learning methods based on kernels.",
            "Solving bivariate systems using Rational Univariate Representations.",
            "Energy and discrepancy of rotationally invariant determinantal point processes in high dimensional spheres."
        ]
    },
    {
        "name": "JCOMPLEXITY",
        "year": "2015",
        "info": "Volume 31: 2015",
        "count": 49,
        "papers": [
            "On lower complexity bounds for large-scale smooth convex optimization.",
            "Complexity of oscillatory integration for univariate Sobolev spaces.",
            "Tractability using periodized generalized Faure sequences.",
            "The descriptive complexity of stochastic integration.",
            "Complexity of the derivative-free solution of systems of IVPs with unknown singularity hypersurface.",
            "On construction of blocked general minimum lower-order confounding 2n-m: 2r designs with N/4+1 ≤ n ≤ 5N/16.",
            "On the complexity of computing quadrature formulas for marginal distributions of SDEs.",
            "Tino Ullrich Wins the 2014 Information-Based Complexity Young Researcher Award.",
            "Global solutions of Navier-Stokes equations for large initial data belonging to spaces with dominating mixed smoothness.",
            "A deterministic algorithm for inverting a polynomial matrix.",
            "High-dimensional integration on Rd, weighted Hermite spaces, and orthogonal transforms.",
            "On the complexity of computing with planar algebraic curves.",
            "Constructing good higher order polynomial lattice rules with modulus of reduced degree.",
            "Generalized Hofer-Niederreiter sequences and their discrepancy from an (u, e, s)-point of view.",
            "Center conditions on high order derivatives in the semilocal convergence of Newton's method.",
            "Bernd Carl, Aicke Hinrichs, and Philipp Rudolph share the 2014 Best Paper Award.",
            "Guest Editors' Preface.",
            "Distributing many points on spheres: Minimal energy and designs.",
            "Proof techniques in quasi-Monte Carlo theory.",
            "On permutation-invariance of limit theorems.",
            "Integration in Hermite spaces of analytic functions.",
            "On embeddings of weighted tensor product Hilbert spaces.",
            "Approximation of multivariate periodic functions by trigonometric polynomials based on sampling along rank-1 lattice with generating vector of Korobov form.",
            "Propagation rules for (u,m,e,s)-nets and (u,e,s)-sequences.",
            "On the star discrepancy of sequences in the unit interval.",
            "A remark on the numerical integration of harmonic functions in the plane.",
            "In memory of Nikolai Sergeevich Bakhvalov (1934-2005).",
            "In memory of Nikolai Sergeevich Bakhvalov (1934-2005).",
            "On the approximate calculation of multiple integrals.",
            "Analysis of discrete least squares on multivariate polynomial spaces with evaluations at low-discrepancy point sets.",
            "Approximation of multivariate periodic functions by trigonometric polynomials based on rank-1 lattice sampling.",
            "Algorithms for finding generalized minimum aberration designs.",
            "Polynomial-time algorithms for quadratic isomorphism of polynomials: The regular case.",
            "Exponential convergence-tractability of general linear problems in the average case setting.",
            "Accessibility of solutions of operator equations by Newton-like methods.",
            "Approximation of additive random fields based on standard information: Average case and probabilistic settings.",
            "Average sampling and space-frequency localized frames on bounded domains.",
            "Computational benefit of smoothness: Parameterized bit-complexity of numerical operators on analytic functions and Gevrey's hierarchy.",
            "New ultimate bound sets and exponential finite-time synchronization for the complex Lorenz system.",
            "Linear complexity of binary generalized cyclotomic sequences over GF(q).",
            "Two- and three-level lower bounds for mixture L2-discrepancy and construction of uniform designs by threshold accepting.",
            "NP-hardness of multiple bondage in graphs.",
            "Construction of second-order orthogonal sliced Latin hypercube designs.",
            "Joseph F. Traub, the Founding Editor of the Journal of Complexity, dies at 83.",
            "A Koksma-Hlawka inequality for general discrepancy systems.",
            "On integration methods based on scrambled nets of arbitrary size.",
            "Quasi-Monte Carlo tractability of high dimensional integration over products of simplices.",
            "Asymptotic analysis of average case approximation complexity of Hilbert space valued random elements.",
            "Nonlinear tensor product approximation of functions."
        ]
    },
    {
        "name": "JCOMPLEXITY",
        "year": "2014",
        "info": "Volume 30: 2014",
        "count": 48,
        "papers": [
            "Christoph Aistleitner Wins the 2013 Information-Based Complexity Young Researcher Award.",
            "Compressed sensing with sparse binary matrices: Instance optimal error guarantees in near-optimal time.",
            "A lower bound for the discrepancy of a random point set.",
            "The cost of deterministic, adaptive, automatic algorithms: Cones, not balls.",
            "Level permutation method for constructing uniform designs under the wrap-around L2-discrepancy.",
            "Quasi-polynomial tractability of linear problems in the average case setting.",
            "Weighted discrepancy and numerical integration in function spaces.",
            "On lower bounds for integration of multivariate permutation-invariant functions.",
            "Construction of uniform designs without replications.",
            "Guest Editors' Preface.",
            "Approximation of analytic functions in Korobov spaces.",
            "On weighted Hilbert spaces and integration of functions of infinitely many variables.",
            "Weak and quasi-polynomial tractability of approximation of infinitely differentiable functions.",
            "Approximation rates for the hierarchical tensor format in periodic Sobolev spaces.",
            "Optimal cubature in Besov spaces with dominating mixed smoothness on the unit square.",
            "Approximation numbers of Sobolev embeddings - Sharp constants and tractability.",
            "The curse of dimensionality for numerical integration of smooth functions II.",
            "Shu Tezuka, Joos Heintz, Bart Kuijpers, and Andrés Rojas Paredes Share the 2013 Best Paper Award.",
            "Efficient Monte Carlo simulation for integral functionals of Brownian motion.",
            "On the Carlitz rank of permutations of Fq and pseudorandom sequences.",
            "Discrepancy based model selection in statistical inverse problems.",
            "A semilocal convergence result for Newton's method under generalized conditions of Kantorovich.",
            "Tractability of approximation of ∞-variate functions with bounded mixed partial derivatives.",
            "An explicit construction of point sets with large minimum Dick weight.",
            "Construction of sliced (nearly) orthogonal Latin hypercube designs.",
            "A new semilocal convergence theorem for the Weierstrass method for finding zeros of a polynomial simultaneously.",
            "Frances Kuo Wins the 2014 Information-Based Complexity Prize.",
            "Nominations for 2015 Prize for Achievement in Information-Based Complexity.",
            "Tractability results for the weighted star-discrepancy.",
            "Complexity of parametric initial value problems in Banach spaces.",
            "Intrinsic complexity estimates in polynomial optimization.",
            "Fast CBC construction of randomly shifted lattice rules achieving O(n-1+δ) convergence for unbounded integrands over R5 in weighted spaces with POD weights.",
            "Estimating the ground state energy of the Schrödinger equation for convex potentials.",
            "s-numbers of compact embeddings of function spaces on quasi-bounded domains.",
            "Some s-numbers of embeddings in function spaces with polynomial weights.",
            "Two-step Newton methods.",
            "Announcement.",
            "Entropy numbers of convex hulls in Banach spaces and applications.",
            "Effective differential Nullstellensatz for ordinary DAE systems with constant coefficients.",
            "A new criterion for tractability of multivariate problems.",
            "A variant of Atanassov's method for (t, s)-sequences and (t, e, s)-sequences.",
            "Wang's B machines are efficiently universal, as is Hasenjaeger's small universal electromechanical toy.",
            "Analytical properties of resource-bounded real functionals.",
            "A condition-based algorithm for solving polyhedral feasibility problems.",
            "Orthogonal polynomial expansions on sparse grids.",
            "Uniform weak tractability of multivariate problems with increasing smoothness.",
            "Tractability of linear problems defined over Hilbert spaces.",
            "Complexity of parametric integration in various smoothness classes."
        ]
    },
    {
        "name": "JCOMPLEXITY",
        "year": "2013",
        "info": "Volume 29: 2013",
        "count": 28,
        "papers": [
            "Pawel Przybylowicz wins the 2012 Information-Based Complexity Young Researcher Award.",
            "Optimal Monte Carlo integration with fixed relative precision.",
            "The internal Steiner tree problem: Hardness and approximations.",
            "Efficient algorithms for the longest common subsequence problem with sequential substring constraints.",
            "On the complexity of solving quadratic Boolean systems.",
            "On tractability of approximation in special function spaces.",
            "Software Engineering and complexity in effective Algebraic Geometry.",
            "Erratum to \"Liberating the dimension for L2-approximation\" [Journal of Complexity 28 (2012) 304-319].",
            "Dmitriy Bilyk, Lutz Kämmerer, Stefan Kunis, Daniel Potts, Volodya Temlyakov and Rui Yu share the 2012 Best Paper Award.",
            "On the complexity of the multivariate resultant.",
            "On the Koksma-Hlawka inequality.",
            "On the decomposition of an NFSR into the cascade connection of an NFSR into an LFSR.",
            "On the inverse of the discrepancy for infinite dimensional infinite sequences.",
            "Vector-valued reproducing kernel Banach spaces with applications to multi-task learning.",
            "Numerical properties of generalized discrepancies on spheres of arbitrary dimension.",
            "On the discrepancy of generalized Niederreiter sequences.",
            "On the complexity of computing the Hausdorff distance.",
            "Efficient approximation of the solution of certain nonlinear reaction-diffusion equations with small absorption.",
            "Mixture discrepancy for quasi-random point sets.",
            "Algorithms for quaternion polynomial root-finding.",
            "An Arithmetic Poisson Formula for the multi-variate resultant.",
            "On tractability of linear tensor product problems for ∞∞-variate classes of functions.",
            "Quasi-Monte Carlo methods for integration of functions with dominating mixed smoothness in arbitrary dimension.",
            "On blocked resolution IV designs containing clear two-factor interactions.",
            "Probabilistic diophantine approximation and the distribution of Halton-Kronecker sequences.",
            "Multivariate approximation by translates of the Korobov function on Smolyak grids.",
            "Uniform weak tractability.",
            "On the Secant method."
        ]
    },
    {
        "name": "JCOMPLEXITY",
        "year": "2012",
        "info": "Volume 28: 2012",
        "count": 35,
        "papers": [
            "Weighted geometric discrepancies and numerical integration on reproducing kernel Hilbert spaces.",
            "Fibonacci sets and symmetrization in discrepancy theory.",
            "A Milstein-based free knot spline approximation for stochastic differential equations.",
            "Solving non-differentiable equations by a new one-point iterative method with memory.",
            "Tractability results for weighted Banach spaces of smooth functions.",
            "Interpolation lattices for hyperbolic cross trigonometric polynomials.",
            "Complexity bounds for second-order optimality in unconstrained optimization.",
            "Bit-size estimates for triangular sets in positive dimension.",
            "Derandomization of the Euler scheme for scalar stochastic differential equations.",
            "The independence of two randomness properties of sequences over finite fields.",
            "Hardness of discrepancy computation and ε-net verification in high dimension.",
            "Quasi-uniformity of minimal weighted energy points on compact metric spaces.",
            "On the complexity of the bondage and reinforcement problems.",
            "Periodic sequences with maximal N-adic complexity and large k-error N-adic complexity over ZI(N).",
            "Gelfand and Kolmogorov numbers of Sobolev embeddings of weighted function spaces.",
            "Constructing uniform designs: A heuristic integer programming method.",
            "On the power generator and its multivariate analogue.",
            "How do path generation methods affect the accuracy of quasi-Monte Carlo methods for problems in finance?",
            "Fast orthogonal transforms and generation of Brownian paths.",
            "Liberating the dimension for L2-approximation.",
            "A geometric algorithm for winding number computation with complexity analysis.",
            "A robust Kantorovich's theorem on the inexact Newton method with relative residual error tolerance.",
            "Weaker conditions for the convergence of Newton's method.",
            "Spherical Radon transform and the average of the condition number on certain Schubert subvarieties of a Grassmannian.",
            "Asymptotic behavior of average Lp-discrepancies.",
            "Ultrastability of nth minimal errors.",
            "On optimal two-level nonregular factorial split-plot designs.",
            "Widths of Besov classes of generalized smoothness on the sphere.",
            "Bilinear complexity of algebras and the Chudnovsky-Chudnovsky interpolation method.",
            "Thomas Daun, Leszek Plaskota, Greg W. Wasilkowski Win the 2011 Best Paper Award.",
            "Jean-Pierre Dedieu 1949-2012.",
            "Adaptive parameter choice for one-sided finite difference schemes and its application in diabetes technology.",
            "Average case tractability of non-homogeneous tensor product problems.",
            "Majorizing sequences for iterative procedures in Banach spaces.",
            "The Jackson inequality and widths of function classes in L2([0, 1], x2v+1)."
        ]
    },
    {
        "name": "JCOMPLEXITY",
        "year": "2011",
        "info": "Volume 27: 2011",
        "count": 37,
        "papers": [
            "Lower bounds for the complexity of linear functionals in the randomized setting.",
            "Rigorous confidence bounds for MCMC under a geometric drift condition.",
            "A unifying theorem for Newton's method on spaces with a convergence structure.",
            "Optimal learning rates for least squares regularized regression with unbounded sampling.",
            "Parameter choice methods using minimization schemes.",
            "Liberating the dimension for function approximation.",
            "Local convergence analysis of the Gauss-Newton method under a majorant condition.",
            "On lower bounds for the L2-discrepancy.",
            "Deterministic sampling of sparse trigonometric polynomials.",
            "Complexity of approximation of functions of few variables in high dimensions.",
            "Lower complexity bounds for interpolation algorithms.",
            "A consistent algorithm to solve Lasso, elastic-net and Tikhonov regularization.",
            "On the widths of Sobolev classes.",
            "Dynamics of a higher-order family of iterative methods.",
            "On the tensor rank of multiplication in any extension of Fs.",
            "Computation of Darboux polynomials and rational first integrals with bounded degree in polynomial time.",
            "Guest Editors' Preface.",
            "On positive positive-definite functions and Bochner's Theorem.",
            "Tractability of tensor product problems in the average case setting.",
            "Construction algorithms for higher order polynomial lattice rules.",
            "On the randomized solution of initial value problems.",
            "Quasi-polynomial tractability.",
            "Deterministic multi-level algorithms for infinite-dimensional integration on RN.",
            "The randomized complexity of indefinite integration.",
            "Complexity of numerical integration over spherical caps in a Sobolev space setting.",
            "A lower bound on complexity of optimization under the r-fold integrated Wiener measure.",
            "Liberating the dimension for function approximation: Standard information.",
            "Geometric isomorphism check for symmetric factorial designs.",
            "Existence and construction of shifted lattice rules with an arbitrary number of points and bounded weighted star discrepancy for general decreasing weights.",
            "B-spline quasi-interpolation on sparse grids.",
            "Covering numbers of Gaussian reproducing kernel Hilbert spaces.",
            "Aicke Hinrichs, Simon Foucart, Alain Pajor, Holger Rauhut, Tino Ullrich win the 2010 Best Paper Award.",
            "Tractability of infinite-dimensional integration in the worst case and randomized settings.",
            "Optimal cubature formulas for tensor products of certain classes of functions.",
            "Covering numbers, dyadic chaining and discrepancy.",
            "B-spline quasi-interpolant representations and sampling recovery of functions with mixed smoothness.",
            "Marcinkiewicz-Zygmund measures on manifolds."
        ]
    },
    {
        "name": "JCOMPLEXITY",
        "year": "2010",
        "info": "Volume 26: 2010",
        "count": 35,
        "papers": [
            "New general convergence theory for iterative processes and its applications to Newton-Kantorovich type theorems.",
            "On the structure of digital explicit nonlinear and inversive pseudorandom number generators.",
            "Fast discrete algorithms for sparse Fourier expansions of high dimensional functions.",
            "Product Gauss quadrature rules vs. cubature rules in the meshless local Petrov-Galerkin method.",
            "Optimal approximation of elliptic problems by linear and nonlinear mappings IV: Errors in L2 and other norms.",
            "Optimal importance sampling for the approximation of integrals.",
            "Randomly shifted lattice rules with the optimal rate of convergence for unbounded integrands.",
            "Stochastic perturbations and smooth condition numbers.",
            "On multiplication in finite fields.",
            "Integral operators generated by multi-scale kernels.",
            "On the effectiveness of a generalization of Miller's primality theorem.",
            "On strata of degenerate polyhedral cones, II: Relations between condition measures.",
            "Multi-level Monte Carlo algorithms for infinite-dimensional integration on RN.",
            "Adversarial smoothed analysis.",
            "A low complexity probabilistic test for integer multiplication.",
            "Convergence behavior of Gauss-Newton's method and extensions of the Smale point estimate theory.",
            "Computational complexity of tissue-like P systems.",
            "Improved generalized differentiability conditions for Newton-like methods.",
            "The approximation characteristic of diagonal matrix in probabilistic setting.",
            "Nearly optimal algorithms for the decomposition of multivariate rational functions and the extended Lüroth Theorem.",
            "Hardness of comparing two run-length encoded strings.",
            "Approximation of high-dimensional kernel matrices by multilevel circulant matrices.",
            "Guest Editors' Preface.",
            "Tractability through increasing smoothness.",
            "Liberating the dimension.",
            "Dimension-wise integration of high-dimensional functions with applications to finance.",
            "Algorithmic construction of low-discrepancy point sets via dependent randomized rounding.",
            "Spatially adaptive sparse grids for high-dimensional data-driven problems.",
            "The smoothing effect of the ANOVA decomposition.",
            "An overlapping additive Schwarz preconditioner for interpolation on the unit sphere with spherical radial basis functions.",
            "Inexact Newton-type methods.",
            "Optimal recovery of isotropic classes of twice-differentiable multivariate functions.",
            "A lifting and recombination algorithm for rational factorization of sparse polynomials.",
            "The Gelfand widths of lp-balls for 0p<=1.",
            "Radial kernels and their reproducing kernel Hilbert spaces."
        ]
    },
    {
        "name": "JCOMPLEXITY",
        "year": "2009",
        "info": "Volume 25: 2009",
        "count": 41,
        "papers": [
            "Editorial Board Changes.",
            "The use of higher order finite difference schemes is not dangerous.",
            "Explicit error bounds for lazy reversible Markov chain Monte Carlo.",
            "Some lower bounds for the complexity of the linear programming feasibility problem over the reals.",
            "General local convergence theory for a class of iterative processes and its applications to Newton's method.",
            "Complexity of Gaussian-radial-basis networks approximating smooth functions.",
            "An algorithmic approach to finding factorial designs with generalized minimum aberration.",
            "Optimal learning of bandlimited functions from localized sampling.",
            "Finding optimal volume subintervals with k points and calculating the star discrepancy are NP-hard problems.",
            "Smale's point estimate theory for Newton's method on Lie groups.",
            "Energies, group-invariant kernels and numerical integration on compact manifolds.",
            "High resolution quantization and entropy coding of jump processes.",
            "Learning from uniformly ergodic Markov chains.",
            "Elastic-net regularization in learning theory.",
            "Guest editors' preface: Issue dedicated to Professor Frank Stenger.",
            "An Alternating-Direction Sinc-Galerkin method for elliptic problems.",
            "Numerical study of pressure distribution in entrance pipe flow.",
            "New averaging technique for approximating weighted integrals.",
            "Polynomial function and derivative approximation of Sinc data.",
            "Weighted approximation by entire functions interpolating at finitely or infinitely many points on the real line.",
            "On probabilistic results for the discrepancy of a hybrid-Monte Carlo sequence.",
            "Generalized von Neumann-Kakutani transformation and random-start scrambled Halton sequences.",
            "Fast algorithms for multivariate interpolation and evaluation at special points.",
            "A note about the average number of real roots of a Bernstein polynomial system.",
            "An optimization of Chebyshev's method.",
            "Approximation of functions on the Sobolev space on the sphere in the average case setting.",
            "Optimal in-place transposition of rectangular matrices.",
            "When is 'nearest neighbour' meaningful: A converse theorem and implications.",
            "Approximation of infinitely differentiable multivariate functions is intractable.",
            "Duality for digital sequences.",
            "On the tractability of linear tensor product problems in the worst case.",
            "A fast Petrov-Galerkin method for solving the generalized airfoil equation.",
            "Oracle inequalities for support vector machines that are based on random entropy numbers.",
            "Randomized approximation of Sobolev embeddings, II.",
            "Randomized approximation of Sobolev embeddings, III.",
            "Our Silver Anniversary.",
            "Changes to the Editorial Board.",
            "Iterative root approximation in p-adic numerical analysis.",
            "On the weakening of the convergence of Newton's method using recurrent functions.",
            "On the approximation of smooth functions using generalized digital nets.",
            "Tractability of the Helmholtz equation with non-homogeneous Neumann boundary conditions: The relation to the L2-approximation."
        ]
    },
    {
        "name": "JCOMPLEXITY",
        "year": "2008",
        "info": "Volume 24: 2008",
        "count": 37,
        "papers": [
            "Guest Editor's Preface.",
            "An explicit solution to Post's Problem over the reals.",
            "Characterizing Valiant's algebraic complexity classes.",
            "Finding a vector orthogonal to roughly half a collection of vectors.",
            "Analytic reparametrization of semi-algebraic sets.",
            "The randomized complexity of initial value problems.",
            "On the number of minima of a random polynomial.",
            "New Brownian bridge construction in quasi-Monte Carlo methods for computational finance.",
            "Tractability properties of the weighted star discrepancy.",
            "Successive minima profile, lattice profile, and joint linear complexity profile of pseudorandom multisequences.",
            "Bracketing numbers for axis-parallel boxes and applications to geometric discrepancy.",
            "Finding a longest common subsequence between a run-length-encoded string and an uncompressed string.",
            "A note on a modification of Moser's method.",
            "Approximation of anisotropic classes by standard information.",
            "On the probabilistic complexity of finding an approximate solution for linear programming.",
            "A modified Newton-Lavrentiev regularization for nonlinear ill-posed Hammerstein-type operator equations.",
            "The covering number for some Mercer kernel Hilbert spaces.",
            "Relative widths of smooth functions determined by fractional order derivatives.",
            "Lattice rule algorithms for multivariate approximation in the average case setting.",
            "On obtaining higher order convergence for smooth periodic functions.",
            "Adaptivity and computational complexity in the numerical solution of ODEs.",
            "Approximation complexity of additive random fields.",
            "Obtaining fast error rates in nonconvex situations.",
            "The complexity of function approximation on Sobolev spaces with bounded mixed derivative by linear Monte Carlo methods.",
            "The asymptotic normalized linear complexity of multisequences.",
            "Newton's method for sections on Riemannian manifolds: Generalized covariant alpha-theory.",
            "Optimal adaptive solution of initial-value problems with unknown singularities.",
            "Are unbounded linear operators computable on the average for Gaussian measures?",
            "On the probability distribution of data at points in real complete intersection varieties.",
            "Effective Pólya semi-positivity for non-negative polynomials on the simplex.",
            "Widths of embeddings in function spaces.",
            "On the exact t-value of Niederreiter and Sobol' sequences.",
            "A numerical algorithm for zero counting, I: Complexity and accuracy.",
            "Parzen windows for multi-class classification.",
            "Learning rates for regularized classifiers using multivariate polynomial kernels.",
            "Integral operators on the sphere generated by positive definite smooth kernels.",
            "On the linear complexity of Sidel'nikov sequences over nonprime fields."
        ]
    },
    {
        "name": "JCOMPLEXITY",
        "year": "2007",
        "info": "Volume 23: 2007",
        "count": 54,
        "papers": [
            "From the Editors.",
            "On the complexity of computing the logarithm and square root functions on a complex domain.",
            "A component-by-component approach to efficient numerical integration over products of spheres.",
            "On regularization algorithms in learning theory.",
            "Approximation of infinitely differentiable multivariate functions is not strongly tractable.",
            "Counting solutions to binomial complete intersections.",
            "Multi-kernel regularized classifiers.",
            "On the complexity of Putinar's Positivstellensatz.",
            "Complexity and effective dimension of discrete Lévy areas.",
            "Error linear complexity measures for multisequences.",
            "Factoring bivariate sparse (lacunary) polynomials.",
            "On the complexity of p-adic basic semi-algebraic sets.",
            "Regularization by truncated Cholesky factorization: A comparison of four different approaches.",
            "A primal-dual symmetric relaxation for homogeneous conic systems.",
            "Generalized tractability for multivariate problems Part I: Linear tensor product problems and linear information.",
            "A survey of randomized algorithms for control synthesis and performance verification.",
            "Polynomial differential equations compute all real computable functions on computable compact intervals.",
            "Fast Lagrange-Newton transformations.",
            "On the construction of optimal cubature formulae which use integrals over hyperspheres.",
            "On the complexity of deciding connectedness and computing Betti numbers of a complex algebraic variety.",
            "Lifting and recombination techniques for absolute factorization.",
            "Issue dedicated to Professor Henryk Wozniakowski.",
            "On the counting function of the lattice profile of periodic sequences.",
            "Strong tractability of multivariate integration of arbitrary high order using digitally shifted polynomial lattice rules.",
            "Regularized collocation method for Fredholm integral equations of the first kind.",
            "Wavelet para-bases and sampling numbers in function spaces on domains.",
            "CBS constants for multilevel splitting of graph-Laplacian and application to preconditioning of discontinuous Galerkin systems.",
            "Pseudorandom numbers and entropy conditions.",
            "Quadrature in Besov spaces on the Euclidean sphere.",
            "A note on the complexity and tractability of the heat equation.",
            "Error propagation of general linear methods for ordinary differential equations.",
            "On the existence of higher order polynomial lattices based on a generalized figure of merit.",
            "A note on parallel and alternating time.",
            "Searching for extensible Korobov rules.",
            "Optimal approximation of elliptic problems by linear and nonlinear mappings III: Frames.",
            "A note on the existence of sequences with small star discrepancy.",
            "Optimal recovery of solutions of the generalized heat equation in the unit ball from inaccurate data.",
            "Discrepancy with respect to convex polygons.",
            "Simple Monte Carlo and the Metropolis algorithm.",
            "Tensor-product approximation to operators and functions in high dimensions.",
            "BDDC methods for discontinuous Galerkin discretization of elliptic problems.",
            "An effective algorithm for generation of factorial designs with generalized minimum aberration.",
            "Lattice-Nyström method for Fredholm integral equations of the second kind with convolution type kernels.",
            "Sampling numbers and function spaces.",
            "Quantum lower bounds by entropy numbers.",
            "On the complexity of the multivariate Sturm-Liouville eigenvalue problem.",
            "Cubature formulas for function spaces with moderate smoothness.",
            "Disintegration of Gaussian measures and average-case optimal algorithms.",
            "Free-knot spline approximation of stochastic processes.",
            "On the best interval quadrature formulae for classes of differentiable periodic functions.",
            "Deterministic constructions of compressed sensing matrices.",
            "On linear codes with large weights simultaneously for the Rosenbloom-Tsfasman and Hamming metrics.",
            "Computation of local radius of information in SM-IBC identification of nonlinear systems.",
            "A note on two fixed point problems."
        ]
    },
    {
        "name": "JCOMPLEXITY",
        "year": "2006",
        "info": "Volume 22: 2006",
        "count": 49,
        "papers": [
            "Special issue.",
            "Fast component-by-component construction of rank-1 lattice rules with a non-prime number of points.",
            "Optimal approximation of elliptic problems by linear and nonlinear mappings I.",
            "Optimal algorithms for global optimization in case of unknown Lipschitz constant.",
            "Randomly shifted lattice rules on the unit cube for unbounded integrands in high dimensions.",
            "Approximation by neural networks and learning theory.",
            "On the complexity of parabolic initial-value problems with variable drift.",
            "Counting complexity classes for numeric computations II: Algebraic and semialgebraic sets.",
            "Monte Carlo approximation of weakly singular integral operators.",
            "The randomized information complexity of elliptic PDE.",
            "Computational complexity of diagram satisfaction in Euclidean geometry.",
            "Enumeration results on linear complexity profiles and lattice profiles.",
            "The P ne NP conjecture in the context of real and complex analysis.",
            "Solving linear programs with finite precision: II. Algorithms.",
            "Improved upper bounds on the star discrepancy of (t, m, s)-nets and (t, s)-sequences.",
            "Weighted quadrature formulas and approximation by zonal function networks on the sphere.",
            "The discretized discrepancy principle under general source conditions.",
            "Expansion and linear complexity of the coordinate sequences over Galois rings.",
            "On the complexity of the resolvent representation of some prime differential ideals.",
            "Corrigendum to \"On the expressiveness and decidability of o-minimal hybrid systems\" [J. Complexity 21 (2005) 447-478].",
            "A central limit theorem and improved error bounds for a hybrid-Monte Carlo sequence with applications in computational finance.",
            "Optimal approximation of SDE's with additive fractional noise.",
            "A numerical-symbolic algorithm for computing the multiplicity of a component of an algebraic set.",
            "The weighted b-adic diaphony.",
            "Complexity of initial-value problems for ordinary differential equations of order k.",
            "Uniqueness of the singular points of vector fields on Riemannian manifolds under the gamma-condition.",
            "Optimal approximation of elliptic problems by linear and nonlinear mappings II.",
            "Guest Editors' preface.",
            "On the mean square weighted L2 discrepancy of randomized digital nets in prime base.",
            "Randomly shifted lattice rules for unbounded integrands.",
            "Exact cubature for a class of functions of maximum effective dimension.",
            "A lower bound for the Sturm-Liouville eigenvalue problem on a quantum computer.",
            "Almost optimal solution of initial-value problems by randomized and quantum algorithms.",
            "The quantum query complexity of elliptic PDE.",
            "Computability and complexity in analysis.",
            "Ideals in constructive Banach algebra theory.",
            "Randomness and universal machines.",
            "A sequentially computable function that is not effectively continuous at any point.",
            "Representing probability measures using probabilistic processes.",
            "Generalized functions with pseudobounded support in constructive mathematics.",
            "On the complexity of finding circumscribed rectangles and squares for a two-dimensional domain.",
            "A hierarchy of Turing degrees of divergence bounded computable real numbers.",
            "Effectively open real functions.",
            "Random non-cupping revisited.",
            "Towards computability of elliptic boundary value problems in variational formulation.",
            "Pre-apartness structures on spaces of functions.",
            "Effective continuities on effective topological spaces.",
            "The basic feasible functionals in computable analysis.",
            "Computing Schrödinger propagators on Type-2 Turing machines."
        ]
    },
    {
        "name": "JCOMPLEXITY",
        "year": "2005",
        "info": "Volume 21: 2005",
        "count": 48,
        "papers": [
            "Guest editors' preface.",
            "Analytic residues along algebraic cycles.",
            "Improved algorithms for computing determinants and resultants.",
            "Essentially optimal computation of the inverse of generic polynomial matrices.",
            "On solving univariate sparse polynomials in logarithmic time.",
            "Semialgebraic complexity of functions.",
            "Multivariate integration in weighted Hilbert spaces based on Walsh functions and weighted Sobolev spaces.",
            "Quasi-Monte Carlo methods can be efficient for integration over products of spheres.",
            "Information-based nonlinear approximation: an average case setting.",
            "Multi-sequences with d-perfect property.",
            "Fast solvers of integral equations of the second kind: wavelet methods.",
            "Simultaneous greedy approximation in Banach spaces.",
            "Approximation on anisotropic Besov classes with mixed norms by standard information.",
            "A note on level-2 condition numbers.",
            "A note on E. Thiémard's algorithm to compute bounds for the star discrepancy.",
            "On the joint linear complexity profile of explicit inversive multisequences.",
            "Mercer theorem for RKHS on noncompact sets.",
            "Learning with generalization capability by kernel methods of bounded complexity.",
            "Stefan Heinrich wins the 2004 Best Paper Award.",
            "Ian Sloan wins the 2005 Information-Based Complexity Prize.",
            "2005 Information-Based Complexity Young Researcher Award Committee.",
            "Festschrift in honor of Arnold Scho\"nhage.",
            "Generalized polar varieties: geometry and algorithms.",
            "On the number of multiplications needed to invert a monic power series over fields of characteristic two.",
            "Polynomial evaluation and interpolation on special sets of points.",
            "On the expressiveness and decidability of o-minimal hybrid systems.",
            "Generalized Budan-Fourier theorem and virtual roots.",
            "Symplectic methods for the approximation of the exponential map and the Newton iteration on Riemannian submanifolds.",
            "Numeric vs. symbolic homotopy algorithms in polynomial system solving: a case study.",
            "Weak Bézout inequality for D-modules.",
            "Complexity of integer quasiconvex polynomial optimization.",
            "P=NP for some structures over the binary words.",
            "Two situations with unit-cost: ordered abelian semi-groups and some commutative rings.",
            "An intrinsic homotopy for intersecting algebraic varieties.",
            "The shifted number system for fast linear algebra on integer matrices.",
            "2005 Best Paper Award Committee.",
            "Numerical analysis of a bisection-exclusion method to find zeros of univariate analytic functions.",
            "Bounds and constructions for the star-discrepancy via ?-covers.",
            "On the necessity of low-effective dimension.",
            "Optimal quadrature problem on Hardy-Sobolev classes.",
            "Improved bounds on the randomized and quantum complexity of initial-value problems.",
            "Lower bounds for wrap-around L2-discrepancy and constructions of symmetrical uniform designs.",
            "On the Kostlan-Shub-Smale model for random polynomial systems. Variance of the number of roots.",
            "Optimal lower bounds for cubature error on the sphere S2.",
            "The expectation and variance of the joint linear complexity of random periodic multisequences.",
            "Non-existence of degree bounds for weighted sums of squares representations.",
            "On point energies, separation radius and mesh norm for s-extremal configurations on compact sets in Rn.",
            "Discretized Tikhonov-Phillips regularization for a naturally linearized parameter identification problem."
        ]
    },
    {
        "name": "JCOMPLEXITY",
        "year": "2004",
        "info": "Volume 20: 2004",
        "count": 52,
        "papers": [
            "From the Editors.",
            "Quantum approximation I. Embeddings of finite-dimensional Lp spaces.",
            "Quantum approximation II. Sobolev embeddings.",
            "Finite-order weights imply tractability of multivariate integration.",
            "Quantum complexity of parametric integration.",
            "Smoothed analysis of kappa(A).",
            "Optimal designs for weighted approximation and integration of stochastic processes on [0, infinity).",
            "Special issue on cryptography and coding theory.",
            "A short biography of Harald Niederreiter.",
            "A class of I.P.P. codes with efficient identification.",
            "On the complexity of the discrete logarithm and Diffie-Hellman problems.",
            "Linear recurrences with polynomial coefficients.",
            "On the confusion and diffusion properties of Maiorana-McFarland's and extended Maiorana-McFarland's functions.",
            "Highly nonlinear mappings.",
            "Normal Boolean functions.",
            "On the constructions and nonlinearity of binary vector-output correlation-immune functions.",
            "On counting and generating curves over small finite fields.",
            "A simple proof to the minimum distance of Z4-linear Goethals-like codes.",
            "Distributional properties of d-FCSR sequences.",
            "Z8-Kerdock codes and pseudorandom binary sequences.",
            "Computing zeta functions of Artin-Schreier curves over finite fields II.",
            "On the linear complexity profile of some new explicit inversive pseudorandom numbers.",
            "Oblivious keyword search.",
            "On maximum length convolutional codes under a trellis complexity constraint.",
            "Classical and quantum function reconstruction via character evaluation.",
            "Noisy Chinese remaindering in the Lee norm.",
            "On Viterbi-like algorithms and their application to Reed-Muller codes.",
            "Shared generation of pseudo-random functions.",
            "Covering numbers, Vapnik-ervonenkis classes and bounds for the star-discrepancy.",
            "On the complexity of curve fitting algorithms.",
            "On the convergence rate of the component-by-component construction of good lattice rules.",
            "On invariance of degree for certain computations.",
            "On the complexity of Schmu\"dgen's Positivstellensatz.",
            "Bifurcations of limit cycles from Quintic Hamiltonian systems with a double figure eight loop.",
            "On the tractability of multivariate integration and approximation by neural networks.",
            "Guest Editors' Preface.",
            "Liberating the weights.",
            "On polynomial-time property for a class of randomized quadratures.",
            "On the root mean square weighted L2 discrepancy of scrambled nets.",
            "Quasi-Monte Carlo algorithms for unbounded, weighted integration problems.",
            "Sharp error bounds on quantum Boolean summation in various settings.",
            "The power of various real-valued quantum queries.",
            "Average case quantum lower bounds for computing the Boolean mean.",
            "On the global error of Itô-Taylor schemes for strong approximation of scalar stochastic differential equations.",
            "Local quadrature formulas on the sphere.",
            "Lower bound on complexity of optimization of continuous functions.",
            "Asymptotic setting (revisited): analysis of a boundary-value problem and a relation to a classical approximation result.",
            "Linear vs. nonlinear algorithms for linear problems.",
            "Randomized and quantum algorithms yield a speed-up for initial-value problems.",
            "Real recursive functions and their hierarchy.",
            "Probabilistic and average widths of multivariate Sobolev spaces with mixed derivative equipped with the Gaussian measure.",
            "Sharp asymptotics of the metric entropy for ellipsoids."
        ]
    },
    {
        "name": "JCOMPLEXITY",
        "year": "2003",
        "info": "Volume 19: 2003",
        "count": 49,
        "papers": [
            "On a problem in quantum summation.",
            "Quantum integration in Sobolev classes.",
            "On the complexity of the multiplication of matrices of small formats.",
            "The expected value of the joint linear complexity of periodic multisequences.",
            "Probabilistic and average linear widths of Sobolev space with Gaussian measure.",
            "How to minimize the cost of iterative methods in the presence of perturbations.",
            "The effective dimension and quasi-Monte Carlo integration.",
            "P != NC over the p-adic numbers.",
            "Algorithmic analysis of irrational rotations in a single neuron model.",
            "Algebra complexity problems involving graph homomorphism, semigroups and the constraint satisfaction problem.",
            "Systems of rational polynomial equations have polynomial size approximate zeros on the average.",
            "Orthogonal rational functions and quadrature on the real half line.",
            "Energy functionals, numerical integration and asymptotic equidistribution on the sphere.",
            "Gaussian rules on unbounded intervals.",
            "Error bounds for the integration of singular functions using equidistributed sequences.",
            "Some theoretical aspects of generalised quadrature methods.",
            "The existence of good extensible rank-1 lattices.",
            "Component-by-component constructions achieve the optimal rate of convergence for multivariate integration in weighted Korobov and Sobolev spaces.",
            "Notes on lattice rules.",
            "Sufficient conditions for fast quasi-Monte Carlo convergence.",
            "Cubature formulas, discrepancy, and nonlinear approximation.",
            "Lower bound for the number of nodes of cubature formulae on the unit ball.",
            "On the (non)-existence of some cubature formulas: gaps between a theory and its applications.",
            "Marcinkiewicz-Zygmund inequalities and the numerical approximation of singular integrals for exponential weights: methods, results and open problems, some new, some old.",
            "Some open problems concerning the star-discrepancy.",
            "My dream quadrature rule.",
            "Some current issues in quasi-Monte Carlo methods.",
            "Open problems for tractability of multivariate integration.",
            "An encyclopaedia of cubature formulas.",
            "Vector greedy algorithms.",
            "Probabilistic analysis of a differential equation for linear programming.",
            "On the tractability of the Brownian Bridge algorithm.",
            "Bounds for the weighted Lp discrepancy and tractability of integration.",
            "Some remarks on the condition number of a real random square matrix.",
            "Linear algorithms for recovering linear functionals from jittered information.",
            "Computing the equidimensional decomposition of an algebraic closed set by means of lifting fibers.",
            "An efficient parallel algorithm for scheduling interval ordered tasks.",
            "Integration error for multivariate functions from anisotropic classes .",
            "Use of algebraically independent numbers for zero recognition of polynomial terms.",
            "Multivariate integration in Cinfinity([0, 1]d) is not strongly tractable.",
            "Analog computers and recursive functions over the reals.",
            "A note on different covering numbers in learning theory.",
            "On the hierarchy and extension of monotonically computable real numbers.",
            "Lower bounds for centered and wrap-around L2-discrepancies and construction of uniform designs by threshold accepting.",
            "Five- and six-dimensional lattice rules generated by structured matrices.",
            "Worst case complexity of multivariate Feynman-Kac path integration.",
            "I-binomial scrambling of digital nets and sequences.",
            "Where does smoothness count the most for Fredholm equations of the second kind with noisy information?",
            "A recursive algorithm for the infinity-norm fixed point problem."
        ]
    },
    {
        "name": "JCOMPLEXITY",
        "year": "2002",
        "info": "Volume 18: 2002",
        "count": 49,
        "papers": [
            "Quantum Summation with an Application to Integration.",
            "A Theory of Complexity for Continuous Time Systems.",
            "Linear Complexity, k-Error Linear Complexity, and the Discrete Fourier Transform.",
            "Real Computations with Fake Numbers.",
            "The Discrepancy and Gain Coefficients of Scrambled Digital Nets.",
            "Learnability in Hilbert Spaces with Reproducing Kernels.",
            "The Brownian Bridge Does Not Offer a Consistent Advantage in Quasi-Monte Carlo Integration.",
            "Newton's Method for Analytic Systems of Equations with Constant Rank Derivatives.",
            "Input-Output Identifiability of Continuous-Time Linear Systems.",
            "On Asymptotically Optimal Methods of Prediction and Adaptive Coding for Markov Sources.",
            "Complexity Theory for Lie-Group Solvers.",
            "Relations between Classical, Average, and Probabilistic Kolmogorov Widths.",
            "Kantorovich's Theorem on Newton's Method in Riemannian Manifolds.",
            "Worst Case Complexity of Weighted Approximation and Integration over Rd.",
            "Complexity Estimates for Representations of Schmu\"dgen Type.",
            "Computation of Edit Probabilities and Edit Distances for the A5-Type Keystream Generator.",
            "The New k-Windows Algorithm for Improving the k-Means Clustering Algorithm.",
            "Dagstuhl 2000.",
            "Linear vs Standard Information for Scalar Stochastic Differential Equations.",
            "On the L2-Discrepancy of the Sobol-Hammersley Net in Dimension 3.",
            "On the Representation of Band Limited Functions Using Finitely Many Bits.",
            "Tractability of Integration in Non-periodic and Periodic Weighted Tensor Product Hilbert Spaces.",
            "Direct Estimation of Linear Functionals from Indirect Noisy Observations.",
            "Average Case Complexity of Weighted Approximation and Integration over R+.",
            "Joint AMS-SIAM Conference.",
            "Piecewise Linear Approximation of Smooth Compact Fibers.",
            "Extra-Updates Criterion for the Limited Memory BFGS Algorithm for Large Scale Nonlinear Optimizatio.",
            "On the Complexity of Exclusion Algorithms for Optimization.",
            "Verifying Topological Indices for Higher-Order Rank Deficiencies.",
            "On the Complexity of Isolating Real Roots and Computing with Certainty the Topological Degree.",
            "A Two-Dimensional Bisection Envelope Algorithm for Fixed Points.",
            "What Is the Complexity of Volume Calculation?",
            "FROM THE EDITOR.",
            "2001 Best Paper Award.",
            "2002 Best Paper Award Committee.",
            "2002 Prize for Achievement in Information-Based Complexity.",
            "A Constructive Approach to Strong Tractability Using Quasi-Monte Carlo Algorithms.",
            "Complexity of Nonlinear Two-Point Boundary-Value Problems.",
            "The covering number in learning theory.",
            "Support Vector Machines are Universally Consistent.",
            "Applicability of Smolyak's Algorithms to Certain Banach Spaces of Multivariate Functions.",
            "The Infinite-Dimensional Widths and Optimal Recovery of Generalized Besov Classes.",
            "Interior-Point Methods: Worst Case and Average Case Analysis of a Phase-I Algorithm and a Termination Procedure.",
            "2003 Information-Based Complexity Prize Committee.",
            "Topological Complexity of Zero Finding with Algebraic Operations.",
            "Component-by-Component Construction of Good Lattice Rules with a Composite Number of Points.",
            "An Analog Characterization of the Grzegorczyk Hierarchy.",
            "Kolmogorov Width of Classes of Smooth Functions on the Sphere Sd-1.",
            "Complete on Average Boolean Satisfiability."
        ]
    },
    {
        "name": "JCOMPLEXITY",
        "year": "2001",
        "info": "Volume 17: 2001",
        "count": 43,
        "papers": [
            "Quantum Computing.",
            "Quantum Complexity of Integration.",
            "P != NP for the Reals with Various Analytic Functions.",
            "On a Transfer Theorem for the P != NP Conjecture.",
            "On the Isomorphism of Fractional Factorial Designs.",
            "The Optimal Approximations for Solving Linear Ill-Posed Problems.",
            "The Optimal Discretization of Stochastic Differential Equations.",
            "A Gröbner Free Alternative for Polynomial System Solving.",
            "Kronecker's and Newton's Approaches to Solving: A First Comparison.",
            "GUEST EDITORS' PREFACE.",
            "A One-Dimensional Optimization Algorithm and Its Convergence Rate under the Wiener Measure.",
            "Complexity of Neural Network Approximation with Limited Information: A Worst Case Approach.",
            "Nonlinear Lebesgue and Ito^ Integration Problems of High Complexity.",
            "Intractability Results for Integration and Discrepancy.",
            "What Is the Complexity of Surface Integration?",
            "Non-linear Approximations Using Sets of Finite Cardinality or Finite Pseudo-dimension.",
            "From the Editor.",
            "ANNOUNCEMENT: 2000 Best Paper Award.",
            "ANNOUNCEMENT: 2001 Best Paper Award Committee.",
            "Announcement: 2001 Prize for Achievement in Information-Based Complexity.",
            "Uniform Distribution, Discrepancy, and Reproducing Kernel Hilbert Spaces.",
            "A Probabilistic Analysis of Linear Operator Testing.",
            "On the Geometry of Graeffe Iteration.",
            "The P-DNP Problem for Infinite Abelian Groups.",
            "Year 2002 Prize for Achievement in Information-Based Complexity.",
            "Special Issue on the Complexity of Multivariate Problems.",
            "Quasi-regression.",
            "Wrap-Around L2-Discrepancy of Random Sampling, Latin Hypercube and Uniform Designs.",
            "The Price of Pessimism for Multidimensional Quadrature.",
            "Tractability of Multivariate Integration for Periodic Functions.",
            "The Microstructure of (t, m, s)-Nets.",
            "Tractability of Multivariate Integration for Weighted Korobov Classes.",
            "Complexity of Weighted Approximation over Rd.",
            "Variations on (0, s)-Sequences.",
            "Semiparametric Approximation Methods in Multivariate Model Selection.",
            "Pricing Algorithms of Multivariate Path Dependent Options.",
            "Quasi-random Simulation of Linear Kinetic Equations.",
            "Estimates for Piecewise Quadric Approximations of Implicitly Defined Manifolds.",
            "Calculation of the Quality Parameter of Digital Nets and Application to Their Construction.",
            "The Exact Exponent of Sparse Grid Quadratures in the Weighted Case.",
            "An Algorithm to Compute Bounds for the Star Discrepancy.",
            "Integration and Approximation Based on Scramble Sampling in Arbitrary Dimensions.",
            "Numerical Integration of Harmonic Functions with Restricted Sampling Data."
        ]
    },
    {
        "name": "JCOMPLEXITY",
        "year": "2000",
        "info": "Volume 16: 2000",
        "count": 34,
        "papers": [
            "Preface.",
            "Time-Space Tradeoffs in Algebraic Complexity Theory.",
            "Topological Complexity of the Range Searching.",
            "A Fast Version of the Schur.Cohn Algorithm.",
            "Deformation Techniques for Efficient Polynomial Equation Solving.",
            "Multivariate Polynomials, Duality, and Structured Matrices.",
            "Fast Computation of Contour Integrals of Rational Functions.",
            "Approximating Complex Polynomial Zeros: Modified Weyl's Quadtree Construction and Improved Newton's Iteration.",
            "Lifting/Descending Processes for Polynomial Zeros.",
            "On Symbolic-Numeric Solving of Sine-Polynomial Equations.",
            "Contraction, Robustness, and Numerical Path-Following Using Secant Maps.",
            "The Complexity of Local Dimensions for Constructible Sets.",
            "A Note on Non-complete Problems in NPImage.",
            "Complexity of Linear Problems with a Fixed Output Basis.",
            "On the Time Complexity of Partial Real Functions.",
            "What Is the Complexity of Stieltjes Integration?",
            "Average Approximations and Moments of Measures.",
            "Decision Problems in Quadratic Function Fields of High Genus.",
            "Optimal Approximation on Sd.",
            "On the Communication Complexity of Lipschitzian Optimization for the Coordinated Model of Computation.",
            "Delayed Curse of Dimension for Gaussian Integration.",
            "Interpolation of Functions from Besov-type Spaces on Gauß-Chebyshev Grids.",
            "From the Editor.",
            "Guest Editors' Preface.",
            "Condition Number Bounds for Problems with Integer Coefficients.",
            "Some Speed-Ups and Speed Limits for Real Algebraic Geometry.",
            "Numerical Homotopies to Compute Generic Points on Positive Dimensional Algebraic Sets.",
            "Finding a Cluster of Zeros of Univariate Polynomials.",
            "From the Editor.",
            "Iteration, Inequalities, and Differentiability in Analog Computers.",
            "Multi-sequences with Almost Perfect Linear Complexity Profile and Function Fields over Finite Fields.",
            "Weakly Computable Real Numbers.",
            "Computation of Affine Covariants of Quadratic Bivariate Differential Systems.",
            "Finding at Least One Point in Each Connected Component of a Real Algebraic Set Defined by a Single Equation."
        ]
    },
    {
        "name": "JCOMPLEXITY",
        "year": "1999",
        "info": "Volume 15: 1999",
        "count": 32,
        "papers": [
            "PREFACE: Festschrift for Zvi Galil.",
            "Matching for Run-Length Encoded Strings.",
            "Lower Bounds on the Depth of Monotone Arithmetic Computations.",
            "Parallel Construction and Query of Index Data Structures for Pattern Matching on Square Matrices.",
            "On-line Construction of Two-Dimensional Suffix Trees.",
            "Efficient Algorithms for Approximate String Matching with Swaps.",
            "Trade-offs between Communication Throughput and Parallel Time.",
            "A Note on the Complexity of Solving Poisson's Equation for Spaces of Bounded Mixed Derivatives.",
            "Approximating Fixed Points of Weakly Contracting Mappings.",
            "Approximate Zeros and Condition Numbers.",
            "The Real Dimension Problem Is NPR-Complete.",
            "Finding Zeros of Analytic Functions: alpha Theory for Secant Type Methods.",
            "Complexity Analysis for Certain Convex Programming Problems.",
            "1998 Best Paper Award.",
            "1999 Prize for Achievement in Information-Based Complexity.",
            "Year 2000 Prize for Achievement in Information-Based Complexity.",
            "Dagstuhl Invited Papers.",
            "Intractability Results for Positive Quadrature Formulas and Extremal Problems for Trigonometric Polynomials.",
            "Monte Carlo Complexity of Parametric Integration.",
            "Quasi-Monte Carlo Simulation of Diffusion.",
            "Where Does Smoothness Count the Most for Two-Point Boundary-Value Problems?",
            "Brakhage's Implicit Iteration Method and the Information Complexity of Equations with Operators Having Closed Range.",
            "Weighted Tensor Product Algorithms for Linear Multivariate Problems.",
            "From the Editor.",
            "Announcement: Best Paper Award Committee 1999.",
            "Stochastic Analog Networks and Computational Complexity.",
            "Quadrature Formulas for the Wiener Measure.",
            "Complexity Lower Bounds for Approximation Algebraic Computation Trees.",
            "Efficient p-adic Cell Decompositions for Univariate Polynomials.",
            "The Rivest-Vuillemin Conjecture on Monotone Boolean Functions Is True for Ten Variables.",
            "Randomized Algorithms over Finite Fields for the Exact Parity Base Problem.",
            "Polynomial Time Samplable Distributions."
        ]
    },
    {
        "name": "JCOMPLEXITY",
        "year": "1998",
        "info": "Volume 14: 1998",
        "count": 27,
        "papers": [
            "When Are Quasi-Monte Carlo Algorithms Efficient for High Dimensional Integrals?",
            "Asymptotically Optimal Weighted Numerical Integration.",
            "On the Direct Sum Conjecture in the Straight Line Model.",
            "Shape from Shadows: A Hilbert Space Setting.",
            "Linear Algorithms with Finite Deviation.",
            "A Refined Model of Computation for Continuous Problems.",
            "Optimal Integration of Lipschitz Functions with a Gaussian Weight.",
            "Monte Carlo Complexity of Global Solution of Integral Equations.",
            "On the Parallel Complexity of the Polynomial Ideal Membership Problem.",
            "On A Scheduling Problem of Time Deteriorating Jobs.",
            "Lyapunov Exponents versus Expansivity and Sensitivity in Cellular Automata.",
            "delta-Uniform BSS Machines.",
            "Fast Rectangular Matrix Multiplication and Applications.",
            "New Prize for Achievement in Information-Based Complexity.",
            "On the Complexity of Self-Validating Numerical Integration and Approximation of Functions with Singularities.",
            "Relaxation of Product Markov Chains on Product Spaces.",
            "On the Asymptotic Average Number of Efficient Vertices in Multiple Objective Linear Programming.",
            "Partial Fraction Decomposition in (z) and Simultaneous Newton Iteration for Factorization in C[z].",
            "1997 Best Paper Award.",
            "1998 Best Paper Award Committee.",
            "Prize for Achievement in Information-Based Complexity.",
            "The Exponent of Discrepancy Is at Least 1.0669.",
            "Some Lower Bounds for the Complexity of Continuation Methods.",
            "Scrambling Sobol' and Niederreiter-Xing Points.",
            "Feasible Real Random Access Machines.",
            "On the L2-Discrepancy for Anchored Boxes.",
            "Approximating Band- and Energy-Limited Signals in the Presence of Jitter."
        ]
    },
    {
        "name": "JCOMPLEXITY",
        "year": "1997",
        "info": "Volume 13: 1997",
        "count": 31,
        "papers": [
            "Best Paper Award.",
            "Guest Editor's Introduction.",
            "Polar Varieties, Real Equation Solving, and Data Structures: The Hypersurface Case.",
            "On Computing a Set of Points Meeting Every Cell Defined by a Family of Polynomials on a Variety.",
            "Simplified Lower Bounds for Polynomials with Algebraic Coefficients.",
            "Rectangular Matrix Multiplication Revisited.",
            "Nearly Sharp Complexity Bounds for Multiprocessor Algebraic Computations.",
            "Elimination of Constants from Machines over Algebraically Closed Fields.",
            "Semi-algebraic Complexity--Additive Complexity of Matrix Computational Tasks.",
            "Newton's Iteration for Inversion of Cauchy-Like and Other Structured Matrices.",
            "Stably Ergodic Dynamical Systems and Partial Hyperbolicity.",
            "Decoding of Reed Solomon Codes beyond the Error-Correction Bound.",
            "Computational Complexity over thep-adic Numbers.",
            "The Fast Generalized Parker-Traub Algorithm for Inversion of Vandermonde and Related Matrices.",
            "Different Quality Indexes for Lattice Rules.",
            "On NP-Completeness for Linear Machines.",
            "Computing the Topological Degree with Noisy Information.",
            "Real Data--Integer Solution Problems within the Blum-Shub-Smale Computational Model.",
            "Best Paper Award.",
            "Some Complexity Results for Polynomial Ideals.",
            "Approximability of the Ground State Problem for Certain Ising Spin Glasses.",
            "Recognizing Global Occurrence of Local Properties.",
            "Linear Complexity Profiles: Hausdorff Dimensions for Almost Perfect Profiles and Measures for General Profiles.",
            "A Note from the Editor.",
            "Editor's Foreword: Dagstuhl Invited Papers.",
            "Tractability of Tensor Product Linear Operators.",
            "On the Randomized Error of Polynomial Methods for Eigenvector and Eigenvalue Estimates.",
            "The Complexity of Indefinite Elliptic Problems with Noisy Data.",
            "Polya's Characterization Theorem for Complex Random Variables.",
            "Nonlinear Approximation in Finite-Dimensional Spaces.",
            "On the Value of Partial Information for Learning from Examples."
        ]
    },
    {
        "name": "JCOMPLEXITY",
        "year": "1996",
        "info": "Volume 12: 1996",
        "count": 35,
        "papers": [
            "Editorial.",
            "Announcement: Best Paper Award.",
            "Quadrature Formulas for Multivariate Convex Functions.",
            "Information Complexity of Multivariate Fredholm Integral Equations in Sobolev Classes.",
            "Optimal Recovery of Periodic Functions from Fourier Coefficients Given with an Error.",
            "About Widths of Wiener Space in the Lq-Norm.",
            "n-Widths, Faber Expansion, and Computation of Analytic Functions.",
            "An Efficient Algorithm for the Complex Roots Problem.",
            "Counting Affine Roots of Polynomial Systems via Pointed Newton Polytopes.",
            "On the Complexity of Sparse Elimination.",
            "Complexity Estimates for the Schmu\"dgen Positivstellensatz.",
            "How to Benefit from Noise.",
            "Note From the Editor.",
            "Tree Complexity and a Doubly Exponential Gap between Structured and Random Sequences.",
            "On the Power of Adaption.",
            "On Speed versus Accuracy: Some Case Studies.",
            "EDITOR'S FOREWORD.",
            "Average Case Complexity of Multivariate Integration and Function Approximation: An Overview.",
            "Hilbert's Nullstellensatz Is in the Polynomial Hierarchy.",
            "Computing Discrepancies of Smolyak Quadrature Rules.",
            "Topological Complexity with Continuous Operations.",
            "On the Expected Number of Shadow Vertices of the Convex Hull of Random Points.",
            "Numerical Integration of Peak Functions.",
            "Topological Complexity of Zero-Finding.",
            "The Minimal Radius of Galerkin Information for the Fredholm Problem of the First Kind.",
            "Worst Case Complexity of Problems with Random Information Noise.",
            "The Complexity of Definite Elliptic Problems with Noisy Data.",
            "A Linear Programming Instance with Many Crossover Events.",
            "How Partial Knowledge Helps to Solve Linear Programs.",
            "Graeffe's, Chebyshev-like, and Cardinal's Processes for Splitting a Polynomial into Factors.",
            "An Algebraic Proof of Barlet's Join Theorem.",
            "An Improved Upper Complexity Bound for the Topology Computation of a Real Algebraic Plane Curve.",
            "Semi-algebraic Complexity of Quotients and Sign Determination of Remainders.",
            "On Isolation of Real and Nearly Real Zeros of a Univariate Polynomial and Its Splitting into Factors.",
            "Metropolis, Simulated Annealing, and Iterated Energy Transformation Algorithms: Theory and Experiments."
        ]
    },
    {
        "name": "JCOMPLEXITY",
        "year": "1995",
        "info": "Volume 11: 1995",
        "count": 25,
        "papers": [
            "Explicit Cost Bounds of Algorithms for Multivariate Tensor Product Problems.",
            "The Real Number Model in Numerical Analysis.",
            "Average Error Bounds of Best Approximation of Continuous Functions on the Wiener Space.",
            "Termination Criteria for Linear Problems.",
            "On the Complexity of Approximating Extremal Determinants in Matrices.",
            "The Complexity of Multivariate Elliptic Problems with Analytic Data.",
            "Complexity of Finding Irreducible Components of a Semialgebraic Set.",
            "Achieving the Ergodically Optimal Convergence Rate for a One-Dimensional Minimization Problem.",
            "Recovering Linear Operators from Inaccurate Data.",
            "Average Complexity for Linear Problems in a Model with Varying Information Noise.",
            "Computational Complexity of Fixed Points and Intersection Points.",
            "An Inequality for Trigonometric Polynomials and Its Application for Estimating the Entropy Numbers.",
            "Short Proofs Using Compact Representations of Algebraic Integers.",
            "Binary Segmentation for Multivariate Polynomials.",
            "A Note on Testing the Resultant.",
            "On the Determinant of a Uniformly Distributed Complex Matrix.",
            "Computing over the Reals with Addition and Order: Higher Complexity Classes.",
            "Finding Well-Conditioned Similarities to Block-Diagonalize Nonsymmetric Matrices Is NP-Hard.",
            "The Optimal Error of Monte Carlo Integration.",
            "Complexity of Local Solution of Multivariate Integral Equations.",
            "Complexities of Winning Strategies in Diophantine Games.",
            "The Fine Structure of the n-Widths of Hp-Spaces in Lq(-1, 1).",
            "Average Widths of WrHomega in C(R).",
            "Ismagilov Type Theorems for Linear, Gel?fand and Bernstein n-Widths.",
            "What Is the Complexity of Solution-Restricted Operator Equations?"
        ]
    },
    {
        "name": "JCOMPLEXITY",
        "year": "1994",
        "info": "Volume 10: 1994",
        "count": 25,
        "papers": [
            "Is It Possible to Know a Problem Instance Is Ill-Posed?: Some Foundations for a General Theory of Condition Numbers.",
            "Bounds on the Number of Units for Computing Arbitrary Dichotomies by Multilayer Perceptrons.",
            "Parallel Speed-Up of Monte Carlo Methods for Global Optimization.",
            "Tractability and Strong Tractability of Linear Multivariate Problems.",
            "Average Saving Effects in Enumerative Methods for Solving Knapsack Problems.",
            "A Multi-step Algorithm for Hankel Matrices.",
            "Learning from Hints.",
            "One-Way Communication Complexity of Computing a Collection of Rational Functions.",
            "Efficient Hybrid Algorithms for Finding Zeros of Convex Functions.",
            "Utilizing Shelve Slots: Sufficiency Conditions for Some Easy Instances of Hard Problems.",
            "General Spacefilling Curve Heuristics and Limit Theory for the Traveling Salesman Problem.",
            "Modeling Optimal Effective Bandwidth of Page-Mode Memory for Stream-Oriented Computations.",
            "Optimization of Active Algorithms for Recovery of Monotonic Functions from Hölder's Class.",
            "Combining Binary Search and Newton's Method to Compute Real Roots for a Class of Real Functions.",
            "The Complexity and Effectiveness of Prediction Algorithms.",
            "Asymptotic Behavior of Automatic Quadrature.",
            "On Boundary Value Problems for the Hyperbolic Case.",
            "On the delta->0 Limit in Probabilistic Complexity.",
            "The Complexity of Two-Point Boundary-Value Problems with Piecewise Analytic Data.",
            "Probabilistic Analysis of Simpson's Quadrature.",
            "Fast Algorithms with Preprocessing for Matrix-Vector Multiplication Problems.",
            "mu-Average n-Widths on the Wiener Space.",
            "Positive Reducibility of the Interior of Filled Julia Sets.",
            "There Exists a Problem Whose Computational Complexity Is Any Given Function of the Information Complexity.",
            "On Parallel Complexity of Nonsmooth Convex Optimization."
        ]
    },
    {
        "name": "JCOMPLEXITY",
        "year": "1993",
        "info": "Volume 9: 1993",
        "count": 32,
        "papers": [
            "Festschrift for Joseph F. Traub.",
            "Complexity of Bezout's Theorem: III. Condition Number and Packing.",
            "Some Complexity Results for Zero Finding for Univariate Functions.",
            "On Approximate Recovery of Functions with Bounded Mixed Derivative.",
            "Improved Error Bounds for Lattice Rules.",
            "Discontinuity Detection and Thresholding-A Stochastic Approach.",
            "Global Bounds on Numerical Error for Ordinary Differential Equations.",
            "The Minimal Cost of Approximating Linear Operators Using Perturbed Information-The Asymptotic Setting.",
            "On Numerical Solution of Poincaré Problem for Oceanic Circulations.",
            "Complexity of Integral Equations and Relations to s-Numbers.",
            "The Complexity of Two-Point Boundary-Value Problems with Analytic Data.",
            "On Optimal Random Nets.",
            "An Ellipsoid Algorithm for the Computation of Fixed Points.",
            "Witnesses for Boolean Matrix Multiplication and for Transitive Closure.",
            "Average n-Widths of the Wiener Space in the Linfinity-Norm.",
            "On Randomized Semi-algebraic Test Complexity.",
            "Integration of Monotone Functions of Several Variables.",
            "A Proof of the Polynomiality of the Iri-Imai Method.",
            "Average Case Complexity of Multivariate Integration for Smooth Functions.",
            "On Optimization of Direct Methods of Solving Weakly Singular Integral Equations.",
            "There Exists a Linear Problem with Infinite Combinatory Complexity.",
            "Efficient Comparison Based String Matching.",
            "Real Number Models under Various Sets of Operations.",
            "On Detecting Regularity of Functions: A Probabilistic Analysis.",
            "A New Algorithm for the Symmetric Tridiagonal Eigenvalue Problem.",
            "Condition-Sensitive Computation of Approximate Fixed Points.",
            "Choosing Optimal Parameters in Iterative Processes.",
            "Information-Based Complexity and Nonparametric Worst-Case System Identification.",
            "Variational Principles in Curve Design.",
            "A Note on Varying Cardinality in the Average Case Setting.",
            "On the Intrinsic Complexity of Elimination Theory.",
            "On the Kolmogorov Complexity of Arbitrary Objects."
        ]
    },
    {
        "name": "JCOMPLEXITY",
        "year": "1992",
        "info": "Volume 8: 1992",
        "count": 27,
        "papers": [
            "Parallel solution of toeplitzlike linear systems.",
            "Optimal linear randomized methods for linear operators in Hilbert spaces.",
            "Polynomial-time algorithms for generation of prime implicants.",
            "Average dimension and ?-widths of classes of functions on the whole line.",
            "Barnsley's scheme for the fractal encoding of images.",
            "Encoding and recovery of operator values.",
            "Complexity of verification and computation for IBC problems.",
            "Relaxed verification for continuous problems.",
            "Information-based complexity of linear operator equations.",
            "Information complexity of equations of the second kind with compact operators in Hilbert space.",
            "Test complexity of generic polynomials.",
            "A note on best fractions of a computable real number.",
            "PR != NCR.",
            "Anosov endomorphisms on branched surfaces.",
            "Robust stability: The computational complexity point of view.",
            "Lower bounds for the complexity of Monte Carlo function approximation.",
            "Function approximation and integration on the wiener space with noisy data.",
            "n-Widths of Hp-spaces in Lq(-1, 1).",
            "Average case complexity of linear multivariate problems I. Theory.",
            "Average case complexity of linear multivariate problems II. Applications.",
            "A problem that is easier to solve on the unit-cost algebraic RAM.",
            "On the numerical computation of orbits of dynamical systems: The higher dimensional case.",
            "On a posteriori upper bounds for approximating linear functionals in a probabilistic setting.",
            "On the complexity of generating synchronizable test sequences.",
            "A note on a P NP result for a restricted class of real machines.",
            "Two P-complete problems in the theory of the reals.",
            "On the optimal quadrature least Linfinity-norm of monosplines with free knots on the real axis."
        ]
    },
    {
        "name": "JCOMPLEXITY",
        "year": "1991",
        "info": "Volume 7: 1991",
        "count": 29,
        "papers": [
            "Discretization effects in statistical inverse problems.",
            "Noisy information for linear problems in the asymptotic setting.",
            "Probabilistic analysis of numerical integration algorithms.",
            "Complexity of functions: Some questions, conjectures, and results.",
            "On the distance to the zero-set of a polynomial.",
            "Complexity of multilinear problems in the average case setting.",
            "On optimality of Krylov's information when solving linear operator equations.",
            "Condition numbers of random matrices.",
            "Optimal residual algorithms for linear operator equations.",
            "A role of lower semicontinuous functions in the combinatorial complexity of geometric problems.",
            "The parallel complexity of function approximation.",
            "NP-Completeness of graph decomposition problems.",
            "Linearity of algorithms and a result of Ando.",
            "Solvability of III-posed problems: An historical note.",
            "On the average case solvability of III-posed problems.",
            "Gaussian mean boundedness of densely defined linear operators.",
            "A path integral approach to data structure evolution.",
            "Random approximation of Sobolev embeddings.",
            "Matrix inversion in RNC1.",
            "Random languages for nonuniform complexity classes.",
            "Some remarks concerning the complexity of computing class groups of quadratic fields.",
            "Programmed interactions in higher-order neural networks: Maximal capacity.",
            "Parallel information-based complexity.",
            "Statistical complexity of dominant eigenvector calculation.",
            "On the complexity of online computations of real functions.",
            "The communication complexity of several problems in matrix computation.",
            "On the evaluation of the Eigenvalues of a banded toeplitz block matrix.",
            "Newtonian graphs for families of complex polynomials.",
            "Programmed interactions in higher-order neural networks: The outer-product algorithm."
        ]
    },
    {
        "name": "JCOMPLEXITY",
        "year": "1990",
        "info": "Volume 6: 1990",
        "count": 25,
        "papers": [
            "On the average complexity of multivariate problems.",
            "Selecting relevant projections onto subsets of coordinates: A minimax dependence-based approach.",
            "s-Numbers in information-based complexity.",
            "On learning a union of half spaces.",
            "On the design of complex organizations and distributive algorithms.",
            "On adaptive and nonadaptive stochastic and deterministic algorithms.",
            "On the power of neural networks for solving hard problems.",
            "On sequential and parallel solution of initial value problems.",
            "On the asymptotic probabilistic analysis of scheduling problems in the presence of precedence constraints.",
            "A note on a theorem of Blum, Shub, and Smale.",
            "Discontinuity detection from band-limited signals.",
            "Learning from hints in neural networks.",
            "On average case complexity of linear problems with noisy information.",
            "Probabilistic complexity analysis for linear problems in bounded domains.",
            "Computations over Z and R: A comparison.",
            "The complexity of a simple stochastic OR-tree model in which \"directional search\" is bad.",
            "Note on quantization for signals with bounded (r + 1)st derivative.",
            "Minimax quadratic estimation of a quadratic functional.",
            "Some complexity results in parallel matrix-based signal processing.",
            "Approximation and optimization on the Wiener space.",
            "Space and time complexities of balanced sorting on processor arrays.",
            "Computing topological degree using noisy information.",
            "Complexity of multilinear problems in the worst case setting.",
            "Diffeomorphisms with infinitely many strange attractors.",
            "Simple algorithms for approximating all roots of a polynomial with real roots."
        ]
    },
    {
        "name": "JCOMPLEXITY",
        "year": "1989",
        "info": "Volume 5: 1989",
        "count": 30,
        "papers": [
            "A clock synchronization problem with random delays.",
            "On the convergence of newton's method.",
            "A lower bound for the topological complexity of poly(D, n).",
            "Optimal complexity recovery of band- and energy-limited signals II.",
            "A stochastic analog to Chebyshev centers and optimal average case algorithms.",
            "On a class of omnibus algorithms for zero-finding.",
            "On the power of two-point based sampling.",
            "A Monte Carlo method for the parallel solution of linear systems.",
            "Statistical complexity of the power method for markov chains.",
            "Optimal algorithms for a problem of optimal control.",
            "On optimal algorithms for problems defined on groups.",
            "Randomization for continuous problems.",
            "On zero finding methods of higher order from data at one point.",
            "Optimal search algorithm for extrema of a discrete periodic bimodal function.",
            "On linearity of spline algorithms.",
            "Certifying smoothness of discrete functions and measuring legitimacy of images.",
            "Solving dense subset-sum problems by using analytical number theory.",
            "On approximation of band-limited signals.",
            "On the distance to the zero set of a homogeneous polynomial.",
            "Average case complexity of elliptic partial differential equations.",
            "Topological complexity of a root finding algorithm.",
            "On the adaptive and continuous information problems.",
            "On adaptive information with varying cardinality for linear problems with elliptically contoured measures.",
            "Asymptotic error for the global maximum of functions in s dimensions.",
            "Exponential lower bounds for finding Brouwer fix points.",
            "Fast computation of divided differences and parallel hermite interpolation.",
            "Critical points and values of complex polynomials.",
            "Mixed settings for linear problems.",
            "The complexity of dynamic programming.",
            "Average-case results for zero finding."
        ]
    },
    {
        "name": "JCOMPLEXITY",
        "year": "1988",
        "info": "Volume 4: 1988",
        "count": 20,
        "papers": [
            "Probabilistic satisfiability.",
            "A fast algorithm for the discrete laplace transformation.",
            "Data structures and algorithms for approximate string matching.",
            "Conditionally optimal algorithms and estimation of reduced order models.",
            "Deadlock avoidance for systolic communication.",
            "A regularized solution to edge detection.",
            "A new simple homotopy algorithm for linear programming I.",
            "Approximating a function by choosing a covering of its domain and ? points from its range.",
            "Guest editorial.",
            "On the complexity of loading shallow neural networks.",
            "On the capabilities of multilayer perceptrons.",
            "Dynamics and architecture for neural computation.",
            "Lower bound for connectivity in local-learning neural networks.",
            "On adaption with noisy information.",
            "Random problems.",
            "Algebraic complexities and algebraic curves over finite fields.",
            "Can we approximate zeros of functions with nonzero topological degree?",
            "VLSI-sorting evaluated under the linear model.",
            "Approximation of smooth periodic functions in several variables.",
            "Minimum asymptotic error of algorithms for solving ODE."
        ]
    },
    {
        "name": "JCOMPLEXITY",
        "year": "1987",
        "info": "Volume 3: 1987",
        "count": 25,
        "papers": [
            "On expansion of algebraic functions in power and Puiseux series, II.",
            "On the optimality of Krylov information.",
            "Asymptotic error of algorithms for solving nonlinear problems.",
            "Average complexity for linear operators over bounded domains.",
            "On the topology of algorithms, I.",
            "On the worst-case arithmetic complexity of approximating zeros of polynomials.",
            "Complexity of approximation with relative error criterion in worst, average, and probabilistic settings.",
            "Do numerical orbits of chaotic dynamical processes represent true orbits?",
            "Algorithmic and complexity issues of robot motion in an uncertain environment.",
            "Optimal algorithms: Tools for mathematical modeling.",
            "The geometry of III-conditioning.",
            "Communication complexity of convex optimization.",
            "The algorithm designer versus nature: A game-theoretic approach to information-based complexity.",
            "On the asymptotic behavior of the projective rescaling algorithm for linear programming.",
            "An information-based approach to III-posed problems.",
            "Some informational requirements for convergence.",
            "An optimal recovery view of Walsh's equiconvergence theorem.",
            "Information-based numerical practice.",
            "The concept of sequential optimality for problems in numerical analysis.",
            "A note on the trade-off between sampling and quantization in signal processing.",
            "A simplex variant solving an m times d linear program in O(min(m2, d2) expected number of pivot steps.",
            "Complexity of fixed points, I.",
            "Bin packing with divisible item sizes.",
            "sigma-Perfect splines and their application to optimal recovery problems.",
            "Optimal solution of ordinary differential equations."
        ]
    },
    {
        "name": "JCOMPLEXITY",
        "year": "1986",
        "info": "Volume 2: 1986",
        "count": 21,
        "papers": [
            "From the Editor.",
            "On the existence of generally convergent algorithms.",
            "Approximation of linear functionals on a banach space with a Gaussian measure.",
            "Complexity of computing topological degree of lipschitz functions in n dimensions.",
            "Structuring causal trees.",
            "Strongly optimal algorithms and optimal information in estimation problems.",
            "On the computational complexity of best Chebyshev approximations.",
            "On the Kolmogorov complexity of functions of finite smoothness.",
            "On the optimal solution of large eigenpair problems.",
            "For which error criteria can we solve nonlinear equations?",
            "Polynomial division and its computational complexity.",
            "Information of varying cardinality.",
            "On average case errors in numerical analysis.",
            "Optimal complexity recovery of band- and energy-limited signals.",
            "Probabilistic setting of information-based complexity.",
            "On expansion of algebraic functions in power and Puiseux series, I.",
            "Fast multiplication of a recursive block Toeplitz matrix by a vector and its application.",
            "How powerful is continuous nonlinear information for linear problems?",
            "On the existence of optimal affine methods for approximating linear functionals.",
            "An optimal algorithm for search of extrema of a bimodal function.",
            "Adaption helps for some nonconvex classes."
        ]
    },
    {
        "name": "JCOMPLEXITY",
        "year": "1985",
        "info": "Volume 1: 1985",
        "count": 17,
        "papers": [
            "Why a journal of complexity?",
            "Complexity of approximately solved problems.",
            "A survey of information-based complexity.",
            "Monte-Carlo algorithms for the planar multiterminal network reliability problem.",
            "A 71/60 theorem for bin packing.",
            "Average case optimality.",
            "Quasi-GCD computations.",
            "Optimal algorithms for image understanding: Current status and future plans.",
            "Memory requirements for balanced computer architectures.",
            "Approximation in a continuous model of computing.",
            "From the editor.",
            "Optimal precision in the presence of uncertainty.",
            "Optimal solution of nonlinear equations.",
            "Continuous optimization problems and a polynomial hierarchy of real functions.",
            "Complexity of differential and integral equations.",
            "Parallel and sequential computation: a statistician's view.",
            "Discrete allocation mechanisms: Dimensional requirements for resource-allocation mechanisms when desired outcomes are unbounded."
        ]
    }
]