[
    {
        "name": "JCSS",
        "year": "2022",
        "info": "2022: Volumes\n123,\n124,\n125,\n126,",
        "count": 39,
        "papers": [
            "Frameworks for designing in-place graph algorithms.",
            "An improved algorithm for the Steiner tree problem with bounded edge-length.",
            "Polynomial anonymous dynamic distributed computing without a unique leader.",
            "A 4 + ϵ approximation for k-connected subgraphs.",
            "Refined notions of parameterized enumeration kernels with applications to matching cut enumeration.",
            "Complexity of stability.",
            "Word equations in non-deterministic linear space.",
            "Improved prophet inequalities for combinatorial welfare maximization with (approximately) subadditive agents.",
            "Special issue on Algorithmic Theory of Dynamic Networks and Its Applications - Preface.",
            "Improved distance sensitivity oracles with subcubic preprocessing time.",
            "Coloring temporal graphs.",
            "The Projection Games Conjecture and the hardness of approximation of super-SAT and related problems.",
            "On the threshold of intractability.",
            "(In)approximability of maximum minimal FVS.",
            "Intersection joins under updates.",
            "Normalized information distance and the oscillation hierarchy.",
            "An extension of the Moran process using type-specific connection graphs.",
            "Single-source shortest paths and strong connectivity in dynamic planar graphs.",
            "Many-visits TSP revisited.",
            "Approximate CVPp in time 20.802n.",
            "Fine-grained complexity of rainbow coloring and its variants.",
            "More on change-making and related problems.",
            "Induced Disjoint Paths in AT-free graphs.",
            "Efficiently enumerating hitting sets of hypergraphs arising in data profiling.",
            "The tree-generative capacity of combinatory categorial grammars.",
            "Regular expression length via arithmetic formula complexity.",
            "Incompressibility of H-free edge modification problems: Towards a dichotomy.",
            "Greedy routing and the algorithmic small-world phenomenon.",
            "Approximating the existential theory of the reals.",
            "Orthogonal planarity testing of bounded treewidth graphs.",
            "An almost optimal approximation algorithm for monotone submodular multiple knapsack.",
            "Latency, capacity, and distributed minimum spanning trees.",
            "Length-bounded cuts: Proper interval graphs and structural parameters.",
            "A constant-factor approximation for directed latency in quasi-polynomial time.",
            "Preprocessing vertex-deletion problems: Characterizing graph properties by low-rank adjacencies.",
            "Medians in median graphs and their cube complexes in linear time.",
            "Multistage knapsack.",
            "A secure searchable encryption scheme for cloud using hash-based indexing.",
            "Complexity of fixed point counting problems in Boolean networks."
        ]
    },
    {
        "name": "JCSS",
        "year": "2021",
        "info": "2021: Volumes\n115,\n116,\n117,\n118,\n119,\n120,\n121,\n122",
        "count": 72,
        "papers": [
            "Searching by heterogeneous agents.",
            "Communicating finite-state machines, first-order logic, and star-free propositional dynamic logic.",
            "Attack and defense in the layered cyber-security model and their (1 ± ϵ)-approximation schemes.",
            "Edge fault-tolerance analysis of maximally edge-connected graphs and super edge-connected graphs.",
            "Circular pattern matching with k mismatches.",
            "Equivalence of pushdown automata via first-order grammars.",
            "Deciding the point-to-fixed-point problem for skew tent maps on an interval.",
            "Deterministic protocols in the SINR model without knowledge of coordinates.",
            "Understanding PPA-completeness.",
            "Assigning times to minimise reachability in temporal graphs.",
            "Approximating partition functions of bounded-degree Boolean counting Constraint Satisfaction Problems.",
            "Preimage problems for deterministic finite automata.",
            "Largest common prefix of a regular tree language.",
            "On the fast delivery problem with one or two packages.",
            "Equivalence checking of quantum finite-state machines.",
            "Speeding-up verification of digital signatures.",
            "Descriptive complexity of #P functions: A new perspective.",
            "Block trees.",
            "Complexity of inverse constraint problems and a dichotomy for the inverse satisfiability problem.",
            "On approximate pure Nash equilibria in weighted congestion games with polynomial latencies.",
            "46th International Colloquium on Automata, Languages and Programming (ICALP 2019) - Track C: Foundations of networks and multi-agent systems.",
            "Parameterized k-Clustering: Tractability island.",
            "Computing exact solutions of consensus halving and the Borsuk-Ulam theorem.",
            "Selective monitoring.",
            "On the profits of competing cloud service providers: A game theoretic approach.",
            "Counting subset repairs with functional dependencies.",
            "Maximum parsimony distance on phylogenetic trees: A linear kernel and constant factor approximation algorithm.",
            "Additive approximation algorithms for modularity maximization.",
            "Reachability relations of timed pushdown automata.",
            "Uniform parsing for hyperedge replacement grammars.",
            "Minimizing the operation cost of distributed green data centers with energy storage under carbon capping.",
            "Grammar-compressed indexes with logarithmic search time.",
            "Automatic Kolmogorov complexity, normality, and finite-state dimension revisited.",
            "Pushing the Online Boolean Matrix-vector Multiplication conjecture off-line and identifying its easy cases.",
            "Representation of ordered trees with a given degree distribution.",
            "A 43-approximation algorithm for the Maximum Internal Spanning Tree Problem.",
            "On temporal graph exploration.",
            "Editorial - Special issue on Concurrency Theory (CONCUR 2018).",
            "Optimal channel utilization with limited feedback.",
            "Nominal syntax with atom substitutions.",
            "Deleting edges to restrict the size of an epidemic in temporal networks.",
            "When are emptiness and containment decidable for probabilistic automata?",
            "Regularizing conjunctive features for classification.",
            "Bisection of bounded treewidth graphs by convolutions.",
            "Bidding mechanisms in graph games.",
            "Descriptive complexity of deterministic polylogarithmic time and space.",
            "A Turing kernelization dichotomy for structural parameterizations of F-Minor-Free Deletion.",
            "The complexity of reachability in parametric Markov decision processes.",
            "On relevant equilibria in reachability games.",
            "Analytic methods for reachability problems.",
            "The complexity of the parity argument with potential.",
            "Bivariate B-splines from convex configurations.",
            "Reducing graph transversals via edge contractions.",
            "Your rugby mates don't need to know your colleagues: Triadic closure with edge colors.",
            "Sliding window temporal graph coloring.",
            "Algorithms for hierarchical and semi-partitioned parallel scheduling.",
            "Lattice-based unidirectional infinite-use proxy re-signatures with private re-signature key.",
            "On the termination and structural termination problems for counter machines with incrementing errors.",
            "Closure and nonclosure properties of the classes of compressible and rankable sets.",
            "Foreword: Selected papers from the 22nd International Symposium on Fundamentals of Computation Theory (FCT 2019).",
            "The temporal explorer who returns to the base.",
            "Temporal cliques admit sparse spanners.",
            "Lattice-based weak-key analysis on single-server outsourcing protocols of modular exponentiations and basic countermeasures.",
            "Clocked population protocols.",
            "Undecidability of the speed positiveness problem in reversible and complete Turing machines.",
            "Measuring what matters: A hybrid approach to dynamic programming with treewidth.",
            "Exploration of dynamic networks: Tight bounds on the number of agents.",
            "On injectivity of quantum finite automata.",
            "The Hairy Ball problem is PPAD-complete.",
            "An efficiently computable characterization of stability and instability for linear cellular automata.",
            "Polynomial time approximation schemes for clustering in low highway dimension graphs.",
            "TCEP: Transitions in operator placement to adapt to dynamic network environments."
        ]
    },
    {
        "name": "JCSS",
        "year": "2020",
        "info": "2020: Volumes\n107,\n108,\n109,\n110,\n111,\n112,\n113,\n114",
        "count": 55,
        "papers": [
            "The complexity of planar Boolean #CSP with complex weights.",
            "LR-drawings of ordered rooted binary trees and near-linear area drawings of outerplanar graphs.",
            "Consensus using omega in asynchronous systems with unknown membership and degenerative Byzantine failures.",
            "The complexity of finding small separators in temporal graphs.",
            "Verifying whether one-tape Turing machines run in linear time.",
            "Temporal vertex cover with a sliding time window.",
            "On decidability and complexity of low-dimensional robot games.",
            "What one has to know when attacking P vs. NP.",
            "Contextuality in multipartite pseudo-telepathy graph games.",
            "Vulnerability of super extra edge-connected graphs.",
            "Relating the bisection width of dual-port, server-centric datacenter networks and the solution of edge isoperimetric problems in graphs.",
            "A trichotomy for regular simple path queries on graphs.",
            "On low for speed oracles.",
            "Clique-width and well-quasi-ordering of triangle-free graph classes.",
            "2-D Tucker is PPA complete.",
            "On the degrees of non-regularity and non-context-freeness.",
            "Non-deterministic weighted automata evaluated over Markov chains.",
            "Complete simulation of automata networks.",
            "Deciding semantic finiteness of pushdown processes and first-order grammars w.r.t. bisimulation equivalence.",
            "Faster Graph bipartization.",
            "Hitting minors on bounded treewidth graphs. III. Lower bounds.",
            "Learning the truth vector in high dimensions.",
            "Boolean approximate counting CSPs with weak conservativity, and implications for ferromagnetic two-spin.",
            "Subexponential algorithms for variants of the homomorphism problem in string graphs.",
            "Using decomposition-parameters for QBF: Mind the prefix!",
            "When are epsilon-nets small?",
            "The complexity of synthesizing elementary net systems relative to natural parameters.",
            "The computational power of parsing expression grammars.",
            "A multivariate analysis of the strict terminal connection problem.",
            "Subquadratic non-adaptive threshold group testing.",
            "Deciding probabilistic bisimilarity distance one for probabilistic automata.",
            "Graphs are not universal for online computability.",
            "Complexity of control in judgment aggregation for uniform premise-based quota rules.",
            "Online bin packing with cardinality constraints resolved.",
            "Eccentricity terrain of δ-hyperbolic graphs.",
            "Multilevel length-based classified index table for IP lookups and updates.",
            "Distributed reconfiguration of maximal independent sets.",
            "Graph reconstruction in the congested clique.",
            "Beyond operator-precedence grammars and languages.",
            "On Weisfeiler-Leman invariance: Subgraph counts and related graph properties.",
            "Disconnected cuts in claw-free graphs.",
            "A counterexample to Thiagarajan's conjecture on regular event structures.",
            "Finding connected secluded subgraphs.",
            "Multi-round cooperative search games with multiple players.",
            "Subexponential algorithm for d-cluster edge deletion: Exception or rule?",
            "A 1.375-approximation algorithm for unsigned translocation sorting.",
            "Unique end of potential line.",
            "An improved algorithm for the minmax regret path center problem on trees.",
            "Universal stability in multi-hop radio networks.",
            "How fast can we reach a target vertex in stochastic temporal graphs?",
            "Counting and enumerating tree-child networks and their subclasses.",
            "Selected papers of the 21st International Symposium on Fundamentals of Computation Theory, FCT 2017.",
            "Secure-channel free searchable encryption with multiple keywords: A generic construction, an instantiation, and its implementation.",
            "Tight hierarchy of data-independent multi-head automata.",
            "Space efficient representations of finite groups."
        ]
    },
    {
        "name": "JCSS",
        "year": "2019",
        "info": "2019: Volumes\n99,\n100,\n101,\n102,\n103,\n104,\n105,\n106",
        "count": 65,
        "papers": [
            "An elastic and resiliency defense against DDoS attacks on the critical DNS authoritative infrastructure.",
            "Packet latency of deterministic broadcasting in adversarial multiple access channels.",
            "Parameterized shifted combinatorial optimization.",
            "HV-planarity: Algorithms and complexity.",
            "On the performance guarantee of First Fit for sum coloring.",
            "Copyless cost-register automata: Structure, expressiveness, and closure properties.",
            "Vector and scalar reachability problems in SL(2, Z).",
            "Expressive power of entity-linking frameworks.",
            "Decidable and expressive classes of probabilistic automata.",
            "The complexity of synchronizing Markov decision processes.",
            "Path-contractions, edge deletions and connectivity preservation.",
            "Counting minimal transversals of β-acyclic hypergraphs.",
            "Recursion-theoretic ranking and compression.",
            "Hide and seek with repetitions.",
            "The complexity of verbal languages over groups.",
            "Computational capabilities of analog and evolving neural networks over infinite input streams.",
            "Band-restricted diagonally dominant matrices: Computational complexity and application.",
            "The optimal absolute ratio for online bin packing.",
            "On the transformation capability of feasible mechanisms for programmable matter.",
            "Special issue on cybersecurity in the critical infrastructure: Advances and future directions.",
            "Gaussian-Gamma collaborative filtering: A hierarchical Bayesian model for recommender systems.",
            "Clearing directed subgraphs by mobile agents: Variations on covering with paths.",
            "The complexity of routing with collision avoidance.",
            "Finite-state independence and normal sequences.",
            "Cyclic-routing of Unmanned Aerial Vehicles.",
            "Temporal flows in temporal networks.",
            "Parameterized aspects of triangle enumeration.",
            "Special issue: Selected papers of the 9th International Conference on Language and Automata Theory and Applications, LATA 2015.",
            "Complexity of regular functions.",
            "Automated synthesis of application-layer connectors from automata-based specifications.",
            "A Nivat theorem for weighted picture automata and weighted MSO logics.",
            "Recognizable series on graphs and hypergraphs.",
            "A game characterisation of tree-like Q-Resolution size.",
            "Recurrence relations, succession rules and the positivity problem.",
            "Efficient enumeration of weighted tree languages over the tropical semiring.",
            "Towards more precise rewriting approximations.",
            "Logics for unordered trees with data constraints.",
            "Linking indexing data structures to de Bruijn graphs: Construction and update.",
            "Sorting networks: To the end and back again.",
            "Bounding clique-width via perfect graphs.",
            "Two parallel algorithms for finding all minimal maximum subsequences.",
            "Insertion operations on deterministic reversal-bounded counter machines.",
            "Coverability and multi-scale coverability on infinite pictures.",
            "One-variable context-free hedge automata.",
            "Classifying invariant structures of step traces.",
            "Derivatives and partial derivatives for regular shuffle expressions.",
            "Complexity of road coloring with prescribed reset words.",
            "Distributional learning of conjunctive grammars and contextual binary feature grammars.",
            "Deterministic regular expressions with back-references.",
            "Space complexity of reachability testing in labelled graphs.",
            "Calculi for symmetric queries.",
            "Bounded depth circuits with weighted symmetric gates: Satisfiability, lower bounds and compression.",
            "Fault-tolerant embedding of starlike trees into restricted hypercube-like graphs.",
            "On notions of distortion and an almost minimum spanning tree with constant average distortion.",
            "k-Majority digraphs and the hardness of voting with a constant number of voters.",
            "On approximate preprocessing for domination and hitting subgraphs with connected deletion sets.",
            "Generalized satisfiability problems via operator assignments.",
            "Structural sparsity of complex networks: Bounded expansion in random models and real-world graphs.",
            "Decidable weighted expressions with Presburger combinators.",
            "The parameterized complexity of the minimum shared edges problem.",
            "Deterministic rendezvous with different maps.",
            "Colouring square-free graphs without long induced paths.",
            "Does adding more agents make a difference? A case study of cover time for the rotor-router.",
            "Optimal string clustering based on a Laplace-like mixture and EM algorithm on a set of strings.",
            "Proper learning of k-term DNF formulas from satisfying assignments."
        ]
    },
    {
        "name": "JCSS",
        "year": "2018",
        "info": "2018: Volumes\n91,\n92,\n93,\n94,\n95,\n96,\n97,\n98",
        "count": 67,
        "papers": [
            "On the complexity of two-dimensional signed majority cellular automata.",
            "Pebbling meets coloring: Reversible pebble game on trees.",
            "Rejecting jobs to minimize load and maximum flow-time.",
            "Weighted L∞ isotonic regression.",
            "A generic framework for checking semantic equivalences between pushdown automata and finite-state automata.",
            "On the speed of constraint propagation and the time complexity of arc consistency testing.",
            "Optimal redundancy in computations from random oracles.",
            "Kernels for deletion to classes of acyclic digraphs.",
            "Parameterized algorithms for recognizing monopolar and 2-subcolorable graphs.",
            "On the complexity of trial and error for constraint satisfaction problems.",
            "Containment of queries for graphs with data.",
            "Approximability and inapproximability of the star p-hub center problem with parameterized triangle inequality.",
            "SOS specifications for uniformly continuous operators.",
            "A parallel computing method using blocked format with optimal partitioning for SpMV on GPU.",
            "Time-approximation trade-offs for inapproximable problems.",
            "Reconfiguration in bounded bandwidth and tree-depth.",
            "On discrete preferences and coordination.",
            "Parameterized approximation via fidelity preserving transformations.",
            "Dual power assignment via second Hamiltonian cycle.",
            "Journal of Computer and System Science: 50 years of celebration. In memory of Professor Edward Blum.",
            "A brief history of Edward K. Blum and the Journal of Computer and System Sciences.",
            "Tree projections and constraint optimization problems: Fixed-parameter tractability and parallel algorithms.",
            "Subproblem ordering heuristics for AND/OR best-first search.",
            "Task-structured probabilistic I/O automata.",
            "Computing marginals using MapReduce.",
            "Range-max queries on uncertain data.",
            "Robust optimization in the presence of uncertainty: A generic approach.",
            "Towards a unified complexity theory of total functions.",
            "Use of information, memory and randomization in asynchronous gathering.",
            "The relationship between extra connectivity and conditional diagnosability of regular graphs under the PMC model.",
            "Grammatical inference of directed acyclic graph languages with polynomial time complexity.",
            "Adapting attackers and defenders patrolling strategies: A reinforcement learning approach for Stackelberg security games.",
            "Decomposition of quantum Markov chains and its applications.",
            "Designing deterministic polynomial-space algorithms by color-coding multivariate polynomials.",
            "k-distinct in- and out-branchings in digraphs.",
            "Algorithmic identification of probabilities is hard.",
            "Unit interval vertex deletion: Fewer vertices are relevant.",
            "Reconfiguration on sparse graphs.",
            "Discrete geometry and topology and their applications to imaging sciences.",
            "Topological tracking of connected components in image sequences.",
            "Categorical aspects of inducing closure operators on graphs by sets of walks.",
            "Topological analysis of voxelized objects by discrete geodesic Reeb graph.",
            "Homotopic properties of an MA-digitization of 2D Euclidean spaces.",
            "Dominant point detection based on discrete curve structure and applications.",
            "Object digitization up to a translation.",
            "Finding a largest rectangle inside a digital object and rectangularization.",
            "Optimal consensus set for digital Flake hyperspheres in nD.",
            "Simple picture processing based on finite automata and regular grammars.",
            "On the optimality of exact and approximation algorithms for scheduling problems.",
            "The tight asymptotic approximation ratio of First Fit for bin packing with cardinality constraints.",
            "Practically-self-stabilizing virtual synchrony.",
            "The 2D Dependency Pair Framework for conditional rewrite systems. Part I: Definition and basic processors.",
            "On the limits of gate elimination.",
            "Finding even subgraphs even faster.",
            "Towards a characterization of constant-factor approximable finite-valued CSPs.",
            "A parameterized algorithm for the Maximum Agreement Forest problem on multiple rooted multifurcating trees.",
            "AC0∘MOD2 lower bounds for the Boolean Inner Product.",
            "Strong bounds for evolution in networks.",
            "Optimal separation in exact query complexities for Simon's problem.",
            "An improved algorithm for the minmax regret path centdian problem on trees.",
            "What can be verified locally?",
            "A single-exponential fixed-parameter algorithm for distance-hereditary vertex deletion.",
            "Visibly pushdown transducers.",
            "Abstract geometrical computation 8: Small machines, accumulations & rationality.",
            "Trace malicious source to guarantee cyber security for mass monitor critical infrastructure.",
            "Establishing evolutionary game models for CYBer security information EXchange (CYBEX).",
            "Approximating Steiner trees and forests with minimum number of Steiner points."
        ]
    },
    {
        "name": "JCSS",
        "year": "2017",
        "info": "2017: Volumes \n83,\n84,\n85,\n86,\n87,\n88,\n89,\n90",
        "count": 110,
        "papers": [
            "Special Issue on Cyber Security in the Critical Infrastructure: Advances and Future Directions.",
            "A polytope-based approach to measure the impact of events against critical infrastructures.",
            "A dynamic prime number based efficient security mechanism for big sensing data streams.",
            "Reducing false positives of network anomaly detection by local adaptive multivariate smoothing.",
            "Modeling and performance evaluation of stealthy false data injection attacks on smart grid in the presence of corrupted measurements.",
            "A new universal designated verifier transitive signature scheme for big graph data.",
            "Secure and efficient protection of consumer privacy in Advanced Metering Infrastructure supporting fine-grained data analysis.",
            "Optimal constructions for active diagnosis.",
            "Rural postman parameterized by the number of components of required edges.",
            "Complexity of metric dimension on planar graphs.",
            "Soft computing methods for WiMax Network Planning on 3D Geographical Information Systems.",
            "Converging to the chase - A tool for finite controllability.",
            "Huge tables and multicommodity flows are fixed-parameter tractable via unimodular integer Carathéodory.",
            "Polynomial kernels for weighted problems.",
            "Closure properties of pattern languages.",
            "Sparse approximation is provably hard under coherent dictionaries.",
            "A lower bound for metric 1-median selection.",
            "Strong partial clones and the time complexity of SAT problems.",
            "An AFPTAS for variable sized bin packing with general activation costs.",
            "On a generalization of Nemhauser and Trotter's local optimization theorem.",
            "Parameterized complexity of the k-arc Chinese Postman Problem.",
            "On the parameterized complexity of b-chromatic number.",
            "On asymptotic gate complexity and depth of reversible circuits without additional memory.",
            "Trading performance for stability in Markov decision processes.",
            "d-k-min-wise independent family of hash functions.",
            "Optimal-depth sorting networks.",
            "Fast algorithms for Abelian periods in words and greatest common divisor queries.",
            "Kernelization using structural parameters on sparse graph classes.",
            "Solving parity games in big steps.",
            "Deciding whether a regular language is generated by a splicing system.",
            "A small minimal aperiodic reversible Turing machine.",
            "Scheduling of online compute-intensive synchronized jobs on high performance virtual clusters.",
            "Turing kernelization for finding long paths and cycles in restricted graph classes.",
            "Backdoors into heterogeneous classes of SAT and CSP.",
            "Determinacy and rewriting of functional top-down and MSO tree transformations.",
            "Combinatorial filter reduction: Special cases, approximation, and fixed-parameter tractability.",
            "Networks of polarized multiset processors.",
            "Inclusion dependencies and their interaction with functional dependencies in SQL.",
            "The extended equation of Lyndon and Schützenberger.",
            "Editing to a planar graph of given degrees.",
            "Optimization and Security Issues for Next Generation Networks - Editorial.",
            "Driver behaviour detection and vehicle rating using multi-UAV coordinated vehicular networks.",
            "Trustworthy data delivery in mobile P2P network.",
            "Publicly verifiable databases with efficient insertion/deletion operations.",
            "TARD: Temporary Access Rights Delegation for guest network devices.",
            "Collision-free network exploration.",
            "Process-centric views of data-driven business artifacts.",
            "Tensors masquerading as matchgates: Relaxing planarity restrictions on Pfaffian circuits.",
            "On the realisability of double-cross matrices by polylines in the plane.",
            "Constructing small tree grammars and small circuits for formulas.",
            "On the advice complexity of the k-server problem.",
            "Fingerprints in compressed strings.",
            "On groups generated by bi-reversible automata: The two-state case over a changing alphabet.",
            "Parameterized algorithms for min-max multiway cut and list digraph homomorphism.",
            "State complexity of operations on input-driven pushdown automata.",
            "Game semantics approach to higher-order complexity.",
            "Parameterized complexity classes beyond para-NP.",
            "Reachability in pushdown register automata.",
            "Deterministic multi-channel information exchange.",
            "On planar valued CSPs.",
            "Narrow sieves for parameterized paths and packings.",
            "20th workshop on logic, language, information and computation - WoLLIC 2013.",
            "Dynamic conjunctive queries.",
            "Quantifying leakage in the presence of unreliable sources of information.",
            "Decidability of order-based modal logics.",
            "Deciding definability by deterministic regular expressions.",
            "Dependence logic with generalized quantifiers: Axiomatizations.",
            "Boolean dependence logic and partially-ordered connectives.",
            "Model-checking for Resource-Bounded ATL with production and consumption of resources.",
            "Fixed points in conjunctive networks and maximal independent sets in graph contractions.",
            "On the data complexity of consistent query answering over graph databases.",
            "Faster exact algorithms for some terminal set problems.",
            "On g-extra connectivity of hypercube-like networks.",
            "The impact of processing order on performance: A taxonomy of semi-FIFO policies.",
            "Hyperplane separation technique for multidimensional mean-payoff games.",
            "Linear kernels for separating a graph into components of bounded size.",
            "Formal verification of stability and chaos in periodic optical systems.",
            "Building a fault tolerant framework with deadline guarantee in big data stream computing environments.",
            "Elasticity management of Streaming Data Analytics Flows on clouds.",
            "ABE with improved auxiliary input for big data security.",
            "Secure and flexible cloud-assisted association rule mining over horizontally partitioned databases.",
            "A data intensive heuristic approach to the two-stage streaming scheduling problem.",
            "CDPS: A cryptographic data publishing system.",
            "Efficient monochromatic and bichromatic probabilistic reverse top-k query processing for uncertain big data.",
            "Computing source-to-target shortest paths for complex networks in RDBMS.",
            "Geographic spatiotemporal big data correlation analysis via the Hilbert-Huang transformation.",
            "Public key encryption resilient to leakage and tampering attacks.",
            "A multivariate framework for weighted FPT algorithms.",
            "Zigzag Decodable codes: Linear-time erasure codes with applications to data storage.",
            "Axiomatizations for downward XPath on data trees.",
            "Disjoint path covers with path length constraints in restricted hypercube-like graphs.",
            "Complexity of suffix-free regular languages.",
            "Decidability and universality of quasiminimal subshifts.",
            "A polynomial-time algorithm for Outerplanar Diameter Improvement.",
            "On the combinatorial design of data centre network topologies.",
            "Differences of halting probabilities.",
            "Precisely deciding CSL formulas through approximate model checking for CTMCs.",
            "Efficient testing and matching of deterministic regular expressions.",
            "Somewhat semantic secure public key encryption with filtered-equality-test in the standard model and its extension to searchable encryption.",
            "Colouring diamond-free graphs.",
            "The control complexity of r-Approval: From the single-peaked case to the general case.",
            "Lp-norm Sauer-Shelah lemma for margin multi-category classifiers.",
            "Secure outsourcing of modular exponentiations under single untrusted programme model.",
            "A query privacy-enhanced and secure search scheme over encrypted data in cloud computing.",
            "Privacy-preserving anomaly detection in cloud with lightweight homomorphic encryption.",
            "A general framework for secure sharing of personal health records in cloud system.",
            "Biconnectivity, st-numbering and other applications of DFS using O(n) bits.",
            "Query complexity of approximate equilibria in anonymous games.",
            "Boolean language operations on nondeterministic automata with a pushdown of constant height.",
            "Characterising the complexity of tissue P systems with fission rules."
        ]
    },
    {
        "name": "JCSS",
        "year": "2016",
        "info": "2016: Volume 82",
        "count": 77,
        "papers": [
            "Journal of Computer and System Sciences Special Issue on Query Answering on Graph-Structured Data.",
            "Answering \"Why Empty?\" and \"Why So Many?\" queries in graph databases.",
            "Tree decomposition-based indexing for efficient shortest path and nearest neighbors query answering on graphs.",
            "Querying a graph database - language selection and performance considerations.",
            "Dynamic class hierarchy management for multi-version ontology-based personalization.",
            "Special Issue on Mobile Social Networking and computing in Proximity (MSNP).",
            "User popularity-based packet scheduling for congestion control in ad-hoc social networks.",
            "Developing the Cloud-integrated data replication framework in decentralized online social networks.",
            "Collaboration reputation for trustworthy Web service selection in social networks.",
            "Evaluating rail transit timetable using big passengers' data.",
            "EV-Linker: Mapping eavesdropped Wi-Fi packets to individuals via electronic and visual signal matching.",
            "Special issue on energy efficient methods and systems in the emerging cloud era.",
            "Power and performance management for parallel computations in clouds and data centers.",
            "Heterogeneity and thermal aware adaptive heuristics for energy efficient consolidation of virtual machines in infrastructure clouds.",
            "Editing to Eulerian graphs.",
            "Structural characterizations of the navigational expressiveness of relation algebras on a tree.",
            "Complete binary trees embeddings in Möbius cubes.",
            "Exploiting user metadata for energy-aware node allocation in a cloud storage system.",
            "Synchronous counting and computational algorithm design.",
            "Meta-kernelization with structural parameters.",
            "Conservative constraint satisfaction re-revisited.",
            "Bases of closure systems over residuated lattices.",
            "Linear kernel for Rooted Triplet Inconsistency and other problems based on conflict packing technique.",
            "Integer factoring and modular square roots.",
            "Combined-semantics equivalence of conjunctive queries: Decidability and tractability results.",
            "Solutions to the anti-piracy problem in oblivious transfer.",
            "Computing maximal-exponent factors in an overlap-free word.",
            "Representative families: A unified tradeoff-based approach.",
            "Data reductions and combinatorial bounds for improved approximation algorithms.",
            "Exploiting hidden structure in selecting dimensions that distinguish vectors.",
            "A faster polynomial-space algorithm for Max 2-CSP.",
            "Sorting nine inputs requires twenty-five comparisons.",
            "Special Issue on Trajectory-based Behaviour Analytics.",
            "Identifying locations from geospatial trajectories.",
            "Discovery of stop regions for understanding repeat travel behaviors of moving objects.",
            "Self-regularized causal structure discovery for trajectory-based networks.",
            "A conceptual framework for trajectory-based medical analytics with IoT contexts.",
            "On list update with locality of reference.",
            "Implementing set objects in dynamic distributed systems.",
            "#BIS-hardness for 2-spin systems on bipartite bounded degree graphs in the tree non-uniqueness region.",
            "Cloud-based automatic test data generation framework.",
            "Tractability frontiers of the partner units configuration problem.",
            "Comment on \"A strong provably secure IBE scheme without bilinear map\" by M. Zheng, Y. Xiang and H. Zhou [J. Comput. Syst. Sci. 81 (2015) 125-131].",
            "On polynomial kernels for sparse integer linear programs.",
            "Edge-fault-tolerant pancyclicity and bipancyclicity of Cartesian product graphs with faulty edges.",
            "Efficient algorithms for the round-trip 1-center and 1-median problems.",
            "Separating OR, SUM, and XOR circuits.",
            "Bounds on the cover time of parallel rotor walks.",
            "On approximating tree spanners that are breadth first search trees.",
            "Satisfiability of ECTL⁎ with constraints.",
            "On the finite and general implication problems of independence atoms and keys.",
            "What is decidable about partially observable Markov decision processes with ω-regular objectives.",
            "Constraint satisfaction and semilinear expansions of addition over the rationals and the reals.",
            "HEX: Scaling honeycombs is easier than scaling clock trees.",
            "Corrigendum to \"Evaluating rail transit timetable using big passengers' data\" [J. Comput. Syst. Sci. 82 (1, Part B) (2016) 144-155].",
            "A logical approach to locality in pictures languages.",
            "Equations over sets of integers with addition only.",
            "Parameterized complexity dichotomy for Steiner Multicut.",
            "Approximation algorithms for the Weighted t-Uniform Sparsest Cut and some other graph partitioning problems.",
            "Hellinger volume and number-on-the-forehead communication complexity.",
            "Kernelizations for the hybridization number problem on multiple nonbinary trees.",
            "An efficient time-free solution to SAT problem by P systems with proteins on membranes.",
            "Win-win kernelization for degree sequence completion problems.",
            "Fast processing of graph queries on a large database of small and medium-sized data graphs.",
            "Approximately counting locally-optimal structures.",
            "Multidimensional range queries on hierarchical Voronoi overlays.",
            "New techniques and tighter bounds for local computation algorithms.",
            "Linking theorems for tree transducers.",
            "Multi-category classifiers and sample width.",
            "Expressive power of first-order recurrent neural networks determined by their attractor dynamics.",
            "On the distributed complexity of the semi-matching problem.",
            "Generic case completeness.",
            "Optimal asymptotic bounds on the oracle use in computations from Chaitin's Omega.",
            "I/O-efficient join dependency testing, Loomis-Whitney join, and triangle enumeration.",
            "SEMD: Secure and efficient message dissemination with policy enforcement in VANET.",
            "LR(0) conjunctive grammars and deterministic synchronized alternating pushdown automata.",
            "The exact complexity of projective image matching."
        ]
    },
    {
        "name": "JCSS",
        "year": "2015",
        "info": "2015: Volume 81",
        "count": 107,
        "papers": [
            "Introduction to special issue on High Performance Computing Architectures and Systems.",
            "A novel memory allocation scheme for memory energy reduction in virtualization environment.",
            "Heterogeneous programming with Single Operation Multiple Data.",
            "Integer programming based heterogeneous CPU-GPU cluster schedulers for SLURM resource manager.",
            "MCMG simulator: A unified simulation framework for CPU and graphic GPU.",
            "Towards a heterogeneous and adaptive parallel Branch-and-Bound algorithm.",
            "Cloud BI: Future of business intelligence in the Cloud.",
            "New efficient velocity-aware probabilistic route discovery schemes for high mobility Ad hoc networks.",
            "Towards dynamic real-time scheduling for multiple earth observation satellites.",
            "A strong provably secure IBE scheme without bilinear map.",
            "Towards time domain invariant QoS measures for queues with correlated traffic.",
            "Optimized routing for video streaming in multi-hop wireless networks using analytical capacity estimation.",
            "Randomized diffusion for indivisible loads.",
            "A single-exponential FPT algorithm for the K4-minor cover problem.",
            "Decision implication canonical basis: a logical perspective.",
            "Parsimonious flooding in geometric random-walks.",
            "Network verification via routing table queries.",
            "On simple generators of recursively enumerable languages.",
            "Locks: Picking key methods for a scalable quantitative analysis.",
            "Runtime analysis of probabilistic programs with unbounded recursion.",
            "The complexity of approximating conservative counting CSPs.",
            "Approximating the partition function of planar two-state spin systems.",
            "Exponentially more concise quantum recognition of non-RMM regular languages.",
            "Two Cartesian closed categories of information algebras.",
            "Communication-optimal eventually perfect failure detection in partially synchronous systems.",
            "Prune-and-search with limited workspace.",
            "A uniquely ergodic cellular automaton.",
            "The complexity of equivalence, entailment, and minimization in existential positive logic.",
            "Quantum-assisted QD-CFS signatures.",
            "Products of matrices and recursively enumerable sets.",
            "A limitation of cell division in tissue P systems by PSPACE.",
            "Ambient and context-aware services.",
            "Agent-based framework for sensor-to-sensor personalization.",
            "SARP: A dynamically readjustable period size proactive routing protocol for MANETs.",
            "A cross layer optimization modeling for a periodic WSN application.",
            "Model-driven development of adaptive web service processes with aspects and rules.",
            "Dynamic heterogeneous team formation for robotic urban search and rescue.",
            "Scalability issues in optimal assignment for carpooling.",
            "A model for managing interactions between tangible and virtual agents on an RFID interactive tabletop: Case study in traffic simulation.",
            "Peak power modeling for join algorithms in DBMS.",
            "Fair signature exchange via delegation on ubiquitous networks.",
            "Control complexity in Bucklin and fallback voting: A theoretical analysis.",
            "Control complexity in Bucklin and fallback voting: An experimental analysis.",
            "Optimizing large data transfers in parity-declustered data layouts.",
            "Practically stabilizing SWMR atomic memory in message-passing systems.",
            "The parameterised complexity of counting connected subgraphs and graph motifs.",
            "SVD-based incremental approaches for recommender systems.",
            "Facilitating an ant colony algorithm for multi-objective data-intensive service provision.",
            "A multi-parameter analysis of hard problems on deterministic finite automata.",
            "On explaining integer vectors by few homogeneous segments.",
            "A new linearization method for nonlinear feedback shift registers.",
            "From the Editors.",
            "From Lawvere to Brandenburger-Keisler: Interactive forms of diagonalization and self-reference.",
            "On finitary functors and their presentations.",
            "Structural operational semantics for continuous state stochastic transition systems.",
            "Trace semantics via determinization.",
            "Lax extensions of coalgebra functors and their logic.",
            "Relational presheaves, change of base and weak simulation.",
            "Context-free coalgebras.",
            "Optimisation, security, privacy and trust in e-business systems.",
            "Priority-grouping method for parallel multi-scheduling in Grid.",
            "Multi-agent system for energy consumption optimisation in higher education institutions.",
            "Dynamic grey platform for efficient forecasting management.",
            "Improving network intrusion detection system performance through quality of service configuration and parallel technology.",
            "A k-anonymous approach to privacy preserving collaborative filtering.",
            "Malware behavioural detection and vaccine development by using a support vector model classifier.",
            "Vulnerability aware graphs for RFID protocol security benchmarking.",
            "An intelligent approach for building a secure decentralized public key infrastructure in VANET.",
            "Normality in non-integer bases and polynomial time randomness.",
            "Distributed agreement in dynamic peer-to-peer networks.",
            "An effective recommender system by unifying user and item trust information for B2B applications.",
            "Variable and value elimination in binary constraint satisfaction via forbidden patterns.",
            "On hybrid models of quantum finite automata.",
            "On the minmax regret path median problem on trees.",
            "Synthesis of succinct systems.",
            "On multi-processor speed scaling with migration.",
            "Geodesic stability for memoryless binary long-lived consensus.",
            "Stepwise refinement of sequence diagrams with soft real-time constraints.",
            "MIX is a 2-MCFL and the word problem in Z2 is captured by the IO and the OI hierarchies.",
            "Regular expressions for data words.",
            "Cubic patterns with permutations.",
            "A complete parameterized complexity analysis of bounded planning.",
            "Synchronous context-free grammars and optimal linear parsing strategies.",
            "Generalized Wong sequences and their applications to Edmonds' problems.",
            "Integer valued betting strategies and Turing degrees.",
            "Corrigendum to \"Another approach to the equivalence of measure-many one-way quantum infinite automata and its application\" [J. Comput. Syst. Sci. 78(3) (2012) 807-821].",
            "Journal of Computer and System Sciences Special Issue on Reliability and Optimization for Wireless Networking and Cloud Computing.",
            "Solving mesh router nodes placement problem in Wireless Mesh Networks by Tabu Search algorithm.",
            "Authorship verification of e-mail and tweet messages applied for continuous authentication.",
            "Read-abortion (RA) based synchronization protocols to prevent illegal information flow.",
            "SAFIR: Secure access framework for IoT-enabled services on smart buildings.",
            "Modeling energy-efficient secure communications in multi-mode wireless mobile devices.",
            "Incentive-based resource assignment and regulation for collaborative cloud services in community networks.",
            "Node placement for wireless mesh networks: Analysis of WMN-GA system simulation results for different parameters and distributions.",
            "A taxonomy for region queries in spatial databases.",
            "Secure deduplication storage systems supporting keyword search.",
            "Task partitioning and priority assignment for distributed hard real-time systems.",
            "Pancake Flipping is hard.",
            "Solovay functions and their applications in algorithmic randomness.",
            "Normality and automata.",
            "Length of polynomials over finite groups.",
            "μ-Limit sets of cellular automata from a computational complexity perspective.",
            "Hardness of conjugacy, embedding and factorization of multidimensional subshifts.",
            "New inapproximability bounds for TSP.",
            "From-below approximations in Boolean matrix factorization: Geometry and new algorithm.",
            "Equivalence and generalization in a layered network model.",
            "The complexity of minimum-length path decompositions."
        ]
    },
    {
        "name": "JCSS",
        "year": "2014",
        "info": "2014: Volume 80",
        "count": 105,
        "papers": [
            "Foreword: Intelligent data analysis.",
            "String analysis by sliding positioning strategy.",
            "Three-objective subgraph mining using multiobjective evolutionary programming.",
            "WCOID-DG: An approach for case base maintenance based on Weighting, Clustering, Outliers, Internal Detection and Dbsan-Gmeans.",
            "Hierarchical multi-label classification using local neural networks.",
            "Predicting user personality by mining social interactions in Facebook.",
            "Mixing local and global information for community detection in large networks.",
            "Bootstrap analysis of multiple repetitions of experiments using an interval-valued multiple comparison procedure.",
            "A feature construction approach for genetic iterative rule learning algorithm.",
            "Discovering gene association networks by multi-objective evolutionary quantitative association rules.",
            "Branching-time model-checking of probabilistic pushdown automata.",
            "Parameterized complexity of connected even/odd subgraph problems.",
            "Lower bounds on the complexity of MSO1 model-checking.",
            "A lightweight dynamic pseudonym identity based authentication and key agreement protocol without verification tables for multi-server architecture.",
            "Effective computation of immersion obstructions for unions of graph classes.",
            "The complexity of complex weighted Boolean #CSP.",
            "A possibility degree method for interval-valued intuitionistic fuzzy multi-attribute group decision making.",
            "On speculative replication of transactional systems.",
            "The complexity of weighted counting for acyclic conjunctive queries.",
            "Search methods for tile sets in patterned DNA self-assembly.",
            "Editor's foreword: WoLLIC 2010.",
            "An approach for lifetime reliability analysis using theorem proving.",
            "A mechanisation of some context-free language theory in HOL4.",
            "A representation theorem for (q-)holonomic sequences.",
            "Branching-time logics with path relativisation.",
            "Displacement logic for anaphora.",
            "Interval-valued fuzzy coimplications and related dual interval-valued conjugate functions.",
            "Belief revision within fragments of propositional logic.",
            "Deciding unique decodability of bigram counts via finite automata.",
            "On the role of complementation in implicit language equations and relations.",
            "Preprocessing subgraph and minor problems: When does a small vertex cover help?",
            "Corrigendum to \"Uniform constant-depth threshold circuits for division and iterated multiplication\" [J. Comput. System Sci. 65(4) (2002) 695-716].",
            "Defending against wireless network intrusion.",
            "Estimating the number of hosts corresponding to an intrusion alert while preserving privacy.",
            "Technique for authenticating H.264/SVC and its performance evaluation over wireless mobile networks.",
            "Broadcast encryption based non-interactive key distribution in MANETs.",
            "A new definition of homomorphic signature for identity management in mobile cloud computing.",
            "Algorithms for a distributed IDS in MANETs.",
            "Building a reputation-based bootstrapping mechanism for newcomers in collaborative alert systems.",
            "Analysis of impersonation attacks on systems using RF fingerprinting and low-end receivers.",
            "Management and applications of trust in Wireless Sensor Networks: A survey.",
            "LDAC: A localized and decentralized algorithm for efficiently countering wormholes in mobile wireless networks.",
            "Detection and mitigation of sinkhole attacks in wireless sensor networks.",
            "Clone wars: Distributed detection of clone attacks in mobile WSNs.",
            "Betweenness estimation in OLSR-based multi-hop networks for distributed filtering.",
            "Satisfying more than half of a system of linear equations over GF(2): A multivariate approach.",
            "The complexity of online manipulation of sequential elections.",
            "On the structure of bispecial Sturmian words.",
            "Bisimulation equivalence and regularity for real-time one-counter automata.",
            "Infinite vs. finite size-bounded randomized computations.",
            "Unshuffling a square is NP-hard.",
            "Robust learning of automatic classes of languages.",
            "Finding the smallest binarization of a CFG is NP-hard.",
            "Automatic learners with feedback queries.",
            "Detecting correlation between server resources for system management.",
            "On the connectivity preserving minimum cut problem.",
            "Column Subset Selection Problem is UG-hard.",
            "Rigorously modeling self-stabilizing fault-tolerant circuits: An ultra-robust clocking scheme for systems-on-chip.",
            "Publisher's note.",
            "Special Issue: Dependable and Secure Computing.",
            "Message matching-based greedy behavior detection in delay tolerant networks.",
            "Trust enhanced distributed authorisation for web services.",
            "Self-adaptive federated authorization infrastructures.",
            "Software control flow error detection and correlation with system performance deviation.",
            "A survey of emerging threats in cybersecurity.",
            "A security framework in G-Hadoop for big data computing across distributed Cloud data centres.",
            "A hybrid approach for scalable sub-tree anonymization over big data using MapReduce on cloud.",
            "Internet traffic clustering with side information.",
            "Editors' foreword.",
            "A complexity question in justification logic.",
            "Realizing public announcements by justifications.",
            "Nominal Lawvere Theories: A category theoretic account of equational theories with names.",
            "Polynomial hierarchy graph properties in hybrid logic.",
            "Independence friendly logic with classical negation via flattening is a second-order logic with weak dependencies.",
            "On the determinacy of concurrent games on event structures with infinite winning sets.",
            "Multiset rewriting over Fibonacci and Tribonacci numbers.",
            "A characterization of definability of second-order generalized quantifiers with applications to non-definability.",
            "On polymorphic types of untyped terms.",
            "Maximum number of fixed points in AND-OR-NOT networks.",
            "Positive Dedalus programs tolerate non-causality.",
            "Algorithms and estimators for summarization of unaggregated data streams.",
            "Range LCP.",
            "Prefix-suffix duplication.",
            "Bounded Budget Connection (BBC) games or how to make friends and influence people, on a budget.",
            "Parameterized complexity of firefighting.",
            "Verifying of interface assertions for infinite state Mealy machines.",
            "A methodology to develop awareness in computer supported collaborative work using policies.",
            "A method based on induced aggregation operators and distance measures to multiple attribute decision making under 2-tuple linguistic environment.",
            "A linear kernel for the complementary maximal strip recovery problem.",
            "Perfect correspondences between dot-depth and polynomial-time hierarchies.",
            "Searching for better fill-in.",
            "Beyond Max-Cut: λ-extendible properties parameterized above the Poljak-Turzík bound.",
            "A novel design of 8-bit adder/subtractor by quantum-dot cellular automata.",
            "Bounded-width QBF is PSPACE-complete.",
            "Tight bounds for parameterized complexity of Cluster Editing with a small number of clusters.",
            "Consistency checking and querying in probabilistic databases under integrity constraints.",
            "Editorial: Special Issue on Theory and Applications in Parallel and Distributed Computing Systems.",
            "Building access control policy model for privacy preserving and testing policy conflicting problems.",
            "Proactive workload management in dynamic virtualized environments.",
            "Secure administration of cryptographic role-based access control for large-scale cloud storage systems.",
            "Dynamics stability in wireless sensor networks active defense model.",
            "EFADS: Efficient, flexible and anonymous data sharing protocol for cloud computing with proxy re-encryption.",
            "A spatiotemporal compression based approach for efficient big data processing on Cloud.",
            "One-time packet key exchange scheme for secure real-time multimedia applications.",
            "De-anonymization attack on geolocated data."
        ]
    },
    {
        "name": "JCSS",
        "year": "2013",
        "info": "2013: Volume 79",
        "count": 90,
        "papers": [
            "A linear vertex kernel for maximum internal spanning tree.",
            "The hardness of counting full words compatible with partial words.",
            "The covering and boundedness problems for branching vector addition systems.",
            "Bin packing with fixed number of bins revisited.",
            "On the complexity of Newman's community finding approach for biological and social networks.",
            "Approximating the Tutte polynomial of a binary matroid and other related combinatorial polynomials.",
            "Datalog and constraint satisfaction with infinite templates.",
            "The sequence equivalence problem for primitive D0L systems.",
            "Space and speed tradeoffs in TCAM hierarchical packet classification.",
            "A novel one-time password mutual authentication scheme on sharing renewed finite random sub-passwords.",
            "Some generalized dependent aggregation operators with intuitionistic linguistic numbers and their application to group decision making.",
            "Completely inapproximable monotone and antimonotone parameterized problems.",
            "Probabilistic automata for computing with words.",
            "Special issue: Frontiers and advance topics of computer and information technology.",
            "Regional cache organization for NoC based many-core processors.",
            "Improving disk I/O performance in a virtualized system.",
            "TopCluster: A hybrid cluster model to support dynamic deployment in Grid.",
            "Speeding up k-Means algorithm by GPUs.",
            "A multi-criteria job scheduling framework for large computing farms.",
            "An algorithm for accuracy enhancement of license plate recognition.",
            "A segmentation-free method for image classification based on pixel-wise matching.",
            "Asymmetric multi-path division communications in underwater acoustic networks with fading channels.",
            "A secure self-destructing scheme for electronic data.",
            "A peer-to-peer recommender system for self-emerging user communities based on gossip overlays.",
            "Theoretical and practical aspects of warehousing, querying and mining sensor and streaming data.",
            "Multi-route query processing and optimization.",
            "Optimizing adaptive multi-route query processing via time-partitioned indices.",
            "A novel distributed framework for optimizing query routing trees in wireless sensor networks via optimal operator placement.",
            "Interactive self-adaptive clutter-aware visualisation for mobile data mining.",
            "Trustworthiness analysis of sensor data in cyber-physical systems.",
            "Multicore computing systems: Architecture, programming tools, and applications.",
            "Utility accrual object distribution in MPSoC real-time embedded systems.",
            "Scalable load balancing congestion-aware Network-on-Chip router architecture.",
            "Developing a power-efficient and low-cost 3D NoC using smart GALS-based vertical channels.",
            "Reliable energy-aware application mapping and voltage-frequency island partitioning for GALS-based NoC.",
            "Cluster-based topologies for 3D Networks-on-Chip using advanced inter-layer bus architecture.",
            "Efficient genetic based topological mapping using analytical models for on-chip networks.",
            "Special issue of JCSS on UbiSafe computing and communications.",
            "Security-aware optimization for ubiquitous computing systems with SEAT graph approach.",
            "Feasibility interval for the transactional event handlers of P-FRP.",
            "An efficient quasi-identifier index based approach for privacy preservation over incremental data sets on cloud.",
            "A practical reputation system for pervasive social chatting.",
            "Unsupervised traffic classification using flow statistical properties and IP packet payload.",
            "Modeling the dynamics of worm propagation using two-dimensional cellular automata in smartphones.",
            "A robust trust model for service-oriented systems.",
            "Planar graph vertex partition for linear problem kernels.",
            "Inferring descriptive generalisations of formal languages.",
            "Strategy improvement for concurrent reachability and turn-based stochastic safety games.",
            "Several extensions of the Parikh matrix L-morphism.",
            "{2,3}-Extraconnectivities of hypercube-like networks.",
            "On selective unboundedness of VASS.",
            "Computation with perturbed dynamical systems.",
            "On some network design problems with degree constraints.",
            "Editor's foreword.",
            "On the equivalence of distributed systems with queries and communication.",
            "The language of plain SO-tgds: Composition, inversion and structural properties.",
            "Solutions in XML data exchange.",
            "On simplification of schema mappings.",
            "Capturing model-based ontology evolution at the instance level: The case of DL-Lite.",
            "On the aggregation problem for synthesized Web services.",
            "Expressiveness and static analysis of extended conjunctive regular path queries.",
            "Simplifying XML Schema: Single-type approximations of regular tree languages.",
            "Semantic query optimization in the presence of types.",
            "A dichotomy in the complexity of counting database repairs.",
            "Tractable counting of the answers to conjunctive queries.",
            "Special issue on intelligent and innovative information systems.",
            "An effective signal strength-based wireless location estimation system for tracking indoor mobile users.",
            "A taxonomy for nearest neighbour queries in spatial databases.",
            "An innovative approach for automatically grading spelling in essays using rubric-based scoring.",
            "Multi-dimensional criteria for testing web services transactions.",
            "Advanced orthogonal RAID based on virtual disks.",
            "Evaluation of struggle strategy in Genetic Algorithms for ground stations scheduling problem.",
            "Real object-oriented communication method for ad hoc networks.",
            "Combining decomposition and reduction for state space analysis of a self-stabilizing system.",
            "Fault tolerance in cellular automata at low fault rates.",
            "Better spaced seeds using Quadratic Residues.",
            "Revisiting the complexity of and/or graph solution.",
            "Leader election in ad hoc radio networks: A keen ear helps.",
            "Model checking quantum Markov chains.",
            "Advanced topics on cloud computing.",
            "How to achieve non-repudiation of origin with privacy protection in cloud computing.",
            "Developing an optimized application hosting framework in Clouds.",
            "A multi-objective ant colony system algorithm for virtual machine placement in cloud computing.",
            "A survey on reliability in distributed systems.",
            "Performance modeling of hybrid MPI/OpenMP scientific applications on large-scale multicore supercomputers.",
            "Multiswapped networks and their topological and algorithmic properties.",
            "Average-case complexity of backtrack search for coloring sparse random graphs.",
            "Bounded repairability of word languages.",
            "Denials leak information: Simulatable auditing.",
            "EC3: Elastic Cloud Computing Cluster."
        ]
    },
    {
        "name": "JCSS",
        "year": "2012",
        "info": "2012: Volume 78",
        "count": 120,
        "papers": [
            "Editorʼs foreword.",
            "Computing optimal outcomes under an expressive representation of settings with externalities.",
            "Truthful randomized mechanisms for combinatorial auctions.",
            "View-based query answering in Description Logics: Semantics and complexity.",
            "Conjunctive query answering in the description logic SH using knots.",
            "Synonymous theories and knowledge representations in answer set programming.",
            "Markov network based ontology matching.",
            "An action-based approach to the formal specification and automatic analysis of business processes under authorization constraints.",
            "An improved two-party identity-based authenticated key agreement protocol using pairings.",
            "Every ternary permutation constraint satisfaction problem parameterized above average has a kernel with a quadratic number of variables.",
            "A three-string approach to the closest string problem.",
            "Editing graphs to satisfy degree constraints: A parameterized approach.",
            "Accurate and precise aggregation counting.",
            "The tractability frontier for NFA minimization.",
            "A 2k kernel for the cluster editing problem.",
            "Learning finite cover automata from queries.",
            "Scheduling malleable tasks with precedence constraints.",
            "Optimal sampling from sliding windows.",
            "A new efficient indexing algorithm for one-dimensional real scaled patterns.",
            "Improved approximation algorithms for Directed Steiner Forest.",
            "On restricted context-free grammars.",
            "A universally fastest algorithm for Max 2-Sat, Max 2-CSP, and everything in between.",
            "On bounded block decomposition problems for under-specified systems of equations.",
            "Generic local computation.",
            "Maintaining awareness using policies; Enabling agents to identify relevance of information.",
            "Special Issue: Games in Verification.",
            "A survey of stochastic ω-regular games.",
            "Multi-valued model checking games.",
            "Solving parity games by a reduction to SAT.",
            "Finding and fixing faults.",
            "Model-checking hierarchical structures.",
            "Drawing a tree as a minimum spanning tree approximation.",
            "Representations of commutative asynchronous automata.",
            "Schützenberger and Eilenberg theorems for words on linear orderings.",
            "Size complexity of rotating and sweeping automata.",
            "On making directed graphs transitive.",
            "Parallel modular exponentiation using load balancing without precomputation.",
            "A structural/temporal query language for Business Processes.",
            "On sets without k-term arithmetic progression.",
            "Ultra-succinct representation of ordered trees with applications.",
            "Approximate shortest paths in weighted graphs.",
            "Enumerating homomorphisms.",
            "Two-server password-only authenticated key exchange.",
            "A linear time algorithm for the induced disjoint paths problem in planar graphs.",
            "The complexity of weighted and unweighted #CSP.",
            "Approximability of constrained LCS.",
            "Faster algorithms for finding and counting subgraphs.",
            "Local search: Is brute-force avoidable?",
            "An improved approximation algorithm for the complementary maximal strip recovery problem.",
            "Fixed-point tile sets and their applications.",
            "Space complexity of perfect matching in bounded genus bipartite graphs.",
            "On CD-systems of stateless deterministic R-automata with window size one.",
            "Another approach to the equivalence of measure-many one-way quantum finite automata and its application.",
            "Editorʼs foreword.",
            "Verification of object-oriented programs: A transformational approach.",
            "Verification of multi-linked heaps.",
            "Non-standard semantics of hybrid systems modelers.",
            "Synthesis of Reactive(1) designs.",
            "Ambient Abstract State Machines with applications.",
            "When are different type-logical semantic definitions defining equivalent meanings?",
            "Synthesis from scenario-based specifications.",
            "Once and for all.",
            "An induced OWA operator in coal mine safety evaluation.",
            "Rewriting XPath queries using materialized XPath views.",
            "Characterisations of multivalued dependency implication over undetermined universes.",
            "The implication problem for 'closest node' functional dependencies in complete XML documents.",
            "A new approximation algorithm for cut-and-paste sorting of unsigned circular permutations.",
            "On time-symmetry in cellular automata.",
            "Vector space formulation of probabilistic finite state automata.",
            "Communication-efficient distributed oblivious transfer.",
            "Information Retrieval, Decision Making Process and User Needs.",
            "Resource recommendation in social annotation systems: A linear-weighted hybrid approach.",
            "Feature-based opinion mining and ranking.",
            "Personalized multi-user view and content synchronization and retrieval in real-time mobile social software applications.",
            "Task-specific information retrieval systems for software engineers.",
            "Semantic annotation of digital music.",
            "Hybrid approach for context-aware service discovery in healthcare domain.",
            "Hybrid model of content extraction.",
            "Content-based image retrieval approach for biometric security using colour, texture and shape features controlled by fuzzy heuristics.",
            "Special Issue: Cloud Computing 2011.",
            "SLA-based admission control for a Software-as-a-Service provider in Cloud computing environments.",
            "Enforcing QoS in scientific workflow systems enacted over Cloud infrastructures.",
            "A QoS-aware composition method supporting cross-platform service invocation in cloud environment.",
            "Cloud federation in a layered service model.",
            "Distributed data possession checking for securing multiple replicas in geographically-dispersed clouds.",
            "A privacy preserving authorisation system for the cloud.",
            "A historical probability based noise generation strategy for privacy protection in cloud computing.",
            "P2P-MapReduce: Parallel data processing in dynamic Cloud environments.",
            "Foreword.",
            "Combinatorial bandits.",
            "Sparse regression learning by aggregation and Langevin Monte-Carlo.",
            "A complete characterization of statistical query learning with applications to evolvability.",
            "A spectral algorithm for learning Hidden Markov Models.",
            "Reliable agnostic learning.",
            "A tree-based regressor that adapts to intrinsic dimension.",
            "Learning with stochastic inputs and adversarial outputs.",
            "The K-armed dueling bandits problem.",
            "Testable and untestable classes of first-order formulae.",
            "The complexity of approximately counting stable roommate assignments.",
            "Catalan structures and dynamic programming in H-minor-free graphs.",
            "Learning with ordinal-bounded memory from positive data.",
            "Multicut in trees viewed through the eyes of vertex cover.",
            "Parameter reduction and automata evaluation for grammar-compressed trees.",
            "Special Issue on Multidisciplinary Emerging Networks and Systems.",
            "Autonomous and adaptive resource allocation among multiple nodes and multiple applications in heterogeneous wireless networks.",
            "Energy efficient ant colony algorithms for data aggregation in wireless sensor networks.",
            "Improvement of assurance including security for wireless sensor networks using dispersed data transmission.",
            "Trustworthy-based efficient data broadcast model for P2P interaction in resource-constrained wireless environments.",
            "Behavior-based reputation management in P2P file-sharing networks.",
            "An adaptive mode control algorithm of a scalable intrusion tolerant architecture.",
            "Socialized ubiquitous personal study: Toward an individualized information portal.",
            "From the Guest Editors.",
            "The inclusion problem for regular expressions.",
            "Reversible pushdown automata.",
            "The maximal number of cubic runs in a word.",
            "Operator precedence and the visibly pushdown property.",
            "A randomized Numerical Aligner (rNA).",
            "Intrinsically universal n-dimensional quantum cellular automata.",
            "Pregroup grammars with letter promotions: Complexity and context-freeness.",
            "Learnability of automatic classes."
        ]
    },
    {
        "name": "JCSS",
        "year": "2011",
        "info": "2011: Volume 77",
        "count": 80,
        "papers": [
            "Foreword.",
            "The isomorphism conjecture for constant depth reductions.",
            "The pervasive reach of resource-bounded Kolmogorov complexity in computational complexity theory.",
            "Holographic algorithms: From art to science.",
            "Hardness results for approximating the bandwidth.",
            "Infeasibility of instance compression and succinct PCPs for NP.",
            "Hardness amplification within NP against deterministic algorithms.",
            "Heuristic algorithms in computational molecular biology.",
            "On the hardness of learning intersections of two halfspaces.",
            "The complexity of Boolean formula minimization.",
            "A bridging model for multi-core computing.",
            "Multilinear formulas, maximal-partition discrepancy and mixed-sources extractors.",
            "Deterministic extractors for small-space sources.",
            "Editorial for the special issue on \"Adaptivity in Heterogeneous Environments\".",
            "Multi-group QoS consensus for web services.",
            "Adaps - A three-phase adaptive prediction system for the run-time of jobs based on user behaviour.",
            "Network-aware heuristics for inter-domain meta-scheduling in Grids.",
            "Adaptive decentralized re-clustering protocol for wireless sensor networks.",
            "Distributed redundancy and robustness in complex systems.",
            "Automatic mobility status estimation in wireless self-organised networks.",
            "Using tuple-spaces to manage the storage and dissemination of spatial-temporal content.",
            "Model interoperability via Model Driven Development.",
            "Fair exchange of valuable information: A generalised framework.",
            "Unitarity plus causality implies localizability.",
            "Theory and application of width bounded geometric separators.",
            "On the complexity of regular-grammars with integer attributes.",
            "A probabilistic approach to problems parameterized above or below tight bounds.",
            "Errors in graph embedding algorithms.",
            "Graph coloring with rejection.",
            "Guest editorial: Special issue on database theory.",
            "Conjunctive query containment over trees.",
            "Queries and materialized views on probabilistic databases.",
            "Relational completeness of query languages for annotated databases.",
            "Succinctness of pattern-based schema languages for XML.",
            "Foundations of Semantic Web databases.",
            "Data exchange and schema mappings in open and closed worlds.",
            "On the finite controllability of conjunctive query answering in databases under open-world assumption.",
            "Special issue foreword: Advances in pervasive computing systems and applications.",
            "The Calculus of Context-aware Ambients.",
            "Performance modelling of Event-Condition-Action rules in P2P networks.",
            "Voronoi-based range and continuous range query processing in mobile databases.",
            "The design and evaluation of fair scheduling in wireless mesh networks.",
            "QoS enhancements and performance analysis for delay sensitive applications.",
            "Network trust management in emergency situations.",
            "A framework for discovering and classifying ubiquitous services in digital health ecosystems.",
            "Video streaming application over WEAC protocol in MANET.",
            "A mobile RFID-based tour system with instant microblogging.",
            "Almost-natural proofs.",
            "Nonapproximability of the normalized information distance.",
            "Representing real numbers in a generalized numeration system.",
            "Index sets and universal numberings.",
            "Average parameterization and partial kernelization for computing medians.",
            "Provably secure and efficient identification and key agreement protocol with user anonymity.",
            "Upper and lower bounds for finding connected motifs in vertex-colored graphs.",
            "Representation of left-computable ε-random reals.",
            "The set of realizations of a max-plus linear sequence is semi-polyhedral.",
            "Performance modeling and evaluation of heterogeneous computer networks.",
            "Exploring gate-limited analytical models for high-performance network storage servers.",
            "Stability and performance analysis of randomly deployed wireless networks.",
            "Criticisms of modelling packet traffic using long-range dependence (extended version).",
            "An empirical framework for user mobility models: Refining and modeling user registration patterns.",
            "A study of performance and scalability metrics of a SIP proxy server - a practical approach.",
            "Controlling mean queuing delay under multi-class bursty and correlated traffic.",
            "Balanced energy allocation scheme for a solar-powered sensor system and its effects on network-wide performance.",
            "Distributed XML Processing and Management: Theory and Practice.",
            "Distributed XML design.",
            "Privacy Preserving OLAP over Distributed XML Data: A Theoretically-Sound Secure-Multiparty-Computation Approach.",
            "Collaborative clustering of XML documents.",
            "A distributed concurrency control mechanism for XML data.",
            "Min-rank conjecture for log-depth circuits.",
            "Almost tight upper bound for finding Fourier coefficients of bounded pseudo-Boolean functions.",
            "A note on approximating the min-max vertex disjoint paths on directed acyclic graphs.",
            "On the induced matching problem.",
            "Kernels for feedback arc set in tournaments.",
            "Selecting and using views to compute aggregate queries.",
            "Spanners in sparse graphs.",
            "Memory lower bounds for XPath evaluation over XML streams.",
            "A generalization of Nemhauser and Trotterʼs local optimization theorem.",
            "Implicit branching and parameterized partial cover problems.",
            "Equilibria problems on games: Complexity versus succinctness."
        ]
    },
    {
        "name": "JCSS",
        "year": "2010",
        "info": "2010: Volume 76",
        "count": 63,
        "papers": [
            "Editor's foreword.",
            "Discovery of optimal factors in binary data via a novel method of matrix decomposition.",
            "A conditional independence algorithm for learning undirected graphical models.",
            "The GUHA method and its meaning for data mining.",
            "On predictive accuracy and risk minimization in pairwise label ranking.",
            "Fast convolution and Fast Fourier Transform under interval and fuzzy uncertainty.",
            "Visualizing and fuzzy filtering for discovering temporal trajectories of association rules.",
            "Prism: An effective approach for frequent sequence mining via prime-block encoding.",
            "Constraint satisfaction with bounded treewidth revisited.",
            "Pattern matching with don't cares and few errors.",
            "Reduction rules for reset/inhibitor nets.",
            "FPT algorithms and kernels for the Directed k-Leaf problem.",
            "Content-dependent chunking for differential compression, the local maximum approach.",
            "Approximation and fixed-parameter algorithms for consecutive ones submatrix problems.",
            "Communication algorithms with advice.",
            "Numberings optimal for learning.",
            "Decision problems for language equations.",
            "An approximation trichotomy for Boolean #CSP.",
            "Corrigendum to \"Shifting: One-inclusion mistake bounds and sample compression\" [J. Comput. System Sci 75 (1) (2009) 37-59].",
            "Editors' foreword for JCSS WoLLIC 2008.",
            "Matching and alpha-equivalence check for nominal terms.",
            "Inter-deriving semantic artifacts for object-oriented programming.",
            "Homomorphism preservation on quasi-wide classes.",
            "On the formal semantics of IF-like logics.",
            "Adversary lower bounds for nonadaptive quantum algorithms.",
            "On abstract resource semantics and computability logic.",
            "Interpretation and inference with maximal referential terms.",
            "Special issue: Scientific workflow 2009.",
            "Information flow analysis of scientific workflows.",
            "An uncoordinated asynchronous checkpointing model for hierarchical scientific workflows.",
            "A collaborative scheduling approach for service-driven scientific workflow execution.",
            "Scaling up workflow-based applications.",
            "Parallelizing XML data-streaming workflows via MapReduce.",
            "Localising temporal constraints in scientific workflows.",
            "Efficiently supporting secure and reliable collaboration in scientific workflows.",
            "A formal semantics for the Taverna 2 workflow model.",
            "Isomorphism and canonization of tournaments and hypertournaments.",
            "A kernelization algorithm for d-Hitting Set.",
            "Simplified proof of the blocking theorem for free-choice Petri nets.",
            "Trajectory databases: Data models, uncertainty and complete query languages.",
            "Generalized modal satisfiability.",
            "Causal graphs and structurally restricted planning.",
            "Comparing trees via crossing minimization.",
            "Fuzzy relation equations and reduction of fuzzy automata.",
            "Counting complexity of propositional abduction.",
            "Algorithm for finding k-vertex out-trees and its application to k-internal out-branching problem.",
            "Hashing and canonicalizing Notation 3 graphs.",
            "Thresholding random geometric graph properties motivated by ad hoc sensor networks.",
            "Improved algorithms for finding length-bounded two vertex-disjoint paths in a planar graph and minmax k vertex-disjoint paths in a directed acyclic graph.",
            "Connected facility location via random facility sampling and core detouring.",
            "The parameterized complexity of some minimum label problems.",
            "Dual ceiling protocol for real-time synchronization under preemption threshold scheduling.",
            "Sequencing by hybridization in few rounds.",
            "Incentive compatible regression learning.",
            "On pebble automata for data languages with decidable emptiness problem.",
            "Space-efficient informational redundancy.",
            "Towards a dichotomy for the Possible Winner problem in elections based on scoring rules.",
            "Simple restriction in context-free rewriting.",
            "Constraint satisfaction with succinctly specified relations.",
            "Subword balance, position indices and power sums.",
            "Betweenness parameterized above tight lower bound.",
            "A deterministic approximation algorithm for computing the permanent of a 0, 1 matrix.",
            "When consensus meets self-stabilization."
        ]
    },
    {
        "name": "JCSS",
        "year": "2009",
        "info": "2009: Volume 75",
        "count": 32,
        "papers": [
            "Special Issue: Learning Theory 2006.",
            "Cryptographic hardness for learning intersections of halfspaces.",
            "Hardness of approximate two-level logic minimization and PAC learning with membership queries.",
            "Efficient learning algorithms yield circuit lower bounds.",
            "Shifting: One-inclusion mistake bounds and sample compression.",
            "Learning a circuit by injecting values.",
            "Agnostic active learning.",
            "On expected constant-round protocols for Byzantine agreement.",
            "On pseudoknot-bordered words and their properties.",
            "Better bounds for minimizing SONET ADMs.",
            "Parameterizing above or below guaranteed values.",
            "Faster pattern matching with character classes using prime number encoding.",
            "Symmetries and the complexity of pure Nash equilibrium.",
            "Implementing the Omega failure detector in the crash-recovery failure model.",
            "The power of verification for one-parameter agents.",
            "Broadcasting in dynamic radio networks.",
            "Derivation of algorithms for cutwidth and related graph layout parameters.",
            "The complexity of satisfiability problems: Refining Schaefer's theorem.",
            "An application of quantum finite automata to interactive proof systems.",
            "Deciding equivalence of top-down XML transformations in polynomial time.",
            "On approximating four covering and packing problems.",
            "XML compression techniques: A survey and comparison.",
            "Using the doubling dimension to analyze the generalization of learning algorithms.",
            "Reasoning about XML update constraints.",
            "Pattern matching with address errors: Rearrangement distances.",
            "Interval-valued fuzzy permutation method and experimental analysis on cardinal and ordinal evaluations.",
            "Improved conditions for bounded tardiness under EPDF Pfair multiprocessor scheduling.",
            "Erratum to \"Languages not recognizable in real time by one-dimensional cellular automata\" [J. Comput. System Sci 74 (7) (2008) 1095-1102].",
            "On problems without polynomial kernels.",
            "Almost 2-SAT is fixed-parameter tractable.",
            "Efficient algorithms for the inverse sorting problem with bound constraints under the l∞-norm and the Hamming distance.",
            "Worst-case optimal algorithm for XPath evaluation over XML streams."
        ]
    },
    {
        "name": "JCSS",
        "year": "2008",
        "info": "2008: Volume 74",
        "count": 88,
        "papers": [
            "Special issue on learning theory.",
            "Learning with errors in answers to membership queries.",
            "The complexity of properly learning simple concept classes.",
            "Learning intersections of halfspaces with a margin.",
            "Using mixture models for collaborative filtering.",
            "A decentralized algorithm for spectral analysis.",
            "Case-factor diagrams for structured probabilistic modeling.",
            "Online linear optimization and adaptive routing.",
            "Deterministic calibration and Nash equilibrium.",
            "Special issue: Web and mobile information systems.",
            "The web from a complex adaptive systems perspective.",
            "Enabling device independent co-browsing through adaptive view points.",
            "Interfacing remote transaction services using UPnP.",
            "XML data update management in XML-enabled database.",
            "An ontological engineering approach for automating inspection and quarantine at airports.",
            "Consumer-centric QoS-aware selection of web services.",
            "Performance analysis of multimedia based web traffic with QoS constraints.",
            "Stateless data concealment for distributed systems.",
            "Topological analysis of AOCD-based agent networks and experimental results.",
            "A distributed multi-agent meeting scheduler.",
            "Foreword.",
            "Extremal properties of polynomial threshold functions.",
            "Quantum certificate complexity.",
            "A combinatorial characterization of resolution width.",
            "Vertex cover might be hard to approximate to within 2-epsilon.",
            "The complexity of stochastic sequences.",
            "Proving SAT does not have small circuits with an application to the two queries problem.",
            "Lower bounds for predecessor searching in the cell probe model.",
            "The complexity of Unique k-SAT: An Isolation Lemma for k-CNFs.",
            "Minimization of decision trees is hard to approximate.",
            "Erratum to \"Propagating XML constraints to relations\" [JCSS 73 (2007) 316-361].",
            "Memorial issue for Carl Smith.",
            "Non-U-shaped vacillatory and team learning.",
            "Learning languages from positive data and negative counterexamples.",
            "Probabilistic and team PFIN-type learning: General properties.",
            "Inferring answers to queries.",
            "Taming teams with mind changes.",
            "Learning with belief levels.",
            "Learning a hidden graph using O(logn) queries per edge.",
            "The value of agreement a new boosting algorithm.",
            "The orchard visibility problem and some variants.",
            "The chromatic number of the plane: The bounded case.",
            "Finding large 3-free sets I: The small n case.",
            "Cryptanalysis of a password authentication scheme over insecure networks.",
            "Tight approximation algorithm for connectivity augmentation problems.",
            "On the Approximation of Correlation Clustering and Consensus Clustering.",
            "Compact samples for data dissemination.",
            "A unified theory of structural tractability for constraint satisfaction problems.",
            "Improved bounds on sorting by length-weighted reversals.",
            "Compact roundtrip routing with topology-independent node names.",
            "Maximal repetitions in strings.",
            "Fast periodic graph exploration with constant memory.",
            "The gap in circumventing the impossibility of consensus.",
            "Hardness of optimal spaced seed design.",
            "Convex recolorings of strings and trees: Definitions, hardness results and algorithms.",
            "Finite automata for testing composition-based reconstructibility of sequences.",
            "Approximation of satisfactory bisection problems.",
            "Simultaneous matchings: Hardness and approximation.",
            "Computational complexity of auditing finite attributes in statistical databases.",
            "Fault tolerance in cellular automata at high fault rates.",
            "Efficient algorithms for counting parameterized list H-colorings.",
            "Performance analysis and evaluation of parallel, cluster, and grid computing systems.",
            "A two-class parallel system with general service times of the parallel class.",
            "Performance evaluation of supercomputers using HPCC and IMB Benchmarks.",
            "A simulator for adaptive parallel applications.",
            "Analytic performance comparison of hypercubes and star graphs with implementation constraints.",
            "Analysing distributed Internet worm attacks using continuous state-space approximation of process algebra models.",
            "A new general method to compute virtual channels occupancy probabilities in wormhole networks.",
            "An Adaptive Dynamic Grid-Based approach to DDM for large-scale distributed simulation systems.",
            "A heuristic flow-decomposition approach for generalized processor sharing under self-similar traffic.",
            "Comparing job allocation schemes where service demand is unknown.",
            "A framework for adaptive collective communications for heterogeneous hierarchical computing systems.",
            "Languages not recognizable in real time by one-dimensional cellular automata.",
            "Structure identification of Boolean relations and plain bases for co-clones.",
            "Lower bounds for the transition complexity of NFAs.",
            "The equivalence problem of multidimensional multitape automata.",
            "Precedence constrained scheduling in (2 - 7/(3p+1)) optimal.",
            "Generating all maximal induced subgraphs for hereditary and connected-hereditary graph properties.",
            "Two-factor mutual authentication based on smart cards and passwords.",
            "The complexity of unions of disjoint sets.",
            "Improved algorithms for feedback vertex set problems.",
            "Nash equilibria in discrete routing games with convex latency functions.",
            "Guest editors' introduction: Special issue on learning theory.",
            "The weak aggregating algorithm and weak mixability.",
            "Reducing mechanism design to algorithm design via machine learning.",
            "Competitive collaborative learning.",
            "Towards a theoretical foundation for Laplacian-based manifold methods.",
            "An analysis of model-based Interval Estimation for Markov Decision Processes."
        ]
    },
    {
        "name": "JCSS",
        "year": "2007",
        "info": "2007: Volume 73",
        "count": 72,
        "papers": [
            "Automata on linear orderings.",
            "S2p is subset of ZPPNP.",
            "Languages polylog-time reducible to dot-depth 1/2.",
            "Online promise problems with online width metrics.",
            "Dichotomy for voting systems.",
            "Multicriteria fuzzy decision-making methods based on intuitionistic fuzzy sets.",
            "Learning languages in a union.",
            "On the learnability of vector spaces.",
            "Quantum cooperative search algorithm for 3-SAT.",
            "Membrane computing and complexity theory: A characterization of PSPACE.",
            "Guest Editors' Foreword.",
            "Dispatch sequences for embedded control models.",
            "A Platform-Independent Component Modeling Language for Distributed Real-time and Embedded Systems.",
            "Holistic analysis of asynchronous real-time transactions with earliest deadline scheduling.",
            "Workload correlations in multi-processor hard real-time systems.",
            "Exact admission-control for integrated aperiodic and periodic tasks.",
            "Database Theory 2004.",
            "The price of validity in dynamic networks.",
            "Spatially-decaying aggregation over a network.",
            "Automata for XML - A survey.",
            "Propagating XML constraints to relations.",
            "Frontiers of tractability for typechecking simple XML transformations.",
            "On the memory requirements of XPath evaluation over XML streams.",
            "Specification and verification of data-driven Web applications.",
            "Weighted hypertree decompositions and optimal query plans.",
            "A formal analysis of information disclosure in data exchange.",
            "Special issue on database theory.",
            "On the complexity of division and set joins in the relational algebra.",
            "On the minimization of XML Schemas and tree automata for unranked trees.",
            "Magic Sets and their application to data integration.",
            "First-order query rewriting for inconsistent databases.",
            "Dependency-preserving normalization of relational and XML data.",
            "An incremental algorithm for computing ranked full disjunctions.",
            "Exploiting schemas in data synchronization.",
            "Maximum H-colourable subdigraphs and constraint optimization with arbitrary weights.",
            "Using views to generate efficient evaluation plans for queries.",
            "On the generalization error of fixed combinations of classifiers.",
            "Autoreducibility, mitoticity, and immunity.",
            "Subgraph isomorphism, log-bounded fragmentation, and graphs of (locally) bounded treewidth.",
            "Undecidability of the structure of the Solovay degrees of c.e. reals.",
            "An equational logic based approach to the security problem against inference attacks on object-oriented databases.",
            "The relative worst-order ratio applied to paging.",
            "A representation independent language for planar spatial databases with Euclidean distance.",
            "Approximating total flow time on parallel machines.",
            "Genus characterizes the complexity of certain graph problems: Some tight results.",
            "Minimizing nfa's and regular expressions.",
            "A general dimension for query learning.",
            "View disassembly: A rewrite that extracts portions of views.",
            "Counting lattice vectors.",
            "Individual communication complexity.",
            "Linear time algorithms for Abelian group isomorphism and related problems.",
            "Near optimal multiple alignment within a band in polynomial time.",
            "Fast factorization by similarity in formal concept analysis of data with fuzzy attributes.",
            "Special issue on computational molecular biology.",
            "On the complexity of the spaced seeds.",
            "Optimal spaced seeds for faster approximate string matching.",
            "A 1.75-approximation algorithm for unsigned translocation distance.",
            "The most probable annotation problem in HMMs and its application to bioinformatics.",
            "Efficient approximation of convex recolorings.",
            "The identification of positive clones in a general inhibitor model.",
            "Two algorithms for LCS Consecutive Suffix Alignment.",
            "Network-based computing.",
            "A new approach to model virtual channels in interconnection networks.",
            "Communication delay analysis of fault-tolerant pipelined circuit switching in torus.",
            "Energy-efficient wireless information retrieval.",
            "Portfolio and investment risk analysis on global grids.",
            "Artificial life techniques for load balancing in computational grids.",
            "On the performance-driven load distribution for heterogeneous computational grids.",
            "Performance analysis of priority scheduling mechanisms under heterogeneous network traffic.",
            "Using on-chip networks to implement polymorphism in the co-design of object-oriented embedded systems.",
            "Structural properties of Cayley digraphs with applications to mesh and pruned torus interconnection networks.",
            "Towards highly available and scalable high performance clusters."
        ]
    },
    {
        "name": "JCSS",
        "year": "2006",
        "info": "2006: Volume 72",
        "count": 70,
        "papers": [
            "Real-valued multiple-instance learning with queries.",
            "An improved approximation algorithm for vertex cover with hard capacities.",
            "Bounded fixed-parameter tractability and log2n nondeterministic bits.",
            "The subsumption lattice and query learning.",
            "Sequential predictions based on algorithmic complexity.",
            "Minimizing maximum fiber requirement in optical networks.",
            "Optimal preemptive scheduling for general target functions.",
            "The many faces of a translation.",
            "Expand, Enlarge and Check: New algorithms for the coverability problem of WSTS.",
            "Special Issue: FOCS 2003.",
            "Hardness of approximating the Shortest Vector Problem in high lp norms.",
            "Polynomial degree vs. quantum query complexity.",
            "On certain connectivity properties of the internet topology.",
            "Symmetric polynomials over Zm and simultaneous communication protocols.",
            "Logics for reasoning about cryptographic constructions.",
            "Lower bounds for non-black-box zero knowledge.",
            "Simulated annealing in convex bodies and an O*(n4) volume algorithm.",
            "Foreword.",
            "A brief overview of network algorithms.",
            "Approximation algorithms for hierarchical location problems.",
            "How much can taxes help selfish routing?",
            "Meet and merge: Approximation algorithms for confluent flows.",
            "Radio communication in random graphs.",
            "TSP with bounded metrics.",
            "A parametric analysis of the state-explosion problem in model checking.",
            "Uniform generation in spatial constraint databases and applications.",
            "Average probe complexity in quorum systems.",
            "Infinite-state high-level MSCs: Model-checking and realizability.",
            "Sublogarithmic approximation for telephone multicast.",
            "LWPP and WPP are not uniformly gap-definable.",
            "Security of the design of time-stamped signatures.",
            "A distributed multiple dimensional QoS constrained resource scheduling optimization policy in computational grid.",
            "A password authentication scheme over insecure networks.",
            "Fuzzy LINMAP method for multiattribute decision making under fuzzy environments.",
            "Dimension, entropy rates, and compression.",
            "Corrigendum to \"Completeness results for graph isomorphism\" [J. Comput. System Sci. 66(2003) 549-566].",
            "Guest editor's foreword.",
            "Extractors from Reed-Muller codes.",
            "Fully dynamic all pairs shortest paths with real edge weights.",
            "Iterative rounding 2-approximation algorithms for minimum-cost vertex connectivity problems.",
            "Planar graphs, negative weight edges, shortest paths, and near linear time.",
            "Ramsey-type theorems for metric spaces with applications to online problems.",
            "On the severity of Braess's Paradox: Designing networks for selfish users is hard.",
            "Nearest neighbors search using point location in balls with applications to approximate Voronoi decompositions.",
            "Provably secure threshold password-authenticated key exchange.",
            "Password-based authentication and key distribution protocols with perfect forward secrecy.",
            "Tolerant property testing and distance approximation.",
            "Error-bounded probabilistic computations between MA and AM.",
            "Inoculation strategies for victims of viruses and the sum-of-squares partition problem.",
            "Optimal rate-based scheduling on multiprocessors.",
            "Performance modelling and evaluation of computer systems.",
            "An analytical model for loss estimation in network traffic analysis systems.",
            "Systematic performance modeling and characterization of heterogeneous IP networks.",
            "Clustering overhead and convergence time analysis of the mobility-based multi-hop clustering algorithm for mobile ad hoc networks.",
            "Determining model accuracy of network traces.",
            "Performance evaluation for self-healing distributed services and fault detection mechanisms.",
            "Performance evaluation of an intelligent CAC and routing framework for multimedia applications in broadband networks.",
            "Prediction of short-lived TCP transfer latency on bandwidth asymmetric links.",
            "HAMS: Scalable peer-to-peer multimedia streaming model in heterogeneous networks.",
            "A tentative commit protocol for composite web services.",
            "Control of queueing delay in a buffer with time-varying arrival rate.",
            "Technical note: Replication graphs revisited.",
            "Robust gossiping with an application to consensus.",
            "A faster distributed protocol for constructing a minimum spanning tree.",
            "Maximizing data locality in distributed systems.",
            "Complexity of reachability problems for finite discrete dynamical systems.",
            "Strong computational lower bounds via parameterized complexity.",
            "Construction universality in purely asynchronous cellular automata.",
            "Compression-based fixed-parameter algorithms for feedback vertex set and edge bipartization.",
            "DELFIN+: An efficient deadlock detection tool for CCS processes."
        ]
    },
    {
        "name": "JCSS",
        "year": "2005",
        "info": "2005: Volumes 70, 71",
        "count": 58,
        "papers": [
            "Partially ordered regular languages for graph queries.",
            "Extracting fuzzy if-then rules by using the information matrix technique.",
            "Wire length as a circuit complexity measure.",
            "Multiattribute decision making models and methods using intuitionistic fuzzy sets.",
            "Extracting the workflow critical path from the extended well-formed workflow schema.",
            "A provable better Branch and Bound method for a nonconvex integer quadratic programming problem.",
            "A parametric error analysis of Goldschmidt's division algorithm.",
            "Efficiently parallelizable problems on a class of decomposable graphs.",
            "Language equations, maximality and error-detection.",
            "First-order expressibility of languages with neutral letters or: The Crane Beach conjecture.",
            "Linear-time algorithms for computing maximum-density sequence segments with bioinformatics applications.",
            "On paging with locality of reference.",
            "A probabilistic model of computing with words.",
            "Delay-insensitive computation in asynchronous cellular automata.",
            "Attribute grammars for unranked trees as a query language for structured documents.",
            "A local approach for temporal model checking of Java bytecode.",
            "Guest Editors' foreword.",
            "An O(n2) algorithm for signed translocation.",
            "A 1.5-approximation algorithm for sorting by transpositions and transreversals.",
            "Sorting signed permutations by reversals, revisited.",
            "Designing seeds for similarity search in genomic DNA.",
            "Vector seeds: An extension to spaced seeds.",
            "Optimal, efficient reconstruction of root-unknown phylogenetic networks with constrained and structured recombination.",
            "Designing optimally multiplexed SNP genotyping assays.",
            "An effective algorithm for peptide de novo sequencing from MS/MS spectra.",
            "Special issue on computational learning theory.",
            "Exact learning of DNF formulas using DNF hypotheses.",
            "Exploring learnability between exact and PAC.",
            "New lower bounds for statistical query learning.",
            "Increasing the power of uniform inductive learners.",
            "Predictive complexity and information.",
            "Performance guarantees for hierarchical clustering.",
            "Prediction and dimension.",
            "Graph-based specification of access control policies.",
            "Monotonic hybrid systems.",
            "A self-stabilizing algorithm for the shortest path problem assuming read/write atomicity.",
            "Efficient parallel factorization and solution of structured and unstructured linear systems.",
            "Tight approximability results for test set problems in bioinformatics.",
            "An improved accuracy measure for rough sets.",
            "Kernels in planar digraphs.",
            "Threshold circuit lower bounds on cryptographic functions.",
            "General constructions for information-theoretic private information retrieval.",
            "Special Issue: Learning Theory 2003.",
            "Learning DNF from random walks.",
            "Boosting in the presence of noise.",
            "Efficient algorithms for online decision problems.",
            "On learning to coordinate: random bits help, insightful normal forms, and competency isomorphisms.",
            "Maximal margin classification for metric spaces.",
            "Clustering with qualitative information.",
            "A refined search tree technique for Dominating Set on planar graphs.",
            "A complete and equal computational complexity classification of compaction and retraction to all graphs with at most four vertices and some general results.",
            "Measuring nondeterminism in pushdown automata.",
            "Fast distributed algorithms for (weakly) connected dominating sets and linear-size skeletons.",
            "An optimal self-stabilizing strarvation-free alternator.",
            "Approximation algorithms for covering/packing integer programs.",
            "An n2-bound for the ultimate equivalence problem of certain D0L systems over an n-letter alphabet.",
            "Bounds on the OBDD-size of integer multiplication via universal hashing.",
            "On the verification of finite failure."
        ]
    },
    {
        "name": "JCSS",
        "year": "2004",
        "info": "2004: Volumes 68, 69",
        "count": 68,
        "papers": [
            "Subword histories and Parikh matrices.",
            "Sensitivity analysis and efficient method for identifying optimal spaced seeds.",
            "Abstract Voronoi diagram in 3-space.",
            "Average stretch without migration.",
            "Randomness and reducibility.",
            "Some measures of dissimilarity in intuitionistic fuzzy structures.",
            "A necessary and sufficient condition for transforming limited accuracy failure detectors.",
            "Trees and learning.",
            "Mixed Pfair/ERfair scheduling of asynchronous periodic tasks.",
            "More efficient PAC-learning of DNF with membership queries under the uniform distribution.",
            "Guest Editors' foreword.",
            "A sharp threshold in proof complexity yields lower bounds for satisfiability search.",
            "Lower bounds for intersection searching and fractional cascading in higher dimension.",
            "Computing crossing numbers in quadratic time.",
            "Learning DNF in time 2Õ(n1/3).",
            "Decidability of string graphs.",
            "Optimal outlier removal in high-dimensional spaces.",
            "Quantitative solution of omega-regular games.",
            "A new protocol and lower bounds for quantum coin flipping.",
            "Clustering to minimize the sum of cluster diameters.",
            "Approximation algorithms for MAX-3-CUT and other problems via complex semidefinite programming.",
            "Computational complexity of compaction to irreflexive cycles.",
            "Algebraic hierarchical graph transformation.",
            "Learning with side information: PAC learning bounds.",
            "Graph properties checkable in linear time in the number of vertices.",
            "On the design of time-stamped signatures.",
            "Branching synchronization grammars with nested tables.",
            "Tight lower bounds on the ambiguity of strong, total, associative, one-way functions.",
            "On the power of nondeterminism and Las Vegas randomization for two-dimensional finite automata.",
            "Guest Editors' foreword.",
            "An information statistics approach to data stream and communication complexity.",
            "Decoding turbo-like codes via linear programming.",
            "Testing juntas.",
            "Implicit B-trees: a new data structure for the dictionary problem.",
            "Learning intersections and thresholds of halfspaces.",
            "A spectral algorithm for learning mixture models.",
            "Guest editor's foreword.",
            "Resolution lower bounds for perfect matching principles.",
            "The correlation between parity and quadratic polynomials mod 3.",
            "The inapproximability of lattice and coding problems with preprocessing.",
            "Hardness amplification within NP.",
            "Scaled dimension and nonuniform complexity.",
            "Robust learning--rich and poor.",
            "Approximation algorithms for classes of graphs excluding single-crossing graphs as minors.",
            "On approximating weighted sums with exponentially many terms.",
            "Minimal DFA for testing divisibility.",
            "A lower bound on the quantum query complexity of read-once functions.",
            "On relations between counting communication complexity classes.",
            "Network QoS games: stability vs optimality tradeoff.",
            "Special issue: 35th Annual ACM Symposium on Theory of Computing.",
            "Random knapsack in expected polynomial time.",
            "Integer priority queues with decrease key in constant time and the single source shortest paths problem.",
            "Testing subgraphs in directed graphs.",
            "Optimal oblivious routing in polynomial time.",
            "Exponential lower bound for 2-query locally decodable codes via a quantum argument.",
            "Learning functions of k relevant variables.",
            "Cell-probe lower bounds for the partial match problem.",
            "Classical complexity and quantum entanglement.",
            "A tight bound on approximating arbitrary metrics by tree metrics.",
            "On the reducibility of sets inside NP to sets with low information content.",
            "Linear time algorithms for finding and representing all the tandem repeats in a string.",
            "Approximating the dense set-cover problem.",
            "One-dimensional quantum walks with absorbing boundaries.",
            "On the computational power of circuits of spiking neurons.",
            "An expressive language for linear spatial database queries.",
            "Minimal unsatisfiable formulas with bounded clause-variable difference are fixed-parameter tractable.",
            "On complexity of single-minded auction.",
            "Global robust stability of delayed neural networks with a class of general activation functions."
        ]
    },
    {
        "name": "JCSS",
        "year": "2003",
        "info": "2003: Volumes 66, 67",
        "count": 71,
        "papers": [
            "Guest Editor's Foreword.",
            "Analysis and application of adaptive sampling.",
            "Query containment for data integration systems.",
            "Verification of relational transducers for electronic commerce.",
            "Typechecking for XML transformers.",
            "Generalized substring selectivity estimation.",
            "On the content of materialized aggregate views.",
            "Reachability and connectivity queries in constraint databases.",
            "Indexing Moving Points.",
            "Auditing Boolean attributes.",
            "Integrity constraints for XML.",
            "TTL: a modular language for hardware/software systems design.",
            "An axiomatic semantics for the synchronous language Gentzen.",
            "An efficient fully polynomial approximation scheme for the Subset-Sum Problem.",
            "Approximate testing with error relative to input size.",
            "The complexity of the temporal logic with \"until\" over general linear time.",
            "Quantum multi-prover interactive proof systems with limited prior entanglement.",
            "Translation of binary regular expressions into nondeterministic ε-free automata with transitions.",
            "Guess-and-verify versus unrestricted nondeterminism for OBDDs and one-way Turing machines.",
            "On the difficulty of approximately maximizing agreements.",
            "Blocking a transition in a free choice net and what it tells about its throughput.",
            "Completeness results for graph isomorphism.",
            "Scheduling multicasts on unit-capacity trees and meshes.",
            "Guest Editor's Foreword.",
            "Optimal aggregation algorithms for middleware.",
            "Relaxed multi-way trees with group updates.",
            "Database-friendly random projections: Johnson-Lindenstrauss with binary coins.",
            "XML with data values: typechecking revisited.",
            "Pipelining in multi-query optimization.",
            "Two-dimensional substring indexing.",
            "Robbers, marshals, and guards: game theoretic and logical characterizations of hypertree width.",
            "Querying websites using compact skeletons.",
            "A simple reduction of non-uniformity in dynamic load balancing of quantized loads on hypercube multiprocessors and hiding balancing overheads.",
            "Stability of long-lived consensus.",
            "On parallel attribute-efficient learning.",
            "Constant time parallel sorting: an empirical view.",
            "Connection caching: model and algorithms.",
            "Proof theory of higher-order equations: conservativity, normal forms and term rewriting.",
            "Remarks on permutive cellular automata.",
            "Preemptive scheduling in overloaded systems.",
            "Scheduling loosely connected task graphs.",
            "Guest Editor's Foreword.",
            "Random sampling and approximation of MAX-CSPs.",
            "Computing the Betti numbers of arrangements via spectral sequences.",
            "Clifford algebras and approximating the permanent.",
            "A polynomial-time algorithm to approximately count contingency tables when the number of rows is constant.",
            "On the complexity of price equilibria.",
            "Fitting algebraic curves to noisy data.",
            "The price of anarchy is independent of the network topology.",
            "Recognizing string graphs in NP.",
            "Optimal finger search trees in the pointer machine.",
            "Pseudo-random generators for all hardnesses.",
            "Almost all graphs with average degree 4 are 3-colorable.",
            "Near-optimal hardness results and approximation algorithms for edge-disjoint paths and related problems.",
            "Automatic graphs and D0L-sequences of finite graphs.",
            "Intrinsic complexity of learning geometrical concepts from positive data.",
            "One-way permutations and self-witnessing languages.",
            "Complex-valued wavelet network.",
            "On the approximability of clique and related maximization problems.",
            "Foreword from the guest editors.",
            "The Turing way to parameterized complexity.",
            "The k-FEATURE SET problem is W[2]-complete.",
            "Solving large FPT problems on coarse-grained parallel machines.",
            "Call control with k rejections.",
            "A fixed-parameter algorithm for minimum quartet inconsistency.",
            "The parametrized complexity of knot polynomials.",
            "On the parameterized complexity of the fixed alphabet shortest common supersequence and longest common subsequence problems.",
            "Improving a fixed parameter tractability time bound for the shadow problem.",
            "On the existence of subexponential parameterized algorithms.",
            "Graph separators: a parameterized view.",
            "Constrained minimum vertex cover in bipartite graphs: complexity and parameterized algorithms."
        ]
    },
    {
        "name": "JCSS",
        "year": "2002",
        "info": "2002: Volumes 64, 65",
        "count": 72,
        "papers": [
            "Special Issue on COLT 2000 - Guest Editor's Foreword.",
            "A New Abstract Combinatorial Dimension for Exact Learning via Queries.",
            "The Computational Complexity of Densest Region Detection.",
            "Adaptive and Self-Confident On-Line Learning Algorithms.",
            "Relative Expected Instantaneous Loss Bounds.",
            "Boosting Using Branching Programs.",
            "Drifting Games and Brownian Motion.",
            "Estimation and Approximation Bounds for Gradient-Based Reinforcement Learning.",
            "Inductive Inference with Additional Information.",
            "Efficient Approximation Algorithms for the SUBSET-SUMS EQUALITY Problem.",
            "Formal Software Specification with Refinements and Modules of Typed Graph Transformation Systems.",
            "Competitive On-line Scheduling of Continuous-Media Streams.",
            "Hierarchical Graph Transformation.",
            "Minimality of an Automaton Cascade Decomposition for Learning System Environments.",
            "Context-Free Languages of Sub-exponential Growth.",
            "Reducing the Number of Solutions of NP Functions.",
            "Interval Consistency of Asynchronous Distributed Computations.",
            "Output String Languages of Compositions of Deterministic Macro Tree Transducers.",
            "LTL Is Expressively Complete for Mazurkiewicz Traces.",
            "Lower Bounds for Linearly Transformed OBDDs and FBDDs.",
            "Special Issue on PODS 1999 - Guest Editors' Foreword.",
            "Rewriting of Regular Expressions and Regular Path Queries.",
            "Inherent Complexity of Recursive Queries.",
            "Maximizing Sharing of Protected Information.",
            "A Framework for Measuring Differences in Data Characteristics.",
            "Hypertree Decompositions and Tractable Queries.",
            "Aggregate Operators in Constraint Query Languages.",
            "Querying Incomplete Information in Semistructured Data.",
            "Polymorphic Type Inference for the Relational Algebra.",
            "Tracking Join and Self-Join Sizes in Limited Storage.",
            "Guest Editor's Foreword.",
            "Quantum Lower Bounds by Quantum Arguments.",
            "Finding Smooth Integers in Short Intervals Using CRT Decoding.",
            "Query Strategies for Priced Information.",
            "Connectivity and Inference Problems for Temporal Networks.",
            "A New Proof of the Weak Pigeonhole Principle.",
            "Tighter Lower Bounds for Nearest Neighbor Search and Related Problems in the Cell Probe Model.",
            "Guest Editor's Foreword.",
            "Determinism versus Nondeterminism for Linear Time RAMs with Memory Restrictions.",
            "Optimal Bounds for the Predecessor Problem and Related Problems.",
            "Finding Similar Regions in Many Sequences.",
            "Extracting all the Randomness and Reducing the Error in Trevisan's Extractors.",
            "A Constant-Factor Approximation Algorithm for the k-Median Problem.",
            "A Fully Dynamic Algorithm for Maintaining the Transitive Closure.",
            "Reducibility between Classes of Port Graph Grammar.",
            "Online Learning of Binary and n-ary Relations over Clustered Domains.",
            "New Lowness Results for ZPPNP and Other Complexity Classes.",
            "Some Decision Problems Concerning Semilinearity and Commutation.",
            "An Algorithm for Handling Many Relational Calculus Queries Efficiently.",
            "On the Complexity of Pattern Matching for Highly Compressed Two-Dimensional Texts.",
            "Node Replacements in Embedding Normal Form.",
            "The Equivalence Problem for DF0L Languages and Power Series.",
            "Unary Context-Free Grammars and Pushdown Automata, Descriptional Complexity and Auxiliary Space Lower Bounds.",
            "Generalization Error of Combined Classifiers.",
            "Foreword.",
            "Reconstructing an ancestral genome using minimum segments duplications and reversals.",
            "The longest common subsequence problem for sequences with nested arc annotations.",
            "Combining polynomial running time and fast convergence for the disk-covering method.",
            "Methods for reconstructing the history of tandem repeats and their application to the human genome.",
            "Steps toward accurate reconstructions of phylogenies from gene-order data.",
            "The restriction mapping problem revisited.",
            "The consensus string problem and the complexity of comparing hidden Markov models.",
            "Efficient algorithms for locating the length-constrained heaviest segments with applications to biomolecular sequence analysis.",
            "Efficient algorithms for multichromosomal genome rearrangements.",
            "Foreword.",
            "A linear lower bound on the unbounded error probabilistic communication complexity.",
            "Monotone simulations of non-monotone proofs.",
            "Affine projections of symmetric polynomials.",
            "On the complexity of approximating the VC dimension.",
            "In search of an easy witness: exponential time vs. probabilistic polynomial time.",
            "Uniform constant-depth threshold circuits for division and iterated multiplication.",
            "Universal traversal sequences with backtracking."
        ]
    },
    {
        "name": "JCSS",
        "year": "2001",
        "info": "2001: Volumes 62, 63",
        "count": 65,
        "papers": [
            "Full Intersection Types and Topologies in Lambda Calculus.",
            "Semantics and Expressive Power of Nondeterministic Constructs in Deductive Databases.",
            "Belief Revision and Update: Complexity of Model Checking.",
            "A Process-Calculus Analysis of Concurrent Operations on B-Trees.",
            "Agnostic Learning of Geometric Patterns.",
            "On the Benefit of Supporting Virtual Channels in Wormhole Routers.",
            "Robust Learning Is Rich.",
            "Guest Editor's Foreword.",
            "Computational Arithmetic Geometry I. Sentences Nearly in the Polynomial Hierarchy.",
            "Pseudorandom Generators without the XOR Lemma.",
            "Linear Gaps between Degrees for the Polynomial Calculus Modulo Distinct Primes.",
            "Graph Ramsey Theory and the Polynomial Hierarchy.",
            "The Communication Complexity of Pointer Chasing.",
            "A Lower Bound for Primality.",
            "On the Complexity of k-SAT.",
            "Quantum Simulations of Classical Random Walks and Undirected Graph Connectivity.",
            "Competitive Routing of Virtual Circuits with Unknown Duration.",
            "Parallel Output-Sensitive Algorithms for Combinatorial and Linear Algebra Problems.",
            "Synthesizing Learners Tolerating Computable Noisy Data.",
            "The Stability of Saturated Linear Dynamical Systems Is Undecidable.",
            "On ACTL Formulas Having Linear Counterexamples.",
            "Improved Bounds on the Sample Complexity of Learning.",
            "Estimation on Domain of Attraction and Convergence Rate of Hopfield Continuous Feedback Neural Networks.",
            "Refinements of Complexity Results on Type Consistency for Object-Oriented Databases.",
            "Translating Regular Expressions into Small -Free Nondeterministic Finite Automata.",
            "Linear-Consistency Testing.",
            "Separation Results for Separated Apex NLC and NCE Graph Languages.",
            "The Descriptive Complexity Approach to LOGCFL.",
            "New Error Bounds for Solomonoff Prediction.",
            "Verification by Augmented Abstraction: The Automata-Theoretic View.",
            "Editor's Foreword.",
            "Fairness in Routing and Load Balancing.",
            "Sharing the Cost of Multicast Transmissions.",
            "Recommendation Systems: A Probabilistic Analysis.",
            "Combining Fairness with Throughput: Online Routing with Multiple Objectives.",
            "The Combinatorics of Cache Misses during Matrix Multiplication.",
            "Compression Using Efficient Multicasting.",
            "Gust Editor's Foreword.",
            "The Communication Complexity of Enumeration, Elimination, and Selection.",
            "On the Complexity of Some Problems on Groups Input as Multiplication Tables.",
            "Quantum Kolmogorov Complexity.",
            "Branching Program Size Is Almost Linear in Formula Size.",
            "Easiness Assumptions and Hardness Tests: Trading Time for Zero Error.",
            "A Lower Bound for the Shortest Path Problem.",
            "Time-Space Tradeoffs for SAT on Nonuniform Machines.",
            "Integer Circuit Evaluation Is PSPACE-Complete.",
            "Language Learning from Texts: Degrees of Intrinsic Complexity and Their Characterizations.",
            "Quantum Neural Networks.",
            "Tight Lower Bounds on the Size of Sweeping Automata.",
            "Logic over Words on Denumerable Ordinals.",
            "Distance Realization Problems with Applications to Internet Tomography.",
            "Spectral Methods for Matrix Rigidity with Applications to Size-Depth Trade-offs and Communication Complexity.",
            "Low Complexity Variants of the Arrow Distributed Directory.",
            "A Polynomial-time Algorithm for the Bistable Roommates Problem.",
            "A Slight Sharpening of LMN.",
            "Guest Editor's Foreword.",
            "Which Problems Have Strongly Exponential Complexity?",
            "A Randomized Approximation Scheme for Metric MAX-CUT.",
            "Time-Space Tradeoffs for Branching Programs.",
            "Protocols for Asymmetric Communication Channels.",
            "The Minimum Equivalent DNF Problem and Shortest Implicants.",
            "Perfect Information Leader Election in log* n+O (1) Rounds.",
            "On Approximate Nearest Neighbors under linfinity Norm.",
            "Heuristics for Semirandom Graph Problems.",
            "Randomness vs Time: Derandomization under a Uniform Assumption."
        ]
    },
    {
        "name": "JCSS",
        "year": "2000",
        "info": "2000: Volumes 60, 61",
        "count": 52,
        "papers": [
            "On the Inapproximability of Disjoint Paths and Minimum Steiner Forest with Bandwidth Constraints.",
            "Rooted Branching Bisimulation as a Congruence.",
            "Global Exponential Stability and Periodic Solutions of Delayed Cellular Neural Networks.",
            "On Relationships between Statistical Zero-Knowledge Proofs.",
            "Data Independence of Read, Write, and Control Structures in PRAM Computations.",
            "A 5/4 Linear Time Bin Packing Algorithm.",
            "Computational Sample Complexity and Attribute-Efficient Learning.",
            "Estimation of the Domain of Attraction and the Convergence Rate of a Hopfield Associative Memory and an Application.",
            "Deciding Bisimilarity and Similarity for Probabilistic Processes.",
            "Editor's Foreword.",
            "Robust Learning Aided by Context.",
            "Structural Results about Exact Learning with Unspecified Attribute Values.",
            "Sample Complexity of Model-Based Search.",
            "An Average-Case Optimal One-Variable Pattern Language Learner.",
            "Editor's Foreword.",
            "Time-Space Tradeoffs for Satisfiability.",
            "Reversible Space Equals Deterministic Space.",
            "Circuits and Expressions with Nonassociative Gates.",
            "On TC0, AC0, and Arithmetic Circuits.",
            "Circuits over PP and PL.",
            "Inequalities for Shannon Entropy and Kolmogorov Complexity.",
            "Undecidability Results for Low Complexity Time Classes.",
            "Guest Editor's Foreword.",
            "Adaptive Packet Routing for Bursty Adversarial Traffic.",
            "Approximating the Bandwidth via Volume Respecting Embeddings.",
            "On the Limits of Nonapproximability of Lattice Problems.",
            "An Improved Approximation Algorithm for MULTIWAY CUT.",
            "On Indexed Data Broadcast.",
            "Protecting Data Privacy in Private Information Retrieval Schemes.",
            "Min-Wise Independent Permutations.",
            "The Closure of Monadic NP.",
            "Spot-Checkers.",
            "A Comparison of Tree Transductions Defined by Monadic Second Order Logic and by Attribute Grammars.",
            "New Efficient and Secure Protocols for Verifiable Signature Sharing and Other Applications.",
            "Improved Algorithms via Approximations of Probability Distributions.",
            "Computing with Membranes.",
            "Guest Editor's Forword.",
            "Path Constraints in Semistructured Databases.",
            "Efficient Searching with Linear Constraints.",
            "Latent Semantic Indexing: A Probabilistic Analysis.",
            "Relational Transducers for Electronic Commerce.",
            "Querying Spatial Databases via Topological Invariants.",
            "Conjunctive-Query Containment and Constraint Satisfaction.",
            "Separating NP-Completeness Notions under Strong Hypotheses.",
            "The Security of the Cipher Block Chaining Message Authentication Code.",
            "On the No-Z-Cycle Property in Distributed Executions.",
            "Testing Problems with Sublearning Sample Complexity.",
            "A Fault-Tolerance Model for Multiprocessor Real-Time Systems.",
            "On the Difference of Horn Theories.",
            "AVL Trees with Relaxed Balance.",
            "The Lob-Pass Problem.",
            "Asymptotically Optimal Bounds for OBDDs and the Solution of Some Basic OBDD Problems."
        ]
    },
    {
        "name": "JCSS",
        "year": "1999",
        "info": "1999: Volumes 58, 59",
        "count": 62,
        "papers": [
            "Mining Optimized Association Rules for Numeric Attributes.",
            "Managing Conflicts Between Rules.",
            "Topological Queries in Spatial Databases.",
            "Temporal Connectives Versus Explicit Timestamps to Query Temporal Databases.",
            "Answering Queries Using Limited External Query Processors.",
            "Combining Fuzzy Information from Multiple Systems.",
            "A Constant-Factor Approximation Algorithm for the k-MST Problem.",
            "On the Boosting Ability of Top-Down Decision Tree Learning Algorithms.",
            "Characterizing Linear Size Circuits in Terms of Pricacy.",
            "The Space Complexity of Approximating the Frequency Moments.",
            "Extracting Randomness: A Survey and New Constructions.",
            "A Note on the Influence of an epsilon-Biased Random Source.",
            "Deciding the Vapnik-Červonenkis Dimension in ∑p3-Complete.",
            "On the Learnability of Rich Function Classes.",
            "Polynomial Time Approximation Schemes for Dense Instances of NP-Hard Problems.",
            "Maximal Machine Learnable Classes.",
            "A Self-Stabilizing Distributed Algorithm to Find the Median of a Tree Graph.",
            "Paging Against a Distribution and IP Networking.",
            "Analysis of Practical Backoff Protocols for Contention Resolution with Multiple Servers.",
            "Algorithms for Matrix Groups and the Tits Alternative.",
            "Sparse Hard Sets for P: Resolution of a Conjecture of Hartmanis.",
            "Transforming Curves on Surfaces.",
            "An Exponential Lower Bound for the Size of Monotone Real Circuits.",
            "Synthesizers and Their Application to the Parallel Construction of Pseudo-Random Functions.",
            "BP HSpace(S) subseteq DSPACE(S3/2).",
            "On the Complexity of Database Queries.",
            "Regular Path Queries with Constraints.",
            "Cut and Paste.",
            "Complete Geometric Query Languages.",
            "Equivalence of Keyed Relational Schemas by Conjunctive Queries.",
            "On the Decidability of Semilinearity for Semialgebraic Sets and Its Implications for Spatial Databases.",
            "The Computational Complexity of Some Problems of Linear Algebra.",
            "Attractors of Linear Cellular Automata.",
            "Stack Cooperation in Multistack Pushdown Automata.",
            "Tight Bound on Johnson's Algorithm for Maximum Satisfiability.",
            "The Complexity of Finding a Second Hmiltonian Cycle in Cubic Graphs.",
            "Creating Strong, Total, Commutative, Associative One-Way Functions from Any One-Way Function in Complexity Theory.",
            "A Technique for Proving Decidability of Containment and Equivalence of Linear Constraint Queries.",
            "Replication and Consistency in a Distributed Environment.",
            "The Learnability of Unions of Two Rectangles in the Two-Dimensional Discretized Space.",
            "A Self-Stabilizing Algorithm for Detecting Fundamental Cycles in a Graph.",
            "Constraint-Generating Dependencies.",
            "Reasoning about Strings in Databases.",
            "Isolation, Matching, and Counting Uniform and Nonuniform Upper Bounds.",
            "Two Queries.",
            "On Arithmetic Branching Programs.",
            "Approximating the SVP to within a Factor (1+1/dimxi) Is NP-Hard under Randomized Reductions.",
            "Complexity Limitations on Quantum Computation.",
            "Computational Indistinguishability: A Sample Hierarchy.",
            "On Membership Comparable Sets.",
            "Space-Bounded Quantum Complexity.",
            "Hard Sets Are Hard to Find.",
            "Arthur-Merlin Games in Boolean Decision Trees.",
            "Petri Net Languages and Infinite Subsets of m.",
            "Analysis of Two Gradient-Based Algorithms for On-Line Regression.",
            "Models of Nondeterministic Regular Expressions.",
            "Graph Isomorphism and Identification Matrices: Sequential Algorithms.",
            "Petri Nets and Regular Processes.",
            "Bistable Versions of the Marriages and Roommates Problems.",
            "Structure of the Invertible CA Transformations Group.",
            "Selective Mu-Calculus and Formula-Based Equivalence of Transition Systems.",
            "On the Decidability of Semilinearity for Semialgebraic Sets and Its Implications for Spatial Databases - CORRIGENDUM."
        ]
    },
    {
        "name": "JCSS",
        "year": "1998",
        "info": "1998: Volumes 56, 57",
        "count": 49,
        "papers": [
            "Regular Sequence Operations and Their Use in Database Queries.",
            "Trading Independent for Synchronized Parallelism in Finite Copying Parallel Rewriting Systems.",
            "Transforming a Single-Valued Transducer Into a Mealy Machine.",
            "Invertible Linear Cellular Automata over Zm: Algorithmic and Dynamical Aspects.",
            "On Correctness of Nonserializable Executions.",
            "TAL Recognition in O(M(n»)) Time.",
            "Lower Bounds on the Multiparty Communication Complexity.",
            "Counting Protocols for Reliable End-to-End Transmission.",
            "On Interpolating Arithmetic Read-Once Formulas with Exponentiation.",
            "Remarks about Commutative Context-Free Languages.",
            "On the Learnability and Usage of Acyclic Probabilistic Finite Automata.",
            "A Game of Prediction with Expert Advice.",
            "Prediction, Learning, Uniform Convergence, and Scale-Sensitive Dimensions.",
            "Specification and Simulation of Statistical Query Algorithms for Efficiency and Noise Tolerance.",
            "Learning with Unreliable Boundary Queries.",
            "Covering Cubes by Random Half Cubes with Applications to Binary Neural Networks.",
            "2-Testability and Relabelings Produce Everything.",
            "A Lower Bound for Perceptrons and an Oracle Separation of the PPPH Hierarchy.",
            "A Note on Batch and Incremental Learnability.",
            "Learning with Restricted Focus of Attention.",
            "A Fast Algorithm for Query Optimization in Universal-Relation Databases.",
            "Attribute-Efficient Learning in Query and Mistake-Bound Models.",
            "Optimal Circular Arc Representations: Properties, Recognition, and Construction.",
            "The Equivalence of Bottom-Up and Top-Down Tree-to-Graph Transducers.",
            "The Relative Complexity of NP Search Problems.",
            "What Do We Know about the Metropolis Algorithm?",
            "On Data Structures and Asymmetric Communication Complexity.",
            "Randomized Query Processing in Robot Path Planning.",
            "Approximations for the Disjoint Paths Problem in High-Diameter Planar Networks.",
            "Sorting in Linear Time?",
            "What's Decidable about Hybrid Automata?",
            "Reductions in Circuit Complexity: An Isomorphism Theorem and a Gap Theorem.",
            "Integer Programming as a Framework for Optimization and Approximability.",
            "Good Degree Bounds on Nullstellensatz Refutations of the Induction Principle.",
            "DNA Models and Algorithms for NP-Complete Problems.",
            "Zero Knowledge and the Chromatic Number.",
            "Nondeterministic NC1 Computation.",
            "Deterministic and Randomized Bounded Truth-Table Reductions of P, NL, and L to Sparse Sets.",
            "Sequences, Datalog, and Transducers.",
            "Safe Locking Policies for Dynamic Databases.",
            "Algebras for Querying Text Regions: Expressive Power and Optimization.",
            "Arity Bounds in First-Order Incremental Evaluation and Definition of Polynomial Time Database Queries.",
            "Increasing the Resilience of Distributed and Replicated Database Systems.",
            "Semantics and Expressiveness Issues in Active Databases.",
            "Learning with Refutation.",
            "Characterizing Multiterminal Flow Networks and Computing Flows in Networks of Small Treewidth.",
            "Approximating Hyper-Rectangles: Learning and Pseudorandom Sets.",
            "Achilles and the Tortoise Climbing Up the Arithmetical Hierarchy.",
            "A Three-Party Communication Problem."
        ]
    },
    {
        "name": "JCSS",
        "year": "1997",
        "info": "1997: Volumes 54, 55",
        "count": 68,
        "papers": [
            "Comparison of Functional and Predicative Query Paradigms.",
            "A Semideterministic Approach to Object Creation and Nondeterminism in Database Queries.",
            "Tie-Breaking Semantics and Structural Totality.",
            "On the Equivalence of Recursive and Nonrecursive Datalog Programs.",
            "Monotonic Aggregation in Deductive Database.",
            "Knowledgebase Transformations.",
            "The Complexity of Querying Indefinite Data about Linearly Ordered Domains.",
            "Reusing and Modifying Rulebases by Predicate Substitution.",
            "Polynomial Bounds for VC Dimension of Sigmoidal and General Pfaffian Neural Networks.",
            "A Weak Version of the Blum, Shub, and Smale Model.",
            "Neural Networks with Quadratic VC Dimension.",
            "On the Computation of Boolean Functions by Analog Circuits of Bounded Fan-In.",
            "Fully Parallelized Multi-Prover Protocols for NEXP-Time.",
            "Better Lower Bounds for Monotone Threshold Formulas.",
            "Connected Components in O (log^3/2 n) Parallel Time for the CREW PRAM.",
            "All Pairs Shortest Paths for Graphs with Small Integer Length Edges.",
            "On the Exponent of the All Pairs Shortest Path Problem.",
            "Breaking the Theta (n log² n) Barrier for Sorting with Faults.",
            "A Spectrum of Time-Space Trade-Offs for Undirected s-t Connectivity.",
            "The Hardness of Approximate Optima in Lattices, Codes, and Systems of Linear Equations.",
            "Efficient Out-of-Core Algorithms for Linear Relaxation Using Blocking Covers.",
            "When Can We Sort in o(n log n) Time?",
            "Learning an Intersection of a Constant Number of Halfspaces over a Uniform Distribution.",
            "DSPACE(n) = NSPACE(n): A Degree Theoretic Characterization.",
            "An Excursion to the Kolmogorov Random Strings.",
            "Counting Quantifiers, Successor Relations, and Logarithmic Space.",
            "The Isomorphism Conjecture Holds and One-Way Functions Exists Relative to an Oracle.",
            "Semantics vs Syntax vs Computations: Machine Models for Type-2 Polynomial-Time Bounded Functionals.",
            "On P-Immunity of Exponential Time Complete Sets.",
            "The Expressive Powers of Stable Models for Bound and Unbound DATALOG Queries.",
            "On Fixed-Parameter Tractability and Approximability of NP Optimization Problems.",
            "Geometric Approach for Optimal Routing on a Mesh with Buses.",
            "A Model of Interactive Teaching.",
            "A Completeness Theorem for the Expressive Power of Higher-Order Algebraic Specifications.",
            "Faster Shortest-Path Algorithms for Planar Graphs.",
            "Natural Proofs.",
            "Decision Tree Complexity and Betti Numbers.",
            "Optimal Parallel Suffix Tree Construction.",
            "The Discovery of Algorithmic Probability.",
            "Stochastic Complexity in Learning.",
            "Learning about the Parameter of the Bernoulli Model.",
            "On-Line Maximum Likelihood Prediction with Respect to General Loss Functions.",
            "A Decision-Theoretic Generalization of On-Line Learning and an Application to Boosting.",
            "Characterizing Rational Versus Exponential learning Curves.",
            "Approximation and Learning of Convex Superpositions.",
            "Learning Distributions by Their Density Levels: A Paradigm for Learning without a Teacher.",
            "Learning Recursive Functions from Approximations.",
            "Dyn-FO: A Parallel, Dynamic Complexity Class.",
            "Bounded Arity Datalog (not-)Queries on Graphs.",
            "Relaxing the Uniformity and Independence Assumptions Using the Concept of Fractal Dimension.",
            "Query Languages for Bags and Aggregate Functions.",
            "Finitely Representable Databases.",
            "A Query Language for NC.",
            "The Complexity of the Evaluation of Complex Algebra Expressions.",
            "Relative Serializability: An Approach for Relaxing the Atomicity of Transactions.",
            "Can Datalog Be Approximated?",
            "Efficient Oblivious Branching Programs for Threshold and Mod Functions.",
            "On the Design of Reliable Boolean Circuits That Contain Partially Unreliable Gates.",
            "(De)randomized Construction of Small Sample Spaces in NC.",
            "An Efficient Membership-Query Algorithm for Learning DNF with Respect to the Uniform Distribution.",
            "Size-Estimation Framework with Applications to Transitive Closure and Reachability.",
            "Maximum (s, t)-Flows in Planar Networks in O(|V|log|V|)-Time.",
            "The Set of Minimal Words of a Context-Free Language is Context-Free.",
            "Logical Description of Contex-Free Graph Languages.",
            "Amortization Results for Chromatic Search Trees, with an Application to Priority Queues.",
            "Shared Global States in Distributed Computations.",
            "The Steiner Tree Problem in Orientation Metrics.",
            "Universally Serializable Computation."
        ]
    },
    {
        "name": "JCSS",
        "year": "1996",
        "info": "1996: Volumes 52, 53",
        "count": 81,
        "papers": [
            "Separator Based Sparsification. I. Planary Testing and Minimum Spanning Trees.",
            "Parameterized Pattern Matching: Algorithms and Applications.",
            "Randomness is Linear in Space.",
            "Self-Routing Superconcentrators.",
            "A Polynomial-Time Parsing Algorithm for K-Depth Languages.",
            "On the Structural Properties of the Set of Fixpoints for Nondeterministic Recursive Definitions.",
            "Lower Bounds for the Union-Find and the Sp;it-Find Problem on Pointer Machines.",
            "A Framework for Testing Safety and Effective Computability.",
            "Semantic Representations and Query Labguages for Or-Sets.",
            "A Free Construction of Dynamic Terms.",
            "Applications of Range Query Theory to Relational Data Base Join and Selection Operations.",
            "Finite Languages for the Representation of Finite Graphs.",
            "On Parikh Slender Languages and Power Series.",
            "Generic Separations.",
            "Learning Sparse Multivariate Polynomials over a Field with Queries and Counterexamples.",
            "On the Structure of Degrees of Inferability.",
            "General Bounds on the Number of Examples Needed for Learning Probabilistic Concepts.",
            "Teaching a Smarter Learner.",
            "Asking Questions to Minimize Errors.",
            "Temporal Interactions of Intervals in Distributed Systems.",
            "Let Sleeping Files Lie: Pattern Matching in Z-Compressed Files.",
            "Structural Average Case Complexity.",
            "On k-Dimensional Balanced Binary Trees.",
            "Exact Classification with Two-Layer Neural Nets.",
            "On Instance-Completeness for Database Query Languages involving Object Creation.",
            "Learning Binary Perceptrons Perfectly Efficiently.",
            "The Intrinsic Complexity of Language Identification.",
            "Inclusion Problems in Parallel Learning and Games.",
            "Oracles and Queries That Are Sufficient for Exact Learning.",
            "Fat-Shattering and the Learnability of Real-Valued Functions.",
            "Computing the Maximum Bichromatic Discrepancy with Applications to Computer Graphics and Machine Learning.",
            "Learning from a Consistently Ignorant Teacher.",
            "Normal Forms and Conservative Extension Properties for Query Languages over Collection Types.",
            "An Extension of Van Gelder's Alternating Fixpoint to Magic Programs.",
            "Completeness Results for Recursive Data Bases.",
            "Reflective Programming in the Relational Algebra.",
            "Selectivity and Cost Estimation for Joins Based on Random Sampling.",
            "Towards Tractable Algebras for Bags.",
            "Indexing for Data Models with Constraints and Classes.",
            "An O(n) Algorithm for Abelian p-Group Isomorphism and an O(n log n) Algorithm for Abelian Group Isomorphism.",
            "Automaticity I: Properties of a Measure of Descriptional Complexity.",
            "Learnability: Admissible, Co-Finite, and Hypersimple Languages.",
            "Language Theoretic and Algorithmic Properties of d-dimensional Collages and Patterns in a Grid.",
            "Concurrent Counting.",
            "New Lower Bounds and Hierarchy Results for Restricted Branching Programs.",
            "Incremental Learning from Positive Data.",
            "Limits on the Power of Parallel Random Access Machines with Weak Forms of Write Conflict Resolution.",
            "Towards Structured Parallel Computing on Architecture-Independent Parallel Algorithm Design for Distributed-Memory Architectures.",
            "Efficient Theoretic and Practical Algorithms for Linear Matroid Intersection Problems.",
            "A Space Efficient Variant of Path Copying for Partially Persistent Sorted Sets.",
            "Polynomial-Time Isomorphism of 1-L-Complete Sets.",
            "On Limited Nondeterminism and the Complexity of the V-C Dimension.",
            "On Closure Properties of #P in the Context of PF ° #P.",
            "Taking It to the Limit: On Infinite Variants of NP-Complete Problems.",
            "P-Selektive Sets and Reducing Search to Decision vs Self-Reducibility.",
            "P-Selektive Self-Reducible Sets: A New Characterization of P.",
            "Pointers versus Arithmetic in PRAMs.",
            "Relative to a Random Oracle, NP Is Not Small.",
            "Multi-prover Encoding Schemes and Three-prover Proof Systems.",
            "Random Strings Make Hard Instances.",
            "On the Isomorphism Conjecture for Weak Reducibilities.",
            "Logical Definability of Counting Functions.",
            "On the Query Complexity of Clique Size and Maximum Satisfiability.",
            "Bounds on the Greedy Routing Algorithm for Array Networks.",
            "Improved Parity-Declustered Layouts for Disk Arrays.",
            "List Ranking and List Scan on the CRAY C90.",
            "Dynamic Load Balancing by Random Matchings.",
            "Construction of the Mesh and the Torus Tolerating a Large Number of Faults.",
            "On the Parallel Complexity of Gaussian Elimination with Pivoting.",
            "An Optimal Randomised Logarithmic Time Connectivity Algorithm for the EREW PRAM.",
            "Efficient Low-Contention Parallel Algorithms.",
            "An Optimal Predicate Locking Scheduler.",
            "A Threshold for Unsatisfiability.",
            "Maximal and Minimal Solutions to Language Equations.",
            "The Complexity of Nested Counterfactuals and Iterated Knowledge Base Revisions.",
            "K One-Way Heads Cannot Do String-Matching.",
            "River Routing with a Generalized Model.",
            "On Completeness Under Random Reductions.",
            "Regular Description of Context-Free Graph Languages.",
            "Partition Triples: A Tool for Reduction of Data Sets.",
            "Program Synthesis in the Presence of Infinite Number of Inaccuracies."
        ]
    },
    {
        "name": "JCSS",
        "year": "1995",
        "info": "1995: Volumes 50, 51",
        "count": 83,
        "papers": [
            "On the Power of the Linear Array Architecture for Performing Tree-Structured Computations.",
            "Polynomial Size Test Sets for Context-Free Languages.",
            "On the Complexity of Teaching.",
            "Learning in the Presence of Finitely or Infinitely Many Irrelevant Attributes.",
            "On Learning Multiple Concepts in Parallel.",
            "Decision Problems for Patterns.",
            "Load Sharing with Parallel Priority Queues.",
            "Characterizations of Learnability for Classes of {0, ..., n}-Valued Functions.",
            "On the Computational Complexity of Finite Cellular Automata.",
            "Efficient Asynchronous Simulation of a Class of Synchronous Parallel Algorithms.",
            "Robust Trainability of Single Neurons.",
            "Single Row Routing on Multilayers.",
            "On the Computational Power of Neural Nets.",
            "On the NP-Isomorphism Problem with Respect to Random Instances.",
            "Implication Problems for Functional Constraints on Databases Supporting Complex Objects.",
            "PP Is Closed under Intersection.",
            "Approximations and Optimal Geometric Divide-an-Conquer.",
            "Testing Finite State Machines: Fault Detection.",
            "Fast Approximation Algorithms for Multicommodity Flow Problems.",
            "Competitive Paging with Locality of Reference.",
            "A Matroid Approach to Finding Edge Connectivity and Packing Arborescences.",
            "Effective Noether Irreducibility Forms and Applications.",
            "Fast Monte Carlo Algorithms for Permutation Groups.",
            "Computing with First-Order Logic.",
            "When Won't Membership Queries Help?",
            "On Unique Satisfiability and the Threshold Behavior of Randomized Reductions.",
            "Superlinear Lower Bounds for Bounded-Width Branching Programs.",
            "Complexity Classes and Sparse Oracles.",
            "Approximation Properties of NP Minimization Classes.",
            "Closure Properties and Witness Reduction.",
            "Monotone Separation of Logarithmic Space from Logarithmic Depth.",
            "Circuits, Matrices, and Nonassociative Computation.",
            "The Power of the Middle Bit of a #P Function.",
            "Bounding the Complexity of Advice Functions.",
            "Saving Queries with Randomness.",
            "Descriptive Complexity of #P Functions.",
            "Interactive Proof Systems with Polynomially Bounded Strategies.",
            "Learning Boolean Read-Once Formulas over Generalized Bases.",
            "An O(n^(log log n)) Learning Algorithm for DNT under the Uniform Distribution.",
            "On Weak Learning.",
            "Breaking the Probability 1/2 Barrier in FIN-Type Learning.",
            "Cryptographic Lower Bounds for Learnability of Boolean Functions on the Uniform Distribution.",
            "Editor's Forword.",
            "Handling Infinite Temporal Data.",
            "Query Size Estimation by Adaptive Sampling.",
            "Constraint Query Languages.",
            "Constrained Shared Locks for Increased Concurrency in Databases.",
            "The Expressive Powers of the Logic Programming Semantics.",
            "On the Efficiency of Transforming Database Logic Programs.",
            "On the Expressive Power of Datalog: Tools and a Case Study.",
            "Editor's Foreword.",
            "On the Expected Size of Recursive Datalog Queries.",
            "Tractable Query Languages for Complex Object Databases.",
            "A Tight Upper Bound on the Benefits of Replica Control Protocols.",
            "On Datalog vs. Polynomial Time.",
            "Spatial Query Optimization: From Boolean Constraints to Range Queries.",
            "Non-deterministic Queue Operations.",
            "Subtyping in OODBs.",
            "Extrema Predicates in Deductive Databases.",
            "Clique Partitions, Graph Compression and Speeding-Up Algorithms.",
            "Language Learning with Some Negative Information.",
            "The Expected Advantage of Asynchrony.",
            "An Optimal Algorithm for Scheduling Interval Ordered Tasks with Communication on N Processors.",
            "Separating the Communication Complexities of MOD m and MOD p Circuits.",
            "Shortest Paths in Reachability Graphs.",
            "Some Logical Characterizations of the Dot-Depth Hierarchy and Applications.",
            "Editor's Foreword.",
            "Competitive Algorithms for Distributed Data Management.",
            "New Algorithms for an Ancient Scheduling Problem.",
            "Fast Learning of k-Term DNF Formulas with Queries.",
            "Planar Separators and Parallel Polygon Triangulation.",
            "Entropy and Sorting.",
            "On the All-Pairs-Shortest-Path Problem in Unweighted Undirected Graphs.",
            "Complexity Tailored Design: A New Design Methodology for Databases With Incomplete Information.",
            "Method Schemas.",
            "On Comparison and Analysis of Algorithms for Multiplication in GF(2^m).",
            "Continuous Algebras Revisited.",
            "Emptiness Problems of eNCE Graph Languages.",
            "The Best Nondeterministic Representations of Finite Orderings.",
            "Decision Trees with Boolean Threshold Queries.",
            "An O(n log log n) Time Algorithm for Constructing a Graph of Maximum Connectivity with Prescribed Degrees.",
            "A Dichotomy Theorem for Maximum Generalized Satisfiability Problems.",
            "On the Feasibility of Checking Temporal Integrity Constraints."
        ]
    },
    {
        "name": "JCSS",
        "year": "1994",
        "info": "1994: Volumes 48, 49",
        "count": 60,
        "papers": [
            "Three One-Way Heads Cannot Do String Matching.",
            "Unique Complements and Decomposition of Database Schemata.",
            "Hypergraph Languages of Bounded Degree.",
            "Parallel Solutions to Geometric Problems in the Scan Model of Computation.",
            "Gap-Definable Counting Classes.",
            "Reversibility and Surjectivity Problems of Cellular Automata.",
            "PSPACE Is Provable by Two Provers in One Round.",
            "Superconcentrators of Depths 2 and 3; Odd Levels Help (Rarely).",
            "Learning Fixed Point Patterns by Recurrent Networks.",
            "Finding Level-Ancestors in Trees.",
            "Exact Lower Time Bounds for Computing Boolean Functions on CREW PRAMs.",
            "The Complexity of Propositional Closed World Reasoning and Circumscription.",
            "Nonuniform Learnability.",
            "On Reductions of NP Sets to Sparse Sets.",
            "Combinatorial Techniques for Universal Hashing.",
            "On the Perceptron Learning Algorithm on Data with High Precision.",
            "A Taxonomy of Complexity Classes of Functions.",
            "Provably Good Mesh Generation.",
            "Competitive k-Server Algorithms.",
            "Specified Precision Polynomial Root Isolation Is in NC.",
            "Efficient Distribution-Free Learning of Probabilistic Concepts.",
            "On the Complexity of the Parity Argument and Other Inefficient Proofs of Existence.",
            "Trans-Dichotomous Algorithms for Minimum Spanning Trees and Shortest Paths.",
            "Simple Characterizations of P(#P) and Complete Problems.",
            "Group Structured Linear Cellular Automata over Zm.",
            "The Random Oracle Hypothesis Is False.",
            "Time-Extraction for Temporal Logic-Logic Programming and Local Process Time.",
            "The Complexity of Connectivity Problems on Context-Free Graph Languages.",
            "Symmetry in Self-Correcting Cellular Automata.",
            "Characterizing Language Identification by Standardizing Operations.",
            "Bounded Degree Graph Inference from Walks.",
            "A Kleene-like Characterization of Languages Accepted by Systolic Tree Automata.",
            "Hardness vs Randomness.",
            "Invariant Sets for Substitution.",
            "On Computing Serial Dependency Relations.",
            "Vacillatory Learning of Nearly Minimal Size Grammars.",
            "Dynamic Dictionary Matching.",
            "A Branching Time Logic with Past Operators.",
            "Non-Deterministic Communication Complexity with Few Witnesses.",
            "The Translation Power of Top-Down Tree-to-Graph Transducers.",
            "Efficient Inference of Partial Types.",
            "A Linear-Time Near-Optimum-Length Triangulation Algorithm for Convex Polygons.",
            "A Three-Valued Semantics for Deductive Databases and Logic Programs.",
            "Measures of Nondeterminism for Pushdown Automata.",
            "Learning with Discrete Multi-valued Neurons.",
            "Robust Gift Wrapping for the Three-Dimensional Convex Hull.",
            "Listing Graphs That Satisfy First-Order Sentences.",
            "An Efficient Algorithm for Hidden Surface Removal, II.",
            "Efficient NC Algorithms for Set Cover with Applications to Learning and Geometry.",
            "The Probabilistic Method Yields Deterministic Parallel Algorithms.",
            "Planarity Testing in Parallel.",
            "Datalog vs First-Order Logic.",
            "Open Problems in \"Systems That Learn\".",
            "On Hausdorff and Topological Dimensions of the Kolmogorov Complexity of the Real Line.",
            "Another Look at Parameterization for Order-Sorted Algebraic Specifications.",
            "Efficient Rebalancing of Chromatic Search Trees.",
            "The Nested Universal Relation Data Model.",
            "The Surjectivity Problem for 2D Cellular Automata.",
            "Implication Problems for Functional Constraints on Databases Supporting Complex Objects.",
            "On Search, Decision, and the Efficiency of Polynomial-Time Algorithms."
        ]
    },
    {
        "name": "JCSS",
        "year": "1993",
        "info": "1993: Volumes 46, 47",
        "count": 35,
        "papers": [
            "Normal and Sinkless Petri Nets.",
            "The Interconnection Problem.",
            "Variable Precision Rough Set Model.",
            "Computation Graphs for Actor Grammars.",
            "A Minimum 3-Connectivity Augmentation of a Graph.",
            "Threshold Circuits of Bounded Depth.",
            "Deterministic Soliton Automata with at Most One Cycle.",
            "Directed Drift: A New Linear Threshold Algorithm for Learning Binary Weights On-Line.",
            "Handle-Rewriting Hypergraph Grammars.",
            "On the Expressive Power of Temporal Logic.",
            "A Complexity Theory for Feasible Closure Properties.",
            "Graph Theoretic Analysis of PLA Folding Heuristics.",
            "A Note on Bi-immunity and p-Closeness of p-Cheatable Sets in P/Poy.",
            "Collapsing Degrees via Strong Computation.",
            "Matrix and Matricial Iteration Theories, Part I.",
            "Matrix and Matricial Iteration Theories, Part II.",
            "Editor's Foreword: Selected Papers of PODS 1989.",
            "Why a Single Parallelization Strategy Is Not Enough in Knowledge Bases.",
            "B-Trees with Inserts and Deletes: Why Free-at-Empty Is Better Than Merge-at-Half.",
            "A Logic Programming with Complex Objects.",
            "Algebraic and Calculus Query Languages for Recursively Typed Complex Objects.",
            "The Impact of Recovery on Concurrency Control.",
            "The Alternating Fixpoint of Logic Programs with Negation.",
            "Logical Query Optimization by Proff-Tree Transformation.",
            "Removing Randomness in Parallel Computation without a Processor Penalty.",
            "Nonexpressibility of Fairness and Signaling.",
            "Communication Complexity and Combinatorial Lattice Theory.",
            "Effect of Connectivity in an Associative Memory Model.",
            "The Discrete Logarithm Modulo a Composite Hides O(n) Bits.",
            "Functions with Bounded Symmetric Communication Complexity, Programs over Commutative Monoids, and ACC.",
            "Surpassing the Information Theoretic Bound with Fusion Trees.",
            "Output Sensitive and Dynamic Constructions of Higher Order Voronoi Diagrams and Levels in Arrangements.",
            "Towards Overcoming the Transitive-Closure Bottleneck: Efficient Parallel Algorithms for Planar Digraphs.",
            "Deterministic Sorting in Nearly Logarithmic Time on the Hypercube and Related Computers.",
            "Self-Testing/Correcting with Applications to Numerical Problems."
        ]
    },
    {
        "name": "JCSS",
        "year": "1992",
        "info": "1992: Volumes 44, 45",
        "count": 44,
        "papers": [
            "Connection-Trap-Free Database Schemes.",
            "Contraction Algebras and Unification of (Infinite) Terms.",
            "Parallel Restructuring and Evaluation of Expressions.",
            "The Correlation between the Complexities of the Nonhierarchical and Hierarchical Versions of Graph Problems.",
            "Perfect Matching for Regular Graphs is AC°-Hard for the General Matching Problem.",
            "Processor-Time Tradeoffs in PRAM Simulations.",
            "Self-Similarity of Linear Cellular Automata.",
            "Undecidability of Safety for the Schematic Protection Model with Cyclic Creates.",
            "Some Remarks on a Theorem of Sakarovitch.",
            "The Complexity Types of Computable Sets.",
            "On the Theory of Average Case Complexity.",
            "Almost Everywhere High Nonuniform Complexity.",
            "Multi-Oracle Interactive Protocols with Constant Space Verifiers.",
            "Turing Machines with Few Accepting Computations and Low Sets for PP.",
            "Oracles for Structural Properties: The Isomorphism Problem and Public-Key Cryptography.",
            "The Complexity of Circuit Value and Network Stability.",
            "Results on Communication Complexity Classes.",
            "Inductive Reasoning and Kolmogorov Complexity.",
            "The Invariant Problem for Binary String Structures and the Parallel Complexity Theory of Queries.",
            "Distributed Event Algebras.",
            "Finite Automata on Directed Graphs.",
            "B-Fairness and Structural B-Fairness in Petri Net Models of Concurrent Systems.",
            "Regular Languages in NC¹.",
            "On Polynomial Time One-Truth-Table Reducibility to a Sparse Set.",
            "Discrete-Time versus Continuous-Time Models of Neural Networks.",
            "Feedforward Nets for Interpolation and Classification.",
            "An Approximation Theorem for Topological Lambda Models and the Topological Incompleteness of Lambda Calculus.",
            "The Powerset Algebra as a Natural Tool to Handle Nested Database Relations.",
            "On the Time-Complexity of Broadcast in Multi-hop Radio Networks: An Exponential Gap Between Determinism and Randomization.",
            "Using the Hamiltonian Path Operator to Capture NP.",
            "Positional Simulation of Two-Way Automata: Proof of a Conjecture of R. Kannan and Generalizations.",
            "Lower Bounds on the Length of Universal Traversal Sequences.",
            "Multiparty Protocols, Pseudorandom Generators for Logspace, and Time-Space Trade-Offs.",
            "A New Fixed Point Approach for Stable Networks and Stable Marriages.",
            "Minimum-Complexity Pairing Functions.",
            "Trade-Offs between Communication and Space.",
            "Closure of Varieties of Languages under Products with Counter.",
            "Embedding Grids into Hypercubes.",
            "Foreground Automata.",
            "Nondiamond Theorems for Polynomial Time Reducibility.",
            "Models of a K-Rational Identity System.",
            "Design of Desirable Relational Database Schemes.",
            "Computing with Discrete Multi-Valued Neurons.",
            "Some Investigations on FCFS Scheduling in Hard Real Time Applications."
        ]
    },
    {
        "name": "JCSS",
        "year": "1991",
        "info": "1991: Volumes 42, 43",
        "count": 37,
        "papers": [
            "On Denotational versus Predicative Semantics.",
            "Realistic Analysis of Some Randomized Algorithms.",
            "Unification Modulo an Equality Theory for Equational Logic Programming.",
            "Relativized Counting Classes: Relations among Thresholds, Parity, and Mods.",
            "Some Lower Bound Results for Decentralized Extrema-Finding in Rings of Processors.",
            "Resource Bounds for Parallel Computation of Threshold and Symmetric Functions.",
            "Kernel-LEAF: A Logic plus Functional Language.",
            "Overlaps in Free Partially Commutative Monoids.",
            "One-Sided Recursions.",
            "On Isomorphism Testing of a Class of 2-Nilpotent Groups.",
            "Corrigendum: Topologically Sweeping an Arrangement.",
            "Two Lower Bounds in Asynchronous Distributed Computation.",
            "Lower Bounds to Randomized Algorithms for Graph Properties.",
            "Improved Algorithms for Graph Four-Connectivity.",
            "How to Emulate Shared Memory.",
            "Statistical Zero-Knowledge Languages can be Recognized in Two Rounds.",
            "Average Case Completeness.",
            "Transaction Synchronisation in Object Bases.",
            "Hybrid Concurrency Control for Abstract Data Types.",
            "Datalog Extensions for Database Queries and Updates.",
            "Why not Negation by Fixpoint?",
            "A Counting Algorithm for a Cyclic Binary Query.",
            "A Semantics for Complex Objects and Approximate Answers.",
            "On the Expressive Power of Database Queries with Intermediate Types.",
            "Time-Space Tradeoffs for Algebraic Problems on General Sequential Machines.",
            "A Lower Bound for Radio Broadcast.",
            "Learning Regular Languages from Counterexamples.",
            "Oblivious Routing with Limited Buffer Capacity.",
            "The String Generating Power of Context-Free Hypergraph Grammars.",
            "An Axiomatic Approach to Voronoi-Diagrams in 3D.",
            "Properties that Characterize LOGCFL.",
            "An Implicit Data Structure for Searching a Multikey Table in Logarithmic Time.",
            "Optimization, Approximation, and Complexity Classes.",
            "Expressing Combinatorial Optimization Problems by Linear Programs.",
            "Program Structures: Some New Characterisations.",
            "Outfix and Infix Codes and Related Classes of Languages.",
            "On Computing Decision Regions with Neural Nets."
        ]
    },
    {
        "name": "JCSS",
        "year": "1990",
        "info": "1990: Volumes 40, 41",
        "count": 33,
        "papers": [
            "Geometric Consistency Theorem for a Symbolic Perturbation Scheme.",
            "Covering Orthogonal Polygons with Star Polygons: The Perfect Graph Approach.",
            "Hidden Surface Removal for Rectangles.",
            "Applied Computational Geometry: Towards Robust Solutions of Basic Problems.",
            "On Maximum Flows in Polyhedral Domains.",
            "The Hoare and Smith Power Domain Constructors Commute under Composition.",
            "First-Order Spectra with One Variable.",
            "Soliton Automata.",
            "Genomorphisms of Semi-Modular Lattices.",
            "Edge-Label Controlled Graph Grammars.",
            "Parametrization for Order-Sorted Algebraic Specification.",
            "On the Power of Safe Locking.",
            "Picture Iteration and Picture Ambiguity.",
            "Boundary Graph Grammars with Dynamic Edge Relabeling.",
            "Input-Dependent-Only Object Histories.",
            "The Complexity of Regular DNLC Graph Languages.",
            "On Inference Control in Semantic Data Models for Statistical Databases.",
            "A Note on A.E. h-Complex Functions.",
            "Decomposing a Relation into a Tree of Binary Relations.",
            "A New Interpretation for Null Values in the Weak Instance Model.",
            "Logic Programming with Sets.",
            "Commutativity-Based Locking for Nested Transactions.",
            "Bounds on the Propagation of Selection into Logic Programs.",
            "Procedural Languages for Database Queries and Updates.",
            "Practical Arbitrary Lookahead LR Parsing.",
            "On the Complexity of Ranking.",
            "On Uniformity within NC¹.",
            "Pseudorandom Sources for BPP.",
            "On the Theory of the PTIME Degrees of the Recursive Sets.",
            "Self-Reducibility.",
            "Cook Reducibility is Faster than Karp Reduciblity in NP.",
            "Relations between Communication Complexity Classes.",
            "Prediction-Preserving Reducibility."
        ]
    },
    {
        "name": "JCSS",
        "year": "1989",
        "info": "1989: Volumes 38, 39",
        "count": 39,
        "papers": [
            "A Provably Efficient Algorithm for Dynamic Storage Allocation.",
            "Embedding Planar Graphs in Four Pages.",
            "With Probability One, a Random Oracle Separates PSPACE from the Polynomial-Time Hierarchy.",
            "Making Data Structures Persistent.",
            "Optimal Parallel Selection has Complexity O(Log Log n).",
            "On Nontrivial Separators for k-Page Graphs and Simulations by Nondeterministic One-Tape Turing Machines.",
            "Bounded-Width Polynomial-Size Branching Programs Recognize Exactly Those Languages in NC¹.",
            "Topologically Sweeping an Arrangement.",
            "The Complexity of Reasoning about Knowledge and Time. I. Lower Bounds.",
            "Automatic Generation of Test Data for Relational Queries.",
            "Data Independent Recursion in Deductive Databases.",
            "Minimalism, Justification and Non-Monotonicity in Deductive Databases.",
            "A Calculus for Complex Objects.",
            "On the Convergence of Query Evaluation.",
            "Deleting Completed Transactions.",
            "A Characterization of Finite fd-Acyclicity.",
            "Rearranging Data to Maximize the Efficiency of Compression.",
            "Lower Bounds for Language Recognition on Two-Dimensional Alternating Multihead Machines.",
            "On Iterative and Cellular Tree Arrays.",
            "Serialization of Concurrent Programs.",
            "Fast and Efficient Solution of Path Algebra Problems.",
            "Positive Relativizations of the P = ? NP Problem.",
            "Strong Nondeterministic Turing Reduction - A Technique for Proving Intractability.",
            "On Hiding Information from an Oracle.",
            "Descriptive Characterizations of Computational Complexity.",
            "Probabilistic Complexity Classes and Lowness.",
            "Some Consequences of the Existence of Pseudorandom Generators.",
            "Optimal Shortest Path Queries in a Simple Polygon.",
            "Parallel Construction of Subdivision Hierarchies.",
            "Orthogonally Convex Coverings of Orthogonal Polygons without Holes.",
            "There are Planar Graphs Almost as Good as the Complete Graph.",
            "Computing Geodesic Furthest Neighbors in Simple Polygons.",
            "On Finite-Precision Representations of Geometric Objects.",
            "Honest Polynomial Time Reducibilities and the P = ? NP Problem.",
            "P^(NP[O(log n)]) and Sparse Turing-Complete Sets for NP.",
            "The Strong Exponential Hierarchy Collapses.",
            "Ordered Vertex Removal and Subgraph Problems.",
            "Solving Reflexive Domain Equations in a Category of Complete Metric Spaces.",
            "The Set Coincidence Game: Complexity, Attainability, and Symmetric Strategies."
        ]
    },
    {
        "name": "JCSS",
        "year": "1988",
        "info": "1988: Volumes 36, 37",
        "count": 41,
        "papers": [
            "Group Actions and Learning for a Family of Automata.",
            "On Alternating omega-Automata.",
            "Automorphism Groups and Factor Automata of Strongly Connected Automata.",
            "Independence of the Equational Axioms for Iteration Theories.",
            "Multilevel Nested Relational Structures.",
            "White Pebbles Help.",
            "A Simple Three-Dimensional Real-Time Reliable Cellular Array.",
            "Self-organizing Sequential Search and Hilbert's Inequalities.",
            "Transition Systems, Metric Spaces and Ready Sets in the Semantics of Uniform Concurrency.",
            "The Complexity of Parallel Search.",
            "Arthur-Merlin Games: A Randomized Proof System, and a Hierarchy of Complexity Classes.",
            "Parallel Computation with Threshold Functions.",
            "A Measure of Relativized Space Which Is Faithful With Respect to Depth.",
            "Lower Bound Arguments with \"Inaccessible\" Numbers.",
            "Isomorphisms and 1-L Reductions.",
            "Relativized Alternation and Space-Bounded Computation.",
            "Expanders, Randomness, or Time versus Space.",
            "The Topology of Provability in Complexity Theory.",
            "Probabilistic Quantifiers and Games.",
            "Probabilistic Game Automata.",
            "The Complexity of Optimization Problems.",
            "The Complexity of Facets Resolved.",
            "The Complexity of Recognizing Polyhedral Scenes.",
            "Parallel Algorithms for Solvable Permutation Groups.",
            "Fast String Matching with k Differences.",
            "How Easy is Local Search?",
            "Simulating Two Pushdown Stores by One Tape in O(n^1.5 sqrt(log n)) Time.",
            "Meanders and Their Applications in Lower Bounds Arguments.",
            "Probabilistic Construction of Deterministic Algorithms: Approximating Packing Integer Programs.",
            "k+1 Heads Are Better than k for PDAs.",
            "Minimum Disclosure Proofs of Knowledge.",
            "An Efficient Parallel Algorithm for Planarity.",
            "Collapsing Degrees.",
            "Pushdown Automata with Reversal-Bounded Counters.",
            "On Locating Minimum Feedback Vertex Sets.",
            "Graph Isomorphism is in the Low Hierarchy.",
            "An Unpredictability Approach to Finite-State Randomness.",
            "Distributed Algorithms for Selection in Sets.",
            "Completeness Results for Conflict-Free Vector Replacement Systems.",
            "Deterministic Tree Pushdown Automata and Monadic Tree Rewriting Systems.",
            "Correction to \"Computational Complexity of Algebraic Functions\"."
        ]
    },
    {
        "name": "JCSS",
        "year": "1987",
        "info": "1987: Volumes 34, 35",
        "count": 35,
        "papers": [
            "Decision Procedures for Elementary Sublanguages of Set Theory. V. Multilevel Syllogistic Extended by the General Union Operator.",
            "Upper Bounds for Time-Space Trade-Offs in Sorting and Selection.",
            "Expressive Completeness Failure in Branching Time Structures.",
            "River Routing in VLSI.",
            "An Analysis of the Nonemptiness Problem for Classes of Reversal-Bounded Multicounter Machines.",
            "A Note on the Two-Variable Pattern-Finding Problem.",
            "Basic Tree Transducers.",
            "Succinct Representation of Regular Sets Using Gotos and Boolean Variables.",
            "On Observational Equivalence and Algebraic Specification.",
            "Parameter-Preserving Data Type Specifications.",
            "Bisimulations and Abstraction Homomorphisms.",
            "Specification and Top-Down Design of Distributed Systems.",
            "Why Horn Formulas Matter in Computer Science: Initial Structures and Generic Examples.",
            "Algebraic Specification of Modules and Their Basic Interconnections.",
            "On the Implementation of Abstract Data Types by Programming Language Constructs.",
            "Amalgamation of Graph Transformations: A Synchronization Mechanism.",
            "Inductively Defined Functions in Functional Programming Languages.",
            "Concurrent Histories: A Basis for Observing Distributed Systems.",
            "Design of Relational Database Schemes by Deleting Attributes in the Canonical Decomposition.",
            "Communication in Concurrent Dynamic Logic.",
            "Complementing Deterministic Büchi Automata in Polynomial Time.",
            "Union and Actualization of Module Specifications: Some Compatibility Results.",
            "Edge-Connectivity Augmentation Problems.",
            "Sigma_2 SPACE(n) is Closed under Complement.",
            "A Lower Bound for Read-Once-Only Branching Programs.",
            "On Flowchart Theories. I. The Deterministic Case.",
            "Handle NLC Grammars and R.E. Languages.",
            "An Algebra of Processes.",
            "Dynamic Algebras with Test.",
            "Groups and NTS Languages.",
            "Refined Complexity Analysis for Heap Operations.",
            "On Deciding the Confluence of a Finite String-Rewriting System on a Given Congruence Class.",
            "On Commutative Context-Free Languages.",
            "The Verso Algebra or How to Answer Queries with Fewer Joins.",
            "Algebraic Solutions to Recursion Schemes."
        ]
    },
    {
        "name": "JCSS",
        "year": "1986",
        "info": "1986: Volumes 32, 33",
        "count": 43,
        "papers": [
            "Binary Trees and Uniform Distribution of Traffic Cutback.",
            "Reliable Computation with Cellular Automata.",
            "About the Paterson-Wegman Linear Unification Algorithm.",
            "Time-Space Trade-offs for Branching Programs.",
            "\"During\" Cannot be Expressed by \"After\".",
            "A Multiparameter Analysis of the Boundedness Problem for Vector Addition Systems.",
            "New Algorithms for Multilink Robot Arms.",
            "Reporting and Counting Segment Intersections.",
            "Automata-Theoretic Techniques for Modal Logics of Programs.",
            "Threshold Functions and Bounded Depth Monotone Circuits.",
            "On the Possibility and Impossibility of Achieving Clock Synchronization.",
            "The Complexity of Elementary Algebra and Geometry.",
            "Finding Small Simple Cycle Separators for 2-Connected Planar Graphs.",
            "Efficient Symbolic Analysis of Programs.",
            "A Simple Undecidable Problem: Existential Agreement of Inverses of Two Morphisms on a Regular Language.",
            "Conditional Rewrite Rules: Confluence and Termination.",
            "Uniform Normal Form for General Time-Bounded Complexity Classes.",
            "Effective Choice Functions and Index Sets.",
            "Domino-Tiling Games.",
            "First-Order Logic and Star-Free Sets.",
            "\"Global\" Graph Problems Tend to Be Intractable.",
            "Fully Abstract Submodels of Typed Lambda Calculi.",
            "Polymorphic Arrays: A Novel VLSI Layout for Systolic Computers.",
            "An Implicit Data Structure Supporting Insertion, Deletion, and Search in O(log² n) Time.",
            "Generating Quasi-random Sequences from Semi-random Sources.",
            "A Lower Bound for Probabilistic Algorithms for Finite State Machines.",
            "Probabilistic Communication Complexity.",
            "Design by Example: An Application of Armstrong Relations.",
            "Querying Logical Databases.",
            "Deadlock-Freedom (and Safety) of Transactions in a Distributed Database.",
            "Chordality Properties on Graphs and Minimal Conceptual Connections in Semantic Data Models.",
            "Partition Semantics for Relations.",
            "Equivalence of Views by Query Capacity.",
            "Concurrent Operations on B*-Trees with Overtaking.",
            "Algorithmic Aspects of Multiversion Concurrency Control.",
            "A Complete Rule for Equifair Termination.",
            "Quasi-varieties in Abstract Algebraic Institutions.",
            "Non First Normal Form Relations: An Algebra Allowing Data Restructuring.",
            "A Theory of Orbital Behavior in a Class of Nonlinear Systems: Chaos and a Signature-Based Approach.",
            "The Bounded Degree Problem for NLC Grammars is Decidable.",
            "A Representation Theorem of Infinite Dimensional Algebras and Applications to Language Theory.",
            "Membership for Growing Context-Sensitive Grammars is Polynomial.",
            "Analysis of Bounded Linear Cellular Automata Based on a Method of Image Charges."
        ]
    },
    {
        "name": "JCSS",
        "year": "1985",
        "info": "1985: Volumes 30, 31",
        "count": 40,
        "papers": [
            "Decision Procedures and Expressiveness in the Temporal Logic of Branching Time.",
            "Tree Pushdown Automata.",
            "A Multiprocess Network Logic with Temporal and Spatial Modalities.",
            "A Linear Algorithm for Embedding Planar Graphs Using PQ-Trees.",
            "Variations on the Technique of Duris and Galil.",
            "Hierarchies of Hyper-AFLs.",
            "Solitaire Automata.",
            "Routing, Merging, and Sorting on Parallel Models of Computation.",
            "Speedups of Deterministic Machines by Synchronous Parallel Machines.",
            "A Probabilistic PDL.",
            "Solvability by Radicals is in Polynomial Time.",
            "A Linear-Time Algorithm for a Special Case of Disjoint Set Union.",
            "Unbounded Fan-In Circuits and Associative Functions.",
            "Factoring Multivariate Polynomials over Finite Fields.",
            "Pattern Selector Grammars and Several Parsing Algorithms in the Context-Free Style.",
            "Cost Functors and Optimal Realization.",
            "Dynamical Characteristics of Linear Cellular Automata.",
            "Free Semiring-Representations and Nondeterminism.",
            "Area-Period Tradeoffs for Multiplication of Rectangular Matrices.",
            "Complexity of Certain Decision Problems about Congruential Languages.",
            "Sylow's Theorem in Polynomial Time.",
            "Qualitative Relativizations of Complexity Classes.",
            "Formal Analysis of a Systolic System for Finite Element Stiffness Matrices.",
            "On the Power of Alternation in Automata Theory.",
            "Behavior of a Class of Nonlinear Discrete-Time Systems.",
            "A Matching Problem in the Plane.",
            "Macro Tree Transducers.",
            "Scaling Algorithms for Network Problems.",
            "Relativized Circuit Complexity.",
            "Probabilistic Counting Algorithms for Data Base Applications.",
            "Improved Upper Bounds on Shellsort.",
            "Irreducibility of Multivariate Polynomials.",
            "Factoring Sparse Multivariate Polynomials.",
            "Games Against Nature.",
            "The Equivalence and Inclusion Problems for NTS Languages.",
            "NTS Languages Are Deterministic and Congruential.",
            "Interactions between Dependencies and Nested Relational Structures.",
            "Serializability Theory for Replicated Databases.",
            "Axiomatizing Schemes and Their Behaviors.",
            "Structural Properties of the String Statistics Problem."
        ]
    },
    {
        "name": "JCSS",
        "year": "1984",
        "info": "1984: Volumes 28, 29",
        "count": 47,
        "papers": [
            "The Implication and Finite Implication Problems for Typed Template Dependencies.",
            "Inclusion Dependencies and Their Interaction with Functional Dependencies.",
            "The Tree Projection Theorem and Relational Query Processing.",
            "The Relational Model of Data and Cylindric Algebras.",
            "Is Distributed Locking Harder?",
            "Independent Database Schemas.",
            "Database Relations with Null Values.",
            "Testing Containment of Conjunctive Queries under Functional and Inclusion Dependencies.",
            "A Probabilistic Dynamic Logic.",
            "Space-Bounded Hierarchies and Probabilistic Computations.",
            "Data Structures for Distributed Counting.",
            "The Complexity of Facets (and Some Facets of Complexity).",
            "Communication Complexity.",
            "Probabilistic Encryption.",
            "A Framework for Solving VLSI Graph Layout Problems.",
            "On the Complexity of Iterated Shuffle.",
            "Minimizing Access Pointers into Trees and Arrays.",
            "New Trie Data Structures Which Support Very Fast Search Operations.",
            "The Complexity of Monadic Recursion Schemes: Exponential Time Bounds.",
            "One-Layer Routing without Component Constraints.",
            "A Complete Inference System for a Class of Regular Behaviours.",
            "Exponential Bounds for the Running Time of a Selection Algorithm.",
            "Complete Problems in the First-Order Predicate Calculus.",
            "An n log n Algorithm for Determining the Congruity of Polyhedra.",
            "Finding Pseudoperipheral Nodes in Graphs.",
            "Commutative One-Counter Languages are Regular.",
            "On the Fixpoints of Nondeterministic Recursive Definitions.",
            "A Generalized Nexttime Operator in Temporal Logic.",
            "Weak Equivalence in a Class of Structured Program Schemes.",
            "Consistency in Nondeterministic Storage.",
            "New Algorithms for the LCS Problem.",
            "On Cancellation Properties of Languages which are Supports of Ration Power Series.",
            "Equivalences among Logics of Programs.",
            "Indecomposable Maps in Tessellation Structures of Arbitrary Dimension.",
            "Time-Space Tradeoffs for Matrix Multiplication and the Discrete Fourier Transform on any General Sequential Random-Access Computer.",
            "Towards a Hierarchy of Nets.",
            "Multi-version Concurrency Control Scheme for a Database System.",
            "On the Computational Complexity of Path Cover Problems.",
            "The Performance of Multilective VLSI Algorithms.",
            "The Complexity of Two-Player Games of Incomplete Information.",
            "On Two-Tape Real-Time Computation and Queues.",
            "An Application of Cohen's Result on Star Height to the Theory of Control Structures.",
            "Finding Euler Tours in Parallel.",
            "GYO Reductions, Canonical Connections, Tree and Cyclic Schemas, and Tree Projections.",
            "Undecidability of PDL with L={a^(2i)|i>=0}.",
            "Extended Macro Grammars and Stack Controlled Machines.",
            "Optimization of Distributed Tree Queries."
        ]
    },
    {
        "name": "JCSS",
        "year": "1983",
        "info": "1983: Volumes 26, 27",
        "count": 46,
        "papers": [
            "Effects of Updates on Optimality in Tries.",
            "Langages à un Compteur.",
            "Context Free Normal Systems and ETOL Systems.",
            "On the Zero-Inequivalence Problem for Loop Programs.",
            "Size-Space Tradeoffs for Oblivious Computations.",
            "Checking Sets, Test Sets, Rich Languages and Commutatively Closed Languages.",
            "Multiplicative Complexity and Algebraic Structure.",
            "On the Transformation Semigroups of Finite Automata.",
            "Network Structure and the Firing Squad Synchronization Problem.",
            "Lower Bounds on the Size of Deterministic Parsers.",
            "On the Equality of Grammatical Families.",
            "Edge-Contraction Problems.",
            "On Self-Reducibility and Weak P-Selectivity.",
            "Propositional Dynamic Logic of Nonregular Programs.",
            "On the Complexity of LL(k) Testing.",
            "Computation of Boolean Functions on Networks of Binary Automata.",
            "Time-Space-Optimal String Matching.",
            "Groups, the Theory of Ends, and Context-Free Languages.",
            "Polynomial Time Computations in Models of ET.",
            "An Asymptotically Optimal Layout for the Shuffle-Exchange Graph.",
            "A Data Structure for Dynamic Trees.",
            "Lower Bounds for the Cycle Detection Problem.",
            "A View of Computability on Term Algebras.",
            "Tests for the LR-, LL-, and LC-Regular Conditions.",
            "A Low and a High Hierarchy within NP.",
            "Port Automata and the Algebra of Concurrent Processes.",
            "A Method for Stepwise Refinement and Abstraction of Petri Nets.",
            "On the Complexity of Chess.",
            "Representation Theorems on Regular Languages.",
            "Remarks on Multihead Pushdown Automata and Multihead Stack Automata.",
            "Linear Cellular Automata over Z_m.",
            "Recursion and Iteration in Continuous Theories: The \"M-Construction\".",
            "Algebraic Characterization of Reducible Flowcharts.",
            "Extensions of Iterative Congruences on Free Iterative Algebras.",
            "An Axiomatization of D-scheme Strong Equivalence.",
            "All Solutions of a System of Recursion Equations in Infinite Trees and Other Contraction Theories.",
            "Transaction Protection by Beacons.",
            "Correctness of Recursive Parallel Nondeterministic Flow Programs.",
            "Algebras of Iteration Theories.",
            "Implementation of Data Types by Algebraic Methods.",
            "Acyclic Join Dependency and Data Base Projections.",
            "A Technique for Decomposing Algorithms Which Use a Single Shared Variable.",
            "A Normal Form for Arithmetical Representation of NP-Sets.",
            "The Insensitivity Theorem for Nonreducing Reflexive Types.",
            "Deterministic and Nondeterministic Flowchart Interpretations.",
            "Finite-State omega-Languages."
        ]
    },
    {
        "name": "JCSS",
        "year": "1982",
        "info": "1982: Volumes 24, 25",
        "count": 39,
        "papers": [
            "Computing Lower Bounds on Tensor Rank over Finite Fields.",
            "The Maximum Value Problem and NP Real Numbers.",
            "On LLP(k) Parsers.",
            "On Some Decision Problems for RAM Programs.",
            "Superconcentrators of Depth 2.",
            "A Hierarchy of Real-Time Deterministic Languages and Their Equivalence.",
            "Accessibility of Values as a Determinant of Relative Complexity in Algebras.",
            "Tree Constructions of Free Continuous Algebras.",
            "The Equivalence Problem for LL- and LR-Regular Grammars.",
            "Finding the Median Distributively.",
            "Tree Correspondence Problems.",
            "Quadratic Automata.",
            "The Complexity of Selection and Ranking in X+Y and Matrices with Sorted Columns.",
            "The Computational Complexity of a Set of Quadratic Functions.",
            "A Note on Sparse Oracles for NP.",
            "Limitedness Theorem on Finite Automata with Distance Functions.",
            "Processes of Transforming Structures.",
            "Simple Multi-Visit Attribute Grammars.",
            "A Prime Decomposition Theorem for Grammatical Families.",
            "Space Complexity in On-Line Computation.",
            "Representation of One-One Degrees by Decision Problems for System Functions.",
            "Corrigendum: Independence Results in Computer Science?",
            "Algebraic Dependencies.",
            "Isomorphism of Graphs of Bounded Valence can be Tested in Polynomial Time.",
            "N-Process Mutual Exclusion with Bounded Waiting by 4 Log_2 N-Valued Shared Variable.",
            "Upper and Lower Bounds for First Order Expressibility.",
            "Structure and Complexity of Relational Queries.",
            "Sparse Complete Sets of NP: Solution of a Conjecture of Berman and Hartmanis.",
            "Process Logic: Expressiveness, Decidability, Completeness.",
            "The Average Height of Binary Trees and Other Simple Trees.",
            "A General Class of Resource Tradeoffs.",
            "Proofs by Induction in Equational Theories with Constructors.",
            "Expressiveness and the Completeness of Hoare's Logic.",
            "Homomorphisms between Models of Parallel Computation.",
            "Subcomplete Generalizations of Graph Isomorphism.",
            "Classifying Regular Events in Symbolic Logic.",
            "An Algebraic Characterization of Some Principal Regulated Rational Cones.",
            "Deterministic Propositional Dynamic Logic: Finite Models, Complexity, and Completeness.",
            "The Copying Power of One-State Tree Transducers."
        ]
    },
    {
        "name": "JCSS",
        "year": "1981",
        "info": "1981: Volumes 22, 23",
        "count": 47,
        "papers": [
            "Some Results on Relativized Deterministic and Nondeterministic Time Hierarchies.",
            "Regularity and Firing Sequences of Computation Graphs.",
            "Growth Patterns of Ordered Cellular Automata.",
            "The Decidability of the D0L-DT0L Equivalence Problem.",
            "A Note on Structure and Looking Back Applied to the Complexity of Computable Functions.",
            "On Minimal Augmentation of a Graph to Obtain an Interval Graph.",
            "An Improved Simulation Result for Ink-Bounded Turing Machines.",
            "The Independence of Control Structures in Abstract Programming Systems.",
            "Decision Problems for Node Label Controlled Graph Grammars.",
            "SR(s, k) Parsers: A Class of Shift-Reduce Bounded-Context Parsers.",
            "Interdependent Translation Schemes.",
            "The Complexity of Decision Problems for Finite-Turn Multicounter Machines.",
            "Area-Time Tradeoffs for Matrix Multiplication and Related Problems in VLSI Models.",
            "Extending Lookahead for LR Parsers.",
            "New Hash Functions and Their Use in Authentication and Set Equality.",
            "A Time-Luck Tradeoff in Relativized Cryptography.",
            "On Time versus Space II. (Turing Machines).",
            "Semantics of Probabilistic Programs.",
            "A Time-Space Tradeoff for Sorting on Non-Oblivious Machines.",
            "On Uniform Circuit Complexity.",
            "Number of Quantifiers is Better Than Number of Tape Cells.",
            "Explicit Constructions of Linear-Sized Superconcentrators.",
            "Division in Idealized Unit Cost RAMS.",
            "Remarks on Recursion versus Diagonalization and Exponentially Difficult Problems.",
            "Computational Complexity of Algebraic Functions.",
            "Completeness of Context-Free Grammar Forms.",
            "A Complete Proof of Correctness of the Knuth-Bendix Completion Algorithm.",
            "Synchronous to Asynchronous Transformation of Polyautomata.",
            "On Maximal Order for Local and Global Numerical Problems.",
            "On Correct Refinement of Programs.",
            "Recursion-Closed Algebraic Theories.",
            "Corrigendum: Time-Space Tradeoffs for Computing Functions, Using Connectivity Properties of Their Circuits.",
            "An Information-Theoretic Approach to Time Bounds for On-Line Computation.",
            "An Optimal Solution to a Wire-Routing Problem.",
            "Pebbling with an Auxiliary Pushdown.",
            "Maintenance of Configurations in the Plane.",
            "Independence Results in Computer Science?",
            "Complexity of Algebraic Implementations for Abstract Data Types.",
            "Upper Bounds for Static Resource Allocation in a Distributed System.",
            "Definability in Dynamic Logic.",
            "Petri Nets and Regular Languages.",
            "Some Observations on NP, Real Numbers and P-Selective Sets.",
            "Theft and Conspiracy in the Take-Grant Protection Model.",
            "The Complexity of Restricted Regular Expressions and the Synthesis Problem for Finite Automata.",
            "Query Time Versus Redundancy Trade-Offs for Range Queries.",
            "The Equivalence Problem for Two DPDA's, One of Which is a Finite-Turn or One-Counter Machine.",
            "An Efficient Interpreter for the Lambda-Calculus."
        ]
    },
    {
        "name": "JCSS",
        "year": "1980",
        "info": "1980: Volumes 20, 21",
        "count": 42,
        "papers": [
            "A Characterization of Time Complexity by Simple Loop Programs.",
            "A Faster Algorithm Computing String Edit Distances.",
            "Languages of R-Trivial Monoids.",
            "On Finding Minimal Length Superstrings.",
            "One-Way Weak-Stack-Counter Automata.",
            "On the Complexity of Computing Bilinear Forms with {0, 1} Constants.",
            "A Proof System for the First-Order Relational Calculus.",
            "Recognition of Topological Equivalence of Patterns by Array Automata.",
            "Time-Space Tradeoffs for Computing Functions, Using Connectivity Properties of Their Circuits.",
            "The Subgraph Homeomorphism Problem.",
            "Tree Transducers, L Systems, and Two-Way Machines.",
            "On Formulating Simultaneity for Studying Parallelism and Synchronization.",
            "The Node-Deletion Problem for Hereditary Properties is NP-Complete.",
            "A Near-Optimal Method for Reasoning about Action.",
            "An Algorithm for Imbedding Cubic Graphs in the Torus.",
            "Vector Addition Systems and Regular Languages.",
            "Adherences of Languages.",
            "The Interaction of Integrity Constraints in an Information System.",
            "Foundations of System Theory: The Hankel Matrix.",
            "Test Sets and Checking Words for Homomorphism Equivalence.",
            "Coping with Errors in Binary Search Procedures.",
            "On the Algebra of Order.",
            "A Finite Step-Size Procedure for the F-W Method.",
            "On DIL Schemes Simulated by D0L Schemes.",
            "Finding Patterns Common to a Set of Strings.",
            "An Efficient PQ-Graph Algorithm for Solving the Graph-Realization Problem.",
            "A-Transducers and the Monotonicity of IL Schemes.",
            "The Equivalence of RE Program Schemes and Data Flow Schemes.",
            "Context-Free Grammar Forms with Strict Interpretations.",
            "Structure Preserving Reductions among Convex Optimization Problems.",
            "Computable Queries for Relational Data Bases.",
            "The Complexity of Problems in Systems of Communicating Sequential Processes.",
            "Lower Bounds on the Size of Sweeping Automata.",
            "An O(EVlog²V) Algorithm for the Maximal Flow Problem.",
            "Tree-Size Bounded Alternation.",
            "Implicit Data Structures for Fast Search and Update.",
            "Straight-Line Program Length as a Parameter for Complexity Analysis.",
            "A Duality Theory for Decomposable Systems in a Category.",
            "Multiple Equality Sets and Post Machines.",
            "Complexity Results for Classes of Quantificational Formulas.",
            "Open-Addressing Hashing with Unequal-Probability Keys.",
            "Adequacy of Decompositions of Relational Databases."
        ]
    },
    {
        "name": "JCSS",
        "year": "1979",
        "info": "1979: Volumes 18, 19",
        "count": 45,
        "papers": [
            "Decomposable Maps in General Tessellation Structures.",
            "Equivalence Problem of Non-Deterministic Finite Automata.",
            "Some Decision Problems Concerning Sequential Transducers and Checking Automata.",
            "Analysis of Petri Nets by Stepwise Refinements.",
            "Injectivity and Surjectivity of Parallel Maps for Cellular Automata.",
            "On the Existence of Minimal Realizations of Linear Dynamical Systems over Noetherian Integral Domains.",
            "Linear Algorithms on Recursive Representations of Trees.",
            "On the Complexity of Computations under Varying Sets of Primitives.",
            "Two Decidability Results for Deterministic Pushdown Automata.",
            "A Class of Algorithms which Require Nonlinear Time to Maintain Disjoint Sets.",
            "Graph Isomorphism, General Remarks.",
            "Universal Classes of Hash Functions.",
            "Fast Probabilistic Algorithms for Hamiltonian Circuits and Matchings.",
            "Propositional Dynamic Logic of Regular Programs.",
            "Optimal Order for Approximation of Derivatives.",
            "On LL-Regular Grammars.",
            "Regular Trees and the Free Iterative Theory.",
            "Undecidability of the First-Order Arithmetic A[P(x), 2x, x+1].",
            "Monadic Recursion Schemes: The Effect of Constants.",
            "On the Family of Finite Index Matrix Languages.",
            "Modifications of the Program Scheme Model.",
            "Complexity Classes of Provable Recursive Functions.",
            "Some Remarks on Multiple-Entry Finite Automata.",
            "Cônes rationnels commutatifs.",
            "Correctness Proofs of Syntax-Directed Processing Descriptions by Attributes.",
            "Automorphisms of Linear Automata.",
            "Final Algebra Semantics and Data Type Extensions.",
            "The Decidability of Equivalence for Deterministic Finite Transducers.",
            "Parameter Passing in Nondeterministic Recursive Programs.",
            "A Hierarchy of Deterministic Languages.",
            "Superdeterministic DPDAS: The Method for Accepting Does Affect Decision Problems.",
            "A Simulation Result for the Auxiliary Pushdown Automata.",
            "Computable Stack Functions for Semantics of Stack Programs.",
            "Simple Counter Machines and Number-Theoretic Problems.",
            "Least Fixed Point of a Functor.",
            "On Recursion in ET0L Systems.",
            "On Time Hierarchies.",
            "Codeterministic Lindenmayer Schemes and Systems.",
            "Group Character Tables in Discrete Transform Theory.",
            "Observations on the Complexity of Regular Expression Problems.",
            "On ET0L Systems with Rank.",
            "Reset Machines.",
            "Universal Realization.",
            "Semantics of Nondeterminism, Concurrency, and Communication.",
            "Sorting Using Networks of Deques."
        ]
    },
    {
        "name": "JCSS",
        "year": "1978",
        "info": "1978: Volumes 16, 17",
        "count": 49,
        "papers": [
            "\"Natural\" Properties of Flowchart Step-Counting Measures.",
            "Power Domains.",
            "The Dot-Depth Hierarchy of Star-Free Languages is Infinite.",
            "On Complements of Unary L Languages.",
            "IO and OI. II.",
            "Inference for Regular Bilanguages.",
            "Evaluation of Polynomials with Super-Preconditioning.",
            "Palindrome Recognition in Real Time by a Multitape Turing Machine.",
            "Linear Unification.",
            "NP-Complete Decision Problems for Binary Quadratics.",
            "On the Complexity of Some Two-Person Perfect-Information Games.",
            "The Analysis of Double Hashing.",
            "Omega-Computations on Deterministic Pushdown Machines.",
            "A Trivial Algorithm Whose Analysis Isn't.",
            "A 2^2^2^pn Upper Bound on the Complexity of Presburger Arithmetic.",
            "Algorithms for Updating Minimal Spanning Trees.",
            "ETOL Forms.",
            "On the Algebraic Atructure of Rooted Trees.",
            "Inductive Definability in Formal Language Theory.",
            "A Lower Bound of the ½n² on Linear Search Programs for the Knapsack Problem.",
            "On Polynomial Time Isomorphisms of Some New Complete Sets.",
            "On Inverse Deterministic Pushdown Transductions.",
            "A Note on Pattern Reproduction in Tessellation Structures.",
            "Nondeterminism and Boolean Operations in PDAs.",
            "Addressable Approximations to Nonaddressable Data Graphs.",
            "The Enforcement of Security Policies for Computation.",
            "On Splitting Recursive Sets.",
            "A Representation of Strongly Connected Automata and its Applications.",
            "Finite Automata, Definable Sets, and Regular Expressions over omega^n-Tapes.",
            "Endomorphisms of Linear Automata.",
            "The Circuit Depth of Symmetric Boolean Functions.",
            "Duality Theory for Discrete-Time Linear Systems.",
            "On Rearrangeable and Non-Blocking Switching Networks.",
            "On the Decidability of Homomorphism Equivalence for Languages.",
            "(A-)Synchronous (Non-)Deterministic Cell Spaces Simulating Each Other.",
            "Realization of Finite Automata with Linear Parts.",
            "A Note on 'Indecomposable Parallel Maps' by S. Amoroso, and I. J. Epstein.",
            "T^omega as a Universal Domain.",
            "A Note on Asynchronous Cellular Automata.",
            "The Complexity of Total Order Structures.",
            "Candidate Keys for Relations.",
            "Stack Languages and log n Space.",
            "The Firing Squad Synchronization Problem for a Class of Polyautomata Networks.",
            "Pumping Lemmas for Term Languages.",
            "On the Structure of Derivations in Deterministic ET0L Systems.",
            "A Theory of Type Polymorphism in Programming.",
            "A Definition of Measures over Language Space.",
            "On Some Classes of Interpretations.",
            "Closure Properties and Languages Defined by Bilinear Automata."
        ]
    },
    {
        "name": "JCSS",
        "year": "1977",
        "info": "1977: Volumes 14, 15",
        "count": 39,
        "papers": [
            "On the Equivalence of Mealy-Type and Moore-Type Automata and a Relation between Reducibility and Moore-Reducibility.",
            "On Topological Machines.",
            "Synchronization and Computing Capabilities of Linear Asynchronous Structures.",
            "Techniques for Separating Space Complexity Classes.",
            "Relating Refined Space Complexity Classes.",
            "Hypergrammars: An Extension of Macrogrammars.",
            "A Semigroup Characterization of a Linearly Realisable Automaton over GF(p).",
            "On Storing Concatenable Arrays.",
            "The Method of Closest Approach for Finding Nonisolated Zeros of Functions.",
            "Degree-Languages: A New Concept of Acceptance.",
            "Sparse Complex Polynomials and Polynomial Reducibility.",
            "Asymptotic Miss Ratios over Independent References.",
            "Scalar and Vector Iteration.",
            "Direct or Cascade Product of Pushdown Automata.",
            "Characteristic Parsing: A Framework for Producing Compact Deterministic Parsers, I.",
            "Characteristic Parsing: A Framework for Producing Compact Deterministic Parsers, II.",
            "Equivalence Problems for Deterministic Context-Free Languages and Monadic Recursion Schemes.",
            "Duality and the Regulator Problem for Linear Systems over Commutative Rings.",
            "Erratum: A Generalized Approach to Formal Languages.",
            "The Amalgamation of Automata.",
            "Relational Data Graphs and Some Properties of Them.",
            "Control Sets of Context-Free Grammar Forms.",
            "On the Covering of Parsable Grammars.",
            "C-Grammars and Tree-Codifications.",
            "Certain Relations between Properties of Maps of Tessellation Automata.",
            "Linear Realization of Finite Automata.",
            "Theory of omega-Languages. I. Characterizations of omega-Context-Free Languages.",
            "Theory of omega-Languages. II. A Study of Various Models of omega-Type Generation and Recognition.",
            "A Characterization of Weakest Preconditions.",
            "Computation and Construction Universality of Reversible Cellular Automata.",
            "Algebraic Properties of Derivation Words.",
            "Corrigendum: Space-Bounded Reducibility among Combinatorial Problems.",
            "Limiting Shapes for Configurations.",
            "The Structure of Context-Free Grammatical Families.",
            "Associative Retrieval Trie Hash-Coding.",
            "Finding the Depth of a Flow Graph.",
            "Single-Valued a-Transducers.",
            "IO and OI. I.",
            "Conditional Grammars."
        ]
    },
    {
        "name": "JCSS",
        "year": "1976",
        "info": "1976: Volumes 12, 13",
        "count": 48,
        "papers": [
            "Surjectivity of Nondeterministic Parallel Maps Induced by Nondeterministic Cellular Automata.",
            "Continuous Self-Reproduction.",
            "The Semigroup of an Algebra Automaton.",
            "Neighborhood Search Algorithms for Guaranteeing Optimal Traveling Salesman Tours Must Be Inefficient.",
            "A Completeness Property of One-Dimensional Tessellation Automata.",
            "Interactive Languages.",
            "The Derivation Language of a Phrase Structure Grammar.",
            "The Computational Complexity of Program Schemata.",
            "Sufficient Conditions for the Convergence of Monotonic Mathematical Programming Algorithms.",
            "On Computational Reducibility.",
            "Complexity Measures for Regular Expressions.",
            "Polynomial and Abstract Subrecursive Classes.",
            "Completeness Results for the Equivalence of Recursive Schemas.",
            "A Characterization of the Power of Vector Machines.",
            "On the Equivalence, Containment, and Covering Problems for the Regular and Context-Free Languages.",
            "Systematic Approach to Reduction and Minimization in Automata and System Theory.",
            "The Existence and Construction of Free Iterative Theories.",
            "On Batch Scheduling of Jobs with Stochastic Service Times and Cost Structures on a Single Server.",
            "Some Bounds on the Complexity of Predicate Recognition by Finite Automata.",
            "A Note on Multiple-Entry Finite Automata.",
            "Properties of Code Events and Homomorphisms over Regular Events.",
            "Nonexistence of Program Optimizers in Several Abstract Settings.",
            "Another Proof of the Theorem on Pattern Reproduction in Tessellation Structures.",
            "Bounded AFLs.",
            "Computation Sequence Sets.",
            "Storage Requirements for Deterministic Polynomial Time Recognizable Languages.",
            "A Result on the Equivalence Problem for Deterministic Pushdown Automata.",
            "On the Sequential Nature of Functions.",
            "A Nonlinear Lower Bound on Linear Search Tree Programs for Solving Knapsack Problems.",
            "A Characterization of Automata and a Direct Product Decomposition.",
            "Context-Free Grammars with Graph-Controlled Tables.",
            "Complexity-Class-Encoding Sets.",
            "The Halting Problem for Linear Turing Assemblers.",
            "Indecomposable Parallel Maps in Tessellation Structures.",
            "On the Structure of Abelian Automata.",
            "A Useful Device for Showing the Solvability of Some Decision Problems.",
            "Hazard Analysis of Asynchronous Circuits in Muller-Bartky's Sense.",
            "Automaton Introspection.",
            "Finding the Median.",
            "Varieties of Ordered Algebras.",
            "Some Convergence Results on the Method of Gradients for Ax = lambda Bx.",
            "Un Théorème de Duplication pour les Forêts Algébriques.",
            "Intercalation Lemmas for Tree Transducer Languages.",
            "Graph-Theoretic Properties in computational Complexity.",
            "Node Listings for Reducible Flow Graphs.",
            "Riemann's Hypothesis and Tests for Primality.",
            "Complexity Metatheorems for Context-Free Grammar Problems.",
            "Testing for the Consecutive Ones Property, Interval Graphs, and Graph Planarity Using PQ-Tree Algorithms."
        ]
    },
    {
        "name": "JCSS",
        "year": "1975",
        "info": "1975: Volumes 10, 11",
        "count": 45,
        "papers": [
            "Discrete-Time Machines in Closed Monoidal Categories. I.",
            "Effective Proper Procedures and Universal Classes of Program Schemata.",
            "On Tape-Bounded Complexity Classes and Multihead Finite Automata.",
            "Some Clarifications of the Concept of a Garden-of-Eden Configuration.",
            "Splitting a Context-Sensitive Set.",
            "Two-way A-Transducers and AFL.",
            "Proving Assertions about Parallel Programs.",
            "Tree Adjunct Grammars.",
            "Uniformly Erasable AFL.",
            "On the Density of Honest Subrecursive Classes.",
            "The Decidability of a Mapping Problem for Generalized Sequential Machines with Final States.",
            "Various Kinds of Automata with Weights.",
            "One Counter Languages and the IRS Condition.",
            "Reproduction in Tessellation Structures.",
            "On Causal omega^2-Systems.",
            "Natural State Transformations.",
            "General Context-Free Recognition in Less than Cubic Time.",
            "Two-Way Nested Stack Automata Are Equivalent to Two-Way Stack Automata.",
            "Deterministic One-Counter Automata.",
            "Some Independent Families of One-Letter Languages.",
            "Proving a Compiler Correct: A Simple Approach.",
            "NP-Complete Scheduling Problems.",
            "Abstract Families of Length-Preserving Processors.",
            "Proving Containment of Bounded AFL.",
            "Hierarchies of Turing Machines with Restricted Tape Alphabet Size.",
            "Space-Bounded Reducibility among Combinatorial Problems.",
            "Context-Free Grammar Forms.",
            "Space Bounds for Processing Contentless Inputs.",
            "Some Properties of the Class of L Languages with Interactions.",
            "Fault Tolerant Cellular Spaces.",
            "Fault Tolerant Cellular Automata.",
            "Dynamics of Discrete Systems and Pattern Reproductions.",
            "The Tape-Complexity of Context-Independent Developmental Languages.",
            "Graph Grammars and Applications to Specialization and Evolution in Biology.",
            "On \"Forgetful\" Cellular Automata.",
            "Formal Grammars and the Regeneration Capability of Biological Systems.",
            "Ambiguity in the Developmental Systems of Lindenmayer.",
            "Computation by Assembly.",
            "An Accelerated Conjugate Direction Method to Solve Linearly Constrained Minimization Problems.",
            "On the Completeness of the Inductive Assertion Method.",
            "Program Equivalence and Context-Free Grammars.",
            "On Some Questions of Rationality and Decidability.",
            "On Reversibility in Cellular Automata.",
            "Practical Decidability.",
            "Erratum: On the Extension of Gladkij's Theorem and the Hierarchies of Languages."
        ]
    },
    {
        "name": "JCSS",
        "year": "1974",
        "info": "1974: Volumes 8, 9",
        "count": 43,
        "papers": [
            "Left-Derivation Bounded Languages.",
            "Ambiguity and Decision Problems for Local Adjunct Languages.",
            "On Transformations of Programs.",
            "Structure des Grammaires d'Ambiguïté Bornée.",
            "On Periodicity of Sequential Machines.",
            "Program Schemata and the First-Order Decision Problem.",
            "Classes of Discrete Optimization Problems and Their Decision Problems.",
            "Theories of Automata on omega-Tapes: A Simplified Approach.",
            "A Geometric Hierarchy of Languages.",
            "On Vector Languages.",
            "Deterministic Multitape Automata Computations.",
            "Predecessor Machines.",
            "Solution of Eigenvalue Problems in Hilbert Spaces by a Gradient Method.",
            "Comment on the Paper \"Error Detection in Formal Languages\".",
            "The Equivalence of Stack Counter Acceptors and Quasi-Realtime Acceptors.",
            "Fast Algorithms for Bin Packing.",
            "Reversal-Bounded Multipushdown Machines.",
            "On Homomorphisms, Correctness, Termination, Unfoldments, and Equivalence of Flow Diagram Programs.",
            "Fast Modular Transforms.",
            "Translatability of Schemas over Restricted Interpretations.",
            "A Generalized Approach to Formal Languages.",
            "Multiple-Entry Finite Automata.",
            "Algorithm Model for Penalty Functions-Type Iterative Procedures.",
            "Completeness Problem of One-Dimensional Binary Scope-3 Tessellation Automata.",
            "Difunctionally Induced State Machines.",
            "Cyclic Decomposition of Finite Stochastic Systems.",
            "Complexity Classes of Partial Recursive Functions.",
            "On Incomparable Abstract Family of Languages (AFL).",
            "Congruence Arithmetic Algorithms for Polynomial Real Zero Determination.",
            "Linear Dynamical Systems over Integral Domains.",
            "Approximations to the Halting Problem.",
            "The Extent and Density of Sequences within the Minimal-Program Complexity Hierarchies.",
            "1-Way Stack Automaton with Jumps.",
            "Translatability of Flowcharts into While Programs.",
            "Minimum Times and Memories Needed to Compute the Values of a Function.",
            "Comparing Complexity Classes.",
            "Analysis of Structured Programs.",
            "Approximation Algorithms for Combinatorial Problems.",
            "Attributed Translations.",
            "An Observation on Time-Storage Trade Off.",
            "Fast On-Line Integer Multiplication.",
            "Correct and Optimal Implementations of Recursion in a Simple Programming Language.",
            "Testing Flow Graph Reducibility."
        ]
    },
    {
        "name": "JCSS",
        "year": "1973",
        "info": "1973: Volume 7",
        "count": 35,
        "papers": [
            "On AFL Generators for Finitely Encoded AFA.",
            "On Two-way Multihead Automata.",
            "Web Grammars and Several Graphs.",
            "LR-Regular Grammars - an Extension of LR(k) Grammars.",
            "Algorithms for Producing Grammars from Sample Derivations: A Common Problem of Formal Language Theory and Developmental Biology.",
            "Program Schemes, Recursion Schemes, and Formal Languages.",
            "Every Discrete Input Machine is Linearly Simulatable.",
            "Group Theoretic Characterization of Linear Permutation Automata.",
            "Optimal Algorithms for Parallel Polynomial Evaluation.",
            "On the Extension of Gladkij's Theorem and the Hierarchies of Languages.",
            "The Equivalence Problem for Deterministic Two-Tape Automata.",
            "Strict Deterministic Grammars.",
            "Coproducts and Decomposable Machines.",
            "Establishing Certain Bounds Concerning Finite Automata.",
            "A Structure Theory of Automata Characterized by Groups.",
            "Approximate Solutions and Error Bounds for Quasilinear Elliptic Boundary Value Problems.",
            "A V log V Algorithm for Isomorphism of Triconnected Planar Graphs.",
            "A Bound on the Multiplicative Efficiency of Iteration.",
            "A Hierarchy for Nondeterministic Time Complexity.",
            "Time Bounded Random Access Machines.",
            "Process Complexity and Effective Random Tests.",
            "Maze Recognizing Automata and Nondeterministic Tape Complexity.",
            "Characterizations of Flowchartable Recursions.",
            "Time Bounds for Selection.",
            "The Unsolvability of the Equality Problem for Sentential Forms of Context-Free Grammars.",
            "The Efficient Calculation of Powers of Polynomials.",
            "The Constructibility of a Configuration in a Cellular automaton.",
            "Many-one Degrees Associated with Semi-Thue Systems.",
            "Distributions of Queue Lengths and Waiting Times in a Loop with Two-Way Traffic.",
            "State Assignment for Realizing Modular Input-Free Sequential Logical Networks Without Invertors.",
            "Program Schemata as Automata I.",
            "A Characterization Theorem for n-Parallel Right Linear Languages.",
            "Two Iteration Theorems for Some Families of Languages.",
            "Conversion of Programs Between Computers: Interpreters, Simulators and Compilers.",
            "Two Entropies of a Generalized Sorting Problem."
        ]
    },
    {
        "name": "JCSS",
        "year": "1972",
        "info": "1972: Volume 6",
        "count": 35,
        "papers": [
            "Computation of Powers of Multivariate Polynomials over the Integers.",
            "Substitution and Bounded Languages.",
            "Syntactic Operators on Full SemiAFLs.",
            "Effective Operators with No Strong Gaps.",
            "On Program Schemata Equivalence.",
            "A Phenomenon in the Theory of Sorting.",
            "Tape Bounds for Time-Bounded Turing Machines.",
            "Equivalence of Programs with Structured Variables.",
            "Pushdown Automata with Counters.",
            "Locally Testable Languages.",
            "Writing Stack Acceptors.",
            "Complete Linear Proofs of Systems of Linear Inequalities.",
            "A Homomorphism Theorem for Weighted Context-Free Grammars.",
            "Real-Time Language Recognition by One-Dimensional Cellular Automata.",
            "Combinatorial Systems. I. Cylindrical Problems.",
            "The Relation Between Derivations and Syntactical Structures in Phrase-Structure Grammars.",
            "Les 1-Convexes du Monoïde Commutatif N^n.",
            "The Equivalence of Several Initial Value Methods for Solving Integral Equations.",
            "Discrete Tchebycheff Approximation for Multivariate Splines.",
            "An Interpretation-Oriented Theorem Prover over Integers.",
            "Absolutely Parallel Grammars and Two-Way Finite State Transducers.",
            "The Riccati Equation and Its Bounds.",
            "A General Approach to One-Step Iterative Methods with Application to Eigenvalue Problems.",
            "Tessellations with Local Transformations.",
            "Degrees of Computational Complexity.",
            "Continuously Valued Logic.",
            "A Generalization of the Theory of Incompletely Specified Machines.",
            "Decision Procedures for Surjectivity and Injectivity of Parallel Maps for Tessellation Structures.",
            "The Markov Algorithm as a Language Parser - Linear Bounds.",
            "Subrecursive Program Schemata I & II: I. Undecidable Equivalence problems; II. Decidable Equivalence Problems.",
            "Generalized Overlap Resolvable Grammars and Their Parsers.",
            "Optimization of LR(k) Parsers.",
            "Augmented Loop Languages and Classes of Computables Functions.",
            "Efficient Evaluation of Polynomial Forms.",
            "Proving Simultaneous Positivity of Linear Forms."
        ]
    },
    {
        "name": "JCSS",
        "year": "1971",
        "info": "1971: Volume 5",
        "count": 35,
        "papers": [
            "Dot-Depth of Star-Free Events.",
            "The Concect of Effective Method Applied to Computational Problems of Linear Algebra.",
            "Realizations by Stochastic Finite Automata.",
            "Classification of Noncounting Events.",
            "The use of Lists in the Study of Undecidable Problems in Automata Theory.",
            "Algorithmic Approximations.",
            "On the Isolation of the Roots of a Non-Linear Operator.",
            "Characterizations of Some Tape and Time Complexity Classes of Turing Machines in Terms of Multihead and Auxiliary Stack Automata.",
            "Abstract Computational Complexity and Cycling Computations.",
            "Extensions of Asynchronous Circuits and the Delay Problem. Part II: Spike-Free Extensions and the Delay Problem of the Second Kind.",
            "A Computational Approach to the Maximum Principle.",
            "Data Graphs and Addressing Schemes.",
            "Mathematical Theory of Partial Correctness.",
            "Translating Recursion Equations into Flow Charts.",
            "The Enumerability and Invariance of Complexity Classes.",
            "Three Theorems Concerning Principal AFLs.",
            "Subrecursive Programming Languages. II. On Program Size.",
            "Unilateral Context Sensitive Grammars and Left-to-Right Parsing.",
            "A Characterization of Context-free Languages.",
            "AFL with the Semilinear Property.",
            "Time-Bounded Grammars and Their Languages.",
            "Minimum Error Bounds for Multidimensional Spline Approximation.",
            "Erratum: Tree Acceptors and Some of Their Applications.",
            "Tessellation Structures for Reproduction of Arbitrary Patterns.",
            "Operation-Preserving Functions and Autononous Factors of Finite Automata.",
            "Towards a Theory of Data Structures.",
            "Every Finite Sequential Machine is Linearly Realizable.",
            "Marked Directed Graphs.",
            "Algebraic Theory of Finite Fourier Transforms.",
            "Finite-Turn Checking Automata.",
            "Pair Grammars, Graph Languages and String-to-Graph Translations.",
            "Abstract Families of Relations.",
            "On Fully Indecomposable Matrices.",
            "Pattern Reproduction in Tessellation Automata of Arbitrary Dimension.",
            "Substitution Expressions."
        ]
    },
    {
        "name": "JCSS",
        "year": "1970",
        "info": "1970: Volume 4",
        "count": 35,
        "papers": [
            "Depth-Bounded Computation.",
            "Newton's Method under Mild Differential Conditions.",
            "Nonlinear Optimal Controls.",
            "A Convex Programming Problem in Banach Spaces and Applications to Optimum Control Theory.",
            "Time-Restricted Sequence Generation.",
            "Some Results Concerning Proofs of Statements about Programs.",
            "Generation of Near-Optimal Universal Boolean Functions.",
            "Factorization of Operators II: A Nonlinear Volterra Method for Numerical Solution of Linear Fredholm Equations.",
            "On the Computational Power of Pushdown Automata.",
            "A Completeness Problem for Pattern Generation in Tessellation Automata.",
            "Relationships Between Nondeterministic and Deterministic Tape Complexities.",
            "Abstract Families of Processors.",
            "Equivalences on Program Schemes.",
            "On Formalised Computer Programs.",
            "Remarks on the Approximation of Some Nonlinear Elliptic Equations.",
            "General Properties of Star Height of Regular Events.",
            "Star Height of Certain Families of Regular Events.",
            "A Characterization of Semilinear Sets.",
            "Principal AFL.",
            "Generalized Sequential Machine Maps.",
            "What makes Some Language Theory Problems Undecidable.",
            "On the Stability of Linear Recurrence Equations with Arbitrary Time Lags.",
            "Error Detection in Formal Languages.",
            "Tree Acceptors and Some of Their Applications.",
            "On the Structure of Subrecursive Degrees.",
            "Recursive Function Theory and Numerical Analysis.",
            "Invariant Imbedding, Difference Equations, and Elliptic Boundary Value Problems.",
            "An Hierarchy Between Context-Free and Context-Sensitive Languages.",
            "Uniform Rational Approximation with Osculatory Interpolation.",
            "A Characterization of Two-Way Deterministic Classes of Languages.",
            "Algebraic Structures in Linear Systems Theory.",
            "An Application of the Epsilon Technique to the Solution of Pursuit and Evasion Problems.",
            "Cutting Plane Algorithms and State Space Constrained Linear Optimal Control Problems.",
            "Time- and Tape-Bounded Turing Acceptors and AFLs.",
            "Tape-Bounded Turing Acceptors and Principal AFLs."
        ]
    },
    {
        "name": "JCSS",
        "year": "1969",
        "info": "1969: Volume 3",
        "count": 23,
        "papers": [
            "On the Convergence of Nonlinear Simulaneous Displacements.",
            "Combinatorial Equivalence of (0, 1) Circulant Matrices.",
            "Optimal Control for a Class of Distributed Parameter Systems Where the Cost Functions are Norms.",
            "Syntax Directed Translations and the Pushdown Assembler.",
            "A General Theory of Extremals.",
            "Time-Varying Linear Sequential Machines I.",
            "The Correctness of Programs.",
            "Convergence with Hilbert's Space Filling Curve.",
            "Parallel Program Schemata.",
            "Checking Automata and One-Way Stack Languages.",
            "Cubature and Tchakaloff Cone.",
            "Every Semilinear Set is a Finite Union of Disjoint Linear Sets.",
            "Scattered Context Grammars.",
            "Towards a Theory of Semantics and Compilers for Programming Languages.",
            "Writing Pushdown Acceptors.",
            "Properties of Syntax Directed Translations.",
            "A Decomposition Method for Structured Linear and Nonlinear Programs.",
            "Regular Expressions and the Equivalence of Programs.",
            "Elementary Indefinite Integration Theory for the Computer.",
            "Some Considerations on Fuzzy Automata.",
            "Referenced Automata and Metaregular Families.",
            "The Primitive Recursive Analysis of Ordinary Differential Equations and the Complexity of Their Solutions.",
            "A Generator of Contex-Sensitive Languages."
        ]
    },
    {
        "name": "JCSS",
        "year": "1968",
        "info": "1968: Volume 2",
        "count": 23,
        "papers": [
            "Deterministic Stack Automata and the Quotient Operator.",
            "Bounded Action Machines: Toward an Abstract Theory of Computer Structure.",
            "On the Equivalence between Matrix Riccati Equations and Fredholm Resolvents.",
            "Multitape One-Way Nonwriting Automata.",
            "A New Computing Technique in System Identification.",
            "Tape-Reversal Bounded Turing Machine Computations.",
            "The Reduction of Tape Reversals for Off-Line One-Tape Turing Machines.",
            "Closures which Preserve Finiteness in Families of Languages.",
            "On the Nonexistence of Close-Packed Double Hamming-Error-Correcting Codes on q=7 Symbols.",
            "Newton's Method and Boundary Value Problems.",
            "Further Results on Generalized Predictor-Corrector Methods.",
            "Frequency of Decomposability among Machines with a Large Number of States.",
            "Derivation-Bounded Languages.",
            "Extensions of Asynchronous Circuits and the Delay Problem. I: Good Extensions and the Delay Problem of the First Kind.",
            "On the Geometry of Optimal Strategies in Two-Person Games of Kind.",
            "A Note on Decision Rules for Stochastic Programs.",
            "Probabilistic Aspects of Machine Decomposition Theory.",
            "Multiparametric Eigenvalue Problems in Inner-product Spaces.",
            "Algorithms for Some Minimax Problems.",
            "Infinite Linear Sequential Machines.",
            "On the Multiplying Ability of Two-Way Automata.",
            "Structural Equivalence of Context-Free Grammars.",
            "On a Characterization of the Nonregular Set of Primes."
        ]
    },
    {
        "name": "JCSS",
        "year": "1967",
        "info": "1967: Volume 1",
        "count": 26,
        "papers": [
            "Bracketed Context-Free Languages.",
            "Linear Positive Machines.",
            "Chebyshev Solution of Large Linear Systems.",
            "A Parametric Method for Solving Certain Nonconcave Maximization Problems.",
            "Methods of the Algebraic Theory of Machines. I: Decomposition Theorem for Generalized Machines; Properties Preserved under Series and Parallel Compositions of Machines.",
            "Stationary Points of Functionals in Pre-Hilbert Spaces.",
            "Foundations of the State-Space Theory of Continous Systems I.",
            "Algebraic Principles for the Analysis of a Biochemical System.",
            "On Some Properties of the Free Monoids with Applications to Automata Theory.",
            "Homomorphic Images of Linear Sequential Machines.",
            "Nonerasing Stack Automata.",
            "Some Definitional Suggestions for Automata Theory.",
            "Generalized Upper Bounding Techniques.",
            "Solutions of Generalized Optimization Problems.",
            "First-Order Necessary Conditions for Generalized Optimization Problems.",
            "A Decomposition Method for Structured Quadratic Programming Problems.",
            "A Solution to the Optimal Pursuit Problem for Distributed Parameter Systems.",
            "Distribution of Attained Service in Time-Shared Systems.",
            "Multitape Finite Automata with Rewind Instructions.",
            "Characterizing Derivation Trees of Context-Free Grammars through a Generalization of Finite Automata Theory.",
            "On Infinite-Dimensional Convex Programs.",
            "Affine Dynamical Systems.",
            "Global Theory of the Riccati Equation.",
            "The Computation of Eigenvalues and Eigenvectors of a Completetly Continuous Self-Adjoint Operator.",
            "Fuzzy Star Functions, Probabilistic Automata, and Their Approximation by Nonprobabilistic Automata.",
            "State Estimation for Infinite-Dimensional Systems."
        ]
    }
]