[
    {
        "name": "JGO",
        "year": "2022",
        "info": "2022: Volumes\n82,",
        "count": 30,
        "papers": [
            "An alternative perspective on copositive and convex relaxations of nonconvex quadratic programs.",
            "Data-driven spatial branch-and-bound algorithms for box-constrained simulation-based optimization.",
            "Augmented Lagrangian method for second-order cone programs under second-order sufficiency.",
            "An efficient alternating minimization method for fourth degree polynomial optimization.",
            "On reduction of exhausters via a support function representation.",
            "Strict directional solutions in vectorial problems: necessary optimality conditions.",
            "Error bound analysis for vector equilibrium problems with partial order provided by a polyhedral cone.",
            "Variational rationality, variational principles and the existence of traps in a changing environment.",
            "Maximization problems of balancing submodular relevance and supermodular diversity.",
            "Identification of mechanical properties of arteries with certification of global optimality.",
            "On nondegenerate M-stationary points for sparsity constrained nonlinear optimization.",
            "Exact SDP relaxations of quadratically constrained quadratic programs with forest structures.",
            "Hidden invariant convexity for global and conic-intersection optimality guarantees in discrete-time optimal control.",
            "Four algorithms to solve symmetric multi-type non-negative matrix tri-factorization problem.",
            "An extension of the proximal point algorithm beyond convexity.",
            "A unified Douglas-Rachford algorithm for generalized DC programming.",
            "Conical averagedness and convergence analysis of fixed point algorithms.",
            "Improperly efficient solutions in a class of vector optimization problems.",
            "Existence results for solutions of mixed tensor variational inequalities.",
            "Adaptive seeding for profit maximization in social networks.",
            "Review and comparison of algorithms and software for mixed-integer derivative-free optimization.",
            "Sparse regularization via bidualization.",
            "Brezis pseudomonotone bifunctions and quasi equilibrium problems via penalization.",
            "Inertial projection and contraction algorithms with larger step sizes for solving quasimonotone variational inequalities.",
            "Strong convergence of inertial projection and contraction methods for pseudomonotone variational inequalities with applications to optimal control problems.",
            "Generalized ε-quasi solutions of set optimization problems.",
            "Linear convergence of a nonmonotone projected gradient method for multiobjective optimization.",
            "Multi-objective dynamic programming with limited precision.",
            "A note on completely positive relaxations of quadratic problems in a multiobjective framework.",
            "Global optimization for the multilevel European gas market system with nonlinear flow models on trees."
        ]
    },
    {
        "name": "JGO",
        "year": "2021",
        "info": "2021: Volumes\n79,\n80,\n81",
        "count": 123,
        "papers": [
            "A filter proximal bundle method for nonsmooth nonconvex constrained optimization.",
            "Oscars-ii: an algorithm for bound constrained global optimization.",
            "The exact solution of multiparametric quadratically constrained quadratic programming problems.",
            "Stochastic optimization with adaptive restart: a framework for integrated local and global learning.",
            "Resolving learning rates adaptively by locating stochastic non-negative associated gradient projection points using line searches.",
            "The extreme rays of the 6˟ 6 copositive cone.",
            "Karush-Kuhn-Tucker type optimality condition for quasiconvex programming in terms of Greenberg-Pierskalla subdifferential.",
            "Second-order KKT optimality conditions for multiobjective discrete optimal control problems.",
            "A scalarization scheme for binary relations with applications to set-valued and robust optimization.",
            "Weak convergence of an extended splitting method for monotone inclusions.",
            "Preface to the special issue dedicated to the 14th international workshop on global optimization held in Leiden, The Netherlands, September 18-21, 2018.",
            "Sequential model based optimization of partially defined functions under unknown constraints.",
            "On the search of the shape parameter in radial basis functions using univariate global optimization methods.",
            "A model of anytime algorithm performance for bi-objective optimization.",
            "Linear interval parametric approach to testing pseudoconvexity.",
            "Cooperative multiobjective optimization with bounds on objective functions.",
            "On the Extension of the DIRECT Algorithm to Multiple Objectives.",
            "AbsTaylor: upper bounding with inner regions in nonlinear continuous global optimization problems.",
            "A DIRECT-type global optimization algorithm for image registration.",
            "Multistart with early termination of descents.",
            "Production and transport scheduling in flexible job shop manufacturing systems.",
            "Nonlinear biobjective optimization: improving the upper envelope using feasible line segments.",
            "The DIRECT algorithm: 25 years Later.",
            "Design of IMEXRK time integration schemes via Delaunay-based derivative-free optimization with nonconvex constraints and grid-based acceleration.",
            "A Galerkin approach to optimization in the space of convex and compact subsets of ${\\mathbb {R}}^d$.",
            "Inertial proximal gradient methods with Bregman regularization for a class of nonconvex optimization problems.",
            "Optimal correction of the absolute value equations.",
            "A combination of RANSAC and DBSCAN methods for solving the multiple geometrical object detection problem.",
            "Efficient computation of minimum-area rectilinear convex hull under rotation and generalizations.",
            "A semidefinite relaxation method for second-order cone tensor eigenvalue complementarity problems.",
            "Ekeland variational principles involving set perturbations in vector equilibrium problems.",
            "The lower bounded inverse optimal value problem on minimum spanning tree under unit l∞  norm.",
            "Data-driven distributionally robust chance-constrained optimization with Wasserstein metric.",
            "General splitting methods with linearization for the split feasibility problem.",
            "An optimization approach to solving the split feasibility problem in Hilbert spaces.",
            "Linear convergence of inexact descent method and inexact proximal gradient algorithms for lower-order regularization problems.",
            "Robust constrained best approximation with nonconvex constraints.",
            "On robustness for set-valued optimization problems.",
            "Gaddum's test for symmetric cones.",
            "The finite intersection property for equilibrium problems.",
            "Maximum shortest path interdiction problem by upgrading edges on trees under weighted l1 norm.",
            "The EMS vehicle patient transportation problem during a demand surge.",
            "Preface of the special issue on global multiobjective optimization.",
            "Inverse multiobjective optimization: Inferring decision criteria from data.",
            "Nonconvex constrained optimization by a filtering branch and bound.",
            "Proximity measures based on KKT points for constrained multi-objective optimization.",
            "One-exact approximate Pareto sets.",
            "Multi-objective convex polynomial optimization and semidefinite programming relaxations.",
            "Duality in nonconvex vector optimization.",
            "Essential stability in unified vector optimization.",
            "Necessary conditions for weak minima and for strict minima of order two in nonsmooth constrained multiobjective optimization.",
            "A general branch-and-bound framework for continuous global multiobjective optimization.",
            "Correction to: A general branch-and-bound framework for continuous global multiobjective optimization.",
            "Solving unconstrained 0-1 polynomial programs through quadratic convex reformulation.",
            "Convexification techniques for linear complementarity constraints.",
            "Convexification of bilinear forms through non-symmetric lifting.",
            "Solving mixed-integer nonlinear optimization problems using simultaneous convexification: a case study for gas networks.",
            "Cheaper relaxation and better approximation for multi-ball constrained quadratic optimization and extension.",
            "On tackling reverse convex constraints for non-overlapping of unequal circles.",
            "A robust method based on LOVO functions for solving least squares problems.",
            "A smoothing quasi-Newton method for solving general second-order cone complementarity problems.",
            "A method for convex black-box integer global optimization.",
            "Inexact stochastic subgradient projection method for stochastic equilibrium problems with nonmonotone bifunctions: application to expected risk minimization in machine learning.",
            "An interval branch and bound method for global Robust optimization.",
            "Partially distributed outer approximation.",
            "Near optimal minimal convex hulls of disks.",
            "Maximizing DR-submodular+supermodular functions on the integer lattice subject to a cardinality constraint.",
            "Bounds on efficient outcomes for large-scale cardinality-constrained Markowitz problems.",
            "Smoothing Newton method for nonsmooth second-order cone complementarity problems with application to electric power markets.",
            "Approximation algorithm for minimum power partial multi-coverage in wireless sensor networks.",
            "Efficient approximation of the metric CVRP in spaces of fixed doubling dimension.",
            "An optimization approach for winner determination problem considering transportation cost discounts.",
            "Review on the monograph Deterministic Global Optimization: An Introduction to the Diagonal Approach, Springer, 2017, written by Yaroslav D. Sergeyev and Dmitri E. Kvasov.",
            "Linearization of McCormick relaxations and hybridization with the auxiliary variable method.",
            "Convex hull representations for bounded products of variables.",
            "On new methods to construct lower bounds in simplicial branch and bound based on interval arithmetic.",
            "Generalizing 0-1 conflict hypergraphs and mixed conflict graphs: mixed conflict hypergraphs in discrete optimization.",
            "Proximal-like incremental aggregated gradient method with Bregman distance in weakly convex optimization problems.",
            "MVMOO: Mixed variable multi-objective optimisation.",
            "Optimizing generalized kernels of polygons.",
            "Unique solvability of weakly homogeneous generalized variational inequalities.",
            "Dynamical system for solving bilevel variational inequalities.",
            "Lagrangian relaxation based heuristics for a chance-constrained optimization model of a hybrid solar-battery storage system.",
            "Preface to the special issue of JOGO on the occasion of the 40th anniversary of the Group for Research in Decision Analysis (GERAD).",
            "Learning chordal extensions.",
            "The conditional p-dispersion problem.",
            "Learning discontinuous piecewise affine fitting functions using mixed integer programming over lattice.",
            "Advances in verification of ReLU neural networks.",
            "Resolving sets and integer programs for recommender systems.",
            "An outer-inner linearization method for non-convex and nondifferentiable composite regularization problems.",
            "Surrogate optimization of deep neural networks for groundwater predictions.",
            "Optimal decision trees for categorical data via integer programming.",
            "Using symbolic calculations to determine largest small polygons.",
            "Decomposition in derivative-free optimization.",
            "Global solutions of nonconvex standard quadratic programs via mixed integer linear programming reformulations.",
            "A variational approach to the alternating projections method.",
            "Optimality conditions based on the Fréchet second-order subdifferential.",
            "A branch-and-bound algorithm for solving max-k-cut problem.",
            "Scenario-based cuts for structured two-stage stochastic and distributionally robust p-order conic mixed integer programs.",
            "Copula theory approach to stochastic geometric programming.",
            "Model risk in mean-variance portfolio selection: an analytic solution to the worst-case approach.",
            "Bilevel cutting-plane algorithm for cardinality-constrained mean-CVaR portfolio optimization.",
            "Detecting and solving aircraft conflicts using bilevel programming.",
            "Detecting optimality and extracting solutions in polynomial optimization with the truncated GNS construction.",
            "An objective penalty function method for biconvex programming.",
            "Exclusion regions for parameter-dependent systems of equations.",
            "A modified simplex partition algorithm to test copositivity.",
            "An exact separation algorithm for unsplittable flow capacitated network design arc-set polyhedron.",
            "A dual approach to multi-dimensional assignment problems.",
            "Nonconvex and Nonsmooth Sparse Optimization via Adaptively Iterative Reweighted Methods.",
            "Dual-density-based reweighted ℓ 1-algorithms for a class of ℓ 0-minimization problems.",
            "Improved interval methods for solving circle packing problems in the unit square.",
            "A branch-cut-and-price algorithm for optimal decoding in digital communication systems.",
            "A geometric branch and bound method for robust maximization of convex functions.",
            "Branch-and-price for a class of nonconvex mixed-integer nonlinear programs.",
            "On global subdifferentials with applications in nonsmooth optimization.",
            "A power penalty approach to a mixed quasilinear elliptic complementarity problem.",
            "Integer programming formulations and efficient local search for relaxed correlation clustering.",
            "ORCA: Outlier detection and Robust Clustering for Attributed graphs.",
            "Error bound of critical points and KL property of exponent 1/2 for squared F-norm regularized factorization.",
            "Solving nonnegative sparsity-constrained optimization via DC quadratic-piecewise-linear approximations.",
            "Experimental analysis of local searches for sparse reflexive generalized inverses.",
            "Exact SDP reformulations of adjustable robust linear programs with box uncertainties under separable quadratic decision rules via SOS representations of non-negativity."
        ]
    },
    {
        "name": "JGO",
        "year": "2020",
        "info": "2020: Volumes\n76,\n77,\n78",
        "count": 120,
        "papers": [
            "Convex envelope of bivariate cubic functions over rectangular regions.",
            "New global optimality conditions for nonsmooth DC optimization problems.",
            "Optimality conditions for an exhausterable function on an exhausterable set.",
            "On the choice of the low-dimensional domain for global optimization via random embeddings.",
            "Steklov regularization and trajectory methods for univariate global optimization.",
            "Strong duality in minimizing a quadratic form subject to two homogeneous quadratic inequalities over the unit sphere.",
            "A residual-based algorithm for solving a class of structured nonsmooth optimization problems.",
            "The decompositions with respect to two core non-symmetric cones.",
            "Solving k-center problems involving sets based on optimization techniques.",
            "Multimode resource-constrained project scheduling in flexible projects.",
            "Multi-objective optimization models in finance and investments.",
            "An optimization-diversification approach to portfolio selection.",
            "Global minimum variance portfolios under uncertainty: a robust optimization approach.",
            "Preference-based evolutionary multi-objective optimization for portfolio selection: a new credibilistic model under investor preferences.",
            "Tailor-made thematic portfolios: a core satellite optimization.",
            "A stochastic goal programming model to derive stable cash management policies.",
            "The joint replenishment problem with trade credits.",
            "Inner approximating the completely positive cone via the cone of scaled diagonally dominant matrices.",
            "Characterization of generalized FJ and KKT conditions in nonsmooth nonconvex optimization.",
            "Convergence analysis of a projection algorithm for variational inequality problems.",
            "Preface.",
            "Cooperation in dynamic multicriteria games with random horizons.",
            "Scheduling problems with controllable processing times and a common deadline to minimize maximum compression cost.",
            "Approximating the 2-machine flow shop problem with exact delays taking two values.",
            "A model for optimization of transport infrastructure for some homogeneous goods markets.",
            "A special three-level optimization problem.",
            "Extension technology and extrema selections in a stochastic multistart algorithm for optimal control problems.",
            "The maximum independent union of cliques problem: complexity and exact approaches.",
            "Multidimensional frontier visualization based on optimization methods using parallel computations.",
            "Consensus and balancing on the three-sphere.",
            "On feedback strengthening of the maximum principle for measure differential equations.",
            "Sparse solutions of optimal control via Newton method for under-determined systems.",
            "Optimality conditions for optimal impulsive control problems with multipoint state constraints.",
            "A puzzled driver is a better driver: enforcing speed limits using a randomization strategy.",
            "Preface: special issue of MOA 2018.",
            "A hybrid Bregman alternating direction method of multipliers for the linearly constrained difference-of-convex problems.",
            "The seeding algorithms for spherical k-means clustering.",
            "A Euclidean distance matrix model for protein molecular conformation.",
            "Non-submodular maximization on massive data streams.",
            "A class of exact penalty functions and penalty algorithms for nonsmooth constrained optimization problems.",
            "An active set Barzilar-Borwein algorithm for l0 regularized optimization.",
            "An ADMM-based location-allocation algorithm for nonconvex constrained multi-source Weber problem under gauge.",
            "Accelerated iterative hard thresholding algorithm for l0 regularized regression problem.",
            "A derivative-free algorithm for spherically constrained optimization.",
            "A Gauss-Seidel type inertial proximal alternating linearized minimization for a class of nonconvex optimization problems.",
            "A descent cautious BFGS method for computing US-eigenvalues of symmetric complex tensors.",
            "Set-completely-positive representations and cuts for the max-cut polytope and the unit modulus lifting.",
            "Preface: Special issue Europt 2018.",
            "An algorithmic approach to multiobjective optimization with decision uncertainty.",
            "On generating the set of nondominated solutions of a linear programming problem with parameterized fuzzy numbers.",
            "Distributed algorithms for convex problems with linear coupling constraints.",
            "The decomposition-based outer approximation algorithm for convex mixed-integer nonlinear programming.",
            "Block layer decomposition schemes for training deep neural networks.",
            "On ill-posedness and stability of tensor variational inequalities: application to an economic equilibrium.",
            "Optimality conditions for convex problems on intersections of non necessarily convex sets.",
            "Global optimization of grillage-type foundations using a distributed genetic algorithm.",
            "Packing ovals in optimized regular polygons.",
            "New bounding schemes and algorithmic options for the Branch-and-Sandwich algorithm.",
            "Convexifications of rank-one-based substructures in QCQPs and applications to the pooling problem.",
            "Sequential characterizations of approximate solutions in convex vector optimization problems with set-valued maps.",
            "Order cancellation law in the family of bounded convex sets.",
            "Globally minimizing the sum of a convex-concave fraction and a convex function based on wave-curve bounds.",
            "Approximation algorithms for capacitated partial inverse maximum spanning tree problem.",
            "An exact completely positive programming formulation for the discrete ordered median problem: an extended version.",
            "Accelerated sampling Kaczmarz Motzkin algorithm for the linear feasibility problem.",
            "An enhanced formulation for solving graph coloring problems with the Douglas-Rachford algorithm.",
            "Linear conditioning, weak sharpness and finite convergence for equilibrium problems.",
            "Optimality-based domain reduction for inequality-constrained NLP and MINLP problems.",
            "Mathematical programming formulations for piecewise polynomial functions.",
            "Global dynamic optimization using edge-concave underestimator.",
            "Doubly nonnegative relaxations are equivalent to completely positive reformulations of quadratic optimization problems with block-clique graph structures.",
            "Subset selection for multiple linear regression via optimization.",
            "Primal-dual analysis for online interval scheduling problems.",
            "Preprocessing algorithm and tightening constraints for multiperiod blend scheduling: cost minimization.",
            "Characterization of the weakly efficient solutions in nonsmooth quasiconvex multiobjective optimization.",
            "Damped Newton's method on Riemannian manifolds.",
            "Limiting Subdifferential Calculus and Perturbed Distance Function in Riemannian Manifolds.",
            "An enhanced logical benders approach for linear programs with complementarity constraints.",
            "An inner approximation method to compute the weight set decomposition of a triobjective mixed-integer problem.",
            "Delaunay-based derivative-free optimization via global surrogates. Part III: nonconvex constraints.",
            "Filter-based stochastic algorithm for global optimization.",
            "Solution maps of polynomial variational inequalities.",
            "A sparse chance constrained portfolio selection model with multiple constraints.",
            "A stochastic approach to full inverse treatment planning for charged-particle therapy.",
            "Capacitated assortment and price optimization under the nested logit model.",
            "Finding optimal points for expensive functions using adaptive RBF-based surrogate model via uncertainty quantification.",
            "A biased random-key genetic algorithm for routing and wavelength assignment under a sliding scheduled traffic model.",
            "Solving polyhedral d.c. optimization problems via concave minimization.",
            "A general asymptotic function with applications in nonconvex optimization.",
            "Global complexity analysis of inexact successive quadratic approximation methods for regularized optimization under mild assumptions.",
            "Two modified extragradient algorithms for solving variational inequalities.",
            "A difference-of-convex approach for split feasibility with applications to matrix factorizations and outlier detection.",
            "Development of an adaptive infill criterion for constrained multi-objective asynchronous surrogate-based optimization.",
            "On the relation between the extended supporting hyperplane algorithm and Kelley's cutting plane algorithm.",
            "Relaxed constant positive linear dependence constraint qualification and its application to bilevel programs.",
            "Generalized risk parity portfolio optimization: an ADMM approach.",
            "Preface to the special issue \"ICVNS 2018\".",
            "Improved metaheuristics for the quartet method of hierarchical clustering.",
            "The continuous single-source capacitated multi-facility Weber problem with setup costs: formulation and solution methods.",
            "GRASP with Variable NCaminoseighborhood Descent for the online order batching problem.",
            "Cooperative versus non-cooperative parallel variable neighborhood search strategies: a case study on the capacitated vehicle routing problem.",
            "Modelling and solving the multi-quays berth allocation and crane assignment problem with availability constraints.",
            "Revenue maximization of Internet of things provider using variable neighbourhood search.",
            "Consistency bounds and support recovery of d-stationary solutions of sparse sample average approximations.",
            "Penalized semidefinite programming for quadratically-constrained quadratic optimization.",
            "Outer space branch and bound algorithm for solving linear multiplicative programming problems.",
            "Gaussian process optimization with failures: classification and convergence proof.",
            "Expected improvement for expensive optimization: a review.",
            "Geoffrion's proper efficiency in linear fractional vector optimization with unbounded constraint sets.",
            "Stability of efficient solutions to set optimization problems.",
            "On the sensitivity of Pareto efficiency in set-valued optimization problems.",
            "Portfolio optimization with two coherent risk measures.",
            "Refugee migration networks and regulations: a multiclass, multipath variational inequality framework.",
            "Saddle point approximation approaches for two-stage robust optimization problems.",
            "Strategic decisions of sales and pay-per-use rentals under incomplete product availability.",
            "Parallel-batching scheduling with nonlinear processing times on a single and unrelated parallel machines.",
            "Parallel-machine group scheduling with inclusive processing set restrictions, outsourcing option and serial-batching under the effect of step-deterioration.",
            "High-end weapon equipment portfolio selection based on a heterogeneous network model.",
            "Fast algorithms for sparse portfolio selection considering industries and investment styles.",
            "A heuristic and metaheuristic approach to the static weapon target assignment problem."
        ]
    },
    {
        "name": "JGO",
        "year": "2019",
        "info": "2019: Volumes\n73,\n74,\n75",
        "count": 124,
        "papers": [
            "Global optimization of generalized semi-infinite programs using disjunctive programming.",
            "A projection-based reformulation and decomposition algorithm for global optimization of a class of mixed integer bilevel linear programs.",
            "Spectral projected gradient method for stochastic optimization.",
            "A Lyapunov-type approach to convergence of the Douglas-Rachford algorithm for a nonconvex setting.",
            "Convergence-order analysis for differential-inequalities-based bounds and relaxations of the solutions of ODEs.",
            "The weighted horizontal linear complementarity problem on a Euclidean Jordan algebra.",
            "A Bayesian optimization approach to find Nash equilibria.",
            "The least squares solution of a class of generalized Sylvester-transpose matrix equations with the norm inequality constraint.",
            "Numbers of the connected components of the solution sets of monotone affine vector variational inequalities.",
            "Global optimization issues in deep network regression: an overview.",
            "A unified DC programming framework and efficient DCA based approaches for large scale batch reinforcement learning.",
            "A fast algorithm for globally solving Tikhonov regularized total least squares problem.",
            "Iteration-complexity analysis of a generalized alternating direction method of multipliers.",
            "Geometric properties for level sets of quadratic functions.",
            "A sensitive-eigenvector based global algorithm for quadratically constrained quadratic programming.",
            "Robot path planning in a dynamic environment with stochastic measurements.",
            "An inexact splitting method for the subspace segmentation from incomplete and noisy observations.",
            "Mixed integer quadratic optimization formulations for eliminating multicollinearity based on variance inflation factor.",
            "Well-posedness and scalarization in set optimization involving ordering cones with possibly empty interior.",
            "Correction to: Optimal deterministic algorithm generation.",
            "Tighter α BB relaxations through a refinement scheme for the scaled Gerschgorin theorem.",
            "SDP-based branch-and-bound for non-convex quadratic integer optimization.",
            "A generic interval branch and bound algorithm for parameter estimation.",
            "On the spherical convexity of quadratic functions.",
            "Rigorous packing of unit squares into a circle.",
            "A topological convergence on power sets well-suited for set optimization.",
            "Efficient global optimization of constrained mixed variable problems.",
            "Conditional optimization of a noisy function using a kriging metamodel.",
            "Novel self-adaptive algorithms for non-Lipschitz equilibrium problems with applications.",
            "Revisiting norm optimization for multi-objective black-box problems: a finite-time analysis.",
            "Book Review: Xinbao Liu, Jun Pei, Lin Liu, Hao Cheng, Mi Zhou, and Panos M. Pardalos: Optimization and management in manufacturing engineering. Resource collaborative optimization and management through the Internet of Things. Springer optimization and its applications series - Springer, 2017, XVIII pp, Hardcover: ISBN: 978-3-319-64567-4.",
            "Lifted polymatroid inequalities for mean-risk optimization with indicator variables.",
            "Enhancing the normalized multiparametric disaggregation technique for mixed-integer quadratic programming.",
            "Packing circles into perimeter-minimizing convex hulls.",
            "On the complexity of quasiconvex integer minimization problem.",
            "A mixed integer programming approach to the tensor complementarity problem.",
            "MiKM: multi-step inertial Krasnosel'skiǐ-Mann algorithm and its applications.",
            "Generalized forward-backward splitting with penalization for monotone inclusion problems.",
            "A subgradient algorithm for a class of nonlinear split feasibility problems: application to jointly constrained Nash equilibrium models.",
            "Properties of the nonlinear scalar functional and its applications to vector optimization problems.",
            "On the hierarchical structure of Pareto critical sets.",
            "Enhancing interval constraint propagation by identifying and filtering n-ary subsystems.",
            "Minimum variance allocation among constrained intervals.",
            "On three soft rectangle packing problems with guillotine constraints.",
            "Application of the DIRECT algorithm to searching for an optimal k-partition of the set A ⊂ Rn and its application to the multiple circle detection problem.",
            "The Douglas-Rachford algorithm for a hyperplane and a doubleton.",
            "Asynchronous sequential inertial iterations for common fixed points problems with an application to linear systems.",
            "A proximal method for solving nonlinear minmax location problems with perturbed minimal time functions via conjugate duality.",
            "Necessary optimality conditions for a nonsmooth semi-infinite programming problem.",
            "The locally Chen-Harker-Kanzow-Smale smoothing functions for mixed complementarity problems.",
            "A unified minimal solution in set optimization.",
            "NAUTILUS Navigator: free search interactive multiobjective optimization without trading-off.",
            "Necessary and sufficient conditions for achieving global optimal solutions in multiobjective quadratic fractional optimization problems.",
            "Proximal bundle methods based on approximate subgradients for solving Lagrangian duals of minimax fractional programs.",
            "Weighted LCPs and interior point systems for copositive linear transformations on Euclidean Jordan algebras.",
            "Solving inverse optimal control problems via value functions to global optimality.",
            "Two-layer adaptive surrogate-assisted evolutionary algorithm for high-dimensional computationally expensive problems.",
            "Variants of the Ekeland variational principle for approximate proper solutions of vector equilibrium problems.",
            "Stability in unified semi-infinite vector optimization.",
            "When is there a representer theorem? - Nondifferentiable regularisers and Banach spaces.",
            "Facets of a mixed-integer bilinear covering set with bounds on variables.",
            "Multi-parametric global optimization approach for tri-level mixed-integer linear optimization problems.",
            "Large proper gaps in bin packing and dual bin packing problems.",
            "Solving the multistage PMU placement problem by integer programming and equivalent network design model.",
            "Multi-objective unconstrained combinatorial optimization: a polynomial bound on the number of extreme supported solutions.",
            "On seeking efficient Pareto optimal points in multi-player minimum cost flow problems with application to transportation systems.",
            "Variable neighborhood search for stochastic linear programming problem with quantile criterion.",
            "Optimal control problems with states of bounded variation and hysteresis.",
            "Preface.",
            "Bi-objective decision making in global optimization based on statistical models.",
            "Tuning BARON using derivative-free optimization algorithms.",
            "An adaptive, multivariate partitioning algorithm for global optimization of nonconvex programs.",
            "On tightness and anchoring of McCormick and other relaxations.",
            "A multi-term, polyhedral relaxation of a 0-1 multilinear function for Boolean logical pattern generation.",
            "Geometric conditions of reduction of exhausters.",
            "Invex optimization revisited.",
            "On the chance-constrained minimum spanning k-core problem.",
            "Critical nodes in interdependent networks with deterministic and probabilistic cascading failures.",
            "A cutting plane method for risk-constrained traveling salesman problem with random arc costs.",
            "Hybrid clustering based on content and connection structure using joint nonnegative matrix factorization.",
            "Joint production and transportation scheduling in flexible manufacturing systems.",
            "Local search approximation algorithms for the sum of squares facility location problems.",
            "Preface on the Special Issue Global Optimization with Multiple Criteria: Theory, Methods and Applications.",
            "Efficient computation of expected hypervolume improvement using box decomposition algorithms.",
            "An exact parallel objective space decomposition algorithm for solving multi-objective integer programming problems.",
            "Nonmonotone line searches for unconstrained multiobjective optimization problems.",
            "Nonlinear biobjective optimization: improvements to interval branch & bound algorithms.",
            "Necessary conditions for weak efficiency for nonsmooth degenerate multiobjective optimization problems.",
            "Weak minimal elements and weak minimal solutions of a nonconvex set-valued optimization problem.",
            "Coherent weights for pairwise comparison matrices and a mixed-integer linear programming problem.",
            "A coercivity condition for nonmonotone quasiequilibria on finite-dimensional spaces.",
            "Quasi-equilibrium problems with non-self constraint map.",
            "Trajectory optimization using quantum computing.",
            "Nonconvex min-max fractional quadratic problems under quadratic constraints: copositive relaxations.",
            "A generalized Benders decomposition-based branch and cut algorithm for two-stage stochastic programs with nonconvex constraints and mixed-binary first and second stage variables.",
            "Fractional 0-1 programs: links between mixed-integer linear and conic quadratic formulations.",
            "Discretization-based algorithms for generalized semi-infinite and bilevel programs with coupling equality constraints.",
            "A scalable global optimization algorithm for stochastic nonlinear programs.",
            "A hierarchy of semidefinite relaxations for completely positive tensor optimization problems.",
            "Global supply chain networks and tariff rate quotas: equilibrium analysis with application to agricultural products.",
            "Second order cone constrained convex relaxations for nonconvex quadratically constrained quadratic programming.",
            "Packing ellipses in an optimized convex polygon.",
            "Proximal bundle methods for nonsmooth DC programming.",
            "Tighter McCormick relaxations through subgradient propagation.",
            "A joint decomposition method for global optimization of multiscenario nonconvex mixed-integer nonlinear programs.",
            "Solving pooling problems with time discretization by LP and SOCP relaxations and rescheduling methods.",
            "A new algorithm for concave quadratic programming.",
            "Solving the equality-constrained minimization problem of polynomial functions.",
            "Sharp upper and lower bounds for maximum likelihood solutions to random Gaussian bilateral inequality systems.",
            "On the convergence of the iterates of proximal gradient algorithm with extrapolation for convex nonsmooth minimization problems.",
            "Generalized polyhedral convex optimization problems.",
            "Convergence and correctness of belief propagation for the Chinese postman problem.",
            "Parametric monotone function maximization with matroid constraints.",
            "Systemic risk governance in a dynamical model of a banking system.",
            "A new bounded degree hierarchy with SOCP relaxations for global polynomial optimization and conic convex semi-algebraic programs.",
            "A finite ϵ -convergence algorithm for two-stage stochastic convex nonlinear programs with mixed-binary first and second-stage variables.",
            "A manifold-based approach to sparse global constraint satisfaction problems.",
            "Noisy Euclidean distance matrix completion with a single missing node.",
            "Incremental quasi-subgradient methods for minimizing the sum of quasi-convex functions.",
            "Inexact proximal ϵ -subgradient methods for composite convex optimization problems.",
            "Stability of a convex feasibility problem.",
            "Surrogate-assisted Bounding-Box approach for optimization problems with tunable objectives fidelity.",
            "Online hole healing for sensor coverage.",
            "Approximation algorithm for the partial set multi-cover problem."
        ]
    },
    {
        "name": "JGO",
        "year": "2018",
        "info": "2018: Volumes\n70,\n71,\n72",
        "count": 129,
        "papers": [
            "Preface: Special issue of MOA 2016.",
            "A sparse enhanced indexation model with chance and cardinality constraints.",
            "Optimal replenishment and stocking strategies for inventory mechanism with a dynamically stochastic short-term price discount.",
            "On the stability of solutions for semi-infinite vector optimization problems.",
            "Two-stage convex relaxation approach to low-rank and sparsity regularized least squares loss.",
            "Approximation algorithms for optimization of real-valued general conjugate complex forms.",
            "Distributionally robust chance constrained optimization for economic dispatch in renewable energy integrated systems.",
            "Optimality analysis on partial l1 -minimization recovery.",
            "Argument division based branch-and-bound algorithm for unit-modulus constrained complex quadratic programming.",
            "A computational study of primal heuristics inside an MI(NL)P solver.",
            "Approximation algorithms for the robust/soft-capacitated 2-level facility location problems.",
            "Smoothing partial exact penalty splitting method for mathematical programs with equilibrium constraints.",
            "A quadratic penalty method for hypergraph matching.",
            "Alternating direction method of multipliers for a class of nonconvex bilinear optimization: convergence analysis and applications.",
            "Generalized coefficient strengthening cuts for mixed integer programming.",
            "Preface.",
            "New necessary and sufficient optimality conditions for strong bilevel programming problems.",
            "On an equilibrium problem with complementarity constraints formulation of pay-as-clear electricity market with demand elasticity.",
            "Evaluating the impacts of the external supply risk in a natural gas supply chain: the case of the Italian market.",
            "New extragradient-like algorithms for strongly pseudomonotone variational inequalities.",
            "Inverse problems for quasi-variational inequalities.",
            "Security investment and information sharing in the market of complementary firms: impact of complementarity degree and industry size.",
            "Second-order necessary efficiency conditions for nonsmooth vector equilibrium problems.",
            "Cooperation in pollution control problems via evolutionary variational inequalities.",
            "The Glowinski-Le Tallec splitting method revisited in the framework of equilibrium problems in Hilbert spaces.",
            "An efficient strategy for the activation of MIP relaxations in a multicore global MINLP solver.",
            "A proximal bundle method for constrained nonsmooth nonconvex optimization with inexact information.",
            "Completely positive and completely positive semidefinite tensor relaxations for polynomial optimization.",
            "An accelerated extended cutting plane approach with piecewise linear approximations for signomial geometric programming.",
            "A trajectory-based method for mixed integer nonlinear programming problems.",
            "A Frank-Wolfe based branch-and-bound algorithm for mean-risk optimization.",
            "Order-based error for managing ensembles of surrogates in mesh adaptive direct search.",
            "Partial inverse maximum spanning tree in which weight can only be decreased under lp-norm.",
            "Inertial projection and contraction algorithms for variational inequalities.",
            "Corrections to: Differentiable McCormick relaxations.",
            "How to project onto extended second order cones.",
            "Quadratic convex reformulation for nonconvex binary quadratically constrained quadratic programming via surrogate constraint.",
            "An interleaved depth-first search method for the linear optimization problem with disjunctive constraints.",
            "An adaptive framework for costly black-box global optimization based on radial basis function interpolation.",
            "Simulation optimization of risk measures with adaptive risk levels.",
            "A Utility Theory Based Interactive Approach to Robustness in Linear Optimization.",
            "Tensor maximal correlation problems.",
            "Approximate efficiency and strategy-proofness for moneyless mechanisms on single-dipped policy domain.",
            "Approximate solutions of vector optimization problems via improvement sets in real linear spaces.",
            "Scalarizations for a unified vector optimization problem based on order representing and order preserving properties.",
            "Guest editors' preface to the special issue devoted to the 2nd International Conference \"Numerical Computations: Theory and Algorithms\", June 19-25, 2016, Pizzo Calabro, Italy.",
            "Global optimization based on bisection of rectangles, function values at diagonals, and a set of Lipschitz constants.",
            "Solving a set of global optimization problems by the parallel technique with uniform convergence.",
            "Minimizing nonsmooth DC functions via successive DC piecewise-affine approximations.",
            "Performance of global random search algorithms for large dimensions.",
            "Efficient multicriterial optimization based on intensive reuse of search information.",
            "On a class of bilevel linear mixed-integer programs in adversarial settings.",
            "An algorithm of simplicial Lipschitz optimization with the bi-criteria selection of simplices for the bi-section.",
            "Approximating a solution set of nonlinear inequalities.",
            "Serial-batching group scheduling with release times and the combined effects of deterioration and truncated job-dependent learning.",
            "On convergence rate of a rectangular partition based global optimization algorithm.",
            "GOSH: derivative-free global optimization using multi-dimensional space-filling curves.",
            "Bayesian optimization of pump operations in water distribution systems.",
            "Augmented Lagrangian functions for cone constrained optimization: the existence of global saddle points and exact penalty property.",
            "A modified simplicial algorithm for convex maximization based on an extension of ω-subdivision.",
            "Successive Lagrangian relaxation algorithm for nonconvex quadratic optimization.",
            "\"Optimal\" choice of the step length of the projection and contraction methods for solving the split feasibility problem.",
            "Nash game based efficient global optimization for large-scale design problems.",
            "Hartley properly and super nondominated solutions in vector optimization with a variable ordering structure.",
            "Efficient multiobjective optimization employing Gaussian processes, spectral sampling and a genetic algorithm.",
            "Correction to: Efficient multiobjective optimization employing Gaussian processes, spectral sampling and a genetic algorithm.",
            "Preface to the Special Issue \"GOW'16\".",
            "Testing pseudoconvexity via interval computation.",
            "Extensions on ellipsoid bounds for quadratic integer programming.",
            "lsmear: a variable selection strategy for interval branch and bound solvers.",
            "Feasibility pump for aircraft deconfliction with speed regulation.",
            "Filter-based DIRECT method for constrained global optimization.",
            "Metabolic pathway analysis using a nash equilibrium approach.",
            "Extended trust-region problems with one or two balls: exact copositive and Lagrangian relaxations.",
            "Reformulations for utilizing separability when solving convex MINLP problems.",
            "Integrality gap minimization heuristics for binary mixed integer nonlinear programming.",
            "A sampling-based exact algorithm for the solution of the minimax diameter clustering problem.",
            "Improving the performance and energy of Non-Dominated Sorting for evolutionary multiobjective optimization on GPU/CPU platforms.",
            "In memoriam: Professor Christodoulos A. Floudas (1959-2016).",
            "Piecewise parametric structure in the pooling problem: from sparse strongly-polynomial solutions to NP-hardness.",
            "Global optimization of MIQCPs with dynamic piecewise relaxations.",
            "A symmetry-based splitting strategy for discretizable distance geometry problems.",
            "An edge-concave underestimator for the global optimization of twice-differentiable nonconvex problems.",
            "Convergence-order analysis of branch-and-bound algorithms for constrained problems.",
            "Arbitrarily tight α BB underestimators of general non-linear functions over sub-optimal domains.",
            "Optimization of black-box problems using Smolyak grids and polynomial approximations.",
            "Global optimization algorithm for capacitated multi-facility continuous location-allocation problems.",
            "Optimal deterministic algorithm generation.",
            "A computational study of global optimization solvers on two trust region subproblems.",
            "A customized branch-and-bound approach for irregular shape nesting.",
            "Surrogate-based feasibility analysis for black-box stochastic simulations with heteroscedastic noise.",
            "On solving generalized convex MINLP problems using supporting hyperplane techniques.",
            "Preface: Special issue dedicated to Distance Geometry.",
            "Low-rank matrix completion using nuclear norm minimization and facial reduction.",
            "The minimum distance superset problem: formulations and algorithms.",
            "A new algorithm for the small-field astrometric point-pattern matching problem.",
            "Minimal curvature-constrained networks.",
            "Mixed integer quadratically-constrained programming model to solve the irregular strip packing problem with continuous rotations.",
            "Tuning interval Branch-and-Prune for protein structure determination.",
            "On branching-point selection for trilinear monomials in spatial branch-and-bound: the hull relaxation.",
            "Unifying local-global type properties in vector optimization.",
            "A simplicial homology algorithm for Lipschitz optimisation.",
            "A nonconvex quadratic optimization approach to the maximum edge weight clique problem.",
            "Exploiting algebraic structure in global optimization and the Belgian chocolate problem.",
            "Global optimization of nonconvex problems with convex-transformable intermediates.",
            "Convex envelopes of bivariate functions through the solution of KKT systems.",
            "Decomposition-based Inner- and Outer-Refinement Algorithms for Global Optimization.",
            "MultiGLODS: global and local multiobjective optimization using direct search.",
            "A vector linear programming approach for certain global optimization problems.",
            "Globally solving a class of optimal power flow problems in radial networks by tree reduction.",
            "Bundle-based descent method for nonsmooth multiobjective DC optimization with inequality constraints.",
            "A note on the Douglas-Rachford splitting method for optimization problems involving hypoconvex functions.",
            "Linear convergence of the generalized Douglas-Rachford algorithm for feasibility problems.",
            "On upper approximations of Pareto fronts.",
            "Enhancing quantum efficiency of thin-film silicon solar cells by Pareto optimality.",
            "The fixed charge transportation problem: a strong formulation based on Lagrangian decomposition and column generation.",
            "Optimal channel assignment and L(p, 1)-labeling.",
            "An abstract proximal point algorithm.",
            "Limit vector variational inequality problems via scalarization.",
            "On maximal monotonicity of bifunctions on Hadamard manifolds.",
            "Maximum-entropy sampling and the Boolean quadric polytope.",
            "Equivalences and differences in conic relaxations of combinatorial quadratic optimization problems.",
            "Generalized Lagrangian duality for nonconvex polynomial programs with polynomial multipliers.",
            "Equivalent Lipschitz surrogates for zero-norm and rank optimization problems.",
            "A DC programming approach for solving multicast network design problems via the Nesterov smoothing technique.",
            "Tractability of convex vector optimization problems in the sense of polyhedral approximations.",
            "Variational inequality formulation for the games with random payoffs.",
            "A class of differential hemivariational inequalities in Banach spaces.",
            "Methods to compare expensive stochastic optimization algorithms with random restarts."
        ]
    },
    {
        "name": "JGO",
        "year": "2017",
        "info": "2017: Volumes\n67,\n68,\n69",
        "count": 123,
        "papers": [
            "Preface.",
            "Global optimization of general constrained grey-box models: new method and its application to constrained PDEs for pressure swing adsorption.",
            "Global optimization of non-convex generalized disjunctive programs: a review on reformulations and relaxation techniques.",
            "Bounds tightening based on optimality conditions for nonconvex box-constrained optimization.",
            "ParEGO extensions for multi-objective optimization of expensive evaluation functions.",
            "A Bayesian approach to constrained single- and multi-objective optimization.",
            "Interactive model-based search with reactive resource allocation.",
            "Packing ellipsoids into volume-minimizing rectangular boxes.",
            "On Laplacian spectra of parametric families of closely connected networks with application to cooperative control.",
            "Optimal transport and a bilevel location-allocation problem.",
            "Supply chain performance assessment and supplier and component importance identification in a general competitive multitiered supply chain network model.",
            "Serial-batching scheduling with time-dependent setup time and effects of deterioration and learning on a single-machine.",
            "Dynamic algorithm selection for pareto optimal set approximation.",
            "A diverse human learning optimization algorithm.",
            "A modified active set algorithm for transportation discrete network design bi-level problem.",
            "A Kriging-based constrained global optimization algorithm for expensive black-box functions with infeasible initial points.",
            "Local search algorithm for universal facility location problem with linear penalties.",
            "Some feasibility sampling procedures in interval methods for constrained global optimization.",
            "An efficient multi-objective PSO algorithm assisted by Kriging metamodel for expensive black-box problems.",
            "Application of Reduced-set Pareto-Lipschitzian Optimization to truss optimization.",
            "Enclosure of all index-1 saddle points of general nonlinear functions.",
            "An eigenvalue decomposition based branch-and-bound algorithm for nonconvex quadratic programming problems with convex quadratic constraints.",
            "Analysis of budget for interdiction on multicommodity network flows.",
            "Multiple depot ring star problem: a polyhedral study and an exact algorithm.",
            "Branch and bound algorithm with applications to robust stability.",
            "A coverage-based Box-Algorithm to compute a representation for optimization problems with three objective functions.",
            "Covers and approximations in multiobjective optimization.",
            "A polynomially solvable case of the pooling problem.",
            "Relaxations and discretizations for the pooling problem.",
            "Heuristic solution approaches for the maximum minsum dispersion problem.",
            "Differentiable McCormick relaxations.",
            "Three enhancements for optimization-based bound tightening.",
            "Monomial-wise optimal separable underestimators for mixed-integer polynomial optimization.",
            "On relaxing the integrality of the allocation variables of the reliability fixed-charge location problem.",
            "Robust optimization approximation for joint chance constrained optimization problem.",
            "Bounded Lagrange multiplier rules for general nonsmooth problems and application to mathematical programs with equilibrium constraints.",
            "Improving the convergence rate of the DIRECT global optimization algorithm.",
            "Balancing global and local search in parallel efficient global optimization algorithms.",
            "Default policies for global optimisation of noisy functions with severe noise.",
            "Universal rigidity of bar frameworks via the geometry of spectrahedra.",
            "A branch and bound algorithm for quantified quadratic programming.",
            "Algorithms for art gallery illumination.",
            "A recursive algorithm for multivariate risk measures and a set-valued Bellman's principle.",
            "An approach to generate comprehensive piecewise linear interpolation of pareto outcomes to aid decision making.",
            "Improved logarithmic linearizing method for optimization problems with free-sign pure discrete signomial terms.",
            "Global saddle points of nonlinear augmented Lagrangian functions.",
            "Searching approximate global optimal Heilbronn configurations of nine points in the unit square via GPGPU computing.",
            "Application of the sequential parametric convex approximation method to the design of robust trusses.",
            "Improving simulated annealing through derandomization.",
            "Erratum to: Multivariate McCormick relaxations.",
            "A hybrid discretization algorithm with guaranteed feasibility for the global solution of semi-infinite programs.",
            "Solving discrete linear bilevel optimization problems using the optimal value reformulation.",
            "Measuring centrality and dispersion in directional datasets: the ellipsoidal cone covering approach.",
            "Accelerated parallel and distributed algorithm using limited internal memory for nonnegative matrix factorization.",
            "Matrix product constraints by projection methods.",
            "Self-concordance is NP-hard.",
            "Cubic-regularization counterpart of a variable-norm trust-region method for unconstrained minimization.",
            "Kantorovich's theorem on Newton's method under majorant condition in Riemannian manifolds.",
            "Chebyshev model arithmetic for factorable functions.",
            "Equal Risk Bounding is better than Risk Parity for portfolio selection.",
            "Erratum to: An integer linear programming formulation and heuristics for the minmax relative regret robust shortest path problem.",
            "A nonlinear programming model with implicit variables for packing ellipsoids.",
            "A proximal bundle method for nonsmooth DC optimization utilizing nonconvex cutting planes.",
            "An approximate bundle method for solving nonsmooth equilibrium problems.",
            "Global optimization of non-convex piecewise linear regression splines.",
            "Coradiant sets and ε -efficiency in multiobjective optimization.",
            "The reduction of computation times of upper and lower tolerances for selected combinatorial optimization problems.",
            "Approximation guarantees of algorithms for fractional optimization problems arising in dispatching rules for INDS problems.",
            "Pseudo expected improvement criterion for parallel EGO algorithm.",
            "Decoupling linear and nonlinear regimes: an evaluation of efficiency for nonlinear multidimensional optimization.",
            "A review of computation of mathematically rigorous bounds on optima of linear programs.",
            "Guided dive for the spatial branch-and-bound.",
            "A new global optimization method for a symmetric Lipschitz continuous function and the application to searching for a globally optimal partition of a one-dimensional set.",
            "Deterministic solution approach for some classes of nonlinear multilevel programs with multiple followers.",
            "A new fully polynomial time approximation scheme for the interval subset sum problem.",
            "DC-NMF: nonnegative matrix factorization based on divide-and-conquer for fast clustering and topic modeling.",
            "Parallel machine scheduling with general sum of processing time based models.",
            "Global convergence of proximal iteratively reweighted algorithm.",
            "Kriging surrogate model with coordinate transformation based on likelihood and gradient.",
            "A stochastic production planning problem in hybrid manufacturing and remanufacturing systems with resource capacity planning.",
            "Global probability maximization for a Gaussian bilateral inequality in polynomial time.",
            "Vectorial penalization for generalized functional constrained problems.",
            "Parallel distributed block coordinate descent methods based on pairwise comparison oracle.",
            "Geodesic and contour optimization using conformal mapping.",
            "iGreen: green scheduling for peak demand minimization.",
            "Solving linear optimization over arithmetic constraint formula.",
            "Incorporation of delivery times in stereotactic radiosurgery treatment optimization.",
            "GOSAC: global optimization with surrogate approximation of constraints.",
            "A Lagrangian search method for the P-median problem.",
            "Certificates of infeasibility via nonsmooth optimization.",
            "Strong valid inequalities for Boolean logical pattern generation.",
            "Supply chain network capacity competition with outsourcing: a variational equilibrium framework.",
            "Fractional 0-1 programming: applications and algorithms.",
            "Global optimization of disjunctive programs.",
            "A branch and bound algorithm for nonconvex quadratic optimization with ball and linear constraints.",
            "An exact algorithm for the minimum dilation triangulation problem.",
            "Solving DC programs with a polyhedral component utilizing a multiple objective linear programming solver.",
            "Dual method of centers for solving generalized fractional programs.",
            "A theorem of the alternative with an arbitrary number of inequalities and quadratic programming.",
            "Method for solving generalized convex nonsmooth mixed-integer nonlinear programming problems.",
            "A certified Branch & Bound approach for reliability-based optimization problems.",
            "Decision uncertainty in multiobjective optimization.",
            "Optimality condition and complexity of order-value optimization problems and low order-value optimization problems.",
            "Recent advances on the interval distance geometry problem.",
            "On parallel Branch and Bound frameworks for Global Optimization.",
            "On a smoothed penalty-based algorithm for global optimization.",
            "On unbounded and binary parameters in multi-parametric programming: applications to mixed-integer bilevel optimization and duality theory.",
            "Non-dominated sorting procedure for Pareto dominance ranking on multicore CPU and/or GPU.",
            "The cluster problem in constrained global optimization.",
            "Virtuous smoothing for global optimization.",
            "On nadir points of multiobjective integer programming problems.",
            "Knapsack with variable weights satisfying linear constraints.",
            "A mixed integer programming-based global optimization framework for analyzing gene expression data.",
            "Global optimization for optimal power flow over transmission networks.",
            "Deterministic global optimization of process flowsheets in a reduced space using McCormick relaxations.",
            "Adaptive block coordinate DIRECT algorithm.",
            "Primal or dual strong-duality in nonconvex optimization and a class of quasiconvex problems having zero duality gap.",
            "Posterior exploration based sequential Monte Carlo for global optimization.",
            "On the convergence rate issues of general Markov search for global minimum.",
            "A simple globally convergent algorithm for the nonsmooth nonconvex single source localization problem.",
            "Inverse max + sum spanning tree problem under Hamming distance by modifying the sum-cost vector.",
            "Implementation of Cartesian grids to accelerate Delaunay-based derivative-free optimization.",
            "On some geometric conditions for minimality of DCH-functions via DC-duality approach."
        ]
    },
    {
        "name": "JGO",
        "year": "2016",
        "info": "2016: Volumes\n64,\n65,\n66",
        "count": 120,
        "papers": [
            "Special issue on global optimization with multiple objectives.",
            "On continuation methods for non-linear bi-objective optimization: towards a certified interval-based approach.",
            "Multi objective optimization of computationally expensive multi-modal functions with RBF surrogates and multi-rule selection.",
            "Extracting from the relaxed for large-scale semi-continuous variable nondominated frontiers.",
            "Generation of Pareto optimal solutions using generalized DEA and PSO.",
            "Lower bound sets for biobjective shortest path problems.",
            "A scalarization proximal point method for quasiconvex multiobjective minimization.",
            "Kriging-based infill sampling criterion for constraint handling in multi-objective optimization.",
            "Duality related to approximate proper solutions of vector optimization problems.",
            "Prederivatives of convex set-valued maps and applications to set optimization problems.",
            "A class of shrinking projection extragradient methods for solving non-monotone equilibrium problems in Hilbert spaces.",
            "On ergodic algorithms for equilibrium problems.",
            "Preface: special issue MAGO 2014.",
            "The computational complexity of the pooling problem.",
            "An extension of the αBB-type underestimation to linear parametric Hessian matrices.",
            "Solving a Huff-like Stackelberg location problem on networks.",
            "The extended supporting hyperplane algorithm for convex mixed-integer nonlinear programming.",
            "Design of space thrusters: a topology optimization problem solved via a Branch and Bound method.",
            "Node selection strategies in interval Branch and Bound algorithms.",
            "On refinement of the unit simplex using regular simplices.",
            "Constrained trace-optimization of polynomials in freely noncommuting variables.",
            "Spectrahedral cones generated by rank 1 matrices.",
            "Maximizing the sum of a generalized Rayleigh quotient and another Rayleigh quotient on the unit sphere via semidefinite programming.",
            "Global solutions to nonconvex optimization of 4th-order polynomial and log-sum-exp functions.",
            "A canonical duality approach for the solution of affine quasi-variational inequalities.",
            "A new semi-smooth Newton multigrid method for control-constrained semi-linear elliptic PDE problems.",
            "The robust constant and its applications in random global search for unconstrained global optimization.",
            "Combinatorial approximation algorithms for the robust facility location problem with penalties.",
            "Gradient-constrained discounted Steiner trees I: optimal tree configurations.",
            "Gradient-constrained discounted Steiner trees II: optimally locating a discounted Steiner point.",
            "Second-order necessary optimality conditions for a discrete optimal control problem with mixed constraints.",
            "Eigenvalue analysis of constrained minimization problem for homogeneous polynomial.",
            "Variable-fidelity modeling of structural analysis of assemblies.",
            "Approximate solutions of quasiequilibrium problems in Banach spaces.",
            "Preface.",
            "Non-degenerate necessary optimality conditions for the optimal control problem with equality-type state constraints.",
            "Convexity with respect to families of sections and lines and their application in optimization.",
            "A proximal method with logarithmic barrier for nonlinear complementarity problems.",
            "Generalized Farkas' lemma and gap-free duality for minimax DC optimization with polynomials and robust quadratic optimization.",
            "Solutions of parametric complementarity problems monotone with respect to parameters.",
            "On sufficient optimality conditions for multiobjective control problems.",
            "A branch-and-bound multi-parametric programming approach for non-convex multilevel optimization with polyhedral constraints.",
            "Normalized multiparametric disaggregation: an efficient relaxation for mixed-integer bilinear problems.",
            "A new expected-improvement algorithm for continuous minimax optimization.",
            "Constrained optimization with stochastic feasibility regions applied to vehicle path planning.",
            "Preface.",
            "Saddle point approach to solving problem of optimal control with fixed ends.",
            "A preconditioned block Arnoldi method for large scale Lyapunov and algebraic Riccati equations.",
            "Global optimization approach to Malfatti's problem.",
            "Generalized subdifferentials of the sign change counting function.",
            "Notes on the single route lateral transhipment problem.",
            "Balancing mixed-model assembly lines with sequence-dependent tasks via hybrid genetic algorithm.",
            "Practical exponential set stabilization for switched nonlinear systems with multiple subsystem equilibria.",
            "On global search in nonconvex optimal control problems.",
            "Irregular polyomino tiling via integer programming with application in phased array antenna design.",
            "Semidefinite programming relaxation methods for global optimization problems with sparse polynomials and unbounded semialgebraic feasible sets.",
            "Extended reverse-convex programming: an approximate enumeration approach to global optimization.",
            "Dynamic programming approximation algorithms for the capacitated lot-sizing problem.",
            "Numerical approximation of the solution in infinite dimensional global optimization using a representation formula.",
            "Quasi-phi-functions and optimal packing of ellipses.",
            "Global behavior of the Douglas-Rachford method for a nonconvex feasibility problem.",
            "On Slater's condition and finite convergence of the Douglas-Rachford algorithm for solving convex feasibility problems in Euclidean spaces.",
            "A polynomial-time nearly-optimal algorithm for an edge coloring problem in outerplanar graphs.",
            "Heuristics for exact nonnegative matrix factorization.",
            "Global optimization with spline constraints: a new branch-and-bound method based on B-splines.",
            "Stochastic filter methods for generally constrained global optimization.",
            "Linear and parabolic relaxations for quadratic constraints.",
            "Cumulative weighting optimization.",
            "A sharp Lagrange multiplier theorem for nonlinear programs.",
            "Post factum analysis for robust multiple criteria ranking and sorting.",
            "Existence and generic stability of cooperative equilibria for multi-leader-multi-follower games.",
            "Functional inequalities, regularity and computation of the deficit and surplus variables in the financial equilibrium problem.",
            "A relaxed-projection splitting algorithm for variational inequalities in Hilbert spaces.",
            "Coderivatives of implicit multifunctions and stability of variational systems.",
            "Non polyhedral convex envelopes for 1-convex functions.",
            "Projection algorithms for nonconvex minimization with application to sparse principal component analysis.",
            "A stabilized filter SQP algorithm for nonlinear programming.",
            "Packing ellipsoids by nonlinear optimization.",
            "Bandwidth packing problem with queueing delays: modelling and exact solution approach.",
            "Algorithms for the two-stage production-capacitated lot-sizing problem.",
            "Algorithms for the partial inverse matroid problem in which weights can only be increased.",
            "A biased random-key genetic algorithm to maximize the number of accepted lightpaths in WDM optical networks.",
            "Interval Branch-and-Bound algorithms for optimization and constraint satisfaction: a survey and prospects.",
            "Special Issue: XVI Baikal International School-Seminar <<Optimization Methods and Their Applications>>.",
            "Parallel global optimization on GPU.",
            "On numerical solving the spherical separability problem.",
            "Adaptive nested optimization scheme for multidimensional global search.",
            "The method of uniform monotonous approximation of the reachable set border for a controllable system.",
            "Approximability of the minimum-weight k-size cycle cover problem.",
            "Discrete-continuous optimization of heat network operating conditions in parallel operation of similar pumps at pumping stations.",
            "Single-projection procedure for linear optimization.",
            "Maximum consistency method for data fitting under interval uncertainty.",
            "An implementation of exact knapsack separation.",
            "Preface.",
            "On the quadratic eigenvalue complementarity problem.",
            "Surrogate-RLT cuts for zero-one integer programs.",
            "On the integration of row and column uncertainty in robust linear programming.",
            "A class of algorithms for mixed-integer bilevel min-max optimization.",
            "Two-stage, single-lot, lot streaming problem for a 1 + 2 hybrid flow shop.",
            "Optimizing assortment and pricing of multiple retail categories with cross-selling.",
            "Convex hull characterizations of lexicographic orderings.",
            "Delaunay-based derivative-free optimization via global surrogates, part I: linear constraints.",
            "Delaunay-based derivative-free optimization via global surrogates, part II: convex constraints.",
            "SOP: parallel surrogate global optimization with Pareto center selection for computationally expensive single objective problems.",
            "Sufficient conditions for error bounds of difference functions and applications.",
            "A block coordinate variable metric forward-backward algorithm.",
            "Smoothing and SAA method for stochastic programming problems with non-smooth objective and constraints.",
            "Global versus local search: the impact of population sizes on evolutionary algorithm performance.",
            "An optimal algorithm for Global Optimization and adaptive covering.",
            "A primal-dual prediction-correction algorithm for saddle point optimization.",
            "The Lyapunov rank of extended second order cones.",
            "Journal of Global Optimization Best Paper Award for 2015.",
            "Convergence analysis of multivariate McCormick relaxations.",
            "Polyhedral subdivisions and functional forms for the convex envelopes of bilinear, fractional and other bivariate functions over general polytopes.",
            "New multi-commodity flow formulations for the pooling problem.",
            "Solving infinite horizon optimization problems through analysis of a one-dimensional global optimization problem.",
            "MONEDA: scalable multi-objective optimization with a neural network-based estimation of distribution algorithm.",
            "Scatter search for the bandpass problem.",
            "Gap functions for quasi-equilibria.",
            "MSO: a framework for bound-constrained black-box global optimization algorithms."
        ]
    },
    {
        "name": "JGO",
        "year": "2015",
        "info": "2015: Volumes\n61,\n62,\n63",
        "count": 127,
        "papers": [
            "Global optimization of generalized semi-infinite programs via restriction of the right hand side.",
            "Efficient random coordinate descent algorithms for large-scale structured nonconvex optimization.",
            "Global optimization by multilevel partition.",
            "Solving DC programs using the cutting angle method.",
            "Pareto-optimal front of cell formation problem in group technology.",
            "Analytical characterizations of some classes of optimal strongly attack-tolerant networks and their Laplacian spectra.",
            "Truss topology optimization with discrete design variables by outer approximation.",
            "Inverse Max + Sum spanning tree problem by modifying the sum-cost vector under weighted l∞ Norm.",
            "Matrix-power energy-landscape transformation for finding NP-hard spin-glass ground states.",
            "A hybrid method without extrapolation step for solving variational inequality problems.",
            "A convergent conical algorithm with $$\\omega $$ ω -bisection for concave minimization.",
            "Parametric Lagrangian dual for the binary quadratic programming problem.",
            "On the efficient Gerschgorin inclusion usage in the global optimization αBB method.",
            "Rigorous verification of feasibility.",
            "On minimal representations by a family of sublinear functions.",
            "Exact solution approach for a class of nonlinear bilevel knapsack problems.",
            "Global minimization of the difference of strictly non-positive valued affine ICR functions.",
            "Gradient-free method for nonsmooth distributed optimization.",
            "A heuristic algorithm for solving the minimum sum-of-squares clustering problems.",
            "Lipschitz continuity of the optimal value function in parametric optimization.",
            "On the coderivative of the solution mapping to a second-order cone constrained parametric variational inequality.",
            "Existence and stability of weakly Pareto-Nash equilibrium for generalized multiobjective multi-leader-follower games.",
            "A new mathematical approach for handling DVH criteria in IMRT planning.",
            "Branching and bounding improvements for global optimization algorithms with Lipschitz continuity properties.",
            "Conic approximation to nonconvex quadratic programming with convex quadratic constraints.",
            "Interactive model-based search for global optimization.",
            "Optimal clustering of a pair of irregular objects.",
            "Scalarization in set optimization with solid and nonsolid ordering cones.",
            "Convergence analysis of inexact proximal point algorithms on Hadamard manifolds.",
            "Characterizations of efficient and weakly efficient points in nonconvex vector optimization.",
            "History-dependent mixed variational problems in contact mechanics.",
            "On an extension of Pólya's Positivstellensatz.",
            "A quadratically convergent algorithm for finding the largest eigenvalue of a nonnegative homogeneous polynomial map.",
            "A linear bound on the number of scalarizations needed to solve discrete tricriteria optimization problems.",
            "A multiobjective optimization based framework to balance the global exploration and local exploitation in expensive optimization.",
            "Sufficient optimality criteria and duality for multiobjective variational control problems with G-type I objective and constraint functions.",
            "Efficient upper and lower bounds for global mixed-integer optimal control.",
            "On set-valued optimization problems with variable ordering structure.",
            "Necessary optimality conditions for optimistic bilevel programming problems using set-valued programming.",
            "Some equivalence results for well-posedness of hemivariational inequalities.",
            "(ϵ-)Efficiency in difference vector optimization.",
            "GLODS: Global and Local Optimization using Direct Search.",
            "The robust crew pairing problem: model and solution methodology.",
            "Finding nadir points in multi-objective integer programs.",
            "Computing the nadir point for multiobjective discrete optimization problems.",
            "A preference-based evolutionary algorithm for multiobjective optimization: the weighting achievement scalarizing function genetic algorithm.",
            "An information guided framework for simulated annealing.",
            "Existence and characterization theorems in nonconvex vector optimization.",
            "Reduction of state dependent sweeping process to unconstrained differential inclusion.",
            "D-gap functions and descent techniques for solving equilibrium problems.",
            "MrDIRECT: a multilevel robust DIRECT algorithm for global optimization problems.",
            "Some observations on exclusion regions in branch and bound algorithms.",
            "PAINT-SiCon: constructing consistent parametric representations of Pareto sets in nonconvex multiobjective optimization.",
            "An algorithm for global solution to bi-parametric linear complementarity constrained linear programs.",
            "Complementarity problems with respect to Loewnerian cones.",
            "Finding sparse solutions of systems of polynomial equations via group-sparsity optimization.",
            "Fast algorithms for the minimum volume estimator.",
            "Locating a median line with partial coverage distance.",
            "Maximizing the net present value of a Steiner tree.",
            "A note on the complexity of scheduling problems with linear job deterioration.",
            "Projective dualities for quasiconvex problems.",
            "Characterizations of the solution set for quasiconvex programming in terms of Greenberg-Pierskalla subdifferential.",
            "Extended Lorentz cones and mixed complementarity problems.",
            "On the existence of saddle points for nonlinear second-order cone programming problems.",
            "Optimization over the Pareto outcome set associated with a convex bi-objective optimization problem: theoretical results, deterministic algorithm and application to the stochastic case.",
            "Optimal curvature and gradient-constrained directional cost paths in 3-space.",
            "Heuristic rating estimation: geometric approach.",
            "SymNMF: nonnegative low-rank approximation of a similarity matrix for graph clustering.",
            "Unified framework for the propagation of continuous-time enclosures for parametric nonlinear ODEs.",
            "Special issue on \"optimization and optimal control with applications\" for the 9th international conference on optimization: techniques and applications (9th ICOTA), December 12-16, 2013, Taipei, Taiwan.",
            "Global optimality conditions and optimization methods for polynomial programming problems.",
            "Duality and robust duality for special nonconvex homogeneous quadratic programming under certainty and uncertainty environment.",
            "A polynomial case of convex integer quadratic programming problems with box integer constraints.",
            "Smoothing augmented Lagrangian method for nonsmooth constrained optimization problems.",
            "A new alternating direction method for linearly constrained nonconvex optimization problems.",
            "A proximal alternating direction method of multipliers for a minimization problem with nonconvex constraints.",
            "A box-constrained differentiable penalty method for nonlinear complementarity problems.",
            "Erratum to: A box-constrained differentiable penalty method for nonlinear complementarity problems.",
            "Norm descent conjugate gradient methods for solving symmetric nonlinear equations.",
            "Scalarization and pointwise well-posedness for set optimization problems.",
            "A penalty approach to a discretized double obstacle problem with derivative constraints.",
            "Parameter identification for a nonlinear enzyme-catalytic dynamic system with time-delays.",
            "On optimal low rank Tucker approximation for tensors: the case for an adjustable core size.",
            "The retailer's optimal decision on order quantity and credit periods under two-level trade credit policy.",
            "Fast algorithm for color texture image inpainting using the non-local CTV model.",
            "Some interesting properties for zero-forcing beamforming under per-antenna power constraints in rural areas.",
            "Reverse propagation of McCormick relaxations.",
            "Analysis of copositive optimization based linear programming bounds on standard quadratic optimization.",
            "A homotopy method based on penalty function for nonlinear semidefinite programming.",
            "Second-order conditions for existence of augmented Lagrange multipliers for eigenvalue composite optimization problems.",
            "Maximizing and minimizing quasiconvex functions: related properties, existence and optimality conditions via radial epiderivatives.",
            "Population model-based optimization.",
            "Constrained shortest path with uncertain transit times.",
            "On power penalty methods for linear complementarity problems arising from American option pricing.",
            "Nonemptiness and boundedness of solution sets for vector variational inequalities via topological method.",
            "Existence results for vector equilibrium problems given by a sum of two functions.",
            "Convex mixed integer nonlinear programming problems and an outer approximation algorithm.",
            "Global optimization of expensive black box functions using potential Lipschitz constants and response surfaces.",
            "First order necessary optimality conditions for mathematical programs with second-order cone complementarity constraints.",
            "Semi-continuous quadratic optimization: existence conditions and duality scheme.",
            "Augmented Lagrangian methods for nonlinear programming with possible infeasibility.",
            "Separable cubic modeling and a trust-region strategy for unconstrained minimization with impact in global optimization.",
            "Smaller SDP for SOS decomposition.",
            "The Douglas-Rachford algorithm for the case of the sphere and the line.",
            "Confidence in heuristic solutions?",
            "Optimal learning with a local parametric belief model.",
            "New heuristic for harmonic means clustering.",
            "An exact method for the discrete (r|p)-centroid problem.",
            "A variable neighborhood search algorithm for the multimode set covering problem.",
            "Fitting censored quantile regression by variable neighborhood search.",
            "Solving the planar p-median problem by variable neighborhood and concentric searches.",
            "Multi-objective variable neighborhood search: an application to combinatorial optimization problems.",
            "Solving large p-median problems by a multistage hybrid approach using demand points aggregation and variable neighbourhood search.",
            "A hybrid method based on linear programming and variable neighborhood descent for scheduling production in open-pit mines.",
            "A VNS metaheuristic for solving the aircraft conflict detection and resolution problem by performing turn changes.",
            "PILOT, GRASP, and VNS approaches for the static balancing of bicycle sharing systems.",
            "Journal of Global Optimization Best Paper Award for a paper published in 2014.",
            "A new preference handling technique for interactive multiobjective optimization without trading-off.",
            "Interiors of completely positive cones.",
            "Island models for cluster geometry optimization: how design options impact effectiveness and diversity.",
            "A new regularized limited memory BFGS-type method based on modified secant conditions for unconstrained optimization problems.",
            "A Branch-and-Cut algorithm for factory crane scheduling problem.",
            "A natural extension of the classical envelope theorem in vector differential programming.",
            "Higher-order metric subregularity and its applications.",
            "A proximal point algorithm for DC fuctions on Hadamard manifolds.",
            "The H-differentiability and calmness of circular cone functions.",
            "Optimal control problems with stopping constraints."
        ]
    },
    {
        "name": "JGO",
        "year": "2014",
        "info": "2014: Volumes\n58,\n59,\n60",
        "count": 128,
        "papers": [
            "Global optimization of bounded factorable functions with discontinuities.",
            "Global optimality principles for polynomial optimization over box or bivalent constraints by separable polynomial approximations.",
            "A new class of exact penalty functions and penalty algorithms.",
            "Evolutionary annealing: global optimization in measure spaces.",
            "An entire space polynomial-time algorithm for linear programming.",
            "Interior-point algorithms for P*κ -LCP based on a new class of kernel functions.",
            "A smoothing homotopy method for variational inequality problems on polyhedral convex sets.",
            "On proximal gradient method for the convex problems regularized with the group reproducing kernel norm.",
            "On the exhaustivity of simplicial partitioning.",
            "Journal of Global Optimization Best Paper Award for a paper published in 2012.",
            "Augmented Lagrangians with possible infeasibility and finite termination for global nonlinear programming.",
            "Existence of augmented Lagrange multipliers for cone constrained optimization problems.",
            "Minimizing rational functions by exact Jacobian SDP relaxation applicable to finite singularities.",
            "Algorithms for nonnegative matrix and tensor factorizations: a unified view based on block coordinate descent framework.",
            "Equilibrium problems involving the Lorentz cone.",
            "Modified projection method for strongly pseudomonotone variational inequalities.",
            "Generalized second-order contingent epiderivatives in parametric vector optimization problems.",
            "Abstract convexity of topical functions.",
            "Online pricing for bundles of multiple items.",
            "High-order moments conservation in thermostatted kinetic models.",
            "Construction of error-tolerance pooling designs in symplectic spaces.",
            "New methods for calculating α BB-type underestimators.",
            "The cluster problem revisited.",
            "A continuous characterization of the maximum-edge biclique problem.",
            "A Semidefinite Programming approach for solving Multiobjective Linear Programming.",
            "Problems with resource allocation constraints and optimization over the efficient set.",
            "A black-box scatter search for optimization problems with integer variables.",
            "Optimal learning for sequential sampling with non-parametric beliefs.",
            "Invariant-point theorems and existence of solutions to optimization-related problems.",
            "Strongly nonlinear multivalued elliptic equations on a bounded domain.",
            "Mordukhovich subgradients of the value function to a parametric discrete optimal control problem.",
            "Aircraft deconfliction with speed regulation: new models from mixed-integer optimization.",
            "Efficient computation of spectral bounds for Hessian matrices on hyperrectangles for global optimization.",
            "First order rejection tests for multiple-objective optimization.",
            "Second-order Karush-Kuhn-Tucker optimality conditions for set-valued optimization.",
            "Higher-order optimality conditions for proper efficiency in nonsmooth vector optimization using radial sets and radial derivatives.",
            "An objective space cut and bound algorithm for convex multiplicative programmes.",
            "An illumination problem: optimal apex and optimal orientation for a cone of light.",
            "Vector quasi-equilibrium problems: separation, saddle points and error bounds for the solution set.",
            "Memetic algorithms and hyperheuristics applied to a multiobjectivised two-dimensional packing problem.",
            "Carbon tax based on the emission factor: a bilevel programming approach.",
            "Speeding up branch and bound algorithms for solving the maximum clique problem.",
            "Simplicial Lipschitz optimization without the Lipschitz constant.",
            "Multiobjective DC programs with infinite convex constraints.",
            "Path-following gradient-based decomposition algorithms for separable convex optimization.",
            "A full-Newton step feasible interior-point algorithm for $$P_*(\\kappa )$$ P ∗ ( κ ) -linear complementarity problems.",
            "Subdifferential test for optimality.",
            "Order statistics and region-based evolutionary computation.",
            "On penalty methods for non monotone equilibrium problems.",
            "Stability for trust-region methods via generalized differentiation.",
            "On the stability of the linear functional equation in a single variable on complete metric groups.",
            "Projected viscosity subgradient methods for variational inequalities with equilibrium problem constraints in Hilbert spaces.",
            "Levitin-Polyak well-posedness for constrained quasiconvex vector optimization problems.",
            "Preface: Honoring the 60th birthday of Panos M. Pardalos.",
            "Globally convergent DC trust-region methods.",
            "Lattice preconditioning for the real relaxation branch-and-bound approach for integer least squares problems.",
            "Rounding on the standard simplex: regular grids for global optimization.",
            "PAVER 2.0: an open source environment for automated performance analysis of benchmarking data.",
            "Optimality-based bound contraction with multiparametric disaggregation for the global optimization of mixed-integer bilinear problems.",
            "On the computation of all eigenvalues for the eigenvalue complementarity problem.",
            "Error estimation in nonlinear optimization.",
            "Linearization-based algorithms for mixed-integer nonlinear programs with convex continuous relaxation.",
            "A fully general, exact algorithm for nesting irregular shapes.",
            "Cutting ellipses from area-minimizing rectangles.",
            "Sparse optimization in feature selection: application in neuroimaging.",
            "On rigorous upper bounds to a global optimum.",
            "A technique to derive the analytical form of convex envelopes for some bivariate functions.",
            "ANTIGONE: Algorithms for coNTinuous / Integer Global Optimization of Nonlinear Equations.",
            "A branch and bound method for the solution of multiparametric mixed integer linear programming problems.",
            "Globally-biased Disimpl algorithm for expensive global optimization.",
            "Exclusion regions for optimization problems.",
            "Models and solution techniques for production planning problems with increasing byproducts.",
            "Multivariate McCormick relaxations.",
            "Minimum vertex cover in ball graphs through local search.",
            "Global optimization of general nonconvex problems with intermediate polynomial substructures.",
            "Nonlinear separation approach for the augmented Lagrangian in nonlinear semidefinite programming.",
            "A solution method for linear variational relation problems.",
            "On efficiency and mixed duality for a new class of nonconvex multiobjective variational control problems.",
            "Level bundle-like algorithms for convex optimization.",
            "Benson type algorithms for linear vector optimization and applications.",
            "Functional inequalities and theorems of the alternative involving composite functions.",
            "SO-I: a surrogate model algorithm for expensive nonlinear integer programming problems including global optimization applications.",
            "Preface of the special issue OR: connecting sciences supported by global optimization related to the 25th European conference on operational research (EURO XXV 2012).",
            "New and efficient algorithms for transfer prices and inventory holding policies in two-enterprise supply chains.",
            "Local reduction based SQP-type method for semi-infinite programs with an infinite number of second-order cone constraints.",
            "A hyperbolic smoothing approach to the Multisource Weber problem.",
            "A numerical method for pricing European options with proportional transaction costs.",
            "Restructuring forward step of MARS algorithm using a new knot selection procedure based on a mapping approach.",
            "Efficient adaptive regression spline algorithms based on mapping approach with a case study on finance.",
            "Global optimization workshop 2012.",
            "Influence of ensemble surrogate models and sampling strategy on the solution quality of algorithms for computationally expensive black-box global optimization problems.",
            "Upper bounding in inner regions for global optimization under inequality constraints.",
            "Column generation bounds for numerical microaggregation.",
            "Stabilizer-based symmetry breaking constraints for mathematical programs.",
            "Modeling and solving the bi-objective minimum diameter-cost spanning tree problem.",
            "Extended formulations for convex envelopes.",
            "A filter-based artificial fish swarm algorithm for constrained global optimization: theoretical and practical issues.",
            "An integer linear programming formulation and heuristics for the minmax relative regret robust shortest path problem.",
            "Finding multiple roots of a box-constrained system of nonlinear equations with a biased random-key genetic algorithm.",
            "Optimal rank-sparsity decomposition.",
            "A new hybrid classical-quantum algorithm for continuous global optimization problems.",
            "Discretization orders for protein side chains.",
            "Turning restriction design in traffic networks with a budget constraint.",
            "Integrating nonlinear branch-and-bound and outer approximation for convex Mixed Integer Nonlinear Programming.",
            "Vladimir Fedorovich Demyanov (18.08.1938-18.04.2014).",
            "Handelman's hierarchy for the maximum stable set problem.",
            "Branch-and-Sandwich: a deterministic global optimization algorithm for optimistic bilevel programming problems. Part I: Theoretical development.",
            "Branch-and-Sandwich: a deterministic global optimization algorithm for optimistic bilevel programming problems. Part II: Convergence analysis and numerical results.",
            "A modified DIRECT algorithm with bilevel partition.",
            "Interior Epigraph Directions method for nonsmooth and nonconvex optimization via generalized augmented Lagrangian duality.",
            "A penalty approximation method for a semilinear parabolic double obstacle problem.",
            "A study of singular spectrum analysis with global optimization techniques.",
            "Fast calculation of multiobjective probability of improvement and expected improvement criteria for Pareto optimization.",
            "Ya. D. Sergeyev, R. G. Strongin and D. Lera: Introduction to global optimization exploiting space-filling curves - Springer briefs in optimization, Springer, 2013, 131 pp, USD 40, £ 30.",
            "Journal of Global Optimization Best Paper Award for a paper published in 2013.",
            "On cyclic and n-cyclic monotonicity of bifunctions.",
            "Hybrid methods with regularization for minimization problems and asymptotically strict pseudocontractive mappings in the intermediate sense.",
            "Motzkin predecomposable sets.",
            "A parametric solution algorithm for a class of rank-two nonconvex programs.",
            "Risk-control approach for bottleneck transportation problem with randomness and fuzziness.",
            "Existence theorem for a class of generalized quasi-variational inequalities.",
            "Properly optimal elements in vector optimization with variable ordering structures.",
            "Primal and dual approximation algorithms for convex vector optimization problems.",
            "Optimal control of impulsive switched systems with minimum subsystem durations.",
            "Bound constrained interval global optimization in the COCONUT Environment.",
            "Minimum total coloring of planar graph.",
            "Note on coloring of double disk graphs.",
            "R. Paulavičius and J. Žilinskas: Simplicial global optimization - Springer briefs in optimization, Springer, 2014, 137 pp, pg USD 40, £36."
        ]
    },
    {
        "name": "JGO",
        "year": "2013",
        "info": "2013: Volumes\n55,\n56,\n57",
        "count": 232,
        "papers": [
            "Journal of global optimization: continuing the tradition of excellence.",
            "Comments from the departing editor.",
            "On efficient applications of G-Karush-Kuhn-Tucker necessary optimality theorems to multiobjective programming problems.",
            "Approximation algorithm for a class of global optimization problems.",
            "Existence theorems for generalized set-valued mixed (quasi-)variational inequalities in Banach spaces.",
            "Optimization methodology assessment for the inlet velocity profile of a hydraulic turbine draft tube: part I - computer optimization techniques.",
            "Differential evolution for dynamic environments with unknown numbers of optima.",
            "Sequential Monte Carlo simulated annealing.",
            "Second-order multiobjective symmetric duality involving cone-bonvex functions.",
            "Fenchel decomposition for stochastic mixed-integer programming.",
            "A multi-start opposition-based particle swarm optimization algorithm with adaptive velocity for bound constrained global optimization.",
            "Well-posedness for generalized quasi-variational inclusion problems and for optimization problems with constraints.",
            "Robust solutions of quadratic optimization over single quadratic constraint under interval uncertainty.",
            "Multi-parametric disaggregation technique for global optimization of polynomial programming problems.",
            "On existence and essential components for solution set for system of strong vector quasi-equilibrium problems.",
            "A dual algorithm for the minimum covering weighted ball problem in $${\\mathbb{R}^n}$$.",
            "A global optimization point of view to handle non-standard object packing problems.",
            "Monotonic optimization based decoding for linear codes.",
            "Simultaneous kriging-based estimation and optimization of mean response.",
            "Convergence of Pham Dinh-Le Thi's algorithm for the trust-region subproblem.",
            "A new dynamic programming procedure for three-staged cutting patterns.",
            "A smoothing Newton method for mathematical programs governed by second-order cone constrained generalized equations.",
            "Optimal measures and Markov transition kernels.",
            "The general iterative methods for nonexpansive semigroups in Banach spaces.",
            "Modified extragradient methods for variational inequality problems and fixed point problems for an infinite family of nonexpansive mappings in Banach spaces.",
            "Multi-objective optimization by learning automata.",
            "2012 Journal of Global Optimization best paper award.",
            "Branch-and-bound algorithms for the partial inverse mixed integer linear programming problem.",
            "Asymptotic analysis in convex composite multiobjective optimization problems.",
            "Abstract convexity of radiant functions with applications.",
            "Some constraint qualifications for quasiconvex vector-valued systems.",
            "Weighted inverse maximum perfect matching problems under the Hamming distance.",
            "A new necessary and sufficient global optimality condition for canonical DC problems.",
            "New fitness sharing approach for multi-objective genetic algorithms.",
            "Continuity of the solution mappings to parametric generalized strong vector equilibrium problems.",
            "Characterizations of the nonemptiness and compactness for solution sets of convex set-valued optimization problems.",
            "A note on the core.",
            "Markov chains, Hamiltonian cycles and volumes of convex bodies.",
            "A decision tool for optimal irrigated crop planning and water resources sustainability.",
            "A particle swarm optimization for solving lot-sizing problem with fluctuating demand and preservation technology cost under trade credit.",
            "A framework for optimization under limited information.",
            "Worst-case global optimization of black-box functions through Kriging and relaxation.",
            "Optimization methodology assessment for the inlet velocity profile of a hydraulic turbine draft tube: part II - performance evaluation of draft tube model.",
            "On the Brézis Nirenberg Stampacchia-type theorems and their applications.",
            "Improving differential evolution through a unified approach.",
            "Two-step projection methods for a system of variational inequality problems in Banach spaces.",
            "Semi-infinite programming method for optimal power flow with transient stability and variable clearing time of faults.",
            "Strong convergence of a regularization method for Rockafellar's proximal point algorithm.",
            "Generalized strong vector quasi-equilibrium problem with domination structure.",
            "A linear time approximation scheme for computing geometric maximum k-star.",
            "Setting targets for surrogate-based optimization.",
            "Inexact solution of NLP subproblems in MINLP.",
            "First and second-order optimality conditions using approximations for vector equilibrium problems with constraints.",
            "Convex underestimators of polynomials.",
            "From approximate balls to approximate ellipses.",
            "An extension of the proximal point algorithm with Bregman distances on Hadamard manifolds.",
            "New horizons in sphere-packing theory, part II: lattice-based derivative-free optimization via global surrogates.",
            "Optimising a nonlinear utility function in multi-objective integer programming.",
            "Antiplane shear deformation of piezoelectric bodies in contact with a conductive support.",
            "A supplement to a regularization method for the proximal point algorithm.",
            "Portfolio selection under model uncertainty: a penalized moment-based optimization approach.",
            "Weak and strong convergence theorems for asymptotically pseudo-contraction mappings in the intermediate sense in Hilbert spaces.",
            "From simulated annealing to stochastic continuation: a new trend in combinatorial optimization.",
            "Preface: Special issue of JOGO MEC EurOPT 2010-Izmir.",
            "Self-learning K-means clustering: a global optimization approach.",
            "The new robust conic GPLM method with an application to finance: prediction of credit default.",
            "Global stabilization in nonlinear discrete systems with time-delay.",
            "A hybrid global optimization algorithm for non-linear least squares regression.",
            "A conic scalarization method in multi-objective optimization.",
            "Optimality conditions for a unified vector optimization problem with not necessarily preordering relations.",
            "Exact null controllability of semilinear evolution systems.",
            "A globalized Newton method for the computation of normalized Nash equilibria.",
            "The maximum principle for the nonlinear stochastic optimal control problem of switching systems.",
            "Development and calibration of a currency trading strategy using global optimization.",
            "A new class of hybrid extragradient algorithms for solving quasi-equilibrium problems.",
            "Multiple critical points for non-differentiable parametrized functionals and applications to differential inclusions.",
            "Lagrange multiplier rules for non-differentiable DC generalized semi-infinite programming problems.",
            "Lipschitz behavior of solutions to nonconvex semi-infinite vector optimization problems.",
            "PTAS for the minimum k-path connected vertex cover problem in unit disk graphs.",
            "A continuation approach to mode-finding of multivariate Gaussian mixtures and kernel density estimates.",
            "Necessary optimality conditions for a set-valued fractional extremal programming problem under inclusion constraints.",
            "Optimal discrete-valued control computation.",
            "Higher-order optimality conditions in set-valued optimization using radial sets and radial derivatives.",
            "Deterministic global optimization in ab-initio quantum chemistry.",
            "Maximum lifetime connected coverage with two active-phase sensors.",
            "Proper and adjoint exhausters in nonsmooth analysis: optimality conditions.",
            "Calculus of tangent sets and derivatives of set-valued maps under metric subregularity conditions.",
            "Existence theorems of the variational-hemivariational inequalities.",
            "A generalized f-projection method for countable families of weak relatively nonexpansive mappings and the system of generalized Ky Fan inequalities.",
            "Mixed generalized quasi-equilibrium problems.",
            "Efficient global optimization algorithm assisted by multiple surrogate techniques.",
            "Exactness and algorithm of an objective penalty function.",
            "Generic uniqueness theorems with some applications.",
            "Handelman rank of zero-diagonal quadratic programs over a hypercube and its applications.",
            "Modeling optimal social choice: matrix-vector representation of various solution concepts based on majority rule.",
            "Toulouse Global optimization Workshop 2010 (TOGO10).",
            "When only global optimization matters.",
            "A general framework for convexity analysis in deterministic global optimization.",
            "Bound reduction using pairs of linear inequalities.",
            "On estimating workload in interval branch-and-bound global optimization algorithms.",
            "Global convergence and the Powell singular function.",
            "The interval Branch-and-Prune algorithm for the discretizable molecular distance geometry problem with inexact distances.",
            "A light-propagation model for aircraft trajectory planning.",
            "Strong formulations for the pooling problem.",
            "A multi-commodity flow formulation for the generalized pooling problem.",
            "Large-scale standard pooling problems with constrained pools and fixed demands.",
            "On the minimum volume simplex enclosure problem for estimating a linear mixing model.",
            "On a continuous approach for the maximum weighted clique problem.",
            "A two-level evolutionary algorithm for solving the facility location and design (1|1)-centroid problem on the plane with variable demand.",
            "Maximal perimeter, diameter and area of equilateral unit-width convex polygons.",
            "Finding largest small polygons with GloptiPoly.",
            "A global optimization algorithm for solving the minimum multiple ratio spanning tree problem.",
            "Generalized S-Lemma and strong duality in nonconvex quadratic programming.",
            "Correlative sparsity structures and semidefinite relaxations for concave cost transportation problems with change of variables.",
            "On interval branch-and-bound for additively separable functions with common variables.",
            "Branch-reduction-bound algorithm for generalized geometric programming.",
            "DIS-CARD: a new method of multiple criteria sorting to classes with desired cardinality.",
            "Increasing the attraction area of the global minimum in the binary optimization problem.",
            "Packing non-identical circles within a rectangle with open length.",
            "Constrained derivative-free optimization on thin domains.",
            "Linear scaling and the DIRECT algorithm.",
            "Derivative-free optimization: a review of algorithms and comparison of software implementations.",
            "Preface: Special issue of Journal of Global Optimization for the 8th international conference on optimization: techniques and applications.",
            "Establishing Nash equilibrium of the manufacturer-supplier game in supply chain management.",
            "Convergence analysis of power penalty method for American bond option pricing.",
            "A cross-monotonic cost-sharing scheme for the concave facility location game.",
            "On a generalized Cournot oligopolistic competition game.",
            "A pair of positive solutions for the Dirichlet p(z)-Laplacian with concave and convex nonlinearities.",
            "An adaptive domain decomposition method for the Hamilton-Jacobi-Bellman equation.",
            "System modeling and performance analysis of the power saving class type II in BWA networks.",
            "Binary classification via spherical separator by DC programming and DCA.",
            "Convex relaxations and MIQCQP reformulations for a class of cardinality-constrained portfolio selection problems.",
            "On the determinant and its derivatives of the rank-one corrected generator of a Markov chain on a graph.",
            "A polynomial case of the cardinality-constrained quadratic optimization problem.",
            "A note on a selfish bin packing problem.",
            "Approximate KKT points and a proximity measure for termination.",
            "Convergence of a class of penalty methods for constrained scalar set-valued optimization.",
            "Continuity of the solution mapping to parametric generalized vector equilibrium problems.",
            "Strong convergence theorems for variational inequality problems and fixed point problems in uniformly smooth and uniformly convex Banach spaces.",
            "A new iterative scheme for fixed point problems of infinite family of κ i -pseudo contractive mappings, equilibrium problem, variational inequality problems.",
            "An iterative algorithm for common fixed points for nonexpansive semigroups and strictly pseudo-contractive mappings with optimization problems.",
            "Halpern's type iterations with perturbations in Hilbert spaces: equilibrium solutions and fixed points.",
            "Efficient Nash equilibria on semilattices.",
            "Hadamard well-posedness of a general mixed variational inequality in Banach space.",
            "Strong convergence theorems for approximating common fixed points of families of nonexpansive mappings and applications.",
            "Constant-approximation for optimal data aggregation with physical interference.",
            "Best proximity point theorems for cyclic strongly quasi-contraction mappings.",
            "Strong convergence theorem for nonexpansive semigroups and systems of equilibrium problems.",
            "On Olaleru's open problem on Gregus fixed point theorem.",
            "Best proximity point theorems: exposition of a significant non-linear programming problem.",
            "Filippov-Pliss lemma and m-dissipative differential inclusions.",
            "A quasi-multistart framework for global optimization of expensive functions using response surface models.",
            "An extension of the Basic Constraint Qualification to nonconvex vector optimization problems.",
            "Examples of inconsistency in optimization by expected improvement.",
            "A branch and bound algorithm for the global optimization of Hessian Lipschitz continuous functions.",
            "Preface.",
            "GloMIQO: Global mixed-integer quadratic optimizer.",
            "On the global solution of multi-parametric mixed integer linear programming problems.",
            "Convergence analysis of Taylor models and McCormick-Taylor models.",
            "A reformulation framework for global optimization.",
            "Improved relaxations for the parametric solutions of ODEs using differential inequalities.",
            "Global optimization of expensive black box problems with a known lower bound.",
            "Integrated experimental design and nonlinear optimization to handle computationally expensive models under resource constraints.",
            "Protein structure optimization by side-chain positioning via beta-complex.",
            "Welfare-maximizing correlated equilibria using Kantorovich polynomials with sparsity.",
            "Special Issue: 21st International Conference on Multiple Criteria Decision Making; Articles on multiobjective optimization.",
            "Higher and lower-level knowledge discovery from Pareto-optimal sets.",
            "A stochastic programming approach to multicriteria portfolio optimization.",
            "Interactive procedure for a multiobjective stochastic discrete dynamic problem.",
            "A variational approach to define robustness for parametric multiobjective optimization problems.",
            "Finding all nondominated points of multi-objective integer programs.",
            "Utilizing expected improvement and generalized data envelopment analysis in multi-objective genetic algorithms.",
            "Global search perspectives for multiobjective optimization.",
            "Optimality conditions for a class of composite multiobjective nonsmooth optimization problems.",
            "Synchronous and asynchronous Pareto-based multi-objective Artificial Bee Colony algorithms.",
            "ε-Mixed type duality for nonconvex multiobjective programs with an infinite number of constraints.",
            "Analysing the scalability of multiobjective evolutionary algorithms when solving the motif discovery problem.",
            "Multiagent cooperation for solving global optimization problems: an extendible framework with example cooperation strategies.",
            "Vector network equilibrium problems with elastic demands.",
            "New existence theorems for quasi-equilibrium problems and a minimax theorem on complete metric spaces.",
            "Binary Accelerated Particle Swarm Algorithm (BAPSA) for discrete optimization problems.",
            "An alternative proof of the mountain pass theorem for a class of functionals.",
            "Differential evolution with multi-constraint consensus methods for constrained optimization.",
            "Preface: special issue of JOGO-GCM10.",
            "Enhancing computations of nondominated solutions in MOLFP via reference points.",
            "Characterization and recognition of d.c. functions.",
            "Generalized convexity for non-regular optimization problems with conic constraints.",
            "Projections onto convex sets on the sphere.",
            "Characterizations of pseudoconvex functions and semistrictly quasiconvex ones.",
            "Strongly convex set-valued maps.",
            "On the uniqueness of Cournot equilibrium in case of concave integrated price flexibility.",
            "On the differentiability of the support function.",
            "Optimization challenges in the structured low rank approximation problem.",
            "Global convergence of a non-convex Douglas-Rachford iteration.",
            "Geometric branch-and-bound methods for constrained global optimization problems.",
            "Approximations for two variants of the Steiner tree problem in the Euclidean plane $${\\mathbb{R}^2}$$.",
            "An Armijo-type method for pseudomonotone equilibrium problems and its applications.",
            "Stackelberg equilibria via variational inequalities and projections.",
            "Existence and uniqueness of solution for quasi-equilibrium problems and fixed point problems on complete metric spaces with applications.",
            "Optimization reformulations of the generalized Nash equilibrium problem using regularized indicator Nikaidô-Isoda function.",
            "An efficient implementation of parallel simulated annealing algorithm in GPUs.",
            "Solving dual problems using a coevolutionary optimization algorithm.",
            "Superimposed optimization methods for the mixed equilibrium problem and variational inclusion.",
            "Versions of Ekeland's variational principle involving set perturbations.",
            "Solvability and iterative approximations for a functional equation.",
            "Green overhead and underground multiple-input multiple-output medium voltage broadband over power lines networks: energy-efficient power control.",
            "Efficient algorithms for the offline variable sized bin-packing problem.",
            "Global optimization of bilinear programs with a multiparametric disaggregation technique.",
            "Selection of intensity modulated radiation therapy treatment beam directions using radial basis functions within a pattern search methods framework.",
            "On smooth reformulations and direct non-smooth computations for minimax problems.",
            "Approximation of rank function and its application to the nearest low-rank correlation matrix.",
            "A note on set-semidefinite relaxations of nonconvex quadratic programs.",
            "Theoretical filtering of RLT bound-factor constraints for solving polynomial programming problems to global optimality.",
            "Some properties of a hypergeometric function which appear in an approximation problem.",
            "A modification of the DIRECT method for Lipschitz global optimization for a symmetric function.",
            "Refinements of existence results for relaxed quasimonotone equilibrium problems.",
            "Fréchet subdifferentials of efficient point multifunctions in parametric vector optimization.",
            "Infinite horizon H2/H∞ optimal control for discrete-time Markov jump systems with (x, u, v)-dependent noise.",
            "Max-min weight balanced connected partition.",
            "Iterative methods for solving equilibrium problems, variational inequalities and fixed points of nonexpansive semigroups.",
            "Strong convergence for maximal monotone operators, relatively quasi-nonexpansive mappings, variational inequalities and equilibrium problems.",
            "A note on nonlinear fourth-order elliptic equations on $$\\mathbb R ^N$$.",
            "A general iteration scheme for variational inequality problem and common fixed point problems of nonexpansive mappings in q-uniformly smooth Banach spaces.",
            "Optimization of the difference of topical functions.",
            "Minimax theorems for scalar set-valued mappings with nonconvex domains and applications.",
            "Uniqueness of supporting hyperplanes and an alternative to solutions of variational inequalities.",
            "Maximal, potential and singular operators in vanishing generalized Morrey spaces.",
            "Continuity of solution mappings in some parametric non-weak vector Ky Fan inequalities.",
            "An improved first-order primal-dual algorithm with a new correction step.",
            "Iterative processes for common fixed points of two different families of mappings with applications.",
            "Existence theorems of the hemivariational inequality governed by a multi-valued map perturbed with a nonlinear term in Banach spaces.",
            "New optimality conditions for nonsmooth control problems."
        ]
    },
    {
        "name": "JGO",
        "year": "2012",
        "info": "2012: Volumes\n52,\n53,\n54",
        "count": 149,
        "papers": [
            "Convergence rate of McCormick relaxations.",
            "Vector optimization problem and generalized convexity.",
            "Low dimensional simplex evolution: a new heuristic for global optimization.",
            "Iterative method for fixed point problem, variational inequality and generalized mixed equilibrium problems with applications.",
            "Characterizations for solidness of dual cones with applications.",
            "Augmented Lagrangian functions for constrained optimization problems.",
            "Weak efficiency in multiobjective variational problems under generalized convexity.",
            "An efficient algorithm for maximal margin clustering.",
            "Dual extragradient algorithms extended to equilibrium problems.",
            "Second order duality in minmax fractional programming with generalized univexity.",
            "A Differential Evolution algorithm to deal with box, linear and quadratic-convex constraints for boundary optimization.",
            "Special issue on \"Optimization and optimal control with applications\" for the 4th International Conference on Optimization and Control with Applications (OCA2009), June 6-11, 2009, Harbin, China.",
            "Global optimal solutions to a class of quadrinomial minimization problems with one quadratic constraint.",
            "Nonlinear optimal feedback control for lunar module soft landing.",
            "On zero duality gap in nonconvex quadratic programming problems.",
            "Second-order differentiability of generalized perturbation maps.",
            "Minimum recession-compatible subsets of closed convex sets.",
            "Optimal switching control of a fed-batch fermentation process.",
            "Anticipating synchronization through optimal feedback control.",
            "Robust dynamical compensator design for discrete-time linear periodic systems.",
            "An adaptive least-squares collocation radial basis function method for the HJB equation.",
            "Exponential stability analysis and impulsive tracking control of uncertain time-delayed systems.",
            "Variance or spectral density in sampled data filtering?",
            "Performance analysis and evaluation of an enhanced power saving class type III in IEEE 802.16 with self-similar traffic.",
            "Preface.",
            "A convergent simplicial algorithm with ω-subdivision and ω-bisection strategies.",
            "Convex envelopes of products of convex and component-wise concave functions.",
            "On the relation between concavity cuts and the surrogate dual for convex maximization problems.",
            "Think co(mpletely)positive ! Matrix properties, examples and a clustered bibliography on copositive optimization.",
            "Reduced RLT representations for nonconvex polynomial programming problems.",
            "Calibration of estimator-weights via semismooth Newton method.",
            "Parameterized fairness axioms on cycle-free graph games.",
            "Criteria and dimension reduction of linear multiple criteria optimization problems.",
            "Exact penalty and error bounds in DC programming.",
            "An improved algorithm to test copositivity.",
            "An outcome space algorithm for optimization over the weakly efficient set of a multiple objective nonlinear programming problem.",
            "Global energy minimisation and cotranslational protein folding of HP models.",
            "Mathematical programs with vanishing constraints: critical point theory.",
            "A hybrid method for quantum global optimization.",
            "An extragradient algorithm for solving bilevel pseudomonotone variational inequalities.",
            "Interior proximal methods for quasiconvex optimization.",
            "Standard bi-quadratic optimization problems and unconstrained polynomial reformulations.",
            "The block diagram method for designing the particle swarm optimization algorithm.",
            "On the existence of solutions to generalized quasi-equilibrium problems.",
            "Radar placement along banks of river.",
            "Inequality problems of quasi-hemivariational type involving set-valued operators and a nonlinear term.",
            "A dual variant of Benson's \"outer approximation algorithm\" for multiple objective linear programming.",
            "Levitin-Polyak well-posedness of generalized vector quasi-equilibrium problems with functional constraints.",
            "An exact solution method for unconstrained quadratic 0-1 programming: a geometric approach.",
            "Generalized projections onto convex sets.",
            "Stability properties of the Tikhonov regularization for nonmonotone inclusions.",
            "Packing congruent hyperspheres into a hypersphere.",
            "Preface.",
            "Gauss-Newton method for convex composite optimizations on Riemannian manifolds.",
            "On linear programs with linear complementarity constraints.",
            "Survey on Vector Complementarity Problems.",
            "Hybrid extragradient-like methods for generalized mixed equilibrium problems, systems of generalized equilibrium problems and optimization problems.",
            "Gauss-Seidel method for multi-valued inclusions with Z mappings.",
            "Semidefinite complementarity reformulation for robust Nash equilibrium problems with Euclidean uncertainty sets.",
            "More results on Schur complements in Euclidean Jordan algebras.",
            "Preface.",
            "Some criteria for maximal abstract monotonicity.",
            "Weak stability and strong duality of a class of nonconvex infinite programs via augmented Lagrangian.",
            "A complete characterization of strong duality in nonconvex optimization with a single constraint.",
            "On the image space analysis for vector quasi-equilibrium problems with a variable ordering relation.",
            "Variational relation problems and equivalent forms of generalized Fan-Browder fixed point theorem with applications to Stampacchia equilibrium problems.",
            "Local boundedness of monotone bifunctions.",
            "Nondifferentiable minimax fractional programming in complex spaces with parametric duality.",
            "On duality gap in binary quadratic programming.",
            "Generalized vector variational-like inequalities and vector optimization.",
            "Nonsmooth semi-infinite programming problem using Limiting subdifferentials.",
            "Asset portfolio optimization using support vector machines and real-coded genetic algorithm.",
            "Behavior of DCA sequences for solving the trust-region subproblem.",
            "Existence and algorithms for bilevel generalized mixed equilibrium problems in Banach spaces.",
            "On stable uniqueness in linear semi-infinite optimization.",
            "Dynamic optimal portfolio with maximum absolute deviation model.",
            "Equilibrium existence theorems for multi-leader-follower generalized multiobjective games in FC-spaces.",
            "Global minimization of multivariate polynomials using nonstandard methods.",
            "Seller's optimal credit period and replenishment time in a supply chain with up-stream and down-stream trade credits.",
            "Saddle points for vector valued functions: existence, necessary and sufficient theorems.",
            "Rigorous filtering using linear relaxations.",
            "Extremal values of global tolerances in combinatorial optimization with an additive objective function.",
            "On solving continuous-time dynamic network flows.",
            "Existence and iterative algorithm of solutions for a class of bilevel generalized mixed equilibrium problems in Banach spaces.",
            "Financing policies via stochastic control: a dynamic programming approach.",
            "Complexity and approximation of the connected set-cover problem.",
            "Bilevel problems over polyhedra with extreme point optimal solutions.",
            "Nonsmooth optimization reformulations of player convex generalized Nash equilibrium problems.",
            "On the equivalence of strong formulations for capacitated multi-level lot sizing problems with setup times.",
            "The positiveness of lower limits of the Hoffman constant in parametric polyhedral programs.",
            "Curvature-constrained directional-cost paths in the plane.",
            "Saddle points of general augmented Lagrangians for constrained nonconvex optimization.",
            "An experimental methodology for response surface optimization methods.",
            "Gap functions and error bounds for quasi variational inequalities.",
            "Theoretical rate of convergence for interval inclusion functions.",
            "Clonal selection: an immunological algorithm for global optimization over continuous spaces.",
            "The economic production and pricing model with lot-size-dependent production cost.",
            "Existence and stability of minimax regret equilibria.",
            "Existence theorems and iterative approximation methods for generalized mixed equilibrium problems for a countable family of nonexpansive mappings.",
            "Duality theorems for a new class of multitime multiobjective variational problems.",
            "Expected improvement in efficient global optimization through bootstrapped kriging.",
            "Inverse 1-median problem on trees under weighted Hamming distance.",
            "A hybrid method for a family of relatively quasi-nonexpansive mappings and an equilibrium problem in Banach spaces.",
            "Strong convergence theorems for variational inequality problems and quasi-φ-asymptotically nonexpansive mappings.",
            "A distance-based measure of super efficiency in data envelopment analysis: an application to gas companies.",
            "Using the parametric approach to solve the continuous-time linear fractional max-min problems.",
            "Strong convergence theorems for variational inequality, equilibrium and fixed point problems with applications.",
            "Strong convergence of an iterative method for pseudo-contractive and monotone mappings.",
            "Viscosity approximation methods for a nonexpansive semigroup in Banach spaces with gauge functions.",
            "An alternating variable method for the maximal correlation problem.",
            "Preface.",
            "Applying the canonical dual theory in optimal control problems.",
            "Regularized learning in Banach spaces as an optimization problem: representer theorems.",
            "An approach to constrained global optimization based on exact penalty functions.",
            "Parallel branch and bound for multidimensional scaling with city-block distances.",
            "Duality and solutions for quadratic programming over single non-homogeneous quadratic constraint.",
            "Duality on a nondifferentiable minimax fractional programming.",
            "Optimal control problems arising in the zinc sulphate electrolyte purification process.",
            "On reduction of duality gap in quadratic knapsack problems.",
            "Canonical dual approach to solving the maximum cut problem.",
            "New parameterized kernel functions for linear optimization.",
            "Common best proximity points: global minimization of multi-objective functions.",
            "Duality for optimization problems in Banach algebras.",
            "Scheduling linear deteriorating jobs to minimize the number of tardy jobs.",
            "Exploiting run time distributions to compare sequential and parallel stochastic local search algorithms.",
            "Erratum to: Global optimization of stochastic black-box systems via sequential kriging meta-models.",
            "On saddle points in nonconvex semi-infinite programming.",
            "Registrar: a complete-memory operator to enhance performance of genetic algorithms.",
            "On the contraction-proximal point algorithms with multi-parameters.",
            "Korpelevich's method for variational inequality problems on Hadamard manifolds.",
            "Discrete optimization in partially ordered sets.",
            "A new iterative scheme for a countable family of relatively nonexpansive mappings and an equilibrium problem in Banach spaces.",
            "Second order sufficient optimality conditions in vector optimization.",
            "A facility location model with safety stock costs: analysis of the cost of single-sourcing requirements.",
            "Simultaneous estimation of thin film thickness and optical properties using two-stage optimization.",
            "On the convergence of augmented Lagrangian methods for nonlinear semidefinite programming.",
            "Infinitely many solutions for a double Sturm-Liouville problem.",
            "On descent-projection method for solving the split feasibility problems.",
            "PTAS for the minimum weighted dominating set in growth bounded graphs.",
            "Tabu search for the BWC problem.",
            "Saddle point and exact penalty representation for generalized proximal Lagrangians.",
            "On some convexity properties of the Least Squares Method for pairwise comparisons matrices without the reciprocity condition.",
            "Optimization of laminated composite plates for maximum fundamental frequency using Elitist-Genetic algorithm and finite strip method.",
            "A \"joint + marginal\" heuristic for 0/1 programs.",
            "The analysis of expected fitness and success ratio of two heuristic optimizations on two bimodal MaxSAT problems.",
            "Decomposition strategy for the stochastic pooling problem.",
            "A BB&R algorithm for minimizing total tardiness on a single machine with sequence dependent setup times.",
            "Weak Fenchel and weak Fenchel-Lagrange conjugate duality for nonconvex scalar optimization problems.",
            "Global optimization of polynomial-expressed nonlinear optimal control problems with semidefinite programming relaxation."
        ]
    },
    {
        "name": "JGO",
        "year": "2011",
        "info": "2011: Volumes\n49,\n50,\n51",
        "count": 134,
        "papers": [
            "Regularized Lagrangian duality for linearly constrained quadratic optimization and trust-region problems.",
            "Best proximity points: global optimal approximate solutions.",
            "Optimality and duality in vector optimization involving generalized type I functions over cones.",
            "A class of r-semipreinvex functions and optimality in nonlinear programming.",
            "Model building using bi-level optimization.",
            "A new differential mutation base generator for differential evolution.",
            "Towards the global solution of the maximal correlation problem.",
            "The column-sufficiency and row-sufficiency of the linear transformation on Hilbert spaces.",
            "Approaching pooling design with smaller efficient ratio.",
            "Multiobjective optimization problems with modified objective functions and cone constraints and applications.",
            "Study of multiscale global optimization based on parameter space partition.",
            "Counterexamples to some triality and tri-duality results.",
            "Constrained global optimization of multivariate polynomials using Bernstein branch and prune algorithm.",
            "Identifying preferred solutions to Multi-Objective Binary Optimisation problems, with an application to the Multi-Objective Knapsack Problem.",
            "Using the Dinkelbach-type algorithm to solve the continuous-time linear fractional programming problems.",
            "Characterizing strict efficiency for convex multiobjective programming problems.",
            "A logarithmic-quadratic proximal point scalarization method for multiobjective programming.",
            "Semidefinite relaxation bounds for bi-quadratic optimization problems with quadratic constraints.",
            "A generic approach to approximate efficiency and applications to vector optimization with set-valued maps.",
            "Degree theory for a generalized set-valued variational inequality with an application in Banach spaces.",
            "Comments on \"Competitive analysis of a better on-line algorithm to minimize total completion time on a single-machine\".",
            "Preface.",
            "Quasi-Newton methods in infinite-dimensional spaces and application to matrix equations.",
            "On generalized Ekeland's variational principle and equivalent formulations for set-valued mappings.",
            "Knapsack problem with probability constraints.",
            "Application of convex lexicographical optimization to the balance of GRTgaz gas grid.",
            "An exact algorithm for solving the vertex separator problem.",
            "A blind image watermarking using multiresolution visibility map.",
            "Evaluating a branch-and-bound RLT-based algorithm for minimum sum-of-squares clustering.",
            "The small hexagon and heptagon with maximum sum of distances between vertices.",
            "Properties of two DC algorithms in quadratic programming.",
            "Automatic differentiation for the optimization of a ship propulsion and steering system: a proof of concept.",
            "The directional subdifferential of the difference of two convex functions.",
            "On 2-stage robust LP with RHS uncertainty: complexity results and applications.",
            "A particle swarm optimization-based hybrid algorithm for minimum concave cost network flow problems.",
            "Scalarization and pointwise well-posedness in vector optimization problems.",
            "Nonmonotone equilibrium problems: coercivity conditions and weak regularization.",
            "Using the idea of expanded core for the exact solution of bi-objective multi-dimensional knapsack problems.",
            "Chebyshev scalarization of solutions to the vector equilibrium problems.",
            "Branching on hyperplane methods for mixed integer linear and convex programming using adjoint lattices.",
            "Stochastic lot-sizing with backlogging: computational complexity analysis.",
            "An extragradient-type method for generalized equilibrium problems involving strictly pseudocontractive mappings.",
            "Generalized vector implicit quasi complementarity problems.",
            "Counterexamples on some articles on quasi-variational inclusion problems.",
            "Necessary optimality conditions for nonsmooth semi-infinite programming problems.",
            "Preface.",
            "Codifferential method for minimizing nonsmooth DC functions.",
            "SSDB spaces and maximal monotonicity.",
            "Partial penalization for the solution of generalized Nash equilibrium problems.",
            "Korpelevich's method for variational inequality problems in Banach spaces.",
            "Small sets in best approximation theory.",
            "Semicontinuity of the solution map of quasivariational inequalities.",
            "Maximizing selections from the core of a cooperative game.",
            "Generalized Nash equilibrium problems for lower semi-continuous strategy maps.",
            "Optimizing microwind rural electrification projects. A case study in Peru.",
            "Enhanced metric regularity and Lipschitzian properties of variational systems.",
            "Transversality condition for singular infinite horizon calculus of variations.",
            "On global unconstrained minimization of the difference of polyhedral functions.",
            "Global optimization numerical strategies for rate-independent processes.",
            "Convergence of iterates with errors of semicontractive mappings.",
            "On minimum submodular cover with submodular cost.",
            "On constructing total orders and solving vector optimization problems with total orders.",
            "The extrapolated interval global optimization algorithm.",
            "Second-order conditions for nonsmooth multiobjective optimization problems with inclusion constraints.",
            "An integral function and vector sequence method for unconstrained global optimization.",
            "A viscosity approximation method for finding a common solution of fixed points and equilibrium problems in Hilbert spaces.",
            "On the computation of protein backbones by using artificial backbones of hydrogens.",
            "Controlled predatory pricing in a multiperiod Stackelberg game: an MPEC approach.",
            "Remarks on solutions to a nonconvex quadratic programming test problem.",
            "A new topological minimax theorem with application.",
            "Global descent methods for unconstrained global optimization.",
            "An approximation algorithm for convex multi-objective programming problems.",
            "Massively parallel differential evolution - pattern search optimization with graphics hardware acceleration: an investigation on bound constrained optimization problems.",
            "Global optimization for the generalized polynomial sum of ratios problem.",
            "A new iterative algorithm for equilibrium and fixed point problems of nonexpansive mapping.",
            "Maximum information stored in a labeled connected network with minimum edges.",
            "On the Dini-Hadamard subdifferential of the difference of two functions.",
            "A biased random-key genetic algorithm for routing and wavelength assignment.",
            "Second-order Kuhn-Tucker invex constrained problems.",
            "A note on the regularized proximal point algorithm.",
            "Alternative principles and their applications.",
            "Equivalent formulations of the gradient.",
            "Preface: Special issue SAGO08.",
            "Parallel algorithms for continuous multifacility competitive location problems.",
            "Dynamic sample budget allocation in model-based optimization.",
            "Pattern discrete and mixed Hit-and-Run for global optimization.",
            "A metaheuristic methodology based on the limitation of the memory of interval branch and bound algorithms.",
            "On determining the cover of a simplex by spheres centered at its vertices.",
            "An exact algorithm for the 0-1 linear knapsack problem with a single continuous variable.",
            "A globally and superlinearly convergent quasi-Newton method for general box constrained variational inequalities without smoothing approximation.",
            "Nonconvex quadratically constrained quadratic programming: best D.C. decompositions and their SDP representations.",
            "A continuation approach for the capacitated multi-facility weber problem based on nonlinear SOCP reformulation.",
            "Min-max and robust polynomial optimization.",
            "Inexact Halpern-type proximal point algorithm.",
            "The general iterative methods for nonexpansive mappings in Banach spaces.",
            "Discrete time dynamic traffic assignment models and solution algorithm for managed lanes.",
            "Iterative approximation method for finite family of relatively quasi nonexpansive mappings and systems of equilibrium problems.",
            "Mixture surrogate models based on Dempster-Shafer theory for global optimization problems.",
            "A new C-function for symmetric cone complementarity problems.",
            "Geometric fit of a point set by generalized circles.",
            "A heterogeneous cooperative parallel search of branch-and-bound method and tabu search algorithm.",
            "Generalized Benders' Decomposition for topology optimization problems.",
            "Guest editorial: a special issue on optimization techniques for business intelligence systems.",
            "A multi-criteria optimization model for humanitarian aid distribution.",
            "A comparison study of fuzzy MADM methods in nuclear safeguards evaluation.",
            "An intelligent multi-criteria optimization method for quick and market-oriented textile material design.",
            "Particle swarm optimization for bi-level pricing problems in supply chains.",
            "Optimization algorithm for learning consistent belief rule-base from examples.",
            "An improved training algorithm for feedforward neural network learning based on terminal attractors.",
            "Maturity, distance and density (MD2) metrics for optimizing trust prediction for business intelligence.",
            "Pareto-optimality of oblique decision trees from evolutionary algorithms.",
            "Constructing composite search directions with parameters in quadratic interpolation models.",
            "Incremental learning optimization on knowledge discovery in dynamic business intelligent systems.",
            "Multitime dynamic programming for multiple integral actions.",
            "Riemannian convexity of functionals.",
            "Combined bound-grid-factor constraints for enhancing RLT relaxations for polynomial programs.",
            "Subdifferential properties of the minimal time function of linear control systems.",
            "Evolution hemivariational inequality problems with doubly nonlinear operators.",
            "Alternating direction method for bi-quadratic programming.",
            "Maximum lifetime coverage preserving scheduling algorithms in sensor networks.",
            "Heuristic algorithms for the inverse mixed integer linear programming problem.",
            "A new smoothing Broyden-like method for solving nonlinear complementarity problem with a P 0-function.",
            "New decision rules for exact search in N-Queens.",
            "Seeking global edges for traveling salesman problem in multi-start search.",
            "Continuity of approximate solution mappings for parametric equilibrium problems.",
            "Global optimality conditions and optimization methods for quadratic integer programming problems.",
            "Generalized McCormick relaxations.",
            "Self-adaptive randomized and rank-based differential evolution for multimodal problems.",
            "The prox-Tikhonov regularization method for the proximal point algorithm in Banach spaces.",
            "Existence results for proper efficient solutions of vector equilibrium problems and applications.",
            "Calmness of efficient solution maps in parametric vector optimization.",
            "Generalized equilibrium problems and fixed point problems for nonexpansive semigroups in Hilbert spaces.",
            "Low order-value approach for solving VaR-constrained optimization problems.",
            "Markov modelling and parameterisation of genetic evolutionary test generations."
        ]
    },
    {
        "name": "JGO",
        "year": "2010",
        "info": "2010: Volumes\n46,\n47,\n48",
        "count": 127,
        "papers": [
            "Solving polynomial least squares problems via semidefinite programming relaxations.",
            "Generalized multivalued vector variational-like inequalities.",
            "On a theorem due to Crouzeix and Ferland.",
            "A non-smooth three critical points theorem with applications in differential inclusions.",
            "A new asymmetric inclusion region for minimum weight triangulation.",
            "Approximating zeros of monotone operators by proximal point algorithms.",
            "Multiple solutions for semilinear resonant elliptic problems with discontinuous nonlinearities via nonsmooth double linking theorem.",
            "Sufficiency and duality for multiobjective control problems under generalized (B, rho)-type I functions.",
            "New systems of generalized vector quasi-equilibrium problems in product FC-spaces.",
            "Convex relaxation for solving posynomial programs.",
            "Characterizing zero-derivative points.",
            "Outer approximation algorithms for canonical DC problems.",
            "Global optimality conditions for quadratic 0-1 optimization problems.",
            "On sufficiency and duality in multiobjective programming problem under generalized alpha-type I univexity.",
            "On the convergence properties of modified augmented Lagrangian methods for mathematical programming with complementarity constraints.",
            "A new augmented Lagrangian approach to duality and exact penalization.",
            "Continuity of solution maps of parametric quasiequilibrium problems.",
            "From an abstract maximal element principle to optimization problems, stationary point theorems and common fixed point theorems.",
            "Stopping and restarting strategy for stochastic sequential search in global optimization.",
            "One-dimensional nested maximin designs.",
            "Convexification for data fitting.",
            "Convexification for data fitting.",
            "Strong convergence theorems for variational inequalities and relatively weak nonexpansive mappings.",
            "Ishikawa iterative algorithms for a generalized equilibrium problem and fixed point problems of a pseudo-contraction mapping.",
            "A primal dual modified subgradient algorithm with sharp Lagrangian.",
            "A hybrid heuristic for the diameter constrained minimum spanning tree problem.",
            "Hadamard well-posed vector optimization problems.",
            "Approximation of optimal feedback control: a dynamic programming approach.",
            "Minimal infeasible constraint sets in convex integer programs.",
            "Lower semicontinuity of the solution map to a parametric vector variational inequality.",
            "A viscosity approximation method for equilibrium problems, fixed point problems of nonexpansive mappings and a general system of variational inequalities.",
            "Variational inequalities on weakly compact sets.",
            "Penalized complementarity functions on symmetric cones.",
            "Preface.",
            "Subdifferentials of perturbed distance functions in Banach spaces.",
            "On the mean value theorem for semidifferentiable functions.",
            "Nash equilibria of generalized games in normed spaces without upper semicontinuity.",
            "Existence theorems for generalized vector variational inequalities with a variable ordering relation.",
            "Vector equilibrium flows with nonconvex ordering relations.",
            "On an elliptic Kirchhoff-type problem depending on two parameters.",
            "Lexicographic and sequential equilibrium problems.",
            "Equilibrium and least element problems for multivalued functions.",
            "A field guide to the matrix classes found in the literature of the linear complementarity problem.",
            "Remarks on infinite dimensional duality.",
            "Reduction of finite exhausters.",
            "Some applications of the image space analysis to the duality theory for constrained extremum problems.",
            "Limiting subgradients of minimal time functions in Banach spaces.",
            "Strong convergence theorem by a hybrid extragradient-like approximation method for variational inequalities and fixed point problems.",
            "Some properties of approximate solutions for vector optimization problem with set-valued functions.",
            "Remarks on strict efficiency in scalar and vector optimization.",
            "A sequential parametric convex approximation method with applications to nonconvex truss topology design problems.",
            "Vectorial exceptional families of elements.",
            "Solving the problem of packing equal and unequal circles in a circular container.",
            "A recurrence method for a special class of continuous time linear programming problems.",
            "An outcome space approach for generalized convex multiplicative programs.",
            "Hybrid inclusion and disclusion systems with applications to equilibria and parametric optimization.",
            "A new smoothing Newton-type algorithm for semi-infinite programming.",
            "The unit-level-core for multi-choice games: the replicated core for TU games.",
            "Closedness and Hadamard well-posedness of the solution map for parametric vector equilibrium problems.",
            "Equity portfolio construction and selection using multiobjective mathematical programming.",
            "Bounded lower subdifferentiability optimization techniques: applications.",
            "Second order optimality conditions for bilevel set optimization problems.",
            "A fast memoryless interval-based algorithm for global optimization.",
            "Set containment characterization with strict and weak quasiconvex inequalities.",
            "Proximal methods for a class of bilevel monotone equilibrium problems.",
            "The oracle penalty method.",
            "Preface.",
            "A polynomial path-following interior point algorithm for general linear complementarity problems.",
            "A network flow model for biclustering via optimal re-ordering of data matrices.",
            "Quasi-bounded mappings and complementarity problems depending of parameters.",
            "Machine learning problems from optimization perspective.",
            "Fuzzy bilevel programming with multiple objectives and cooperative multiple followers.",
            "Optimal control of a quasi-variational obstacle problem.",
            "Convergence rate for consensus with delays.",
            "Parameterized variational inequalities.",
            "Solutions to quadratic minimization problems with box and integer constraints.",
            "D(C){{\\mathcal {D}(\\mathcal {C})}}-optimization and robust global optimization.",
            "Are dualities appropriate for duality theories in optimization?",
            "Maximum flows and minimum cuts in the plane.",
            "Pseudomonotone operators and the Bregman Proximal Point Algorithm.",
            "Global solution of nonlinear mixed-integer bilevel programs.",
            "Global optimality conditions for cubic minimization problem with box or binary constraints.",
            "A combined DCA: GA for constructing highly nonlinear balanced boolean functions in cryptography.",
            "Solving convex quadratic bilevel programming problems using an enumeration sequential quadratic programming algorithm.",
            "Upper semicontinuity result for the solution mapping of a mixed parametric generalized vector quasiequilibrium problem with moving cones.",
            "On convex relaxations of quadrilinear terms.",
            "Foreword: Special issue celebrating the 70th birthday of Roman G. Strongin.",
            "Methods of embedding-cutting off in problems of mathematical programming.",
            "A lower bound on convergence rates of nonadaptive algorithms for univariate optimization with noise.",
            "One-dimensional identification problem and ranking parameters.",
            "A genetic algorithm for a global optimization problem arising in the detection of gravitational waves.",
            "Linear and quadratic programming approaches for the general graph partitioning problem.",
            "A local search method for continuous global optimization.",
            "Stopping rules in k-adaptive global random search algorithms.",
            "An information global minimization algorithm using the local improvement technique.",
            "A partition-based global optimization algorithm.",
            "On simulation of optimal strategies and Nash equilibrium in the financial market context.",
            "Iterative regularization algorithms for constrained image deblurring on graphics processors.",
            "On computational search for optimistic solutions in bilevel problems.",
            "On similarities between two models of global optimization: statistical models and radial basis functions.",
            "Duality and optimality conditions for generalized equilibrium problems involving DC functions.",
            "On the norm of a dc function.",
            "On numerical optimization theory of infinite kernel learning.",
            "A new smoothing and regularization Newton method for P0-NCP.",
            "A fractional programming approach for retail category price optimization.",
            "A quasi-variational approach to a competitive economic equilibrium problem without strong monotonicity assumption.",
            "Continuous GRASP with a local active-set method for bound-constrained global optimization.",
            "Refined optimality conditions for differences of convex functions.",
            "Robust optimization with simulated annealing.",
            "Bounds of redundant multicast routing problem with SRLG-diverse constraints: edge, path and tree models.",
            "Dynamic analysis for the selection of parameters and initial population, in particle swarm optimization.",
            "BIANCA: a genetic algorithm to solve hard combinatorial optimisation problems in engineering.",
            "Iterative algorithms for variational inequality and equilibrium problems with applications.",
            "Semidefinite approximations for quadratic programs over orthogonal matrices.",
            "Exceptional family of elements for generalized variational inequalities.",
            "The theoretical and empirical rate of convergence for geometric branch-and-bound methods.",
            "An improved lower bound and approximation algorithm for binary constrained quadratic programming problem.",
            "A. Mucherino, P. J. Papajorgji, P. M. Pardalos: Data mining in agriculture - Springer-Verlag, 2009, ISBN: 978-0-387-88614-5.",
            "Optimal placement of UV-based communications relay nodes.",
            "A heuristic method for the minimum toll booth problem.",
            "Partitioning procedure for polynomial optimization.",
            "Pyramidal tours and multiple objectives.",
            "Piece adding technique for convex maximization problems.",
            "An efficient combined DCA and B&B using DC/SDP relaxation for globally solving binary quadratic programs.",
            "New dominating sets in social networks.",
            "Minimization of equilibrium problems, variational inequality problems and fixed point problems.",
            "DC models for spherical separation."
        ]
    },
    {
        "name": "JGO",
        "year": "2009",
        "info": "2009: Volumes\n43,\n44,\n45",
        "count": 113,
        "papers": [
            "Low Order-Value Optimization and applications.",
            "Generalizations of vector quasivariational inclusion problems with set-valued maps.",
            "Vector optimization and variational-like inequalities.",
            "A reassessment of the Snyman-Fatti dynamic search trajectory method for unconstrained global optimization.",
            "Constrained inverse min-max spanning tree problems under the weighted Hamming distance.",
            "On G-invex multiobjective programming. Part I. Optimality.",
            "On G-invex multiobjective programming. Part II. Duality.",
            "Steiner trees for fixed orientation metrics.",
            "A note on a paper \"A regularization method for the proximal point algorithm\".",
            "Improved scatter search for the global optimization of computationally expensive dynamic models.",
            "A kriging based method for the solution of mixed-integer nonlinear programs containing black-box functions.",
            "Double variable neighbourhood search with smoothing for the molecular distance geometry problem.",
            "Global optimization of higher order moments in portfolio selection.",
            "Global optimization of robust chance constrained problems.",
            "Two aspects of optimal diet determination for pig production: efficiency of solution and incorporation of cost variation.",
            "A mixed-integer optimization framework for the synthesis and analysis of regulatory networks.",
            "Column enumeration based decomposition techniques for a class of non-convex MINLP problems.",
            "Cutting circles and polygons from area-minimizing rectangles.",
            "The interacting-particle algorithm with dynamic heating and cooling.",
            "Branch and bound algorithm for multidimensional scaling with city-block metric.",
            "Global optimization of expensive-to-evaluate functions: an empirical comparison of two sampling criteria.",
            "Some transformation techniques with applications in global optimization.",
            "Concave programming and DH-point.",
            "Optimization strategies in credit portfolio management.",
            "Molecular conformation of n -alkanes using terrain/funneling methods.",
            "Fast construction of constant bound functions for sparse polynomials.",
            "An analytical method for derivation of the Steiner Ratio of 3D euclidean Steiner trees.",
            "Semidefinite programming versus the reformulation-linearization technique for nonconvex quadratically constrained quadratic programming.",
            "Preface.",
            "Viscosity approximation methods for generalized equilibrium problems and fixed point problems.",
            "On generalized variational inequalities.",
            "Improving the efficiency of DC global optimization methods by improving the DC representation of the objective function.",
            "Necessary conditions for super minimizers in constrained multiobjective optimization.",
            "Game theoretical optimization inspired by information theory.",
            "Pseudomonotone *{_{\\ast}} maps and the cutting plane property.",
            "Dual characterizations of the set containments with strict cone-convex inequalities in Banach spaces.",
            "Nonsmooth multiobjective continuous-time problems with generalized invexity.",
            "Local minima of quadratic forms on convex cones.",
            "Resolution method for mixed integer bi-level linear problems based on decomposition technique.",
            "DESA: a new hybrid global optimization method and its application to analog integrated circuit sizing.",
            "The optimal statistical median of a convex set of arrays.",
            "Stampacchia generalized vector quasi-equilibrium problem with set-valued mapping.",
            "Vector optimization problems with quasiconvex constraints.",
            "Generalized V-univexity type-I for multiobjective programming with n-set functions.",
            "Structural stability and robustness to bounded rationality for non-compact cases.",
            "Levitin-Polyak well-posedness of variational inequality problems with functional constraints.",
            "The interior proximal extragradient method for solving equilibrium problems.",
            "Hybrid spectral gradient method for the unconstrained minimization problem.",
            "A filled function method for optimal discrete-valued control problems.",
            "A novel hybrid approach combining electromagnetism-like method with Solis and Wets local search for continuous optimization problems.",
            "A global optimization algorithm for generalized semi-infinite, continuous minimax with coupled constraints and bi-level problems.",
            "Optimal transportation policies for production/inventory systems with an unreliable and a reliable carrier.",
            "Choosing the best set of variables in regression analysis using integer programming.",
            "A superlinearly convergent projection method for constrained systems of nonlinear equations.",
            "System of generalized resolvent equations with corresponding system of variational inclusions.",
            "An efficient branch-and-bound algorithm for finding a maximum clique with computational experiments.",
            "DC programming techniques for solving a class of nonlinear bilevel programs.",
            "Necessary and sufficient global optimality conditions for NLP reformulations of linear SDP problems.",
            "A second-order pruning step for verified global optimization.",
            "Moreau-Yosida regularization of Lagrangian-dual functions for a class of convex optimization problems.",
            "A numerical approach to design control invariant sets for constrained nonlinear discrete-time systems with guaranteed optimality.",
            "New inexact implicit method for general mixed quasi variational inequalities.",
            "Nondifferentiability of an objective function at its point of minimum for most minimax problems.",
            "Unified theory of augmented Lagrangian methods for constrained global optimization.",
            "Separation of sets and Wolfe duality.",
            "A hybrid multiagent approach for global trajectory optimization.",
            "Some regularities for parametric equilibrium problems.",
            "Genetic algorithms applied to the solution of hybrid optimal control problems in astrodynamics.",
            "An informational approach to the global optimization of expensive-to-evaluate functions.",
            "Neural networks for a class of bi-level variational inequalities.",
            "An extension of interior point potential reduction algorithm to solve general LCPs.",
            "A new approach with orthogonal array for global optimization in design of experiments.",
            "Systems of variational inclusion problems and differential inclusion problems with applications.",
            "Second order duality for nondifferentiable minimax programming problems with generalized convexity.",
            "A modified extragradient method for inverse-monotone operators in Banach spaces.",
            "Global optimization and its applications.",
            "A review of recent advances in global optimization.",
            "Moments and sums of squares for polynomial optimization and related problems.",
            "Towards global bilevel dynamic optimization.",
            "Convergence analysis of a global optimization algorithm using stochastic differential equations.",
            "Mathematical modeling and efficient optimization methods for the distance-dependent rearrangement clustering problem.",
            "Global optimization of multi-parametric MILP problems.",
            "Optimizing Omega.",
            "Modular global optimisation in chemical engineering.",
            "Constructing a DC decomposition for ordered median problems.",
            "Generalized convex spaces, L-spaces, and FC-spaces.",
            "On the convergence of the entropy-exponential penalty trajectories and generalized proximal point methods in semidefinite optimization.",
            "Mixed quasi complementarity problems in topological vector spaces.",
            "A new Lagrangean approach to the pooling problem.",
            "Some characterizations for SOC-monotone and SOC-convex functions.",
            "On the computation of C* certificates.",
            "Existence of solutions of vector variational inequalities and vector complementarity problems.",
            "Solution semicontinuity of parametric generalized vector equilibrium problems.",
            "Optimality and duality for nonsmooth multiobjective programming problems with V-r-invexity.",
            "An open global volume minimization problem.",
            "Global optimization for a class of fractional programming problems.",
            "Monotonic analysis over ordered topological vector spaces: IV.",
            "Browder-Tikhonov regularization for a class of evolution second order hemivariational inequalities.",
            "Continuous location problems and Big Triangle Small Triangle: constructing better bounds.",
            "An efficient algorithm for range computation of polynomials using the Bernstein form.",
            "Optimization of aircraft structural components by using nature-inspired algorithms and multi-fidelity approximations.",
            "A PTAS for minimum connected dominating set in 3-dimensional Wireless sensor networks.",
            "Metric characterizations of alpha-well-posedness for symmetric quasi-equilibrium problems.",
            "Solutions and optimality criteria for nonconvex constrained global optimization problems with connections between canonical and Lagrangian duality.",
            "Interval propagation and search on directed acyclic graphs for numerical constraint solving.",
            "Matrix pencils and existence conditions for quadratic programming with a sign-indefinite quadratic equality constraint.",
            "Set containment characterization for quasiconvex programming.",
            "On the existence of solutions to quasivariational inclusion problems.",
            "Stability of semi-infinite vector optimization problems under functional perturbations.",
            "Equivalence theorem, consistency and axiomatizations of a multi-choice value.",
            "Optimality conditions and duality for semi-infinite programming involving B-arcwise connected functions.",
            "Asymptotic convergence of an inertial proximal method for unconstrained quasiconvex minimization.",
            "On optimal zero-preserving corrections for inconsistent linear systems."
        ]
    },
    {
        "name": "JGO",
        "year": "2008",
        "info": "2008: Volumes\n40,\n41,\n42",
        "count": 134,
        "papers": [
            "Preface.",
            "A sensitivity analysis of a class of semi-coercive variational inequalities using recession tools.",
            "Regularity results for evolutionary nonlinear variational and quasi-variational inequalities with applications to dynamic equilibrium problems.",
            "Fields of extremals and sufficient conditions for the simplest problem of the calculus of variations.",
            "Dynamic equilibria of group vaccination strategies in a heterogeneous population.",
            "Lagrange multipliers and infinite-dimensional equilibrium problems.",
            "Exhausters, optimality conditions and related problems.",
            "An existence result of a quasi-variational inequality associated to an equilibrium problem.",
            "Global regularity for solutions to Dirichlet problem for discontinuous elliptic systems with nonlinearity q > 1 and with natural growth.",
            "Some classes of projected dynamical systems in Banach spaces and variational inequalities.",
            "Nonlinear analysis and complementarity theory.",
            "Penalization and regularization for multivalued pseudo-monotone variational inequalities with Mosco approximation on constraint sets.",
            "On the uniqueness of solutions of spectral equations.",
            "Second-order conditions in stability analysis for state constrained optimal control.",
            "On the perturbation of the observability equation in linear control systems.",
            "Hölder continuity of solutions to elastic traffic network models.",
            "Generalized Gagliardo-Nirenberg estimates and differentiability of the solutions to monotone nonlinear parabolic systems.",
            "Constrained extremum problems with infinite dimensional image. Selection and saddle point.",
            "Singularities of minima: a walk on the wild side of the Calculus of Variations.",
            "Necessary and sufficient conditions for linear suboptimality in constrained optimization.",
            "A class of subelliptic quasilinear equations.",
            "A network efficiency measure with application to critical infrastructure networks.",
            "On the interior regularity of weak solutions to the non-stationary Stokes system.",
            "Dirichlet and Neumann problems to critical Emden-Fowler type equations.",
            "W 2, p -a priori estimates for the emergent Poincaré Problem.",
            "Critical duality.",
            "Interactive decisions and potential games.",
            "Equilibrium conditions and vector variational inequalities: a complex relation.",
            "Commutators of fractional integral operators on Vanishing-Morrey spaces.",
            "Asymptotic analysis of solutions to parabolic systems.",
            "Sectional curvatures in nonlinear optimization.",
            "Well-posedness of constrained minimization problems via saddle-points.",
            "Some sharp Hölder estimates for two-dimensional elliptic equations.",
            "Solution continuity in variational conditions.",
            "A solution differentiability result for evolutionary quasi-variational inequalities.",
            "Singular integral operators in Morrey spaces and interior regularity of solutions to systems of linear PDE's.",
            "Near operators theory and fully nonlinear elliptic equations.",
            "Approximate solutions and optimality conditions of vector variational inequalities in Banach spaces.",
            "Minty's lemma and vector variational-like inequalities.",
            "On the second conjugate of several convex functions in general normed vector spaces.",
            "Localization of minimax points.",
            "On the maximum principle for linear parabolic equations.",
            "Preface.",
            "Box-constrained minimization reformulations of complementarity problems in second-order cones.",
            "A new criterion for the inexact logarithmic-quadratic proximal method and its derived hybrid methods.",
            "A geometric framework for nonconvex optimization duality using augmented lagrangian functions.",
            "The Betti reciprocity principle and the normal boundary component control problem for linear elastic systems.",
            "Geometric dual formulation for first-derivative-based univariate cubic L 1 splines.",
            "A nonconvex dissipative system and its applications (I).",
            "A nonconvex dissipative system and its applications (II).",
            "Optimal induced norm computation of discrete H∞ control systems with time-delays.",
            "Systems of equilibrium problems with applications to new variants of Ekeland's variational principle, fixed point theorems and parametric optimization problems.",
            "1.5-Q-superlinear convergence of an exterior-point method for constrained optimization.",
            "Global minimization of rational functions and the nearest GCDs.",
            "Deterministic parallel global parameter estimation for a model of the budding yeast cell cycle.",
            "On system of generalized vector variational inequalities.",
            "Existence theorems of systems of variational inclusion problems with applications.",
            "Vector optimization problems with nonconvex preferences.",
            "Lipschitz behavior of convex semi-infinite optimization problems: a variational approach.",
            "Quadratic kernel-free non-linear support vector machine.",
            "Sufficient conditions for optimality for differential inclusions of parabolic type and duality.",
            "Characterizing efficiency without linear structure: a unified approach.",
            "An efficient solver for weighted Max-SAT.",
            "Box-constrained quadratic programs with fixed charge variables.",
            "Optimality and duality for nonsmooth multiobjective fractional programming with mixed constraints.",
            "Well-posedness of mixed variational inequalities, inclusion problems and fixed point problems.",
            "On the solution existence of pseudomonotone variational inequalities.",
            "Optimality for ( h, phi )-multiobjective programming involving generalized type-I functions.",
            "A Lagrangean based branch-and-cut algorithm for global optimization of nonconvex mixed-integer nonlinear programs with decomposable structures.",
            "Sensitivity analysis of solution mappings of parametric vector quasi-equilibrium problems.",
            "A globally and superlinearly convergent modified SQP-filter method.",
            "Global optimization using a synchronization of multiple search Points autonomously driven by a chaotic dynamic model.",
            "The semismooth approach for semi-infinite programming under the Reduction Ansatz.",
            "T-shape homogenous block patterns for the two-dimensional cutting problem.",
            "The optimization problem over a distributive lattice.",
            "Nonsmooth optimization through Mesh Adaptive Direct Search and Variable Neighborhood Search.",
            "Smoothing by mollifiers. Part I: semi-infinite optimization.",
            "Smoothing by mollifiers. Part II: nonlinear optimization.",
            "On Nash-Cournot oligopolistic market equilibrium models with concave cost functions.",
            "Computations with disjunctive cuts for two-stage stochastic mixed 0-1 integer programs.",
            "Total domination in partitioned trees and partitioned graphs with minimum degree two.",
            "Gap functions for a system of generalized vector quasi-equilibrium problems with set-valued mappings.",
            "A modified inexact operator splitting method for monotone variational inequalities.",
            "Self-adaptive velocity particle swarm optimization for solving constrained optimization problems.",
            "An adaptive radial basis algorithm (ARBF) for expensive black-box global optimization.",
            "Mixed projection methods for systems of variational inequalities.",
            "Scope of stationary multi-objective evolutionary optimization: a case study on a hydro-thermal power dispatch problem.",
            "Generating the weakly efficient set of nonconvex multiobjective problems.",
            "Various kinds of semicontinuity and the solution sets of parametric multivalued symmetric vector quasiequilibrium problems.",
            "Convergence of stochastic search algorithms to finite size pareto set approximations.",
            "A convex analysis approach for convex multiplicative programming.",
            "A robust algorithm for generalized geometric programming.",
            "On the stable containment of two sets.",
            "The conjugate of the pointwise maximum of two convex functions revisited.",
            "Market selection decisions for inventory models with price-sensitive demand.",
            "Reference variable methods of solving min-max optimization problems.",
            "Gradient-constrained minimum networks (II). Labelled or locally minimal Steiner points.",
            "Global optimization of signomial mixed-integer nonlinear programming problems with free variables.",
            "Tight convex underestimators for C2-continuous problems: I. univariate functions.",
            "Tight convex underestimators for C2-continuous problems: II. multivariate functions.",
            "Solving the sum-of-ratios problem by a stochastic search algorithm.",
            "Iterative solving of variational inclusions under Wijsman perturbations.",
            "An inexact proximal point method for solving generalized fractional programs.",
            "Editorial.",
            "Farmland appraisal based on the analytic network process.",
            "On Saaty's and Koczkodaj's inconsistencies of pairwise comparison matrices.",
            "An interactive solution approach for a bi-objective semi-desirable location problem.",
            "Nondominated equilibrium solutions of a multiobjective two-person nonzero-sum game in extensive form and corresponding mathematical programming problem.",
            "A memetic algorithm for multi-objective dynamic location problems.",
            "An algorithm for ordinal sorting based on ELECTRE with categories defined by examples.",
            "Optimization of nearest neighbor classifiers via metaheuristic algorithms for credit risk assessment.",
            "Variable preference modeling with ideal-symmetric convex cones.",
            "ANP application for evaluating Turkish mobile communication operators.",
            "Preface.",
            "A scaling algorithm for polynomial constraint satisfaction problems.",
            "Comments on an ancient Greek racecourse: finding minimum width annuluses.",
            "Comments on an ancient Greek racecourse: finding minimum width annuluses.",
            "The non-existence of a regular exceptional family of elements. A necessary and sufficient condition. Applications to complementarity theory.",
            "Efficient interval partitioning for constrained global optimization.",
            "Duality for almost convex optimization problems via the perturbation approach.",
            "Separation of sets and Wolfe duality.",
            "Generalized Semi-Infinite Programming: on generic local minimizers.",
            "A method for approximating pairwise comparison matrices by consistent matrices.",
            "Branch-and-price-and-cut algorithms for solving the reliable h -paths problem.",
            "The (S)+ condition on generalized variational inequalities.",
            "Global solution of bilevel programs with a nonconvex inner program.",
            "Sensitivity analysis for multivalued quasiequilibrium problems in metric spaces: Hölder continuity of solutions.",
            "A geometric characterization of \"optimality-equivalent\" relaxations.",
            "Existence of zero points for pseudomonotone operators in Banach spaces.",
            "A novel proof of the existence of solutions for a new system of generalized mixed quasi-variational-like inclusions involving ( A , eta , m )-accretive operators.",
            "A convergence for infinite dimensional vector valued functions.",
            "Neighborhood search approaches to beam orientation optimization in intensity modulated radiation therapy treatment planning.",
            "Closed-form solution of a maximization problem.",
            "A note on global optimization via the heat diffusion equation."
        ]
    },
    {
        "name": "JGO",
        "year": "2007",
        "info": "2007: Volumes\n37,\n38,\n39",
        "count": 114,
        "papers": [
            "Unbounded Components in the Solution Sets of Strictly Quasiconcave Vector Maximization Problems.",
            "An Efficient Procedure for Dynamic Lot-sizing Model with Demand Time Windows.",
            "Theoretical Convergence Analysis of a General Division-deletion Algorithm for Solving Global Search Problems.",
            "An Inverse Reliability-based Approach for Designing under Uncertainty with Application to Robust Piston Design.",
            "Nonempty Intersection Theorems and Generalized Multi-objective Games in Product FC-Spaces.",
            "A linear programming reformulation of the standard quadratic optimization problem.",
            "Exact Penalty Functions for Constrained Minimization Problems via Regularized Gap Function for Variational Inequalities.",
            "An Efficient Branch-and-bound Algorithm for Finding a Maximum Clique with Computational Experiments.",
            "Improved Strategies for Radial basis Function Methods for Global Optimization.",
            "Application of the cross-entropy method to clustering and vector quantization.",
            "Generating functions and the performance of backtracking adaptive search.",
            "Symbolic Interval Inference Approach for Subdivision Direction Selection in Interval Partitioning Algorithms.",
            "Existences theorems of systems of vector quasi-equillibrium problems and mathematical programs with equilibrium constraint.",
            "Comparison Between Baumann and Admissible Simplex Forms in Interval Analysis.",
            "An Optimal Alternative Theorem and Applications to Mathematical Programming.",
            "Some remarks on nonsmooth critical point theory.",
            "Discontinuous implicit generalized quasi-variational inequalities in Banach spaces.",
            "Mathematical Programming with System of Equilibrium Constraints.",
            "Levitin-Polyak well-posedness of constrained vector optimization problems.",
            "A General Global Optimization Approach for Solving Location Problems in the Plane.",
            "On duality bound methods for nonconvex global optimization.",
            "Constrained optimization using multiple objective programming.",
            "Discrete global descent method for discrete global optimization and nonlinear integer programming.",
            "Mobile Robot Global Localization using an Evolutionary MAP Filter.",
            "On initial populations of a genetic algorithm for continuous optimization problems.",
            "Existence results for inequality problems on various subsets of Banach spaces and applications.",
            "Uniqueness and Hölder continuity of the solution to multivalued equilibrium problems in metric spaces.",
            "A Branch and Bound algorithm for the minimax regret spanning arborescence.",
            "Scatter search for chemical and bio-process optimization.",
            "Global optimal policy for vendor-buyer integrated inventory system within just in time environment.",
            "Speed-up for the expectation-maximization algorithm for clustering categorical data.",
            "A population global optimization algorithm to solve the image alignment problem in electron crystallography.",
            "Cross-entropic learning of a machine for the decision in a partially observable universe.",
            "A robust algorithm for quadratic optimization under quadratic constraints.",
            "Integration and dimensional modeling approaches for complex data warehousing.",
            "A new efficient algorithm based on DC programming and DCA for clustering.",
            "Application of lower bound direct method to engineering structures.",
            "A homotopy interior point method for semi-infinite programming problems.",
            "Vector equilibrium problems with elastic demands and capacity constraints.",
            "An updated geometric build-up algorithm for solving the molecular distance geometry problems with sparse distance data.",
            "On the on-line rent-or-buy problem in probabilistic environments.",
            "Systems of generalized quasivariational inclusions problems with applications to variational analysis and optimization problems.",
            "Discrete-time dynamic traffic assignment models with periodic planning horizon: system optimum.",
            "A novel three-phase trajectory informed search methodology for global optimization.",
            "Nonlinear optimization with GAMS /LGO.",
            "Explicitly quasiconvex set-valued optimization.",
            "A (CF)-mapping of integral functional of locally lipschitz functions.",
            "Transport and concentration problems with interaction effects.",
            "A finite steps algorithm for solving convex feasibility problems.",
            "Preface: Special issue Go05.",
            "Extremal problems for convex polygons.",
            "Survivable network design under optimal and heuristic interdiction scenarios.",
            "Algorithms for separable nonlinear least squares with application to modelling time-resolved spectra.",
            "Multi-dimensional pruning from the Baumann point in an Interval Global Optimization Algorithm.",
            "An exact global optimization method for deriving weights from pairwise comparison matrices.",
            "GASUB: finding global optima to discrete location problems by a genetic-like algorithm.",
            "A hybrid method for solving multi-objective global optimization problems.",
            "Search space pruning and global optimisation of multiple gravity assist spacecraft trajectories.",
            "Use of an interval global optimization tool for exploring feasibility of batch extractive distillation.",
            "Obtaining an outer approximation of the efficient set of nonlinear biobjective problems.",
            "An analytically derived cooling schedule for simulated annealing.",
            "Generalized KKM type theorems in FC-spaces with applications (II).",
            "The p-step iterative algorithm for a system of generalized mixed quasi-variational inclusions with (H, η)-monotone operators.",
            "Local saddle point and a class of convexification methods for nonconvex optimization problems.",
            "Accelerating convergence of cutting plane algorithms for disjoint bilinear programming.",
            "Self-concordant functions for optimization on smooth manifolds.",
            "Multiplicity theorems for scalar periodic problems at resonance with p-Laplacian-like operator.",
            "A new class of test functions for global optimization.",
            "János D. Pintér, ed. (2006), Global Optimization: Scientific and Engineering Case Studies, Springer Verlag Nonconvex Optimization and its Applications series, 546 pp., ISBN 0-387-30408-8.",
            "Preface.",
            "Global optimization in stabilizing controller design.",
            "A novel approach to Bilevel nonlinear programming.",
            "A new bilevel formulation for the vehicle routing problem and a solution method using a genetic algorithm.",
            "Two level minimization in multidimensional scaling.",
            "Model and extended Kuhn-Tucker approach for bilevel multi-follower decision making in a referential-uncooperative situation.",
            "Parametric global optimisation for bilevel programming.",
            "Constraint qualification in a general class of Lipschitzian mathematical programming problems.",
            "Hybrid evolutionary algorithm for solving general variational inequality problems.",
            "Optimality conditions and duality for a class of nondifferentiable multi-objective fractional programming problems.",
            "Simulated annealing with asymptotic convergence for nonlinear constrained optimization.",
            "Multi-funnel optimization using Gaussian underestimation.",
            "A new multiobjective simulated annealing algorithm.",
            "A new global optimization method for univariate constrained twice-differentiable NLP problems.",
            "On the solution stability of variational inequalities.",
            "On the convexity of a class of quadratic mappings and its application to the problem of finding the smallest ball enclosing a given intersection of balls.",
            "Computing exact solution to nonlinear integer programming: Convergent Lagrangian and objective level cut method.",
            "An improved general extra-gradient method with refined step size for nonlinear monotone variational inequalities.",
            "Numerical solution to the optimal feedback control of continuous casting process.",
            "A particle swarm pattern search method for bound constrained global optimization.",
            "An improved inexact Newton method.",
            "A projection based multiscale optimization method for eigenvalue problems.",
            "An extension of gap functions for a system of vector equilibrium problems with applications to optimization problems.",
            "Parallelizing simulated annealing algorithms based on high-performance computer.",
            "D-optimal design of a monitoring network for parameter estimation of distributed systems.",
            "A novel clustering approach and prediction of optimal number of clusters: global optimum search with enhanced positioning.",
            "Globally optimal solutions of max-min systems.",
            "A multiplicity theorem for the Neumann p-Laplacian with an asymmetric nonsmooth potential.",
            "On quasivariational inclusion problems of type I and related problems.",
            "Linear bilevel multi-follower programming with independent followers.",
            "Global error bound for convex inclusion problems.",
            "Sufficient global optimality conditions for weakly convex minimization problems.",
            "The existence and uniqueness of solution and the convergence of a multi-step iterative algorithm for a system of variational inclusions with (A, η, m)-accretive operators.",
            "A powerful and efficient algorithm for numerical function optimization: artificial bee colony (ABC) algorithm.",
            "Sufficiency in multiobjective subset programming involving generalized type-I functions.",
            "New bounds for Morse clusters.",
            "A filled function method for constrained global optimization.",
            "Variational inclusions problems with applications to Ekeland's variational principle, fixed point and optimization problems.",
            "Necessary optimality conditions for bilevel set optimization problems.",
            "New bounds on the unconstrained quadratic integer programming problem.",
            "Entropy-like proximal algorithms based on a second-order homogeneous distance function for quasi-convex programming.",
            "Infeasibility spheres for finding robust solutions of blending problems with quadratic constraints.",
            "Some new Farkas-type results for inequality systems with DC functions.",
            "The spherical constraint in Boolean quadratic programs.",
            "Management and analysis of DNA microarray data by using weighted trees."
        ]
    },
    {
        "name": "JGO",
        "year": "2006",
        "info": "2006: Volumes\n34,\n35,\n36",
        "count": 104,
        "papers": [
            "Minimal Ellipsoid Circumscribing a Polytope Defined by a System of Linear Inequalities.",
            "System of Generalized Vector Quasi-Equilibrium Problems with Applications to Fixed Point Theorems for a Family of Nonexpansive Multivalued Mappings.",
            "Dual Characterizations of Set Containments with Strict Convex Inequalities.",
            "On a Modified Subgradient Algorithm for Dual Problems via Sharp Augmented Lagrangian.",
            "Infinite Player Noncooperative Games with Vector Payoffs Under Relative Pseudomonotonicity.",
            "Lower Bounds from State Space Relaxations for Concave Cost Network Flow Problems.",
            "A Branch-and-Bound Algorithm for Concave Network Flow Problems.",
            "Book Review: Yaroslav D. Sergeyev (2003), Arithmetic of infinity, Edizioni Orizzonti Meridionali, 112 pp., ISBN 88-89064-01-3.",
            "Global Optimization with Nonlinear Ordinary Differential Equations.",
            "Sufficiency and Duality in Multiobjective Variational Problems with Generalized Type I Functions.",
            "\"Two Nontrivial Critical Points for Nonsmooth Functionals via Local Linking and Applications\".",
            "Optimal Ordering Policy for Deteriorating Items with Partial Backlogging under Permissible Delay in Payments.",
            "Properties of Solutions for Certain Functional Equations Arising in Dynamic Programming.",
            "Optimization of Algorithmic Parameters using a Meta-Control Approach.",
            "Nontrivial Solutions for Resonant Hemivariational Inequalities.",
            "Improve-and-Branch Algorithm for the Global Optimization of Nonconvex NLP Problems.",
            "A Smoothing Method of Global Optimization that Preserves Global Minima.",
            "On Vector Implicit Variational Inequalities and Complementarity Problems.",
            "A Combined Global & Local Search (CGLS) Approach to Global Optimization.",
            "Gap Functions and Existence of Solutions to Generalized Vector Quasi-Equilibrium Problems.",
            "Global Optimization of Stochastic Black-Box Systems via Sequential Kriging Meta-Models.",
            "Constrained Inverse Minimum Spanning Tree Problems under the Bottleneck-Type Hamming Distance.",
            "Nonconvex Piecewise-Quadratic Underestimation for Global Minimization.",
            "Competitive Analysis for the On-line Truck Transportation Problem.",
            "Dynamic Nonlinear Modelization of Operational Supply Chain Systems.",
            "Necessary Optimality Conditions for Bilevel Optimization Problems Using Convexificators.",
            "A Class of Inverse Dominant Problems under Weighted l ∞ Norm and an Improved Complexity Bound for Radzik's Algorithm.",
            "Global Optimization using a Dynamical Systems Approach.",
            "The Essential Component of the Solution Set for Vector Equilibrium Problems.",
            "Trees with Equal Domination and Restrained Domination Numbers.",
            "Vector Quasi-Hemivariational Inequalities and Discontinuous Elliptic Systems.",
            "Hartley Proper Efficiency in Multiobjective Optimization Problems with Locally Lipschitz Set-valued Objectives and Constraints.",
            "Financial Optimization Models in Data Networks.",
            "Convex- and Monotone-Transformable Mathematical Programming Problems and a Proximal-Like Point Method.",
            "Existence Results for Systems of Vector Equilibrium Problems.",
            "A Numerical Approach for Solving Some Convex Maximization Problems.",
            "On a Minimum Linear Classification Problem.",
            "Improving Construction for Connected Dominating Set with Steiner Tree in Wireless Sensor Networks.",
            "Dynamic Slope Scaling Procedure and Lagrangian Relaxation with Subproblem Approximation.",
            "Complete Solutions and Extremality Criteria to Polynomial Optimization Problems.",
            "A Verified Optimization Technique to Locate Chaotic Regions of Hénon Systems.",
            "Preface.",
            "Piecewise Partially Separable Functions and a Derivative-free Algorithm for Large Scale Nonsmooth Optimization.",
            "Variational Methods in Convex Analysis.",
            "The Method of Virtual Experts in Mathematical Diagnostics.",
            "Partial Augmented Lagrangian Method and Mathematical Programs with Complementarity Constraints.",
            "Towards Strong Duality in Integer Programming.",
            "Lower Semicontinuous Regularization for Vector-Valued Mappings.",
            "Duality for Equilibrium Problems.",
            "Computing the Minkowski Sum of Prisms.",
            "Boundedness and Regularity Properties of Semismooth Reformulations of Variational Inequalities.",
            "A Branch-and-Bound Based Method for Solving Monotone Optimization Problems.",
            "A Polytope Approach to the Optimal Assembly Problem.",
            "On a Polynomial Fractional Formulation for Independence Number of a Graph.",
            "Converging Marriage in Honey-Bees Optimization and Application to Stochastic Dynamic Programming.",
            "Spin Dynamics: A Paradigm for Time Optimal Control on Compact Lie Groups.",
            "A Chain Rule for Upper Semicontinuous (CF)-Mappings.",
            "Multivalued Regularized Equilibrium Problems.",
            "Hausdorff Matching and Lipschitz Optimization.",
            "Derivative-Free Filter Simulated Annealing Method for Constrained Continuous Global Optimization.",
            "A Differential Free Point Generation Scheme in the Differential Evolution Algorithm.",
            "Approximations and Lower Bounds for the Length of Minimal Euclidean Steiner Trees.",
            "Optimality Criteria and Duality in Multiobjective Programming Involving Nonsmooth Invex Functions.",
            "Optimization of the Local Search in the Training for SAMANN Neural Network.",
            "Data Clustering Based on Maximization of Outlier Factor.",
            "A System for Distance Studies and Applications of Metaheuristics.",
            "On the Semismoothness of Projection Mappings and Maximum Eigenvalue Functions.",
            "Development and Evaluation of Decision-Making Model for Stock Markets.",
            "The Mean-Partition Problem.",
            "An Experimental Evaluation of Some Classification Methods.",
            "Generalized (η, ρ)-Invex Functions and Global Semiparametric Sufficient Efficiency Conditions for Multiobjective Fractional Programming Problems Containing Arbitrary Norms.",
            "Corrigendum for Vector Equilibrium Problems. Existence Theorems and Convexity of Solution Set.",
            "A Complementarity-based Partitioning and Disjunctive Cut Algorithm for Mathematical Programming Problems with Equilibrium Constraints.",
            "A Regularization Method for the Proximal Point Algorithm.",
            "Liberating the Subgradient Optimality Conditions from Constraint Qualifications.",
            "On System of Generalized Vector Quasi-equilibrium Problems with Set-valued Maps.",
            "Book Reviews: Boris S. Mordukhovich, Variational Analysis and Generalized Differentiation I: Basic Theory Series: Grundlehren der Mathematischen Wissenschaften, Vol 330, Volume Package: Variational Analysis and Generalized Differentiation, 2006, XXII, 582 pp., Hardcover ISBN: 3-540-25437-4 and Boris S. Mordukhovich, Variational Analysis and Generalized Differentiation II: Applications Series: Grundlehren der Mathematischen Wissenschaften, Vol 331, Volume Package: Variational Analysis and Generalized Differentiation, 2006, XXII, 612 pp., Hardcover ISBN: 3-540-25438-2.",
            "An Exact Reformulation Algorithm for Large Nonconvex NLPs Involving Bilinear Terms.",
            "Linearly Constrained Global Optimization and Stochastic Differential Equations.",
            "Analyzing the Complexity of Finding Good Neighborhood Functions for Local Search Algorithms.",
            "Generalized (η, ρ)-Invex Functions and Semiparametric Duality Models for Multiobjective Fractional Programming Problems Containing Arbitrary Norms.",
            "Some Applications to Variational-Hemivariational Inequalities of the Principle of Symmetric Criticality for Motreanu-Panagiotopoulos Type Functionals.",
            "Stability Index Method for Global Minimization.",
            "Using Global Optimization to Estimate Population Class Sizes.",
            "Strong Vector Equilibrium Problems.",
            "An LQP Method for Pseudomonotone Variational Inequalities.",
            "Bayesian Stopping Rules for Greedy Randomized Procedures.",
            "On the Maximization of (not necessarily) Convex Functions on Convex Sets.",
            "Optimal Relay Location for Resource-limited Energy-efficient Wireless Communication.",
            "A New Duality Approach to Solving Concave Vector Maximization Problems.",
            "Bounded sets of KKT multipliers in vector optimization.",
            "α -Well-posedness for Nash Equilibria and For Optimization Problems with Nash Equilibrium Constraints.",
            "Approximating Data in \\mathfrakRn by a Quadratic Underestimator with Specified Hessian Minimum and Maximum Eigenvalues.",
            "Sufficient Global Optimality Conditions for Non-convex Quadratic Minimization Problems With Box Constraints.",
            "Existence of Solutions of Generalized Vector Variational Inequalities in Reflexive Banach Spaces.",
            "Duality for Multiple Objective Fractional Subset Programming with Generalized (, ρ, σ, θ)-V-Type-I Functions.",
            "The Development of Information Guided Evolution Algorithm for Global Optimization.",
            "Generalized Invariant Monotonicity and Invexity of Non-differentiable Functions.",
            "The Semismooth-Related Properties of a Merit Function and a Descent Method for the Nonlinear Complementarity Problem.",
            "Generalized KKM Type Theorems in FC-Spaces with Applications (I).",
            "Additive Scaling and the DIRECT Algorithm.",
            "A Modification to the New Version of the Price's Algorithm for Continuous Global Optimization Problems.",
            "The Study of the System of Generalized Vector Quasi-equilibrium Problems.",
            "Convergence Analysis of a Class of Penalty Methods for Vector Optimization Problems with Cone Constraints."
        ]
    },
    {
        "name": "JGO",
        "year": "2005",
        "info": "2005: Volumes\n31,\n32,\n33",
        "count": 108,
        "papers": [
            "A Bilinear Algorithm for Optimizing a Linear Function over the Efficient Set of a Multiple Objective Linear Programming Problem.",
            "Dynamic Generalized Assignment Problems with Stochastic Demands and Multiple Agent-Task Relationships.",
            "Convexification and Concavification for a General Class of Global Optimization Problems.",
            "Improving an Upper Bound on the Stability Number of a Graph.",
            "On Absorbing Cycles in Min-Max Digraphs.",
            "A Study of Global Optimization Using Particle Swarms.",
            "Vector Equilibrium Problems. Existence Theorems and Convexity of Solution Set.",
            "Homotopy Methods for Solving Variational Inequalities in Unbounded Sets.",
            "Singularities of Monotone Vector Fields and an Extragradient-type Algorithm.",
            "Constrained Global Optimization of Expensive Black Box Functions Using Radial Basis Functions.",
            "On the Existence of Positive Solutions for Hemivariational Inequalities Driven by the p-Laplacian.",
            "Special Issue of Journal of Global Optimization on Optimization Techniques and Applications.",
            "Further Study on Augmented Lagrangian Duality Theory.",
            "Hidden Convex Minimization.",
            "On Minimax Fractional Optimality and Duality with Generalized Convexity.",
            "Conical Partition Algorithm for Maximizing the Sum of dc Ratios.",
            "A Gradient-based Continuous Method for Large-scale Optimization Problems.",
            "An Inexact Newton Method Derived from Efficiency Analysis.",
            "Single-Machine Scheduling with Exponential Processing Times and General Stochastic Cost Functions.",
            "Minimizing Completion Time Variance with Compressible Processing Times.",
            "An Approach to the Subproblem of the Cutting Angle Method of Global Optimization.",
            "Unified Approaches to Well-Posedness with Some Applications.",
            "Generalized Convexity and Nonsmooth Problems of Vector Optimization.",
            "Complementarity Problems and Variational Inequalities. A Unified Approach of Solvability by an Implicit Leray-Schauder Type Alternative.",
            "Optimality Conditions for Vector Optimization Problems of a Difference of Convex Mappings.",
            "On the Solution of Min-sum-min Problems.",
            "Fixed Points for Directional Multi-Valued k(·)-Contractions.",
            "Asset Pricing under Progressive Taxes and Existence of General Equilibrium.",
            "Optimal Covering of Plane Domains by Circles Via Hyperbolic Smoothing.",
            "Boundary Hemivariational Inequalities of Hyperbolic Type and Applications.",
            "Computation of efficient compromise arcs in Convex Quadratic Multicriteria Optimization.",
            "Foreword.",
            "Objective Function Features Providing Barriers to Rapid Global Optimization.",
            "On the Investigation of Stochastic Global Optimization Algorithms.",
            "Matching Stochastic Algorithms to Objective Function Landscapes.",
            "Optimising Noisy Objective Functions.",
            "Approximate Implementations of Pure Random Search in the Presence of Noise.",
            "Comparative Assessment of Algorithms and Software for Global Optimization.",
            "A Numerical Evaluation of Several Stochastic Algorithms on Selected Continuous Global Optimization Test Problems.",
            "Global Minimization via Piecewise-Linear Underestimation.",
            "Saddle Points and Pareto Points in Multiple Objective Programming.",
            "An Improved Interval Global Optimization Algorithm Using Higher-order Inclusion Function Forms.",
            "A Multilevel Search Algorithm for the Maximization of Submodular Functions Applied to the Quadratic Cost Partition Problem.",
            "Integration of ε-Fenchel Subdifferentials and Maximal Cyclic Monotonicity.",
            "An Integrated Inventory-Routing System for Multi-item Joint Replenishment with Limited Vehicle Capacity.",
            "On the Optimal Value Function of a Linearly Perturbed Quadratic Program.",
            "The Study of KKM Theorems With Applications to Vector Equilibrium Problems and Implict Vector Variational Inequalities Problems.",
            "Preface.",
            "Local Optimization Method with Global Multidimensional Search.",
            "Quartic Formulation of Standard Quadratic Optimization Problems.",
            "Global Optimization Versus Integer Programming in Portfolio Optimization under Nonconvex Transaction Costs.",
            "Convex Underestimation of Twice Continuously Differentiable Functions by Piecewise Quadratic Perturbation: Spline αBB Underestimators.",
            "Accelerating Branch-and-Bound through a Modeling Language Construct for Relaxation-Specific Constraints.",
            "A Global Optimization RLT-based Approach for Solving the Hard Clustering Problem.",
            "Robust Solution of Nonconvex Global Optimization Problems.",
            "Using Global Optimization for a Microparticle Identification Problem with Noisy Data.",
            "On Solving Nonconvex Optimization Problems by Reducing The Duality Gap.",
            "Multiplier Rules and Saddle-Point Theorems for Helbig's Approximate Solutions in Convex Pareto Problems.",
            "The Million-Variable \"March\" for Stochastic Combinatorial Optimization.",
            "On the Liu-Floudas Convexification of Smooth Programs.",
            "Global Optimization: Local Minima and Transition Points.",
            "Global Solution Approach for a Nonconvex MINLP Problem in Product Portfolio Optimization.",
            "Preface.",
            "A Few Words about Professor Franco Giannessi.",
            "Generalized Vector Quasi-Variational Inequality Problems Over Product Sets.",
            "A Nonlinear Scalarization Function and Generalized Quasi-vector Equilibrium Problems.",
            "Semicontinuous Mappings into T.V.S. with Applications to Mixed Vector Variational-Like Inequalities.",
            "Existence of Solutions and Star-shapedness in Minty Variational Inequalities.",
            "On Vector Variational Inequalities in Reflexive Banach Spaces.",
            "Full Nuclear Cones and a Relation Between Strong Optimization and Pareto Efficiency.",
            "A Scalarization Approach for Vector Variational Inequalities with Applications - This paper is dedicated to Professor Franco Giannessi for his 68th birthday.",
            "Global Stability Results for the Weak Vector Variational Inequality.",
            "Some Existence Results for Vector Quasivariational Inequalities Involving Multifunctions and Applications to Traffic Equilibrium Problems.",
            "Upper Semicontinuity of the Solution set to Parametric Vector Quasivariational Inequalities.",
            "Generalized Vector Variational and Quasi-Variational Inequalities with Operator Solutions.",
            "Vector Variational Inequalities for Nondifferentiable Convex Vector Optimization Problems.",
            "Existence Theorems of Simultaneous Equilibrium Problems and Generalized Vector Quasi-Saddle Points.",
            "Vector Variational Inequalities with Semi-monotone Operators.",
            "Treating Free Variables in Generalized Geometric Global Optimization Programs.",
            "Exact Algorithm for Concave Knapsack Problems: Linear Underestimation and Partition Method.",
            "On the Design of Optimization Strategies Based on Global Response Surface Approximation Models.",
            "Interval Branch and Bound with Local Sampling for Constrained Global Optimization.",
            "Proof of Convergence for a Global Optimization Algorithm for Problems with Ordinary Differential Equations.",
            "Edge-Directions of Standard Polyhedra with Applications to Network Flows.",
            "Global and Local Search Algorithms for Concave Cost Transshipment Problems.",
            "Linearity Embedded in Nonconvex Programs.",
            "Duality in Multivalued Complementarity Theory by Using Inversions and Scalar Derivatives.",
            "A Revision of the Trapezoidal Branch-and-Bound Algorithm for Linear Sum-of-Ratios Problems.",
            "Experimental Testing of Advanced Scatter Search Designs for Global Optimization of Multimodal Functions.",
            "Generalized Nonlinear Lagrangian Formulation for Bounded Integer Programming.",
            "Characterizations of Hartley Proper Efficiency in Nonconvex Vector Optimization.",
            "D.C. Versus Copositive Bounds for Standard QP.",
            "Decomposition Methods for Solving Nonconvex Quadratic Programs via Branch and Bound.",
            "Supermodularity in Mean-Partition Problems.",
            "Flowshop/No-idle Scheduling to Minimize Total Elapsed Time.",
            "On the Finite Termination of an Entropy Function Based Non-Interior Continuation Method for Vertical Linear Complementarity Problems.",
            "Uncapacitated Euclidean Hub Location: Strengthened Formulation, New Facets and a Relax-and-cut Algorithm.",
            "Perturbation of Sets and Centers.",
            "A Global Optimization Method, QBB, for Twice-Differentiable Nonconvex Optimization Problem.",
            "The Deregulated Electricity Market Viewed as a Bilevel Programming Problem.",
            "A Superlinearly Convergent SSLE Algorithm for Optimization Problems with Linear Complementarity Constraints.",
            "Minimum Ellipsoid Bounds for Solutions of Polynomial Systems via Sum of Squares.",
            "Optimality Conditions for D.C. Vector Optimization Problems Under Reverse Convex Constraints.",
            "Interval Analysis on Directed Acyclic Graphs for Global Optimization.",
            "The K th-Best Approach for Linear Bilevel Multi-follower Programming.",
            "Existence Results for Primal and Dual Generalized Vector Equilibrium Problems With Applications to Generalized Semi-Infinite Programming.",
            "A Global Optimization RLT-based Approach for Solving the Fuzzy Clustering Problem.",
            "Beyond Convex? Global Optimization is Feasible Only for Convex Objective Functions: A Theorem."
        ]
    },
    {
        "name": "JGO",
        "year": "2004",
        "info": "2004: Volumes\n28,\n29,\n30",
        "count": 83,
        "papers": [
            "Ellipsoidal Approach to Box-Constrained Quadratic Problems.",
            "A New Filled Function Method for Global Optimization.",
            "Variational Inequalities and Applications to a Continuum Model of Transportation Network with Capacity Constraints.",
            "Sufficient Optimality Condition for Vector Optimization Problems under D.C. Data.",
            "Portfolio Selection Theory with Different Interest Rates for Borrowing and Leading.",
            "Solving Variational Inequality Problems with Linear Constraints by a Proximal Decomposition Algorithm.",
            "Coloring of Double Disk Graphs.",
            "A Rigorous Lower Bound for the Optimal Value of Convex Optimization Problems.",
            "An Analytic Center Cutting Plane Method for Solving Semi-Infinite Variational Inequality Problems.",
            "On augmented Lagrangians for Optimization Problems with a Single Constraint.",
            "Neurodynamical Optimization.",
            "A New Decomposition Technique in Solving Multistage Stochastic Linear Programs by Infeasible Interior Point Methods.",
            "Some optimization problems in multivariate statistics.",
            "A Hybrid Descent Method for Global Optimization.",
            "Variational Inequalities: an Elementary Approach.",
            "A Critical Points Theorem and Nonlinear Differential Problems.",
            "Variational Analysis of the Abscissa Mapping for Polynomials via the Gauss-Lucas Theorem.",
            "The subgradient formula for the minimal time function in the case of constant dynamics in Hilbert space.",
            "Time - Dependent Spatial Price Equilibrium Problem: Existence and Stability Results for the Quantity Formulation Model.",
            "A Three-Level Mathematical Programming Model of Road Pricing.",
            "Regularity of Optimal Controls for State Constrained Problems.",
            "On necessary conditions for infinite-dimensional extremum problems.",
            "Topics on Variational Analysis and Applications to Equilibrium Problems.",
            "Coderivative Analysis of Variational Systems.",
            "Strong Local Optimality Conditions for State Constrained Control Problems.",
            "Gap Functions and Lyapunov Functions.",
            "Time-dependent Variational Inequalities and Applications to Equilibrium Problems.",
            "Three Topological Problems about Integral Functionals on Sobolev Spaces.",
            "A Linearization Method for Nondegenerate Variational Conditions.",
            "Hamilton-Jacobi Theory and Parametric Analysis in Fully Convex Problems of Optimal Control.",
            "Integer Programming Duality in Multiple Objective Programming.",
            "Optimization of Polynomial Fractional Functions.",
            "The System of Vector Quasi-Equilibrium Problems with Applications.",
            "Explicit and Implicit Continuation Algorithms for Strongly Monotone Variational Inequalities with Box Constraints.",
            "Some Convergence Results for Evolution Hemivariational Inequalities.",
            "Saddle-Point Optimality: A Look Beyond Convexity.",
            "An Exact Method for Fractional Goal Programming.",
            "A Comment on: F.K. Hwang, Y.M. Wang and J.S. Lee, 'Sortability of Multi-Partitions', Journal of Global Optimization 24 (2002), pp. 463-472.",
            "Trilinear Monomials with Mixed Sign Domains: Facets of the Convex and Concave Envelopes.",
            "Improving Interval Analysis Bounds by Translations.",
            "Global Optimization Performance Measures for Generalized Hill Climbing Algorithms.",
            "A New Successive Partition Algorithm for Concave Minimization Based on Cone Decomposition and Decomposition Cuts.",
            "A Combined Evolutionary Search and Multilevel Optimisation Approach to Graph-Partitioning.",
            "Computational Experience with a New Class of Convex Underestimators: Box-constrained NLP Problems.",
            "Probabilities, Intervals, What Next? Optimization Problems Related to Extension of Interval Computations to Situations with Partial Information about Probabilities.",
            "Advances in Interval Methods for Deterministic Global Optimization in Chemical Engineering.",
            "A Geometric Terrain Methodology for Global Optimization.",
            "An Interior Point Heuristic for the Hamiltonian Cycle Problem via Markov Decision Processes.",
            "Well-positioned Closed Convex Sets and Well-positioned Closed Convex Functions.",
            "DC Solutions of Postbuckling Problems.",
            "The Structure of Cities.",
            "Canonical Duality Theory and Solutions to Constrained Nonconvex Quadratic Programming.",
            "A New Quadratic Semi-infinite Programming Algorithm Based on Dual Parametrization.",
            "Duality in Vector Optimization in Banach Spaces with Generalized Convexity.",
            "Optimality and Duality in Nondifferentiable and Multiobjective Programming under Generalized d-Invexity.",
            "Nonsmooth Variational Problems in the Limit Case and Duality.",
            "Scalarization and Nonlinear Scalar Duality for Vector Optimization with Preferences that are not necessarily a Pre-order Relation.",
            "A New Self-Dual Embedding Method for Convex Programming.",
            "Some Results about Duality and Exact Penalization.",
            "Docking of Atomic Clusters Through Nonlinear Optimization.",
            "Optimal Multisections in Interval Branch-and-Bound Methods of Global Optimization.",
            "A Derivative Based Surrogate Model for Approximating and Optimizing the Output of an Expensive Computer Simulation.",
            "Global Optimization Issues in Multiparametric Continuous and Mixed-Integer Optimization Problems.",
            "Some Global Optimization Problems on Stiefel Manifolds.",
            "The Gradient Projection Method with Exact Line Search.",
            "Equilibrium Problems under Generalized Convexity and Generalized Monotonicity.",
            "Generalized Vector Equilibrium Problems with Trifunctions.",
            "Generalized Vector Variational Inequalities over Countable Product of Sets.",
            "A Smoothing Newton Method for Semi-Infinite Programming.",
            "An Approximation Approach to Non-strictly Convex Quadratic Semi-infinite Programming.",
            "Duality theorems and algorithms for linear programming in measure spaces.",
            "On Generalized Linearity of Quadratic Fractional Functions.",
            "Smooth Convex Approximation to the Maximum Eigenvalue Function.",
            "Second-Order Global Optimality Conditions for Optimization Problems.",
            "Convergence Properties of Dikin's Affine Scaling Algorithm for Nonconvex Quadratic Minimization.",
            "On the Convergence of a Population-Based Global Optimization Algorithm.",
            "A Geometric Representation of the Morse Fan.",
            "The Complexity of Minimum Ratio Spanning Tree Problems.",
            "A Two-Echelon Inventory Optimization Model with Demand Time Window Considerations.",
            "A New Class of Improved Convex Underestimators for Twice Continuously Differentiable Constrained NLPs.",
            "Hoffman's Least Error Bounds for Systems of Linear Inequalities.",
            "Extrema of a Real Polynomial.",
            "A New Inclusion Function for Optimization: Kite - The One Dimensional Case."
        ]
    },
    {
        "name": "JGO",
        "year": "2003",
        "info": "2003: Volumes\n25,\n26,\n27",
        "count": 72,
        "papers": [
            "Some Properties for the Euclidean Distance Matrix and Positive Semidefinite Matrix Completion Problems.",
            "MIP Models and BB Strategies in Brachytherapy Treatment Optimization.",
            "Paired-domination of Trees.",
            "Approximation of Dense-n/2-Subgraph and the Complement of Min-Bisection.",
            "On the Log-exponential Trajectory of Linear Programming.",
            "A Decision Criterion for the Optimal Number of Clusters in Hierarchical Clustering.",
            "Ab initio Tertiary Structure Prediction of Proteins.",
            "Cutting Plane Algorithms for Nonlinear Semi-Definite Programming Problems with Applications.",
            "Convex Envelopes of Monomials of Odd Degree.",
            "A Note on the Griewank Test Function.",
            "Rational Functions with Prescribed Global and Local Minimizers.",
            "Near-optimal design of Global Positioning System (GPS) networks using the Tabu Search technique.",
            "On the Efficiency of a Global Non-differentiable Optimization Algorithm Based on the Method of Optimal Set Partitioning.",
            "On Uniform Global Error Bounds for Convex Inequalities.",
            "Computation of the Reverse Shortest-Path Problem.",
            "An Electromagnetism-like Mechanism for Global Optimization.",
            "Ultraspherical Integral Method for Optimal Control Problems Governed by Ordinary Differential Equations.",
            "An Adaptive Algorithm for Vector Partitioning.",
            "Contractibility of Efficient Frontier of Simply Shaded Sets.",
            "Exceptional Family of Elements and Feasibility for Nonlinear Complementarity Problems.",
            "New Interval Analysis Support Functions Using Gradient Information in a Global Minimization Algorithm.",
            "Global Linear and Quadratic One-step Smoothing Newton Method for P0-LCP.",
            "Solving the Simple Plant Location Problem using a Data Correcting Approach.",
            "Solving an Inverse Problem for an Elliptic Equation by d.c. Programming.",
            "Minimum Maximal Flow Problem: An Optimization over the Efficient Set.",
            "A Multi-Stage Stochastic Integer Programming Approach for Capacity Expansion under Uncertainty.",
            "Optimizing Supply Shortage Decisions in Base Stock Distribution Operations.",
            "Scheduling Deliveries in Vehicles with Multiple Compartments.",
            "Decentralized Dual-Based Algorithm for Computing Optimal Flows in a General Supply Chain.",
            "An Approach for Strategic Supply Chain Planning under Uncertainty based on Stochastic 0-1 Programming.",
            "A New Hybrid Generalized Proximal Point Algorithm for Variational Inequality Problems.",
            "Vector Equilibrium Problems Under Asymptotic Analysis.",
            "A Sequential Convexification Method (SCM) for Continuous Global Optimization.",
            "Identification of the Optimal Active Set in a Noninterior Continuation Method for LCP.",
            "A Global Optimization Method for Solving Convex Quadratic Bilevel Programming Problems.",
            "An Approach to the Optimization and Approximation of Solutions of any Operator Inclusion.",
            "A Unified Monotonic Approach to Generalized Linear Fractional Programming.",
            "Target-Oriented Branch and Bound Method for Global Optimization.",
            "A Finite Algorithm for a Class of Nonlinear Multiplicative Programs.",
            "A Knowledge-Based Approach To Response Surface Modelling in Multifidelity Optimization.",
            "A Geometric Build-Up Algorithm for Solving the Molecular Distance Geometry Problem with Sparse Distance Data.",
            "A Pseudo-Global Optimization Approach with Application to the Design of Containerships.",
            "Minimum Distance Between the Faces of Two Convex Polyhedra: A Sufficient Condition.",
            "Global Optimization of Multiplicative Programs.",
            "Multivariate Polynomial Minimization and Its Application in Signal Processing.",
            "On a Minimum Linear Classification Problem.",
            "Global Minimization of a Multivariate Polynomial using Matrix Methods.",
            "Global Optimization: Fractal Approach and Non-redundant Parallelism.",
            "Infine Functions, Nonsmooth Alternative Theorems and Vector Optimization Problems.",
            "Studying the Complexity of Global Verification for NP-Hard Discrete Optimization Problems.",
            "Competitive Analysis of a Better On-line Algorithm to Minimize Total Completion Time on a Single-machine.",
            "A Trigonometric Mutation Operation to Differential Evolution.",
            "Computation of Signature Symmetric Balanced Realizations.",
            "Indefinite Stochastic Linear Quadratic Control with Markovian Jumps in Infinite Time Horizon.",
            "Numerical Solution of Hamilton-Jacobi-Bellman Equations by an Upwind Finite Volume Method.",
            "Cutting Angle Method and a Local Search.",
            "Semismooth Newton Methods for Solving Semi-Infinite Programming Problems.",
            "Constraint Selection and Deterministic Annealing.",
            "Blind Channel Identification Based on Noisy Observation by Stochastic Approximation Method.",
            "Complexity of Workforce Scheduling in Transfer Lines.",
            "Single Machine Scheduling of Unit-time Jobs with Controllable Release Dates.",
            "Routing of Railway Carriages.",
            "Cyclic Just-In-Time Sequences Are Optimal.",
            "An Application of Branch and Cut to Open Pit Mine Scheduling.",
            "On the Complexity of Equalizing Inequalities.",
            "Solving Large Scale Molecular Distance Geometry Problems by a Smoothing Technique via the Gaussian Transform and D.C. Programming.",
            "Improved Approximation Algorithms for MAX \\fracn\\text2-DIRECTED-BISECTION and MAX \\fracn\\text2-DENSE-SUBGRAPH.",
            "Gap Functions for Equilibrium Problems.",
            "Numerical Comparison of Some Penalty-Based Constraint Handling Techniques in Genetic Algorithms.",
            "Efficiency Conditions and Duality for a Class of Multiobjective Fractional Programming Problems.",
            "Nonlinear Lagrange Duality Theorems and Penalty Function Methods In Continuous Optimization.",
            "A New Approach to Multiobjective Programming with a Modified Objective Function."
        ]
    },
    {
        "name": "JGO",
        "year": "2002",
        "info": "2002: Volumes\n22,\n23,\n24",
        "count": 66,
        "papers": [
            "The system of generalized vector equilibrium problems with applications.",
            "Branch-and-bound approaches to standard quadratic optimization problems.",
            "A note on reduction of quadratic and bilinear programs with equality constraints.",
            "A class of problems where dual bounds beat underestimation bounds.",
            "Deterministic global optimization in isothermal reactor network synthesis.",
            "Equivalent formulations and necessary optimality conditions for the Lennard-Jones problem.",
            "Convergence analysis of non-quadratic proximal methods for variational inequalities in Hilbert spaces.",
            "Portfolio optimization under D.C. transaction costs and minimal transaction unit constraints.",
            "A branch-and-bound algorithm for maximizing the sum of several linear ratios.",
            "Minimal interatomic distance in Morse clusters.",
            "Bayesian heuristic approach to global optimization and examples.",
            "D.C. programming approach for multicommodity network optimization problems with step increasing cost functions.",
            "Enhancing RLT relaxations via a new class of semidefinite cuts.",
            "Convergence of duality bound method in partly convex programming.",
            "Approximation of the distribution of convergence times for stochastic global optimisation.",
            "Optimization over the efficient set: overview.",
            "A modification of Benders' decomposition algorithm for discrete subproblems: An approach for stochastic programs with integer recourse.",
            "Using concave envelopes to globally solve the nonlinear sum of ratios problem.",
            "A linear-time algorithm for solving the molecular distance geometry problem with exact inter-atomic distances.",
            "Lagrangian bounds in multiextremal polynomial and discrete optimization problems.",
            "Continuity of the optimal value function in indefinite quadratic programming.",
            "A method of truncated codifferential with application to some problems of cluster analysis.",
            "Introducing oblique norms into multiple criteria programming.",
            "Variational inequalities with operator solutions.",
            "Downward Sets and their separation and approximation properties.",
            "A D.C. biobjective location model.",
            "Heuristic optimization methods for motion planning of autonomous agricultural vehicles.",
            "A novel metaheuristics approach for continuous global optimization.",
            "An Optimization Based Robust Identification Algorithm in the Presence of Outliers.",
            "On Characterizations of Proper Efficiency for Nonconvex Multiobjective Optimization.",
            "Numerical Solution of Optimal Control Problems with Discrete-Valued System Parameters.",
            "Discrete-time Indefinite LQ Control with State and Control Dependent Noises.",
            "Trajectory Following Methods in Control System Design.",
            "Gradient Flows Computing the C-numerical Range with Applications in NMR Spectroscopy.",
            "The Geometry of the Newton Method on Non-Compact Lie Groups.",
            "Convergence Rates of Digital Diffusion Network Algorithms for Global Optimization with Applications to Image Estimation.",
            "Nonconvex Stochastic Optimization for Model Reduction.",
            "A Gradient Flow Approach to Optimal Model Reduction of Discrete-Time Periodic Systems.",
            "A Globally Convergent and Efficient Method for Unconstrained Discrete-Time Optimal Control.",
            "A Rigorous Global Optimization Algorithm for Problems with Ordinary Differential Equations.",
            "Search Heuristics for Box Decomposition Methods.",
            "Global Optimization using Dynamic Search Trajectories.",
            "Piecewise-Convex Maximization Problems: Algorithm and Computational Experiments.",
            "A Concavity Result for Network Design Problems.",
            "Cone Adaptation Strategies for a Finite and Exact Cutting Plane Algorithm for Concave Minimization.",
            "Preface.",
            "Solving Problems with Min-Type Functions by Disjunctive Programming.",
            "Optimal Hoffman-Type Estimates in Eigenvalue and Semidefinite Inequality Constraints.",
            "Fast Algorithm for the Cutting Angle Method of Global Optimization.",
            "Solving Standard Quadratic Optimization Problems via Linear, Semidefinite and Copositive Programming.",
            "Augmented Lagrangian Duality and Nondifferentiable Optimization Methods in Nonconvex Programming.",
            "An Adaptive Dual Parametrization Algorithm for Quadratic Semi-infinite Programming Problems.",
            "New Classes of Globally Convexized Filled Functions for Global Optimization.",
            "Parallel Implementation of Successive Convex Relaxation Methods for Quadratic Optimization Problems.",
            "NCP Functions Applied to Lagrangian Globalization for the Nonlinear Complementarity Problem.",
            "Gradient Approach of Computing Fixed Points of Equilibrium Problems.",
            "Generating Convex Polynomial Inequalities for Mixed 0-1 Programs.",
            "Some Fundamental Properties of Successive Convex Relaxation Methods on LCP and Related Problems.",
            "A Global Optimization Algorithm using Lagrangian Underestimates and the Interval Newton Method.",
            "Structural Optimization with FEM-based Shakedown Analyses.",
            "Global Optimization of 0-1 Hyperbolic Programs.",
            "An Algorithm for Global Optimization using the Taylor-Bernstein Form as Inclusion Function.",
            "A Polynomial Time Approximation Scheme for the Grade of Service Steiner Minimum Tree Problem.",
            "On the On-line Number of Snacks Problem.",
            "Sortability of Multi-partitions.",
            "Set Containment Characterization."
        ]
    },
    {
        "name": "JGO",
        "year": "2001",
        "info": "2001: Volumes\n19,\n20,\n21",
        "count": 69,
        "papers": [
            "Effective Relaxations and Partitioning Schemes for Solving Water Distribution Network Design Problems to Global Optimality.",
            "Parallel Simulated Annealing Algorithms in Global Optimization.",
            "Optimal Consecutive-k-out-of-(2k+1): G Cycle.",
            "Using Interval Analysis for Solving Planar Single-Facility Location Problems: New Discarding Tests.",
            "Solving the Sum-of-Ratios Problem by an Interior-Point Method.",
            "Minimum Spanning Trees with Sums of Ratios.",
            "Linear Approximations in a Dynamic Programming Approach for the Uncapacitated Single-Source Minimum Concave Cost Network Flow Problem in Acyclic Networks.",
            "Iterative Schemes for Multivalued Quasi Variational Inclusions.",
            "Finding Global Minima with a Computable Filled Function.",
            "Duality for Anticonvex Programs.",
            "Exceptional Families and Existence Results for Nonlinear Complementarity Problem.",
            "A Radial Basis Function Method for Global Optimization.",
            "On Convergence of a P-Algorithm Based on a Statistical Model of Continuously Differentiable Functions.",
            "Experiments with a new selection criterion in a fast interval optimization algorithm.",
            "Reliability and Performance of UEGO, a Clustering-based Global Optimizer.",
            "Convex Quadratic Programming Approach to the Maximum Matching Problem.",
            "New Subinterval Selection Criteria for Interval Global Optimization.",
            "A Point Balance Algorithm for the Spherical Code Problem.",
            "A New Extreme Point Algorithm and Its Application in PSQP Algorithms for Solving Mathematical Programs with Linear Complementarity Constraints.",
            "Stability Analysis of Gradient-Based Neural Networks for Optimization Problems.",
            "A Combined Topographical Search Strategy with Ellipsometric Application.",
            "Analysis of Bounds for Multilinear Functions.",
            "Handbook of Combinatorial Optimization DingZhu Du and Panos M. Pardalos (co-editors), Kluwer Academic Publishers, 1998, Vols. 1-3, ISBN: 0-7923-5285-8.",
            "Global Optimization of Nonlinear Bilevel Programming Problems.",
            "Implementing pure adaptive search for global optimization using Markov chain sampling.",
            "Filled functions for unconstrained global optimization.",
            "A Note on Equilibrium Problems with Properly Quasimonotone Bifunctions.",
            "Development of the Tangent Modulus from the Euler-Problem to Nonsmooth Materials.",
            "Development of the Tangent Modulus from the Euler-Problem to Nonsmooth Materials.",
            "Finitely convergent cutting planes for concave minimization.",
            "Semidefinite Relaxations of Fractional Programs via Novel Convexification Techniques.",
            "Progress in the Solving of a Circuit Design Problem.",
            "Capacity and flow assignment of data networks by generalized Benders decomposition.",
            "SPT: a stochastic tunneling algorithm for global optimization.",
            "Preface.",
            "Global Optimization of Marginal Functions with Applications to Economic Equilibrium.",
            "Efficiency and Stability in a Discrete Model of Country Formation.",
            "Sharing Nonconvex Costs.",
            "Global Optimization of Econometric Functions.",
            "The Concave Nontransitive Consumer.",
            "Arbitrage and Equilibrium in Economies with Externalities.",
            "Pareto Optimality in Nonconvex Economies with Infinite-dimensional Commodity Spaces.",
            "Pricing Behaviors on Networks: Some General Results for Two-way Networks.",
            "On the Efficiency of Market Equilibrium in Production Economies.",
            "Piecewise-Convex Maximization Problems.",
            "On-line k-Truck Problem and Its Competitive Algorithms.",
            "A Locally-Biased form of the DIRECT Algorithm.",
            "Existence of a Saddle Point in Nonconvex Constrained Optimization.",
            "Approximate Optimal Solutions and Nonlinear Lagrangian Functions.",
            "A Cutting Plane Approach to Solving Quadratic Infinite Programs on Measure Spaces.",
            "Convex Quadratic Programming Approach.",
            "Convex Quadratic Programming Approach to the Maximum Matching Problem.",
            "Helmut Neunzert and Abul Hasan Siddiqi Topics in Industrial Mathematics. Case Studies and Related Mathematical Methods. Applied Optimization, Vol. 42.",
            "Finding independent sets in a graph using continuous multivariable polynomial formulations.",
            "Gradient-constrained minimum networks. I. Fundamentals.",
            "A Globally and Superlinearly Convergent SQP Algorithm for Nonlinear Constrained Optimization.",
            "A convexification method for a class of global optimization problems with applications to reliability optimization.",
            "A Modified SQP Method with Nonmonotone Linesearch Technique.",
            "Finding GM-estimators with global optimization techniques.",
            "On success rates for controlled random search.",
            "On solving the maximum clique problem.",
            "A Class of Global Optimization Problems as Models of the Phase Unwrapping Problem.",
            "Index branch-and-bound algorithm for Lipschitz univariate global optimization with multiextremal constraints.",
            "A Taxonomy of Global Optimization Methods Based on Response Surfaces.",
            "Polynomial Time Approximation Scheme for Symmetric Rectilinear Steiner Arborescence Problem.",
            "An Experimental Evaluation of a Scatter Search for the Linear Ordering Problem.",
            "A Comparison of Global Optimization Methods for the Design of a High-speed Civil Transport.",
            "On the Regularity Condition for Vector Programming Problems.",
            "Global Optimality Conditions in Maximizing a Convex Quadratic Function under Convex Quadratic Constraints."
        ]
    },
    {
        "name": "JGO",
        "year": "2000",
        "info": "2000: Volumes\n16,\n17,\n18",
        "count": 78,
        "papers": [
            "Global Optimization Techniques for Mixed Complementarity Problems.",
            "k-Plane Clustering.",
            "Prokhorov Radius of a Neighborhood of Zero Described by Three Moment Constraints.",
            "On Simulated Annealing and Nested Annealing.",
            "Well-posedness for Optimization Problems with Constraints defined by Variational Inequalities having a unique solution.",
            "On Generalized Vector Equilibrium Problems.",
            "An Algorithm for Global Minimization of Linearly Constrained Quadratic Functions.",
            "The Generic Stability and Existence of Essentially Connected Components of Solutions for Nonlinear Complementarity Problems.",
            "Yair Censor and Stavros A. Zenios, Parallel Optimization - Theory, Algorithms, and Applications. Oxford University Press, New York/Oxford, 1997, xxviii+539 pages. ISBN 0-19-510062-X (US $ 85.00).",
            "Genetic and Random Search Methods in Optimal Shape Design Problems.",
            "A Decomposition Method for Global and Local Quadratic Minimization.",
            "Optimal Solutions in an Allocation Process for a Continuum of Traders.",
            "Global Optimization For Molecular Clusters Using A New Smoothing Approach.",
            "An Inner Approximation Method for Optimization over the Weakly Efficient Set.",
            "Multisection in Interval Branch-and-Bound Methods for Global Optimization II. Numerical Tests.",
            "Test Problem Generator by Neural Network for Algorithms that Try Solving Nonlinear Programming Problems Globally.",
            "A Note on a Penalty Function Approach for Solving Bilevel Linear Programs.",
            "A Stochastic Algorithm for Constrained Global Optimization.",
            "Optimal Scheduling in Parallel and Serial Manufacturing Systems via the Maximum Principle.",
            "Remarks on an algorithm for reverse convex programs.",
            "Handbook of Test Problems in Local and Global Optimization by C.A. Floudas, P.M. Pardalos et al. In Noncovex Optimization and Its Applications, volume 33, Kluwer Academic Publishers, 1999.",
            "Pivoting in an Outcome Polyhedron.",
            "Approximate energy minimization for large Lennard-Jones clusters.",
            "A Boolean Penalty Method for Zero-One Nonlinear Programming.",
            "Successive Optimization Method via Parametric Monotone Composition Formulation.",
            "Multisection in Interval Branch-and-Bound Methods for Global Optimization - I. Theoretical Results.",
            "A Dual Representation for Proper Positively Homogeneous Functions.",
            "A Tribute to Panagis Panagiotopoulos.",
            "Periodic Solutions for Second-Order Differential Equations involving Nonconvex Superpotentials.",
            "Optimal Noise Rejection in Structural Analysis by Means of Generalized Sampled-Data Hold Functions.",
            "Multiplicity of solutions for a class of nonsymmetric eigenvalue hemivariational inequalities.",
            "Conditions for an Extremum in Metric Spaces.",
            "Periodic Solutions of Superlinear Convex Autonomous Hamiltonian Systems.",
            "Resolving Singularities in a Ramsey-type Growth Model.",
            "Deterministic Global Optimization in Nonlinear Optimal Control Problems.",
            "Canonical Dual Transformation Method and Generalized Triality Theory in Nonsmooth Global Optimization.",
            "Global Optimization: On Pathlengths in Min-Max Graphs.",
            "Finite Element Approximation of Hemivariational Inequalities.",
            "Basis Reduction for the Shakedown Problem for Bounded Kinematic Hardening Material.",
            "Auxiliary Problem Principle and Proximal Point Methods.",
            "A Dynamic Domain Contraction Algorithm for Nonconvex Piecewise Linear Network Flow Problems.",
            "Development of the Tangent Modulus from the Euler-Problem to Nonsmooth Materials.",
            "A Linear Complementarity Approach for the Non-convex Seismic Frictional Interaction between Adjacent Structures under Instabilizing Effects.",
            "A Parallel Grasp for the Steiner Tree Problem in Graphs Using a Hybrid Local Search Strategy.",
            "Optimal Control of Parabolic Hemivariational Inequalities.",
            "A Heuristic Method for Nonconvex Optimization in Mechanics: Conceptual Idea, Theoretical Justification, Engineering Applications.",
            "Semicoercive Variational-hemivariational Inequalities with Unilateral Growth Conditions.",
            "Unilateral Crack Identification: A Filter-Driven, Iterative, Boundary Element Approach.",
            "Controllability and Stabilization in Elasticity, Heat Conduction and Thermoelasticity: Review of Recent Developments.",
            "Buckling of a von Kármán Plate Adhesively Connected to a Rigid Support Allowing for Delamination: Existence and Multiplicity Results.",
            "On the Seismic Disturbance Rejection of Structures.",
            "A New Approach to Optimization Under Monotonic Constraint.",
            "Approximations for Steiner Trees with Minimum Number of Steiner Points.",
            "Dominators for Multiple-objective Quasiconvex Maximization Problems.",
            "A Lagrangian Based Branch-and-Bound Algorithm for Production-transportation Problems.",
            "Splitting Algorithms for General Pseudomonotone Mixed Variational Inequalities.",
            "Generalized Invexity and Duality in Multiobjective Programming Problems.",
            "C.A. Floudas, Deterministic Global Optimization : Theory, Algorithms and Applica-tions. Kluwer Academic Publishers, 2000, 760 pp., 315 US$, hardbound, ISBN 0-7923-6041-1 (Nonconvex Optimization and Its Applications, Volume 37).",
            "Finite Exact Branch-and-Bound Algorithms for Concave Minimization over Polytopes.",
            "The Dual of a Logical Linear Programme.",
            "On Uniform Covering, Adaptive Random Search and Raspberries.",
            "A Barrier Function Method for the Nonconvex Quadratic Programming Problem with Box Constraints.",
            "Duality Gaps in Stochastic Integer Programming.",
            "Solving Nonconvex Planar Location Problems by Finite Dominating Sets.",
            "An Algorithm of Global Optimization for Rational Functions with Rational Constraints.",
            "Convergence of a Simulated Annealing Algorithm for Continuous Global Optimization.",
            "Success Guarantee of Dual Search in Integer Programming: p-th Power Lagrangian Method.",
            "Optimal Control of the Viscous Burgers Equation Using an Equivalent Index Method.",
            "On Covering Methods for D.C. Optimization.",
            "Supermodularity in Various Partition Problems.",
            "A Branch and Bound Algorithm for Solving Low Rank Linear Multiplicative and Fractional Programming Problems.",
            "On Copositive Programming and Standard Quadratic Optimization Problems.",
            "Conical Algorithm in Global Optimization for Optimizing over Efficient Sets.",
            "Dual Bounds and Optimality Cuts for All-Quadratic Programs with Convex Constraints.",
            "A Simple Finite Cone Covering Algorithm for Concave Minimization.",
            "Global Optimization on Funneling Landscapes.",
            "Global Optimization Problems in Optimal Design of Experiments in Regression Models.",
            "A Case Study of Stochastic Optimization in Health Policy: Problem Formulation and Preliminary Results."
        ]
    },
    {
        "name": "JGO",
        "year": "1999",
        "info": "1999: Volumes\n14,\n15",
        "count": 46,
        "papers": [
            "Efficient and Adaptive Lagrange-Multiplier Methods for Nonlinear Continuous Global Optimization.",
            "Fixed Point and Equilibrium Theorems in Pseudoconvex and Related Spaces.",
            "Two Strategies of Adaptive Cluster Covering with Descent and Their Comparison to Other Algorithms.",
            "On Optimization Properties of Functions, with a Concave Minorant.",
            "Computable Error Bounds for Semidefinite Programming.",
            "Comparing Nonsmooth Nonconvex Bundle Methods in Solving Hemivariational Inequalities.",
            "A Perturbation Result for a Double Eigenvalue Hemivariational Inequality with Constraints and Applications.",
            "Global Interval Methods for Local Nonsmooth Optimization.",
            "One-Parameter Families of Feasible Sets in Semi-infinite Optimization.",
            "Extension of Piyavskii's Algorithm to Continuous Global Optimization.",
            "A Branch and Contract Algorithm for Problems with Concave Univariate, Bilinear and Linear Fractional Terms.",
            "Augmented Lagrangian and Tchebycheff Approaches in Multiple Objective Programming.",
            "An Outer Approximation Algorithm Guaranteeing Feasibility of Solutions and Approximate Accuracy of Optimality.",
            "A Non-myopic Utility Function for Statistical Global Optimization Algorithms.",
            "Optimization of Molecular Similarity Index with Applications to Biomolecules.",
            "Exceptional Family of Elements for a Variational Inequality Problem and its Applications.",
            "Global Optimization by Multilevel Coordinate Search.",
            "A New Semidefinite Programming Bound for Indefinite Quadratic Forms Over a Simplex.",
            "A Nonsmooth Global Optimization Technique Using Slopes: The One-Dimensional Case.",
            "Variational Inequality with Fuzzy Convex Cone.",
            "FRACTOP: A Geometric Partitioning Metaheuristic for Global Optimization.",
            "Stochastic Global Optimization: Problem Classes and Solution Techniques.",
            "Approximating Global Quadratic Optimization with Convex Quadratic Constraints.",
            "Minimizing Increasing Star-shaped Functions Based on Abstract Convexity.",
            "Existence Theorems of Hartman-Stampacchia Type for Hemivariational Inequalities and Applications.",
            "A Method for Converting a Class of Univariate Functions into d.c. Functions.",
            "Computing a Minimum Weight Triangulation of a Sparse Point Set.",
            "Existence and Characterization of Optimal Locations.",
            "Ibrahim H. Osman and James P. Kelly (eds.), Meta-Heuristics: Theory and Applications.",
            "A Geometric Approach to Global Optimization.",
            "Generating Hard Test Instances with Known Optimal Solution for the Rectilinear Quadratic Assignment Problem.",
            "Parallel Information Algorithm with Local Tuning for Solving Multidimensional GO Problems.",
            "Comparison of One-dimensional Composite and Non-composite Passive Algorithms.",
            "Exceptional Families of Elements for Continuous Functions: Some Applications to Complementarity Theory.",
            "A Combined Feasible-Infeasible Point Continuation Method for Strongly Monotone Variational Inequality Problems.",
            "The Complexity Analysis of the Inverse Center Location Problem.",
            "Distance Geometry Optimization for Protein Structures.",
            "Surmounting the Multiple-Minima Problem in Protein Folding.",
            "Dynamics of Peptide Folding: Transition States and Reaction Pathways of Solvated and Unsolvated Tetra-Alanine.",
            "On optimization of continuous-time Markov networks in distributed computing.",
            "An Outcome Space Branch and Bound-Outer Approximation Algorithm for Convex Multiplicative Programming.",
            "Concave Programming in Control Theory.",
            "How to Extend the Concept of Convexity Cuts to Derive Deeper Cutting Planes.",
            "Polynomial algorithms for a class of minimum rank-two cost path problems.",
            "Minimization of the sum of three linear fractional functions.",
            "Heuristic Methods for Linear Multiplicative Programming."
        ]
    },
    {
        "name": "JGO",
        "year": "1998",
        "info": "1998: Volumes\n12,\n13",
        "count": 55,
        "papers": [
            "A Finite Algorithm for Global Minimization of Separable Concave Programs.",
            "Optimal Shape Design Problems for a Class of Systems Described by Hemivariational Inequalities.",
            "A Discrete Lagrangian-Based Global-Search Method for Solving Satisfiability Problems.",
            "On a Class of Functionals Whose Local Minima are Global.",
            "B. Mirkin, Mathematical Classification and Clustering.",
            "C.A. Floudas, Nonlinear and Mixed-Integer Optimization. Fundamentals and Applications.",
            "Editorial.",
            "Pattern Classification by Linear Goal Programming and its Extensions.",
            "Diverse Imprecise Goal Programming Model Formulations.",
            "Two-phases Method and Branch and Bound Procedures to Solve the Bi-objective Knapsack Problem.",
            "Inferring an ELECTRE TRI Model from Assignment Examples.",
            "Measuring Customer Satisfaction Using a Collective Preference Disaggregation Model.",
            "A Multiple Criteria Analysis Model For Real Estate Evaluation.",
            "Optimal Control Problems via Exact Penalty Functions.",
            "The Global Optimization of Variational Problems with Discontinuous Solutions.",
            "A Duality Theory for a Class of Generalized Fractional Programs.",
            "A Finite Algorithm for Globally Optimizing a Class of Rank-Two Reverse Convex Programs.",
            "Global Optimization of Nonconvex Polynomial Programming Problems Having Rational Exponents.",
            "Perturbations of Hemivariational Inequalities with Constraints and Applications.",
            "Optimal Shape Design Problems for a Class of Systems Described by Parabolic Hemivariational Inequality.",
            "János D. Pintér, Global Optimization in Action, Continuous and Lipschitz Optimization: Algorithms, Implementations and Applications. Nonconvex Optimization and Its Applications, Volume 6, Kluwer Academic Publishers, Dordrecht - Boston - London, 1996.",
            "Anatoly G. Kusraev and Seman S. Kutateladze, Subdifferentials: Theory and Application, Mathematics and its Applications Volume 323, Kluwer Academic Publishers, Dordrecht - Boston - London, 1995 (408 pp. Hb ISBN 0-7923-3389-6).",
            "A Generic Global Optimization Algorithm for the Chemical and Phase Equilibrium Problem.",
            "Global Optimization in Practice: An Application to Interactive Multiple Objective Linear Programming.",
            "On the Minimization of Difference Functions.",
            "A Multivariate Global Optimization Using Linear Bounding Functions.",
            "Numerical Methods for Solution of the Multiextremal Problems Connected with the Inverse Mathematical Programming Problems.",
            "Global Optimality Conditions for Nonconvex Optimization.",
            "Epsilon Dominance and Constraint Partitioning in Multiple Objective Problems.",
            "An Outer Approximation Algorithm for Generating All Efficient Extreme Points in the Outcome Set of a Multiple Objective Linear Programming Problem.",
            "Relaxing the Assumptions of the Multilevel Single Linkage Algorithm.",
            "Tracking Demands in Optimal Control of Managerial Systems with Continuously-Divisible, Doubly Constrained Resources.",
            "Testing the ℜ- strategy for a Reverse Convex Problem.",
            "A Constraint Satisfaction Approach to a Circuit Design Problem.",
            "Two Heuristics for the Euclidean Steiner Tree Problem.",
            "On Global Optimality Conditions for Nonlinear Optimal Control Problems.",
            "Convergent Outer Approximation Algorithms for Solving Unary Programs.",
            "A Polyhedral Approach for Nonconvex Quadratic Programming Problems with Box Constraints.",
            "A Branch and Bound Method via d.c. Optimization Algorithms and Ellipsoidal Technique for Box Constrained Nonconvex Quadratic Problems.",
            "Test Functions with Variable Attraction Regions for Global Optimization Problems.",
            "Cutting Plane/Tabu Search Algorithms for Low Rank Concave Quadratic Programming Problems.",
            "On Producing Multiple Solutions Using Repeated Trials.",
            "A Crystal Growth Approach for Topographical Global Optimization.",
            "Hysteresis and Hemivariational Inequalities: Semilinear Case.",
            "A Branch-and-Bound Approach for Solving a Class of Generalized Semi-infinite Programming Problems.",
            "A General Duality Scheme for Nonconvex Minimization Problems with a Strict Inequality Constraint.",
            "Conjugate Functions for Convex and Nonconvex Duality.",
            "Conditions for Global Optimality 2.",
            "On Standard Quadratic Optimization Problems.",
            "Proximal Point Methods and Nonconvex Optimization.",
            "A Simplified Convergence Proof for the Cone Partitioning Algorithm.",
            "A Simplicial Branch-and-Bound Method for Solving Nonconvex All-Quadratic Programs.",
            "Stochastic Methods for Practical Global Optimization.",
            "Random and Quasi-Random Linkage Methods in Global Optimization.",
            "Efficient Global Optimization of Expensive Black-Box Functions."
        ]
    },
    {
        "name": "JGO",
        "year": "1997",
        "info": "1997: Volumes\n10,\n11",
        "count": 50,
        "papers": [
            "A Theoretical Approach to Restart in Global Optimization.",
            "Finite Element Approximation of Vector-Valued Hemivariational Problems.",
            "The Hyperbell Algorithm for Global Optimization: A Random Walk Using Cauchy Densities.",
            "Bayesian Algorithms for One-Dimensional Global Optimization.",
            "Global and Local Quadratic Minimization.",
            "Restoration of Degraded Images with Maximum Entropy.",
            "Trace-Based Methods for Solving Nonlinear Global Optimization and Satisfiability Problems.",
            "Evolution towards the Maximum Clique.",
            "A New Version of the Price's Algorithm for Global Optimization.",
            "Parallel Characteristical Algorithms for Solving Problems of Global Optimization.",
            "Exceptional Families, Topological Degree and Complementarity Problems.",
            "Generalized Convex Multiplicative Programming via Quasiconcave Minimization.",
            "A Global Optimization Algorithm for Multivariate Functions with Lipschitzian First Derivatives.",
            "The Common Cycle Economic Lot Scheduling Problem with Backorders: Benefits of Controllable Production Rates.",
            "Hunting for a Smaller Convex Subdifferential.",
            "On Singular Phenomena in Certain Time-Optimal Problem.",
            "On the Complexity of Semidefinite Programs.",
            "Semidefinite Programming Relaxation for Nonconvex Quadratic Programs.",
            "Comparison of Two Reformulation-Linearization Technique Based Linear Programming Relaxations for Polynomial Programming Problems.",
            "QAPLIB - A Quadratic Assignment Problem Library.",
            "Optimizing a General Optimal Replacement Model by Fractional Programming Techniques.",
            "A Convex Envelope Formula for Multilinear Functions.",
            "Performance of Neural Net Heuristics for Maximum Clique on Diverse Highly Compressible Graphs.",
            "Copmputer Simulations in Molecular and Protein Conformations.",
            "Prediction of Oligopeptide Conformations via Deterministic Global Optimization.",
            "Global Optima of Lennard-Jones Clusters.",
            "Protein Conformation of a Lattice Model Using Tabu Search.",
            "Growth of Nanophase Clusters and Potential Energy Minima: Hysteresis, Oscillations, and Phase Transitions.",
            "Minimum Inter-Particle Distance at Global Minimizers of Lennard-Jones Clusters.",
            "A Stochastic/Perturbation Global Optimization Algorithm for Distance Geometry Problems.",
            "A Global Optimization Approach to a Water Distribution Network Design Problem.",
            "On a Branch and Bound Algorithm for the Solution of a Family of Softening Material Problems of Mechanics with Applications to the Analysis of Metallic Structures.",
            "The Generalized Linear Complementarity Problem: Least Element Theory and Z-Matrices.",
            "A Pseudo-Polynomial Primal-Dual Algorithm for Globally Solving a Production-Transportation Problem.",
            "Aspiration Based Simulated Annealing Algorithm.",
            "A Modified SQP Method and Its Global Convergence.",
            "An Unsolved Problem of Fenchel.",
            "Book Review.",
            "Book Review.",
            "Efficiency and Solution Approaches to Bicriteria Nonconvex Programs.",
            "Solving a Class of Linearly Constrained Indefinite Quadratic Problems by D.C. Algorithms.",
            "A Reduced Space Branch and Bound Algorithm for Global optimization.",
            "A Hybrid Genetic Algorithm for Nonconvex Function Minimization.",
            "Global Escape Strategies for Maximizing Quadratic Forms over a Simplex.",
            "Differential Evolution - A Simple and Efficient Heuristic for global Optimization over Continuous Spaces.",
            "The Chebyshev Hyperplane Optimization Problem.",
            "A Numerical Comparison of Some Modified Controlled Random Search Algorithms.",
            "On a Global Optimization Problem in the Study of Information Discrepancy.",
            "Weber's Problem with Attraction and Repulsion under Polyhedral Gauges.",
            "The Surgical Separation of Sets."
        ]
    },
    {
        "name": "JGO",
        "year": "1996",
        "info": "1996: Volumes\n8,\n9",
        "count": 50,
        "papers": [
            "Simulated Annealing for noisy cost functions.",
            "Optimal equi-partition of rectangular domains for parallel computation.",
            "Tabu Search for the planar three-index assignment problem.",
            "Parallel continuation-based global optimization for molecular conformation and protein folding.",
            "A decomposition algorithm for solving certain classes of production-transportation problems with concave production cost.",
            "Optimal random non-adaptive algorithm for global optimization of Brownian motion.",
            "Estimation of the Lipschitz constant of a function.",
            "Book review.",
            "A branch-and-reduce approach to global optimization.",
            "Using duality to solve generalized fractional programming problems.",
            "Characterizing global optimality for DC optimization problems under convex inequality constraints.",
            "A globally convergent method for semi-infinite linear programming.",
            "BARON: A general purpose global optimization software package.",
            "Book review.",
            "Editorial: Hierarchical and bilevel programming.",
            "A hybrid Tabu-ascent algorithm for the linear Bilevel Programming Problem.",
            "Test problem construction for linear bilevel programming problems.",
            "The application of non-linear bi-level programming to the aluminium industry.",
            "Weak via strong Stackelberg problem: New results.",
            "Solving two-Level variational inequality.",
            "Finding an efficient solution to linear bilevel programming problem: An effective approach.",
            "The hierarchical and social decision making procedure for bi-objective optimization problems by using the simple majority decision rule.",
            "Global optimization of Hölder functions.",
            "Transient and steady-state analysis of a manufacturing system with setup changes.",
            "An algorithm for maximizing a convex function over a simple set.",
            "An improved univariate global optimization algorithm with improved linear lower bounding functions.",
            "Global optimization with a limited solution time.",
            "Obtaining test problems via Internet.",
            "Parallel methods for verified global optimization practice and theory.",
            "Rigorous convex underestimators for general twice-differentiable problems.",
            "Tracking elementary particles near their primary vertex: A combinatorial approach.",
            "Subdivision of simplices relative to a cutting plane and finite concave minimization.",
            "Simple linkage: Analysis of a threshold-accepting global optimization method.",
            "NP-hardness of linear multiplicative programming and related problems.",
            "Noncoercive hemivariational inequality approach to constrained problems for star-shaped admissible sets.",
            "Second-order sufficient optimality conditions for local and global nonlinear programming.",
            "Computational experience using an edge search algorithm for linear reverse convex programs.",
            "Unconstrained minimization approaches to nonlinear complementarity problems.",
            "Optimal production control of a dynamic two-product manufacturing system with setup costs and setup times.",
            "Earliness and tardiness single machine scheduling with proportional weights.",
            "Comparative evaluation of heuristic algorithms for the single machine scheduling problem with two operations per job and time-lags.",
            "Using profit maximizing scheduling models to structure operational trade-offs and manufacturing strategy issues.",
            "Scheduling in network flow shops.",
            "Three stage generalized flowshop: Scheduling civil engineering projects.",
            "Clustered flow shop models.",
            "The master-slave paradigm in parallel computer and industrial settings.",
            "Interval Scheduling on identical machines.",
            "Machine scheduling with an availability constraint.",
            "Stochastic programming approaches to stochastic scheduling.",
            "Material allocation in MRP with tardiness penalties."
        ]
    },
    {
        "name": "JGO",
        "year": "1995",
        "info": "1995: Volumes\n6,\n7",
        "count": 51,
        "papers": [
            "An adaptive simulated annealing algorithm for global optimization over continuous variables.",
            "A global optimization algorithm for linear fractional and bilinear programs.",
            "Planar point-objective location problems with nonconvex constraints: A geometrical construction.",
            "A method for solving d.c. programming problems. Application to fuel mixture nonconvex optimization problem.",
            "Book review.",
            "Greedy Randomized Adaptive Search Procedures.",
            "The Minimum Concave Cost Network Flow Problem with fixed numbers of sources and nonlinear arc costs.",
            "The linear complementarity problem as a separable bilinear program.",
            "Nonconvex energy functions, related eigenvalue hemivariational inequalities on the sphere and applications.",
            "Efficient algorithms for solving certain nonconvex programs dealing with the product of two affine fractional functions.",
            "On complexity of subset interconnection designs.",
            "Convergence of the (GOP) algorithm for a large class of smooth optimization problems.",
            "An open global optimization problem on the unit sphere.",
            "A relaxation method for nonconvex quadratically constrained quadratic programs.",
            "A geometrical analysis of the efficient outcome set in multiple objective convex programs with linear criterion functions.",
            "Solution of linear complementarity problems using minimization with simple bounds.",
            "Global optimization of arborescent multilevel inventory systems.",
            "Simple global minimization algorithm for one-variable rational functions.",
            "Solving a class of multiplicative programming problems via c-programming.",
            "Book review.",
            "Nonconvex energy functions: Applications in engineering.",
            "Quasidifferentiability in nonsmooth, nonconvex mechanics.",
            "Path-following energy optimization in unilateral contact problems.",
            "Semicoercive variational hemivariational inequalities.",
            "On variational aspects of some nonconvex nonsmooth global optimization problem.",
            "On numerical solution of hemivariational inequalities by nonsmooth optimization methods.",
            "On the numerical treatment of nonconvex energy problems of mechanics.",
            "A reformulation-convexification approach for solving nonconvex quadratic programming problems.",
            "Some geometric results in semidefinite programming.",
            "A recipe for semidefinite relaxation for (0, 1)-quadratic programming - In memory of Svata Poljak.",
            "On global maximum of a convex terminal functional in optimal control problems.",
            "Towards Pure Adaptive Search - A general framework and a one-dimensional realisation.",
            "Book review.",
            "Preface.",
            "Computing global minima to polynomial optimization problems using Gröbner bases.",
            "Nonconvex optimization over a polytope using generalized capacity improvement.",
            "Finding all solutions of nonlinearly constrained systems of equations.",
            "On the selection of subdivision directions in interval branch-and-bound methods for global optimization.",
            "A D.C. optimization method for single facility location problems.",
            "Partly convex programming and zermelo's navigation problems.",
            "Optimization over the efficient set.",
            "On the longest circuit in an alterable digraph.",
            "A branch and bound algorithm for bound constrained optimization problems without derivatives.",
            "Book reviews.",
            "On numerical solution of hemivariational inequlities by nonsmooth optimization.",
            "Preface.",
            "αBB: A global optimization method for general constrained nonconvex problems.",
            "Global optimization for the Biaffine Matrix Inequality problem.",
            "Bilevel programming in traffic planning: Models, methods and challenge.",
            "An algorithm for solving global optimization problems with nonlinear constraints.",
            "Integral global minimization: Algorithms, implementations and numerical tests."
        ]
    },
    {
        "name": "JGO",
        "year": "1994",
        "info": "1994: Volumes\n4,\n5",
        "count": 60,
        "papers": [
            "Editorial.",
            "A finite algorithm for solving general quadratic problems.",
            "On a new stochastic global optimization algorithm based on censored observations.",
            "Accelerations for a variety of global optimization methods.",
            "Global minimization of a generalized convex multiplicative function.",
            "Image space analysis of generalized fractional programs.",
            "The simplex method as a global optimizer: A c-programming perspective.",
            "Book review.",
            "Preface.",
            "Optimization methods for computing global minima of nonconvex potential energy functions.",
            "Global minimum potential energy conformations of small molecules.",
            "A parallel build-up algorithm for global energy minimizations of molecular clusters using effective energy simulated annealing.",
            "Molecular conformation on the CM-5 by parallel two-level simulated annealing.",
            "Conformational searches for the global minimum of protein models.",
            "A quadratic assignment formulation of the molecular conformation problem.",
            "A quasiconcave minimization method for solving linear two-level programs.",
            "On the existence of efficient points in locally convex spaces.",
            "On the topological complexity of DC-sets.",
            "A new dynamic programming algorithm for the single item capacitated dynamic lot size model.",
            "The maximum clique problem.",
            "Accelerations for global optimization covering methods using second derivatives.",
            "Book review.",
            "Application of Bayesian approach to numerical methods of global and stochastic optimization.",
            "Constrained control of a nonlinear two point boundary value problem, I.",
            "A dynamic programming algorithm for dynamic lot size models with piecewise linear costs.",
            "On the solution and complexity of a generalized linear complementarity problem.",
            "Improvement on the northby algorithm for molecular conformation: Better solutions.",
            "Linear programs with an additional rank two reverse convex constraint.",
            "A finite concave minimization algorithm using branch and bound and neighbor generation.",
            "A note on P-convexity.",
            "A generalization of the construction of test problems for nonconvex optimization.",
            "On a constructive approximation of the efficient outcomes in bicriterion vector optimization.",
            "On the role of continuously differentiable exact penalty functions in constrained global optimization.",
            "Inference of a minimum size boolean function from examples by using a new efficient branch-and-bound approach.",
            "Comments on a reverse convex programming algorithm.",
            "Book reviews.",
            "Simulated annealing for constrained global optimization.",
            "A continuous version of a result of Du and Hwang.",
            "Calculus rules for global approximate minima and applications to approximate subdifferential calculus.",
            "Global optimization by random perturbation of the gradient method with a fixed parameter.",
            "Integral global optimization method for solution of nonlinear complementarity problems.",
            "A class of test functions for global optimization.",
            "Book review.",
            "Software section.",
            "Decomposition based and branch and bound global optimization approaches for the phase equilibrium problem.",
            "The cluster problem in multivariate global optimization.",
            "Topographical global optimization using pre-sampled points.",
            "An ordering (enumerative) algorithm for nonlinear 0-1 programming.",
            "Bilevel and multilevel programming: A bibliography review.",
            "Book review.",
            "Misclassification minimization.",
            "Computational comparison of two methods for constrained global optimization.",
            "Constraint decomposition algorithms in global optimization.",
            "Topographical Multilevel Single Linkage.",
            "Global optimization conditions for certain nonconvex minimization problems.",
            "A counterexample to a global optimization algorithm.",
            "Finding maximum likelihood estimators for the three-parameter Weibull distribution.",
            "On the construction of test problems for concave minimization algorithms.",
            "A global optimization problem in series-parallel networks with maximum reliability.",
            "Book review."
        ]
    },
    {
        "name": "JGO",
        "year": "1993",
        "info": "1993: Volume 3",
        "count": 33,
        "papers": [
            "A global optimization approach for the linear two-level program.",
            "Calculation of bounds on variables satisfying nonlinear inequality constraints.",
            "The application of the genetic algorithm to the minimization of potential energy functions.",
            "On the global optimization properties of finite-difference local descent algorithms.",
            "Sufficient conditions for solving linearly constrained separable concave global minimization problems.",
            "A bisection-extreme point search algorithm for optimizing over the efficient set in the linear dependence case.",
            "Convexity analysis in detecting a steel plant hidden global optimum.",
            "A wide class of test functions for global optimization.",
            "Multistart method with estimation scheme for global satisfycing problems.",
            "Parametric linear fractional programming for an unbounded feasible region.",
            "Improving Hit-and-Run for global optimization.",
            "Customizing methods for global optimization-a geometric viewpoint.",
            "Nonlinear coordinate transformations for unconstrained optimization I. Basic transformations.",
            "Consistency of a myopic Bayesian algorithm for one-dimensional global optimization.",
            "New existence results for efficient points in locally convex spaces ordered by supernormal cones.",
            "Iterative processes for solving incorrect convex variational problems.",
            "Book reviews.",
            "An improved branch and bound algorithm for minimum concave cost network flow problems.",
            "Single machine scheduling with flow time and earliness penalties.",
            "A generalized duality and applications.",
            "An outer approximation method for minimizing the product of several convex functions on a convex set.",
            "Multidimensional bisection: The performance and the context.",
            "Nonlinear coordinate transformations for unconstrained optimization II. Theoretical background.",
            "Combined branch-and-bound and cutting plane methods for solving a class of nonlinear programming problems.",
            "Book reviews.",
            "A penalty function approach for solving bi-level linear programs.",
            "Decomposition and interval arithmetic applied to global minimization of polynomial and rational functions.",
            "New properties and computational improvement of the GOP algorithm for problems with quadratic objective functions and constraints.",
            "Test case generators and computational results for the maximum clique problem.",
            "The linearization method: Principal concepts and perspective directions.",
            "Experiments using interval analysis for solving a circuit design problem.",
            "A remark on the GOP algorithm for global optimization.",
            "Book reviews."
        ]
    },
    {
        "name": "JGO",
        "year": "1992",
        "info": "1992: Volume 2",
        "count": 26,
        "papers": [
            "A new simplicial cover technique in constrained global optimization.",
            "The complementary convex structure in global optimization.",
            "Reduction of indefinite quadratic programs to bilinear programs.",
            "Global optimization of a nonconvex single facility location problem by sequential unconstrained convex minimization.",
            "Unconstrained and constrained global optimization of polynomial functions in one variable.",
            "A global optimization algorithm for polynomial programming problems using a Reformulation-Linearization Technique.",
            "Approximation in multiobjective optimization.",
            "On nonconvex optimization problems with separated nonconvex variables.",
            "A review of statistical models for global optimization.",
            "Unconstrained 0-1 nonlinear programming: A nondifferentiable approach.",
            "The normal score transformation applied to a multi-univariate method of global optimization.",
            "Tuning distributed control algorithms for optimal functioning.",
            "An optimality criterion for global quadratic optimization.",
            "A stochastic probing algorithm for global optimization.",
            "Optimal measuring signal generation.",
            "Preface.",
            "A continuous method for computing bounds in integer quadratic optimization problems.",
            "A parallel stochastic method for solving linearly constrained concave global minimization problems.",
            "An interval branch and bound algorithm for bound constrained optimization problems.",
            "Application of the renormalization group to deterministic global minimization of molecular conformation energy functions.",
            "Book review.",
            "Some computational methods for systems of nonlinear equations and systems of polynomial equations.",
            "Algorithms for multi-extremal mathematical programming problems employing the set of joint space-filling curves.",
            "A new reformulation-linearization technique for bilinear programming problems.",
            "Dual estimates in multiextremal problems.",
            "Book review."
        ]
    },
    {
        "name": "JGO",
        "year": "1991",
        "info": "1991: Volume 1",
        "count": 25,
        "papers": [
            "Bayesian methods in global optimization.",
            "Quadratic programming with one negative eigenvalue is NP-hard.",
            "Effect of the subdivision strategy on convergence and efficiency of some global optimization algorithms.",
            "On Timonov's algorithm for global optimization of univariate Lipschitz functions.",
            "Nonlinear optimization: Characterization of structural stability.",
            "Parametric simplex algorithms for solving a special class of nonconvex minimization problems.",
            "An all-linear programming relaxation algorithm for optimizing over the efficient set.",
            "What can interval analysis do for global optimization?",
            "Decomposition in global optimization.",
            "Mathematical programs with a two-dimensional reverse convex constraint.",
            "Efficient algorithms for solving rank two and rank three bilinear programming problems.",
            "Global optimization of fractional programs.",
            "On solving a D.C. programming problem by a sequence of linear programs.",
            "Stochastic techniques for global optimization: A survey of recent advances.",
            "Polyhedral annexaton, dualization and dimension reduction technique in global optimization.",
            "Algorithms for the single-source uncapacitated minimum concave-cost network flow problem.",
            "A parametric successive underestimation method for convex multiplicative programming problems.",
            "A simple solution of the van der Waerden permanent problem.",
            "An open optimization problem in statistical quality control.",
            "Global search algorithms for minimum concave-cost network flow problems.",
            "On when to stop sampling for the maximum.",
            "A global optimization approach for solving the convex multiplicative programming problem.",
            "Bounding the set of solutions of a perturbed global optimization problem.",
            "A trajectory algorithm based on the gradient method I. The search on the quasioptimal trajectories.",
            "An application of Lipschitzian global optimization to product design."
        ]
    }
]