[
    {
        "name": "JSC",
        "year": "2022",
        "info": "2022: Volumes\n108,\n109,\n110,\n111,\n112,",
        "count": 51,
        "papers": [
            "Disjoint direct product decompositions of permutation groups.",
            "On Elkies' method for bounding the transitivity degree of Galois groups.",
            "Groups whose orders factorise into at most four primes.",
            "The number of tetrahedra sharing the same metric invariants via symbolic and numerical computations.",
            "A linear-algebraic method to compute polynomial PDE conservation laws.",
            "Computation of positively graded filiform nilpotent Lie algebras in low dimensions.",
            "Entropy of tropical holonomic sequences.",
            "Probabilistic analysis of block Wiedemann for leading invariant factors.",
            "Computation of orders and cycle lengths of automorphisms of finite solvable groups.",
            "Existence and convergence of Puiseux series solutions for autonomous first order differential equations.",
            "Polynomial-division-based algorithms for computing linear recurrence relations.",
            "Shifted varieties and discrete neighborhoods around varieties.",
            "Memories on Vladimir Gerdt.",
            "Efficient rational creative telescoping.",
            "A unified FFT-based approach to maximum assignment problems related to transitive finite group actions.",
            "On surfaces of minimal degree in P5.",
            "Simplifying regular expressions further.",
            "Effective approximation of the solutions of algebraic equations.",
            "Stream/block ciphers, difference equations and algebraic attacks.",
            "Foreword: Special issue of JSC on the occasion of MEGA 2019.",
            "Autocovariance varieties of moving average random fields.",
            "Catalecticant intersections and confinement of decompositions of forms.",
            "Strict inclusions of high rank loci.",
            "Quartic monoid surfaces with maximum number of lines.",
            "Saturations of subalgebras, SAGBI bases, and U-invariants.",
            "Computing integral bases via localization and Hensel lifting.",
            "On certain polynomial systems involving Stirling numbers of second kind.",
            "Voronoi cells of varieties.",
            "Certification for polynomial systems via square subsystems.",
            "Stronger bounds on the cost of computing Gröbner bases for HFE systems.",
            "On a tropical version of the Jacobian conjecture.",
            "Initial steps in the classification of maximal mediated sets.",
            "Computing quotients by connected solvable groups.",
            "Computing representation matrices for the action of Frobenius on cohomology groups.",
            "A new general formula for the Cauchy index on an interval with subresultants.",
            "Measuring the local non-convexity of real algebraic curves.",
            "Unexpected hypersurfaces with multiple fat points.",
            "Noetherian operators and primary decomposition.",
            "Lexicographic Gröbner bases of bivariate polynomials modulo a univariate one.",
            "An in-place truncated Fourier transform.",
            "Guessing Gröbner bases of structured ideals of relations of sequences.",
            "Degree bounds for Gröbner bases of modules.",
            "Computation of Macaulay constants and degree bounds for Gröbner bases.",
            "Machine-learning the Sato-Tate conjecture.",
            "Algorithm for studying polynomial maps and reductions modulo prime number.",
            "Solving parametric systems of polynomial equations over the reals through Hermite matrices.",
            "On the classification of foliations of degree three with one singularity.",
            "Structural identifiability of series-parallel LCR systems.",
            "Heuristics to sift extraneous factors in Dixon resultants.",
            "Computing the Lie algebra of the differential Galois group: The reducible case.",
            "Effective computations of the Atiyah-Bott formula."
        ]
    },
    {
        "name": "JSC",
        "year": "2021",
        "info": "2021: Volumes\n102,\n103,\n104,\n105,\n106,\n107",
        "count": 103,
        "papers": [
            "Foreword.",
            "Algorithms for computing greatest common divisors of parametric multivariate polynomials.",
            "Standard bases over Euclidean domains.",
            "Cyclic distances of idempotent convolutional codes.",
            "Truncated normal forms for solving polynomial systems: Generalized and efficient algorithms.",
            "Removing apparent singularities of linear difference systems.",
            "Chordal graphs in triangular decomposition in top-down style.",
            "On affine tropical F5 algorithms.",
            "Complex Golay pairs up to length 28: A search via computer algebra and programmatic SAT.",
            "Bivariate Kolchin-type dimension polynomials of non-reflexive prime difference-differential ideals. The case of one translation.",
            "On the maximal number of real embeddings of minimally rigid graphs in R2, R3 and S2.",
            "Constructive arithmetics in Ore localizations enjoying enough commutativity.",
            "Formal reduction of singular linear differential systems using eigenrings: A refined approach.",
            "Computing real radicals and S-radicals of polynomial systems.",
            "Algorithms for simultaneous Hermite-Padé approximations.",
            "Computing nearby non-trivial Smith forms.",
            "Efficient Gröbner bases computation over principal ideal rings.",
            "On the primary decomposition of some determinantal hyperedge ideal.",
            "Polynomial solutions of algebraic difference equations and homogeneous symmetric polynomials.",
            "Combinatorial algorithm for the computation of cyclically standard regular bracket monomials.",
            "On the efficiency of solving Boolean polynomial systems with the characteristic set method.",
            "Necklaces count polynomial parametric osculants.",
            "Galois groups over rational function fields and Explicit Hilbert Irreducibility.",
            "Polynomial reduction and supercongruences.",
            "Computing the resolution regularity of bi-homogeneous ideals.",
            "Coisotropic hypersurfaces in Grassmannians.",
            "Weingarten calculus and the IntHaar package for integrals over compact matrix groups.",
            "Lexicographic and reverse lexicographic quadratic Gröbner bases of cut ideals.",
            "A generalization of the Katzman-Zhang algorithm.",
            "Effective coefficient asymptotics of multivariate rational functions via semi-numerical algorithms for polynomial systems.",
            "Symmetric polynomials in upper-bound semirings.",
            "Computing the real Weyl group.",
            "Definite determinantal representations via orthostochastic matrices.",
            "A multi-computational exploration of some games of pure chance.",
            "Powers of monomial ideals and the Ratliff-Rush operation.",
            "On the termination of the general XL algorithm and ordinary multinomials.",
            "A method of verifying partition congruences by symbolic computation.",
            "The Kronecker-Vahlen theorem fails in real quadratic norm-Euclidean fields.",
            "Identifiability in phylogenetics using algebraic matroids.",
            "On computing the degree of a Chebyshev Polynomial from its value.",
            "Moh's example of algebroid space curves.",
            "Computing the multilinear factors of lacunary polynomials without heights.",
            "The dimension of the moduli spaces of curves defined by topologically non quasi-homogeneous functions.",
            "Computing unit groups of curves.",
            "Distance invariant method for normalization of indexed differentials.",
            "On the computation of identities relating partition numbers in arithmetic progressions with eta quotients: An implementation of Radu's algorithm.",
            "Computing strong regular characteristic pairs with Gröbner bases.",
            "A constructive method for decomposing real representations.",
            "Singularities and genus of the k-ellipse.",
            "Reducing radicals in the spirit of Euclid.",
            "Reconstruction of rational ruled surfaces from their silhouettes.",
            "A fast algorithm for computing multiplicative relations between the roots of a generic polynomial.",
            "Approximate square-free part and decomposition.",
            "Polynomial-time proofs that groups are hyperbolic.",
            "Exact p-adic computation in Magma.",
            "On the existence of telescopers for rational functions in three variables.",
            "A condition for multiplicity structure of univariate polynomials.",
            "Unirational differential curves and differential rational parametrizations.",
            "On symbolic integration of algebraic functions.",
            "Catalan-many tropical morphisms to trees; Part I: Constructions.",
            "Combinatorial decompositions for monomial ideals.",
            "Distance to the stochastic part of phylogenetic varieties.",
            "Standard monomial theory and toric degenerations of Schubert varieties from matching field tableaux.",
            "Computing invariants for multipersistence via spectral systems and effective homology.",
            "Solving determinantal systems using homotopy techniques.",
            "Efficiently factoring polynomials modulo p4.",
            "Fast transforms over finite fields of characteristic two.",
            "Wasserstein distance to independence models.",
            "Families of blowups of the real affine plane: Classification, isotopies and visualization.",
            "New ways to multiply 3 × 3-matrices.",
            "Quasi-independence models with rational maximum likelihood estimator.",
            "Exact algorithms for semidefinite programs with degenerate feasible set.",
            "Analytic integrability of quasi-homogeneous systems via the Yoshida method.",
            "Foreword.",
            "Toward the best algorithm for approximate GCD of univariate polynomials.",
            "A fast parallel sparse polynomial GCD algorithm.",
            "On some classes of irreducible polynomials.",
            "A nearly optimal algorithm to decompose binary forms.",
            "An unwinding number pair for continuous expressions of integrals.",
            "Symbolic analysis of multiple steady states in a MAPK chemical reaction network.",
            "Multilinear polynomial systems: Root isolation and bit complexity.",
            "Verification protocols with sub-linear communication for polynomial matrix operations.",
            "Drinfeld modules with complex multiplication, Hasse invariants and factoring polynomials over finite fields.",
            "Counting invariant subspaces and decompositions of additive polynomials.",
            "On Bézout inequalities for non-homogeneous polynomial ideals.",
            "A generic and executable formalization of signature-based Gröbner basis algorithms.",
            "Rationalizability of square roots.",
            "Computing the Schur multipliers of the Lie p-rings in the family defined by a symbolic Lie p-ring presentation.",
            "Variadic equational matching in associative and commutative theories.",
            "Multivariate interpolation: Preserving and exploiting symmetry.",
            "On rational and hypergeometric solutions of linear ordinary difference equations in ΠΣ⁎-field extensions.",
            "Towards a computational proof of Vizing's conjecture using semidefinite programming and sums-of-squares.",
            "Symmetric ideals, Specht polynomials and solutions to symmetric systems of equations.",
            "Efficient q-integer linear decomposition of multivariate polynomials.",
            "qFunctions - A Mathematica package for q-series and partition theory applications.",
            "Construction of free differential algebras by extending Gröbner-Shirshov bases.",
            "A new algorithm for computing logarithmic vector fields along an isolated singularity and Bruce-Roberts Milnor ideals.",
            "Semialgebraic sets and real binary forms decompositions.",
            "On exact Reznick, Hilbert-Artin and Putinar's representations.",
            "Log-concavity of P-recursive sequences.",
            "Proof of a supercongruence via the Wilf-Zeilberger method.",
            "New bounds and an efficient algorithm for sparse difference resultants.",
            "Cohomology with local coefficients and knotted manifolds."
        ]
    },
    {
        "name": "JSC",
        "year": "2020",
        "info": "2020: Volumes\n96,\n97,\n98,\n99,\n100,\n101",
        "count": 63,
        "papers": [
            "Determining the limits of bivariate rational functions by Sturm's theorem.",
            "Deterministic polynomial factoring over finite fields: A uniform approach via P-schemes.",
            "The BMM symmetrising trace conjecture for groups G4,  G5,  G6,  G7,  G8.",
            "Sylvester double sums, subresultants and symmetric multivariate Hermite interpolation.",
            "An algorithm for computing the Hilbert-Samuel multiplicities and reductions of zero-dimensional ideals of Cohen-Macaulay local rings.",
            "Lifting tropical bitangents.",
            "Special issue on dynamic geometry and automated reasoning.",
            "New dynamics in dynamic geometry: Dragging constructed points.",
            "Reasoning about linkages with dynamic geometry.",
            "Taxonomies of geometric problems.",
            "An automated study of isoptic curves of an astroid.",
            "Non-standard analysis in dynamic geometry.",
            "Special Issue on Symbolic and Algebraic Computation: ISSAC 2017.",
            "On the algorithmic linearizability of nonlinear ordinary differential equations.",
            "Constructive arithmetics in Ore localizations of domains.",
            "Dimension and depth dependent upper bounds in polynomial ideal theory.",
            "Matrix formulæ for resultants and discriminants of bivariate tensor-product polynomials.",
            "Identifying the parametric occurrence of multiple steady states for some biological networks.",
            "On the Extended Hensel Construction and its application to the computation of real limit points.",
            "Block-Krylov techniques in the context of sparse-FGLM algorithms.",
            "Fast computation of approximant bases in canonical form.",
            "Computing lower rank approximations of matrix polynomials.",
            "Elimination-based certificates for triangular equivalence and rank profiles.",
            "Fast Hermite interpolation and evaluation over finite fields of characteristic two.",
            "Reconstruction algorithms for sums of affine powers.",
            "Linear time Fourier transforms of Sn-k-invariant functions on the symmetric group Sn.",
            "A symbolic algorithm to compute immersions of polynomial systems into linear ones up to an output injection.",
            "An adaptive prefix-assignment technique for symmetry reduction.",
            "Effective Buchberger-Zacharias-Weispfenning theory of skew polynomial extensions of subbilateral coherent rings.",
            "On types of degenerate critical points of real polynomial functions.",
            "Equations defining probability tree models.",
            "Zacharias representation of effective associative rings.",
            "The complexity of sparse Hensel lifting and sparse polynomial factorization.",
            "On the complexity of exact counting of dynamically irreducible polynomials.",
            "Tropicalization, symmetric polynomials, and complexity.",
            "The classification of real singularities using Singular Part III: Unimodal singularities of corank 2.",
            "Symbolic computation and satisfiability checking.",
            "Fully incremental cylindrical algebraic decomposition.",
            "Cylindrical algebraic decomposition with equational constraints.",
            "From simplification to a partial theory solver for non-linear real polynomial constraints.",
            "A complete and terminating approach to linear integer solving.",
            "Computing and using minimal polynomials.",
            "On conversions from CNF to ANF.",
            "Applying computer algebra systems with SAT solvers to the Williamson conjecture.",
            "The complexity of subdivision for diameter-distance tests.",
            "Noncommutative algebras, context-free grammars and algebraic Hilbert series.",
            "A census of small transitive groups and vertex-transitive graphs.",
            "Decomposing tropical rational functions.",
            "Convolutions of Liouvillian sequences.",
            "Gröbner bases for (partial) flag manifolds.",
            "Explicit formulas of Euler sums via multiple zeta values.",
            "Separation bounds for polynomial systems.",
            "Normal bases from 1-dimensional algebraic groups.",
            "Improved bounds on absolute positiveness of multivariate polynomials.",
            "Homogeneous Einstein metrics on Stiefel manifolds associated to flag manifolds with two isotropy summands.",
            "On the solutions of holonomic third-order linear irreducible differential equations in terms of hypergeometric functions.",
            "Hyperbolicity of the canonical genus two knots.",
            "In-depth comparison of the Berlekamp-Massey-Sakata and the Scalar-FGLM algorithms: The adaptive variants.",
            "Ranks and symmetric ranks of cubic surfaces.",
            "Automated proof of mixed trigonometric-polynomial inequalities.",
            "Subresultants of (x-α)m and (x-β)n, Jacobi polynomials and complexity.",
            "An approach for computing families of multi-branch-point covers and applications for symplectic Galois groups.",
            "Faster interpolation algorithms for sparse multivariate polynomials given by straight-line programs."
        ]
    },
    {
        "name": "JSC",
        "year": "2019",
        "info": "2019: Volumes\n90,\n91,\n92,\n93,\n94,\n95",
        "count": 74,
        "papers": [
            "Symbolic computation in software science.",
            "Mechanical synthesis of sorting algorithms for binary trees by logic and combinatorial techniques.",
            "Nominal unification with atom-variables.",
            "Formal analysis of continuous-time systems using Fourier transform.",
            "Aligning concepts across proof assistant libraries.",
            "Using jointly geometry and algebra to determine RC-constructibility.",
            "Formalization of the arithmetization of Euclidean plane geometry and applications.",
            "Foreword on the special issue of JSC on the occasion of MEGA 2017.",
            "On the postulation of lines and a fat line.",
            "Ideals of the form I1(XY).",
            "Bar code for monomial ideals.",
            "Constructing equivariant vector bundles via the BGG correspondence.",
            "The Bordiga surface as critical locus for 3-view reconstructions.",
            "Computing the monodromy and pole order filtration on Milnor fiber cohomology of plane curves.",
            "Algorithms for tight spans and tropical linear spaces.",
            "The tropical analogue of the Helton-Nie conjecture is true.",
            "An approach to constrained polynomial optimization via nonnegative circuit polynomials and geometric programming.",
            "Beyond polyhedral homotopies.",
            "Imaginary projections of polynomials.",
            "Waring decompositions and identifiability via Bertini and Macaulay2 software.",
            "Proof of the BMR conjecture for G20 and G21.",
            "Some criteria for Gröbner bases and their applications.",
            "Computing stable epimorphisms onto finite groups.",
            "Univariate real root isolation in an extension field and applications.",
            "Validity proof of Lazard's method for CAD construction.",
            "New refiners for permutation group search.",
            "Effective computation of base points of ideals in two-dimensional local rings.",
            "Computing finite semigroups.",
            "An integro-differential structure for Dirac distributions.",
            "Factorization of motion polynomials.",
            "Polynomials describing the multiplication in finitely generated torsion-free nilpotent groups.",
            "Virtual links with finite medial bikei.",
            "The maximum likelihood degree of toric varieties.",
            "On the complexity of the Lickteig-Roy subresultant algorithm.",
            "Computing the bound of an Ore polynomial. Applications to factorization.",
            "Computing subfields of number fields and applications to Galois group computations.",
            "Asymptotic r-log-convexity and P-recursive sequences.",
            "An equivalence theorem for regular differential chains.",
            "Rational curves over generalized complex numbers.",
            "On the blowup of affine spaces along monomial ideals: Tameness.",
            "Symmetric polynomials in tropical algebra semirings.",
            "Computation of graded ideals with given extremal Betti numbers in a polynomial ring.",
            "Proof of the Wilf-Zeilberger conjecture for mixed hypergeometric terms.",
            "An algorithm for computing Schur indices of characters.",
            "The complexity of computing all subfields of an algebraic number field.",
            "Bivariate chromatic polynomials in computer algebra.",
            "Algorithms for weighted sum of squares decomposition of non-negative univariate polynomials.",
            "Semi-automated proof of supercongruences on partial sums of hypergeometric series.",
            "On divisor-closed submonoids and minimal distances in finitely generated monoids.",
            "Automating algorithm selection: Checking for matrix properties that can simplify computations.",
            "The limit point and the T-function.",
            "The fiber cone of a monomial ideal in two variables.",
            "Quadratic 2-step Lie algebras: Computational algorithms and classification.",
            "A computable extension for D-finite functions: DD-finite functions.",
            "Functors of liftings of projective schemes.",
            "On the factorization of non-commutative polynomials (in free associative algebras).",
            "An implementation of effective homotopy of fibrations.",
            "Splitting quaternion algebras over quadratic number fields.",
            "Formal solutions of singularly-perturbed linear differential systems.",
            "Integration in finite terms with dilogarithmic integrals, logarithmic integrals and error functions.",
            "Fast systematic encoding of multiplicity codes.",
            "An algorithm for providing the normal forms of spatial quasi-homogeneous polynomial differential systems.",
            "The use of permutation representations in structural computations in large finite matrix groups.",
            "Construction of all polynomial relations among Dedekind eta functions of level N.",
            "Invariant algebraic sets and symmetrization of polynomial systems.",
            "The irreducible characters of the Sylow p-subgroups of the Chevalley groups D6(pf) and E6(pf).",
            "A general framework for Noetherian well ordered polynomial reductions.",
            "Bounding the degrees of a minimal μ-basis for a rational surface parametrization.",
            "Root separation for trinomials.",
            "On the prime graph question for integral group rings of Conway simple groups.",
            "Integral Hodge conjecture for Fermat varieties.",
            "Symbolic computation on the partition lattice of an n-set.",
            "Existence of Pythagorean-hodograph quintic interpolants to spatial G1 Hermite data with prescribed arc lengths.",
            "Apparent singularities of D-finite systems."
        ]
    },
    {
        "name": "JSC",
        "year": "2018",
        "info": "2018: Volumes\n84,\n85,\n86,\n87,\n88,\n89",
        "count": 62,
        "papers": [
            "A symbolic approach to multiple zeta values at negative integers.",
            "Dancing samba with Ramanujan partition congruences.",
            "Improving root separation bounds.",
            "Reduction operators and completion of rewriting systems.",
            "Subset sum problem in polycyclic groups.",
            "Prony's method in several variables: Symbolic solutions by universal interpolation.",
            "Computation of dilated Kronecker coefficients.",
            "Certifying solutions to overdetermined and singular polynomial systems over ℚ.",
            "Preface.",
            "Similarity detection of rational space curves.",
            "Solving generic nonarchimedean semidefinite programs using stochastic game algorithms.",
            "Baby-step giant-step algorithms for the symmetric group.",
            "The Brun gcd algorithm in high dimensions is almost always subtractive.",
            "Reduction-based creative telescoping for fuchsian D-finite functions.",
            "New order bounds in differential elimination algorithms.",
            "Positive root isolation for poly-powers by exclusion and differentiation.",
            "Generating sets for the multiplicative groups of algebras over finite fields and expander graphs.",
            "A factorization algorithm for G-algebras and its applications.",
            "Solving rank-constrained semidefinite programs in exact arithmetic.",
            "Time and space efficient generators for quasiseparable matrices.",
            "Algorithmic operator algebras via normal forms in tensor rings.",
            "On Gröbner bases and Krull dimension of residue class rings of polynomial rings over integral domains.",
            "Deterministic genericity for polynomial ideals.",
            "A near-optimal subdivision algorithm for complex root isolation based on the Pellet test and Newton iteration.",
            "The Chow form of the essential variety in computer vision.",
            "Computing Chebyshev knot diagrams.",
            "Small partial Latin squares that embed in an infinite group but not into any finite group.",
            "A smoothness test for higher codimensions.",
            "Embedding algorithms and applications to differential equations.",
            "Singularities of plane rational curves via projections.",
            "Difference indices of quasi-prime difference algebraic systems.",
            "Sparse resultants and straight-line programs.",
            "Primitive transcendental functions and symbolic computation.",
            "Computing linear systems on metric graphs.",
            "Projective and affine symmetries and equivalences of rational curves in arbitrary dimension.",
            "Computing the Betti table of a monomial ideal: A reduction algorithm.",
            "Discovering linear-recurrent solutions to Hofstadter-like recurrences using symbolic computation.",
            "Deciding the existence of rational general solutions for first-order algebraic ODEs.",
            "Triangular bases of integral closures.",
            "Bit complexity for multi-homogeneous polynomial system solving - Application to polynomial minimization.",
            "On the last fall degree of zero-dimensional Weil descent systems.",
            "Effective identifiability criteria for tensors and polynomials.",
            "Corrigendum to \"Faster algorithms for computing Hong's bound on absolute positiveness\" [J. Symb. Comput. 45 (2010) 677-683].",
            "Foreword to special issue.",
            "Motion planning and control of a planar polygonal linkage.",
            "Combinatorial rigidity of incidence systems and application to dictionary learning.",
            "Motions of grid-like reflection frameworks.",
            "The hypermetric cone and polytope on eight vertices and some generalizations.",
            "On the complexity of integer matrix multiplication.",
            "Bounding the degree of solutions of differential equations.",
            "Gröbner bases and cocyclic Hadamard matrices.",
            "Effective bounds for the consistency of differential equations.",
            "Syzygies for translational surfaces.",
            "Pisot unit generators in number fields.",
            "Flat extension and ideal projection.",
            "On evaluation codes coming from a tower of function fields.",
            "Computing with quadratic forms over number fields.",
            "Comprehensive Gröbner systems in PBW algebras, Bernstein-Sato ideals and holonomic D-modules.",
            "Elliptic function based algorithms to prove Jacobi theta function relations.",
            "Fast operations on linearized polynomials and their applications in coding theory.",
            "On a problem of Pethő.",
            "Matrix-F5 algorithms and tropical Gröbner bases computation."
        ]
    },
    {
        "name": "JSC",
        "year": "2017",
        "info": "2017: Volumes\n78,\n79,\n80,\n81,\n82,\n83",
        "count": 101,
        "papers": [
            "Special issue on algorithms and software for computational topology.",
            "Certified computation of planar Morse-Smale complexes.",
            "Birth and death in discrete Morse theory.",
            "Reducing complexes in multidimensional persistent homology theory.",
            "Phat - Persistent Homology Algorithms Toolbox.",
            "A persistence landscapes toolbox for topological statistics.",
            "MICC: A tool for computing short distances in the curve complex.",
            "Foreword.",
            "Bases of subalgebras of K〚x〛 and K[x].",
            "Extreme rays of Hankel spectrahedra for ternary forms.",
            "Border bases for lattice ideals.",
            "A short proof for the open quadrant problem.",
            "Liaison linkages.",
            "The maximum likelihood data singular locus.",
            "Estimating the number of roots of trinomials over finite fields.",
            "Standard bases in mixed power series and polynomial rings over rings.",
            "Types of signature analysis in reliability based on Hilbert series.",
            "On the auto Igusa-zeta function of an algebraic curve.",
            "The Hurwitz form of a projective variety.",
            "Bounding the number of limit cycles for a polynomial Liénard system by using regular chains.",
            "Improved methods for the construction of relative invariants for permutation groups.",
            "A Henneberg-based algorithm for generating tree-decomposable minimally rigid graphs.",
            "CIO and ring graphs: Deficiency and testing.",
            "Algorithms for polycyclic-by-finite groups.",
            "Resultants over commutative idempotent semirings I: Algebraic aspect.",
            "Construction algorithms for rational cubic surfaces.",
            "Computation of Jeffrey-Kirwan residues using Gröbner bases.",
            "Polynomial dynamics of human blood genotypes frequencies.",
            "The invariant rings of the Sylow groups of GU(3, q2), GU(4, q2), Sp(4, q) and O+(4, q) in the natural characteristic.",
            "On rational functions with monodromy group M11.",
            "List decoding algorithm based on voting in Gröbner bases for general one-point AG codes.",
            "A new faster algorithm for factoring skew polynomials over finite fields.",
            "On the maximum computing time of the bisection method for real root isolation.",
            "Computing isolated orbifolds in weighted flag varieties.",
            "On ramification indices of formal solutions of constructive linear ordinary differential systems.",
            "Algorithmic calculus for Lie determining systems.",
            "Special Issue on Program Verification, Automated Debugging and Symbolic Computation.",
            "Intruder deducibility constraints with negation. Decidability and application to secured service compositions.",
            "Satisfiability of general intruder constraints with and without a set constructor.",
            "Barrier certificates revisited.",
            "Revision with probability.",
            "Replacing conjectures by positive knowledge: Inferring proven precise worst-case execution time bounds using symbolic execution.",
            "A generic framework for symbolic execution: A coinductive approach.",
            "Skalpel: A constraint-based type error slicer for Standard ML.",
            "Mechanically certifying formula-based Noetherian induction reasoning.",
            "A tropical construction of a family of real reducible curves.",
            "Symbolic computation of some power-trigonometric series.",
            "A certified numerical algorithm for the topology of resultant and discriminant curves.",
            "Perturbation results on the zero-locus of a polynomial.",
            "Matrix-F5 algorithms over finite-precision complete discrete valuation fields.",
            "Multiple binomial sums.",
            "Betti numbers of binomial ideals.",
            "Monomial right ideals and the Hilbert series of noncommutative modules.",
            "Gröbner bases and their application to the Cauchy problem on finitely generated affine monoids.",
            "F-threshold functions: Syzygy gap fractals and the two-variable homogeneous case.",
            "On the arithmetic complexity of Strassen-like matrix multiplications.",
            "The Euclidean distance degree of Fermat hypersurfaces.",
            "Efficient characteristic refinements for finite groups.",
            "Revealing regions of multiple steady states in heterogeneous catalytic chemical reaction networks using Gröbner basis.",
            "Sparse FGLM algorithms.",
            "Constructive General Neron Desingularization for one dimensional local rings.",
            "On the computation of the HNF of a module over the ring of integers of a number field.",
            "Summation Theory II: Characterizations of RΠΣ⁎-extensions and algorithmic aspects.",
            "Binomial difference ideals.",
            "Fault-tolerant modular reconstruction of rational numbers.",
            "A survey on signature-based algorithms for computing Gröbner bases.",
            "Open weak CAD and its applications.",
            "On the complexity of multiplication in the Iwahori-Hecke algebra of the symmetric group.",
            "Symmetrizing tableaux and the 5th case of the Foulkes conjecture.",
            "Algorithm for computing μ-bases of univariate polynomials.",
            "Algebraic invariants of projective monomial curves associated to generalized arithmetic sequences.",
            "Implicitization of hypersurfaces.",
            "Formal solutions of completely integrable Pfaffian systems with normal crossings.",
            "Effective criteria for bigraded birational maps.",
            "A sharp bound on the number of real intersection points of a sparse plane curve with a line.",
            "A modular algorithm to compute the generalized Hermite normal form for Z[x]-lattices.",
            "Numerical algorithms for detecting embedded components.",
            "Improvements of Lagrange's bound for polynomial roots.",
            "Computing Segre classes in arbitrary projective varieties.",
            "Parametric FGLM algorithm.",
            "A hybrid symbolic-numerical approach to the center-focus problem.",
            "A test for monomial containment.",
            "Algebraic local cohomology with parameters and parametric standard bases for zero-dimensional ideals.",
            "Bivariate triangular decompositions in the presence of asymptotes.",
            "A symbolic decision procedure for relations arising among Taylor coefficients of classical Jacobi theta functions.",
            "Corrigendum to \"The F5 criterion revised\" [J. Symb. Comput. 46 (2) (2011) 1017-1029].",
            "Special issue on the conference ISSAC 2015: Symbolic computation and computer algebra.",
            "Near optimal subdivision algorithms for real root isolation.",
            "Linear algebra for computing Gröbner bases of linear recursive multidimensional sequences.",
            "Algebraic diagonals and walks: Algorithms, bounds, complexity.",
            "Structure of polyzetas and explicit representation on transcendence bases of shuffle and stuffle algebras.",
            "Buchberger-Weispfenning theory for effective associative rings.",
            "Amenability of Schreier graphs and strongly generic algorithms for the conjugacy problem.",
            "Harmonic sums and polylogarithms at non-positive multi-indices.",
            "Fast computation of the rank profile matrix and the generalized Bruhat decomposition.",
            "Computing separability elements for the sentence-ambient algebra of split ideal codes.",
            "On deflation and multiplicity structure.",
            "Computing hypergeometric solutions of second order linear differential equations using quotients of formal solutions and integral bases.",
            "Computing minimal interpolation bases.",
            "Gröbner fans of x-homogeneous ideals in R〚t〛[x].",
            "A probabilistic algorithm for computing data-discriminants of likelihood equations."
        ]
    },
    {
        "name": "JSC",
        "year": "2016",
        "info": "2016: Volumes\n72,\n73,\n74,\n75,\n76,\n77",
        "count": 92,
        "papers": [
            "A certificate for semidefinite relaxations in computing positive-dimensional real radical ideals.",
            "Continued fraction real root isolation using the Hong root bound.",
            "On tubular vs. swung surfaces.",
            "On using Lazard's projection in CAD construction.",
            "A difference ring theory for symbolic summation.",
            "Numerically deciding the arithmetically Cohen-Macaulayness of a projective scheme.",
            "Stratification of the space of foliations on CP2.",
            "Using extended Derksen ideals in computational invariant theory.",
            "Common composites of triangular polynomial systems and hash functions.",
            "Computing the V-saturation of finitely-generated submodules of V[X]m where V is a valuation domain.",
            "Proving inequalities and solving global optimization problems via simplified CAD projection.",
            "A simple and fast online power series multiplication and its analysis.",
            "Ancilla-free synthesis of large reversible functions using binary decision diagrams.",
            "On the small-weight codewords of some Hermitian codes.",
            "Computing real roots of real polynomials.",
            "Geometry of the ringed surfaces in R4 that generate spatial Pythagorean hodographs.",
            "A combinatorial description of finite O-sequences and aCM genera.",
            "Algorithms to compute the topological Euler characteristic, Chern-Schwartz-MacPherson class and Segre class of projective varieties.",
            "Efficient edge-skeleton computation for polytopes defined by oracles.",
            "Determining cyclicity of finite modules.",
            "Solving a sparse system using linear algebra.",
            "Computing the intersections of three conics according to their Jacobian curve.",
            "Semi-automated verification of security proofs of quantum cryptographic protocols.",
            "Continuous detection of the variations of the intersection curve of two moving quadrics in 3-dimensional projective space.",
            "Computing individual Kazhdan-Lusztig basis elements.",
            "Center problem in the center manifold for quadratic differential systems in R3.",
            "Propagating weights of tori along free resolutions.",
            "Complexity of tropical Schur polynomials.",
            "Probabilistic analysis of Wiedemann's algorithm for minimal polynomial computation.",
            "Symbolic computation on a second-order KdV equation.",
            "Knapsack problems in products of groups.",
            "Local positivity of line bundles on smooth toric varieties and Cayley polytopes.",
            "Integrability test for evolutionary lattice equations of higher order.",
            "Solution of a quadratic quaternion equation with mixed coefficients.",
            "Polynomial-time solvable #CSP problems via algebraic models and Pfaffian circuits.",
            "Nearly optimal refinement of real roots of a univariate polynomial.",
            "Real root finding for determinants of linear matrices.",
            "Certified predictor-corrector tracking for Newton homotopies.",
            "Better answers to real questions.",
            "Lifting Markov bases and higher codimension toric fiber products.",
            "Refined algorithms to compute syzygies.",
            "Algorithms for computing symbolic representations of basic e-sums and their application to composites.",
            "The classification of real singularities using Singular. Part II: The structure of the equivalence classes of the unimodal singularities.",
            "Recognizing implicitly given rational canal surfaces.",
            "Border basis relaxation for polynomial optimization.",
            "On new types of rational rotation-minimizing frame space curves.",
            "Isoclinism of crossed modules.",
            "Probabilistic analyses of the plain multiple gcd algorithm.",
            "Algorithms for curves with one place at infinity.",
            "Implicitization of rational hypersurfaces via linear syzygies: A practical overview.",
            "The power of pyramid decomposition in Normaliz.",
            "Liouville integrability: An effective Morales-Ramis-Simó theorem.",
            "Genus 3 curves whose Jacobians have endomorphisms by.",
            "Binomial fibers and indispensable binomials.",
            "Quality of positive root bounds.",
            "Deciding positivity of multisymmetric polynomials.",
            "Desingularization of Ore operators.",
            "Syzygies of Jacobian ideals and weighted homogeneous singularities.",
            "Examples of special quadratic birational transformations into complete intersections of quadrics.",
            "Corrigendum to \"Finiteness theorems and algorithms for permutation invariant chains of Laurent lattice ideals\" [J. Symb. Comput. 50(March 2013) 314-334].",
            "Special issue on the conference ISSAC 2014: Symbolic computation and computer algebra.",
            "Faster sparse multivariate polynomial interpolation of straight-line programs.",
            "On the computation of the parameterized differential Galois group for a second-order linear differential equation with differential parameters.",
            "Dual bases for noncommutative symmetric and quasi-symmetric functions via monoidal factorization.",
            "Quantifier elimination by cylindrical algebraic decomposition based on regular chains.",
            "Logspace computations in graph products.",
            "Real quantifier elimination for the synthesis of optimal numerical algorithms (Case study: Square root computation).",
            "Factoring linear partial differential operators in n variables.",
            "An isomorphism test for modules over a non-commutative PID. Applications to similarity of Ore polynomials.",
            "Bounded-degree factors of lacunary multivariate polynomials.",
            "The prompter method: A treatment for hard-to-solve iterative functional equations.",
            "Sparse multivariate function recovery with a small number of evaluations.",
            "Quantum Fourier transform over symmetric groups - improved result.",
            "Tame decompositions and collisions.",
            "Truth table invariant cylindrical algebraic decomposition.",
            "Cylindrical algebraic decomposition using local projections.",
            "Rational curves on Calabi-Yau threefolds: Verifying mirror symmetry predictions.",
            "On the effective and automatic enumeration of polynomial permutation classes.",
            "Extremely strong Shoda pairs with GAP.",
            "On the complexity of computing Gröbner bases for weighted homogeneous systems.",
            "Resultant of an equivariant polynomial system with respect to the symmetric group.",
            "Associated primes of spline complexes.",
            "Periodic continued fractions and elliptic curves over quadratic fields.",
            "Random sampling in computational algebra: Helly numbers and violator spaces.",
            "Additive normal forms and integration of differential fractions.",
            "On a conjecture of Vasconcelos via Sylvester forms.",
            "Third-order ordinary differential equations equivalent to linear second-order ordinary differential equations via tangent transformations.",
            "Continuous amortization and extensions: With applications to bisection-based root isolation.",
            "Implicitizing rational surfaces using moving quadrics constructed from moving planes.",
            "Estimating the number of tetrahedra determined by volume, circumradius and four face areas using Groebner basis.",
            "Shortest division chains in unique factorization domains.",
            "Efficient computation of maximal orders in Artin-Schreier-Witt extensions."
        ]
    },
    {
        "name": "JSC",
        "year": "2015",
        "info": "2015: Volumes\n66,\n67,\n68,\n69,\n70,\n71",
        "count": 64,
        "papers": [
            "An algorithm to compute the Hilbert depth.",
            "Genus computation of global function fields.",
            "On the length of integers in telescopers for proper hypergeometric terms.",
            "From approximate factorization to root isolation with application to cylindrical algebraic decomposition.",
            "On the complexity of Hilbert refutations for partition.",
            "An algorithm for computing mixed sums of products of Bernoulli polynomials and Euler polynomials.",
            "Finding residue integrals for systems of non-algebraic equations in Cn.",
            "Corrigendum to \"A long note on Mulders' short product\" [J. Symb. Comput 37 (3) (2004) 391-401].",
            "Weight ideals associated to regular and log-linear arrays.",
            "Point equivalence of second-order ODEs: Maximal invariant classification order.",
            "Regular expression order-sorted unification and matching.",
            "A generalisation of Miller's algorithm and applications to pairing computations on abelian varieties.",
            "Bottom-up rewriting for words and terms.",
            "On the existence of telescopers for mixed hypergeometric terms.",
            "A practical model for computation with matrix groups.",
            "The classification of real singularities using Singular Part I: Splitting Lemma and simple singularities.",
            "Subresultants, Sylvester sums and the rational interpolation problem.",
            "Separating linear forms and Rational Univariate Representations of bivariate systems.",
            "On full rank differential systems with power series coefficients.",
            "Integrality and arithmeticity of solvable linear groups.",
            "Quantifier elimination for a class of exponential polynomial formulas.",
            "Sparse difference resultant.",
            "A generic position based method for real root isolation of zero-dimensional polynomial systems.",
            "An algorithmic approach to Ramanujan-Kolberg identities.",
            "Robust toric ideals.",
            "Complete intersections in simplicial toric varieties.",
            "Metric problems for quadrics in multidimensional space.",
            "Triangular systems and a generalization of primitive polynomials.",
            "Special issue on effective methods in algebraic computation.",
            "On the free resolution induced by a Pommaret basis.",
            "Multiple Bernoulli series and volumes of moduli spaces of flat bundles over surfaces.",
            "Maximally positive polynomial systems supported on circuits.",
            "The computation of generalized Ehrhart series in Normaliz.",
            "Term-ordering free involutive bases.",
            "Explicit computations of invariants of plane quartic curves.",
            "Systems of equations with a single solution.",
            "Computation of topological invariants for real projective surfaces with isolated singularities.",
            "The theory of bonds II: Closed 6R linkages with maximal genus.",
            "Separating inequalities for nonnegative polynomials that are not sums of squares.",
            "A Wronskian approach to the real τ-conjecture.",
            "On Alexander-Conway polynomials of two-bridge links.",
            "Relaxed Hensel lifting of triangular sets.",
            "Algorithms for Mumford curves.",
            "The three-state toric homogeneous Markov chain model has Markov degree two.",
            "Combinatorial excess intersection.",
            "Stratified order one differential equations in positive characteristic.",
            "Special issue on symbolic computation in software science.",
            "Exploring conditional rewriting logic computations.",
            "Parametrized automata simulation and application to service composition.",
            "Synthesis of list algorithms by mechanical proving.",
            "Formalizing polygonal knot origami.",
            "Learning-assisted theorem proving with millions of lemmas.",
            "Beyond polynomials and Peano arithmetic - automation of elementary and ordinal interpretations.",
            "Some computational aspects of solvable regular covers of graphs.",
            "Constructing a single cell in cylindrical algebraic decomposition.",
            "On the complexity of the F5 Gröbner basis algorithm.",
            "The Rees Algebra of a monomial plane parametrization.",
            "Krandick's proof of Lagrange's real root bound claim.",
            "Special algorithm for stability analysis of multistable biological regulatory systems.",
            "Towards semantic mathematical editing.",
            "Equivalence of differential equations of order one.",
            "Field of moduli of generalized Fermat curves of type (k, 3) with an application to non-hyperelliptic dessins d'enfants.",
            "Computing Galois groups of polynomials (especially over function fields of prime characteristic).",
            "Random matrices over a DVR and LU factorization."
        ]
    },
    {
        "name": "JSC",
        "year": "2014",
        "info": "2014: Volumes\n60,\n61-62,\n63,\n64,\n65",
        "count": 37,
        "papers": [
            "Gröbner-Shirshov bases for the non-symmetric operads of dendriform algebras and quadri-algebras.",
            "Univariate polynomial solutions of algebraic difference equations.",
            "Annihilators of Artinian modules compatible with a Frobenius map.",
            "Self-dual skew codes and factorization of skew polynomials.",
            "Closed form solutions of linear difference equations in terms of symmetric products.",
            "Converting subalgebra bases with the Sagbi walk.",
            "Practical graph isomorphism, II.",
            "Faster arithmetic for number-theoretic transforms.",
            "Automated simplification of large symbolic expressions.",
            "Symbolic computation in applied computational mechanics.",
            "Symbolic and numerical analysis of plates in bending using Matlab.",
            "On the use of particle swarm optimization to maximize bending stiffness of functionally graded structures.",
            "On a hybrid analytical-experimental technique to assess the storage modulus of resilient materials using symbolic computation.",
            "A procedure for computing the symmetric difference of regions defined by polygonal curves.",
            "Technology integration into mathematics education and applications.",
            "Changing assessment methods: New rules, new roles.",
            "Neglected critical issues of effective CAS utilization.",
            "A tool for evaluating solution economy of algebraic transformations.",
            "Using Fourier series to analyse mass imperfections in vibratory gyroscopes.",
            "A local Fourier convergence analysis of a multigrid method using symbolic computation.",
            "Characterization of rational ruled surfaces.",
            "Identifiable reparametrizations of linear compartment models.",
            "Algorithms for Garside calculus.",
            "Mathematical and computer algebra techniques in cryptology.",
            "On the probability of generating a lattice.",
            "Recovering a sum of two squares decomposition.",
            "Cubic Sieve Congruence of the Discrete Logarithm Problem, and fractional part sequences.",
            "Products with variables from low-dimensional affine spaces and shifted power identity testing in finite fields.",
            "Generalizations of complete mappings of finite fields and some applications.",
            "The Carlitz rank of permutations of finite fields: A survey.",
            "Computational aspects of retrieving a representation of an algebraic geometry code.",
            "Reduced Gröbner bases and Macaulay-Buchberger Basis Theorem over Noetherian rings.",
            "Computing the degree of a lattice ideal of dimension one.",
            "Minimal families of curves on surfaces.",
            "A symbolic transformation language and its application to a multiscale method.",
            "On the complexity of the Descartes method when using approximate arithmetic.",
            "A non-commutative F5 algorithm with an application to the computation of Loewy layers."
        ]
    },
    {
        "name": "JSC",
        "year": "2013",
        "info": "2013: Volumes 48, 49, 50, 51,\n52,\n53,\n54,\n55,\n56,\n57,\n58,\n59",
        "count": 104,
        "papers": [
            "Invariant functions and invariant relations: An alternative to invariant assertions.",
            "Gröbner-free normal forms for Boolean polynomials.",
            "Gröbner basis for norm-trace codes.",
            "On symplectically rigid local systems of rank four and Calabi-Yau operators.",
            "Minimal generating sets of non-modular invariant rings of finite groups.",
            "Skew polynomial rings, Gröbner bases and the letterplace embedding of the free associative algebra.",
            "Guest Editors' foreword.",
            "Triangular decomposition of semi-algebraic systems.",
            "An efficient algorithm for computing a comprehensive Gröbner system of a parametric polynomial system.",
            "On simultaneous row and column reduction of higher-order linear differential systems.",
            "Linear q-difference equations depending on a parameter.",
            "Dimension-dependent bounds for Gröbner bases of polynomial ideals.",
            "Easy composition of symbolic computation software using SCSCP: A new Lingua Franca for symbolic computation.",
            "Algorithms for integrals of holonomic functions over domains defined by polynomial inequalities.",
            "Symbolic termination analysis of solvable loops.",
            "Homotopy bases and finite derivation type for Schützenberger groups of monoids.",
            "Application of Dixon resultant to satellite trajectory control by pole placement.",
            "Recognizing finite matrix groups over infinite fields.",
            "On the complexity of computing with zero-dimensional triangular sets.",
            "Computations for Coxeter arrangements and Solomon's descent algebra: Groups of rank three and four.",
            "Representation of sparse Legendre expansions.",
            "Complexity and algorithms for Euler characteristic of simplicial complexes.",
            "Limits of quotients of bivariate real analytic functions.",
            "New fast euclidean algorithms.",
            "On the bit-complexity of sparse polynomial and series multiplication.",
            "On the evaluation of multivariate polynomials over finite fields.",
            "Upgraded methods for the effective computation of marked schemes on a strongly stable ideal.",
            "On the cactus rank of cubic forms.",
            "Computing generators of groups preserving a bilinear form over residue class rings.",
            "Algorithms for the implementation of the analytic classification of plane branches.",
            "Finiteness theorems and algorithms for permutation invariant chains of Laurent lattice ideals.",
            "Computing split maximal toral subalgebras of Lie algebras over fields of small characteristic.",
            "Computational methods for nilsoliton metric Lie algebras I.",
            "Toric complete intersection codes.",
            "Loop invariant synthesis in a combined abstract domain.",
            "Lower bounds for decomposable univariate wild polynomials.",
            "A new algorithmic scheme for computing characteristic sets.",
            "Computing hypercircles by moving hyperplanes.",
            "Cubic vertex-transitive graphs on up to 1280 vertices.",
            "Relations among conditional probabilities.",
            "Computing intersection numbers of Chern classes.",
            "On determinants and eigenvalue theory of tensors.",
            "Bounds on factors in Z[x].",
            "Homological techniques for the analysis of the dimension of triangular spline spaces.",
            "Foreword from the Editors.",
            "Explicit solution by radicals, gonal maps and plane models of algebraic curves of genus 5 or 6.",
            "Calculating generators of multigraded algebras.",
            "Affine solution sets of sparse polynomial systems.",
            "Small polygons and toric codes.",
            "Moment matrices, border bases and real radical computation.",
            "Computing tropical linear spaces.",
            "Parallel algorithms for normalization.",
            "Special issue on symbolic and algebraic computation: Foundations, algorithmics and applications: ISSAC 2011.",
            "Extracting sparse factors from multivariate integral polynomials.",
            "Generating subfields.",
            "Deformation of roots of polynomials via fractional derivatives.",
            "General tensor decomposition, moment matrices and applications.",
            "Computing with semi-algebraic sets: Relaxation techniques and effective boundaries.",
            "Differential type operators and Gröbner-Shirshov bases.",
            "An efficient method for computing comprehensive Gröbner bases.",
            "Using a bihomogeneous resultant to find the singularities of rational space curves.",
            "Efficient computation of maximal orders in Artin-Schreier extensions.",
            "Selecting lengths of floats for the computation of approximate Gröbner bases.",
            "Markoff-Rosenberger triples in arithmetic progression.",
            "Budan tables of real univariate polynomials.",
            "Structures of precision losses in computing approximate Gröbner bases.",
            "Connection and linearization coefficients of the Askey-Wilson polynomials.",
            "A Borel open cover of the Hilbert scheme.",
            "A note on computing involution centralizers.",
            "Eigenvectors of tensors and algorithms for Waring decomposition.",
            "On k-simple forms of first-order linear differential systems and their computation.",
            "Computing homology using generalized Gröbner bases.",
            "Gröbner bases of symmetric ideals.",
            "Generalization of the Lee-O'Sullivan list decoding for one-point AG codes.",
            "Monomial curve families supporting Rossi's conjecture.",
            "Characterization of relative Gröbner bases.",
            "On the complexity of the generalized MinRank problem.",
            "Proving isometry for homogeneous Einstein metrics on flag manifolds by symbolic computation.",
            "Symbolic computation of strongly nonlinear periodic oscillations.",
            "Group arithmetic in C3, 5C3, 5 curves.",
            "Computing with real Lie algebras: Real forms, Cartan decompositions, and Cartan subalgebras.",
            "Rank-profile revealing Gaussian elimination and the CUP matrix decomposition.",
            "Ideal-specific elimination orders form a star-shaped region.",
            "An algorithm to parametrize approximately space curves.",
            "Curves testing boundedness of polynomials on subsets of the real plane.",
            "Computational algebraic geometry.",
            "Bundles of rank 3 on curves of Clifford index 3.",
            "Foundations of invariant theory for the down operator.",
            "Determinantal representations of hyperbolic plane curves: An elementary approach.",
            "On automorphisms groups of cyclic p-gonal Riemann surfaces.",
            "Computing intersection numbers between abelian varieties associated to subspaces of modular forms.",
            "Scalar-vector algorithm for the roots of quadratic quaternion polynomials, and the characterization of quintic rational rotation-minimizing frame curves.",
            "Certified rational parametric approximation of real algebraic space curves with local generic position method.",
            "Discovering polynomial Lyapunov functions for continuous dynamical systems.",
            "Improved polynomial remainder sequences for Ore polynomials.",
            "Factoring bivariate polynomials using adjoints.",
            "Corrigendum to \"Rational rotation-minimizing frames on polynomial space curves of arbitrary degree\" [J. Symbolic Comput. 45(8) (2010) 844-856].",
            "On decomposable semigroups and applications.",
            "Involutive bases algorithm incorporating F5 criterion.",
            "An analysis of inhomogeneous signature-based Gröbner basis computations.",
            "Conchoid surfaces of quadrics.",
            "Guessing singular dependencies.",
            "The Graph Isomorphism Problem and approximate categories.",
            "Compositions and collisions at degree p2."
        ]
    },
    {
        "name": "JSC",
        "year": "2012",
        "info": "2012: Volume 47",
        "count": 86,
        "papers": [
            "Exact certification in global polynomial optimization via sums-of-squares of rational functions with rational coefficients.",
            "Deciding polynomial-transcendental problems.",
            "Good reduction of Puiseux series and applications.",
            "The Product Replacement Prospector.",
            "New solutions for ordinary differential equations.",
            "An extension of Kedlaya's algorithm for hyperelliptic curves.",
            "On the computation of matrices of traces and radicals of ideals.",
            "Macsyma: A personal history.",
            "Complete subdivision algorithms, II: Isotopic meshing of singular algebraic curves.",
            "SqFreeEVAL: An (almost) optimal real-root isolation algorithm.",
            "Discriminants and nonnegative polynomials.",
            "A reduced form for linear differential systems and its application to integrability of Hamiltonian systems.",
            "A complete classification of quintic space curves with rational rotation-minimizing frames.",
            "Determining singular solutions of polynomial systems via symbolic-numeric reduction to geometric involutive forms.",
            "A worst-case bound for topology computation of algebraic curves.",
            "Finding regular insertion encodings for permutation classes.",
            "The geometry of flex tangents to a cubic curve and its parameterizations.",
            "Real root isolation for exp-log-arctan functions.",
            "Invariants for the computation of intransitive and transitive Galois groups.",
            "Local shape of generalized offsets to algebraic curves.",
            "Algorithms for Del Pezzo surfaces of degree 5 (construction, parametrization).",
            "In honour of the research and influence of Joachim von zur Gathen at 60.",
            "On the modular inversion hidden number problem.",
            "Genus 2 point counting over prime fields.",
            "Non-linear polynomial selection for the number field sieve.",
            "Approximate GCD of several univariate polynomials with small degree perturbations.",
            "Triangular x-basis decompositions and derandomization of linear algebra algorithms over K[x].",
            "Faster p-adic feasibility for certain multivariate sparse polynomials.",
            "On the Berlekamp/Massey algorithm and counting singular Hankel matrices over a finite field.",
            "All unitary perfect polynomials over f2 with at most four distinct irreducible factors.",
            "Global optimization of polynomials restricted to a smooth variety using sums of squares.",
            "Algorithmic determination of q-power series for q-holonomic functions.",
            "Twin-float arithmetic.",
            "Efficient computation of maximal orders in radical (including Kummer) extensions.",
            "The degree complexity of smooth surfaces of codimension 2.",
            "Preface.",
            "A brief introduction to Wen-Tsun Wu's academic career.",
            "Transforming problems from analysis to algebra: A case study in linear boundary problems.",
            "Algorithms for computing triangular decomposition of polynomial systems.",
            "The extended Zeilberger algorithm with parameters.",
            "Characteristic set algorithms for equation solving in finite fields.",
            "Convolution surfaces based on polygonal curve skeletons.",
            "Computing the multiplicity structure of an isolated singular solution: Case of breadth one.",
            "Transforming linear functional systems into fully integrable systems.",
            "Implicitization, parameterization and singularity computation of Steiner surfaces using moving surfaces.",
            "Special Issue on Symbolic and Algebraic Computation Foundations, Algorithmics and Applications: ISSAC 2009.",
            "Computing the homology of groups: The geometric way.",
            "Fast arithmetics in Artin-Schreier towers over finite fields.",
            "Efficient algorithms for order basis computation.",
            "Multihomogeneous resultant formulae for systems with scaled support.",
            "Root isolation of zero-dimensional polynomial systems with linear univariate representation.",
            "Fast simplifications for Tarski formulas based on monomial inequalities.",
            "Variant quantifier elimination.",
            "On the isotopic meshing of an algebraic implicit surface.",
            "On the relation between the MXL family of algorithms and Gröbner basis algorithms.",
            "Sylvester's double sums: An inductive proof of the general case.",
            "The Karatsuba integer middle product.",
            "Trading order for degree in creative telescoping.",
            "An algorithm for computing compatibly Frobenius split subvarieties.",
            "First-order theorem proving: Foreword.",
            "Model Evolution with equality - Revised and implemented.",
            "Incremental variable splitting.",
            "On the verification of security-aware E-services.",
            "Projection and scope-determined circumscription.",
            "lim+, δ+, and Non-Permutability of β-Steps.",
            "Foreword from the Editors.",
            "Symbolic computation and the cyclicity problem for singularities.",
            "Discussion on polynomials having polynomial iterative roots.",
            "Isochronicity and normal forms of polynomial systems of ODEs.",
            "Links between two semisymmetric graphs on 112 vertices via association schemes.",
            "Serre's reduction of linear partial differential systems with holonomic adjoints.",
            "Fraction-free algorithm for the computation of diagonal forms matrices over Ore domains using Gröbner bases.",
            "Algorithmic Thomas decomposition of algebraic and differential systems.",
            "A symbolic summation approach to Feynman integral calculus.",
            "Using Gröbner bases for finding the logarithmic part of the integral of transcendental functions.",
            "Computing Gröbner bases of pure binomial ideals via submodules of Zn.",
            "Computational homology of n-types.",
            "Single-factor lifting and factorization of polynomials over local fields.",
            "Representations of q-orthogonal polynomials.",
            "On the computing time of the continued fractions method.",
            "Foreword.",
            "Abstract interpretation meets convex optimization.",
            "Tropical linear-fractional programming and parametric mean payoff games.",
            "Acceleration of the abstract fixpoint computation in numerical program analysis.",
            "Applying abstract acceleration to (co-)reachability analysis of reactive programs.",
            "Discovering invariants via simple component analysis."
        ]
    },
    {
        "name": "JSC",
        "year": "2011",
        "info": "2011: Volume 46",
        "count": 87,
        "papers": [
            "A local construction of the Smith normal form of a matrix polynomial.",
            "Chern numbers of smooth varieties via homotopy continuation and intersection theory.",
            "Computing symmetric rank for symmetric tensors.",
            "Solving genus zero Diophantine equations over number fields.",
            "A deterministic algorithm for isolating real roots of a real polynomial.",
            "Corrigendum to \"Linear complete differential resultants and the implicitization of linear DPPEs\" [J. Symbolic Comput. 45(3) March (2010) 324-341].",
            "Foreword.",
            "Trace-based verification of imperative programs with I/O.",
            "An accessible verification environment for UML models of services.",
            "Static consistency checking of web applications with WebDSL.",
            "Verifying the consistency of web-based technical documentations.",
            "Providing RIA user interfaces with accessibility properties.",
            "Foreword.",
            "A lattice-theoretical perspective on adhesive categories.",
            "How to delete categorically - Two pushout complement constructions.",
            "Cartesian effect categories are Freyd-categories.",
            "Symbolic graphs for attributed graph constraints.",
            "A categorical framework for the transformation of object-oriented systems: Models and data.",
            "Meta-expansion of transseries.",
            "Computing group cohomology rings from the Lyndon-Hochschild-Serre spectral sequence.",
            "Constructive homomorphisms for classical groups.",
            "Sylvester double sums and subresultants.",
            "Gröbner basis of the alternating galoisian ideal.",
            "Gröbner bases of bihomogeneous ideals generated by polynomials of bidegree (1, 1): Algorithms and complexity.",
            "Computing representatives of nilpotent orbits of θ-groups.",
            "Artificial discontinuities of single-parametric Gröbner bases.",
            "A complete, exact and efficient implementation for computing the edge-adjacency graph of an arrangement of quadrics.",
            "Bruno Buchberger and the world of Gröbner bases.",
            "Computing inhomogeneous Gröbner bases.",
            "Some algebraic methods for solving multiobjective polynomial integer programs.",
            "Lattice Polly Cracker cryptosystems.",
            "A modified coefficient ideal for use with the strict transform.",
            "The Gröbner basis of the ideal of vanishing polynomials.",
            "Morley's theorem revisited: Origami construction and automated proof.",
            "Model checking in the modal μ-calculus and generic solutions.",
            "Computing diagonal form and Jacobson normal form of a matrix using Gröbner bases.",
            "Non-Cohen-Macaulay unique factorization domains in small dimensions.",
            "Boolean Gröbner bases.",
            "Simple forms of higher-order linear differential systems and their applications in computing regular solutions.",
            "On a new method for finding generalized equivalence transformations for differential equations involving arbitrary functions.",
            "Parallelization of Modular Algorithms.",
            "fKenzo: A user interface for computations in Algebraic Topology.",
            "A q-analogue of the Bailey-Borwein-Bradley identity.",
            "Quartic curves and their bitangents.",
            "In honour of Keith Geddes on his 60th birthday.",
            "High-precision numerical integration: Progress and challenges.",
            "Tropical algebraic geometry in Maple: A preprocessing algorithm for finding common factors for multivariate polynomials with approximate coefficients.",
            "Kaltofen's division-free determinant algorithm differentiated for matrix adjoint computation.",
            "Chunky and equal-spaced polynomial multiplication.",
            "Sparse polynomial division using a heap.",
            "Simultaneous modular reduction and Kronecker substitution for small finite fields.",
            "The modpn library: Bringing fast polynomial arithmetic into Maple.",
            "Ten commandments for good default expression simplification.",
            "Extended rate, more GFUN.",
            "Solution formulas for cubic equations without or with constraints.",
            "Single-lifting Macaulay-type formulae of generalized unmixed sparse resultants.",
            "Toric forms of elliptic curves and their arithmetic.",
            "Optimal affine reparametrization of rational curves.",
            "A perturbed differential resultant based implicitization algorithm for linear DPPEs.",
            "Formal enforcement of security policies on concurrent systems.",
            "The F5 criterion revised.",
            "Radical parametrizations of algebraic curves by adjoint curves.",
            "Pólya's Theorem with zeros.",
            "Macaulay inverse systems revisited.",
            "Flat families by strongly stable ideals and a generalization of Gröbner bases.",
            "Obituary. Philippe Flajolet.",
            "Generating stable modular graphs.",
            "Computing minimal associated primes in polynomial rings over the integers.",
            "Ideals with larger projective dimension and regularity.",
            "A geometric index reduction method for implicit systems of differential algebraic equations.",
            "Properness defects of projection and minimal discriminant variety.",
            "Algorithms for computing a primary ideal decomposition without producing intermediate redundant components.",
            "Rational general solutions of planar rational systems of autonomous ODEs.",
            "Erratum to \"A new algorithm for discussing Gröbner bases with parameters\" [J. Symbolic Comput. 33(1-2) (2002) 183-208].",
            "Exact linear modeling using Ore algebras.",
            "Subanalytic solutions of linear difference equations and multidimensional hypergeometric sequences.",
            "Embedded desingularization of toric varieties.",
            "Detecting lacunary perfect powers and computing their roots.",
            "Computing infeasibility certificates for combinatorial problems through Hilbert's Nullstellensatz.",
            "Cylindrical decomposition for systems transcendental in the first variable.",
            "When does <T> equal sat(T)?",
            "Approximate polynomial GCD over integers.",
            "Computing the nearest polynomial with a zero in a given domain by using piecewise rational functions.",
            "How to implement a modular form.",
            "Symbolic computation of conservation laws for nonlinear partial differential equations in multiple space dimensions.",
            "Homotopy techniques for multiplication modulo triangular sets.",
            "Cayley graphs and G-graphs: Some applications."
        ]
    },
    {
        "name": "JSC",
        "year": "2010",
        "info": "2010: Volume 45",
        "count": 81,
        "papers": [
            "Rational two-parameter families of spheres and rational offset surfaces.",
            "Almost vanishing polynomials for sets of limited precision points.",
            "Computations in the ring of quaternionic polynomials.",
            "Local Bernstein-Sato ideals: Algorithm and examples.",
            "A bound on the projective dimension of three cubics.",
            "On the relation between Context and Sequence Unification.",
            "A verified Common Lisp implementation of Buchberger's algorithm in ACL2.",
            "Computing differential characteristic sets by change of ordering.",
            "Special issue on automated deduction: Decidability, complexity, tractability.",
            "Decidable fragments of many-sorted logic.",
            "Context unification with one context variable.",
            "Deciding inseparability and conservative extensions in the description logic EL.",
            "Theory decision by decomposition.",
            "Combination of convex theories: Modularity, deduction completeness, and explanation.",
            "Liouvillian solutions of linear difference-differential equations.",
            "An algorithm to compute Liouvillian solutions of prime order linear difference-differential equations.",
            "Linear complete differential resultants and the implicitization of linear DPPEs.",
            "Computing with algebraically closed fields.",
            "Computing automorphisms of semigroups.",
            "Origami fold as algebraic graph rewriting.",
            "Set-theoretic generators of rational space curves.",
            "On the minimum of a positive polynomial over the standard simplex.",
            "Subresultants of two Hermite-Laurent series.",
            "Stratification associated with local b-functions.",
            "Optimized parametrization of systems of incidences between rigid bodies.",
            "Symbolic computation in software science: Foreword from the editor.",
            "Programming with narrowing: A tutorial.",
            "Anti-patterns for rule-based languages.",
            "Reducibility of operation symbols in term rewriting systems and its application to behavioral specifications.",
            "Equational approximations for tree automata completion.",
            "External and internal syntax of the lambda-calculus.",
            "Bounds on absolute positiveness of multivariate polynomials.",
            "Solving the conjugacy problem in Garside groups by cyclic sliding.",
            "On convolutions of algebraic curves.",
            "Faster algorithms for computing Hong's bound on absolute positiveness.",
            "Polynomial ring automorphisms, rational (w, sigma)-canonical forms, and the assignment problem.",
            "The invariants of the binary nonic.",
            "Special issue algebraic coding theory and applications.",
            "The weight distributions of cyclic codes with two zeros and zeta functions.",
            "Algebraic geometry codes from polyhedral divisors.",
            "Decoding by rank-2 bundles over plane quartics.",
            "Key equations for list decoding of Reed-Solomon codes and how to solve them.",
            "Formally self-dual additive codes over F4.",
            "Binary codes from the line graph of the n-cube.",
            "Quotients of Gaussian graphs and their application to perfect codes.",
            "Elliptic Gauss sums and applications to point counting.",
            "The invariants of the binary decimic.",
            "Rational rotation-minimizing frames on polynomial space curves of arbitrary degree.",
            "Newton's method and FFT trading.",
            "Approximate polynomial GCD: Small degree and small height perturbations.",
            "Normalization of rings.",
            "Algorithms for solving linear systems over cyclotomic fields.",
            "Looking for Gröbner basis theory for (almost) skew 2-nomial algebras.",
            "Some new simple Lie algebras in characteristic 2.",
            "Computing the support of monomial iterated mapping cones.",
            "On the De Boer-Pellikaan method for computing minimum distance.",
            "Local Bézout Theorem.",
            "Application of computational invariant theory to Kobayashi hyperbolicity and to Green-Griffiths algebraic degeneracy.",
            "Effective bounds for P-recursive sequences.",
            "Introduction.",
            "Mechanical inference of invariants for FOR-loops.",
            "Reflexive transitive invariant relations: A basis for computing loop functions.",
            "An invariant-based approach to the verification of asynchronous parameterized networks.",
            "Verifying pointer safety for programs with unknown calls.",
            "Modular inference of subprogram contracts for safety checking.",
            "Constraint solving for interpolation.",
            "Termination of linear programs with nonlinear constraints.",
            "Effective methods in algebraic geometry 2009: Barcelona. Guest editors' foreword.",
            "On non-defectivity of certain Segre-Veronese varieties.",
            "Bounding the radii of balls meeting every connected component of semi-algebraic sets.",
            "Modular Las Vegas algorithms for polynomial absolute factorization.",
            "An implicitization challenge for binary factor analysis.",
            "Dynamic Galois Theory.",
            "Extended F5 criteria.",
            "The first rational Chebyshev knots.",
            "P versus NP and geometry.",
            "Curves and coherent Prüfer rings.",
            "Gröbner bases for polynomial systems with parameters.",
            "Rational general solutions of first order non-autonomous parametrizable ODEs.",
            "F5C: A variant of Faugère's F5 algorithm with reduced Gröbner bases.",
            "On a generalization of Stickelberger's Theorem."
        ]
    },
    {
        "name": "JSC",
        "year": "2009",
        "info": "2009: Volume 44",
        "count": 113,
        "papers": [
            "Parametrizing Del Pezzo surfaces of degree 8 using Lie algebras.",
            "State space analysis of Petri nets with relation-algebraic methods.",
            "D'Alembertian series solutions at ordinary points of LODE with polynomial coefficients.",
            "Shallow confluence of conditional term rewriting systems.",
            "An improved EZ-GCD algorithm for multivariate polynomials.",
            "The implicit equation of a canal surface.",
            "Formal desingularization of surfaces: The Jung method revisited.",
            "Helical polynomial curves and double Pythagorean hodographs I. Quaternion and Hopf map representations.",
            "Parameterizing surfaces with certain special support functions, including offsets of quadrics and rationally supported surfaces.",
            "On the simplification of the coefficients of a parametrization.",
            "A complete minimal system of covariants for the binary form of degree 7.",
            "Foreword.",
            "Thirty years of Polynomial System Solving, and now?",
            "A computational study of ruled surfaces.",
            "A characteristic set method for ordinary difference polynomial systems.",
            "Élie Cartan's geometrical vision or how to avoid expression swell.",
            "Hadamard matrices of Williamson type: A challenge for Computer Algebra.",
            "Solving polynomial systems via symbolic-numeric reduction to geometric involutive form.",
            "Subdivision methods for solving polynomial equations.",
            "Helical polynomial curves and double Pythagorean hodographs II. Enumeration of low-degree curves.",
            "Algebraic transformation of differential characteristic decompositions from one ranking to another.",
            "The Slice Algorithm for irreducible decomposition of monomial ideals.",
            "Differential invariants of a Lie group action: Syzygies on a generating set.",
            "Corrigendum to: \"Computing the characteristic numbers of the variety of nodal plane cubics inP2 [J. Symb. Computation 42 (1-2) (2007) 192-202].",
            "Foreword from the editors.",
            "On d-solvability for linear differential equations.",
            "Annihilating ideals for an algebraic local cohomology class.",
            "Algorithm computing the local b function by an approximate division algorithm in D.",
            "Minimal canonical comprehensive Gröbner systems.",
            "Implicitization of rational ruled surfaces with mu-bases.",
            "Detecting real singularities of a space curve from a real rational parametrization.",
            "On the structure of generalized toric codes.",
            "An algorithm to compute the Wedderburn decomposition of semisimple group algebras implemented in the GAP package wedderga.",
            "Gröbner bases in universal enveloping algebras of Leibniz algebras.",
            "Naturally graded quasi-filiform Leibniz algebras.",
            "conley: Computing connection matrices in Maple.",
            "The homological reduction method for computing cocyclic Hadamard matrices.",
            "Certifying properties of an efficient functional program for computing Gröbner bases.",
            "Milne's volume function and vector symmetric polynomials.",
            "A tessellation for Fermat surfaces in CP3.",
            "Nearest multivariate system with given root multiplicities.",
            "Analytic classification of plane branches up to multiplicity 4.",
            "Partial degree formulae for plane offset curves.",
            "Implementation of Stanley's algorithm for projective group imbeddings.",
            "On the equivalence of binary quartics.",
            "Lower bounds for decision problems in imaginary, norm-Euclidean quadratic integer rings.",
            "Special issue on symbolic and algebraic computation.",
            "Parametric polynomial spectral factorization using the sum of roots and its application to a control design problem.",
            "Regularity of the Euclid Algorithm; application to the analysis of fast GCD Algorithms.",
            "Complete numerical isolation of real roots in zero-dimensional triangular systems.",
            "Non-associative Gröbner bases, finitely-presented Lie rings and the Engel condition, II.",
            "Noncommutative algebra, multiple harmonic sums and applications in discrete probability.",
            "On the asymptotic and practical complexity of solving bivariate systems over the reals.",
            "New classification techniques for ordinary differential equations.",
            "Computation of 2-groups of narrow logarithmic divisor classes of number fields.",
            "An explicit duality for quasi-homogeneous ideals.",
            "Harnessing parallel disks to solve Rubik's cube.",
            "Fast arithmetic for triangular sets: From theory to practice.",
            "On real factors of real interval polynomials.",
            "Implicit Riquier Bases for PDAE and their semi-discretizations.",
            "Symbolic-numeric sparse interpolation of multivariate polynomials.",
            "The q-WZ method for infinite series.",
            "Cayley-Dixon projection operator for multi-univariate composed polynomials.",
            "On asymptotic extrapolation.",
            "On the Moser- and super-reduction algorithms of systems of linear differential equations and their complexity.",
            "On deciding finiteness of matrix groups.",
            "Symmetric representation of the elements of the Conway group .0.",
            "Rogers-Ramanujan computer searches.",
            "On the relation between weighted trees and tropical Grassmannians.",
            "Effective methods in algebraic geometry.",
            "Evaluation techniques for zero-dimensional primary decomposition.",
            "On the complexity of counting components of algebraic varieties.",
            "Characteristic set method for differential-difference polynomial systems.",
            "Sylvester's double sums: The general case.",
            "Iterated discriminants.",
            "Towards toric absolute factorization.",
            "Separating invariants.",
            "Constructing algebraic groups from their Lie algebras.",
            "Generators of the ideal of an algebraic space curve.",
            "Quasi-quadratic elliptic curve point counting using rigid cohomology.",
            "Milnor algebras could be isomorphic to modular algebras.",
            "The number of roots of a lacunary bivariate polynomial on a line.",
            "A quantitative Pólya's Theorem with zeros.",
            "Isotopic triangulation of a real algebraic surface.",
            "Betti numbers and minimal free resolutions for multi-state system reliability bounds.",
            "PolyBoRi: A framework for Gröbner-basis computations with Boolean polynomials.",
            "Dynamic balancing of planar mechanisms using toric geometry.",
            "Noether normalization guided by monomial cone decompositions.",
            "Letterplace ideals and non-commutative Gröbner bases.",
            "Decomposition of ordinary difference polynomials.",
            "Algorithms for near solutions to polynomial equations.",
            "Computing some fundamental numbers of the variety of nodal cubics in P3.",
            "An algorithm to bound the regularity and nonemptiness of linear systems in Pn.",
            "Computing generating sets of lattice ideals and Markov bases of lattices.",
            "Reverse search for monomial ideals.",
            "Automatic computation of the complete root classification for a parametric polynomial.",
            "Faster polynomial multiplication via multipoint Kronecker substitution.",
            "Plus-minus algorithm - A method for derivation of the Bäcklund transformations.",
            "Corrigendum to: \"On ordering free groups\" [J. Symbolic Comput. 40(2005) 1285-1290].",
            "Preface.",
            "Using symmetries in the eigenvalue method for polynomial systems.",
            "Toric dynamical systems.",
            "Approximate computation of zero-dimensional polynomial ideals.",
            "Evaluation properties of invariant polynomials.",
            "Foreword.",
            "On the decoding of binary cyclic codes with the Newton identities.",
            "Bounded distance decoding of linear error-correcting codes with Gröbner bases.",
            "Coding with skew polynomial rings.",
            "List decoding codes on Garcia-Stictenoth tower using Gröbner basis.",
            "List decoding of Hermitian codes using Gröbner bases.",
            "An efficient algorithm for decomposing multivariate polynomials and its applications to cryptography.",
            "Index calculus for abelian varieties of small dimension and the elliptic curve discrete logarithm problem.",
            "QUAD: A multivariate stream cipher with provable security."
        ]
    },
    {
        "name": "JSC",
        "year": "2008",
        "info": "2008: Volume 43",
        "count": 51,
        "papers": [
            "Solving thousand-digit Frobenius problems using Gröbner bases.",
            "Algorithms for computing with nilpotent matrix groups over infinite domains.",
            "Universal characteristic decomposition of radical differential ideals.",
            "Solving over-determined systems by the subresultant method (with an appendix by Marc Chardin).",
            "Counting with rational generating functions.",
            "Computing singular points of plane rational curves.",
            "A univariate resultant-based implicitization algorithm for surfaces.",
            "Algorithms for quadratic forms.",
            "Completion of overdetermined parabolic PDEs.",
            "Near-optimal parameterization of the intersection of quadrics: I. The generic algorithm.",
            "Near-optimal parameterization of the intersection of quadrics: II. A classification of pencils.",
            "Near-optimal parameterization of the intersection of quadrics: III. Parameterizing singular intersections.",
            "Corrigendum to \"Are Buchberger's criteria necessary for the chain condition?\" [J. Symbolic Comput. 42(2007) 717-732].",
            "Topology of real algebraic space curves.",
            "On the decomposition of rational functions.",
            "On the homology of two-dimensional elimination.",
            "Descent via isogeny on elliptic curves with large rational torsion subgroups.",
            "Localization of the complex zeros of parametrized families of polynomials.",
            "An efficient sparse adaptation of the polytope method over I and a record-high binary bivariate factorisation.",
            "The largest group of invariance for Markov bases and toric ideals.",
            "Approximate factorization of multivariate polynomials using singular value decomposition.",
            "Dimensions of solution spaces of H.",
            "Computer algebra in pure and applied mathematics: A foreword.",
            "Gröbner-Shirshov basis for the braid group in the Artin-Garside generators.",
            "Universally defined representations of Lie conformal superalgebras.",
            "The degree-complexity of the defining ideal of a smooth integral curve.",
            "Algebraic degree of the inverse of linearized polynomials.",
            "Eta pairing computation on general divisors over hyperelliptic curves y.",
            "0/0 Simplifies implicitization.",
            "Indispensable monomials of toric ideals and Markov bases.",
            "Calculation of a formal moment generating function by using a differential operator.",
            "Solving and factoring boundary problems for linear ordinary differential equations in differential algebras.",
            "Algorithms for a class of infinite permutation groups.",
            "A bound for the Rosenfeld-Gröbner algorithm.",
            "A refined difference field theory for symbolic summation.",
            "List decoding of Reed-Solomon codes from a Gröbner basis perspective.",
            "Good global behavior of offsets to plane algebraic curves.",
            "Gröbner bases and Diophantine analysis.",
            "Value monoids of zero-dimensional valuations of rank 1.",
            "Computing difference-differential dimension polynomials by relative Gröbner bases in difference-differential modules.",
            "Rational solutions of ordinary difference equations.",
            "Standard bases in K.",
            "Computing the algebraic relations of C-finite sequences and multisequences.",
            "On Lawrence semigroups.",
            "Rational Univariate Reduction via toric resultants.",
            "Good local behavior of offsets to rational regular algebraic surfaces.",
            "Flat matching.",
            "Parameter augmentation and the q.",
            "Stable border bases for ideals of points.",
            "Proving hypergeometric identities by numerical verifications.",
            "A Groebner basis approach to solve a Conjecture of Nowicki."
        ]
    },
    {
        "name": "JSC",
        "year": "2007",
        "info": "2007: Volume 42",
        "count": 63,
        "papers": [
            "Foreword from the Editors.",
            "On the probability distribution of singular varieties of given corank.",
            "Efficiency improvement in an nD systems approach to polynomial optimization.",
            "Computing tropical varieties.",
            "Simplicial cycles and the computation of simplicial trees.",
            "Equisingular calculations for plane curve singularities.",
            "Restriction of A-discriminants and dual defect toric varieties.",
            "On the geometry of parametrized bicubic surfaces.",
            "Improving the algorithms of Berlekamp and Niederreiter for factoring polynomials over finite fields.",
            "Standard bases for local rings of branches and their modules of differentials.",
            "Computing the characteristic numbers of the variety of nodal plane cubics in P3.",
            "Rational invariants of a group action. Construction and rewriting.",
            "Computing multihomogeneous resultants using straight-line programs.",
            "Around the numeric-symbolic computation of differential Galois groups.",
            "Mathscape and molecular integrals.",
            "An elementary proof of Sylvester's double sums for subresultants.",
            "The generic Gröbner walk.",
            "Computing obstructions for existence of connections on modules.",
            "Multiple object semilinear motion planning.",
            "Local shape of offsets to algebraic curves.",
            "Solving equations with sequence variables and sequence functions.",
            "Efficient accelero-summation of holonomic functions.",
            "An example of relations on the Ext-quiver for the Suzuki group Sz(8) in characteristic 2.",
            "Generating all polynomial invariants in simple loops.",
            "Improved dense multivariate polynomial factorization algorithms.",
            "Special issue on Applications of Computer Algebra.",
            "Computing the fine structure of real reductive symmetric spaces.",
            "Computing with toric varieties.",
            "A new class of term orders for elimination.",
            "G-graphs: A new representation of groups.",
            "Gröbner bases with respect to several orderings and multivariable dimension polynomials.",
            "Trivializing a central simple algebra of degree 4 over the rational numbers.",
            "MOPS: Multivariate orthogonal polynomials (symbolically).",
            "New effective bounds on the dimension of a linear system in P2.",
            "Solving parametric polynomial systems.",
            "Generation of groups of square-free order.",
            "A delineability-based method for computing critical sets of algebraic surfaces.",
            "On approximate triangular decompositions in dimension zero.",
            "Are Buchberger's criteria necessary for the chain condition?",
            "Output-sensitive modular algorithms for polynomial matrix normal forms.",
            "Recognizing and parametrizing curves isomorphic to a line.",
            "Structure theorems for parallel integration.",
            "Generalized power series solutions to linear partial differential equations.",
            "New algorithms for relaxed multiplication.",
            "Gröbner bases for families of affine or projective schemes.",
            "Computation of the singularities of parametric plane curves.",
            "A Gröbner-based treatment of elimination theory for affine varieties.",
            "The Moufang loops of order 64 and 81.",
            "Symmetric subresultants and applications.",
            "Linear syntax for communicating elementary mathematics.",
            "On complete system of invariants for the binary form of degree 7.",
            "Summation algorithms for Stirling number identities.",
            "An algorithm for checking whether the toric ideal of an affine monomial curve is a complete intersection.",
            "Symbolic computation with finite biquandles.",
            "Foreword from the Editor.",
            "Gröbner bases with coefficients in rings.",
            "An algorithmic approach to resolutions.",
            "Complete involutive rewriting systems.",
            "Poincaré-Birkhoff-Witt theorem for Leibniz n.",
            "Graphs of relations and Hilbert series.",
            "Set-theoretic solutions of the Yang-Baxter equation, graphs and computations.",
            "Computation of bases of free modules over the Weyl algebras.",
            "Gröbner bases and the number of Latin squares related to autotopisms of order <= 7."
        ]
    },
    {
        "name": "JSC",
        "year": "2006",
        "info": "2006: Volume\n41",
        "count": 84,
        "papers": [
            "Fast computation of special resultants.",
            "Local parametrization of cubic surfaces.",
            "New bounds for the Descartes method.",
            "The unification type of the Pythagorean equation in varieties of nilpotent rings.",
            "A database of local fields.",
            "Gröbner finite path algebras.",
            "Ideals, bifiltered modules and bivariate Hilbert polynomials.",
            "Retraction notice to \"Characterization of Pythagorean curves and Pythagoreanization using a rational transform\".",
            "Preface.",
            "Resultants in genetic linkage analysis.",
            "Phylogenetic invariants for stationary base composition.",
            "Viterbi sequences and polytopes.",
            "Markov bases and structural zeros.",
            "Markov bases of three-way tables are arbitrarily complicated.",
            "Markov bases for noncommutative Fourier analysis of ranked data.",
            "The space of compatible full conditionals is a unimodular toric variety.",
            "Cumulant varieties.",
            "Polyhedral conditions for the nonexistence of the MLE for hierarchical log-linear models.",
            "Counting and locating the solutions of polynomial systems of maximum likelihood equations, I.",
            "Computing all roots of the likelihood equations of seemingly unrelated regressions.",
            "Bruno Buchberger - A life devoted to symbolic computation.",
            "Preface on the contributed papers.",
            "On inverse systems and squarefree decomposition of zero-dimensional polynomial ideals.",
            "Comprehensive Gröbner bases and regular rings.",
            "Tree polynomials and non-associative Gröbner bases.",
            "Gröbner bases and logarithmic D-modules.",
            "Lexicographic Gröbner bases for transportation problems of format r×3×3.",
            "Gröbner-Shirshov bases for some braid groups.",
            "Computing restrictions of ideals in finitely generated k-algebras by means of Buchberger's algorithm.",
            "Towards a clausal analysis of cut-elimination.",
            "Logicographic symbols.",
            "An automated prover for Zermelo-Fraenkel set theory in Theorema.",
            "Comments on the translation of my PhD thesis.",
            "Bruno Buchberger's PhD thesis 1965: An algorithm for finding the basis elements of the residue class ring of a zero dimensional polynomial ideal.",
            "Fraction-free row reduction of matrices of Ore polynomials.",
            "Brauer groups of diagonal quartic surfaces.",
            "Finitely labeled generating trees and restricted permutations.",
            "String rewriting for double coset systems.",
            "Resultants of partially composed polynomials.",
            "Algebraic solutions of holomorphic foliations: An algorithmic approach.",
            "Erratum to \"Ideals, bifiltered modules and bivariate Hilbert polynomials\" [J. Symbolic Comput. 41(2006) 112-121].",
            "An algorithm to solve integer linear systems exactly using numerical methods.",
            "Normal forms in a cyclically graded Lie algebra.",
            "The lex game and some applications.",
            "From an approximate to an exact absolute polynomial factorization.",
            "Validated numerical computation of the LInfinity-norm for linear dynamical systems.",
            "Normal forms for general polynomial matrices.",
            "A polynomial time algorithm for finding rational general solutions of first order autonomous ODEs.",
            "Decision algorithms for fragments of real analysis. I. Continuous functions with strict convexity and concavity predicates.",
            "Parameterized norm form equations with arithmetic progressions.",
            "Symbolic computation with finite quandles.",
            "A hybrid search algorithm for the Whitehead Minimization problem.",
            "Gröbner bases of ideals invariant under endomorphisms.",
            "Computing the character table of a finite group.",
            "Determination of the tangents for a real plane algebraic curve.",
            "Non-associative Gröbner bases.",
            "Gröbner bases of Hilbert ideals of alternating groups.",
            "Integration in finite terms with elementary functions and dilogarithms.",
            "A necessary condition in the monodromy problem for analytic differential equations on the plane.",
            "Counterexamples to witness conjectures.",
            "Computing generators of the tame kernel of a global function field.",
            "All solutions to Thomas' family of Thue equations over imaginary quadratic number fields.",
            "An improved term ordering for the ideal of commuting matrices.",
            "Complexity bounds for zero-test algorithms.",
            "Cylindrical Algebraic Decomposition using validated numerics.",
            "SumCracker: A package for manipulating symbolic sums and related objects.",
            "Computing spectral sequences.",
            "Polynomial root separation examples.",
            "Gröbner fan and universal characteristic sets of prime differential ideals.",
            "Castelnuovo-Mumford regularity of projective monomial varieties of codimension two.",
            "Computing the first few Betti numbers of semi-algebraic sets in single exponential time.",
            "Editorial.",
            "Algorithmic methods for investigating equilibria in epidemic modeling.",
            "Galois theory, splitting fields and computer algebra.",
            "Computing the intersection of two ruled surfaces by using a new algebraic approach.",
            "Quantifier elimination in automatic loop parallelization.",
            "Computation of unirational fields.",
            "Improving the DISPGB algorithm using the discriminant ideal.",
            "Gröbner bases in function rings - A guide for introducing reduction relations to algebraic structures.",
            "Differential operators on orbifolds.",
            "Rank and eigenvalues of a supersymmetric tensor, the multivariate homogeneous polynomial and the algebraic hypersurface it defines.",
            "Computing the support of local cohomology modules.",
            "Irreducible constituents of monomial representations.",
            "On the frontiers of polynomial computations in tropical geometry."
        ]
    },
    {
        "name": "JSC",
        "year": "2005",
        "info": "2005: Volumes\n39, 40",
        "count": 74,
        "papers": [
            "Constructing transitive permutation groups.",
            "Computing zero-dimensional schemes.",
            "A new family of rational surfaces in P4.",
            "Birational properties of the gap subresultant varieties.",
            "Equations of parametric surfaces with base points via syzygies.",
            "Good bases for tame polynomials.",
            "The Gröbner fan and Gröbner walk for modules.",
            "Applicability of the q-analogue of Zeilberger's algorithm.",
            "A new symbolic method for solving linear two-point boundary value problems on the level of operators.",
            "Sharp upper bounds for the orders of the recurrences output by the Zeilberger and q-Zeilberger algorithms.",
            "Towards a unified model of search in theorem-proving: subgoal-reduction strategies.",
            "Preface.",
            "Subresultants and generic monomial bases.",
            "Representation theory on the open Bruhat cell.",
            "Irreducible decomposition of polynomial ideals.",
            "Semi-implicit representations of surfaces in , resultants and applications.",
            "Algebraic geometry of Bayesian networks.",
            "Quantum automata and algebraic groups.",
            "Algorithms for graded injective resolutions and local cohomology over semigroup rings.",
            "Bezoutian and quotient ring structure.",
            "Tangent cone algorithm for homogenized differential operators.",
            "Effective analytic functions.",
            "Galois theory and algorithms for linear differential equations.",
            "On constructive desingularization.",
            "Algorithmic stratification of RhomD for regular algebraic (M,N)-modules on Cn.",
            "Integration of automated reasoning and computer algebra systems.",
            "A reconstruction and extension of Maple's assume facility via constraint contextual rewriting.",
            "The meaning of infinity in calculus and computer algebra systems.",
            "Hidden verification for computational mathematics.",
            "Dealing with algebraic expressions over a field in Coq using Maple.",
            "Automated conjecture making in number theory using HR, Otter and Maple.",
            "Factoring polynomials over global fields I.",
            "Homotopy classification of maps between simply connected four manifolds.",
            "Efficient algorithms for the gcd and cubic residuosity in the ring of Eisenstein integers.",
            "Cyclic resultants.",
            "An algorithm for constructing representations of finite groups.",
            "The mu-basis and implicitization of a rational parametric surface.",
            "Suslin's algorithms for reduction of unimodular rows.",
            "Computation of the topology of real algebraic space curves.",
            "Reduction strategies in rewriting and programming.",
            "Tree automata for rewrite strategies.",
            "Operational semantics for declarative multi-paradigm languages.",
            "A survey of strategies in rule-based program transformation systems.",
            "Evaluation strategies for functional logic programming.",
            "Decidability of bounded higher-order unification.",
            "On the Gosper-Petkovs(ek representation of rational functions.",
            "Computing instanton numbers of curve singularities.",
            "Perfect bases for differential equations.",
            "Operations with regular holonomic D-modules with support a normal crossing.",
            "Computing subgroups of bounded index in a finite group.",
            "Generic initial ideals of points and curves.",
            "Gröbner bases and syzygies on bimodules over PBW algebras.",
            "Conquering inseparability: Primary decomposition and multivariate factorization over algebraic function fields of positive characteristic.",
            "Comparison of theoretical complexities of two methods for computing annihilating ideals of polynomials.",
            "Using resultants for SAGBI basis verification in the univariate polynomial ring.",
            "Linear groupoids and the associated wreath products.",
            "Erratum to \"Cyclic resultants\" [J. Symbolic Comput. 39 (6) (2005) 653-669].",
            "Foreword to the special issue on Applications of computer algebra.",
            "Detecting unnecessary reductions in an involutive basis computation.",
            "Implicitizing rational hypersurfaces using approximation complexes.",
            "Some constructions for real algebraic curves.",
            "Computational algebra for bifurcation theory.",
            "Simplification techniques for maps in simplicial topology.",
            "Enumeration and 3D representation of the stereo-isomers of alkane molecules.",
            "Sturm's algorithm and isolating blocks.",
            "Asymptotic invariant tori of perturbed two-body problems.",
            "Computing polycyclic presentations for polycyclic rational matrix groups.",
            "On ordering free groups.",
            "Numerical stability of surface implicitization.",
            "Eigenvalues of a real supersymmetric tensor.",
            "Factoring polynomials over global fields II.",
            "Shapes of liquid drops obtained using symbolic computation.",
            "Toric ideals and graph theory to analyze Hopf bifurcations in mass action systems.",
            "Out of order quantifier elimination for Standard Quantified Linear Programs."
        ]
    },
    {
        "name": "JSC",
        "year": "2004",
        "info": "2004: Volumes\n37, 38",
        "count": 75,
        "papers": [
            "Superposition with completely built-in Abelian groups.",
            "Efficient decomposition of separable algebras.",
            "An effective decision method for semidefinite polynomials.",
            "Corner edge cutting and Dixon A-resultant quotients.",
            "Special issue on computer algebra and signal processing: forward by the guest editors.",
            "Generating fast Fourier transforms of solvable groups.",
            "Symmetry-based matrix factorization.",
            "Two-dimensional wreath product group-based image processing.",
            "Symbolic computation and signal processing.",
            "Gröbner bases and wavelet design.",
            "Automatic derivation and implementation of fast convolution algorithms.",
            "Computing minimal generators of the ideal of a general projective curve.",
            "Elementary decompositions of arbitrary maps over finite sets.",
            "Symbolic derivation of Runge-Kutta order conditions.",
            "Solving a class of higher-order equations over a group structure.",
            "Reduction relations for monoid semirings.",
            "A long note on Mulders' short product.",
            "A symbolic test for (i, j)-uniformity in reduced zero-dimensional schemes.",
            "a Maple package for aiding the discovery and proof of finite Rogers-Ramanujan type identities.",
            "Note on Jacobi's method for approximating dominant roots.",
            "Fast algorithms for uniform semi-unification.",
            "Certified dense linear system solving.",
            "Strongly Noetherian rings and constructive ideal theory.",
            "Computation of the finitistic dimension of monomial algebras.",
            "A parallel multi-modular algorithm for computing Lagrange resolvents.",
            "Semi-numerical absolute factorization of polynomials with integer coefficients.",
            "Regular representations of finite-dimensional separable semisimple algebras and Gróbner bases.",
            "Computing maximal subgroups of finite groups.",
            "Tractable and intractable second-order matching problems.",
            "On the computation of Bernstein-Sato ideals.",
            "A relative van Hoeij algorithm over number fields.",
            "Symbolic computation of exact solutions expressible in hyperbolic and elliptic functions for nonlinear PDEs.",
            "An objective representation of the Gaussian integers.",
            "On the computation of the Ratliff-Rush closure.",
            "The computational complexity of rules for the character table of Sn.",
            "Parallel computation of determinants of matrices with polynomial entries.",
            "Symbolic computation for mobile robot path planning.",
            "Constructing Sylvester-type resultant matrices using the Dixon formulation.",
            "Applications of the theory of weakly nondegenerate conditions to zero decomposition for polynomial systems.",
            "Minimizing representations over number fields.",
            "Computing generators of the ideal of a smooth affine algebraic variety.",
            "Modular and incremental proofs of AC-termination.",
            "A simple method for implicitizing rational curves and surfaces.",
            "Resultants for unmixed bivariate polynomial systems produced using the Dixon formulation.",
            "Short rational functions for toric algebra and applications.",
            "Linear differential equations in exponential extensions.",
            "New algorithms for generating Conway polynomials over finite fields.",
            "Computing lattice ideals of unions of monomial curves.",
            "A modular algorithm for computing the exponential solutions of a linear differential operator.",
            "Computing group resolutions.",
            "The Cartan matrix and enumerative calculus.",
            "Automatic solution of families of Thue equations and an example of degree 8.",
            "Erratum to \"Rational normal forms and minimal decompositions of hypergeometric terms\" [J. Symbolic Comput 33 (2002) 521-543].",
            "Editorial.",
            "Efficiently computing minimal sets of critical pairs.",
            "Partial standard bases as a tool for studying families of singularities.",
            "A normal form algorithm for the Brieskorn lattice.",
            "Implementation of prime decomposition of polynomial ideals over small finite fields.",
            "Convex hulls, oracles, and homology.",
            "From the zonotope construction to the Minkowski addition of convex polytopes.",
            "Effective lattice point counting in rational convex polytopes.",
            "Telescoping in the context of symbolic summation in Maple.",
            "Castelnuovo-Mumford regularity of initial ideals.",
            "Certified sparse linear system solving.",
            "Automatic verification of secrecy properties for linear logic specifications of cryptographic protocols.",
            "Computation of Milnor numbers and critical values at infinity.",
            "Polynomial factorization algorithms over number fields.",
            "Special polycyclic generating sequences for finite soluble groups.",
            "Deterministic distinct-degree factorization of polynomials over finite fields.",
            "Elements of small norm in Shanks' cubic extensions of imaginary quadratic fields.",
            "On algorithmically checking whether a Hilbert series comes from a complete intersection.",
            "Single-factor coefficient bounds.",
            "On a new procedure for finding nonclassical symmetries.",
            "Algorithmic proofs of two theorems of Stafford.",
            "Algorithmical determination of the topology of a real algebraic surface."
        ]
    },
    {
        "name": "JSC",
        "year": "2003",
        "info": "2003: Volumes\n35, 36",
        "count": 76,
        "papers": [
            "Publisher's Note.",
            "Computing characteristic classes of projective schemes.",
            "Deciding the guarded fragments by resolution.",
            "Computation and homotopical applications of induced crossed modules.",
            "Effective use of Boolean satisfiability procedures in the formal verification of superscalar and VLIW microprocessors.",
            "Computing left Kan extensions.",
            "A database of categories.",
            "Implementing finite structures in Mathematica via a skeletal topos of finite sets.",
            "The term orderings which are compatible with composition II.",
            "A result on braids via the investigation of a rewriting system.",
            "On the Gröbner bases of some symmetric systems and their application to coding theory.",
            "Constructive recognition of classical groups in their natural representation.",
            "Automorphism group computation and isomorphism testing in finite groups.",
            "An algorithm to compute the set of characteristics of a system of polynomial equations over the integers.",
            "An elementary approach to subresultants theory.",
            "A new elementary algorithm for proving q-hypergeometric identities.",
            "Distributed Maple: parallel computer algebra in networked environments.",
            "qMultiSum--a package for proving q-hypergeometric multiple summation identities.",
            "On lattice reduction for polynomial matrices.",
            "Modular algorithms for computing Gröbner bases.",
            "The affine primitive permutation groups of degree less than 1000.",
            "An algorithm for computing invariants of linear actions of algebraic groups up to a given degree.",
            "Some remarks on Fitzpatrick and Flynn's Gröbner basis technique for Padé approximation.",
            "Preface to Computer algebra and computer analysis.",
            "A combined symbolic and numerical algorithm for the computation of zeros of orthogonal polynomials and special functions.",
            "An orderly linear PDE system with analytic initial conditions with a non-analytic solution.",
            "The integration of systems of linear PDEs using conservation laws of syzygies.",
            "Cohomology, stratifications and parametric Gröbner bases in characteristic zero.",
            "Applications of SAGBI-bases in dynamics.",
            "The Sibirsky component of the center variety of polynomial differential systems.",
            "A matching pursuit technique for computing the simplest normal forms of vector fields.",
            "Computer analysis of periodic orbits of discontinuous vector fields.",
            "Linear recurrent sequences and polynomial roots.",
            "On the normalization of numbers and functions defined by radicals.",
            "An algorithm to compute the primitive central idempotents and the Wedderburn decomposition of a rational group algebra.",
            "Double Sylvester sums for subresultants and multi-Schur functions.",
            "Preface to First order theorem proving.",
            "Model building with ordered resolution: extracting models from saturated clause sets.",
            "A calculus combining resolution and enumeration for building finite models.",
            "Stratified resolution.",
            "Limited resource strategy in resolution theorem proving.",
            "Depth-first proof search without backtracking for free-variable clausal tableaux.",
            "leanCoP: lean connection-based theorem proving.",
            "Hyperresolution for guarded formulae.",
            "Constraint contextual rewriting.",
            "On using ground joinable equations in equational theorem proving.",
            "On the complexity of equational problems in CNF.",
            "Computer proofs about finite and regular sets: the unifying concept of subvariance.",
            "Preface.",
            "Exact resultants for corner-cut unmixed multivariate polynomial systems using the Dixon formulation.",
            "Multihomogeneous resultant formulae by means of complexes.",
            "Algorithms to compute the topology of orientable real algebraic surfaces.",
            "Early termination in sparse interpolation algorithms.",
            "Algorithms for computing sparsest shifts of polynomials in power, Chebyshev, and Pochhammer bases.",
            "The resultant of an unmixed bivariate system.",
            "Factoring systems of linear PDEs with finite-dimensional solution spaces.",
            "Fast computation of discrete invariants associated to a differential rational mapping.",
            "Moving frames.",
            "Towards faster real algebraic numbers.",
            "Simplification of surface parametrizations - a lattice polygon approach.",
            "Complexity results for triangular sets.",
            "Computing in algebraic geometry and commutative algebra using Macaulay 2.",
            "High-order lifting and integrality certification.",
            "An alternative approach to comprehensive Gröbner bases.",
            "Canonical comprehensive Gröbner bases.",
            "Constructing Lie algebras of first order differential operators.",
            "Revisiting the [mu]-basis of a rational ruled surface.",
            "Automated short proof generation for projective geometric theorems with Cayley and bracket algebras: I. Incidence geometry.",
            "Automated short proof generation for projective geometric theorems with Cayley and bracket algebras: II. Conic geometry.",
            "Implicitization of differential rational parametric equations.",
            "Dense resultant of composed polynomials: Mixed-mixed case.",
            "An algorithm to find a coordinate's mate.",
            "Bases for projective modules in An(k).",
            "Liouvillian solutions of third order differential equations.",
            "Resolution-based decision procedures for the universal theory of some classes of distributive lattices with operators.",
            "Computing all parametric solutions for blending parametric surfaces."
        ]
    },
    {
        "name": "JSC",
        "year": "2002",
        "info": "2002: Volumes\n33, 34",
        "count": 79,
        "papers": [
            "Introduction to the GiNaC Framework for Symbolic Computation within the C++ Programming Language.",
            "Fast Computation of the Bezout and Dixon Resultant Matrices.",
            "Constructing Faithful Representations of Finitely-generated Torsion-free Nilpotent Groups.",
            "Continuously Parameterized Symmetries and Buchberger's Algorithm.",
            "On the Computation of Elementary Divisors of Integer Matrices.",
            "SAGBI Bases Under Composition.",
            "Solvability of Context Equations with Two Context Variables is Decidable.",
            "FFT-like Multiplication of Linear Differential Operators.",
            "Computing Subgroups by Exhibition in Finite Solvable Groups.",
            "Computing Transformation Semigroups.",
            "Regular Gröbner Bases.",
            "A New Algorithm for Discussing Gröbner Bases with Parameters.",
            "Gröbner Bases in Orders of Algebraic Number Fields.",
            "The Inverse Gröbner Basis Problem in Codimension Two.",
            "Approximate Solutions of Polynomial Equations.",
            "Identities for the Associator in Alternative Algebras.",
            "A Family of Sparse Polynomial Systems Arising in Chemical Reaction Systems.",
            "Predicting Zero Coefficients in Formal Power Series Computations.",
            "Local Box Adjacency Algorithms for Cylindrical Algebraic Decompositions.",
            "The Riccati Equation in Mathematical Finance.",
            "Symmetry in Planar Dynamical Systems.",
            "Size Reduction and Partial Decoupling of Systems of Equations.",
            "A Fast Euclidean Algorithm for Gaussian Integers.",
            "Symbolic and Numeric Methods for Exploiting Structure in Constructing Resultant Matrices.",
            "Tamely Ramified Towers and Discriminant Bounds for Number Fields-II.",
            "Computing Riemann-Roch Spaces in Algebraic Function Fields and Related Topics.",
            "Sparse Resultant of Composed Polynomials IMixed-. Unmixed Case.",
            "Sparse Resultant of Composed Polynomials II. Unmixed-Mixed Case.",
            "Solving Genus Zero Diophantine Equations with at Most Two Infinite Valuations.",
            "Quantified Constraints Under Perturbation.",
            "A Mathematica Program for the Degrees of Certain Schubert Varieties.",
            "Preface.",
            "Rational Normal Forms and Minimal Decompositions of Hypergeometric Terms.",
            "On Multivariate Rational Function Decomposition.",
            "Scalable Parallel Coset Enumeration: Bulk Definition and the Memory Wall.",
            "Hybrid Sparse Resultant Matrices for Bivariate Polynomials.",
            "Derivations and Radicals of Polynomial Ideals over Fields of Arbitrary Characteristic.",
            "An Iterated Eigenvalue Algorithm for Approximating Roots of Univariate Polynomials.",
            "On Computer-assisted Classification of Coupled Integrable Equations.",
            "Irreducible Decomposition of Curves.",
            "Relations Between Roots and Coefficients, Interpolation and Application to System Solving.",
            "Univariate Polynomials: Nearly Optimal Algorithms for Numerical Factorization and Root-finding.",
            "A Probabilistic Algorithm to Test Local Algebraic Observability in Polynomial Time.",
            "Subquadratic Computation of Vector Generating Polynomials and Improvement of the Block Wiedemann Algorithm.",
            "Cancellative Abelian Monoids and Related Structures in Refutational Theorem Proving (Part I).",
            "Cancellative Abelian Monoids and Related Structures in Refutational Theorem Proving (Part II).",
            "Normal Parametrizations of Algebraic Plane Curves.",
            "Calculating the Galois Group of Y'= = = AY+ + + B, Y'= = = AY Completely Reducible.",
            "Orbit-stabilizer Problems and Computing Normalizers for Polycyclic Groups.",
            "Modular Termination Proofs for Rewriting Using Dependency Pairs.",
            "Barnett's Theorems About the Greatest Common Divisor of Several Univariate Polynomials Through Bezout-like Matrices.",
            "Quartic Fields and Radical Extensions.",
            "Identifying Half-Twists Using Randomized Algorithm Methods.",
            "Computation of the Dual of a Plane Projective Curve.",
            "Elimination Theory in Codimension 2.",
            "On the Resolution of Resultant Type Equations.",
            "Interval Arithmetic in Cylindrical Algebraic Decomposition.",
            "Computing Rational Forms of Integer Matrices.",
            "Potential Good Reduction of Elliptic Curves.",
            "Involutive Bases in the Weyl Algebra.",
            "Algorithmic Computation of Flattenings and of Modular Deformations.",
            "Efficient Collection in Infinite Polycyclic Groups.",
            "The Calculation of Radical Ideals in Positive Characteristic.",
            "Editorial: The Integration of Automated Reasoning and Computer Algebra Systems.",
            "Incorporating Decision Procedures in Implicit Induction.",
            "Equality in Computer Algebra and Beyond.",
            "A Constructive Algebraic Hierarchy in Coq.",
            "Comparing Approaches to the Exploration of the Domain of Residue Classes.",
            "Computing Modular Invariants of p-groups.",
            "MultInt, a MAPLE Package for Multiple Integration by the WZ Method.",
            "Linear Differential Operators for Polynomial Equations.",
            "Valuations and Filtrations.",
            "Thomas' Family of Thue Equations Over Imaginary Quadratic Fields.",
            "Computing the Primary Decomposition of Zero-dimensional Ideals.",
            "An Algorithm for Isolating the Real Solutions of Semi-algebraic Systems.",
            "Relax, but Don't be Too Lazy.",
            "Real Solving for Positive Dimensional Systems.",
            "Decomposing Monomial Representations of Solvable Groups.",
            "Taylor and Lyubeznik Resolutions via Gröbner Bases."
        ]
    },
    {
        "name": "JSC",
        "year": "2001",
        "info": "2001: Volumes\n31, 32",
        "count": 87,
        "papers": [
            "Special Issue on Computational Algebra and Number Theory: Proceedings of the Second Magma Conference - Foreword of the Guest Editor.",
            "Factoring Polynomials Over Finite Fields: A Survey.",
            "On the Deterministic Complexity of Factoring Polynomials.",
            "Some Applications of Magma in Designs and Codes: Oval Designs, Hermitian Unitals and Generalized Reed-Muller Codes.",
            "Constructions in Finite Geometry Using Computer Algebra Systems.",
            "Classical Invariants and 2-descent on Elliptic Curves.",
            "Irregular Primes and Cyclotomic Invariants to 12 Million.",
            "Class Number Relations from a Computational Point of View.",
            "On Computations in Kummer Extensions.",
            "Algorithmic Methods for Finitely Generated Abelian Groups.",
            "Computing the Subgroups of a Permutation Group.",
            "Determination of Socle Series using the Condensation Method.",
            "Computing Double Cosets in Soluble Groups.",
            "Computing in the Monster.",
            "A New Existence Proof for Ly, the Sporadic Simple Group of R. Lyons.",
            "Embeddings of PSL(2, 41) and PSL(2, 49) in E8(C).",
            "Calculating Group Cohomology: Tests for Completion.",
            "A New Approach to Primary Decomposition.",
            "An Optimal Algorithm for Constructing the Reduced Gröbner Basis of Binomial Ideals, and Applications to Commutative Semigroups.",
            "Unification of Concept Terms in Description Logics.",
            "Counting and Gröbner Bases.",
            "Sylvester-Habicht Sequences and Fast Cauchy Index Computation.",
            "Implicitization of a General Union of Parametric Varieties.",
            "An Implicitization Algorithm for Rational Surfaces with no Base Points.",
            "Decomposition Plans for Geometric Constraint Systems, Part I: Performance Measures for CAD.",
            "Decomposition Plans for Geometric Constraint Problems, Part II: New Algorithms.",
            "Matrix Generators for Exceptional Groups of Lie Type.",
            "A Generalized Sylvester Identity and Fraction-free Random Gaussian Elimination.",
            "Parallelization of Perturbation Analysis: Application to Large-scale Engineering Problems.",
            "A Parser for the Interval Evaluation of Analytical Functions and its Application to Engineering Problems.",
            "A Higher-order Interpretation of Deductive Tableau.",
            "Simple CAD Construction and its Applications.",
            "Septic Number Fields Which are Ramified Only at One Small Prime.",
            "Syntactical Methods for Braids of Three Strands.",
            "Gröbner Bases over Galois Rings with an Application to Decoding Alternant Codes.",
            "Resultants and Moving Surfaces.",
            "Curves of Genus 2 with (N, N) Decomposable Jacobians.",
            "A Direct Approach to Computing the µ-basis of Planar Rational Curves.",
            "Unmixed-dimensional Decomposition of a Finitely Generated Perfect Differential Ideal.",
            "Rectangular Corner Cutting and Dixon A-resultants.",
            "Detecting Algebraic Curves in Bad Position.",
            "Rational Solutions of Riccati-like Partial Differential Equations.",
            "Fast Evaluation of Holonomic Functions Near and in Regular Singularities.",
            "KLEIN: a MATHEMATICA Package for Radar Polarimetry Based on Spinor and Tensor Algebra.",
            "Computer Algebra and Mechanized Reasoning: Selected St. Andrews' ISSAC/Calculemus 2000 Contributions - Foreword from the Editors.",
            "Electronic Communication of Mathematics and the Interaction of Computer Algebra Systems and Proof Assistants.",
            "Algorithms for Finite Near-rings and their N-groups.",
            "Two Computational Techniques for Singularity Resolution.",
            "Formal and Efficient Primality Proofs by Use of Computer Algebra Oracles.",
            "On Efficient Sparse Integer Matrix Smith Normal Form Computations.",
            "Constructing Homomorphism Spaces and Endomorphism Rings.",
            "The Parametrization of Canal Surfaces and the Decomposition of Polynomials into a Sum of Two Squares.",
            "Computing Isomorphisms of Association Schemes and its Application.",
            "Commutative Algebra in the Mizar System.",
            "Counting Points on Curves and Abelian Varieties Over Finite Fields.",
            "Squarefree Decomposition of Univariate Polynomials Depending on a Parameter. Application to the Integration of Parametric Rational Functions.",
            "Computing Local Integral Closures.",
            "Symbolic Reachability Computation for Families of Linear Vector Fields.",
            "Constructing Irreducible Representations of Finitely Presented Algebras.",
            "Computing the Radical of an Ideal in Positive Characteristic.",
            "Condensation of Symmetrized Tensor Powers.",
            "Solving the Word Problem for Two Classes of Non-associative Rings by Rewriting.",
            "Special Issue on Calculemus-99: Integrating Computation and Deduction - Foreword of the Guest Editors.",
            "The Control Layer in Open Mechanized Reasoning Systems: Annotations and Tactics.",
            "Automatic Derivation of the Irrationality of e.",
            "On the Role of OpenMath in Interactive Mathematical Documents.",
            "MBase: Representing Knowledge and Context for the Integration of Mathematical Software Systems.",
            "A General Framework to Build Contextual Cover Set Induction Provers.",
            "Improved Projection for Cylindrical Algebraic Decomposition.",
            "Polynomial Minimum Root Separation.",
            "Computing with Quantized Enveloping Algebras: PBW-Type Bases, Highest-Weight Modules and R-Matrices.",
            "Normal Forms for Representations of Representation-finite Algebras.",
            "Computing Projectors, Injectors, Residuals and Radicals of Finite Soluble Groups.",
            "Multivariate Polynomial System Solving Using Intersections of Eigenspaces.",
            "Factoring Polynomials Over Local Fields.",
            "Algorithms for the Gauss-Manin Connection.",
            "Algebraic and Symbolic Manipulation of Poisson Series.",
            "Special Issue on Effective Methods in Rings of Differential Operators - Foreword by the Guest Editors.",
            "Minimal Free Resolutions of Homogenized D-modules.",
            "Computing Homomorphisms Between Holonomic D-modules.",
            "Rank Jumps in Codimension 2A-hypergeometric Systems.",
            "Algorithm for Computing Bernstein-Sato Ideals Associated with a Polynomial Mapping.",
            "Constructibility of the Set of Polynomials with a Fixed Bernstein-Sato Polynomial: an Algorithmic Approach.",
            "Explicit Comparison Theorems for D-modules.",
            "Uq(sl(2)) Satisfies a Bernstein Duality.",
            "Towards an Effective Version of a Theorem of Stafford.",
            "Formal Solutions of Linear PDEs and Convex Polyhedra."
        ]
    },
    {
        "name": "JSC",
        "year": "2000",
        "info": "2000: Volumes\n29, 30",
        "count": 92,
        "papers": [
            "Editorial.",
            "Editorial.",
            "Using Rewriting Systems to Compute Left Kan Extensions and Induced Actions of Categories.",
            "Fast Constructive Recognition of a Black Box Group Isomorphic to Sn or An using Goldbach's Conjecture.",
            "An Algorithmic Approach to Fundamental Groups and Covers of Combinatorial Cell Complexes.",
            "A Formula for the General Solution of a Constant-coefficient Difference Equation.",
            "SFA, a Package on Symmetric Functions Considered as Operators over the Ring of Polynomials for the Computer Algebra System Maple.",
            "Symbolic Computation and Differential Equations: Lie Symmetries.",
            "Theorem Proving Techniques for View Deletion in Databases.",
            "Cut-elimination and Redundancy-elimination by Resolution.",
            "Combining Enumeration and Deductive Techniques in order to Increase the Class of Constructible Infinite Models.",
            "Speeding up Algorithms on Atomic Representations of Herbrand Models via New Redundancy Criteria.",
            "Goals and Benchmarks for Automated Map Reasoning.",
            "Controlled Use of Clausal Lemmas in Connection Tableau Calculi.",
            "Tableau Methods for a Logic with Term Declarations.",
            "Connection Calculus Theorem Proving with Multiple Built-in Theories.",
            "An Algorithm for Computing a New Normal Form for Dynamical Systems.",
            "On the Validity of Implicitization by Moving Quadrics for Rational Surfaces with No Base Points.",
            "Efficient Decomposition of Associative Algebras over Finite Fields.",
            "On Rational Geometry of Conic Sections.",
            "Solving Systems of Strict Polynomial Inequalities.",
            "Special Issue on Symbolic Computation in Algebra, Analysis, and Geometry - Foreword of the Guest Editors.",
            "Symmetries of Polynomials.",
            "Generalized Resultants over Unirational Algebraic Varieties.",
            "Applications of Some Properties of the Canonical Module in Computational Projective Algebraic Geometry.",
            "Non-general Type Surfaces in P4: Some Remarks on Bounds and Constructions.",
            "Cohomology on Toric Varieties and Local Cohomology with Monomial Supports.",
            "Multiplicative Bases, Gröbner Bases, and Right Gröbner Bases.",
            "Primary Decomposition of Lattice Basis Ideals.",
            "Factorization-free Decomposition Algorithms in Differential Algebra.",
            "New Structure Theorem for Subresultants.",
            "Generic and Cogeneric Monomial Ideals.",
            "Local Cohomology at Monomial Ideals.",
            "A Localization Algorithm for D-modules.",
            "Computing Global Extension Modules.",
            "Weyl Closure of a Linear Differential Operator.",
            "Toric Newton Method for Polynomial Homotopies.",
            "Algorithmic Computation of de Rham Cohomology of Complements of Complex Affine Varieties.",
            "On Solutions of Linear Ordinary Difference Equations in their Coefficient Field.",
            "Algorithms for Exponentiation in Finite Fields.",
            "Challenges of Symbolic Computation: My Favorite Open Problems.",
            "Invariants, Patterns and Weights for Ordering Terms.",
            "An Algorithm to Compute the Kernel of a Derivation up to a Certain Degree.",
            "Quantifier Elimination for Trigonometric Polynomials by Cylindrical Trigonometric Decomposition.",
            "Foreword to the Special Issue on Schemas.",
            "Program Development Schemata as Derived Rules.",
            "Proofs as Schemas and Their Heuristic Use.",
            "A Calculus for Schemas in Z.",
            "An Abstract Formalization of Correct Schemas for Program Synthesis.",
            "Finding Normal Integral Bases of Cyclic Number Fields of Prime Degree.",
            "Minimally Generating Ideals of Rational Parametric Curves in Polynomial Time.",
            "Generalized Strong Pseudoprime Tests and Applications.",
            "Deciding Hopf Bifurcations by Quantifier Elimination in a Software-component Architecture.",
            "Solving Index Form Equations in Fields of Degree 9 with Cubic Subfields.",
            "Permanental Ideals.",
            "Linear Problems in Valued Fields.",
            "Computing Triangular Systems and Regular Systems.",
            "Computing Local Artin Maps, and Solvability of Norm Equations.",
            "Computer Algebra and Algebraic. Geometry-Achievements and Perspectives.",
            "The Projective Noether Maple Package: Computing the Dimension of a Projective Variety.",
            "Finding a Basis of a Linear System with Pairwise Distinct Discrete Valuations on an Algebraic Curve.",
            "Bounds for the Roots of Lacunary Polynomials.",
            "Complexity of the Havas, Majewski, Matthews LLL Hermite Normal Form Algorithm.",
            "Special Issue on Applications of Gröbner Bases - Foreword of the Guest Editors.",
            "Computing Ideals of Points.",
            "Reduced Gröbner Bases, Free Difference-Differential Modules and Difference-Differential Dimension Polynomials.",
            "Cellular Binomial Ideals. Primary Decomposition of Binomial Ideals.",
            "Automated Resolution of Singularities for Hypersurfaces.",
            "Computing Gröbner Bases by FGLM Techniques in a Non-commutative Setting.",
            "A Fast Algorithm for Gröbner Basis Conversion and its Applications.",
            "Gröbner Bases Applied to Finitely Generated Field Extensions.",
            "A Systematic Framework for Solving Geometric Constraints Analytically.",
            "Computing Orbits of Minimal Parabolic k-subgroups Acting on Symmetric k-varieties.",
            "An Algorithm for the Quillen-Suslin Theorem for Quotients of Polynomial Rings by Monomial Ideals.",
            "On the Practical Solution of Genus Zero Diophantine Equations.",
            "Proper Parametrization of Real Tubular Surfaces.",
            "Divisorial Extensions and the Computation of Integral Closures.",
            "(1+i)-ary GCD Computation in Z[i] as an Analogue to the Binary GCD Algorithm.",
            "The Symbolic Integration of Exact PDEs.",
            "Special Issue on Algorithmic Methods in Galois Theory - Foreword of the Guest Editors.",
            "Using Galois Ideals for Computing Relative Resolvents.",
            "Galois Group Computation for Rational Polynomials.",
            "Explicit Galois Realization of Transitive Groups of Degree up to 15.",
            "Multi-parameter Polynomials with Given Galois Group.",
            "A Polynomial with Galois Group SL2(11).",
            "Boundary of Hurwitz Spaces and Explicit Patching.",
            "An Algorithm of Katz and its Application to the Inverse Galois Problem.",
            "Projective Linear Groups as Galois Groups over Q via Modular Representations.",
            "Explicit Solutions of Galois Embedding Problems by Means of Generalized Clifford Algebras.",
            "Generic Polynomials with Few Parameters.",
            "Generic and Explicit Realization of Small p-groups.",
            "Generic Extensions and Generic Polynomials."
        ]
    },
    {
        "name": "JSC",
        "year": "1999",
        "info": "1999: Volumes\n27, 28",
        "count": 67,
        "papers": [
            "Computing Automatic Coset Systems and Subgroup Presentations.",
            "A Polynomial Time Algorithm for Diophantine Equations in One Variable.",
            "SAGBI and SAGBI-Gröbner Bases over Principal Ideal Domains.",
            "A Unified Approach to Linear and Nonlinear Normal Forms for Hamiltonian Systems.",
            "Monomial Orderings, Rewriting Systems, and Gröbner Bases for the Commutator Ideal of a Free Algebra.",
            "Basic Algorithms for Rational Function Fields.",
            "An Algorithm to Calculate Optimal Homogeneous Systems of Parameters.",
            "Lazy Linear Combinatorial Unification.",
            "The STO problem is NP-complete.",
            "Computer Algebra Algorithms and Routines for the Computation of Conservation Laws and Fixing of Gauge in Differential Expressions.",
            "Solving Difference Equations in Finite Terms.",
            "On Polynomial Decompositions.",
            "A Framework for Operational Equational Specifications with Pre-defined Structures.",
            "A Transducer Approach to Coxeter Groups.",
            "On Shortest Linear Recurrences.",
            "Computing Toric Ideals.",
            "Factors of Iterated Resultants and Discriminants.",
            "Construction of Finite Groups.",
            "The Groups of Order at Most 1000 Except 512 and 768.",
            "Computing Subgroups Invariant Under a Set of Automorphisms.",
            "Sheaf Cohomology is #P-hard.",
            "A Categorical Critical-pair Completion Algorithm.",
            "A Computational Method for Determining Strong Stabilizability of n-D Systems.",
            "Integrating Factors for Second-order ODEs.",
            "The Pohlig-Hellman Method Generalized for Group Structure Computation.",
            "The Generating Function for the Number of Roots of a Coxeter Group.",
            "Symbolic Asymptotics: Multiseries of Inverse Functions.",
            "Complexity of Computing the Local Dimension of a Semialgebraic Set.",
            "Renormalization Automated by Hopf Algebra.",
            "Matrices in Elimination Theory.",
            "On the Bézout Construction of the Resultant.",
            "Simultaneous Elimination by using Several Tools from Real Algebraic Geometry.",
            "On the Theories of Triangular Sets.",
            "Triangular Sets for Solving Polynomial Systems: a Comparative Implementation of Four Methods.",
            "Solving Degenerate Sparse Polynomial Systems Faster.",
            "Finding All Isolated Zeros of Polynomial Systems inCnvia Stable Mixed Volumes.",
            "Weak Wu Stratification in Rn.",
            "Recent Advances on Determining the Number of Real Roots of Parametric Polynomials.",
            "A Modular Method to Compute the Rational Univariate Representation of Zero-dimensional Ideals.",
            "On the Complexity of Gröbner Bases Conversion.",
            "Gröbner Bases, Invariant Theory and Equivariant Dynamics.",
            "Polynomial Systems from Certain Differential Equations.",
            "An Optimal Algorithm for Constructing the Reduced Gröbner Basis of Binomial Ideals.",
            "A Practical Algorithm for Finding Matrix Representations for Polycyclic Groups.",
            "Practical Algorithms for Polycyclic Matrix Groups.",
            "Elimination of Conditions.",
            "Application of Computer Algebra Systems for Stability Analysis of Difference Schemes on Curvilinear Grids.",
            "Foreword of the Guest Editors.",
            "Galois Theory of Differential Equations, Algebraic Groups and Lie Algebras.",
            "Computing Galois Groups of Completely Reducible Differential Equations.",
            "Differential Equations of Order Two with One Singular Point.",
            "Two Generator Subgroups of SL(2, C) and the Hypergeometric, Riemann, and Lamé Equations.",
            "On Rational Solutions of Systems of Linear Differential Equations.",
            "An Algorithm Computing the Regular Formal Solutions of a System of Linear Differential Equations.",
            "Liouvillian Solutions of Linear Differential Equations of Order Three and Higher.",
            "The Schmidt-Kolchin Conjecture.",
            "The Differential Ideal [P]: Minfty.",
            "Essential Components of an Algebraic Differential Equation.",
            "Computation of Hilbert Polynomials in Two Variables.",
            "Multibasic and Mixed Hypergeometric Gosper-Type Algorithms.",
            "Toward Symbolic Integration of Elliptic Integrals.",
            "Decomposition of Polynomials with Respect to the Cyclic Group of Order m.",
            "Inversion Problems in the q-Hahn Tableau.",
            "Algorithms for q-Hypergeometric Summation in Computer Algebra.",
            "The Fourth-order Difference Equation Satisfied by the Associated Orthogonal Polynomials of the Delta-Laguerre-Hahn Class.",
            "Computing with Differential-difference Operators.",
            "Partial Differential Equations and Bivariate Orthogonal Polynomials."
        ]
    },
    {
        "name": "JSC",
        "year": "1998",
        "info": "1998: Volumes\n25, 26",
        "count": 74,
        "papers": [
            "Counting Points on Curves over Finite Fields.",
            "A Generalization of Gröbner Basis Algorithms to Polycyclic Group Rings.",
            "Finding Intersections and Normalizers in Finely Generated Nilpotent Groups.",
            "A Polycyclic Quotient Algorithm.",
            "The Computation and Application of the Generalized Inverse via Maple.",
            "A Survey of User Interfaces for Computer Algebra Systems.",
            "A Generic Approach to Building User Interfaces for Theorem Provers.",
            "NEWTON: An Interactive Environment for Exploring Mathematics.",
            "Design and Implementation of MP, a Protocol for Efficient Exchange of Mathematical Expressions.",
            "The Use of Proof Planning for Co-operative Theorem Proving.",
            "Interactive Theorem Proving: An Empirical Study of User Activity.",
            "The Geobucket Data Structure for Polynomials.",
            "Decomposing Polynomial Systems into Simple Systems.",
            "Gröbner Bases and Normal Forms in a Subring of the Power Series Ring on Countably Many Variables.",
            "Symbolic Asymptotics: Functions of Two Variables, Implicit Functions.",
            "Matrix Generators for the Orthogonal Groups.",
            "Explicit Bounds for the Solutions of Elliptic Equations with Rational Coefficients.",
            "Generation and Verification of Algorithms for Symbolic-Numeric Processing.",
            "Computation of the Interval of Stability of Runge-Kutta-Nyström Methods.",
            "Completion of Rewrite Systems with Membership Constraints. Part I: Deduction Rules.",
            "Completion of Rewrite Systems with Membership Constraints. Part II: Constraint Solving.",
            "Dynamically Typed Computations for Order-Sorted Equational Presentations.",
            "A Semantic Approach to Order-Sorted Rewriting.",
            "Bounds for Absolute Positiveness of Multivariate Polynomials.",
            "The Search for the Maximum of a Polynomial.",
            "Systems of Algebraic Equations with Bad Reduction.",
            "Groebner Basis Under Composition I.",
            "Descriptions of Groups of Primepower Order.",
            "The Theory of Involutive Divisions and an Application to Hilbert Function Computations.",
            "Differential Equations and Algebraic Relations.",
            "Generating a Noetherian Normalization of the Invariant Ring of a Finite Group.",
            "A Deterministic Lazy Narrowing Calculus.",
            "Infinite String Rewrite Systems and Complexity.",
            "Rational Parametrization of Surfaces.",
            "Advances on the Simplification of Sine-Cosine Equations.",
            "Modular Arithmetic for Linear Algebra Computations in the Real Field.",
            "An Algorithm for Solving the Factorization Problem in Permutation Groups.",
            "Negation Elimination in Empty or Permutative Theories.",
            "Sparsification of Rectangualr Matrices.",
            "On Two-Parametric Quartic Families of Diophantine Problems.",
            "On a Family of Quintic Thue Equations.",
            "Non-Commutative Elimination in Ore Algebras Proves Multivariate Identities.",
            "A Parallel Implementation of Buchberger's Algorithm over Zp for p <= 31991.",
            "An Algebraic Computational Approach to the Identifiability of Fourier Models.",
            "A Constructive Description of SAGBI Bases for Polynomial Invariants of Permutation Groups.",
            "An Algorithm for Computing the Integral Closure.",
            "Algorithms for Trigonometric Curves (Simplification, Implicitization, Parameterization).",
            "Properties of Gröbner Bases and Applications to Doubly Periodic Arrays.",
            "Construction of Linear Systems on Hyperelliptic Curves.",
            "Computing Representations of a Lie Group via the Universal Enveloping Algebra.",
            "Composing Power Series Over a Finite Ring in Essentially Linear Time.",
            "Finding Possible Permutation Characters.",
            "Geometry and Structure of Lie Pseudogroups from Infinitesimal Defining Systems.",
            "Computation of the Maximal Degree of the Inverse of a Cubic Automorphism of the Affine Plane with Jacobian 1 via Gröbner Bases.",
            "The Schur-Cohn Algorithm Revisited.",
            "Strategies for Computing Minimal Free Resolutions.",
            "Reduced Gröbner Bases Under Composition.",
            "An Algorithm Determining the Difference Galois Group of Second Order Linear Difference Equations.",
            "Factoring in Skew-Polynomial Rings over Finite Fields.",
            "Classification of Hermitian Forms with the Neighbour Method.",
            "Efficient Algorithms for Computing the Jacobi Symbol.",
            "Algorithmic Properties of Polynomial Rings.",
            "Factoring Modular Polynomials.",
            "A Normal Form for Function Rings of Piecewise Functions.",
            "Infinite Convergent String-Rewriting Systems and Cross-Sections for Finitely Presented Monoids.",
            "On Approximate GCDs of Univariate Polynomials.",
            "Nearest Singular Polynomials.",
            "When are Two Numerical Polynomials Relatively Prime?",
            "A Fast and Numerically Stable Euclidean-Like Algorithm for Detecting Relatively Prime Numerical Polynomials.",
            "Computing the Isolated Roots by Matrix Methods.",
            "A Symbolic-Numerical Method for Finding a Real Solution of an Arbitrary System of Nonlinear Algebraic Equations.",
            "Remarks on Automatic Algorithm Stabilization.",
            "Numerical Schubert Calculus.",
            "Riemann Surfaces, Plane Algebraic Curves and Their Period Matrices."
        ]
    },
    {
        "name": "JSC",
        "year": "1997",
        "info": "1997: Volumes\n23, 24",
        "count": 77,
        "papers": [
            "Paramodulation with Built-in AC-Theories and Symbolic Constraints.",
            "Oriented Equational Logic Programming is Complete.",
            "Automated Theorem Proving by Test Set Induction.",
            "Solving a Unification Problem under Constrained Substitutions Using Tree Automata.",
            "New Algorithm for Computing the Asymptotic Solutions of a Class of Linear Differential Systems.",
            "Implicitization of Parametric Curves and Surfaces by Using Multidimensional Newton Formulae.",
            "Implicitizing Rational Curves by the Method of Moving Algebraic Curves.",
            "Implicitization of Nested Circular Curves.",
            "Parametrization of Algebraic Curves over Optimal Field Extensions.",
            "Rational Parametrizations of Algebraic Curves Using a Canonical Divisor.",
            "An Algebraic Approach to Computing Adjoint Curves.",
            "Real Reparametrizations of Real Curves.",
            "Computing Rational Parametrizations of Canal Surfaces.",
            "Parametric Generalized Offsets to Hypersurfaces.",
            "Symbolic Constraints in Constructive Geometric Constraint Solving.",
            "Conic Approximation of Conic Offsets.",
            "Spline Approximations of Real Algebraic Surfaces.",
            "Some Algorithms for Nilpotent Permutation Groups.",
            "Subresultants Under Composition.",
            "Interactive Theorem Proving with Temporal Logic.",
            "Omega-Termination is Undecidable for Totally Terminating Term Rewriting Systems.",
            "SP, a Package for Schubert Polynomials Realized with the Computer Algebra System. MAPLE.",
            "Two Perturbation Calculations in Fluid Mechanics Using Large-Expression Management.",
            "Visualizations for Mathematics Courses Based on a Computer Algebra System.",
            "A Use of Computers to Teach Group Theory and Introduce Students to Research.",
            "Using the Magma Computer Algebra System in Abstract Algebra Courses.",
            "Scientific Computing: One Part of the Revolution.",
            "A Course in Computational Nonassociative Algebra.",
            "Teaching Computational Abstract Algebra.",
            "Applications of the Differential Algebra Package diffgrob2 to Classical Symmetries of Differential Equations.",
            "Worksheets and Notebooks: Can We Teach Mathematical Algorithms with Them?",
            "Computer Algebra and Interpolation: A Lesson Plan.",
            "Trying to Do Group Theory with Undergraduates and Computers.",
            "Mathematica Notebooks for a Conventional Differential Equations Course.",
            "Formal Solutions and Factorization of Differential Operators with Power Series Coefficients.",
            "A Rational Approach to the Prelle-Singer Algorithm.",
            "A Note on Subresultants and the Lazard/Rioboo/Trager Formula in Rational Function Integration.",
            "On the Stability of Gröbner Bases Under Specializations.",
            "Increasing Model Building Capabilities by Constraint Solving on Terms with Integer Exponents.",
            "Numeric Deduction in Symbolic Computation. Application to Normalizing Transformations.",
            "PSPCLink: A Cooperation Between General Symbolic and Poisson Series Processors.",
            "Computing the Newtonian Graph.",
            "Nonlinear Control System Design by Quantifier Elimination.",
            "Robust Multi-Objective Feedback Design by Quantifier Elimination.",
            "Testing Stability by Quantifier Elimination.",
            "Simulation and Optimization by Quantifier Elimination.",
            "Simplification of Quantifier-Free Formulae over Ordered Fields.",
            "The Magma Algebra System I: The User Language.",
            "KANT V4.",
            "Computing Chief Series, Composition Series and Socles in Large Permutation Groups.",
            "Computing Sylow Subgroups in Permutation Groups.",
            "Computing Ext Algebras for Finite Groups.",
            "Computing Isometries of Lattices.",
            "Analysing Finitely Presented Groups by Constructing Representations.",
            "Lattices of Compatibly Embedded Finite Fields.",
            "Computing with Subfields.",
            "On Computing Subfields.",
            "Bohdan S. Majewski: Integer Matrix Diagonalization.",
            "Algorithm for the Computation of Canonical Forms of Matrices over Fields.",
            "Subexponential Algorithms for Class Group and Unit Computations.",
            "Toric Degenerations of Polynomial Ideals and Geometric Localization of Fans.",
            "Converting Bases with the Gröbner Walk.",
            "Constructing Permutation Representations for Matrix Groups.",
            "Constructing a Representation of the Group.",
            "The 2-Modular Characters of Conway's Third Group Co3.",
            "On Testing a Bivariate Polynomial for Analytic Reducibility.",
            "Factorization of Differential Operators with Rational Functions Coefficients.",
            "Rectifying Transformations for the Integration of Rational Trigonometric Functions.",
            "Solving a Multivariable Congruence by Change of Term Order.",
            "Symbolic Computation of Conserved Densities for Systems of Nonlinear Evolution Equations.",
            "How to Recognize Zero.",
            "Computing in the Field of Complex Algebraic Numbers.",
            "On Validated Computing in Algebraic Number Fields.",
            "Detection and Validation of Clusters of Polynomial Zeros.",
            "Estimations for the Separation Number of a Polynomial System.",
            "Floating-point versus Symbolic Computations in theQD-algorithm.",
            "A New Approach for Analytical Computation of Hamiltonian of a Satellite Perturbed Motion."
        ]
    },
    {
        "name": "JSC",
        "year": "1996",
        "info": "1996: Volumes\n21, 22",
        "count": 71,
        "papers": [
            "The Habicht Approch to Subresultants.",
            "Comparing Curried and Uncurried Rewriting.",
            "Inductive Theorem Proving for Design Specification.",
            "Order Stars and Linear Stability Theory.",
            "Ideal Decompositions and Subfields.",
            "Analogs of Gröbner Bases in Polynomial Rings over a Ring.",
            "Gröbner Bases with Respect to Generalized Term Orders and their Application to the Modelling Problem.",
            "Computing B-Orbits on G/H.",
            "Unification in the Union of Disjoint Equational Theories: Combining Decision Procedures.",
            "The Method of Multiple Scales: Asymptotic Solutions and Normal Forms for Nonlinear Oscillatory Problems.",
            "Normalized Rewriting: An Alternative to Rewriting Modulo a Set of Equations.",
            "A Remark on Infinite Matching vs Infinite Unification.",
            "Memory Management in the PoSSo Solver.",
            "Improved Techniques for Factoring Univariate Polynomials.",
            "Implicitization of Rational Parametric Surfaces.",
            "Construction of Finitely Presented Lie Algebras and Superalgebras.",
            "Calculating Invariant Rings of Finite Groups over Arbitrary Fields.",
            "Solving Discriminant Form Equations Via Unit Equations.",
            "Modular Algorithm for Sparse Multivariate Polynomial Interpolation and its Parallel Implementation.",
            "Parallel Polynomial Operations on SMPs: an Overview.",
            "Strategy-Accurate Parallel Buchberger Algorithms.",
            "A Distributed and Cooperative Environment for Computer Algebra.",
            "Bidirectional Exact Integer Division.",
            "Parallel Implementation of the Accelerated Integer GCD Algorithm.",
            "Performance Analysis of the Parallel Karatsuba Multiplication Algorithm for Distributed Memory Architectures.",
            "Strategy Compliant Multi-Threaded Term Completion.",
            "On the Reconstruction of Proofs in Distributed Theorem Proving: a Modified Clause-Diffusion Method.",
            "Recording and Analysing Knowledge-Based Distributed Deduction Processes.",
            "PSATO: a Distributed Propositional Prover and its Application to Quasigroup Problems.",
            "Parallelizing Imperative Functional Programs: the Vectorization Monad.",
            "Shared Memory Implementation of the Gamma-Operation.",
            "A Para-Functional Programming Interface for a Parallel Computer Algebra Package.",
            "A Semi-Automatic Multiple-Strategy Approach To Mapping Tree-Structured Symbolic Processing Programs.",
            "The Constraint-Based Knowledge Broker Model: Semantics, Implementation and Analysis.",
            "Extending the µLog Framework with Local and Conditional Blackboard Operations.",
            "Constraint Satisfaction in Distributed Concurrent Logic Programming.",
            "A Methodology for Granularity-Based Control of Parallelism in Logic Programs.",
            "Polynomial-Time Computation of the Dimension of Algebraic Varieties in Zero-Characteristic.",
            "The Ideal Membership Problem in Non-Commutative Polynomial Rings.",
            "AC Complement Problems: Satisfiability and Negation Elimination.",
            "Applying Quantifier Elimination to the Birkhoff Interpolation Problem.",
            "Symbolic Finite Element Modeling of Structural Systems.",
            "On Different Structure-Preserving Translations to Normal Form.",
            "On the Modularity of Normal Forms in Rewriting.",
            "For Groups the Property of Having Finite Derivation Type is Equivalent to the Homological Finiteness Condition FP_3.",
            "Note on Kovacic's Algorithm.",
            "Symmetric Representation of the Elements of the Janko Group J_1.",
            "On the List of Finite Primitive Permutation Groups of Degree <= 50.",
            "MAPinsure - A MAPLE Package for Life Insurance.",
            "Decomposition of Algebraic Functions.",
            "Localization and Primary Decomposition of Polynomial Ideals.",
            "Bi-Rewrite Systems.",
            "Decidability of Unification in the Theory of One-Sided Distributivity and a Multiplicative Unit.",
            "Symbolic Computation on Complex Polynomial Solution of Differential Equations.",
            "Hilbert Functions and the Buchberger Algorithm.",
            "Computing x^m mod p(x) and an Application to Splitting a Polynomial Into Factors Over a Fixed Disc.",
            "Efficient Simulation of Forward-Branching Systems with Constructor Systems.",
            "Modular Higher-Order Equational Preunification.",
            "On the Resolution of Index form Equations in Sextic Fields with an Imaginary Quadratic Subfield.",
            "Rigorous Error Analysis of Numerical Algorithms via Symbolic Computations.",
            "Symbolic Solutions for a Class of Partial Differential Equations.",
            "Timed Default Concurrent Constraint Programming.",
            "Deriving Liveness Goals from Temporal Logic Specifications.",
            "Temporal Annotated Constraint Logic Programming.",
            "Dense Time Logic Programming.",
            "Executable Temporal Logic for Non-Monotonic Reasoning.",
            "Temporal Semantics for Concurrent Metatem.",
            "A Non-Standard Temporal Deductive Database System.",
            "NatureTime: Temporal Granularity in Simulation of Ecosystems.",
            "Dealing with Multiple Granularity of Time in Temporal Logic Programming.",
            "Executable Temporal Logic Systems."
        ]
    },
    {
        "name": "JSC",
        "year": "1995",
        "info": "1995: Volumes\n19, 20",
        "count": 74,
        "papers": [
            "Analogical Type Theory.",
            "On Coherence in Computer Algebra.",
            "Subtyping Inheritance and Its Application in Languages for Symbolic Computation Systems.",
            "A Computer Algebra System Based on Ordersorted Algebra.",
            "A Type System for Computer Algebra.",
            "The Design of the SACLIB/PACLIB Kernels.",
            "Compact Delivery Support for REDUCE.",
            "A Double-Digit Lehmer-Euclid Algorithm for Finding the GCD of Long Integers.",
            "Visualization of Mathematical Surfaces: The IZIC Server Approach.",
            "A Sequent Calculus for Automated Reasoning in Symbolic Computation Systems.",
            "Context in Mathematical Reasoning and Computation.",
            "A Generic Graphic Framework for Combining Inference Tools and Editing Proofs and Formulae.",
            "Distributed Deduction by Clause-Diffusion: Distributed Contraction and the Aquarius Prover.",
            "Process Scheduling in DSC and the Large Sparse Linear Systems Challenge.",
            "Computing Bases for Rings of Permutation-Invariant Polynomials.",
            "The Summation of Rational Functions by an Extended Gosper Algorithm.",
            "A Deterministic Constructin of Normal Bases With Complexity O(n³+n log n log(log n) log q).",
            "Theorem Proving with Ordering and Equality Constrained Clauses.",
            "Resolution-Based Theorem Proving for Manyvalued Logics.",
            "Fraction Free Gaussian Elimination for Sparse Matrices.",
            "Coefficient Fields of Solutions in Kovacic's Algorithm.",
            "Homogeneous Bivariate Decompositions.",
            "Factorization of Prime Ideal Extensions in Dedekind Domains.",
            "A Gröbner Approach to Involutive Bases.",
            "The Todd-Coxeter Procedure and Left Kan Extensions.",
            "Perfect Bases for Equational Theories.",
            "A Fast Method for Finding the Basis of Nonnegative Solutions to a Linear Diophantine Equation.",
            "A Rational Function Decomposition Algorithm by Near-Separated Polynomials.",
            "Algorithms in Local Algebra.",
            "Galois Action on Solutions of a Differential Equation.",
            "Selecting Base Points for the Schreier-Sims Algorithm for Matrix Groups.",
            "The 2-Modular Decomposition Matrices of the Non-Principal Blocks of Maximal Defect of the Triple Cover of the Sporadic Simple McLaughlin Group.",
            "Confluence of Curried Term-Rewriting Systems.",
            "Modular Properties of Composable Term Rewriting Systems.",
            "Total Termination of Term Rewriting is Undecidable.",
            "Computing Elements of Given Index in Totally Complex Cyclic Sextic Fields.",
            "On n-Dimensional Sequences I.",
            "On the Minimal Realizations of a Finite Sequence.",
            "Efficient Inceremtal Algorithms for the Sparse Resultant and the Mixed Volume.",
            "Constructing Carmichael Numbers which are Strong Pseudoprimes to Several Bases.",
            "A Note on Gröbner Bases and Integration of Rational Functions.",
            "Asymptotic Forms and Algebraic Differential Equations.",
            "An Algorithm to Determine Potential Systems in Mathematica.",
            "Gröbner Bases in Clifford and Grassmann Algebras.",
            "Linear Problems and Linear Algorithms.",
            "Automata for Reduction Properties Solving.",
            "Greatest Factorial Factorization and Symbolic Summation.",
            "Generalized Subresultants for Computing the Smith Normal Form of Polynomial Matrices.",
            "Efficient Rational Number Reconstruction.",
            "Computing GCDs of Polynomials over Algebraic Number Fields.",
            "T-Theorem Proving I.",
            "The Complexity of Counting Problems in Equational Matching.",
            "A New Polynomial Factorization Algorithm and its Implementation.",
            "Algorithms for m-Fold Hypergeometric Summation.",
            "Theoretical and Experimental Comparison of Efficiency of Finite Field Extensions.",
            "Positive and Negative Results for Higher-Order Disunification.",
            "Reduced Idempotents in the Semigroup of Boolean Matrices.",
            "On a Conjecture of Peter Borwein.",
            "Parallelogram Polyominoes and Corners.",
            "Ramanujan's Theories of Elliptic Functions to Alternative Bases-a Symbolic Excursion.",
            "Finding Identities with the WZ Method.",
            "Some Combinatorial Results First Found Using Computer Algebra.",
            "Closed Forms for the Number of Polygon Dissections.",
            "Parallel Computation and Indefinite Summation: A MAPLE Application for the Rational Case.",
            "Rational Summation and Gosper-Petkovsek Representation.",
            "An Algorithm for Finding Recurrence Ralations of Binomial Sums and its Complexity.",
            "Computer Algebra Libraries for Combinatorial Structures.",
            "A Mathematica Version of Zeilberger's Algorithm for Proving Binomial Coefficient Identities.",
            "Three Recitations on Holonomic Systems and Hypergeometric Series.",
            "Five Surprisingly Simple Complexities.",
            "The Computer-Aided Discovery of a Theorem about Young Tableaux.",
            "HYP and HYPQ.",
            "RComp: A Mathematica Package for Computing with Recursive Sequences.",
            "A Maple Package for Symmetric Functions."
        ]
    },
    {
        "name": "JSC",
        "year": "1994",
        "info": "1994: Volumes\n17, 18",
        "count": 63,
        "papers": [
            "Completeness of Combinations of Conditional Constructor Systems.",
            "Termination of Term Rewriting: Interpretation and Type Elimination.",
            "A Constructor-Based Approach to Positive/Negative-Conditional Equational Specifications.",
            "Linearizing Term Rewriting Systems Using Test Sets.",
            "Isomorphism Testing for p-Groups.",
            "Hilbert Series for Ideals Generated by Generic Forms.",
            "Calculations with Simplicial and Cubical Groups in AXIOM.",
            "A Corrigendum for the Optimized-IPIA.",
            "A New Method for the Boolean Ring Based Theorem Proving.",
            "Exact Transversal Hypergraphs and Application to Boolean µ-Functions.",
            "Fast Computation of Some Asymptotic Functional Inverses.",
            "Idempotent Computation over Finite Fields.",
            "Classifying Geometries with Cayley.",
            "On the Smallest Divisor of a Polynomial.",
            "Symbolic Computation of DeWitt-Seeley-Gilkey Coefficients on Curved Manifolds.",
            "Complexity, Algorithms, Programs, Systems: The Shifting Focus.",
            "Evolution of a Software System: Interaction, Interfaces and Applications in the XYZ GeoBench.",
            "An Application of Point Pattern Matching in Astronautics.",
            "Grail: A C++ Library for Automata and Expressions.",
            "Surface Reconstruction Between Simple Polygons via Angle Criteria.",
            "Fast Construction of Irreducible Polynomials over Finite Fields.",
            "Injectivity of Composite Functions.",
            "Computing a Set of Generators of Minimal Cardinality in a Solvable Group.",
            "Regular Path Expressions in Feature Logic.",
            "Symbolic Local Refinement of Tetrahedral Grids.",
            "Analysis of a Left-Shift Binary GCD Algorithm.",
            "Zeros of Equivariant Vector Fields: Algorithms for an Invariant Approach.",
            "A Random Base Change Algorithm for Permutation Groups.",
            "Peakword Condensation and Submodule Lattices: An Application of the Meat-Axe.",
            "Multi-Modular Approach to Polynomial-Time Factorization of Bivariate Integral Polynomials.",
            "A Multipurpose Backtracking Algorithm.",
            "Abstract Parametric Classes and Abstract Data Types defined by Classical and Constructive Logical Methods.",
            "A Microcomputer Based System for Small Relation Algebras.",
            "A Computer Algebra Approach to the Discrete Dirichlet Problem.",
            "Finite Derivation Type Implies the Homological Finiteness Condition FP_3.",
            "Combining Symbolic Constraint Solvers on Algebraic Domains.",
            "Transformation of Logic Programs to FP Programs Based on Dataflows.",
            "Simple Multivariate Polynomial Multiplication.",
            "The Hecke Operators on S_k(Gamma_1 (N)).",
            "Real Number Computations: On the Use of Information.",
            "Parallel Computation of Gröbner Bases on Distributed Memory Machines.",
            "A Gröbner Basis Method for Modules over Rings of Differential Operators.",
            "Differentiation and Integration of Indefinite Summations with Respect to Indexed Variables - Some Rules and Applications.",
            "Symbolic Derivation of Runge-Kutta Methods.",
            "Tree Automata Help One To Solve Equational Formulae In AC-Theories.",
            "Bounded, Strongly Sequential and Forward-Branching Term Rewriting Systems.",
            "An Algorithm for Computing an Integral Basis in an Algebraic Function Field.",
            "Prime Decompositions of Radicals in Polynomial Rings.",
            "A Case Where Choosing a Product Order Makes the Calculations of a Groebner Basis Much Faster.",
            "Landau's Inequality via Hadamard's.",
            "Irreducible Linear Differential Equations of Prime Order.",
            "On Some Bounds for Zeros of Norm-Bounded Polynomials.",
            "Algebraic Numbers: An Example of Dynamic Evaluation.",
            "On Flatness of Generic Projections.",
            "Complexity Bounds for Some Finite Forms of Kruskal's Theorem.",
            "The STO-Problem is NP-Hard.",
            "Why You Cannot Even Hope to use Gröbner Bases in Public Key Cryptography: An Open Letter to a Scientist Who Failed and a Challenge to Those Who Have Not Yet Failed.",
            "On The Minors Defined By A Generic Matrix.",
            "Efficient Algorithms for the Riemann-Roch Problem and for Addition in the Jacobian of a Curve.",
            "A Finite Soluble Quotient Algorithm.",
            "Term Rewriting for the Conjugacy Problem and the Braid Groups.",
            "Solving Hankel Systems over the Integers.",
            "Tensor Products and Computability."
        ]
    },
    {
        "name": "JSC",
        "year": "1993",
        "info": "1993: Volumes\n15, 16",
        "count": 78,
        "papers": [
            "Compiling Pattern Matching by Term Decomposition.",
            "Implementing CLP(IB) Using the Connection Theorem Proving Method and a Clause Management System.",
            "Transitivity for Weak and Strong Gröbner Bases.",
            "The Equivalence Problem for Finite Rings.",
            "The Study of Motion for a Gyroscope with Gimbal Suspension: Obtaining the Highest Approximations for a Drift of Magnus.",
            "Computer Algebra Techniques in Affinity Binding Equations: The Dimer Case.",
            "Computer Classification of the Integrable Coupled Kdv-like Systems with Unit Main Matrix.",
            "Symbolically Precise Solutions to a Homogeneous Second Order Matrix Ordinary Differential Equation with Macsyma.",
            "Multipolynomial Resultant Algorithms.",
            "On Factorizing the Symbolic U-Resultant - Application of the ddet Operator -.",
            "A Generalized Euclidean Algorithm for Computing Triangular Representations of Algebraic Varieties.",
            "An Algorithm for Exact Division.",
            "On an Efficient Algorithm for Big Rational Number Computations by Parallel p-adics.",
            "On Lucky Primes.",
            "Isomorphisms of Modular Group Algebras: An Algorithm and its Application to Groups of Order.",
            "On Holt's Algorithm.",
            "Finite Acyclic Theories are Unitary.",
            "Standard Bases in Power Series Rings: Uniqueness and Superfluous Critical Pairs.",
            "Primary Decomposition of Modules: Two Variables over a Field.",
            "A Combinatorial Proof of the Effective Nullstellensatz.",
            "On the Representation of 1 by Binary Cubic Forms of Positive Discriminant.",
            "Identities Arising From Hecke Transformations of Modular Forms Over Q(\\surd2) and Q(\\surd3).",
            "The Brauer Tree for J_3 in Characteristic 17.",
            "Completeness of Combinations of Constructor Systems.",
            "Automatic Computation of Z- & Inverse Z-Transformations by Maple.",
            "Surprising Mathematics Using a Computer Algebra System.",
            "Factorization of Multivariate Polynomials with Coefficients in F_p.",
            "Polynomial Factorization Sharp Bounds, Efficient Algorithms.",
            "A Fast Algorithm for Generating Reduced Ground Rewriting Systems from a Set of Ground Equations.",
            "An Efficient Algorithm and Parallel Implementations for Binary and Residue Number Systems.",
            "Deductive and Inductive Synthesis of Equational Programs.",
            "Deriving Fold/Unfold Transformations of Logic Programs Using Extended OLDT-Based Abstract Interpretation.",
            "Origin Tracking.",
            "Synthesis Aspects in the Design of Efficient Processor Arrays from Affine Recurrence Equations.",
            "Constructing Specification Morphisms.",
            "Synthesis of ML Programs in the System Coq.",
            "QPC_2: A Constructive Calculus with Parameterized Specifications.",
            "A Derived Algorithm for Evaluating \\varepsilon-Expressions over Abstract Sets.",
            "On the Mechanical Derivation of Loop Invariants.",
            "Logical Debugging.",
            "Logic Program Synthesis from Incomplete Specifications.",
            "Synthesis of Real Time Acceptors.",
            "Schur-Cohn Sub-Transforms of a Polynomial.",
            "Galois Groups of Second and Third Order Linear Differential Equations.",
            "Liouvillian and Algebraic Solutions of Second and Third Order Linear Differential Equations.",
            "Low Degree Solutions to Linear Equations with K[x] Coefficients.",
            "An Elimination Method for Polynomial Systems.",
            "Bounds for the Height of a Factor of a Polynomial in Terms of Bombieri's Norms: I. The Largest Factor.",
            "Bounds for the Height of a Factor of a Polynomial in Terms of Bombieri's Norms: II. The Smallest Factor.",
            "Some Questions Concerning Computer-Generated Proofs of a Binomial Double- Sum Identy.",
            "An Axiomatic Approach to Robust Geometric Programs.",
            "On the Problem of Generating Small Convergent Systems.",
            "Parallel Scheduling of Recursively Defined Arrays: Revisited.",
            "Integration of a Class of Transcendental Liouvillian Functions with Error-Functions, Part II.",
            "Improvement of the Degree Setting in Gospers's Algorithm.",
            "Computing View Graphs of Algebraic Surfaces.",
            "A Note on Polynomial Reduction.",
            "Term Rewrite Systems for Lattice Theory.",
            "Experimenting with the Identity (xy)z = y(zx).",
            "On the Resolution of F(x, y)=G(x, y).",
            "Isomorphism Testing for p-Groups.",
            "A Fast Algorithm for Finding \"Small\" Solutions of F(x, y)=G(x, y) over Imaginary Quadratic Fields.",
            "Efficient Computation of Zero-Dimensional Gröbner Bases by Change of Ordering.",
            "An Algorithm for Computing Graded Algebras.",
            "On Computing Closed Forms for Indefinite Summations.",
            "Chebyshev and Legendre Spectral Methods in Algebraic Manipulation Languages.",
            "Factorization of Polynomials over Finite Fields and Characteristic Sequences.",
            "The Transitive Groups of Degree Fourteen and Fifteen.",
            "Computing Closed Form Solutions of First Order ODEs Using the Prelle-Singer Procedure.",
            "Consolution as a Framework for Comparing Calculi.",
            "Generalizations of Unification.",
            "Solving *-Problems Modulo Distributivity by a Reduction to AC1-Unification.",
            "An Algorithm for Constructing Gröbner and Free Schreier Bases in Free Group Algebras.",
            "An Algorithm to Compute the Invariant Ring of a G_a-Action on an Affine Variety.",
            "The Word Problem for Free Partially Commutative, Partially Associative Groupoids.",
            "On the Resolution of Index Form Equations in Quartic Number Fields.",
            "A Zero Structure Theorem for Differential Parametric Systems.",
            "Combining Unification Algorithms."
        ]
    },
    {
        "name": "JSC",
        "year": "1992",
        "info": "1992: Volumes\n13, 14",
        "count": 68,
        "papers": [
            "A Canonical Form for Generalized Linear Constraints.",
            "An Extended Polynomial GCD Algorithm Using Hankel Matrices.",
            "A Note on \"Zippel Denesting\".",
            "A Heuristic Irreducibility Test for Univariate Polynomials.",
            "Slope Retention Techniques for Solving Boundary-Value Problems in Differential Equations.",
            "Some Experiments with a Completion Theorem Prover.",
            "Application of Ordered Standard Bases to Catastrophe Theory.",
            "Solving Zero-Dimensional Algebraic Systems.",
            "A Gröbner Basis Technique for Inverting Mulitvariable Hensel Codes.",
            "The Complexity of Deciding Consistency of Systems of Polynomial in Exponent Inequalities.",
            "Discriminator Varieties and Symbolic Computation.",
            "The Inverse of an Automorphism in Polynomial Time.",
            "The Volume Common to Two Congruent Cylinders.",
            "A Note on Upper Bounds for Ideal-Theoretic Problems.",
            "Resolution Framework for Finitely-Valued First-Order Logics.",
            "On the Computational Complexity and Geometry of the First-Order Theory of the Reals, Part I: Introduction. Preliminaries. The Geometry of Semi-Algebraic Sets. The Decision Problem for the Existential Theory of the Reals.",
            "On the Computational Complexity and Geometry of the First-Order Theory of the Reals, Part II: The General Decision Problem. Preliminaries for Quantifier Elimination.",
            "On the Computational Complexity and Geometry of the First-Order Theory of the Reals, Part III: Quantifier Elimination.",
            "An Algorithm for Solving Parametric Linear Systems.",
            "Three New Algorithms for Multivariate Polynomial GCD.",
            "On Solutions of Linear Ordinary Differential Equations in their Coefficient Field.",
            "On Subsumption and Semiunifaction in Feature Algebras.",
            "Products of Polynomials and a Priori Estimates for Coefficients in Polynomial Decompositions: A Sharp Result.",
            "Some Comments on Gröbner Bases over Commutative Rings.",
            "Implicit Representation of Rational Parametric Surfaces.",
            "Symbolic Computation of Derivations Using Labeled Trees.",
            "Integration of a Class of Transcendental Liouvillian Functions with Error-Functions, Part I.",
            "A Review of Mathematica.",
            "Power Series in Computer Algebra.",
            "On the Product of the Largest Roots of a Polynomial.",
            "A Method for Simultanous Search for Refutations and Models by Equational Constraint Solving.",
            "On the Derivation and Reduction of C1 Trigonometric Basis Functions Using MapleTM.",
            "On Graphical Quintuple Systems.",
            "REDUCE-Procedures for the Study of Adjoint Symmetries of Second-Order Differential Equations.",
            "Comprehensive Gröbner Bases.",
            "Computation of Hilbert Functions.",
            "AC-Unification Race: The System Solving Approach, Implementation and Benchmarks.",
            "Constructing Type Systems over an Operational Semantics.",
            "ELISE, an Algorithm to Compute Asymptotic Representations for Solutions of Linear Differential Equations, Realized with the Computer Algebra System MAPLE.",
            "The Blockhandler and the Bitfield Package.",
            "Isogroups of Differential Equations Using Algebraic Computing.",
            "Special Issue: Symbolic Computation in Combinatorics - Foreword of the Guest Editors.",
            "Symbolic Manipulation for the Study of the Descent Algebra of Finite Coxeter Groups.",
            "A Proof for the Two Parameter Q-Cases of the Macdonald-Morris Constant Term Root System Conjecture for S(F4) and S(F4) via Zeilberger's Method.",
            "Super Ballot Numbers.",
            "SYMMETRICA, an Object Oriented Computer-Algebra System for the Symmetric Group.",
            "Schubert Polynomials and Skew Schur Functions.",
            "Counting Asymmetric Enriched Trees.",
            "Hypergeometric Solutions of Linear Recurrences with Polynomial Coefficents.",
            "An Approach to the Zero Recognition Problem by Buchberger Algorithm.",
            "An Optimality Result for Clause Form Translation.",
            "An Improved General E-Unification Method.",
            "Unification Under a Mixed Prefix.",
            "Some Properties of Finite Special String-Rewriting Systems.",
            "A Field Guide to Equational Logic.",
            "Solutions of Systems of Algebraic Equations and Linear Maps on Residue Class Rings.",
            "Well Rewrite Orderings and Well Quasi-Orderings.",
            "A New Method for Undecidablity Proofs of First Order Theories.",
            "Implicitization of Rational Parametric Equations.",
            "On Lucky Ideals for Gröbner Basis Computations.",
            "Gröbner Bases and Primary Decomposition of Modules.",
            "Solving a Congruence on a Graded Algebra by a Subresultant Sequence and its Application.",
            "Automatic Generation of Mapping Functions for Infinite Elements Using REDUCE.",
            "AC Unification Through Order-Sorted AC1 Unification.",
            "On the Choice of Pencils in the Parametrization of Curves.",
            "A General Refutational Completeness Result for an Inference Procedure Based on Associative-Commutative Unification.",
            "Computing the Topology of a Bounded Non-Algebraic Curve in the Plane.",
            "The Set Player System for Symbolic Computation on Power Sets."
        ]
    },
    {
        "name": "JSC",
        "year": "1991",
        "info": "1991: Volumes\n11, 12",
        "count": 64,
        "papers": [
            "Using Forcing to Prove Completeness of Resolution and Paramodulation.",
            "Theorem-Proving with Resolution and Superposition.",
            "A Completion Procedure for Conditional Equations.",
            "Automating Inductionless Induction Using Test Sets.",
            "On Word Problems in Horn Theories.",
            "On the Relation Between Resolution Based and Completion Based Theorem Proving.",
            "Term Rewriting: Some Experimental Results.",
            "Multi-Valued Logic and Gröbner Bases with Applications to Modal Logic.",
            "The Method of Creative Telescoping.",
            "Elimination of Composite Superpositions May Cause Abortion.",
            "Rational Geometry in Space.",
            "A Method for Symbolic Evaluation of Indefinite Integrals Containing Special Functions or their Products.",
            "Liouvillian Solutions of Linear Differential Equations with Liouvillian Coefficients.",
            "Modelling Waves with Computer Algebra.",
            "Uses Made of Computer Algebra in Physics.",
            "Parallel Multiplication and Powering of Polynomials.",
            "Comparison of Priority Rules in Pattern Matching and Term Rewriting.",
            "A Rewrite-Based Type Discipline for a Subset of Computer Algebra.",
            "Asymptotic Eigenfrequency Distributions for the N-Beam Euler-Bernoulli Coupled Beam Equation with Dissipative Joints.",
            "Multilinear Cayley Factorization.",
            "On the Synthetic Factorization of Projectively Invariant Polynomials.",
            "Invariant and Geometric Aspects of Algebraic Complexity Theory I.",
            "The Dotted Straightening Algorithm.",
            "Multivariate Polynomials, Standard Tableaux, and Representations of Symmetric Groups.",
            "Invariant-Theoretic Methods in Scene Analysis and Structural Mechanics.",
            "Invariant Computations for Analytic Projective Geometry.",
            "Some Examples of the Use of Distances as Coordinates for Euclidean Geometry.",
            "Computational Algebraic Geometry of Projective Configurations.",
            "A New Lower Bound Construction for Commutative Thue Systems with aApplications.",
            "Extraction of Redundancy-free Programs from Constructive Natural Deduction Proofs.",
            "Resolution via Homological Perturbation.",
            "Using MAPLE for the Analysis of Bifurcation Phenomena in Condensed-Phase Surface Combustion.",
            "Macsyma Computation of Local Minimal Realization of Dynamical Systems of which Generating Power Series are Finite.",
            "Wu's Method and the Khovanskii Finiteness Theorem.",
            "Normal Forms for a Class of Formulas.",
            "Sequentiality in Orthogonal Term Rewriting Systems.",
            "AUTOMATE, a Computing Package for Automata and Finite Semigroups.",
            "Symbolic Computation of Orientational Correlation Function Moments.",
            "Mechanical Manipulation for a Class of Differential Systems.",
            "When is an Extension of a Specification Consistent? Decidable and Undecidable Cases.",
            "A Methodology for Detecting Shared Variable Dependencies in Logic Programs.",
            "Partial Cylindrical Algebraic Decomposition for Quantifier Elimination.",
            "A Faster Way to Count the Solution of Inhomogeneous Systems of Algebraic Equations, with Applications to Cyclic n-Roots.",
            "Standard Bases for General Coefficient Rings and a New Constructive Proof of Hilbert's Basis Theorem.",
            "On the Polynomial Representation of Generalized Liouville Operators.",
            "Computer Algebra in Spacetime Embedding.",
            "The Use of Knuth-Bendix Methods to Solve the Word Problem in Automatic Groups.",
            "Double Coset Enumeration.",
            "Constructing Matrix Representations of Finitely Presented Groups.",
            "The Knuth-Bendix Procedure for Strings as a Substitute for Coset Enumeration.",
            "Computing Sylow Subgroups of Permutation Groups Using Homomorphic Images of Centralizers.",
            "Fast Recognition of Doubly Transitive Groups.",
            "A Strong Generating Test and Short Presentation for Permutation Groups.",
            "The Computation of Normalizers in Permutation Groups.",
            "Finding Composition Factors of Permutation Groups of Degree n < 10^6.",
            "Computing with Group Homomorphisms.",
            "Permutation Group Algorithms Based on Partitions, I: Theory and Algorithms.",
            "A New Notion of Reduction: General Universal Gröbner Basis for K[x, y].",
            "Symbolic Parametrization of Curves.",
            "Combining Matching Algorithms: The Regular Case.",
            "A Constructive Implementation of the Cartan-Kähler Theory of Exterior Differential Systems.",
            "An Application of Computer Algebra to a Problem in Stratified Fluid Flow.",
            "Group-Classified Polynomials of Phase Space in Higher-Order Aberration Expansions.",
            "Investigating a Hybrid Perturbation-Galerkin Technique Using Computer Algebra."
        ]
    },
    {
        "name": "JSC",
        "year": "1990",
        "info": "1990: Volumes\n9, 10",
        "count": 80,
        "papers": [
            "Non-Commutative Gröbner Bases in Algebras of Solvable Type.",
            "An Algorithm for the Construction of Matrix Representations for Finitely Presented Non-Commutative Algebras.",
            "Operation of Class Sums on Permutation Modules.",
            "The Trascendental Risch Differential Equation.",
            "Renormalisation Group, Function Iterations and Computer Algebra.",
            "The Analytic Approach to Recursion Relations.",
            "Computer-Aided Study of a Problem in Hermitian Matrix Theory.",
            "Integration of Rational Functions: Rational Computation of the Logarithmic Part.",
            "Integration of Elementary Functions.",
            "Inversion in Finite Fields Using Logarithmic Depth.",
            "An Incremental Method for Generating Prime Implicants/Impicates.",
            "Application of Symbolic Algebra to the Analysis of Plates on Variable Elastic Foundation.",
            "REDUCE and the Bifurcation of Limit Cycles.",
            "Special Issue Computational Algebraic Complexity Editorial.",
            "Factoring Polynomials Using Fewer Random Bits.",
            "Generalised Characteristic Polynomials.",
            "Matrix Multiplication via Arithmetic Progressions.",
            "Functional Decomposition of Polynomials: The Tame Case.",
            "Computing with Polynomials Given By Black Boxes for Their Evaluations: Greatest Common Divisors, Factorization, Separation of Numerators and Denominators.",
            "Shortest Division Chains in Imaginary Quadratic Number Fields.",
            "Computing the Structure of Finite Algebras.",
            "Interpolating Polynomials from Their Values.",
            "Singular Points of Algebraic Curves.",
            "Automated Proof of Ring Commutativity Problems by Algebraic Methods.",
            "Analysis of Euclidean Algorithms for Polynomials over Finite Fields.",
            "Minimum K-Partitioning of Rectilinear Polygons.",
            "Parallel Tree Pattern Matching.",
            "Solution of a Hydrodynamic Lubrication Problem with Maple.",
            "Symbolic Computation of the Flow of Granular Avalanches.",
            "Calculating Characters of p-Groups.",
            "Computing Modular and Projective Character Degrees of Soluble Groups.",
            "Some Problems in Computational Representation Theory.",
            "The Computer Construction of Matrix Representations of Finite Groups over Finite Fields.",
            "Computer Condensation of Modular Representations.",
            "Dixon's Character Table Algorithm Revisited.",
            "Computing with Endomorphism Rings of Modular Representations.",
            "Computing Intersections and Normalizers in Soluble Groups.",
            "A Nilpotent Quotient Algorithm for Graded Lie Rings.",
            "Collection from the Left and Other Strategies.",
            "The p-Group Generation Algorithm.",
            "Computing the Order of a Solvable Permutation Group.",
            "Implementing the Baumslag-Cannonito-Miller Polycyclic Quotient Algorithm.",
            "Collection from the Left.",
            "Testing Polynomials.",
            "Complexity of Factoring and Calculating the GCD of Linear Ordinary Differential Operators.",
            "Complexity of the Computation on Real Algebraic Numbers.",
            "On the Asymptotic Analysis of the Euclidean Algorithm.",
            "Formal Solutions of Differential Equations.",
            "NxN Puzzle and Related Relocation Problem.",
            "Power Series Remainder Sequences and Pade Fractions Over an Integral Domain.",
            "Standard Bases and Some Computations in Rings of Power Series.",
            "Processing Poisson Series in Parallel.",
            "Computer Classification of Integrable Coupled KdV-like Systems.",
            "Some Remarks On Numerical Iterations in a Symbolic Manipulation System.",
            "Non Convex Contour Reconstruction.",
            "A Fast Planar Partition Algorithm, I.",
            "An Algorithm for Generalized Point Location and its Applications.",
            "Locating a Robot with Angle Mathematics.",
            "On the Complexity of Some Geometric Problems in Unbounded Dimension.",
            "Tetrahedrizing Point Sets in Three Dimensions.",
            "Symbolic Treatment of Geometric Degeneration.",
            "On the Two-Dimensional Davenport Schinzel Problem.",
            "The Complexity of Almost Linear Diophantine Problems.",
            "A Theorem on Random Polynomials and Some Consequences in Average Complexity.",
            "The Complexity of Equivalence for Commutative Rings.",
            "Functional Decomposition of Polynomials: The Wild Case.",
            "On p-adic Computation of the Rational Form of a Matrix.",
            "The Concept of Gröbner Algebras.",
            "On the Determination of Green's Relations in Finite Tranformation Semigroups.",
            "Use of Computer Algebra to Locate Critical Loci in Fluid Mixtures.",
            "Application of Symbolic Computation in Robot Pose Error Modeling.",
            "Computer Algebra Applied to Radiation from Microstrip Discontinuities.",
            "Leopoldt's Conjecture for Imaginary Galois Number Fields.",
            "Constructing Normal Bases in Finite Fields.",
            "The Method of Differentiating under the Integral Sign.",
            "On the Worst Case of Three Algorithms for Computing the Jacobi Symbol.",
            "Growth Estimates for Exp-Log Functions.",
            "Computing a Sweeping-Plane in Regular (\"General\") Position: A Numerical and a Symbolic Solution.",
            "The 2- and 3 Modular Characters of J3, its Covering Group and Automorhism Group.",
            "Symbolic Computation with Fermions."
        ]
    },
    {
        "name": "JSC",
        "year": "1989",
        "info": "1989: Volumes\n7, 8",
        "count": 66,
        "papers": [
            "General Methods for Adding Range Restrictions to Decomposable Searching Problems.",
            "Visibility Problems for Polyhedral Terrains.",
            "GCDHEU: Heuristic Polynomial GCD Algorithm Based On Integer GCD Computation.",
            "Solving Algebraic Equations: Combining Buchberger's Algorithm with Multivariate Factorization.",
            "On the D-Bases of Polynomial Ideals Over Principal Ideal Domains.",
            "Solving Symbolic Equations with PRESS.",
            "Algebraic Programming of Geometrical Calculus and Clifford Algebra.",
            "Computation of the Cohomology of BSO_n<16> for 23 <= n <= 26 Using REDUCE.",
            "The Word Problem for Smullyan's Lark Combinator is Decidable.",
            "Parallel Reductions in lambda-Calculus.",
            "On the Transformation of Logic Programs with Instantiation Based Computation Rules.",
            "A Computer Oriented Algorithm for the Determination of the Dimension and Character of a Modular Irreducible SL(n, K)-Module.",
            "INGRID: A Graph Invariant Manipulator.",
            "An Example of Application of Symbolic Computation in Solid State Physics.",
            "Symbolic Evaluation of Integrals Occurring in Accelerator Orbit Theory.",
            "A MACSYMA Program for the Multiple Bifurcation Analysis of Double-Diffusive Concection.",
            "Application of NEWEUL in Robot Dynamics.",
            "Unification Theory.",
            "Boolean Unification - The Story So Far.",
            "Basic Narrowing Revisited.",
            "Enumarating Outer Narrowing Derivations for Constructor-Based Term Rewriting Systems.",
            "Inheritance Hierarchies: Semantics and Unification.",
            "Equational Problems and Disunification.",
            "On the Relationship of Congruence Closure and Unification.",
            "Polynomial Decomposition Algorithms.",
            "Cancellativity in Finitely Presented Semigroups.",
            "Backtrack Search with Isomorph Rejection and Consistency Check.",
            "A Deductive Database Based on Aristotelian Logic.",
            "Stratification and Knowledge Base Management.",
            "Using Reduce in Supersymmetry.",
            "The Kernel of the Kodaira-Spencer Map of the Versal µ-Constant Deformation of an Irreducible Plane Curve Singularity with C^r-Action.",
            "Deductive Synthesis of Sorting Programs.",
            "An Interactive Calculus Theorem-Prover for Continuity Properties.",
            "Inproved Bounds for Rectangular and Guillotine Partitions.",
            "Computer Algebra Application for Determining Lie and Lie-Bäcklund Symmetries of Differential Equations.",
            "On Equational Theories, Unification, and (Un)Decidability.",
            "Unification in a Combination of Arbitrary Disjoint Equational Theories.",
            "Higher-Order Unification Revisited: Complete Sets of Transformations.",
            "On the Logic of Unification.",
            "Efficient Solution of Linear Diophantine Equations.",
            "Adventures in Associative-Commutative Unification.",
            "Computing in Permutation and Matrix Groups III: Sylow Subgroups.",
            "A Strong Restriction of the Inductive Completion Procedure.",
            "Temporal Logic Programming.",
            "On the Harmonic and Monogenic Decomposition of Polynomials.",
            "Symbolic Computation of Hyperbolicity Regions for Systems of Two-Phase Flow Conservation Laws Using Maple.",
            "Constructing the Vertex-Transitive Graphs of Order 24.",
            "On Computing the Canonical Form for a Binary Form of Odd Degree.",
            "Using Unavoidable Set of Trees to Generalize Kruskal's Theorem.",
            "Order-Sorted Unification.",
            "Unification in Permutative Equational Theories is Undecidable.",
            "Computer-Aided Derivation of Spherical Harmonic Spectral Equations in Astrogeophysics.",
            "The Computation of Polynomial Greatest Common Divisors Over an Algebraic Number Field.",
            "Unification in Boolean Rings and Abelian Groups.",
            "Unification in Commutative Theories.",
            "Solving Word Equations.",
            "Matching - A Special Case of Unification?",
            "Differential Equations of Some Orthogonal Families in REDUCE.",
            "On Radical Zero-Dimensional Ideals.",
            "Computing Primitive Elements of Extension Fields.",
            "Symbolic Computation Application for the Design of Linear Multivariable Control Systems.",
            "CAL: A Theoretical Background of Constraint Logic Programming and its Applications.",
            "First Order Compiler: A Deterministic Logic Program Synthesis Algorithm.",
            "Codatatypes in ML.",
            "Meta-Circular Interpreter for a Strongly Typed Language.",
            "E-CCC: Between CCC and Topos, - its Expressive Power from the Viewpoint of Data Type Theory."
        ]
    },
    {
        "name": "JSC",
        "year": "1988",
        "info": "1988: Volumes\n5, 6",
        "count": 50,
        "papers": [
            "The Complexity of Linear Problems in Fields.",
            "Real Quantifier Elimination is Doubly Exponential.",
            "Solving Systems of Polynomial Inequalities in Subexponential Time.",
            "Complexity of Deciding Tarski Algebra.",
            "Some Aspects of Complexity in Real Algebraic Geometry.",
            "Thom's Lemma, the Coding of Real Algebraic Numbers and the Computation of the Topology of Semi-Algebraic Sets.",
            "Algebraic Decomposition of Regular Curves.",
            "An Improved Projection Operation for Cylindrical Algebraic Decomposition of Three-Dimensional Space.",
            "An Adjacency Algorithm for Cylindrical Algebraic Decompositions of Three-Dimensional Space.",
            "A Cluster-Based Cylindrical Algebraic Decomposition Algorithm.",
            "A Polynomial-Time Algorithm for the Topological Type of a Real Algebraic Curve.",
            "On Mechanical Quantifier Elimination for Elementary Algebra and Geometry.",
            "Quantifier Elimination: Optimal Solution for Two Classical Examples.",
            "A Bibliography of Quantifier Elimination for Real Closed Fields.",
            "A Proof of Holt's Algorithm.",
            "Constructing Normalisers in Finite Soluble Groups.",
            "Intersecting Subgroups of Finite Soluble Groups.",
            "Solving Systems of Algebraic Equations by a General Elimination Method.",
            "Finding a Minimal Set of Linear Recurring Relations Capable of Generating a Given Finite Two-Dimensional Array.",
            "Pseudo-Natural Algorithms for Finitely Generated Presentations of Monoids and Groups.",
            "The Programming System PRIZ.",
            "An Algebraic Treatment of Quantum Vibrations Using REDUCE.",
            "Solving the Heat Equation Symbolically with MuSimp.",
            "Critical Pair Criteria for Completion.",
            "Only Prime Superpositions Need be Considered in the Knuth-Bendix Completion Procedure.",
            "Computing a Gröbner Basis of a Polynomial Ideal over a Euclidean Domain.",
            "Tietze Transformations with Weighted Substring Search.",
            "Parallel Scheduling of Recursively Defined Arrays.",
            "The Automation of Syllogistic I. Syllogistic Normal Forms.",
            "The Word Problem for Free Partially Commutative Groups.",
            "An Algorithm for Determining the Simplicity of a Modular Group Representation.",
            "Minimum Number of Fundamental Invariants for the Binary Form of Degree.",
            "On a Particular Restricted Five-Body Problem An Analysis with Computer Algebra.",
            "Computer Algebra Applied to Itself.",
            "On the Complexity of Computing Syzygies.",
            "Gröbner Bases and Primary Decomposition of Polynomial Ideals.",
            "Lifting Canonical Algorithms from a Ring R to the Ring R[x].",
            "The Gröbner Fan of an Ideal.",
            "Standard Bases and Geometric Invariant Theory I. Initial Ideals and State Polytopes.",
            "Gröbner Bases and Hilbert Schemes. I.",
            "Computing Dimension and Independent Sets for Polynomial Ideals.",
            "Combinatorial Dimension Theory of Algebraic Varieties.",
            "Using Gröbner Bases to Determine Algebra Membership Split Surjective Algebra Homomorphisms Determine Birational Equivalence.",
            "On an Installation of Buchberger's Algorithm.",
            "A p-Adic Approach to the Computation of Gröbner Bases.",
            "Constructive Lifting in Graded Structures: A Unified View of Buchberger and Hensel Methods.",
            "On the Computation of Generalized Standard Bases.",
            "On the Construction of Gröbner Bases Using Syzygies.",
            "An Extension of Buchberger's Algorithm and Calculations in Enveloping Fields of Lie Algebras.",
            "On Recognisable Properties of Associative Algebras."
        ]
    },
    {
        "name": "JSC",
        "year": "1987",
        "info": "1987: Volumes\n3, 4",
        "count": 44,
        "papers": [
            "History and Basic Features of the Critical-Pair/Completion Procedure.",
            "Thue Systems as Rewriting Systems.",
            "Termination of Rewriting.",
            "Path of Subterms Ordering and Recursive Decomposition Ordering Revisited.",
            "Rewrite Method for Theorem Proving in First Order Theory with Equality.",
            "Unification in Combinations of Collapse-Free Regular Theories.",
            "Unification Problems with One-Sided Distributivity.",
            "Complexity of Matching Problems.",
            "An Algebraic Approach to Unification Under Associativity and Commutativity.",
            "Verifying Nilpotence.",
            "Recognising Polytopical Cell Complexes and Constructing Projection Polyhedra.",
            "Associative-Commutative Unification.",
            "On the Analytic Solution by Computer Algebra of Some Problems in the Vibration-Rotational Spectroscopy of Diatomic Molecules.",
            "A Steiner Tree Associated with Three Quarks.",
            "Using a Small Algebraic Manipulation System to Solve Differential and Integral Equations by Variational and Approximation Techniques.",
            "Solving the Problems of Kinetics of Complex Reactions by Symbolic Algebraic Manipulation Methods.",
            "Computing the Decomposition of Primes p and p-adic Absolute Values in Semi-simple Algebras over Q.",
            "On Principal Ideal Testing in Algebraic Number Fields.",
            "Computing the Measure of a Polynomial.",
            "Application of Symbolic Manipulation to the Hecke Transformations of Modular Forms in Two Variables, II.",
            "Computation of Class Numbers by an Analytic Method.",
            "What is the Rank of the Demjanenko Matrix?",
            "The Construction of Maximal Orders Over a Dedekind Domain.",
            "Deterministic Irreducibility Testing of Polynomials over Large Finite Fields.",
            "Polynomials for Primitive Nonsolvable Permutation Groups of Degree d ≤ 15.",
            "Polynome mit der Galoisgruppe M_11 über Q.",
            "Computation of Integral Bases in Certain S_n Extensions of Q.",
            "On the Resolution of Thue Inequalities.",
            "Towards a Soluble Quotient Algorithm.",
            "A Modification of the LLL Reduction Algorithm.",
            "Feasible Arithmetic Computations: Valiant's Hypothesis.",
            "Theory Links: Applications to Automated Theorem Proving.",
            "Embedding Boolean Expressions into Logic Programming.",
            "Mechanical Translation of Set Theoretic Problem Specifications into Efficient RAM Code-A Case Study.",
            "Fast Algorithms for Testing Unsatisfiability of Ground Horn Clauses with Equations.",
            "The Transitive Groups of Degree Twelve.",
            "Functional Programming with Combinators.",
            "Simplifying Conditional Term Rewriting Systems: Unification, Termination and Confluence.",
            "On the Algebraic and Differential Newton-Puiseux Polygons.",
            "A Generalization of Reduction Rings.",
            "GI/S: A Graphical User Interface For Symbolic Computation Systems.",
            "The Volume Common to Two Congruent Circular Cones whose Axes Intersect Symmetrically.",
            "Application of Symbolic Algebra to the Instability of a Nonconservative System.",
            "SIS - A Symbolic Information Management System."
        ]
    },
    {
        "name": "JSC",
        "year": "1986",
        "info": "1986: Volume\n2",
        "count": 27,
        "papers": [
            "An Algorithm for Solving Second Order Linear Homogeneous Differential Equations.",
            "On the Computation of Group Characters.",
            "Computing Character Degrees in p-Groups.",
            "Non-Standard Algorithmic and Dynamic Logic.",
            "Some Examples for Solving Systems of Algebraic Equations by Calculating Groebner Bases.",
            "Proving Geometric Algorithm Non-Solvability: An Application of Factoring Polynomials.",
            "Stability Analysis of an Optimally Controlled Light-Driven Engine.",
            "On the Descriptive Power of Term Rewriting Systems.",
            "Modelling the Combination of Functional and Logic Programming Languages.",
            "On the Theory of Graded Structures.",
            "Computing a Ham-Sandwich Cut in Two Dimensions.",
            "A Tutorial Introduction to Maple.",
            "Representations of Unusual Mathematical Structures in Scientific Applications of Symbolic Computation.",
            "Application of the MuMATH(R) Symbol Manipulation System to Chemically Significant Permutation Groups.",
            "Using MACSYMA to Write FORTRAN Subroutines.",
            "Computer Algebra: Past and Future.",
            "Elementary and Liouvillian Solutions of Linear Differential Equations.",
            "On the Number of Divisions of the Euclidean Algorithm Applied to Gaussian Integers.",
            "A Structure-Preserving Clause Form Translation.",
            "FINGER: A Symbolic System for Automatic Generation of Numerical Programs in Finite Element Analysis.",
            "On Unification: Equational Theories Are Not Bounded.",
            "Constructing Recursion Operators in Intuitionistic Type Theory.",
            "Fast Computation of Weight Multiplicities.",
            "A Catalogue of Complete Group Presentations.",
            "Constructing Universal Unfoldings Using Gröbner Bases.",
            "On the Application of Buchberger's Algorithm to Automated Geometry Theorem Proving.",
            "Using Gröbner Bases to Reason About Geometry Problems."
        ]
    },
    {
        "name": "JSC",
        "year": "1985",
        "info": "1985: Volume\n1",
        "count": 29,
        "papers": [
            "Equational Methods in First Order Predicate Calculus.",
            "Properties of Substitutions and Unifications.",
            "Optimal Solutions for a Class of Point Retrieval Problems.",
            "Fast Parallel Absolute Irreducibility Testing.",
            "MACSYMA from F to G.",
            "Computer Algebra Application for Classification of Integrable Non-Linear Evolution Equations.",
            "Explicit Evaluation of Certain Definite Integrals Involving Powers of Logarithms.",
            "A Bibliography on Parallel Inference Machines.",
            "Automatic Programming: A Tutorial on Formal Methodologies.",
            "Effective Computation with Group Homomorphisms.",
            "Polynomial Decomposition Algorithms.",
            "Decreasing the Nesting Depth of Expressions Involving Square Roots.",
            "Simplification of Expressions Involving Radicals.",
            "Solving Algebraic Problems with Reduce.",
            "An Algorithm for Determining Polynomial First Integrals of Autonomous Systems of Ordinary Differential Equations.",
            "Applications of a Factorisation Theorem for Ninth-Order Aberration Optics.",
            "An Application of Factoring.",
            "Automated Inferencing.",
            "Ideal Bases and Primary Decomposition: Case of Two Variables.",
            "Symbolic Iterative Algorithm for Generalised Inversion of Rational Polynomial Matrices.",
            "Integration in Finite Terms with Special Functions: the Error Function.",
            "Theory of Summation in Finite Terms.",
            "Using Symbolic Computation in Buckling Analysis.",
            "A Selected Bibliography on Constructive Mathematics, Intuitionistic Type Theory and Higher Order Deduction.",
            "Termination Orderings for Associative-Commutative Rewriting Systems.",
            "The Mechanical Computation of First and Second Cohomology Groups.",
            "A General Backtrack Algorithm for the Isomorphism Problem of Combinatorial Objects.",
            "Pseudo-Natural Algorithms for the Word Problem for Finitely Presented Monoids and Groups.",
            "MACSYMA Computation of the Dirac-Bergmann Algorithm for Hamiltonian Systems with Constraints."
        ]
    }
]