[
    {
        "year": "2021",
        "name": "36th LICS 2021",
        "info": "Rome, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/lics/2021",
                "sub_name": "36th Annual ACM/IEEE Symposium on Logic in Computer Science, LICS 2021, Rome, Italy, June 29 - July 2, 2021.",
                "count": 95,
                "papers": [
                    "Towards a more efficient approach for the satisfiability of two-variable logic.",
                    "Gödel-McKinsey-Tarski and Blok-Esakia for Heyting-Lewis Implication.",
                    "Demonic Lattices and Semilattices in Relational Semigroups with Ordinary Composition.",
                    "On Logics and Homomorphism Closure.",
                    "Universal Skolem Sets.",
                    "Evidenced Frames: A Unifying Framework Broadening Realizability Models.",
                    "Behavioural Preorders via Graded Monads.",
                    "The Undecidability of System F Typability and Type Checking for Reductionists.",
                    "Complexity Lower Bounds from Algorithm Design.",
                    "On the logical structure of choice and bar induction principles.",
                    "Compositional relational reasoning via operational game semantics.",
                    "Continuous One-Counter Automata.",
                    "In search of lost time: Axiomatising parallel composition in process algebras.",
                    "Initial Limit Datalog: a New Extensible Class of Decidable Constrained Horn Clauses.",
                    "Assuming Just Enough Fairness to make Session Types Complete for Lock-freedom.",
                    "Parameterized Complexity of Elimination Distance to First-Order Logic Properties.",
                    "Types Are Internal ∞-Groupoids.",
                    "On the Expressive Power of Homomorphism Counts.",
                    "Monomial size vs. Bit-complexity in Sums-of-Squares and Polynomial Calculus.",
                    "First-Order Reasoning and Efficient Semi-Algebraic Proofs.",
                    "Quantitative and Approximate Monitoring.",
                    "Global Optimisation with Constructive Reals.",
                    "Supermartingales, Ranking Functions and Probabilistic Lambda Calculus.",
                    "Compositional Semantics for Probabilistic Programs with Exact Conditioning.",
                    "Graphical Language with Delayed Trace: Picturing Quantum Computing with Finite Memory.",
                    "Efficient Local Computation of Differential Bisimulations via Coupling and Up-to Methods.",
                    "Minimal Taylor Algebras as a Common Framework for the Three Algebraic Approaches to the CSP.",
                    "On sequentiality and well-bracketing in the π-calculus.",
                    "The Topological Mu-Calculus: completeness and decidability.",
                    "Categories of Nets.",
                    "A Compositional Cost Model for the λ-calculus.",
                    "The Smash Product of Monoidal Theories.",
                    "Combinatorial Proofs and Decomposition Theorems for First-order Logic.",
                    "Asynchronous Extensions of HyperLTL.",
                    "Living without Beth and Craig: Definitions and Interpolants in the Guarded and Two-Variable Fragments.",
                    "Comonadic semantics for guarded fragments.",
                    "Stochastic Processes with Expected Stopping Time.",
                    "Responsibility and verification: Importance value in temporal logics.",
                    "Separating Rank Logic from Polynomial Time.",
                    "PTAS for Sparse General-Valued CSPs.",
                    "Positive First-order Logic on Words.",
                    "A Logic for Locally Complete Abstract Interpretations.",
                    "Lovász-Type Theorems and Game Comonads.",
                    "Commutative Monads for Probabilistic Programming Languages.",
                    "Higher Lenses.",
                    "Axiomatizations and Computability of Weighted Monadic Second-Order Logic.",
                    "Perspective Multi-Player Games.",
                    "Intersection Type Distributors.",
                    "A distributed operational view of Reversible Prime Event Structures.",
                    "Parikh's theorem for infinite alphabets.",
                    "Strong Call-by-Value is Reasonable, Implosively.",
                    "No-Rainbow Problem and the Surjective Constraint Satisfaction Problem.",
                    "A Relational Theory of Monadic Rewriting Systems, Part I.",
                    "Orbit-Finite-Dimensional Vector Spaces and Weighted Register Automata.",
                    "Smart Choices and the Selection Monad.",
                    "Some constructive variants of S4 with the finite model property.",
                    "A Complete Axiomatisation for Divergence Preserving Branching Congruence of Finite-State Behaviours.",
                    "A Constructive Logic with Classical Proofs and Refutations.",
                    "Session Logical Relations for Noninterference.",
                    "Expressivity of Quantitative Modal Logics : Categorical Foundations via Codensity and Approximation.",
                    "An Algebraic Characterisation of First-Order Logic with Neighbour.",
                    "Fixed-Points for Quantitative Equational Logics.",
                    "Categorical models of Linear Logic with fixed points of formulas.",
                    "Zero-one laws for provability logic: Axiomatizing validity in almost all models and almost all frames.",
                    "Internal ∞-Categorical Models of Dependent Type Theory : Towards 2LTT Eating HoTT.",
                    "Constraint Satisfaction Problems over Finite Structures.",
                    "A Quantum Interpretation of Bunched Logic & Quantum Separation Logic.",
                    "The Logic of Graph Neural Networks.",
                    "From Multisets over Distributions to Distributions over Multisets.",
                    "Lacon- and Shrub-Decompositions: A New Characterization of First-Order Transductions of Bounded Expansion Classes.",
                    "Canonical Polymorphisms of Ramsey Structures and the Unique Interpolation Property.",
                    "From Finite-Valued Nondeterministic Transducers to Deterministic Two-Tape Automata.",
                    "Alignment Completeness for Relational Hoare Logics.",
                    "Verifying higher-order concurrency with data automata.",
                    "On Generalized Metric Spaces for the Simply Typed Lambda-Calculus.",
                    "Fusible numbers and Peano Arithmetic.",
                    "Inapproximability of Unique Games in Fixed-Point Logic with Counting.",
                    "On Linear Time Decidability of Differential Privacy for Programs with Unbounded Inputs.",
                    "A Bunched Logic for Conditional Independence.",
                    "Abstraction in Data Integration.",
                    "Combining Nondeterminism, Probability, and Termination: Equational and Metric Reasoning.",
                    "The Laplace Mechanism has optimal utility for differential privacy over continuous queries.",
                    "Normalization for Cubical Type Theory.",
                    "The Space of Interaction.",
                    "Parametricity and Semi-Cubical Types.",
                    "Decidability and Complexity in Weakening and Contraction Hypersequent Substructural Logics.",
                    "Finite Model Theory of the Triguarded Fragment and Related Logics.",
                    "Removing Redundant Refusals: Minimal Complete Test Suites for Failure Trace Semantics.",
                    "SD-Regular Transducer Expressions for Aperiodic Transformations.",
                    "Symbolic Time and Space Tradeoffs for Probabilistic Verification.",
                    "A Normal Form Characterization for Efficient Boolean Skolem Function Synthesis.",
                    "Forbidden Induced Subgraphs and the Łoś-Tarski Theorem.",
                    "Universal Semantics for the Stochastic λ-Calculus.",
                    "Multi-Structural Games and Number of Quantifiers.",
                    "Asynchronous Template Games and the Gray Tensor Product of 2-Categories."
                ]
            }
        ]
    },
    {
        "year": "2020",
        "name": "35th LICS 2020",
        "info": "Saarbrücken, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/lics/2020",
                "sub_name": "LICS '20: 35th Annual ACM/IEEE Symposium on Logic in Computer Science, Saarbrücken, Germany, July 8-11, 2020.",
                "count": 73,
                "papers": [
                    "When Reachability Meets Grzegorczyk.",
                    "A tale of intersection types.",
                    "Automatic Structures: Twenty Years Later.",
                    "Contextual Types, Explained: Invited Tutorial.",
                    "Logic Beyond Formulas: A Proof System on Graphs.",
                    "A Higher Structure Identity Principle.",
                    "The Integers as a Higher Inductive Type.",
                    "Space-efficient Query Evaluation over Probabilistic Event Streams.",
                    "Algebraic models of simple type theories: A polynomial approach.",
                    "Approximating Values of Generalized-Reachability Stochastic Games.",
                    "Reconciling noninterference and gradual typing.",
                    "Complexity of controlled bad sequences over finite sets of Nd.",
                    "Deciding Differential Privacy for Programs with Finite Inputs and Outputs.",
                    "Universal equivalence and majority of probabilistic programs over finite fields.",
                    "Modal Logics with Composition on Finite Forests: Expressivity and Complexity.",
                    "A Hennessy-Milner Theorem for ATL with Imperfect Information.",
                    "Mixing Probabilistic and non-Probabilistic Objectives in Markov Decision Processes.",
                    "Hardness Characterisations and Size-Width Lower Bounds for QBF Resolution.",
                    "The Complexity of Reachability in Affine Vector Addition Systems with States.",
                    "Temporal Constraint Satisfaction Problems in Fixed-Point Logic.",
                    "First-order tree-to-tree functions.",
                    "Extensions of ω-Regular Languages.",
                    "A Cellular Howe Theorem.",
                    "On the Weisfeiler-Leman Dimension of Finite Groups.",
                    "A Fixed Point Theorem on Lexicographic Lattice Structures.",
                    "Re-pairing brackets.",
                    "The Benefit of Being Non-Lazy in Probabilistic λ-calculus: Applicative Bisimulation is Fully Abstract for Non-Lazy Probabilistic Call-by-Name.",
                    "An Approach to Regular Separability in Vector Addition Systems.",
                    "Modal Intuitionistic Logics as Dialgebraic Logics.",
                    "Cones as a model of intuitionistic linear logic.",
                    "Uniformisations of Regular Relations Over Bi-Infinite Words.",
                    "One-Clock Priced Timed Games are PSPACE-hard.",
                    "Lower Bounds for QBFs of Bounded Treewidth.",
                    "Coherence and normalisation-by-evaluation for bicategorical cartesian closed structure.",
                    "Linear Dependent Type Theory for Quantum Programming Languages: Extended Abstract.",
                    "Combining probabilistic and non-deterministic choice via weak distributive laws.",
                    "A Complete Proof System for 1-Free Regular Expressions Modulo Bisimilarity.",
                    "Successor-Invariant First-Order Logic on Classes of Bounded Degree.",
                    "Multimodal Dependent Type Theory.",
                    "Counting Bounded Tree Depth Homomorphisms.",
                    "Bisimulation Finiteness of Pushdown Systems Is Elementary.",
                    "A tier-based typed programming language characterizing Feasible Functionals.",
                    "Descriptive complexity of real computation and probabilistic independence logic.",
                    "A calculus of expandable stores: Continuation-and-environment-passing style translations.",
                    "Intermediate problems in modular circuits satisfiability.",
                    "The Surprising Power of Constant Depth Algebraic Proofs.",
                    "Interaction Laws of Monads and Comonads.",
                    "Consuming and Persistent Types for Classical Logic.",
                    "Refinement-Based Game Semantics for Certified Abstraction Layers.",
                    "Large and Infinitary Quotient Inductive-Inductive Types.",
                    "Coherence via Well-Foundedness: Taming Set-Quotients in Homotopy Type Theory.",
                    "Efficient Analysis of VASS Termination Complexity.",
                    "Good-for-games ω-Pushdown Automata.",
                    "Pebble Minimization of Polyregular Functions.",
                    "The Complexity of Dynamic Data Race Prediction.",
                    "Sparse Hashing for Scalable Approximate Model Counting: Theory and Practice.",
                    "Concurrent Separation Logic Meets Template Games.",
                    "The Hidden Subgroup Problem for Universal Algebras.",
                    "On the computational content of Zorn's lemma.",
                    "Russian Constructivism in a Prefascist Theory.",
                    "Extended Kripke lemma and decidability for hypersequent substructural logics.",
                    "Partial Univalence in n-truncated Type Theory.",
                    "Resolving finite indeterminacy: A definitive constructive universal prime ideal theorem.",
                    "An Efficient Normalisation Procedure for Linear Temporal Logic and Very Weak Alternating Automata.",
                    "Sequential Colimits in Homotopy Type Theory.",
                    "Making Streett Determinization Tight.",
                    "Register Automata with Extrema Constraints, and an Application to Two-Variable Logic.",
                    "On Computability of Logical Approaches to Branching-Time Property Verification of Programs.",
                    "Automata Learning: An Algebraic Approach.",
                    "A Constructive Model of Directed Univalence in Bicubical Sets.",
                    "Constructing Higher Inductive Types as Groupoid Quotients.",
                    "A characterisation of ordered abstract probabilities.",
                    "On The Relational Width of First-Order Expansions of Finitely Bounded Homogeneous Binary Cores with Bounded Strict Width."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "34th LICS 2019",
        "info": "Vancouver, BC, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/lics/2019",
                "sub_name": "34th Annual ACM/IEEE Symposium on Logic in Computer Science, LICS 2019, Vancouver, BC, Canada, June 24-27, 2019.",
                "count": 62,
                "papers": [
                    "Separation and covering for group based concatenation hierarchies.",
                    "Why Propositional Quantification Makes Modal Logics on Trees Robustly Hard?",
                    "Higher-Kinded Data Types: Syntax and Semantics.",
                    "Model Comparison Games for Horn Description Logics.",
                    "The Logic of Action Lattices is Undecidable.",
                    "Point-width and Max-CSPs.",
                    "Path Spaces of Higher Inductive Types in Homotopy Type Theory.",
                    "Perspective Games.",
                    "The Geometry of Bayesian Programming.",
                    "Categorical Semantics for Time Travel.",
                    "Backprop as Functor: A compositional perspective on supervised learning.",
                    "Descriptive complexity for minimal time of cellular automata.",
                    "A Sequent Calculus for Opetopes.",
                    "Approximate Span Liftings: Compositional Semantics for Relaxations of Differential Privacy.",
                    "Block products for algebras over countable words and applications to logic.",
                    "Differentiable Causal Computations via Delayed Trace.",
                    "Promises Make Finite (Constraint Satisfaction) Problems Infinitary.",
                    "Long-run Satisfaction of Path Properties.",
                    "The Theory of Traces for Systems with Nondeterminism and Probability.",
                    "Lambda Y-Calculus With Priorities.",
                    "Matching μ-Logic.",
                    "Completeness for Game Logic.",
                    "A comonadic view of simulation and quantum resources.",
                    "A short story of the CSP dichotomy conjecture.",
                    "On the Termination Problem for Probabilistic Higher-Order Recursive Programs.",
                    "The convex hull of finitely generable subsets and its predicate transformer.",
                    "On the Existential Theories of Büchi Arithmetic and Linear p-adic Fields.",
                    "Canonisation and Definability for Graphs of Bounded Rank Width.",
                    "A Type Theory for Defining Logics and Proofs.",
                    "Timed Systems through the Lens of Logic.",
                    "Describing free $\\omega$ -categories.",
                    "Codensity Games for Bisimilarity.",
                    "Walk refinement, walk logic, and the iteration number of the Weisfeiler-Leman algorithm.",
                    "Lambda Calculus and Probabilistic Computation.",
                    "Quantum channels as a categorical completion.",
                    "Graph Planning with Expected Finite Horizon.",
                    "No-Go Theorems for Distributive Laws.",
                    "A type theory for cartesian closed bicategories (Extended Abstract).",
                    "The Hierarchy of Hyperlogics.",
                    "Probabilistic Relational Reasoning via Metrics.",
                    "Type-Based Complexity Analysis of Probabilistic Functional Programs.",
                    "History-Dependent Nominal μ-Calculus.",
                    "Local normal forms and their use in algorithmic meta theorems (Invited Talk).",
                    "A Generic Normal Form for ZX-Diagrams and Application to the Rational Angle Completeness.",
                    "Algorithmic barriers to representing conditional independence.",
                    "A Near-Minimal Axiomatisation of ZX-Calculus for Pure Qubit Quantum Mechanics.",
                    "Quantum Hoare Logic with Ghost Variables.",
                    "HoCHC: A Refutationally Complete and Semantically Invariant System of Higher-order Logic Modulo Theories.",
                    "On the Power of Symmetric Linear Programs.",
                    "Reachability in Vector Addition Systems is Primitive-Recursive in Fixed Dimension.",
                    "A Probabilistic and Non-Deterministic Call-by-Push-Value Language.",
                    "Learning Concepts Definable in First-Order Logic with Counting.",
                    "When is Ontology-Mediated Querying Efficient?",
                    "Intuitionistic proofs without syntax.",
                    "Template games and differential linear logic.",
                    "Realizability in the Unitary Sphere.",
                    "Bisimulation Equivalence of First-Order Grammars is ACKERMANN-Complete.",
                    "Presburger arithmetic with stars, rational subsets of graph groups, and nested zero tests.",
                    "Graphical Affine Algebra.",
                    "Topology is relevant (in a dichotomy conjecture for infinite-domain constraint satisfaction problems).",
                    "MSO+∇ is undecidable.",
                    "High-level methods for homotopy construction in associative n-categories."
                ]
            },
            {
                "sub_name_abbr": "journals/corr/abs-1910-08712",
                "sub_name": "Proceedings of the Fourteenth Workshop on Logical Frameworks and Meta-Languages: Theory and Practice, LFMTP@LICS 2019, Vancouver, Canada, 22nd June 2019.",
                "count": 4,
                "papers": [
                    "A Definitional Implementation of the Lax Logical Framework LLFP in Coq, for Supporting Fast and Loose Reasoning.",
                    "GF + MMT = GLF - From Language to Semantics through LF.",
                    "Rapid Prototyping Formal Systems in MMT: 5 Case Studies.",
                    "A Weakly Initial Algebra for Higher-Order Abstract Syntax in Cedille."
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "33rd LICS 2018",
        "info": "Oxford, UK",
        "venues": [
            {
                "sub_name_abbr": "conf/lics/2018",
                "sub_name": "Proceedings of the 33rd Annual ACM/IEEE Symposium on Logic in Computer Science, LICS 2018, Oxford, UK, July 09-12, 2018.",
                "count": 95,
                "papers": [
                    "Black Ninjas in the Dark: Formal Analysis of Population Protocols.",
                    "Inner Models of Univalence.",
                    "Continuous Reasoning: Scaling the impact of formal methods.",
                    "Quasi-Open Bisimilarity with Mismatch is Intuitionistic.",
                    "Distribution-based objectives for Markov Decision Processes.",
                    "A Simple and Optimal Complementation Algorithm for Büchi Automata.",
                    "Syntax and Semantics of Quantitative Type Theory.",
                    "Definable Ellipsoid Method, Sums-of-Squares Proofs, and the Isomorphism Problem.",
                    "Impredicative Encodings of (Higher) Inductive Types.",
                    "Stochastic Shortest Paths and Weight-Bounded Properties in Markov Decision Processes.",
                    "Extensional and Intensional Semantic Universes: A Denotational Model of Dependent Types.",
                    "A universal-algebraic proof of the complexity dichotomy for Monotone Monadic SNP.",
                    "A Hybrid, Dynamic Logic for Hybrid-Dynamic Information Flow.",
                    "Regular and First-Order List Functions.",
                    "Definable decompositions for graphs of bounded linear cliquewidth.",
                    "On computability and tractability for infinite sets.",
                    "Automaton-Based Criteria for Membership in CTL.",
                    "Rewriting with Frobenius.",
                    "Sound up-to techniques and Complete abstract domains.",
                    "Efficient Algorithms for Asymptotic Bounds on Termination Time in VASS.",
                    "Concurrency and Probability: Removing Confusion, Compositionally.",
                    "Higher Groups in Homotopy Type Theory.",
                    "The concurrent game semantics of Probabilistic PCF.",
                    "Tree-depth, quantifier elimination, and quantifier rank.",
                    "A parameterized halting problem, the linear time hierarchy, and the MRDP theorem.",
                    "Computability Beyond Church-Turing via Choice Sequences.",
                    "On Higher Inductive Types in Cubical Type Theory.",
                    "Strong Sums in Focused Logic.",
                    "Probabilistic Stable Functions on Discrete Cones are Power Series.",
                    "Unary negation fragment with equivalence relations has the finite model property.",
                    "Logics for Word Transductions with Synthesis.",
                    "Work Analysis with Resource-Aware Session Types.",
                    "Regular Transducer Expressions for Regular Transformations.",
                    "A pseudo-quasi-polynomial algorithm for mean-payoff parity games.",
                    "Logical paradoxes in quantum computation.",
                    "Causal Computational Complexity of Distributed Processes.",
                    "Model-Theoretic Characterization of Boolean and Arithmetic Circuit Classes of Small Depth.",
                    "Eager Functions as Processes.",
                    "What's in a game?: A theory of game models.",
                    "One Theorem to Rule Them All: A Unified Translation of LTL into ω-Automata.",
                    "A Theory of Register Monitors.",
                    "Playing with Repetitions in Data Words Using Energy Games.",
                    "The State Complexity of Alternating Automata.",
                    "Rational Synthesis Under Imperfect Information.",
                    "Sequential Relational Decomposition.",
                    "ReLoC: A Mechanised Relational Logic for Fine-Grained Concurrency.",
                    "Quantitative Behavioural Reasoning for Higher-order Effectful Programs: Applicative Distances.",
                    "Classical realizability as a classifier for nondeterminism.",
                    "Compositional Game Theory.",
                    "A Generalized Modality for Recursion.",
                    "Can One Escape Red Chains?: Regular Path Queries Determinacy is Undecidable.",
                    "Two complete axiomatisations of pure-state qubit quantum computing.",
                    "Wreath Products of Distributive Forest Algebras.",
                    "Cellular Cohomology in Homotopy Type Theory.",
                    "Polynomial Invariants for Affine Programs.",
                    "Unification nets: canonical proof net quantifiers.",
                    "Satisfiability in multi-valued circuits.",
                    "A Complete Axiomatisation of the ZX-Calculus for Clifford+T Quantum Mechanics.",
                    "Diagrammatic Reasoning beyond Clifford+T Quantum Mechanics.",
                    "Type-two polynomial-time and restricted lookahead.",
                    "A Logical Account for Linear Partial Differential Equations.",
                    "Free Higher Groups in Homotopy Type Theory.",
                    "Conditional Value-at-Risk for Reachability and Mean Payoff in Markov Decision Processes.",
                    "Weighted model counting beyond two-variable logic.",
                    "Around Classical and Intuitionistic Linear Logics.",
                    "A modal μ perspective on solving parity games in quasi-polynomial time.",
                    "Probabilistic Böhm Trees and Probabilistic Separation.",
                    "Enriching a Linear/Non-linear Lambda Calculus: A Programming Language for String Diagrams.",
                    "Boolean-Valued Semantics for the Stochastic λ-Calculus.",
                    "An Algebraic Theory of Markov Processes.",
                    "Ribbon Tensorial Logic.",
                    "An Asynchronous Soundness Theorem for Concurrent Separation Logic.",
                    "Riesz Modal Logic with Threshold Operators.",
                    "A sequent calculus with dependent types for classical arithmetic.",
                    "An answer to the Gamma question.",
                    "Dialectica models of type theory.",
                    "The Geometry of Computation-Graph Abstraction.",
                    "A Fixpoint Logic and Dependent Effects for Temporal Property Verification.",
                    "MSO Queries on Trees: Enumerating Answers under Updates Using Forest Algebras.",
                    "Degrees of Relatedness: A Unified Framework for Parametricity, Irrelevance, Ad Hoc Polymorphism, Intersections, Unions and Algebra in Dependent Type Theory.",
                    "Parameterized circuit complexity of model-checking on sparse structures.",
                    "On the number of types in sparse graphs.",
                    "Syntax and Semantics for Operations with Scopes.",
                    "Differential Equation Axiomatization: The Impressive Power of Differential Ghosts.",
                    "Allegories: decidability and graph homomorphisms.",
                    "A functional interpretation with state.",
                    "LMSO: A Curry-Howard Approach to Church's Synthesis via Linear Logic.",
                    "Computable decision making on the reals and other spaces: via partiality and nondeterminism.",
                    "A General Framework for Relational Parametricity.",
                    "Guarded Computational Type Theory.",
                    "Species, Profunctors and Taylor Expansion Weighted by SMCC: A Unified Framework for Modelling Nondeterministic, Probabilistic and Quantum Programs.",
                    "Every λ-Term is Meaningful for the Infinitary Relational Model.",
                    "A van Benthem Theorem for Fuzzy Modal Logic.",
                    "A theory of linear typings as flows on 3-valent graphs.",
                    "Separability by piecewise testable languages and downward closures beyond subwords."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "32nd LICS 2017",
        "info": "Reykjavik, Iceland",
        "venues": [
            {
                "sub_name_abbr": "conf/lics/2017",
                "sub_name": "32nd Annual ACM/IEEE Symposium on Logic in Computer Science, LICS 2017, Reykjavik, Iceland, June 20-23, 2017.",
                "count": 94,
                "papers": [
                    "LICS 2017 foreword.",
                    "Logic and regular cost functions.",
                    "Symbolic execution and probabilistic reasoning.",
                    "Algorithms for some infinite-state MDPs and stochastic games.",
                    "Quantitative semantics of the lambda calculus: Some generalisations of the relational model.",
                    "Linear combinations of unordered data vectors.",
                    "An interpretation of system F through bar recursion.",
                    "On the extension of computable real functions.",
                    "Logics for continuous reachability in Petri nets and vector addition systems with states.",
                    "Foundation for a series of efficient simulation algorithms.",
                    "Separation for dot-depth two.",
                    "Foundational nonuniform (Co)datatypes for higher-order logic.",
                    "Common knowledge and multi-scale locality analysis in Cayley structures.",
                    "Herbrand property, finite quasi-Herbrand models, and a Chandra-Merlin theorem for quantified conjunctive queries.",
                    "Bar induction: The good, the bad, and the ugly.",
                    "Constructive completeness for the linear-time μ-calculus.",
                    "Gödel logic: From natural deduction to parallel computation.",
                    "Higher-order parity automata.",
                    "Large scale geometries of infinite strings.",
                    "Regular separability of one counter automata.",
                    "Learning first-order definable concepts over structures of small degree.",
                    "Descriptive complexity of linear equation systems and applications to propositional proof complexity.",
                    "Definability of summation problems for Abelian groups and semigroups.",
                    "Timed pushdown automata and branching vector addition systems.",
                    "Fibred fibration categories.",
                    "The logic of counting query answers.",
                    "Enumeration reducibility in closure spaces with applications to logic and algebra.",
                    "The limits of SDP relaxations for general-valued CSPs.",
                    "Cut-free completeness for modal mu-calculus.",
                    "Dual-context calculi for modal logic.",
                    "Computing quantiles in Markov chains with multi-dimensional costs.",
                    "Riesz Modal logic for Markov processes.",
                    "Succinct progress measures for solving parity games.",
                    "Generalised species of rigid resource terms.",
                    "A fine-grained hierarchy of hard problems in the separated fragment.",
                    "A categorical semantics for causal structure.",
                    "On delay and regret determinization of max-plus automata.",
                    "The clocks are ticking: No more delays!",
                    "Revisiting reachability in timed automata.",
                    "Uniform, integral and efficient proofs for the determinant identities.",
                    "Parity objectives in countable MDPs.",
                    "Polynomial automata: Zeroness and applications.",
                    "On the axiomatizability of quantitative algebras.",
                    "Infinitary intersection types as sequences: A new answer to Klop's problem.",
                    "Foundations of information integration under bag semantics.",
                    "Perfect half space games.",
                    "The homomorphism problem for regular graph patterns.",
                    "The Weisfeiler-Leman dimension of planar graphs is at most 3.",
                    "Definability of semidefinite programming and lasserre lower bounds for CSPs.",
                    "A monad for full ground reference cells.",
                    "Quotients in monadic programming: Projective algebras are equivalent to coalgebras.",
                    "Register automata with linear arithmetic.",
                    "The geometry of concurrent interaction: Handling multiple ports by way of multiple tokens.",
                    "An effectful way to eliminate addiction to dependence.",
                    "Equivalence of inductive definitions and cyclic proofs under arithmetic.",
                    "Model-checking for successor-invariant first-order formulas on graph classes of bounded expansion.",
                    "The complexity of minimal inference problem for conservative constraint languages.",
                    "Effectful applicative bisimilarity: Monads, relators, and Howe's method.",
                    "Fully abstract encodings of λ-calculus in HOcore through abstract machines.",
                    "The continuity of monadic stream functions.",
                    "A cartesian-closed category for higher-order model checking.",
                    "Understanding the complexity of #SAT using knowledge compilation.",
                    "The primitivity of operators in the algebra of binary relations under conjunctions of containments.",
                    "Capturing polynomial time using Modular Decomposition.",
                    "A type-theoretical definition of weak ω-categories.",
                    "Games with costs and delays.",
                    "Verification of randomized security protocols.",
                    "Typability in bounded dimension.",
                    "The equivalence of two dichotomy conjectures for infinite domain constraint satisfaction problems.",
                    "The pebbling comonad in Finite Model Theory.",
                    "Stack semantics of type theory.",
                    "MDPs with energy-parity objectives.",
                    "Partial derivatives on graphs for Kleene allegories.",
                    "First-order logic with counting.",
                    "On strong determinacy of countable stochastic games.",
                    "Domains and event structures for fusions.",
                    "Strategy logic with imperfect information.",
                    "A convenient category for higher-order probability theory.",
                    "Untwisting two-way transducers in elementary time.",
                    "Bounded time computation on metric spaces and Banach spaces.",
                    "Quantifiers on languages and codensity monads.",
                    "Decidability, complexity, and expressiveness of first-order logic over the subword ordering.",
                    "Lean and full congruence formats for recursion.",
                    "Differentiation in logical form.",
                    "Static analysis of deterministic negotiations.",
                    "On shift-invariant maximal filters and hormonal cellular automata.",
                    "The real projective spaces in homotopy type theory.",
                    "Data structures for quasistrict higher categories.",
                    "A crevice on the Crane Beach: Finite-degree predicates.",
                    "Constraint satisfaction problems over semilattice block Mal'tsev algebras.",
                    "Descriptive Complexity for counting complexity classes.",
                    "Categorical liveness checking by corecursive algebras.",
                    "Unrestricted stone duality for Markov processes.",
                    "A weakest pre-expectation semantics for mixed-sign expectations."
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "31st LICS 2016",
        "info": "Columbia University, New York City, NY, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/lics/2016",
                "sub_name": "Proceedings of the 31st Annual ACM/IEEE Symposium on Logic in Computer Science, LICS '16, New York, NY, USA, July 5-8, 2016.",
                "count": 89,
                "papers": [
                    "Unifying Logical and Statistical AI.",
                    "Duality in Computer Science.",
                    "Blockchains and the Logic of Accountability: Keynote Address.",
                    "The Probabilistic Model Checking Landscape.",
                    "Stochastic mechanics of graph rewriting.",
                    "On the Satisfiability of Some Simple Probabilistic Logics.",
                    "Distinguishing Hidden Markov Chains.",
                    "Quantitative Automata under Probabilistic Semantics.",
                    "Deciding First-Order Satisfiability when Universal and Existential Variables are Separated.",
                    "The Diagonal Problem for Higher-Order Recursion Schemes is Decidable.",
                    "Two-variable Logic with a Between Relation.",
                    "Decidability and Complexity for Quiescent Consistency.",
                    "From positive and intuitionistic bounded arithmetic to monotone proof complexity.",
                    "Gödel's functional interpretation and the concept of learning.",
                    "Understanding Gentzen and Frege Systems for QBF.",
                    "Unified Semantics and Proof System for Classical, Intuitionistic and Affine Logics.",
                    "Data Communicating Processes with Unreliable Channels.",
                    "A New Perspective on FO Model Checking of Dense Graph Classes.",
                    "Proving Liveness of Parameterized Programs.",
                    "Model and Objective Separation with Conditional Lower Bounds: Disjunction is Harder than Conjunction.",
                    "The complexity of regular abstractions of one-counter languages.",
                    "Two-Way Visibly Pushdown Automata and Transducers.",
                    "Automata on Infinite Trees with Equality and Disequality Constraints Between Siblings.",
                    "Plays as Resource Terms via Non-idempotent Intersection Types.",
                    "Perfect-Information Stochastic Games with Generalized Mean-Payoff Objectives.",
                    "Games with bound guess actions.",
                    "Near-Optimal Lower Bounds on Quantifier Depth and Weisfeiler-Leman Refinement Steps.",
                    "Hanf normal form for first-order logic with unary counting quantifiers.",
                    "Upper Bounds on the Quantifier Depth for Graph Differentiation in First Order Logic.",
                    "Querying Visible and Invisible Information.",
                    "Coinduction All the Way Up.",
                    "Denotational semantics of recursive types in synthetic guarded domain theory.",
                    "Type Theory based on Dependent Inductive and Coinductive Types.",
                    "Program Equivalence is Coinductive.",
                    "Fixed Points In Quantitative Semantics.",
                    "Ability to Count Messages Is Worth Θ(Δ) Rounds in Distributed Computing.",
                    "The Definitional Side of the Forcing.",
                    "Towards Completeness via Proof Search in the Linear Time μ-calculus: The case of Büchi inclusions.",
                    "First-order definability of rational transductions: An algebraic approach.",
                    "Order Invariance on Decomposable Structures.",
                    "Definability equals recognizability for graphs of bounded treewidth.",
                    "Monadic second order logic as the model companion of temporal logic.",
                    "Interaction Graphs: Full Linear Logic.",
                    "Conflict nets: Efficient locally canonical MALL proof nets.",
                    "Infinitary Lambda Calculi from a Linear Perspective.",
                    "First-order logic with reachability for infinite-state systems.",
                    "The Complexity of Coverability in ν-Petri Nets.",
                    "Reachability in Two-Dimensional Unary Vector Addition Systems with States is NL-Complete.",
                    "Comparing Chemical Reaction Networks: A Categorical and Algorithmic Perspective.",
                    "A categorical approach to open and interconnected dynamical systems.",
                    "Differential Refinement Logic.",
                    "On Recurrent Reachability for Continuous Linear Dynamical Systems.",
                    "Semantics for probabilistic programming: higher-order functions, continuous distributions, and soft constraints.",
                    "Interacting Frobenius Algebras are Hopf.",
                    "Semi-galois Categories I: The Classical Eilenberg Variety Theory.",
                    "A bifibrational reconstruction of Lawvere's presheaf hyperdoctrine.",
                    "A Mechanization of the Blakers-Massey Connectivity Theorem in Homotopy Type Theory.",
                    "Hybrid realizability for intuitionistic and classical choice.",
                    "Trace semantics for polymorphic references.",
                    "Constructions with Non-Recursive Higher Inductive Types.",
                    "A constructive function-theoretic approach to topological compactness.",
                    "The algebraic dichotomy conjecture for infinite domain Constraint Satisfaction Problems.",
                    "Reducts of finitely bounded homogeneous structures, and lifting tractability from finite-domain constraint satisfaction.",
                    "Weak consistency notions for all the CSPs of bounded width.",
                    "Graphs of relational structures: restricted types.",
                    "The Power of Arc Consistency for CSPs Defined by Partially-Ordered Forbidden Patterns.",
                    "Winning Cores in Parity Games.",
                    "Reasoning about Recursive Probabilistic Programs.",
                    "Healthiness from Duality.",
                    "Kolmogorov Extension, Martingale Convergence, and Compositionality of Processes.",
                    "Quantitative Algebraic Reasoning.",
                    "Rewriting modulo symmetric monoidal structure.",
                    "Effective Brenier Theorem: Applications to Computable Analysis and Algorithmic Randomness.",
                    "Quantifier Free Definability on Infinite Algebras.",
                    "Factor Varieties and Symbolic Computation.",
                    "Proving Differential Privacy via Probabilistic Couplings.",
                    "On Thin Air Reads Towards an Event Structures Model of Relaxed Memory.",
                    "Towards Compositional Feedback in Non-Deterministic and Non-Input-Receptive Systems.",
                    "Divide and Congruence II: Delay and Weak Bisimilarity.",
                    "How unprovable is Rabin's decidability theorem?",
                    "Solvability of Matrix-Exponential Equations.",
                    "Order-Invariance of Two-Variable Logic is Decidable.",
                    "A Step Up in Expressiveness of Decidable Fixpoint Logics.",
                    "Church Meets Cook and Levin.",
                    "Complexity Theory of (Functions on) Compact Metric Spaces.",
                    "Semantically Acyclic Conjunctive Queries under Functional Dependencies.",
                    "A Generalised Twinning Property for Minimisation of Cost Register Automata.",
                    "Invisible Pushdown Languages.",
                    "Minimization of Symbolic Tree Automata."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "30th LICS 2015",
        "info": "Kyoto, Japan",
        "venues": [
            {
                "sub_name_abbr": "conf/lics/2015",
                "sub_name": "30th Annual ACM/IEEE Symposium on Logic in Computer Science, LICS 2015, Kyoto, Japan, July 6-10, 2015.",
                "count": 66,
                "papers": [
                    "Higher-Order Model Checking: An Overview.",
                    "Privacy and the Price of Data.",
                    "From Categorical Logic to Facebook Engineering.",
                    "Names and Symmetry in Computer Science (Invited Tutorial).",
                    "Recent Developments in Quantitative Information Flow (Invited Tutorial).",
                    "Reachability in Two-Dimensional Vector Addition Systems with States Is PSPACE-Complete.",
                    "Long-Run Average Behaviour of Probabilistic Vector Addition Systems.",
                    "Demystifying Reachability in Vector Addition Systems.",
                    "Petri Automata for Kleene Allegories.",
                    "Complexity Bounds for Sum-Product Logic via Additive Proof Nets and Petri Nets.",
                    "A Cubical Approach to Synthetic Homotopy Theory.",
                    "Game Semantics for Type Soundness.",
                    "Programs for Cheap!",
                    "Polarised Intermediate Representation of Lambda Calculus with Sums.",
                    "On the Relative Usefulness of Fireballs.",
                    "Bisimilarity in Fresh-Register Automata.",
                    "Branching Bisimilarity of Normed BPA Processes Is in NEXPTIME.",
                    "Branching Bisimilarity on Normed BPA Is EXPTIME-Complete.",
                    "Distributed Graph Automata.",
                    "Separating Regular Languages with Two Quantifiers Alternations.",
                    "Star Height via Games.",
                    "Nondeterminism in Game Semantics via Sheaves.",
                    "The Parallel Intensionally Fully Abstract Games Model of PCF.",
                    "Unifying Two Views on Multiple Mean-Payoff Objectives in Markov Decision Processes.",
                    "Multidimensional beyond Worst-Case and Almost-Sure Problems for Mean-Payoff Objectives.",
                    "Improved Algorithms for One-Pair and k-Pair Streett Objectives.",
                    "The Hunt for a Red Spider: Conjunctive Query Determinacy Is Undecidable.",
                    "The Complexity of Boundedness for Guarded Logics.",
                    "Finite Open-World Query Answering with Number Restrictions.",
                    "Tree-like Queries in OWL 2 QL: Succinctness and Complexity Results.",
                    "Path Logics for Querying Graphs: Combining Expressiveness and Efficiency.",
                    "PDL Is the Bisimulation-Invariant Fragment of Weak Chain Logic.",
                    "Monadic Second-Order Logic and Bisimulation Invariance for Coalgebras.",
                    "Defining Winning Strategies in Fixed-Point Logic.",
                    "Interpolation with Decidable Fixpoint Logics.",
                    "A Complete Axiomatization of MSO on Infinite Trees.",
                    "A Fibrational Account of Local States.",
                    "Varieties of Languages in a Category.",
                    "Extensions of Domain Maps in Differential and Integral Calculus.",
                    "Descriptive Set Theory in the Category of Represented Spaces.",
                    "Domains of Commutative C-Subalgebras.",
                    "From Complexity to Algebra and Back: Digraph Classes, Collapsibility, and the PGP.",
                    "Locally Finite Constraint Satisfaction Problems.",
                    "Descriptive Complexity of List H-Coloring Problems in Logspace: A Refined Dichotomy.",
                    "One Context Unification Problems Solvable in Polynomial Time.",
                    "Extending ALCQIO with Trees.",
                    "Feedback Turing Computability, and Turing Computability as Feedback.",
                    "Regularity Preserving but Not Reflecting Encodings.",
                    "Hyper Natural Deduction.",
                    "Parallelism and Synchronization in an Infinitary Context.",
                    "A Diagrammatic Axiomatisation for Qubit Entanglement.",
                    "A Unifying Approach to the Gamma Question.",
                    "Abstract Hidden Markov Models: A Monadic Account of Quantitative Information Flow.",
                    "How Good Is a Strategy in a Game with Nature?",
                    "Entailment among Probabilistic Implications.",
                    "Metric Reasoning about λ-Terms: The Affine Case.",
                    "On the Complexity of Temporal Equilibrium Logic.",
                    "A Note on the Complexity of Classical and Intuitionistic Proofs.",
                    "On the Complexity of Linear Arithmetic with Divisibility.",
                    "Characterising Choiceless Polynomial Time with First-Order Interpretations.",
                    "Universal Covers, Color Refinement, and Two-Variable Counting Logic: Lower Bounds for the Depth.",
                    "A Canonical Form for Weighted Automata and Applications to Approximate Minimization.",
                    "Automata-Based Abstraction Refinement for µHORS Model Checking.",
                    "Nested Weighted Automata.",
                    "Timed Pushdown Automata Revisited.",
                    "The Target Discounted-Sum Problem."
                ]
            },
            {
                "sub_name_abbr": "conf/icalp/2015nlcs",
                "sub_name": "Third Workshop on Natural Language and Computer Science, NLCS@ICALP/LICS 2015, Kyoto, Japan, 2015.",
                "count": 6,
                "papers": [
                    "On Logical Relations and Conservativity.",
                    "Bidirectional Functional Semantics for Pregroup Grammars.",
                    "Applicative Abstract Categorial Grammar.",
                    "Lexical Semantics with Linear Types.",
                    "Computational Coverage of TLG: Nonlinearity.",
                    "Non-linear Second Order Abstract Categorial Grammars and Deletion."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "29th LICS-CSL 2014",
        "info": "Vienna, Austria",
        "venues": [
            {
                "sub_name_abbr": "conf/csl/2014",
                "sub_name": "Joint Meeting of the Twenty-Third EACSL Annual Conference on Computer Science Logic (CSL) and the Twenty-Ninth Annual ACM/IEEE Symposium on Logic in Computer Science (LICS), CSL-LICS '14, Vienna, Austria, July 14 - 18, 2014.",
                "count": 80,
                "papers": [
                    "Trade-off analysis meets probabilistic model checking.",
                    "Abstract interpretation: past, present and future.",
                    "Understanding biology through logic.",
                    "Computer-checked mathematics: a formal proof of the odd order theorem.",
                    "The Ackermann award 2014.",
                    "Citations for the test-of-time award from 1994.",
                    "Infinite-state energy games.",
                    "Beta reduction is invariant, indeed.",
                    "Regular combinators for string transformations.",
                    "Asymptotic behaviour in temporal logic.",
                    "Weight monitoring with linear temporal logic: complexity and decidability.",
                    "Graph logics with rational relations: the role of word combinatorics.",
                    "Effective interpolation and preservation in guarded logics.",
                    "On the discriminating power of passivation and higher-order interaction.",
                    "A domain-theoretic approach to Brownian motion and general continuous stochastic processes.",
                    "Two-way cost automata and cost logics over infinite trees.",
                    "Decomposition theorems and model-checking for the modal μ-calculus.",
                    "Logic for communicating automata with parameterized topology.",
                    "Logical characterization of weighted pebble walking automata.",
                    "Coinduction up-to in a fibrational setting.",
                    "Model checking existential logic on partially ordered sets.",
                    "Zero-reachability in probabilistic multi-counter automata.",
                    "The complexity of admissibility in Omega-regular games.",
                    "On the characterization of models of H.",
                    "A decision procedure for satisfiability in separation logic with inductive predicates.",
                    "Secure equilibria in weighted games.",
                    "Weak MSO: automata and expressiveness modulo bisimilarity.",
                    "Symmetry in concurrent games.",
                    "Decidability of weak logics with deterministic transitive closure.",
                    "Equality and fixpoints in the calculus of structures.",
                    "The tractability frontier of graph-like first-order query sets.",
                    "One hierarchy spawns another: graph deconstructions and the complexity classification of conjunctive queries.",
                    "On the total variation distance of labelled Markov chains.",
                    "System F with coercion constraints.",
                    "The geometry of synchronization.",
                    "On the pigeonhole and related principles in deep inference and monotone systems.",
                    "Expressive completeness of separation logic with two variables and no separating conjunction.",
                    "A new correctness criterion for MLL proof nets.",
                    "On periodically iterated morphisms.",
                    "Pattern logics and auxiliary relations.",
                    "Substitution, jumps, and algebraic effects.",
                    "Satisfiability modulo counting: a new approach for analyzing privacy properties.",
                    "Achieving new upper bounds for the hypergraph duality problem through logic.",
                    "KAT + B!",
                    "Symmetric normalisation for intuitionistic logic.",
                    "Equilibria of concurrent games on event structures.",
                    "Subclasses of presburger arithmetic and the weak EXP hierarchy.",
                    "Senescent ground tree rewrite systems.",
                    "Preservation and decomposition theorems for bounded degree structures.",
                    "No proof nets for MLL with units: proof equivalence in MLL is PSPACE-complete.",
                    "Abstract interpretation from Büchi automata.",
                    "Memoryful geometry of interaction: from coalgebraic components to algebraic effects.",
                    "Axioms and decidability for type isomorphism in the presence of sums.",
                    "Functional reactive types.",
                    "Probably safe or live.",
                    "A quest for algorithmically random infinite structures.",
                    "On the succinctness of query rewriting over shallow ontologies.",
                    "Turing machines with atoms, constraint satisfaction problems, and descriptive complexity.",
                    "Local temporal reasoning.",
                    "On Hanf-equivalence and the number of embeddings of small induced subgraphs.",
                    "Non-elementary complexities for branching VASS, MELL, and extensions.",
                    "Infinite sequential games with real-valued payoffs.",
                    "Hyper-Ackermannian bounds for pushdown vector addition systems.",
                    "Transition systems over games.",
                    "Compositional verification of termination-preserving refinement of concurrent programs.",
                    "Eilenberg-MacLane spaces in homotopy type theory.",
                    "MSO queries on trees: enumerating answers under updates.",
                    "On the computing power of +, -, and ×.",
                    "On the Hoare theory of monadic recursion schemes.",
                    "Formulae-as-types for an involutive negation.",
                    "A type theory for productive coprogramming via guarded recursion.",
                    "Deadlock and lock freedom in the linear π-calculus.",
                    "On context semantics and interaction nets.",
                    "Anchored LTL separation.",
                    "Separating regular languages with first-order logic.",
                    "Logics with counting and equivalence.",
                    "A functional functional interpretation.",
                    "Compositional higher-order model checking via ω-regular games over Böhm trees.",
                    "Finite-memory strategy synthesis for robust multidimensional mean-payoff objectives.",
                    "Faster decision of first-order graph properties."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "28th LICS 2013",
        "info": "New Orleans, LA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/lics/2013",
                "sub_name": "28th Annual ACM/IEEE Symposium on Logic in Computer Science, LICS 2013, New Orleans, LA, USA, June 25-28, 2013.",
                "count": 62,
                "papers": [
                    "LICS: Logic in Computer Security - Some Attacker's Models and Related Decision Problems.",
                    "From Qualitative to Quantitative Proofs of Security Properties Using First-Order Conditional Logic.",
                    "Duality in Logic and Computation.",
                    "Timed and Probabilistic I/O Automata.",
                    "Regular Functions and Cost Register Automata.",
                    "Presburger Vector Addition Systems.",
                    "Reasoning about Data Repetitions with Counter Systems.",
                    "On the Context-Freeness Problem for Vector Addition Systems.",
                    "Groupoids, Hypergraphs, and Symmetries in Finite Models.",
                    "An Optimal Gaifman Normal Form Construction for Structures of Bounded Degree.",
                    "Two-Variable Logic with Counting and Trees.",
                    "Measurable Spaces and Their Effect Logic.",
                    "Topological Structure of Quantum Algorithms.",
                    "On the Query Complexity of Real Functionals.",
                    "Quantitative Monadic Second-Order Logic.",
                    "Magnitude Monadic Logic over Words and the Use of Relative Internal Set Theory.",
                    "Quantitative Reasoning for Proving Lock-Freedom.",
                    "Model Checking for Successor-Invariant First-Order Logic on Minor-Closed Graph Classes.",
                    "Dynamic Logic of Propositional Assignments: A Well-Behaved Variant of PDL.",
                    "Model-Checking Parse Trees.",
                    "The Complexity of Model Checking Multi-stack Systems.",
                    "Maximum Matching and Linear Programming in Fixed-Point Logic with Counting.",
                    "Turing Machines with Atoms.",
                    "Adding an Equivalence Relation to the Interval Logic ABB: Complexity and Expressiveness.",
                    "Decidability of Weak Simulation on One-Counter Nets.",
                    "Intensional Type Theory with Guarded Recursive Types qua Fixed Points on Universes.",
                    "Calculating the Fundamental Group of the Circle in Homotopy Type Theory.",
                    "Type-Based Productivity of Stream Definitions in the Calculus of Constructions.",
                    "Fibred Data Types.",
                    "Arbitrary Action Model Logic and Action Model Synthesis.",
                    "On the Boundary of Behavioral Strategies.",
                    "A Relatively Complete Generic Hoare Logic for Order-Enriched Effects.",
                    "Unifying Classical and Intuitionistic Logics for Computational Control.",
                    "The Cost of Usage in the Lambda-Calculus.",
                    "Weighted Relational Models of Typed Lambda-Calculi.",
                    "Atomic Lambda Calculus: A Typed Lambda-Calculus with Explicit Sharing.",
                    "Stone Duality for Markov Processes.",
                    "Trading Performance for Stability in Markov Decision Processes.",
                    "Solving Partial-Information Stochastic Parity Games.",
                    "Expressive Completeness for Metric Temporal Logic.",
                    "One-Path Reachability Logic.",
                    "Substructure Temporal Logic.",
                    "Name-Passing Calculi: From Fusions to Preorders and Types.",
                    "A Compositional Semantics for the Reversible p-Calculus.",
                    "Pumping by Typing.",
                    "From Frame Properties to Hypersequent Rules in Modal Logics.",
                    "The Logic of Exact Covers: Completeness and Uniform Interpolation.",
                    "Compressing Polarized Boxes.",
                    "Kripke Semantics for Modal Bilattice Logic.",
                    "Forcing MSO on Infinite Words in Weak MSO.",
                    "From Monadic Second-Order Definable String Transformations to Transducers.",
                    "From Two-Way to One-Way Finite State Transducers.",
                    "A Characterization Theorem for the Alternation-Free Fragment of the Modal µ-Calculus.",
                    "Bisimilarity of Pushdown Automata is Nonelementary.",
                    "Rabin-Mostowski Index Problem: A Step beyond Deterministic Automata.",
                    "Regular Real Analysis.",
                    "Instances of Computational Effects: An Algebraic Perspective.",
                    "Multiversal Polymorphic Algebraic Theories: Syntax, Semantics, Translations, and Equational Logic.",
                    "A Categorical Treatment of Ornaments.",
                    "Converging to the Chase - A Tool for Finite Controllability.",
                    "Why is it Hard to Obtain a Dichotomy for Consistent Query Answering?",
                    "Abstract Machines for Game Semantics, Revisited."
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "27th LICS 2012",
        "info": "Dubrovnik, Croatia",
        "venues": [
            {
                "sub_name_abbr": "conf/lics/2012",
                "sub_name": "Proceedings of the 27th Annual IEEE Symposium on Logic in Computer Science, LICS 2012, Dubrovnik, Croatia, June 25-28, 2012.",
                "count": 66,
                "papers": [
                    "Backward induction in games of perfect information.",
                    "On Building Constructive Formal Theories of Computation Noting the Roles of Turing, Church, and Brouwer.",
                    "Privacy, Anonymity, and Accountability in Ad-Supported Services.",
                    "Turing's Password: What Internet Cannot Leak.",
                    "Term Rewriting and Lambda Calculus.",
                    "Logics of Dynamical Systems.",
                    "Lower Bounds for Existential Pebble Games and k-Consistency Tests.",
                    "Dense-Timed Pushdown Automata.",
                    "Coproducts of Monads on Set.",
                    "Approximate Verification of the Symbolic Dynamics of Markov Chains.",
                    "Regular Transformations of Infinite Strings.",
                    "The Semantics of Parsing with Semantic Actions.",
                    "Modular Construction of Cut-free Sequent Calculi for Paraconsistent Logics.",
                    "Inductive Types in Homotopy Type Theory.",
                    "Combining Deduction Modulo and Logics of Fixed-Point Definitions.",
                    "Graph Logics with Rational Relations and the Generalized Intersection Problem.",
                    "Near Unanimity Constraints Have Bounded Pathwidth Duality.",
                    "A Computational Interpretation of Parametricity.",
                    "Von Neumann's Biased Coin Revisited.",
                    "On the Magnitude of Completeness Thresholds in Bounded Model Checking.",
                    "Collapsible Pushdown Automata and Labeled Recursion Schemes: Equivalence, Safety and Effective Selection.",
                    "Partial-Observation Stochastic Games: How to Win When Belief Fails.",
                    "Decidable Problems for Probabilistic Automata on Infinite Words.",
                    "Mean-Payoff Pushdown Games.",
                    "Decomposing Quantified Conjunctive (or Disjunctive) Formulas.",
                    "An Algebraic Preservation Theorem for Aleph-Zero Categorical Quantified Constraint Satisfaction.",
                    "On the Ordered Conjecture.",
                    "The Winning Ways of Concurrent Games.",
                    "Strong Complementarity and Non-locality in Categorical Quantum Mechanics.",
                    "The HOM Problem is EXPTIME-Complete.",
                    "Where First-Order and Monadic Second-Order Logic Coincide.",
                    "First-Order and Monadic Second-Order Model-Checking on Ordered Structures.",
                    "A Perfect Model for Bounded Verification.",
                    "Deciding the Value 1 Problem for Probabilistic Leaktight Automata.",
                    "Delta-Decidability over the Reals.",
                    "Countermodels from Sequent Calculi in Multi-Modal Logics.",
                    "The Complexity of Decomposing Modal and First-Order Theories.",
                    "Automatic Sequences and Zip-Specifications.",
                    "Functionals Using Bounded Information and the Dynamics of Algorithms.",
                    "The Ordinal-Recursive Complexity of Timed-arc Petri Nets, Data Nets, and Other Enriched Nets.",
                    "A Constructive Proof of Dependent Choice, Compatible with Classical Logic.",
                    "Better Abstractions for Timed Automata.",
                    "Step Indexed Realizability Semantics for a Call-by-Value Language Based on Basic Combinatorial Objects.",
                    "Extending Type Theory with Forcing.",
                    "The Complexity of Verbal Languages over Groups.",
                    "Decidability of DPDA Language Equivalence via First-Order Grammars.",
                    "Capsules and Separation.",
                    "Two-Variable First-Order Logic with Equivalence Closure.",
                    "Learning Probabilistic Systems from Tree Samples.",
                    "Non-definability of Languages by Generalized First-order Formulas over (N, +).",
                    "A Kantorovich-Monadic Powerdomain for Information Hiding, with Probability and Nondeterminism.",
                    "An Infinitary Affine Lambda-Calculus Isomorphic to the Full Lambda-Calculus.",
                    "Game Semantics in String Diagrams.",
                    "Decidable Elementary Modal Logics.",
                    "Short Propositional Refutations for Dense Random 3CNF Formulas.",
                    "On the Complexity of Linear Authorization Logics.",
                    "On the Significance of the Collapse Operation.",
                    "A Higher-Order Distributed Calculus with Name Creation.",
                    "The Complete Proof Theory of Hybrid Systems.",
                    "Interpretations in Trees with Countably Many Branches.",
                    "Conservative Concurrency in Haskell.",
                    "Constructing Fully Complete Models for Multiplicative Linear Logic.",
                    "Induction in Algebra: A First Case Study.",
                    "An Automata Model for Trees with Ordered Data Values.",
                    "Foundational, Compositional (Co)datatypes for Higher-Order Logic: Category Theory Applied to Theorem Proving.",
                    "Higher Semantics of Quantum Protocols."
                ]
            },
            {
                "sub_name_abbr": "journals/corr/Graham-LengrandP13",
                "sub_name": "Proceedings Sixth Workshop on Intersection Types and Related Systems, ITRS 2012, Dubrovnik, Croatia, 29th June 2012.",
                "count": 6,
                "papers": [
                    "Characterisation of Strongly Normalising lambda-mu-Terms.",
                    "Using Inhabitation in Bounded Combinatory Logic with Intersection Types for Composition Synthesis.",
                    "Annotations for Intersection Typechecking.",
                    "Bounding normalization time through intersection types.",
                    "Toward Isomorphism of Intersection and Union types.",
                    "Reconciling positional and nominal binding."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "26th LICS 2011",
        "info": "Toronto, Ontario, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/lics/2011",
                "sub_name": "Proceedings of the 26th Annual IEEE Symposium on Logic in Computer Science, LICS 2011, June 21-24, 2011, Toronto, Ontario, Canada.",
                "count": 43,
                "papers": [
                    "A Why-on-Earth Tutorial on Finite Model Theory.",
                    "The Meaning of Semantics.",
                    "Logic in Software, Dynamical and Biological Systems.",
                    "Qualitative Tree Languages.",
                    "Languages of Dot-Depth One over Infinite Words.",
                    "Two Views on Multiple Mean-Payoff Objectives in Markov Decision Processes.",
                    "Temporal Specifications with Accumulative Values.",
                    "First Steps in Synthetic Guarded Domain Theory: Step-Indexing in the Topos of Trees.",
                    "Imperative Programs as Proofs via Game Semantics.",
                    "Game Semantics for Good General References.",
                    "The Computational Meaning of Probabilistic Coherence Spaces.",
                    "Continuous Random Variables.",
                    "Noncomputable Conditional Distributions.",
                    "Propositional Proof Complexity: A Survey on the State of the Art, Including Some Recent Results.",
                    "A Type System for Complexity Flow Analysis.",
                    "Linear Dependent Types and Relative Completeness.",
                    "CoQMTU: A Higher-Order Type Theory with a Predicative Hierarchy of Universes Parametrized by a Decidable First-Order Theory.",
                    "Isomorphisms of Types in the Presence of Higher-Order References.",
                    "Listings and Logics.",
                    "Computational Complexity of Quantum Satisfiability.",
                    "Formalizing Randomized Matching Algorithms.",
                    "Forcing as a Program Transformation.",
                    "Proof Nets for Additive Linear Logic with Units.",
                    "Higher-Order Model Checking: From Theory to Practice.",
                    "Powermonads and Tensors of Unranked Effects.",
                    "Semantics of Higher-Order Quantum Computation via Geometry of Interaction.",
                    "Separation Logic in the Presence of Garbage Collection.",
                    "Ultrametric Semantics of Reactive Programs.",
                    "Ackermannian and Primitive-Recursive Bounds with Dickson's Lemma.",
                    "The Complexity of Verifying Ground Tree Rewrite Systems.",
                    "Complexity of Two-Variable Dependence Logic and IF-Logic.",
                    "The Dichotomy for Conservative Constraint Satisfaction Problems Revisited.",
                    "A Tetrachotomy for Positive First-Order Logic without Equality.",
                    "Decidability of Definability.",
                    "The Complexity of Evaluating First-Order Sentences over a Fixed Structure.",
                    "Regular Repair of Specifications.",
                    "Rigorous Approximated Determinization of Weighted Automata.",
                    "Automata with Group Actions.",
                    "A Decidable Two-Way Logic on Data Words.",
                    "The Ultimate Undecidability Result for the Halpern-Shoham Logic.",
                    "What's Decidable about Halpern and Shoham's Interval Logic? The Maximal Fragment ABBL.",
                    "Computing Optimal Coverability Costs in Priced Timed Petri Nets.",
                    "Concurrent Strategies."
                ]
            }
        ]
    },
    {
        "year": "2010",
        "name": "25th LICS 2010",
        "info": "Edinburgh, Scotland, United Kingdom",
        "venues": [
            {
                "sub_name_abbr": "conf/lics/2010",
                "sub_name": "Proceedings of the 25th Annual IEEE Symposium on Logic in Computer Science, LICS 2010, 11-14 July 2010, Edinburgh, United Kingdom.",
                "count": 46,
                "papers": [
                    "Querying the Guarded Fragment.",
                    "Highly Acyclic Groups, Hypergraph Covers and the Guarded Fragment.",
                    "Equality Is Typable in Semi-full Pure Type Systems.",
                    "Strong Normalization for System F by HOAS on Top of FOAS.",
                    "Game Semantics for a Polymorphic Programming Language.",
                    "An Intuitionistic Logic that Proves Markov's Principle.",
                    "Amir Pnueli: A Gentle Giant, Lord of the Phi's and the Psi's.",
                    "Robin Milner, a Craftsman of Tools for the Mind.",
                    "Alternating Timed Automata over Bounded Time.",
                    "Regular Cost Functions over Finite Trees.",
                    "Parikh Images of Grammars: Complexity and Applications.",
                    "On the Scope of the Universal-Algebraic Approach to Constraint Satisfaction.",
                    "New Conditions for Taylor Varieties and CSP.",
                    "The Fine Print of Security.",
                    "Modular Construction of Fixed Point Combinators and Clocked Bohm Trees.",
                    "Recursion Schemes and Logical Reflection.",
                    "Undecidability of Propositional Separation Logic and Its Neighbours.",
                    "The Undecidability of Boolean BI through Phase Semantics.",
                    "Segal Condition Meets Computational Effects.",
                    "The Isomorphism Problem on Classes of Automatic Structures.",
                    "On the Strictness of the First-Order Quantifier Structure Hierarchy over Finite Structures.",
                    "Fixed-Point Definability and Polynomial Time on Graphs with Excluded Minors.",
                    "Lower Bounds for the Complexity of Monadic Second-Order Logic.",
                    "Capturing Polynomial Time on Interval Graphs.",
                    "A Generic Operational Metatheory for Algebraic Effects.",
                    "Polarity and the Logic of Delimited Continuations.",
                    "Datalog+/-: A Family of Logical Knowledge Representation and Query Languages for New Applications.",
                    "An Extension of Data Automata that Captures XPath.",
                    "Deciding Definability in FO2(<) (or XPath) on Trees.",
                    "The Emptiness Problem for Tree Automata with Global Constraints.",
                    "Addition-Invariant FO and Regularity.",
                    "Theorem Proving for Verification: The Early Days.",
                    "Breaking Paths in Atomic Flows for Classical Logic.",
                    "Infinitary Completeness in Ludics.",
                    "On Strong Maximality of Paraconsistent Finite-Valued Logics.",
                    "Probabilistic Information Flow.",
                    "Weak Equivalences in Psi-Calculi.",
                    "A Calculus of Contracting Processes.",
                    "On Probabilistic Automata in Continuous Time.",
                    "omega-QRB-Domains and the Probabilistic Powerdomain.",
                    "Abstracting the Differential Semantics of Rule-Based Models: Exact and Automated Model Reduction.",
                    "The Expressive Power of Synchronizations.",
                    "On the Expressivity of Symmetry in Event Structures.",
                    "A Finiteness Structure on Resource Terms.",
                    "Coalgebras, Chu Spaces, and Representations of Physical Systems.",
                    "A Sound and Complete Calculus for Finite Stream Circuits."
                ]
            },
            {
                "sub_name_abbr": "conf/lics/2010pspl",
                "sub_name": "International Workshop on Proof Systems for Program Logics, PSPL 2010, Edinburgh, Scotland, UK, July 10, 2010.",
                "count": 6,
                "papers": [
                    "A simple proof system for lock-free concurrency.",
                    "A Developer-oriented Hoare Logic.",
                    "A Proof System for Reasoning about Probabilistic Concurrent Processes.",
                    "Towards a Cut-free Sequent Calculus for Boolean BI.",
                    "A Multi-Modal Dependent Type Theory for Representing Data Accessibility in a Network.",
                    "Tableau-Like Automata-Based Axiomatization for Propositional Linear Temporal Logic."
                ]
            },
            {
                "sub_name_abbr": "conf/lics/2010lam",
                "sub_name": "3rd International Workshop on Logics, Agents, and Mobility, LAM'10, Edinburgh, UK, July 14, 2010.",
                "count": 9,
                "papers": [
                    "Possession as Linear Knowledge.",
                    "Modal Location-Resource-Process Logic for Access Control.",
                    "Reconciling Population and Agent Models for Crowd Dynamics.",
                    "A Survey of Elementary Object Systems.",
                    "Complexity of LTL Model-Checking for Safe Object Nets.",
                    "Towards a Simply Typed CALculus for Semantic Knowledge Bases.",
                    "An Operational Semantics for Network Datalog.",
                    "Towards a Logic for Reasoning About Learning in a Changing World.",
                    "QWeS2T for Type-Safe Web Programming."
                ]
            },
            {
                "sub_name_abbr": "journals/corr/abs-1101-4104",
                "sub_name": "Proceedings Fifth Workshop on Intersection Types and Related Systems, ITRS 2010, Edinburgh, U.K., 9th July 2010.",
                "count": 7,
                "papers": [
                    "Relating Church-Style and Curry-Style Subtyping.",
                    "Intersection Logic in sequent calculus style.",
                    "Sound and Complete Typing for lambda-mu.",
                    "Intersection types for unbind and rebind.",
                    "Untangling Typechecking of Intersections and Unions.",
                    "Session Types = Intersection Types + Union Types.",
                    "Equality, Quasi-Implicit Products, and Large Eliminations."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "24th LICS 2009",
        "info": "Los Angeles, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/lics/2009",
                "sub_name": "Proceedings of the 24th Annual IEEE Symposium on Logic in Computer Science, LICS 2009, 11-14 August 2009, Los Angeles, CA, USA.",
                "count": 43,
                "papers": [
                    "My 27-year Quest to Overcome the State Explosion Problem.",
                    "The General Vector Addition System Reachability Problem by Presburger Inductive Invariants.",
                    "Applications of Game Semantics: From Program Analysis to Hardware Synthesis.",
                    "Boundedness vs. Unboundedness of Lock Chains: Characterizing Decidability of Pairwise CFL-Reachability for Threads Communicating via Locks.",
                    "Psi-calculi: Mobile Processes, Nominal Data, and Logic.",
                    "An Algebra for Kripke Polynomial Coalgebras.",
                    "Trace Semantics is Fully Abstract.",
                    "Logical Step-Indexed Logical Relations.",
                    "Fully Abstract Logical Bisimilarity for a Polymorphic Object Calculus.",
                    "Reflexive Scott Domains are Not Complete for the Extensional Lambda Calculus.",
                    "Substructural Operational Semantics as Ordered Logic Programming.",
                    "Logics with Rank Operators.",
                    "On Finite Satisfiability of Two-Variable First-Order Logic with Equivalence Relations.",
                    "Pointer Programs and Undirected Reachability.",
                    "An Exponential Lower Bound for the Parity Game Strategy Improvement Algorithm as We Know it.",
                    "Graph Reachability and Pebble Automata over Infinite Alphabets.",
                    "An Improved Lower Bound for the Complementation of Rabin Automata.",
                    "A Type System Equivalent to the Modal Mu-Calculus Model Checking of Higher-Order Recursion Schemes.",
                    "Clipping: A Semantics-Directed Syntactic Approximation.",
                    "Expressiveness and Closure Properties for Quantitative Languages.",
                    "Computation and the Periodic Table.",
                    "The Structure of First-Order Causality.",
                    "The Inverse Taylor Expansion Problem in Linear Logic.",
                    "On the Computational Complexity of Verifying One-Counter Processes.",
                    "Co-ing Büchi Made Tight and Useful.",
                    "Wreath Products of Forest Algebras, with Applications to Tree Logics.",
                    "Dinatural Terms in System F.",
                    "Indexed Containers.",
                    "Functional Reachability.",
                    "Statistic Analysis for Probabilistic Processes.",
                    "Quantitative Model Checking of Continuous-Time Markov Chains Against Timed Automata Specifications.",
                    "Qualitative Determinacy and Decidability of Stochastic Games with Signals.",
                    "Combining Ehrenfeucht-Fraïssé Games.",
                    "Winning Concurrent Reachability Games Requires Doubly-Exponential Patience.",
                    "Graded Computation Tree Logic.",
                    "A Unified Sequent Calculus for Focused Proofs.",
                    "Non-linear Rewrite Closure and Weak Normalization.",
                    "Ludics with Repetitions (Exponentials, Interactive Types and Completeness).",
                    "Trichotomy in the Complexity of Minimal Inference.",
                    "A Logic for PTIME and a Parameterized Halting Problem.",
                    "A Note on the Complexity of the Satisfiability Problem for Graded Modal Logics.",
                    "The Complexity of Global Cardinality Constraints.",
                    "The Complexity of Positive First-order Logic without Equality."
                ]
            }
        ]
    },
    {
        "year": "2008",
        "name": "23rd LICS 2008",
        "info": "Pittsburgh, Pennsylvania, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/lics/2008",
                "sub_name": "Proceedings of the Twenty-Third Annual IEEE Symposium on Logic in Computer Science, LICS 2008, 24-27 June 2008, Pittsburgh, PA, USA.",
                "count": 42,
                "papers": [
                    "On the Expressiveness and Complexity of Randomization in Finite State Monitors.",
                    "Combining Generic Judgments with Recursive Definitions.",
                    "Mechanizing the Metatheory of LF.",
                    "Second-Order and Dependently-Sorted Abstract Syntax.",
                    "Structural Logical Relations.",
                    "Types for Hereditary Permutators.",
                    "Context Matching for Compressed Terms.",
                    "Nonlocal Flow of Control and Kleene Algebra with Tests.",
                    "A Logic for Algebraic Effects.",
                    "An Algebraic Process Calculus.",
                    "On the Expressiveness and Decidability of Higher-Order Process Calculi.",
                    "On the Axiomatizability of Impossible Futures: Preorder versus Equivalence.",
                    "General Structural Operational Semantics through Categorical Logic.",
                    "Parameterization as Abstraction: A Tractable Approach to the Dataflow Analysis of Concurrent Programs.",
                    "Winning Regions of Higher-Order Pushdown Games.",
                    "The Ordinal Recursive Complexity of Lossy Channel Systems.",
                    "Almost-Sure Model Checking of Infinite Paths in One-Clock Timed Automata.",
                    "From Axioms to Analytic Rules in Nonclassical Logics.",
                    "Focusing on Binding and Computation.",
                    "A First-Order Representation of Pure Type Systems Using Superdeduction.",
                    "The Quest for a Logic Capturing PTIME.",
                    "On the Asymptotic Nullstellensatz and Polynomial Calculus Proof Complexity.",
                    "On the Computational Complexity of Cut-Reduction.",
                    "Maltsev + Datalog --> Symmetric Datalog.",
                    "Caterpillar Duality for Constraint Satisfaction Problems.",
                    "Quantified Constraints and Containment Problems.",
                    "Hiding Local State in Direct Style: A Higher-Order Anti-Frame Rule.",
                    "Typed Normal Form Bisimulation for Parametric Polymorphism.",
                    "Reachability Games and Game Semantics: Comparing Nondeterministic Programs.",
                    "Weak Topology and a Differentiable Operator for Lipschitz Maps.",
                    "A Logical Characterization of Individual-Based Models.",
                    "The Satisfiability Problem for Probabilistic CTL.",
                    "The Axiomatic Derivation of Absolute Lower Bounds.",
                    "Definable Tree Decompositions.",
                    "Hypergraph Acyclicity and Extension Preservation Theorems.",
                    "From Automatic Structures to Borel Structures.",
                    "Piecewise Testable Tree Languages.",
                    "Collapsible Pushdown Automata and Recursion Schemes.",
                    "The Geometry of Interaction of Differential Interaction Nets.",
                    "Correctness of Multiplicative Additive Proof Structures is NL-Complete.",
                    "Cut Elimination for Monomial MALL Proof Nets.",
                    "A Neutral Approach to Proof and Refutation in MALL."
                ]
            }
        ]
    },
    {
        "year": "2007",
        "name": "22nd LICS 2007",
        "info": "Wroclaw, Poland",
        "venues": [
            {
                "sub_name_abbr": "conf/lics/2007",
                "sub_name": "22nd IEEE Symposium on Logic in Computer Science (LICS 2007), 10-12 July 2007, Wroclaw, Poland, Proceedings.",
                "count": 44,
                "papers": [
                    "Normalization by Evaluation for Martin-Lof Type Theory with Typed Equality Judgements.",
                    "Strong Normalization as Safe Interaction.",
                    "A Dependent Set Theory.",
                    "Some Methods of Problem Solving in Elementary Geometry.",
                    "Principles of Superdeduction.",
                    "Complete Sequent Calculi for Induction and Infinite Descent.",
                    "Highly Efficient Secrecy-Preserving Proofs of Correctness of Computations and Applications.",
                    "A Complete Axiomatization of Knowledge and Cryptography.",
                    "Limits of Multi-Discounted Markov Decision Processes.",
                    "Game Relations and Metrics.",
                    "The Cost of Punctuality.",
                    "Two-way unary temporal logic over trees.",
                    "Alternation-free modal mu-calculus for data trees.",
                    "A Contraction Method to Decide MSO Theories of Deterministic Trees.",
                    "First-Order and Temporal Logics for Nested Words.",
                    "A Robust Class of Context-Sensitive Languages.",
                    "A New Efficient Simulation Equivalence Algorithm.",
                    "Infinite State AMC-Model Checking for Cryptographic Protocols.",
                    "Symmetric Datalog and Constraint Satisfaction Problems in Logspace.",
                    "Quantified Equality Constraints.",
                    "Tractability and learnability arising from algebras with few subpowers.",
                    "Examining The Fragments of G.",
                    "Separating DAG-Like and Tree-Like Proof Systems.",
                    "The Complexity of Proving the Discrete Jordan Curve Theorem.",
                    "Reflections on Finite Model Theory.",
                    "Locally Excluding a Minor.",
                    "Lindstrom theorems for fragments of first-order logic.",
                    "Environmental Bisimulations for Higher-Order Languages.",
                    "Pi-Calculus in Logical Form.",
                    "Characterising Testing Preorders for Finite Probabilistic Processes.",
                    "Higher-Order Matching, Games and Automata.",
                    "Bialgebraic Operational Semantics and Modal Logic.",
                    "Relational Parametricity for Computational Effects.",
                    "Static Name Control for FreshML.",
                    "Local Action and Abstract Separation Logic.",
                    "Categorical Combinatorics for Innocent Strategies.",
                    "Resource modalities in game semantics.",
                    "Full abstraction for nominal general references.",
                    "Stratified Bounded Affine Logic for Logarithmic Space.",
                    "Light Logics and Optimal Reduction: Completeness and Complexity.",
                    "Modified Realizability Interpretation of Classical Linear Logic.",
                    "Infinite sets that admit fast exhaustive search.",
                    "On Noetherian Spaces.",
                    "A computable approach to measure and integration theory."
                ]
            }
        ]
    },
    {
        "year": "2006",
        "name": "21st LICS 2006",
        "info": "Seattle, WA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/lics/2006",
                "sub_name": "21th IEEE Symposium on Logic in Computer Science (LICS 2006), 12-15 August 2006, Seattle, WA, USA, Proceedings.",
                "count": 47,
                "papers": [
                    "Foreward.",
                    "Conference Organization.",
                    "Organizing Committee.",
                    "Reviewers.",
                    "Formal Verification of Infinite State Systems Using Boolean Methods.",
                    "Two-Variable Logic on Words with Data.",
                    "LTL with the Freeze Quantifier and Register Automata.",
                    "Fixed-Parameter Hierarchies inside PSPACE.",
                    "The Boundedness Problem for Monadic Universal First-Order Logic.",
                    "A Congruence Rule Format for Name-Passing Process Calculi from Mathematical Structural Operational Semantics.",
                    "On the Expressiveness of Linearity vs Persistence in the Asychronous Pi-Calculus.",
                    "Saturated Semantics for Reactive Systems.",
                    "On Model-Checking Trees Generated by Higher-Order Recursion Schemes.",
                    "Monadic Chain Logic Over Iterations and Applications to Pushdown Systems.",
                    "An Automata-Theoretic Approach for Model Checking Threads for LTL Propert.",
                    "On Typability for Rank-2 Intersection Types with Polymorphic Recursion.",
                    "Adapting Logics.",
                    "Managing Digital Rights using Linear Logic.",
                    "Variables as Resource in Hoare Logics.",
                    "Independence and Concurrent Separation Logic.",
                    "Matching Explicit and Modal Reasoning about Programs: A Proof Theoretic Delineation of Dynamic Logic.",
                    "Context Semantics, Linear Logic and Computational Complexity.",
                    "Obsessional Cliques: A Semantic Characterization of Bounded Time Complexity.",
                    "Conditional Lower Bound for a System of Constant-Depth Proofs with Modular Connectives.",
                    "A Characterisation of First-Order Constraint Satisfaction Problems.",
                    "First Order Formulas with Modular Predicates.",
                    "On Tractability and Congruence Distributivity.",
                    "PSPACE Bounds for Rank-1 Modal Logics.",
                    "Avoiding Determinization.",
                    "From Nondeterministic Buchi and Streett Automata to Deterministic Parity Automata.",
                    "Memoryful Branching-Time Logic.",
                    "Faster Solutions of Rabin and Streett Games.",
                    "Bounds in w-Regularity.",
                    "Head Normal Form Bisimulation for Pairs and the \\lambda\\mu-Calculus.",
                    "A Proof of Strong Normalisation using Domain Theory.",
                    "Boolean Algebras for Lambda Calculus.",
                    "Normalisation is Insensible to lambda-Term Identity or Difference.",
                    "Shaken Foundations or Groundbreaking Realignment? A Centennial Assessment of Kurt Gödel's Impact on Logic, Mathematics, and Computer Science.",
                    "Provable Implementations of Security Protocols.",
                    "Stochastic Games with Branching-Time Winning Objectives.",
                    "Coinductive Proof Principles for Stochastic Processes.",
                    "Control in o-minimal Hybrid Systems.",
                    "An Abstraction-Refinement Framework for Multi-Agent Systems.",
                    "Temporal Logics and Model Checking for Fairly Correct Systems.",
                    "3-Valued Abstraction: More Precision at Less Cost.",
                    "Approximation Schemes for First-Order Definable Optimisation Problems.",
                    "Approximate Satisfiability and Equivalence."
                ]
            }
        ]
    },
    {
        "year": "2005",
        "name": "20th LICS 2005",
        "info": "Chicago, IL, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/lics/2005",
                "sub_name": "20th IEEE Symposium on Logic in Computer Science (LICS 2005), 26-29 June 2005, Chicago, IL, USA, Proceedings.",
                "count": 55,
                "papers": [
                    "Front Cover.",
                    "Cover Pages.",
                    "Foreword.",
                    "Conference Organization.",
                    "Program Committee.",
                    "Additional Reviewers.",
                    "Relations in Concurrency.",
                    "Regular Expressions in Process Algebra.",
                    "Modal Characterisation Theorems over Special Classes of Frames.",
                    "Temporal Logics over Unranked Trees.",
                    "On Locality and Uniform Reduction.",
                    "Looping Caterpillars.",
                    "Generalizing Parametricity Using Information-flow.",
                    "Relational Parametricity and Control.",
                    "Recursive Polymorphic Types and Parametricity in an Operational Framework.",
                    "Semantic Subtyping for the p-Calculus.",
                    "An Insider's Guide to Logic in Telecommunications Data.",
                    "On Digraph Coloring Problems and Treewidth Duality.",
                    "Quantitative Analysis of Probabilistic Pushdown Automata: Expectations and Variances.",
                    "Verifying Infinite Markov Chains with a Finite Attractor or the Global Coarseness Property.",
                    "Recognizing omega-regular Languages with Probabilistic Automata.",
                    "A Polynomial Time Presburger Criterion and Synthesis for Number Decision Diagrams.",
                    "Model Checking Vs. Generalized Model Checking: Semantic Minimizations for Temporal Logics.",
                    "Model-Checking Hierarchical Structures.",
                    "Mean-Payoff Parity Games.",
                    "On the Decidability of Metric Temporal Logic.",
                    "Closure Properties of Coalgebra Automata.",
                    "Constructing Free Boolean Categories.",
                    "Completions of µ-algebras.",
                    "Proof-Theoretic Approach to Description-Logic.",
                    "Process Algebras for Quantitative Analysis.",
                    "A Functional Quantum Programming Language.",
                    "Semantics of Separation-Logic Typing and Higher-Order Frame Rules.",
                    "An Observationally Complete Program Logic for Imperative Higher-Order Frame Rules.",
                    "Expressiveness of a Spatial Logic for Trees.",
                    "Proof Theory for Kleene Algebra.",
                    "Name Generation and Linearity.",
                    "Reactive Systems over Cospans.",
                    "Uniform Distributed Synthesis.",
                    "Automated Verification of Selected Equivalences for Security Protocols.",
                    "Tarski's Influence on Computer Science.",
                    "Logic and Systems Biology.",
                    "Eager Normal Form Bisimulation.",
                    "Separation with Streams in the lambdaµ-calculus.",
                    "The Geometry of Linear Higher-Order Recursion.",
                    "Ludics Nets, a game Model of Concurrent Interaction.",
                    "Asynchronous Games 4: A Fully Complete Model of Propositional Linear Logic.",
                    "Herbrand Constraint Abduction.",
                    "Certifying Compilation for a Language with Stack Allocation.",
                    "Inverse and Implicit Functions in Domain Theory.",
                    "Operational Domain Theory and Topology of a Sequential Programming Language.",
                    "Generalized Majority-Minority Operations are Tractable.",
                    "Small Substructures and Decidability Issues for First-Order Logic with Two Variables.",
                    "Definability on a Random 3-CNF Formula.",
                    "Existential Positive Types and Preservation under Homomorphisisms."
                ]
            }
        ]
    },
    {
        "year": "2004",
        "name": "19th LICS 2004",
        "info": "Turku, Finland",
        "venues": [
            {
                "sub_name_abbr": "conf/lics/2004",
                "sub_name": "19th IEEE Symposium on Logic in Computer Science (LICS 2004), 14-17 July 2004, Turku, Finland, Proceedings.",
                "count": 46,
                "papers": [
                    "Model Checking Synchronized Products of Infinite Transition Systems.",
                    "Model Checking Probabilistic Pushdown Automata.",
                    "Spi Calculus Translated to ?--Calculus Preserving May-Tests.",
                    "Transition Invariants.",
                    "Automatic Structures: Richness and Limitations.",
                    "On the Language Inclusion Problem for Timed Automata: Closing a Decidability Gap.",
                    "Vector Addition Tree Automata.",
                    "Testing, Optimizaton, and Games.",
                    "Proving Termination Assertions in Dynamic Logics.",
                    "Deciding Quantifier-Free Presburger Formulas Using Parameterized Solution Bounds.",
                    "On the Automata Size for Presburger Arithmetic.",
                    "From Automata to Formulas: Convex Integer Polyhedra.",
                    "Feasible Proofs and Computations: Partnership and Fusion.",
                    "A Sequent Calculus for Nominal Logic.",
                    "Nominal Games and Full Abstraction for the Nu-Calculus.",
                    "Games with Secure Equilibria.",
                    "Three-Valued Abstractions of Games: Uncertainty, but with Precision.",
                    "Proof Nets and Boolean Circuits.",
                    "An Arithmetical Hierarchy of the Law of Excluded Middle and Related Principles.",
                    "The Omega Rule is II_2^0-Hard in the lambda beta -Calculus.",
                    "On the Geometry of Interaction for Classical Logic.",
                    "Beyond Image-Finiteness: Labelled Transition Systems as a Stone Space.",
                    "First-Order Definable Retraction Problems for Posets and Reflexive Graph.",
                    "Parametric Limits.",
                    "Self-Adjusting Computation.",
                    "The Strength of Replacement in Weak Arithmetic.",
                    "Light Types for Polynomial Time Computation in Lambda-Calculus.",
                    "The Sensible Graph Theories of Lambda Calculus.",
                    "A Symmetric Modal Lambda Calculus for Distributed Computing.",
                    "Bisimulation: From The Origins to Today.",
                    "Congruence for SOS with Data.",
                    "Towards Imperative Modules: Reasoning about Invariants and Sharing of Mutable State.",
                    "A Computational Interpretation of Open Induction.",
                    "The Existence of Finite Abstractions for Branching Time Model Checking.",
                    "Multi-Clock Timed Networks.",
                    "A Landscape with Games in the Backgroun.",
                    "An Algebraic Approach to the Complexity of Propositional Circumscription.",
                    "VTC circ: A Second-Order Theory for TCcirc.",
                    "Model-Checking Problems as a Basis for Parameterized Intractability.",
                    "A Second-Order Theory for NL.",
                    "High-Level Methods for Quantum Computation and Information.",
                    "A Categorical Semantics of Quantum Protocols.",
                    "Semantics of a Sequential Language for Exact Real-Number Computation.",
                    "The Succinctness of First-Order Logic on Linear Orders.",
                    "A Graph of a Relational Structure and Constraint Satisfaction Problems.",
                    "Equicardinality on Linear Orders."
                ]
            }
        ]
    },
    {
        "year": "2003",
        "name": "18th LICS 2003",
        "info": "Ottawa, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/lics/2003",
                "sub_name": "18th IEEE Symposium on Logic in Computer Science (LICS 2003), 22-25 June 2003, Ottawa, Canada, Proceedings.",
                "count": 39,
                "papers": [
                    "Proof Nets for Unit-free Multiplicative-Additive Linear Logic (Extended abstract).",
                    "About Translations of Classical Logic into Polarized Linear Logic.",
                    "System ST \\beta-reduction and completeness.",
                    "Types and Programming Languages: The Next Generation.",
                    "Reasoning about Hierarchical Storage.",
                    "Formal Verification at Intel.",
                    "New Directions in Instantiation-Based Theorem Proving.",
                    "Abstract Saturation-Based Inference.",
                    "Orienting Equalities with the Knuth-Bendix Order.",
                    "Dependent Intersection: A New Way of Defining Records in Type Theory.",
                    "Structural Subtyping of Non-Recursive Types is Decidable.",
                    "On Program Equivalence in Languages with Ground-Type References.",
                    "A Proof Theory for Generic Judgments: An extended abstract.",
                    "Polynomial-time Algorithms from Ineffective Proofs.",
                    "The Complexity of Resolution Refinements.",
                    "Successor-Invariance in the Finite.",
                    "Will Deflation Lead to Depletion? On Non-Monotone Fixed Point Inductions.",
                    "On Automatic Partial Orders.",
                    "Logical Definability and Query Languages over Unranked Trees.",
                    "Query Evaluation on Compressed Trees (Extended Abstract).",
                    "Revisiting Digitization, Robustness, and Decidability for Timed Automata.",
                    "Satisfiability in Alternating-time Temporal Logic.",
                    "Strong Bisimilarity on Basic Parallel Processes is PSPACE-complete.",
                    "Logic in Access Control.",
                    "The Planning Spectrum - One, Two, Three, Infinity.",
                    "Advice about logical AI.",
                    "A Sound Framework for Untrusted Verification-Condition Generators.",
                    "An NP Decision Procedure for Protocol Insecurity with XOR.",
                    "Intruder Deductions, Constraint Solving and Insecurity Decision in Presence of Exclusive or.",
                    "Spectrum Hierarchies and Subdiagonal Functions.",
                    "Spectra of Monadic Second-Order Formulas with One Unary Function.",
                    "Convergence Law for Random Graphs with Specified Degree Sequence.",
                    "Homomorphism Closed vs. Existential Positive.",
                    "Tractable conservative Constraint Satisfaction Problems.",
                    "Labelled Markov Processes: Stronger and Faster Approximations.",
                    "Model checking for probability and time: from theory to practice .",
                    "Model Checking Guarded Protocols.",
                    "Model-checking Trace Event Structures.",
                    "Micro-Macro Stack Systems: A New Frontier of Elementary Decidability for Sequential Systems."
                ]
            }
        ]
    },
    {
        "year": "2002",
        "name": "17th LICS 2002",
        "info": "Copenhagen, Denmark",
        "venues": [
            {
                "sub_name_abbr": "conf/lics/2002",
                "sub_name": "17th IEEE Symposium on Logic in Computer Science (LICS 2002), 22-25 July 2002, Copenhagen, Denmark, Proceedings.",
                "count": 41,
                "papers": [
                    "Little Engines of Proof.",
                    "Automatic Decidability.",
                    "Tree-Like Counterexamples in Model Checking.",
                    "Probabilistic Abstraction for Model Checking: An Approach Based on Property Testing.",
                    "Semantic Minimization of 3-Valued Propositional Formulae.",
                    "Separation Logic: A Logic for Shared Mutable Data Structures.",
                    "A Stratified Semantics of General References A Stratified Semantics of General References.",
                    "A Syntactic Approach to Foundational Proof-Carrying Code.",
                    "A Fully Abstract May Testing Semantics for Concurrent Objects.",
                    "Semantics and Logic of Object Calculi.",
                    "Efficient Type Inference for Record Concatenation and Subtyping.",
                    "Semantic Subtyping.",
                    "Remarks on Isomorphisms in Typed Lambda Calculi with Empty and Sum Types.",
                    "On The Lambda Y Calculus.",
                    "Dense Real-Time Games.",
                    "Computing Reachability Relations in Timed Automata.",
                    "Monadic Queries over Tree-Structured Data.",
                    "Tree Extension Algebras: Logics, Automata, and Query Languages.",
                    "The Complexity of First-Order and Monadic Second-Order Logic Revisited.",
                    "The 0-1 law fails for frame satisfiability of propositional modal logic.",
                    "Some Results on Automatic Structures.",
                    "Observational Equivalence of 3rd-Order Idealized Algol is Decidable.",
                    "Games on Graphs and Sequentially Realizable Functionals.",
                    "Polarized Games.",
                    "Domain Theory and Differential Calculus (Functions of one Variable).",
                    "Computational Adequacy for Recursive Types in Models of Intuitionistic Set Theory.",
                    "The Powerdomain of Indexed Valuations.",
                    "Complexity Classes, Propositional Proof Systems, and Formal Theories.",
                    "Complete Problems for Dynamic Complexity Classes.",
                    "Unsatisfiable Random Formulas Are Hard to Certify.",
                    "The Proof Complexity of Linear Algebra.",
                    "Calibrating Computational Feasibility by Abstraction Rank.",
                    "Description Logics: Foundations for Class-based Knowledge Representation.",
                    "Modal and Guarded Characterisation Theorems over Finite Transition Systems.",
                    "Temporal Logic with Forgettable Past.",
                    "Decidable and Undecidable Fragments of First-Order Branching Temporal Logics.",
                    "Expressive Equivalence of Least and Inflationary Fixed-Point Logic.",
                    "The Metric Analogue of Weak Bisimulation for Probabilistic Processes.",
                    "Separability, Expressiveness, and Decidability in the Ambient Logic.",
                    "Linearity in Process Languages.",
                    "Deciding Confluence of Certain Term Rewriting Systems in Polynomial Time."
                ]
            }
        ]
    },
    {
        "year": "2001",
        "name": "16th LICS 2001",
        "info": "Boston, Massachusetts, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/lics/2001",
                "sub_name": "16th Annual IEEE Symposium on Logic in Computer Science, Boston, Massachusetts, USA, June 16-19, 2001, Proceedings.",
                "count": 42,
                "papers": [
                    "Probabilistic Polynominal-Time Process Calculus and Security Protocol Analysis.",
                    "Definitions by Rewriting in the Calculus of Constructions.",
                    "Deconstructing Shostak.",
                    "A Decision Procedure for an Extensional Theory of Arrays.",
                    "On Ordering Constraints for Deduction with Built-In Abelian Semigroups, Monoids and Groups.",
                    "Successive Approximation of Abstract Transition Relations.",
                    "A Bound on Attacks on Payment Protocols.",
                    "A Dichotomy in the Complexity of Propositional Circumscription.",
                    "Relating Semantic and Proof-Theoretic Concepts for Polynominal Time Decidability of Uniform Word Problems.",
                    "Semantics of Name and Value Passing.",
                    "A Fully Abstract Game Semantics of Local Exceptions.",
                    "A Universal Characterization of the Closed Euclidean Interval.",
                    "Logician in the Land of OS: Abstract State Machines in Microsoft.",
                    "Eliminating Definitions and Skolem Functions in First-Order Logic.",
                    "On the Decision Problem for the Guarded Fragment with Transitivity.",
                    "The Hierarchy inside Closed Monadic Sigma1 Collapses on the Infinite Binary Tree.",
                    "On Definability of Order in Logic with Choice.",
                    "The Engineering Challenge for Logic.",
                    "A Second-Order System for Polytime Reasoning Using Graedel's Theorem.",
                    "The Crane Beach Conjecture.",
                    "An n! Lower Bound on Formula Size.",
                    "Light Affine Calculus and Polytime Strong Normalization.",
                    "Intensionality, Extensionality, and Proof Irrelevance in Modal Type Theory.",
                    "Dependent Types for Program Termination Verification.",
                    "Foundational Proof-Carrying Code.",
                    "Intuitionistic Linear Logic and Partial Correctness.",
                    "Perturbed Turing Machines and Hybrid Systems.",
                    "From Verification to Control: Dynamic Programs for Omega-Regular Objectives.",
                    "Deterministic Generators and Games for LTL Fragments.",
                    "Normalization by Evaluation for Typed Lambda Calculus with Coproducts.",
                    "Strong Normalisation in the pi-Calculus.",
                    "A Symbolic Labelled Transition System for Coinductive Subtyping of Fµ< Types.",
                    "A Continuum of Theories of Lambda Calculus without Semantics.",
                    "Relating Levels of the Mu-Calculus Hierarchy and Levels of the Monadic Hierarchy.",
                    "Focus Games for Satisfiability and Completeness of Temporal Logic.",
                    "Safety and Liveness in Branching Time.",
                    "Semistructured Data: from Practice to Theory.",
                    "Synthesizing Distributed Systems.",
                    "Permutation Rewriting and Algorithmic Verification.",
                    "Temporal Logic Query Checking.",
                    "Typechecking XML Views of Relational Databases.",
                    "A Model-Theoretic Approach to Regular String Relations."
                ]
            }
        ]
    },
    {
        "year": "2000",
        "name": "15th LICS 2000",
        "info": "Santa Barbara, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/lics/2000",
                "sub_name": "15th Annual IEEE Symposium on Logic in Computer Science, Santa Barbara, California, USA, June 26-29, 2000.",
                "count": 39,
                "papers": [
                    "Logic, Complexity, and Games.",
                    "A General Notion of Realizability.",
                    "A Model for Impredicative Type Systems, Universes, Intersection Types and Subtyping.",
                    "Complete Axioms for Categorical Fixed-Point Operators.",
                    "The Role of Decidability in First Order Separations over Classes of Finite Structures.",
                    "Automatic Structures.",
                    "Definability and Compression.",
                    "Resource-Bounded Continuity and Sequentiality for Type-Two Functionals.",
                    "A Syntactical Analysis of Non-Size-Increasing Polynomial Time Computation.",
                    "Approximating Labeled Markov Processes.",
                    "Precongruence Formats for Decorated Trace Preorders.",
                    "Virtual Symmetry Reduction.",
                    "Better is Better than Well: On Efficient Verification of Infinite-State Systems.",
                    "Concurrent Omega-Regular Games.",
                    "Approximate Pattern Matching is Expressible in Transitive Closure Logic.",
                    "Computational Complexity of Some Problems Involving Congruences on Algebras.",
                    "From the Church-Turing Thesis to the First-Order Algorithm Theorem.",
                    "Satisfiability Testing: Recent Developments and Challenge Problems.",
                    "Dominator Trees and Fast Verification of Proof Nets.",
                    "Game Semantics and Subtyping.",
                    "Probabilistic Game Semantics.",
                    "Back and Forth between Guarded and Modal Logics.",
                    "More Past Glories.",
                    "A Complete Axiomatization of Interval Temporal Logic with Infinite Time.",
                    "A Modality for Recursion.",
                    "A Static Calculus of Dependencies for the lambda-Cube.",
                    "A Decision Procedure for Term Algebras with Queues.",
                    "A Decision Procedure for the Existential Theory of Term Algebras with the Knuth-Bendix Ordering.",
                    "Some Strategies for Proving Theorems with a Model Checker.",
                    "The Curry-Howard Correspondence in Set Theory.",
                    "A Theory of Bisimulation for a Fragment of Concurrent ML with Local Names.",
                    "Models for Name-Passing Processes: Interleaving and Causal.",
                    "Assigning Types to Processes.",
                    "On First-Order Topological Queries.",
                    "View-Based Query Processing and Constraint Satisfaction.",
                    "Imperative Programming with Dependent Types.",
                    "Efficient and Flexible Matching of Recursive Types.",
                    "How to Optimize Proof-Search in Modal Logics: A New Way of Proving Redundancy Criteria for Sequent Calculi.",
                    "Paramodulation with Built-in Abelian Groups."
                ]
            }
        ]
    },
    {
        "year": "1999",
        "name": "14th LICS 1999",
        "info": "Trento, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/lics/1999",
                "sub_name": "14th Annual IEEE Symposium on Logic in Computer Science, Trento, Italy, July 2-5, 1999.",
                "count": 46,
                "papers": [
                    "Some Decision Problems of Enormous Complexity.",
                    "Two-Variable Descriptions of Regularity.",
                    "The Two-Variable Guarded Fragment with Transitive Relations.",
                    "Logics with Aggregate Operators.",
                    "Guarded Fixed Point Logic.",
                    "Towards a Theory of Bisimulation for Local Names.",
                    "Weak Bisimulation and Open Maps.",
                    "Elementary Axioms for Categories of Classes.",
                    "Region Analysis and the Polymorphic Lambda Calculus.",
                    "Pattern Matching as Cut Elimination.",
                    "Some Computational Properties of Intersection Types.",
                    "Type Inference for Recursive Definitions.",
                    "Plausibility Measures and Default Reasoning: An Overview.",
                    "Subtyping Recursive Types in Kernel Fun.",
                    "A Fragment Calculus - Towards a Model of Separate Compilation, Linking and Binary Compatibility.",
                    "Proof Techniques for Cryptographic Processes.",
                    "On Hoare Logic and Kleene Algebra with Tests.",
                    "Full Abstraction and Universality via Realisability.",
                    "On Bunched Predicate Logic.",
                    "Abstract Syntax and Variable Binding.",
                    "Semantical Analysis of Higher-Order Abstract Syntax.",
                    "A New Approach to Abstract Syntax Involving Binders.",
                    "Paramodulation with Non-Monotonic Orderings.",
                    "Full Completeness of the Multiplicative Linear Logic of Chu Spaces.",
                    "Cartesian Closed Double Categories, Their Lambda-Notation, and the Pi-Calculus.",
                    "Weak Bounded Arithmetic, the Diffie-Hellman Problem and Constable's Class K.",
                    "First-Order Logic vs. Fixed-Point Logic in Finite Set Theory.",
                    "Entailment of Atomic Set Constraints is PSPACE-Complete.",
                    "A Superposition Decision Procedure for the Guarded Fragment with Equality.",
                    "Working with Arms: Complexity Results on Atomic Representations of Herbrand Models.",
                    "Logics with Counting, Auxiliary Relations, and Lower Bounds for Invariant Queries.",
                    "Counting and Addition Cannot Express Deterministic Transitive Closure.",
                    "Parametric Quantitative Temporal Reasoning.",
                    "Modular Temporal Logic.",
                    "On the Verification of Broadcast Protocols.",
                    "On the Expressive Power of CTL.",
                    "Proving Security Protocols Correct.",
                    "Reasoning about Common Knowledge with Infinitely Many Agents.",
                    "Parikh's Theorem in Commutative Kleene Algebra.",
                    "The Higher-Order Recursive Path Ordering.",
                    "Extensional Equality in Intensional Type Theory.",
                    "A Fully Abstract Game Semantics for Finite Nondeterminism.",
                    "Concurrent Games and Full Completeness.",
                    "Non-Deterministic Games and Program Analysis: An Application to Security.",
                    "Correctness of Multiplicative Proof Nets Is Linear.",
                    "Linear Types and Non-Size-Increasing Polynomial Time Computation."
                ]
            }
        ]
    },
    {
        "year": "1998",
        "name": "13th LICS 1998",
        "info": "Indianapolis, Indiana, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/lics/1998",
                "sub_name": "Thirteenth Annual IEEE Symposium on Logic in Computer Science, Indianapolis, Indiana, USA, June 21-24, 1998.",
                "count": 47,
                "papers": [
                    "Logic and Over-Simplification.",
                    "Fixed-Point Logics on Planar Graphs.",
                    "Existential Second-Order Logic over Strings.",
                    "Ordering Finite Variable Types with Generalized Quantifiers.",
                    "Convergence Results for Relational Bayesian Networks.",
                    "The Horn Mu-calculus.",
                    "On Model Checking for Non-Deterministic Infinite-State Systems.",
                    "Freedom, Weakness, and Determinism: From Linear-Time to Branching-Time.",
                    "Efficient Representation and Validation of Proofs.",
                    "Secure Implementation of Channel Abstractions.",
                    "The Logical Role of the Four-Valued Bilattice.",
                    "Completeness of a Relational Calculus for Program Schemes.",
                    "Monadic Logic and Automata: Recent Developments.",
                    "Phase Semantics and Verification of Concurrent Constraint Programs.",
                    "A Congruence Theorem for Structured Operational Semantics of Higher-Order Languages.",
                    "Bisimulation in Name-Passing Calculi without Matching.",
                    "The Fusion Calculus: Expressiveness and Symmetry in Mobile Processes.",
                    "Type Theory via Exact Categories.",
                    "Higher Dimensional Multigraphs.",
                    "An Axiomatics for Categories of Transition Systems as Coalgebras.",
                    "A Theory of Recursive Domains with Applications to Concurrency.",
                    "L. E. J. Brouwer's Intuitionism: A Revolution in Two Installments.",
                    "Process Operations in Extended Dynamic Logics.",
                    "Herbrand's Theorem, Automated Reasoning and Semantics Tableaux.",
                    "The Relation Between Second-Order Unification and Simultaneous Rigid E-Unification.",
                    "Decision Problems in Ordered Rewriting.",
                    "A Stability Theorem in Rewriting Theory.",
                    "Light Affine Logic.",
                    "Linear Logic With Boxes.",
                    "Coinductive Techniques for Operational Equivalence of Interaction Nets.",
                    "A Fully Abstract Game Semantics for General References.",
                    "Recursive Types in Games: Axiomatics and Process Representation.",
                    "Realizability for Constructive Theory of Functions and Classes and its Application to Program Synthesis.",
                    "Completeness of Type Assignment Systems with Intersection, Union, and Type Quantifiers.",
                    "Full Abstraction for First-Order Objects with Recursive Types and Subtyping.",
                    "Linear vs. Branching Time: A Complexity-Theoretic Perspective.",
                    "Calculus in Coinductive Form.",
                    "Invertibility in lambda-eta.",
                    "The First-Order Theory of Ordering Constraints over Feature Trees.",
                    "On Proofs about Threshold Circuits and Counting Hierarchies.",
                    "How to Specify and Verify the Long-Run Average Behavior of Probabilistic Systems.",
                    "Compositional Analysis of Expected Delays in Networks of Probabilistic I/O Automata.",
                    "A Logical Characterization of Bisimulation for Labeled Markov Processes.",
                    "Embedded Finite Models, Stability Theory and the Impact of Order.",
                    "On Counting Logics and Local Properties.",
                    "On the Boundedness Problem for Two-Variable First-Order Logic.",
                    "Fragments of Existential Second-Order Logic without 0-1 Laws."
                ]
            }
        ]
    },
    {
        "year": "1997",
        "name": "12th LICS 1997",
        "info": "Warsaw, Poland",
        "venues": [
            {
                "sub_name_abbr": "conf/lics/1997",
                "sub_name": "Proceedings, 12th Annual IEEE Symposium on Logic in Computer Science, Warsaw, Poland, June 29 - July 2, 1997.",
                "count": 39,
                "papers": [
                    "Combination of Compatible Reduction Orderings that are Total on Ground Terms.",
                    "Automata-Driven Automated Induction.",
                    "Ground Reducibility is EXPTIME-Complete.",
                    "Strong Normalization of Explicit Substitutions via Cut Elimination in Proof Nets (Extended Abstract).",
                    "Temporal Linear Logic Specifications for Concurrent Processes (Extended Abstract).",
                    "Full Abstraction for Functional Languages with Control.",
                    "Believe it or not, AJM's Games Model is a Model of Classical Linear Logic.",
                    "Games and Definability for System F.",
                    "Boolean Expression Diagrams (Extended Abstract).",
                    "How Much Memory is Needed to Win Infinite Games?",
                    "Quantitative Analysis and Model Checking.",
                    "A Partially Deadlock-Free Typed Process Calculus.",
                    "Unique Fixpoint Induction for Value-Passing Processes (Extended Abstract).",
                    "Bisimulation for Labelled Markov Processes.",
                    "A Kleene Theorem for Timed Automata.",
                    "Automata, Tableaus and a Reduction Theorem for Fixpoint Calculi in Arbitrary Complete Lattices.",
                    "An Expressively Complete Linear Time Temporal Logic for Mazurkiewicz Traces.",
                    "On the Complexity of Reasoning in Kleene Algebra.",
                    "On the Forms of Locality over Finite Models.",
                    "Large Finite Structures with Few Lk-Types.",
                    "First-Order Logic with Two Variables and Unary Temporal Logic.",
                    "The Monadic Quantifier Alternation Hierarchy over Graphs is Infinite.",
                    "Semantics of Exact Real Arithmetic.",
                    "A Relational Account of Call-by-Value Sequentiality.",
                    "Complete Cuboidal Sets in Axiomatic Domain Theory.",
                    "Towards a Mathematical Operational Semantics.",
                    "The \"Hardest\" Natural Decidable Theory.",
                    "Two-Variable Logic with Counting is Decidable.",
                    "Complexity of Two-Variable Logic with Counting.",
                    "Complexity of Power Default Reasoning.",
                    "On the Cubic Bottleneck in Subtyping and Flow Analysis.",
                    "The Complexity of Subtype Entailment for Simple Types.",
                    "Set Constraints with Intersection.",
                    "Induction and Recursion on the Partial Real Line via Biquotients of Bifree Algebras.",
                    "Continuation Models are Universal for Lambda-Mu-Calculus.",
                    "Discrimination by Parallel Observers.",
                    "Ramified Higher-Order Unification.",
                    "Linear Higher-Order Pre-Unification.",
                    "A Logic for Reasoning with Higher-Order Abstract Syntax."
                ]
            }
        ]
    },
    {
        "year": "1996",
        "name": "11th LICS 1996",
        "info": "New Brunswick, New Jersey, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/lics/1996",
                "sub_name": "Proceedings, 11th Annual IEEE Symposium on Logic in Computer Science, New Brunswick, New Jersey, USA, July 27-30, 1996.",
                "count": 49,
                "papers": [
                    "A Generalization of Fagin's Theorem.",
                    "DATALOG SIRUPs Uniform Boundedness is Undecidable.",
                    "On the Structure of Queries in Constraint Query Languages.",
                    "A Fully Abstract Domain Model for the pi-Calculus.",
                    "A Fully-Abstract Model for the pi-Calculus (Extended Abstract).",
                    "Higher Dimensional Transition Systems.",
                    "An Algebraic Theory of Process Efficiency.",
                    "The Subtyping Problem for Second-Order Types is Undecidable.",
                    "Subtyping Dependent Types (Summary).",
                    "Reduction-Free Normalisation for a Polymorphic System.",
                    "An Until Hierarchy for Temporal Logic.",
                    "Locally Linear Time Temporal Logic.",
                    "A Modal Mu-Calculus for Durational Transition Systems.",
                    "Tarskian Set Constraints.",
                    "Reasoning about Local Variables with Operationally-Based Logical Relations.",
                    "The Essence of Parallel Algol.",
                    "Games and Full Abstraction for FPC.",
                    "A Temporal-Logic Approach to Binding-Time Analysis.",
                    "Symbolic Protocol Verification With Queue BDDs.",
                    "Reactive Modules.",
                    "Model-Checking of Correctness Conditions for Concurrent Objects.",
                    "A Semantic View of Classical Proofs: Type-Theoretic, Categorical, and Denotational Characterizations (Preliminary Extended Abstract).",
                    "Syntactic Considerations on Recursive Types.",
                    "On the Expressive Power of Simply Typed and Let-Polymorphic Lambda Calculi.",
                    "A Linear Logical Framework.",
                    "The Theory of Hybrid Automata.",
                    "Partial-Order Methods for Model Checking: From Linear Time to Branching Time.",
                    "Efficient Model Checking via the Equational µ-Calculus.",
                    "General Decidability Theorems for Infinite-State Systems.",
                    "Relating Word and Tree Automata.",
                    "More About Recursive Structures: Descriptive Complexity and Zero-One Laws.",
                    "On the Expressive Power of Variable-Confined Logics.",
                    "Zero-One Laws for Gilbert Random Graphs.",
                    "The Scott Topology Induces the Weak Topology.",
                    "Integration in Real PCF.",
                    "Game Semantics & Abstract Machines.",
                    "Semantics of Normal Logic Programs and Contested Information.",
                    "Linear Logic, Monads and the Lambda Calculus.",
                    "Order-Incompleteness and Finite Lambda Models (Extended Abstract).",
                    "Confluence and Preservation of Strong Normalisation in an Explicit Substitutions Calculus.",
                    "Completing Partial Combinatory Algebras With Unique Head-Normal Forms.",
                    "Complexity Analysis Based on Ordered Resolution.",
                    "Solving Linear Equations over Polynomial Semirings.",
                    "Basic Paramodulation and Decidable Theories (Extended Abstract).",
                    "Counting Modulo Quantifiers on Finite Linearly Ordered Trees.",
                    "Simultaneous E-Unification and Related Algorithmic Problems.",
                    "Decidability Problems for the Prenex Fragment of Intuitionistic Logic.",
                    "On the Complexity of Abduction.",
                    "Decision Problems for Semi-Thue Systems with a Few Rules."
                ]
            }
        ]
    },
    {
        "year": "1995",
        "name": "10th LICS 1995",
        "info": "San Diego, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/lics/1995",
                "sub_name": "Proceedings, 10th Annual IEEE Symposium on Logic in Computer Science, San Diego, California, USA, June 26-29, 1995.",
                "count": 48,
                "papers": [
                    "A Complete Proof Systems for QPTL.",
                    "Completeness of Kozen's Axiomatisation of the Propositional mu-Calculus.",
                    "Once and For All.",
                    "Complete Proof Systems for First Order Interval Temporal Logic.",
                    "The Infinitary Logic of Sparse Random Graphs.",
                    "Generalized Quantifiers and 0-1 Laws.",
                    "Relativized Logspace and Generalized Quantifiers over Finite Structures.",
                    "First-order Queries on Finite Structures over the Reals.",
                    "Model-Checking of Causality Properties.",
                    "On the Complexity of Modular Model Checking.",
                    "Timing Behavior Analysis for Real-Time Systems.",
                    "On the Verification Problem of Nonregular Properties for Nonregular Processes.",
                    "The Semantic Challenge of Verilog HDL.",
                    "Uniform Proofs and Disjunctive Logic Programming (Extended Abstract).",
                    "Structural Cut Elimination.",
                    "Paramodulation without Duplication.",
                    "Complexity of Normal Default Logic and Related Modes of Nonmonotonic Reasoning.",
                    "Control Structures.",
                    "Configuration Structures.",
                    "A Typed Calculus of Synchronous Processes.",
                    "Modal mu-Types for Processes.",
                    "Games and Full Abstraction for the Lazy lambda-Calculus.",
                    "Domain Theory in Stochastic Processes.",
                    "A Fully Abstract Semantics for a Concurrent Functional Language with Monadic Types.",
                    "Experience with Type Theory as a Foundation for Computer Science.",
                    "Equality between Functionals in the Presence of Coproducts.",
                    "A Logic of Subtyping (Extended Abstract).",
                    "Normalization and Extensionality (Extended Abstract).",
                    "New Notions of Reduction and Non-Semantic Proofs of beta-Strong Normalization in Typed lambda-Calculi.",
                    "Finitely Monotone Properties.",
                    "Tree Canonization and Transitive Closure.",
                    "Ptime Canonization for Two Variables with Counting.",
                    "When Do Fixed Point Logics Capture Complexity Classes?",
                    "Higher-Order Unification via Explicit Substitutions (Extended Abstract).",
                    "Orderings, AC-Theories and Symbolic Constraint Solving (Extended Abstract).",
                    "Efficient On-the-Fly Model Checking for CTL*.",
                    "Partial Model Checking (Extended Abstract).",
                    "Hardware Verification, Boolean Logic Programming, Boolean Functional Programming.",
                    "Compositionality via Cut-Elimination: Hennessy-Milner Logic for an Arbitrary GSOS.",
                    "Compositional Testing Preorders for Probabilistic Processes.",
                    "The Stone Gamut: A Coordinatization of Mathematics.",
                    "Logically Presented Domains.",
                    "Games Semantics for Full Propositional Linear Logic.",
                    "Decision Problems for Second-Order Linear Logic.",
                    "The Complexity of Neutrals in Linear Logic.",
                    "Decidability of Linear Affine Logic.",
                    "Origins and Metamorphoses of the Trinity: Logic, Nets, Automata.",
                    "Sequentiality, Second Order Monadic Logic and Tree Automata."
                ]
            }
        ]
    },
    {
        "year": "1994",
        "name": "9th LICS 1994",
        "info": "Paris, France",
        "venues": [
            {
                "sub_name_abbr": "conf/lics/1994",
                "sub_name": "Proceedings of the Ninth Annual Symposium on Logic in Computer Science (LICS '94), Paris, France, July 4-7, 1994.",
                "count": 53,
                "papers": [
                    "Terms, Proofs, and Refinement (Extended abstract).",
                    "McColm's Conjecture.",
                    "The Expressive Power of Finitely Many Generalized Quantifiers.",
                    "Generalized Quantifiers for Simple Properties.",
                    "How to Define a Linear Order on Finite Models.",
                    "Finitary Fairness.",
                    "Bisimulation is Not Finitely (First Order) Equationally Axiomatisable.",
                    "Foundations of Timed Concurrent Constraint Programming.",
                    "A Fully Abstract Semantics for Concurrent Graph Reduction.",
                    "An Axiomatization of Computationally Adequate Domain Theoretic Models of FPC.",
                    "On Strong Stability and Higher-Order Sequentiality.",
                    "Linear Types, Approximation, and Topology.",
                    "Domain Theory and Integration.",
                    "Automatic Verification of Finite-State Concurrent Systems.",
                    "Negative Set Constraints with Equality.",
                    "Systems of Set Constraints with Negative Constraints are NEXPTIME-Complete.",
                    "A Compositional Proof System for the Modal mu-Calculus.",
                    "On the Parallel Complexity of Model Checking in the Modal Mu-Calculus.",
                    "Complexity Transfer for Modal Logic (Extended Abstract).",
                    "Typability and Type-Checking in the Second-Order lambda-Calculus are Equivalent and Undecidable.",
                    "Efficient Inference of Object Types.",
                    "Type Inference and Extensionality.",
                    "The Groupoid Model Refutes Uniqueness of Identity Proofs.",
                    "A Non-Elementary Speed-Up in Proof Length by Structural Clause Form Transformation.",
                    "Upper and Lower Bounds for Tree-Like Cutting Planes Proofs.",
                    "The Power of Reflective Relational Machines.",
                    "A Syntactic Characterization of NP-Completeness.",
                    "The Declarative Semantics of the Prolog Selection Rule.",
                    "Semantics of Meta-Logic in an Algebra of Programs.",
                    "A Multiple-Conclusion Meta-Logic.",
                    "Proof Search in First-Order Linear Logic and Other Cut-Free Sequent Calculi.",
                    "Linear Logic, Totality and Full Completeness.",
                    "The Emptiness Problem for Intersection Types.",
                    "Subtyping and Parametricity.",
                    "On the Church-Rosser Property for Expressive Type Systems and its Consequences for their Metatheoretic Study.",
                    "A Semantics of Object Types.",
                    "Passivity and Independence.",
                    "A General Semantics for Evaluation Logic.",
                    "Reflexive Graphs and Parametric Polymorphism.",
                    "Categories, Allegories and Circuit Design.",
                    "Rewrite Techniques for Transitive Relations.",
                    "Normalised Rewriting and Normalised Completion.",
                    "Modularity of Strong Normalization and Confluence in the algebraic-lambda-Cube.",
                    "Cyclic Lambda Graph Rewriting.",
                    "Paths in the lambda-calculus.",
                    "A Trace Based Extension of Linear Time Temporal Logic.",
                    "Axioms for Knowledge and Time in Distributed Systems with Perfect Recall.",
                    "Compositional Verification of Real-Time Systems.",
                    "Logical Bilattices and Inconsistent Data.",
                    "a modal logic for subjective default reasoning.",
                    "Language Completeness of the Lambek Calculus.",
                    "Rigid E-Unifiability is DEXPTIME-Complete.",
                    "Higher-Order Narrowing."
                ]
            }
        ]
    },
    {
        "year": "1993",
        "name": "8th LICS 1993",
        "info": "Montreal, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/lics/1993",
                "sub_name": "Proceedings of the Eighth Annual Symposium on Logic in Computer Science (LICS '93), Montreal, Canada, June 19-23, 1993.",
                "count": 42,
                "papers": [
                    "The Genericity Theorem and the Notion of Parametricity in the Polymorphic lambda-calculus (Extended Abstract).",
                    "Standard ML-NJ weak polymorphism and imperative constructs.",
                    "A lambda calculus of objects and method specialization.",
                    "Strong Normalization for Second Order Classical Natural Deduction.",
                    "Automated Production of Traditional Proofs for Constructive Geometry Theorems.",
                    "On the Unification Problem for Cartesian Closed Categories.",
                    "Functional Unification of Higher-Order Patterns.",
                    "Set Constraints are the Monadic Class.",
                    "Relational Properties of Recursively Defined Domains.",
                    "Full Abstraction for a Shared Variable Parallel Language.",
                    "A Coinduction Principle for Recursive Data Types Based on Bisimulation.",
                    "A Tutorial on Finite Model Theory (Abstract).",
                    "In and Out of Temporal Logic.",
                    "On Completeness of the mu-calculus.",
                    "On Model Checking for Real-Time Properties with Durations.",
                    "Verifying Programs with Unreliable Channels.",
                    "y = 2x vs. y = 3x.",
                    "Monadic Second-Order Logic and Hypergraph Orientation.",
                    "Infinitary Logics and Very Sparse Random Graphs.",
                    "Asymptotic Probabilities of Languages with Generalized Quantifiers.",
                    "Compositional Analysis for Concurrent Constraint Programming.",
                    "Rules of Definitional Reflection.",
                    "Encoding the Calculus of Constructions in a Higher-Order Logic.",
                    "Programs, grammars and arguments: a personal view of some connections between computation, language and logic.",
                    "Imperfect information flow.",
                    "A Typed Pattern Calculus.",
                    "Non-Determinism in a Functional Setting.",
                    "Adequacy for untyped translations of typed lambda-calculi.",
                    "Local and asynchronous beta-reduction (an analysis of Girard's execution formula).",
                    "An Exponential Separation between the Matching Principle and the Pigeonhole Principle.",
                    "Some Desirable Conditions for Feasible Functionals of Type~2.",
                    "Database Query Languages Embedded in the Typed Lambda Calculus.",
                    "Homomorphic Tree Embeddings and Their Applications to Recursive Program Optimization.",
                    "The order types of termination orderings on monadic terms, strings and multisets.",
                    "The Unifiability Problem in Ground AC Theories.",
                    "Type Theory and Recursion (Extended Abstract).",
                    "Typing and Subtyping for Mobile Processes.",
                    "Decomposability, Decidability and Axiomatisability for Bisimulation Equivalence on Basic Parallel Processes.",
                    "A Fully Abstract Denotational Model for Higher-Order Processes (Extended Abstract).",
                    "Self-Synchronization of Concurrent Processes (Preliminary Report).",
                    "Bisimulation and open maps.",
                    "Lambek Grammars Are Context Free."
                ]
            }
        ]
    },
    {
        "year": "1992",
        "name": "7th LICS 1992",
        "info": "Santa Cruz, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/lics/1992",
                "sub_name": "Proceedings of the Seventh Annual Symposium on Logic in Computer Science (LICS '92), Santa Cruz, California, USA, June 22-25, 1992.",
                "count": 44,
                "papers": [
                    "Third Order Matching is Decidable.",
                    "Double-exponential Complexity of Computing a Complete Set of AC-Unifiers.",
                    "Random Worlds and Maximum Entropy.",
                    "Minimal Model Semantics for Nonmonotonic Modal Logics.",
                    "Fixpoint Logic vs. Infinitary Logic in Finite-Model Theory.",
                    "Deterministic vs. Nondeterministic Transitive Closure Logic.",
                    "Axiomatizable Classes of Finite Models and Definability of Linear Order.",
                    "An abstract standardisation theorem.",
                    "A Constructive Formalization of the Catch and Throw Mechanism.",
                    "A Computational Analysis of Girard's Translation and LC.",
                    "The Lazy Lambda Calculus in a Concurrency Scenario (Extended Abstract).",
                    "Specification in Software Development.",
                    "Turning SOS Rules into Equations.",
                    "A Calculus of Dataflow Networks (Extended Abstract).",
                    "Asynchronous Communication in Process Algebra.",
                    "Equivalences on Observable Processes.",
                    "The Type and Effect Discipline.",
                    "Disjunctive Strictness Analysis.",
                    "References, Local Variables and Operational Reasoning.",
                    "Horn Programming in Linear Logic Is NP-Complete.",
                    "New Foundations for the Geometry of Interaction.",
                    "Linear Logic Without Boxes.",
                    "Operational aspects of linear lambda calculus.",
                    "Origins of the Calculus of Binary Relations.",
                    "Decidable Problems in Shallow Equational Theories (Extended Abstract).",
                    "Monadic Theory of Term Rewritings.",
                    "Strong Sequentiality of Left-Linear Overlapping Term Rewriting Systems.",
                    "There is No Recursive Axiomatization for Feasible Functionals of Type~2.",
                    "Cutting Planes and constant depth Frege proofs.",
                    "Subtype Inequalities.",
                    "An Engine for Logic Program Analysis.",
                    "Solving Systems of Set Constraints (Extended Abstract).",
                    "The Category of Constraint Systems is Cartesian-Closed.",
                    "Generalized Quantifiers and Pebble Games on Finite Structures.",
                    "Logical Hierarchies in PTIME.",
                    "Zero-One Laws for Modal Logic.",
                    "Progress Measures, Immediate Determinacy, and a Subset Construction for Tree Automata.",
                    "Symbolic Model Checking for Real-time Systems.",
                    "Compiler Verification in LF.",
                    "Mixing List Recursion and Arithmetic.",
                    "Observable Algorithms on Concrete Data Structures.",
                    "Functorial Parametricity.",
                    "The Church-Rosser Property for beta-eta-reduction in Typed lambda-Calculi.",
                    "Retracts in simply typed lambda-beta-eta-calculus."
                ]
            }
        ]
    },
    {
        "year": "1991",
        "name": "6th LICS 1991",
        "info": "Amsterdam, The Netherlands",
        "venues": [
            {
                "sub_name_abbr": "conf/lics/1991",
                "sub_name": "Proceedings of the Sixth Annual Symposium on Logic in Computer Science (LICS '91), Amsterdam, The Netherlands, July 15-18, 1991.",
                "count": 40,
                "papers": [
                    "A Foundational Delineation of Computational Feasiblity.",
                    "Towards a Semantics for the QUEST Language.",
                    "Term Declaration Logic and Generalised Composita.",
                    "Logic Programming in a Fragment of Intuitionistic Linear Logic.",
                    "Games Semantics for Linear Logic.",
                    "Linearizing Intuitionistic Implication.",
                    "Some Results on the Interpretation of lambda-calculus in Operator Algebras.",
                    "Unification and Anti-Unification in the Calculus of Constructions.",
                    "Partial Objects in the Calculus of Constructions.",
                    "An Evaluation Semantics for Classical Proofs.",
                    "A Theory of Testing for Real-Time.",
                    "Complexity Bounds of Hoare-style Proof Systems.",
                    "Semantics of Pointers, Referencing and Dereferencing with Intensional Logic.",
                    "Sequentiality and Strong Stability.",
                    "Parallel PCF Has a Unique Extensional Model.",
                    "The Fixed Point Property in Synthetic Domain Theory.",
                    "On Computational Open-Endedness in Martin-Löf's Type Theory.",
                    "Predicative Type Universes and Primitive Recursion.",
                    "Freyd's Hierarchy of Combinator Monoids.",
                    "Equational Prgoramming in lambda-calculus.",
                    "An Inverse of the Evaluation Functional for Typed lambda-calculus.",
                    "A Completeness Theorem for Kleene Algebras and the Algebra of Regular Events.",
                    "On First Order Database Query Languages.",
                    "Specifying and Proving Serializability in Temporal Logic.",
                    "CCS with Priority Choice.",
                    "Rabin Measures and Their Applications to Fairness and Automata Theory.",
                    "Specification and Refinement of Probabilistic Processes.",
                    "On the 0-1 Law for the class of Existential Second Order Minimal Gödel Sentences with Equality.",
                    "On the Deduction Rule and the Number of Proof Lines.",
                    "Logic Programs as Types for Logic Programs.",
                    "A First-Order Theory of Types and Polymorphism in Logic Programming.",
                    "Prop revisited: Propositional Formula as Abstract Domain for Groundness Analysis.",
                    "Constructive Negation for Constraint Logic Programming.",
                    "Higher-Order Critical Pairs.",
                    "A Computation Model for Executable Higher-Order Algebraic Specification Languages.",
                    "Defaults and Revision in Structured Theories.",
                    "Actions Speak Louder than Words: Proving Bisimilarity for Context-Free Processes.",
                    "On the Relationship Between Process Algebra and Input/Output Automata.",
                    "A Compositional Proof System for Dynamic Process Creation.",
                    "A Partial Approach to Model Checking."
                ]
            }
        ]
    },
    {
        "year": "1990",
        "name": "5th LICS 1990",
        "info": "Philadelphia, Pennsylvania, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/lics/1990",
                "sub_name": "Proceedings of the Fifth Annual Symposium on Logic in Computer Science (LICS '90), Philadelphia, Pennsylvania, USA, June 4-7, 1990.",
                "count": 46,
                "papers": [
                    "Type Reconstruction in Finite-Rank Fragments of the Polymorphic lambda-Calculus (Extended Summary).",
                    "Polymorphism, Set Theory, and Call-by-Value.",
                    "Universal Domains in the Theory of Denotational Semantics of Programming Languages.",
                    "The Classification of Continuous Domains (Extended Abstract).",
                    "A Decision Procedure for a Class of Set Constraints (Extended Abstract).",
                    "A Constraint Sequent Calculus.",
                    "Solving Inequations in Term Algebras (Extended Abstract).",
                    "The Dynamic Logic of Permission.",
                    "A Theory of Nonmonotonic Rule Systems.",
                    "The Semantics of Reflected Proof.",
                    "Equation Solving Using Modal Transition Systems.",
                    "Three Logics for Branching Bisimulation (Extended Abstract).",
                    "Reactive, Generative, and Stratified Models of Probabilistic Processes.",
                    "The Nonexistence of Finite Axiomatisations for CCS Congruences.",
                    "0-1 Laws for Infinitary Logics (Preliminary Report).",
                    "Implicit Definability on Finite Structures and Unambiguous Computations (Preliminary Report).",
                    "ALOGTIME and a Conjecture of S. A. Cook (Extended Abstract).",
                    "On the Expression of Monadic Second-Order Graph Properties Without Quantifications Over Sets of Edges (Extended Abstract).",
                    "Normal Process Representatives.",
                    "A Categorical Linear Framework for Petri Nets.",
                    "A Linear Semantics for Allowed Logic Programs.",
                    "Programming in Equational Logic: Beyond Strong Sequentiality.",
                    "The Theory of Ground Rewrite Systems is Decidable.",
                    "Well Rewrite Orderings.",
                    "A Constructive Proof of Higman's Lemma.",
                    "Syntactic Theories and Unification.",
                    "Proof Transformations for Equational Theories.",
                    "A New AC Unification Algorithm with an Algorithm for Solving Systems of Diophantine Equations.",
                    "On Subsumption and Semiunification in Feature Algebras.",
                    "Completeness for typed lazy inequalities.",
                    "Conditional Lambda-Theories and the Verification of Static Properties of Programs.",
                    "Single-Threaded Polymorphic Lambda Calculus.",
                    "Extensional PERs.",
                    "A Per Model of Polymorphism and Recursive Types.",
                    "Effective Domains and Intrinsic Structure.",
                    "A Logic of Concrete Time Intervals (Extended Abstract).",
                    "Real-time Logics: Complexity and Expressiveness.",
                    "Explicit Clock Temporal Logic.",
                    "Model-Checking for Real-Time Systems.",
                    "Symbolic Model Checking: 10^20 States and Beyond.",
                    "When is \"Partial\" Adequate? A Logic-Based Proof Technique Using Partial Specifications.",
                    "Modelling Shared State in a Shared Action Model.",
                    "On the Limits of Efficient Temporal Decidability (Extended Abstract).",
                    "On the Power of Bounded Concurrency~III: Reasoning About Programs (Preliminary Report).",
                    "New Foundations for Fixpoint Computations.",
                    "Recursive Types Reduced to Inductive Types."
                ]
            }
        ]
    },
    {
        "year": "1989",
        "name": "4th LICS 1989",
        "info": "Pacific Grove, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/lics/1989",
                "sub_name": "Proceedings of the Fourth Annual Symposium on Logic in Computer Science (LICS '89), Pacific Grove, California, USA, June 5-8, 1989.",
                "count": 41,
                "papers": [
                    "Domains and Logics (Extended Abstract).",
                    "Non-trivial Power Types Can't Be Subtypes of Polymorphic Types.",
                    "Computational Lambda-Calculus and Monads.",
                    "Computing with Recursive Types (Extended Abstract).",
                    "Stratified Polymorphism (Extended Summary).",
                    "Proof Theory and Semantics of Logic Programs.",
                    "Negation As Refutation.",
                    "Fixpoint Extensions of First-Order Logic and Datalog-Like Languages.",
                    "PARTHENON: A Parallel Theorem Prover for Non-Horn Clauses.",
                    "Type Inference for Record Concatenation and Multiple Inheritance.",
                    "Computational Consequences and Partial Solutions of a Generalized Unification Problem (Partial Report).",
                    "How Complete is PER?",
                    "Inheritance and Explicit Coercion (Preliminary Report).",
                    "Emil Post's Contributions to Computer Science.",
                    "Towards Action-Refinement in Process Algebras.",
                    "A Small Universal Model for System Executions.",
                    "A Game-Theoretic Modeling of Concurrency.",
                    "Nets and Data Flow Interpreters.",
                    "Axiomatizing Net Computations and Processes.",
                    "A Probabilistic Powerdomain of Evaluations.",
                    "Equality In Lazy Computation Systems.",
                    "Extending the Lambda Calculus with Surjective Pairing is Conservative.",
                    "Faithful Ideal Models for Recursive Polymorphic Types.",
                    "Structure and Representation in LF.",
                    "The Mathematics of Nonmonotonic Reasoning (Abstract).",
                    "On the Complexity of Epistemic Reasoning.",
                    "RI: A Logic for Reasoning with Inconsistency.",
                    "Non-Well-Founded Sets Obtained from Ideal Fixed Points.",
                    "On Substitutional Recursion Over Non-Well-Founded Sets.",
                    "Axiomatizing Operational Equivalence in the Presence of Side Effects.",
                    "A Fully Abstract Semantics for a Functional Language with Logic Variables.",
                    "Unified Algebras and Institutions.",
                    "Elf: A Language for Logic Definition and Verified Metaprogramming.",
                    "Some Complexity Bounds for Dynamic Logics.",
                    "On Simultaneously Determinizing and Complementing omega-Automata (Extended Abstract).",
                    "mu-Definable Sets of Integers.",
                    "Compositional Model Checking.",
                    "Characterizing Complexity Classes By Higher Type Primitive Recursive Definitions.",
                    "Polynomially Grade Logic I: A Graded Version of System T.",
                    "ECC, an Extended Calculus of Constructions.",
                    "A Sufficient Condition for the Termination of the Direct Sum of Term Rewriting Systems."
                ]
            }
        ]
    },
    {
        "year": "1988",
        "name": "3rd LICS 1988",
        "info": "Edinburgh, Scotland",
        "venues": [
            {
                "sub_name_abbr": "conf/lics/1988",
                "sub_name": "Proceedings of the Third Annual Symposium on Logic in Computer Science (LICS '88), Edinburgh, Scotland, UK, July 5-8, 1988.",
                "count": 43,
                "papers": [
                    "0-1 Laws and Decision Problems for Fragments of Second-Order Logic.",
                    "An Algebra and a Logic for NC¹.",
                    "Proving unprovability.",
                    "Partial Correctness of C-MOS Switching Circuits: An Exercise in Applied Logic.",
                    "A Modest Model of Records, Inheritance and Bounded Quantification.",
                    "A fixed point extension of the second order lambda-calculus: observable equivalences and models.",
                    "Characterization of typings in polymorphic type discipline.",
                    "On the Computational Power of Universally Polymorphic Recursion.",
                    "Combining Algebra and Higher-Order Types.",
                    "Characterizing X-Separability and One-Side Invertibility in lambda-beta-Omega-Calculus.",
                    "Proof-Theoretic Techniques for Term Rewriting Theory.",
                    "Efficient Parallel Algorithms for Anti-Unification and Relative Complement.",
                    "Unification in Free Extensions of Boolean Rings and Abelian Groups.",
                    "Corrigendum: Complete Type Inference for Simple Objects.",
                    "On the Consistency of \"Truly Concurrent\" Operational and Denotational Semantics (Extended Abstract).",
                    "A Category of Labelled Petri Nets and Compositional Proof System (Extended Abstract).",
                    "Petri Nets Are Monoids: A New Algebraic Foundation for Net Theory.",
                    "The Existence of Refinement Mappings.",
                    "Relevance Logic and Concurrent Composition.",
                    "Bisimulations and Divergence.",
                    "Priorities in Process Algebras.",
                    "A Modal Process Logic.",
                    "On the Arithmetic Inexpressiveness of Term Rewriting Systems.",
                    "Rigid E-Unification is NP-Complete.",
                    "Proof by Consistency in Equational Theories.",
                    "Semantical Paradigms: Notes for an Invited Lecture, with Two Appendices by Stavros S. Cosmadakis.",
                    "Categories of Embeddings.",
                    "A Categorical Semantics of Constructions.",
                    "Semantic Parametricity in Polymorphic Lambda Calculus.",
                    "Can LCF Be Topped? Flat Lattice models of Typed Lambda Calculus (Preliminary Report).",
                    "The Topology of Program Termination.",
                    "Coherence and Consistency in Domains (Extended Outline).",
                    "Fully Abstract Denotational Semantics for Flat Concurrent Prolog.",
                    "Proving Termination Properties of Prolog Programs: A Semantic Approach.",
                    "Complete Axiomatizations of the Algebras of Finite, Rational and Infinite Trees.",
                    "Computational Foundations of Basic Recursive Function Theory.",
                    "Notational definition-a formal account.",
                    "The Strength of the Subset Type in Martin-Löf's Type Theory.",
                    "The notion of a Framework and a framework for LTC.",
                    "Fixed Points vs. Infinite Generation.",
                    "A Logic for Reasoning about Probabilities.",
                    "Weak Alternating Automata Give a Simple Explanation of Why Most Temporal and Dynamic Logics are Decidable in Exponential Time.",
                    "On the Existence of Effective Hoare Logics."
                ]
            }
        ]
    },
    {
        "year": "1987",
        "name": "2nd LICS 1987",
        "info": "Ithaca, New York, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/lics/1987",
                "sub_name": "Proceedings of the Symposium on Logic in Computer Science (LICS '87), Ithaca, New York, USA, June 22-25, 1987.",
                "count": 37,
                "papers": [
                    "Some Uses of Maximal Fixed Points (Abstract of Invited Lecture).",
                    "Polymorphism is conservative over simple types (Preliminary Report).",
                    "Order-Sorted Algebra solves the Constructor-Selector, Multiple.",
                    "Recursive Types and Type Constraints in Second-Order Lambda Calculus.",
                    "Complete Type Inference for Simple Objects.",
                    "Domain Theory in Logical Form.",
                    "On the Formal Semantics of Statecharts (Extended Abstract).",
                    "Modelling Computations: A 2-Categorical Framework.",
                    "Partial Order Models of Concurrency and the Computation of Functions.",
                    "Minimalism subsumes Default Logic and Circumscription in Stratified Logic Programming.",
                    "Hereditary Harrop Formulas and Uniform Proof Systems.",
                    "Undecidable Optimization Problems for Database Logic Programs.",
                    "Conjunctive Types and Algol-like Languages.",
                    "The Power of Temporal Proofs.",
                    "Proving Boolean Combinations of Deterministic Properties.",
                    "Reasoning with Many Processes.",
                    "On the Eventuality Operator in Temporal Logic.",
                    "Verification of Concurrent Programs: The Automata-Theoretic Framework.",
                    "First-order Predicate Logic as a Common Basis for Relational and Functional Programming (Abstract).",
                    "Partial Objects In Constructive Type Theory.",
                    "A Framework for Defining Logics.",
                    "The Computational Behaviour of Girard's Paradox.",
                    "A Non-Type-Theoretic Definition of Martin-Löf's Types.",
                    "The Hierarchy of Finitely Typed Functional Programs (Short Version).",
                    "Definability with Bounded Number of Bound Variables.",
                    "On Chain Logic, Path Logic, and First-Order Logic over Infinite Trees.",
                    "Full Abstraction and Expressive Completenes for FP.",
                    "A Semantical Approach to Nonmonotic Logics.",
                    "I'm OK if You're OK: On the Notion of Trusting Communication.",
                    "Hoare Logic for Lambda-Terms as Basis of Hoare Logic for Imperative Languages.",
                    "Kripke-Style models for typed lambda calculus.",
                    "Some Semantic Aspects of Polymorphic Lambda Calculus.",
                    "X-Separability and Left-Invertibility in lambda-calculus.",
                    "Inference Rules for Rewrite-Based First-Order Theorem Proving.",
                    "Theorem Proving Using Rigid E-Unification Equational Matings.",
                    "Solving Disequations.",
                    "Decidability of the Confluence of Ground Term Rewriting Systems."
                ]
            }
        ]
    },
    {
        "year": "1986",
        "name": "1st LICS 1986",
        "info": "Cambridge, Massachusetts, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/lics/1986",
                "sub_name": "Proceedings of the Symposium on Logic in Computer Science (LICS '86), Cambridge, Massachusetts, USA, June 16-18, 1986.",
                "count": 42,
                "papers": [
                    "Merging Functional with Relational Programming in a Reduction Setting (Abstract of an Invited Lecture).",
                    "Program Correctness on Finite Fields.",
                    "True Relative Completeness of an Axiom System for the Language L4 (Abridged).",
                    "Towards Deductive Synthesis of Dataflow Networks.",
                    "A Complete Logical Calculus for Record Structures Representing Linguistic Information.",
                    "Floyd-Hoare Logic Defines Semantics: Preliminary Version.",
                    "An Algebraic Model of Parallel Execution of Logic Programs.",
                    "A Semantically Based Proof System for Partial Correctness and Deadlock in CSP.",
                    "A Sheaf-Theoretic Model of Concurrency.",
                    "Strong Bisimulation of State Automata.",
                    "Algorithm Development in the Calculus of Constructions.",
                    "How Uncomputable is General Circumscription? (Extended Abstract).",
                    "The Design and Implementations of Intuit.",
                    "Equivalence of First Order LISP Programs. Proving Properties of Destructive Programs via Transformation.",
                    "A Logician Looks at Expert Systems: Areas for Mathematical Research (Abstract of Invited Lecture).",
                    "The Finitary Projection Model for Second Order Lambda Calculus and Solutions to Higher Order Domain Equations.",
                    "Reasoning with Continuations.",
                    "The Largest First-Order-Axiomatizable Cartesian Closed Category of Domains.",
                    "Good Rewrite Strategies for FP.",
                    "The Denotional Semantics of Nondeterministic Recursive Programs using Coherent Relations.",
                    "A Timely Resolution.",
                    "On Mechanical Theorem Proving in Minkowskian Plane Geometry.",
                    "Proof of Translation in Natural Semantics.",
                    "Computing Unification Algorithms.",
                    "Type inference and logical relations.",
                    "An Analysis of Girard's Paradox.",
                    "Formalized Metareasoning in Type Theory.",
                    "Infinite Objects in Type Theory.",
                    "Quantitative and Qualitative Semantics (Abstract of Invited Lecture).",
                    "An Improved Algorithm for the Automatic Verification of Finite State Systems Using Temporal Logic.",
                    "Efficient Model Checking in Fragments of the Propositional Mu-Calculus (Extended Abstract).",
                    "A Propositional Model Logic of Time Intervals.",
                    "On the Equivalence of Weak Second Order and Nonstandard Time Semantics For Various Program Verification Systems.",
                    "Automata on the Integers, Recurrence Distinguishability, and the Equivalence and Decidability of Monadic Theories.",
                    "A Choppy Logic.",
                    "Levels of Knowledge in Distributed Computing.",
                    "Probabilistic Verification by Tableaux.",
                    "An Automata-Theoretic Approach to Automatic Program Verification (Preliminary Report).",
                    "Orderings for Equational Proofs.",
                    "Automatic Proofs by Induction in Equational Theories Without Constructors.",
                    "Inductive Reasoning with Incomplete Specifications (Preliminary Report).",
                    "On Translating Lambda Terms into Combinators; The Basis Problem."
                ]
            }
        ]
    }
]