[
    {
        "name": "LMCS",
        "year": "2021",
        "info": "Volume 17: 2021",
        "count": 48,
        "papers": [
            "Axiomatizing Maximal Progress and Discrete Time.",
            "Tameness in least fixed-point logic and McColm's conjecture.",
            "2-adjoint equivalences in homotopy type theory.",
            "On the Strong Equivalences for LPMLN Programs.",
            "Definable decompositions for graphs of bounded linear cliquewidth.",
            "Modal Logics for Nominal Transition Systems.",
            "Solvability = Typability + Inhabitation.",
            "Correct and Efficient Antichain Algorithms for Refinement Checking.",
            "Computing Probabilistic Bisimilarity Distances for Probabilistic Automata.",
            "Determinacy in Discrete-Bidding Infinite-Duration Games.",
            "Axiomatization of betweenness in order-theoretic trees.",
            "Robustness Against Transactional Causal Consistency.",
            "Convolution Algebras: Relational Convolution, Generalised Modalities and Incidence Algebras.",
            "The π-Calculus is Behaviourally Complete and Orbit-Finitely Executable.",
            "Output-sensitive Information flow analysis.",
            "A Formal Proof of the Irrationality of ζ(3).",
            "Datatype defining rewrite systems for naturals and integers.",
            "Complete Call-by-Value Calculi of Control Operators II: Strong Termination.",
            "A Sound Algorithm for Asynchronous Session Subtyping and its Implementation.",
            "Constructive Domains with Classical Witnesses.",
            "Stubborn Set Reduction for Two-Player Reachability Games.",
            "Synthesis of Data Word Transducers.",
            "Reconfiguration and Message Losses in Parameterized Broadcast Networks.",
            "Superposition for Lambda-Free Higher-Order Logic.",
            "Coalgebraic Semantics for Probabilistic Logic Programming.",
            "Semipullbacks of labelled Markov processes.",
            "Direct spectra of Bishop spaces and their limits.",
            "Sculptures in Concurrency.",
            "Algebraic Language Theory for Eilenberg-Moore Algebras.",
            "Logic for exact real arithmetic.",
            "DRAT and Propagation Redundancy Proofs Without New Variables.",
            "Failure Trace Semantics for a Process Algebra with Time-outs.",
            "Parametric updates in parametric timed automata.",
            "Interface Modeling for Quality and Resource Management.",
            "A realizability semantics for inductive formal topologies, Church's Thesis and Axiom of Choice.",
            "Predicative theories of continuous lattices.",
            "Algebraic cocompleteness and finitary functors.",
            "Reachability Switching Games.",
            "Constructing Higher Inductive Types as Groupoid Quotients.",
            "LNL-FPC: The Linear/Non-linear Fixpoint Calculus.",
            "Partially Ordered Automata and Piecewise Testability.",
            "Decidability for Entailments of Symbolic Heaps with Arrays.",
            "Computable analysis and notions of continuity in Coq.",
            "Presentable signatures and initial semantics.",
            "Theories of real addition with and without a predicate for integers.",
            "Star Games and Hydras.",
            "Discovering ePassport Vulnerabilities using Bisimilarity.",
            "Encoding many-valued logic in λ-calculus."
        ]
    },
    {
        "name": "LMCS",
        "year": "2020",
        "info": "Volume 16: 2020",
        "count": 84,
        "papers": [
            "On the logical complexity of cyclic arithmetic.",
            "Modalities in homotopy type theory.",
            "Non-idempotent types for classical calculi in natural deduction style.",
            "A Categorical Reconstruction of Quantum Theory.",
            "Language Preservation Problems in Parametric Timed Automata.",
            "Probabilistic logics based on Riesz spaces.",
            "Call-by-name Gradual Type Theory.",
            "Efficient and Modular Coalgebraic Partition Refinement.",
            "Descriptive Complexity for Counting Complexity Classes.",
            "Signatures and Induction Principles for Higher Inductive-Inductive Types.",
            "An operational interpretation of coinductive types.",
            "Undecidability of a weak version of MSO+U.",
            "Overlap Algebras: a Constructive Look at Complete Boolean Algebras.",
            "Minimization of visibly pushdown automata is NP-complete.",
            "Covariance and Controvariance: a fresh look at an old issue (a primer in advanced type systems for learning functional programmers).",
            "Regular Tree Algebras.",
            "Continuous Regular Functions.",
            "McShane-Whitney extensions in constructive analysis.",
            "On Nominal Syntax and Permutation Fixed Points.",
            "Recursion Schemes, the MSO Logic, and the U quantifier.",
            "The Complexity of Combinations of Qualitative Constraint Satisfaction Problems.",
            "A syntactic approach to continuity of T-definable functionals.",
            "Decreasing Diagrams for Confluence and Commutation.",
            "Continuity of Functional Transducers: A Profinite Study of Rational Functions.",
            "First-order queries on classes of structures with bounded expansion.",
            "Distances between States and between Predicates.",
            "Unique perfect matchings, forbidden transitions and proof nets for linear logic with Mix.",
            "A Universal Ordinary Differential Equation.",
            "Translation of Algorithmic Descriptions of Discrete Functions to SAT with Applications to Cryptanalysis Problems.",
            "Classical Control, Quantum Circuits and Linear Logic in Enriched Category Theory.",
            "A new coinductive confluence proof for infinitary lambda calculus.",
            "Automata Minimization: a Functorial Approach.",
            "An Integrated First-Order Theory of Points and Intervals over Linear Orders (Part II).",
            "Reachability for infinite time Turing machines with long tapes.",
            "Representing Dependencies in Event Structures.",
            "Tight Polynomial Worst-Case Bounds for Loop Programs.",
            "On the incomputability of computable dimension.",
            "Register Games.",
            "Cellular Cohomology in Homotopy Type Theory.",
            "On properties of B-terms.",
            "Synthesis of Orchestrations and Choreographies: Bridging the Gap between Supervisory Control and Coordination of Services.",
            "Trace Refinement in Labelled Markov Decision Processes.",
            "Completeness of the ZX-Calculus.",
            "Consistency of circuit lower bounds with bounded theories.",
            "Forward Analysis for WSTS, Part III: Karp-Miller Trees.",
            "Failure of Normalization in Impredicative Type Theory with Proof-Irrelevant Propositional Equality.",
            "Fixed point combinators as fixed points of higher-order fixed point generators.",
            "Revisiting Call-by-value Böhm trees in light of their Taylor expansion.",
            "Interpolating Between Choices for the Approximate Intermediate Value Theorem.",
            "Directed Homotopy in Non-Positively Curved Spaces.",
            "Combinatorial Conversion and Moment Bisimulation for Stochastic Rewriting Systems.",
            "Rule Algebras for Adhesive Categories.",
            "Playing with Repetitions in Data Words Using Energy Games.",
            "Constructive Canonicity of Inductive Inequalities.",
            "A limitation on the KPT interpolation.",
            "Dual-Context Calculi for Modal Logic.",
            "On the Expressive Power of Higher-Order Pushdown Systems.",
            "The Sierpinski Object in the Scott Realizability Topos.",
            "Compiling With Classical Connectives.",
            "Rooted Divergence-Preserving Branching Bisimilarity is a Congruence.",
            "Gems of Corrado Böhm.",
            "Two-variable logics with some betweenness relations: Expressiveness, satisfiability and membership.",
            "A unifying framework for continuity and complexity in higher types.",
            "On Resolving Non-determinism in Choreographies.",
            "A symmetric protocol to establish service level agreements.",
            "Field-based Coordination with the Share Operator.",
            "On the Termination Problem for Probabilistic Higher-Order Recursive Programs.",
            "Of Cores: A Partial-Exploration Framework for Markov Decision Processes.",
            "Verification of Flat FIFO Systems.",
            "Reversing Place Transition Nets.",
            "A Functional (Monadic) Second-Order Theory of Infinite Trees.",
            "Collaboration vs. choreography conformance in BPMN.",
            "The Complexity of Subgame Perfect Equilibria in Quantitative Reachability Games.",
            "Transfinite Lyndon words.",
            "Convexity and Order in Probabilistic Call-by-Name FPC.",
            "Clause Set Cycles and Induction.",
            "An extended type system with lambda-typed lambda-expressions.",
            "Life is Random, Time is Not: Markov Decision Processes with Window Objectives.",
            "Theory of higher order interpretations and application to Basic Feasible Functions.",
            "Towards Races in Linear Logic.",
            "Psi-Calculi Revisited: Connectivity and Compositionality.",
            "Ticking clocks as dependent right adjoints: Denotational semantics for clocked type theory.",
            "On open well-filtered spaces.",
            "Towards a Minimal Stabilizer ZX-calculus."
        ]
    },
    {
        "name": "LMCS",
        "year": "2019",
        "info": "Volume 15: 2019",
        "count": 108,
        "papers": [
            "Natural Transformations as Rewrite Rules and Monad Composition.",
            "Models of Type Theory Based on Moore Paths.",
            "Probabilistic call by push value.",
            "A Finite-Model-Theoretic View on Propositional Proof Complexity.",
            "Extending set functors to generalised metric spaces.",
            "Degrees of extensionality in the theory of Böhm trees and Sallé's conjecture.",
            "Shrub-depth: Capturing Height of Dense Graphs.",
            "A Light Modality for Recursion.",
            "A sequent calculus for a semi-associative law.",
            "Relative Entailment Among Probabilistic Implications.",
            "The Subpower Membership Problem for Finite Algebras with Cube Terms.",
            "Efficient reduction of nondeterministic automata with application to language inclusion testing.",
            "Size, Cost, and Capacity: A Semantic Technique for Hard Random QBFs.",
            "Algebra, coalgebra, and minimization in polynomial differential equations.",
            "Sahlqvist via Translation.",
            "Almost Every Simply Typed Lambda-Term Has a Long Beta-Reduction Sequence.",
            "Behavioural equivalences for timed systems.",
            "Thin Games with Symmetry and Concurrent Hyland-Ong Games.",
            "Shortest paths in one-counter systems.",
            "Displayed Categories.",
            "On the Incomparability of Cache Algorithms in Terms of Timing Leakage.",
            "The principle of pointfree continuity.",
            "Web spaces and worldwide web spaces: topological aspects of domain theory.",
            "Capturing Polynomial Time using Modular Decomposition.",
            "On the First-Order Complexity of Induced Subgraph Isomorphism.",
            "Coaxioms: flexible coinductive definitions by inference systems.",
            "Stone-Type Dualities for Separation Logics.",
            "Initial Semantics for Reduction Rules.",
            "Topological Scott Convergence Theorem.",
            "Disjunctive bases: normal forms and model theory for modal logics.",
            "Proving Soundness of Extensional Normal-Form Bisimilarities.",
            "A classical groupoid model for quantum networks.",
            "On Thin Air Reads: Towards an Event Structures Model of Relaxed Memory.",
            "Computer-Assisted Proving of Combinatorial Conjectures Over Finite Domains: A Case Study of a Chess Conjecture.",
            "Moschovakis Extension of Represented Spaces.",
            "Abstract Hidden Markov Models: a monadic account of quantitative information flow.",
            "Streamability of nested word transductions.",
            "Canonical Models and the Complexity of Modal Team Logic.",
            "Generalised Mermin-type non-locality arguments.",
            "Validity and Entailment in Modal and Propositional Dependence Logics.",
            "All-Path Reachability Logic.",
            "The height of piecewise-testable languages and the complexity of the logic of subwords.",
            "Feedback computability on Cantor space.",
            "Reasoning about effects: from lists to cyber-physical agents.",
            "Polishness of some topologies related to word or tree automata.",
            "A Denotational Semantics for SPARC TSO.",
            "Covering and separation for logical fragments with modular predicates.",
            "A Strategy for Dynamic Programs: Start over and Muddle through.",
            "On the Expressiveness and Monitoring of Metric Temporal Logic.",
            "Every metric space is separable in function realizability.",
            "Rewritability in Monadic Disjunctive Datalog, MMSNP, and Expressive Description Logics.",
            "The logical strength of Büchi's decidability theorem.",
            "An ωω\\omega-Algebra for Real-Time Energy Problems.",
            "Bisimulations for Delimited-Control Operators.",
            "Upper Bounds on the Quantifier Depth for Graph Differentiation in First-Order Logic.",
            "Regular Separability of One Counter Automata.",
            "Elementary Quotient Completions, Church's Thesis, and Partioned Assemblies.",
            "Guarded and Unguarded Iteration for Generalized Processes.",
            "Capturing Logarithmic Space and Polynomial Time on Chordal Claw-Free Graphs.",
            "Subspace-Invariant AC00^0 Formulas.",
            "Logical properties of random graphs from small addable classes.",
            "Coherence for Frobenius pseudomonoids and the geometry of linear proofs.",
            "A Forgotten Theory of Proofs ?",
            "Controlling a population.",
            "An efficient algorithm to decide periodicity of bbb-recognisable sets using LSDF convention.",
            "Normalizing the Taylor expansion of non-deterministic {\\lambda}-terms, via parallel reduction of resource vectors.",
            "Classical System of Martin-Lof's Inductive Definitions is not Equivalent to Cyclic Proofs.",
            "Game characterizations and lower cones in the Weihrauch degrees.",
            "Divergence and unique solution of equations.",
            "On the commutativity of the powerspace constructions.",
            "Companions, Causality and Codensity.",
            "A categorical semantics for causal structure.",
            "Quantitative Automata under Probabilistic Semantics.",
            "On the Succinctness of Atoms of Dependency.",
            "Bounded Quantifier Instantiation for Checking Inductive Invariants.",
            "Abstract Completion, Formalized.",
            "Parity Games with Weights.",
            "Query learning of derived ωω\\omega-tree languages in polynomial time.",
            "Alternating, private alternating, and quantum alternating realtime automata.",
            "The Data Complexity of Ontology-Mediated Queries with Closed Predicates.",
            "Approximability in the GPAC.",
            "Interaction Graphs: Exponentials.",
            "A diagrammatic calculus of fermionic quantum circuits.",
            "Regular tree languages in low levels of the Wadge Hierarchy.",
            "Higher-dimensional automata modeling shared-variable systems.",
            "Definability and Interpolation within Decidable Fixpoint Logics.",
            "On noncommutative extensions of linear logic.",
            "The parameterized space complexity of model-checking bounded variable first-order logic.",
            "Nash Equilibrium and Bisimulation Invariance.",
            "The Complexity of Flat Freeze LTL.",
            "ℵ1 and the modal μ-calculus.",
            "Rule Formats for Nominal Process Calculi.",
            "On the enumeration of closures and environments with an application to random generation.",
            "On Free ω-Continuous and Regular Ordered Algebras.",
            "Scalar and Vectorial mu-calculus with Atoms.",
            "On completeness and parametricity in the realizability semantics of System F.",
            "The Dynamic Geometry of Interaction Machine: A Token-Guided Graph Rewriter.",
            "Lifting Coalgebra Modalities and MELL Model Structure to Eilenberg-Moore Categories.",
            "Flow Logic.",
            "A non-regular language of infinite trees that is recognizable by a sort-wise finite algebra.",
            "Computing the Width of Non-deterministic Automata.",
            "Simplified Algorithmic Metatheorems Beyond MSO: Treewidth and Neighborhood Diversity.",
            "A Curry-Howard Approach to Church's Synthesis.",
            "Definable isomorphism problem.",
            "On Functions Weakly Computable by Pushdown Petri Nets and Related Systems.",
            "Logical and Algebraic Characterizations of Rational Transductions.",
            "Concurrency and Probability: Removing Confusion, Compositionally.",
            "Relational ⋆⋆\\star-Liftings for Differential Privacy."
        ]
    },
    {
        "name": "LMCS",
        "year": "2018",
        "info": "Volume 14: 2018",
        "count": 93,
        "papers": [
            "Compatibility Properties of Synchronously and Asynchronously Communicating Components.",
            "Intersection Types for the lambda-mu Calculus.",
            "Coinductive Foundations of Infinitary Rewriting and Infinitary Equational Logic.",
            "Soundness in negotiations.",
            "Pushing for weighted tree automata.",
            "Mending Fences with Self-Invalidation and Self-Downgrade.",
            "The Ho-Zhao Problem.",
            "Globular: an online proof assistant for higher-dimensional rewriting.",
            "A Load-Buffer Semantics for Total Store Ordering.",
            "A Real-Valued Modal Logic.",
            "Logical relations for coherence of effect subtyping.",
            "Automated Synthesis of Distributed Self-Stabilizing Protocols.",
            "A generalization of a theorem of Hurewicz for quasi-Polish spaces.",
            "Some model theory for the modal μ-calculus: syntactic characterisations of semantic properties.",
            "Families of DFAs as Acceptors of ω-Regular Languages.",
            "An enriched view on the extended finitary monad-Lawvere theory correspondence.",
            "Dynamic Causality in Event Structures.",
            "Mixin Composition Synthesis based on Intersection Types.",
            "A coalgebraic treatment of conditional transition systems with upgrades.",
            "A Proof of Stavi's Theorem.",
            "Weighted omega-Restricted One Counter Automata.",
            "Model Theory and Proof Theory of Coalgebraic Predicate Logic.",
            "The sequential functionals of type (ι→ι)n→ι form a dcpo for all n ∈ N.",
            "A survey on difference hierarchies of regular languages.",
            "Proof-Relevant Logical Relations for Name Generation.",
            "Closed Sets and Operators thereon: Representations, Computability and Complexity.",
            "Monadic Second Order Logic with Measure and Category Quantifiers.",
            "nnn-permutability and linear Datalog implies symmetric Datalog.",
            "A note on first-order spectra with binary relations.",
            "Van Kampen Colimits and Path Uniqueness.",
            "Domains via approximation operators.",
            "Study of Behaviours via Visitable Paths.",
            "Analyzing Timed Systems Using Tree Automata.",
            "A Categorical Approach to Syntactic Monoids.",
            "Uniqueness of directed complete posets based on Scott closed set lattices.",
            "Weihrauch-completeness for layerwise computability.",
            "The language of Stratified Sets is confluent and strongly normalising.",
            "A Dichotomy for First-Order Reducts of Unary Structures.",
            "Computability in Basic Quantum Mechanics.",
            "An Integrated First-Order Theory of Points and Intervals over Linear Orders (Part I).",
            "On Sub-Propositional Fragments of Modal Logic.",
            "An estimation for the lengths of reduction sequences of the λμρθ-calculus.",
            "SOS-based Modal Decomposition on Nondeterministic Probabilistic Processes.",
            "Extensional Semantics for Higher-Order Logic Programs with Negation.",
            "The Covering Problem.",
            "Relational Graph Models at Work.",
            "The intuitionistic temporal logic of dynamical systems.",
            "A Ghost at ω1.",
            "A topological interpretation of three Leibnizian principles within the functional extensions.",
            "Unification and Logarithmic Space.",
            "Inhabitation for Non-idempotent Intersection Types.",
            "The recursion hierarchy for PCF is strict.",
            "Infinite and Bi-infinite Words with Decidable Monadic Theories.",
            "Unguarded Recursion on Coinductive Resumptions.",
            "Trees from Functions as Processes.",
            "Ologisms.",
            "A Galois connection between Turing jumps and limits.",
            "Universal Constructions for (Co)Relations: categories, monoidal categories, and props.",
            "Coalgebraic Infinite Traces and Kleisli Simulations.",
            "A categorical foundation for structured reversible flowchart languages: Soundness and adequacy.",
            "Java & Lambda: a Featherweight Story.",
            "Categorical structures for type theory in univalent foundations.",
            "Free complete Wasserstein algebras.",
            "Coalgebraic Behavioral Metrics.",
            "Defining Recursive Predicates in Graph Orders.",
            "Proper Functors and Fixed Points for Finite Behaviour.",
            "On Interpolation and Symbol Elimination in Theory Extensions.",
            "Equational Reasonings in Wireless Network Gossip Protocols.",
            "Event Structures for Petri nets with Persistence.",
            "Applicable Mathematics in a Minimal Computational Theory of Sets.",
            "Qualitative and Quantitative Monitoring of Spatio-Temporal Properties with SSTL.",
            "Local Redundancy in SAT: Generalizations of Blocked Clauses.",
            "On the algebraic structure of Weihrauch degrees.",
            "The Complexity of Bisimulation and Simulation on Finite Systems.",
            "Codensity Lifting of Monads and its Dual.",
            "Deciding Confluence and Normal Form Properties of Ground Term Rewrite Systems Efficiently.",
            "Extension by Conservation. Sikorski's Theorem.",
            "The Complexity of All-switches Strategy Improvement.",
            "Do Hard SAT-Related Reasoning Tasks Become Easier in the Krom Fragment?",
            "Intuitionistic Layered Graph Logic: Semantics and Proof Theory.",
            "Reasoning with Finite Sets and Cardinality Constraints in SMT.",
            "Game Characterization of Probabilistic Bisimilarity, and Applications to Pushdown Automata.",
            "Affine Sessions.",
            "A Complete Quantitative Deduction System for the Bisimilarity Distance on Markov Chains.",
            "Separating regular languages with two quantifier alternations.",
            "Termination in Convex Sets of Distributions.",
            "Inducing syntactic cut-elimination for indexed nested sequents.",
            "Reasoning About Bounds in Weighted Transition Systems.",
            "Model Checking Flat Freeze LTL on One-Counter Automata.",
            "Taylor expansion in linear logic is invertible.",
            "One-way definability of two-way word transducers.",
            "Axioms for Modelling Cubical Type Theory in a Topos.",
            "Subsumption Algorithms for Three-Valued Geometric Resolution."
        ]
    },
    {
        "name": "LMCS",
        "year": "2017",
        "info": "Volume 13: 2017",
        "count": 99,
        "papers": [
            "Logical compactness and constraint satisfaction problems.",
            "Mixed powerdomains for probability and nondeterminism.",
            "Stream Differential Equations: Specification Formats and Solution Methods.",
            "Unprovability of circuit upper bounds in Cook's theory PV.",
            "A feasible interpolation for random resolution.",
            "Complexity of Conditional Term Rewriting.",
            "Sequential decision problems, dependent types and generic solutions.",
            "Lineal: A linear-algebraic Lambda-calculus.",
            "Reasoning about Strategies: on the Satisfiability Problem.",
            "A Coordination Language for Databases.",
            "Termination of Cycle Rewriting by Transformation and Matrix Interpretation.",
            "Reachability Analysis of Innermost Rewriting.",
            "Asynchronous Distributed Execution Of Fixpoint-Based Computational Fields.",
            "Typing weak MSOL properties.",
            "Notions of Anonymous Existence in Martin-Löf Type Theory.",
            "Minimisation of Multiplicity Tree Automata.",
            "Multiparty Session Actors.",
            "Existence of strongly proper dyadic subbases.",
            "Dynamic Choreographies: Theory And Implementation.",
            "Subcomputable Schnorr Randomness.",
            "Hopf and Lie algebras in semi-additive Varieties.",
            "Certifying Confluence Proofs via Relative Termination and Rule Labeling.",
            "Inter-procedural Two-Variable Herbrand Equalities.",
            "A Recipe for State-and-Effect Triangles.",
            "Feasible Interpolation for QBF Resolution Calculi.",
            "A Reduced Semantics for Deciding Trace Equivalence.",
            "On Sessions and Infinite Data.",
            "Disjoint-union partial algebras.",
            "Hanf numbers via accessible images.",
            "On the Preciseness of Subtyping in Session Types.",
            "On-the-Fly Computation of Bisimilarity Distances.",
            "An expressive completeness theorem for coalgebraic modal mu-calculi.",
            "Unifying Two Views on Multiple Mean-Payoff Objectives in Markov Decision Processes.",
            "Deriving Probability Density Functions from Probabilistic Functional Programs.",
            "Towards an Algebra for Cascade Effects.",
            "LLF𝒫: a logical framework for modeling external evidence, side conditions, and proof irrelevance using monads.",
            "Characterization theorem for the conditionally computable real functions.",
            "Aspects of algebraic Algebras.",
            "Tracing where IoT data are collected and aggregated.",
            "Focusing in Orthologic.",
            "Algebraic and logical descriptions of generalized trees.",
            "Complexity Hierarchies and Higher-order Cons-free Term Rewriting.",
            "The Algebraic Intersection Type Unification Problem.",
            "The Independence of Markov's Principle in Type Theory.",
            "On the Compositionality of Quantitative Information Flow.",
            "A Note on the Topologicity of Quantale-Valued Topological Spaces.",
            "A revised completeness result for the simply typed λμ-calculus using realizability semantics.",
            "Some remarks on connectors and groupoids in Goursat categories.",
            "Retractability, games and orchestrators for session contracts.",
            "First Order Theories of Some Lattices of Open Sets.",
            "Hyper Normalisation and Conditioning for Discrete Probability Distributions.",
            "On some categorical-algebraic conditions in S-protomodular categories.",
            "Path Checking for MTL and TPTL over Data Words.",
            "Fair Simulation for Nondeterministic and Probabilistic Buechi Automata: a Coalgebraic Perspective.",
            "Complexity theory for spaces of integrable functions.",
            "Localic completion of uniform spaces.",
            "Edit Distance for Pushdown Automata.",
            "Well Behaved Transition Systems.",
            "A new characterization of complete Heyting and co-Heyting algebras.",
            "Improved Algorithms for Parity and Streett objectives.",
            "Environmental Bisimulations for Delimited-Control Operators with Dynamic Prompt Generation.",
            "Formal Languages, Formally and Coinductively.",
            "Easy to Win, Hard to Master: Optimal Strategies in Parity Games with Costs.",
            "A bound for Dickson's lemma.",
            "Coherent Presentations of Monoidal Categories.",
            "Lax orthogonal factorisations in monad-quantale-enriched categories.",
            "Petri Automata.",
            "Strong normalization of lambda-Sym-Prop- and lambda-bar-mu-mu-tilde-star- calculi.",
            "Games and Strategies as Event Structures.",
            "Normalisation by Evaluation for Type Theory, in Type Theory.",
            "Modular, Fully-abstract Compilation by Approximate Back-translation.",
            "Boundedness in languages of infinite words.",
            "Adding Path-Functional Dependencies to the Guarded Two-Variable Fragment with Counting.",
            "Bottom-up automata on data trees and vertical XPath.",
            "Bounded degree and planar spectra.",
            "The Data Complexity of Description Logic Ontologies.",
            "Cyclic Datatypes modulo Bisimulation based on Second-Order Algebraic Theories.",
            "An intensionally fully-abstract sheaf model for π (expanded version).",
            "Some observations on the logical foundations of inductive theorem proving.",
            "The Universal Process.",
            "Multiactive objects and their applications.",
            "Computing Solution Operators of Boundary-value Problems for Some Linear Hyperbolic Systems of PDEs.",
            "A Framework for Certified Self-Stabilization.",
            "Games for Bisimulations and Abstraction.",
            "Faithful (meta-)encodings of programmable strategies into term rewriting systems.",
            "Branching Bisimilarity of Normed BPA Processes as a Rational Monoid.",
            "A Few Notes on Formal Balls.",
            "Statman's Hierarchy Theorem.",
            "Multiplicative-Additive Proof Equivalence is Logspace-complete, via Binary Decision Trees.",
            "From Logic to Biology via Physics: a survey.",
            "Undecidability of Equality in the Free Locally Cartesian Closed Category (Extended version).",
            "Grilliot's trick in Nonstandard Analysis.",
            "A Classical Realizability Model arising from a Stable Model of Untyped Lambda Calculus.",
            "Timed Session Types.",
            "The Power of Arc Consistency for CSPs Defined by Partially-Ordered Forbidden Patterns.",
            "Privacy by typing in the π-calculus.",
            "Matching Logic.",
            "Standardization and Conservativity of a Refined Call-by-Value lambda-Calculus.",
            "The Rice-Shapiro theorem in Computable Topology."
        ]
    },
    {
        "name": "LMCS",
        "year": "2016",
        "info": "Volume 12: 2016",
        "count": 47,
        "papers": [
            "Type-checking Liveness for Collaborative Processes with Bounded and Unbounded Recursion.",
            "Proof equivalence in MLL is PSPACE-complete.",
            "Weak topologies for Linear Logic.",
            "(Leftmost-Outermost) Beta Reduction is Invariant, Indeed.",
            "Separating Regular Languages with First-Order Logic.",
            "Simulation Problems Over One-Counter Nets.",
            "History-Register Automata.",
            "A Sorted Semantic Framework for Applied Process Calculi.",
            "Order-Invariant Types and Their Applications.",
            "Generic algorithms for halting problem and optimal machines revisited.",
            "Non-Obfuscated Unprovable Programs & Many Resultant Subtleties.",
            "FO2(<, +1, ~) on data trees, data tree automata and branching vector addition systems.",
            "On the characterization of models of H*: The semantical aspect.",
            "Quasipolynomial Normalisation in Deep Inference via Atomic Flows and Threshold Formulae.",
            "Certified Context-Free Parsing: A formalisation of Valiant's Algorithm in Agda.",
            "Formalized linear algebra over Elementary Divisor Rings in Coq.",
            "Two-variable Logic with Counting and a Linear Order.",
            "Weighted Pushdown Systems with Indexed Weight Domains.",
            "Using higher-order contracts to model session types.",
            "The Largest Respectful Function.",
            "No solvable lambda-value term left behind.",
            "Reasoning about Data Repetitions with Counter Systems.",
            "Dualized Simple Type Theory.",
            "Block structure vs scope extrusion: between innocence and omniscience.",
            "How Much Lookahead is Needed to Win Infinite Games?",
            "Solving finite-domain linear constraints in presence of the alldifferent.",
            "Synthesis of Strategies Using the Hoare Logic of Angelic and Demonic Nondeterminism.",
            "The Guarded Lambda-Calculus: Programming and Reasoning with Guarded Recursion for Coinductive Types.",
            "Build your own clarithmetic I.",
            "Idempotents in intensional type theory.",
            "Z-stability in Constructive Analysis.",
            "Data optimizations for constraint automata.",
            "Build your own clarithmetic II.",
            "On Natural Deduction for Herbrand Constructive Logics I: Curry-Howard Correspondence for Dummett's Logic LC.",
            "Extending Unification in EL to Disunification: The Case of Dismatching and Local Disunification.",
            "Model Checking Spatial Logics for Closure Spaces.",
            "Some theorems on passing from local to global presence of properties of functions.",
            "Borel-piecewise continuous reducibility for uniformization problems.",
            "Discovering, quantifying, and displaying attacks.",
            "Automata for Specifying and Orchestrating Service Contracts.",
            "Honesty by Typing.",
            "On the locality of arb-invariant first-order formulas with modulo counting quantifiers.",
            "On linear rewriting systems for Boolean logic and some applications to proof theory.",
            "Coalgebraic trace semantics via forgetful logics.",
            "On the Mints Hierarchy in First-Order Intuitionistic Logic.",
            "Compositional bisimulation metric reasoning with Probabilistic Process Calculi.",
            "Encoding Monomorphic and Polymorphic Types."
        ]
    },
    {
        "name": "LMCS",
        "year": "2015",
        "info": "Volume 11: 2015",
        "count": 83,
        "papers": [
            "A Hoare logic for the coinductive trace-based big-step semantics of While.",
            "Permission-Based Separation Logic for Multithreaded Java Programs.",
            "Monads need not be endofunctors.",
            "On the relative proof complexity of deep inference via atomic flows.",
            "Program Logics for Homogeneous Generative Run-Time Meta-Programming.",
            "Extracting verified decision procedures: DPLL and Resolution.",
            "Simulation in the Call-by-Need Lambda-Calculus with Letrec, Case, Constructors, and Seq.",
            "The extensional realizability model of continuous functionals and three weakly non-constructive classical theorems.",
            "Complexity of Problems of Commutative Grammars.",
            "Weak Cat-Operads.",
            "Effective zero-dimensionality for computable metric spaces.",
            "The Computational Complexity of Propositional Cirquent Calculus.",
            "Positive Inductive-Recursive Definitions.",
            "Bialgebraic Semantics for Logic Programming.",
            "High-level Counterexamples for Probabilistic Automata.",
            "Ranking Templates for Linear Loops.",
            "Domain Representations Induced by Dyadic Subbases.",
            "Modelling MAC-Layer Communications in Wireless Systems.",
            "Kernelizing MSO Properties of Trees of Fixed Height, and Some Consequences.",
            "Aspect-oriented linearizability proofs.",
            "Mutually Testing Processes.",
            "On Reachability for Unidirectional Channel Systems Extended with Regular Tests.",
            "Learning and Designing Stochastic Processes from Logical Constraints.",
            "Containment for Conditional Tree Patterns.",
            "From Kleisli Categories to Commutative C*-algebras: Probabilistic Gelfand Duality.",
            "Bounding linear head reduction and visible interaction through skeletons.",
            "Using models to model-check recursive schemes.",
            "Logical strength of complexity theory and a formalization of the PCP theorem in bounded arithmetic.",
            "Pure Nash Equilibria in Concurrent Deterministic Games.",
            "Generators and relations for n-qubit Clifford operators.",
            "On Unification Modulo One-Sided Distributivity: Algorithms, Variants and Asymmetry.",
            "Deciding the value 1 problem for probabilistic leaktight automata.",
            "Thermodynamic graph-rewriting.",
            "Weak bisimulation for coalgebras over order enriched monads.",
            "On absorption in semigroups and n-ary semigroups.",
            "Permissive Controller Synthesis for Probabilistic Systems.",
            "On the system CL12 of computability logic.",
            "Presenting Distributive Laws.",
            "Service-Oriented Logic Programming.",
            "Proof Theory of a Multi-Lane Spatial Logic.",
            "Deciding definability in FO2(<h, <v) on trees.",
            "Constructing Fully Complete Models of Multiplicative Linear Logic.",
            "On Nested Sequents for Constructive Modal Logics.",
            "Quantitative Approximation of the Probability Distribution of a Markov Process by Formal Abstractions.",
            "Quantified Constraints and Containment Problems.",
            "Logics with rigidly guarded data tests.",
            "Abstract Model Repair.",
            "Detecting Unrealizability of Distributed Fault-tolerant Systems.",
            "Learning Regular Languages over Large Ordered Alphabets.",
            "Quantitative Languages Defined by Functional Automata.",
            "Compositional Verification for Timed Systems Based on Automatic Invariant Generation.",
            "Partial functions and domination.",
            "On the Axiomatizability of Impossible Futures.",
            "Positive fragments of coalgebraic logics.",
            "Featherweight VeriFast.",
            "Verification for Timed Automata extended with Discrete Data Structure.",
            "Weak upper topologies and duality for cones.",
            "A correspondence between rooted planar maps and normal planar lambda terms.",
            "Exact Unification and Admissibility.",
            "New Directions in Categorical Logic, for Classical, Probabilistic and Quantum Logic.",
            "Ellipses and Lambda Definability.",
            "Expressive Path Queries on Graph with Data.",
            "Logic and Branching Automata.",
            "The computability path ordering.",
            "Formal Design of Asynchronous Fault Detection and Identification Components using Temporal Epistemic Logic.",
            "Quantitative information flow under generic leakage functions and adaptive adversaries.",
            "Closed choice: Cardinality vs convex dimension.",
            "A decidable weakening of Compass Logic based on cone-shaped cardinal directions.",
            "Faster Existential FO Model Checking on Posets.",
            "From nominal to higher-order rewriting and back again.",
            "Problems in number theory from busy beaver competition.",
            "FO Model Checking of Interval Graphs.",
            "Modular Session Types for Objects.",
            "Type Reconstruction for the Linear π-Calculus with Composite Regular Types.",
            "Datalog Rewritings of Regular Path Queries using Views.",
            "Structurally Cyclic Petri Nets.",
            "Bisimulation of Labelled State-to-Function Transition Systems Coalgebraically.",
            "Preservation and decomposition theorems for bounded degree structures.",
            "A finer reduction of constraint problems to digraphs.",
            "A Program Logic for Verifying Secure Routing Protocols.",
            "Computational Problems in Metric Fixed Point Theory and their Weihrauch Degrees.",
            "Type-based Self-stabilisation for Computational Fields.",
            "Typed realizability for first-order classical analysis."
        ]
    },
    {
        "name": "LMCS",
        "year": "2014",
        "info": "Volume 10: 2014",
        "count": 81,
        "papers": [
            "The role of logical interpretations in program development.",
            "Monadic second-order definable graph orderings.",
            "About the range property for H.",
            "Linear Temporal Logic for Regular Cost Functions.",
            "Unification modulo a 2-sorted Equational theory for Cipher-Decipher Block Chaining.",
            "Computational Complexity of Smooth Differential Equations.",
            "The First-Order Theory of Ground Tree Rewrite Graphs.",
            "Separation Property for wB- and wS-regular Languages.",
            "Knowledge Spaces and the Completeness of Learning Strategies.",
            "Exact and Approximate Determinization of Discounted-Sum Automata.",
            "The Size-Change Termination Principle for Constructor Based Languages.",
            "Parameterized Synthesis.",
            "Two Views on Multiple Mean-Payoff Objectives in Markov Decision Processes.",
            "A Proof of Kamp's theorem.",
            "Universal First-Order Logic is Superfluous for NL, P, NP and coNP.",
            "Revisiting Trace and Testing Equivalences for Nondeterministic and Probabilistic Processes.",
            "Linear usage of state.",
            "Model Checking Lower Bounds for Simple Graphs.",
            "Modular Complexity Analysis for Term Rewriting.",
            "Towards 3-Dimensional Rewriting Theory.",
            "A Linear Category of Polynomial Functors (extensional part).",
            "Querying the Guarded Fragment.",
            "Discriminating Lambda-Terms Using Clocked Boehm Trees.",
            "Interaction and Depth against Nondeterminism in Proof Search.",
            "Partial Order Infinitary Term Rewriting.",
            "Infinitary Term Rewriting for Weakly Orthogonal Systems: Properties and Counterexamples.",
            "Computability of 1-manifolds.",
            "Locating Ax, where A is a subspace of B(H).",
            "Global Numerical Constraints on Trees.",
            "Dynamic Tags for Security Protocols.",
            "Unsolvability Cores in Classification Problems.",
            "Probability Logic for Harsanyi Type Spaces.",
            "Parity and Streett Games with Costs.",
            "Compositional Reasoning for Explicit Resource Management in Channel-Based Concurrency.",
            "Small Stone in Pool.",
            "Synthesis from Probabilistic Components.",
            "Classical propositional logic and decidability of variables in intuitionistic propositional logic.",
            "Decidability Results for the Boundedness Problem.",
            "A Fragment of Dependence Logic Capturing Polynomial Time.",
            "Automata theory in nominal sets.",
            "Reductions to the set of random strings: The resource-bounded case.",
            "Finite state verifiers with constant randomness.",
            "Representations of measurable sets in computable measure theory.",
            "Deciding Conditional Termination.",
            "On Ramsey properties of classes with forbidden trees.",
            "A Concurrent Pattern Calculus.",
            "Refinement and Difference for Probabilistic Automata.",
            "Ambiguity of omega-Languages of Turing Machines.",
            "Computable Jordan Decomposition of Linear Continuous Functionals on $C[0;1]$.",
            "When is a container a comonad?",
            "Random strings and tt-degrees of Turing complete C.E. sets.",
            "Categorical Proof Theory of Co-Intuitionistic Linear Logic.",
            "Analysis of Timed and Long-Run Objectives for Markov Automata.",
            "Observationally-induced algebras in Domain Theory.",
            "Corecursive Algebras, Corecursive Monads and Bloom Monads.",
            "Fourier spectra of measures associated with algorithmically random Brownian motion.",
            "Inferring Algebraic Effects.",
            "Polynomial Interpretations over the Natural, Rational and Real Numbers Revisited.",
            "Improving legibility of natural deduction proofs is not trivial.",
            "Separating Regular Languages by Locally Testable and Locally Threshold Testable Languages.",
            "Connection Matrices and the Definability of Graph Parameters.",
            "Full abstraction for fair testing in CCS (expanded version).",
            "On the strictness of the quantifier structure hierarchy in first-order logic.",
            "The Power of Priority Channel Systems.",
            "Decidability Problems for Actor Systems.",
            "Stochastic Timed Automata.",
            "Computing a Solution of Feigenbaum's Functional Equation in Polynomial Time.",
            "Call-by-value, call-by-name and the vectorial behaviour of the algebraic λ-calculus.",
            "An Effect System for Algebraic Effects and Handlers.",
            "On the Relation of Interaction Semantics to Continuations and Defunctionalization.",
            "Cost Preserving Bisimulations for Probabilistic Automata.",
            "Algorithmic randomness for Doob's martingale convergence theorem in continuous time.",
            "State of Büchi Complementation.",
            "Beyond Q-Resolution and Prenex Form: A Proof System for Quantified Constraint Satisfaction.",
            "Sub-computable Boundedness Randomness.",
            "Bounded variation and the strength of Helly's selection theorem.",
            "Quantified CTL: Expressiveness and Complexity.",
            "Global semantic typing for inductive and coinductive computing.",
            "A Robust Class of Data Languages and an Application to Learning.",
            "Globally Governed Session Semantics.",
            "Stochastic Parity Games on Lossy Channel Systems."
        ]
    },
    {
        "name": "LMCS",
        "year": "2013",
        "info": "Volume 9: 2013",
        "count": 85,
        "papers": [
            "Type classes for efficient exact real arithmetic in Coq.",
            "Some properties of random lambda terms.",
            "Counting CTL.",
            "A Rewriting View of Simple Typing.",
            "Vector Addition System Reversible Reachability Problem.",
            "Coarse abstractions make Zeno behaviours difficult to detect.",
            "On Subgame Perfection in Quantitative Reachability Games.",
            "On the Complexity of Equivalence and Minimisation for Q-weighted Automata.",
            "Generalizing determinization from automata to coalgebras.",
            "Bisimilarity on Basic Process Algebra is in 2-ExpTime (an explicit proof).",
            "L-Recursion and a new Logic for Logarithmic Space.",
            "Collapsible Pushdown Graphs of Level 2 are Tree-Automatic.",
            "Unifying Büchi Complementation Constructions.",
            "Call-by-Value and Call-by-Name Dual Calculi with Inductive and Coinductive Types.",
            "An Algebraic Preservation Theorem for Aleph-Zero Categorical Quantified Constraint Satisfaction.",
            "Polylogarithmic Cuts in Models of V^0.",
            "Decidable Classes of Tree Automata Mixing Local and Global Constraints Modulo Flat Theories.",
            "The degree structure of Weihrauch-reducibility.",
            "Infinite sequential Nash equilibrium.",
            "Two Variable vs. Linear Temporal Logic in Model Checking and Games.",
            "Total Representations.",
            "Time and Space Results for Parity Games with Bounded Treewidth.",
            "Bisimulations Meet PCTL Equivalences for Probabilistic Automata.",
            "Effective Characterizations of Simple Fragments of Temporal Logic Using Carton--Michel Automata.",
            "Admissibility in Finitely Generated Quasivarieties.",
            "Tree-Automatic Well-Founded Trees.",
            "Unifying the Linear Time-Branching Time Spectrum of Process Semantics.",
            "Propositional Dynamic Logic with Converse and Repeat for Message-Passing Systems.",
            "Lower Bound on Weights of Large Degree Threshold Functions.",
            "Markov two-components processes.",
            "Graph Logics with Rational Relations.",
            "Well-Pointed Coalgebras.",
            "Regular Cost Functions, Part I: Logic and Algebra over Words.",
            "Modal Interface Automata.",
            "Computably regular topological spaces.",
            "Indexed Induction and Coinduction, Fibrationally.",
            "Universal codes of the natural numbers.",
            "Algebraic Structure of Combined Traces.",
            "Computability of Probability Distributions and Characteristic Functions.",
            "Cartesian closed 2-categories and permutation equivalence in higher-order rewriting.",
            "Measure Transformer Semantics for Bayesian Machine Learning.",
            "Linearizability with Ownership Transfer.",
            "Reachability Problem for Weak Multi-Pushdown Automata.",
            "Coalgebraic Characterizations of Context-Free Languages.",
            "Pebble Games, Proof Complexity, and Time-Space Trade-offs.",
            "Connector algebras for C/E and P/T nets' interactions.",
            "On Characterising Distributability.",
            "A Polynomial Translation of pi-calculus FCPs to Safe Petri Nets.",
            "Automatic functions, linear time and learning.",
            "Induction in Algebra: a First Case Study.",
            "Reachability under Contextual Locking.",
            "Exploring the Boundaries of Monad Tensorability on Set.",
            "Bases as Coalgebras.",
            "A Static Analysis Framework for Livelock Freedom in CSP.",
            "Unary negation.",
            "Modelling Probabilistic Wireless Networks.",
            "Recovering randomness from an asymptotic Hamming distance.",
            "Abstract GSOS Rules and a Modular Treatment of Recursive Definitions.",
            "Alternating Turing machines for inductive languages.",
            "Partial Model Checking using Networks of Labelled Transition Systems and Boole an Equation Systems.",
            "Lower Bounds for Existential Pebble Games and k-Consistency Tests.",
            "Non-idempotent intersection types and strong normalisation.",
            "Step-Indexed Relational Reasoning for Countable Nondeterminism.",
            "Satisfiability Games for Branching-Time Logics.",
            "Incarnation in Ludics and maximal cliques of paths.",
            "Implicit Resolution.",
            "Relation lifting, with an application to the many-valued cover modality.",
            "Polynomial Path Orders.",
            "Priced Timed Petri Nets.",
            "All Linear-Time Congruences for Familiar Operators.",
            "Definability of linear equation systems over groups and rings.",
            "Avoiding Shared Clocks in Networks of Timed Automata.",
            "Products of effective topological spaces and a uniformly computable Tychonoff Theorem.",
            "Approximation systems for functions in topological and in metric spaces.",
            "Coalgebraic Trace Semantics for Continuous Probabilistic Transition Systems.",
            "Epistemic Updates on Algebras.",
            "Expansions of MSO by cardinality relations.",
            "Compact manifolds with computable boundaries.",
            "Nominal Coalgebraic Data Types with Applications to Lambda Calculus.",
            "Ordered Models of the Lambda Calculus.",
            "Modeling and Verification of Infinite Systems with Resources.",
            "Handling Algebraic Effects.",
            "Herbrand-Confluence.",
            "Strong Turing Degrees for Additive BSS RAM's.",
            "Undecidable First-Order Theories of Affine Geometries."
        ]
    },
    {
        "name": "LMCS",
        "year": "2012",
        "info": "Volume 8: 2012",
        "count": 99,
        "papers": [
            "Coupling policy iteration with semi-definite relaxation to compute accurate numerical invariants in static analysis.",
            "Formal proofs in real algebraic geometry: from ordered fields to quantifier elimination.",
            "On completeness of reducibility candidates as a semantics of strong normalization.",
            "A type reduction theory for systems with replicated components.",
            "An extension of data automata that captures XPath.",
            "Ground interpolation for the theory of equality.",
            "Absorbing Subalgebras, Cyclic Terms, and the Constraint Satisfaction Problem.",
            "A dependent nominal type theory.",
            "Semantics and Algorithms for Parametric Monitoring.",
            "Realizability algebras II : new models of ZF + DC.",
            "Scalar System F for Linear-Algebraic Lambda-Calculus: Towards a Quantum Physical Logic.",
            "Type-elimination-based reasoning for the description logic SHIQbs using decision diagrams and disjunctive datalog.",
            "Büchi Complementation and Size-Change Termination.",
            "QRB-Domains and the Probabilistic Powerdomain.",
            "Two-Variable Logic with Two Order Relations.",
            "Deciding Kleene Algebras in Coq.",
            "Typing Copyless Message Passing.",
            "A Bi-Directional Refinement Algorithm for the Calculus of (Co)Inductive Constructions.",
            "Derivation Lengths Classification of Gödel's T Extending Howard's Assignment.",
            "Theorem proving for prenex Gödel logic with Delta: checking validity and unsatisfiability.",
            "Alternating register automata on finite words and trees.",
            "The rapid points of a complex oscillation.",
            "On Global Types and Multi-Party Session.",
            "Formal Theories for Linear Algebra.",
            "Static Analysis of Run-Time Errors in Embedded Real-Time Parallel C Programs.",
            "On the Parameterized Intractability of Monadic Second-Order Logic.",
            "Preservation of Strong Normalisation modulo permutations for the structural lambda-calculus.",
            "On Irrelevance and Algorithmic Equality in Predicative Type Theory.",
            "A Synthesis of the Procedural and Declarative Styles of Interactive Theorem Proving.",
            "A Reduction-Preserving Completion for Proving Confluence of Non-Terminating Term Rewriting Systems.",
            "Tree-width for first order formulae.",
            "Extended Initiality for Typed Abstract Syntax.",
            "Barriers in Concurrent Separation Logic: Now With Tool Support!",
            "Intuitionistic implication makes model checking hard.",
            "Quantifier-Free Interpolation of a Theory of Arrays.",
            "Secure the Clones.",
            "Modes of Convergence for Term Graph Rewriting.",
            "On the equivalence of game and denotational semantics for the probabilistic mu-calculus.",
            "Width and size of regular resolution proofs.",
            "Refining Inductive Types.",
            "Dynamic Dependency Pairs for Algebraic Functional Systems.",
            "Model Checking Vector Addition Systems with one zero-test.",
            "Generic Fibrational Induction.",
            "Untyping Typed Algebras and Colouring Cyclic Linear Logic.",
            "General Bindings and Alpha-Equivalence in Nominal Isabelle.",
            "Precompact Apartness Spaces.",
            "Generalized Craig Interpolation for Stochastic Boolean Satisfiability Problems with Applications to Probabilistic State Reachability and Region Stability.",
            "Automata-Based CSL Model Checking.",
            "Software Model Checking with Explicit Scheduler and Symbolic Threads.",
            "The Relationship Between Separation Logic and Implicit Dynamic Frames.",
            "Completeness for the coalgebraic cover modality.",
            "Efficient Interpolant Generation in Satisfiability Modulo Linear Integer Arithmetic.",
            "Soundness of Unravelings for Conditional Term Rewriting Systems via Ultra-Properties Related to Linearity.",
            "Formalizing Randomized Matching Algorithms.",
            "Finite dimensional Hilbert spaces are complete for dagger compact closed categories.",
            "Bounded Arithmetic in Free Logic.",
            "Isomorphisms of types in the presence of higher-order references (extended version).",
            "Pseudo-finite hard instances for a student-teacher game with a Nisan-Wigderson generator.",
            "A Complete Axiom System for Propositional Interval Temporal Logic with Infinite Time.",
            "On logical hierarchies within FO2-definable languages.",
            "On Constructor Rewrite Systems and the Lambda Calculus.",
            "On the Scope of the Universal-Algebraic Approach to Constraint Satisfaction.",
            "Strongly Complete Logics for Coalgebras.",
            "Point-Separable Classes of Simple Computable Planar Curves.",
            "Canonized Rewriting and Ground AC Completion Modulo Shostak Theories : Design and Implementation.",
            "Transfer Function Synthesis without Quantifier Elimination.",
            "Weak Alternating Timed Automata.",
            "Wreath Products of Forest Algebras, with Applications to Tree Logics.",
            "Model-Checking of Ordered Multi-Pushdown Automata.",
            "Model Checking the Quantitative mu-Calculus on Linear Hybrid Systems.",
            "Two for the Price of One: Lifting Separation Logic Assertions.",
            "Reachability Analysis of Communicating Pushdown Systems.",
            "Degrees of Lookahead in Regular Infinite Games.",
            "Predicate Generation for Learning-Based Quantifier-Free Loop Invariant Inference.",
            "Piecewise testable tree languages.",
            "Applying CEGAR to the Petri Net State Equation.",
            "Forward Analysis for WSTS, Part II: Complete WSTS.",
            "Invariant Generation through Strategy Iteration in Succinctly Represented Control Flow Graphs.",
            "Uniform Reduction to SAT.",
            "Boolean Circuits as a Data Structure for Boolean Functions: Efficient Algorithms and Hard Problems.",
            "First steps in synthetic guarded domain theory: step-indexing in the topos of trees.",
            "Linear-use CPS translations in the Enriched Effect Calculus.",
            "Full Abstraction for the Resource Lambda Calculus with Tests, through Taylor Expansion.",
            "On streams that are finitely red.",
            "Essential Convexity and Complexity of Semi-Algebraic Constraints.",
            "Parameterised Multiparty Session Types.",
            "On Berry's conjectures about the stable order in PCF.",
            "Off-line test selection with test purposes for non-deterministic timed automata.",
            "Petri Net Reachability Graphs: Decidability Status of First Order Properties.",
            "Efficient Parallel Path Checking for Linear-Time Temporal Logic With Past and Bounds.",
            "Linear Dependent Types and Relative Completeness.",
            "Complete Axiomatizations of Fragments of Monadic Second-Order Logic on Finite Trees.",
            "Adaptable processes.",
            "Environment and classical channels in categorical quantum mechanics.",
            "On computable approximations of Landau's constant.",
            "The Structure of Differential Invariants and Differential Cut Elimination.",
            "A Complete Axiomatization of Quantified Differential Dynamic Logic for Distributed Hybrid Systems.",
            "Probabilistic modal μ-calculus with independent product.",
            "Continuous Markovian Logics - Axiomatization and Quantified Metatheory."
        ]
    },
    {
        "name": "LMCS",
        "year": "2011",
        "info": "Volume 7: 2011",
        "count": 67,
        "papers": [
            "Algebraic Notions of Termination.",
            "Semantics of Typed Lambda-Calculus with Constructors.",
            "Efficiently Simulating Higher-Order Arithmetic by a First-Order Theory Modulo.",
            "Generic Modal Cut Elimination Applied to Conditional Logics.",
            "Terminating Tableaux for Graded Hybrid Logic with Global Modalities and Role Hierarchies.",
            "A Focused Sequent Calculus Framework for Proof Search in Pure Type Systems.",
            "A calculus for costed computations.",
            "From coinductive proofs to exact real arithmetic: theory and applications.",
            "Functional Interpretations of Intuitionistic Linear Logic.",
            "Equality Saturation: A New Approach to Optimization.",
            "Psi-calculi: a framework for mobile processes with nominal data and logic.",
            "Model Checking of Continuous-Time Markov Chains Against Timed Automata Specifications.",
            "Relating coalgebraic notions of bisimulation.",
            "Being Van Kampen is a universal property.",
            "Semantics of Higher-Order Recursion Schemes.",
            "From formulas to cirquents in computability logic.",
            "Existential witness extraction in classical realizability and via a negative translation.",
            "CFA2: a Context-Free Approach to Control-Flow Analysis.",
            "A Modular Type-checking algorithm for Type Theory with Singleton Types and Proof Irrelevance.",
            "Decidable Expansions of Labelled Linear Orderings.",
            "Automated Synthesis of Tableau Calculi.",
            "Symbolic and Asynchronous Semantics via Normalized Coalgebras.",
            "On the Correspondence between Display Postulates and Deep Inference in Nested Sequent Calculi for Tense Logics.",
            "Finitely generated free Heyting algebras via Birkhoff duality and coalgebra.",
            "Towards a Proof Theory of Gödel Modal Logics.",
            "Banach Spaces as Data Types.",
            "Model Checking CTL is Almost Always Inherently Sequential.",
            "Ludics with repetitions (Exponentials, Interactive types and Completeness).",
            "Knowledge-Based Synthesis of Distributed Systems Using Event Structures.",
            "Noncomputable functions in the Blum-Shub-Smale model.",
            "Logical Step-Indexed Logical Relations.",
            "Amortised Resource Analysis with Separation Logic.",
            "TRX: A Formally Verified Parser Interpreter.",
            "Turing machines on represented sets, a model of computation for Analysis.",
            "First-order query evaluation on structures of bounded degree.",
            "The Derivational Complexity Induced by the Dependency Pair Method.",
            "Realizability algebras: a program to well order R.",
            "EXPTIME Tableaux for the Coalgebraic mu-Calculus.",
            "Monotonicity Constraints for Termination in the Integer Domain.",
            "Co-c.e. spheres and cells in computable metric spaces.",
            "Constraint solving in non-permutative nominal abstract syntax.",
            "Permission-Based Separation Logic for Message-Passing Concurrency.",
            "Conway games, algebraically and coalgebraically.",
            "Answering Non-Monotonic Queries in Relational Data Exchange.",
            "Real Analytic Machines and Degrees: A Topological View on Algebraic Limiting Computation.",
            "Logical Concurrency Control from Sequential Proofs.",
            "On the mathematical synthesis of equational logics.",
            "Composition with Target Constraints.",
            "Randomisation and Derandomisation in Descriptive Complexity Theory.",
            "Finiteness spaces, graphs and \"coherence\".",
            "Algorithmic Randomness and Capacity of Closed Sets.",
            "Attacker Control and Impact for Confidentiality and Integrity.",
            "Kripke Semantics for Martin-Löf's Extensional Type Theory.",
            "Formalization of Abstract State Transition Systems for SAT.",
            "The Complexity of Nash Equilibria in Stochastic Multiplayer Games.",
            "Nested Hoare Triples and Frame Rules for Higher-order Store.",
            "Power of Randomization in Automata on Infinite Strings.",
            "An Exponential Lower Bound for the Latest Deterministic Strategy Iteration Algorithms.",
            "Computational Models of Certain Hyperspaces of Quasi-metric Spaces.",
            "Computational Models of Certain Hyperspaces of Quasi-metric Spaces.",
            "A decidable characterization of locally testable tree languages.",
            "Context-Bounded Analysis For Concurrent Programs With Dynamic Creation of Threads.",
            "Proof-irrelevant model of CC with predicative induction and judgmental equality.",
            "The Complexity of Rooted Phylogeny Problems.",
            "A note on the expressive power of linear orders.",
            "Timed Parity Games: Complexity and Robustness.",
            "Complexity of Model Checking Recursion Schemes for Fragments of the Modal Mu-Calculus."
        ]
    },
    {
        "name": "LMCS",
        "year": "2010",
        "info": "Volume 6: 2010",
        "count": 49,
        "papers": [
            "O-Minimal Hybrid Reachability Games.",
            "A Graph Model for Imperative Computation.",
            "Bifinite Chu Spaces.",
            "Guarded Second-Order Logic, Spanning Trees, and Network Flows.",
            "Weighted Logics for Nested Words and Algebraic Formal Power Series.",
            "On the Sets of Real Numbers Recognized by Finite Automata in Multiple Bases.",
            "Infinitary Combinatory Reduction Systems: Normalising Reduction Strategies.",
            "Orthomodular lattices, Foulis Semigroups and Dagger Kernel Categories.",
            "On the Monadic Second-Order Transduction Hierarchy.",
            "Analytic Tableaux for Simple Type Theory and its First-Order Fragment.",
            "Redundancy, Deduction Schemes, and Minimum-Size Bases for Association Rules.",
            "Transforming Outermost into Context-Sensitive Rewriting.",
            "Lazy Evaluation and Delimited Control.",
            "Size-Change Termination, Monotonicity Constraints and Ranking Functions.",
            "Classical BI: Its Semantics and Proof Theory.",
            "Automatic Modular Abstractions for Template Numerical Constraints.",
            "Positive Supercompilation for a Higher-Order Call-By-Value Language.",
            "Automated Verification of Practical Garbage Collectors.",
            "Spatial logics with connectedness predicates.",
            "Termination of Rewriting with Right-Flat Rules Modulo Permutative Theories.",
            "Domain Representable Spaces Defined by Strictly Positive Induction.",
            "Expressiveness and Closure Properties for Quantitative Languages.",
            "Acyclic Solos and Differential Interaction Nets.",
            "A Proof Theoretic Analysis of Intruder Theories.",
            "Algorithms for Game Metrics (Full Version).",
            "Sampled Semantics of Timed Automata.",
            "Initial Algebra Semantics for Cyclic Sharing Tree Structures.",
            "Propositional Dynamic Logic for Message-Passing Systems.",
            "Unification in the Description Logic EL.",
            "Modularity of Convergence and Strong Convergence in Infinitary Rewriting.",
            "Interactive Learning-Based Realizability for Heyting Arithmetic with EM1.",
            "Local Termination: theory and practice.",
            "Well-definedness of Streams by Transformation and Termination.",
            "The General Vector Addition System Reachability Problem by Presburger Inductive Invariants.",
            "Non-Deterministic Kleene Coalgebras.",
            "Weak omega-categories from intensional type theory.",
            "On Second-Order Monadic Monoidal and Groupoidal Quantifiers.",
            "Tree Languages Defined in First-Order Logic with One Quantifier Alternation.",
            "A Model of Cooperative Threads.",
            "Game semantics for first-order logic.",
            "The complexity of global cardinality constraints.",
            "Refinement Types for Logical Frameworks and Their Interpretation as Proof Irrelevance.",
            "An Explicit Framework for Interaction Nets.",
            "Bounded Linear Logic, Revisited.",
            "A Logical Foundation for Environment Classifiers.",
            "The complexity of linear-time temporal logic over the class of ordinals.",
            "Backward Reachability of Array-based Systems by SMT solving: Termination and Invariant Synthesis.",
            "On the meaning of logical completeness.",
            "On Constructive Connectives and Systems."
        ]
    },
    {
        "name": "LMCS",
        "year": "2009",
        "info": "Volume 5: 2009",
        "count": 40,
        "papers": [
            "The Complexity of Generalized Satisfiability for Linear Temporal Logic.",
            "Beyond Language Equivalence on Visibly Pushdown Automata.",
            "The Safe Lambda Calculus.",
            "The Complexity of Datalog on Linear Orders.",
            "Antichains for the Automata-Based Approach to Model-Checking.",
            "Cut-Simulation and Impredicativity.",
            "On tiered small jump operators.",
            "A Faithful Semantics for Generalised Symbolic Trajectory Evaluation.",
            "Neighbourhood Structures: Bisimilarity and Basic Model Theory.",
            "A Generic Framework for Reasoning about Dynamic Networks of Infinite-State Processes.",
            "Footprints in Local Reasoning.",
            "The Church Problem for Countable Ordinals.",
            "The Omega Rule is Π11-Complete in the λβ-Calculus.",
            "Qualitative Logics and Equivalences for Probabilistic Systems.",
            "Ranking Functions for Size-Change Termination II.",
            "Solving Simple Stochastic Games with Few Random Vertices.",
            "Polynomial Size Analysis of First-Order Shapely Functions.",
            "Continuation-Passing Style and Strong Normalisation for Intuitionistic Sequent Calculi.",
            "Simulating reachability using first-order logic with applications to verification of linked data structures.",
            "Universal Structures and the logic of Forbidden Patterns.",
            "Programs as polygraphs: computability and complexity.",
            "Explicit fairness in testing semantics.",
            "Formalising the pi-calculus using nominal logic.",
            "A Theory of Explicit Substitutions with Safe and Full Composition.",
            "Decidability of higher-order matching.",
            "Lindström theorems for fragments of first-order logic.",
            "Structure Theorem and Strict Alternation Hierarchy for FO^2 on Words.",
            "Two-Way Unary Temporal Logic over Trees.",
            "RPO, Second-order Contexts, and Lambda-calculus.",
            "Relational Parametricity for Computational Effects.",
            "Full abstraction for nominal general references.",
            "Representations of Stream Processors Using Nested Fixed Points.",
            "Applications of Metric Coinduction.",
            "A rich hierarchy of functionals of finite types.",
            "A Type System For Call-By-Name Exceptions.",
            "A Step-indexed Semantics of Imperative Objects.",
            "Infinitary Combinatory Reduction Systems: Confluence.",
            "The Complexity of Infinite Computations In Models of Set Theory.",
            "Computation Tree Logic with Deadlock Detection.",
            "Observational Equivalence and Full Abstraction in the Symmetric Interaction Combinators."
        ]
    },
    {
        "name": "LMCS",
        "year": "2008",
        "info": "Volume 4: 2008",
        "count": 48,
        "papers": [
            "Are there Hilbert-style Pure Type Systems?",
            "Lambda-RBAC: Programming with Role-Based Access Control.",
            "Call-by-Value Termination in the Untyped lambda-Calculus.",
            "Generative Unbinding of Names.",
            "Lower Bounds for Complementation of omega-Automata Via the Full Automata Technique.",
            "Independence and Concurrent Separation Logic.",
            "Algebraic Pattern Matching in Join Calculus.",
            "An Application of the Feferman-Vaught Theorem to Automata and Logics for Words over an Infinite Alphabet.",
            "Normalisation Control in Deep Inference via Atomic Flows.",
            "Normalization of IZF with Replacement.",
            "Approximating a Behavioural Pseudometric without Discount for Probabilistic Systems.",
            "Semi-Continuous Sized Types and Termination.",
            "A Distribution Law for CCS and a New Congruence Result for the p-calculus.",
            "A Lower Bound on Web Services Composition.",
            "Relational Parametricity and Separation Logic.",
            "On the Expressiveness and Complexity of ATL.",
            "Visibly Tree Automata with Memory and Constraints.",
            "Model Checking One-Clock Priced Timed Automata.",
            "Enriched µ-Calculi Module Checking.",
            "Canonical Calculi with (n, k)-ary Quantifiers.",
            "Exhaustible Sets in Higher-type Computation.",
            "Separability in the Ambient Logic.",
            "Extracting Programs from Constructive HOL Proofs via IZF Set-Theoretic Semantics.",
            "Coinductive Formal Reasoning in Exact Real Arithmetic.",
            "Game Refinement Relations and Metrics.",
            "Consistency and Completeness of Rewriting in the Calculus of Constructions.",
            "Rational Streams Coalgebraically.",
            "Proving Noninterference by a Fully Complete Translation to the Simply Typed Lambda-Calculus.",
            "The Complexity of Enriched Mu-Calculi.",
            "Model Checking Probabilistic Timed Automata with One or Two Clocks.",
            "On the Strength of Proof-irrelevant Type Theories.",
            "Interpolation in Local Theory Extensions.",
            "Logical Reasoning for Higher-Order Functions with Local State.",
            "Bisimilarity and Behaviour-Preserving Reconfigurations of Open Petri Nets.",
            "Characterising Testing Preorders for Finite Probabilistic Processes.",
            "Light Logics and the Call-by-Value Lambda Calculus.",
            "Flow Faster: Efficient Decision Algorithms for Probabilistic Simulations.",
            "Recursive Concurrent Stochastic Games.",
            "Multi-Objective Model Checking of Markov Decision Processes.",
            "Compactly Accessible Categories and Quantum Key Distribution.",
            "Coalgebraic Automata Theory: Basic Results.",
            "First-Order and Temporal Logics for Nested Words.",
            "A Rational Deconstruction of Landin's SECD Machine with the J Operator.",
            "Resolution Trees with Lemmas: Resolution Refinements that Characterize DLL Algorithms with Clause Learning.",
            "Symbolic Backwards-Reachability Analysis for Higher-Order Pushdown Systems.",
            "The Wadge Hierarchy of Deterministic Tree Languages.",
            "On the Expressive Power of 2-Stack Visibly Pushdown Automata.",
            "Bootstrapping Inductive and Coinductive Types in HasCASL."
        ]
    },
    {
        "name": "LMCS",
        "year": "2007",
        "info": "Volume 3: 2007",
        "count": 35,
        "papers": [
            "Dense-Timed Petri Nets: Checking Zenoness, Token liveness and Boundedness.",
            "Cores of Countably Categorical Structures.",
            "Expressiveness of Metric modalities for continuous time.",
            "Logic Meets Algebra: the Case of Regular Languages.",
            "Predicate Abstraction with Under-Approximation Refinement.",
            "Structure and Problem Hardness: Goal Asymmetry and DPLL Proofs in SAT-Based Planning.",
            "Real-Time Model-Checking: Parameters everywhere.",
            "On the decidability and complexity of Metric Temporal Logic over finite words.",
            "Adventures in time and space.",
            "Predicate Abstraction via Symbolic Decision Procedures.",
            "Automatic Structures: Richness and Limitations.",
            "Automata with Nested Pebbles Capture First-Order Logic with Transitive Closure.",
            "Transforming structures by set interpretations.",
            "Bistable Biorders: A Sequential Domain Theory.",
            "On tractability and congruence distributivity.",
            "The Complexity of Model Checking Higher-Order Fixpoint Logic.",
            "A Finite Semantics of Simply-Typed Lambda Terms for Infinite Runs of Automata.",
            "Relating two standard notions of secrecy.",
            "Probabilistic Interval Temporal Logic and Duration Calculus with Infinite Intervals: Complete Proof Systems.",
            "Algorithms for Omega-Regular Games with Imperfect Information.",
            "From Nondeterministic Büchi and Streett Automata to Deterministic Parity Automata.",
            "A Normalizing Intuitionistic Set Theory with Inaccessible Sets.",
            "Inductive Definition and Domain Theoretic Properties of Fully Abstract Models for PCF and PCF+.",
            "Interpolant-Based Transition Relation Approximation.",
            "A Note on Shortest Developments.",
            "Interactive Small-Step Algorithms I: Axiomatization.",
            "Interactive Small-Step Algorithms II: Abstract State Machines and the Characterization Theorem.",
            "Model Checking Synchronized Products of Infinite Transition Systems.",
            "A Characterisation of First-Order Constraint Satisfaction Problems.",
            "Decisive Markov Chains.",
            "Coinductive Proof Principles for Stochastic Processes.",
            "The Church Synthesis Problem with Parameters.",
            "Verification of Ptime Reducibility for system F Terms: Type Inference in Dual Light Affine Logic.",
            "Generic Trace Semantics via Coinduction.",
            "A proof of strong normalisation using domain theory."
        ]
    },
    {
        "name": "LMCS",
        "year": "2006",
        "info": "Volume 2: 2006",
        "count": 29,
        "papers": [
            "Computably Based Locally Compact Spaces.",
            "Model Checking Probabilistic Pushdown Automata.",
            "Theories for TC0 and Other Small Complexity Classes.",
            "Approximate reasoning for real-time probabilistic processes.",
            "Algorithmic correspondence and completeness in modal logic. I. The core algorithm SQEMA.",
            "Extending the theory of Owicki and Gries with a logic of progress.",
            "Extending the Extensional Lambda Calculus with Surjective Pairing is Conservative.",
            "The monadic second-order logic of graphs XVI : Canonical graph decompositions.",
            "On the Expressiveness of the Ambient Logic.",
            "A System of Interaction and Structure II: The Need for Deep Inference.",
            "Modal Logics of Topological Relations.",
            "Context-Sensitive Languages, Rational Graphs and Determinism.",
            "On the complexity of XPath containment in the presence of disjunction, DTDs, and variables.",
            "Logics for Unranked Trees: An Overview.",
            "Relational Parametricity and Control.",
            "Resource Usage Analysis for the p-Calculus.",
            "Efficient Open World Reasoning for Planning.",
            "Tarski's influence on computer science.",
            "Generalized Majority-Minority Operations are Tractable.",
            "A State-Based Regression Formulation for Domains with Sensing Actions and Incomplete Information.",
            "From Proof Nets to the Free *-Autonomous Category.",
            "Combining decision procedures for the reals.",
            "Solution of a Problem of Barendregt on Sensible lambda-Theories.",
            "Positional Determinacy of Games with Infinitely Many Priorities.",
            "Semantics of Separation-Logic Typing and Higher-order Frame Rules for Algol-like Languages.",
            "Linear Abadi and Plotkin Logic.",
            "The Completeness of Propositional Resolution: A Simple and Constructive Proof.",
            "Elgot Algebras.",
            "Linear Encodings of Bounded LTL Model Checking."
        ]
    },
    {
        "name": "LMCS",
        "year": "2005",
        "info": "Volume 1: 2005",
        "count": 16,
        "papers": [
            "Labelled transition systems as a Stone space.",
            "Model-checking problems as a basis for parameterized intractability.",
            "Split-2 bisimilarity has a finite axiomatization over CCS with Hennessy's merge.",
            "Contextual equivalence for higher-order pi-calculus revisited.",
            "Linear datalog and bounded path duality of relational structures.",
            "The succinctness of first-order logic on linear orders.",
            "General recursion via coinductive types.",
            "Internalising modified realisability in constructive type theory.",
            "Strong normalization for applied lambda calculi.",
            "Comparing hierarchies of total functionals.",
            "An Operational Foundation for Delimited Continuations in the CPS Hierarchy.",
            "Deciding Quantifier-Free Presburger Formulas Using Parameterized Solution Bounds.",
            "Probabilistic Algorithmic Knowledge.",
            "Security Policies as Membranes in Systems for Global Computing.",
            "Almost periodic functions, constructively.",
            "Modularizing the Elimination of r=0 in Kleene Algebra."
        ]
    },
    {
        "name": "LMCS",
        "year": "2011",
        "info": "Special Issue 25: RTA 2011",
        "count": 6,
        "papers": [
            "A Reduction-Preserving Completion for Proving Confluence of Non-Terminating Term Rewriting Systems.",
            "Quantifier-Free Interpolation of a Theory of Arrays.",
            "Modes of Convergence for Term Graph Rewriting.",
            "Dynamic Dependency Pairs for Algebraic Functional Systems.",
            "Soundness of Unravelings for Conditional Term Rewriting Systems via Ultra-Properties Related to Linearity.",
            "A Rewriting View of Simple Typing."
        ]
    },
    {
        "name": "LMCS",
        "year": "2011",
        "info": "Special Issue 24: TACAS 2011",
        "count": 7,
        "papers": [
            "Generalized Craig Interpolation for Stochastic Boolean Satisfiability Problems with Applications to Probabilistic State Reachability and Region Stability.",
            "Software Model Checking with Explicit Scheduler and Symbolic Threads.",
            "Efficient Interpolant Generation in Satisfiability Modulo Linear Integer Arithmetic.",
            "Canonized Rewriting and Ground AC Completion Modulo Shostak Theories : Design and Implementation.",
            "Predicate Generation for Learning-Based Quantifier-Free Loop Invariant Inference.",
            "Applying CEGAR to the Petri Net State Equation.",
            "Off-line test selection with test purposes for non-deterministic timed automata."
        ]
    },
    {
        "name": "LMCS",
        "year": "2010",
        "info": "Special Issue 23: TYPES 2010",
        "count": 9,
        "papers": [
            "Formal proofs in real algebraic geometry: from ordered fields to quantifier elimination.",
            "On completeness of reducibility candidates as a semantics of strong normalization.",
            "A dependent nominal type theory.",
            "Scalar System F for Linear-Algebraic Lambda-Calculus: Towards a Quantum Physical Logic.",
            "Deciding Kleene Algebras in Coq.",
            "A Bi-Directional Refinement Algorithm for the Calculus of (Co)Inductive Constructions.",
            "On Irrelevance and Algorithmic Equality in Predicative Type Theory.",
            "A Synthesis of the Procedural and Declarative Styles of Interactive Theorem Proving.",
            "On streams that are finitely red."
        ]
    },
    {
        "name": "LMCS",
        "year": "2010",
        "info": "Special Issue 22: CSL 2010",
        "count": 6,
        "papers": [
            "Randomisation and Derandomisation in Descriptive Complexity Theory.",
            "Two-Variable Logic with Two Order Relations.",
            "Theorem proving for prenex Gödel logic with Delta: checking validity and unsatisfiability.",
            "Formal Theories for Linear Algebra.",
            "Generic Fibrational Induction.",
            "Untyping Typed Algebras and Colouring Cyclic Linear Logic."
        ]
    },
    {
        "name": "LMCS",
        "year": "2010",
        "info": "Special Issue 21: ICDT 2010",
        "count": 4,
        "papers": [
            "Answering Non-Monotonic Queries in Relational Data Exchange.",
            "Composition with Target Constraints.",
            "The Complexity of Rooted Phylogeny Problems.",
            "Alternating register automata on finite words and trees."
        ]
    },
    {
        "name": "LMCS",
        "year": "2010",
        "info": "Special Issue 20: CCA 2010",
        "count": 8,
        "papers": [
            "Banach Spaces as Data Types.",
            "Noncomputable functions in the Blum-Shub-Smale model.",
            "Turing machines on represented sets, a model of computation for Analysis.",
            "Co-c.e. spheres and cells in computable metric spaces.",
            "Real Analytic Machines and Degrees: A Topological View on Algebraic Limiting Computation.",
            "Algorithmic Randomness and Capacity of Closed Sets.",
            "Computational Models of Certain Hyperspaces of Quasi-metric Spaces.",
            "Computational Models of Certain Hyperspaces of Quasi-metric Spaces."
        ]
    },
    {
        "name": "LMCS",
        "year": "2009",
        "info": "Special Issue 19: TABLEAUX 2009",
        "count": 7,
        "papers": [
            "Backward Reachability of Array-based Systems by SMT solving: Termination and Invariant Synthesis.",
            "On Constructive Connectives and Systems.",
            "Generic Modal Cut Elimination Applied to Conditional Logics.",
            "Terminating Tableaux for Graded Hybrid Logic with Global Modalities and Role Hierarchies.",
            "Automated Synthesis of Tableau Calculi.",
            "On the Correspondence between Display Postulates and Deep Inference in Nested Sequent Calculi for Tense Logics.",
            "Towards a Proof Theory of Gödel Modal Logics."
        ]
    },
    {
        "name": "LMCS",
        "year": "2009",
        "info": "Special Issue 18: RTA 2009",
        "count": 7,
        "papers": [
            "Transforming Outermost into Context-Sensitive Rewriting.",
            "A Proof Theoretic Analysis of Intruder Theories.",
            "Unification in the Description Logic EL.",
            "Modularity of Convergence and Strong Convergence in Infinitary Rewriting.",
            "Local Termination: theory and practice.",
            "Well-definedness of Streams by Transformation and Termination.",
            "An Explicit Framework for Interaction Nets."
        ]
    },
    {
        "name": "LMCS",
        "year": "2009",
        "info": "Special Issue 17: LICS 2009",
        "count": 8,
        "papers": [
            "The General Vector Addition System Reachability Problem by Presburger Inductive Invariants.",
            "Non-Deterministic Kleene Coalgebras.",
            "The complexity of global cardinality constraints.",
            "Psi-calculi: a framework for mobile processes with nominal data and logic.",
            "Model Checking of Continuous-Time Markov Chains Against Timed Automata Specifications.",
            "Ludics with repetitions (Exponentials, Interactive types and Completeness).",
            "Logical Step-Indexed Logical Relations.",
            "An Exponential Lower Bound for the Latest Deterministic Strategy Iteration Algorithms."
        ]
    },
    {
        "name": "LMCS",
        "year": "2009",
        "info": "Special Issue 16: CALCO 2009",
        "count": 6,
        "papers": [
            "Relating coalgebraic notions of bisimulation.",
            "Being Van Kampen is a universal property.",
            "Semantics of Higher-Order Recursion Schemes.",
            "Symbolic and Asynchronous Semantics via Normalized Coalgebras.",
            "Finitely generated free Heyting algebras via Birkhoff duality and coalgebra.",
            "Conway games, algebraically and coalgebraically."
        ]
    },
    {
        "name": "LMCS",
        "year": "2009",
        "info": "Special Issue 15: POPL 2009",
        "count": 7,
        "papers": [
            "Lazy Evaluation and Delimited Control.",
            "Automatic Modular Abstractions for Template Numerical Constraints.",
            "Classical BI: Its Semantics and Proof Theory.",
            "Positive Supercompilation for a Higher-Order Call-By-Value Language.",
            "Automated Verification of Practical Garbage Collectors.",
            "A Model of Cooperative Threads.",
            "Equality Saturation: A New Approach to Optimization."
        ]
    },
    {
        "name": "LMCS",
        "year": "2008",
        "info": "Special Issue 14: ICALP 2008",
        "count": 5,
        "papers": [
            "A Theory of Explicit Substitutions with Safe and Full Composition.",
            "A Type System For Call-By-Name Exceptions.",
            "Weighted Logics for Nested Words and Algebraic Formal Power Series.",
            "On the Sets of Real Numbers Recognized by Finite Automata in Multiple Bases.",
            "Tree Languages Defined in First-Order Logic with One Quantifier Alternation."
        ]
    },
    {
        "name": "LMCS",
        "year": "2008",
        "info": "Special Issue 13: FOSSACS 2008",
        "count": 3,
        "papers": [
            "Footprints in Local Reasoning.",
            "Solving Simple Stochastic Games with Few Random Vertices.",
            "RPO, Second-order Contexts, and Lambda-calculus."
        ]
    },
    {
        "name": "LMCS",
        "year": "2007",
        "info": "Special Issue 12: TCLA 2007",
        "count": 6,
        "papers": [
            "The Safe Lambda Calculus.",
            "On tiered small jump operators.",
            "The Omega Rule is Π11-Complete in the λβ-Calculus.",
            "Polynomial Size Analysis of First-Order Shapely Functions.",
            "Continuation-Passing Style and Strong Normalisation for Intuitionistic Sequent Calculi.",
            "Observational Equivalence and Full Abstraction in the Symmetric Interaction Combinators."
        ]
    },
    {
        "name": "LMCS",
        "year": "2007",
        "info": "Special Issue 11: LICS 2007",
        "count": 6,
        "papers": [
            "Exhaustible Sets in Higher-type Computation.",
            "Game Refinement Relations and Metrics.",
            "Characterising Testing Preorders for Finite Probabilistic Processes.",
            "First-Order and Temporal Logics for Nested Words.",
            "Two-Way Unary Temporal Logic over Trees.",
            "Full abstraction for nominal general references."
        ]
    },
    {
        "name": "LMCS",
        "year": "2007",
        "info": "Special Issue 10: CALCO 2007",
        "count": 5,
        "papers": [
            "Rational Streams Coalgebraically.",
            "Bisimilarity and Behaviour-Preserving Reconfigurations of Open Petri Nets.",
            "Bootstrapping Inductive and Coinductive Types in HasCASL.",
            "Neighbourhood Structures: Bisimilarity and Basic Model Theory.",
            "Applications of Metric Coinduction."
        ]
    },
    {
        "name": "LMCS",
        "year": "2007",
        "info": "Special Issue 9: FOSSACS 2007",
        "count": 11,
        "papers": [
            "Approximating a Behavioural Pseudometric without Discount for Probabilistic Systems.",
            "A Distribution Law for CCS and a New Congruence Result for the p-calculus.",
            "A Lower Bound on Web Services Composition.",
            "Relational Parametricity and Separation Logic.",
            "On the Expressiveness and Complexity of ATL.",
            "Visibly Tree Automata with Memory and Constraints.",
            "Model Checking One-Clock Priced Timed Automata.",
            "Enriched µ-Calculi Module Checking.",
            "Logical Reasoning for Higher-Order Functions with Local State.",
            "Symbolic Backwards-Reachability Analysis for Higher-Order Pushdown Systems.",
            "Formalising the pi-calculus using nominal logic."
        ]
    },
    {
        "name": "LMCS",
        "year": "2007",
        "info": "Special Issue 8: TACAS 2007",
        "count": 5,
        "papers": [
            "Model Checking Probabilistic Timed Automata with One or Two Clocks.",
            "Flow Faster: Efficient Decision Algorithms for Probabilistic Simulations.",
            "Multi-Objective Model Checking of Markov Decision Processes.",
            "Antichains for the Automata-Based Approach to Model-Checking.",
            "A Generic Framework for Reasoning about Dynamic Networks of Infinite-State Processes."
        ]
    },
    {
        "name": "LMCS",
        "year": "2006",
        "info": "Special Issue 7: ICALP 2006",
        "count": 6,
        "papers": [
            "Lambda-RBAC: Programming with Role-Based Access Control.",
            "Lower Bounds for Complementation of omega-Automata Via the Full Automata Technique.",
            "The Complexity of Enriched Mu-Calculi.",
            "Recursive Concurrent Stochastic Games.",
            "The Wadge Hierarchy of Deterministic Tree Languages.",
            "Decidability of higher-order matching."
        ]
    },
    {
        "name": "LMCS",
        "year": "2006",
        "info": "Special Issue 6: CSL 2006",
        "count": 8,
        "papers": [
            "A Finite Semantics of Simply-Typed Lambda Terms for Infinite Runs of Automata.",
            "Relating two standard notions of secrecy.",
            "Algorithms for Omega-Regular Games with Imperfect Information.",
            "The Church Synthesis Problem with Parameters.",
            "Verification of Ptime Reducibility for system F Terms: Type Inference in Dual Light Affine Logic.",
            "Normalization of IZF with Replacement.",
            "Semi-Continuous Sized Types and Termination.",
            "Universal Structures and the logic of Forbidden Patterns."
        ]
    },
    {
        "name": "LMCS",
        "year": "2006",
        "info": "Special Issue 5: LICS 2006",
        "count": 5,
        "papers": [
            "From Nondeterministic Büchi and Streett Automata to Deterministic Parity Automata.",
            "A Characterisation of First-Order Constraint Satisfaction Problems.",
            "Coinductive Proof Principles for Stochastic Processes.",
            "A proof of strong normalisation using domain theory.",
            "Independence and Concurrent Separation Logic."
        ]
    },
    {
        "name": "LMCS",
        "year": "2006",
        "info": "Special Issue 4: IJCAR 2006",
        "count": 6,
        "papers": [
            "Canonical Calculi with (n, k)-ary Quantifiers.",
            "Extracting Programs from Constructive HOL Proofs via IZF Set-Theoretic Semantics.",
            "Consistency and Completeness of Rewriting in the Calculus of Constructions.",
            "On the Strength of Proof-irrelevant Type Theories.",
            "Interpolation in Local Theory Extensions.",
            "Cut-Simulation and Impredicativity."
        ]
    },
    {
        "name": "LMCS",
        "year": "2005",
        "info": "Special Issue 3: CAV 2005",
        "count": 4,
        "papers": [
            "Linear Encodings of Bounded LTL Model Checking.",
            "Predicate Abstraction with Under-Approximation Refinement.",
            "Predicate Abstraction via Symbolic Decision Procedures.",
            "Interpolant-Based Transition Relation Approximation."
        ]
    },
    {
        "name": "LMCS",
        "year": "2005",
        "info": "Special Issue 2: LICS 2005",
        "count": 5,
        "papers": [
            "Relational Parametricity and Control.",
            "Tarski's influence on computer science.",
            "Generalized Majority-Minority Operations are Tractable.",
            "Semantics of Separation-Logic Typing and Higher-order Frame Rules for Algol-like Languages.",
            "On the decidability and complexity of Metric Temporal Logic over finite words."
        ]
    },
    {
        "name": "LMCS",
        "year": "2004",
        "info": "Special Issue 1: LICS 2004",
        "count": 5,
        "papers": [
            "The succinctness of first-order logic on linear orders.",
            "Deciding Quantifier-Free Presburger Formulas Using Parameterized Solution Bounds.",
            "Model Checking Probabilistic Pushdown Automata.",
            "Theories for TC0 and Other Small Complexity Classes.",
            "Automatic Structures: Richness and Limitations."
        ]
    }
]