[
    {
        "name": "LOGCOM",
        "year": "2022",
        "info": "Volume 32: 2022",
        "count": 20,
        "papers": [
            "Maximality of bi-intuitionistic propositional logic.",
            "Strictly join irreducible varieties of residuated lattices.",
            "Computability of glued manifolds.",
            "The first-order theory of the computably enumerable equivalence relations in the uncountable setting.",
            "On probabilistic argumentation and subargument-completeness.",
            "Truth tables for modal logics T and S4, by using three-valued non-deterministic level semantics.",
            "Modular non-deterministic semantics for T, TB, S4, S5 and more.",
            "Corrigendum to: Frame definability, canonicity and cut elimination in common sense modal predicate logics.",
            "Erratum to: Evaluative multiple revision based on core beliefs.",
            "Preface to the Special Issue from the 35th Italian Conference on Computational Logic (CILC 2020).",
            "A conditional, a fuzzy and a probabilistic interpretation of self-organizing maps.",
            "Declarative continuous reasoning in the cloud-IoT continuum.",
            "Calculi, countermodel generation and theorem prover for strong logics of counterfactual reasoning.",
            "A Labelling Semantics and Strong Admissibility for Weighted Argumentation Frameworks.",
            "3coSoKu and its declarative modeling.",
            "An ASP approach for arteries classification in CT scans.",
            "Modelling Ceteris Paribus Preferences with Deontic Logic.",
            "Arg2P: an argumentation framework for explainable intelligent systems.",
            "Satisfiability of constrained Horn clauses on algebraic data types: A transformation-based approach.",
            "Ensuring trustworthy and ethical behaviour in intelligent logical agents."
        ]
    },
    {
        "name": "LOGCOM",
        "year": "2021",
        "info": "Volume 31: 2021",
        "count": 87,
        "papers": [
            "Editorial.",
            "On computable aspects of algebraic and definable closure.",
            "Feedback hyperjump.",
            "Towards a proof theory for Henkin quantifiers.",
            "Hypersequent calculi for non-normal modal and deontic logics: countermodels and optimal complexity.",
            "Completeness theorems for first-order logic analysed in constructive type theory.",
            "On sharp and single-conclusion justification models.",
            "Constructive truth and falsity in Peano arithmetic.",
            "Finitism, imperative programs and primitive recursion.",
            "Knowledge of uncertain worlds: programming with logical constraints.",
            "On the correspondence between nested calculi and semantic systems for intuitionistic logics.",
            "Parameterized complexity of abduction in Schaefer's framework.",
            "The Axiom of Choice in computability theory and Reverse Mathematics with a cameo for the Continuum Hypothesis.",
            "Tracking computability of GPAC-generable functions.",
            "Categorical and algebraic aspects of the intuitionistic modal logic IEL - and its predicate extensions.",
            "About the characterization of a fine line that separates generalizations and boundary-case exceptions for the Second Incompleteness Theorem under semantic tableau deduction.",
            "Probability logic: A model-theoretic perspective.",
            "Type inhabitation of atomic polymorphism is undecidable.",
            "Complexity of finite-variable fragments of products with K.",
            "Probabilities of first-order sentences on sparse random relational structures: An application to definability on random CNF formulas.",
            "Access-based intuitionistic knowledge.",
            "Algorithmic properties of first-order superintuitionistic logics of finite Kripke frames in restricted languages.",
            "Algorithmic correspondence and canonicity for possibility semantics.",
            "NNIL-formulas revisited: Universal models and finite model property.",
            "On the strongest three-valued paraconsistent logic contained in classical logic and its dual.",
            "Operator algebras with hyperarithmetic theory.",
            "Extensional realizability for intuitionistic set theory.",
            "Abstract argumentation and the rational man.",
            "Preface.",
            "Intuitionistic multi-agent subatomic natural deduction for belief and knowledge.",
            "A forward internal calculus for model generation in S4.",
            "Interpolation for intermediate logics via injective nested sequents.",
            "Internal proof calculi for modal logics with separating conjunction.",
            "Labelled cyclic proofs for separation logic.",
            "Labelled calculi for quantified modal logics with definite descriptions.",
            "Uniform labelled calculi for preferential conditional logics based on neighbourhood semantics.",
            "A fully labelled proof system for intuitionistic modal logics.",
            "Reasoning in social settings.",
            "Classical term-modal logics.",
            "Reasoning about strategic voting in modal logic quickly becomes undecidable.",
            "No false grounds and topology of argumentation.",
            "Modeling legal conflict resolution based on dynamic logic.",
            "Games of influence.",
            "Logic of defeasible permission and its dynamics.",
            "A Talmudic norms approach to many-valued logic.",
            "ℋ-Colouring Dichotomy in Proof Complexity.",
            "Logics of formal inconsistency based on distributive involutive residuated lattices.",
            "Algorithmic properties of first-order modal logics of linear Kripke frames in restricted languages.",
            "Notions of indifference for genericity: Union sets and subsequence sets.",
            "An efficient reasoning method on logic programming using partial evaluation in vector spaces.",
            "Notes on conjunctive and Quasi degrees.",
            "Negation as a modality in a quantified setting.",
            "Handling inconsistency in partially preordered ontologies: the Elect method.",
            "Preface.",
            "Relating structure and power: Comonadic semantics for computational resources.",
            "On the behaviour of coalgebras with side effects and algebras with effectful iteration.",
            "Steps and traces.",
            "Fibrational bisimulations and quantitative reasoning: Extended version.",
            "Analog reducibility.",
            "A note on the asymptotic expressiveness of ZF and ZFC.",
            "Neighbourhood semantics and labelled calculus for intuitionistic infinitary logic.",
            "A strongly complete axiomatization of intuitionistic temporal logic.",
            "A recursion theoretic foundation of computation over real numbers.",
            "Logics of dependence and independence: The local variants.",
            "Topological semantics of conservativity and interpretability logics.",
            "Computational Errors and Suspension in a PWK Epistemic Agent.",
            "Modelling supra-classical logic in a Boltzmann neural network: I representation.",
            "EGG+: A graph grammar formalism with uncertain structure processing mechanism.",
            "Epistemic extensions of substructural inquisitive logics.",
            "Strategic coalitions in stochastic games.",
            "Dualities and algebraic geometry of Baire functions in non-classical logic.",
            "On the Turing complexity of learning finite families of algebraic structures.",
            "Preface of the special issue'Logic, argumentation and AI' in JLC.",
            "Lifting propositional proof compression algorithms to first-order logic.",
            "Frame definability, canonicity and cut elimination in common sense modal predicate logics.",
            "Group belief.",
            "Ambiguity and context learning in signalling games.",
            "A logic of knowledge based on abstract arguments.",
            "Experience and prediction: a metric of hardness for a novel litmus test.",
            "A study of continuous vector representations for theorem proving.",
            "Semirings of Evidence.",
            "Solovay functions and paradoxes.",
            "Guaranteeing Admissibility of Abstract Argumentation Frameworks with Rationality and Feasibility Constraints.",
            "Ideal related algebras and their logics.",
            "Logics for reasoning about degrees of confirmation.",
            "Paracomplete truth theory with KFS-definable determinateness.",
            "Modal Logics and Group Polarization."
        ]
    },
    {
        "name": "LOGCOM",
        "year": "2020",
        "info": "Volume 30: 2020",
        "count": 68,
        "papers": [
            "Special Issue on Logical Foundations of Computer Science.",
            "Modal logics with hard diamond-free fragments.",
            "An introduction to feedback Turing computability.",
            "On aggregating probabilistic evidence.",
            "Classical logic with Mendler induction.",
            "On the complexity of index sets for finite predicate logic programs which allow function symbols.",
            "Multiple conclusion linear logic: cut elimination and more.",
            "Lower bounds for the state complexity of probabilistic languages and the language of prime numbers.",
            "First-order justification logic with constant domain semantics.",
            "Type theoretical databases.",
            "Reconciling Lambek's restriction, cut-elimination and substitution in the presence of exponential modalities.",
            "Probabilistic justification logic.",
            "Cut elimination and complexity bounds for intuitionistic epistemic logic.",
            "Resource sharing linear logic.",
            "A cut-free labelled sequent calculus for dynamic epistemic logic.",
            "Embeddings of Bishop spaces.",
            "An arithmetic interpretation of intuitionistic verification.",
            "Definability in first-order theories of graph orderings ⋆.",
            "The complexity of disjunction in intuitionistic logic.",
            "Power Kripke-Platek set theory and the axiom of choice.",
            "The unreasonable effectiveness of Nonstandard Analysis.",
            "Equivariant ZFA and the foundations of nominal techniques.",
            "Recursive enumerability and elementary frame definability in predicate modal logic.",
            "Congruence-based proofs of the recognizability theorems for free many-sorted algebras.",
            "Standpoint semantics for polysemy in spatial prepositions.",
            "A multi-labelled sequent calculus for Topo-Logic.",
            "Decidability of affine solution problems.",
            "Losing connection: the modal logic of definable link deletion.",
            "Elementary cellular automata and self-referential paradoxes.",
            "Self-full ceers and the uniform join operator.",
            "Order polarities.",
            "Seventh ASPOCP International Workshop on 'Answer Set Programming and Other Computing Paradigms'.",
            "Computing secure sets in graphs using answer set programming.",
            "Optimum stable model search: algorithms and implementation.",
            "Action language ℬℭ+.",
            "Declarative encodings of acyclicity properties.",
            "The language of epistemic specifications (refined) including a prototype solver.",
            "The generalized orthomodularity property: configurations and pastings.",
            "Individual resource games and resource redistributions.",
            "On the different types of collective attacks in abstract argumentation: equivalence results for SETAFs.",
            "Sette's calculus P1 and some hierarchies of paraconsistent systems.",
            "A study of possible-worlds semantics of relevance-sensitive belief revision.",
            "Ordered models for concept representation.",
            "Rational coordination with no communication or conventions.",
            "Convergence, continuity, recurrence and Turing completeness in dynamic epistemic logic1.",
            "Space and time complexity for infinite time Turing machines.",
            "First-order swap structures semantics for some logics of formal inconsistency.",
            "On Scott's semantics for many-valued logic.",
            "Corrigendum to: Displaying updates in logic.",
            "Algorithmic properties of first-order modal logics of finite Kripke frames in restricted languages.",
            "A model-theoretic approach to descriptive general frames: the van Benthem characterization theorem.",
            "On uniform belief revision.",
            "Fraïssé-Hintikka theorem in institutions.",
            "Sublattices and Δ-blocks of orthomodular posets.",
            "Locally constant constructive functions and connectedness of intervals.",
            "A logic of blockchain updates.",
            "Open sets in computability theory and reverse mathematics.",
            "Herbrand Proofs and Expansion Proofs as Decomposed Proofs.",
            "Notions of Cauchyness and metastability.",
            "Founded semantics and constraint semantics of logic rules.",
            "Polyteam semantics.",
            "An abstract form of the first epsilon theorem.",
            "Justification awareness.",
            "Kripke-style Semantics and Completeness for Full Simply Typed Lambda Calculus.",
            "Multi-dimensional Interpretations of Presburger Arithmetic in Itself.",
            "Epistemic predicates in the arithmetical context.",
            "Explicit analyses of proof/refutation interaction for constructible falsity and Heyting-Brouwer logic.",
            "Editorial."
        ]
    },
    {
        "name": "LOGCOM",
        "year": "2019",
        "info": "Volume 29: 2019",
        "count": 57,
        "papers": [
            "Subframization and stabilization for superintuitionistic logics.",
            "On the connections between wttwttwttwttwtt- and QQ[Math Processing Error]Q-reducibilities.",
            "Diffusion in social networks with recalcitrant agents.",
            "Discrete duality for lattices with modal operators.",
            "An analysis of clausal coordination using synchronous tree adjoining grammar.",
            "Maximality in finite-valued Łukasiewicz logics defined by order filters.",
            "Trial and error mathematics: Dialectical systems and completions of theories.",
            "Erratum to: Editorial Reasons, argumentation and justification: DEON 2016 special issue.",
            "Editorial Reasons, argumentation and justification: DEON 2016 special issue.",
            "Structured argumentation with prioritized conditional obligations and permissions.",
            "Prioritized norms in formal argumentation.",
            "Enriching deontic logic.",
            "A temporal dynamic deontic logic.",
            "Coarse deontic logic.",
            "Special Issue 'deontic modalities in natural language' - selected and revised papers from the 12th International Conference on Deontic Logic and Normative Systems (DEON 2014).",
            "Fine-tuning natural language imperatives.",
            "In defence of deontic diversity.",
            "Chisholm's paradox and conditional oughts.",
            "Normative reasoning by sequent-based argumentation.",
            "Preface for the special issue of Proof, Structure, and Computation 2014.",
            "Well-definedness and observational equivalence for inductive-coinductive programs.",
            "Intuitionistic ancestral logic.",
            "Program extraction applied to monadic parsing.",
            "Parametrized bar recursion: a unifying framework for realizability interpretations of classical dependent choice.",
            "An analysis of the Podelski-Rybalchenko termination theorem via bar recursion.",
            "Modal operators and toric ideals.",
            "From Tarski to Gödel - or how to derive the second incompleteness theorem from the undefinability of truth without self-reference.",
            "Model checking and validity in propositional and modal inclusion logics.",
            "Logics based on linear orders of contaminating values.",
            "A bilateral Hilbert-style investigation of 2-intuitionistic logic.",
            "Towards automated reasoning in Herbrand structures.",
            "Automatic white-box testing of first-order logic ontologies.",
            "Substituting strict equivalents.",
            "|MTL|-algebras as rotations of basic hoops.",
            "Uniform interpolation for propositional and modal team logics.",
            "A temporal epistemic logic with a non-rigid set of agents for analyzing the blockchain protocol.",
            "The fixed point property and a technique to harness double fixed point combinators.",
            "On the satisfiability problem for fragments of two-variable logic with one transitive relation.",
            "A comparative analysis and improvement of MaxSAT encodings for coalition structure generation under MC-nets.",
            "Effective aspects of Bernoulli randomness.",
            "A logic of efficient and optimal designs.",
            "Taking the path computably traveled.",
            "A logic of hypothetical conjunction.",
            "Introduction to the special issue.",
            "The probabilistic logic of communication and change.",
            "Coalition logic with individual, distributed and common knowledge1.",
            "Program models and semi-public environments.",
            "Topological facets of the logic of subset spaces (with emphasis on canonical models).",
            "Reasoning about opinion dynamics in social networks.",
            "The power of modal separation logics.",
            "Definable inapproximability: new challenges for duplicator.",
            "Symbolic model checking of public announcement protocols.",
            "A substructural epistemic resource logic: theory and modelling applications.",
            "The Influence of the Test Operator on the Expressive Power of PDL-like Logics.",
            "Formula size games for modal logic and μ-calculus.",
            "A proof-theoretic study of abstract termination principles.",
            "Pseudo-BCI algebras with derivations."
        ]
    },
    {
        "name": "LOGCOM",
        "year": "2018",
        "info": "Volume 28: 2018",
        "count": 66,
        "papers": [
            "Implementing fragments of ZFC within an r.e. Universe.",
            "Shapely monads and analytic functors.",
            "Not only size, but also shape counts: abstract argumentation solvers are benchmark-sensitive.",
            "Modal correspondence theory in the class of all Euclidean frames.",
            "The universal homogeneous binary tree.",
            "A proof-theoretic study of bi-intuitionistic propositional sequent calculus.",
            "On the computational complexity of detecting possibilistic locality.",
            "Symbolic possibilistic logic: completeness and inference methods.",
            "Fuzzy approach to quantum Fredkin gate.",
            "Editorial Logic, Rationality and Interaction (LORI-5): Introduction to the Special Issue.",
            "Modal logics of sabotage revisited.",
            "Formulating semantics of probabilistic argumentation by characterizing subgraphs: theory and empirical results.",
            "Learning to act: qualitative learning of deterministic action models.",
            "Symbolic model checking for Dynamic Epistemic Logic - S5 and beyond.",
            "Decidable temporal and sequential relevant logics.",
            "On the 'transitivity' of consequence relations.",
            "Tableaux for a combination of propositional dynamic logic and epistemic logic with interactions.",
            "Preface to the Special Issue on Computational Logic in Multi-Agent Systems (CLIMA XIV).",
            "The equivalence zoo for Dung-style semantics.",
            "Two-stage agent program verification.",
            "Combining transactions and automatic repairs.",
            "A temporal argumentation approach to cooperative planning using dialogues.",
            "Accumulative knowledge under bounded resources.",
            "Instantiating rule-based defeasible theories in abstract dialectical frameworks and beyond.",
            "Preface.",
            "Alternating-time temporal logic with resource bounds.",
            "Trust domains in system models: algebra, logic, utility, and combinators.",
            "Iteration-free PDL with storing, recovering and parallel composition: a complete axiomatization.",
            "A modal separation logic for resource dynamics.",
            "On fixpoint logics and equivalences for processes with restricted nondeterminism.",
            "A labelled sequent calculus for BBI: proof theory and proof search.",
            "Intuitionistic Modal Logic: A 15-year retrospective.",
            "Many-valued hybrid logic.",
            "Justification logic and audited computation.",
            "On an intuitionistic logic for pragmatics.",
            "Tree-sequent calculi and decision procedures for intuitionistic modal logics.",
            "Bisimulations for coalgebras on Stone spaces.",
            "Accelerating LTL satisfiability checking by SAT solvers.",
            "Stit logic of justification announcements: a completeness result.",
            "Flat modal fixpoint logics with the converse modality.",
            "From probabilities to categorical beliefs: Going beyond toy models.",
            "Hyper Natural Deduction for Gödel Logic - A natural deduction system for parallel reasoning.",
            "Interpolation in propositional Horn logic.",
            "The strength of SCT soundness.",
            "A note on phonological similarity in Tesar's (2014) theory of output-drivenness.",
            "Infinitary logic and basically disconnected compact Hausdorff spaces.",
            "The logic of identity and copy for computational artefacts.",
            "Computing the maximal Boolean complexity of families of Aristotelian diagrams.",
            "From the subformula property to cut-admissibility in propositional sequent calculi.",
            "Unified correspondence as a proof-theoretic tool.",
            "Satisfiability for relation-changing logics.",
            "Judgment aggregation in dynamic logic of propositional assignments.",
            "Strong jump inversion.",
            "Reasoning with maximal consistency by argumentative approaches.",
            "Proof search in a context-sensitive logic for molecular biology.",
            "Belief base rationalization for propositional merging.",
            "Backward induction in presence of cycles.",
            "Navigability with intermediate constraints.",
            "On the aggregation of argumentation frameworks: operators and postulates.",
            "Terminating sequent calculi for two intuitionistic modal logics.",
            "Introduction: Selected Papers from the 4th Workshop on Logic, Rationality and Interaction (LORI-4).",
            "Efficient minimal preference change.",
            "Commands changing obligations 1.",
            "Proof theory, semantics and algebra for normative systems.",
            "How to update neighbourhood models.",
            "Bisimulation characterization and expressivity hierarchy of languages for epistemic awareness models."
        ]
    },
    {
        "name": "LOGCOM",
        "year": "2017",
        "info": "Volume 27: 2017",
        "count": 95,
        "papers": [
            "Universality of quantum Turing machines with deterministic control.",
            "Unifying logics via context-sensitiveness.",
            "Layered graph logic as an assertion language for access control policy models.",
            "Completeness and termination for a Seligman-style tableau system.",
            "Boolean unification with predicates.",
            "Modal extensions of Łukasiewicz logic for modelling coalitional power.",
            "Four-valued modal logic: Kripke semantics and duality.",
            "A modal logic amalgam of classical and intuitionistic propositional logic.",
            "Paretian argumentation frameworks for Pareto optimal arguments.",
            "Judgement aggregation in multi-agent argumentation.",
            "Min-based possibilistic DL-Lite.",
            "On modal extensions of Product fuzzy logic.",
            "Rees coextensions of finite, negative tomonoids.",
            "Stochastic non-determinism and effectivity functions.",
            "A modal logic for reasoning about economic policies.",
            "Erratum to: A substructural logic for layered graphs.",
            "Preface.",
            "The abstract state machines method for modular design and analysis of programming languages.",
            "BDI: a new decidable clause class.",
            "KBOs, ordinals, subrecursive hierarchies and all that.",
            "Faulty sets of Boolean formulas and Łukasiewicz logic.",
            "Theorem proving for classical logic with partial functions by reduction to Kleene logic.",
            "A paramodulation-based calculus for refuting schemata of clause sets defined by rewrite rules.",
            "Reducing redundancy in cut-elimination by resolution.",
            "Editorial.",
            "The canonical FEP construction.",
            "Dual characterizations for finite lattices via correspondence theory for monotone modal logic.",
            "Sahlqvist preservation for topological fixed-point logic.",
            "Canonicity results for mu-calculi: an algorithmic approach.",
            "A Van Benthem/Rosen theorem for coalgebraic predicate logic.",
            "Sahlqvist theory for impossible worlds.",
            "Jónsson-style canonicity for ALBA-inequalities.",
            "On Sahlqvist theory for hybrid logics.",
            "Undecidable problems for modal definability.",
            "Unified correspondence and proof theory for strict implication.",
            "Computing prime implicates by pruning the search space and accelerating subsumption.",
            "Completeness for linear continuous logic.",
            "Equivalence closure in the two-variable guarded fragment.",
            "The first-order hypothetical logic of proofs.",
            "Implementing Courcelle's Theorem in a declarative framework for dynamic programming.",
            "Partial order reduction for checking LTL formulae with the next-time operator.",
            "AGM contraction is not reconstructible as a descriptor operation.",
            "Complete representation by partial functions for composition, intersection and anti-domain.",
            "Suppes-style sequent calculus for probability logic.",
            "Limit-agreeing to disagree.",
            "Knowledge in communication networks.",
            "A logic of sights.",
            "A minimalistic many-valued theory of types.",
            "Modal independence logic.",
            "A bimodal perspective on possibility semantics.",
            "Gödel-Rosser's Incompleteness Theorem, generalized and optimized for definable theories.",
            "Undecidability of the transitive graded modal logic with converse.",
            "A Substructural Modal Logic of Utility.",
            "The power of primitive positive definitions with polynomially many variables.",
            "Comparing the expressiveness of argumentation semantics.",
            "Logics with definitional reflection rules.",
            "Embedding from multilattice logic into classical logic and vice versa.",
            "Implicit Kripke semantics and ultraproducts in stratified institutions.",
            "Categorical comprehensions and recursion.",
            "Algebras of Information States.",
            "Universal logic and computation.",
            "From conventional to institution-independent logic programming.",
            "Downward Löwenheim-Skolem Theorem and interpolation in logics with constructors.",
            "How to identify, translate and combine logics?",
            "An institutional approach to positive coalgebraic logic.",
            "Paraconsistency in hybrid logic.",
            "Polynomial ring calculus for modalities.",
            "SMC: synthesis of uniform strategies and verification of strategic ability for multi-agent systems.",
            "CERES for first-order schemata.",
            "On directed simulations in description logics.",
            "Methods of class field theory to separate logics over finite residue classes and circuit complexity.",
            "On ensconcement and contraction.",
            "Fair decomposition of group obligations.",
            "On the characterization of fibred logics, with applications to conservativity and finite-valuedness.",
            "Argument Revision.",
            "One-step Heyting Algebras and Hypersequent Calculi with the Bounded Proof Property.",
            "The IMP game: Learnability, approximability and adversarial learning beyond $$\\Sigma^0_1$$.",
            "Characterizing logical consequence in many-valued logic.",
            "On the category of Nelson paraconsistent lattices.",
            "On the likelihood of normalization in combinatory logic.",
            "Relating first-order monadic omega-logic, propositional linear-time temporal logic, propositional generalized definitional reflection logic and propositional infinitary logic.",
            "A modal logic of knowledge, belief and estimation.",
            "Reliability-based preference dynamics: lexicographic upgrade.",
            "More for free: a dynamic epistemic framework for conformant planning over transition systems.",
            "Results in modal correspondence theory for possibility semantics.",
            "On the number of bipolar Boolean functions.",
            "Verification logic.",
            "Reified Input/Output logic: Combining Input/Output logic and Reification to represent norms coming from existing legislation.",
            "Hard and soft logical information.",
            "Equivalences between subcategories of MTL-algebras via Boolean algebras and prelinear semihoops.",
            "On the formal characterization of the FORTE_MBC theory revision operators.",
            "Pareto optimality and strategy-proofness in group argument evaluation.",
            "Combinatorics of $$\\lambda$$-terms: a natural approach.",
            "Iterated reflection over full disquotational truth.",
            "The lattice of congruences of a finite line frame."
        ]
    },
    {
        "name": "LOGCOM",
        "year": "2016",
        "info": "Volume 26: 2016",
        "count": 76,
        "papers": [
            "Foreword.",
            "Nested sequent calculi for normal conditional logics.",
            "Proof theory of witnessed Gödel logic: A negative result.",
            "Spoiled for choice?",
            "Paraconsistent set theory by predicating on consistency.",
            "Basic primal infon logic.",
            "Universality in two dimensions.",
            "A cut-free sequent system for Grzegorczyk logic, with an application to the Gödel-McKinsey-Tarski embedding.",
            "On matrices, Nmatrices and games.",
            "Realization using the model existence theorem.",
            "Relevant harmony.",
            "Logical foundations for bipolar and tripolar argumentation networks: preliminary results.",
            "An open logical framework.",
            "Semantic investigation of canonical Gödel hypersequent systems.",
            "Which style of reasoning to choose in the face of conflicting information?",
            "An Avron rule for fragments of R-mingle.",
            "ADC method of proof search for intuitionistic propositional natural deduction.",
            "Logic on the n-cube.",
            "Falsification, natural deduction and bi-intuitionistic logic.",
            "Binding modalities.",
            "Special Issue on Computational Logic in Honour of Roy Dyckhoff.",
            "Computational logic and the social.",
            "Views of proof-theoretic semantics: reified proof-theoretic meanings.",
            "Proof-theoretic semantics, paradoxes and the distinction between sense and denotation.",
            "Proof analysis beyond geometric theories: from rule systems to systems of rules.",
            "An extended framework for specifying and reasoning about proof systems.",
            "A multi-focused proof system isomorphic to expansion proofs.",
            "The formal strong completeness of partial monoidal Boolean BI.",
            "Proof automation for functional correctness in separation logic.",
            "A deep inference system with a self-dual binder which is complete for linear lambda calculus.",
            "A simple sequent calculus for nominal logic.",
            "A partial translation from λU to λ2.",
            "Coalgebraic logic programming: from Semantics to Implementation.",
            "The Frobenius anatomy of word meanings II: possessive relative pronouns.",
            "Description logics of context.",
            "Quasi-varieties and initial semantics for hybridized institutions.",
            "On constraint satisfaction problems below P.",
            "The collapse of the bounded width hierarchy.",
            "Non-transitive linear temporal logic and logical knowledge operations.",
            "Noise robustness and stochastic tolerance of OT error-driven ranking algorithms.",
            "Temporal logics on strings with prefix relation.",
            "On the Priorean temporal logic with [d] over the real line.",
            "Unifying F-logic molecules: a rectification to the original unification algorithm.",
            "Introduction to the special issue on Loops in Argumentation.",
            "Dilemmas and paradoxes: cycles in argumentation frameworks.",
            "The handling of loops in argumentation networks.",
            "Stage semantics and the SCC-recursive schema for argumentation semantics.",
            "On the acceptance of loops in argumentation frameworks.",
            "Beyond admissibility: accepting cycles in argumentation with game protocols for cogency criteria.",
            "Preferred semantics as socratic discussion.",
            "The role of self-attacking arguments in characterizations of equivalence notions.",
            "RP-DeLP: a weighted defeasible argumentation framework based on a recursive semantics.",
            "Ideal extensions as logical programming models.",
            "Ordering protoalgebraic logics.",
            "Conditional interchangeability of Nash equilibria.",
            "A complete axiomatization of a temporal logic with obligation and robustness.",
            "Multidimensional trees and a Chomsky-Schützenberger-Weir representation theorem for simple context-free tree grammars.",
            "Adaptive strategies and finite-conditional premise sets.",
            "A new coalgebraic Lindström theorem.",
            "Refinements of subatomic natural deduction.",
            "Faulty Belnap computers and subsystems of FDE.",
            "Equilibria interchangeability in cellular games.",
            "Relentful strategic reasoning in alternating-time temporal logic.",
            "Fast interpreter for logical reasoning in general game playing.",
            "A note on hereditarily Π10- and Σ10-complete sets of sentences.",
            "From rational Gödel logic to ultrametric logic.",
            "Algebraic semantics for a modal logic close to S1.",
            "Special issue on substructural logic and information dynamics: introduction.",
            "Epistemic extensions of modal distributive substructural logics.",
            "Epistemic logics for sceptical agents.",
            "Dynamic consequence for soft information.",
            "Displaying updates in logic.",
            "Dynamic epistemic logic in update logic.",
            "A proof-theoretic semantic analysis of dynamic epistemic logic.",
            "Multi-type display calculus for dynamic epistemic logic.",
            "Multi-type display calculus for propositional dynamic logic."
        ]
    },
    {
        "name": "LOGCOM",
        "year": "2015",
        "info": "Volume 25: 2015",
        "count": 58,
        "papers": [
            "Modal compact Hausdorff spaces.",
            "Bi-modal Gödel logic over [0, 1]-valued Kripke frames.",
            "Towards a uniform presentation of logical systems by indexed categories and adjoint situations.",
            "Initial semantics in logics with constructors.",
            "Reactive standard deontic logic.",
            "Forbidding undesirable agreements.",
            "Terminating sequent calculi for proving and refuting formulas in S4.",
            "Social network games.",
            "Introducing the Special Issue on 20 Years of Argument-Based Inference.",
            "Preference-based argumentation built from prioritized logic programming.",
            "Implementing crash-resistance and non-interference in logic-based argumentation.",
            "Formal semantics for perceptual classification.",
            "Using synchronous tree adjoining grammar to model the typology of bound variable pronouns.",
            "A small model theorem for the hybrid μ-calculus.",
            "Representing supererogation.",
            "Residuated Park theories.",
            "Quantifiers in logic and proof-search using permissive-nominal terms and sets.",
            "The logic and philosophy of information corner: Presentation and call for papers.",
            "Separating intermediate predicate logics of well-founded and dually well-founded structures by monadic sentences.",
            "Similarity and bisimilarity notions appropriate for characterizing indistinguishability in fragments of the calculus of relations.",
            "Trilattice logic: an embedding-based approach.",
            "Differential and integral calculus for logical operations. A matrix-vector approach.",
            "A game-theoretic approach to compute stable topologies in mobile ad hoc networks.",
            "The Univalence Axiom in posetal model categories.",
            "A Stone-Weierstrass theorem for MV-algebras and unital ℓ-groups.",
            "On generalizing the Nullstellensatz for MV algebras.",
            "The expressivity of update logics.",
            "Pedagogical lambda-cube: the λ2 case.",
            "Evaluative multiple revision based on core beliefs.",
            "The complexity of handling minimal solutions in logic-based abduction.",
            "Logics for some dynamic spaces-I.",
            "Logics for some dynamic spaces-II.",
            "Hierarchies in independence and inclusion logic with strict semantics.",
            "Set Graphs. V. On representing graphs as membership digraphs.",
            "Embedding the hypersequent calculus in the display calculus.",
            "Enumeration of the adjunctive hierarchy of hereditarily finite sets.",
            "Universal algebra for general aggregation theory: Many-valued propositional-attitude aggregators as MV-homomorphisms.",
            "Corrigendum and addendum to 'Universal algebra for general aggregation theory'.",
            "Computability in Europe 2010.",
            "Hairpin lengthening: language theoretic and algorithmic results.",
            "Haskell before Haskell: an alternative lesson in practical logics of the ENIAC.",
            "Recent complexity-theoretic results on P systems with active membranes.",
            "Counting the changes of random Δ20 sets.",
            "From mathematical logic to programming-language semantics: a discussion with Tony Hoare.",
            "A single-type logic for natural language.",
            "A Tribute to Marian Boykan Pour-El (1928-2009).",
            "A formalization of argumentation schemes for legal case-based reasoning in ASPIC+.",
            "Polynomially parsable unification grammars.",
            "The syntactic concept lattice: Another algebraic theory of the context-free languages?",
            "Blending margins: the modal logic K has nullary unification type.",
            "On deontic action logics based on Boolean algebra.",
            "Recent advances of research on Computational Logic in Italy (CILC 2012): In memoriam of Elio Lanzarone (1945-2011).",
            "Efficient generation of test data structures using constraint logic programming and program transformation.",
            "Multi-engine ASP solving with policy adaptation.",
            "Achieving completeness in the verification of action theories by Bounded Model Checking in ASP.",
            "Rank and simulation: the well-founded case.",
            "An ASP approach for the valves positioning optimization in a water distribution system.",
            "Elio Lanzarone: a life for science."
        ]
    },
    {
        "name": "LOGCOM",
        "year": "2014",
        "info": "Volume 24: 2014",
        "count": 53,
        "papers": [
            "Obligations with deadlines: a formalization in Dynamic Deontic Logic.",
            "Computer-aided decision-making with trust relations and trust domains (cryptographic applications).",
            "Attack-defense trees.",
            "Reasoning about delegation and revocation schemes in answer set programming.",
            "An axiomatization of ECTL.",
            "Tools for the robust analysis of error-driven ranking algorithms and their implications for modelling the child's acquisition of phonotactics.",
            "Detection and analysis of some redundancies in linear logic sequent proofs.",
            "Deduction-detachment theorem in hidden k-logics.",
            "Propositional primal logic with disjunction.",
            "A proof-theoretic analysis of the classical propositional matrix method.",
            "Review of Errors of Reasoning. Naturalizing the Logic of Inference, by John Woods.",
            "Grammars, Parsers and Recognizers.",
            "The most probable string: an algorithmic study.",
            "Prefix probabilities for linear context-free rewriting systems.",
            "Tree parsing for tree-adjoining machine translation.",
            "Efficient parallel CKY parsing using GPUs.",
            "A word clustering approach to domain adaptation: Robust parsing of source and target domains.",
            "Parse reranking for domain-adaptative relation extraction.",
            "Learning structural dependencies of words in the Zipfian Tail.",
            "A corpus-based finite-state morphological toolkit for contemporary arabic.",
            "A system for named entity recognition based on local grammars.",
            "Model-theory and implementation of property grammars with features.",
            "Linearity in Computation.",
            "Linearity: A Roadmap.",
            "Uniqueness typing for resource management in message-passing concurrency.",
            "What is a model for a semantically linear λ-calculus?",
            "Labelled calculi of resources.",
            "The enriched effect calculus: syntax and semantics.",
            "Linear Types and Locality.",
            "Restricted normal modal logics and levelled possible worlds semantics.",
            "Logics in access control: a conditional approach.",
            "Bijective faithful translations among default logics.",
            "Model-theoretic characterization of intuitionistic predicate formulas.",
            "Translating preferred subtheories into structured argumentation.",
            "Strict equilibria interchangeability in multi-player zero-sum games.",
            "Uniform Kurtz randomness.",
            "A resolution-based calculus for Coalition Logic.",
            "Propositional dynamic logics for communicating concurrent programs with CCS's parallel operator.",
            "A substructural logic for layered graphs.",
            "A dependency perspective on the adequacy of tree local multi-component tree adjoining grammar.",
            "Approximate reasoning about logic circuits with single-fan-out unreliable gates.",
            "On the Priorean temporal logic with 'around now' over the real line.",
            "Tractable and intractable classes of propositional schemata.",
            "Preface to the Special Issue on Computational Logic in Multi-Agent Systems (CLIMA XII).",
            "Alternating-time temporal dynamic epistemic logic.",
            "Non-monotonic reasoning with normative conflicts in multi-agent deontic logic.",
            "On the definability of simulation and bisimulation in epistemic logic.",
            "Ontology merging as social choice: judgment aggregation under the open world assumption.",
            "Preface to the Special Issue on Computational Logic in Multi-Agent Systems (CLIMA XIII).",
            "An equational approach to the merging of argumentation networks.",
            "What if no hybrid reasoner is available? Hybrid MKNF in multi-context systems.",
            "A logical analysis of responsibility attribution: emotions, individuals and collectives.",
            "A formal semantics for agent (re)organization."
        ]
    },
    {
        "name": "LOGCOM",
        "year": "2013",
        "info": "Volume 23: 2013",
        "count": 61,
        "papers": [
            "Strong normalization in some temporal substructural logics.",
            "Opening the black box of trust: reasoning about trust models in a BDI agent.",
            "A semantic proof of strong cut-admissibility for first-order Gödel logic.",
            "Arc consistency and friends.",
            "Prime implicates and relevant belief revision.",
            "The d-logic of the real line.",
            "On the existence of a modal-logical basis for monadic second-order logic.",
            "Remarks on some general features of abduction.",
            "Generalized constraint diagrams and the classical decision problem.",
            "The recursive path and polynomial ordering for first-order and higher-order terms.",
            "Introduction to the special issue on NorMAS 2009.",
            "THOMAS: An agent platform for supporting normative multi-agent systems.",
            "A logic for normative multi-agent programs.",
            "Dynamic assignment of roles, rights and responsibilities in normative multi-agent systems.",
            "Towards a model of UAVs navigation in urban canyon through defeasible logic.",
            "Situated normative infrastructures: the normative object approach.",
            "Dependency in Cooperative Boolean Games.",
            "On modal μ-calculus over reflexive symmetric graphs.",
            "Elementarily equivalent structures for topological languages over regions in Euclidean space.",
            "Compactness in first-order Gödel logics.",
            "Probabilistic logics for objects located in space and time.",
            "Cut-free sequent calculi for C-systems with generalized finite-valued semantics.",
            "Partial semantics of argumentation: basic properties and empirical.",
            "A Logic for prioritized normative reasoning.",
            "Completeness and decidability results for a logic of contrary-to-duty conditionals.",
            "Proto logic and neural subsymbolic reasoning.",
            "On generalizing free algebras for a functor.",
            "How big is BCI fragment of BCK logic.",
            "The complexity of admissible rules of Łukasiewicz logic.",
            "Strongly involutive uninorm algebras.",
            "Computability in Europe 2009.",
            "First-order universality for real programs.",
            "Complexity of existential positive first-order logic.",
            "(Hybrid) automata and (stochastic) programsThe hybrid automata lattice of a stochastic program.",
            "On the inference of non-confluent NLC graph grammars.",
            "Combinatorics of chromosomal rearrangements based on synteny blocks and synteny packs.",
            "Algorithmic solution of higher type equations.",
            "On a hierarchy of 5′ → 3′ sensing Watson-Crick finite automata languages.",
            "Functions definable by numerical set-expressions.",
            "Solving a PSPACE-complete problem by gene assembly.",
            "Generating Kolmogorov random strings from sources with limited independence.",
            "The cf2 argumentation semantics revisited.",
            "On logical specifications of the Argument Interchange Format.",
            "On the semantics of abstract argumentation.",
            "Polynomial time certifying algorithms for the planar quantified integer programming problem.",
            "Complexity for probability logic with quantifiers over propositions.",
            "A tableau for general linear temporal logic.",
            "Foundations of model construction in feature-based semantic science.",
            "On a coalgebraic view on Logic.",
            "The expressive power of first-order topological languages.",
            "The incomputable.",
            "Definable relations in Turing degree structures.",
            "Oracles that measure thresholds: the Turing machine and the broken balance.",
            "Joining non-low C.E. sets with diagonally non-computable functions.",
            "Two-to-one structures.",
            "Incomputability at the foundations of physics (A study in the philosophy of science).",
            "Classes of structures with universe a subset of ω1.",
            "Singleton enumeration reducibility and arithmetic.",
            "The Frobenius anatomy of word meanings I: subject and object relative pronouns.",
            "Quasi-minimal degrees for degree spectra.",
            "Effective properties of Marker's extensions."
        ]
    },
    {
        "name": "LOGCOM",
        "year": "2012",
        "info": "Volume 22: 2012",
        "count": 70,
        "papers": [
            "Editors' Note.",
            "Relevance and Conjunction.",
            "Relevance in Cooperation and Conflict.",
            "A Relevance-theoretic Framework for Constructing and Deconstructing Enthymemes.",
            "Relevance Realization and the Emerging Framework in Cognitive Science.",
            "Causal Relevance and Relevant Causation.",
            "Argument Relevance as the Right Kind of Epistemic Reason.",
            "A Generalizable Argument Structure Using Defeasible Class-inclusion Transitivity for Evaluating Evidentiary Probative Relevancy in Litigation.",
            "Computability in Europe 2008.",
            "Deterministic Graphical Games Revisited.",
            "Monotonicity Constraints in Characterizations of PSPACE.",
            "Triviality and Minimality in the Degrees of Monotone Complexity.",
            "Sharp Thresholds for a Phase Transition Related to Weakly Increasing Sequences.",
            "Notions of Bisimulation for Heyting-Valued Modal Languages.",
            "Graph Polynomials: From Recursive Definitions to Subset Expansion Formulas.",
            "Expressing versus Proving: Relating Forms of Complexity in Logic.",
            "Higher Types, Finite Domains and Resource-bounded Turing Machines.",
            "Hybrid Functional Interpretations of Linear and Intuitionistic Logic.",
            "Exploring the Computational Content of the Infinite Pigeonhole Principle.",
            "Semantically closed intuitionistic abstract logics.",
            "Intuitionistic implication without disjunction.",
            "Characterizing perfect recall using next-step temporal operators in S5 Epistemic Temporal Logic.",
            "Finite RDP-algebras: duality, coproducts and logic.",
            "Private announcement and belief expansion: an internal perspective.",
            "Measuring the blame of each formula for inconsistent prioritized knowledge bases.",
            "Monodic temporal logic with quantified propositional variables.",
            "Separating bounded arithmetical theories by Herbrand consistency.",
            "Borrowing interpolation.",
            "The complexity of reasoning for fragments of default logic.",
            "A logical basis for constructive systems.",
            "Horn versus full first-order: Complexity dichotomies in algebraic constraint satisfaction.",
            "Logics preserving degrees of truth from varieties of residuated lattices.",
            "Computability at Logic Colloquium 2009.",
            "Model-theoretic properties of the n-c.e. degrees.",
            "Compactness arguments with effectively closed sets for the study of relative randomness.",
            "Low upper bounds in the Turing degrees revisited.",
            "Separations of non-monotonic randomness notions.",
            "Least enumerations of partial structures.",
            "Turing and enumeration jumps in the Ershov hierarchy.",
            "Low linear orderings.",
            "Spectra of highn and non-lown degrees.",
            "Embedding distributive lattices in the Σ02 enumeration degrees.",
            "On constructive models of theories with linear Rudin-Keisler ordering.",
            "Non-cuppable enumeration degrees via finite injury.",
            "Algorithmic reducibilities of algebraic structures.",
            "Properties of the jump classes.",
            "Counting the back-and-forth types.",
            "Prompt enumerations and relative randomness.",
            "M2-computable real numbers.",
            "Embedding countable partial orderings in the enumeration degrees and the ω-enumeration degrees.",
            "Special Issue on Argumentation in Agreement Technologies.",
            "A formal analysis of the role of argumentation in negotiation dialogues.",
            "Using argumentation to reason about trust and belief.",
            "Revising option status in argument-based decision systems1.",
            "Temporal Logics of Repeating Values.",
            "Embedding-based approaches to paraconsistent and temporal description logics.",
            "Expressible preferential logics.",
            "Complexity Classifications for Propositional Abduction in Post's Framework.",
            "Cut Elimination and Realization for Epistemic Logics with Justification.",
            "Writing out Unifiers in Linear Temporal Logic.",
            "Semi-stable semantics.",
            "Turing is among us.",
            "A plea for the majority method in aggregating judgements.",
            "Dynamic specification of open agent systems.",
            "Modelling epistemic actions in interrogative belief revision.",
            "Preserving mappings in fuzzy predicate logics.",
            "Infinity, in short.",
            "Optimal decompositions of matrices with entries from residuated lattices.",
            "An abstract view on syntax with sharing.",
            "On meet-combination of logics."
        ]
    },
    {
        "name": "LOGCOM",
        "year": "2011",
        "info": "Volume 21: 2011",
        "count": 58,
        "papers": [
            "Parallel and Distributed Methods in Verification.",
            "Parallel SAT Solving in Bounded Model Checking.",
            "Distributed Algorithms for SCC Decomposition.",
            "A Database Approach to Distributed State-Space Generation.",
            "Speculative Image Computation for Distributed Symbolic Reachability Analysis.",
            "To Parallelize or to Optimize?",
            "The rules of the game are changing: Scientific impact factors and publication strategies among logicians.",
            "Towards the Proof-theoretic Unification of Dung's Argumentation Framework: an Adaptive Logic Approach.",
            "Linear Temporal Logic LTL: Basis for Admissible Rules.",
            "From Situation Calculus to Dynamic Epistemic Logic.",
            "Introducing Preferences in Planning as Satisfiability.",
            "Cyclic Involutive Distributive Full Lambek Calculus is Decidable.",
            "Towards a Definition of an Algorithm.",
            "Rank Hierarchies for Generalized Quantifiers.",
            "Inductive Defense for Sceptical Semantics of Extended Argumentation.",
            "Relations Versus Functions at the Foundations of Logic: Type-Theoretic Considerations.",
            "Preservation by fibring of the finite model property.",
            "Review of Modeling in Event-B: System and Sofware Engineering, 1st edition, by Jean-Raymond Abrial.",
            "Applications of Topological Dualities to Measure Theory in Algebraic Many-valued Logic.",
            "On States on MV-algebras and their Applications.",
            "On the Logical Formalization of Possibilistic Counterparts of States over n-valued Łukasiewicz Events.",
            "Models for Many-Valued Probabilistic Reasoning.",
            "States on Bold Algebras: Categorical Aspects.",
            "Core of Coalition Games on MV-algebras.",
            "Metric Completions of MV-algebras with States: An Approach to Stochastic Independence.",
            "A Compact [0, 1]-valued First-order Łukasiewicz Logic with Identity on Hilbert Space.",
            "Measures and Topologies on MV-algebras.",
            "Proof and Computation.",
            "Can We Make the Second Incompleteness Theorem Coordinate Free?",
            "Intuitionistic Dual-intuitionistic Nets.",
            "From Deep Inference to Proof Nets via Cut Elimination.",
            "Eskolemization in Intuitionistic Logic.",
            "On Two Attempts of Describing Propositional Realizability Logic.",
            "Arithmetical Completeness of the Intuitionistic Logic of Proofs.",
            "A Topological Study of the Closed Fragment of GLP.",
            "A Remark on Superintuitionistic Predicate Logics of Kripke Frames with Constant and with Nested Domains.",
            "Special Issue on Mathematical Fuzzy Logic.",
            "On the Structure of Finite Integral Commutative Residuated Chains.",
            "Structural Description of a Class of Involutive Uninorms via Skew Symmetrization.",
            "On the Minimum Many-Valued Modal Logic over a Finite Residuated Lattice.",
            "Computing Minimal Axiomatizations in Gödel Propositional Logic.",
            "A Simple Proof of Completeness and Cut-admissibility for Propositional Gödel Logic.",
            "Comments on Interpretability and Decidability in Fuzzy Logic.",
            "A Notion of Coherence for Books on Conditional Events in Many-valued Logic.",
            "Codd's Relational Model from the Point of View of Fuzzy Logic.",
            "State smearing theorems and the existence of states on some atomic lattice effect algebras.",
            "Social choice and the logic of simple games.",
            "Logic for coalitions with bounded resources.",
            "Non-axiomatizability for the linear temporal logic of knowledge with concrete observability.",
            "Metalevel argumentation.",
            "Public communication in justification logic.",
            "Cover semantics for quantified lax logic.",
            "Two new homomorphism dualities and lattice operations.",
            "Labelled natural deduction for a bundled branching temporal logic.",
            "Probabilistic models for intuitionistic predicate logic.",
            "Sequent calculi for induction and infinite descent.",
            "Verifying social expectations by model checking truncated paths.",
            "Computing inconsistency measure based on paraconsistent semantics."
        ]
    },
    {
        "name": "LOGCOM",
        "year": "2010",
        "info": "Volume 20: 2010",
        "count": 56,
        "papers": [
            "Preface.",
            "Axiom Pinpointing in General Tableaux.",
            "Herbrand's Theorem, Skolemization and Proof Systems for First-Order Lukasiewicz Logic.",
            "Tableaux for Public Announcement Logic.",
            "The Hyper Tableaux Calculus with Equality and an Application to Finite Model Computation.",
            "Model Checking Using Description Logic.",
            "Tableaux for Logics of Subinterval Structures over Dense Orderings.",
            "Analytic Methods for the Logic of Proofs.",
            "Tableaux and Resource Graphs for Separation Logic.",
            "Combining Derivations and Refutations for Cut-free Completeness in Bi-intuitionistic Logic.",
            "Reduced Implicate Tries with Updates.",
            "Bottom-up Construction of Semantic Tableaux.",
            "Differential-algebraic Dynamic Logic for Differential-algebraic Programs.",
            "A New Method to Obtain Termination in Backward Proof Search For Modal Logic S4.",
            "A New Method to Obtain Termination in Backward Proof Search for Modal Logic S4.",
            "On White's Expansion of Lukasiewicz Logic.",
            "Arithmetical Complexity of First-order Predicate Fuzzy Logics Over Distinguished Semantics.",
            "Admissible Rules of Lukasiewicz Logic.",
            "A Proof System for Abstract Non-interference.",
            "The Complexity of the Warranted Formula Problem in Propositional Argumentation.",
            "A Nominal Axiomatization of the Lambda Calculus.",
            "Answer Set Programming with Resources.",
            "Paraconsistent Machines and their Relation to Quantum Computing.",
            "Completeness and Cut-elimination in the Intuitionistic Theory of Types - Part 2.",
            "Reliable Methods of Judgement Aggregation.",
            "The Logic of Quasi-MV Algebras.",
            "Relation Algebras by Games, by Robin Hirsch and Ian Hodkinson.",
            "Editorial.",
            "Comparing LTL Semantics for Runtime Verification.",
            "Rule Systems for Run-time Monitoring: from Eagle to RuleR.",
            "Collaborative Runtime Verification with Tracematches.",
            "Interaction-based Runtime Verification for Systems of Systems Integration.",
            "Temporal Assertions with Parametrized Propositions.",
            "Order, Algebra and Logics.",
            "Constructive Logic with Strong Negation as a Substructural Logic.",
            "Categorical Equivalences for sqrt(') quasi-MV Algebras.",
            "Finitely Presented MV-algebras with Finite Automorphism Group.",
            "Interpolation Properties, Beth Definability Properties and Amalgamation Properties for Substructural Logics.",
            "Applying Universal Algebra to Lambda Calculus.",
            "Quantale Modules and their Operators, with Applications.",
            "Syllogistic Logics with Verbs.",
            "A Non-finitary Sentential Logic that is Elementarily Algebraizable.",
            "Solutions to Some Open Problems on Totally Ordered Monoids.",
            "Coalgebra and Logic: A Brief Overview.",
            "Presentation of Set Functors: A Coalgebraic Perspective.",
            "Vietoris Bisimulations.",
            "Exemplaric Expressivity of Modal Logics.",
            "Deduction Systems for Coalgebras Over Measurable Spaces.",
            "A Note on Expressive Coalgebraic Logics for Finitary Set Functors.",
            "Rank-1 Modal Logics are Coalgebraic.",
            "Bases of Admissible Rules of Lukasiewicz Logic.",
            "Completeness by Forcing.",
            "Interrogatives, Recursion, and Incompleteness.",
            "Intuitionistic Trilattice Logics.",
            "Information About a Given Entity: From Semantics Towards Automated Deduction.",
            "Role Interchange for Anonymity and Privacy of Voting."
        ]
    },
    {
        "name": "LOGCOM",
        "year": "2009",
        "info": "Volume 19: 2009",
        "count": 74,
        "papers": [
            "Logic and Computation in the Real World: CiE 2007.",
            "K-Triviality of Closed Sets and Continuous Functions.",
            "RZ: a Tool for Bringing Constructive and Computable Mathematics Closer to Programming Practice.",
            "Borel Complexity of Topological Operations on Computable Metric Spaces.",
            "Pseudojumps and Pi10 Classes.",
            "Subexponential Time and Fixed-parameter Tractability: Exploiting the Miniaturization Mapping.",
            "Existentially Closed Models and Conservation Results in Bounded Arithmetic.",
            "The Settling Time Reducibility Ordering and Delta20 Sets.",
            "Enumeration Degrees and Enumerability of Familes.",
            "The Uniformity Principle for Sigma-definability.",
            "Infinite Computations and a Hierarchy in Delta3 Reconsidered.",
            "Undecidability in Some Structures Related to Computation Theory.",
            "A Jump Inversion Theorem for the Degree Spectra.",
            "Logical and Complexity-theoretic Aspects of Models of Computation with Restricted Access to Arrays.",
            "Fuzzy Logic Corner.",
            "Complexity Issues in Axiomatic Extensions of Lukasiewicz Logic.",
            "Rewriting Corner.",
            "Paramodulation with Well-founded Orderings.",
            "Algebraic and Coalgebraic Logic Corner.",
            "Algebras of Relations and Relevance Logic.",
            "Proof Complexity of the Cut-free Calculus of Structures.",
            "Nominal Algebra and the HSP Theorem.",
            "Fixpoint and While Temporal Query Languages.",
            "Updating Epistemic Logic Programs.",
            "Indifferent Sets.",
            "Connections between Belief Revision, Belief Merging and Social Choice.",
            "Geodesic Revision.",
            "Aggregating Judgements by Merging Evidence.",
            "Aggregating Partially Ordered Preferences.",
            "Non-manipulable Social Welfare Functions when Preferences are Fuzzy.",
            "A General Approach to Aggregation Problems.",
            "Editorial.",
            "Monotonic Answer Set Programming.",
            "From (Quantified) Boolean Formulae to Answer Set Programming.",
            "A Translation-based Approach to the Verification of Modular Equivalence.",
            "The Significance of Memory Costs in Answer Set Solver Implementation.",
            "OntoDLV: An ASP-based System for Enterprise Ontologies.",
            "Efficiently Querying RDF(S) Ontologies with Answer Set Programming.",
            "Experimental Analysis of Graph-based Answer Set Computation over Parallel and Distributed Architectures.",
            "Special Issue on Ontology Dynamics.",
            "Base Revision for Ontology Debugging.",
            "On Instance-level Update and Erasure in Description Logic Ontologies.",
            "Trust-based Revision for Expressive Web Syndication.",
            "Category-based Equational Reasoning: An Approach to Ontology Integration.",
            "Reasoning Support for Mapping Revision.",
            "A Multi-Agent System for Dynamic Ontologies.",
            "Multimedia Interpretation for Dynamic Ontology Evolution.",
            "Editorial: Logic and Law Corner.",
            "The Logic of Acceptance: Grounding Institutions on Agents' Attitudes.",
            "Modelling Judicial Context in Argumentation Frameworks.",
            "Editorial: Proof Theory Corner.",
            "Sequent Calculi for the Modal µ-Calculus over S5.",
            "Editorial and call for papers: The Non-classical Logics Corner of the Journal of Logic and Computation.",
            "Linear Temporal Logic LTKK extended by Multi-Agent Logic Kn with Interacting Agents.",
            "Residuated Lattices as an Algebraic Semantics for Paraconsistent Nelson's Logic.",
            "Logics Preserving Degrees of Truth from Varieties of Residuated Lattices.",
            "Towards a Common Framework for Dialectical Proof Procedures in Abstract Argumentation.",
            "Editorial: Introduction to the Universal Logic Corner.",
            "On the Density of Truth of Locally Finite Logics.",
            "Verification of Games in the Game Description Language.",
            "Model-theoretic and Computational Properties of Modal Dependence Logic.",
            "An Axiomatic System Suggested by Quantum Computation.",
            "On a Finitely Axiomatizable Kripke Incomplete Logic Containing KTB.",
            "A Logical and Computational Theory of Located Resource.",
            "Labelled Tableaux for Distributed Temporal Logic.",
            "A Graph-theoretic Account of Logics.",
            "On Graph-theoretic Fibring of Logics.",
            "Qualitative Temporal and Spatial Reasoning Revisited.",
            "Property-based Slicing for Agent Verification.",
            "A Complete Deductive System for Probability Logic.",
            "Nominal (Universal) Algebra: Equational Logic with Names and Binding.",
            "TCTL Model Checking of Time Petri Nets.",
            "The Effects of Bounding Syntactic Resources on Presburger LTL.",
            "Max-based Prioritized Information Fusion without Commensurability."
        ]
    },
    {
        "name": "LOGCOM",
        "year": "2008",
        "info": "Volume 18: 2008",
        "count": 52,
        "papers": [
            "Introducing the Logic and Law Corner.",
            "Combining Syntax and Semantics through Prime Form Representation.",
            "Analytic Calculi for Logics of Ordinal Multiples of Standard t-Norms.",
            "A Presentation of Quantum Logic Based on an and then Connective.",
            "On Variable-inactivity and Polynomial tau-Satisfiability Procedures.",
            "Vector Logic: A Natural Algebraic Representation of the Fundamental Logical Gates.",
            "Preservation of Interpolation Features by Fibring.",
            "Monotonic and Downward Closed Games.",
            "Cut Elimination and Decidability for Classical Lambek Logic.",
            "Lambda Calculus, Type Theory, and Natural Language II.",
            "Sequentially Indexed Grammars.",
            "M. H. Newman's Typability Algorithm for Lambda-calculus.",
            "Proof Nets for Basic Discontinuous Lambek Calculus.",
            "Hyperintensions.",
            "Computable Models.",
            "Natural Language and Knowledge Representation.",
            "Experience and History: Processes and their Relation to Events.",
            "The Semantic Processing of Continuous Quantities for Discrete Terms in Ontologies.",
            "Extracting Frame-Semantics Knowledge using Lattice Theory.",
            "Deverbal Nouns in Knowledge Representation.",
            "Linking Semantic and Knowledge Representations in a Multi-Domain Dialogue System.",
            "Speech Acts, Epistemic Planning and Grice's Maxims.",
            "Testing the Reasoning for Question Answering Validation.",
            "Utilizing Natural Language for One-Shot Task Learning.",
            "Editorial and call for papers.",
            "General Models and Completeness of First-Order Modal µ-calculus.",
            "Multi-modal and Temporal Logics with Universal Formula - Reduction of Admissibility to Validity and Unification.",
            "One-and-a-halfth-order Logic.",
            "Sum and Product in Dynamic Epistemic Logic.",
            "Lambek Calculus in Natural Deduction.",
            "A Note on Bisimulation Quantifiers and Fixed Points over Transitive Frames.",
            "A Syntactical Proof of the Canonical Reactivity Form for Past Linear Temporal Logic.",
            "On the Hierarchy of Intuitionistic Bounded Arithmetic.",
            "Adding Intensional Machinery to Hybrid Logic.",
            "Quantifier Elimination for Quantified Propositional Logics on Kripke Frames of Type omega.",
            "Pedagogical Second-order Propositional Calculi.",
            "Preface.",
            "Degrees of Belief.",
            "Three Scenarios for the Revision of Epistemic States.",
            "An Axiomatic Characterization of Ensconcement-Based Contraction.",
            "Reconstructing an Agent's Epistemic State from Observations about its Beliefs and Non-beliefs.",
            "Reinforcement Belief Revision.",
            "Modal Operators over Constructive Logic.",
            "Synthesizing Monadic Predicates.",
            "The Expansion Problem in Lambda Calculi with Explicit Substitution.",
            "Complete Axiomatization of Discrete-Measure Almost-Everywhere Quantification.",
            "Logical Weak Completions of Paraconsistent Logics.",
            "On Computational Complexity of Semilinear Varieties.",
            "Standard Logics Are Valuation-Nonmonotonic.",
            "Cirquent Calculus Deepened.",
            "On Dynamic Topological Logic of the Real Line.",
            "On Algebras with Iteration."
        ]
    },
    {
        "name": "LOGCOM",
        "year": "2007",
        "info": "Volume 17: 2007",
        "count": 53,
        "papers": [
            "Introduction and Call for Papers.",
            "Axiomatizing the Monodic Fragment of QCTL.",
            "First-order Definable Retraction Problems for Posets and Reflexive Graphs.",
            "Anytime Approximations of Classical Logic from Above.",
            "The Dynamics of Syntactic Knowledge.",
            "A Tableau for Bundled CTL.",
            "Complexity of the Guarded Two-variable Fragment with Counting Quantifiers.",
            "Generalized Strong Preservation by Abstract Interpretation.",
            "On Action Logic: Equational Theories of Action Algebras.",
            "A New Modal Approach to the Logic of Intervals.",
            "Peirce Algebras and Boolean Modules.",
            "The Extent of Constructive Game Labellings.",
            "On Reduction Systems Equivalent to the Non-associative Lambek Calculus with the Empty String.",
            "Complexity and Definability Issues in L Pi 1/2.",
            "Using Temporal Logic to Analyse Temporal Logic: A Hierarchical Approach Based on Intervals.",
            "A Logic for Concepts and Similarity.",
            "Model Representation over Finite and Infinite Signatures.",
            "Contraction Based on Sentential Selection.",
            "Strong Negation and Equivalence in the Safe Belief Semantics.",
            "Termination for Hybrid Tableaus.",
            "Epistemic Actions as Resources.",
            "On Independence of Variants of the Weak Pigeonhole Principle.",
            "An Institution-independent Generalization of Tarski's Elementary Chain Theorem.",
            "Logics with Common Weak Completions.",
            "Logic for Ontology Engineering Corner.",
            "On the Properties of Metamodeling in OWL.",
            "Ramifications: An Extension and Correspondence Result for the Event Calculus.",
            "Models and Separation Logics for Resource Trees.",
            "Two Representation Theorems for Non-monotonic Inference Relations.",
            "Spectral Duality for Finitely Generated Nilpotent Minimum Algebras, with Applications.",
            "Classical Modal Display Logic in the Calculus of Structures and Minimal Cut-free Deep Inference Calculi for S5.",
            "Characterizing the NP-PSPACE Gap in the Satisfiability Problem for Modal Logic.",
            "A Structural Proof of the Soundness of Rely/guarantee Rules.",
            "Preface.",
            "A Causal Theory of Abduction.",
            "A General Framework for Expressing Preferences in Causal Reasoning and Planning.",
            "Conciliation through Iterated Belief Merging.",
            "Causality and Counterfactuals in the Situation Calculus.",
            "Forgetting Literals with Varying Propositional Symbols.",
            "Goal Change in the Situation Calculus.",
            "Logical Approaches to Computational Barriers: CiE 2006.",
            "Post's Programme for the Ershov Hierarchy.",
            "Algorithmic Randomness of Closed Sets.",
            "Partial Continuous Functions and Admissible Domain Representations.",
            "A Sharp Phase Transition Threshold for Elementary Descent Recursive Functions.",
            "On a Problem of J. Paris.",
            "Call-by-Value lambda-calculus and LJQ.",
            "Undecidability in the Homomorphic Quasiorder of Finite Labelled Forests.",
            "Isolation, Infima and Diamond Embeddings.",
            "Third-Order Computation and Bounded Arithmetic.",
            "The omega-Enumeration Degrees.",
            "Relativized Degree Spectra.",
            "Genericity and Non-bounding in the Enumeration degrees."
        ]
    },
    {
        "name": "LOGCOM",
        "year": "2006",
        "info": "Volume 16: 2006",
        "count": 39,
        "papers": [
            "Editorial.",
            "A Unified Category-theoretic Semantics for Binding Signatures in Substructural Logics.",
            "A Hybrid Intuitionistic Logic: Semantics and Decidability.",
            "Detecting Loops During Proof Search in Propositional Affine Logic.",
            "Linearity Constraints as Bounded Intervals in Linear Logic Programming.",
            "Hybrid Logics with Infinitary Proof Systems.",
            "Transfer Results for Hybrid Logic. Part I: The Case Without Satisfaction Operators.",
            "An Independence Result for Intuitionistic Bounded Arithmetic.",
            "On Product Logic with Truth-constants.",
            "A Six-valued Logic to Reason about Uncertainty and Inconsistency in Requirements Specifications.",
            "Discrete Linear-time Probabilistic Logics: Completeness, Decidability and Complexity.",
            "Deductive Algorithmic Knowledge.",
            "A Syntax-based Approach to Reasoning about Action and Belief Update.",
            "Proof Systems for Institutional Logic.",
            "Constraint Satisfaction with Countable Homogeneous Templates.",
            "Dynamic Logic for Plan Revision in Agent Programming.",
            "Proof Theory for Casari's Comparative Logics.",
            "On Weakly Cancellative Fuzzy Logics.",
            "On Representing Sentential Connectives of Lesniewski's Elementary Protothetic.",
            "A Logic of Probability with Decidable Model Checking.",
            "Introduction to Cirquent Calculus and Abstract Resource Semantics.",
            "Editorial.",
            "Definability Over the Class of all Partitions.",
            "Embedding Alternating-time Temporal Logic in Strategic STIT Logic of Agency.",
            "Algorithmic Correspondence and Completeness in Modal Logic. II. Polyadic and Hybrid Extensions of the Algorithm SQEMA.",
            "Classificatory Aspects of Counts-as: An Analysis in Modal Logic.",
            "Reference Constructions in the Single-conclusion Proof Logic.",
            "A Game Semantics for Grz.",
            "On Realization of S5-modality by Evidence Terms.",
            "On Non-axiomatizability of Superintuitionistic Predicate Logics of Some Classes of Well-founded and Dually Well-founded Kripke Frames.",
            "Logic of Proofs and Labels with a Complete Set of Operations.",
            "An Institution-independent Generalization of Tarski's Elementary Chain Theorem.",
            "Tableau-based Decision Procedures for Hybrid Logic.",
            "ATL Satisfiability is Indeed EXPTIME-complete.",
            "A Logic of Type Relations and its Applications to Relational Databases.",
            "Expressive Power and Complexity of a Logic with Quantifiers that Count Proportions of Sets.",
            "Computability in Specification.",
            "Logics with Common Weak Completions.",
            "The Expressivity of Quantifying over Regions."
        ]
    },
    {
        "name": "LOGCOM",
        "year": "2005",
        "info": "Volume 15: 2005",
        "count": 50,
        "papers": [
            "Linear Logics with Communication-merge.",
            "Logic, Self-awareness and Self-improvement: the Metacognitive Loop and the Problem of Brittleness.",
            "Implicit Complexity over an Arbitrary Structure: Sequential and Parallel Polynomial Time.",
            "An Extension of Muchnik's Theorem.",
            "Normal Forms for Characteristic Functions on n-ary Relations.",
            "Records and Record Types in Semantic Theory.",
            "Abstraction and Ontology: Questions as Propositional Abstracts in Type Theory with Records.",
            "Underspecified Interpretations in a Curry-typed Representation Language.",
            "Semantics and Stratification.",
            "Probabilistic /lambda-calculus and Quantitative Program Analysis.",
            "Quantitative Information Flow, Relations and Polymorphic Types.",
            "Director Strings Revisited: A Generic Approach to the Efficient Representation of Free Variables in Higher-order Rewriting.",
            "Interaction Net Implementation of Additive and Multiplicative Structures.",
            "Non-deterministic Multiple-valued Structures.",
            "Preferential and Preferential-discriminative Consequence Relations.",
            "Programming and Verifying Subgame-Perfect Mechanisms.",
            "A Verification Logic for Rewriting Logic.",
            "On Long Normal Inhabitants of a Type.",
            "Towards a Systematic Account of Different Semantics for Logic Programs.",
            "Editorial.",
            "Admissible Rules of Modal Logics.",
            "Uniform Proof Complexity.",
            "A Finitary Treatment of the Closed Fragment of Japaridze's Provability Logic.",
            "An Iterative Framework for Simulation Conformance.",
            "A Note on Linear Kripke Models.",
            "Probabilistic Logic and Induction.",
            "Negative Operations on Proofs and Labels.",
            "On Kripke-style Semantics for the Provability Logic of Gödel's Proof Predicate with Quantifiers on Proofs.",
            "Approximating Succinct MaxSat.",
            "Modal Logics of Regions and Minkowski Spacetime.",
            "P != NP cap co-NP for Infinite Time Turing Machines.",
            "Expressing Default Logic Variants in Default Logic.",
            "The Foundations of Specification.",
            "Logical Consecutions in Intransitive Temporal Linear Logic of Finite Intervals.",
            "Pivotal and Pivotal-discriminative Consequence Relations.",
            "A First-order Theory of Communication and Multi-agent Plans.",
            "Logic as a Vector System.",
            "A Reduction from DLP to PDL.",
            "Ground Nonmonotonic Modal Logic S5: New Results.",
            "Review: Advances in Elliptic Curve Cryptography.",
            "Editorial.",
            "Completeness and Cut-elimination in the Intuitionistic Theory of Types.",
            "de Bruijn Indices for Metaterms.",
            "Relating Higher-order and First-order Rewriting.",
            "Aristotelian Syntax from a Computational-Combinatorial Point of View.",
            "A Decidable Constraint Diagram Reasoning System.",
            "Coherence and Flexibility in Dialogue Games for Argumentation.",
            "Value-based Argumentation Frameworks as Neural-symbolic Learning Systems.",
            "Introducing Justification into Epistemic Logic.",
            "Persuasion and Value in Legal Argument."
        ]
    },
    {
        "name": "LOGCOM",
        "year": "2004",
        "info": "Volume 14: 2004",
        "count": 44,
        "papers": [
            "Editorial.",
            "On Non-local Propositional and Weak Monodic Quantified CTL.",
            "Handling Expiration of Multigranular Temporal Objects.",
            "Representing and Reasoning about Temporal Granularities.",
            "A Finite-state Approach to Events in Natural Language Semantics.",
            "A Local Search Approach to Modelling and Solving Interval Algebra Problems.",
            "R-SATCHMO: Refinements on I-SATCHMO.",
            "ÉTOILE-specifications: An Object-oriented Algebraic Formalism with Refinement.",
            "Approximate and Limited Reasoning: Semantics, Proof Theory, Expressivity and Control.",
            "Categorial Grammars and Tree Languages.",
            "A Complete Proof System for First-order Interval Temporal Logic with Projection.",
            "Changing Modalities.",
            "Order Independent Temporal Properties.",
            "Storage Operators and Multiplicative Quantifiers in Many-valued Logics.",
            "Review: From 0 to 1; an Authoritative History of Modern Computing.",
            "Review: Things a Computer Scientist Rarely Talks About.",
            "Review: A Dictionary of the Internet.",
            "Review: Views into the Chinese Room: New Essays on Searle and Artificial Intelligence.",
            "Natural Deduction for Hybrid Logic.",
            "The Limit Assumption and Multiple Revision.",
            "The Lattice of Lambda Theories.",
            "Concept Equations.",
            "Soundness of Coercion in the Calculus of Constructions.",
            "Rules and Refutation Rules for the Logic of Finite n-ary Trees.",
            "Editorial.",
            "Propositions as Types.",
            "Towards a Logic for Pragmatics. Assertions and Conjectures.",
            "A Logic for Partial System Description.",
            "A Formulae-as-Types Interpretation of Subtractive Logic.",
            "Monad-independent Dynamic Logic in HasCasl.",
            "Forthcoming Papers.",
            "Editorial.",
            "Combining Soft Linear Logic and Spatio-temporal Operators.",
            "Elementary Diagrams in Institutions.",
            "Argumentation Semantics for Defeasible Logic.",
            "Event Calculus Reasoning Through Satisfiability.",
            "Event Calculus Planning Through Satisfiability.",
            "Uncontroversial Default Logic.",
            "Extended Natural Deduction Images of Conversions from the System of Sequents.",
            "On Computing Belief Change Operations using Quantified Boolean Formulas.",
            "Similarity and Fuzzy Tolerance Spaces.",
            "The Expressiveness of Spider Diagrams.",
            "Review: Process Algebra with Timing.",
            "Review: Word, Proofs and Diagrams."
        ]
    },
    {
        "name": "LOGCOM",
        "year": "2003",
        "info": "Volume 13: 2003",
        "count": 49,
        "papers": [
            "Editorial.",
            "Controlled Revision - An algorithmic approach for belief revision.",
            "Ten Philosophical Problems in Belief Revision.",
            "When Maximizing Entropy gives the Rational Closure.",
            "Structured Clusters: A Framework to Reason with Contradictory Interests.",
            "Credibility-limited Functions for Belief Bases.",
            "Coherence and Conservatism in the Dynamics of Belief II: Iterated Belief Change without Dispositional Coherence.",
            "Representation and Human Reasoning.",
            "On the Turing Degrees of Weakly Computable Real Numbers.",
            "Characterizing Interpolation Pairs in Infinitary Graded Logics.",
            "A Decision Procedure and Complete Axiomatization of Finite Interval Temporal Logic with Projection.",
            "A Tableau Calculus for Hájek's Logic BL.",
            "On the Complexity of the First-order Random Theory.",
            "On Almost Sure Elimination of Numerical Quantifiers.",
            "Uniform Lazy Narrowing.",
            "Book Review: \"Refinement in Z and object-Z: Foundations and Advanced Applications\" by John Derrick and Eerke Boiten.",
            "Special Issue on Computational Dialectics: an Introduction.",
            "DefLog: on the Logical Interpretation of Prima Facie Justified Assumptions.",
            "Properties and Complexity of Some Formal Inter-agent Dialogues.",
            "On Decision Problems Related to the Preferred Semantics for Argumentation Frameworks.",
            "Collective Argumentation and Disjunctive Logic Programming.",
            "Persuasion in Practical Argument Using Value-based Argumentation Frameworks.",
            "Editorial.",
            "Algebraic Semantics for Paraconsistent Nelson's Logic.",
            "Fuzzy Logics with Noncommutative Conjuctions.",
            "A Note on Absolutely Unorderable Combinatory Algebras.",
            "Fixed-point Logics with Nondeterministic Choice.",
            "Hoops and Fuzzy Logic.",
            "Reducing Preferential Paraconsistent Reasoning to Classical Entailment.",
            "A Complete Axiomatization for Blocks World.",
            "Fibring Logics with Topos Semantics.",
            "Book Review: \"Concurrency Verification: Introduction to Compositional and Non-compositional Methods\" by Willem-Paul de Roever, Frank de Boer, Ulrich Hanneman, Jozef Hooman, Yassine Lakhnech, Mannes Poel and Job Zwiers (eds.).",
            "Editorial.",
            "A Linear Spine Calculus.",
            "Strong Normalization of Herbelin's Explicit Substitution Calculus with Substitution Propagation.",
            "Semantic Labelled Tableaux for Propositional BI.",
            "A Kripke-style Semantics for the Intuitionistic Logic of Pragmatics ILP.",
            "Proof Nets for Classical Logic.",
            "Forthcoming Papers.",
            "An Axiomatization of Linear Temporal Logic in the Calculus of Inductive Constructions.",
            "Formal Verification of an Incremental Garbage Collector.",
            "Hypersequent Calculi for Gödel Logics - a Survey.",
            "A Logical Viewpoint on Process-algebraic Quotients.",
            "Comparing Constructive Arithmetical Theories Based on NP-PIND and coNP-PIND.",
            "Reasoning About Space: The Modal Way.",
            "A Real-time Semantics of Temporal Logic of Actions.",
            "A Modal Perspective on Path Constraints.",
            "Review: Mathematics of Quantum Computation.",
            "Review: Handbook of Process Algebra."
        ]
    },
    {
        "name": "LOGCOM",
        "year": "2002",
        "info": "Volume 12: 2002",
        "count": 43,
        "papers": [
            "Definability in Rationals with Real Order in the Background.",
            "Operators and Laws for Combining Preference Relations.",
            "Formalizing Collaborative Decision-making and Practical Reasoning in Multi-agent Systems.",
            "Mental States Recognition from Communication.",
            "Logical Precision in Concept Lattices.",
            "A Modal Logic for Coalitional Power in Games.",
            "A Foundation for Metareasoning Part I: The Proof Theory.",
            "Editorial.",
            "Final Coalgebras are Ideal Completions of Initial Algebras.",
            "Monadic Logic of Order over Naturals has no Finite Base.",
            "µ-Calculus with Explicit Points and Approximations.",
            "Continuous Additive Algebras and Injective Simulations of Synchronization Trees.",
            "An Equational Axiomatization of Bisimulation over Regular Expressions.",
            "On Greatest Fixpoint Semantics of Logic Programming.",
            "A Foundation for Metareasoning Part II: The Model Theory.",
            "Two Logical Theories of Plan Recognition.",
            "Engineering Executable Agents using Multi-context Systems.",
            "Fibring Labelled Deduction Systems.",
            "Belief Functions and the Possible Worlds Paradigm.",
            "Generalizing Def and Pos to Type Analysis.",
            "Codes and Ciphers: Julius Caesar, The Enigma, and the Internet.",
            "Foundations of Cryptography: Basic Tools.",
            "Verifying Concurrent Systems with Symbolic Execution.",
            "On the Relationship between [ohgr]-automata and Temporal Logic Normal Forms.",
            "Linear Tense Logics of Increasing Sets.",
            "Extending CTL with Actions and Real Time.",
            "Model Checking Games for Branching Time Logics.",
            "Extending Kamp's Theorem to Model Time Granularity.",
            "Axioms for Branching Time.",
            "Complete Proof System for QPTL.",
            "Lazy List Comprehension in Logic Programming.",
            "Merging Information Under Constraints: A Logical Framework.",
            "A Tableau Calculus for Temporal Description Logic: the Expanding Domain Case.",
            "The Expressive Power of Temporal Logic of Actions.",
            "Theoremhood-preserving Maps Characterizing Cut Elimination for Modal Provability Logics.",
            "Tractability Results in the Block Algebra.",
            "Relevance Principle for Substructural Logics with Mingle and Strong Negation.",
            "A Decision Algorithm for Stratified Context Unification.",
            "Space-efficient Decision Procedures for Three Interpolable Propositional Intermediate Logics.",
            "Display Calculi for Nominal Tense Logics.",
            "Modal Logics Between Propositional and First-order.",
            "Labelled Tableaux for Nonmonotonic Reasoning: Cumulative Consequence Relations.",
            "Kripke Resource Models of a Dependently-typed, Bunched λ-calculus."
        ]
    },
    {
        "name": "LOGCOM",
        "year": "2001",
        "info": "Volume 11: 2001",
        "count": 49,
        "papers": [
            "Editorial.",
            "Editorial and Call for Papers.",
            "Ackermann's Implication for Typefree Logic.",
            "Revision Sequences and Computers with an Infinite Amount of Time.",
            "Multi-agent Only Knowing.",
            "Preferential Logics are X-logics.",
            "PSPACE Reasoning for Graded Modal Logics.",
            "SHR Tableaux - A Framework for Automated Model Generation.",
            "Ideal and Real Belief about Belief.",
            "Book Review: \"Elementary Logics: a Procedural Perspective\" by Dov M. Gabbay.",
            "Which Branching-Time Properties are Effectively Linear?",
            "Nonmonotonic Logics and Semantics.",
            "Dynamic Argument Systems: A Formal Model of Argumentation Processes Based on Situation Calculus.",
            "Hypersequent Calculi for some Intermediate Logics with Bounded Kripke Models.",
            "Conditional Quantification, or Poor Man's Probability.",
            "Minimizing Agent Specifications using a Logic of Knowledge and Actions.",
            "Book Review: \"Selected Papers on Analysis of Algorithms\" by Donald E. Knuth.",
            "Book Review: \"Parallel Processing and Parallel Algorithms: Theory and Computation\" by Seyed H. Roosta.",
            "Book Review: \"Time Warps, String Edits, and Macromolecules: the Theory and Practice of Sequence Comparison\" by David Sankoff and Joseph Kruskal.",
            "Editorial.",
            "Reviewing the Classical and the de Bruijn Notation for [lambda]-calculus and Pure Type Systems.",
            "Approximation Theorems for Intersection Type Systems.",
            "About Folding-Unfolding Cuts and Cuts Modulo.",
            "Explicit Substitutions and Reducibility.",
            "Algebraic Specifications, Higher-order Types and Set-theoretic Models.",
            "Extensional Set Equality in the Calculus of Constructions.",
            "Nonmonotonic Inheritance in Object-Oriented Deductive Database Languages.",
            "A Semantics for [lambda]: a Calculus with Overloading and Late-binding.",
            "Embedding First-order Logic in a Pure Type System with Parameters.",
            "Composition of Default Specifications.",
            "Knowledge Compilation for Closed World Reasoning and Circumscription.",
            "The Complexity of Poor Man's Logic.",
            "On the Soundness and Completeness of Equational Predicate Logics.",
            "Bringing them all Together.",
            "Internalization: The Case of Hybrid Logics.",
            "Relation Algebra with Binders.",
            "Modal Logic with Bounded Quantification over Worlds.",
            "Resolution in Modal, Description and Hybrid Logic.",
            "Sahlqvist Formulas in Hybrid Polyadic Modal Logics.",
            "Corner on directions in nonclassical logic.",
            "The Trilattice of Constructive Truth Values.",
            "Comparing some Intuitions of 'Process Calculus' and 'Program Logic'.",
            "Compositional Verification of Quantitative Properties of Statecharts.",
            "Reducing Modal Consequence Relations.",
            "On the Products of Linear Modal Logics.",
            "The Complexity of Regularity in Grammar Logics and Related Modal Logics.",
            "Book Review: \"Cryptography and Computational Number Theory\" by K.-Y. Lam, I. Shparlinski, H. Wang and C. Xing.",
            "Book Review: \"Artificial Immune Systems and their Applications\" by D. Dasgupta.",
            "Book Review: \"Model Checking\" by E. Clarke, O. Grumberg and D. A. Peled."
        ]
    },
    {
        "name": "LOGCOM",
        "year": "2000",
        "info": "Volume 10: 2000",
        "count": 34,
        "papers": [
            "SPADES - a process algebra for discrete event simulation.",
            "Investigating Z.",
            "Object calculi in linear logic.",
            "Tractable and intractable instances of combination problems for unification and disunification.",
            "Internalizing labelled deduction.",
            "Proof-terms for classical and intuitionistic resolution.",
            "Stability, the finite cover property and 0-1 laws.",
            "Sequent calculi for finite-valued Lukasiewicz logics via Boolean decompositions.",
            "The product of converse PDL and polymodal K.",
            "Two alternative notions of 'possibility' satisfying Halpern's conditions.",
            "Completeness of neighbourhood logic.",
            "On the expressive limits of reified theories.",
            "Editorial.",
            "Stable results and relative normalization.",
            "Relating the λσ- and λs-styles of explicit substitutions.",
            "A syntactical analysis of normalization.",
            "A linearization of the Lambda-calculus and consequences.",
            "A geometric proof of confluence by decreasing diagrams.",
            "Axiomatic rewriting theory II: the λσ-calculus enjoys finite normalisation cones.",
            "Coherence and transitivity of subtyping as entailment.",
            "Presentation of proofs in modal natural deduction.",
            "Unrestricted preferential structures.",
            "The logic of conflicts between decision making agents.",
            "Measuring similarity in belief revision.",
            "Ramification and causality in a modal action logic.",
            "A single complete refinement rule for Z.",
            "Reasoning with contradictory information using quasi-classical logic.",
            "Non-cumulative reasoning: rules and models.",
            "Postponement, conservation and preservation of strong normalization for generalized reduction.",
            "Reflection principles in computational logic.",
            "A dynamic logic for acting, sensing, and planning.",
            "Similarity relations in concept lattices.",
            "A logical reconstruction of temporal databases.",
            "A mixed decision method for duration calculus."
        ]
    },
    {
        "name": "LOGCOM",
        "year": "1999",
        "info": "Volume 9: 1999",
        "count": 40,
        "papers": [
            "What's on My Mind...",
            "Programming by Combining General Logic Programs.",
            "Agents in Proactive Environments.",
            "A Direct Proof of the Completeness of SLDNF-Resolution.",
            "Applying Labelled Deductive Systems and Multi-Agent Systems to Source-Based Argumentation.",
            "A Modal Logic for Fusing Partial Belief of Multiple Reasoners.",
            "Coercive Subtyping.",
            "Augmenting Branching Temporal Logics with Existential Quantification over Atomic Propositions.",
            "Fibring of Logics as a Categorial Construction.",
            "Some Probability Logics with New Types of Probability Operators.",
            "Complexity of Products of Modal Logics.",
            "Robust Semantics for Argumentation Frameworks.",
            "Editorial: Special Issue on Description Logics.",
            "Optimizing Description Logic Subsumption.",
            "Representing and Reasoning on XML Documents: A Description Logic Approach.",
            "Expressive Number Restrictions in Description Logics.",
            "A Description Logic with Concrete Domains and a Role-forming Predicate Operator.",
            "A Description Logic with Transitive and Inverse Roles and Role Hierarchies.",
            "Matching in Description Logics.",
            "Report on the 1998 International Workshop on Description Logics (DL'98).",
            "A Topological Construction of a Non-smooth Model of Cumulativity.",
            "Coalgebraic Theories of Sequences in PVS.",
            "The Probability of Pure Literals.",
            "Computing Argumentation in Logic Programming.",
            "The Cooperative Problem-solving Process.",
            "Points, Lines and Diamonds: A two-sorted Modal Logic for Projective Planes.",
            "Reasoning about Concurrent Interaction.",
            "Propositional Information Systems.",
            "Frege Structures for Partial Applicative Theories.",
            "Formalizing Action and Change in Modal Logic I: the frame problem.",
            "Declarative PTIME Queries for Relational Databases using Quantifier Elimination.",
            "A Theory and Implementation of Cognitive Mobile Robots.",
            "Coalition Formation Processes with Belief Revision among Bounded-rational Self-interested Agents.",
            "Preferred History Semantics for Iterated Updates.",
            "Dynamic Slicing: a generic analysis based on a natural semantics format.",
            "Possibilistic and Standard Probabilistic Semantics of Conditional Knowledge Bases.",
            "Undecidability of Compass Logic.",
            "Hierarchies in Classes of Program Schemes.",
            "Sets, Types and Type-checking.",
            "On the Expressive Power of Three-Valued and Four-Valued Languages."
        ]
    },
    {
        "name": "LOGCOM",
        "year": "1998",
        "info": "Volume 8: 1998",
        "count": 38,
        "papers": [
            "Editorial.",
            "A Module System for a Programming Language Based on the LF Logical Framework.",
            "leanTAP Revisited.",
            "Constructive Z.",
            "Enhancing Fixed Point Logic with Cardinality Quantifiers.",
            "Updates and Counterfactuals.",
            "Adding the Everywhere Operator to Propositional Logic.",
            "Computation of Prime Implicants Using Matrix and Paths.",
            "Preferential Orders and Plausibility Measures.",
            "A Note on SLDNF-Resolution.",
            "Extensions for Open Default Theories via the Domain Closure Assumption.",
            "Subclasses of Binary NP.",
            "Uniform Provability in Classical Logic.",
            "Editorial.",
            "Engineering AgentSpeak(L): A Formal Computational Model.",
            "Agents That Reason and Negotiate by Arguing.",
            "Decision Procedures for BDI Logics.",
            "Resolution for Temporal Logics of Knowledge.",
            "Tableau Methods for Formal Verification of Multi-Agent Distributed Systems.",
            "Model Checking Multiagent Systems.",
            "Applying the Mu-Calculus in Planning and Reasoning about Action.",
            "Abductive Analysis of Modular Logic Programs.",
            "Actions Speak Louder Than Words: Proving Bisimilarity for Context-Free Processes.",
            "A New Method for Automated Finite Model Building Exploiting Failures and Symmetries.",
            "An Equivalence Theorem for the Operational and Temporal Semantics of Real-Time, Concurrent Programs.",
            "Simplification of Many-Valued Logic Formulas Using Anti-Links.",
            "Intuitionistic Propositional Logic with Only Equivalence Has No Interpolation.",
            "A Modal Extension of Logic Programming: Modularity, Beliefs and Hypothetical Reasoning.",
            "New Solutions to Novikov's Problem for Intuitionistic Connectives.",
            "Saturated Formulas in Full Linear Logic.",
            "On the Decidability of Continuous Time Specification Formalisms.",
            "Logical Specification of Reactive and Real-Time Systems.",
            "Optimized Encodings of Fragments of Type Theory in First-Order Logic.",
            "Update Rules in Datalog Programs.",
            "Occurrences and Narratives as Constraints in the Branching Structure of the Situation Calculus.",
            "A Relevant Analysis of Natural Deduction.",
            "Approximating Classical Theorems.",
            "Reasoning About Set Constraints Applied to Tractable Inference in Intuitionistic Logic."
        ]
    },
    {
        "name": "LOGCOM",
        "year": "1997",
        "info": "Volume 7: 1997",
        "count": 32,
        "papers": [
            "An Algebraic Perspective of Constraint Logic Programming.",
            "Semantic Tableaux with Equality.",
            "Modal Logics for Incidence Geometries.",
            "A Theory of Knowledge and Ignorance for Many Agents.",
            "How to (Plan to) Meet a Deadline between Now and Then.",
            "The Generalized Logic of only Knowing (GOL) That Covers the Notion of Epistemic Specifications.",
            "Mechanizing Coinduction and Corecursion in Higher-Order Logic.",
            "Existential Least Fixed-Point Logic and its Relatives.",
            "Reading Between the Lines in Constructive Type Theory.",
            "Modal Deduction in Second-Order Logic and Set Theory - I.",
            "Verification of Meta-Interpreters.",
            "Expressive Power and Complexity in Algebraic Logic.",
            "Complexity of Satisfiability Problems with Symmetric Polynomial Clauses.",
            "Regular Search Spaces and Constructive Negation.",
            "Fixed-Point Logics, Generalized Quantifiers, and Oracles.",
            "A Normal Form for Temporal Logics and its Applications in Theorem-Proving and Execution.",
            "SAT-Problems and Reductions with Respect to the Number of Variables.",
            "On Gentzen Systems Associated with the Finite Linear MV-Algebras.",
            "Simulating Without Negation.",
            "Ground Nonmonotonic Modal Logics.",
            "Deterministic and Non-Deterministic Stable Models.",
            "Functional Translation and Second-Order Frame Properties of Modal Logics.",
            "Beyond Rational Monotony: Some Strong Non-Horn Rules for Nonmonotonic Inference Relations.",
            "Reasoning About Rational, But Not Logically Omniscient, Agents.",
            "Relations Between Propositional Normal Modal Logics: An Overview.",
            "A Description of the Tableau Method Using Abstract State Machines.",
            "Labelled Propositional Modal Logics: Theory and Practice.",
            "Modal Tableaux Based on Residuation.",
            "Unification Through Projectivity.",
            "Finite Failure is And-Compositional.",
            "A First-Order Conditional Logic with Qualitative Statistical Semantics.",
            "On the Indiscernibility of Individuals in Logic Programming."
        ]
    },
    {
        "name": "LOGCOM",
        "year": "1996",
        "info": "Volume 6: 1996",
        "count": 34,
        "papers": [
            "Note on a Lemma of Ladkin.",
            "Weak Theories of Operations and Types.",
            "A Formal Definition for the Expressive Power of Terminological Knowledge Representation Languages.",
            "Partial Applicative Theories and Explicit Substitutions.",
            "Simultaneous Replacement in Normal Programs.",
            "Modal Logic and Equality for Process Algebra.",
            "On the Very Weak 0-1 Law for Random Graphs with Orders.",
            "Hyperresolution and Automated Model Building.",
            "A Proof Theoretical Approach to Default Reasoning I: Tableaux for Default Logic.",
            "Linear Deductive Planning.",
            "On Negation Rationality.",
            "An Investigation of 'Non-Intermingling' Principles in Temporal Logic.",
            "Nonmonotonic Reasoning is Sometimes Simpler!",
            "Unification of Higher-Order Patterns in Linear Time and Space.",
            "Verification of Temporal Properties.",
            "On the Declarative and Procedural Semantics of Definite Metalogic Programs.",
            "Inclusions and Subtypes I: First-Order Case.",
            "A Linear Logic Approach to Consistency Preserving Updates.",
            "The Dynamic Logic of Permission.",
            "Resultants Semantics for Prolog.",
            "Buy One, Get One Free!!!",
            "Inclusions and Subtypes II: Higher-Order Case.",
            "An Interactive Solution to the n by n Mutilated Checkerboard Problem.",
            "Some Completeness Results for Stoppered and Ranked Classical Preferential Models.",
            "Generic Models of Logic Programs.",
            "Pruning Simply Typed Lambda-Terms.",
            "Novelty in Deductive Databases.",
            "Quantales and Structural Rules.",
            "Counting Variables in a Dynamic Setting.",
            "Logic Programming with Signs and Annotations.",
            "On Winning Strategies with Unary Quantifiers.",
            "Strong Normalizations of Substitutions.",
            "A-Ordered Tableaux.",
            "Adding Metatheoretic Facilities to First-Order Theories."
        ]
    },
    {
        "name": "LOGCOM",
        "year": "1995",
        "info": "Volume 5: 1995",
        "count": 30,
        "papers": [
            "Domain Theory Meets Default Logic.",
            "Aziomatization, Declarative Semantics and Operational Semantics of Passive and Active Updates in Logic Databases.",
            "On Average Case Complexity of SAT for Symmetric Distribution.",
            "Highway to the Danger Zone.",
            "Deductive Nonmonotonic Inference Operations: Antitonic Representations.",
            "Observable Semantics for Constraint Logic Programs.",
            "A Three-Valued Formalization of Provability.",
            "Semantical Analysis of Logic of Actions.",
            "Generalized Quantifiers and Logical Reducibilities.",
            "Object-Process Analysis: Maintaining the Balance Between System Structure and Behaviour.",
            "Paraconsistent Stable Semantics for Extended Disjunctive Programs.",
            "On the Independent Axiomatizability of Modal and Intermediate Logics.",
            "Reliable Semantics for Extended Logic Programs with Rule Prioritization.",
            "Counting Objects.",
            "Exterior Topology and Revision Spaces.",
            "Principal Typing in a forall-and-Discipline.",
            "Conjunctive Type Systems and Abstract Interpretation of Higher-Order Functional Programs.",
            "An intensional semantics for elementary program transformations.",
            "Completeness of Resolution for Definite Answers.",
            "Defaults as Generalized Quantifiers.",
            "A Naïve Time Analysis and its Theory of Cost Equivalence.",
            "Representing Incomplete Knowledge in Abductive Logic Programming.",
            "CHICA, an Abductive Planning System Based on Event Calculus.",
            "Object Specification Logic.",
            "Automated Mathematical Induction.",
            "Efficient Verified Programs in a Typed Theory with Mixed Constructivity.",
            "Automated Deduction with Shannon Graphs.",
            "A Common Knowledge Representation for Plan Generation and Reactive Execution.",
            "Formalizing Properties of Agents.",
            "Preferential Choice Representation Theorems for Branching Time Structures."
        ]
    },
    {
        "name": "LOGCOM",
        "year": "1994",
        "info": "Volume 4: 1994",
        "count": 40,
        "papers": [
            "A Hypothetical Reasoning Algorithm for Linguistic Analysis.",
            "Solution to a Problem of Goranko and Passy.",
            "The Monotonous Elimination of Predicate Variables.",
            "A Proof-Theoretic Analysis of Goal-Directed Provability.",
            "Circumscription in Data Logic for Data Type Specification.",
            "Intersection Types as Logical Formulae.",
            "Sequent Calculi for Normal Modal Proposisional Logics.",
            "Herbrand's Theorem for Nonstandard Inference Operations.",
            "Conjunctive Normal Forms in Three-Valued Propositional Logics.",
            "A Uniform Proof-Theoretic Investigation of Linear Logic Programming.",
            "Editorial.",
            "Rewrite-Based Equational Theorem Proving with Selection and Simplification.",
            "Input/Output Dependencies of Normal Logic Programs.",
            "Expressiveness for Highly Nested Expressions in Linear Temporal Logic.",
            "Unforgettable Forgetful Determinacy.",
            "The Taming of the Cut. Classical Refutations with Analytic Cut.",
            "Letter: Why Set Theory Without Foundation?",
            "Logical Description of Monotone NP Problems.",
            "A Modal Approach to Negation as Failure Rule.",
            "About Boundedness for Some Datalog and Datalogneg Programs.",
            "Linear Logic as CSP.",
            "Deduction in Concept Languages: From Subsumption to Instance Checking.",
            "Editorial.",
            "ADL and the State-Transition Model of Action.",
            "Narratives in the Situation Calculus.",
            "Actions and Events in Interval Temporal Logic.",
            "The Range of Applicability of Some Non-monotonic Logics for Strict Inertia.",
            "Turning an Action Formalism into a Planner - A Case Study.",
            "State Constraints Revisited.",
            "Explanation Closure, Action Closure and the Sandewall Test Suite for Reasoning about Change.",
            "A Monotonic Formalism for Events and Systems of Events.",
            "Knowledge Preconditions for Plans.",
            "Action Under Uncertainty.",
            "A Unified View of Belief Revision and Update.",
            "Modal Logic, Transition Systems and Processes.",
            "Linear Logic and Exceptions.",
            "Extending Temporal Logic Programming with Choice Predicates Non-Determinism.",
            "Short Conjunctive Normal Forms in Finitely Valued Logics.",
            "Some Properties of Linear Logic Proved by Semantic Methods.",
            "Process-Algebraic Interpretations of Positive Linear and Relevant Logics."
        ]
    },
    {
        "name": "LOGCOM",
        "year": "1993",
        "info": "Volume 3: 1993",
        "count": 34,
        "papers": [
            "Editorial.",
            "A Tableaux Method for Systematic Simultaneous Search for Refutationas and Models Using Equational Problems.",
            "Learning Theory and Descriptive Set Theory.",
            "Formalizing a Hierarchical Structure of Practical Mathematical Reasoning.",
            "An O(n log n)-Space Decision Procedure for Intuitionistic Propositional Logic.",
            "Lazy Theories of Operations and Types.",
            "Editorial.",
            "A Fixed Point Semantics for the ATMS.",
            "Unbounded Non-Determinism in CSP.",
            "Systems for Knowledge and Belief.",
            "A Deductive System for Existential Least Fixpoint Logic.",
            "Editorial: An Undergraduate Degree in Practical Reasoning.",
            "Injective Models and Disjunctive Relations.",
            "Ockhamist Computational Logic: Past-Sensitive Necessitation in CTL.",
            "The Relevance Graph of a BCK-Formula.",
            "A Complete Proof Synthesis Method for the Cube of Type Systems.",
            "Defeasible Dialectics: A Controversy-Oriented Approach Towards Defeasible Argumentation.",
            "Editorial: The Possibility of Generating True Conjectures.",
            "Naming and Identity in Epistemic Logics Part I: The Propositional Case.",
            "Defeasible Logic is Stable.",
            "Logic Programs for Primitive Recursive Sets.",
            "Composing Open Logic Programs.",
            "Editorial: The Elusive Locus of Logicality.",
            "Directly Sceptical Inheritance Cannot Capture the Intersection of Extensions.",
            "Supporting Transformations for the Partial Evaluation of Logic Programs.",
            "Levationis Laus.",
            "How to do Things with Worlds: On Formalizing Actions and Plans.",
            "2-Sequent Calculus: Intuitionism and Natural Deduction.",
            "Editorial: Logic in Abstract Interpretation.",
            "Modelling Prolog Control.",
            "On the Correspondence between Modal and Classical Logic: An Automated Approach.",
            "Ordered Logic Programming with Sets.",
            "Principal Type Schemes for the Strict Type Assignment System.",
            "Inhabitation in Intersection and Union Type Assignment Systems."
        ]
    },
    {
        "name": "LOGCOM",
        "year": "1992",
        "info": "Volume 2: 1992",
        "count": 31,
        "papers": [
            "Editorial.",
            "Using the Universal Modality: Gains and Questions.",
            "A Constructive Presentation for the Modal Connective of Necessity (\\Box).",
            "Axiomatic Systems, Deduction and Implication.",
            "Editorial.",
            "Logic and Exceptions: A Few Remarks.",
            "Finite Axiomatizations for Universal Domains.",
            "Assumption-Free Semantics for Ordered Logic Programs: On the Relationship between Well-Founded and Stable Partial Models.",
            "Efficient Temporal Satisfiability.",
            "Proof Nets for Lambek Calculus.",
            "Editorial.",
            "Modal Theorem Proving: An Equational Viewpoint.",
            "Logic Programming with Focusing Proofs in Linear Logic.",
            "The Pure Logic of Necessitation.",
            "The Arithmetical Hierarchy over the Reals.",
            "Complexity Results for Nonmonotonic Logics.",
            "Editorial.",
            "Bounded Fixed-Point Iteration.",
            "Relational Reversal of Abstract Interpretation.",
            "Compile-Time Garbage Collection for Higher-Order Functional Languages.",
            "Abstract Interpretation Frameworks.",
            "Editorial: Rhetoric versus Modernism in Computing.",
            "An Alternative Order for the Failures Model.",
            "Set Theory and Nominalization, Part I.",
            "A Synthesis of Two Approaches for Verifying Finite State Concurrent Systems.",
            "An Intuitionistic Predicate Logic Theorem Prover.",
            "Editorial.",
            "Some Results on Classical Preferential Models.",
            "Set Theory and Nominalization, Part II.",
            "Verisimilitude via Vietoris.",
            "Abductive Logic Programming."
        ]
    },
    {
        "name": "LOGCOM",
        "year": "1990",
        "info": "Volume 1: 1990/1991",
        "count": 34,
        "papers": [
            "Editorial.",
            "Abstract Interpretation, Logical Relations and Kan Extensions.",
            "Bilattices and Modal Operators.",
            "Finite and Circular Path Models for Branching Time Logics.",
            "Destructive Modal Resolution.",
            "Properties of a Pruning Operator.",
            "Editorial.",
            "A Fixpoint Semantics for Ordered Logic.",
            "Logics of Modal Terms for Systems Specification.",
            "An Axiomitization of the Temporal Logic with Until and Since over the Real Numbers.",
            "A Proof-Theoretic Approach to Logic Programming. I. Clauses as Rules.",
            "Editorial.",
            "Comparing the Expressibility of Languages Formed using NP-Complete Operators.",
            "Modal Logic and Negation as Failure.",
            "Temporal reasoning over deontic specifications.",
            "Combining Logic Programming and Equation Solving.",
            "Editorial.",
            "A Free Variable Version of the First-Order Predicate Calculus.",
            "A Modal Logic for Chopping Intervals.",
            "Semantics and Consistency of Rule-Based Expert Systems.",
            "A Logic Programming Language with Lambda-Abstraction, Function Variables, and Simple Unification.",
            "Some Syntactical Observations on Linear Logic.",
            "Editorial.",
            "Reasoning about Objects Using a Tableau Method.",
            "Rudimentary Beth Models and Conditionally Rudimentary Kripke Models for the Heyting Propositional Calculus.",
            "A Proof-Theoretic Approach to Logic Programming. II. Programs as Definitions.",
            "On the Relationship between Abduction and Deduction.",
            "Semantics-Based Translation Methods for Modal Logics.",
            "Editorial.",
            "Compositionality through an Operational Semantics of Contexts.",
            "Kleene's Logic, Generalized.",
            "A Complete Axiomatization of the Three-Valued Completion of Logic Programs.",
            "Logic Programming with Strong Negation and Inexact Predicates.",
            "Complete Problems Involving Boolean Labelled Structures and Projection Transactions."
        ]
    }
]