[
    {
        "year": "2021",
        "name": "46th MFCS 2021",
        "info": "Tallinn, Estonia",
        "venues": [
            {
                "sub_name_abbr": "conf/mfcs/2021",
                "sub_name": "46th International Symposium on Mathematical Foundations of Computer Science, MFCS 2021, August 23-27, 2021, Tallinn, Estonia.",
                "count": 91,
                "papers": [
                    "Front Matter, Table of Contents, Preface, Conference Organization.",
                    "Non-Axiomatizability of the Equational Theories of Positive Relation Algebras (Invited Talk).",
                    "A Deep Dive into the Weisfeiler-Leman Algorithm (Invited Talk).",
                    "Holonomic Techniques, Periods, and Decision Problems (Invited Talk).",
                    "On Dynamic Graphs (Invited Talk).",
                    "Sublinear Algorithms for Edit Distance (Invited Talk).",
                    "An Approximation Algorithm for the Matrix Tree Multiplication Problem.",
                    "Depth-First Search in Directed Planar Graphs, Revisited.",
                    "Order Reconfiguration Under Width Constraints.",
                    "Universal Gauge-Invariant Cellular Automata.",
                    "Equivalence Testing of Weighted Automata over Partially Commutative Monoids.",
                    "Finitely Tractable Promise Constraint Satisfaction Problems.",
                    "A Generic Strategy Improvement Method for Simple Stochastic Games.",
                    "(Un)Decidability for History Preserving True Concurrent Logics.",
                    "Parameterized Complexity of Feature Selection for Categorical Data Clustering.",
                    "Decision Questions for Probabilistic Automata on Small Alphabets.",
                    "Ideal Membership Problem for Boolean Minority and Dual Discriminator.",
                    "Graph Traversals as Universal Constructions.",
                    "Space-Efficient Fault-Tolerant Diameter Oracles.",
                    "ω-Forest Algebras and Temporal Logics.",
                    "Constructing Deterministic ω-Automata from Examples by an Extension of the RPNI Algorithm.",
                    "Computational Complexity of Covering Multigraphs with Semi-Edges: Small Cases.",
                    "Coherent Control and Distinguishability of Quantum Channels via PBS-Diagrams.",
                    "Reconfiguring Independent Sets on Interval Graphs.",
                    "Finite Convergence of μ-Calculus Fixpoints on Genuinely Infinite Structures.",
                    "Dots & Boxes Is PSPACE-Complete.",
                    "Uncertain Curve Simplification.",
                    "Fractional Homomorphism, Weisfeiler-Leman Invariance, and the Sherali-Adams Hierarchy for the Constraint Satisfaction Problem.",
                    "A Decidable Equivalence for a Turing-Complete, Distributed Model of Computation.",
                    "Black-Box Hypotheses and Lower Bounds.",
                    "Geometry of Interaction for ZX-Diagrams.",
                    "Diameter Versus Certificate Complexity of Boolean Functions.",
                    "Budgeted Dominating Sets in Uncertain Graphs.",
                    "On the Complexity of the Escape Problem for Linear Dynamical Systems over Compact Semialgebraic Sets.",
                    "The Pseudo-Skolem Problem is Decidable.",
                    "A Recursion-Theoretic Characterization of the Probabilistic Class PP.",
                    "Parallel Polynomial Permanent Mod Powers of 2 and Shortest Disjoint Cycles.",
                    "On the Relative Power of Linear Algebraic Approximations of Graph Isomorphism.",
                    "Maximum Cut on Interval Graphs of Interval Count Four Is NP-Complete.",
                    "Fuzzy Simultaneous Congruences.",
                    "Pebble Transducers with Unary Output.",
                    "Graph Characterization of the Universal Theory of Relations.",
                    "Co-Degeneracy and Co-Treewidth: Using the Complement to Solve Dense Instances.",
                    "Isometric Embeddings in Trees and Their Use in Distance Problems.",
                    "On Computing the Average Distance for Some Chordal-Like Graphs.",
                    "A Cubic Vertex-Kernel for Trivially Perfect Editing.",
                    "Lower Bounds on Avoiding Thresholds.",
                    "HyperLTL Satisfiability Is Σ₁¹-Complete, HyperCTL* Satisfiability Is Σ₁²-Complete.",
                    "Matching Patterns with Variables Under Hamming Distance.",
                    "Keyboards as a New Model of Computation.",
                    "Quantum Speedups for Dynamic Programming on n-Dimensional Lattice Graphs.",
                    "A Note on the Join of Varieties of Monoids with LI.",
                    "Optimal Regular Expressions for Palindromes of Given Length.",
                    "A Bit of Nondeterminism Makes Pushdown Automata Expressive and Succinct.",
                    "Perfect Forests in Graphs and Their Extensions.",
                    "On Deciding Linear Arithmetic Constraints Over p-adic Integers for All Primes.",
                    "Obstructing Classification via Projection.",
                    "Online Domination: The Value of Getting to Know All Your Neighbors.",
                    "A Linear-Time Nominal μ-Calculus with Name Allocation.",
                    "Test of Quantumness with Small-Depth Quantum Circuits.",
                    "On Search Complexity of Discrete Logarithm.",
                    "A Homological Condition on Equational Unifiability.",
                    "Ordered Fragments of First-Order Logic.",
                    "The Simplest Non-Regular Deterministic Context-Free Language.",
                    "On the Hardness of Compressing Weights.",
                    "Griddings of Permutations and Hardness of Pattern Matching.",
                    "Sets of Linear Forms Which Are Hard to Compute.",
                    "On Positivity and Minimality for Second-Order Holonomic Sequences.",
                    "Improved Upper Bounds for the Rigidity of Kronecker Products.",
                    "The Power of One Clean Qubit in Communication Complexity.",
                    "Connecting Constructive Notions of Ordinals in Homotopy Type Theory.",
                    "Maximum Votes Pareto-Efficient Allocations via Swaps on a Social Network.",
                    "Finite Models for a Spatial Logic with Discrete and Topological Path Operators.",
                    "Recursive Backdoors for SAT.",
                    "Parallel Algorithms for Power Circuits and the Word Problem of the Baumslag Group.",
                    "The Complexity of Transitively Orienting Temporal Graphs.",
                    "Temporal Reachability Minimization: Delaying vs. Deleting.",
                    "A Timecop's Chase Around the Table.",
                    "Syntactic Minimization Of Nondeterministic Finite Automata.",
                    "Idempotent Turing Machines.",
                    "Ergodic Theorems and Converses for PSPACE Functions.",
                    "On Guidable Index of Tree Automata.",
                    "Feedback Vertex Set and Even Cycle Transversal for H-Free Graphs: Finding Large Block Graphs.",
                    "Stabilization Bounds for Influence Propagation from a Random Initial State.",
                    "Parameterized (Modular) Counting and Cayley Graph Expanders.",
                    "A Hierarchy of Nondeterminism.",
                    "Boolean Automata and Atoms of Regular Languages.",
                    "The Gödel Fibration.",
                    "Abstract Congruence Criteria for Weak Bisimilarity.",
                    "Quantum Multiple-Valued Decision Diagrams in Graphical Calculi.",
                    "Decision Problems for Origin-Close Top-Down Tree Transducers."
                ]
            }
        ]
    },
    {
        "year": "2020",
        "name": "45th MFCS 2020",
        "info": "Prague, Czech Republic",
        "venues": [
            {
                "sub_name_abbr": "conf/mfcs/2020",
                "sub_name": "45th International Symposium on Mathematical Foundations of Computer Science, MFCS 2020, August 24-28, 2020, Prague, Czech Republic.",
                "count": 86,
                "papers": [
                    "Front Matter, Table of Contents, Preface, Conference Organization.",
                    "Concurrent Games with Arbitrarily Many Players (Invited Talk).",
                    "Some Open Problems in Computational Geometry (Invited Talk).",
                    "List-Decodability of Structured Ensembles of Codes (Invited Talk).",
                    "Isomorphism Problem for S_d-Graphs.",
                    "A Polynomial Kernel for 3-Leaf Power Deletion.",
                    "Complexity of Computing the Anti-Ramsey Numbers for Paths.",
                    "Best Fit Bin Packing with Random Order Revisited.",
                    "Quantum Lower and Upper Bounds for 2D-Grid and Dyck Language.",
                    "Dynamic Time Warping-Based Proximity Problems.",
                    "A Special Case of Rational Identity Testing and the Brešar-Klep Theorem.",
                    "Solving Packing Problems with Few Small Items Using Rainbow Matchings.",
                    "Decidability in Group Shifts and Group Cellular Automata.",
                    "Ideal Membership Problem and a Majority Polymorphism over the Ternary Domain.",
                    "Layered Fan-Planar Graph Drawings.",
                    "Topological Influence and Locality in Swap Schelling Games.",
                    "Approximation in (Poly-) Logarithmic Space.",
                    "Slice Rank of Block Tensors and Irreversibility of Structure Tensors of Algebras.",
                    "Computing a Minimum-Cost k-Hop Steiner Tree in Tree-Like Metrics.",
                    "Some Remarks on Deciding Equivalence for Graph-To-Graph Transducers.",
                    "List Homomorphism Problems for Signed Graphs.",
                    "On a Temporal Logic of Prefixes and Infixes.",
                    "Simplified Game of Life: Algorithms and Complexity.",
                    "Quantum-Inspired Sublinear Algorithm for Solving Low-Rank Semidefinite Programming.",
                    "PBS-Calculus: A Graphical Language for Coherent Control of Quantum Computations.",
                    "Enumeration of s-d Separators in DAGs with Application to Reliability Analysis in Temporal Graphs.",
                    "Span Programs and Quantum Time Complexity.",
                    "Exact and Approximate Algorithms for Computing a Second Hamiltonian Cycle.",
                    "Improved Explicit Data Structures in the Bit-Probe Model Using Error-Correcting Codes.",
                    "Register Transducers Are Marble Transducers.",
                    "Randomization in Non-Uniform Finite Automata.",
                    "Extending Nearly Complete 1-Planar Drawings in Polynomial Time.",
                    "The Mergegram of a Dendrogram and Its Stability.",
                    "Synchronizing Deterministic Push-Down Automata Can Be Really Hard.",
                    "Value Iteration Using Universal Graphs and the Complexity of Mean Payoff Games.",
                    "Building Large k-Cores from Sparse Graphs.",
                    "The Complexity of Approximating the Complex-Valued Potts Model.",
                    "Fast Algorithms for General Spin Systems on Bipartite Expanders.",
                    "Linear High-Order Deterministic Tree Transducers with Regular Look-Ahead.",
                    "Graph Clustering in All Parameter Regimes.",
                    "A Quasiorder-Based Perspective on Residual Automata.",
                    "Fractional Covers of Hypergraphs with Bounded Multi-Intersection.",
                    "Factoring Polynomials over Finite Fields with Linear Galois Groups: An Additive Combinatorics Approach.",
                    "Efficient Isolation of Perfect Matching in O(log n) Genus Bipartite Graphs.",
                    "Communication Complexity of the Secret Key Agreement in Algorithmic Information Theory.",
                    "∃ℝ-Completeness of Stationary Nash Equilibria in Perfect Information Stochastic Games.",
                    "Minimum 0-Extension Problems on Directed Metrics.",
                    "Hierarchical Clusterings of Unweighted Graphs.",
                    "On Affine Reachability Problems.",
                    "Structural Parameterizations of Clique Coloring.",
                    "Compressing Permutation Groups into Grammars and Polytopes. A Graph Embedding Approach.",
                    "Unary Prime Languages.",
                    "A Complexity Dichotomy for Permutation Pattern Matching on Grid Classes.",
                    "Quantum-Inspired Classical Algorithms for Singular Value Transformation.",
                    "On LTL Model Checking for Low-Dimensional Discrete Linear Dynamical Systems.",
                    "Even Faster Algorithms for CSAT Over supernilpotent Algebras.",
                    "Continuous and Monotone Machines.",
                    "U-Bubble Model for Mixed Unit Interval Graphs and Its Applications: The MaxCut Problem Revisited.",
                    "Regular Resynchronizability of Origin Transducers Is Undecidable.",
                    "On Repetition Languages.",
                    "Efficient Enumerations for Minimal Multicuts and Multiway Cuts.",
                    "Complexity of Counting First-Order Logic for the Subword Order.",
                    "Sensitivity Lower Bounds from Linear Dependencies.",
                    "Algorithms for the Rainbow Vertex Coloring Problem on Graph Classes.",
                    "Reducing Graph Transversals via Edge Contractions.",
                    "Elimination Distance to Bounded Degree on Planar Graphs.",
                    "Analysing Spatial Properties on Neighbourhood Spaces.",
                    "Knapsack and the Power Word Problem in Solvable Baumslag-Solitar Groups.",
                    "A Relaxation of the Directed Disjoint Paths Problem: A Global Congestion Metric Helps.",
                    "Regular Choice Functions and Uniformisations For countable Domains.",
                    "Quick Separation in Chordal and Split Graphs.",
                    "A Timecop's Work Is Harder Than You Think.",
                    "Randomized Polynomial-Time Equivalence Between Determinant and Trace-IMM Equivalence Tests.",
                    "Randomness and Effective Dimension of Continued Fractions.",
                    "Optimally Resilient Strategies in Pushdown Safety Games.",
                    "On the Parameterized Complexity of Deletion to ℋ-Free Strong Components.",
                    "Synchronous Boolean Finite Dynamical Systems on Directed Graphs over XOR Functions.",
                    "Preservation of Equations by Monoidal Monads.",
                    "VC Density of Set Systems Definable in Tree-Like Graphs.",
                    "All Growth Rates of Abelian Exponents Are Attained by Infinite Binary Words.",
                    "Ambiguity Hierarchy of Regular Infinite Tree Languages.",
                    "Palindromic k-Factorization in Pure Linear Time.",
                    "Hitting Forbidden Induced Subgraphs on Bounded Treewidth Graphs.",
                    "Classically Simulating Quantum Circuits with Local Depolarizing Noise.",
                    "An Improved Approximation Algorithm for Scheduling Under Arborescence Precedence Constraints.",
                    "The Combined Basic LP and Affine IP Relaxation for Promise VCSPs on Infinite Domains."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "44th MFCS 2019",
        "info": "Aachen, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/mfcs/2019",
                "sub_name": "44th International Symposium on Mathematical Foundations of Computer Science, MFCS 2019, August 26-30, 2019, Aachen, Germany.",
                "count": 84,
                "papers": [
                    "Front Matter, Table of Contents, Preface, Conference Organization.",
                    "Trustworthy Graph Algorithms (Invited Talk).",
                    "Guarded Kleene Algebra with Tests: Verification of Uninterpreted Programs in Nearly Linear Time (Invited Talk).",
                    "Picking Random Vertices (Invited Talk).",
                    "Popular Matchings: Good, Bad, and Mixed (Invited Talk).",
                    "Petri Net Reachability Problem (Invited Talk).",
                    "An Improved Online Algorithm for the Traveling Repairperson Problem on a Line.",
                    "Query-Competitive Sorting with Uncertainty.",
                    "Better Bounds for Online Line Chasing.",
                    "Nash Equilibria in Games over Graphs Equipped with a Communication Mechanism.",
                    "Parity Games: Zielonka's Algorithm in Quasi-Polynomial Time.",
                    "Bidding Mechanisms in Graph Games.",
                    "Cluster Deletion on Interval Graphs and Split Related Graphs.",
                    "Constrained Representations of Map Graphs and Half-Squares.",
                    "Colouring H-Free Graphs of Bounded Diameter.",
                    "Distance Labeling Schemes for Cube-Free Median Graphs.",
                    "One-Dimensional Guarded Fragments.",
                    "Finite Satisfiability of Unary Negation Fragment with Transitivity.",
                    "The Fluted Fragment with Transitivity.",
                    "Counting of Teams in First-Order Team Logics.",
                    "Approximating Activation Edge-Cover and Facility Location Problems.",
                    "Distributed Minimum Vertex Coloring and Maximum Independent Set in Chordal Graphs.",
                    "Multistage Knapsack.",
                    "Recursion Schemes, Discrete Differential Equations and Characterization of Polynomial Time Computations.",
                    "On the Coalgebra of Partial Differential Equations.",
                    "Random Subgroups of Rationals.",
                    "Counting Induced Subgraphs: An Algebraic Approach to #W[1]-hardness.",
                    "Packing Arc-Disjoint Cycles in Tournaments.",
                    "A Sub-Exponential FPT Algorithm and a Polynomial Kernel for Minimum Directed Bisection on Semicomplete Digraphs.",
                    "The Quantifier Alternation Hierarchy of Synchronous Relations.",
                    "Two variable fragment of Term Modal Logic.",
                    "Choiceless Logarithmic Space.",
                    "Faster FPT Algorithm for 5-Path Vertex Cover.",
                    "Parameterized Complexity of Fair Vertex Evaluation Problems.",
                    "A Complexity Dichotomy for Critical Values of the b-Chromatic Number of Graphs.",
                    "Parameterized Complexity of Conflict-Free Matchings and Paths.",
                    "On the Strength of Uniqueness Quantification in Primitive Positive Formulas.",
                    "Resolution Lower Bounds for Refutation Statements.",
                    "Tangles and Single Linkage Hierarchical Clustering.",
                    "Approximating the Orthogonality Dimension of Graphs and Hypergraphs.",
                    "Domination Above r-Independence: Does Sparseness Help?",
                    "Reducing the Domination Number of Graphs via Edge Contractions.",
                    "Measuring what Matters: A Hybrid Approach to Dynamic Programming with Treewidth.",
                    "The Power Word Problem.",
                    "Upper Bounds on the Length of Minimal Solutions to Certain Quadratic Word Equations.",
                    "The Power of the Weisfeiler-Leman Algorithm to Decompose Graphs.",
                    "The Domino Problem is Undecidable on Surface Groups.",
                    "P-Optimal Proof Systems for Each NP-Set but no Complete Disjoint NP-Pairs Relative to an Oracle.",
                    "Semicomputable Points in Euclidean Spaces.",
                    "Bounded-Depth Frege Complexity of Tseitin Formulas for All Graphs.",
                    "On the Expressivity of Linear Recursion Schemes.",
                    "Uniform Random Expressions Lack Expressivity.",
                    "Lower Bounds for Multilinear Order-Restricted ABPs.",
                    "On the Symmetries of and Equivalence Test for Design Polynomials.",
                    "The Complexity of Homomorphism Indistinguishability.",
                    "SZX-Calculus: Scalable Graphical Quantum Reasoning.",
                    "On the Stretch Factor of Polygonal Chains.",
                    "Deleting Edges to Restrict the Size of an Epidemic in Temporal Networks.",
                    "Constant Delay Enumeration with FPT-Preprocessing for Conjunctive Queries of Bounded Submodular Width.",
                    "Counting Homomorphisms Modulo a Prime Number.",
                    "Approximate Counting CSP Seen from the Other Side.",
                    "Uniformisation Gives the Full Strength of Regular Languages.",
                    "New Pumping Technique for 2-Dimensional VASS.",
                    "Computational Complexity of Synchronization under Regular Constraints.",
                    "A Constant-Time Colored Choice Dictionary with Almost Robust Iteration.",
                    "Fault Tolerant and Fully Dynamic DFS in Undirected Graphs: Simple Yet Efficient.",
                    "RLE Edit Distance in Near Optimal Time.",
                    "Indexing Graph Search Trees and Applications.",
                    "Additive Cellular Automata Over Finite Abelian Groups: Topological and Measure Theoretic Properties.",
                    "On Synthesis of Resynchronizers for Transducers.",
                    "Acceptance Ambiguity for Quantum Automata.",
                    "From Regular Expression Matching to Parsing.",
                    "Solving Systems of Equations in Supernilpotent Algebras.",
                    "Listing Induced Steiner Subgraphs as a Compact Way to Discover Steiner Trees in Graphs.",
                    "Enumeration of Preferred Extensions in Almost Oriented Digraphs.",
                    "Determinisation of Finitely-Ambiguous Copyless Cost Register Automata.",
                    "Aperiodic Weighted Automata and Weighted First-Order Logic.",
                    "A Congruence-based Perspective on Automata Minimization Algorithms.",
                    "Finding Optimal Solutions With Neighborly Help.",
                    "Reconfiguration of Minimum Steiner Trees via Vertex Exchanges.",
                    "The Perfect Matching Reconfiguration Problem.",
                    "Spectral Aspects of Symmetric Matrix Signings.",
                    "Efficient Analysis of Unambiguous Automata Using Matrix Semigroup Techniques.",
                    "On the Mortality Problem: From Multiplicative Matrix Equations to Linear Recurrence Sequences and Beyond."
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "43rd MFCS 2018",
        "info": "Liverpool, UK",
        "venues": [
            {
                "sub_name_abbr": "conf/mfcs/2018",
                "sub_name": "43rd International Symposium on Mathematical Foundations of Computer Science, MFCS 2018, August 27-31, 2018, Liverpool, UK.",
                "count": 85,
                "papers": [
                    "Front Matter, Table of Contents, Preface, Conference Organization.",
                    "Consensus Strings with Small Maximum Distance and Small Distance Sum.",
                    "Plain Stopping Time and Conditional Complexities Revisited.",
                    "Error-Tolerant Non-Adaptive Learning of a Hidden Hypergraph.",
                    "From Expanders to Hitting Distributions and Simulation Theorems.",
                    "Balance Problems for Integer Circuits.",
                    "On Hadamard Series and Rotating Q-Automata.",
                    "One-Sided Error Communication Complexity of Gap Hamming Distance.",
                    "Online Maximum Matching with Recourse.",
                    "Linking Focusing and Resolution with Selection.",
                    "Team Semantics for the Specification and Verification of Hyperproperties.",
                    "Consistency for Counting Quantifiers.",
                    "The b-Branching Problem in Digraphs.",
                    "Pairing heaps: the forward variant.",
                    "Simultaneous Multiparty Communication Protocols for Composed Functions.",
                    "Sliding Windows over Context-Free Languages.",
                    "Average Case Analysis of Leaf-Centric Binary Tree Sources.",
                    "Expressive Power, Satisfiability and Equivalence of Circuits over Nilpotent Algebras.",
                    "Lagrange's Theorem for Binary Squares.",
                    "A Two-Sided Error Distributed Property Tester For Conductance.",
                    "Graph Similarity and Approximate Isomorphism.",
                    "Finding Short Synchronizing Words for Prefix Codes.",
                    "Quantum vs. Classical Proofs and Subset Verification.",
                    "Timed Network Games with Clocks.",
                    "Hardness Results for Consensus-Halving.",
                    "Maximum Rooted Connected Expansion.",
                    "Interactive Proofs with Polynomial-Time Quantum Prover for Computing the Order of Solvable Groups.",
                    "On the Complexity of Team Logic and Its Two-Variable Fragment.",
                    "A Tight Analysis of the Parallel Undecided-State Dynamics with Two Colors.",
                    "Recovering Sparse Graphs.",
                    "Average-Case Polynomial-Time Computability of Hamiltonian Dynamics.",
                    "Generalized Budgeted Submodular Set Function Maximization.",
                    "Complexity of Preimage Problems for Deterministic Finite Automata.",
                    "The Complexity of Disjunctive Linear Diophantine Constraints.",
                    "Give Me Some Slack: Efficient Network Measurements.",
                    "Spanning-Tree Games.",
                    "Faster Exploration of Degree-Bounded Temporal Graphs.",
                    "Approximating Dominating Set on Intersection Graphs of Rectangles and L-frames.",
                    "On Efficiently Solvable Cases of Quantum k-SAT.",
                    "Balanced Connected Partitioning of Unweighted Grid Graphs.",
                    "Concurrent Games and Semi-Random Determinacy.",
                    "Low Rank Approximation of Binary Matrices: Column Subset Selection and Generalizations.",
                    "Optimal Strategies in Pushdown Reachability Games.",
                    "Why are CSPs Based on Partition Schemes Computationally Hard?.",
                    "Directed Graph Minors and Serial-Parallel Width.",
                    "The Complexity of Finding Small Separators in Temporal Graphs.",
                    "The Complexity of Transducer Synthesis from Multi-Sequential Specifications.",
                    "Pricing Problems with Buyer Preselection.",
                    "On Randomized Generation of Slowly Synchronizing Automata.",
                    "Counting Homomorphisms to Trees Modulo a Prime.",
                    "Car-Sharing between Two Locations: Online Scheduling with Two Servers.",
                    "The Robustness of LWPP and WPP, with an Application to Graph Reconstruction.",
                    "Shape Recognition by a Finite Automaton Robot.",
                    "Conflict Free Feedback Vertex Set: A Parameterized Dichotomy.",
                    "Largest Weight Common Subtree Embeddings with Distance Penalties.",
                    "Enumerating Minimal Transversals of Hypergraphs without Small Holes.",
                    "Collective Fast Delivery by Energy-Efficient Agents.",
                    "Parity to Safety in Polynomial Time for Pushdown and Collapsible Pushdown Systems.",
                    "Quantum Generalizations of the Polynomial Hierarchy with Applications to QMA(2).",
                    "A Subquadratic Algorithm for 3XOR.",
                    "Treewidth-Two Graphs as a Free Algebra.",
                    "On Pseudodeterministic Approximation Algorithms.",
                    "Testing Simon's congruence.",
                    "On the Price of Independence for Vertex Cover, Feedback Vertex Set and Odd Cycle Transversal.",
                    "Probabilistic Secret Sharing.",
                    "Extra Space during Initialization of Succinct Data Structures and Dynamical Initializable Arrays.",
                    "Fast Entropy-Bounded String Dictionary Look-Up with Mismatches.",
                    "New Results on Directed Edge Dominating Set.",
                    "Interval-Like Graphs and Digraphs.",
                    "Double Threshold Digraphs.",
                    "Tree Tribes and Lower Bounds for Switching Lemmas.",
                    "Projection Theorems Using Effective Dimension.",
                    "Polynomial-Time Equivalence Testing for Deterministic Fresh-Register Automata.",
                    "On W[1]-Hardness as Evidence for Intractability.",
                    "A Simple Augmentation Method for Matchings with Applications to Streaming Algorithms.",
                    "Reconfiguration of Graph Minors.",
                    "A Feferman-Vaught Decomposition Theorem for Weighted MSO Logic.",
                    "Maximum Area Axis-Aligned Square Packings.",
                    "Deterministically Counting Satisfying Assignments for Constant-Depth Circuits with Parity Gates, with Implications for Lower Bounds.",
                    "Results on the Dimension Spectra of Planar Lines.",
                    "Tight Bounds for Deterministic h-Shot Broadcast in Ad-Hoc Directed Radio Networks.",
                    "Depth Two Majority Circuits for Majority and List Expanders.",
                    "Optimization over the Boolean Hypercube via Sums of Nonnegative Circuit Polynomials.",
                    "Rainbow Vertex Coloring Bipartite Graphs and Chordal Graphs.",
                    "Listing Subgraphs by Cartesian Decomposition."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "42nd MFCS 2017",
        "info": "Aalborg, Denmark",
        "venues": [
            {
                "sub_name_abbr": "conf/mfcs/2017",
                "sub_name": "42nd International Symposium on Mathematical Foundations of Computer Science, MFCS 2017, August 21-25, 2017 - Aalborg, Denmark.",
                "count": 86,
                "papers": [
                    "Front Matter, Table of Contents, Preface, Conference Organization.",
                    "Does Looking Inside a Circuit Help?.",
                    "The Power of Programs over Monoids in DA.",
                    "Regular Language Distance and Entropy.",
                    "The Complexity of Boolean Surjective General-Valued CSPs.",
                    "On the Expressive Power of Quasiperiodic SFT.",
                    "Parameterized Algorithms for Partitioning Graphs into Highly Connected Clusters.",
                    "Hypercube LSH for Approximate near Neighbors.",
                    "Generalized Predecessor Existence Problems for Boolean Finite Dynamical Systems.",
                    "Dividing Splittable Goods Evenly and With Limited Fragmentation.",
                    "Small-Space LCE Data Structure with Constant-Time Queries.",
                    "ZX-Calculus: Cyclotomic Supplementarity and Incompleteness for Clifford+T Quantum Mechanics.",
                    "Counting Problems for Parikh Images.",
                    "Communication Complexity of Pairs of Graph Families with Applications.",
                    "Monitor Logics for Quantitative Monitor Automata.",
                    "The Complexity of Quantum Disjointness.",
                    "Smoothed and Average-Case Approximation Ratios of Mechanisms: Beyond the Worst-Case Analysis.",
                    "Time Complexity of Constraint Satisfaction via Universal Algebra.",
                    "The Hardness of Solving Simple Word Equations.",
                    "Comparison of Max-Plus Automata and Joint Spectral Radius of Tropical Matrices.",
                    "Binary Search in Graphs Revisited.",
                    "A Formal Semantics of Influence in Bayesian Reasoning.",
                    "The Complexity of SORE-definability Problems.",
                    "TC0 Circuits for Algorithmic Problems in Nilpotent Groups.",
                    "Better Complexity Bounds for Cost Register Automata.",
                    "Kernelization of the Subset General Position Problem in Geometry.",
                    "Satisfiable Tseitin Formulas Are Hard for Nondeterministic Read-Once Branching Programs.",
                    "The Complexity of Quantified Constraints Using the Algebraic Formulation.",
                    "Induced Embeddings into Hamming Graphs.",
                    "Structured Connectivity Augmentation.",
                    "Combinatorial Properties and Recognition of Unit Square Visibility Graphs.",
                    "Weighted Operator Precedence Languages.",
                    "Model Checking and Validity in Propositional and Modal Inclusion Logics.",
                    "Emptiness Problems for Integer Circuits.",
                    "Another Characterization of the Higher K-Trivials.",
                    "The Quantum Monad on Relational Structures.",
                    "Towards a Polynomial Kernel for Directed Feedback Vertex Set.",
                    "Timed Network Games.",
                    "Efficient Identity Testing and Polynomial Factorization in Nonassociative Free Rings.",
                    "Faster Algorithms for Mean-Payoff Parity Games.",
                    "Attainable Values of Reset Thresholds.",
                    "Lower Bounds and PIT for Non-Commutative Arithmetic Circuits with Restricted Parse Trees.",
                    "Approximation and Parameterized Algorithms for Geometric Independent Set with Shrinking.",
                    "Eilenberg Theorems for Free.",
                    "Membership Problem in GL(2, Z) Extended by Singular Matrices.",
                    "Grammars for Indentation-Sensitive Parsing.",
                    "The Power of Linear-Time Data Reduction for Maximum Matching.",
                    "Two-Planar Graphs Are Quasiplanar.",
                    "The Shortest Identities for Max-Plus Automata with Two States.",
                    "On the Upward/Downward Closures of Petri Nets.",
                    "On Multidimensional and Monotone k-SUM.",
                    "Parameterized Complexity of the List Coloring Reconfiguration Problem with Graph Parameters.",
                    "Automata in the Category of Glued Vector Spaces.",
                    "The Equivalence, Unambiguity and Sequentiality Problems of Finitely Ambiguous Max-Plus Tree Automata are Decidable.",
                    "New Insights on the (Non-)Hardness of Circuit Minimization and Related Problems.",
                    "Strategy Complexity of Concurrent Safety Games.",
                    "A Characterisation of Pi^0_2 Regular Tree Languages.",
                    "On the Exact Amount of Missing Information that Makes Finding Possible Winners Hard.",
                    "Fractal Intersections and Products via Algorithmic Dimension.",
                    "Domains for Higher-Order Games.",
                    "Fine-Grained Complexity of Rainbow Coloring and its Variants.",
                    "Faster Monte-Carlo Algorithms for Fixation Probability of the Moran Process on Undirected Graphs.",
                    "The 2CNF Boolean Formula Satisfiability Problem and the Linear Space Hypothesis.",
                    "Variations on Inductive-Recursive Definitions.",
                    "One-Dimensional Logic over Trees.",
                    "An Improved FPT Algorithm for the Flip Distance Problem.",
                    "Reversible Kleene lattices.",
                    "Lossy Kernels for Hitting Subgraphs.",
                    "Undecidable Problems for Probabilistic Network Programming.",
                    "Computational Complexity of Graph Partition under Vertex-Compaction to an Irreflexive Hexagon.",
                    "Recognizing Graphs Close to Bipartite Graphs.",
                    "Parameterized Algorithms and Kernels for Rainbow Matching.",
                    "Compositional Weak Metrics for Group Key Update.",
                    "Clique-Width for Graph Classes Closed under Complementation.",
                    "Computing the Maximum using (min, +) Formulas.",
                    "Selecting Nodes and Buying Links to Maximize the Information Diffusion in a Network.",
                    "K4-free Graphs as a Free Algebra.",
                    "Making Metric Temporal Logic Rational.",
                    "Complexity of Restricted Variants of Skolem and Related Problems.",
                    "Being Even Slightly Shallow Makes Life Hard.",
                    "Walrasian Pricing in Multi-Unit Auctions.",
                    "Distributed Strategies Made Easy.",
                    "On Definable and Recognizable Properties of Graphs of Bounded Treewidth (Invited Talk).",
                    "Hardness and Approximation of High-Dimensional Search Problems (Invited Talk).",
                    "Temporal Logics for Multi-Agent Systems (Invited Talk).",
                    "Ideal-Based Algorithms for the Symbolic Verification of Well-Structured Systems (Invited Talk)."
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "41st MFCS 2016",
        "info": "Kraków, Poland",
        "venues": [
            {
                "sub_name_abbr": "conf/mfcs/2016",
                "sub_name": "41st International Symposium on Mathematical Foundations of Computer Science, MFCS 2016, August 22-26, 2016 - Kraków, Poland.",
                "count": 90,
                "papers": [
                    "Front Matter, Foreword, Conference Organization, External Reviewers, Table of Contents.",
                    "How Far Are We From Having a Satisfactory Theory of Clustering?",
                    "Decidable Extensions of MSO.",
                    "Optimal Reachability in Weighted Timed Automata and Games.",
                    "Scale-Free Networks, Hyperbolic Geometry, and Efficient Algorithms.",
                    "RNA-Folding - From Hardness to Algorithms.",
                    "Integer Factoring Using Small Algebraic Dependencies.",
                    "Routing with Congestion in Acyclic Digraphs.",
                    "Stochastic Timed Games Revisited.",
                    "Inequity Aversion Pricing over Social Networks: Approximation Algorithms and Hardness Results.",
                    "Trading Determinism for Time in Space Bounded Computations.",
                    "Families of DFAs as Acceptors of omega-Regular Languages.",
                    "On the Complexity of Probabilistic Trials for Hidden Satisfiability Problems.",
                    "The Parameterized Complexity of Fixing Number and Vertex Individualization in Graphs.",
                    "Real Interactive Proofs for VPSPACE.",
                    "Synchronizing Data Words for Register Automata.",
                    "On the Sensitivity Conjecture for Read-k Formulas.",
                    "Graph Properties in Node-Query Setting: Effect of Breaking Symmetry.",
                    "Stable States of Perturbed Markov Chains.",
                    "On Degeneration of Tensors and Algebras.",
                    "Using Contracted Solution Graphs for Solving Reconfiguration Problems.",
                    "Pointer Quantum PCPs and Multi-Prover Games.",
                    "A Formal Exploration of Nominal Kleene Algebra.",
                    "On the Implicit Graph Conjecture.",
                    "Nested Weighted Limit-Average Automata of Bounded Width.",
                    "Conditionally Optimal Algorithms for Generalized Büchi Games.",
                    "FPT Algorithms for Plane Completion Problems.",
                    "Some Lower Bounds in Parameterized AC^0.",
                    "Space-Efficient Approximation Scheme for Maximum Matching in Sparse Graphs.",
                    "Logical Characterization of Bisimulation for Transition Relations over Probability Distributions with Internal Actions.",
                    "Ackermannian Integer Compression and the Word Problem for Hydra Groups.",
                    "A Note on the Advice Complexity of Multipass Randomized Logspace.",
                    "Complexity of Constraint Satisfaction Problems over Finite Subsets of Natural Numbers.",
                    "Faster Algorithms for the Maximum Common Subtree Isomorphism Problem.",
                    "A Single-Exponential Fixed-Parameter Algorithm for Distance-Hereditary Vertex Deletion.",
                    "Preprocessing Under Uncertainty: Matroid Intersection.",
                    "Ride Sharing with a Vehicle of Unlimited Capacity.",
                    "On the General Chain Pair Simplification Problem.",
                    "Computing DAWGs and Minimal Absent Words in Linear Time for Integer Alphabets.",
                    "On Planar Valued CSPs.",
                    "Determining Sets of Quasiperiods of Infinite Words.",
                    "On the Complexity Landscape of Connected f-Factor Problems.",
                    "On Existential MSO and its Relation to ETH.",
                    "Programming Biomolecules That Fold Greedily During Transcription.",
                    "Connected Reversible Mealy Automata of Prime Size Cannot Generate Infinite Burnside Groups.",
                    "Circuit Size Lower Bounds and #SAT Upper Bounds Through a General Framework.",
                    "On the Limits of Gate Elimination.",
                    "Algebraic Problems Equivalent to Beating Exponent 3/2 for Polynomial Factorization over Finite Fields.",
                    "On Synchronizing Colorings and the Eigenvectors of Digraphs.",
                    "Competitive Packet Routing with Priority Lists.",
                    "The Ground-Set-Cost Budgeted Maximum Coverage Problem.",
                    "Computational and Proof Complexity of Partial String Avoidability.",
                    "Deciding Semantic Finiteness of Pushdown Processes and First-Order Grammars w.r.t. Bisimulation Equivalence.",
                    "Minimal Phylogenetic Supertrees and Local Consensus Trees.",
                    "Quantum Communication Complexity of Distributed Set Joins.",
                    "On the Voting Time of the Deterministic Majority Process.",
                    "Space-Efficient Biconnected Components and Recognition of Outerplanar Graphs.",
                    "Multi-Party Protocols, Information Complexity and Privacy.",
                    "Dividing by Zero - How Bad Is It, Really?.",
                    "Advice Complexity of the Online Induced Subgraph Problem.",
                    "Decidability of Predicate Logics with Team Semantics.",
                    "On the Complexity of Universality for Partially Ordered NFAs.",
                    "Eulerian Paths with Regular Constraints.",
                    "On the Exact Learnability of Graph Parameters: The Case of Partition Functions.",
                    "A Preliminary Investigation of Satisfiability Problems Not Harder than 1-in-3-SAT.",
                    "Uniformization Problems for Tree-Automatic Relations and Top-Down Tree Transducers.",
                    "Two-Variable Logic over Countable Linear Orderings.",
                    "Piecewise Testable Languages and Nondeterministic Automata.",
                    "Stably Computing Order Statistics with Arithmetic Population Protocols.",
                    "Shortest Unique Substring Queries on Run-Length Encoded Strings.",
                    "Shattered Sets and the Hilbert Function.",
                    "Optimal Sparsification for Some Binary CSPs Using Low-Degree Polynomials.",
                    "Fully Dynamic Data Structure for LCE Queries in Compressed Space.",
                    "Undecidability of Two-dimensional Robot Games.",
                    "Algebraic Independence over Positive Characteristic: New Criterion and Applications to Locally Low Algebraic Rank Circuits.",
                    "Parameterized Algorithms on Perfect Graphs for Deletion to (r, l)-Graphs.",
                    "Supplementarity is Necessary for Quantum Diagram Reasoning.",
                    "The Covering Problem: A Unified Approach for Investigating the Expressive Power of Logics.",
                    "On the Complexity of Branching Games with Regular Conditions.",
                    "Symbolic Lookaheads for Bottom-up Parsing.",
                    "Structural Control in Weighted Voting Games.",
                    "Every Binary Pattern of Length Greater Than 14 Is Abelian-2-Avoidable.",
                    "Bounded Depth Circuits with Weighted Symmetric Gates: Satisfiability, Lower Bounds and Compression.",
                    "Transducer-Based Rewriting Games for Active XML.",
                    "Vector Reachability Problem in SL(2, Z).",
                    "The Generalised Colouring Numbers on Classes of Bounded Expansion.",
                    "Polynomial Space Randomness in Analysis.",
                    "Finding a Maximum 2-Matching Excluding Prescribed Cycles in Bipartite Graphs.",
                    "Transformation Between Regular Expressions and omega-Automata.",
                    "An Improved Approximation Algorithm for the Traveling Tournament Problem with Maximum Trip Length Two."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "40th MFCS 2015",
        "info": "Milan, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/mfcs/2015-1",
                "sub_name": "Mathematical Foundations of Computer Science 2015 - 40th International Symposium, MFCS 2015, Milan, Italy, August 24-28, 2015, Proceedings, Part I.",
                "count": 35,
                "papers": [
                    "Minimal and Monotone Minimal Perfect Hash Functions.",
                    "Equational Properties of Fixed Point Operations in Cartesian Categories: An Overview.",
                    "Reversible and Irreversible Computations of Deterministic Finite-State Devices.",
                    "Robust Inference and Local Algorithms.",
                    "Uniform Generation in Trace Monoids.",
                    "When Are Prime Formulae Characteristic?",
                    "Stochastization of Weighted Automata.",
                    "Algebraic Synchronization Criterion and Computing Reset Words.",
                    "Recurrence Function on Sturmian Words: A Probabilistic Study.",
                    "Exponential-Size Model Property for PDL with Separating Parallel Composition.",
                    "A Circuit Complexity Approach to Transductions.",
                    "Locally Chain-Parsable Languages.",
                    "Classes of Languages Generated by the Kleene Star of a Word.",
                    "Relating Paths in Transition Systems: The Fall of the Modal Mu-Calculus.",
                    "Weighted Automata and Logics on Graphs.",
                    "Longest Gapped Repeats and Palindromes.",
                    "Quasiperiodicity and Non-computability in Tilings.",
                    "The Transitivity Problem of Turing Machines.",
                    "Strong Inapproximability of the Shortest Reset Word.",
                    "Finitary Semantics of Linear Logic and Higher-Order Model-Checking.",
                    "Complexity of Propositional Independence and Inclusion Logic.",
                    "Modal Inclusion Logic: Being Lax is Simpler than Being Strict.",
                    "Differential Bisimulation for a Markovian Process Algebra.",
                    "On the Hardness of Almost-Sure Termination.",
                    "Graphs Identified by Logics with Counting.",
                    "Synchronizing Automata with Extremal Properties.",
                    "Ratio and Weight Quantiles.",
                    "Precise Upper and Lower Bounds for the Monotone Constraint Satisfaction Problem.",
                    "Definability by Weakly Deterministic Regular Expressions with Counters is Decidable.",
                    "On the Complexity of Reconfiguration in Systems with Legacy Components.",
                    "Eliminating Recursion from Monadic Datalog Programs on Trees.",
                    "Computability on the Countable Ordinals and the Hausdorff-Kuratowski Theorem (Extended Abstract).",
                    "Emergence on Decreasing Sandpile Models.",
                    "Lost in Self-Stabilization.",
                    "Equations and Coequations for Weighted Automata."
                ]
            },
            {
                "sub_name_abbr": "conf/mfcs/2015-2",
                "sub_name": "Mathematical Foundations of Computer Science 2015 - 40th International Symposium, MFCS 2015, Milan, Italy, August 24-28, 2015, Proceedings, Part II.",
                "count": 50,
                "papers": [
                    "Near-Optimal Asymmetric Binary Matrix Partitions.",
                    "Dual VP Classes.",
                    "On Tinhofer's Linear Programming Approach to Isomorphism Testing.",
                    "On the Complexity of Noncommutative Polynomial Factorization.",
                    "An Algebraic Proof of the Real Number PCP Theorem.",
                    "On the Complexity of Hub Labeling (Extended Abstract).",
                    "On the Complexity of Speed Scaling.",
                    "Almost All Functions Require Exponential Energy.",
                    "On Dynamic DFS Tree in Directed Graphs.",
                    "Metric Dimension of Bounded Width Graphs.",
                    "Equality, Revisited.",
                    "Bounding the Clique-Width of H-free Chordal Graphs.",
                    "New Bounds for the CLIQUE-GAP Problem Using Graph Decomposition Theory.",
                    "QMA with Subset State Witnesses.",
                    "Phase Transition for Local Search on Planted SAT.",
                    "Optimal Bounds for Estimating Entropy with PMF Queries.",
                    "Mutual Dimension and Random Sequences.",
                    "Optimal Algorithms and a PTAS for Cost-Aware Scheduling.",
                    "Satisfiability Algorithms and Lower Bounds for Boolean Formulas over Finite Bases.",
                    "Randomized Polynomial Time Protocol for Combinatorial Slepian-Wolf Problem.",
                    "Network Creation Games: Think Global - Act Local.",
                    "Oblivious Transfer from Weakly Random Self-Reducible Public-Key Cryptosystem.",
                    "Efficient Computations over Encrypted Data Blocks.",
                    "Polynomial Kernels for Weighted Problems.",
                    "A Shortcut to (Sun)Flowers: Kernels in Logarithmic Space or Linear Time.",
                    "Metastability of Asymptotically Well-Behaved Potential Games - (Extended Abstract).",
                    "The Shifted Partial Derivative Complexity of Elementary Symmetric Polynomials.",
                    "Parameterized Algorithms for Parity Games.",
                    "Algorithmic Applications of Tree-Cut Width.",
                    "Log-Concavity and Lower Bounds for Arithmetic Circuits.",
                    "Easy Multiple-Precision Divisors and Word-RAM Constants.",
                    "Visibly Counter Languages and the Structure of NC1.",
                    "The Price of Connectivity for Cycle Transversals.",
                    "Upper and Lower Bounds on Long Dual Paths in Line Arrangements.",
                    "A Numbers-on-Foreheads Game.",
                    "Faster Lightweight Lempel-Ziv Parsing.",
                    "Parallel Identity Testing for Skew Circuits with Big Powers and Applications.",
                    "On Probabilistic Space-Bounded Machines with Multiple Access to Random Tape.",
                    "Densest Subgraph in Dynamic Graph Streams.",
                    "The Offline Carpool Problem Revisited.",
                    "On Sampling Simple Paths in Planar Graphs According to Their Lengths.",
                    "Degree-Constrained Subgraph Reconfiguration is in P.",
                    "Generalized Pseudoforest Deletion: Algorithms and Uniform Kernel.",
                    "Efficient Equilibria in Polymatrix Coordination Games.",
                    "Finding Consensus Strings with Small Length Difference Between Input and Solution Strings.",
                    "Active Linking Attacks.",
                    "On the Complexity of Master Problems.",
                    "Efficient Algorithm for Computing All Low s-t Edge Connectivities in Directed Graphs.",
                    "Maximum Minimal Vertex Cover Parameterized by Vertex Cover.",
                    "Fast Dynamic Weight Matchings in Convex Bipartite Graphs."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "39th MFCS 2014",
        "info": "Budapest, Hungary",
        "venues": [
            {
                "sub_name_abbr": "conf/mfcs/2014-1",
                "sub_name": "Mathematical Foundations of Computer Science 2014 - 39th International Symposium, MFCS 2014, Budapest, Hungary, August 25-29, 2014. Proceedings, Part I.",
                "count": 46,
                "papers": [
                    "Partial-Observation Stochastic Reachability and Parity Games.",
                    "Random Deterministic Automata.",
                    "Communication Complexity Theory: Thirty-Five Years of Set Disjointness.",
                    "What Does the Local Structure of a Planar Graph Tell Us About Its Global Structure?",
                    "Choiceless Polynomial Time on Structures with Small Abelian Colour Classes.",
                    "Sofic-Dyck Shifts.",
                    "A Logical Characterization of Timed (non-)Regular Languages.",
                    "Asymptotic Monadic Second-Order Logic.",
                    "Towards Efficient Reasoning Under Guarded-Based Disjunctive Existential Rules.",
                    "Alternating Parity Krivine Automata.",
                    "Advances in Parametric Real-Time Reasoning.",
                    "Universal Lyndon Words.",
                    "Subword Complexity and Decomposition of the Set of Factors.",
                    "Cyclic Complexity of Words.",
                    "Classifying Recognizable Infinitary Trace Languages Using Word Automata.",
                    "Bounded Variable Logic, Parameterized Logarithmic Space, and Savitch's Theorem.",
                    "An Algebraic Characterization of Unary Two-Way Transducers.",
                    "Size-Change Abstraction and Max-Plus Automata.",
                    "Alternating Vector Addition Systems with States.",
                    "Information Rate of Some Classes of Non-regular Languages: An Automata-Theoretic Approach - (Extended Abstract).",
                    "Relating Nominal and Higher-Order Rewriting.",
                    "Expressivity and Succinctness of Order-Invariant Logics on Depth-Bounded Structures.",
                    "Two Recursively Inseparable Problems for Probabilistic Automata.",
                    "Monadic Second-Order Logic with Arbitrary Monadic Predicates.",
                    "Transforming Two-Way Alternating Finite Automata to One-Way Nondeterministic Automata.",
                    "Measure Properties of Game Tree Languages.",
                    "On Upper and Lower Bounds on the Length of Alternating Towers.",
                    "L ax F: Side Conditions and External Evidence as Monads.",
                    "The Monoid of Queue Actions.",
                    "Undecidable Properties of Self-affine Sets and Multi-tape Automata.",
                    "Complexity and Expressivity of Uniform One-Dimensional Fragment with Equality.",
                    "A Unifying Approach for Multistack Pushdown Automata.",
                    "Definability and Transformations for Cost Logics and Automatic Structures.",
                    "Generalised Lyndon-Schützenberger Equations.",
                    "Complexity of Equivalence and Learning for Multiplicity Tree Automata.",
                    "Monadic Datalog and Regular Tree Pattern Queries.",
                    "Model Checking Concurrent Recursive Programs Using Temporal Logics.",
                    "Decidability of the Interval Temporal Logic $\\mathsf{A\\bar{A}B\\bar{B}}$ over the Rationals.",
                    "Reachability in Pushdown Register Automata.",
                    "A Generalization of the Łoś-Tarski Preservation Theorem over Classes of Finite Structures.",
                    "Determinising Parity Automata.",
                    "Tight Bounds for Complementing Parity Automata.",
                    "On Infinite Words Determined by Indexed Languages.",
                    "A Pumping Lemma for Two-Way Finite Transducers.",
                    "Tractability Frontier for Dually-Closed Ord-Horn Quantified Constraint Satisfaction Problems.",
                    "The Dynamic Descriptive Complexity of k-Clique."
                ]
            },
            {
                "sub_name_abbr": "conf/mfcs/2014-2",
                "sub_name": "Mathematical Foundations of Computer Science 2014 - 39th International Symposium, MFCS 2014, Budapest, Hungary, August 25-29, 2014. Proceedings, Part II.",
                "count": 53,
                "papers": [
                    "On r-Simple k-Path.",
                    "Low-Depth Uniform Threshold Circuits and the Bit-Complexity of Straight Line Programs.",
                    "Zero Knowledge and Circuit Minimization.",
                    "A Tight Lower Bound on Certificate Complexity in Terms of Block Sensitivity and Sensitivity.",
                    "Õ(√n)-Space and Polynomial-Time Algorithm for Planar Directed Graph Reachability.",
                    "Forbidden Induced Subgraphs and the Price of Connectivity for Feedback Vertex Set.",
                    "Network-Based Dissolution.",
                    "On Unification of QBF Resolution-Based Calculi.",
                    "Minimum Planar Multi-sink Cuts with Connectivity Priors.",
                    "The Price of Envy-Freeness in Machine Scheduling.",
                    "On the Complexity of Some Ordering Problems.",
                    "The Relationship between Multiplicative Complexity and Nonlinearity.",
                    "Dual Connectedness of Edge-Bicolored Graphs and Beyond.",
                    "Combinatorial Voter Control in Elections.",
                    "An Improved Deterministic #SAT Algorithm for Small De Morgan Formulas.",
                    "On the Limits of Depth Reduction at Depth 3 Over Small Finite Fields.",
                    "Hitting Forbidden Subgraphs in Graphs of Bounded Treewidth.",
                    "Probabilistic Analysis of Power Assignments.",
                    "Existence of Secure Equilibrium in Multi-player Games with Perfect Information.",
                    "An Efficient Quantum Algorithm for Finding Hidden Parabolic Subgroups in the General Linear Group.",
                    "A Note on the Minimum Distance of Quantum LDPC Codes.",
                    "Minimum Bisection Is NP-hard on Unit Disk Graphs.",
                    "Query-Competitive Algorithms for Cheapest Set Problems under Uncertainty.",
                    "Streaming Kernelization.",
                    "A Reconfigurations Analogue of Brooks' Theorem.",
                    "Intersection Graphs of L-Shapes and Segments in the Plane.",
                    "Autoreducibility and Mitoticity of Logspace-Complete Sets for NP and Other Classes.",
                    "Editing to a Connected Graph of Given Degrees.",
                    "Circuit Complexity of Properties of Graphs with Constant Planar Cutwidth.",
                    "On Characterizations of Randomized Computation Using Plain Kolmogorov Complexity.",
                    "New Results for Non-Preemptive Speed Scaling.",
                    "Lower Bounds for Splittings by Linear Combinations.",
                    "On the Complexity of List Ranking in the Parallel External Memory Model.",
                    "Knocking Out P k -free Graphs.",
                    "Relating the Time Complexity of Optimization Problems in Light of the Exponential-Time Hypothesis.",
                    "Affine Consistency and the Complexity of Semilinear Constraints.",
                    "Small Complexity Classes for Computable Analysis.",
                    "Two Results about Quantum Messages.",
                    "Parameterized Approximations via d-Skew-Symmetric Multicut.",
                    "On the Clique Editing Problem.",
                    "On the Complexity of Symbolic Verification and Decision Problems in Bit-Vector Logic.",
                    "Computational Complexity of Covering Three-Vertex Multigraphs.",
                    "Finding Maximum Common Biconnected Subgraphs in Series-Parallel Graphs.",
                    "On Coloring Resilient Graphs.",
                    "Document Retrieval with One Wildcard.",
                    "An H n/2 Upper Bound on the Price of Stability of Undirected Network Design Games.",
                    "Traveling Salesman Problems in Temporal Graphs.",
                    "Inferring Strings from Lyndon Factorization.",
                    "Betweenness Centrality - Incremental and Faster.",
                    "Deterministic Parameterized Algorithms for the Graph Motif Problem.",
                    "The Two Queries Assumption and Arthur-Merlin Classes.",
                    "Flexible Bandwidth Assignment with Application to Optical Networks - (Extended Abstract).",
                    "Approximation Algorithms for Bounded Color Matchings via Convex Decompositions."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "38th MFCS 2013",
        "info": "Klosterneuburg, Austria",
        "venues": [
            {
                "sub_name_abbr": "conf/mfcs/2013",
                "sub_name": "Mathematical Foundations of Computer Science 2013 - 38th International Symposium, MFCS 2013, Klosterneuburg, Austria, August 26-30, 2013. Proceedings.",
                "count": 73,
                "papers": [
                    "Alternation Trading Proofs and Their Limitations.",
                    "Bin Packing Games with Selfish Items.",
                    "A Constructive Proof of the Topological Kruskal Theorem.",
                    "Logical and Structural Approaches to the Graph Isomorphism Problem.",
                    "Prior-Free Auctions of Digital Goods.",
                    "Synthesis from Temporal Specifications: New Applications in Robotics and Model-Driven Development.",
                    "Clustering on k-Edge-Colored Graphs.",
                    "How to Pack Your Items When You Have to Buy Your Knapsack.",
                    "Computing Behavioral Distances, Compositionally.",
                    "Which Finitely Ambiguous Automata Recognize Finitely Sequential Functions? - (Extended Abstract).",
                    "Rewriting Guarded Negation Queries.",
                    "Parity Games and Propositional Proofs.",
                    "Logic and Branching Automata.",
                    "A Constant Factor Approximation for the Generalized Assignment Problem with Minimum Quantities and Unit Size Items.",
                    "Determinacy and Rewriting of Top-Down and MSO Tree Transformations.",
                    "On the Speed of Constraint Propagation and the Time Complexity of Arc Consistency Testing.",
                    "Validity of Tree Pattern Queries with Respect to Schema Information.",
                    "Auctions for Partial Heterogeneous Preferences.",
                    "New Polynomial Cases of the Weighted Efficient Domination Problem.",
                    "Bringing Order to Special Cases of Klee's Measure Problem.",
                    "Random Shortest Paths: Non-euclidean Instances for Metric Optimization Problems.",
                    "Semilinearity and Context-Freeness of Languages Accepted by Valence Automata.",
                    "Learning Reductions to Sparse Sets.",
                    "Probabilistic Automata with Isolated Cut-Points.",
                    "On Stochastic Games with Multiple Objectives.",
                    "Minimal Indices for Successor Search - (Extended Abstract).",
                    "Paradigms for Parameterized Enumeration.",
                    "Complexity of Checking Bisimilarity between Sequential and Parallel Processes.",
                    "Guarding Orthogonal Art Galleries Using Sliding Cameras: Algorithmic and Hardness Results.",
                    "Linear-Space Data Structures for Range Frequency Queries on Arrays and Trees.",
                    "Noninterference with Local Policies.",
                    "In-Place Binary Counters.",
                    "Rent or Buy Problems with a Fixed Time Horizon.",
                    "On the Recognition of Four-Directional Orthogonal Ray Graphs.",
                    "Reachability Analysis of Recursive Quantum Markov Chains.",
                    "Ordering Metro Lines by Block Crossings.",
                    "Reachability in Register Machines with Polynomial Updates.",
                    "On the Parameterized Complexity of Cutting a Few Vertices from a Graph.",
                    "On Fixed-Polynomial Size Circuit Lower Bounds for Uniform Polynomials in the Sense of Valiant.",
                    "A Parameterized Complexity Analysis of Combinatorial Feature Selection Problems.",
                    "Meta-kernelization with Structural Parameters.",
                    "Separating Hierarchical and General Hub Labelings.",
                    "Solving 3-Superstring in 3 n/3 Time.",
                    "On the Parameterized Complexity of the Maximum Edge 2-Coloring Problem.",
                    "A Note on Deterministic Poly-Time Algorithms for Partition Functions Associated with Boolean Matrices with Prescribed Row and Column Sums.",
                    "Polynomial Threshold Functions and Boolean Threshold Circuits.",
                    "Reachability in Higher-Order-Counters.",
                    "Length-Increasing Reductions for PSPACE-Completeness.",
                    "Improved Complexity Results on k-Coloring P t -Free Graphs.",
                    "A Polychromatic Ramsey Theory for Ordinals.",
                    "Detecting Regularities on Grammar-Compressed Strings.",
                    "Small Depth Proof Systems.",
                    "Reversibility of Computations in Graph-Walking Automata.",
                    "Prime Languages.",
                    "Logical Aspects of the Lexicographic Order on 1-Counter Languages.",
                    "Helly Circular-Arc Graph Isomorphism Is in Logspace.",
                    "Zeno, Hercules and the Hydra: Downward Rational Termination Is Ackermannian.",
                    "Strong Completeness for Markovian Logics.",
                    "Arithmetic Branching Programs with Memory.",
                    "Subexponential Algorithm for d-Cluster Edge Deletion: Exception or Rule?",
                    "Unlimited Decidability of Distributed Synthesis with Limited Missing Knowledge.",
                    "Revisiting Space in Proof Complexity: Treewidth and Pathwidth.",
                    "Space-Efficient Parallel Algorithms for Combinatorial Search Problems.",
                    "Separating Regular Languages by Piecewise Testable and Unambiguous Languages.",
                    "An Unusual Temporal Logic.",
                    "A More Efficient Simulation Algorithm on Kripke Structures.",
                    "A Planarity Test via Construction Sequences.",
                    "Feasible Combinatorial Matrix Theory.",
                    "Approximation Algorithms for Generalized Plant Location.",
                    "Hardness of Classically Simulating Quantum Circuits with Unbounded Toffoli and Fan-Out Gates.",
                    "Improved Bounds for Reduction to Depth 4 and Depth 3.",
                    "Parameterized Algorithms for Module Motif.",
                    "On the Quantifier-Free Dynamic Complexity of Reachability."
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "37th MFCS 2012",
        "info": "Bratislava, Slovakia",
        "venues": [
            {
                "sub_name_abbr": "conf/mfcs/2012",
                "sub_name": "Mathematical Foundations of Computer Science 2012 - 37th International Symposium, MFCS 2012, Bratislava, Slovakia, August 27-31, 2012. Proceedings.",
                "count": 71,
                "papers": [
                    "On the Complexity of Ontological Reasoning under Disjunctive Existential Rules.",
                    "New Races in Parameterized Algorithmics.",
                    "Scott Is Always Simple.",
                    "A Toolkit for Proving Limitations of the Expressive Power of Logics.",
                    "How to Reconstruct a Genome.",
                    "Simple Models for Recursive Schemes.",
                    "Transportation under Nasty Side Constraints.",
                    "Computation of Least Fixed Points.",
                    "Unordered Constraint Satisfaction Games.",
                    "A Polynomial-Time Algorithm for Computing the Maximum Common Subgraph of Outerplanar Graphs of Bounded Degree.",
                    "Reductions to the Set of Random Strings: The Resource-Bounded Case.",
                    "Approximate Graph Isomorphism.",
                    "Near-Optimal Expanding Generator Sets for Solvable Permutation Groups.",
                    "Generating Functions of Timed Languages.",
                    "The Robust Set Problem: Parameterized Complexity and Approximation.",
                    "Mortality for 2×2 Matrices Is NP-Hard.",
                    "Solving Counter Parity Games.",
                    "Drawing Planar Graphs on Points Inside a Polygon.",
                    "New Advances in Reoptimizing the Minimum Steiner Tree Problem.",
                    "Smoothed Complexity Theory.",
                    "Abelian Pattern Avoidance in Partial Words.",
                    "The Complexity of Rerouting Shortest Paths.",
                    "Computing with Large Populations Using Interactions.",
                    "Pancake Flipping Is Hard.",
                    "In-place Heap Construction with Optimized Comparisons, Moves, and Cache Misses.",
                    "Model Checking Stochastic Branching Processes.",
                    "Parameterized Study of the Test Cover Problem.",
                    "Sitting Closer to Friends Than Enemies, Revisited.",
                    "A Dichotomy Theorem for Homomorphism Polynomials.",
                    "Finite State Transducers for Modular Möbius Number Systems.",
                    "Zero-Knowledge Proofs via Polynomial Representations.",
                    "Cluster Vertex Deletion: A Parameterization between Vertex Cover and Clique-Width.",
                    "On the Impact of Fair Best Response Dynamics.",
                    "Fast Balanced Partitioning Is Hard Even on Grids and Trees.",
                    "A Characterization of Bispecial Sturmian Words.",
                    "Online Sum-Radii Clustering.",
                    "Observe and Remain Silent (Communication-Less Agent Location Discovery).",
                    "When Trees Grow Low: Shrubs and Fast MSO1.",
                    "Strategy Machines and Their Complexity.",
                    "Coloring Graphs Characterized by a Forbidden Subgraph.",
                    "Obtaining Planarity by Contracting Few Edges.",
                    "Light Spanners in Bounded Pathwidth Graphs.",
                    "Planarizing Gadgets for Perfect Matching Do Not Exist.",
                    "Kernels for Edge Dominating Set: Simpler or Smaller.",
                    "Categories of Coalgebraic Games.",
                    "Quasi-recognizable vs MSO Definable Languages of One-Dimensional Overlapping Tiles - (Extended Abstract).",
                    "An Improved Approximation Scheme for Variable-Sized Bin Packing.",
                    "Gathering an Even Number of Robots in an Odd Ring without Global Multiplicity Detection.",
                    "Reversal Hierarchies for Small 2DFAs.",
                    "Strictness of the Collapsible Pushdown Hierarchy.",
                    "Computational Complexity of Smooth Differential Equations.",
                    "The Lower Reaches of Circuit Uniformity.",
                    "The Join Levels of the Trotter-Weil Hierarchy Are Decidable.",
                    "Equations X + A = B and (X + X) + C = (X - X) + D over Sets of Natural Numbers.",
                    "Weakly-Synchronized Ground Tree Rewriting - (with Applications to Verifying Multithreaded Programs).",
                    "Descriptional Complexity of Deterministic Regular Expressions.",
                    "Identity Testing, Multilinearity Testing, and Monomials in Read-Once/Twice Formulas and Branching Programs.",
                    "Fine and Wilf's Theorem and Pseudo-repetitions.",
                    "Taking It to the Limit: Approximate Reasoning for Markov Processes.",
                    "Asymmetric Swap-Equilibrium: A Unifying Equilibrium Concept for Network Creation Games.",
                    "Between Tree Patterns and Conjunctive Queries: Is There Tractability beyond Acyclicity?",
                    "Reducing a Target Interval to a Few Exact Queries.",
                    "Maximum Cliques in Graphs with Small Intersection Number and Random Intersection Graphs.",
                    "A Finite Basis for 'Almost Future' Temporal Logic over the Reals.",
                    "Constructing Premaximal Ternary Square-Free Words of Any Level.",
                    "Regularity Problems for Weak Pushdown ω-Automata and Games.",
                    "Computational Aspects of Cellular Automata on Countable Sofic Shifts.",
                    "Computing Lempel-Ziv Factorization Online.",
                    "On Two Stronger Versions of Dejean's Conjecture.",
                    "Probabilistic Automata and Probabilistic Logic.",
                    "A Quadratic Vertex Kernel for Feedback Arc Set in Bipartite Tournaments."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "36th MFCS 2011",
        "info": "Warsaw, Poland",
        "venues": [
            {
                "sub_name_abbr": "conf/mfcs/2011",
                "sub_name": "Mathematical Foundations of Computer Science 2011 - 36th International Symposium, MFCS 2011, Warsaw, Poland, August 22-26, 2011. Proceedings.",
                "count": 54,
                "papers": [
                    "Nearest Neighbor Search in High-Dimensional Spaces.",
                    "Invariantization of Listings.",
                    "Duality and Recognition.",
                    "Some Variants of the Star Height Problem.",
                    "Generic Techniques to Round SDP Relaxations.",
                    "New Proofs in Graph Minors.",
                    "The Least-Core of Threshold Network Flow Games.",
                    "Adhesivity Is Not Enough: Local Church-Rosser Revisited.",
                    "Quantitative Refinement for Weighted Modal Transition Systems.",
                    "Faster Coupon Collecting via Replication with Applications in Gossiping.",
                    "Verifying Proofs in Constant Depth.",
                    "The Complexity of the Cover Polynomials for Planar Graphs of Bounded Degree.",
                    "Model Checking Coverability Graphs of Vector Addition Systems.",
                    "Hard Functions for Low-Degree Polynomials over Prime Fields.",
                    "Temporal Logics for Concurrent Recursive Programs: Satisfiability and Model Checking.",
                    "The Reachability Problem for Vector Addition System with One Zero-Test.",
                    "The Bounded Search Tree Algorithm for the Closest String Problem Has Quadratic Smoothed Complexity.",
                    "Solving Analytic Differential Equations in Polynomial Time over Unbounded Domains.",
                    "Pattern-Guided Data Anonymization and Clustering.",
                    "Language Equivalence of Deterministic Real-Time One-Counter Automata Is NL-Complete.",
                    "Energy and Mean-Payoff Parity Markov Decision Processes.",
                    "The Role of Polymorphism in the Characterisation of Complexity by Soft Types.",
                    "An Algebraic Theory of Complexity for Valued Constraints: Establishing a Galois Connection.",
                    "On the Use of Guards for Logics with Data.",
                    "An Elementary Proof of a 3n - o(n) Lower Bound on the Circuit Complexity of Affine Dispersers.",
                    "On the Complexity of the l-diversity Problem.",
                    "Infinite Synchronizing Words for Probabilistic Automata.",
                    "Characterizing EF over Infinite Trees and Modal Logic on Transitive Graphs.",
                    "Parity Games on Graphs with Medium Tree-Width.",
                    "Satisfiability of Systems of Equations of Real Analytic Functions Is Quasi-decidable.",
                    "On Minimising Automata with Errors.",
                    "Contracting a Chordal Graph to a Split Graph or a Tree.",
                    "Quantum Finite Automata and Probabilistic Reversible Automata: R-trivial Idempotent Languages.",
                    "A Universally Defined Undecidable Unimodal Logic.",
                    "On the Approximability of Minimum Topic Connected Overlay and Its Special Instances.",
                    "Can Everybody Sit Closer to Their Friends Than Their Enemies?",
                    "Submodularity on a Tree: Unifying $L^\\natural$ -Convex and Bisubmodular Functions.",
                    "Streaming Algorithms for Recognizing Nearly Well-Parenthesized Expressions.",
                    "Size and Computation of Injective Tree Automatic Presentations.",
                    "Symmetric Functions Capture General Functions.",
                    "Compressed Word Problems for Inverse Monoids.",
                    "Pushing for Weighted Tree Automata.",
                    "Periodicity Algorithms for Partial Words.",
                    "State Complexity of Operations on Input-Driven Pushdown Automata.",
                    "Conflict Packing Yields Linear Vertex-Kernels for k -FAST, k -dense RTI and a Related Problem.",
                    "Transduction on Kadanoff Sand Pile Model Avalanches, Application to Wave Pattern Emergence.",
                    "Problems Parameterized by Treewidth Tractable in Single Exponential Time: A Logical Approach.",
                    "Distributed Synthesis for Regular and Contextfree Specifications.",
                    "Geometric Graphs with Randomly Deleted Edges - Connectivity and Routing Protocols.",
                    "Untimed Language Preservation in Timed Systems.",
                    "Lower Bounds for Linear Decision Trees via an Energy Complexity Argument.",
                    "Weak Cost Monadic Logic over Infinite Trees.",
                    "Linear Problem Kernels for Planar Graph Problems with Small Distance Property.",
                    "New Parameterized Algorithms for the Edge Dominating Set Problem."
                ]
            }
        ]
    },
    {
        "year": "2010",
        "name": "35th MFCS 2010",
        "info": "Brno, Czech Republic",
        "venues": [
            {
                "sub_name_abbr": "conf/mfcs/2010",
                "sub_name": "Mathematical Foundations of Computer Science 2010, 35th International Symposium, MFCS 2010, Brno, Czech Republic, August 23-27, 2010. Proceedings.",
                "count": 61,
                "papers": [
                    "New Developments in Quantum Algorithms.",
                    "Persistent Homology under Non-uniform Error.",
                    "Information Complexity of Online Problems.",
                    "Algorithmic Lower Bounds for Problems on Decomposable Graphs.",
                    "Do We Really Understand the Crossing Numbers?",
                    "Balanced Queries: Divide and Conquer.",
                    "Slowly Synchronizing Automata and Digraphs.",
                    "Weights of Exact Threshold Functions.",
                    "Proof Systems and Transformation Games.",
                    "Scheduling Real-Time Mixed-Criticality Jobs.",
                    "A dexptime-Complete Dolev-Yao Theory with Distributive Encryption.",
                    "On Problem Kernels for Possible Winner Determination under the k-Approval Protocol.",
                    "Counting Minimum (s, t)-Cuts in Weighted Planar Graphs in Polynomial Time.",
                    "Finding Best Swap Edges Minimizing the Routing Cost of a Spanning Tree.",
                    "Improved Approximability and Non-approximability Results for Graph Diameter Decreasing Problems.",
                    "Distance Constraint Satisfaction Problems.",
                    "Faster Algorithms on Branch and Clique Decompositions.",
                    "Exponential Space Complexity for Symbolic Maximum Flow Algorithms in 0-1 Networks.",
                    "Robust Computations with Dynamical Systems.",
                    "On Factor Universality in Symbolic Spaces.",
                    "Toward a Deterministic Polynomial Time Algorithm with Optimal Additive Query Complexity.",
                    "Resource Combinatory Algebras.",
                    "Randomness for Free.",
                    "Qualitative Analysis of Partially-Observable Markov Decision Processes.",
                    "All Symmetric Predicates in NSPACE(n2) Are Stably Computable by the Mediated Population Protocol Model.",
                    "Online Clustering with Variable Sized Clusters.",
                    "Deterministic Rendezvous of Asynchronous Bounded-Memory Agents in Polygonal Terrains.",
                    "Counting Classes and the Fine Structure between NC1 and L.",
                    "The Average Complexity of Moore's State Minimization Algorithm Is O(n log log n).",
                    "Connected Searching of Weighted Trees.",
                    "Iterated Regret Minimization in Game Graphs.",
                    "Properties of Visibly Pushdown Transducers.",
                    "Second-Order Algebraic Theories - (Extended Abstract).",
                    "Frame Definability for Classes of Trees in the µ-calculus.",
                    "Evaluating Non-square Sparse Bilinear Forms on Multiple Vector Pairs in the I/O-Model.",
                    "Finding and Counting Vertex-Colored Subtrees.",
                    "Limiting Negations in Bounded Treewidth and Upward Planar Circuits.",
                    "On the Topological Complexity of MSO+U and Related Automata Models.",
                    "Least and Greatest Solutions of Equations over Sets of Integers.",
                    "Improved Simulation of Nondeterministic Turing Machines.",
                    "The Prize-Collecting Edge Dominating Set Problem in Trees.",
                    "The Multivariate Resultant Is NP-hard in Any Characteristic.",
                    "Parameterized Complexity and Kernelizability of Max Ones and Exact Ones Problems.",
                    "Meta-Envy-Free Cake-Cutting Protocols.",
                    "Two Variables and Two Successors.",
                    "Harnessing MLF with the Power of System F.",
                    "Describing Average- and Longtime-Behavior by Weighted MSO Logics.",
                    "Solving minones-2-sat as Fast as vertex cover.",
                    "Unambiguous Finite Automata over a Unary Alphabet.",
                    "The Complexity of Finding Reset Words in Finite Automata.",
                    "Does Treewidth Help in Modal Satisfiability? - (Extended Abstract).",
                    "Asynchronous Omega-Regular Games with Partial Information.",
                    "Parity Games with Partial Information Played on Graphs of Bounded Complexity.",
                    "Revisiting Ackermann-Hardness for Lossy Counter Machines and Reset Petri Nets.",
                    "Enumeration of the Monomials of a Polynomial and Related Complexity Classes.",
                    "Faster Approximation Schemes and Parameterized Algorithms on H-Minor-Free and Odd-Minor-Free Graphs.",
                    "Semi-linear Parikh Images of Regular Expressions via Reduction.",
                    "Breaking the Rectangle Bound Barrier against Formula Size Lower Bounds.",
                    "Mesh Deformation of Dynamic Smooth Manifolds with Surface Correspondences.",
                    "Counting Dependent and Independent Strings.",
                    "Impossibility of Independence Amplification in Kolmogorov Complexity Theory."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "34th MFCS 2009",
        "info": "Novy Smokovec, High Tatras, Slovakia",
        "venues": [
            {
                "sub_name_abbr": "conf/mfcs/2009",
                "sub_name": "Mathematical Foundations of Computer Science 2009, 34th International Symposium, MFCS 2009, Novy Smokovec, High Tatras, Slovakia, August 24-28, 2009. Proceedings.",
                "count": 63,
                "papers": [
                    "Four Subareas of the Theory of Constraints, and Their Links.",
                    "Synchronization of Regular Automata.",
                    "Stochastic Process Creation.",
                    "Stochastic Games with Finitary Objectives.",
                    "Stochastic Data Streams.",
                    "Recent Advances in Population Protocols.",
                    "How to Sort a Train.",
                    "Arithmetic Circuits, Monomial Algebras and Finite Automata.",
                    "An Improved Approximation Bound for Spanning Star Forest and Color Saving.",
                    "Energy-Efficient Communication in Multi-interface Wireless Networks.",
                    "Private Capacities in Mechanism Design.",
                    "Towards a Dichotomy of Finding Possible Winners in Elections Based on Scoring Rules.",
                    "Sampling Edge Covers in 3-Regular Graphs.",
                    "Balanced Paths in Colored Graphs.",
                    "Few Product Gates But Many Zeros.",
                    "Branching Programs for Tree Evaluation.",
                    "A Dichotomy Theorem for Polynomial Evaluation.",
                    "DP-Complete Problems Derived from Extremal NP-Complete Properties.",
                    "The Synchronization Problem for Locally Strongly Transitive Automata.",
                    "Constructing Brambles.",
                    "Self-indexed Text Compression Using Straight-Line Programs.",
                    "Security and Tradeoffs of the Akl-Taylor Scheme and Its Variants.",
                    "Parameterized Complexity Classes under Logical Reductions.",
                    "The Communication Complexity of Non-signaling Distributions.",
                    "How to Use Spanning Trees to Navigate in Graphs.",
                    "Representing Groups on Graphs.",
                    "Admissible Strategies in Infinite Games over Graphs.",
                    "A Complexity Dichotomy for Finding Disjoint Solutions of Vertex Deletion Problems.",
                    "Future-Looking Logics on Data Words and Trees.",
                    "A By-Level Analysis of Multiplicative Exponential Linear Logic.",
                    "Hyper-minimisation Made Efficient.",
                    "Regular Expressions with Counting: Weak versus Strong Determinism.",
                    "Choosability of P5-Free Graphs.",
                    "Time-Bounded Kolmogorov Complexity and Solovay Functions.",
                    "The Longest Path Problem Is Polynomial on Interval Graphs.",
                    "Synthesis for Structure Rewriting Systems.",
                    "On the Hybrid Extension of CTL and CTL+.",
                    "Bounds on Non-surjective Cellular Automata.",
                    "FO Model Checking on Nested Pushdown Trees.",
                    "The Prismoid of Resources.",
                    "A Dynamic Algorithm for Reachability Games Played on Trees.",
                    "An Algebraic Characterization of Semirings for Which the Support of Every Recognizable Series Is Recognizable.",
                    "Graph Decomposition for Improving Memoryless Periodic Exploration.",
                    "On FO2 Quantifier Alternation over Words.",
                    "On the Recognizability of Self-generating Sets.",
                    "The Isomorphism Problem for k-Trees Is Complete for Logspace.",
                    "Snake-Deterministic Tiling Systems.",
                    "Query Automata for Nested Words.",
                    "A General Class of Models of H*.",
                    "The Complexity of Satisfiability for Fragments of Hybrid Logic-Part I.",
                    "Colouring Non-sparse Random Intersection Graphs.",
                    "On the Structure of Optimal Greedy Computation (for Job Scheduling).",
                    "A Probabilistic PTAS for Shortest Common Superstring.",
                    "The Cost of Stability in Network Flow Games.",
                    "(Un)Decidability of Injectivity and Surjectivity in One-Dimensional Sand Automata.",
                    "Quantum Algorithms to Solve the Hidden Shift Problem for Quadratics and for Functions of Large Gowers Norm.",
                    "From Parity and Payoff Games to Linear Programming.",
                    "Partial Randomness and Dimension of Recursively Enumerable Reals.",
                    "Partial Solution and Entropy.",
                    "On Pebble Automata for Data Languages with Decidable Emptiness Problem.",
                    "Size and Energy of Threshold Circuits Computing Mod Functions.",
                    "Points on Computable Curves of Computable Lengths.",
                    "The Expressive Power of Binary Submodular Functions."
                ]
            }
        ]
    },
    {
        "year": "2008",
        "name": "33rd MFCS 2008",
        "info": "Torun, Poland",
        "venues": [
            {
                "sub_name_abbr": "conf/mfcs/2008",
                "sub_name": "Mathematical Foundations of Computer Science 2008, 33rd International Symposium, MFCS 2008, Torun, Poland, August 25-29, 2008, Proceedings.",
                "count": 50,
                "papers": [
                    "One Useful Logic That Defines Its Own Truth.",
                    "On Synchronous and Asynchronous Interaction in Distributed Systems.",
                    "A Robust Class of Regular Languages.",
                    "Deterministic Models of Communication Faults.",
                    "Algebraic Graph Algorithms.",
                    "Question/Answer Games on Towers and Pyramids.",
                    "The Maximum Independent Set Problem in Planar Graphs.",
                    "When Ignorance Helps: Graphical Multicast Cost Sharing Games.",
                    "Shortest Synchronizing Strings for Huffman Codes.",
                    "Optimizing Conjunctive Queries over Trees Using Schema Information.",
                    "Clustering with Partial Information.",
                    "Reoptimization of the Metric Deadline TSP.",
                    "On the Shortest Linear Straight-Line Program for Computing Linear Forms.",
                    "Flip Algorithm for Segment Triangulations.",
                    "Computing Sharp 2-Factors in Claw-Free Graphs.",
                    "A 6/5-Approximation Algorithm for the Maximum 3-Cover Problem.",
                    "Positional Strategies for Higher-Order Pushdown Parity Games.",
                    "Arthur and Merlin as Oracles.",
                    "A Decision Problem for Ultimately Periodic Sets in Non-standard Numeration Systems.",
                    "Regional Languages and Tiling: A Unifying Approach to Picture Grammars.",
                    "On a Special Class of Primitive Words.",
                    "Complexity of Data Tree Patterns over XML Documents.",
                    "A PTAS for the Sparsest Spanners Problem on Apex-Minor-Free Graphs.",
                    "Computational Complexity of Perfect-Phylogeny-Related Haplotyping Problems.",
                    "Sincere-Strategy Preference-Based Approval Voting Broadly Resists Control.",
                    "Reversal-Bounded Counter Machines Revisited.",
                    "Iterative Compression and Exact Algorithms.",
                    "Complexity and Limiting Ratio of Boolean Functions over Implication.",
                    "Succinctness of Regular Expressions with Interleaving, Intersection and Counting.",
                    "Nilpotency and Limit Sets of Cellular Automata.",
                    "A Note on k-Colorability of P5-Free Graphs.",
                    "Combinatorial Bounds and Algorithmic Aspects of Image Matching under Projective Transformations.",
                    "Lower Bounds for Syntactically Multilinear Algebraic Branching Programs.",
                    "Periodicity and Immortality in Reversible Computing.",
                    "Step-Out Ring Signatures.",
                    "The Height of Factorization Forests.",
                    "Arithmetic Circuits, Syntactic Multilinearity, and the Limitations of Skew Formulae.",
                    "Smoothed Analysis of Binary Search Trees and Quicksort under Additive Noise.",
                    "From lambda-Calculus to Universal Algebra and Back.",
                    "A Complete Axiomatic System for a Process-Based Spatial Logic.",
                    "Voronoi Games on Cycle Graphs.",
                    "Colouring Random Empire Trees.",
                    "A Random Oracle Does Not Help Extract the Mutual Information.",
                    "Approximating Independent Set and Coloring in Random Uniform Hypergraphs.",
                    "A New Upper Bound for Max-2-SAT: A Graph-Theoretic Approach.",
                    "Directed Percolation Arising in Stochastic Cellular Automata Analysis.",
                    "Resolution Width and Cutting Plane Rank Are Incomparable.",
                    "On the Decidability of Bounded Valuedness for Transducers.",
                    "Monadic Second Order Logic on Graphs with Local Cardinality Constraints.",
                    "Short Proofs of Strong Normalization."
                ]
            }
        ]
    },
    {
        "year": "2007",
        "name": "32nd MFCS 2007",
        "info": "Ceský Krumlov, Czech Republic",
        "venues": [
            {
                "sub_name_abbr": "conf/mfcs/2007",
                "sub_name": "Mathematical Foundations of Computer Science 2007, 32nd International Symposium, MFCS 2007, Ceský Krumlov, Czech Republic, August 26-31, 2007, Proceedings.",
                "count": 66,
                "papers": [
                    "How To Be Fickle.",
                    "Finite Model Theory on Tame Classes of Structures.",
                    "Minimum Cycle Bases in Graphs Algorithms and Applications.",
                    "Hierarchies of Infinite Structures Generated by Pushdown Automata and Recursion Schemes.",
                    "Evolvability.",
                    "Expander Properties and the Cover Time of Random Intersection Graphs.",
                    "Uncover Low Degree Vertices and Minimise the Mess: Independent Sets in Random Regular Graphs.",
                    "Transition Graphs of Rewriting Systems over Unranked Trees.",
                    "Rewriting Conjunctive Queries Determined by Views.",
                    "Approximation Algorithms for the Maximum Internal Spanning Tree Problem.",
                    "New Approximability Results for 2-Dimensional Packing Problems.",
                    "On Approximation of Bookmark Assignments.",
                    "Height-Deterministic Pushdown Automata.",
                    "Minimizing Variants of Visibly Pushdown Automata.",
                    "Linear Circuits, Two-Variable Logic and Weakly Blocked Monoids.",
                    "Combinatorial Proof that Subprojective Constraint Satisfaction Problems are NP-Complete.",
                    "NP by Means of Lifts and Shadows.",
                    "The Complexity of Solitaire.",
                    "Adapting Parallel Algorithms to the W-Stream Model, with Applications to Graph Problems.",
                    "Space-Conscious Compression.",
                    "Small Alliances in Graphs.",
                    "The Maximum Solution Problem on Graphs.",
                    "What Are Iteration Theories?",
                    "Properties Complementary to Program Self-reference.",
                    "Dobrushin Conditions for Systematic Scan with Block Dynamics.",
                    "On the Complexity of Computing Treelength.",
                    "On Time Lookahead Algorithms for the Online Data Acknowledgement Problem.",
                    "Real Time Language Recognition on 2D Cellular Automata: Dealing with Non-convex Neighborhoods.",
                    "Towards a Rice Theorem on Traces of Cellular Automata.",
                    "Progresses in the Analysis of Stochastic 2D Cellular Automata: A Study of Asynchronous 2D Minority.",
                    "Public Key Identification Based on the Equivalence of Quadratic Forms.",
                    "Reachability Problems in Quaternion Matrix and Rotation Semigroups.",
                    "VPSPACE and a Transfer Theorem over the Complex Field.",
                    "Efficient Provably-Secure Hierarchical Key Assignment Schemes.",
                    "Nearly Private Information Retrieval.",
                    "Packing and Squeezing Subgraphs into Planar Graphs.",
                    "Dynamic Matchings in Convex Bipartite Graphs.",
                    "Communication in Networks with Random Dependent Faults.",
                    "Optimal Gossiping in Directed Geometric Radio Networks in Presence of Dynamical Faults.",
                    "A Linear Time Algorithm for the k Maximal Sums Problem.",
                    "A Lower Bound of 1+phi for Truthful Scheduling Mechanisms.",
                    "Analysis of Maximal Repetitions in Strings.",
                    "Series-Parallel Languages on Scattered and Countable Posets.",
                    "Traces of Term-Automatic Graphs.",
                    "State Complexity of Basic Operations on Suffix-Free Regular Languages.",
                    "Exact Algorithms for L (2, 1)-Labeling of Graphs.",
                    "On ( k , l)-Leaf Powers.",
                    "An Improved Claw Finding Algorithm Using Quantum Walk.",
                    "Complexity Upper Bounds for Classical Locally Random Reductions Using a Quantum Computational Argument.",
                    "On the Complexity of Game Isomorphism.",
                    "Hardness Results for Tournament Isomorphism and Automorphism.",
                    "Relating Complete and Partial Solution for Problems Similar to Graph Automorphism.",
                    "Well Supported Approximate Equilibria in Bimatrix Games: A Graph Theoretic Approach.",
                    "Selfish Load Balancing Under Partial Knowledge.",
                    "Extending the Notion of Rationality of Selfish Agents: Second Order Nash Equilibria.",
                    "Congestion Games with Player-Specific Constants.",
                    "Finding Patterns in Given Intervals.",
                    "The Power of Two Prices: Beyond Cross-Monotonicity.",
                    "Semisimple Algebras of Almost Minimal Rank over the Reals.",
                    "Structural Analysis of Gapped Motifs of a String.",
                    "Online and Offline Access to Short Lists.",
                    "Optimal Randomized Comparison Based Algorithms for Collision.",
                    "Randomized and Approximation Algorithms for Blue-Red Matching.",
                    "Real Computational Universality: The Word Problem for a Class of Groups with Infinite Presentation.",
                    "Finding Paths Between Graph Colourings: PSPACE-Completeness and Superpolynomial Distances.",
                    "Shuffle Expressions and Words with Nested Data."
                ]
            }
        ]
    },
    {
        "year": "2006",
        "name": "31st MFCS 2006",
        "info": "Stará Lesná, Slovakia",
        "venues": [
            {
                "sub_name_abbr": "conf/mfcs/2006",
                "sub_name": "Mathematical Foundations of Computer Science 2006, 31st International Symposium, MFCS 2006, Stará Lesná, Slovakia, August 28-September 1, 2006, Proceedings.",
                "count": 69,
                "papers": [
                    "A Core Calculus for Scala Type Checking.",
                    "Tree Exploration with an Oracle.",
                    "Distributed Data Structures: A Survey on Informative Labeling Schemes.",
                    "From Deduction Graphs to Proof Nets: Boxes and Sharing in the Graphical Presentation of Deductions.",
                    "The Structure of Tractable Constraint Satisfaction Problems.",
                    "On the Representation of Kleene Algebras with Tests.",
                    "From Three Ideas in TCS to Three Applications in Bioinformatics.",
                    "Decompositions, Partitions, and Coverings with Convex Polygons and Pseudo-triangles.",
                    "Approximate Shortest Path Queries on Weighted Polyhedral Surfaces.",
                    "A Unified Construction of the Glushkov, Follow, and Antimirov Automata.",
                    "Algebraic Characterizations of Unitary Linear Quantum Cellular Automata.",
                    "A Polynomial Time Nilpotence Test for Galois Groups and Related Results.",
                    "The Multiparty Communication Complexity of Exact-T: Improved Bounds and New Problems.",
                    "Crochemore Factorization of Sturmian and Other Infinite Words.",
                    "Equations on Partial Words.",
                    "Concrete Multiplicative Complexity of Symmetric Functions.",
                    "On the Complexity of Limit Sets of Cellular Automata Associated with Probability Measures.",
                    "Coloring Random 3-Colorable Graphs with Non-uniform Edge Probabilities.",
                    "The Kleene Equality for Graphs.",
                    "On the Repetition Threshold for Large Alphabets.",
                    "Improved Parameterized Upper Bounds for Vertex Cover.",
                    "On Comparing Sums of Square Roots of Small Integers.",
                    "A Combinatorial Approach to Collapsing Words.",
                    "Optimal Linear Arrangement of Interval Graphs.",
                    "The Lempel-Ziv Complexity of Fixed Points of Morphisms.",
                    "Partially Commutative Inverse Monoids.",
                    "Learning Bayesian Networks Does Not Have to Be NP-Hard.",
                    "Lower Bounds for the Transition Complexity of NFAs.",
                    "Smart Robot Teams Exploring Sparse Trees.",
                    "k-Sets of Convex Inclusion Chains of Planar Point Sets.",
                    "Toward the Eigenvalue Power Law.",
                    "Multicast Transmissions in Non-cooperative Networks with a Limited Number of Selfish Moves.",
                    "Very Sparse Leaf Languages.",
                    "On the Correlation Between Parity and Modular Polynomials.",
                    "Optimally Fast Data Gathering in Sensor Networks.",
                    "Magic Numbers in the State Hierarchy of Finite Automata.",
                    "Online Single Machine Batch Scheduling.",
                    "Machines that Can Output Empty Words.",
                    "Completeness of Global Evaluation Logic.",
                    "NOF-Multiparty Information Complexity Bounds for Pointer Jumping.",
                    "Dimension Characterizations of Complexity Classes.",
                    "Approximation Algorithms and Hardness Results for Labeled Connectivity Problems.",
                    "An Expressive Temporal Logic for Real Time.",
                    "On Matroid Representability and Minor Problems.",
                    "Non-cooperative Tree Creation.",
                    "Guarantees for the Success Frequency of an Algorithm for Finding Dodgson-Election Winners.",
                    "Reductions for Monotone Boolean Circuits.",
                    "Generalised Integer Programming Based on Logically Defined Relations.",
                    "Probabilistic Length-Reducing Automata.",
                    "Sorting Long Sequences in a Single Hop Radio Network.",
                    "Systems of Equations over Finite Semigroups and the #CSP Dichotomy Conjecture.",
                    "Valiant's Model: From Exponential Sums to Exponential Products.",
                    "A Reachability Algorithm for General Petri Nets Based on Transition Invariants.",
                    "Approximability of Bounded Occurrence Max Ones.",
                    "Fast Iterative Arrays with Restricted Inter-cell Communication: Constructions and Decidability.",
                    "Faster Algorithm for Bisimulation Equivalence of Normed Context-Free Processes.",
                    "Quantum Weakly Nondeterministic Communication Complexity.",
                    "Minimal Chordal Sense of Direction and Circulant Graphs.",
                    "Querying and Embedding Compressed Texts.",
                    "Lempel-Ziv Dimension for Lempel-Ziv Compression.",
                    "Characterizing Valiant's Algebraic Complexity Classes.",
                    "The Price of Defense.",
                    "The Data Complexity of MDatalog in Basic Modal Logics.",
                    "The Complexity of Counting Functions with Easy Decision Version.",
                    "On Non-Interactive Zero-Knowledge Proofs of Knowledge in the Shared Random String Model.",
                    "Constrained Minimum Enclosing Circle with Center on a Query Line Segment.",
                    "Hierarchical Unambiguity.",
                    "An Efficient Algorithm Finds Noticeable Trends and Examples Concerning the Cerny Conjecture.",
                    "On Genome Evolution with Innovation."
                ]
            }
        ]
    },
    {
        "year": "2005",
        "name": "30th MFCS 2005",
        "info": "Gdansk, Poland",
        "venues": [
            {
                "sub_name_abbr": "conf/mfcs/2005",
                "sub_name": "Mathematical Foundations of Computer Science 2005, 30th International Symposium, MFCS 2005, Gdansk, Poland, August 29 - September 2, 2005, Proceedings.",
                "count": 69,
                "papers": [
                    "Page Migration in Dynamic Networks.",
                    "Knot Theory, Jones Polynomial and Quantum Computing.",
                    "Interactive Algorithms 2005.",
                    "Some Computational Issues in Membrane Computing.",
                    "The Generalization of Dirac's Theorem for Hypergraphs.",
                    "On the Communication Complexity of Co-linearity Problems.",
                    "An Invitation to Play.",
                    "The Complexity of Satisfiability Problems: Refining Schaefer's Theorem.",
                    "On the Number of Random Digits Required in MonteCarlo Integration of Definable Functions.",
                    "Pure Nash Equilibria in Games with a Large Number of Actions.",
                    "On the Complexity of Depth-2 Circuits with Threshold Gates.",
                    "Isomorphic Implication.",
                    "Abstract Numeration Systems and Tilings.",
                    "Adversarial Queueing Model for Continuous Network Dynamics.",
                    "Coloring Sparse Random k-Colorable Graphs in Polynomial Expected Time.",
                    "Regular Sets of Higher-Order Pushdown Stacks.",
                    "Linearly Bounded Infinite Graphs.",
                    "Basic Properties for Sand Automata.",
                    "A Bridge Between the Asynchronous Message Passing Model and Local Computations in Graphs.",
                    "Reconstructing an Ultrametric Galled Phylogenetic Network from a Distance Matrix.",
                    "New Resource Augmentation Analysis of the Total Stretch of SRPT and SJF in Multiprocessor Scheduling.",
                    "Approximating Polygonal Objects by Deformable Smooth Surfaces.",
                    "Basis of Solutions for a System of Linear Inequalities in Integers: Computation and Applications.",
                    "Asynchronous Deterministic Rendezvous in Graphs.",
                    "Zeta-Dimension.",
                    "Online Interval Coloring with Packing Constraints.",
                    "Separating the Notions of Self- and Autoreducibility.",
                    "Fully Asynchronous Behavior of Double-Quiescent Elementary Cellular Automata.",
                    "Finding Exact and Maximum Occurrences of Protein Complexes in Protein-Protein Interaction Graphs.",
                    "Matrix and Graph Orders Derived from Locally Constrained Graph Homomorphisms.",
                    "Packing Weighted Rectangles into a Square.",
                    "Nondeterministic Graph Searching: From Pathwidth to Treewidth.",
                    "Goals in the Propositional Horn Language Are Monotone Boolean Circuits.",
                    "Autoreducibility, Mitoticity, and Immunity.",
                    "Canonical Disjoint NP-Pairs of Propositional Proof Systems.",
                    "Complexity of DNF and Isomorphism of Monotone Formulas.",
                    "The Expressive Power of Two-Variable Least Fixed-Point Logics.",
                    "Languages Representable by Vertex-Labeled Graphs.",
                    "On the Complexity of Mixed Discriminants and Related Problems.",
                    "Two Logical Hierarchies of Optimization Problems over the Real Numbers.",
                    "Algebras as Knowledge Structures.",
                    "Combining Self-reducibility and Partial Information Algorithms.",
                    "Complexity Bounds for Regular Games.",
                    "Basic Mereology with Equivalence Relations.",
                    "Online and Dynamic Recognition of Squarefree Strings.",
                    "Shrinking Restarting Automata.",
                    "Removing Bidirectionality from Nondeterministic Finite Automata.",
                    "Generating All Minimal Integral Solutions to Monotone and, or-Systems of Linear, Transversal and Polymatroid Inequalities.",
                    "On the Parameterized Complexity of Exact Satisfiability Problems.",
                    "Approximating Reversal Distance for Strings with Bounded Number of Duplicates.",
                    "Random Databases and Threshold for Monotone Non-recursive Datalog.",
                    "An Asymptotically Optimal Linear-Time Algorithm for Locally Consistent Constraint Satisfaction Problems.",
                    "Greedy Approximation via Duality for Packing, Combinatorial Auctions and Routing.",
                    "Tight Approximability Results for the Maximum Solution Equation Problem over Zp.",
                    "The Complexity of Model Checking Higher Order Fixpoint Logic.",
                    "An Efficient Algorithm for Computing Optimal Discrete Voltage Schedules.",
                    "Inverse Monoids: Decidability and Complexity of Algebraic Questions.",
                    "Dimension Is Compression.",
                    "Concurrent Automata vs. Asynchronous Systems.",
                    "Completeness and Degeneracy in Information Dynamics of Cellular Automata.",
                    "Strict Language Inequalities and Their Decision Problems.",
                    "Event Structures for the Collective Tokens Philosophy of Inhibitor Nets.",
                    "An Exact 2.9416n Algorithm for the Three Domatic Number Problem.",
                    "D-Width: A More Natural Measure for Directed Tree Width.",
                    "On Beta-Shifts Having Arithmetical Languages.",
                    "A BDD-Representation for the Logic of Equality and Uninterpreted Functions.",
                    "On Small Hard Leaf Languages.",
                    "Explicit Inapproximability Bounds for the Shortest Superstring Problem.",
                    "Stratified Boolean Grammars."
                ]
            }
        ]
    },
    {
        "year": "2004",
        "name": "29th MFCS 2004",
        "info": "Prague, Czech Republic",
        "venues": [
            {
                "sub_name_abbr": "conf/mfcs/2004",
                "sub_name": "Mathematical Foundations of Computer Science 2004, 29th International Symposium, MFCS 2004, Prague, Czech Republic, August 22-27, 2004, Proceedings.",
                "count": 70,
                "papers": [
                    "A Case Study of Genome Evolution: From Continuous to Discrete Time Model.",
                    "Multicoloring: Problems and Techniques.",
                    "Some Recent Progress in Algorithmic Randomness.",
                    "Ubiquitous Parameterization - Invitation to Fixed-Parameter Algorithms.",
                    "PRAM-On-Chip: A Quest for Not-So-Obvious Non-obviousness.",
                    "Theory and Applied Computing: Observations and Anecdotes.",
                    "Boxed Ambients with Communication Interfaces.",
                    "Algebraic Recognizability of Languages.",
                    "Geometric Optimization and Unique Sink Orientations of Cubes p.",
                    "Congestion Games and Coordination Mechanisms.",
                    "Equitable Colorings of Bounded Treewidth Graphs.",
                    "The Bidimensional Theory of Bounded-Genus Graphs.",
                    "Parallel Knock-Out Schemes in Networks.",
                    "Online Algorithms for Disk Graphs.",
                    "Protein Folding in the HP Model on Grid Lattices with Diagonals (Extended Abstract).",
                    "Optimization, Games, and Quantified Constraint Satisfaction.",
                    "Approximating Boolean Functions by OBDDs.",
                    "On Approximation Hardness of the Minimum 2SAT-DELETION Problem.",
                    "Group Coloring and List Group Coloring Are Pi2P-Complete (Extended Abstract).",
                    "Complexity Results in Graph Reconstruction.",
                    "Generating Paths and Cuts in Multi-pole (Di)graphs.",
                    "Packing Directed Cycles Efficiently.",
                    "The Complexity of Membership Problems for Circuits over Sets of Integers.",
                    "Some Meet-in-the-Middle Circuit Lower Bounds.",
                    "The Enumerability of P Collapses P to NC.",
                    "On NC1 Boolean Circuit Composition of Non-interactive Perfect Zero-Knowledge.",
                    "All Superlinear Inverse Schemes Are coNP-Hard.",
                    "The Complexity of Equivalence and Isomorphism of Systems of Equations over Finite Groups.",
                    "Generation Problems.",
                    "One Query Reducibilities Between Partial Information Classes.",
                    "A New Dimension Sensitive Property for Cellular Automata.",
                    "Captive Cellular Automata.",
                    "Simulating 3D Cellular Automata with 2D Cellular Automata.",
                    "Graph Exploration by a Finite Automaton.",
                    "On Polynomially Time Bounded Symmetry of Information.",
                    "Scaled Dimension and the Kolmogorov Complexity of Turing-Hard Sets.",
                    "A Geometric Approach to Parameterized Algorithms for Domination Problems on Planar Graphs.",
                    "Polynomial Time Approximation Schemes and Parameterized Complexity.",
                    "Epistemic Foundation of the Well-Founded Semantics over Bilattices.",
                    "Structural Model Checking for Communicating Hierarchical Machines.",
                    "Compositional Verification: Decidability Issues Using Graph Substitutions.",
                    "Event Structures for Resolvable Conflict.",
                    "Optimal Preemptive Scheduling for General Target Functions.",
                    "The Price of Anarchy for Polynomial Social Cost.",
                    "Agent-Based Information Handling in Large Networks.",
                    "Approximating Earliest Arrival Flows with Flow-Dependent Transit Times.",
                    "A Hierarchy of Irreducible Sofic Shifts.",
                    "Membership and Reachability Problems for Row-Monomial Transformations.",
                    "On Pseudovarieties of Semiring Homomorphisms.",
                    "An Algebraic Generalization of omega-Regular Languages.",
                    "A Protocol for Serializing Unique Strategies.",
                    "A Combinatorial Strongly Subexponential Strategy Improvement Algorithm for Mean Payoff Games.",
                    "When Can You Play Positionally?",
                    "The Dual of Concatenation.",
                    "Computational Aspects of Disjunctive Sequences.",
                    "Decidability of Trajectory-Based Equations.",
                    "Efficient View Point Selection for Silhouettes of Convex Polyhedra.",
                    "Angles and Lengths in Reconfigurations of Polygons and Polyhedra.",
                    "Improved Bounds and Schemes for the Declustering Problem.",
                    "Crossing Number Is Hard for Cubic Graphs.",
                    "A Reducibility for the Dot-Depth Hierarchy.",
                    "Sublogarithmic Ambiguity.",
                    "An Elementary Proof for the Non-parametrizability of the Equation xyz=zvx.",
                    "A Generalization of Repetition Threshold.",
                    "An Algorithmic Argument for Nonadaptive Query Complexity Lower Bounds on Advised Quantum Computation (Extended Abstract).",
                    "Universal Test for Quantum One-Way Permutations.",
                    "A Common Algebraic Description for Probabilistic and Quantum Computations (Extended Abstract).",
                    "Extraction and Implication of Path Constraints.",
                    "Schema Evolution for XML: A Consistency-Preserving Approach.",
                    "Complexity of Decision Problems for Simple Regular Expressions."
                ]
            }
        ]
    },
    {
        "year": "2003",
        "name": "28th MFCS 2003",
        "info": "Bratislava, Slovak Republic",
        "venues": [
            {
                "sub_name_abbr": "conf/mfcs/2003",
                "sub_name": "Mathematical Foundations of Computer Science 2003, 28th International Symposium, MFCS 2003, Bratislava, Slovakia, August 25-29, 2003, Proceedings.",
                "count": 62,
                "papers": [
                    "Distributed Quantum Computing.",
                    "Selfish Routing in Non-cooperative Networks: A Survey.",
                    "Process Algebraic Frameworks for the Specification and Analysis of Cryptographic Protocols.",
                    "Semantic and Syntactic Approaches to Simulation Relations.",
                    "On the Computational Complexity of Conservative Computing.",
                    "Constructing Infinite Graphs with a Decidable MSO-Theory.",
                    "Towards a Theory of Randomized Search Heuristics.",
                    "Adversarial Models for Priority-Based Networks.",
                    "On Optimal Merging Networks.",
                    "Problems with Cannot Be Reduced to Any Proper Subproblems.",
                    "ACID-Unification Is NEXPTIME-Decidable.",
                    "Completeness in Differential Approximation Classes.",
                    "On the Length of the Minimum Solution of Word Equations in One Variable.",
                    "Smoothed Analysis of Three Combinatorial Problems.",
                    "Inferring Strings from Graphs and Arrays.",
                    "Faster Algorithms for k-Medians in Trees.",
                    "Periodicity and Transitivity for Cellular Automata in Besicovitch Topologies.",
                    "Starting with Nondeterminism: The Systematic Derivation of Linear-Time Graph Layout Algorithms.",
                    "Error-Bounded Probabilistic Computations between MA and AM.",
                    "A Faster FPT Algorithm for Finding Spanning Trees with Many Leaves.",
                    "Symbolic Analysis of Crypto-Protocols Based on Modular Exponentiation.",
                    "Denotational Testing Semantics in Coinductive Form.",
                    "Lower Bounds for General Graph-Driven Read-Once Parity Branching Programs.",
                    "The Minimal Graph Model of Lambda Calculus.",
                    "Unambiguous Automata on Bi-infinite Words.",
                    "Relating Hierarchy of Temporal Properties to Model Checking.",
                    "Arithmetic Constant-Depth Circuit Complexity Classes.",
                    "Inverse NP Problems.",
                    "A Linear-Time Algorithm for 7-Coloring 1-Planar Graphs.",
                    "Generalized Satisfability with Limited Occurrences per Variable: A Study through Delta-Matroid Parity.",
                    "Randomized Algorithms for Determining the Majority on Graphs.",
                    "Using Transitive-Closure Logic for Deciding Linear Properties of Monoids.",
                    "Linear-Time Computation of Local Periods.",
                    "Two Dimensional Packing: The Power of Rotation.",
                    "Approximation Schemes for the Min-Max Starting Time Problem.",
                    "Quantum Testers for Hidden Group Properties.",
                    "Local LTL with Past Constants Is Expressively Complete for Mazurkiewicz Traces.",
                    "LTL with Past and Two-Way Very-Weak Alternating Automata.",
                    "Match-Bounded String Rewriting Systems.",
                    "Probabilistic and Nondeterministic Unary Automata.",
                    "On Matroid Properties Definable in the MSO Logic.",
                    "Characterizations of Catalytic Membrane Computing Systems.",
                    "Augmenting Local Edge-Conncectivity between Vertices and Vertex Subsets in Undirected Graphs.",
                    "Scheduling and Traffic Allocation for Tasks with Bounded Splittability.",
                    "Computing Average Value in Ad Hoc Networks.",
                    "A Polynomial-Time Algorithm for Deciding True Concurrency Equivalences of Basic Parallel Processes.",
                    "Solving the Sabotage Game Is PSPACE-Hard.",
                    "The Approximate Well-Founded Semantics for Logic Programs with Uncertainty.",
                    "Which Is the Worst-Case Nash Equilibrium?",
                    "A Unique Decomposition Theorem for Ordered Monoids with Applications in Process Theory.",
                    "Generic Algorithms for the Generation of Combinatorial Objects.",
                    "On the Complexity of Some Problems in Interval Arithmetic.",
                    "An Abduction-Based Method for Index Relaxation in Taxonomy-Based Sources.",
                    "On Selection Functions that Do Not Preserve Normality.",
                    "On Converting CNF to DNF.",
                    "A Basis of Tiling Motifs for Generating Repeated Patterns and Its Complexity for Higher Quorum.",
                    "On the Complexity of Some Equivalence Problems for Propositional Calculi.",
                    "Quantified Mu-Calculus for Control Synthesis.",
                    "On Probabilistic Quantified Satisfability Games.",
                    "A Completeness Property of Wilke's Tree Algebras.",
                    "Symbolic Topological Sorting with OBDDS.",
                    "Ershov's Hierarchy of Real Numbers."
                ]
            }
        ]
    },
    {
        "year": "2002",
        "name": "27th MFCS 2002",
        "info": "Warsaw, Poland",
        "venues": [
            {
                "sub_name_abbr": "conf/mfcs/2002",
                "sub_name": "Mathematical Foundations of Computer Science 2002, 27th International Symposium, MFCS 2002, Warsaw, Poland, August 26-30, 2002, Proceedings.",
                "count": 53,
                "papers": [
                    "Global Development via Local Observational Construction Steps.",
                    "Edge-Colouring Pairs of Binary Trees: Towards a Concise Proof of the Four-Colour Theorem of Planar Maps.",
                    "Applications of Finite Automata.",
                    "Approximability of the Minimum Bisection Problem: An Algorithmic Challenge.",
                    "Low Stretch Spanning Trees.",
                    "On Radiocoloring Hierarchically Specified Planar Graphs: PSPACE-Completeness and Approximations.",
                    "Finite Domain Constraint Satisfaction Using Quantum Computation.",
                    "Fast Algorithms with Algebraic Monge Properties.",
                    "Packing Edges in Random Regular Graphs.",
                    "A Lower Bound Technique for Nondeterministic Graph-Driven Read-Once-Branching Programs and Its Applications.",
                    "Matroid Intersections, Polymatroid Inequalities, and Related Problems.",
                    "Accessibility in Automata on Scattered Linear Orderings.",
                    "On Infinite Terms Having a Decidable Monadic Theory.",
                    "A Chomsky-Like Hierarchy of Infinite Graphs.",
                    "Competitive Analysis of On-line Stream Merging Algorithms.",
                    "Coloring k-Colorable Semirandom Graphs in Polynomial Expected Time via Semidefinite Programming.",
                    "On Word Equations in One Variable.",
                    "Autoreducibility of Random Sets: A Sharp Bound on the Density of Guessed Bits.",
                    "Two-Way Finite State Transducers with Nested Pebbles.",
                    "Optimal Non-preemptive Semi-online Scheduling on Two Related Machines.",
                    "More on Weighted Servers or FIFO is Better than LRU.",
                    "On Maximizing the Throughput of Multiprocessor Tasks.",
                    "Some Results on Random Unsatisfiable k-Sat Instances and Approximation Algorithms Applied to Random Structures.",
                    "Evolutive Tandem Repeats Using Hamming Distance.",
                    "Subgraph Isomorphism, log-Bounded Fragmentation and Graphs of (Locally) Bounded Treewidth.",
                    "Computing Partial Information out of Intractable One - The First Digit of 2 n  at Base 3 as an Example.",
                    "Algorithms for Computing Small NFAs.",
                    "Space-Economical Construction of Index Structures for All Suffixes of a String.",
                    "An Explicit Lower Bound of 5n - o(n) for Boolean Circuits.",
                    "Computational Complexity in the Hyperbolic Plane.",
                    "On a Mereological System for Relational Software Specifications.",
                    "An Optimal Lower Bound for Resolution with 2-Conjunctions.",
                    "Improved Parameterized Algorithms for Planar Dominating Set.",
                    "Optimal Free Binary Decision Diagrams for Computation of EARn.",
                    "Unification Modulo Associativity and Idempotency Is NP-complete.",
                    "On the Complexity of Semantic Equivalences for Pushdown Automata and BPA.",
                    "An Improved Algorithm for the Membership Problem for Extended Regular Expressions.",
                    "Efficient Algorithms for Locating the Length-Constrained Heaviest Segments, with Applications to Biomolecular Sequence Analysis.",
                    "Derivation of Rational Expressions with Multiplicity.",
                    "Hypothesis-Founded Semantics for Datalog Programs with Negation.",
                    "On the Problem of Scheduling Flows on Distributed Networks.",
                    "Unit Testing for CASL Architectural Specifications.",
                    "Symbolic Semantics and Analysis for Crypto-CCS with (Almost) Generic Inference Systems.",
                    "The Complexity of Tree Multicolorings.",
                    "On Verifying Fair Lossy Channel Systems.",
                    "Parameterized Counting Problems.",
                    "On the Construction of Effective Random Sets.",
                    "On the Structure of the Simulation Order of Proof Systems.",
                    "Comorphism-Based Grothendieck Logics.",
                    "Finite Test-Sets for Overlap-Free Morphisms.",
                    "Characterizing Simpler Recognizable Sets of Integers.",
                    "Towards a Cardinality Theorem for Finite Automata.",
                    "An Approximation Semantics for the Propositional Mu-Calculus."
                ]
            }
        ]
    },
    {
        "year": "2001",
        "name": "26th MFCS 2001",
        "info": "Marianske Lazne, Czech Republic",
        "venues": [
            {
                "sub_name_abbr": "conf/mfcs/2001",
                "sub_name": "Mathematical Foundations of Computer Science 2001, 26th International Symposium, MFCS 2001 Marianske Lazne, Czech Republic, August 27-31, 2001, Proceedings.",
                "count": 61,
                "papers": [
                    "A New Category for Semantics.",
                    "On Implications between P-NP-Hypotheses: Decision versus Computation in Algebraic Complexity.",
                    "Playing Games with Algorithms: Algorithmic Combinatorial Game Theory.",
                    "Some Recent Results on Data Mining and Search.",
                    "Hypertree Decompositions: A Survey.",
                    "The Strength of Non-size-increasing Computation (Introduction and Summary).",
                    "Introduction to Recent Quantum Algorithms.",
                    "Decomposition Methods and Sampling Circuits in the Cartesian Lattice.",
                    "New Algorithms for k -SAT Based on the Local Search Principle.",
                    "Linear Temporal Logic and Finite Semigroups.",
                    "Refined Search Tree Technique for DOMINATING SET on Planar Graphs.",
                    "The Computational Power of a Family of Decision Forests.",
                    "Exact Results for Accepting Probabilities of Quantum Automata.",
                    "Improved Bounds on the Weak Pigeonhole Principle and Infinitely Many Primes from Weaker Axioms.",
                    "Analysis Problems for Sequential Dynamical Systems and Communicating State Machines.",
                    "The Complexity of Tensor Circuit Evaluation.",
                    "Computing Reciprocals of Bivariate Power Series.",
                    "Automatic Verification of Recursive Procedures with One Integer Parameter.",
                    "Graph-Driven Free Parity BDDs: Algorithms and Lower Bounds.",
                    "Computable Versions of Baire's Category Theorem.",
                    "Automata on Linear Orderings.",
                    "Algorithmic Information Theory and Cellular Automata Dynamics.",
                    "The k-Median Problem for Directed Trees.",
                    "On Pseudorandom Generators in NC.",
                    "There Are No Sparse NPW-Hard Sets.",
                    "Sharing One Secret vs. Sharing Many Secrets: Tight Bounds for the Max Improvement Ratio.",
                    "(H, C, K)-Coloring: Fast, Easy, and Hard Cases.",
                    "Randomness and Reducibility.",
                    "On the Computational Complexity of Infinite Words.",
                    "Lower Bounds for On-Line Single-Machine Scheduling.",
                    "Approximation Algorithms and Complexity Results for Path Problems in Trees of Rings.",
                    "A 3-Approximation Algorithm for Movement Minimization in Conveyor Flow Shop Processing.",
                    "Quantifier Rank for Parity of Embedded Finite Models.",
                    "Space Hierarchy Theorem Revised.",
                    "Converting Two-Way Nondeterministic Unary Automata into Simpler Automata.",
                    "The Complexity of the Minimal Polynomial.",
                    "Note on Minimal Finite Automata.",
                    "Synchronizing Finite Automata on Eulerian Digraphs.",
                    "A Time Hierarchy for Bounded One-Way Cellular Automata.",
                    "Checking Amalgamability Conditions for C ASL Architectural Specifications.",
                    "On-Line Scheduling with Tight Deadlines.",
                    "Complexity Note on Mixed Hypergraphs.",
                    "News from the Online Traveling Repairman.",
                    "Word Problems for 2-Homogeneous Monoids and Symmetric Logspace.",
                    "Variations on a Theorem of Fine & Wilf.",
                    "Upper Bounds on the Bisection Width of 3- and 4-Regular Graphs.",
                    "Satisfiability of Systems of Equations over Finite Monoids.",
                    "Rational Graphs Trace Context-Sensitive Languages.",
                    "Towards Regular Languages over Infinite Alphabets.",
                    "Partial Information and Special Case Algorithms.",
                    "The Complexity of Computing the Number of Self-Avoiding Walks in Two-Dimensional Grid Graphs and in Hypercube Graphs.",
                    "From Bidirectionality to Alternation.",
                    "Syntactic Semiring of a Language.",
                    "On Reducibility and Symmetry of Disjoint NP-Pairs.",
                    "Hierarchy of Monotonically Computable Real Numbers.",
                    "On the Equational Definition of the Least Prefixed Point.",
                    "On the Periods of Partial Words.",
                    "The Size of Power Automata.",
                    "On the Approximability of the Steiner Tree Problem.",
                    "Alignment between Two RNA Structures.",
                    "Characterization of Context-Free Languages with Polynomially Bounded Ambiguity."
                ]
            }
        ]
    },
    {
        "year": "2000",
        "name": "25th MFCS 2000",
        "info": "Bratislava, Slovakia",
        "venues": [
            {
                "sub_name_abbr": "conf/mfcs/2000",
                "sub_name": "Mathematical Foundations of Computer Science 2000, 25th International Symposium, MFCS 2000, Bratislava, Slovakia, August 28 - September 1, 2000, Proceedings.",
                "count": 65,
                "papers": [
                    "Region Analysis and a pi-Calculus wiht Groups.",
                    "Abstract Data Types in Computer Algebra.",
                    "What Do We Learn from Experimental Algorithmics?",
                    "And/Or Hierarchies and Round Abstraction.",
                    "Computational Politics: Electoral Systems.",
                    "0-1 Laws for Fragments of Existential Second-Order Logic: A Survey.",
                    "On Algorithms and Interaction.",
                    "On the Use of Duality and Geometry in Layouts for ATM Networks.",
                    "On the Lower Bounds for One-Way Quantum Automata.",
                    "Axiomatizing Fully Complete Models for ML Polymorphic Types.",
                    "Measure Theoretic Completeness Notions for the Exponential Time Classes.",
                    "Edge-Bisection of Chordal Rings.",
                    "Equation Satisfiability and Program Satisfiability for Finite Monoids.",
                    "XML Grammars.",
                    "Simplifying Flow Networks.",
                    "Balanced k-Colorings.",
                    "A Compositional Model for Confluent Dynamic Data-Flow Networks.",
                    "Restricted Nondeterministic Read-Once Branching Programs and an Exponential Lower Bound for Integer Multiplication.",
                    "Expressiveness of Updatable Timed Automata.",
                    "Iterative Arrays with Small Time Bounds.",
                    "Embedding Fibonacci Cubes into Hypercubes with Omega(2cn) Faulty Nodes.",
                    "Periodic-Like Words.",
                    "The Monadic Theory of Morphic Infinite Words and Generalizations.",
                    "Optical Routing of Uniform Instances in Tori.",
                    "Factorizing Codes and Schützenberger Conjectures.",
                    "Compositional Characterizations of lambda-Terms Using Intersection Types.",
                    "Time and Message Optimal Leader Election in Asynchronous Oriented Complete Networks.",
                    "Subtractive Reductions and Complete Problems for Counting Complexity Classes.",
                    "On the Autoreducibility of Random Sequences.",
                    "Iteration Theories of Boolean Functions.",
                    "An Algorithm Constructing the Semilinear Post* for 2-Dim Reset/Transfer VASS.",
                    "NP-Completeness Results and Efficient Approximations for Radiocoloring in Planar Graphs.",
                    "Explicit Fusions.",
                    "State Space Reduction Using Partial tau-Confluence.",
                    "Reducing the Number of Solutions of NP Functions.",
                    "Regular Collections of Message Sequence Charts.",
                    "Alternating and Empty Alternating Auxiliary Stack Automata.",
                    "Conter Machines: Decidable Properties and Applications to Verification Problems.",
                    "A Family of NFA's Which Need 2n -alpha Deterministic States.",
                    "Preemptive Scheduling on Dedicated Processors: Applications of Fractional Graph Coloring.",
                    "Matching Modulo Associativity and Idempotency Is NP-Complete.",
                    "On NP-Partitions over Posets with an Application to Reducing the Set of Solutions of NP Problems.",
                    "Algebraic and Uniqueness Properties of Parity Ordered Binary Decision Diagrams and Their Generalization.",
                    "Formal Series over Algebras.",
                    "µ-Calculus Synthesis.",
                    "The Infinite Versions of LOGSPACE != P Are Consistent with the Axioms of Set Theory.",
                    "Timed Automata with Monotonic Activities.",
                    "On a Generalization of Bi-Complement Reducible Graphs.",
                    "Automatic Graphs and Graph D0L-Systems.",
                    "Bilinear Functions and Trees over the (max, +) Semiring.",
                    "Derivability in Locally Quantified Modal Logics via Translation in Set Theory.",
                    "pi-Calculus, Structured Coalgebras, and Minimal HD-Automata.",
                    "Informative Labeling Schemes for Graphs.",
                    "Separation Results for Rebound Automata.",
                    "Unary Pushdown Automata and Auxiliary Space Lower Bounds.",
                    "Binary Decision Diagrams by Shard Rewriting.",
                    "Verifying Single and Multi-mutator Garbage Collectors with Owicki-Gries in Isabelle/HOL.",
                    "Why so Many Temporal Logics Climb up the Trees?",
                    "Optimal Satisfiability for Propositional Calculi and Constraint Satisfaction Problems.",
                    "A Hierarchy Result for Read-Once Branching Programs with Restricted Parity Nondeterminism.",
                    "On Diving in Trees.",
                    "Abstract Syntax and Variable Binding for Linear Binders.",
                    "Regularity of Congruential Graphs.",
                    "Sublinear Ambiguity.",
                    "An Automata-Based Recognition Algorithm for Semi-extended Regular Expressions."
                ]
            }
        ]
    },
    {
        "year": "1999",
        "name": "24th MFCS 1999",
        "info": "Szklarska Poreba, Poland",
        "venues": [
            {
                "sub_name_abbr": "conf/mfcs/1999",
                "sub_name": "Mathematical Foundations of Computer Science 1999, 24th International Symposium, MFCS'99, Szklarska Poreba, Poland, September 6-10, 1999, Proceedings.",
                "count": 41,
                "papers": [
                    "On-Line Addition in Real Base.",
                    "Query Languages for Real Number Databases Based on Descriptive Complexity over R.",
                    "The Arithmetical Hierarchy of Real Numbers.",
                    "Invited Lecture: The Burrows-Wheeler Transform: Theory and Practice.",
                    "Efficiency of Fast Parallel Pattern Searching in Highly Compressed Texts.",
                    "Computing and Comparing Semantics of Programs in Four-Valued Logics.",
                    "Foundations of Modular SOS.",
                    "Message Sequence Graphs and Decision Problems on Mazurkiewicz Traces.",
                    "On the Complexity of Recognizing the Hilbert Basis of a Linear Diophantine System.",
                    "The Complexity of the Extended GCD Problem.",
                    "Complexity Results for Confluence Problems.",
                    "Is Your Model Checker on Time? On the Complexity of Model Checking for Timed Modal Logics.",
                    "Clausal Resolution for CTL*.",
                    "Model Checking and Higher-Order Recursion.",
                    "Multiparty Communication Complexity: Very Hard Functions.",
                    "New Perspectives in Distributed Computing.",
                    "An Improved Disjunctive Strictness Analysis for Lazy Functional Languages.",
                    "Unique Fixed Point Induction for McCarthy's Amb.",
                    "On Some Topological Properties of Linear Cellular Automata.",
                    "Real-Time Language Recognition by One-Way and Two-Way Cellular Automata.",
                    "Average State Complexity of Operations on Unary Automata.",
                    "Fooling Rebound Automata.",
                    "The Complexity of Minimizing FBDDs.",
                    "Efficient Strongly Universal and Optimally Universal Hashing.",
                    "Lower and Upper Bounds for the Problem of Page Replication in Ring Networks.",
                    "Language-Based Security.",
                    "An Algebraic Approach to Knowledge Representation.",
                    "On the Structure of the Monadic Logic of the Binary Tree.",
                    "A New Space Bound for the Modal Logics K4, KD4 and S4.",
                    "On Approximating the Number of Bases of Exchange Preserving Matroids.",
                    "The Semantic Foundations of a Compositional Proof Method for Synchronously Communicating Processes.",
                    "On Plain and Hereditary History-Preserving Bisimulation.",
                    "Approximating Weak Bisimulation on Basic Process Algebras.",
                    "Edge Coloring of Bipartite Graphs with Constraints.",
                    "An Efficient Exact Algorithm for Constraint Bipartite Vertex Cover.",
                    "On Minimum Edge Ranking Spanning Trees.",
                    "Football Elimination Is Hard to Decide Under the 3-Point-Rule.",
                    "Generalized Regular Counting Classes.",
                    "A Foundation of Programming a Multi-tape Quantum Turing Machine.",
                    "A Type Discipline for Solving Year 2000 Problems in COBOL Programs.",
                    "Type Reconstruction for Functional Programs with Subtyping over a Lattice of Atomic Types."
                ]
            }
        ]
    },
    {
        "year": "1998",
        "name": "23rd MFCS 1998",
        "info": "Brno, Czech Republic",
        "venues": [
            {
                "sub_name_abbr": "conf/mfcs/1998",
                "sub_name": "Mathematical Foundations of Computer Science 1998, 23rd International Symposium, MFCS'98, Brno, Czech Republic, August 24-28, 1998, Proceedings.",
                "count": 82,
                "papers": [
                    "Hypergraph Traversal Revisited: Cost Measures and Dynamic Algorithms.",
                    "Defining the Java Virtual Machine as Platform for Provably Correct Java Compilation.",
                    "Towards a Theory of Recursive Structures.",
                    "Modularization and Abstraction: The Keys to Practical Formal Verification.",
                    "On the Role of Time and Space in Neural Computation.",
                    "From Algorithms to Working Programs: On the Use of Program Checking in LEDA.",
                    "Computationally-Sound Checkers.",
                    "Reasoning About the Past.",
                    "Satisfiability - Algorithms and Logic.",
                    "The Joys of Bisimulation.",
                    "Towards Algorithmic Explanation of Mind Evolution and Functioning.",
                    "Combinatorial Hardness Proofs for Polynomial Evaluation.",
                    "Minimum Propositional Proof Length is NP-Hard to Linearly Approximate.",
                    "Reconstructing Polyatomic Structures from Discrete X-Rays: NP-Completeness Proof for Three Atoms.",
                    "Locally Explicit Construction of Rödl's Asymptotically Good Packings.",
                    "Proof Theory of Fuzzy Logics: Urquhart's C and Related Logics.",
                    "Nonstochastic Languages as Projections of 2-Tape Quasideterministic Languages.",
                    "Flow Logic for Imperative Objects.",
                    "Expressive Completeness of Temporal Logic of Action.",
                    "Reducing AC-Termination to Termination.",
                    "On One-Pass Term Rewriting.",
                    "On the Word, Subsumption, and Complement Problem for Recurrent Term Schematizations.",
                    "Encoding the Hydra Battle as a Rewrite System.",
                    "Computing epsilon-Free NFA from Regular Expressions in O(n log²(n)) Time.",
                    "Iterated Length-Preserving Rational Transductions.",
                    "The Head Hierarchy for Oblivious Finite Automata with Polynomial Advice Collapses.",
                    "The Equivalence Problem for Deterministic Pushdown Transducers into Abelian Groups.",
                    "The Semi-Full Closure of Pure Type Systems.",
                    "Predicative Polymorphic Subtyping.",
                    "A Computational Interpretation of the lambda-µ-Calculus.",
                    "Polymorphic Subtyping Without Distributivity.",
                    "A (Non-elementary) Modular Decision Procedure for LTrL.",
                    "Complete Abstract Interpretations Made Constructive.",
                    "Timed Bisimulation and Open Maps.",
                    "Deadlocking States in Context-Free Process Algebra.",
                    "A Superpolynomial Lower Bound for a Circuit Computing the Clique Function with At Most (1/6) log log n Negation Gates.",
                    "On Counting AC0 Circuits with Negative Constants.",
                    "A Second Step Towards Circuit Complexity-Theoretic Analogs of Rice's Theorem.",
                    "Model Checking Real-Time Properties of Symmetric Systems.",
                    "Locality of Order-Invariant First-Order Formulas.",
                    "Probabilistic Concurrent Constraint Programming: Towards a Fully Abstract Model.",
                    "Lazy Functional Algorithms for Exact Real Functionals.",
                    "Randomness vs. Completeness: On the Diagonalization Strength of Resource-Bounded Random Sets.",
                    "Positive Turing and Truth-Table Completeness for NEXP Are Incomparable.",
                    "Tally NP Sets and Easy Census Functions.",
                    "Average-Case Intractability vs. Worst-Case Intractability.",
                    "Shuffle on Trajectories: The Schützenberger Product and Related Operations.",
                    "Gaußian Elimination and a Characterization of Algebraic Power Series.",
                    "D0L-Systems and Surface Automorphisms.",
                    "About Synchronization Languages.",
                    "When Can an Equational Simple Graph Be Generated by Hyperedge Replacement?",
                    "Spatial and Temporal Refinement of Typed Graph Transformation Systems.",
                    "Approximating Maximum Independent Sets in Uniform Hypergraphs.",
                    "Representing Hyper-Graphs by Regular Languages.",
                    "Improved Time and Space Hierarchies of One-Tape Off-Line TMs.",
                    "Tarskian Set Constraints Are in NEXPTIME.",
                    "forall exists*-Equational Theory of Context Unification is Pi10-Hard.",
                    "Speeding-Up Nondeterministic Single-Tape Off-Line Computations by One Alternation.",
                    "Facial Circuits of Planar Graphs and Context-Free Languages.",
                    "Optimizing OBDDs Is Still Intractable for Monotone Functions.",
                    "Blockwise Variable Orderings for Shared BDDs.",
                    "On the Composition Problem for OBDDs with Multiple Variable Orders.",
                    "Equations in Transfinite Strings.",
                    "Minimal Forbidden Words and Factor Automata.",
                    "On Defect Effect of Bi-Infinite Words.",
                    "On Repetition-Free Binary Words of Minimal Density.",
                    "Embedding of Hypercubes into Grids.",
                    "Tree Decompositions of Small Diameter.",
                    "Degree-Preserving Forests.",
                    "A Parallelization of Dijkstra's Shortest Path Algorithm.",
                    "Comparison Between the Complexity of a Function and the Complexity of Its Graph.",
                    "IFS and Control Languages.",
                    "One Quantifier Will Do in Existential Monadic Second-Order Logic over Pictures.",
                    "On Some Recognizable Picture-Languages.",
                    "On the Complexity of Wavelength Converters.",
                    "On Boolean vs. Modular Arithmetic for Circuits and Communication Protocols.",
                    "Communication Complexity and Lower Bounds on Multilective Computations.",
                    "A Finite Hierarchy of the Recursively Enumerable Real Numbers.",
                    "One Guess One-Way Cellular Arrays.",
                    "Topological Definitions of Chaos Applied to Cellular Automata Dynamics.",
                    "Characterization of Sensitive Linear Cellular Automata with Respect to the Counting Distance.",
                    "Additive Cellular Automata over Zp and the Bottom of (CA, <=)."
                ]
            },
            {
                "sub_name_abbr": "conf/mfcs/1998gs",
                "sub_name": "Progreedings of the MFCS '98 Satellite Workshop on Grammar Systems, Brno, Czech Republic, August 22-23, 1998.",
                "count": 17,
                "papers": [
                    "Foreword.",
                    "Colonies - A Theory of Reactive Agents (Preliminary Survey).",
                    "New Topics in Colonies Theory.",
                    "Unreliable Colonies as Systems of Stochastic Grammars.",
                    "Networks of Language Processors: Distributed Communicating Architectures in Grammar Systems.",
                    "Array Grammar Systems.",
                    "Grammatical Models for Some Process Synchronizers.",
                    "Communication in Parallel Communicating Lindenmayer Systems (Extended Abstract).",
                    "Cooperating Distributed Hyperedge Replacement Grammars.",
                    "Cultural Eco-Grammar Systems: A Multi-Agent System for Cultural Change.",
                    "On Determinism in Eco-Grammar Systems.",
                    "Eco-Grammar Systems, Decidability and the Tiling Problem.",
                    "On Hybrid Eco-Rewriting Systems.",
                    "Computing Linear Systems of First-order Equations on Integers and Naturals by Simple Eco-grammars.",
                    "Cellular Associative Symbolic Processing for Pattern Recognition.",
                    "Intelligent Languages: A Preliminary Syntactic Theory.",
                    "Cooperation in Contextual Grammars."
                ]
            }
        ]
    },
    {
        "year": "1997",
        "name": "22nd MFCS 1997",
        "info": "Bratislava, Slovakia",
        "venues": [
            {
                "sub_name_abbr": "conf/mfcs/1997",
                "sub_name": "Mathematical Foundations of Computer Science 1997, 22nd International Symposium, MFCS'97, Bratislava, Slovakia, August 25-29, 1997, Proceedings.",
                "count": 51,
                "papers": [
                    "Game Semantics for Programming Languages (Abstract).",
                    "Communication Complexity.",
                    "Treewidth: Algorithmoc Techniques and Results.",
                    "When are Two Rewrite Systems More than None?",
                    "Positive Applications of Lattices to Cryptography.",
                    "A Tile-Based Coordination View of Asynchronous pi-Calculus.",
                    "Communication Complexity and Sequential Compuation.",
                    "Lower Bounds for a Proof System with an Expentential Speed-up over Constant-Depth Frege Systems and over Polynomial Calculus.",
                    "Computational Limitations of Stochastic Turing Machines and Arthur-Merlin Games with Small Space Bounds.",
                    "Learning to Perform Knowledge-Intensive Inferences.",
                    "Resolution Proofs, Exponential Bounds, and Kolmogorov Complexity.",
                    "The Expressiveness of Datalog Circuits (DAC).",
                    "The Complexity of Policy Evaluation for Finite-Horizon Partially-Observable Markov Decision Processes.",
                    "A Category of Transition Systems and Its Relations with Orthomodular Posets.",
                    "Accepting Zeno Words Without Making Time Stand Still.",
                    "Complexity Theoretical Results on Partitioned (Nondeterministic) Binary Decision Diagrams.",
                    "Specifying Computations Using Hyper Transition Systems.",
                    "A Shift-Invariant Metric on Szz Inducing a Non-trivial Tolology.",
                    "Subtyping Calculus of Construction (Extended Abstract).",
                    "Distances Between Languages and Reflexivity of Relations.",
                    "Partial Characterization of Synchronization Languages.",
                    "Integrating the Specification Techniques of Graph Transformation and Temporal Logic.",
                    "On the Generation of Trees by Hyperedge Replacement.",
                    "Regulations by Valences.",
                    "Simulation as a Correct Transformation of Rewrite Systems.",
                    "On the Dilation of Interval Routing.",
                    "Relating Conflict-Free Stable Transition and Event Models (Extended Abstract).",
                    "The Giant Component Threshold for Random Regular Graphs with Edge Faults.",
                    "A Topological Generalization of Propositional Linear Time Temporal Logic.",
                    "Multi-Head Finite Automata: Data-Independent Versus Data-Dependent Computations.",
                    "Complexity of Finding Short Resolution Proofs.",
                    "On O versus NP \\cap co-NP for Decision Trees and Read-Once Branching Programs.",
                    "A Characterization of Abstract Families of Algebraic Power Series.",
                    "Repetitiveness of D0L-Languages Is Decidable in Polynomial Time.",
                    "Minimal Letter Frequency in n-th Power-Free Binary Words.",
                    "Real-Time Generation of Primes by a One-Dimensional Cellular Automaton with 11 States.",
                    "Optimal Algorithms for Complete Linkage Clustering in d Dimensions.",
                    "Invertible Linear Cellular Automata over zm: Algorithmic and Dynamical Aspects.",
                    "Two-Level Contextual Grammars: The Internal Case.",
                    "Counting Problems over the Reals.",
                    "On the Influence of the State Encoding on OBDD-Representations of Finite State Machines.",
                    "Decomposition of TrPTL Formulas.",
                    "NP-Hard Sets Have Many Hard Instances.",
                    "Deciding Verbose Languages with Linear Advice.",
                    "Homomorphic Images os Sentential Forms and Terminating Grammars (Extended Abstract).",
                    "Simplification Orders for Term Graph Rewriting.",
                    "Dependency-Based Action Refinement.",
                    "A Hierarchy for (1, +k)-Branching Programs with Respect of k.",
                    "Routing with Finite Speeds of Memory and Network.",
                    "Queries and Algorithms Computable by Polynomial Time Existential Reflective Machines (Extended Abstract).",
                    "Partial Order Semantics and Read Arcs."
                ]
            }
        ]
    },
    {
        "year": "1996",
        "name": "21st MFCS 1996",
        "info": "Cracow, Poland",
        "venues": [
            {
                "sub_name_abbr": "conf/mfcs/1996",
                "sub_name": "Mathematical Foundations of Computer Science 1996, 21st International Symposium, MFCS'96, Cracow, Poland, September 2-6, 1996, Proceedings.",
                "count": 45,
                "papers": [
                    "Word Level Model Checking (Abstract).",
                    "Code Problems on Traces.",
                    "Models of DNA Computation.",
                    "Theory and Practice of Action Semantics.",
                    "Linear Time Temporal Logics over Mazurkiewicz Traces.",
                    "Partial Order Reduction: Model-Checking Using Representatives.",
                    "Nonmonotonic Rule Systems: Foward Chaining, Constraints, and Complexity (Abstract).",
                    "Mind the Gap! Abstract Versus Concrete Models of Specifications.",
                    "A Sequent Calculus for Subtyping Polymorphic Types.",
                    "Kolmogorov Complexity: Recent Research in Moscow.",
                    "A Modal Logic for Data Analysis.",
                    "From Specifications to Programs: A Fork-Algebraic Approach to Bridge the Gap.",
                    "Logic of Predicates with Explicit Substitutions.",
                    "On the Query Complexity of Sets.",
                    "A Lambda Calculus of Incomplete Objects.",
                    "Bisimilarity Problems Requiring Exponential Time.",
                    "Linear Dynamic Kahn Networks Are Deterministic.",
                    "Shortest Path Problems with Time Constraints.",
                    "Parallel Alternating-Direction Access Machine.",
                    "Specification and Verification of Timed Lazy Systems.",
                    "A Class of Information Logics with a Decidable Validity Problem.",
                    "On the Power of Nonconservative PRAM.",
                    "Self-Similarity Viewed as a Local Property via Tile Sets.",
                    "Simulation of Specification Statements in Hoare Logic.",
                    "Equational Properties of Iteration in Algebraically Complete Categories.",
                    "On Unconditional Transfer.",
                    "(poly(log log n), poly(log log n))-Restricted Verifiers are Unlikely to Exist for Languages in NP.",
                    "Minimizing Congestion of Layouts for ATM Networks with Faulty Links.",
                    "Polynomial Automaticity, Context-Free Languages, and Fixed Points of Morphism (Extended Abstract).",
                    "Causal Testing.",
                    "Construction of List Homomorphisms by Tupling and Fusion.",
                    "Probabilistic Metric Semantics for a Simple Language with Recursion.",
                    "Dynamic Graphs.",
                    "Equations on Trees.",
                    "On the Equivalence Problem for E-Pattern Languages.",
                    "Specifying and Verifying Parametric Processes.",
                    "On Saturation with Flexible Function Symbols.",
                    "Approximating Good Simultaneous Diophantine Approximations Is Almost NP-Hard.",
                    "On the Conjugation of Standard Morphisms.",
                    "A Semantic Matching Algorithm: Analysis and Implementation.",
                    "Routing on Triangles, Tori and Honeycombs.",
                    "A Uniform Analysis of Trie Structures that Store Prefixing-Keys with Application to Doubly-Chained Prefixing-Tries.",
                    "On Fairness in Terminating and Reactive Programs.",
                    "Polynomial Time Samplable Distributions.",
                    "From Static to Dynamic Abstract Data-Types."
                ]
            }
        ]
    },
    {
        "year": "1995",
        "name": "20th MFCS 1995",
        "info": "Prague, Czech Republic",
        "venues": [
            {
                "sub_name_abbr": "conf/mfcs/1995",
                "sub_name": "Mathematical Foundations of Computer Science 1995, 20th International Symposium, MFCS'95, Prague, Czech Republic, August 28 - September 1, 1995, Proceedings.",
                "count": 54,
                "papers": [
                    "Scheduling Parallel Communication: The h-relation Problem.",
                    "Decomposable Structures, Boolean Function Representations, and Optimization.",
                    "The Complexity of Interval Routing on Random Graphs.",
                    "Bridging Across the log(n) Space Frontier.",
                    "Second Order Logic and the Weak Exponential Hierarchies.",
                    "On the Computing Paradigm and Computational Complexity.",
                    "Ranked Structures in Nonmonotonic Reasoning and Belief Revision: Abstract.",
                    "Symbolic Dynamics and Finite Automata.",
                    "Lower Bounds for Propositional Proofs and Independence Results in Bounded Arithmetic (Abstract).",
                    "Physics and the New Computation.",
                    "Measure on P: Robustness of the Notion.",
                    "Comparing Counting Classes for Logspace, One-way Logspace, and First-order.",
                    "Automata That Take Advice.",
                    "Nonuniform Lower Bounds for Exponential Time Classes.",
                    "On a Quantitative Notion of Uniformity.",
                    "Separations by Random Oracles and \"Almost\" Classes for Generalized Reducibilities.",
                    "On the Complexity of Finite Memory Policies for Markov Decision Processes.",
                    "Derandomization for Sparse Approximations and Independent Sets.",
                    "Asymptotically Efficient In-Place Merging.",
                    "The Complexity of the Falsifiability Problem for Pure Implicational Formulas.",
                    "Strong Lower Bounds on the Approximability of some NPO PB-Complete Maximization Problems.",
                    "Some Typical Properties of Large AND/OR Boolean Formulas.",
                    "The Hedge: An Efficient Storage Device for Turing Machines with One Head (Extended Abstract).",
                    "Graph Inference from a Walk for TRees of Bounded Degree 3 is NP-Complete.",
                    "Honecomb Networks.",
                    "Witness-Isomorphic Reductions and the Local Search Problem (Extended Abstract).",
                    "Multiple Product Modulo Arbitrary Numbers.",
                    "Lower Bounds for the Majority Communication Complexity of Various Graph Accessibility Problems.",
                    "Strong Optimal Lower Bounds for Turing Machines that Accept Nonregular Languages.",
                    "A Superpolynomial Lower Bound for (1, +k(n))-Branching Programs.",
                    "Deterministic Parsing for Augmented Context-free Grammars.",
                    "A Periodicity Theorem on Words and Applications.",
                    "A New Approach to Analyse Coupled-Context-Free Languages.",
                    "Computational Complexity of Simultaneous Elementary Matching Problems (Extended Abstract).",
                    "Graph Reducibility of Term Rewriting Systems.",
                    "Positive Recursive Type Assignment.",
                    "String Recognition on Anonymous Rings.",
                    "The Firing Squad Synchronization Problem on Cayley Graphs.",
                    "Solving Cheap Graph Problems an Meshes.",
                    "An Elementary Bisimulation Decision Procedure for Arbitrary Context-Free Processes.",
                    "On Congruences and Partial Orders.",
                    "Performance Preorder: Ordering Processes with Respect to Speed.",
                    "Towards a Semantic Theory of CML (Extended Abstract).",
                    "Modular Constructions of Distributing Automata.",
                    "On the Proof Method for Bisimulation (Extended Abstract).",
                    "Towards a Calculus of Predicate Transformers.",
                    "An Abstract Account of Composition.",
                    "Syntax and Semantics of Procol.",
                    "Synthesizing Distinguishing Formulae for Real Time Systems (Extended Abstract).",
                    "From Timed Automata to Logic - and Back.",
                    "Incremental Model Checking for Decomposable Structures (Extended Abstract).",
                    "Automata for the Modal mu-Calculus and related Results.",
                    "A v-Calculus with Local Views for Systems of Sequential Agents.",
                    "An Operator Calculus Approach to the Evolution of Dynamic Data Structures."
                ]
            }
        ]
    },
    {
        "year": "1994",
        "name": "19th MFCS 1994",
        "info": "Kosice, Slovakia",
        "venues": [
            {
                "sub_name_abbr": "conf/mfcs/1994",
                "sub_name": "Mathematical Foundations of Computer Science 1994, 19th International Symposium, MFCS'94, Kosice, Slovakia, August 22 - 26, 1994, Proceedings.",
                "count": 54,
                "papers": [
                    "Models, Languages, and Compiler Technology for High Performance Computers.",
                    "On NC-Real Complexity Classes for Additive Circuits and Their Relations with NC.",
                    "E-Complete Sets Do Not Have Optimal Polynomial Time Approximations.",
                    "Solving Polynomial Fixed Point Equations.",
                    "Capturing Complexity Classes with Lindström Quantifiers.",
                    "Communication Throughput of Interconnection Networks.",
                    "Intuitive Counterexamples for Constructive Fallacies.",
                    "Algebraic Methods in the Compositional Analysis of Logic Programs.",
                    "Longest Common Subsequences.",
                    "Towards DNA Sequencing Chips.",
                    "On-Line Scheduling of Parallel Jobs.",
                    "Stable Bistructure Models of PCF.",
                    "A Competitive Analysis of the List Update Problem with Lookahead.",
                    "May and Must Convergencey in Concurrent Lambda-Calculus.",
                    "Genericity and Measure for Exponential Time.",
                    "Analysis of Bounded Disorder.",
                    "On Languages Accepted with Simultaneous Complexity Bounds and Their Ranking Problem.",
                    "A Proof System for Asynchronously Communicating Deterministic Processes.",
                    "Embedding Complete Binary Trees into Star Networks.",
                    "Inductive Counting Below LOGSPACE.",
                    "Decision Problems for Edge Grammars.",
                    "\"The Big Sweep\": On the Power of the Wavefront Approach to Voronoi Diagrams.",
                    "Reliable Minimum Finding Comparator Networks.",
                    "On Parallel Complexity of Maximum f-matching and the Degree Sequence Problem.",
                    "A Comparison of Two Lower Bound Methods for Communication Complexity.",
                    "Efficient Solving of the Word Equations in One Variable.",
                    "A Pi-Calculus with Explicit Substitutions: the Late Semantics.",
                    "Processes and Hyperuniverses.",
                    "The Combinatorial Complexity of a Finite String.",
                    "A Fully Abstract Semantics for Termination in Petri Nets.",
                    "Passive and Active Rules in Deductive Databases.",
                    "Combinatorial Results on the Complexity of Teaching and Learning.",
                    "Degrees and Reducibilities of Easy Tally Sets.",
                    "MSO Definable Text Languages.",
                    "Two Lower Bounds on Distributive Generation of Languages.",
                    "Rational Rewriting.",
                    "On the Size of Independent Systems of Equations in Semigroups.",
                    "On a Sublinear Time Parallel Construction of Optimal Binary Search Trees.",
                    "Hammock-on-Ears Decomposition: A Technique for the Efficient Parallel Solution of Shortest Paths and Other Problems.",
                    "The Relationship Between Gossiping in Vertex-Disjoint Paths Mode and Bisection Width.",
                    "A Comparison of Finite and Cellular Automata.",
                    "Empty Alternation.",
                    "On the Minimization Prolem for Omega-Automata.",
                    "On the Complexity of Constructing Optimal Ordered Binary Decision Diagrams.",
                    "Approximation Algorithms for Min-k-overlap Problems Using the Principal Lattice of Partitions Approach.",
                    "A Completeness Theorem fro Nondeterministic Kleene Algebras.",
                    "How a Rainbow Coloring Function Can Simulate Wait-Free Handshaking.",
                    "Critical Pairs in Term Graph Rewriting.",
                    "Read-Write Causality.",
                    "Some Trace Monoids Where Both the Star Problem and the Finite Power Property Problem are Decidable.",
                    "Complexity of E0L Structural Equivalence.",
                    "Shorter Queues for Permutation Routing on Meshes.",
                    "Full Abstraction for the Second Order Subset of an Algol-Like Language.",
                    "The Finest Homophonic Partition and Related Code Concepts."
                ]
            }
        ]
    },
    {
        "year": "1993",
        "name": "18th MFCS 1993",
        "info": "Gdansk, Poland",
        "venues": [
            {
                "sub_name_abbr": "conf/mfcs/1993",
                "sub_name": "Mathematical Foundations of Computer Science 1993, 18th International Symposium, MFCS'93, Gdansk, Poland, August 30 - September 3, 1993, Proceedings.",
                "count": 68,
                "papers": [
                    "On the Unification Free Prolog Programs.",
                    "Equivalences and Preorders of Transition Systems.",
                    "Deliverables: A Categorial Approach to Program Development in Type Theory.",
                    "Complex and Complex-Like Traces.",
                    "Symbolic Bisimulations (Abstract).",
                    "Some Results on the Full Abstraction Problem for Restricted Lambda Calculi.",
                    "Action Calculi, or Syntactic Action Structures.",
                    "Observable Properties of Higher Order Functions that Dynamically Create Local Names, or What's new?",
                    "The Second Calculus of Binary Relations.",
                    "An Introduction to Dynamic Labled 2-Structures.",
                    "Post Correspondence Problem: Primitivity and Interrelations with Complexity Classes.",
                    "A Taste of Linear Logic.",
                    "On the Tree Inclusion Problem.",
                    "On the Adequacy of Per Models.",
                    "Hausdorff Reductions to Sparse Sets and to Sets of High Information Content.",
                    "Stores as Homomorphisms and their Transformations.",
                    "Comparative Semantics for Linear Arrays of Communicating Processes: A Study of the UNIX Fork and Pipe Commands.",
                    "Rabin Tree Automata and Finite Monoids.",
                    "Efficient Type Reconstruction in the Presence of Inheritance.",
                    "A Characterization of Sturmian Morphisms.",
                    "On the Complexity of Scheduling Incompatible Jobs with Unit-Times.",
                    "Isomorphisms between Predicates and State Transformers.",
                    "On the Amount of Nondeterminism and the Power of Verifying (Extended Abstract).",
                    "Observing Distribution in Processes.",
                    "Speedup of Recognizable Trace Languages.",
                    "May I Borrow Your Logic?",
                    "Approximate and Exact Deterministic Parallel Selection.",
                    "Defining Soft Sortedness by Abstract Interpretation.",
                    "A Model for Real-Time Process Algebras (Extended Abstract).",
                    "Data Encapsulation and Modularity: Three Views of Inheritance.",
                    "Image Compression Using Weighted Finite Automata.",
                    "Filter Models for a Parallel and Non Deterministic Lambda-Calculus.",
                    "Real Number Computability and Domain Theory.",
                    "Lambda Substitution Algebras.",
                    "Global Properties of 2D Cellular Automata: Some Complexity Results.",
                    "Completeness Results for Linear Logic on Petri Nets.",
                    "An Expressive Logic for Basic Process Algebra.",
                    "The Complexity of Finding Replicas Using Equality Tests.",
                    "A Complete Axiomatization for Branching Bisimulation Congruence of Finite-State Behaviours.",
                    "Object Oriented Application Flow Graphs and their Semantics.",
                    "Some Hierarchies for the Communication Complexity Measures of Cooperating Grammar Systems.",
                    "Efficient Parallel Graph Algorithms Based on Open Ear Decomposition.",
                    "On the Communication Complexity of Parallel Computation.",
                    "A Taxonomy of Forgetting Automata.",
                    "Hybrid Parallel Programming and Implementation of Synchronised Communication.",
                    "Proof Systems for Cause Based Equivalences.",
                    "A Uniform Universal CREW PRAM.",
                    "Observing Located Concurrency.",
                    "The Boundary of Substitution Systems.",
                    "New Algorithms for Detecting Morphic Images of a Word.",
                    "Ignoring Nonessential Interleavings in Assertional Reasoning on Concurrent Programs.",
                    "Constant Time Reductions in Lambda-Caculus.",
                    "Heterogeneous Unified Algebras.",
                    "A Representation Theorem for Lambda Abstraction Algebras.",
                    "On Saturated Calculi for a Linear Temporal Logic.",
                    "The Snack Powerdomain for Database Semantics.",
                    "Verifying Properties of Module Construction in Type Theory.",
                    "On Time-Space Trade-Offs in Dynamic Graph Pebbling.",
                    "Deterministic Behavioural Models for Concurrency.",
                    "Real-Time Refinement: Semantics and Application.",
                    "Deciding Testing Equivalence for Real-Time Processes with Dense Time.",
                    "A Calculus for Higher Order Procedures with Global Variables.",
                    "Variable Substitution with Iconic Combinators.",
                    "Feature Constraints with First-Class Features.",
                    "Between Min Cut and Graph Bisection.",
                    "Paths and Cycles in Finite Periodic Graphs.",
                    "Learning Decision Lists from Noisy Examples.",
                    "Analytic Tableaux for Finite and Infinite Post Logics."
                ]
            }
        ]
    },
    {
        "year": "1992",
        "name": "17th MFCS 1992",
        "info": "Prague, Czechoslovakia",
        "venues": [
            {
                "sub_name_abbr": "conf/mfcs/1992",
                "sub_name": "Mathematical Foundations of Computer Science 1992, 17th International Symposium, MFCS'92, Prague, Czechoslovakia, August 24-28, 1992, Proceedings.",
                "count": 50,
                "papers": [
                    "On Range Searching with Semialgebraic Sets.",
                    "Graph Layout Problems.",
                    "Parallel Recognition and Ranking of Context-Free Languages.",
                    "On the Expansion of Combinatorial Polytopes.",
                    "Neural Networks and Complexity Theory.",
                    "Theory of Computation over Stream Algebras, and its Applications.",
                    "Methods in Parallel Algorithmics (Abstract).",
                    "On the Complexity of Small Description and Related Topics.",
                    "Weak Parallel Machines: a New Class of Physically Feasible Parallel Machine Models.",
                    "The Complexity of Graph Connectivity.",
                    "A Perfect Parallel Dictionary.",
                    "Some Remarks on the Test Complexity of Iterative Logic Arrays.",
                    "The Degree Structure of 1-L Reductions.",
                    "Promise Problems and Access to Unambiguous Computation.",
                    "On the Complexity of Incremental Computation.",
                    "Rational Transductions and Complexity of Counting Problems.",
                    "Negation Elimination in Equational Formulae.",
                    "Object Interaction.",
                    "Strong Normalization of Substitutions.",
                    "Probabilistic and Pluralistic Learners with Mind Changes.",
                    "Parallel Complexity of Iterated Morphisms and the Arithmetic of Small Numbers.",
                    "On Computational Power of Weighted Finite Automata.",
                    "The Shuffle Exchange Network has a Hamiltonian Path.",
                    "Poset Properties of Complex Traces.",
                    "A Threshold for Unsatisfiability.",
                    "Dataflow Semantics for Petri Nets.",
                    "About Boundedness for some DATALOG and DATALOG_neg Programs.",
                    "Merging and Sorting Strings in Parallel.",
                    "Characterization of Context-Free Languages by Erasing Automata.",
                    "Insertion and Deletion of Words: Determinism and Reversibility.",
                    "Small Universal One-State Linear Operator Algorithm.",
                    "Mobility in the CC-Paradigm.",
                    "The Emptiness Problem for Intersections of Regular Languages.",
                    "On Finite Automata with Limited Nondeterminism.",
                    "Definitions and Comparisons of Local Computations on Graphs.",
                    "Efficient Unidimensional Universal Cellular Automaton.",
                    "Inferring a Tree from Walks.",
                    "Almost Every Set in Exponential Time is P-Bi-Immune.",
                    "A Functorial Semantics for Observed Concurrency.",
                    "Modelling Concurrency with Semi-Commutations.",
                    "Decision Problems for Cellular Automata and Their Semigroups.",
                    "On the Nature of Events.",
                    "New Parallel Algorithms for Convex Hull and Triangulation in 3-Dimensional Space.",
                    "Two Simple Characterizations of Well-Founded Semantics.",
                    "Fully Abstract Semantics for Higher Order Communicating Systems.",
                    "Superposable Trellis Automata.",
                    "Maintaining Proximity in Higher Dimensional Spaces.",
                    "Characterizing Regular Languages with Polynomial Densities.",
                    "A Strategy for Speeding-up the Computation of Characteristic Sets.",
                    "One-Rule Trace-Rewriting Systems and Confluence."
                ]
            }
        ]
    },
    {
        "year": "1991",
        "name": "16th MFCS 1991",
        "info": "Kazimierz Dolny, Poland",
        "venues": [
            {
                "sub_name_abbr": "conf/mfcs/1991",
                "sub_name": "Mathematical Foundations of Computer Science 1991, 16th International Symposium, MFCS'91, Kazimierz Dolny, Poland, September 9-13, 1991, Proceedings.",
                "count": 43,
                "papers": [
                    "Elimination of Negation in Term Algebras.",
                    "Rewrite Orderings and Termination of Rewrite Systems.",
                    "On the Faithfulness of Formal Models.",
                    "Models for Concurrency.",
                    "On a Hierarchy of File Types and a Tower of Their Theories.",
                    "Strong Conjunction and Intersection Types.",
                    "Partial Higher-Order Specifications.",
                    "Unification in Incompletely Specified Theories: A Case Study.",
                    "Observing Localities (Extended Abstract).",
                    "Abstract Dynamic Data Types: A Temporal Logic Approach.",
                    "Generating Words by Cellular Automata.",
                    "Atomic Refinement in Process Description Languages.",
                    "Recognizable Complex Trace Languages.",
                    "Solving Systems of Linear Diophantine Equations: An Algebraic Approach.",
                    "A Second-Order Pattern Matching Algorithm for the Cube of Typed Lambda-Calculi.",
                    "The lazy call-by-value Lamda-Calculus.",
                    "The Limit of Split_n-Bisimulations for CCS Agents.",
                    "Stochastic Automata and Length Distributions of Rational Languages.",
                    "Towards a Categorical Semantics Type Classes.",
                    "Single-Path Petri Nets.",
                    "The Bisection Problem for Graphs of Degree 4 (Configuring Transputer Systems).",
                    "Some Results Concerning 2-D On-line Tessellation Acceptors and 2-D Alternating Finite Automata.",
                    "Infinite Normal Forms for Non-Linear Term Rewriting Systems.",
                    "Two Algorithms for Approximate String Matching in Static Texts.",
                    "Efficient Constructions of Test Sets for Regular and Context-Free Languages.",
                    "The Complexity of The Reliable Connectivity Problem.",
                    "Pattern Matching in Order-Sorted Languages.",
                    "Two Over Three: A Two-Valued Logic for Software Specification and Validation Over a Three-Valued Predicate Calculus.",
                    "A Solution of the Complement Problem in Associative-Commutative Theories.",
                    "A Model for Real-Time Systems.",
                    "On Strict Codes.",
                    "A Decidable Case of the Semi-Unification Problem.",
                    "Maintaining Dictionaries in a Hierarchical Memory.",
                    "Upper and Lower Bounds for Certain Graph-Accessibility Problems on Bounded Alternating Omega-Branching Programs.",
                    "CCS Dynamic Bisimulation is Progressing.",
                    "Syntax and Semantics of a Monotonic Framework for Non-Monotonic Reasoning.",
                    "On the Cardinality of Sets of Infinite Trees Recognizable by Finite Automata.",
                    "Extending Temporal Logic by Explicit Concurrency.",
                    "An Extensional Partial Combinatory Algebra Based on Lamda-Terms.",
                    "Once More on Order-Sorted Algebras.",
                    "Composition of Two Semi Commutations.",
                    "An Efficient Decision Algorithm for the Uniform Semi-Unification Problem.",
                    "Different Modifications of Pointer Machines and Their Computational Power."
                ]
            }
        ]
    },
    {
        "year": "1990",
        "name": "15th MFCS 1990",
        "info": "Banská Bystrica, Czechoslovakia",
        "venues": [
            {
                "sub_name_abbr": "conf/mfcs/1990",
                "sub_name": "Mathematical Foundations of Computer Science 1990, MFCS'90, Banská Bystrica, Czechoslovakia, August 27-31, 1990, Proceedings.",
                "count": 62,
                "papers": [
                    "A Logical Operational Semantics of Full Prolog, Part II: Built-in Predicates for Database Manipulation.",
                    "Syntactic Theories.",
                    "On Kleene Algebras and Closed Semirings.",
                    "Interactive Computations of Optimal Solutions.",
                    "Restricted Branching Programs and Their Computational Power.",
                    "Dynamic Hashing Strategies.",
                    "One-Way Functions in Complexity Theory.",
                    "Type Inference Problems: A Survey.",
                    "Counting the Number of Solutions.",
                    "Implementation of Parallel Graph Reduction by Explicit Annotation and Program Transformation.",
                    "Interrogative Complexity of omega-Languages' Recognition.",
                    "On the Power of Uniform Families of Constant Depth Treshold Circuits.",
                    "Separating Sets of Hyperrectangles.",
                    "On Preemptive Scheduling of Periodic, Real-Time Tasks on One Processor.",
                    "Retractions in Comparing Prolog Semantics (Extended Abstract).",
                    "Using Inductive Counting to Simulate Nondeterministic Computation.",
                    "Some Properties of Zerotesting Bounded One-Way Multicounter Machines.",
                    "On Fast Algorithms for Two Servers.",
                    "Decomposition of Semi Commutations.",
                    "Parallel Construction of Minimal Suffix and Factor Automata.",
                    "Affine Automata: A Technique to Generate Complex Images.",
                    "The Complexity of Symmetric Functions in Parity Normal Forms.",
                    "Event Structures, Causal Trees, and Refinements.",
                    "Query Languages which Express all PTIME Queries for Trees and Unicyclic Graphs.",
                    "Comparisons Among Classes of Y-Tree Systolic Automata.",
                    "On Checking Versus Evaluation of Multiple Queries.",
                    "Generalized Kolmogorov Complexity in Relativized Separations (Extended Abstract).",
                    "A First-Order Logic for Partial Recursive Functions.",
                    "Speed-Up Theorem Without Tape Compression.",
                    "On Possibilities of One-Way Synchronized and Alternating Automata.",
                    "Unrestricted Resolution versus N-Resolution.",
                    "Quality Criteria for Partial Order Semantics of Place/Transition-Nets.",
                    "Tree-Stack Automata.",
                    "Specification & Verification of Higher Order Processes.",
                    "The Membership Problem for Context-Free Chain Code Picture Languages.",
                    "Optimal Algorithms for Dissemination of Information in Some Interconnection Networks (Extended Abstract).",
                    "A Hierarchy of Compositional Models of I/O-Automata (Extended Abstract).",
                    "Minimal Nontrivial Space Complexity of Probabilistic One-Way Turing Machines.",
                    "On the Complexity of Genuinely Polynomial Computation.",
                    "Pumping Lemmas for Tree Languages Generated by Rewrite Systems.",
                    "Vector Language: Simple Description of Hard Instances (Extended Abstract).",
                    "Separating +L From L, NL, co-NL and AL (=P) for Oblivious Turing Machines of Linear Access Time.",
                    "The Use of Graphs of Elliptical Influence in Visuel Hierarchical Clustering.",
                    "Characterizing Unambiguous Augmented Pushdown Automata by Circuits.",
                    "Rational omega-Transductions.",
                    "Splitsort - An Adaptive Sorting Algorithm.",
                    "Equational Calculi for Many-Sorted Algebras with Empty Carrier Sets.",
                    "Semi-Commutation and Deterministic Petri Nets.",
                    "Internal Labellings in Lambda-Calculus.",
                    "A Sup-Preserving Completion of Ordered Partial Algebras.",
                    "ATIME(N) is Closed Under Counting.",
                    "Investigation of Finitary Calculi for the Temporal Logics by Means of Infinitary Calculi.",
                    "Typed Horn Logic.",
                    "Results on the Glory of the Past.",
                    "A Stronger Version of Parikh Theorem.",
                    "The Parallel Complexity of Some Constructions in Combinatorial Group Theory (Abstract).",
                    "Gentzen Type Axiomatizations for PAL.",
                    "Distance Automata Having Large Finite Distance or Finite Ambiguity.",
                    "Bottom-Up-Heap Sort, a New Variant of Heap Sort Beating on Average Quick Sort (if n is not very small).",
                    "Symmetric Functions in AC0A Can Be Computed in Constant Depth With Very Small Size.",
                    "The k-section of Treewidth Restricted Graphs.",
                    "Computing Large Polynomial Powers Very Fast in Parallel."
                ]
            }
        ]
    },
    {
        "year": "1989",
        "name": "14th MFCS 1989",
        "info": "Porabka-Kozubnik, Poland",
        "venues": [
            {
                "sub_name_abbr": "conf/mfcs/1989",
                "sub_name": "Mathematical Foundations of Computer Science 1989, MFCS'89, Porabka-Kozubnik, Poland, August 28 - September 1, 1989, Proceedings.",
                "count": 52,
                "papers": [
                    "From Specification Languages to Specification Knowledge Bases: The PTO Approach.",
                    "Monadic Second-Order Logic and Context-Free Graph-Grammars.",
                    "A Thesis for Bounded Concurrency.",
                    "Space Bounded Computations: Review And New Separation Results.",
                    "Concurrent Nondeterministic Processes: Adequacy of Structure and Behaviour.",
                    "LEDA: A Library of Efficient Data Types and Algorithms.",
                    "Correctness of Concurrent Processes.",
                    "Understanding Nets.",
                    "On the Strength of Temporal Proofs.",
                    "Proof-Theoretic Characterisations of Logic Programs.",
                    "Algebraic Closed Theories.",
                    "Control Flow versus Logic: A Denotational and a Declarative Model for Guarded Horn Clauses.",
                    "Ehrenfeucht Test Set Theorem and Hilbert Basis Theorem: A Constructive Glimpse.",
                    "Parallel Complexity of Lexicographically First Order Problems for Tree-Structured Graphs (Extended Abstract).",
                    "On the Power of Synchronization in Parallel Computations.",
                    "Optimal Parallel Algorithms For The Recognition And Colouring Outerplanar Graphs (Extended Abstract).",
                    "Logical Characterizations of Nonmonotonic TMSs.",
                    "Proving Correctness of Constructor Implementations.",
                    "Equivalence Notions for Concurrent Systems and Refinement of Actions (Extended Abstract).",
                    "System Simulation and the Sensitivity of Self-Stabilization.",
                    "Polynomial-Time Functions Generate SAT: On P-Splinters.",
                    "Generalized Definite Tree Languages.",
                    "Pinwheel Scheduling With Tow Distinct Numbers.",
                    "Testing Approximate Symmetry in the Plane is NP-hard.",
                    "Memory and Algebra.",
                    "Integer Relations Among Algebraic Numbers.",
                    "An Iterative Metric Fully Abstract Semantics for Nondeterministic Dataflow (Extended Abstract).",
                    "Complexity of Decision Problems Under Incomplete Information.",
                    "On the Nature of TELLUS (a Typed Equational Logic Look over Uniform Specification).",
                    "Switching Graphs and Their Complexity.",
                    "Pomset Semantics for True Concurrency with Synchronization and Recursion (Extended Abstract).",
                    "Oracle Branching Programs and Logspace versus P.",
                    "Generalizing Singly-Linked List Reorganizing Heuristics for Doubly-Linked Lists.",
                    "Area Complexity of Merging.",
                    "Logically Defined Subsets of Nk.",
                    "An Extended Herbrand Theorem for First-Order Theories with Equality Interpreted in Partial Algebras.",
                    "Characterization of Recognizable Trace Languages by Distributed Automata (Extended Abstract).",
                    "Knuth-Morris-Pratt Algorithm: An Analysis.",
                    "Pushdown Automata on Infinite Trees and Omega-Kleene closure of Context-Free Tree Sets.",
                    "An Imperative Type Hierarchy with Partial Products.",
                    "A Coloring Algorithm for Interval Graphs.",
                    "Finite Constants: Characterizations of a New Decidable Set of Constants.",
                    "Optimal Data Flow Analysis via Observational Equivalence.",
                    "One More Method For Proving Lower Bounds on the Formula Complexity of Boolean Functions.",
                    "The Hoare-Like Verification System for a Language with an Exception Handling Mechanism.",
                    "On the Length of Values in a Finite Transducer.",
                    "On Varieties of Languages Closed Under Products with Counter.",
                    "On the Computational Efficiency of Symmetric Neural Networks.",
                    "Constructive Aspects of the Omega-Rule: Application to Proof Systems in Computer Science and Algorithmic Logic.",
                    "How to Define Functionals of Free Structures in Typed Lambda Calculus.",
                    "Concurrency, Modularity, and Synchronization.",
                    "On Comparing Probabilistic and Deterministic Automata Complexity of Languages."
                ]
            }
        ]
    },
    {
        "year": "1988",
        "name": "13th MFCS 1988",
        "info": "Carlsbad, Czechoslovakia",
        "venues": [
            {
                "sub_name_abbr": "conf/mfcs/1988",
                "sub_name": "Mathematical Foundations of Computer Science 1988, MFCS'88, Carlsbad, Czechoslovakia, August 29 - September 2, 1988, Proceedings.",
                "count": 53,
                "papers": [
                    "Sparse Sets, Tally Sets, and Polynomial Reducibilities.",
                    "Functional Programming and Combinatory Algebras.",
                    "On Models and Algebras for Concurrent Processes.",
                    "String Matching with Constraints.",
                    "Structure of Complexity Classes: Separations, Collapses, and Completeness.",
                    "Inductive Syntactical Synthesis of Programs from Sample Computations.",
                    "3-Dimensional Shortest Paths in the Presence of Polyhedral Obstacles.",
                    "Robust Orale Machines.",
                    "Recognizable Sets with Multiplicities in the Tropical Semiring.",
                    "Reusable Specification Components.",
                    "Comparing Interconnection Networks.",
                    "Probabilistic Automata Complexity of Languages Depends on Language Structure and Error Probability.",
                    "Breadth-First Phrase Structure Grammars and Queue Automata.",
                    "Implementing Abstract Data Structures in Hardware.",
                    "Distribution of Sequential Processes.",
                    "Automata and Rational Expressions on Planar Graphs.",
                    "On Maximal Prefix Sets of Words.",
                    "Infinite Behaviour if Deterministic Petri Nets.",
                    "Testing Isomorphism of Outerplanar Graphs in Parallel.",
                    "Efficient Simulations Between Concurrent-Read Concurrent-Write PRAM Models.",
                    "Multiple Propositional Dynamic Logic of Parallel Programs (Extended Abstract).",
                    "The Steiner Tree Problem and Homogeneous Sets.",
                    "Termination of Rewriting is Undecidable in the One-Rule Case.",
                    "Local Checking of Trace Synchroniziability.",
                    "Edge Separators for Planar Graphs and Their Applications.",
                    "A Fast Parallel Algorithm for Eigenvalue Problem of Jacobi Matrices.",
                    "Strong and Robustly Strong Polynomial Time Reducibilities to Sparse Sets.",
                    "Context-Free-Like Forms for the Phrase-Structure Grammars.",
                    "On the Expressive Strength of the Finitely Typed Lambda-Terms.",
                    "Hoare Calculi for Higher-Type Control Structures and Their Completeness in the Sense of Cook.",
                    "On Representing CCS Programs by Finite Petri Nets.",
                    "A Taxonomy of Fairness and Temporal Logic Problems for Petri Nets.",
                    "Branching Programs as a Tool for Proving Lower Bounds on VLSI Computations and Optimal Algorithms for Systolic Arrays.",
                    "Two Lower Bounds for Circuits over the Basis (&, V, -).",
                    "Positive/Negative Conditional Rewriting.",
                    "On the Computational Complexity of Codes in Graphs.",
                    "Separating the Eraser Turing Machine Classes Le, NLe, co-NLe and Pe.",
                    "Compositional Proofs by Partial Specification of Processes.",
                    "Introducing Negative Information in Relational Databases.",
                    "On Positive Occur-Checks in Unification.",
                    "Two Applications of Fürer's Counter to One-Tape Nondeterministic TMs.",
                    "Δ2p-Complete Lexicographically First Maximal Subgraph Problems.",
                    "Proof System for Weakest Prespecification and its Applications.",
                    "On Complexity of Counting.",
                    "Design, Proof and Analysis of New Efficient Algorithms for Incremental Attribute Evaluation.",
                    "On Efficiency of Interval Routing Algorithms.",
                    "An Almost Linear Robinson Unification ALgorithm.",
                    "Random Boolean Formulas Representing any Boolean Function with Asymptotically Equal Probability (Extended Abstract).",
                    "On the Power of Communication in Alternating Machines.",
                    "Classes of CNF-Formulas with Backtracking Trees of Exponential or Linear Average Order for Exact-Satisfiability.",
                    "Bisections of Free Monoids and a New Unavoidable Regularity.",
                    "Failures Semantics and Deadlocking of Modular Petri Nets.",
                    "A Decomposition Theorem for Finite-Valued Tranducers and an Application to the Equivalence Problem."
                ]
            }
        ]
    },
    {
        "year": "1986",
        "name": "12th MFCS 1986",
        "info": "Bratislava, Czechoslovakia",
        "venues": [
            {
                "sub_name_abbr": "conf/mfcs/1986",
                "sub_name": "Mathematical Foundations of Computer Science 1986, Bratislava, Czechoslovakia, August 25-29, 1996, Proceedings.",
                "count": 62,
                "papers": [
                    "Why Sometimes Probabilistic Algorithms Can Be More Effective.",
                    "Recent Results in the Theory of Rational Sets.",
                    "Partial Interpretations of Higher Order Algebraic Types (Extended Abstract).",
                    "Kins of Context-Free Languages.",
                    "Algebraic Theory of Module Specification with Constraints.",
                    "A Semantical Model for Integration and Modularization of Rules.",
                    "Parallel Arithmetic Computations: A Survey.",
                    "An Approach to Proof Checker.",
                    "The Promise of Electronic Prototyping.",
                    "Systolic Arrays: Characterizations and Complexity.",
                    "Geometric Location Problems and Their Complexity.",
                    "Developing Implicit Data Structures.",
                    "Higher-Order Arrays and Stacks in Programming. An Application of Complexity Theory to Logics of Programs.",
                    "Deterministic Simulation of Idealized Parallel Computers on More Realistic Ones.",
                    "Relational Specifications and Observational Semantics.",
                    "Efficient Testing of Optimal Time Adders (Extended Abstract).",
                    "Properties of Complexity Measures for PRAMs and WRAMs.",
                    "Iterative Systems of Equations.",
                    "Polynomial Complexity of the Newton-Puiseux Algorithm.",
                    "Unique Deciperability for Partially Commutative Alphabet (Extended Abstract).",
                    "The Equivalence of Finite Valued Transducers (on HDTOL Languages) is Decidable.",
                    "A Fast Parallel Algorithm for Six-Colouring of Planar Graphs (Extended Abstract).",
                    "Quicksort Without a Stack.",
                    "Towards an Efficient Merging.",
                    "Homomorphic Realizations of Automata with Compositions.",
                    "Refined Bounds on the Complexity of Sorting and Selection in D-Dimensional Space.",
                    "On the Inherent Combinatorial Complexity of Geometric Problems in D-Dimensional Space.",
                    "The Evolution of Two Stacks in Bounded Space and Random Walks in a Triangle.",
                    "P-Genericity and Strong G-Genericity.",
                    "Fibonacci Numeration Systems and Rational Functions.",
                    "Safe Implementation Equivalence for Asynchronous Nondeterministic Processes.",
                    "Grammars with Context Dependency Restricted to Synchronization.",
                    "Some Improved Parallelisms for Graphs.",
                    "A Complete Inference System for an Algebra or Regular Acceptance Models.",
                    "Nondeterministic Turing Machines with Modified Acceptance.",
                    "Remark on the Power of Compass (Extended Abstract).",
                    "Regular Chain Code Picture Languages of Nonlinear Descriptional Complexity.",
                    "An Analysis of the Nonemptiness Problem for Classes of Reversal-Bounded Multicounter Machines.",
                    "A New Approach to Defining the Complexity for VLSI.",
                    "Lower Bounds on the Complexity of Local Circuits (Preliminary Report).",
                    "Optimal Sorting of Seven Element Sets.",
                    "Undecidable Problems Concerning Generalized Pascal Triangles of Commutative Algebras.",
                    "Regular Augmentation of Automata and Transducers (Extended Abstract).",
                    "On Some Types of Pseudo-Random Sequences.",
                    "The Space Complexity of the Accessibility Problem for Undirected Graphs of Log N Bounded Genus.",
                    "An Alternative, Priority-Free, Solution to Post's Problem.",
                    "Near Optimal Algorithms for Finding Minimum Steiner Trees on Random Graphs.",
                    "Matrix Systems and Principal Cones of Algebraic Power Series.",
                    "Two Characterizations of the Logarithmic Alternation Hierarchy.",
                    "p-Projection Reducibility and the Complexity Classes L(nonuniform) and NL(nonuniform).",
                    "A Proof System to Derive Evantually Properties Under Justice Hypothesis.",
                    "AL-Khowarizmi: A Formal System for Higher-Order Logic Programming.",
                    "One-Sided Dyck Reduction Over Two Letter Alphabet and Deterministic Context-Free Languages.",
                    "Model and Complexity of Termination for Distributed Computations.",
                    "Complexity of Generalized Graph Coloring.",
                    "The Parallel Complexity of Deadlock Detection.",
                    "The Centers of Context-Sensitive Languages.",
                    "A Greedy Algorithm for Constructing Shortest Common Superstrings.",
                    "The OI-Hierarchy is Closed under Control.",
                    "On the Degree of Ambiguity of Finite Automata.",
                    "Learning in Knowledge Based System, a Possibilistic Approach.",
                    "Proofs that Release Minimum Knowledge."
                ]
            }
        ]
    },
    {
        "year": "1984",
        "name": "11th MFCS 1984",
        "info": "Praha, Czechoslovakia",
        "venues": [
            {
                "sub_name_abbr": "conf/mfcs/1984",
                "sub_name": "Mathematical Foundations of Computer Science 1984, Praha, Czechoslovakia, September 3-7, 1984, Proceedings.",
                "count": 57,
                "papers": [
                    "Separating, Strongly Separating, and Collapsing Relativized Complexity Classes.",
                    "Complexity of Quantifier Elimination in the Theory of Algebraically Closed Fields.",
                    "Systolic Automata - Power, Characterizations, Nonhomogeneity.",
                    "A Note on Unique Decipherability.",
                    "Outline of an Algebraic Language Theory.",
                    "Thue Systems and the Church-Rosser Property.",
                    "Limits, Higher Type Computability and Type-Free Languages.",
                    "Traces, Histories, Graphs: Instances of a Process Monoid.",
                    "Recent Results on Automata and Infinite Words.",
                    "VLSI Algorithms and Architectures.",
                    "Decidability of Monadic Theories.",
                    "On the Ehrenfeucht Conjecture on Test Sets and Its Dual Version.",
                    "Sparse Oracles, Lowness, and Highness.",
                    "Computability of Probabilistic Parameters for Some Classes of Formal Languages.",
                    "A Truely Morphic Characterization of Recursively Enumerable Sets.",
                    "On the Herbrand Kleene Universe for Nondeterministic Computations.",
                    "An Investigation of Controls for Concurrent Systems by Abstract Control Languages.",
                    "On Generalized Words of Thue-Morse.",
                    "Nondeterminism Is Essential for Two-Way Counter Machines.",
                    "Weak and Strong Fairness in CCS.",
                    "On the Complexity of Inductive Inference (Preliminary Report).",
                    "Monotone Edge Sequences in Line Arrangements and Applications (Extended Abstract).",
                    "Many-Sorted Temporal Logic for Multi-Processes Systems.",
                    "Process Logics: Two Decidability Results.",
                    "On Searching of Special Cases of Mazes and Finite Embedded Graphs.",
                    "The Power of the Future Perfect in Program Logics.",
                    "Hierarchy of Reversal and Zerotesting Bounded Multicounter Machines.",
                    "On the Power of Alternation in Finite Automata.",
                    "The Equivalence Problem and Correctness Formulas for a Simple Class of Programs (Extended Abstract).",
                    "Lower Bounds for Polygon Simplicity Testing and Other Problems.",
                    "A Uniform Independence of Invariant Sentences.",
                    "On the Equivalence of Compositions of Morphisms and Inverse Morphisms on Regular Languages.",
                    "Some Connections between Representability of Complexity Classes and the Power of Formal Systems of Reasoning.",
                    "Finding a Maximum Flow in /S, T/-Planar Network in Linear Expected Time.",
                    "Nondeterministic Logspace Reductions.",
                    "Factoring Multivariate Polynomials over Algebraic Number Fields.",
                    "Gödel Numberings, Principal Morphisms, Combinatory Algebras: A Category-theoretic Characterization of Functional Completeness.",
                    "Representations lf Integers and Language Theory.",
                    "New Lower Bound for Polyhedral Membership Problem with an Application to Linear Programming.",
                    "Decidability of the Equivalence Problem for Synchronous Deterministic Pushdown Automata.",
                    "Models and Operators for Nondeterministic Processes.",
                    "Algorithms for String Editing which Permit Arbitrarily Complex Editing Constraints.",
                    "The Structure of Polynomial Complexity Cores (Extended Abstract).",
                    "Solving Visibility Problems by Using Skeleton Structures.",
                    "Another Look at Parameterization Using Algebras with Subsorts.",
                    "A Lower Bound on Complexity of Branching Programs (Extended Abstract).",
                    "From Dynamic Algebras to Test Algebras.",
                    "Combinatorial Games with Exponential Space Complete Decision Problems.",
                    "Fast Recognition of Pushdown Automaton and Context-Free Languages.",
                    "Multiprocessor Systems and Their Concurrency.",
                    "Free Constructions in Algebraic Institutions.",
                    "Remarks on Comparing Expressive Power of Logics of Programs.",
                    "The Complexity of Problems Concerning Graphs with Regularities (Extended Abstract).",
                    "On the Complexity of Slice Functions.",
                    "An Exponential Lower Bound for One-Time-Only Branching Programs.",
                    "A Topological View of Some Problems in Complexity Theory.",
                    "Propositional Dynamic Logic with Strong Loop Predicate."
                ]
            }
        ]
    },
    {
        "year": "1981",
        "name": "10th MFCS 1981",
        "info": "Strbske Pleso, Czechoslovakia",
        "venues": [
            {
                "sub_name_abbr": "conf/mfcs/1981",
                "sub_name": "Mathematical Foundations of Computer Science 1981, Strbske Pleso, Czechoslovakia, August 31 - September 4, 1981, Proceedings.",
                "count": 57,
                "papers": [
                    "The Complexity of Manipulating Hierarchically Defined Sets of Rectangles.",
                    "The Transformational Machine: Theme and Variations.",
                    "Probabilistic Two-Way Machines.",
                    "A Survey of Some Recent Results on Computational Complexity in Weak Theories of Arithmetic.",
                    "A Survey on Oracle Techniques.",
                    "Time and Space Bounded Complexity Classes and Bandwidth Constrained Problems (A Survey).",
                    "Representations of Graphs by Means of Products and Their Complexity.",
                    "Parsing Strategies: A Concise Survey (Preliminary Report).",
                    "The Art of Dynamizing.",
                    "Fast Parallel Computation of Polynomials Using Few Processes.",
                    "Generalizations of Petri Nets.",
                    "Partial Match Retrieval in Implicit Data Structures.",
                    "A Characterization of Floyd-Provable Programs.",
                    "Semantics of CSP via Translation into CCS.",
                    "More about the \"Geography\" of Context-Free Languages.",
                    "On the Power of Algebraic Specifications.",
                    "An Application of the Theory of Free Partially Commutative Monoids: Asymptotic Densities of Trace Languages.",
                    "On the Complexity of Word Problems in Certain Thue Systems (Preliminary Report).",
                    "On the Tranformation of Derivation Graphs to Derivation Trees (Preliminary Report).",
                    "Pushdown Automata with Restricted Use of Storage Symbols.",
                    "Structured Nets.",
                    "Retraceability, Repleteness and Busy Beaver Sets.",
                    "Combining T and level-N.",
                    "On Realization and Implementation.",
                    "Multiplicative Complexity of a Bilinear Form over a Commutative Ring.",
                    "Making Dynamic Logic First-Order.",
                    "Partial Interpretations of Program Schemata.",
                    "Closure Properties of the Family of Languages Recognized by One-Way Two-Head Deterministic Finite State Automata.",
                    "Another Hierarchy Defined by Multihead Finite Automata.",
                    "An Extension of Rabin's Complete Proof Concept.",
                    "How to Find Invariants for Coloured Petri Nets.",
                    "Relationships between Probabilistic and Deterministic Tape Complexity.",
                    "Grammatical Levels of the Position Restricted Grammars.",
                    "A General Framework for Comparing Sequential and Parallel Rewriting.",
                    "A Bin Packing Algorithm with Complexity O(n log n) and Performance 1 in the Stochastic Limit.",
                    "Codings of Nonnegative Integers.",
                    "The Maximum k-Flow in a Network.",
                    "On the Constructive Description of Graph Languages Accepted by Finite Automata.",
                    "Weighted Multidimensional B-trees Used as Nearly Optimal Dynamic Dictionaries.",
                    "Maximum Flow in Planar Networks.",
                    "Probabilistic Combinatorial Optimization.",
                    "Time-Processor Trade-offs for Universal Parallel Computers.",
                    "Negative Results on the Size of Deterministic Right Parsers.",
                    "Key-Equivalence of Functional Dependency Statements Systems.",
                    "On Representations of Dynamic Algebras with Reversion.",
                    "A Framework for Studying Grammars.",
                    "On Existence of Complete Predicate Calculus in Metamathematics without Exponentiation.",
                    "On Structural Similarity of Context-Free Grammars.",
                    "Axioms for the Term-Wise Correctness of Programs.",
                    "Complexity and Entropy.",
                    "Axiomatic Semantics of Indirect Addressing.",
                    "Testing of Join Dependency Preserving by a Modified Chase Method.",
                    "A Starvation-Free Solution of the Dining Philosopher's Problem by Use of Interaction Systems.",
                    "Admissible Representations of Effective CPO's.",
                    "Preserving Total Order in Constant Expected Time.",
                    "Constructive Category Theory (No. 1).",
                    "Two Pebbles Don't Suffice."
                ]
            }
        ]
    },
    {
        "year": "1980",
        "name": "9th MFCS 1980",
        "info": "Rydzyna, Poland",
        "venues": [
            {
                "sub_name_abbr": "conf/mfcs/1980",
                "sub_name": "Mathematical Foundations of Computer Science 1980 (MFCS'80), Proceedings of the 9th Symposium, Rydzyna, Poland, September 1-5, 1980.",
                "count": 53,
                "papers": [
                    "Formal Description of Programming Concepts: A Software Engineering Viewpoint.",
                    "Electronic Category Theory.",
                    "Substitution Systems - A Family of System Models Based on Concurrency.",
                    "An Eassay about Research on Sparse NP Complete Sets.",
                    "Some Theoretical Aspects of Applicative Multiprocessing.",
                    "On Some Discrete Optimization Problems in Mass Storage Systems.",
                    "Abstract Data Types: A Retrospective and Prospective View.",
                    "Controlling Behaviours of Systems: Some Basic Concepts and some Applications.",
                    "Conceptual Relations between Databases Transformed under Join and Projection.",
                    "The Weighted Sperner's Set Problem.",
                    "Proof of a Concurrent Program Finding Euler Paths.",
                    "A Theoretical Basis for the Systematic Proof Method.",
                    "Consistent Semantics for a Data Flow Language.",
                    "Analog Processes.",
                    "An Extended Polymorphic Type System for Applicative Languages.",
                    "A Criterion of Undecidability of Algorithmic Theories.",
                    "On Finding the Optimal Access Path to Resolve a Relational Data Base Query.",
                    "Compound Algebraic Implementations: An Approach to Stepwise Refinement of Software Systems.",
                    "on And/Or Schemes.",
                    "A Term Model for CCS.",
                    "A Mathematical Approach to Multi-Pass Parsing.",
                    "Abstract Implementation of Abstract Data Types.",
                    "Parallel Algorithms in Graph Theory: Planarity Testing (preliminary version).",
                    "On Atomic Nets and Concurrency Relations.",
                    "Node-Label Controllel Graph Grammars.",
                    "A Method to Compare the Descriptive Power of Different Types of Petri Nets.",
                    "A Simple Class of Algorithmic Specifications for Abstract Software Modules.",
                    "Inducing Patterns of Behaviour in Distributed System Parts.",
                    "Van Wijngaarden Grammars as a Special Information Processing Model.",
                    "Approaches to Concurrency in B-Trees.",
                    "On a Subclass of Pseudopolynomial Problems.",
                    "Decidability of Reachability in Persistent Vector Replacement Systems.",
                    "Generalized Heapsort.",
                    "Decidability Results on a Query Language for Data Bases with Incomplete Informations.",
                    "New Results on Completeness and Consistency of Abstract Data Types.",
                    "Asymptotic Complexity of Game-Searching Procedures.",
                    "Completeness in Classical Logic of Complex Algorithms.",
                    "Initially-Restricting Algebraic Theories.",
                    "Schemes for Nonsequential Processing Systems.",
                    "Dynamic Algebras which are not Kripke Structures.",
                    "Time and Space Bounds in Producing Certain Partial Orders.",
                    "Axioms of Algorithmic Logic Univocally Determine Semantics of Programs.",
                    "A Logical Approach to the Problem \"P=NP?\".",
                    "Verifying Concurrent System Specification in COSY.",
                    "Deadlocks and Livelocks in Transition Systems.",
                    "Descriptional Complexity of Concurrent Processes (preliminary version).",
                    "A Uniform Approach to Applicative and Imperative Features in Programming Languages.",
                    "A Resource Applocation Problem.",
                    "An O(n² log log log n) Expected Time Algorithm for the all Shortest Distance Problem.",
                    "Decision Complexity of Variants of Propositional Dynamic Logic.",
                    "Relativized Obliviousness.",
                    "Abstract Data Types as Lattices of Finitely Generated Models.",
                    "The LR(k) Parser."
                ]
            }
        ]
    },
    {
        "year": "1979",
        "name": "8th MFCS 1979",
        "info": "Olomouc, Czechoslovakia",
        "venues": [
            {
                "sub_name_abbr": "conf/mfcs/1979",
                "sub_name": "Mathematical Foundations of Computer Science 1979, Proceedings, 8th Symposium, Olomouc, Czechoslovakia, September 3-7, 1979.",
                "count": 57,
                "papers": [
                    "A Sound and Complete Proof System for Partial Program Correctness.",
                    "The Problem of Reachability and Verification of Programs.",
                    "Assertion Programming.",
                    "Complexity Classes of Formal Languages (Preliminary Report).",
                    "Fast Probabilistic Algorithms.",
                    "Relative Succinctness of Representations of Languages and Separation of Complexity Classes.",
                    "On Two Types of Loops.",
                    "Full Abstraction for a Simple Parallel Programming Language.",
                    "On Some Recent Developments in Cryptography and Their Applications to Computer Science.",
                    "Searching, Sorting and Information Theory.",
                    "LCF: A Way of Doing Proofs with a Machine.",
                    "Axioms or Algorithms.",
                    "Power from Power Series.",
                    "Computational Complexity of String and Graph Identification.",
                    "A Survey of Grammar and L Forms-1978.",
                    "A Theoretical Study of the Time Analysis of Programs.",
                    "Completeness Problems in Verification of Programs and Program Schemes.",
                    "Relationships between AFDL's and Cylinders.",
                    "Computable Data Types.",
                    "Program Equivalence and Provability.",
                    "Interactive L Systems with Almost Interactionless Behaviour.",
                    "On the Simplification of Constructions in Degrees of Unsolvability via Computational Complexity.",
                    "An Algebraic Extension of the Chomsky-Hierarchy.",
                    "Bounds on Computational Complexity and Approximability of Initial Segments of Recursive Sets.",
                    "On the Weighted Path Length of Binary Search Trees for Unknown Access Probabilities.",
                    "Computational Complexity of Approximation Algorithms for Combinatorial Problems.",
                    "A Reduct-and-Closure Algorithm for Graphs.",
                    "Small Universal Minsky Machines.",
                    "Parallel and Two-Way Recognizers of Directed Acyclic Graphs (Extended Abstract).",
                    "Fully Effective Solutions of Recursive Domain Equations.",
                    "A Note on Computational Complexity of a Statistical Deducibility Testing Procedure.",
                    "Context Free Normal Systems.",
                    "New Proofs for Jump DPDA's.",
                    "Synchronization and Maximality for Very Pure Subsemigroups of a Free Semigroup.",
                    "On the Sets of Minimal Indices of Partial Recursive Functions.",
                    "Some Remarks on Boolean Sums.",
                    "On the Propositional Algorithmic Logic.",
                    "Ch(k) Grammars: A Characterization of LL(k) Languages.",
                    "A Uniform Approach to Balanced Binary and Multiway Trees.",
                    "On the Generative Capacity of Some Classes of Grammars with Regulated Rewriting.",
                    "Validity Test for Floyd's Operator-Precedence Parsing Algorithms.",
                    "On the Languages of Bounded Petri Nets.",
                    "Dyck Language D2 Is Not Absolutely Parallel.",
                    "Fixed Points in the Power-Set Algebra of Infinite Trees (Abstract).",
                    "On Relaxation Rules in Algorithmic Logic.",
                    "L-Fuzzy Functorial Automata.",
                    "Schematics of Structural Parallel Programming and its Applications.",
                    "On Axiomatization of Deterministic Propositional Dynamic Logic.",
                    "Bounded Recursion and Complexity Classes.",
                    "Characterization of Rational and Algebraic Power Series.",
                    "A Crossing Measure for 2-Tape Turing Machines.",
                    "The Complexity of Lexicographic Sorting and Searching.",
                    "An Algebraic Approach to Concurrence.",
                    "On Multitape Automata.",
                    "A Turing Machine Oracle Hierarchy.",
                    "A Survey of Some Syntactic Results in the lambda-Calculus.",
                    "On Rational Expressions Representing Infinite Rational Trees: Application to the Structure of Flow Charts."
                ]
            }
        ]
    },
    {
        "year": "1978",
        "name": "7th MFCS 1978",
        "info": "Zakopane, Poland",
        "venues": [
            {
                "sub_name_abbr": "conf/mfcs/1978",
                "sub_name": "Mathematical Foundations of Computer Science 1978, Proceedings, 7th Symposium, Zakopane, Poland, September 4-8, 1978.",
                "count": 51,
                "papers": [
                    "The Connection between Modal Logic and Algorithmic Logic.",
                    "The Algebraic Semantics of Recursive Program Schemes.",
                    "Finding the Correctness Proof of a Concurrent Program.",
                    "An Algebra for Parallelism Based on Petri Nets.",
                    "Data Types as Functions.",
                    "Synthesis of Communicating Behaviour.",
                    "Programming Languages as Mathematical Objects.",
                    "Writing and Verifying Sequential Files Updating Programs.",
                    "On the Completeness of Query Languages for Relational Data Bases.",
                    "Mastering Contextsensitivity in Programming Languages.",
                    "Decision Problems Concerning Parallel Programming.",
                    "Attribute Grammars and Two-Level Grammars: A Unifying Approach.",
                    "Extensions and Implementations of Abstract Data Type Specifications.",
                    "Concurrency of Manipulations in Multidimensional Information Structures.",
                    "Deriving Structures from Structures.",
                    "Semantics of Nondeterminism, Concurrency and Communication (Extended Abstract).",
                    "Contribution to the Theory of Concurrency in Databases.",
                    "Facts in Place/Transition-Nets.",
                    "Loop Programs and Classes of Primitive Recursive Functions.",
                    "Dynamic Theories of Real and Complex Numbers.",
                    "Multiplicative Complexity of a Pair of Bilinear Forms and of the Polynomial Multiplication.",
                    "Some Applications of Algebraic Semantics.",
                    "Goal-Oriented Derivation of Logic Programs.",
                    "Transforming Recursive Equations to Algorithms.",
                    "Structural Invariants for Some Classes of Structured Programs.",
                    "Synthesis of Concurrent Schemes.",
                    "Fast Matrix Multiplication by Boolean RAM in Linear Storage.",
                    "Cycles of Partial Orders.",
                    "Complexity Measures Defined by Mazurkiewicz-Algorithms.",
                    "On Functional Grammars.",
                    "Analysis of a Universal Class of Hash Functions.",
                    "A Framework for Producing Deterministic Canonical Bottom-up Parsers.",
                    "Cooperating Grammar Systems.",
                    "Synchronized Petri Nets: A Model for the Description of Non-Autonomous Systems.",
                    "On Divergence and Halting Problems for Monadic Program Schemas.",
                    "Compression of Clustered Inverted Files.",
                    "The Completeness of Propositional Dynamic Logic.",
                    "Improving Memory Utilization in Transforming Recursive Programs (Extended Abstract).",
                    "On Two Subclasses of Real-Time Grammars.",
                    "On Information Storage and Retrieval Systems: An Algebraic Approach, Part I.",
                    "Probabilistic LCF.",
                    "On Algorithmic Theory of Stacks.",
                    "Analyzing Program Solutions of Coordination problems by CP-Nets.",
                    "Structural Properties of Petri Nets.",
                    "Ensuring Correctness by Arbitrary Postfixed-Points.",
                    "String-Matching in Real Time: Some Properties of the Data Structure.",
                    "Name Independence and Database Abstraction in the Relational Model.",
                    "Free Petri Net Languages.",
                    "Tranformations to Produce Certain Covering Grammars.",
                    "On the Computational Power of Extended Petri Nets.",
                    "Theory of Relations for Databases - A Tutorial Survey."
                ]
            }
        ]
    },
    {
        "year": "1977",
        "name": "6th MFCS 1977",
        "info": "Tatranska Lomnica, Czechoslovakia",
        "venues": [
            {
                "sub_name_abbr": "conf/mfcs/1977",
                "sub_name": "Mathematical Foundations of Computer Science 1977, 6th Symposium, Tatranska Lomnica, Czechoslovakia, September 5-9, 1977, Proceedings.",
                "count": 61,
                "papers": [
                    "On the Structure and Properties of NP-Complete Problems and Their Associated Optimization Problems.",
                    "A Comparative Review of Some Program Verification Methods.",
                    "Classification of the Context-Free Languages.",
                    "Finite Automaton from a Flowchart Scheme Point of View.",
                    "A New Type of Models of Computation.",
                    "Correctness of Mixed Computation in Algol-Like Programs.",
                    "Algebra and Logic in Theoretical Computer Science.",
                    "A Survey of Recent Problems and Results in Analytic Computational Complexity.",
                    "Tree-Structures for Set Manipulation Problems.",
                    "Applied Algorithmic Logic.",
                    "Improved Lower Bounds on the Number of Multiplications/Divisions Which Are Necessary to Evaluate Polynomials.",
                    "Frequency Algorithms and Computations.",
                    "Graph-Theoretic Arguments in Low-Level Complexity.",
                    "Properties of Complexity Classes: A Short Survey.",
                    "A Uniform Approach to Inductive Posets and Inductive Closure.",
                    "Generalized Probabilistic Grammars.",
                    "Classes of Structurally Isomorphic {NP}-Optimization Problems.",
                    "Pushdown-Automata and Families of Languages Generating Cylinders.",
                    "Semantics of Infinite Processes Using Generalized Trees.",
                    "Characterization of Recognizable Families by Means of Regular Languages.",
                    "An Algebraic Approach to Problem Solution and Problem Semantics.",
                    "Complexity and Minimality of Context-Free Grammars and Languages.",
                    "Comparison of the Active Visiting and the Crossing Complexities.",
                    "Arithmetical Complexity of Some Problems in Computer Science.",
                    "Formal Transformations and the Development of Programs.",
                    "Optimal RAS Programs for Arbitrarily Complex 0-1 Valued Functions.",
                    "The Expressive Power of Intensional Logic in the Semantics of Programming Languages.",
                    "On the Complexity of Equivalent Transformations in Programming Languages.",
                    "Schematology in a Multi-Language Optimizer.",
                    "Decidability (Undecidability) of Equivalence of Minsky Machines with Components Consisting of at Most Seven (Eight) Instructions.",
                    "A Top-Down No Backtrack Parsing of General Context-Free Languages.",
                    "A Probabilistic Restriction of Branching Plans.",
                    "Reducing Operators for Normed General Formal Systems.",
                    "Invariant Properties of Informational Bulks.",
                    "Two Decidability Results for Deterministic Pushdown Automata.",
                    "On the Logic of Incomplete Transformation.",
                    "Measures of Ambiguity in the Analysis of Complex Systems.",
                    "Two-Level Meta-Controlled Substitution Grammars.",
                    "A Calculus to Build Up Correct Programs.",
                    "Another Approach for Proving Program Correctness.",
                    "Cover Results and Normal Forms.",
                    "On a Deterministic Subclass of Context-Free Languages.",
                    "Exponential Optimization for the {LLP($k$)} Parsing Method.",
                    "The Medial Axis of a Simple Polygon.",
                    "Semantics and Proof Rules for Coroutine Hierarchies in Block-Structured Programming Languages.",
                    "Acceptors for Iteration Languages.",
                    "How Good Is the Adversary Lower Bound?",
                    "Total Correctness for Procedures.",
                    "A Model for Retrieval Systems and Some Mathematical Problems Behind.",
                    "Time and Tape Bounded Auxiliary Pushdown Automata.",
                    "A Fast Non-Commutative Algorithm for Matrix Multiplication.",
                    "Fixed-Points and Algebras with Infinitely Long Expressions, I.",
                    "On Languages, Accepted by Machines in the Category of Sets.",
                    "Real Time Computations with Restrictions on Tape Alphabet.",
                    "The Bodnarchuk Metric Space of Languages and the Topology of the Learning Space.",
                    "Complexity Hierarchies of Oracles.",
                    "Determining Processes by Violations.",
                    "The Influence of the Machine Model on the Time Complexity of Context-Free Language Recognition.",
                    "A Generalized Computability Thesis (Abstract).",
                    "Identification of Formal Languages.",
                    "Correctness of Recursive Flow Diagram Programs."
                ]
            }
        ]
    },
    {
        "year": "1976",
        "name": "5th MFCS 1976",
        "info": "Gdansk, Poland",
        "venues": [
            {
                "sub_name_abbr": "conf/mfcs/1976",
                "sub_name": "Mathematical Foundations of Computer Science 1976, 5th Symposium, Gdansk, Poland, September 6-10, 1976, Proceedings.",
                "count": 78,
                "papers": [
                    "Exercises in Denotational Semantics.",
                    "W-Automata and Their Languages.",
                    "On Semantic Issues in the Relational Model of Data.",
                    "The Effective Arrangement of Logical Systems.",
                    "Recursivity, Sequence Recursivity, Stack Recursivity and Semantics of Programs.",
                    "Descriptional Complexity (of Languages) - A Short Survey.",
                    "On the Branching Structure of Languages.",
                    "Observability Concepts in Abstract Data Type Specifications.",
                    "Algorithms and Real Numbers.",
                    "On Mappings of Machines.",
                    "Recent Results on L Systems.",
                    "Decision Problems for Multi-Tape Automata.",
                    "Recursive Program Schemas and Computable Functionals.",
                    "Some Fundamentals of Order-Algebraic Semantics.",
                    "On Attribute Grammars.",
                    "Formal Definition of Semantics of Generated Control Regimes.",
                    "Minimal While Programs.",
                    "On Specfic Features of Recognizable Families of Languages.",
                    "On the Termination of Simple Computer Programs.",
                    "Reduction of Petri-Nets.",
                    "On Behaviour of R-Fuzzy Automata.",
                    "Cannonizing Reducibility Method in the Theory of Program Schemata.",
                    "Strongly Connected G-S-M Mappings Preserving Conjugation.",
                    "Analysis of the Non-Context-Free Component of Formal Languages.",
                    "Programs, Computations and Temporal Features.",
                    "A Note on the Automatic Generation of Inductive Assertions.",
                    "On the Relationship between a Procedure and its Data.",
                    "On the Relativization of Deterministic and Nondeterministic Complexity Classes.",
                    "The Metric Properties on the Semigroups and the Languages.",
                    "A Lower Bound of ½n² on Linear Search Programs for the Knapsack Problem.",
                    "The Direct Product of Automata and Quasi-Automata.",
                    "An Axiomatic Approach to Information Structures.",
                    "Parallelism of Manipulations in Multidimensional Information Structures.",
                    "The Calculus of Facts.",
                    "On Strict Interpretations of Grammar Forms.",
                    "A Hierarchy of Context-Sensitive Languages.",
                    "On Consecutive Storage of Records.",
                    "A Remark on Equivalence of Mazurkiewicz's Finite-Control Algorithms over Nets.",
                    "Microprogram-Oriented Model of the Controlled Structure.",
                    "Relations between Programs with Different Storage Requirements.",
                    "An Algebraic Approach to Data Types, Program Verification, and Program Synthesis.",
                    "About Three Equations Classes of Languages Built Up By Shuffle Operations.",
                    "A Machine Independent Description of Complexity Classes, Definable by Nondeterministic as well as Determinsitic Turing Machines with Primitive Pecursove Tape or Time Bounds.",
                    "Schemes with Recursion on Higher Types.",
                    "Constructing Iterative Version of a System of Recursive Procedures.",
                    "A Method Using a Set-Theoretical Formalism to Describe the Semantics of Programming Languages.",
                    "The Cubic Search Method.",
                    "Vectors of Coroutines.",
                    "One-One Degrees of Turing Machines Decision Problems.",
                    "Multiplicity Functions on Omega-Automata.",
                    "Heuristic Representation of State-Space by Finite Automata.",
                    "Semigroup Characterizations of Some Language Varieties.",
                    "On Memory Requirements of Strassen's Algorithms.",
                    "Determinism in Concurrent Systems.",
                    "Generating Control Mechanisms by Restrictions.",
                    "On Diagnosis of Algorithmical Processes.",
                    "On Some Properties of Cyclic Automata and Their Extensions.",
                    "A Complete Axiomatic Characterization of Algorithmic Properties of Block-Structured Programs with Procedures.",
                    "Compiler Generation Using Denotational Semantics.",
                    "On Divergence Problems for Program Schemas.",
                    "On the Parsing of LL-Regular Grammars.",
                    "The Characteristic Polynomial of a Finite Automaton.",
                    "Error Detection Using Regular Languages.",
                    "On a Relationship Between Programs of Address Machines and Mazurkiewicz Algorithms.",
                    "Dijkstra's Predicate Transformer, Non-Determinism, Recursion and Termination.",
                    "Context-Free Programmed Grammars and ETOL Systems.",
                    "Context-Free Algebra: A Mathematical Device for Compiler Specifications.",
                    "On the Lower Bound for Minimum Comparison Selection.",
                    "Computational Processes Generated by Programs with Recursive Procedures and Block Structures.",
                    "An Algebraic Framework for the Study of the Syntactic Monoids Application to the Group Languages.",
                    "Degrees of Parallelism in Computations.",
                    "On Adaptability of a System of Programs.",
                    "A Mathematical Model of Parallel Information Processing.",
                    "Powerdomains.",
                    "On the Domain of Iteration in Iterative Algebraic Theories.",
                    "The Influence of the Data Presentation on the Computational POwer of Machines.",
                    "On Sequential Modelling of Non-Sequential Processes.",
                    "Equivalence and Optimization of Recursive Program Schemata."
                ]
            }
        ]
    },
    {
        "year": "1975",
        "name": "4th MFCS 1975",
        "info": "Mariánské Lázne, Czechoslovakia",
        "venues": [
            {
                "sub_name_abbr": "conf/mfcs/1975",
                "sub_name": "Mathematical Foundations of Computer Science 1975, 4th Symposium, Mariánské Lázne, Czechoslovakia, September 1-5, 1975, Proceedings.",
                "count": 59,
                "papers": [
                    "Construction of Complete Sample System for Correctness Testing.",
                    "Ten Years of Speedup.",
                    "On Logics of Discovery.",
                    "On Models of Protection in Operating Systems.",
                    "Parsing as a Subtask of Compiling.",
                    "Parallel Recursive Program Schemes.",
                    "On Some Problems Concerning Pawlak's Machines.",
                    "Formal Power Series and Growth Functions of Lindenmayer Systems.",
                    "On the Representability of Relations by Deterministic and Nondeterministic Multi-Tape Automata.",
                    "On Problems Solvable by Successive Trials.",
                    "Automate and Categories.",
                    "On Some Models of Computability of Boolean Functions.",
                    "Automata and Categories: Finiteness Contra Minimality.",
                    "Languages Over Free Groups.",
                    "On the Comparison of Notions of Approximation.",
                    "Non-Linear Speed-Up Theorem for Two Register Minsky Machines.",
                    "Systems of Open Paths in Petri Nets.",
                    "on the Largest Full Sub-AFL of the Full AFL of Context-Free Languages.",
                    "On Complexity of Nondeterministic Turing Machines Computations.",
                    "On Closure Properties of Context-Free Derivation Complexity Classes.",
                    "Control Structures in Single Block Programs.",
                    "Minimal Gödel Numbers and Their Identification in the Limit.",
                    "Isomorphic Representation of Automata.",
                    "Extended Simple Regular Expressions.",
                    "Conniver Programs by Logical Point of View.",
                    "On the Set of All Automata with the Same Monoid of Endomorphisms.",
                    "Nondterministically Recognizable Sets of Languages.",
                    "The Approximation Problem in Computational Statistics.",
                    "The Continuous Algebra of Monadic Languages.",
                    "On Sets of Complex-Programmed Numbers.",
                    "Decision Algorithms for Havel's Branching Automata.",
                    "Automata and Categories - Input Processes.",
                    "Formalization of Algorithmic Reasoning.",
                    "Proving Program Properties, Symbolic Evaluation and Logical Procedural Semantics.",
                    "A Contribution to Error Recovery.",
                    "On the Analysis and Synthesis Problems for Context-Free Expressions.",
                    "Monotone Switching Circuits and Boolean Matrix Product.",
                    "On Some Lattice-Theoretic Properties of Generable Languages.",
                    "On Some Formal Grammars Generating Dependency Trees.",
                    "Graph Walking Automata.",
                    "On Finding All Solutions of the Partitioning Problem.",
                    "Greibach Normal Form Complexity.",
                    "On Correctness and Essentiality of Some Ianov Schemas Equivalence Relations.",
                    "Polynomially Complete Problems in the Logic of Automated Discovery.",
                    "Relational definition of Computer Languages.",
                    "First-Order Reductions of Call-by-Name to Call-by-Value.",
                    "Local Disambiguating Transformation.",
                    "On Cardinal Sequential Outer Measures.",
                    "On Representation of Sequential and Parallel Functions.",
                    "The Theory of the Modified Post Algebras and Multidimensional Automata Structures.",
                    "An Algebraic Theory of Formal Languages.",
                    "On Polynomial Reducibility of Word Problem Under Embedding of Recursively Presented Groups in Finitely Presented Groups.",
                    "On the Synthesis of Automata with Several Initial States.",
                    "A Hierarchy of Regular Sequence Sets.",
                    "R-Fuzzy Grammars.",
                    "Characterization of Some Classes of Context-Free Languages in Terms of Complexity Classes.",
                    "Inductive Inference of Recursive Functions.",
                    "Proving Properties of Programs by Means of Predicate Logic.",
                    "A Generalization of Scott's Flow Diagrams."
                ]
            }
        ]
    },
    {
        "year": "1974",
        "name": "3rd MFCS 1974",
        "info": "Jadwisin near Warsaw, Poland",
        "venues": [
            {
                "sub_name_abbr": "conf/mfcs/1974",
                "sub_name": "Mathematical Foundations of Computer Science, 3rd Symposium at Jadwisin near Warsaw, Poland, June 17-22, 1974, Proceedings.",
                "count": 44,
                "papers": [
                    "Sequential Functions and Generalized Moore and Mealy Automata.",
                    "Mathematical Methods of the Theory of Stochastic Automata.",
                    "On the Quasi-Controllability of Automata.",
                    "Models for Analysis of Races in Sequential Networks.",
                    "Factorizations, Congruences, and the Decomposition of Automata and Systems.",
                    "On the Periodic Sum and Extensions of Finite Automata.",
                    "Finite Branching Automata: Automata Theory Motivated by Problem Solving.",
                    "On Configurations in Cellular Automata.",
                    "Finite Automata Acceptation of Infinite Sequences.",
                    "R-Fuzzy Automata with a Time-Variant Structure.",
                    "Functions Computable in the Limit by Probabilistic Machines.",
                    "Some Properties of Limit Recursive Functions.",
                    "On Some Approximation Problems of Continuous Computation.",
                    "Set-Theoretic Properties of Programs in Stored Program Computers.",
                    "Classification of Programs of a SPC.",
                    "The Algebraic Approach to the Theory of Computing Systems.",
                    "Continuous Simple Z-Machines, Z-Computable Functions and Sets of Functions of n Real Variables.",
                    "An Approach to Correctness Proofs of Semicoroutines.",
                    "Towards an Understanding of Complex Processes.",
                    "Simulation.",
                    "Concurrent Programs.",
                    "Ultralinear Expressions.",
                    "A Family of Algebraic Systems Related to the Theory of Equations on Free Monoids.",
                    "Stretching by Probabilistic Tree Automata and Santos Grammars.",
                    "Tow Down versus Bottom Up Syntax Analysis Revised.",
                    "Substring Languages.",
                    "Defining Languages by Mazurkiewicz Algorithms.",
                    "Complexity and Normal Forms of Contex-Free Languages.",
                    "The Axiomatization Problem of a Theory of Linear Languages.",
                    "A Lattice-Theoretical Approach to Problem-Solving.",
                    "On the Equivalence of Planar Grammars and Parallel Picture Processing Algorithms.",
                    "Combinatorial Aspects of Information Storage and Retrieval.",
                    "Modular Approach to the Logical Theory of Programs.",
                    "Proving Programs by Sets of Computations.",
                    "Bases of Paths in Correctness Proofs.",
                    "Algebraic Models I.",
                    "Structured Programmability of Iterative Algorithms.",
                    "On Equivalence of Programs.",
                    "Mathematical Model of Programs with Dynamic Allocation of Variables.",
                    "Mathematical Foundations of Motivation Languages and Synthesis Maps.",
                    "The Semantics of Semantic Equations.",
                    "omega+-Valued Algorithmic Logic as a Tool to Investigate Procedures.",
                    "Call-by-Value versus Call-by-Name: A proof-Theoretic Comparison.",
                    "Procedures, Formal Computations and Models."
                ]
            }
        ]
    },
    {
        "year": "1973",
        "name": "2nd MFCS 1973",
        "info": "Strbské Pleso, Czechoslovakia",
        "venues": [
            {
                "sub_name_abbr": "conf/mfcs/1973",
                "sub_name": "Mathematical Foundations of Computer Science: Proceedings of Symposium and Summer School, Strbské Pleso, High Tatras, Czechoslovakia, September 3-8, 1973.",
                "count": 50,
                "papers": [
                    "Towards a Theory of Inductive Inference (in Russian).",
                    "An Algebraic Approach to Programs and Their Computations.",
                    "Equivalences of Parallel Courses of Algorithmic Nets and Precedence Flow Diagrams.",
                    "On the Formal Definition of Assembly Languages.",
                    "Towards a Galois Theory of Algorithmic Problems.",
                    "Model Theoretical Methods in the Theory of Automata.",
                    "Substitution and (Semi-)AFL.",
                    "Descriptional Complexity of Context-Free Languages.",
                    "Some Logical Problems of Automated Research.",
                    "On the Problem of Finding Natural Computational Complexity Measures.",
                    "Computation and Deduction.",
                    "Operators on Families of Languages.",
                    "Constructions of Grammars for Formal Languages.",
                    "Mathematical Foundation of Information Retrieval.",
                    "Concepts of Net Theory.",
                    "L-Systems: A Device in Biologically Motivated Automata Theory.",
                    "Lower Bounds for the Product of Time and Space Requirements of Turing Machine Computations.",
                    "On the Sequential Relations of Time-Invariant Automata.",
                    "Towards a Formal Definition of the Control in Structured Programs.",
                    "Top-down Analysis of Programming Languages without Backtrack (in Russian).",
                    "Semiboolean Algebras of Submachines.",
                    "Equations of Formal Power Series over Non Commutative Semiring.",
                    "On Grammatical Complexity of Context-Free Languages (Extended Abstract).",
                    "On Changes of Input/Output Coding.",
                    "Combinatorial Problems III. Degrees of Combinatorial Problems of Computing Machines.",
                    "On Vector Languages.",
                    "The Process Complexity and the Understanding of Sequences.",
                    "Conditional Metric Completeness of Finite Sets of Automata: A Criterion and an Algorithm (in Russian).",
                    "Decision Problems for Multihead Finite Automata.",
                    "On the Connectivity of the Periodic Sum of Automata.",
                    "An Algebraic Model for Parallel Processes.",
                    "On Ianov Schemas with One Memory Location.",
                    "Computational Complexity Based on Expectation of the Time of Computation on Minsky Machines.",
                    "Some Sources of Primitive Constructs in Programming Languages.",
                    "An Algebraic Characterization of Stochastic Finite-State Automata and Their Behaviour Functions.",
                    "Characterization of Programs and Their Synthesis from a Formalized Theory.",
                    "Computational Optimality of a Dynamic Programming Method.",
                    "On the Complexity of Countable Functions (Abstract).",
                    "Tree Transformations via Finite Recursive Transition Machines.",
                    "On Endomorphism Semigroup of Nilpotent Automata.",
                    "Relational Structures and Dynamics of Certain Discrete Systems.",
                    "Operational and Mathematical Semantics for Recursive Polyadic Program Schemata.",
                    "Necessary Conditions for Containment of Principal (Semi-)AFL with Bounded Generators.",
                    "Construction and Properties of Context-Sensitive Grammars and Languages (in Russian).",
                    "On Some Measures on Free Semigroups Induced by Semiautomata.",
                    "Machines with Input and Output.",
                    "Some Results Concerning the Situation Calculus.",
                    "A Note on Improving Input Strings for Paging Machines.",
                    "Turing Machine Recognition.",
                    "On Families of Languages Defined by Time-Bounded Random Access Machines."
                ]
            }
        ]
    },
    {
        "year": "1972",
        "name": "1st MFCS 1972",
        "info": "Jablona near Warsaw, Poland",
        "venues": []
    }
]