[
    {
        "name": "MSCS",
        "year": "2021",
        "info": "2021: Volume 31",
        "count": 31,
        "papers": [
            "Preface to the MSCS Issue 31.1 (2021) Homotopy Type Theory and Univalent Foundations.",
            "Indexed type theories.",
            "Extensional constructive real analysis via locators.",
            "Injective types in univalent mathematics.",
            "Homotopy type-theoretic interpretations of constructive set theories.",
            "Computing with continuous objects: a uniform co-inductive approach.",
            "Strictifying and taming directed paths in Higher Dimensional Automata.",
            "On (co)products of partial combinatory algebras, with an application to pushouts of realizability toposes.",
            "Products and projective limits of continuous valuations on T0 spaces.",
            "Preface to special issue: LSFA 2017 and 2018.",
            "Quasi-Nelson algebras and fragments.",
            "Formalising nominal C-unification generalised with protected variables.",
            "A focused linear logical framework and its application to metatheory of object logics.",
            "Formalization of metatheory of the Lambda Calculus in constructive type theory using the Barendregt variable convention.",
            "Preface to the MSCS Issue 31.1 (2021) Homotopy Type Theory and Univalent Foundations - Part II.",
            "Modal descent.",
            "Model structure on the universe of all types in interval type theory.",
            "Syntax and models of Cartesian cubical type theory.",
            "An interpretation of dependent type theory in a model category of locally cartesian closed categories.",
            "Linear logic in normed cones: probabilistic coherence spaces and beyond.",
            "Metric monads.",
            "Causal inference via string diagram surgery: A diagrammatic approach to interventions and counterfactuals.",
            "Languages of higher-dimensional automata.",
            "Separating minimal valuations, point-continuous valuations, and continuous valuations.",
            "The geometry of Bayesian programming.",
            "Monotone recursive types and recursive data representations in Cedille.",
            "A special issue on categorical algebras and computation in celebration of John Power's 60th birthday, part I.",
            "Freely adjoining monoidal duals.",
            "Doctrines, modalities and comonads.",
            "Finitary monads on the category of posets.",
            "Coherence for bicategorical cartesian closed structure."
        ]
    },
    {
        "name": "MSCS",
        "year": "2020",
        "info": "2020: Volume 30",
        "count": 37,
        "papers": [
            "A representation of proper BC domains based on conjunctive sequent calculi.",
            "Noncommutative network models.",
            "Primitive recursion in the abstract.",
            "A channel-based perspective on conjugate priors.",
            "Monoidal-closed categories of tree automata.",
            "Modal dependent type theory and dependent right adjoints.",
            "Multisets, heaps, bags, families: What is a multiset?",
            "A cubical Squier's theorem.",
            "Computable analysis with applications to dynamic systems.",
            "Witness algebra and anyon braiding.",
            "SMT-based verification of data-aware processes: a model-theoretic approach.",
            "Open Petri nets.",
            "Denotational semantics for guarded dependent type theory.",
            "Encodings of Turing machines in linear logic.",
            "Cofree coalgebras and differential linear logic.",
            "Implicative algebras: a new foundation for realizability and forcing.",
            "Nilpotent types and fracture squares in homotopy type theory.",
            "Convenient antiderivatives for differential linear categories.",
            "Introduction to the special issue: Unification.",
            "Free Heyting algebra endomorphisms: Ruitenburg's Theorem and beyond.",
            "Extensions of unification modulo ACUI.",
            "Higher-order pattern generalization modulo equational theories.",
            "Bounded ACh unification.",
            "Computing knowledge in equational extensions of subterm convergent theories.",
            "Rewriting with generalized nominal unification.",
            "NAE-resolution: A new resolution refutation technique to prove not-all-equal unsatisfiability.",
            "Forward analysis for WSTS, part I: completions.",
            "Petri nets based on Lawvere theories.",
            "Jets and differential linear logic.",
            "Dynamic game semantics.",
            "From Kruskal's theorem to Friedman's gap condition.",
            "Preserving cardinals and weak forms of Zorn's lemma in realizability models.",
            "A unified approach to some non-Hausdorff topological properties.",
            "The nominal/FM Yoneda Lemma.",
            "A MALL geometry of interaction based on indexed linear logic.",
            "Quantifiers on languages and codensity monads.",
            "Back to the Coordinated Attack Problem."
        ]
    },
    {
        "name": "MSCS",
        "year": "2019",
        "info": "2019: Volume 29",
        "count": 53,
        "papers": [
            "Preface to special issue: ICTAC 2015.",
            "Converging from branching to linear metrics on Markov chains.",
            "Newton series, coinductively: a comparative study of composition.",
            "Quotienting the delay monad by weak bisimilarity.",
            "A resource aware semantics for a focused intuitionistic calculus.",
            "Reasoning about knowledge and messages in asynchronous multi-agent systems.",
            "Optimal enforcement of (timed) properties with uncontrollable events.",
            "On Banach spaces of sequences and free linear logic exponential modality.",
            "Integral categories and calculus categories.",
            "Nonflatness and totality.",
            "Semantics-based software watermarking by abstract interpretation.",
            "The quantum walk search algorithm: factors affecting efficiency.",
            "Realizability in ordered combinatory algebras with adjunction.",
            "Denotational semantics of recursive types in synthetic guarded domain theory.",
            "Automorphisms of types in certain type theories and representation of finite groups.",
            "Limits in categories of Vietoris coalgebras.",
            "A homotopy-theoretic model of function extensionality in the effective topos.",
            "Strategic port graph rewriting: an interactive modelling framework.",
            "The computational power of timed P systems with active membranes using promoters.",
            "Unique decomposition of homogeneous languages and application to isothetic regions.",
            "Preface.",
            "Proof nets for multiplicative cyclic linear logic and Lambek calculus.",
            "Syllogistic logic with \"Most\".",
            "A generalised quantifier theory of natural language in categorical compositional distributional semantics with bialgebras.",
            "Universal properties for universal types in bifibrational parametricity.",
            "A public announcement separation logic.",
            "Probabilistic logic over equations and domain restrictions.",
            "Characterizing polynomial Ramsey quantifiers.",
            "Equational properties of fixed-point operations in cartesian categories: An overview.",
            "Definability in the local structure of the ω-Turing degrees.",
            "Disintegration and Bayesian inversion via string diagrams.",
            "Domains of commutative C*-subalgebras.",
            "A special issue on structural proof theory, automated reasoning and computation in celebration of Dale Miller's 60th birthday.",
            "Expansion trees with cut.",
            "Deep inference and expansion trees for second-order multiplicative linear logic.",
            "Complexity of translations from resolution to sequent calculus.",
            "Inhabitation in simply typed lambda-calculus through a lambda-calculus for proof search.",
            "Implementing type theory in higher order constraint logic programming.",
            "Hybrid linear logic, revisited.",
            "On the unification of classical, intuitionistic and affine logics.",
            "Subexponentials in non-commutative linear logic.",
            "A semantics for nabla.",
            "Constructing weak simulations from linear implications for processes with private names.",
            "A case study in programming coinductive proofs: Howe's method.",
            "A general proof certification framework for modal logic.",
            "Abstract machines, optimal reduction, and streams.",
            "Identity types and weak factorization systems in Cauchy complete categories.",
            "Decidability of regular language genus computation.",
            "Singular value automata and approximate minimization.",
            "A deterministic rewrite system for the probabilistic λ-calculus.",
            "Categorical models of the differential λ-calculus.",
            "m-Algebraic lattices in formal concept analysis.",
            "The category of implicative algebras and realizability."
        ]
    },
    {
        "name": "MSCS",
        "year": "2018",
        "info": "2018: Volume 28",
        "count": 58,
        "papers": [
            "A quantum algorithm to approximate the linear structures of Boolean functions.",
            "The genus of regular languages.",
            "Realizability algebras III: some examples.",
            "A correspondence between maximal abelian sub-algebras and linear logic fragments.",
            "W-types in homotopy-type theory - CORRIGENDUM.",
            "A second note on the feasibility of generalized universal composability.",
            "Polygraphs of finite derivation type.",
            "On the expressiveness of π-calculus for encoding mobile ambients.",
            "Natural models of homotopy type theory.",
            "The algebra of recursive graph transformation language UnCAL: complete axiomatisation and iteration categorical semantics.",
            "Preface.",
            "Cellular automata over generalized Cayley graphs.",
            "Splitting and non-splitting in the difference hierarchy.",
            "Autostability spectra for decidable structures.",
            "The logic of the reverse mathematics zoo.",
            "Complexity for partial computable functions over computable Polish spaces.",
            "The universality of polynomial time Turing equivalence.",
            "Calibrating word problems of groups via the complexity of equivalence relations.",
            "Mackey-complete spaces and power series - a topological model of differential linear logic.",
            "A doctrinal approach to modal/temporal Heyting logic and non-determinism in processes.",
            "θ-continuity and D θ-completion of posets.",
            "Yoneda completeness.",
            "Coinductive predicates and final sequences in a fibration.",
            "Preface to special issue: LINEARITY 2014.",
            "Multi-focused cut elimination.",
            "Expressing additives using multiplicatives and subexponentials.",
            "Geometry of resource interaction and Taylor-Ehrhard-Regnier expansion: a minimalist approach.",
            "A linear/producer/consumer model of classical linear logic.",
            "An Isbell duality theorem for type refinement systems.",
            "Hoare Semigroups.",
            "Dynamic networks of heterogeneous timed machines.",
            "Brouwer's fixed-point theorem in real-cohesive homotopy type theory.",
            "Validating Brouwer's continuity principle for numbers using named exceptions.",
            "Preface.",
            "An introduction to differential linear logic: proof-nets, models and antiderivatives.",
            "Transport of finiteness structures and applications.",
            "The true concurrency of differential interaction nets.",
            "Order algebras: a quantitative model of interaction.",
            "Execution time of λ-terms via denotational semantics and intersection types.",
            "Jump from parallel to sequential proofs: exponentials.",
            "An explicit formula for the free exponential modality of linear logic.",
            "Foreword: special issue on term and graph rewriting.",
            "Recognizable languages of arrows and cospans.",
            "Interactive and automated proofs for graph transformations.",
            "Convergence in infinitary term graph rewriting systems is simple.",
            "Linear pattern matching of compressed terms and polynomial rewriting.",
            "Non-size increasing graph rewriting for natural language processing.",
            "Finding small counterexamples for abstract rewriting properties.",
            "Preface - Special Issue on Logical Frameworks and Meta-Languages 2015.",
            "Benchmarks for reasoning with syntax trees containing binders and contexts of assumptions.",
            "Proof-relevant π-calculus: a constructive account of concurrency and causality.",
            "Plugging-in proof development environments using Locks in LF.",
            "Mechanizing proofs with logical relations - Kripke-style.",
            "On geometry of interaction for polarized linear logic.",
            "Model structures on categories of models of type theories.",
            "The geometry of conservative programs.",
            "Essential and density topologies on s2-continuous posets.",
            "Paths, tree homomorphisms and disequalities for -clauses."
        ]
    },
    {
        "name": "MSCS",
        "year": "2017",
        "info": "2017: Volume 27",
        "count": 70,
        "papers": [
            "No-iteration mixed distributive laws.",
            "A time-free uniform solution to subset sum problem by tissue P systems with cell division.",
            "Linked data privacy.",
            "Equational axioms associated with finite automata for fixed point operations in cartesian categories.",
            "Cartesian differential categories revisited.",
            "Preface.",
            "Type safe incremental rebinding.",
            "Structure and properties of strong prefix codes of pictures.",
            "Fast circular dictionary-matching algorithm.",
            "Permutation classes and polyomino classes with excluded submatrices.",
            "A Gray code for cross-bifix-free sets.",
            "On lookahead equilibria in congestion games.",
            "On merging two trust-networks in one with bipolar preferences.",
            "Multi-level dynamo and opinion spreading.",
            "Representing prefix and border tables: results on enumeration.",
            "The longest common substring problem.",
            "Set-syllogistics meet combinatorics.",
            "Generalizations of the distributed Deutsch-Jozsa promise problem.",
            "A rewriting framework and logic for activities subject to regulations.",
            "Many-one reductions and the category of multivalued functions.",
            "Lambda theories allowing terms with a finite number of fixed points.",
            "Ordered combinatory algebras and realizability.",
            "Preface.",
            "On conditions for semirings to induce compact information algebras.",
            "Representation of algebraic domains by formal association rule systems.",
            "Characterising E-projectives via Comonads.",
            "Well-filtered spaces and their dcpo models.",
            "Lattice-valued Scott topology on dcpos.",
            "A completion-invariant extension of the concept of meet continuous lattices.",
            "A stable universal domain related to $\\mathbb{T}$ω.",
            "Computing with lambda-terms: A special issue dedicated to Corrado Böhm for his 90th birthday.",
            "The approximation theorem for the Λμ-calculus.",
            "Infinitary affine proofs.",
            "Isomorphism of intersection and union types.",
            "Essential and relational models.",
            "The parametric continuation monad.",
            "The infinitary lambda calculus of the infinite eta Böhm trees.",
            "Taming the wild ant-lion; a counterexample to a conjecture of Böhm.",
            "Redexes are stable in the λ-calculus.",
            "Coalgebraic analysis of subgame-perfect equilibria in infinite games without discounting.",
            "Classical lambda calculus in modern dress.",
            "Clocked lambda calculus.",
            "Computing with relational machines.",
            "Transcendental syntax I: deterministic case.",
            "Resource convertibility and ordered commutative monoids.",
            "The conservation theorem for differential nets.",
            "Constructive forcing, CPS translations and witness extraction in Interactive realizability.",
            "Isomorphism theorems between models of mixed choice.",
            "Classical realizability and arithmetical formulæ.",
            "Foreword: special issue on coalgebraic logic.",
            "Well-founded coalgebras, revisited.",
            "Practical coinduction.",
            "Quasivarieties and varieties of ordered algebras: regularity and exactness.",
            "Smooth coalgebra: testing vector analysis.",
            "Enhanced coalgebraic bisimulation.",
            "Bisimilarity is not Borel.",
            "Preface to the special issue: Continuity, computability, constructivity: from logic to algorithms 2013.",
            "On computability and disintegration.",
            "Computations with oracles that measure vanishing quantities.",
            "A realizability interpretation of Church's simple theory of types.",
            "Computation over algebraic structures and a classification of undecidable problems.",
            "A comparison of concepts from computable analysis and effective descriptive set theory.",
            "On the computational complexity of the Dirichlet Problem for Poisson's Equation.",
            "Computable elements and functions in effectively enumerable topological spaces.",
            "Effective Riemann mappings of multiply connected domains and Riemann surfaces.",
            "On naturally continuous non-dcpo domains.",
            "Towards a descriptive theory of cb0-spaces.",
            "Quantifying over events in probability logic: an introduction.",
            "Some results related to the continuity problem.",
            "Properties of domain representations of spaces through dyadic subbases."
        ]
    },
    {
        "name": "MSCS",
        "year": "2016",
        "info": "2016: Volume 26",
        "count": 44,
        "papers": [
            "Selected papers from Dependently Typed Programming 2010 - Overview.",
            "Modules over relative monads for syntax and semantics.",
            "Partiality and recursion in interactive theorem provers - an overview.",
            "Containers, monads and induction recursion.",
            "Vulnerability modelling with functional programming and dependent types.",
            "A light-weight integration of automated and interactive theorem proving.",
            "Preface to special issue: behavioural types.",
            "Global escape in multiparty sessions.",
            "Linearity, session types and the Pi calculus.",
            "Global progress for dynamically interleaved multiparty sessions.",
            "On asynchronous eventful session semantics.",
            "Preface to special issue: behavioural types.",
            "Linear logic propositions as session types.",
            "Fair subtyping for multi-party session types.",
            "An extensible approach to session polymorphism.",
            "Modelling session types using contracts.",
            "Observable interface behaviour and inheritance.",
            "Characterizing co-NL by a group action.",
            "Full abstraction for expressiveness: history, myths and facts.",
            "General conditions for full abstraction.",
            "Making abstract models complete.",
            "Local cycles and dynamical properties of Boolean networks.",
            "The undecidability theorem for the Horn-like fragment of linear logic (Revisited).",
            "Encoding hybridized institutions into first-order logic.",
            "Proof nets and semi-star-autonomous categories.",
            "On the reification of semantic linearity.",
            "Relating reasoning methodologies in linear logic and process algebra.",
            "Preface to special issue: EXPRESS 2010.",
            "Compositional methods for information-hiding.",
            "Expressiveness modulo bisimilarity of regular expressions with parallel composition.",
            "Light logics and higher-order processes.",
            "Relating timed and register automata.",
            "Models for CSP with availability information.",
            "Breaking symmetries.",
            "On quantum lambda calculi: a foundational perspective.",
            "Formalization of real analysis: a survey of proof assistants and libraries.",
            "A coalgebraic view on decorated traces.",
            "Specifying Peirce's law in classical realizability.",
            "Simply typed fixpoint calculus and collapsible pushdown automata.",
            "Preface to special issue: EXPRESS 2011.",
            "Information flow safety in multiparty sessions.",
            "Termination in a π-calculus with subtyping.",
            "On session types and polynomial time.",
            "Synchrony versus causality in distributed systems."
        ]
    },
    {
        "name": "MSCS",
        "year": "2015",
        "info": "2015: Volume 25",
        "count": 64,
        "papers": [
            "A short proof of the Schröder-Simpson Theorem.",
            "Kan injectivity in order-enriched categories.",
            "Inclusions for partiality.",
            "Embedding theorems for LTL and its variants.",
            "Retrenchment and refinement interworking: the tower theorems.",
            "Preface to the special issue on quantitative information flow.",
            "Quantification of integrity.",
            "A semiring-based trace semantics for processes with applications to information leakage analysis.",
            "Asymptotic information leakage under one-try attacks.",
            "Hidden-Markov program algebra with iteration.",
            "Quantifying opacity.",
            "Algebraic foundations for quantitative information flow.",
            "An analysis of trust in anonymity networks in the presence of adaptive attackers.",
            "Quantifying information flow in cryptographic systems.",
            "Preface: Special issue on objects and services.",
            "Abstract delta modelling.",
            "Security monitor inlining and certification for multithreaded Java.",
            "cJoin: Join with communicating transactions.",
            "Attribute-based transactions in service oriented computing.",
            "CaSPiS: a calculus of sessions, pipelines and services.",
            "Model checking usage policies.",
            "Preface.",
            "Bisimulation proof methods in a path-based specification language for polynomial coalgebras.",
            "JNI light: an operational model for the core JNI.",
            "Verification of tree-processing programs via higher-order mode checking.",
            "A certified implementation of ML with structural polymorphism and recursive types.",
            "Automatically inferring loop invariants via algorithmic learning.",
            "Context-preserving XQuery fusion.",
            "A liberal type system for functional logic programs.",
            "Concurrency cannot be observed, asynchronously.",
            "Introduction - from type theory and homotopy theory to univalent foundations.",
            "Univalent categories and the Rezk completion.",
            "Homotopy limits in type theory.",
            "A generalization of the Takeuti-Gandy interpretation.",
            "W-types in homotopy type theory.",
            "A dependently-typed construction of semi-simplicial types.",
            "A notion of homotopy for the effective topos.",
            "A univalent formalization of the p-adic numbers.",
            "Sets in homotopy type theory.",
            "Univalence for inverse diagrams and homotopy canonicity.",
            "An experimental library of formalized Mathematics based on the univalent foundations.",
            "Non-deterministic structures of computation.",
            "Sub-behaviour relations for session-based client/server systems.",
            "On recursive operations over logic LTS.",
            "Weak symmetry breaking and abstract simplex paths.",
            "Preface to the special issue: Computing with infinite data: topological and logical foundations.",
            "Generalized geometric theories and set-generated classes.",
            "An injection from the Baire space to natural numbers.",
            "Borel and Hausdorff hierarchies in topological spaces of Choquet games and their effectivization.",
            "Wadge hardness in Scott spaces and its effectivization.",
            "Multidimensional infinite data in the language Lucid.",
            "Variations on a theme by Ishihara.",
            "Constructive decidability of classical continuity.",
            "Kolmogorov complexity and the geometry of Brownian motion.",
            "Spatiality of countably presentable locales (proved with the Baire category theorem).",
            "Completeness and cocompleteness of the categories of basic pairs and concrete spaces.",
            "Comparing the Medvedev and Turing degrees of Π0 1 classes.",
            "Positive predicate structures for continuous data.",
            "Addendum to 'The Katětov construction modified for a T 0-quasi-metric space'.",
            "Program extraction in exact real arithmetic.",
            "Wadge-like reducibilities on arbitrary quasi-Polish spaces.",
            "A constructive interpretation of Ramsey's theorem via the product of selection functions.",
            "Effective metric model theory.",
            "Some hierarchies of QCB 0-spaces."
        ]
    },
    {
        "name": "MSCS",
        "year": "2014",
        "info": "2014: Volume 24",
        "count": 58,
        "papers": [
            "An operational domain-theoretic treatment of recursive types.",
            "Fixed points of contractive maps on dcpo's.",
            "Equivalence relations for modular performance evaluation in dtsPBC.",
            "A linear category of polynomial diagrams.",
            "Computability structures, simulations and realizability.",
            "Trace spaces of directed tori with rectangular holes.",
            "Higher-order psi-calculi.",
            "Event Identifier Logic.",
            "Property-oriented semantics of structured specifications.",
            "Constructing Gröbner bases for Noetherian rings.",
            "Preface to the special issue on developments of the concepts of randomness, statistics and probability.",
            "Kolmogorov on the role of randomness in probability theory.",
            "A quantum random number generator certified by value indefiniteness.",
            "Probability, statistics and computation in dynamical systems.",
            "Joint distributions, the uncertainty principle and positive distributions.",
            "Probability in quantum computation and quantum computational logics: a survey.",
            "Toward a probabilistic biology.",
            "Randomness in biology.",
            "On the concept of probability.",
            "Debate on the concept of probability, and conclusions to this special issue on developments of the concepts of randomness, statistics and probability.",
            "Shannon entropy: a rigorous notion at the crossroads between probability, information theory, dynamical systems and statistical physics.",
            "Foreword: special issue on structure transformation.",
            "Processes and unfoldings: concurrent computations in adhesive categories.",
            "Finitary ℳ-adhesive categories.",
            "RPO semantics for mobile ambients.",
            "Multi-amalgamation of rules with application conditions in ℳ-adhesive categories.",
            "ℳ-adhesive transformation systems with nested application conditions. Part 1: parallelism, concurrency and amalgamation.",
            "Combining termination proofs in model transformation systems.",
            "Formal analysis of model transformations based on triple graph grammars.",
            "Analysis of permutation equivalence in -adhesive transformation systems with negative application conditions.",
            "Introduction: special issue ICICTA 2012.",
            "A cooperative co-evolutionary particle swarm optimiser based on a niche sharing scheme for the flow shop scheduling problem under uncertainty.",
            "A hybrid WT-FBPNN optimisation algorithm to identify the investment risk of wind power projects.",
            "Adaptive control of a class of non-linear systems preceded by backlash-like hysteresis.",
            "An empirical comparison of sales time series for online and offline channels for commodities in China.",
            "Method of item recognition based on SIFT and SURF.",
            "Analysis of the Doppler frequency feature of aero deception active-passive-jamming.",
            "Bayesian theory based software reliability demonstration test method for safety critical software.",
            "Delay-dependent robust H ∞ control for neutral time-delay systems.",
            "Delay-dependent robust stability criteria for stochastic neural networks of neutral-type with interval time-varying delay and linear fractional uncertainties.",
            "The design of an IMC-PID controller based on MEOTF and its application to non-square processes with time delay.",
            "The GA-SA model and its application to predicting the potential of the solar power industry.",
            "H ∞ stabilisation of networked control systems with time delays and packet losses.",
            "Liveness and boundedness analysis of Petri net synthesis.",
            "Multi-objective comprehensive evaluation approach to a river health system based on fuzzy entropy.",
            "Optimal fuzzy PID controller design for an active magnetic bearing system based on adaptive genetic algorithms.",
            "Optimised assignment of airport gate configurations using an immune genetic algorithm.",
            "Research on digital predistortion based on adaptive algorithms.",
            "Robust attitude tracking control scheme for a multi-body spacecraft using a radial basis function network and terminal sliding mode.",
            "Robust optimisation of the spring actuator in a vacuum circuit breaker.",
            "Robust stability analysis of a class of uncertain neutral T-S fuzzy systems with time delay.",
            "Dynamic analysis and numerical simulation of a discrete model of a bistable system.",
            "Interactive Realizability for second-order Heyting arithmetic with EM1 and SK1.",
            "Database queries and constraints via lifting problems.",
            "Realizability interpretation of PA by iterated limiting PCA.",
            "Theories of analytic monads.",
            "Rigidity is undecidable.",
            "The biequivalence of locally cartesian closed categories and Martin-Löf type theories."
        ]
    },
    {
        "name": "MSCS",
        "year": "2013",
        "info": "2013: Volume 23",
        "count": 40,
        "papers": [
            "A step-indexed Kripke model of hidden state.",
            "A categorical analogue of the monoid semiring construction.",
            "A spectral order for infinite-dimensional quantum spaces.",
            "Local fibred right adjoints are polynomial.",
            "Generalised powerlocales via relation lifting.",
            "Preface to special issue: Developments In Computational Models 2010.",
            "The monoidal structure of Turing machines.",
            "Two-domain DNA strand displacement.",
            "Constraining rule-based dynamics with types.",
            "Equilibrium and termination II: the case of Petri nets.",
            "Open-graphs and monoidal theories.",
            "Extended phase map decompositions for unitaries.",
            "Quantum algorithms for testing and learning Boolean functions.",
            "A formalism-local framework for general probabilistic theories, including quantum theory.",
            "Topological features of good resources for measurement-based quantum computation.",
            "Comparing the globalness of bipartite unitary operations: delocalisation power, entanglement cost and entangling power.",
            "Multi-level modelling via stochastic multi-level multiset rewriting.",
            "A typed, algebraic, computational lambda-calculus.",
            "A new description of orthogonal bases.",
            "Ticket Entailment is decidable.",
            "Quantum attacks on pseudorandom generators.",
            "The algebra of multirelations.",
            "Preface to special issue: lightweight and practical formal methods in the design and analysis of safety-critical systems.",
            "Can we build it: formal synthesis of control strategies for cooperative driver assistance systems.",
            "A formal approach to collaborative modelling and co-simulation for embedded systems.",
            "Model checking for performability.",
            "Employing UML and OCL for designing and analysing role-based access control.",
            "A modular formal semantics for Ptolemy.",
            "Rigorous implementation of real-time systems - from theory to application.",
            "Applications and extensions of Alloy: past, present and future.",
            "Postlude: seamless composition and integration - a perspective on formal methods research.",
            "A logical framework combining model and proof theory.",
            "Imaginary groups: lazy monoids and reversible computation.",
            "A certified lightweight non-interference Java bytecode verifier.",
            "Regular functors and relative realisability categories.",
            "Monadic translation of classical sequent calculus.",
            "Deriving session and union types for objects.",
            "Generation and sudden death of entanglement in qubit-qutrit systems with depolarising noise.",
            "Krivine's classical realisability from a categorical perspective.",
            "On the computability of a construction of Brownian motion."
        ]
    },
    {
        "name": "MSCS",
        "year": "2012",
        "info": "2012: Volume 22",
        "count": 35,
        "papers": [
            "Interpolation for predefined types.",
            "Lenses, fibrations and universal translations.",
            "Bisimulations for non-deterministic labelled Markov processes.",
            "Relative formal topology: the binary positivity predicate comes first.",
            "Constructing a small category of setoids.",
            "Preface to special issue: EXPRESS, ICE and SOS 2009.",
            "Characteristic formulae for fixed-point semantics: a general framework.",
            "Modal logic and the approximation induction principle.",
            "Almost linear Büchi automata.",
            "On projecting processes into session types.",
            "Proving the validity of equations in GSOS languages using rule-matching bisimilarity.",
            "A hierarchy of reverse bisimulations on stable configuration structures.",
            "The small-community phenomenon in networks.",
            "A coding theoretic study of MLL proof nets.",
            "What is a categorical model of the differential and the resource λ-calculi?",
            "Spatial quantum search in a triangular network.",
            "Formalising PFSQL queries using ŁΠ fuzzy logic.",
            "On quasi-interpretations, blind abstractions and implicit complexity.",
            "Extending modal transition systems with structured labels.",
            "A quantum double construction in Rel.",
            "Static analysis of Biological Regulatory Networks dynamics using abstract interpretation.",
            "Extending relational algebra with similarities.",
            "A duality between exceptions and states.",
            "Introduction: computability of the physical.",
            "Renormalisation and computation II: time cut-off and the Halting Problem.",
            "A statistical mechanical interpretation of algorithmic information theory III: composite systems and fixed points.",
            "Algorithmic thermodynamics.",
            "Adversarial scheduling in discrete models of social dynamics.",
            "Toward a fundamental theorem of quantal measure theory.",
            "The impact of models of a physical oracle on computational power.",
            "Incomputability in Physics and Biology.",
            "Preface to the special issue: commutativity of algebraic diagrams.",
            "Shuffles and concatenations in the construction of graphs.",
            "Coherence in monoidal track categories.",
            "Properties of co-operations: diagrammatic proofs."
        ]
    },
    {
        "name": "MSCS",
        "year": "2011",
        "info": "2011: Volume 21",
        "count": 40,
        "papers": [
            "Non-uniform (hyper/multi)coherence spaces.",
            "The formal ball model for -categories.",
            "The structure of first-order causality.",
            "Noetherian orders.",
            "Stably compact spaces.",
            "Foreword: special issue on coalgebraic logic.",
            "Coalgebraic logic over general measurable spaces - a survey.",
            "Modular algorithms for heterogeneous modal logics via multi-sorted coalgebra.",
            "Traces for coalgebraic components.",
            "Pointwise extensions of GSOS-defined operations.",
            "Equational presentations of functors and monads.",
            "On monotone modalities and adjointness.",
            "Elgot theories: a new perspective on the equational properties of iteration.",
            "Initial algebras and terminal coalgebras in many-sorted sets.",
            "Choquet-Kendall-Matheron theorems for non-Hausdorff spaces.",
            "A system of interaction and structure V: the exponentials and splitting.",
            "The representational adequacy of Hybrid.",
            "Domains occur among spaces as strict algebras among lax.",
            "Preface.",
            "Zen and the art of formalisation.",
            "Formal proofs for theoretical properties of Newton's method.",
            "A formal proof of Pick's Theorem.",
            "A formal study of Bernstein coefficients and polynomials.",
            "Formalising Overlap Algebras in Matita.",
            "Type classes for mathematics in type theory.",
            "CoLoR: a Coq library on well-founded rewrite relations and its application to the automated verification of termination certificates.",
            "Classical mathematics for a constructive world.",
            "Formalising foundations of mathematics.",
            "A pluralist approach to the formalisation of mathematics.",
            "The λ-calculus in the π-calculus.",
            "Two-level nominal sets and semantic nominal terms: an extension of nominal set theory for handling meta-variables.",
            "Dagger extension theorem.",
            "Final coalgebras in accessible categories.",
            "Foreword: programming language interference and dependence.",
            "Non-disclosure for distributed mobile code.",
            "Non-termination and secure information flow.",
            "Secure information flow by self-composition.",
            "Modelling declassification policies using abstract domain completeness.",
            "Provenance as dependency analysis.",
            "On the computational complexity of dynamic slicing problems for program schemas."
        ]
    },
    {
        "name": "MSCS",
        "year": "2010",
        "info": "2010: Volume 20",
        "count": 47,
        "papers": [
            "Preface to special issue: Expressiveness in Concurrency 2008.",
            "Channel abstractions for network security.",
            "Turing universality of the Biochemical Ground Form.",
            "Modal and mixed specifications: key decision problems and their complexities.",
            "Preface for the special issue on domains.",
            "Domain representations of spaces of compact subsets.",
            "Selection functions, bar recursion and backward induction.",
            "De Groot duality and models of choice: angels, demons and nature.",
            "Some reasons for generalising domain theory.",
            "The limit-colimit coincidence theorem for -categories.",
            "On universal algebra over nominal sets.",
            "Tree-functors, determinacy and bisimulations.",
            "Bitopological duality for distributive lattices and Heyting algebras.",
            "On the operating unit size of load/store architectures.",
            "Iterative reflections of monads.",
            "Domain theoretic characterisations of quasi-metric completeness in terms of formal balls.",
            "Towards a typed Geometry of Interaction.",
            "Coherence for monoidal endofunctors.",
            "Coherence for monoidal monads and comonads.",
            "Setoids and universes.",
            "Rewriting systems for the surface classification theorem.",
            "Long-run cost analysis by approximation of linear operators over dioids.",
            "A solution of the uniform word problem for ortholattices.",
            "Diagrammatic logic applied to a parameterisation process.",
            "Realisability semantics of parametric polymorphism, general references and recursive types.",
            "Preface to Special Issue: Theory and Applications of Models of Computation (TAMC 2008-2009).",
            "Quantitative aspects of speed-up and gap phenomena.",
            "Semantical proofs of correctness for programs performing non-deterministic tests on real numbers.",
            "Bounded minimalisation and bounded counting in argument-bounded idc's.",
            "Weak bisimulations for the Giry monad.",
            "Diamond embeddings into the enumeration degrees.",
            "Tilings: simulation and universality.",
            "A practical parameterised algorithm for the individual haplotyping problem MLF.",
            "Axiomatic semantics of projection temporal logic programs.",
            "Connection between logical and algebraic approaches to concurrent systems.",
            "The computational SLR: a logic for reasoning about computational indistinguishability.",
            "A separation between divergence and Holevo information for ensembles.",
            "Introduction to special issue: Physics and computer science - quantum computation and other approaches.",
            "Spatial search on a honeycomb network.",
            "A note on accelerated Turing machines.",
            "Limits to measurement in experiments governed by algorithms.",
            "Observing the superposition of a single particle with the vacuum.",
            "The Travelling Salesman Problem for finite-sized cities.",
            "Continuous-time quantum walks on the threshold network model.",
            "Quantum walks and elliptic integrals.",
            "On the von Neumann entropy of certain quantum walks subject to decoherence.",
            "Quantum algorithmic methods for computational geometry."
        ]
    },
    {
        "name": "MSCS",
        "year": "2009",
        "info": "2009: Volume 19",
        "count": 45,
        "papers": [
            "Editors' note: bibliometrics and the curators of orthodoxy.",
            "Preface to Special Issue: Theory and Applications of Models of Computation (TAMC).",
            "Phase transition of multivariate polynomial systems.",
            "Non-cupping, measure and computably enumerable splittings.",
            "On universal computably enumerable prefix codes.",
            "Absolutely non-computable predicates and functions in analysis.",
            "Complexity of propositional projection temporal logic with star.",
            "On computably locally compact Hausdorff spaces.",
            "Quantum multiparty communication complexity and circuit lower bounds.",
            "Unary automatic graphs: an algorithmic perspective.",
            "Principal filters definable by parameters in EbT.",
            "Cupping Delta20 enumeration degrees to 0 e'.",
            "A note on the feasibility of generalised universal composability.",
            "The method of the Yu-Ding Theorem and its application.",
            "On traced monoidal closed categories.",
            "Correctness of high-level transformation systems relative to nested conditions.",
            "On a measurement-free quantum lambda calculus with classical control.",
            "The space of formal balls and models of quasi-metric spaces.",
            "Boolean and classical restriction categories.",
            "Three extensional models of type theory.",
            "Exploring the relation between Intuitionistic BI and Boolean BI: an unexpected embedding.",
            "Predicate transformers for extended probability and non-determinism.",
            "A quantitative computational model for complete partial metric spaces via formal balls.",
            "On the expressive power of process interruption and compensation.",
            "A theory of contracts for strong service compliance.",
            "From parametric polymorphism to models of polymorphic FPC.",
            "Two-dimensional models of type theory.",
            "Automata theory based on unsharp quantum logic.",
            "The Dedekind reals in abstract Stone duality.",
            "A type system for Discretionary Access Control.",
            "Social processes, program verification and all that.",
            "Effective lambda-models versus recursively enumerable lambda-theories.",
            "The sequential topology on ℕℕℕ is not regular.",
            "Algebra and logic for resource-based systems modelling.",
            "The algebraic lambda calculus.",
            "Foreword: special issue in memory of Nadia Busi.",
            "Structural non-interference in elementary and trace nets.",
            "Process discovery and Petri nets.",
            "Efficient computation in rational-valued P systems.",
            "(Tissue) P systems with cell polarity.",
            "An expressiveness study of priority in process calculi.",
            "On the expressive power of recursion, replication and iteration in process calculi.",
            "Deciding reachability problems in Turing-complete fragments of Mobile Ambients.",
            "Mobile Petri nets.",
            "Nadia Busi's publications."
        ]
    },
    {
        "name": "MSCS",
        "year": "2008",
        "info": "2008: Volume 18",
        "count": 41,
        "papers": [
            "Preface to Special Issue devoted to the memory of Sauro Tulipani.",
            "On the axiomatisability of priority.",
            "A survey of modal logics characterising behavioural equivalences for non-deterministic and stochastic systems.",
            "Comparative uncertainty: theory and automation.",
            "Towards an algorithmic construction of cut-elimination procedures.",
            "Multiple-Labelled Transition Systems for nominal calculi and their logics.",
            "Semantics for a basic relevant logic with intensional conjunction and disjunction (and some of its extensions).",
            "The Travelling Salesman Problem in symmetric circulant matrices with two stripes.",
            "A positive set theory with equality revisited.",
            "Model theory of exponentials on Lie algebras.",
            "Combinatorial laplacians and positivity under partial transpose.",
            "Types for ambient and process mobility.",
            "Computability and information in models of randomness and chaos.",
            "On asymptotic divergency in equivalential logics.",
            "Observational interpretation of Casl specifications.",
            "Maurer computers for pipelined instruction processing.",
            "The Decomposition Tree for analyses of Boolean functions.",
            "Rewriting calculi, higher-order reductions and patterns: introduction.",
            "Strong normalisation in two Pure Pattern Type Systems.",
            "iRho: an imperative rewriting calculus.",
            "A call-by-need lambda calculus with locally bottom-avoiding choice: context lemma and correctness of transformations.",
            "Computation with classical sequents.",
            "Monad compositions II: Kleisli strength.",
            "Preface to the special issue: isomorphisms of types and invertibility of lambda terms.",
            "Curry-style type isomorphisms and game semantics.",
            "An insertion operator preserving infinite reduction sequences.",
            "Coercions in a polymorphic type system.",
            "On the building of affine retractions.",
            "Theory and applications of subtyping: Introduction.",
            "Polarised subtyping for sized types.",
            "Type-based flow analysis and context-free language reachability.",
            "Bounded polymorphism in session types.",
            "Structural subtyping for inductive types with functorial equality rules.",
            "Graph lambda theories.",
            "Exponentiable morphisms of domains.",
            "On the interpretation of mathematical entities in the formalisation of programming and modelling languages.",
            "Reducibility of domain representations and Cantor-Weihrauch domain representations.",
            "A ground-complete axiomatisation of finite-state processes in a generic process algebra.",
            "Bunched polymorphism.",
            "Using groups for investigating rewrite systems.",
            "Logical relations for monadic types."
        ]
    },
    {
        "name": "MSCS",
        "year": "2007",
        "info": "2007: Volume 17",
        "count": 42,
        "papers": [
            "Preface to the special issue: Constructive analysis, types and exact real numbers.",
            "Constructive analysis, types and exact real numbers.",
            "Affine functions and series with co-inductive real numbers.",
            "RealLib: An efficient implementation of exact real arithmetic.",
            "Implementing the cylindrical algebraic decomposition within the Coq system.",
            "A monadic, functional implementation of real numbers.",
            "Two preservation results for countable products of sequential spaces.",
            "3-body, classical-quantum, discrete-continuous.",
            "Discrete-continuous and classical-quantum.",
            "The discrete versus continuous controversy in physics.",
            "The driven three body Coulomb problem.",
            "Dynamical systems: stability and simulability.",
            "Discrete-time and continuous-time modelling: some bridges and gaps.",
            "On the status of perturbation theory.",
            "Randomness and determinism in the interplay between the continuum and the discrete.",
            "Free compact 2-categories.",
            "Proofs, denotational semantics and observational equivalences in Multiplicative Linear Logic.",
            "Theory and applications of term graph rewriting: introduction.",
            "A rewriting calculus for cyclic higher-order term graphs.",
            "Graph rewriting for the pi-calculus.",
            "A duality between proof systems for cyclic term graphs.",
            "Natural deduction via graphs: formal definition and computation rules.",
            "A denotational semantics for the symmetric interaction combinators.",
            "Randomised algorithms for isomorphisms of simple types.",
            "More developments in computational models: introduction.",
            "Boxed ambients with communication interfaces.",
            "Coalgebraic description of generalised binary methods.",
            "A calculus of open modules: call-by-need strategy and confluence.",
            "On the size complexity of universal accepting hybrid networks of evolutionary processors.",
            "Restriction categories III: colimits, partial limits and extensivity.",
            "A projective formalism applied to topological and probabilistic event structures.",
            "Preface.",
            "On the ubiquity of certain total type structures.",
            "On categorical models of classical logic and the Geometry of Interaction.",
            "An algebraic semantics of event-based architectures.",
            "Behavioural reasoning for conditional equations.",
            "Quantum computation and quantum information.",
            "Entanglement and Hilbert space geometry for systems with a few qubits.",
            "Unitary invariants of qubit systems.",
            "Truth, modality and intersubjectivity.",
            "Decoherence in quantum walks - a review.",
            "Complexity of chaos and quantum computation."
        ]
    },
    {
        "name": "MSCS",
        "year": "2006",
        "info": "2006: Volume 16",
        "count": 50,
        "papers": [
            "Termination of processes.",
            "Anti-symmetry of higher-order subtyping and equality by subtyping.",
            "Intuitionistic phase semantics is almost classical.",
            "Distributing probability over non-determinism.",
            "Quasi-metric spaces and point-free geometry.",
            "Preface.",
            "Compactly generated domain theory.",
            "Modified bar recursion.",
            "Graph models of lambda-calculus at work, and variations.",
            "Quotients of countably based spaces are not closed under sobrification.",
            "A Cartesian closed extension of the category of locales.",
            "Monoids over domains.",
            "On sequential functionals of type 3.",
            "The strength of Engeler's lemma.",
            "A domain-theoretic Banach-Alaoglu theorem.",
            "Denotational semantics for a program logic of objects.",
            "Partial metrisability of continuous posets.",
            "Special issue on quantum programming languages.",
            "Types and typechecking for Communicating Quantum Processes.",
            "Relations among quantum processes: bisimilarity and congruence.",
            "Quantum weakest preconditions.",
            "Structuring quantum effects: superoperators as arrows.",
            "A categorical quantum logic.",
            "LQP: the dynamic logic of quantum information.",
            "A lambda calculus for quantum computation with classical control.",
            "Developments in computational models: introduction.",
            "Generalised multisets for chemical programming.",
            "Quantum programming languages: survey and bibliography.",
            "Classically controlled quantum computation.",
            "Reversible combinatory logic.",
            "Call-by-need in token-passing nets.",
            "Addressed term rewriting systems: application to a typed object calculus.",
            "On light logics, uniform encodings and polynomial time.",
            "Mathematics of computing at CiE 2005.",
            "Random reals and Lipschitz continuity.",
            "Continuous semantics for strong normalisation.",
            "On the complexity of inductive definitions.",
            "Schnorr dimension.",
            "Borel ranks and Wadge degrees of context free omega-languages.",
            "Restricted jump interpolation in the d.c.e. degrees.",
            "Ordinal computations.",
            "A logical approach to abstract algebra.",
            "Uniform regular enumerations.",
            "An extremely sharp phase transition threshold for the slow growing hierarchy.",
            "Linear logic and polynomial time.",
            "Transition systems, link graphs and Petri nets.",
            "Differential categories.",
            "Iterative algebras at work.",
            "Deriving bisimulation congruences in the DPO approach to graph rewriting with borrowed contexts.",
            "Erratum."
        ]
    },
    {
        "name": "MSCS",
        "year": "2005",
        "info": "2005: Volume 15",
        "count": 36,
        "papers": [
            "Compositional semantics for open Petri nets based on deterministic processe.",
            "Definitions by rewriting in the Calculus of Constructions.",
            "A coinductive calculus of streams.",
            "Operations and equations for coalgebras.",
            "Classical logic as limit completion.",
            "On proving the correctness of program transformations based on free theorems for higher-order polymorphic calculi.",
            "Garside monoids vs divisibility monoids.",
            "A comonadic account of behavioural covarieties of coalgebras.",
            "Extensions of valuations.",
            "The largest Cartesian closed category of domains, considered constructively.",
            "Classical linear logic of implications.",
            "Closed reduction: explicit substitutions without alpha-conversion.",
            "Periodic Linear Programming with applications to real-time scheduling.",
            "Introduction: special issue on selected papers from the Fifth Workshop on Coalgebraic Methods in Computer Science.",
            "A general final coalgebra theorem.",
            "Monads of coalgebras: rational terms and term graphs.",
            "Coalgebraic modal logic of finite rank.",
            "A note on coalgebras and presheaves.",
            "On bisimulations for the spi calculus.",
            "Profunctors, open maps and bisimulation.",
            "Finiteness spaces.",
            "Semi-pullbacks for stochastic relations over analytic spaces.",
            "Modelling general recursion in type theory.",
            "Categorical models for Abadi and Plotkin's logic for parametricity.",
            "Abstract hierarchical graph transformation.",
            "Foreword.",
            "A short survey of isomorphisms of types.",
            "A computational view of implicit coercions in type theory.",
            "Isomorphisms of simple inductive types through extensional rewriting.",
            "Efficient algorithms for isomorphisms of simple types.",
            "Matching with multiplication and exponentiation (extended abstract).",
            "Classical isomorphisms of types.",
            "Axioms for bigraphical structure.",
            "The semantics of BI and resource tableaux.",
            "Modular correspondence between dependent type theories and categories including pretopoi and topoi.",
            "From proof-nets to bordisms: the geometric meaning of multiplicative connectives."
        ]
    },
    {
        "name": "MSCS",
        "year": "2004",
        "info": "2004: Volume 14",
        "count": 28,
        "papers": [
            "A simple process algebra based on atomic actions with resources.",
            "A categorical version of the Brouwer-Heyting-Kolmogorov interpretation.",
            "Two-dimensional proof-structures and the exchange rule.",
            "Type-based termination of recursive definitions.",
            "Wheels - on division by zero.",
            "Corrigenda for 'Connected limits, familial representability and Artin glueing'.",
            "First order in Ludics.",
            "Syntactic composition of top-down tree transducers is short cut fusion.",
            "Introduction to special issue on concurrency and coordination: Selected work from the International Workshop ConCoord.",
            "TQL: a query language for semistructured data based on the ambient logic.",
            "Reo: a channel-based coordination model for component composition.",
            "MetaKlaim: a type safe multi-stage language for global computing.",
            "Coordination and mobility in CoreLime.",
            "Concurrent models for Linda with transactions.",
            "A domain equation for refinement of partial systems.",
            "Proof systems for lattice theory.",
            "Towards a quantum programming language.",
            "Operational aspects of untyped Normalisation by Evaluation.",
            "A relational model of non-deterministic dataflow.",
            "Typed behavioural equivalences for processes in the presence of subtyping.",
            "Minimisation and minimal realisation in Span(Graph).",
            "On asynchrony in name-passing calculi.",
            "Introduction to special issue on domain theory.",
            "Domain theory and differential calculus (functions of one variable).",
            "On the non-sequential nature of the interval-domain model of real-number computation.",
            "Domains, integration and 'positive analysis'.",
            "Fractals and domain theory.",
            "Compact metric spaces as minimal-limit sets in domains of bottomed sequences."
        ]
    },
    {
        "name": "MSCS",
        "year": "2003",
        "info": "2003: Volume 13",
        "count": 26,
        "papers": [
            "A Simple Proof of the Undecidability of Strong Normalisation.",
            "Intersection Types and lambda-Definability.",
            "Reductions, Intersection Types, and Explicit Substitutions.",
            "Modular Control-Flow Analysis with Rank 2 Intersection Types.",
            "Exact Flow Analysis.",
            "A Conjunctive Type System for Useless-Code Elimination.",
            "On Varieties and Covarieties in a Category.",
            "Modal Operators and the Formal Dual of Birkhoff's Completeness Theorem.",
            "Free Iterative Theories: A Coalgebraic View.",
            "Generalised Coinduction.",
            "Dualising Initial Algebras.",
            "Equational Properties Of Mobile Ambients.",
            "Proof Nets And Explicit Substitutions.",
            "A Categorical Framework For Finite State Machines.",
            "Sequentiality vs. Concurrency In Games And Logic.",
            "Complexity Of Weak Bisimilarity And Regularity For Bpa And Bpp.",
            "Embedding Untimed Into Timed Process Algebra: The Case For Explicit Termination.",
            "The Expressive Power Of Urgent, Lazy And Busy-Waiting Actions In Timed Processes.",
            "Foreword To Special Issue: The Difference Between Concurrent And Sequential Computation.",
            "Transition And Cancellation In Concurrency And Branching Time.",
            "Comparing The Expressive Power Of The Synchronous And Asynchronous Pi-Calculi.",
            "Solos In Concert.",
            "Concurrent Computing Machines And Physical Space-Time.",
            "On The Expressiveness Of Pure Safe Ambients.",
            "Obsessional Experiments For Linear Logic Proof-Nets.",
            "Diagrammatic Specifications."
        ]
    },
    {
        "name": "MSCS",
        "year": "2002",
        "info": "2002: Volume 12",
        "count": 33,
        "papers": [
            "Syntactical Truth Predicates for Formulas with Atomic Negation.",
            "Continuous Domains as Formal Spaces.",
            "Symmetric Monoidal and Cartesian Double Categories as a Semantic Framework for Tile Logic.",
            "Universal Homogeneous Graph-Like Structures And Domains.",
            "String and Graph Reduction Systems for Gene Assembly in Ciliates.",
            "Normal Forms for Context-Free Node-Rewriting Hypergraph Grammars.",
            "Hypergraph Construction and its Application to the Static Analysis of Concurrent Systems.",
            "Pushout Complements for Partly Total Algebras.",
            "Fusion in Relational Structures and the Verification of Monadic Second-Order Properties.",
            "Realizability: A Historical Essay.",
            "Tripos Theory in Retrospect.",
            "Computability and Totality in Domains.",
            "Variations on Realizability: Realizing the Propositional Axiom of Choice.",
            "Local Realizability Toposes and a Modal Logic for Computability.",
            "Impredicativity entails Untypedness.",
            "Concurrency and Loose Semantics of Open Graph Transformation Systems.",
            "An Event Structure Based Semantics for High-Level Message Sequence Charts.",
            "Constraint Satisfaction Algorithms for Graph Pattern Matching.",
            "Algebraic Properties Of Processes for Local Action Systems.",
            "Double Categories: A Modular Model of Multiplicative Linear Logic.",
            "Universal Aspects of Probabilistic Automata.",
            "The Logic of Linear Functors.",
            "Axiomatizability in Inclusive Equational Logics.",
            "Coalgebras Of Bounded Type.",
            "On Köthe Sequence Spaces and Linear Logic.",
            "Geometry of Interaction and Linear Combinatory Algebras.",
            "Investigation of Concurrent Processes by Means of Homotopy Functors.",
            "A Theory of Mixin Modules: Algebraic Laws and Reduction Semantics.",
            "Topological and Limit-Space Subcategories of Countably-Based Equilogical Spaces.",
            "A Proof-Irrelevant Model of Martin-Löf's Logical Framework.",
            "Encoding Left Reduction in the Lambda-Calculus with Interaction Nets.",
            "BetaEta-Complete Models for System F.",
            "The Temporal Logic of Coalgebras via Galois Algebras."
        ]
    },
    {
        "name": "MSCS",
        "year": "2001",
        "info": "2001: Volume 11",
        "count": 24,
        "papers": [
            "Theory and applications of explicit substitutions: Introduction.",
            "Pure type systems with explicit substitution.",
            "HOL-λσ: an intentional first-order expression of higher-order logic.",
            "Perpetuality in a named lambda calculus with explicit substitutions.",
            "Dependent types and explicit substitutions: a meta-theoretical development.",
            "Cut rules and explicit substitutions.",
            "A lambda-calculus with explicit weakening and explicit substitution.",
            "Control categories and duality: on the categorical semantics of the lambda-mu calculus.",
            "Implicit exchange in multiplicative proofnets.",
            "Mu-depth 3 is more than 2: a game-theoretic proof.",
            "Preface to Locus Solum.",
            "Locus Solum: From the rules of logic to the logic of rules.",
            "Special issue: Modalities in type theory.",
            "A judgmental reconstruction of modal logic.",
            "The Russell-Prawitz modality.",
            "Recursion over objects of functional type.",
            "Proof search in Lax Logic.",
            "Extracting information from intermediate semiconstructive HA-systems - extended abstract.",
            "Computation Algebras.",
            "Double-pushout graph transformation revisited.",
            "The classical AI planning problems in the mirror of Horn linear logic: semantics, expressibility, complexity.",
            "Strongly algebraic = SFP (topically).",
            "Recognizable languages in divisibility monoids.",
            "On the elimination of some higher type quantifiers."
        ]
    },
    {
        "name": "MSCS",
        "year": "2000",
        "info": "2000: Volume 10",
        "count": 26,
        "papers": [
            "Sequent combinators: a Hilbert system for the lambda calculus.",
            "Topological representation of the lambda-calculus.",
            "Introduction.",
            "On permuting cut with contraction.",
            "Unique factorisation lifting functors and categories of linearly-controlled processes.",
            "Introduction to linear bicategories.",
            "Unique decomposition categories, Geometry of Interaction and combinatory logic.",
            "Pontrjagin duality and full completeness for multiplicative linear logic (without Mix).",
            "On lists and other abstract data types in the calculus of constructions.",
            "Non-commutative logic II: sequent calculus and phase semantics.",
            "top-top-closed relations and admissibility.",
            "Parametric polymorphism and operational equivalence.",
            "Decidability of fourth-order matching.",
            "Category-based constraint logic.",
            "Foreword.",
            "Geometry and concurrency: a user's guide.",
            "On the classification of dipaths in geometric models for concurrency.",
            "Loops, ditopology and deadlocks.",
            "Homotopy invariants of higher dimensional categories and concurrency in computer science.",
            "Higher dimensional automata revisited.",
            "Algebraic spans.",
            "Statistical properties of simple types.",
            "On the number of fixed points of a combinator in lambda calculus.",
            "Elementary structures in process theory (1): Sets with renaming.",
            "Domain equations for probabilistic processes.",
            "Linear types and approximation."
        ]
    },
    {
        "name": "MSCS",
        "year": "1999",
        "info": "1999: Volume 9",
        "count": 28,
        "papers": [
            "Full abstraction, totality and PCF.",
            "Abstract and behaviour module specifications.",
            "A filter model for mobile processes.",
            "Order in open intervals of computable reals.",
            "Collections, sets and types.",
            "Relating operational and denotational semantics for input/output effects.",
            "On categories generalizing universal domains.",
            "General synthetic domain theory - a logical approach.",
            "Foreword.",
            "Proof-theoretic foundations for the design of actor systems.",
            "A specification logic for concurrent object-oriented programming.",
            "Hidden coinduction: behavioural correctness proofs for objects.",
            "Preface.",
            "A new method for establishing conservativity of classical systems over their intuitionistic version.",
            "Some logical and syntactical observations concerning the first-order dependent type system lambda-P.",
            "On the existence of n but not n + 1 easy combinators.",
            "From lambda to pi; or, Rediscovering continuations.",
            "Coinductive characterizations of applicative structures.",
            "A semantics for lambda calculi with resources.",
            "Extending partial combinatory algebras.",
            "Stratified polymorphism and primitive recursion.",
            "Semi-pullbacks and bisimulation in categories of Markov processes.",
            "Final coalgebras as greatest fixed points in ZF set theory.",
            "Topical categories of domains.",
            "The call-by-value [lambda]-calculus: a semantic investigation.",
            "Conditions for the completeness of functional and algebraic equational reasoning.",
            "Observational trees as models for concurrency.",
            "A general method for proving the normalization theorem for first and second order typed lambda-calculi."
        ]
    },
    {
        "name": "MSCS",
        "year": "1998",
        "info": "1998: Volume 8",
        "count": 21,
        "papers": [
            "Algorithms for Categorical Equivalence.",
            "Very Abstract Specifications: A Formalism Independent Approach.",
            "Re-Grouping Information in a Domain-Theoretic Data Model.",
            "Minimal Realization in Bicategories of Automata.",
            "An Axiomatization of the Category of Petri Net Computations.",
            "Normalization and the Yoneda Embedding.",
            "A Menagerie of NonFfinitely Based Process Semantics over BPA* - From Ready Simulation to Completed Traces.",
            "Implementing Collection Classes with Monads.",
            "Temporal Algebra.",
            "A Computationally Adequate Model for Overloading via Domain-Valued Functors.",
            "A Categorical Model for Higher Order Imperative Programming.",
            "A Theory of Mixin Modules: Basic and Derived Operators.",
            "On the Foundations of Final Coalgebra Semantics: Non-Well-Founded Sets, Partial Orders, Metric Spaces.",
            "On the Foundations of Final Coalgebra Semantics.",
            "Foreword.",
            "Minimality of the correctness criterion for multiplicative proof nets.",
            "Abstract Böhm trees.",
            "Type assignment and termination of interaction nets.",
            "An environment machine for the lambda-mu-calculus.",
            "Regular Böhm trees.",
            "Concurrent programming as proof net construction."
        ]
    },
    {
        "name": "MSCS",
        "year": "1997",
        "info": "1997: Volume 7",
        "count": 25,
        "papers": [
            "Categorical Properties of Logical Frameworks.",
            "Chu I: Cofree Equivalences, Dualities and *-Autonomous Categories.",
            "Intuitionistic Model Constructions and Normalization Proofs.",
            "A Theory of Classes: Proofs and Models.",
            "Intersection Types and Bounded Polymorphism.",
            "Weak Inclusion Systems.",
            "String Rewriting and Homology of Monoids.",
            "Structured Transition Systems with Parametric Observations: Observational Congruences and Minimal Realizations.",
            "An Axiomatization of Partial n-Place Operations.",
            "Invariants of Inversive 2-Structures on Groups of Labels.",
            "Type Reconstruction in Fomega.",
            "On the Semantics of Place/Transition Petri Nets.",
            "When Scott is Weak on the Top.",
            "A Categorical Generalization of Scott Domains.",
            "A Semantic Characterisation of the Correctness of a Proof Net.",
            "Premonoidal Categories and Notions of Computation.",
            "A Uniform Approach to Domain Theory in Realizability Models.",
            "A Computational Formalization for Partial Evaluation.",
            "Spaces of Maximal Points.",
            "Action Semantics Reasoning about Functional Programs.",
            "An Enrichment Theorem for an Axiomatisation of Categories of Domains and Continuous Functions.",
            "Categorical logic of Names and Abstraction in Action Calculi.",
            "Isomorphic Objects in Symmetric Monoidal Closed Categories.",
            "Subnets of Proof-Nets in Multiplicative Linear Logic with MIX.",
            "Varieties Generated by Languages with Poset Operations."
        ]
    },
    {
        "name": "MSCS",
        "year": "1996",
        "info": "1996: Volume 6",
        "count": 27,
        "papers": [
            "Datatype Laws without Signatures.",
            "Algebraic Implementation of Abstract Data Types: A Survey of Concepts and New Compositionality Results.",
            "Constructive Theory of the Lower Power Locale.",
            "Non-Strict Don't Care Algebras and Specifications.",
            "A Note on Recursive Functions.",
            "Equivalent Definitions of Recognizability for Sets of Graphs of Bounded Tree-Width.",
            "A Categorial Approach to the Semantics of Argumentation.",
            "Hopf Algebras and Linear Logic.",
            "Appendix: Separability of Tensor in Chu Categories of Cector Spaces.",
            "Axiomatizing Permutation Equivalence.",
            "A Polynomial-Time Algorithm for Deciding Bisimulation Equivalence of Normed Basic Parallel Processes.",
            "Interpolation and Compactness in Categories of Pre-Institutions.",
            "The Structure of Interlaced Bilattices.",
            "Fuzzy Models of Linear Logic.",
            "! and ? - Storage as Tensorial Strength.",
            "Mirror, Mirror in my Hand: A Duality between Specifications and Models of Process Behaviour.",
            "Reflexive Objects in Topological Categories.",
            "Functional Completeness of the Free Locally Cartesian Closed Category an Interpretations of Martin-Löf's Theory of Dependent Types.",
            "Typing and Subtyping for Mobile Processes.",
            "Colimits in the Category DCPO.",
            "Higher-Order Intersection Types and Multiple Inheritance.",
            "Linear Time Computable Problems and First-Order Descriptions.",
            "On Outward and Inward Productions in the Categorical Graph-Grammar Approach and Delta-Grammars.",
            "Event Structures and Non-Orthogonal Term Graph Rewriting.",
            "Uniqueness Typing for Functional Languages with Graph Rewriting Semantics.",
            "Horizontal and Vertical Structuring of Typed Graph Transformation Systems.",
            "Term Graph Narrowing."
        ]
    },
    {
        "name": "MSCS",
        "year": "1995",
        "info": "1995: Volume 5",
        "count": 22,
        "papers": [
            "A Remark on the Theory of Semi-Functors.",
            "Completeness of Category-Based Equational Deduction.",
            "Semantical Observations on the Embedding of Intuitionistic Logic into Intuitionistic Linear Logic.",
            "Parametric Algebraic Specifications with Gentzen Formulas - from Quasi-Freeness to Free Functor Semantics.",
            "Efficient Recursive Subtyping.",
            "An Approach to Object Semantics based on Terminal Co-Algebras.",
            "Categorical Concepts for Parameterized Partial Specifications.",
            "Equivalence and Difference between Institutions: Simulating Horn Clause Logic with Based Algebras.",
            "Algebraic High-Level Net Transformation Systems.",
            "D-oids: A Model for Dynamic Data-Types.",
            "Compositionality and Compatibility of Parameterization and Parameter Passing in Specification Languages.",
            "Finitary Sketches and Finitely Accessible Categories.",
            "Equivalences between Logics and Their Representing Type Theories.",
            "Causal Dependencies in Multiplicative Linear Logic with MIX.",
            "A Generalization of the Trie Data Structure.",
            "Strong Normalization with Non-Structural Subtyping.",
            "A Note on the Structure of Bilattices.",
            "Connected Limits, Familial Representability and Artin Glueing.",
            "Sound and Complete Axiomatisations of Call-by-Value Control Operators.",
            "Reductions in Intuitionistic Linear Logic.",
            "Fibrations with Indeterminates: Contextual and Functional Completeness for Polymorphic Lambda Calculi.",
            "Order-Enrichment for Categories of Partial Maps."
        ]
    },
    {
        "name": "MSCS",
        "year": "1994",
        "info": "1994: Volume 4",
        "count": 17,
        "papers": [
            "Recognizable Sets of Graphs: Equivalent Definitions and Closure Properties.",
            "Categories, Relations and Dynamic Programming.",
            "Categorical Data Types in Parametric Polymorphism.",
            "A Universality Theorem for PCF With Recursive Types, Parallel-Or and Exists.",
            "Partial Hyperdoctrines: Categorical Models for Partial Function Logic and Hoare Logic.",
            "A Categorical Approach to Database Semantics.",
            "Sketches and Computation - I: Basic Definitions and Static Evaluation.",
            "Sketches and Computation - II: Dynamic Evaluation and Applications.",
            "The Mix Rule.",
            "A Categorical Look at Tree Automata and Context-Free Languages.",
            "Primitive Recursion, Equality, and a Universal Set.",
            "Simulating Expansions without Expansions.",
            "An Oxford Survey of Order Sorted Algebra.",
            "The Glueing Construction and Lax Limits.",
            "Dynamic Labeled 2-Structures.",
            "Interaction Systems I: The Theory of Optimal Reductions.",
            "Languages under Concatenation and Shuffling."
        ]
    },
    {
        "name": "MSCS",
        "year": "1993",
        "info": "1993: Volume 3",
        "count": 16,
        "papers": [
            "Equational Axioms for Regular Sets.",
            "Step Bisimulation is Pomset Equivalence on a Parallel Language Without Explicit Internal Choice.",
            "Algebra of Constructsion II: An Algebraic Approach to Martin-Löf Theory and the Calculus of Constructions.",
            "The Theory of Semi-Functors.",
            "Admissible and Derivable Rules in Intuitionistic Logic.",
            "Universal Domains and the Amalgamation Property.",
            "Quantales, Observational Logic and Process Semantics.",
            "Least Fixpoints of Endofunctors of Cartesian Closed Categories.",
            "Some Monoidal Closed Categories of Stable Domains and Event Structures.",
            "Introduction to Distributive Categories.",
            "An Application of PER Models to Program Extraction.",
            "Program Specification and Data Refinement in Type Theory.",
            "Hypercoherences: A Strongly Stable Model of Linear Logic.",
            "Fully Abstract Translations Between Functional Languages.",
            "Demonic Operators and Monotype Factors.",
            "A Model for Syntactic Control of Interference."
        ]
    },
    {
        "name": "MSCS",
        "year": "1992",
        "info": "1992: Volume 2",
        "count": 19,
        "papers": [
            "A Formalism for the Specification of Essentially Algebraic Structures in 2-Categories.",
            "Dependence and Independence Results for (Impredicative) Calculi of Dependent Types.",
            "Coherence of Subsumption, Minimum Typing and Type-Checking in F<=.",
            "Girard Quantaloids.",
            "Engeler's Scientific Work.",
            "Functions as Processes.",
            "Unfold/Fold Transformations of Logic Programs.",
            "Sheaf Semantics for Concurrent Interacting Objects.",
            "A New Approach to Abstract Data Types, I: Informal Development.",
            "Provable Isomorphisms of Types.",
            "An Imperative Language Based on Distributive Categories.",
            "Processes as Terms: Non-Well-Founded Models for Bisimulation.",
            "Building Domains from Graph Models.",
            "Projections for Polymorphic First-Order Strictness Analysis.",
            "Categorical Models for Non-Extensional lambda-Calculi and Combinatory Logic.",
            "Representing Control: A Study of the CPS Transformation.",
            "Continuation-Based Compilation of Functional Languages for Parallel Machines.",
            "From Operational Semantics for Abstract Machines.",
            "Comprehending Monads."
        ]
    },
    {
        "name": "MSCS",
        "year": "1991",
        "info": "1991: Volume 1",
        "count": 12,
        "papers": [
            "Operations on Records.",
            "A Categorical Manifesto.",
            "From Petri Nets to Linear Logic.",
            "A Cateogry-Theoretic Account of Program Modules.",
            "Pre-Adjunctions in Order Enriched Categories.",
            "*-Autonomous Categories and Linear Logic.",
            "Temporal Structures.",
            "Constructive Natural Deduction and its 'Omega-Set' Interpretation.",
            "A New Constructive Logic: Classical Logic.",
            "Church-Rosser Property and Homology of Monoids.",
            "Semantics of the Second Order Lambda Calculus.",
            "Parallelism and Concurrency in High-Level Replacement Systems."
        ]
    }
]