[
	{
		"year": "2021",
		"name": "6th FSCD 2021",
		"info": "Buenos Aires, Argentina [Virtual Conference]",
		"venues": [
			{
				"sub_name_abbr": "conf/fscd/2021",
				"sub_name": "6th International Conference on Formal Structures for Computation and Deduction, FSCD 2021, July 17-24, 2021, Buenos Aires, Argentina (Virtual Conference).",
				"count": 33,
				"papers": [
					"Front Matter, Table of Contents, Preface, Conference Organization.",
					"Duality in Action (Invited Talk).",
					"Completion and Reduction Orders (Invited Talk).",
					"Process-As-Formula Interpretation: A Substructural Multimodal View (Invited Talk).",
					"Some Formal Structures in Probability (Invited Talk).",
					"The Expressive Power of One Variable Used Once: The Chomsky Hierarchy and First-Order Monadic Constructor Rewriting.",
					"Church's Semigroup Is Sq-Universal.",
					"Call-By-Value, Again!",
					"Predicative Aspects of Order Theory in Univalent Foundations.",
					"A Strong Call-By-Need Calculus.",
					"A Bicategorical Model for Finite Nondeterminism.",
					"Failure of Cut-Elimination in the Cyclic Proof System of Bunched Logic with Inductive Propositions.",
					"A Functional Abstraction of Typed Invocation Contexts.",
					"Beth Semantics and Labelled Deduction for Intuitionistic Sentential Calculus with Identity.",
					"New Minimal Linear Inferences in Boolean Logic Independent of Switch and Medial.",
					"A Modular Associative Commutative (AC) Congruence Closure Algorithm.",
					"Derivation of a Virtual Machine For Four Variants of Delimited-Control Operators.",
					"Positional Injectivity for Innocent Strategies.",
					"Synthetic Undecidability of MSELL via FRACTRAN Mechanised in Coq.",
					"An RPO-Based Ordering Modulo Permutation Equations and Its Applications to Rewrite Systems.",
					"Some Axioms for Mathematics.",
					"Non-Deterministic Functions as Non-Deterministic Processes.",
					"Type-Theoretic Constructions of the Final Coalgebra of the Finite Powerset Functor.",
					"Resource Transition Systems and Full Abstraction for Linear Higher-Order Effectful Programs.",
					"Z; Syntax-Free Developments.",
					"Recursion and Sequentiality in Categories of Sheaves.",
					"Polymorphic Automorphisms and the Picard Group.",
					"What's Decidable About (Atomic) Polymorphism?",
					"Coalgebra Encoding for Efficient Minimization.",
					"On the Logical Strength of Confluence and Normalisation for Cyclic Proofs.",
					"Abstract Clones for Abstract Syntax.",
					"Tuple Interpretations for Higher-Order Complexity.",
					"Output Without Delay: A π-Calculus Compatible with Categorical Semantics."
				]
			}
		]
	},
	{
		"year": "2020",
		"name": "5th FSCD 2020",
		"info": "Paris, France [Virtual Conference]",
		"venues": [
			{
				"sub_name_abbr": "conf/fscd/2020",
				"sub_name": "5th International Conference on Formal Structures for Computation and Deduction, FSCD 2020, June 29-July 6, 2020, Paris, France (Virtual Conference).",
				"count": 38,
				"papers": [
					"Front Matter, Table of Contents, Preface, Conference Organization.",
					"Solvability in a Probabilistic Setting (Invited Talk).",
					"A Modal Analysis of Metaprogramming, Revisited (Invited Talk).",
					"Quotients in Dependent Type Theory (Invited Talk).",
					"Certifying the Weighted Path Order (Invited Talk).",
					"Efficient Full Higher-Order Unification.",
					"Comprehension and Quotient Structures in the Language of 2-Categories.",
					"A Complete Normal-Form Bisimilarity for Algebraic Effects and Handlers.",
					"Pomsets with Boxes: Protection, Separation, and Locality in Concurrent Kleene Algebra.",
					"Undecidability of Semi-Unification on a Napkin.",
					"Conditional Bisimilarity for Reactive Systems.",
					"A Fast Decision Procedure For Uniqueness of Normal Forms w.r.t. Conversion of Shallow Term Rewriting Systems.",
					"Modules over Monads and Operational Semantics.",
					"Type Safety of Rewrite Rules in Dependent Types.",
					"Refining Constructive Hybrid Games.",
					"Data-Flow Analyses as Effects and Graded Monads.",
					"A Profunctorial Scott Semantics.",
					"String Diagrams for Optics.",
					"A Reflection on Continuation-Composing Style.",
					"A Probabilistic Higher-Order Fixpoint Logic.",
					"Adaptive Non-Linear Pattern Matching Automata.",
					"On Average-Case Hardness of Higher-Order Model Checking.",
					"Size-Preserving Translations from Order-(n+1) Word Grammars to Order-n Tree Grammars.",
					"A Syntax for Mutual Inductive Families.",
					"Towards Constructive Hybrid Semantics.",
					"A Gentzen-Style Monadic Translation of Gödel's System T.",
					"Unital Anti-Unification: Type and Algorithms.",
					"Symbolic Execution Game Semantics.",
					"Strongly Normalizing Higher-Order Relational Queries.",
					"Semi-Axiomatic Sequent Calculus.",
					"Constraint Solving over Multiple Similarity Relations.",
					"Encoding Agda Programs Using Rewriting.",
					"The Difference λ-Calculus: A Language for Difference Categories.",
					"Rast: Resource-Aware Session Types with Arithmetic Refinements (System Description).",
					"Hierarchy Builder: Algebraic hierarchies Made Easy in Coq with Elpi (System Description).",
					"The New Rewriting Engine of Dedukti (System Description).",
					"WANDA - a Higher Order Termination Tool (System Description).",
					"A Type Checker for a Logical Framework with Union and Intersection Types (System Description)."
				]
			},
			{
				"sub_name_abbr": "journals/corr/abs-2102-01804",
				"sub_name": "Proceedings 11th International Workshop on Computing with Terms and Graphs, TERMGRAPH@FSCD 2020, Online, 5th July 2020.",
				"count": 5,
				"papers": [
					"Operational Semantics with Hierarchical Abstract Syntax Graphs.",
					"On Stochastic Rewriting and Combinatorics via Rule-Algebraic Methods.",
					"Structure-Constrained Process Graphs for the Process Semantics of Regular Expressions.",
					"Parallel Hyperedge Replacement String Languages.",
					"Parallel Independence in Attributed Graph Rewriting."
				]
			},
			{
				"sub_name_abbr": "journals/corr/abs-2112-14305",
				"sub_name": "Proceedings Second Joint International Workshop on Linearity & Trends in Linear Logic and Applications, Linearity&TLLA@IJCAR-FSCD 2020, Online, 29-30 June 2020.",
				"count": 10,
				"papers": [
					"Exponentially Handsome Proof Nets and Their Normalization.",
					"A Deep Inference System for Differential Linear Logic.",
					"Super Exponentials in Linear Logic.",
					"Linear Additives.",
					"A Braided Lambda Calculus.",
					"Deriving Distributive Laws for Graded Linear Types.",
					"Harmony in the Light of Computational Ludics.",
					"Flag: a Self-Dual Modality for Non-Commutative Contraction and Duplication in the Category of Coherence Spaces.",
					"*-autonomous envelopes.",
					"A Linear Algebra Approach to Linear Metatheory."
				]
			}
		]
	},
	{
		"year": "2019",
		"name": "4th FSCD 2019",
		"info": "Dortmund, Germany",
		"venues": [
			{
				"sub_name_abbr": "conf/rta/2019",
				"sub_name": "4th International Conference on Formal Structures for Computation and Deduction, FSCD 2019, June 24-30, 2019, Dortmund, Germany.",
				"count": 35,
				"papers": [
					"Front Matter, Table of Contents, Preface, Conference Organization.",
					"A Fresh Look at the lambda-Calculus (Invited Talk).",
					"A Linear Logical Framework in Hybrid (Invited Talk).",
					"Extending Maximal Completion (Invited Talk).",
					"Some Semantic Issues in Probabilistic Programming Languages (Invited Talk).",
					"Bicategories in Univalent Foundations.",
					"Modular Specification of Monads Through Higher-Order Presentations.",
					"Towards the Average-Case Analysis of Substitution Resolution in Lambda-Calculus.",
					"Deriving an Abstract Machine for Strong Call by Need.",
					"Dependency Pairs Termination in Dependent Type Theory Modulo Rewriting.",
					"A Generic Framework for Higher-Order Generalizations.",
					"Homotopy Canonicity for Cubical Type Theory.",
					"Polymorphic Higher-Order Termination.",
					"On the Taylor Expansion of Probabilistic lambda-terms.",
					"Proof Normalisation in a Logic Identifying Isomorphic Propositions.",
					"lambda!-calculus, Intersection Types, and Involutions.",
					"Template Games, Simple Games, and Day Convolution.",
					"Differentials and Distances in Probabilistic Coherence Spaces.",
					"Modal Embeddings and Calling Paradigms.",
					"Probabilistic Rewriting: Normalization, Termination, and Unique Normal Forms.",
					"A Linear-Logical Reconstruction of Intuitionistic Modal Logic S4.",
					"Sparse Tiling Through Overlap Closures for Termination of String Rewriting.",
					"Proof Nets for First-Order Additive Linear Logic.",
					"The Sub-Additives: A Proof Theory for Probabilistic Choice extending Linear Logic.",
					"A Lower Bound of the Number of Rewrite Rules Obtained by Homological Methods.",
					"Gluing for Type Theory.",
					"The Discriminating Power of the Let-In Operator in the Lazy Call-by-Name Probabilistic lambda-Calculus.",
					"Hilbert's Tenth Problem in Coq.",
					"The Delta-calculus: Syntax and Types.",
					"Pointers in Recursion: Exploring the Tropics.",
					"Typed Equivalence of Effect Handlers and Delimited Control.",
					"Cubical Syntax for Reflection-Free Extensional Equality.",
					"Guarded Recursion in Agda via Sized Types.",
					"Sequence Types for Hereditary Permutators.",
					"Model Checking Strategy-Controlled Rewriting Systems (System Description)."
				]
			}
		]
	},
	{
		"year": "2018",
		"name": "3rd FSCD 2018",
		"info": "Oxford, UK",
		"venues": [
			{
				"sub_name_abbr": "conf/rta/2018",
				"sub_name": "3rd International Conference on Formal Structures for Computation and Deduction, FSCD 2018, July 9-12, 2018, Oxford, UK.",
				"count": 33,
				"papers": [
					"Front Matter, Table of Contents, Preface, Conference Organization.",
					"Analysing Privacy-Type Properties in Cryptographic Protocols (Invited Talk).",
					"Formal Design, Implementation and Verification of Blockchain Languages (Invited Talk).",
					"Challenges in Quantum Programming Languages (Invited Talk).",
					"Proof Techniques for Program Equivalence in Probabilistic Higher-Order Languages (Invited Talk).",
					"A Unifying Framework for Type Inhabitation.",
					"Confluence of Prefix-Constrained Rewrite Systems.",
					"Fixed-Point Constraints for Nominal Equational Unification.",
					"Strict Ideal Completions of the Lambda Calculus.",
					"Term-Graph Anti-Unification.",
					"Proof Nets for Bi-Intuitionistic Linear Logic.",
					"Counting Environments and Closures.",
					"Higher-Order Equational Pattern Anti-Unification.",
					"Term Rewriting Characterisation of LOGSPACE for Finite and Infinite Data.",
					"Decreasing Diagrams with Two Labels Are Complete for Confluence of Countable Systems.",
					"Coherence of Gray Categories via Rewriting.",
					"Completeness of Tree Automata Completion.",
					"A Diagrammatic Axiomatisation of Fermionic Quantum Circuits.",
					"On Repetitive Right Application of B-Terms.",
					"Index-Stratified Types.",
					"A Syntax for Higher Inductive-Inductive Types.",
					"Lifting Coalgebra Modalities and IMELL Model Structure to Eilenberg-Moore Categories.",
					"Internal Universes in Models of Homotopy Type Theory.",
					"The Clocks They Are Adjunctions Denotational Semantics for Clocked Type Theory.",
					"Call-by-Name Gradual Type Theory.",
					"Unique perfect matchings and proof nets.",
					"Narrowing Trees for Syntactically Deterministic Conditional Term Rewriting Systems.",
					"Homogeneity Without Loss of Generality.",
					"Nominal Unification with Atom and Context Variables.",
					"Cumulative Inductive Types In Coq.",
					"Completion for Logically Constrained Rewriting.",
					"ProTeM: A Proof Term Manipulator (System Description).",
					"Confluence Competition 2018."
				]
			},
			{
				"sub_name_abbr": "journals/corr/abs-1807-01352",
				"sub_name": "Proceedings of the 13th International Workshop on Logical Frameworks and Meta-Languages: Theory and Practice, LFMTP@FSCD 2018, Oxford, UK, 7th July 2018.",
				"count": 5,
				"papers": [
					"The RedPRL Proof Assistant (Invited Paper).",
					"Formalisation in Constructive Type Theory of Barendregt's Variable Convention for Generic Structures with Binders.",
					"Formalization in Constructive Type Theory of the Standardization Theorem for the Lambda Calculus using Multiple Substitution.",
					"Abstract Representation of Binders in OCaml using the Bindlib Library.",
					"Sharing a Library between Proof Assistants: Reaching out to the HOL Family."
				]
			},
			{
				"sub_name_abbr": "journals/corr/abs-1807-03732",
				"sub_name": "Proceedings of the 7th Workshop on Mathematically Structured Functional Programming, MSFP@FSCD 2018, Oxford, UK, 8th July 2018.",
				"count": 4,
				"papers": [
					"Formalizing Constructive Quantifier Elimination in Agda.",
					"Relating Idioms, Arrows and Monads from Monoidal Adjunctions.",
					"Backward induction for repeated games.",
					"Everybody's Got To Be Somewhere."
				]
			},
			{
				"sub_name_abbr": "journals/corr/abs-1902-01510",
				"sub_name": "Proceedings Tenth International Workshop on Computing with Terms and Graphs, TERMGRAPH@FSCD 2018, Oxford, UK, 7th July 2018.",
				"count": 5,
				"papers": [
					"Modeling Terms by Graphs with Structure Constraints (Two Illustrations).",
					"Semantics-Preserving DPO-Based Term Graph Rewriting.",
					"On Quasi Ordinal Diagram Systems.",
					"Finding the Transitive Closure of Functional Dependencies using Strategic Port Graph Rewriting.",
					"A Framework for Rewriting Families of String Diagrams."
				]
			},
			{
				"sub_name_abbr": "journals/corr/abs-1902-07818",
				"sub_name": "Proceedings Fifth International Workshop on Rewriting Techniques for Program Transformations and Evaluation, WPTE@FSCD 2018, Oxford, England, 8th July 2018.",
				"count": 5,
				"papers": [
					"Reducing Total Correctness to Partial Correctness by a Transformation of the Language Semantics.",
					"Automating the Diagram Method to Prove Correctness of Program Transformations.",
					"On Transforming Functions Accessing Global Variables into Logically Constrained Term Rewriting Systems.",
					"Optimizing Space of Parallel Processes.",
					"On Transforming Narrowing Trees into Regular Tree Grammars Generating Ranges of Substitutions."
				]
			},
			{
				"sub_name_abbr": "journals/corr/abs-1903-12402",
				"sub_name": "Proceedings 7th International Workshop on Theorem proving components for Educational software, ThEdu@FLoC 2018, Oxford, United Kingdom, 18 july 2018.",
				"count": 6,
				"papers": [
					"Students' Proof Assistant (SPA).",
					"Natural Deduction Assistant (NaDeA).",
					"Towards Ranking Geometric Automated Theorem Provers.",
					"Towards Intuitive Reasoning in Axiomatic Geometry.",
					"Theorem and Algorithm Checking for Courses on Logic and Formal Methods.",
					"Technologies for \"Complete, Transparent & Interactive Models of Math\" in Education."
				]
			},
			{
				"sub_name_abbr": "journals/corr/abs-1904-06159",
				"sub_name": "Proceedings Joint International Workshop on Linearity & Trends in Linear Logic and Applications, Linearity-TLLA@FLoC 2018, Oxford, UK, 7-8 July 2018.",
				"count": 9,
				"papers": [
					"Formalization of Automated Trading Systems in a Concurrent Linear Framework.",
					"The Bang Calculus and the Two Girard's Translations.",
					"From Linear Logic to Cyclic Sharing.",
					"On the Lambek Calculus with an Exchange Modality.",
					"Taking Linear Logic Apart.",
					"Coherent Interaction Graphs.",
					"The ILLTP Library for Intuitionistic Linear Logic.",
					"Quantum programming made easy.",
					"Proof nets, coends and the Yoneda isomorphism."
				]
			}
		]
	},
	{
		"year": "2017",
		"name": "2nd FSCD 2017",
		"info": "Oxford, UK",
		"venues": [
			{
				"sub_name_abbr": "conf/rta/2017",
				"sub_name": "2nd International Conference on Formal Structures for Computation and Deduction, FSCD 2017, September 3-9, 2017, Oxford, UK.",
				"count": 34,
				"papers": [
					"Front Matter, Table of Contents, Preface, Steering Committee, Program Committee, External Reviewers.",
					"Type Systems for the Relational Verification of Higher Order Programs (Invited Talk).",
					"Uniform Resource Analysis by Rewriting: Strenghts and Weaknesses (Invited Talk).",
					"Brzozowski Goes Concurrent - A Kleene Theorem for Pomset Languages (Invited Talk).",
					"Quantitative Semantics for Probabilistic Programming (Invited Talk).",
					"Displayed Categories.",
					"The Confluent Terminating Context-Free Substitutive Rewriting System for the lambda-Calculus with Surjective Pairing and Terminal Type.",
					"Improving Rewriting Induction Approach for Proving Ground Confluence.",
					"Böhm Reduction in Infinitary Term Graph Rewriting Systems.",
					"Optimality and the Linear Substitution Calculus.",
					"Generalized Refocusing: From Hybrid Strategies to Abstract Machines.",
					"Nested Multisets, Hereditary Multisets, and Syntactic Ordinals in Isabelle/HOL.",
					"Observably Deterministic Concurrent Strategies and Intensional Full Abstraction for Parallel-or.",
					"There Is Only One Notion of Differentiation.",
					"Confluence of an Extension of Combinatory Logic by Boolean Constants.",
					"The Complexity of Principal Inhabitation.",
					"List Objects with Algebraic Structure.",
					"Is the Optimal Implementation Inefficient? Elementarily Not.",
					"Continuation Passing Style for Effect Handlers.",
					"Infinite Runs in Abstract Completion.",
					"Refutation of Sallé's Longstanding Conjecture.",
					"Relating System F and Lambda2: A Case Study in Coq, Abella and Beluga.",
					"A Polynomial-Time Algorithm for the Lambek Calculus with Brackets of Bounded Order.",
					"Polynomial Running Times for Polynomial-Time Oracle Machines.",
					"Types as Resources for Classical Natural Deduction.",
					"A Fibrational Framework for Substructural and Modal Logics.",
					"Arrays and References in Resource Aware ML.",
					"Negative Translations and Normal Modality.",
					"Models of Type Theory Based on Moore Paths.",
					"On Dinaturality, Typability and beta-eta-Stable Models.",
					"A Curry-Howard Approach to Church's Synthesis.",
					"Combinatorial Flows and Their Normalisation.",
					"Streett Automata Model Checking of Higher-Order Recursion Schemes.",
					"A Sequent Calculus for a Semi-Associative Law."
				]
			},
			{
				"sub_name_abbr": "journals/corr/abs-1802-05862",
				"sub_name": "Proceedings Fourth International Workshop on Rewriting Techniques for Program Transformations and Evaluation, WPTE@FSCD 2017, Oxford, UK, 8th September 2017.",
				"count": 7,
				"papers": [
					"Attributed Hierarchical Port Graphs and Applications.",
					"A Method to Translate Order-Sorted Algebras to Many-Sorted Algebras.",
					"Transforming Proof Tableaux of Hoare Logic into Inference Sequences of Rewriting Induction.",
					"Efficient Implementation of Evaluation Strategies via Token-Guided Graph Rewriting.",
					"Reduced Dependency Spaces for Existential Parameterised Boolean Equation Systems.",
					"Transforming Dependency Chains of Constrained TRSs into Bounded Monotone Sequences of Integers.",
					"Space Improvements and Equivalences in a Functional Core Language."
				]
			}
		]
	},
	{
		"year": "2016",
		"name": "1st FSCD 2016",
		"info": "Porto, Portugal",
		"venues": [
			{
				"sub_name_abbr": "conf/rta/2016",
				"sub_name": "1st International Conference on Formal Structures for Computation and Deduction, FSCD 2016, June 22-26, 2016, Porto, Portugal.",
				"count": 37,
				"papers": [
					"Front Matter, Table of Contents, Preface, Steering Committee, Program Committee, External Reviewers, Organising Commitee.",
					"Compositional Compiler Verification for a Multi-Language World.",
					"Coalgebras and Higher-Order Computation: a GoI Approach.",
					"Teaching Foundations of Computation and Deduction Through Literate Functional Programming and Type Theory Formalization.",
					"Verified Analysis of Functional Data Structures.",
					"Strong Normalization for the Parameter-Free Polymorphic Lambda Calculus Based on the Omega-Rule..",
					"Normalisation by Evaluation for Dependent Types.",
					"Minimal Paradefinite Logics for Reasoning with Incompleteness and Inconsistency.",
					"Structural Interactions and Absorption of Structural Rules in BI Sequent Calculus.",
					"Environmental Bisimulations for Delimited-Control Operators with Dynamic Prompt Generation.",
					"Complexity of Acyclic Term Graph Rewriting.",
					"Nominal Narrowing.",
					"Synthesis of Functional Programs with Help of First-Order Intuitionistic Logic.",
					"Classical Extraction in Continuation Models.",
					"Proving Correctness of Logically Decorated Graph Rewriting Systems.",
					"New Results on Morris's Observational Theory: The Benefits of Separating the Inseparable.",
					"Modular Focused Proof Systems for Intuitionistic Modal Logics.",
					"The Independence of Markov's Principle in Type Theory.",
					"On Undefined and Meaningless in Lambda Definability.",
					"The Intersection Type Unification Problem.",
					"Computing Connected Proof(-Structure)s From Their Taylor Expansion.",
					"Strongly Normalising Cyclic Data Computation by Iteration Categories of Second-Order Algebraic Theories.",
					"Non-Omega-Overlapping TRSs are UN.",
					"Complexity Hierarchies and Higher-Order Cons-Free Rewriting.",
					"Weighted Relational Models for Mobility.",
					"Focusing in Orthologic.",
					"Functions-as-Constructors Higher-Order Unification.",
					"Homological Computations for Term Rewriting Systems.",
					"Reversible Term Rewriting.",
					"Certifying Confluence of Almost Orthogonal CTRSs via Exact Tree Automata Completion.",
					"Category Theory in Coq 8.5.",
					"Formal Languages, Formally and Coinductively.",
					"Normalisation by Random Descent.",
					"Ground Confluence Prover based on Rewriting Induction.",
					"Globular: An Online Proof Assistant for Higher-Dimensional Rewriting.",
					"Interaction Automata and the ia2d Interpreter.",
					"Automating the First-Order Theory of Rewriting for Left-Linear Right-Ground Rewrite Systems."
				]
			},
			{
				"sub_name_abbr": "journals/corr/CirsteaE17",
				"sub_name": "Proceedings Third International Workshop on Rewriting Techniques for Program Transformations and Evaluation, WPTE@FSCD 2016, Porto, Portugal, 23rd June 2016.",
				"count": 6,
				"papers": [
					"The Complexity of Abstract Machines.",
					"On Upper Bounds on the Church-Rosser Theorem.",
					"Confluence of Conditional Term Rewrite Systems via Transformations.",
					"An Extension of Proof Graphs for Disjunctive Parameterised Boolean Equation Systems.",
					"Sound Structure-Preserving Transformation for Weakly-Left-Linear Deterministic Conditional Term Rewriting Systems.",
					"An Environment for Analyzing Space Optimizations in Call-by-Need Functional Languages."
				]
			},
			{
				"sub_name_abbr": "journals/corr/Kobayashi17",
				"sub_name": "Proceedings Eighth Workshop on Intersection Types and Related Systems, ITRS 2016, Porto, Portugal, 26th June 2016.",
				"count": 4,
				"papers": [
					"Intersections and Unions of Session Types.",
					"Characterisation of Approximation and (Head) Normalisation for λμ using Strict Intersection Types.",
					"Retractions in Intersection Types.",
					"Intersection Types and Counting."
				]
			}
		]
	},
	{
		"year": "2015",
		"name": "26th RTA 2015",
		"info": "Warsaw, Poland",
		"venues": [
			{
				"sub_name_abbr": "conf/rta/2015",
				"sub_name": "26th International Conference on Rewriting Techniques and Applications, RTA 2015, June 29 to July 1, 2015, Warsaw, Poland.",
				"count": 26,
				"papers": [
					"Front Matter, Table of Contents, Preface, Conference Organization.",
					"Port Graphs, Rules and Strategies for Dynamic Data Analytics - Extended Abstract (Invited Talk).",
					"Matching Logic - Extended Abstract (Invited Talk).",
					"Executable Formal Models in Rewriting Logic (Invited Talk).",
					"Certification of Complexity Proofs using CeTA.",
					"Dismatching and Local Disunification in EL.",
					"Nominal Anti-Unification.",
					"A faithful encoding of programmable strategies into term rewriting systems.",
					"Presenting a Category Modulo a Rewriting System.",
					"Confluence of nearly orthogonal infinitary term rewriting systems.",
					"No complete linear term rewriting system for propositional logic.",
					"A Coinductive Framework for Infinitary Rewriting and Equational Reasoning.",
					"Proving non-termination by finite automata.",
					"Reachability Analysis of Innermost Rewriting.",
					"Network Rewriting II: Bi- and Hopf Algebras.",
					"Leftmost Outermost Revisited.",
					"Conditional Complexity.",
					"Constructing Orthogonal Designs in Powers of Two: Gröbner Bases Meet Equational Unification.",
					"Improving Automatic Confluence Analysis of Rewrite Systems by Redundant Rules.",
					"Certified Rule Labeling.",
					"Transforming Cycle Rewriting into String Rewriting.",
					"Confluence of Orthogonal Nominal Rewriting Systems Revisited.",
					"Matrix Interpretations on Polyhedral Domains.",
					"Inferring Lower Bounds for Runtime Complexity.",
					"A Simple and Efficient Step Towards Type-Correct XSLT Transformations.",
					"DynSem: A DSL for Dynamic Semantics Specification."
				]
			},
			{
				"sub_name_abbr": "conf/rta/2015wpte",
				"sub_name": "2nd International Workshop on Rewriting Techniques for Program Transformations and Evaluation, WPTE 2015, July 2, 2015, Warsaw, Poland.",
				"count": 6,
				"papers": [
					"Frontmatter, Table of Contents, Preface, Workshop Organization.",
					"Mechanizing Meta-Theory in Beluga (Invited Talk).",
					"Head reduction and normalization in a call-by-value lambda-calculus.",
					"Towards Modelling Actor-Based Concurrency in Term Rewriting.",
					"Observing Success in the Pi-Calculus.",
					"Formalizing Bialgebraic Semantics in PVS 6.0."
				]
			}
		]
	},
	{
		"year": "2014",
		"name": "RTA-TLCA 2014",
		"info": "Vienna, Austria",
		"venues": [
			{
				"sub_name_abbr": "conf/rta/2014",
				"sub_name": "Rewriting and Typed Lambda Calculi - Joint International Conference, RTA-TLCA 2014, Held as Part of the Vienna Summer of Logic, VSL 2014, Vienna, Austria, July 14-17, 2014. Proceedings.",
				"count": 33,
				"papers": [
					"Process Types as a Descriptive Tool for Interaction - Control and the Pi-Calculus.",
					"Concurrent Programming Languages and Methods for Semantic Analyses (Extended Abstract of Invited Talk).",
					"Unnesting of Copatterns.",
					"Proving Confluence of Term Rewriting Systems via Persistency and Decreasing Diagrams.",
					"Predicate Abstraction of Rewrite Theories.",
					"Unification and Logarithmic Space.",
					"Ramsey Theorem as an Intuitionistic Property of Well Founded Relations.",
					"A Model of Countable Nondeterminism in Guarded Type Theory.",
					"Cut Admissibility by Saturation.",
					"Automatic Evaluation of Context-Free Grammars (System Description).",
					"Tree Automata with Height Constraints between Brothers.",
					"A Coinductive Confluence Proof for Infinitary Lambda-Calculus.",
					"An Implicit Characterization of the Polynomial-Time Decidable Sets by Cons-Free Rewriting.",
					"Preciseness of Subtyping on Intersection and Union Types.",
					"Abstract Datatypes for Real Numbers in Type Theory.",
					"Self Types for Dependently Typed Lambda Encodings.",
					"First-Order Formative Rules.",
					"Automated Complexity Analysis Based on Context-Sensitive Rewriting.",
					"Amortised Resource Analysis and Typed Polynomial Interpretations.",
					"Confluence by Critical Pair Analysis.",
					"Proof Terms for Infinitary Rewriting.",
					"Construction of Retractile Proof Structures.",
					"Local States in String Diagrams.",
					"Reduction System for Extensional Lambda-mu Calculus.",
					"The Structural Theory of Pure Type Systems.",
					"Applicative May- and Should-Simulation in the Call-by-Value Lambda Calculus with AMB.",
					"Implicational Relevance Logic is 2-ExpTime-Complete.",
					"Near Semi-rings and Lambda Calculus.",
					"All-Path Reachability Logic.",
					"Formalizing Monotone Algebras for Certification of Termination and Complexity Proofs.",
					"Conditional Confluence (System Description).",
					"Nagoya Termination Tool.",
					"Termination of Cycle Rewriting."
				]
			},
			{
				"sub_name_abbr": "conf/rta/2014wpte",
				"sub_name": "First International Workshop on Rewriting Techniques for Program Transformations and Evaluation, WPTE 2014, July 13, 2014, Vienna, Austria.",
				"count": 8,
				"papers": [
					"Frontmatter, Table of Contents, Preface, Workshop Organization.",
					"HERMIT: An Equational Reasoning Model to Implementation Rewrite System for Haskell (Invited Talk).",
					"Notes on Structure-Preserving Transformations of Conditional Term Rewrite Systems.",
					"Verifying Optimizations for Concurrent Programs.",
					"Inverse Unfold Problem and Its Heuristic Solving.",
					"On Proving Soundness of the Computationally Equivalent Transformation for Normal Conditional Term Rewriting Systems by Using Unravelings.",
					"Structural Rewriting in the pi-Calculus.",
					"Contextual Equivalences in Call-by-Need and Call-By-Name Polymorphically Typed Calculi (Preliminary Report)."
				]
			},
			{
				"sub_name_abbr": "journals/corr/Rehof15",
				"sub_name": "Proceedings Seventh Workshop on Intersection Types and Related Systems, ITRS 2014, Vienna, Austria, 18 July 2014.",
				"count": 7,
				"papers": [
					"A Finite Model Property for Intersection Types.",
					"Uniform Proofs of Normalisation and Approximation for Intersection Types.",
					"Liquid Intersection Types.",
					"Indexed linear logic and higher-order model checking.",
					"On Isomorphism of \"Functional\" Intersection and Union Types.",
					"Lucretia - intersection type polymorphism for scripting languages.",
					"Typing Classes and Mixins with Intersection Types."
				]
			}
		]
	},
	{
		"year": "2013",
		"name": "24th RTA 2013",
		"info": "Eindhoven, The Netherlands",
		"venues": [
			{
				"sub_name_abbr": "conf/rta/2013",
				"sub_name": "24th International Conference on Rewriting Techniques and Applications, RTA 2013, June 24-26, 2013, Eindhoven, The Netherlands.",
				"count": 25,
				"papers": [
					"Frontmatter, Table of Contents, Preface, Conference Organization.",
					"Pattern Generation by Cellular Automata (Invited Talk).",
					"Husserl and Hilbert on Completeness and Husserl's Term Rewrite-based Theory of Multiplicity (Invited Talk).",
					"Evidence Normalization in System FC (Invited Talk).",
					"Linear Logic and Strong Normalization.",
					"A Combination Framework for Complexity.",
					"Tyrolean Complexity Tool: Features and Usage.",
					"Abstract Logical Model Checking of Infinite-State Systems Using Narrowing.",
					"Compression of Rewriting Systems for Termination Analysis.",
					"A Variant of Higher-Order Anti-Unification.",
					"Over-approximating Descendants by Synchronized Tree Languages.",
					"Unifying Nominal Unification.",
					"Rewriting with Linear Inferences in Propositional Logic.",
					"Proof Orders for Decreasing Diagrams.",
					"Decidable structures between Church-style and Curry-style.",
					"Expressibility in the Lambda Calculus with Mu.",
					"A Homotopical Completion Procedure with Applications to Coherence of Monoids.",
					"Extending Abramsky's Lazy Lambda Calculus: (Non)-Conservativity of Embeddings.",
					"Algorithms for Extended Alpha-Equivalence and Complexity.",
					"Unification Modulo Nonnested Recursion Schemes via Anchored Semi-Unification.",
					"Formalizing Knuth-Bendix Orders and Knuth-Bendix Completion.",
					"Automatic Decidability: A Schematic Calculus for Theories with Counting Operators.",
					"Normalized Completion Revisited.",
					"Beyond Peano Arithmetic - Automatically Proving Termination of the Goodstein Sequence.",
					"Confluence by Decreasing Diagrams - Formalized."
				]
			},
			{
				"sub_name_abbr": "conf/rta/2013unif",
				"sub_name": "27th International Workshop on Unification, UNIF 2013, Eindhoven, Netherlands, June 26, 2013.",
				"count": 8,
				"papers": [
					"Unification and Anti-unification modulo Equational Theories.",
					"Anti-Unification: Algorithms and Applications.",
					"Detecting Modular ACU Structural Symmetries.",
					"Hybrid Unification in the Description Logic EL.",
					"Unranked Anti-Unification with Hedge and Context Variables.",
					"Unication Problems Modulo a Theory of Until.",
					"Hierarchical Combination of Unication Algorithms (Extended Abstract).",
					"Is it possible to unify sequential programs?"
				]
			}
		]
	},
	{
		"year": "2012",
		"name": "23rd RTA 2012",
		"info": "Nagoya, Japan",
		"venues": [
			{
				"sub_name_abbr": "conf/rta/2012",
				"sub_name": "23rd International Conference on Rewriting Techniques and Applications (RTA'12) , RTA 2012, May 28 - June 2, 2012, Nagoya, Japan.",
				"count": 26,
				"papers": [
					"RTA 2012 Proceedings Frontmatter.",
					"Computational Real Algebraic Geometry in Practice (Invited Talk).",
					"Rho-Calculi for Computation and Logic (Invited Talk).",
					"Dictionary-Based Tree Compression (Invited Talk).",
					"An Abstract Factorization Theorem for Explicit Substitutions.",
					"On the Invariance of the Unitary Cost Model for Head Reduction.",
					"A Term Rewriting System for Kuratowski's Closure-Complement Problem.",
					"Term Rewriting Systems as Topological Dynamical Systems.",
					"Infinitary Term Graph Rewriting is Simple, Sound and Complete.",
					"Axiomatic Sharing-via-Labelling.",
					"On the Decidability Status of Reachability and Coverability in Graph Transformation Systems.",
					"Normalisation for Dynamic Pattern Calculi.",
					"A Semantic Proof that Reducibility Candidates entail Cut Elimination.",
					"One-context Unification with STG-Compressed Terms is in NP.",
					"Deciding Confluence of Ground Term Rewrite Systems in Cubic Time.",
					"Polynomial Interpretations for Higher-Order Rewriting.",
					"On Soundness Conditions for Unraveling Deterministic Conditional Rewrite Systems.",
					"Reinterpreting Compression in Infinitary Rewriting.",
					"Finite Models vs Tree Automata in Safety Verification.",
					"Triangulation in Rewriting.",
					"Turing-Completeness of Polymorphic Stream Equation Systems.",
					"Matching of Compressed Patterns with Character-Variables.",
					"Meaningless Sets in Infinitary Combinatory Logic.",
					"A Rewriting Framework for Activities Subject to Regulations.",
					"Semantic Evaluation, Intersection Types and Complexity of Simply Typed Lambda Calculus.",
					"On the Formalization of Termination Techniques based on Multiset Orderings."
				]
			}
		]
	},
	{
		"year": "2011",
		"name": "22nd RTA 2011",
		"info": "Novi Sad, Serbia",
		"venues": [
			{
				"sub_name_abbr": "conf/rta/2011",
				"sub_name": "Proceedings of the 22nd International Conference on Rewriting Techniques and Applications, RTA 2011, May 30 - June 1, 2011, Novi Sad, Serbia.",
				"count": 32,
				"papers": [
					"Frontmatter, Table of Contents, Preface, Conference Organization.",
					"Tree Automata, (Dis-)Equality Constraints and Term Rewriting: What's New?.",
					"Rewriting in Practice.",
					"Combining Proofs and Programs.",
					"FAST: An Efficient Decision Procedure for Deduction and Static Equivalence.",
					"Automated Certified Proofs with CiME3.",
					"Variants, Unification, Narrowing, and Symbolic Reachability in Maude 2.6.",
					"Termination Analysis of C Programs Using Compiler Intermediate Languages.",
					"First-Order Unification on Compressed Terms.",
					"Anagopos: A Reduction Graph Visualizer for Term Rewriting and Lambda Calculus.",
					"Maximal Completion.",
					"CRSX - Combinatory Reduction Systems with Extensions.",
					"A Reduction-Preserving Completion for Proving Confluence of Non-Terminating Term Rewriting Systems.",
					"Natural Inductive Theorems for Higher-Order Rewriting.",
					"A Path Order for Rewrite Systems that Compute Exponential Time Functions.",
					"Modes of Convergence for Term Graph Rewriting.",
					"Modular Termination Proofs of Recursive Java Bytecode Programs by Term Rewriting.",
					"Rewriting-based Quantifier-free Interpolation for a Theory of Arrays.",
					"Improved Functional Flow and Reachability Analyses Using Indexed Linear Tree Grammars.",
					"Higher Order Dependency Pairs for Algebraic Functional Systems.",
					"Anti-Unification for Unranked Terms and Hedges.",
					"Termination Proofs in the Dependency Pair Framework May Induce Multiple Recursive Derivational Complexity.",
					"Revisiting Matrix Interpretations for Proving Termination of Term Rewriting.",
					"Soundness of Unravelings for Deterministic Conditional Term Rewriting Systems via Ultra-Properties Related to Linearity.",
					"Program Inversion for Tail Recursive Functions.",
					"Refinement Types as Higher-Order Dependency Pairs.",
					"Weakening the Axiom of Overlap in Infinitary Lambda Calculus.",
					"Modular and Certified Semantic Labeling and Unlabeling.",
					"Type Preservation as a Confluence Problem.",
					"Left-linear Bounded TRSs are Inverse Recognizability Preserving.",
					"Labelings for Decreasing Diagrams.",
					"Proving Equality of Streams Automatically."
				]
			}
		]
	},
	{
		"year": "2010",
		"name": "21st RTA 2010",
		"info": "Edinburgh, Scottland, UK",
		"venues": [
			{
				"sub_name_abbr": "conf/rta/2010",
				"sub_name": "Proceedings of the 21st International Conference on Rewriting Techniques and Applications, RTA 2010, July 11-13, 2010, Edinburgh, Scottland, UK.",
				"count": 30,
				"papers": [
					"Frontmatter (Titlepage, Table of Contents, Author List, PC List, Reviewer List).",
					"Preface.",
					"Automata for Data Words and Data Trees.",
					"Realising Optimal Sharing.",
					"Automated Confluence Proof by Decreasing Diagrams based on Rule-Labelling.",
					"Higher-Order (Non-)Modularity .",
					"Closing the Gap Between Runtime Complexity and Polytime Computability.",
					"Abstract Models of Transfinite Reductions.",
					"Partial Order Infinitary Term Rewriting and Böhm Trees.",
					"Unique Normal Forms in Infinitary Weakly Orthogonal Rewriting.",
					"The Undecidability of Type Related Problems in Type-free Style System F.",
					"On (Un)Soundness of Unravelings.",
					"A Proof Calculus Which Reduces Syntactic Bureaucracy.",
					"A Rewriting Logic Semantics Approach to Modular Program Analysis.",
					"Infinitary Rewriting: Foundations Revisited.",
					"Underspecified computation of normal forms.",
					"Order-Sorted Unification with Regular Expression Sorts.",
					"An Efficient Nominal Unification Algorithm.",
					"Computing Critical Pairs in 2-Dimensional Rewriting Systems.",
					"Polynomial Interpretations over the Reals do not Subsume Polynomial Interpretations over the Integers.",
					"Automated Termination Analysis of Java Bytecode by Term Rewriting.",
					"Declarative Debugging of Missing Answers for Maude.",
					"Simulation in the Call-by-Need Lambda-Calculus with letrec.",
					"Weak Convergence and Uniform Normalization in Infinitary Rewriting.",
					"Certified Subterm Criterion and Certified Usable Rules.",
					"Termination of linear bounded term rewriting systems.",
					"Polynomially Bounded Matrix Interpretations.",
					"Optimizing mkbTT.",
					"Modular Complexity Analysis via Relative Complexity.",
					"Proving Productivity in Infinite Data Structures."
				]
			}
		]
	},
	{
		"year": "2009",
		"name": "20th RTA 2009",
		"info": "Brasília, Brazil",
		"venues": [
			{
				"sub_name_abbr": "conf/rta/2009",
				"sub_name": "Rewriting Techniques and Applications, 20th International Conference, RTA 2009, Brasília, Brazil, June 29 - July 1, 2009, Proceedings.",
				"count": 27,
				"papers": [
					"Automatic Termination.",
					"Loops under Strategies.",
					"Proving Termination of Integer Term Rewriting.",
					"Dependency Pairs and Polynomial Path Orders.",
					"Unique Normalization for Shallow TRS.",
					"The Existential Fragment of the One-Step Parallel Rewriting Theory.",
					"Proving Confluence of Term Rewriting Systems Automatically.",
					"A Proof Theoretic Analysis of Intruder Theories.",
					"Flat and One-Variable Clauses for Single Blind Copying Protocols: The XOR Case.",
					"Protocol Security and Algebraic Properties: Decision Results for a Bounded Number of Sessions.",
					"YAPA: A Generic Tool for Computing Intruder Knowledge.",
					"Well-Definedness of Streams by Termination.",
					"Modularity of Convergence in Infinitary Rewriting.",
					"A Heterogeneous Pushout Approach to Term-Graph Transformation.",
					"An Explicit Framework for Interaction Nets.",
					"Dual Calculus with Inductive and Coinductive Types.",
					"Comparing Böhm-Like Trees.",
					"The Derivational Complexity Induced by the Dependency Pair Method.",
					"Local Termination.",
					"VMTL-A Modular Termination Laboratory.",
					"Tyrolean Termination Tool 2.",
					"From Outermost to Context-Sensitive Rewriting.",
					"A Fully Abstract Semantics for Constructor Systems.",
					"The -Completeness of Most of the Properties of Rewriting Systems You Care About (and Productivity).",
					"Unification in the Description Logic EL.",
					"Unification with Singleton Tree Grammars.",
					"Unification and Narrowing in Maude 2.4."
				]
			}
		]
	},
	{
		"year": "2008",
		"name": "19th RTA 2008",
		"info": "Hagenberg, Austria",
		"venues": [
			{
				"sub_name_abbr": "conf/rta/2008",
				"sub_name": "Rewriting Techniques and Applications, 19th International Conference, RTA 2008, Hagenberg, Austria, July 15-17, 2008, Proceedings.",
				"count": 30,
				"papers": [
					"Modular Termination of Basic Narrowing.",
					"Linear-algebraic lambda-calculus: higher-order, encodings, and confluence..",
					"Term-Graph Rewriting Via Explicit Paths.",
					"Finer Is Better: Abstraction Refinement for Rewriting Approximations.",
					"A Needed Rewriting Strategy for Data-Structures with Pointers.",
					"Effectively Checking the Finite Variant Property.",
					"Dependency Pairs for Rewriting with Built-In Numbers and Semantic Data Structures.",
					"Maximal Termination.",
					"Usable Rules for Context-Sensitive Rewrite Systems.",
					"Combining Equational Tree Automata over AC and ACI Theories.",
					"Closure of Hedge-Automata Languages by Hedge Rewriting.",
					"On Normalisation of Infinitary Combinatory Reduction Systems.",
					"Innermost Reachability and Context Sensitive Reachability Properties Are Decidable for Linear Right-Shallow Term Rewriting Systems.",
					"Arctic Termination ...Below Zero.",
					"Logics and Automata for Totally Ordered Trees.",
					"Diagram Rewriting for Orthogonal Matrices: A Study of Critical Peaks.",
					"Nominal Unification from a Higher-Order Perspective.",
					"Functional-Logic Graph Parser Combinators.",
					"Proving Quadratic Derivational Complexities Using Context Dependent Interpretations.",
					"Tree Automata for Non-linear Arithmetic.",
					"Confluence by Decreasing Diagrams.",
					"A Finite Simulation Method in a Non-deterministic Call-by-Need Lambda-Calculus with Letrec, Constructors, and Case.",
					"Root-Labeling.",
					"Combining Rewriting with Noetherian Induction to Reason on Non-orientable Equalities.",
					"Deciding Innermost Loops.",
					"Termination Proof of S-Expression Rewriting Systems with Recursive Path Relations.",
					"Encoding the Pure Lambda Calculus into Hierarchical Graph Rewriting.",
					"Revisiting Cut-Elimination: One Difficult Proof Is Really a Proof.",
					"Reduction Under Substitution.",
					"Normalization of Infinite Terms."
				]
			}
		]
	},
	{
		"year": "2007",
		"name": "18th RTA 2007",
		"info": "Paris, France",
		"venues": [
			{
				"sub_name_abbr": "conf/rta/2007",
				"sub_name": "Term Rewriting and Applications, 18th International Conference, RTA 2007, Paris, France, June 26-28, 2007, Proceedings.",
				"count": 30,
				"papers": [
					"Formal Verification of an Optimizing Compiler.",
					"Challenges in Satisfiability Modulo Theories.",
					"On a Logical Foundation for Explicit Substitutions.",
					"Intruders with Caps.",
					"Tom: Piggybacking Rewriting on Java.",
					"Rewriting Approximations for Fast Prototyping of Static Analyzers.",
					"Determining Unify-Stable Presentations.",
					"Confluence of Pattern-Based Calculi.",
					"A Simple Proof That Super-Consistency Implies Cut Elimination.",
					"Bottom-Up Rewriting Is Inverse Recognizability Preserving.",
					"Adjunction for Garbage Collection with Application to Graph Rewriting.",
					"Non Strict Confluent Rewrite Systems for Data-Structures with Pointers.",
					"Symbolic Model Checking of Infinite-State Systems Using Narrowing.",
					"Delayed Substitutions.",
					"Innermost-Reachability and Innermost-Joinability Are Decidable for Shallow Term Rewrite Systems.",
					"Termination of Rewriting with Right-Flat Rules.",
					"Abstract Critical Pairs and Confluence of Arbitrary Binary Relations.",
					"On the Completeness of Context-Sensitive Order-Sorted Specifications.",
					"KOOL: An Application of Rewriting Logic to Language Prototyping and Analysis.",
					"Simple Proofs of Characterizing Strong Normalization for Explicit Substitution Calculi.",
					"Proving Termination of Rewrite Systems Using Bounds.",
					"Sequence Unification Through Currying.",
					"The Termination Competition.",
					"Random Descent.",
					"Correctness of Copy in Calculi with Letrec.",
					"A Characterization of Medial as Rewriting Rule.",
					"The Maximum Length of Mu-Reduction in Lambda Mu-Calculus.",
					"On Linear Combinations of lambda -Terms.",
					"Satisfying KBO Constraints.",
					"Termination by Quasi-periodic Interpretations."
				]
			}
		]
	},
	{
		"year": "2006",
		"name": "17th RTA 2006",
		"info": "Seattle, WA, USA",
		"venues": [
			{
				"sub_name_abbr": "conf/rta/2006",
				"sub_name": "Term Rewriting and Applications, 17th International Conference, RTA 2006, Seattle, WA, USA, August 12-14, 2006, Proceedings.",
				"count": 30,
				"papers": [
					"Formal Verification of Infinite State Systems Using Boolean Methods.",
					"Solving Partial Order Constraints for LPO Termination.",
					"Computationally Equivalent Elimination of Conditions.",
					"On the Correctness of Bubbling.",
					"Propositional Tree Automata.",
					"Generalizing Newman's Lemma for Left-Linear Rewrite Systems.",
					"Unions of Equational Monadic Theories.",
					"Modular Church-Rosser Modulo.",
					"Hierarchical Combination of Intruder Theories.",
					"Feasible Trace Reconstruction for Rewriting Approximations.",
					"Rewriting Models of Boolean Programs.",
					"Syntactic Descriptions: A Type System for Solving Matching Equations in the Linear lambda-Calculus.",
					"A Terminating and Confluent Linear Lambda Calculus.",
					"A Lambda-Calculus with Constructors.",
					"Structural Proof Theory as Rewriting.",
					"Checking Conservativity of Overloaded Definitions in Higher-Order Logic.",
					"Certified Higher-Order Recursive Path Ordering.",
					"Dealing with Non-orientable Equations in Rewriting Induction.",
					"TPA: Termination Proved Automatically.",
					"RAPT: A Program Transformation System Based on Term Rewriting.",
					"The CL-Atse Protocol Analyser.",
					"Slothrop: Knuth-Bendix Completion with a Modern Termination Checker.",
					"Automated Termination Analysis for Haskell: From Term Rewriting to Programming Languages.",
					"Predictive Labeling.",
					"Termination of String Rewriting with Matrix Interpretations.",
					"Decidability of Termination for Semi-constructor TRSs, Left-Linear Shallow TRSs and Related Systems.",
					"Proving Positive Almost Sure Termination Under Strategies.",
					"A Proof of Finite Family Developments for Higher-Order Rewriting Using a Prefix Property.",
					"Higher-Order Orderings for Normal Rewriting.",
					"Bounded Second-Order Unification Is NP-Complete."
				]
			}
		]
	},
	{
		"year": "2005",
		"name": "16th RTA 2005",
		"info": "Nara, Japan",
		"venues": [
			{
				"sub_name_abbr": "conf/rta/2005",
				"sub_name": "Term Rewriting and Applications, 16th International Conference, RTA 2005, Nara, Japan, April 19-21, 2005, Proceedings.",
				"count": 36,
				"papers": [
					"Confluent Term Rewriting Systems.",
					"Generalized Innermost Rewriting.",
					"Orderings for Innermost Termination.",
					"Leanest Quasi-orderings.",
					"Abstract Modularity.",
					"Union of Equational Theories: An Algebraic Approach.",
					"Equivariant Unification.",
					"Faster Basic Syntactic Mutation with Sorts for Some Separable Equational Theories.",
					"Unification in a Class of Permutative Theories.",
					"Dependency Pairs for Simply Typed Term Rewriting.",
					"Universal Algebra for Termination of Higher-Order Rewriting.",
					"Quasi-interpretations and Small Space Bounds.",
					"A Sufficient Completeness Reasoning Tool for Partial Specifications.",
					"Tyrolean Termination Tool.",
					"Call-by-Value Is Dual to Call-by-Name - Reloaded.",
					"lambda-µ-Calculus and Duality: Call-by-Name and Call-by-Value.",
					"Reduction in a Linear Lambda-Calculus with Applications to Operational Semantics.",
					"Higher-Order Matching in the Linear Lambda Calculus in the Absence of Constants Is NP-Complete.",
					"Localized Fairness: A Rewriting Semantics.",
					"Partial Inversion of Constructor Term Rewriting Systems.",
					"Natural Narrowing for General Term Rewriting Systems.",
					"The Finite Variant Property: How to Get Rid of Some Algebraic Properties.",
					"Intruder Deduction for AC-Like Equational Theories with Homomorphisms.",
					"Proving Positive Almost-Sure Termination.",
					"Termination of Single-Threaded One-Rule Semi-Thue Systems.",
					"On Tree Automata that Certify Termination of Left-Linear Term Rewriting Systems.",
					"Twenty Years Later.",
					"Open. Closed. Open.",
					"A Tutorial Example of the Semantic Approach to Foundational Proof-Carrying Code.",
					"Extending the Explicit Substitution Paradigm.",
					"Arithmetic as a Theory Modulo.",
					"Infinitary Combinatory Reduction Systems.",
					"Proof-Producing Congruence Closure.",
					"The Algebra of Equality Proofs.",
					"On Computing Reachability Sets of Process Rewrite Systems.",
					"Automata and Logics for Unranked and Unordered Trees."
				]
			}
		]
	},
	{
		"year": "2004",
		"name": "15th RTA 2004",
		"info": "Aachen, Germany",
		"venues": [
			{
				"sub_name_abbr": "conf/rta/2004",
				"sub_name": "Rewriting Techniques and Applications, 15th International Conference, RTA 2004, Aachen, Germany, June 3-5, 2004, Proceedings.",
				"count": 21,
				"papers": [
					"Termination Analysis of the Untyped lamba-Calculus.",
					"A Type-Based Termination Criterion for Dependently-Typed Higher-Order Rewrite Systems.",
					"Termination of S-Expression Rewriting Systems: Lexicographic Path Ordering for Higher-Order Terms.",
					"Monadic Second-Order Unification Is NP-Complete.",
					"A Certified AC Matching Algorithm.",
					"Matchbox: A Tool for Match-Bounded String Rewriting.",
					"TORPA: Termination of Rewriting Proved Automatically.",
					"Querying Unranked Trees with Stepwise Tree Automata.",
					"A Verification Technique Using Term Rewriting Systems and Abstract Interpretation.",
					"Rewriting for Fitch Style Natural Deductions.",
					"Efficient lambda-Evaluation with Interaction Nets.",
					"Proving Properties of Term Rewrite Systems via Logic Programs.",
					"On the Modularity of Confluence in Infinitary Term Rewriting.",
					"mu-term: A Tool for Proving Termination of Context-Sensitive Rewriting.",
					"Automated Termination Proofs with AProVE.",
					"An Approximation Based Approach to Infinitary Lambda Calculi.",
					"Böhm-Like Trees for Term Rewriting Systems.",
					"Dependency Pairs Revisited.",
					"Inductive Theorems for Higher-Order Rewriting.",
					"The Joinability and Unification Problems for Confluent Semi-constructor TRSs.",
					"A Visual Environment for Developing Context-Sensitive Term Rewriting Systems."
				]
			}
		]
	},
	{
		"year": "2003",
		"name": "14th RTA 2003",
		"info": "Valencia, Spain",
		"venues": [
			{
				"sub_name_abbr": "conf/rta/2003",
				"sub_name": "Rewriting Techniques and Applications, 14th International Conference, RTA 2003, Valencia, Spain, June 9-11, 2003, Proceedings.",
				"count": 35,
				"papers": [
					"Invited Talk: Symbolic Systems Biology.",
					"Confluence as a Cut Elimination Property.",
					"Associative-Commutative Rewriting on Large Terms.",
					"A Rule-Based Approach for Automated Generation of Kinetic Chemical Mechanisms.",
					"Efficient Reductions with Director Strings.",
					"Rewriting Logic and Probabilities.",
					"The Maude 2.0 System.",
					"Diagrams for Meaning Preservation.",
					"Expression Reduction Systems with Patterns.",
					"Residuals in Higher-Order Rewriting.",
					"Rewriting UNITY.",
					"New Decidability Results for Fragments of First-Order Logic and Application to Cryptographic Protocols.",
					"An E-unification Algorithm for Analyzing Protocols That Use Modular Exponentiation.",
					"Two-Way Equational Tree Automata for AC-Like Theories: Decidability and Closure Properties.",
					"Rule-Based Analysis of Dimensional Safety.",
					"Invited Talk: Topological Collections, Transformations and Their Application to the Modeling and the Simulation of Dynamical Systems.",
					"On the Complexity of Higher-Order Matching in the Linear lambda-Calculus.",
					"XML Schema, Tree Logic and Sheaves Automata.",
					"Size-Change Termination for Term Rewriting.",
					"Monotonic AC-Compatible Semantic Path Orderings.",
					"Relating Derivation Lengths with the Slow-Growing Hierarchy Directly.",
					"Tsukuba Termination Tool.",
					"Liveness in Rewriting.",
					"Validation of the JavaCard Platform with Implicit Induction Techniques.",
					"\"Term Partition\" for Mathematical Induction.",
					"Equational Prover of THEOREMA.",
					"Termination of Simply Typed Term Rewriting by Translation and Labelling.",
					"Rewriting Modulo in Deduction Modulo.",
					"Termination of String Rewriting Rules That Have One Pair of Overlaps.",
					"Environments for Term Rewriting Engines for Free!",
					"Joint RTA-TLCA Invited Talk: A Logical Algorithm for ML Type Inference.",
					"A Rewriting Alternative to Reidemeister-Schreier.",
					"Stable Computational Semantics of Conflict-Free Rewrite Systems (Partial Orders with Duplication).",
					"Recognizing Boolean Closed A-Tree Languages with Membership Conditional Rewriting Mechanism.",
					"Testing Extended Regular Language Membership Incrementally by Rewriting."
				]
			}
		]
	},
	{
		"year": "2002",
		"name": "13th RTA 2002",
		"info": "Copenhagen, Denmark",
		"venues": [
			{
				"sub_name_abbr": "conf/rta/2002",
				"sub_name": "Rewriting Techniques and Applications, 13th International Conference, RTA 2002, Copenhagen, Denmark, July 22-24, 2002, Proceedings.",
				"count": 29,
				"papers": [
					"Combining Shostak Theories.",
					"Multiset Rewriting and Security Protocol Analysis.",
					"Engineering of Logics for the Content-Based Representation of Information.",
					"Axiomatic Rewriting Theory VI Residual Theory Revisited.",
					"Static Analysis of Modularity of beta-Reduction in the Hyperbalanced lambda-Calculus.",
					"Exceptions in the Rewriting Calculus.",
					"Deriving Focused Lattice Calculi.",
					"Layered Transducing Term Rewriting System and Its Recognizability Preserving Property.",
					"Decidability and Closure Properties of Equational Tree Languages.",
					"Regular Sets of Descendants by Some Rewrite Strategies.",
					"Rewrite Games.",
					"An Extensional Böhm Model.",
					"A Weak Calculus with Explicit Operators for Pattern Matching and Substitution.",
					"Tradeoffs in the Intensional Representation of Lambda Terms.",
					"Improving Symbolic Model Checking by Rewriting Temporal Logic Formulae.",
					"Conditions for Efficiency Improvement by Tree Transducer Composition.",
					"Rewriting Strategies for Instruction Selection.",
					"Probabilistic Rewrite Strategies. Applications to ELAN.",
					"Loops of Superexponential Lengths in One-Rule String Rewriting.",
					"Recursive Derivational Length Bounds for Confluent Term Rewrite Systems.",
					"Termination of (Canonical) Context-Sensitive Rewriting.",
					"Atomic Set Constraints with Projection.",
					"Currying Second-Order Unification Problems.",
					"A Decidable Variant of Higher Order Matching.",
					"Combining Decision Procedures for Positive Theories Sharing Constructors.",
					"JITty: A Rewriter with Strategy Annotations.",
					"Autowrite: A Tool for Checking Properties of Term Rewriting Systems.",
					"TTSLI: An Implementation of Tree-Tuple Synchronized Languages.",
					"in2 : A Graphical Interpreter for Interaction Nets."
				]
			}
		]
	},
	{
		"year": "2001",
		"name": "12th RTA 2001",
		"info": "Utrecht, The Netherlands",
		"venues": [
			{
				"sub_name_abbr": "conf/rta/2001",
				"sub_name": "Rewriting Techniques and Applications, 12th International Conference, RTA 2001, Utrecht, The Netherlands, May 22-24, 2001, Proceedings.",
				"count": 27,
				"papers": [
					"Computing and Proving.",
					"Rewriting for Deduction and Verification.",
					"Universal Interaction Systems with Only Two Agents.",
					"General Recursion on Second Order Term Algebras.",
					"Beta Reduction Constraints.",
					"From Higher-Order to First-Order Rewriting.",
					"Combining Pattern E-Unification Algorithms.",
					"Matching Power.",
					"Dependency Pairs for Equational Rewriting.",
					"Termination Proofs by Context-Dependent Interpretations.",
					"Uniform Normalisation beyond Orthogonality.",
					"Verifying Orientability of Rewrite Rules Using the Knuth-Bendix Order.",
					"Relating Accumulative and Non-accumulative Functional Programs.",
					"Context Unification and Traversal Equations.",
					"Weakly Regular Relations and Applications.",
					"On the Parallel Complexity of Tree Automata.",
					"Transfinite Rewriting Semantics for Term Rewriting Systems.",
					"Goal-Directed E-Unification.",
					"The Unification Problem for Confluent Right-Ground Term Rewriting Systems.",
					"On Termination of Higher-Order Rewriting.",
					"Matching with Free Function Symbols - A Simple Extension of Matching?",
					"Deriving Focused Calculi for Transitive Relations.",
					"A Formalised First-Order Confluence Proof for the lambda-Calculus Using One-Sorted Variable Names.",
					"A Normal Form for Church-Rosser Language Systems.",
					"Confluence and Termination of Simply Typed Term Rewriting Systems.",
					"Parallel Evaluation of Interaction Nets with MPINE.",
					"Stratego: A Language for Program Transformation Based on Rewriting Strategies."
				]
			}
		]
	},
	{
		"year": "2000",
		"name": "11th RTA 2000",
		"info": "Norwich, UK",
		"venues": [
			{
				"sub_name_abbr": "conf/rta/2000",
				"sub_name": "Rewriting Techniques and Applications, 11th International Conference, RTA 2000, Norwich, UK, July 10-12, 2000, Proceedings.",
				"count": 20,
				"papers": [
					"Rewriting Logic and Maude: Concepts and Applications.",
					"Tree Automata and Term Rewrite Systems.",
					"Absolute Explicit Unification.",
					"Termination and Confluence of Higher-Order Rewrite Systems.",
					"A de Bruijn Notation for Higher-Order Rewriting.",
					"Rewriting Techniques in Theoretical Physics.",
					"Normal Forms and Reduction for Theories of Binary Relations.",
					"Parallelism Constraints.",
					"Linear Higher-Order Matching Is NP-Complete.",
					"Standardization and Confluence for a Lambda Calculus with Generalized Applications.",
					"Linear Second-Order Unification and Context Unification with Tree-Regular Constraints.",
					"Word Problems and Confluence Problems for Restricted Semi-Thue Systems.",
					"The Explicit Representability of Implicit Generalizations.",
					"On the Word Problem for Combinators.",
					"An Algebra of Resolution.",
					"Deriving Theory Superposition Calculi from Convergent Term Rewriting Systems.",
					"Right-Linear Finite Path Overlapping Term Rewriting Systems Effectively Preserve Recognizability.",
					"System Description: The Dependency Pair Method.",
					"REM (Reduce Elan Machine): Core of the New ELAN Compiler.",
					"TALP: A Tool for the Termination Analysis of Logic Programs."
				]
			}
		]
	},
	{
		"year": "1999",
		"name": "10th RTA 1999",
		"info": "Trento, Italy",
		"venues": [
			{
				"sub_name_abbr": "conf/rta/1999",
				"sub_name": "Rewriting Techniques and Applications, 10th International Conference, RTA-99, Trento, Italy, July 2-4, 1999, Proceedings.",
				"count": 30,
				"papers": [
					"Solved Forms for Path Ordering Constraints.",
					"Jeopardy.",
					"Strategic Pattern Matching.",
					"On the Strong Normalisation of Natural Deduction with Permutation-Conversions.",
					"Normalisation in Weakly Orthogonal Rewriting.",
					"Strong Normalization of Proof Nets Modulo Structural Congruences.",
					"Hierarchical Graph Decompositions Defined by Grammars and Logical Formulas.",
					"Undecidability of the exists*forall* Part of the Theory of Ground Term Algebra Modulo an AC Symbol.",
					"Deciding the Satisfiability of Quantifier free Formulae on One-Step Rewriting.",
					"A New Result about the Decidability of the Existential One-Step Rewriting Theory.",
					"A Fully Syntactic AC-RPO.",
					"Theory Path Orderings.",
					"A Characterisation of Multiply Recursive Functions with Higman's Lemma.",
					"Deciding the Word Problem in the Union of Equational Theories Sharing Constructors.",
					"Normalization via Rewrite Closures.",
					"Test Sets for the Universal and Existential Closure of Regular Tree Languages.",
					"Higher-Order Rewriting.",
					"The Maude System.",
					"TOY: A Multiparadigm Declarative System.",
					"UNIMOK: A System for Combining Equational Unification Algorithm.",
					"LarrowR2: A Laboratory fro Rapid Term Graph Rewriting.",
					"Decidability for Left-Linaer Growing Term Rewriting Systems.",
					"Transforming Context-Sensitive Rewrite Systems.",
					"Context-Sensitive AC-Rewriting.",
					"The Calculus of algebraic Constructions.",
					"HOL-lambdasigma: An Intentional First-Order Expression of Higher-Order Logic.",
					"On the Connections between Rewriting and Formal Language Theory.",
					"A Rewrite System Associated with Quadratic Pisot Units.",
					"Fast Rewriting of Symmetric Polynomials.",
					"On Implementation of Tree Synchronized Languages."
				]
			}
		]
	},
	{
		"year": "1998",
		"name": "9th RTA 1998",
		"info": "Tsukuba, Japan",
		"venues": [
			{
				"sub_name_abbr": "conf/rta/1998",
				"sub_name": "Rewriting Techniques and Applications, 9th International Conference, RTA-98, Tsukuba, Japan, March 30 - April 1, 1998, Proceedings.",
				"count": 25,
				"papers": [
					"Origin Tracking in Term Rewriting (Abstract).",
					"Simultaneous Critical Pairs and Church-Rosser Property.",
					"Church-Rosser Theorems for Abstract Reduction Modulo an Equivalence Relation.",
					"Automatic Monoids Versus Monoids with Finite Convergent Presentations.",
					"Decidable and Undecidable Second-Order Unification Problems.",
					"On the Exponent of Periodicity of Minimal Solutions of Context Equation.",
					"Unification in Extension of Shallow Equational Theories.",
					"Unification and Matching in Process Algebras.",
					"E-Unification for Subsystems of S4.",
					"Solving Disequations Modulo Some Class of Rewrite Systems.",
					"About Proofs by Consistency (Abstract).",
					"Normalization of S-Terms is Decidable.",
					"Decidable Approximations of Sets of Descendants and Sets of Normal Forms.",
					"Algorithms and Reductions for Rewriting Problems.",
					"The Decidability of Simultaneous Rigid E-Unification with One Variable.",
					"Ordering Constraints over Feature Trees Expressed in Second-Order Monadic Logic.",
					"Co-definite Set Constraints.",
					"Modularity of Termination Using Dependency pairs.",
					"Termination of Associative-Commutative Rewriting by Dependency Pairs.",
					"Termination Transformation by Tree Lifting Ordering.",
					"Towards Automated Termination Proofs through \"Freezing\".",
					"Higher-Order Rewriting and Partial Evaluation.",
					"SN Combinators and Partial Combinatory Algebras.",
					"Coupling Saturation-Based Provers by Exchanging Positive/Negative Information.",
					"An On-line Problem Database."
				]
			}
		]
	},
	{
		"year": "1997",
		"name": "8th RTA 1997",
		"info": "Sitges, Spain",
		"venues": [
			{
				"sub_name_abbr": "conf/rta/1997",
				"sub_name": "Rewriting Techniques and Applications, 8th International Conference, RTA-97, Sitges, Spain, June 2-5, 1997, Proceedings.",
				"count": 28,
				"papers": [
					"Well-Behaved Search and the Robbins Problem.",
					"Goal-Directed Completion Using SOUR Graphs.",
					"Shostak's Congruence Closure as Completion.",
					"Conditional Equational Specifications of Data Types with Partial Operations for Inductive Theorem Proving.",
					"Cross-Sections for Finitely Presented Monoids with Decidable Word Problems.",
					"New Undecidablility Results for Finitely Presented Monoids.",
					"On the Property of Preserving Regularity for String-Rewriting Systems.",
					"Rewrite Systems for Natural, Integral, and Rational Arithmetic.",
					"D-Bases for Polynomial Ideals over Commutative Noetherian Rings.",
					"On the Word Problem for Free Lattices.",
					"A Total, Ground path Ordering for Proving Termination of AC-Rewrite Systems.",
					"Proving Innermost Normalisation Automatically.",
					"Termination of Context-Sensitive Rewriting.",
					"A New Parallel Closed Condition for Church-Rossser of Left-Linear Term Rewriting Systems.",
					"Innocuous Constructor-Sharing Combinations.",
					"Scott's Conjecture is True, Position Sensitive Weights.",
					"Two-Dimensional Rewriting.",
					"A Complete Axiomatisation for the Inclusion of Series-Parallel Partial Orders.",
					"Undecidability of the First Order Theory of One-Step Right Ground Rewriting.",
					"The First-Order Theory of One Step Rewriting in Linear Noetherian Systems is Undecidable.",
					"Solving Linear Diophantine Equations Using the Geometric Structure of the Solution Space.",
					"A Criterion for Intractability of E-unification with Free Function Symbols and Its Relevance for Combination Algorithms.",
					"Effective Reduction and Conversion Strategies for Combinators.",
					"Finite Family Developments.",
					"Prototyping Combination of Unification Algorithms with the ELAN Rule-Based Programming Language.",
					"The Invariant Package of MAS.",
					"Opal: A System for Computing Noncommutative Gröbner Bases.",
					"TRAM: An Abstract Machine for Order-Sorted Conditioned Term Rewriting Systems."
				]
			}
		]
	},
	{
		"year": "1996",
		"name": "7th RTA 1996",
		"info": "New Brunswick, NJ, USA",
		"venues": [
			{
				"sub_name_abbr": "conf/rta/1996",
				"sub_name": "Rewriting Techniques and Applications, 7th International Conference, RTA-96, New Brunswick, NJ, USA, July 27-30, 1996, Proceedings.",
				"count": 37,
				"papers": [
					"Rewrite-Based Automated Reasoning: Challenges Ahead.",
					"Fine-Grained Concurrent Completion.",
					"AC-Complete Unification and its Application to Theorem Proving.",
					"Superposition Theorem Proving for Albelian Groups Represented as Integer Modules.",
					"Symideal Gröbner Bases.",
					"Termination of Constructor Systems.",
					"Dummy Elimination in Equational Rewriting.",
					"On Proving Termination by Innermost Termination.",
					"A Recursive Path Ordering for Higher-Order Terms in eta-Long beta-Normal Form.",
					"Higher-Order Superposition for Dependent Types.",
					"Higher-Order Narrowing with Definitional Trees.",
					"Design Proof Assistant (Abstract).",
					"A Compiler for Nondeterministic Term Rewriting Systems.",
					"Combinatory Reduction Systems with Explicit Substitution that Preserve Strong Nomalisation.",
					"Confluence Properties of Extensional and Non-Extensional lambda-Calculi with Explicit Substitutions (Extended Abstract).",
					"On the Power of Simple Diagrams.",
					"Coherence for Sharing Proof Nets.",
					"Modularity of Termination in Term Graph Rewriting.",
					"Confluence of Terminating Conditional Rewrite Systems Revisited.",
					"Applications of Rewrite Techniques in Monoids and Rings (Abstract).",
					"Compositional Term Rewriting: An Algebraic Proof of Toyama's Theorem.",
					"The First-Order Theory of One-Step Rewriting is Undecidable.",
					"An Algorithm for Distributive Unification.",
					"On the Termination Problem for One-Rule Semi-Thue System.",
					"Efficient Second-Order Matching.",
					"Linear Second-Order Unification.",
					"Unification of Higher-Order patterns in a Simply Typed Lambda-Calculus with Finite Products and terminal Type.",
					"Decidable Approximations of Term Rewriting Systems.",
					"Semantics and Strong Sequentiality of Priority Term Rewriting Systems.",
					"Higher-Order Families.",
					"A New Proof Manager and Graphic Interface for Larch Prover.",
					"ReDuX 1.5: New Facets of Rewriting.",
					"CiME: Completion Modulo E.",
					"Distributed Larch Prover (DLP): An Experiment in Parallelizing a Rewrite-Rule Based Prover.",
					"EPIC: An Equational Language -Abstract Machine Supporting Tools-.",
					"SPIKE-AC: A System for Proofs by Induction in Associative-Commutative Theories.",
					"On Gaining Efficiency in Completion-Based Theorem Proving."
				]
			}
		]
	},
	{
		"year": "1995",
		"name": "6th RTA 1995",
		"info": "Kaiserslautern, Germany",
		"venues": [
			{
				"sub_name_abbr": "conf/rta/1995",
				"sub_name": "Rewriting Techniques and Applications, 6th International Conference, RTA-95, Kaiserslautern, Germany, April 5-7, 1995, Proceedings.",
				"count": 41,
				"papers": [
					"On Some Mathematical Logic Contributions to Rewriting Techniques: Lost Heritage (Abstract).",
					"Modularity of Completeness Revisited.",
					"Automatic Termination Proofs With Transformation Orderings.",
					"A Termination Ordering for Higher Order Rewrite System.",
					"A Complete Characterization of Termination of Op 1q -> 1r Os.",
					"On Narrowing, Refutation Proofs and Constraints.",
					"Completion for Multiple Reduction Orderings.",
					"Towards an Efficient Construction of Test Sets for Deciding Ground Reducability.",
					"Term Rewriting in Contemporary Resolution Theorem Proving (Abstract).",
					"deltao!Epsilon = 1 - Optimizing Optimal lambda-Calculus Implementations.",
					"Substitution Tree Indexing.",
					"Concurrent Garbage Collection for Concurrent Rewriting.",
					"Lazy Rewriting and Eager Machinery.",
					"A Rewrite Mechanism for Logic Programs with Negation.",
					"Level-Confluence of Conditional Rewrite Systems with Extra Variables in Right-Hand Sides.",
					"A Polynomial Algorithm Testing Partial Confluence of Basic Semi-Thue Systems.",
					"Problems in Rewriting Applied to Categorical Concepts by the Example of a Computational Comonad.",
					"Relating Two Categorial Models of Term Rewriting.",
					"Towards a Domain Theory for Termination Proofs.",
					"Higher-Order Rewrite Systems (Abstract).",
					"Infinitary Lambda Calculi and Böhm Models.",
					"Proving the Genericity Lemma by Leftmost Reduction is Simple.",
					"(Head-) Normalization of Typeable Rewrite Systems.",
					"Explicit Substitutions with de Bruijn's Levels.",
					"A Restricted Form on Higher-Order Rewriting Applied to an HDL Semantics.",
					"Rewrite Systems for Integer Arithmetic.",
					"General Solution of Systems of Linear Diophantine Equations and Inequations.",
					"Combination of Constraint Solving Techniques: An Algebraic POint of View.",
					"Some Independent Results for Equational Unification.",
					"Regular Substitution Sets: A Means of Controlling E-Unification.",
					"DISCOUNT: A SYstem for Distributed Equational Deduction.",
					"ASTRE: Towards a Fully Automated Program Transformation System.",
					"Parallel ReDuX -> PaReDuX.",
					"STORM: A MAny-to-One Associative-Commutative Matcher.",
					"LEMMA: A System for Automated Synthesis of Recursive Programs in Equational Theories.",
					"Generating Polynomial Orderings for Termination Proofs.",
					"Disguising Recursively Chained Rewrite Rules as Equational Theorems, as Implemented in the Prover EFTTP Mark 2.",
					"Prototyping Completion with Constraints Using Computational Systems.",
					"Guiding Term Reduction Through a Neural Network: Some Prelimanary Results for the Group Theory.",
					"Studying Quasigroup Identities by Rewriting Techniques: Problems and First Results.",
					"Problems in Rewriting III."
				]
			}
		]
	},
	{
		"year": "1993",
		"name": "5th RTA 1993",
		"info": "Montreal, Canada",
		"venues": [
			{
				"sub_name_abbr": "conf/rta/1993",
				"sub_name": "Rewriting Techniques and Applications, 5th International Conference, RTA-93, Montreal, Canada, June 16-18, 1993, Proceedings.",
				"count": 39,
				"papers": [
					"Rewrite Techniques in Theorem Proving (Abstract).",
					"Redundancy Criteria for Constrained Completion.",
					"Bi-rewriting, a Term Rewriting Technique for Monotonic Order Relations.",
					"A Case Study of Completion Modulo Distributivity and Abelian Groups.",
					"A Semantic Approach to Order-Sorted Rewriting.",
					"Distributing Equational Theorem Proving.",
					"On the Correctness of a Distributed Memory Gröbner basis Algorithm.",
					"Improving Transformation Systems for General E-Unification.",
					"Equational and Membership Constraints for Finite Trees.",
					"Regular Path Expression in Feature Logic.",
					"Proving Properties of Typed Lambda Terms: Realizability, Covers, and Sheaves (Abstract).",
					"Some Lambda Calculi with Categorial Sums and Products.",
					"Paths, Computations and Labels in the Lambda-Calculus.",
					"Confluence and Superdevelopments.",
					"Relating Graph and Term Rewriting via Böhm Models.",
					"Topics in Termination.",
					"Total Termination of Term Rewriting.",
					"Simple Termination is Difficult.",
					"Optimal Normalization in Orthogonal Term Rewriting Systems.",
					"A Graph Reduction Approach to Incremental Term Rewriting (Preliminary Report).",
					"Generating Tables for Bottom-Up Matching.",
					"On some Algorithmic Problems for Groups and Monoids.",
					"Combination Techniques and Decision Problems for Disunification.",
					"The Negation Elimination from Syntactic Equational Formula is Decidable.",
					"Encompassment Properties and Automata with Constraints.",
					"Recursively Defined Tree Transductions.",
					"AC Complement Problems: Satisfiability and Negation Elimination.",
					"A Precedence-Based Total AC-Compatible Ordering.",
					"Extension of the Associative Path Ordering to a Chain of Associative Commutative Symbols.",
					"Polynomial Time Termination and Constraint Satisfaction Tests.",
					"Linear Interpretations by Counting Patterns.",
					"Some Undecidable Termination Problems for Semi-Thue Systems (Abstract).",
					"Saturation of First-Order (Constrained) Clauses with the Saturate System.",
					"MERILL: An Equational Reasoning System in Standard ML.",
					"Reduce the Redex -> ReDuX.",
					"AGG - An Implementation of Algebraic Graph Rewriting.",
					"Smaran: A Congruence-Closure Based System for Equational Computations.",
					"LAMBDALG: Higher Order Algebraic Specification Language.",
					"More Problems in Rewriting."
				]
			}
		]
	},
	{
		"year": "1991",
		"name": "4th RTA 1991",
		"info": "Como, Italy",
		"venues": [
			{
				"sub_name_abbr": "conf/rta/1991",
				"sub_name": "Rewriting Techniques and Applications, 4th International Conference, RTA-91, Como, Italy, April 10-12, 1991, Proceedings.",
				"count": 40,
				"papers": [
					"Transfinite Reductions in Orthogonal Term Rewriting Systems (Extended Abstract).",
					"Redex Capturing in Term Graph Rewriting (Concise Version).",
					"Rewriting, and Equational Unification: the Higher-Order Cases.",
					"Adding Algebraic Rewriting to the Untyped Lambda Calculus (Extended Abstract).",
					"Incremental Termination Proofs and the Length of Derivations.",
					"Time Bounded Rewrite Systems and Termination Proofs by Generalized Embedding.",
					"Detecting Redundant Narrowing Derivations by the LSE-SL Reducability Test.",
					"Unification, Weak Unification, Upper Bound, Lower Bound, and Generalization Problems.",
					"AC Unification Through Order-Sorted AC1 Unification.",
					"Narrowing Directed by a Graph of Terms.",
					"Adding Homomorphisms to Commutative/Monoidal Theories or How Algebra Can Help in Equational Unification.",
					"Undecidable Properties of Syntactic Theories.",
					"Goal Directed Strategies for Paramodulation.",
					"Minimal Solutions of Linear Diophantine Systems: Bounds and Algorithms.",
					"Proofs in Parameterized Specification.",
					"Completeness of Combinations of Constructor Systems.",
					"Modular Higher-Order E-Unification.",
					"On Confluence for Weakly Normalizing Systems.",
					"Program Transformation and Rewriting.",
					"An Efficient Representation of Arithmetic for Term Rewriting.",
					"Query Optimization Using Rewrite Rules.",
					"Boolean Algebra Admits No Convergent Term Rewriting System.",
					"Decidability of Confluence and Termination of Monadic Term Rewriting Systems.",
					"Bottom-Up Tree Pushdown Automata and Rewrite Systems.",
					"On Relationship Between Term Rewriting Systems and Regular Tree Languages.",
					"The Equivalence of Boundary and Confluent Graph Grammars on Graph Languages of Bounded Degree.",
					"Left-to-Right Tree Pattern Matching.",
					"Incremental Techniques for Efficient Normalization of Nonlinear Rewrite Systems.",
					"On Fairness of Completion-Based Theorem Proving Strategies.",
					"Proving Equational and Inductive Theorems by Completion and Embedding Techniques.",
					"Divergence Phenomena during Completion.",
					"Simulation Buchberger's Algorithm by Knuth-Bendix Completion.",
					"On Proving Properties of Completion Strategies.",
					"On Ground AC-Completion.",
					"Any Gound Associative-Commutative Theory Has a Finite Canonical System.",
					"A Narrowing-Based Theorem Prover.",
					"ANIGRAF: An Interactive System for the Animation of Graph Rewriting Systems with Priorities.",
					"EMMY: A Refutational Theorem Prover for First-Order Logic with Equation.",
					"The Tecton Proof System.",
					"Open Problems in Rewriting."
				]
			}
		]
	},
	{
		"year": "1989",
		"name": "3rd RTA 1989",
		"info": "Chapel Hill, North Carolina, USA",
		"venues": [
			{
				"sub_name_abbr": "conf/rta/1989",
				"sub_name": "Rewriting Techniques and Applications, 3rd International Conference, RTA-89, Chapel Hill, North Carolina, USA, April 3-5, 1989, Proceedings.",
				"count": 47,
				"papers": [
					"Term Rewriting and Universal Algebra in Historical Perspective (Abstract of Invited Lecture).",
					"Characterization of Unification Type Zero.",
					"Proof Normalization for Resolution and Paramodulation.",
					"Complete Sets of Reductions Modulo Associativity, Commutativity and Identity.",
					"Completion-Time Optimization of Rewrite-Time Goal Solving.",
					"Computing Ground Reducability and Inductively Complete Positions.",
					"Inductive Proofs by Specification Transformation.",
					"Narrowing and Unification in Functional Programming - An Evaluation Mechanism for Absolute Set Abstraction.",
					"Simulation of Turning Machines by a Left-Linear Rewrite Rule.",
					"Higher-order Unification with Dependent Function Types.",
					"An Overview of LP, The Larch Power.",
					"Graph Grammars, A New Paradigma for Implementing Visual Languages.",
					"Termination Proofs and the Length of Derivations (Preliminary Version).",
					"Abstract Rewriting with Concrete Operations.",
					"On How To Move Mountains 'Associatively and Commutatively'.",
					"Generalized Gröbner Bases: Theory and Applications. A Condensation.",
					"A Local Termination Property for Term Rewriting Systems.",
					"An Equational Logic Sampler.",
					"Modular Aspects of Properties of Term Rewriting Systems Related to Normal Forms.",
					"Priority Rewriting: Semantics, Confluence, and Conditional.",
					"Negation with Logical Variables in Conditional Rewriting.",
					"Algebraic Semantics and Complexity of Term Rewriting Systems.",
					"Optimization by Non-Deterministic, Lazy Rewriting.",
					"Combining Matching Algorithms: The Rectangular Case.",
					"Restrictions of Congruence Generated by Finite Canonical String-Rewriting Systems.",
					"Embedding with Patterns and Associated Recursive Path Ordering.",
					"Rewriting Techniques for Program Synthesis.",
					"Transforming Strongly Sequential Rewrite Systems with Constructors for Efficient parallel Execution.",
					"Efficient Ground Completion: An O(n log n) Algorithm for Generating Reduced Sets of Ground Rewrite Rules Equivalent to a Set of Ground Equations E.",
					"Extensions and Comparison of Simplification Orderings.",
					"Classes of Equational Programs that Compile into Efficient Machine Code.",
					"Fair Termination is Decidable for Ground Systems.",
					"Termination for the Direct Sum of left-Linear Term Rewriting Systems -Preliminary Draft-.",
					"Conditional Rewrite Rule Systems with Built-In Arithmetic and Induction.",
					"Consider Only General Superpositions in Completion Procedures.",
					"Solving Systems of Linear Diophantine Equations and Word Equations.",
					"SbReve2: A Term Rewriting Laboratory with (AC-) Unfailing Completion.",
					"THEOPOGLES - An efficient Theorem Prover based on Rewrite-Techniques.",
					"COMTES - An Experimental Environment for the Completion of Term Rewriting Systems.",
					"ASSPEGIQUE: An Integrated Specification Environment.",
					"KBlab: An Equational Theorem Prover for the Macintosh.",
					"Fast Knuth-Bendix Completion: Summary.",
					"Compilation of Ground Term Rewriting Systems and Applications.",
					"An Overview of Rewrite Rule Laboratory (RRL).",
					"InvX: An Automatic Function Inverter.",
					"A Parallel Implementation of Rewriting and Narrowing.",
					"Morphocompletion for One-Relation Monoids."
				]
			}
		]
	},
	{
		"year": "1987",
		"name": "2nd RTA 1987",
		"info": "Bordeaux, France",
		"venues": [
			{
				"sub_name_abbr": "conf/rta/87",
				"sub_name": "Rewriting Techniques and Applications, 2nd International Conference, RTA-87, Bordeaux, France, May 25-27, 1987, Proceedings.",
				"count": 23,
				"papers": [
					"Term-Rewriting Implementation of Equational Logic Programming.",
					"Optimizing Equational Programs.",
					"A Compiler for Conditional Term Rewriting Systems.",
					"How to Choose Weights in the Knuth Bendix Ordering.",
					"Detecting Looping Simplifications.",
					"Combinatorial Hypermap Rewriting.",
					"Th Word Problem for Finitely Presented Monoids and Finite Canonical Rewriting Systems.",
					"Term Rewriting Systems with Priorities.",
					"A Gap Between Linear and Non Linear Term-Rewriting Systems (1).",
					"Code Generator Generation Based on Template-Driven Target Term Rewriting.",
					"Descendants of Regular Language in a Class of Rewriting Systems: Algorithm and Complexity of an Automata Construction.",
					"Groups Presented by Certain Classes of Finite Length-Reducing String-Rewriting Systems.",
					"Some Results about Confluence on a Given Congruence Class.",
					"Ground Confluence.",
					"Structured Contextual Rewriting.",
					"Schematization of Infinite Sets of Rewrite Rules. Application to the Divergence of Completion Processes.",
					"Completion for Rewriting Modulo a Congruence.",
					"On Equational Theories, Unification and Decidability.",
					"A General Complete E-Unification Procedure.",
					"Improving Basic Narrowing Techniques.",
					"Strategy-Controlled Reduction and Narrowing.",
					"Algorithmic Complexity of Term Rewriting Systems.",
					"Optimal Speedups for Parallel Pattern Matching in Trees."
				]
			}
		]
	},
	{
		"year": "1985",
		"name": "1st RTA 1985",
		"info": "Dijon, France",
		"venues": [
			{
				"sub_name_abbr": "conf/rta/1985",
				"sub_name": "Rewriting Techniques and Applications, First International Conference, RTA-85, Dijon, France, May 20-22, 1985, Proceedings.",
				"count": 23,
				"papers": [
					"Basic Features and Development of the Critical-Pair/Completion Procedure.",
					"Contextual Rewriting.",
					"Thue Systems as Rewriting Systems.",
					"Deciding Algebraic Properties of Monoids Presented by Finite Church-Rosser Thue Systems.",
					"Two Applications of Equational Theories to Database Theory.",
					"An Experiment in Partial Evaluation: The Generation of a Compiler Generator.",
					"NARROWER: A New Algorithm for Unification and Its Application to Logic Programming.",
					"Solving Type Equations by Graph Rewriting.",
					"Termination.",
					"Path of Subterms Ordering and Recursive Decomposition Ordering Revisited.",
					"Associative Path Orderings.",
					"A Procedure for Automatically Proving the Termination of a Set of Rewrite Rules.",
					"PETRIREVE: Proving Petri Net Properties with Rewriting Systems.",
					"Fairness in Term Rewriting Systems.",
					"Two Results in Term Rewriting Theorem Proving.",
					"Handling Function Definitions through Innermost Superposition and Rewriting.",
					"An Ideal-Theoretic Approach to Work Problems and Unification Problems over Finitely Presented Commutative Algebras.",
					"Combining Unification Algorithms for Confined Regular Equational Theories.",
					"An Algebraic Approch to Unification Under Assoiativity and Commutativity.",
					"Unification Problems with One-Sided Distributivity.",
					"Fast Many-to-One Matching Algorithms.",
					"Complexity of Matching Problems.",
					"The Set of Unifiers in Typed Lambda-Calculus as Regular Expression."
				]
			}
		]
	}
]