[
	{
		"year": "2021",
		"name": "24th SAT 2021",
		"info": "Barcelona, Spain",
		"venues": [
			{
				"sub_name_abbr": "conf/sat/2021",
				"sub_name": "Theory and Applications of Satisfiability Testing - SAT 2021 - 24th International Conference, Barcelona, Spain, July 5-9, 2021, Proceedings.",
				"count": 37,
				"papers": [
					"OptiLog: A Framework for SAT-based Systems.",
					"PyDGGA: Distributed GGA for Automatic Configuration.",
					"QBFFam: A Tool for Generating QBF Families from Proof Complexity.",
					"Davis and Putnam Meet Henkin: Solving DQBF with Resolution.",
					"Lower Bounds for QCDCL via Formula Gauge.",
					"Deep Cooperation of CDCL and Local Search for SAT.",
					"Hash-Based Preprocessing and Inprocessing Techniques in SAT Solvers.",
					"Hardness and Optimality in QBF Proof Systems Modulo NP.",
					"Characterizing Tseitin-Formulas with Short Regular Resolution Refutations.",
					"Weighted Model Counting Without Parameter Variables.",
					"ProCount: Weighted Projected Model Counting with Graded Project-Join Trees.",
					"Efficient All-UIP Learned Clause Minimization.",
					"Solving Non-uniform Planted and Filtered Random SAT Formulas Greedily.",
					"MCP: Capturing Big Data by Satisfiability (Tool Description).",
					"Chinese Remainder Encoding for Hamiltonian Cycles.",
					"Efficient SAT-Based Minimal Model Generation Methods for Modal Logic S5.",
					"DiMo - Discrete Modelling Using Propositional Logic.",
					"SAT-Based Rigorous Explanations for Decision Lists.",
					"Investigating the Existence of Costas Latin Squares via Satisfiability Testing.",
					"Assessing Progress in SAT Solvers Through the Lens of Incremental SAT.",
					"Projection Heuristics for Binary Branchings Between Sum and Product.",
					"On Dedicated CDCL Strategies for PB Solvers.",
					"Efficient Local Search for Pseudo Boolean Optimization.",
					"Scheduling Reach Mahjong Tournaments Using Pseudoboolean Constraints.",
					"On the Hierarchical Community Structure of Practical Boolean Formulas.",
					"Smt-Switch: A Solver-Agnostic C++ API for SMT Solving.",
					"The MergeSat Solver.",
					"Proof Complexity of Symbolic QBF Reasoning.",
					"XOR Local Search for Boolean Brent Equations.",
					"A Fast Algorithm for SAT in Terms of Formula Length.",
					"MedleySolver: Online SMT Algorithm Selection.",
					"Leveraging GPUs for Effective Clause Sharing in Parallel SAT Solving.",
					"A Proof Builder for Max-SAT.",
					"Certified DQBF Solving by Definition Extraction.",
					"Scalable SAT Solving in the Cloud.",
					"DQBDD: An Efficient BDD-Based DQBF Solver.",
					"Logical Cryptanalysis with WDSat."
				]
			}
		]
	},
	{
		"year": "2020",
		"name": "23rd SAT 2020",
		"info": "Alghero, Italy",
		"venues": [
			{
				"sub_name_abbr": "conf/sat/2020",
				"sub_name": "Theory and Applications of Satisfiability Testing - SAT 2020 - 23rd International Conference, Alghero, Italy, July 3-10, 2020, Proceedings.",
				"count": 36,
				"papers": [
					"Sorting Parity Encodings by Reusing Variables.",
					"Community and LBD-Based Clause Sharing Policy for Parallel SAT Solving.",
					"Clause Size Reduction with all-UIP Learning.",
					"Trail Saving on Backtrack.",
					"Four Flavors of Entailment.",
					"Designing New Phase Selection Heuristics.",
					"On the Effect of Learned Clauses on Stochastic Local Search.",
					"SAT Heritage: A Community-Driven Effort for Archiving, Building and Running More Than Thousand SAT Solvers.",
					"Distributed Cube and Conquer with Paracooba.",
					"Reproducible Efficient Parallel SAT Solving.",
					"Improving Implementation of SAT Competitions 2017-2019 Winners.",
					"On CDCL-Based Proof Systems with the Ordered Decision Strategy.",
					"Equivalence Between Systems Stronger Than Resolution.",
					"Simplified and Improved Separations Between Regular and General Resolution by Lifting.",
					"Mycielski Graphs and PR Proofs.",
					"Towards a Better Understanding of (Partial Weighted) MaxSAT Proof Systems.",
					"Towards a Complexity-Theoretic Understanding of Restarts in SAT Solvers.",
					"On the Sparsity of XORs in Approximate Model Counting.",
					"A Faster Algorithm for Propositional Model Counting Parameterized by Incidence Treewidth.",
					"Abstract Cores in Implicit Hitting Set MaxSat Solving.",
					"MaxSAT Resolution and Subcube Sums.",
					"A Lower Bound on DNNF Encodings of Pseudo-Boolean Constraints.",
					"On Weakening Strategies for PB Solvers.",
					"Reasoning About Strong Inconsistency in ASP.",
					"Taming High Treewidth with Abstraction, Nested Dynamic Programming, and Database Technology.",
					"Reducing Bit-Vector Polynomials to SAT Using Gröbner Bases.",
					"Speeding up Quantified Bit-Vector SMT Solvers by Bit-Width Reductions and Extensions.",
					"Strong (D)QBF Dependency Schemes via Tautology-Free Resolution Paths.",
					"Short Q-Resolution Proofs with Homomorphisms.",
					"Multi-linear Strategy Extraction for QBF Expansion Proofs via Local Soundness.",
					"Positional Games and QBF: The Corrective Encoding.",
					"Matrix Multiplication: Verifying Strong Uniquely Solvable Puzzles.",
					"Satisfiability Solving Meets Evolutionary Optimisation in Designing Approximate Circuits.",
					"SAT Solving with Fragmented Hamiltonian Path Constraints for Wire Arc Additive Manufacturing.",
					"SAT-Based Encodings for Optimal Decision Trees with Explicit Paths.",
					"Incremental Encoding of Pseudo-Boolean Goal Functions Based on Comparator Networks."
				]
			}
		]
	},
	{
		"year": "2019",
		"name": "22nd SAT 2019",
		"info": "Lisbon, Portugal",
		"venues": [
			{
				"sub_name_abbr": "conf/sat/2019",
				"sub_name": "Theory and Applications of Satisfiability Testing - SAT 2019 - 22nd International Conference, SAT 2019, Lisbon, Portugal, July 9-12, 2019, Proceedings.",
				"count": 28,
				"papers": [
					"Circular (Yet Sound) Proofs.",
					"Short Proofs in QBF Expansion.",
					"Proof Complexity of QBF Symmetry Recomputation.",
					"Satisfiability Threshold for Power Law Random 2-SAT in Configuration Model.",
					"DRAT Proofs, Propagation Redundancy, and Extended Resolution.",
					"Knowledge Compilation Languages as Proof Systems.",
					"The Equivalences of Refutational QRAT.",
					"A SAT-Based System for Consistent Query Answering.",
					"Incremental Inprocessing in SAT Solving.",
					"Local Search for Fast Matrix Multiplication.",
					"Speeding Up Assumption-Based SAT.",
					"Simplifying CDCL Clause Database Reduction.",
					"QRAT Polynomially Simulates ∀ \\text -Exp+Res.",
					"QRATPre+: Effective QBF Preprocessing via Strong Redundancy Properties.",
					"On Computing the Union of MUSes.",
					"Revisiting Graph Width Measures for CNF-Encodings.",
					"DRMaxSAT with MaxHS: First Contact.",
					"Backing Backtracking.",
					"Assessing Heuristic Machine Learning Explanations with Model Counting.",
					"Syntax-Guided Rewrite Rule Enumeration for SMT Solvers.",
					"DRAT-based Bit-Vector Proofs in CVC4.",
					"Combining Resolution-Path Dependencies with Dependency Learning.",
					"Proof Complexity of Fragments of Long-Distance Q-Resolution.",
					"Guiding High-Performance SAT Solvers with Unsat-Core Predictions.",
					"Verifying Binarized Neural Networks by Angluin-Style Learning.",
					"CrystalBall: Gazing in the Black Box of SAT Solving.",
					"Clausal Abstraction for DQBF.",
					"On Super Strong ETH."
				]
			}
		]
	},
	{
		"year": "2018",
		"name": "21st SAT 2018",
		"info": "Oxford, UK",
		"venues": [
			{
				"sub_name_abbr": "conf/sat/2018pos",
				"sub_name": "Proceedings of Pragmatics of SAT 2015, Austin, Texas, USA, September 23, 2015 / Pragmatics of SAT 2018, Oxford, UK, July 7, 2018.",
				"count": 10,
				"papers": [
					"Evaluating CDCL Restart Schemes.",
					"Predicting SAT Solver Performance on Heterogeneous Hardware.",
					"Checking Unsatisfiability Proofs in Parallel.",
					"Applications of MaxSAT in Data Analysis.",
					"Competitive Sorter-based Encoding of PB-Constraints into SAT.",
					"CryptoMiniSat Switches-Optimization for Solving Cryptographic Instances.",
					"Two flavors of DRAT.",
					"The Effect of Scrambling CNFs.",
					"Tuning Parallel SAT Solvers.",
					"A Problem Meta-Data Library for Research in SAT."
				]
			},
			{
				"sub_name_abbr": "conf/sat/2018",
				"sub_name": "Theory and Applications of Satisfiability Testing - SAT 2018 - 21st International Conference, SAT 2018, Held as Part of the Federated Logic Conference, FloC 2018, Oxford, UK, July 9-12, 2018, Proceedings.",
				"count": 27,
				"papers": [
					"Dependency Quantified Boolean Formulas: An Overview of Solution Methods and Applications - Extended Abstract.",
					"Approximately Propagation Complete and Conflict Propagating Constraint Encodings.",
					"Dynamic Polynomial Watchdog Encoding for Solving Weighted MaxSAT.",
					"Solving MaxSAT with Bit-Vector Optimization.",
					"Using Combinatorial Benchmarks to Probe the Reasoning Power of Pseudo-Boolean Solvers.",
					"Machine Learning-Based Restart Policy for CDCL SAT Solvers.",
					"Chronological Backtracking.",
					"Centrality-Based Improvements to CDCL Heuristics.",
					"Fast Sampling of Perfectly Uniform Satisfying Assignments.",
					"Fast and Flexible Probabilistic Model Counting.",
					"Exploiting Treewidth for Projected Model Counting and Its Limits.",
					"Circuit-Based Search Space Pruning in QBF.",
					"Symmetries of Quantified Boolean Formulas.",
					"Local Soundness for QBF Calculi.",
					"QBF as an Alternative to Courcelle's Theorem.",
					"Polynomial-Time Validation of QCDCL Certificates.",
					"Sharpness of the Satisfiability Threshold for Non-uniform Random k-SAT.",
					"In Between Resolution and Cutting Planes: A Study of Proof Systems for Pseudo-Boolean SAT Solving.",
					"Cops-Robber Games and the Resolution of Tseitin Formulas.",
					"Minimal Unsatisfiability and Minimal Strongly Connected Digraphs.",
					"Finding All Minimal Safe Inductive Sets.",
					"Effective Use of SMT Solvers for Program Equivalence Checking Through Invariant-Sketching and Query-Decomposition.",
					"Experimenting on Solving Nonlinear Integer Arithmetic with Incremental Linearization.",
					"XOR-Satisfiability Set Membership Filters.",
					"ALIAS: A Modular Tool for Finding Backdoors for SAT.",
					"PySAT: A Python Toolkit for Prototyping with SAT Oracles.",
					"Constrained Image Generation Using Binarized Neural Networks with Decision Procedures."
				]
			}
		]
	},
	{
		"year": "2017",
		"name": "20th SAT 2017",
		"info": "Melbourne, VIC, Australia",
		"venues": [
			{
				"sub_name_abbr": "conf/sat/2017",
				"sub_name": "Theory and Applications of Satisfiability Testing - SAT 2017 - 20th International Conference, Melbourne, VIC, Australia, August 28 - September 1, 2017, Proceedings.",
				"count": 30,
				"papers": [
					"Probabilistic Model Counting with Short XORs.",
					"Backdoor Treewidth for SAT.",
					"New Width Parameters for Model Counting.",
					"Hard Satisfiable Formulas for Splittings by Linear Combinations.",
					"On the Community Structure of Bounded Model Checking SAT Problems.",
					"Symmetric Explanation Learning: Effective Dynamic Symmetry Handling for SAT.",
					"An Adaptive Prefix-Assignment Technique for Symmetry Reduction.",
					"An Empirical Study of Branching Heuristics Through the Lens of Global Learning Rate.",
					"Coverage-Based Clause Reduction Heuristics for CDCL Solvers.",
					"(I Can Get) Satisfaction: Preference-Based Scheduling for Concert-Goers at Multi-venue Music Festivals.",
					"On Tackling the Limits of Resolution in SAT Solving.",
					"Improving MCS Enumeration via Caching.",
					"Introducing Pareto Minimal Correction Subsets.",
					"A Distributed Version of Syrup.",
					"PaInleSS: A Framework for Parallel SAT Solving.",
					"A Propagation Rate Based Splitting Heuristic for Divide-and-Conquer Solvers.",
					"Shortening QBF Proofs with Dependency Schemes.",
					"A Little Blocked Literal Goes a Long Way.",
					"Dependency Learning for QBF.",
					"A Resolution-Style Proof System for DQBF.",
					"From DQBF to QBF by Dependency Elimination.",
					"Theory Refinement for Program Verification.",
					"On Simplification of Formulas with Unconstrained Variables and Quantifiers.",
					"A Benders Decomposition Approach to Deciding Modular Linear Integer Arithmetic.",
					"SAT-Based Local Improvement for Finding Tree Decompositions of Small Width.",
					"A Lower Bound on CNF Encodings of the At-Most-One Constraint.",
					"SAT-Encodings for Special Treewidth and Pathwidth.",
					"MaxPre: An Extended MaxSAT Preprocessor.",
					"The GRAT Tool Chain - Efficient (UN)SAT Certificate Checking with Formal Correctness Guarantees.",
					"CNFgen: A Generator of Crafted Benchmarks."
				]
			}
		]
	},
	{
		"year": "2016",
		"name": "19th SAT 2016",
		"info": "Bordeaux, France",
		"venues": [
			{
				"sub_name_abbr": "conf/sat/2016",
				"sub_name": "Theory and Applications of Satisfiability Testing - SAT 2016 - 19th International Conference, Bordeaux, France, July 5-8, 2016, Proceedings.",
				"count": 36,
				"papers": [
					"Parameterized Compilation Lower Bounds for Restricted CNF-Formulas.",
					"Satisfiability via Smooth Pictures.",
					"Solution-Graphs of Boolean Formulas and Isomorphism.",
					"Strong Backdoors for Default Logic.",
					"The Normalized Autocorrelation Length of Random Max r -Sat Converges in Probability to (1-1/2^r)/r.",
					"Tight Upper Bound on Splitting by Linear Combinations for Pigeonhole Principle.",
					"Extreme Cases in SAT Problems.",
					"Improved Static Symmetry Breaking for SAT.",
					"Learning Rate Based Branching Heuristic for SAT Solvers.",
					"On the Hardness of SAT with Community Structure.",
					"Trade-offs Between Time and Memory in a Tighter Model of CDCL SAT Solvers.",
					"A SAT Approach to Branchwidth.",
					"Computing Maximum Unavoidable Subgraphs Using SAT Solvers.",
					"Heuristic NPN Classification for Large Functions Using AIGs and LEXSAT.",
					"Solving and Verifying the Boolean Pythagorean Triples Problem via Cube-and-Conquer.",
					"Deciding Bit-Vector Formulas with mcSAT.",
					"Solving Quantified Bit-Vector Formulas Using Binary Decision Diagrams.",
					"Speeding up the Constraint-Based Method in Difference Logic.",
					"Synthesis of Domain Specific CNF Encoders for Bit-Vector Solvers.",
					"Finding Finite Models in Multi-sorted First-Order Logic.",
					"MCS Extraction with Sublinear Oracle Queries.",
					"Predicate Elimination for Preprocessing in First-Order Theorem Proving.",
					"Incremental Determinization.",
					"Non-prenex QBF Solving Using Abstraction.",
					"On Q-Resolution and CDCL QBF Solving.",
					"On Stronger Calculi for QBFs.",
					"Q-Resolution with Generalized Axioms.",
					"2QBF: Challenges and Solutions.",
					"Dependency Schemes for DQBF.",
					"Lifting QBF Resolution Calculi to DQBF.",
					"Long Distance Q-Resolution with Dependency Schemes.",
					"BEACON: An Efficient SAT-Based Tool for Debugging EL^+ Ontologies.",
					"HordeQBF: A Modular and Massively Parallel QBF Solver.",
					"LMHS: A SAT-IP Hybrid MaxSAT Solver.",
					"OpenSMT2: An SMT Solver for Multi-core and Cloud Computing.",
					"SpyBug: Automated Bug Detection in the Configuration Space of SAT Solvers."
				]
			},
			{
				"sub_name_abbr": "conf/sat/2016qbf",
				"sub_name": "Proceedings of the 4th International Workshop on Quantified Boolean Formulas (QBF 2016) co-located with 19th International Conference on Theory and Applications of Satisfiability Testing (SAT 2016), Bordeaux, France, July 4, 2016.",
				"count": 7,
				"papers": [
					"The Ninth QBF Solvers Evaluation - Preliminary Report.",
					"QBF Encoding of Generalized Tic-Tac-Toe.",
					"Dynamic Programming-based QBF Solving.",
					"Dependency Schemes in QBF Calculi: Semantics and Soundness.",
					"ASPQ: An ASP-Based 2QBF Solver.",
					"The QBF Solver AIGSolve.",
					"SAT-to-SAT in QBFEval 2016."
				]
			}
		]
	},
	{
		"year": "2015",
		"name": "18th SAT 2015",
		"info": "Austin, TX, USA",
		"venues": [
			{
				"sub_name_abbr": "conf/sat/2015",
				"sub_name": "Theory and Applications of Satisfiability Testing - SAT 2015 - 18th International Conference, Austin, TX, USA, September 24-27, 2015, Proceedings.",
				"count": 30,
				"papers": [
					"CCAnr: A Configuration Checking Based Local Search Solver for Non-random Satisfiability.",
					"PBLib - A Library for Encoding Pseudo-Boolean Constraints into CNF.",
					"Speeding up MUS Extraction with Preprocessing and Chunking.",
					"Improved Algorithms for Sparse MAX-SAT and MAX-k-CSP.",
					"Laissez-Faire Caching for Parallel #SAT Solving.",
					"SATGraf: Visualizing the Evolution of SAT Formula Structure in Solvers.",
					"Hints Revealed.",
					"Mining Backbone Literals in Incremental SAT - A New Kind of Incremental Data.",
					"Constructing SAT Filters with a Quantum Annealer.",
					"#∃SAT: Projected Model Counting.",
					"Computing Maximal Autarkies with Few and Simple Oracle Queries.",
					"HordeSat: A Massively Parallel Portfolio SAT Solver.",
					"Preprocessing for DQBF.",
					"Incrementally Computing Minimal Unsatisfiable Cores of QBFs via a Clause Group Solver API.",
					"On Compiling CNFs into Structured Deterministic DNNFs.",
					"SpySMAC: Automated Configuration and Performance Analysis of SAT Solvers.",
					"Community Structure Inspired Algorithms for SAT and #SAT.",
					"Using Community Structure to Detect Relevant Learnt Clauses.",
					"Recognition of Nested Gates in CNF Formulas.",
					"Exploiting Resolution-Based Representations for MaxSAT Solving.",
					"SAT-Based Formula Simplification.",
					"Volt: A Lazy Grounding Framework for Solving Very Large MaxSAT Instances.",
					"Between SAT and UNSAT: The Fundamental Difference in CDCL SAT.",
					"Efficient MUS Enumeration of Horn Formulae with Applications to Axiom Pinpointing.",
					"QELL: QBF Reasoning with Extended Clause Learning and Levelized SAT Solving.",
					"SMT-RAT: An Open Source C++ Toolbox for Strategic and Parallel SMT Solving.",
					"Search-Space Partitioning for Parallelizing SMT Solvers.",
					"A New Approach to Partial MUS Enumeration.",
					"Evaluating CDCL Variable Scoring Schemes.",
					"SAT-Based Horn Least Upper Bounds."
				]
			}
		]
	},
	{
		"year": "2014",
		"name": "17th SAT 2014",
		"info": "Vienna, Austria",
		"venues": [
			{
				"sub_name_abbr": "conf/sat/2014",
				"sub_name": "Theory and Applications of Satisfiability Testing - SAT 2014 - 17th International Conference, Held as Part of the Vienna Summer of Logic, VSL 2014, Vienna, Austria, July 14-17, 2014. Proceedings.",
				"count": 33,
				"papers": [
					"A (Biased) Proof Complexity Survey for SAT Practitioners.",
					"Cores in Core Based MaxSat Algorithms: An Analysis.",
					"Solving MaxSAT and #SAT on Structured CNF Formulas.",
					"Solving Sparse Instances of Max SAT via Width Reduction and Greedy Restriction.",
					"MUS Extraction Using Clausal Proofs.",
					"On Computing Preferred MUSes and MCSes.",
					"Conditional Lower Bounds for Failed Literals and Related Techniques.",
					"Fixed-Parameter Tractable Reductions to SAT.",
					"On Reducing Maximum Independent Set to Minimum Satisfiability.",
					"Long Proofs of (Seemingly) Simple Formulas.",
					"Proof Complexity and the Kneser-Lovász Theorem.",
					"QBF Resolution Systems and Their Proof Complexities.",
					"Unified Characterisations of Resolution Hardness Measures.",
					"Community Branching for Parallel Portfolio SAT Solvers.",
					"Lazy Clause Exchange Policy for Parallel SAT Solvers.",
					"Ultimately Incremental SAT.",
					"A SAT Attack on the Erdős Discrepancy Conjecture.",
					"Dominant Controllability Check Using QBF-Solver and Netlist Optimizer.",
					"Fast DQBF Refutation.",
					"Impact of Community Structure on SAT Solver Performance.",
					"Variable Dependencies and Q-Resolution.",
					"Detecting Cardinality Constraints in CNF.",
					"Improving Implementation of SLS Solvers for SAT and New Heuristics for k-SAT with Long Clauses.",
					"Everything You Always Wanted to Know about Blocked Sets (But Were Afraid to Ask).",
					"Minimal-Model-Guided Approaches to Solving Polynomial Constraints and Extensions.",
					"Simplifying Pseudo-Boolean Constraints in Residual Number Systems.",
					"An Ising Model Inspired Extension of the Product-Based MP Framework for SAT.",
					"Approximating Highly Satisfiable Random 2-SAT.",
					"Hypergraph Acyclicity and Propositional Model Counting.",
					"Automatic Evaluation of Reductions between NP-Complete Problems.",
					"DRAT-trim: Efficient Checking and Trimming Using Expressive Clausal Proofs.",
					"MPIDepQBF: Towards Parallel QBF Solving without Knowledge Sharing.",
					"Open-WBO: A Modular MaxSAT Solver, ."
				]
			},
			{
				"sub_name_abbr": "conf/sat/2014pos",
				"sub_name": "POS-14. Fifth Pragmatics of SAT workshop, a workshop of the SAT 2014 conference, part of FLoC 2014 during the Vienna Summer of Logic, July 13, 2014, Vienna, Austria.",
				"count": 9,
				"papers": [
					"Dolius: A Distributed Parallel SAT Solving Framework.",
					"Validating Unsatisfiability Results of Clause Sharing Parallel SAT Solvers.",
					"Post Mortem Analysis of SAT Solver Proofs.",
					"Formula partitioning revisited.",
					"New CNF Features and Formula Classification.",
					"Typical-case complexity and the SAT competitions.",
					"Lingeling Essentials, A Tutorial on Design and Implementation Aspects of the the SAT Solver Lingeling.",
					"Generic CDCL - A Formalization of Modern Propositional Satisfiability Solvers.",
					"iDQ: Instantiation-Based DQBF Solving."
				]
			}
		]
	},
	{
		"year": "2013",
		"name": "16th SAT 2013",
		"info": "Helsinki, Finland",
		"venues": [
			{
				"sub_name_abbr": "conf/sat/2013",
				"sub_name": "Theory and Applications of Satisfiability Testing - SAT 2013 - 16th International Conference, Helsinki, Finland, July 8-12, 2013. Proceedings.",
				"count": 34,
				"papers": [
					"The Proof-Search Problem between Bounded-Width Resolution and Bounded-Degree Semi-algebraic Proofs.",
					"Turing's Computable Real Numbers and Why They Are Still Important Today.",
					"There Are No CNF Problems.",
					"Soundness of Inprocessing in Clause Sharing SAT Solvers.",
					"Exponential Separations in a Hierarchy of Clause Learning Proof Systems.",
					"On the Resolution Complexity of Graph Non-isomorphism.",
					"On Propositional QBF Expansions and Q-Resolution.",
					"Recovering and Utilizing Partial Duality in QBF.",
					"Efficient Clause Learning for Quantified Boolean Formulas via QBF Pseudo Unit Propagation.",
					"Concurrent Clause Strengthening.",
					"Parallel MUS Extraction.",
					"A Modular Approach to MaxSAT Modulo Theories.",
					"Exploiting the Power of mip Solvers in maxsat.",
					"Community-Based Partitioning for MaxSAT Solving.",
					"Experiments with Reduction Finding.",
					"A Constraint Satisfaction Approach for Programmable Logic Detailed Placement.",
					"Minimizing Models for Tseitin-Encoded SAT Instances.",
					"Solutions for Hard and Soft Constraints Using Optimized Probabilistic Satisfiability.",
					"Quantified Maximum Satisfiability: - A Core-Guided Approach.",
					"Nested Boolean Functions as Models for Quantified Boolean Formulas.",
					"Factoring Out Assumptions to Speed Up MUS Extraction.",
					"On the Interpolation between Product-Based Message Passing Heuristics for SAT.",
					"Improving Glucose for Incremental SAT Solving with Assumptions: Application to MUS Extraction.",
					"A SAT Approach to Clique-Width.",
					"Cliquewidth and Knowledge Compilation.",
					"A Rank Lower Bound for Cutting Planes Proofs of Ramsey's Theorem.",
					"The Complexity of Theorem Proving in Autoepistemic Logic.",
					"Local Backbones.",
					"Upper and Lower Bounds for Weak Backdoor Set Detection.",
					"LearnSAT: A SAT Solver for Education.",
					"MUStICCa: MUS Extraction with Interactive Choice of Candidates.",
					"SCSat: A Soft Constraint Guided SAT Solver.",
					"Snappy: A Simple Algorithm Portfolio.",
					"Scarab: A Rapid Prototyping Tool for SAT-Based Constraint Programming Systems."
				]
			},
			{
				"sub_name_abbr": "conf/sat/2013pos",
				"sub_name": "POS-13. Fourth Pragmatics of SAT workshop, a workshop of the SAT 2013 conference, July 7, 2013, Helsinki, Finland.",
				"count": 4,
				"papers": [
					"Boosting the Performance of SLS and CDCL Solvers by Preprocessor Tuning.",
					"SAT Encodings for the Car Sequencing Problem.",
					"Analysis of Portfolio-Style Parallel SAT Solving on Current Multi-Core Architectures.",
					"Modern Cooperative Parallel SAT Solving."
				]
			}
		]
	},
	{
		"year": "2012",
		"name": "15th SAT 2012",
		"info": "Trento, Italy",
		"venues": [
			{
				"sub_name_abbr": "conf/sat/2012",
				"sub_name": "Theory and Applications of Satisfiability Testing - SAT 2012 - 15th International Conference, Trento, Italy, June 17-20, 2012. Proceedings.",
				"count": 54,
				"papers": [
					"Understanding IC3.",
					"Satisfiability and The Art of Computer Programming.",
					"Choosing Probability Distributions for Stochastic Local Search and the Role of Make versus Break.",
					"Off the Trail: Re-examining the CDCL Algorithm.",
					"An Improved Separation of Regular Resolution from Pool Resolution and Clause Learning.",
					"Computing Resolution-Path Dependencies in Linear Time , .",
					"Strong Backdoors to Nested Satisfiability.",
					"Extended Failed-Literal Preprocessing for Quantified Boolean Formulas.",
					"On Sequent Systems and Resolution for QBFs.",
					"Solving QBF with Counterexample Guided Refinement.",
					"Henkin Quantifiers and Boolean Formulae.",
					"Lynx: A Programmatic SAT Solver for the RNA-Folding Problem.",
					"Generalized Property Directed Reachability.",
					"SMT-Aided Combinatorial Materials Discovery.",
					"Faulty Interaction Identification via Constraint Solving and Optimization.",
					"Revisiting Clause Exchange in Parallel SAT Solving.",
					"Designing Scalable Parallel SAT Solvers.",
					"Evaluating Component Solver Contributions to Portfolio-Based Algorithm Selectors.",
					"Efficient SAT Solving under Assumptions.",
					"Preprocessing in Incremental SAT.",
					"On Davis-Putnam Reductions for Minimally Unsatisfiable Clause-Sets.",
					"Improvements to Core-Guided Binary Search for MaxSAT.",
					"On Efficient Computation of Variable MUSes.",
					"Interpolant Strength Revisited.",
					"Exponential Lower Bounds for DPLL Algorithms on Satisfiable Random 3-CNF Formulas.",
					"Parameterized Complexity of Weighted Satisfiability Problems.",
					"Fixed-Parameter Tractability of Satisfying beyond the Number of Variables.",
					"Finding Efficient Circuits for Ensemble Computation.",
					"Conflict-Driven XOR-Clause Learning.",
					"Perfect Hashing and CNF Encodings of Cardinality Constraints.",
					"The Community Structure of SAT Formulas.",
					"SATLab: X-Raying Random k-SAT - (Tool Presentation).",
					"Resolution-Based Certificate Extraction for QBF - (Tool Presentation).",
					"Coprocessor 2.0 - A Flexible CNF Simplifier - (Tool Presentation).",
					"SMT-RAT: An SMT-Compliant Nonlinear Real Arithmetic Toolbox - (Tool Presentation).",
					"CoPAn: Exploring Recurring Patterns in Conflict Analysis of CDCL SAT Solvers - (Tool Presentation).",
					"Azucar: A SAT-Based CSP Solver Using Compact Order Encoding - (Tool Presentation).",
					"SatX10: A Scalable Plug&Play Parallel SAT Framework - (Tool Presentation).",
					"Improved Single Pass Algorithms for Resolution Proof Reduction - (Poster Presentation).",
					"Creating Industrial-Like SAT Instances by Clustering and Reconstruction - (Poster Presentation).",
					"Incremental QBF Preprocessing for Partial Design Verification - (Poster Presentation).",
					"Concurrent Cube-and-Conquer - (Poster Presentation).",
					"Satisfying versus Falsifying in Local Search for Satisfiability - (Poster Presentation).",
					"Exploiting Historical Relationships of Clauses and Variables in Local Search for Satisfiability - (Poster Presentation).",
					"Towards Massively Parallel Local Search for SAT - (Poster Presentation).",
					"Optimizing MiniSAT Variable Orderings for the Relational Model Finder Kodkod - (Poster Presentation).",
					"A Cardinality Solver: More Expressive Constraints for Free - (Poster Presentation).",
					"Single-Solver Algorithms for 2QBF - (Poster Presentation).",
					"An Efficient Method for Solving UNSAT 3-SAT and Similar Instances via Static Decomposition - (Poster Presentation).",
					"Intensification Search in Modern SAT Solvers - (Poster Presentation).",
					"Using Term Rewriting to Solve Bit-Vector Arithmetic Problems - (Poster Presentation).",
					"Learning Polynomials over GF(2) in a SAT Solver - (Poster Presentation).",
					"Learning Back-Clauses in SAT - (Poster Presentation).",
					"Augmenting Clause Learning with Implied Literals - (Poster Presentation)."
				]
			}
		]
	},
	{
		"year": "2011",
		"name": "14th SAT 2011",
		"info": "Ann Arbor, MI, USA",
		"venues": [
			{
				"sub_name_abbr": "conf/sat/2011",
				"sub_name": "Theory and Applications of Satisfiability Testing - SAT 2011 - 14th International Conference, SAT 2011, Ann Arbor, MI, USA, June 19-22, 2011. Proceedings.",
				"count": 37,
				"papers": [
					"Connecting SAT Algorithms and Complexity Lower Bounds.",
					"Concolic Testing and Constraint Satisfaction.",
					"Parameterized Complexity of DPLL Search Procedures.",
					"Satisfiability Certificates Verifiable in Subexponential Time.",
					"On Variables with Few Occurrences in Conjunctive Normal Forms.",
					"Satisfiability of Acyclic and almost Acyclic CNF Formulas (II).",
					"BDDs for Pseudo-Boolean Constraints - Revisited.",
					"DPLL+ROBDD Derivation Applied to Inversion of Some Cryptographic Functions.",
					"πDD: A New Decision Diagram for Efficient Problem Solving in Permutation Space.",
					"How to Apply SAT-Solving for the Equivalence Test of Monotone Normal Forms.",
					"Enumerating All Solutions of a Boolean CSP by Non-decreasing Weight.",
					"A Satisfiability-Based Approach for Embedding Generalized Tanglegrams on Level Graphs.",
					"Minimally Unsatisfiable Boolean Circuits.",
					"On Improving MUS Extraction Algorithms.",
					"Faster Extraction of High-Level Minimal Unsatisfiable Cores.",
					"On Freezing and Reactivating Learnt Clauses.",
					"Efficient CNF Simplification Based on Binary Implication Graphs.",
					"Between Restarts and Backjumps.",
					"Abstraction-Based Algorithm for 2QBF.",
					"Transformations into Normal Forms for Quantified Circuits.",
					"Failed Literal Detection for QBF.",
					"Reducing Chaos in SAT-Like Search: Finding Solutions Close to a Given One.",
					"Generating Diverse Solutions in SAT.",
					"Captain Jack: New Variable Selection Heuristics in Local Search for SAT.",
					"Careful Ranking of Multiple Solvers with Timeouts and Ties.",
					"Generalized Conflict-Clause Strengthening for Satisfiability Solvers.",
					"Empirical Study of the Anatomy of Modern Sat Solvers.",
					"Translating Pseudo-Boolean Constraints into CNF.",
					"Analyzing the Instances of the MaxSAT Evaluation.",
					"Model Counting Using the Inclusion-Exclusion Principle.",
					"Phase Transitions in Knowledge Compilation: An Experimental Study.",
					"EagleUP: Solving Random 3-SAT Using SLS with Unit Propagation.",
					"Non-Model-Based Algorithm Portfolios for SAT.",
					"The Order Encoding: From Tractable CSP to Tractable SAT.",
					"Applying UCT to Boolean Satisfiability.",
					"A Compact and Efficient SAT-Encoding of Finite Domain CSP.",
					"Learning Polarity from Structure in SAT."
				]
			}
		]
	},
	{
		"year": "2010",
		"name": "13th SAT 2010",
		"info": "Edinburgh, UK",
		"venues": [
			{
				"sub_name_abbr": "conf/sat/2010",
				"sub_name": "Theory and Applications of Satisfiability Testing - SAT 2010, 13th International Conference, SAT 2010, Edinburgh, UK, July 11-14, 2010. Proceedings.",
				"count": 37,
				"papers": [
					"The Big Deal: Applying Constraint Satisfaction Technologies Where It Makes the Difference.",
					"Exact Algorithms and Complexity.",
					"Improving Stochastic Local Search for SAT with a New Probability Distribution.",
					"Lower Bounds for Width-Restricted Clause Learning on Small Width Formulas.",
					"Proof Complexity of Propositional Default Logic.",
					"Automated Testing and Debugging of SAT and QBF Solvers.",
					"Rewriting (Dependency-)Quantified 2-CNF with Arbitrary Free Literals into Existential 2-HORN.",
					"Synthesizing Shortest Linear Straight-Line Programs over GF(2) Using SAT.",
					"sQueezeBF: An Effective Preprocessor for QBFs Based on Equivalence Reasoning.",
					"Non Uniform Selection of Solutions for Upper Bounding the 3-SAT Threshold.",
					"Symmetry and Satisfiability: An Update.",
					"A Non-prenex, Non-clausal QBF Solver with Game-State Learning.",
					"SAT Solving with Reference Points.",
					"Integrating Dependency Schemes in Search-Based QBF Solvers.",
					"An Exact Algorithm for the Boolean Connectivity Problem for k-CNF.",
					"Improving Unsatisfiability-Based Algorithms for Boolean Optimization.",
					"Encoding Techniques, Craig Interpolants and Bounded Model Checking for Incomplete Designs.",
					"Statistical Methodology for Comparison of SAT Solvers.",
					"On the Relative Merits of Simple Local Search Methods for the MAX-SAT Problem.",
					"The Seventh QBF Solvers Evaluation (QBFEVAL'10).",
					"Complexity Results for Linear XSAT-Problems.",
					"Bounds on Threshold of Regular Random k-SAT.",
					"Dynamic Scoring Functions with Variable Expressions: New SLS Methods for Solving SAT.",
					"Improved Local Search for Circuit Satisfiability.",
					"A System for Solving Constraint Satisfaction Problems with SMT.",
					"Two Techniques for Minimizing Resolution Proofs.",
					"On Moderately Exponential Time for SAT.",
					"Minimising Deterministic Büchi Automata Precisely Using SAT Solving.",
					"Exploiting Circuit Representations in QBF Solving.",
					"Reconstructing Solutions after Blocked Clause Elimination.",
					"An Empirical Study of Optimal Noise and Runtime Distributions in Local Search.",
					"Green-Tao Numbers and SAT.",
					"Exact MinSAT Solving.",
					"Uniquely Satisfiable k-SAT Instances with Almost Minimal Occurrences of Each Variable.",
					"Assignment Stack Shrinking.",
					"Simple but Hard Mixed Horn Formulas.",
					"Zero-One Designs Produce Small Hard SAT Instances."
				]
			},
			{
				"sub_name_abbr": "conf/sat/2010pos",
				"sub_name": "POS-10. Pragmatics of SAT, Edinburgh, UK, July 10, 2010.",
				"count": 5,
				"papers": [
					"From Parallel SAT to Distributed SAT.",
					"Enhanced Gaussian Elimination in DPLL-based SAT Solvers.",
					"Improved Exact Solver for the Weighted MAX-SAT Problem.",
					"Towards Improving the Resource Usage of SAT-solvers.",
					"On Solving MaxSAT Through SAT."
				]
			}
		]
	},
	{
		"year": "2009",
		"name": "12th SAT 2009",
		"info": "Swansea, UK",
		"venues": [
			{
				"sub_name_abbr": "conf/sat/2009",
				"sub_name": "Theory and Applications of Satisfiability Testing - SAT 2009, 12th International Conference, SAT 2009, Swansea, UK, June 30 - July 3, 2009. Proceedings.",
				"count": 47,
				"papers": [
					"SAT Modulo Theories: Enhancing SAT with Special-Purpose Algorithms.",
					"Symbolic Techniques in Propositional Satisfiability Solving.",
					"Efficiently Calculating Evolutionary Tree Measures Using SAT.",
					"Finding Lean Induced Cycles in Binary Hypercubes.",
					"Finding Efficient Circuits Using SAT-Solvers.",
					"Encoding Treewidth into SAT.",
					"The Complexity of Reasoning for Fragments of Default Logic.",
					"Does Advice Help to Prove Propositional Tautologies?",
					"Backdoors in the Context of Learning.",
					"Solving SAT for CNF Formulas with a One-Sided Restriction on Variable Occurrences.",
					"On Some Aspects of Mixed Horn Formulas.",
					"Variable Influences in Conjunctive Normal Forms.",
					"Clause-Learning Algorithms with Many Restarts and Bounded-Width Resolution.",
					"An Exponential Lower Bound for Width-Restricted Clause Learning.",
					"Improved Conflict-Clause Minimization Leads to Improved Propositional Proof Traces.",
					"Boundary Points and Resolution.",
					"Sequential Encodings from Max-CSP into Partial Max-SAT.",
					"Cardinality Networks and Their Applications.",
					"New Encodings of Pseudo-Boolean Constraints into CNF.",
					"Efficient Term-ITE Conversion for Satisfiability Modulo Theories.",
					"On-the-Fly Clause Improvement.",
					"Dynamic Symmetry Breaking by Simulating Zykov Contraction.",
					"Minimizing Learned Clauses.",
					"Extending SAT Solvers to Cryptographic Problems.",
					"Improving Variable Selection Process in Stochastic Local Search for Propositional Satisfiability.",
					"A Theoretical Analysis of Search in GSAT.",
					"The Parameterized Complexity of k-Flip Local Search for SAT and MAX SAT.",
					"A Novel Approach to Combine a SLS- and a DPLL-Solver for the Satisfiability Problem.",
					"Building a Hybrid SAT Solver via Conflict-Driven, Look-Ahead and XOR Reasoning Techniques.",
					"Restart Strategy Selection Using Machine Learning Techniques.",
					"Instance-Based Selection of Policies for SAT Solvers.",
					"Width-Based Restart Policies for Clause-Learning Satisfiability Solvers.",
					"Problem-Sensitive Restart Heuristics for the DPLL Procedure.",
					"(1, 2)-QSAT: A Good Candidate for Understanding Phase Transitions Mechanisms.",
					"VARSAT: Integrating Novel Probabilistic Inference Techniques with DPLL Search.",
					"Resolution and Expressiveness of Subclasses of Quantified Boolean Formulas and Circuits.",
					"A Compact Representation for Syntactic Dependencies in QBFs.",
					"Beyond CNF: A Circuit-Based QBF Solver.",
					"Solving (Weighted) Partial MaxSAT through Satisfiability Testing.",
					"Nonlinear Pseudo-Boolean Optimization: Relaxation or Propagation?.",
					"Relaxed DPLL Search for MaxSAT.",
					"Branch and Bound for Boolean Optimization and the Generation of Optimality Certificates.",
					"Exploiting Cycle Structures in Max-SAT.",
					"Generalizing Core-Guided Max-SAT.",
					"Algorithms for Weighted Boolean Optimization.",
					"PaQuBE: Distributed QBF Solving with Advanced Knowledge Sharing.",
					"c-sat: A Parallel SAT Solver for Clusters."
				]
			}
		]
	},
	{
		"year": "2008",
		"name": "11th SAT 2008",
		"info": "Guangzhou, China",
		"venues": [
			{
				"sub_name_abbr": "conf/sat/2008",
				"sub_name": "Theory and Applications of Satisfiability Testing - SAT 2008, 11th International Conference, SAT 2008, Guangzhou, China, May 12-15, 2008. Proceedings.",
				"count": 27,
				"papers": [
					"Modelling Max-CSP as Partial Max-SAT.",
					"A Preprocessor for Max-SAT Solvers.",
					"A Generalized Framework for Conflict Analysis.",
					"Adaptive Restart Strategies for Conflict Driven SAT Solvers.",
					"New Results on the Phase Transition for Random Quantified Boolean Formulas.",
					"Designing an Efficient Hardware Implication Accelerator for SAT Solving.",
					"Attacking Bivium Using SAT Solvers.",
					"SAT Modulo the Theory of Linear Arithmetic: Exact, Inexact and Commercial Solvers.",
					"Random Instances of W[2]-Complete Problems: Thresholds, Complexity, and Algorithms.",
					"Complexity and Algorithms for Well-Structured k-SAT Instances.",
					"A Decision-Making Procedure for Resolution-Based SAT-Solvers.",
					"Online Estimation of SAT Solving Runtime.",
					"A Max-SAT Inference-Based Pre-processing for Max-Clique.",
					"SAT, UNSAT and Coloring.",
					"Computation of Renameable Horn Backdoors.",
					"A New Bound for an NP-Hard Subclass of 3-SAT Using Backdoors.",
					"Improvements to Hybrid Incremental SAT Algorithms.",
					"Searching for Autarkies to Trim Unsatisfiable Clause Sets.",
					"Nenofex: Expanding NNF for QBF Solving.",
					"SAT(ID): Satisfiability of Propositional Logic Extended with Inductive Definitions.",
					"Towards More Effective Unsatisfiability-Based Maximum Satisfiability Algorithms.",
					"A CNF Class Generalizing Exact Linear Formulas.",
					"How Many Conflicts Does It Need to Be Unsatisfiable?",
					"Speeding-Up Non-clausal Local Search for Propositional Satisfiability with Clause Learning.",
					"Local Restarts.",
					"Regular and General Resolution: An Improved Separation.",
					"Finding Guaranteed MUSes Fast."
				]
			}
		]
	},
	{
		"year": "2007",
		"name": "10th SAT 2007",
		"info": "Lisbon, Portugal",
		"venues": [
			{
				"sub_name_abbr": "conf/sat/2007",
				"sub_name": "Theory and Applications of Satisfiability Testing - SAT 2007, 10th International Conference, Lisbon, Portugal, May 28-31, 2007, Proceedings.",
				"count": 36,
				"papers": [
					"SAT: Past and Future.",
					"Encodings of Problems in Effectively Propositional Logic.",
					"Efficient Circuit to CNF Conversion.",
					"Mapping CSP into Many-Valued SAT.",
					"Circuit Based Encoding of CNF Formula.",
					"Breaking Symmetries in SAT Matrix Models.",
					"Partial Max-SAT Solvers with Clause Learning.",
					"MiniMaxSat: A New Weighted Max-SAT Solver.",
					"Solving Multi-objective Pseudo-Boolean Problems.",
					"Improved Lower Bounds for Tree-Like Resolution over Linear Inequalities.",
					"Horn Upper Bounds and Renaming.",
					"Matched Formulas and Backdoor Sets.",
					"Short XORs for Model Counting: From Theory to Practice.",
					"Variable Dependency in Local Search: Prevention Is Better Than Cure.",
					"Combining Adaptive Noise and Look-Ahead in Local Search for SAT.",
					"From Idempotent Generalized Boolean Assignments to Multi-bit Search.",
					"Satisfiability with Exponential Families.",
					"Formalizing Dangerous SAT Encodings.",
					"Algorithms for Variable-Weighted 2-SAT and Dual Problems.",
					"On the Boolean Connectivity Problem for Horn Relations.",
					"A First Step Towards a Unified Proof Checker for QBF.",
					"Dynamically Partitioning for Solving QBF.",
					"Backdoor Sets of Quantified Boolean Formulas.",
					"Bounded Universal Expansion for Preprocessing QBF.",
					"Effective Incorporation of Double Look-Ahead Procedures.",
					"Applying Logic Synthesis for Speeding Up SAT.",
					"Towards a Better Understanding of the Functionality of a Conflict-Driven SAT Solver.",
					"A Lightweight Component Caching Scheme for Satisfiability Solvers.",
					"Minimum 2CNF Resolution Refutations in Polynomial Time.",
					"Polynomial Time SAT Decision for Complementation-Invariant Clause-Sets, and Sign-non-Singular Matrices.",
					"Verifying Propositional Unsatisfiability: Pitfalls to Avoid.",
					"A Simple and Flexible Way of Computing Small Unsatisfiable Cores in SAT Modulo Theories.",
					"SAT Solving for Termination Analysis with Polynomial Interpretations.",
					"Fault Localization and Correction with QBF.",
					"Sensor Deployment for Failure Diagnosis in Networked Aerial Robots: A Satisfiability-Based Approach.",
					"Inversion Attacks on Secure Hash Functions Using satSolvers."
				]
			}
		]
	},
	{
		"year": "2006",
		"name": "9th SAT 2006",
		"info": "Seattle, WA, USA",
		"venues": [
			{
				"sub_name_abbr": "conf/sat/2006",
				"sub_name": "Theory and Applications of Satisfiability Testing - SAT 2006, 9th International Conference, Seattle, WA, USA, August 12-15, 2006, Proceedings.",
				"count": 39,
				"papers": [
					"From Propositional Satisfiability to Satisfiability Modulo Theories.",
					"CSPs: Adding Structure to SAT.",
					"Complexity of Semialgebraic Proofs with Restricted Degree of Falsity.",
					"Categorisation of Clauses in Conjunctive Normal Forms: Minimally Unsatisfiable Sub-clause-sets and the Lean Kernel.",
					"A Scalable Algorithm for Minimal Unsatisfiable Core Extraction.",
					"Minimum Witnesses for Unsatisfiable 2CNFs.",
					"Preliminary Report on Input Cover Number as a Metric for Propositional Resolution Proofs.",
					"Extended Resolution Proofs for Symbolic SAT Solving with Quantification.",
					"Encoding CNFs to Empower Component Analysis.",
					"Satisfiability Checking of Non-clausal Formulas Using General Matings.",
					"Determinization of Resolution by an Algorithm Operating on Complete Assignments.",
					"A Complete Random Jump Strategy with Guiding Paths.",
					"Applications of SAT Solvers to Cryptanalysis of Hash Functions.",
					"Functional Treewidth: Bounding Complexity in the Presence of Functional Dependencies.",
					"Encoding the Satisfiability of Modal and Description Logics into SAT: The Case Study of K(m)/ALC.",
					"SAT in Bioinformatics: Making the Case with Haplotype Inference.",
					"Lemma Learning in SMT on Linear Constraints.",
					"On SAT Modulo Theories and Optimization Problems.",
					"Fast and Flexible Difference Constraint Propagation for DPLL(T).",
					"A Progressive Simplifier for Satisfiability Modulo Theories.",
					"Dependency Quantified Horn Formulas: Models and Complexity.",
					"On Linear CNF Formulas.",
					"A Dichotomy Theorem for Typed Constraint Satisfaction Problems.",
					"A Complete Calculus for Max-SAT.",
					"On Solving the Partial MAX-SAT Problem.",
					"MAX-SAT for Formulas with Constant Clause Density Can Be Solved Faster Than in O(s2) Time.",
					"Average-Case Analysis for the MAX-2SAT Problem.",
					"Local Search for Unsatisfiability.",
					"Efficiency of Local Search.",
					"Implementing Survey Propagation on Graphics Processing Units.",
					"Characterizing Propagation Methods for Boolean Satisfiability.",
					"Minimal False Quantified Boolean Formulas.",
					"Binary Clause Reasoning in QBF.",
					"Solving Quantified Boolean Formulas with Circuit Observability Don't Cares.",
					"QBF Modeling: Exploiting Player Symmetry for Simplicity and Efficiency.",
					"Solving #SAT Using Vertex Covers.",
					"Counting Models in Integer Domains.",
					"sharpSAT - Counting Models with Advanced Component Caching and Implicit BCP.",
					"A Distribution Method for Solving SAT in Grids."
				]
			}
		]
	},
	{
		"year": "2005",
		"name": "8th SAT 2005",
		"info": "St. Andrews, UK",
		"venues": [
			{
				"sub_name_abbr": "conf/sat/2005",
				"sub_name": "Theory and Applications of Satisfiability Testing, 8th International Conference, SAT 2005, St. Andrews, UK, June 19-23, 2005, Proceedings.",
				"count": 42,
				"papers": [
					"Solving Over-Constrained Problems with SAT Technology.",
					"A Symbolic Search Based Approach for Quantified Boolean Formulas.",
					"Substitutional Definition of Satisfiability in Classical Propositional Logic.",
					"A Clause-Based Heuristic for SAT Solvers.",
					"Effective Preprocessing in SAT Through Variable and Clause Elimination.",
					"Resolution and Pebbling Games.",
					"Local and Global Complete Solution Learning Methods for QBF.",
					"Equivalence Checking of Circuits with Parameterized Specifications.",
					"Observed Lower Bounds for Random 3-SAT Phase Transition Density Using Linear Programming.",
					"Simulating Cutting Plane Proofs with Restricted Degree of Falsity by Resolution.",
					"Resolution Tunnels for Improved SAT Solver Performance.",
					"Diversification and Determinism in Local Search for Satisfiability.",
					"On Finding All Minimally Unsatisfiable Subformulas.",
					"Optimizations for Compiling Declarative Models into Boolean Formulas.",
					"Random Walk with Continuously Smoothed Variable Weights.",
					"Derandomization of PPSZ for Unique- k-SAT.",
					"Heuristics for Fast Exact Model Counting.",
					"A Scalable Method for Solving Satisfiability of Integer Linear Arithmetic Logic.",
					"DPvis - A Tool to Visualize the Structure of SAT Instances.",
					"Constraint Metrics for Local Search.",
					"Input Distance and Lower Bounds for Propositional Resolution Proof Length.",
					"Sums of Squares, Satisfiability and Maximum Satisfiability.",
					"Faster Exact Solving of SAT Formulae with a Low Number of Occurrences per Variable.",
					"A New Approach to Model Counting.",
					"Benchmarking SAT Solvers for Bounded Model Checking.",
					"Model-Equivalent Reductions.",
					"Improved Exact Solvers for Weighted Max-SAT.",
					"Quantifier Trees for QBFs.",
					"Quantifier Rewriting and Equivalence Models for Quantified Horn Formulas.",
					"A Branching Heuristics for Quantified Renamable Horn Formulas.",
					"An Improved Upper Bound for SAT.",
					"Bounded Model Checking with QBF.",
					"Variable Ordering for Efficient SAT Search by Analyzing Constraint-Variable Dependencies.",
					"Cost-Effective Hyper-Resolution for Preprocessing CNF Formulas.",
					"Automated Generation of Simplification Rules for SAT and MAXSAT.",
					"Speedup Techniques Utilized in Modern SAT Solvers.",
					"FPGA Logic Synthesis Using Quantified Boolean Satisfiability.",
					"On Applying Cutting Planes in DLL-Based Algorithms for Pseudo-Boolean Optimization.",
					"A New Set of Algebraic Benchmark Problems for SAT Solvers.",
					"A Branch-and-Bound Algorithm for Extracting Smallest Minimal Unsatisfiable Formulas.",
					"Threshold Behaviour of WalkSAT and Focused Metropolis Search on Random 3-Satisfiability.",
					"On Subsumption Removal and On-the-Fly CNF Simplification."
				]
			}
		]
	},
	{
		"year": "2004",
		"name": "7th SAT 2004",
		"info": "Vancouver, BC, Canada",
		"venues": [
			{
				"sub_name_abbr": "conf/sat/2004",
				"sub_name": "SAT 2004 - The Seventh International Conference on Theory and Applications of Satisfiability Testing, 10-13 May 2004, Vancouver, BC, Canada, Online Proceedings.",
				"count": 48,
				"papers": [
					"A Random Constraint Satisfaction Problem That Seems Hard for DPLL.",
					"From Spin Glasses to Hard Satisfiable Formulas.",
					"Combining Component Caching and Clause Learning for Effective Model Counting.",
					"Early Conflict Detection Based BCP for SAT Solving.",
					"UBCSAT: An Implementation and Experimentation Environment for SLS Algorithms for SAT & MAX-SAT.",
					"CirCUs: A Hybrid Satisfiability Solver.",
					"Computing Unsatisfiable k-SAT Instances with Few Occurrences per Variable.",
					"Algorithms for Satisfiability using Independent Sets of Variables.",
					"Derandomization of Schuler's Algorithm for SAT.",
					"Polynomial Time SAT Decision, Hypergraph Transversals and the Hermitian Rank.",
					"Approximation Algorithm for Random MAX-kSAT.",
					"Detecting Backdoor Sets with Respect to Horn and Binary Clauses.",
					"A Note on Satisfying Truth-Value Assignments of Boolean Formulas.",
					"Mapping Problems with Finite-Domain Variables into Problems with Boolean Variables.",
					"Using Lower-Bound Estimates in SAT-Based Pseudo-Boolean Optimization.",
					"Worst Case Bounds for some NP-Complete Modified Horn-SAT Problems.",
					"Satisfiability Threshold of the Skewed Random k-SAT.",
					"Local Search for Very Large SAT Problems.",
					"Local Search with Bootstrapping.",
					"Efficient Implementations of SAT Local Search.",
					"Adding a New Conflict Based Branching Heuristic in two Evolved DPLL SAT Solvers.",
					"Using Rewarding Mechanisms for Improving Branching Heuristics.",
					"On Computing Minimum Unsatisfiable Cores.",
					"Visualizing the Internal Structure of SAT Instances (Preliminary Report).",
					"Using DPLL for Efficient OBDD Construction.",
					"Search vs. Symbolic Techniques in Satisfiability Solving.",
					"Solving Non-clausal Formulas with DPLL search.",
					"Automatic Extraction of Functional Dependencies.",
					"A SAT-based Decision Procedure for the Boolean Combination of Difference Constraints.",
					"Aligning CNF- and Equivalence-reasoning.",
					"An Algebraic Approach to the Complexity of Generalized Conjunctive Queries.",
					"A SAT Based Scheduler for Tournament Schedules.",
					"Incremental Compilation-to-SAT Procedures.",
					"Analysis of Search Based Algorithms for Satisfiability of Quantified Boolean Formulas Arising from Circuit State Space Diameter Problems.",
					"Looking Algebraically at Tractable Quantified Boolean Formulas.",
					"Equivalence Models for Quantified Boolean Formulas.",
					"Encoding Global Unobservability for Efficient Translation to SAT.",
					"Resolve and Expand.",
					"QBF Reasoning on Real-World Instances.",
					"A Comparative Study of 2QBF Algorithms.",
					"Dealing with Symmetries in Quantified Boolean Formulas.",
					"Improving First-order Model Searching by Propositional Reasoning and Lemma Learning.",
					"Boolean Ring Satisfiability.",
					"Game-SAT: A Preliminary Report.",
					"Verifying the On-Line Help System of SIEMENS Magnetic Resonance Tomographs using SAT (Extended Abstract).",
					"NiVER: Non Increasing Variable Elimination Resolution for Preprocessing SAT instances.",
					"The Optimality of a Fast CNF Conversion and its Use with SAT.",
					"Full CNF Encoding: The Counting Constraints Case."
				]
			},
			{
				"sub_name_abbr": "conf/sat/2004lncs",
				"sub_name": "Theory and Applications of Satisfiability Testing, 7th International Conference, SAT 2004, Vancouver, BC, Canada, May 10-13, 2004, Revised Selected Papers.",
				"count": 28,
				"papers": [
					"Mapping Problems with Finite-Domain Variables to Problems with Boolean Variables.",
					"A SAT-Based Decision Procedure for the Boolean Combination of Difference Constraints.",
					"An Algebraic Approach to the Complexity of Generalized Conjunctive Queries.",
					"Incremental Compilation-to-SAT Procedures.",
					"Resolve and Expand.",
					"Looking Algebraically at Tractable Quantified Boolean Formulas.",
					"Derandomization of Schuler's Algorithm for SAT.",
					"Polynomial Time SAT Decision, Hypergraph Transversals and the Hermitian Rank.",
					"QBF Reasoning on Real-World Instances.",
					"Automatic Extraction of Functional Dependencies.",
					"Algorithms for Satisfiability Using Independent Sets of Variables.",
					"Aligning CNF- and Equivalence-Reasoning.",
					"Using DPLL for Efficient OBDD Construction.",
					"Approximation Algorithm for Random MAX- kSAT.",
					"Clause Form Conversions for Boolean Circuits.",
					"From Spin Glasses to Hard Satisfiable Formulas.",
					"CirCUs: A Hybrid Satisfiability Solver.",
					"Equivalence Models for Quantified Boolean Formulas.",
					"Search vs. Symbolic Techniques in Satisfiability Solving.",
					"Worst Case Bounds for Some NP-Complete Modified Horn-SAT Problems.",
					"Satisfiability Threshold of the Skewed Random k-SAT.",
					"NiVER: Non-increasing Variable Elimination Resolution for Preprocessing SAT Instances.",
					"Analysis of Search Based Algorithms for Satisfiability of Propositional and Quantified Boolean Formulas Arising from Circuit State Space Diameter Problems.",
					"UBCSAT: An Implementation and Experimentation Environment for SLS Algorithms for SAT and MAX-SAT.",
					"Fifty-Five Solvers in Vancouver: The SAT 2004 Competition.",
					"March_eq: Implementing Additional Reasoning into an Efficient Look-Ahead SAT Solver.",
					"Zchaff2004: An Efficient SAT Solver.",
					"The Second QBF Solvers Comparative Evaluation."
				]
			}
		]
	},
	{
		"year": "2003",
		"name": "6th SAT 2003",
		"info": "Santa Margherita Ligure, Italy",
		"venues": [
			{
				"sub_name_abbr": "conf/sat/2003",
				"sub_name": "Theory and Applications of Satisfiability Testing, 6th International Conference, SAT 2003. Santa Margherita Ligure, Italy, May 5-8, 2003 Selected Revised Papers.",
				"count": 38,
				"papers": [
					"Satisfiability and Computing van der Waerden Numbers.",
					"An Algorithm for SAT Above the Threshold.",
					"Watched Data Structures for QBF Solvers.",
					"How Good Can a Resolution Based SAT-solver Be?",
					"A Local Search SAT Solver Using an Effective Switching Strategy and an Efficient Unit Propagation.",
					"Density Condensation of Boolean Formulas.",
					"SAT Based Predicate Abstraction for Hardware Verification.",
					"On Boolean Models for Quantified Boolean Horn Formulas.",
					"Local Search on SAT-encoded Colouring Problems.",
					"A Study of Pure Random Walk on Random Satisfiability Problems with \"Physical\" Methods.",
					"Hidden Threshold Phenomena for Fixed-Density SAT-formulae.",
					"Improving a Probabilistic 3-SAT Algorithm by Dynamic Search and Independent Clause Pairs.",
					"Width-Based Algorithms for SAT and CIRCUIT-SAT: (Extended Abstract).",
					"Linear Time Algorithms for Some Not-All-Equal Satisfiability Problems.",
					"On Fixed-Parameter Tractable Parameterizations of SAT.",
					"On the Probabilistic Approach to the Random Satisfiability Problem.",
					"Comparing Different Prenexing Strategies for Quantified Boolean Formulas.",
					"Solving Error Correction for Large Data Sets by Means of a SAT Solver.",
					"Using Problem Structure for Efficient Clause Learning.",
					"Abstraction-Driven SAT-based Analysis of Security Protocols.",
					"A Case for Efficient Solution Enumeration.",
					"Cache Performance of SAT Solvers: a Case Study for Efficient Implementation of Algorithms.",
					"Local Consistencies in SAT.",
					"Guiding SAT Diagnosis with Tree Decompositions.",
					"On Computing k-CNF Formula Properties.",
					"Effective Preprocessing with Hyper-Resolution and Equality Reduction.",
					"Read-Once Unit Resolution.",
					"The Interaction Between Inference and Branching Heuristics.",
					"Hypergraph Reductions and Satisfiability Problems.",
					"SBSAT: a State-Based, BDD-Based Satisfiability Solver.",
					"Computing Vertex Eccentricity in Exponentially Large Graphs: QBF Formulation and Solution.",
					"The Combinatorics of Conflicts between Clauses.",
					"Conflict-Based Selection of Branching Rules.",
					"The Essentials of the SAT 2003 Competition.",
					"Challenges in the QBF Arena: the SAT'03 Evaluation of QBF Solvers.",
					"kcnfs: An Efficient Solver for Random k-SAT Formulae.",
					"An Extensible SAT-solver.",
					"Survey and Belief Propagation on Random K-SAT."
				]
			}
		]
	},
	{
		"year": "2001",
		"name": "SAT 2001",
		"info": "Boston, Massachusetts, USA",
		"venues": []
	}
]