[
    {
        "name": "SICOMP",
        "year": "2021",
        "info": "Volume 50, 2021",
        "count": 65,
        "papers": [
            "A Near-Linear Approximation Scheme for Multicuts of Embedded Graphs With a Fixed Number of Terminals.",
            "Conditional Disclosure of Secrets: Amplification, Closure, Amortization, Lower-bounds, and Separations.",
            "Perfect Secure Computation in Two Rounds.",
            "Structure Versus Hardness Through the Obfuscation Lens.",
            "Maximum Rectilinear Convex Subsets.",
            "Query-to-Communication Lifting Using Low-Discrepancy Gadgets.",
            "The Complexity of Contracts.",
            "Online Contention Resolution Schemes with Applications to Bayesian Selection Problems.",
            "List-Decoding with Double Samplers.",
            "Dynamic Sampling from Graphical Models.",
            "Perfect Lp Sampling in a Data Stream.",
            "Algorithms for Weighted Matching Generalizations I: Bipartite Graphs, b-matching, and Unweighted f-factors.",
            "Fine-Grained Complexity of the Graph Homomorphism Problem for Bounded-Treewidth Graphs.",
            "Voronoi Diagrams on Planar Graphs, and Computing the Diameter in Deterministic Õ(n5/3) Time.",
            "Algorithms for Weighted Matching Generalizations II: f-factors and the Special Case of Shortest Paths.",
            "An O(nlog n)-Time Algorithm for the k-Center Problem in Trees.",
            "Isolating a Vertex via Lattices: Polytopes with Totally Unimodular Faces.",
            "New Results on Linear Size Distance Preservers.",
            "The Communication Complexity of Set Intersection and Multiple Equality Testing.",
            "Effective Wireless Scheduling via Hypergraph Sketches.",
            "Efficient Algorithm for Generalized Polynomial Partitioning and Its Applications.",
            "On the Power of Relaxed Local Decoding Algorithms.",
            "Near-Optimal Approximate Shortest Paths and Transshipment in Distributed and Streaming Models.",
            "How to Use Indistinguishability Obfuscation: Deniable Encryption, and More.",
            "Metrical Task Systems on Trees via Mirror Descent and Unfair Gluing.",
            "From Independent Sets and Vertex Colorings to Isotropic Spaces and Isotropic Decompositions: Another Bridge between Graphs and Alternating Matrix Spaces.",
            "Quantum Hardness of Learning Shallow Classical Circuits.",
            "NC Algorithms for Computing a Perfect Matching and a Maximum Flow in One-Crossing-Minor-Free Graphs.",
            "Spectral Analysis of Matrix Scaling and Operator Scaling.",
            "Distributed Spanner Approximation.",
            "Corrigendum: LDFS-Based Certifying Algorithm for the Minimum Path Cover Problem on Cocomparability Graphs.",
            "Special Section on the 48th Annual ACM Symposium on Theory of Computing (STOC 2016).",
            "Breaking the Logarithmic Barrier for Truthful Combinatorial Auctions with Submodular Bidders.",
            "A Tight Space Bound for Consensus.",
            "Two-Source Dispersers for Polylogarithmic Entropy and Improved Ramsey Graphs.",
            "Algorithmic Bayesian Persuasion.",
            "A Deterministic Almost-Tight Distributed Algorithm for Approximating Single-Source Shortest Paths.",
            "Lift-and-Round to Improve Weighted Completion Time on Unrelated Machines.",
            "A Duality-Based Unified Approach to Bayesian Mechanism Design.",
            "A (1+epsilon)-Approximation for Makespan Scheduling with Precedence Constraints Using LP Hierarchies.",
            "Bipartite Perfect Matching is in Quasi-NC.",
            "Exponential Separation of Communication and External Information.",
            "Constant-Round Interactive Proofs for Delegating Computation.",
            "Tight Bounds for Single-Pass Streaming Complexity of the Set Cover Problem.",
            "Algorithmic Stability for Adaptive Data Analysis.",
            "A Polynomial Lower Bound for Testing Monotonicity.",
            "Toward Tight Approximation Bounds for Graph Diameter and Eccentricities.",
            "Adaptive Planar Point Location.",
            "Sparse MDS Matrices over Small Fields: A Proof of the GM-MDS Conjecture.",
            "Solving CSPs Using Weak Local Consistency.",
            "Tight Bounds for the Subspace Sketch Problem with Applications.",
            "A Little Charity Guarantees Almost Envy-Freeness.",
            "A Proof of the Algebraic Tractability Conjecture for Monotone Monadic SNP.",
            "Error Thresholds for Arbitrary Pauli Noise.",
            "A Fixed-Depth Size-Hierarchy Theorem for $\\mathrm{AC}^0[\\oplus]$ via the Coin Problem.",
            "Searchable Symmetric Encryption: Optimal Locality in Linear Space via Two-Dimensional Balanced Allocations.",
            "An Algebraic Approach to Nonmalleability.",
            "Polynomial Time Approximation Schemes for the Traveling Repairman and Other Minimum Latency Problems.",
            "Simple, Deterministic, Constant-Round Coloring in Congested Clique and MPC.",
            "Graph Pattern Detection: Hardness for all Induced Patterns and Faster Noninduced Cycles.",
            "Promise Constraint Satisfaction: Algebraic Structure and a Symmetric Boolean Dichotomy.",
            "Counting Solutions to Random CNF Formulas.",
            "A Full Dichotomy for $\\hol^{c}$, Inspired by Quantum Computation.",
            "Nonlocal Games with Noisy Maximally Entangled States are Decidable.",
            "Derandomization beyond Connectivity: Undirected Laplacian Systems in Nearly Logarithmic Space."
        ]
    },
    {
        "name": "SICOMP",
        "year": "2020",
        "info": "Volume 49, 2020",
        "count": 65,
        "papers": [
            "Local Flow Partitioning for Faster Edge Connectivity.",
            "Hallucination Helps: Energy Efficient Virtual Circuit Routing.",
            "Approximate Modularity Revisited.",
            "Supercritical Space-Width Trade-offs for Resolution.",
            "Sampling Lower Bounds: Boolean Average-Case and Permutations.",
            "The Minimum Euclidean-Norm Point in a Convex Polytope: Wolfe's Combinatorial Algorithm is Exponential.",
            "Approximation Limitations of Pure Dynamic Programming.",
            "Communication Complexity of Discrete Fair Division.",
            "Zero-Knowledge Proof Systems for QMA.",
            "Robust Positioning Patterns with Low Redundancy.",
            "Tight Bounds for Planar Strongly Connected Steiner Subgraph with Fixed Number of Terminals (and Extensions).",
            "Topology Is Irrelevant (In a Dichotomy Conjecture for Infinite Domain Constraint Satisfaction Problems).",
            "An Algorithmic Proof of the Lovász Local Lemma via Resampling Oracles.",
            "The Greedy Spanner Is Existentially Optimal.",
            "Finding Cliques in Social Networks: A New Distribution-Free Model.",
            "Spanoids - An Abstraction of Spanning Structures, and a Barrier for LCCs.",
            "Distributed (Δ+1)-Coloring via Ultrafast Graph Shattering.",
            "Prophet Inequalities Made Easy: Stochastic Optimization by Pricing Nonstochastic Inputs.",
            "On Locality-Sensitive Orderings and Their Applications.",
            "Turning Big Data Into Tiny Data: Constant-Size Coresets for k-Means, PCA, and Projective Clustering.",
            "Fair Scheduling via Iterative Quasi-Uniform Sampling.",
            "Algorithms for #BIS-Hard Problems on Expander Graphs.",
            "Distributed Local Approximation Algorithms for Maximum Matching in Graphs and Hypergraphs.",
            "On Approximating the Number of k-Cliques in Sublinear Time.",
            "From Gap-Exponential Time Hypothesis to Fixed Parameter Tractable Inapproximability: Clique, Dominating Set, and More.",
            "Simple Optimal Hitting Sets for Small-Success RL.",
            "Find Your Place: Simple Distributed Algorithms for Community Detection.",
            "Special Section on the Fifty-Eighth Annual IEEE Symposium on Foundations of Computer Science (FOCS 2017).",
            "On the Power of Statistical Zero Knowledge.",
            "A Nearly Optimal Lower Bound on the Approximate Degree of AC0.",
            "Better Guarantees for k-Means and Euclidean k-Median by Primal-Dual Algorithms.",
            "Local List Recovery of High-Rate Tensor Codes and Applications.",
            "Two-Round and Non-Interactive Concurrent Non-Malleable Commitments from Time-Lock Puzzles.",
            "Hardness Results for Structured Linear Systems.",
            "Determinant-Preserving Sparsification of SDDM Matrices.",
            "Scheduling to Minimize Total Weighted Completion Time via Time-Indexed Linear Programming Relaxations.",
            "Query-to-Communication Lifting for BPP.",
            "Strong Connectivity in Directed Graphs under Failures, with Applications.",
            "Tight Revenue Gaps Among Simple Mechanisms.",
            "Amplification and Derandomization without Slowdown.",
            "Nonmalleable Extractors and Codes, with Their Many Tampered Extensions.",
            "Special Section on the Fiftieth Annual ACM Symposium on Theory of Computing (STOC 2018).",
            "Round Compression for Parallel Matching Algorithms.",
            "Smooth Heaps and a Dual View of Self-Adjusting Data Structures.",
            "Collusion Resistant Traitor Tracing from Learning with Errors.",
            "Pseudorandom Pseudo-distributions with Near-Optimal Error for Read-Once Branching Programs.",
            "Circuit Lower Bounds for Nondeterministic Quasi-polytime from a New Easy Witness Lemma.",
            "Crossing the Logarithmic Barrier for Dynamic Boolean Data Structure Lower Bounds.",
            "Shadow Tomography of Quantum States.",
            "Inapproximability of the Independent Set Polynomial in the Complex Plane.",
            "A Friendly Smoothed Analysis of the Simplex Method.",
            "Nearly Work-Efficient Parallel Algorithm for Digraph Reachability.",
            "Computational Two-Party Correlation: A Dichotomy for Key-Agreement Protocols.",
            "A Quasi-Polynomial Approximation for the Restricted Assignment Problem.",
            "Constructive Polynomial Partitioning for Algebraic Curves in ℝ3 with Applications.",
            "Hardness of Continuous Local Search: Query Complexity and Cryptographic Lower Bounds.",
            "Algorithmic Polynomials.",
            "The Power of the Combined Basic Linear Programming and Affine Relaxation for Promise Constraint Satisfaction Problems.",
            "Subdeterminant Maximization via Nonconvex Relaxations and Anti-Concentration.",
            "Resolving SINR Queries in a Dynamic Setting.",
            "A Framework for Exponential-Time-Hypothesis-Tight Algorithms and Lower Bounds in Geometric Intersection Graphs.",
            "Hardness and Ease of Curing the Sign Problem for Two-Local Qubit Hamiltonians.",
            "Connectivity Oracles for Graphs Subject to Vertex Failures.",
            "Bidimensionality and Kernels.",
            "Erratum: Three-Player Entangled XOR Games are NP-hard to Approximate."
        ]
    },
    {
        "name": "SICOMP",
        "year": "2019",
        "info": "Volume 48, 2019",
        "count": 56,
        "papers": [
            "Bounds on the Step and Namespace Complexity of Renaming.",
            "A Time Hierarchy Theorem for the LOCAL Model.",
            "Small-Depth Multilinear Formula Lower Bounds for Iterated Matrix Multiplication with Applications.",
            "Tight Bounds for Online Vector Scheduling.",
            "An Exponential Separation between Randomized and Deterministic Complexity in the LOCAL Model.",
            "The Computational Power of Depth Five Arithmetic Circuits.",
            "Simple and Tight Device-Independent Security Proofs.",
            "Using Petal-Decompositions to Build a Low Stretch Spanning Tree.",
            "Steiner Point Removal with Distortion O(log k) using the Relaxed-Voronoi Algorithm.",
            "Approximation via Correlation Decay When Strong Spatial Mixing Fails.",
            "On the Distortion of Locality Sensitive Hashing.",
            "Efficient Approximations for the Online Dispersion Problem.",
            "Minimum Bisection Is Fixed-Parameter Tractable.",
            "Special Section on the Fifty-Seventh Annual IEEE Symposium on Foundations of Computer Science (FOCS 2016).",
            "Local Search Yields a PTAS for k-Means in Doubling Metrics.",
            "Truly Subcubic Algorithms for Language Edit Distance and RNA Folding via Fast Bounded-Difference Min-Plus Product.",
            "The Constant Inapproximability of the Parameterized Dominating Set Problem.",
            "An Algorithm for Komlós Conjecture Matching Banaszczyk's Bound.",
            "Interleaved Group Products.",
            "Convergence of MCMC and Loopy BP in the Tree Uniqueness Region for the Hard-Core Model.",
            "Local Search Yields Approximation Schemes for k-Means and k-Median in Euclidean and Minor-Free Metrics.",
            "Depth Reduction for Composites.",
            "A Nearly Tight Sum-of-Squares Lower Bound for the Planted Clique Problem.",
            "Linear Hashing Is Awesome.",
            "Robust Estimators in High-Dimensions Without the Computational Intractability.",
            "Generalized Quantum Arthur-Merlin Games.",
            "Quantum Query Algorithms Are Completely Bounded Forms.",
            "Algorithms Based on *-Algebras, and Their Applications to Isomorphism of Polynomials with One Secret, Group Isomorphism, and Polynomial Identity Testing.",
            "A Polynomial-Time Approximation Algorithm for All-Terminal Network Reliability.",
            "Derandomizing Isolation in Space-Bounded Settings.",
            "Constant-Query Testability of Assignments to Constraint Satisfaction Problems.",
            "Anisotropic Triangulations via Discrete Riemannian Voronoi Diagrams.",
            "The Lovász Theta Function for Random Regular Graphs and Community Detection in the Hard Regime.",
            "Cops, Robbers, and Threatening Skeletons: Padded Decomposition for Minor-Free Graphs.",
            "Noisy Interactive Quantum Communication.",
            "A General Framework for Graph Sparsification.",
            "Constraint Satisfaction Problems for Reducts of Homogeneous Graphs.",
            "Verifiable Stream Computation and Arthur-Merlin Communication.",
            "Testing Isomorphism of Lattices over CM-Orders.",
            "Dynamic DFS in Undirected Graphs: Breaking the O(m) Barrier.",
            "Designing Networks with Good Equilibria under Uncertainty.",
            "Counting Hypergraph Colorings in the Local Lemma Regime.",
            "The Independence Number of the Birkhoff Polytope Graph, and Applications to Maximally Recoverable Codes.",
            "Hopsets with Constant Hopbound, and Applications to Approximate Shortest Paths.",
            "Revisiting \"Computation of Matrix Chain Products\".",
            "Planar Graphs of Bounded Degree Have Bounded Queue Number.",
            "Lazy Local Search Meets Machine Scheduling.",
            "The Price of Stability of Weighted Congestion Games.",
            "A Local Lemma for Focused Stochastic Algorithms.",
            "Bicriteria Data Compression.",
            "On Approximating Matrix Norms in Data Streams.",
            "Shortest Two Disjoint Paths in Polynomial Time.",
            "Certifiably Pseudorandom Financial Derivatives.",
            "Coordinated Motion Planning: Reconfiguring a Swarm of Labeled Robots with Bounded Stretch.",
            "Robust Algorithms with Polynomial Loss for Near-Unanimity CSPs.",
            "Geodesic Spanners for Points on a Polyhedral Terrain."
        ]
    },
    {
        "name": "SICOMP",
        "year": "2018",
        "info": "Volume 47, 2018",
        "count": 81,
        "papers": [
            "Approximate Polytope Membership Queries.",
            "Algebraic Attacks against Random Local Functions and Their Countermeasures.",
            "Fault-Tolerant Subgraph for Single-Source Reachability: General and Optimal.",
            "Inapproximability of Truthful Mechanisms via Generalizations of the Vapnik-Chervonenkis Dimension.",
            "Duality and Optimality of Auctions for Uniform Distributions.",
            "Multicut Is FPT.",
            "Structure of Protocols for XOR Functions.",
            "Deterministic Communication in Radio Networks.",
            "Extension Complexity of Independent Set Polytopes.",
            "Approximating Minimum Cost Connectivity Orientation and Augmentation.",
            "Erasure-Resilient Property Testing.",
            "The Submodular Secretary Problem Goes Linear.",
            "Compressing Interactive Communication Under Product Distributions.",
            "Computing k-Atomicity in Polynomial Time.",
            "Achieving New Upper Bounds for the Hypergraph Duality Problem through Logic.",
            "Bounded Independence Plus Noise Fools Products.",
            "Non-Malleable Codes from Additive Combinatorics.",
            "Eigenvectors of Orthogonally Decomposable Functions.",
            "Fully Dynamic Maximal Matching in O(log n) Update Time (Corrected Version).",
            "Making the Most of Your Samples.",
            "Slightly Superexponential Parameterized Problems.",
            "Submodular Functions: Learnability, Structure, and Optimization.",
            "Random Walks with the Minimum Degree Local Rule Have O(n2) Cover Time.",
            "On the Complexity of the Model Checking Problem.",
            "The Complexity of Boolean Holant Problems with Nonnegative Weights.",
            "Prioritized Metric Structures and Embedding.",
            "Deterministic Fully Dynamic Data Structures for Vertex Cover and Matching.",
            "Special Section on the Forty-Seventh Annual ACM Symposium on Theory of Computing (STOC 2015).",
            "Sketching and Embedding are Equivalent for Norms.",
            "Inapproximability of Nash Equilibrium.",
            "Approximating Nash Equilibria and Dense Subgraphs via an Approximate Version of Carathéodory's Theorem.",
            "Forrelation: A Problem That Optimally Separates Quantum from Classical Computing.",
            "On the Lovász Theta Function for Independent Sets in Sparse Graphs.",
            "Online Submodular Welfare Maximization: Greedy Beats 1/2 in Random Order.",
            "Edit Distance Cannot Be Computed in Strongly Subquadratic Time (Unless SETH is False).",
            "Matching Triangles and Basing Hardness on an Extremely Popular Conjecture.",
            "Indistinguishability Obfuscation for RAM Programs and Succinct Randomized Encodings.",
            "Approximating the Nash Social Welfare with Indivisible Items.",
            "Gaussian Cooling and O*(n3) Algorithms for Volume and Gaussian Volume.",
            "Improved Approximation Algorithms for (Budgeted) Node-weighted Steiner Problems.",
            "On the Complexity of Random Satisfiability Problems with Planted Solutions.",
            "Minimum Circuit Size, Graph Isomorphism, and Related Problems.",
            "Sampling Correctors.",
            "Characterizing Propositional Proofs as Noncommutative Formulas.",
            "Simplex Partitioning via Exponential Clocks and the Multiway-Cut Problem.",
            "All-or-Nothing Multicommodity Flow Problem with Bounded Fractionality in Planar Graphs.",
            "Online Buy-at-Bulk Network Design.",
            "Ranking on Arbitrary Graphs: Rematch via Continuous Linear Programming.",
            "NP-Hardness of Reed-Solomon Decoding, and the Prouhet-Tarry-Escott Problem.",
            "Spanners for Directed Transmission Graphs.",
            "Approximation Algorithms for Euler Genus and Related Problems.",
            "Separation Between Deterministic and Randomized Query Complexity.",
            "A (1+ε)-Embedding of Low Highway Dimension Graphs into Bounded Treewidth Graphs.",
            "A PTAS for the Steiner Forest Problem in Doubling Metrics.",
            "Contention Resolution with Constant Throughput and Log-Logstar Channel Accesses.",
            "Faster Space-Efficient Algorithms for Subset Sum, k-Sum, and Related Problems.",
            "Communication Lower Bounds via Critical Block Sensitivity.",
            "Special Section on the Forty-Sixth Annual ACM Symposium on Theory of Computing (STOC 2014).",
            "Breaking the Minsky-Papert Barrier for Constant-Depth Circuits.",
            "Constant Rank Two-Player Games are PPAD-hard.",
            "Fingerprinting Codes and the Price of Approximate Differential Privacy.",
            "Primal Beats Dual on Online Packing LPs in the Random-Order Model.",
            "Faster All-Pairs Shortest Paths via Circuit Complexity.",
            "Formulas versus Circuits for Small Distance Connectivity.",
            "Commutativity in the Algorithmic Lovász Local Lemma.",
            "An O(log m)-Competitive Algorithm for Online Machine Minimization.",
            "Near-Optimal Distributed Maximum Flow.",
            "Minimum Cuts and Sparsification in Hypergraphs.",
            "Watermarking Cryptographic Capabilities.",
            "A Hierarchy of Lower Bounds for Sublinear Additive Spanners.",
            "Special Section on the Fifty-Sixth Annual IEEE Symposium on Foundations of Computer Science (FOCS 2015).",
            "On Monotonicity Testing and Boolean Isoperimetric-type Theorems.",
            "Near-Optimal Bounds on the Bounded-Round Quantum Communication Complexity of Disjointness.",
            "Constructing Linear-Sized Spectral Sparsification in Almost-Linear Time.",
            "Towards an Optimal Method for Dynamic Planar Point Location.",
            "The Power of Asymmetry in Constant-Depth Circuits.",
            "Deterministic Communication vs. Partition Number.",
            "Pseudorandomness via the Discrete Fourier Transform.",
            "Interlacing Families IV: Bipartite Ramanujan Graphs of All Sizes.",
            "Sample(x)=(a*x<=t) Is a Distinguisher with Probability 1/8.",
            "If the Current Clique Algorithms Are Optimal, so Is Valiant's Parser."
        ]
    },
    {
        "name": "SICOMP",
        "year": "2017",
        "info": "Volume 46, 2017",
        "count": 62,
        "papers": [
            "Deterministic Randomness Extraction from Generalized and Distributed Santha-Vazirani Sources.",
            "Improved Average-Case Lower Bounds for De Morgan Formula Size: Matching Worst-Case Lower Bound.",
            "Rumor Spreading with No Dependence on Conductance.",
            "Time-Optimal Top-k Document Retrieval.",
            "Toward Better Formula Lower Bounds: The Composition of a Function and a Universal Relation.",
            "Super-Polylogarithmic Hypergraph Coloring Hardness via Low-Degree Long Codes.",
            "Special Section on the Fifty-Fifth Annual ACM Symposium on Foundations of Coomputer Science (FOCS 2014).",
            "Fixed-Parameter Tractable Canonization and Isomorphism Test for Graphs of Bounded Treewidth.",
            "Chasing Ghosts: Competing with Stateful Policies.",
            "Constructive Discrepancy Minimization for Convex Sets.",
            "Hardness of Coloring 2-Colorable 12-Uniform Hypergraphs with 2(log n)Ømega(1) Colors.",
            "LP-Based Algorithms for Capacitated Facility Location.",
            "An Exponential Lower Bound for Homogeneous Depth Four Arithmetic Formulas.",
            "On the Power of Homogeneous Depth 4 Arithmetic Circuits.",
            "List and Unique Coding for Interactive Communication in the Presence of Adversarial Noise.",
            "An Automatic Inequality Prover and Instance Optimal Identity Testing.",
            "Single Pass Spectral Sparsification in Dynamic Streams.",
            "An Almost-Optimally Fair Three-Party Coin-Flipping Protocol.",
            "Optimal CUR Matrix Decompositions.",
            "Performance of Sequential Local Algorithms for the Random NAE-K-SAT Problem.",
            "Equilibria of Greedy Combinatorial Auctions.",
            "Parallelism and Time in Hierarchical Self-Assembly.",
            "Partitioning Well-Clustered Graphs: Spectral Clustering Works!",
            "Near-Optimal Algorithms for Online Matrix Prediction.",
            "Estimating the Longest Increasing Sequence in Polylogarithmic Time.",
            "How to Morph Planar Graph Drawings.",
            "Holographic Algorithms with Matchgates Capture Precisely Tractable Planar #CSP.",
            "Improved Cheeger's Inequality and Analysis of Local Graph Partitioning using Vertex Expansion and Expansion Profile.",
            "Online Node-weighted Steiner Forest and Extensions via Disk Paintings.",
            "On the AC0 Complexity of Subgraph Isomorphism.",
            "Membership in Moment Polytopes is in NP and coNP.",
            "A PAC Approach to Application-Specific Algorithm Selection.",
            "Nearly Optimal NP-Hardness of Unique Coverage.",
            "Greedy Algorithms for the Maximum Satisfiability Problem: Simple Algorithms and Inapproximability Bounds.",
            "The Power of Oblivious Wireless Power.",
            "The Complexity of General-Valued CSPs.",
            "The Power of Local Consistency in Conjunctive Queries and Constraint Satisfaction Problems.",
            "A Correction on Shiloach's Algorithm for Minimum Linear Arrangement of Trees.",
            "Algorithms for Group Isomorphism via Group Extensions and Cohomology.",
            "Randomization Helps Computing a Minimum Spanning Tree under Uncertainty.",
            "The Power of Sherali-Adams Relaxations for General-Valued CSPs.",
            "Multiple-Source Multiple-Sink Maximum Flow in Directed Planar Graphs in Near-Linear Time.",
            "Universal Security for Randomness Expansion from the Spot-Checking Protocol.",
            "Direct Sum Testing.",
            "The Communication Complexity of Distributed epsilon-Approximations.",
            "Uniform Generation of Random Regular Graphs.",
            "Worst-Case Mechanism Design via Bayesian Analysis.",
            "Capacity of Interactive Communication over Erasure Channels and Channels with Feedback.",
            "Efficient Counting with Optimal Resilience.",
            "The \"Runs\" Theorem.",
            "A Polynomial Time Algorithm for Computing Extinction Probabilities of Multitype Branching Processes.",
            "(2+ε)-Sat Is NP-hard.",
            "Peeling Potatoes Near-Optimally in Near-Linear Time.",
            "Approximately Counting Triangles in Sublinear Time.",
            "Physical Limitations of Quantum Cryptographic Primitives or Optimal Bounds for Quantum Coin Flipping and Bit Commitment.",
            "On Clustering Induced Voronoi Diagrams.",
            "Approximation Algorithms for Polynomial-Expansion and Low-Density Graphs.",
            "Geometric Packing under Nonuniform Constraints.",
            "Nonstochastic Multi-Armed Bandits with Graph-Structured Feedback.",
            "Multikey Fully Homomorphic Encryption and Applications.",
            "Deterministic Polynomial-Time Approximation Algorithms for Partition Functions and Graph Polynomials.",
            "Quantum Algorithm for Systems of Linear Equations with Exponentially Improved Dependence on Precision."
        ]
    },
    {
        "name": "SICOMP",
        "year": "2016",
        "info": "Volume 45, 2016",
        "count": 70,
        "papers": [
            "The Power of Deferral: Maintaining a Constant-Competitive Steiner Tree Online.",
            "Combinatorial Walrasian Equilibrium.",
            "Minimum-Cost Network Design with (Dis)economies of Scale.",
            "Known Algorithms for Edge Clique Cover are Probably Optimal.",
            "A Size-Sensitive Discrepancy Bound for Set Systems of Bounded Primal Shatter Dimension.",
            "Clustering under Perturbation Resilience.",
            "An Almost Optimal Algorithm for Computing Nonnegative Rank.",
            "Lower Bounds for Number-in-Hand Multiparty Communication Complexity, Made Easy.",
            "Decompositions of Triangle-Dense Graphs.",
            "Pricing on Paths: A PTAS for the Highway Problem.",
            "Equilibria in Online Games.",
            "Complexity Classification of Local Hamiltonian Problems.",
            "A ck n 5-Approximation Algorithm for Treewidth.",
            "Generalized Symmetry Breaking Tasks and Nondeterminism in Concurrent Objects.",
            "Non-Black-Box Simulation from One-Way Functions and Applications to Resettable Security.",
            "Special Section on the Forty-Fifth Annual ACM Symposium on the Theory of Computing (STOC 2013).",
            "An o(n) Monotonicity Tester for Boolean Functions over the Hypercube.",
            "Answering n2+o(1) Counting Queries with Differential Privacy is Hard.",
            "Natural Proofs versus Derandomization.",
            "Approximating k-Median via Pseudo-Approximation.",
            "Maintaining Shortest Paths Under Deletions in Weighted Directed Graphs.",
            "The Geometry of Differential Privacy: The Small Database and Approximate Cases.",
            "Superlinear Advantage for Exact Quantum Algorithms.",
            "A Simpler Proof of the Existence of Quantum Weak Coin Flipping with Arbitrarily Small Bias.",
            "Approximately Counting H-Colorings is $\\#\\mathrm{BIS}$-Hard.",
            "A Fully Dynamic Reachability Algorithm for Directed Graphs with an Almost Linear Update Time.",
            "Lower Bounds for Restricted-Use Objects.",
            "The Fast Cauchy Transform and Faster Robust Linear Regression.",
            "How Good is the Chord Algorithm?",
            "The Power of Recourse for Online MST and TSP.",
            "Special Section on the Fifty-Fourth Annual IEEE Symposium on Foundations of Computer Science (FOCS 2013).",
            "Candidate Indistinguishability Obfuscation and Functional Encryption for All Circuits.",
            "Better Bin Packing Approximations via Discrepancy Theory.",
            "Dynamic Approximate All-Pairs Shortest Paths: Breaking the O(mn) Barrier and Derandomization.",
            "Three-Player Entangled XOR Games are NP-Hard to Approximate.",
            "Arithmetic Circuits: A Chasm at Depth 3.",
            "Quantum 3-SAT Is QMA1-Complete.",
            "Optimal Bounds on Approximation of Submodular and XOS Functions by Juntas.",
            "Designing FPT Algorithms for Cut Problems Using Randomized Contractions.",
            "The HOM Problem is EXPTIME-Complete.",
            "On the Power of Conditional Samples in Distribution Testing.",
            "Local Correlation Breakers and Applications to Three-Source Extractors and Mergers.",
            "Semantic Acyclicity on Graph Databases.",
            "Half-integrality, LP-branching, and FPT Algorithms.",
            "Upper and Lower Bounds on the Power of Advice.",
            "Sublinear Root Detection and New Hardness Results for Sparse Polynomials over Finite Fields.",
            "Special Section on the Forty-Fourth Annual ACM Symposium on Theory of Computing (STOC 2012).",
            "The Multiparty Communication Complexity of Set Disjointness.",
            "Routing in Undirected Graphs with Constant Congestion.",
            "Jacobian Hits Circuits: Hitting Sets, Lower Bounds for Depth-D Occur-k Formulas and Depth-3 Transcendence Degree-k Circuits.",
            "The Traveling Salesman Problem: Low-Dimensionality Implies a Polynomial Time Approximation Scheme.",
            "Computing a Nonnegative Matrix Factorization - Provably.",
            "Time-Space Trade-offs in Resolution: Superpolynomial Lower Bounds for Superlinear Space.",
            "Robustly Solvable Constraint Satisfaction Problems.",
            "A Complete Dichotomy Rises from the Capture of Vanishing Signatures.",
            "A Strongly Polynomial Algorithm for a Class of Minimum-Cost Flow Problems with Separable Convex Objectives.",
            "Frequent Directions: Simple and Deterministic Matrix Sketching.",
            "Adaptive Hardness and Composable Security in the Plain Model from Standard Assumptions.",
            "Rectangles Are Nonnegative Juntas.",
            "Minimizing Co-location Potential of Moving Entities.",
            "Total Space in Resolution.",
            "On the Existence of Extractable One-Way Functions.",
            "Private Matchings and Allocations.",
            "Mondshein Sequences (a.k.a. (2, 1)-Orders).",
            "Ferromagnetic Potts Model: Refined #BIS-hardness and Related Results.",
            "Decomposing Quantified Conjunctive (or Disjunctive) Formulas.",
            "A Simple Algorithm for Sampling Colorings of G(n, d/n) Up to The Gibbs Uniqueness Threshold.",
            "Limits on the Power of Indistinguishability Obfuscation and Functional Encryption.",
            "Nonnegative Weighted #CSP: An Effective Complexity Dichotomy.",
            "A Polynomial Regularity Lemma for Semialgebraic Hypergraphs and Its Applications in Geometry and Property Testing."
        ]
    },
    {
        "name": "SICOMP",
        "year": "2015",
        "info": "Volume 44, 2015",
        "count": 57,
        "papers": [
            "The Power of Linear Programming for General-Valued CSPs.",
            "New Doubling Spanners: Better and Simpler.",
            "Large Induced Subgraphs via Triangulations and CMSO.",
            "Fully Dynamic Maximal Matching in O(log n) Update Time.",
            "Structure Theorem and Isomorphism Test for Graphs with Excluded Topological Subgraphs.",
            "Embedding Metrics into Ultrametrics and Graphs into Spanning Trees with Constant Average Distortion.",
            "Finding Collisions in Interactive Protocols - Tight Lower Bounds on the Round and Communication Complexities of Statistically Hiding Commitments.",
            "Stronger Methods of Making Quantum Interactive Proofs Perfectly Complete.",
            "Randomized Approximation Schemes for Cuts and Flows in Capacitated Graphs.",
            "Fast Augmenting Paths by Random Sampling from Residual Graphs.",
            "Short Proofs for the Determinant Identities.",
            "Fixed-Parameter Algorithms for Finding Agreement Supertrees.",
            "Partially Symmetric Functions Are Efficiently Isomorphism Testable.",
            "Encoding Functions with Constant Online Rate, or How to Compress Garbled Circuit Keys.",
            "Anisotropic Delaunay Mesh Generation.",
            "Random Access to Grammar-Compressed Strings and Trees.",
            "Testing Probability Distributions using Conditional Samples.",
            "Low-Distortion Inference of Latent Similarities from a Multiplex Social Network.",
            "Hitting-Sets for ROABP and Sum of Set-Multilinear Circuits.",
            "A Forward-Backward Single-Source Shortest Paths Algorithm.",
            "Pattern Formation by Oblivious Asynchronous Mobile Robots.",
            "Regular Graphs and the Spectra of Two-Variable Logic with Counting.",
            "Minimum Congestion Mapping in a Cloud.",
            "How to Meet Asynchronously at Polynomial Cost.",
            "Fast Nonadaptive Deterministic Algorithm for Conflict Resolution in a Dynamic Multiple-Access Channel.",
            "Polynomial Learning of Distribution Families.",
            "Multicommodity Flows and Cuts in Polymatroidal Networks.",
            "Approximating Minimization Diagrams and Generalized Proximity Search.",
            "Cutting Corners Cheaply, or How to Remove Steiner Points.",
            "Steiner Shallow-Light Trees Are Exponentially Lighter than Spanning Ones.",
            "Operator Precedence Languages: Their Automata-Theoretic and Logic Characterization.",
            "Counting List Matrix Partitions of Graphs.",
            "Space Complexity in Polynomial Calculus.",
            "On the Number of Iterations for Dantzig-Wolfe Optimization and Packing-Covering Approximation Algorithms.",
            "Lower Bounds for Depth-4 Formulas Computing Iterated Matrix Multiplication.",
            "Iterative Rounding Approximation Algorithms for Degree-Bounded Node-Connectivity Network Design.",
            "Quantum Locally Testable Codes.",
            "Optimal Impartial Selection.",
            "Special Section on the Fifty-Third IEEE Annual Symposium on Foundations of Computer Science (FOCS 2012).",
            "Making the Long Code Shorter.",
            "On Non-Black-Box Simulation and the Impossibility of Approximate Obfuscation.",
            "A Tight Linear Time (1/2)-Approximation for Unconstrained Submodular Maximization.",
            "Diffusive Influence Systems.",
            "New Limits to Classical and Quantum Instance Compression.",
            "How to Compute in the Presence of Leakage.",
            "Lower Bounds on Information Complexity via Zero-Communication Protocols and Applications.",
            "Constructive Discrepancy Minimization by Walking on the Edges.",
            "Approximating Boolean Functions with Depth-2 Circuits.",
            "The Limits of Depth Reduction for Arithmetic Formulas: It's All About the Top Fan-In.",
            "Optimal Local Routing on Delaunay Triangulations Defined by Empty Equilateral Triangles.",
            "Quasi-Polynomial Time Approximation Scheme for Weighted Geometric Set Cover on Pseudodisks and Halfspaces.",
            "From Affine to Two-Source Extractors via Approximate Duality.",
            "Interactive Information Complexity.",
            "Sample Complexity Bounds on Differentially Private Learning via Communication Complexity.",
            "Tight Lower Bounds for the Online Labeling Problem.",
            "Smoothed Analysis of the Successive Shortest Path Algorithm.",
            "A Complementary Pivot Algorithm for Market Equilibrium under Separable, Piecewise-Linear Concave Utilities."
        ]
    },
    {
        "name": "SICOMP",
        "year": "2014",
        "info": "Volume 43, 2014",
        "count": 74,
        "papers": [
            "Hidden Translation and Translating Coset in Quantum Computing.",
            "On a Linear Program for Minimum-Weight Triangulation.",
            "A Size-Popularity Tradeoff in the Stable Marriage Problem.",
            "Distributed (Delta+1)-Coloring in Linear (in Delta) Time.",
            "The Generalized Work Function Algorithm Is Competitive for the Generalized 2-Server Problem.",
            "Online Scheduling with General Cost Functions.",
            "New Lower Bounds for the Rank of Matrix Multiplication.",
            "Position-Based Quantum Cryptography: Impossibility and Constructions.",
            "On the NP-Hardness of Max-Not-2.",
            "Characterizing Truthful Multi-armed Bandit Mechanisms.",
            "Average Sensitivity and Noise Sensitivity of Polynomial Threshold Functions.",
            "Erratum: Polynomial Time Algorithms for Finding Integer Relations Among Real Numbers.",
            "Special Section on the Fifty-First Annual IEEE Symposium on Foundations of Computer Science (FOCS 2010).",
            "The Monotone Complexity of k-Clique on Random Graphs.",
            "Determinant Sums for Undirected Hamiltonicity.",
            "Distance Oracles beyond the Thorup-Zwick Bound.",
            "Black-Box Randomized Reductions in Algorithmic Mechanism Design.",
            "Approaching Optimality for Solving SDD Linear Systems.",
            "Fixed-Parameter Tractability of Multicut Parameterized by the Size of the Cutset.",
            "Coin Flipping with Constant Bias Implies One-Way Functions.",
            "Approximate Shortest Descending Paths.",
            "Computing the Discrete Fréchet Distance in Subquadratic Time.",
            "Nonmalleable Extractors with Short Seeds and Applications to Privacy Amplification.",
            "Linear-Time Compression of Bounded-Genus Graphs into Information-Theoretically Optimal Number of Bits.",
            "Expanders via Random Spanning Trees.",
            "Monotone Submodular Maximization over a Matroid via Non-Oblivious Local Search.",
            "Improved Bounds for the Union of Locally Fat Objects in the Plane.",
            "Constraint Satisfaction Parameterized by Solution Size.",
            "Self-Improving Algorithms for Coordinatewise Maxima and Convex Hulls.",
            "Special Section on the Fifty-Second IEEE Annual Symposium on Foundations of Computer Science (FOCS 2011).",
            "Extractors for Circuit Sources.",
            "On Range Searching in the Group Model and Combinatorial Discrepancy.",
            "Near-Optimal Column-Based Matrix Reconstruction.",
            "3-SAT Faster and Simpler - Unique-SAT Bounds for PPSZ Hold in General.",
            "Quadratic Goldreich-Levin Theorems.",
            "A Constant-Factor Approximation Algorithm for Unsplittable Flow on Paths.",
            "Privacy Amplification and Nonmalleable Extractors Via Character Sums.",
            "Efficient Fully Homomorphic Encryption from (Standard) $\\mathsf{LWE}$.",
            "Min-Max Graph Partitioning and Small Set Expansion.",
            "How to Garble Arithmetic Circuits.",
            "Bayesian Combinatorial Auctions: Expanding Single Buyer Mechanisms to Many Buyers.",
            "Pseudorandom Generators for Regular Branching Programs.",
            "Quantum Multiprover Interactive Proofs with Communicating Provers.",
            "Two-Variable First-Order Logic with Equivalence Closure.",
            "Skew Bisubmodularity and Valued CSPs.",
            "Efficient Approximations of Conjunctive Queries.",
            "A Full Characterization of Quantum Advice.",
            "Almost Polynomial Factor Hardness for Closest Vector Problem with Preprocessing.",
            "Span Programs are Equivalent to Quantum Query Algorithms.",
            "The Power of Reordering for Online Minimum Makespan Scheduling.",
            "Vertex Sparsifiers: New Results from Old Techniques.",
            "Utilitarian Mechanism Design for Multiobjective Optimization.",
            "Position-Based Cryptography.",
            "Approximating Minimum-Cost k-Node Connected Subgraphs via Independence-Free Graphs.",
            "Reporting Neighbors in High-Dimensional Euclidean Space.",
            "Managing Unbounded-Length Keys in Comparison-Driven Data Structures with Applications to Online Indexing.",
            "Correlation Testing for Affine Invariant Properties on 픽pn in the High Error Regime.",
            "Analyzing Walksat on Random Formulas.",
            "Down the Rabbit Hole: Robust Proximity Search and Density Estimation in Sublinear Space.",
            "Impossibility of Differentially Private Universally Optimal Mechanisms.",
            "Almost Optimal Lower Bounds for Problems Parameterized by Clique-Width.",
            "Protecting Circuits from Computationally Bounded and Noisy Leakage.",
            "Voting with Limited Information and Many Alternatives.",
            "New Bounds for Matching Vector Families.",
            "The Geometry of Scheduling.",
            "On the Correlation of Parity and Small-Depth Circuits.",
            "Time Hierarchies for Sampling Distributions.",
            "Polynomial-Time Computation of Homotopy Groups and Postnikov Systems in Fixed Dimension.",
            "Optimal Dynamic Sequence Representations.",
            "Matroid Secretary for Regular and Decomposable Matroids.",
            "Submodular Function Maximization via the Multilinear Relaxation and Contention Resolution Schemes.",
            "Recognizing Well-Parenthesized Expressions in the Streaming Model.",
            "How to Schedule a Cascade in an Arbitrary Graph.",
            "The Complexity of Computing the Sign of the Tutte Polynomial."
        ]
    },
    {
        "name": "SICOMP",
        "year": "2013",
        "info": "Volume 42, 2013",
        "count": 95,
        "papers": [
            "A Local Clustering Algorithm for Massive Graphs and Its Application to Nearly Linear Time Graph Partitioning.",
            "A Dichotomy Theorem for the Resolution Complexity of Random Constraint Satisfaction Problems.",
            "Information Cost Tradeoffs for Augmented Index and Streaming Language Recognition.",
            "Error-Correcting Data Structures.",
            "Sherali-Adams Relaxations and Indistinguishability in Counting Logics.",
            "Approximate Nearest Neighbor Search for Low-Dimensional Queries.",
            "The Price of Routing Unsplittable Flow.",
            "Matroid Secretary Problem in the Random-Assignment Model.",
            "The Limits of Buffering: A Tight Lower Bound for Dynamic Membership in the External Memory Model.",
            "Circumventing the Price of Anarchy: Leading Dynamics to Good Behavior.",
            "Symmetry and Approximability of Submodular Maximization Problems.",
            "Noise Tolerance of Expanders and Sublinear Expansion Reconstruction.",
            "The Complexity of Symmetric Boolean Parity Holant Problems.",
            "Matroid Matching: The Power of Local Search.",
            "IP = PSPACE Using Error-Correcting Codes.",
            "Threshold Phenomena in k-Dominant Skylines of Random Samples.",
            "Embeddings of Surfaces, Curves, and Moving Points in Euclidean Space.",
            "Nearly Tight Bounds for Testing Function Isomorphism.",
            "Contractions, Removals, and Certifying 3-Connectivity in Linear Time.",
            "Optimal Testing of Multivariate Polynomials over Small Prime Fields.",
            "Reconstruction of Markov Random Fields from Samples: Some Observations and Algorithms.",
            "A Harmonic Algorithm for the 3D Strip Packing Problem.",
            "Spectral Gap Amplification.",
            "Pattern Matching under Polynomial Transformation.",
            "Link Reversal Routing with Binary Link Labels: Work Complexity.",
            "Bounded-Curvature Shortest Paths through a Sequence of Points Using Convex Optimization.",
            "Fast Integer Multiplication Using Modular Arithmetic.",
            "Testing and Reconstruction of Lipschitz Functions with Applications to Data Privacy.",
            "Graph Connectivities, Network Coding, and Expander Graphs.",
            "NP-Hardness of Approximately Solving Linear Equations over Reals.",
            "LDFS-Based Certifying Algorithm for the Minimum Path Cover Problem on Cocomparability Graphs.",
            "Set Covering with Our Eyes Closed.",
            "Finding, Minimizing, and Counting Weighted Subgraphs.",
            "On Multiplicative Lambda-Approximations and Some Geometric Applications.",
            "Branching-Time Model Checking of One-Counter Processes and Timed Automata.",
            "Graph Homomorphisms with Complex Values: A Dichotomy Theorem.",
            "Balls and Bins: Smaller Hash Families and Faster Evaluation.",
            "Pseudorandom Generators for Combinatorial Shapes.",
            "Computing the Girth of a Planar Graph in Linear Time.",
            "Every Property of Hyperfinite Graphs Is Testable.",
            "Determining Edge Expansion and Other Connectivity Measures of Graphs of Bounded Genus.",
            "A Polynomial-Time Algorithm for Estimating the Partition Function of the Ferromagnetic Ising Model on a Regular Matroid.",
            "Computing Shortest Paths amid Convex Pseudodisks.",
            "Efficient Edge Splitting-Off Algorithms Maintaining All-Pairs Edge-Connectivities.",
            "Locating Regions in a Sequence under Density Constraints.",
            "Special Section on the Forty-Second Annual ACM Symposium on Theory of Computing (STOC 2010).",
            "Improving Exhaustive Search Implies Superpolynomial Lower Bounds.",
            "An Effective Dichotomy for the Counting Constraint Satisfaction Problem.",
            "Pseudorandom Generators for Polynomial Threshold Functions.",
            "Local List-Decoding and Testing of Random Linear Codes from High Error.",
            "How to Compress Interactive Communication.",
            "A Deterministic Single Exponential Time Algorithm for Most Lattice Problems Based on Voronoi Cell Computations.",
            "Perfect Matchings in O(nlog n) Time in Regular Bipartite Graphs.",
            "Efficiency Improvements in Constructing Pseudorandom Generators from One-Way Functions.",
            "Fixed-Parameter Algorithms for Maximum Agreement Forests.",
            "The All-or-Nothing Multicommodity Flow Problem.",
            "Privately Releasing Conjunctions and the Statistical Query Barrier.",
            "On the Bit-Complexity of Lempel-Ziv Compression.",
            "Multiple-Source Shortest Paths in Embedded Graphs.",
            "A Deterministic Truthful PTAS for Scheduling Related Machines.",
            "Asymmetric Traveling Salesman Path and Directed Latency Problems.",
            "The Stretch Factor of the Delaunay Triangulation Is Less than 1.998.",
            "Soft Heaps Simplified.",
            "Fixed-Parameter Tractability of Directed Multiway Cut Parameterized by the Size of the Cutset.",
            "Nerves of Good Covers Are Algorithmically Unrecognizable.",
            "Robust Geometric Spanners.",
            "Size Bounds and Query Plans for Relational Joins.",
            "Counting Trees in a Phylogenetic Network Is \\#P-Complete.",
            "Models for the Compressible Web.",
            "Adding One Edge to Planar Graphs Makes Crossing Number and 1-Planarity Hard.",
            "Jaywalking Your Dog: Computing the Fréchet Distance with Shortcuts.",
            "Computing Correlation between Piecewise-Linear Functions.",
            "Restricted Isometry of Fourier Matrices and List Decodability of Random Linear Codes.",
            "An Algebraic Theory of Complexity for Discrete Optimization.",
            "On the Complexity of Package Recommendation Problems.",
            "Hidden Symmetry Subgroup Problems.",
            "Pseudorandom Generators with Long Stretch and Low Locality from Random Local One-Way Functions.",
            "On Range Searching with Semialgebraic Sets. II.",
            "Reducibility among Fractional Stability Problems.",
            "Deterministic Identity Testing of Depth-4 Multilinear Circuits with Bounded Top Fan-in.",
            "Deterministic Algorithms for the Lovász Local Lemma.",
            "On the Insertion Time of Cuckoo Hashing.",
            "A Space Lower Bound for Dynamic Approximate Membership Data Structures.",
            "Subexponential Parameterized Algorithm for Minimum Fill-In.",
            "Additive Approximation for Bounded Degree Survivable Network Design.",
            "On the Queue Number of Planar Graphs.",
            "Special Section on the Fiftieth Annual IEEE Symposium on Foundations of Computer Science (FOCS 2009).",
            "On the Power of Randomization in Algorithmic Mechanism Design.",
            "Extensions to the Method of Multiplicities, with Applications to Kakeya Sets and Mergers.",
            "The Intersection of Two Halfspaces Has High Threshold Degree.",
            "KKL, Kruskal-Katona, and Monotone Nets.",
            "Vertex Sparsification and Oblivious Reductions.",
            "Dynamic and Nonuniform Pricing Strategies for Revenue Maximization.",
            "Composition of Low-Error 2-Query PCPs Using Decodable PCPs.",
            "A Parallel Repetition Theorem for Any Interactive Argument."
        ]
    },
    {
        "name": "SICOMP",
        "year": "2012",
        "info": "Volume 41, 2012",
        "count": 72,
        "papers": [
            "Simulating Size-constrained Galton-Watson Trees.",
            "Envy-Free Makespan Approximation.",
            "The Gathering Problem for Two Oblivious Robots with Unreliable Compasses.",
            "On Clustering to Minimize the Sum of Radii.",
            "Iterated Rounding Algorithms for the Smallest k-Edge Connected Spanning Subgraph.",
            "An Optimal Dynamic Data Structure for Stabbing-Semigroup Queries.",
            "Exponential Lower Bounds and Integrality Gaps for Tree-Like Lovász-Schrijver Procedures.",
            "Regular Expressions with Counting: Weak versus Strong Determinism.",
            "The Complexity of Distributions.",
            "Explicit Dimension Reduction and Its Applications.",
            "Local Versus Global Properties of Metric Spaces.",
            "The Complexity of Inferring a Minimally Resolved Phylogenetic Supertree.",
            "Tabulation-Based 5-Independent Hashing with Applications to Linear Probing and Second Moment Estimation.",
            "Approximating the Permanent via Nonabelian Determinants.",
            "A Deterministic Polynomial-Time Approximation Scheme for Counting Knapsack Solutions.",
            "Improved Bounds for Geometric Permutations.",
            "Randomized Competitive Algorithms for Generalized Caching.",
            "An Optimal Self-Stabilizing Firing Squad.",
            "Approximate Sparse Recovery: Optimizing Time and Measurements.",
            "Almost-Optimal Gossip-Based Aggregate Computation.",
            "Multiparty Communication Complexity and Threshold Circuit Size of sfAC0.",
            "On the Inherent Sequentiality of Concurrent Objects.",
            "Area-Universal and Constrained Rectangular Layouts.",
            "Universal Sequencing on an Unreliable Machine.",
            "Approximating TSP on Metrics with Bounded Global Growth.",
            "On Minimal-Time Solutions of Firing Squad Synchronization Problems for Networks.",
            "Dynamic Approximate All-Pairs Shortest Paths in Undirected Graphs.",
            "Huffman Coding with Letter Costs: A Linear-Time Approximation Scheme.",
            "Corrigendum: Algorithmic Enumeration of Ideal Classes for Quaternion Orders.",
            "Nice Labeling Problem for Event Structures: A Counterexample.",
            "Online Set Packing.",
            "Quasirandom Load Balancing.",
            "Public-Key Cryptosystems Resilient to Key Leakage.",
            "A Polynomial Algorithm for 3-Compatible Coloring and the Stubborn List Partition Problem (The Stubborn Problem Is Stubborn No More).",
            "Distributed Computing by Mobile Robots: Gathering.",
            "Affine Dispersers from Subspace Polynomials.",
            "Trevisan's Extractor in the Presence of Quantum Side Information.",
            "Triangulating the Square and Squaring the Triangle: Quadtrees and Delaunay Triangulations are Equivalent.",
            "Sampling-Based Approximation Algorithms for Multistage Stochastic Optimization.",
            "Shooting Permanent Rays among Disjoint Polygons in the Plane.",
            "Approximation Algorithms for QMA-Complete Problems.",
            "Tile Complexity of Linear Assemblies.",
            "Improved Constant-Time Approximation Algorithms for Maximum Matchings and Other Optimization Problems.",
            "An O(log2k)-Approximation Algorithm for the k-Vertex Connected Spanning Subgraph Problem.",
            "Improved Approximation Algorithms for Bipartite Correlation Clustering.",
            "Strong Direct Product Theorems for Quantum Communication and Query Complexity.",
            "Considering Suppressed Packets Improves Buffer Management in Quality of Service Switches.",
            "Efficient Noninteractive Proof Systems for Bilinear Groups.",
            "Special Section on the Forty-Third Annual ACM Symposium on Theory of Computing (STOC 2011).",
            "Distributed Verification and Hardness of Distributed Approximation.",
            "Pareto Optimal Solutions for Smoothed Analysts.",
            "Blackbox Identity Testing for Bounded Top-Fanin Depth-3 Circuits: The Field Doesn't Matter.",
            "An Optimal Lower Bound on the Communication Complexity of Gap-Hamming-Distance.",
            "Santa Claus Schedules Jobs on Unrelated Machines.",
            "The Weakest Failure Detectors to Solve Quittable Consensus and Nonblocking Atomic Commit.",
            "Transitive-Closure Spanners.",
            "Quantum Query Complexity of Minor-Closed Graph Properties.",
            "Fast Information Spreading in Graphs with Large Weak Conductance.",
            "Reconstructing Approximate Phylogenetic Trees from Quartet Samples.",
            "Locality from Circuit Lower Bounds.",
            "On the Hidden Shifted Power Problem.",
            "Agnostic Learning of Monomials by Halfspaces Is Hard.",
            "Special Section on the Forty-First Annual ACM Symposium on Theory of Computing (STOC 2009).",
            "Bit-Probe Lower Bounds for Succinct Data Structures.",
            "Homology Flows, Cohomology Cuts.",
            "Approximating Edit Distance in Near-Linear Time.",
            "Online and Stochastic Survivable Network Design.",
            "Universally Utility-maximizing Privacy Mechanisms.",
            "3-Query Locally Decodable Codes of Subexponential Length.",
            "Twice-Ramanujan Sparsifiers.",
            "New Direct-Product Testers and 2-Query PCPs.",
            "Max Cut and the Smallest Eigenvalue."
        ]
    },
    {
        "name": "SICOMP",
        "year": "2011",
        "info": "Volume 40, 2011",
        "count": 76,
        "papers": [
            "Randomly Supported Independence and Resistance.",
            "Multiwriter Consistency Conditions for Shared Memory Registers.",
            "The Complexity of Early Deciding Set Agreement.",
            "How Hard Is It to Approximate the Best Nash Equilibrium?",
            "Uncoordinated Two-Sided Matching Markets.",
            "A Near-Optimal Separation of Regular and General Resolution.",
            "On Achieving the \"Best of Both Worlds\" in Secure Multiparty Computation.",
            "Search via Quantum Walk.",
            "The Chow Parameters Problem.",
            "An Almost Optimal Rank Bound for Depth-3 Identities.",
            "Black-Box Constructions of Protocols for Secure Computation.",
            "A Combinatorial Construction of Almost-Ramanujan Graphs Using the Zig-Zag Product.",
            "An Analysis of Random-Walk Cuckoo Hashing.",
            "Improved Approximation Algorithms for Prize-Collecting Steiner Tree and TSP.",
            "Dynamic Connectivity: Connecting to Networks and Geometry.",
            "Self-Improving Algorithms.",
            "Algorithmic Aspects of Property Testing in the Dense Graphs Model.",
            "Deciding Regularity of the Set of Instances of a Set of Terms with Regular Constraints is EXPTIME-Complete.",
            "Space-Efficient Preprocessing Schemes for Range Minimum Queries on Static Arrays.",
            "Fail-Aware Untrusted Storage.",
            "On Proximity-Oblivious Testing.",
            "Inapproximability Results for Maximum Edge Biclique, Minimum Linear Arrangement, and Sparsest Cut.",
            "Sorting and Selection in Posets.",
            "Optimal Envy-Free Pricing with Metric Substitutability.",
            "A Topological View of Unsupervised Learning from Noisy Data.",
            "Short Seed Extractors against Quantum Storage.",
            "Terminal Backup, 3D Matching, and Covering Cubic Graphs.",
            "An Expansion Tester for Bounded Degree Graphs.",
            "Boltzmann Samplers, Pólya Theory, and Cycle Pointing.",
            "Special Section on Foundations of Computer Science.",
            "A Counterexample to Strong Parallel Repetition.",
            "Kakeya Sets, New Mergers, and Old Extractors.",
            "What Can We Learn Privately?",
            "Unifying the Landscape of Cell-Probe Lower Bounds.",
            "Entangled Games Are Hard to Approximate.",
            "Beating the Random Ordering Is Hard: Every Ordering CSP Is Approximation Resistant.",
            "Truthful Approximation Schemes for Single-Parameter Agents.",
            "A Quantitative Version of the Gibbard-Satterthwaite Theorem for Three Alternatives.",
            "Degree Bounded Network Design with Metric Costs.",
            "Spectral Sparsification of Graphs.",
            "Optimal Homologous Cycles, Total Unimodularity, and Linear Programming.",
            "Semialgebraic Range Reporting and Emptiness Searching with Applications.",
            "Testing Fourier Dimensionality and Sparsity.",
            "Computational Complexity of Holant Problems.",
            "Maximizing Non-monotone Submodular Functions.",
            "Matching Vector Codes.",
            "An Overview of Mathematical Issues Arising in the Geometric Complexity Theory Approach to VP≠VNP.",
            "Exact Price of Anarchy for Polynomial Congestion Games.",
            "The Recognition of Tolerance and Bounded Tolerance Graphs.",
            "Hardness of Precedence Constrained Scheduling on Identical Machines.",
            "Fitting Tree Metrics: Hierarchical Clustering and Phylogeny.",
            "Interval Graphs: Canonical Representations in Logspace.",
            "Terrain Guarding is NP-Hard.",
            "Near Optimal Bounds for Steiner Trees in the Hypercube.",
            "Sampling and Cost-Sharing: Approximation Algorithms for Stochastic Optimization Problems.",
            "Efficient Stream Sampling for Variance-Optimal Estimation of Subset Sums.",
            "List Decoding Tensor Products and Interleaved Codes.",
            "Rank-Pairing Heaps.",
            "On the Power of the Randomized Iterate.",
            "On the Composition of Public-Coin Zero-Knowledge Protocols.",
            "Buying Cheap Is Expensive: Approximability of Combinatorial Pricing Problems.",
            "Approximation Techniques for Utilitarian Mechanism Design.",
            "Learning Kernel-Based Halfspaces with the 0-1 Loss.",
            "Optimal Cover of Points by Disks in a Simple Polygon.",
            "Bisimulation Metrics for Continuous Markov Decision Processes.",
            "Submodular Approximation: Sampling-based Algorithms and Lower Bounds.",
            "Special Section on the Fortieth Annual ACM Symposium On Theory Of Computing (STOC 2008).",
            "Maximizing a Monotone Submodular Function Subject to a Matroid Constraint.",
            "Fast Polynomial Factorization and Modular Composition.",
            "Lossy Trapdoor Functions and Their Applications.",
            "Sketching in Adversarial Environments.",
            "Parallel Repetition in Projection Games and a Concentration Bound.",
            "Interdomain Routing and Games.",
            "Graph Sparsification by Effective Resistances.",
            "Testing Symmetric Properties of Distributions.",
            "The Pattern Matrix Method."
        ]
    },
    {
        "name": "SICOMP",
        "year": "2009",
        "info": "Volume 39, 2009/2010",
        "count": 149,
        "papers": [
            "Special Issue On The Thirty-Eighth Annual ACM Symposium On Theory Of Computing (STOC 2006).",
            "Bounded-Error Quantum State Identification and Exponential Separations in Communication Complexity.",
            "Zero-Knowledge against Quantum Attacks.",
            "Narrow Proofs May Be Spacious: Separating Space and Width in Resolution.",
            "On Maximizing Welfare When Utility Functions Are Subadditive.",
            "A Combinatorial Characterization of the Testable Graph Properties: It's All About Regularity.",
            "Extractors for a Constant Number of Polynomially Small Min-Entropy Independent Sources.",
            "The Complexity of Computing a Nash Equilibrium.",
            "Random Formulas Have Frozen Variables.",
            "Edge-Disjoint Paths in Planar Graphs with Constant Congestion.",
            "The Fast Johnson--Lindenstrauss Transform and Approximate Nearest Neighbors.",
            "Gowers Uniformity, Influence of Variables, and PCPs.",
            "The Online Set Cover Problem.",
            "On Earthmover Distance, Metric Labeling, and 0-Extension.",
            "Sparse Algebraic Equations over Finite Fields.",
            "The Power of Extended Top-Down Tree Transducers.",
            "Finding a Heaviest Vertex-Weighted Triangle Is not Harder than Matrix Multiplication.",
            "Distributed Approximate Matching.",
            "A Near-Tight Approximation Algorithm for the Robot Localization Problem.",
            "Combinatorial Construction of Locally Testable Codes.",
            "Special Section on Foundations of Computer Science.",
            "Set Partitioning via Inclusion-Exclusion.",
            "Approximate List-Decoding of Direct Product Codes and Uniform Hardness Amplification.",
            "On Agnostic Learning of Parities, Monomials, and Halfspaces.",
            "Beyond Hirsch Conjecture: Walks on Random Polytopes and Smoothed Complexity of the Simplex Method.",
            "Algebraic Algorithms for Matching and Matroid Problems.",
            "Transdichotomous Results in Computational Geometry, I: Point Location in Sublogarithmic Time.",
            "Higher Lower Bounds for Near-Neighbor and Further Rich Problems.",
            "Hardness of Learning Halfspaces with Noise.",
            "Worst-Case and Smoothed Analysis of the ICP Algorithm, with an Application to the k-Means Method.",
            "Pass-Efficient Algorithms for Learning Mixtures of Uniform Distributions.",
            "Strong Lower Bounds for Approximating Distribution Support Size and the Distinct Elements Problem.",
            "Conditional Hardness for Approximate Coloring.",
            "An LLL Algorithm with Quadratic Complexity.",
            "Estimating the Weight of Metric Minimum Spanning Trees in Sublinear Time.",
            "On Coresets for k-Median and k-Means Clustering in Metric and Euclidean Spaces and Their Applications.",
            "Tight Bounds for Randomized and Quantum Local Search.",
            "Special Section On The Thirty-Ninth Annual ACM Symposium On Theory Of Computing (STOC 2007).",
            "Faster Integer Multiplication.",
            "Low-End Uniform Hardness versus Randomness Tradeoffs for AM.",
            "Circuit Lower Bounds for Merlin--Arthur Classes.",
            "Survivable Network Design with Degree or Order Constraints.",
            "Playing Games with Approximation Algorithms.",
            "Linear Probing with Constant Independence.",
            "Zero-Knowledge Proofs from Secure Multiparty Computation.",
            "Statistically Hiding Commitments and Statistical Zero-Knowledge Arguments from Any One-Way Function.",
            "Kinetic kd-Trees and Longest-Side kd-Trees.",
            "The Hiring Problem and Lake Wobegon Strategies.",
            "A New Approximation Method for Set Covering Problems, with Applications to Multidimensional Bin Packing.",
            "Hardness-Randomness Tradeoffs for Bounded Depth Arithmetic Circuits.",
            "Speed Scaling for Weighted Flow Time.",
            "Time-decaying Sketches for Robust Aggregation of Sensor Data.",
            "Small Approximate Pareto Sets for Biobjective Shortest Paths and Other Problems.",
            "On the Computational Power of Demand Queries.",
            "Parameterized Approximation Scheme for the Multiple Knapsack Problem.",
            "Additive Guarantees for Degree-Bounded Directed Network Design.",
            "More Efficient Algorithms for Closest String and Substring Problems.",
            "On the Cost of Interchange Rearrangement in Strings.",
            "Complexity of Stoquastic Frustration-Free Hamiltonians.",
            "Complexity of Decision Problems for XML Schemas and Chain Regular Expressions.",
            "Congruence Distributivity Implies Bounded Width.",
            "More Robust Hashing: Cuckoo Hashing with a Stash.",
            "Simulating Quantum Correlations with Finite Communication.",
            "Programmable Control of Nucleation for Algorithmic Self-Assembly.",
            "Low Distortion Maps Between Point Sets.",
            "Uniform Direct Product Theorems: Simplified, Optimized, and Derandomized.",
            "On the Compressibility of NP Instances and Cryptographic Applications.",
            "Algorithmic Enumeration of Ideal Classes for Quaternion Orders.",
            "O(sqrt(log(n)) Approximation to SPARSEST CUT in Õ(n2) Time.",
            "Approximation Algorithms for Nonuniform Buy-at-Bulk Network Design.",
            "Designing Network Protocols for Good Equilibria.",
            "The Sign-Rank of AC0.",
            "Edge Disjoint Paths in Moderately Connected Graphs.",
            "Querying Approximate Shortest Paths in Anisotropic Regions.",
            "An Optimal Randomized Cell Probe Lower Bound for Approximate Nearest Neighbor Searching.",
            "Intractability of Clique-Width Parameterizations.",
            "Selfish Traffic Allocation for Server Farms.",
            "Breaking the Epsilon-Soundness Bound of the Linearity Test over GF(2).",
            "Testing Halfspaces.",
            "Labeling Dynamic XML Trees.",
            "More Algorithms for All-Pairs Shortest Paths in Weighted Graphs.",
            "Information-Theoretically Secure Protocols and Security under Composition.",
            "Effective Computations on Sliding Windows.",
            "On Spanners and Lightweight Spanners of Geometric Graphs.",
            "Distributed Broadcast in Unknown Radio Networks.",
            "Submodularity of Influence in Social Networks: From Local to Global.",
            "On the Approximability of Budgeted Allocations and Improved Lower Bounds for Submodular Welfare Maximization and GAP.",
            "An Optimal Bifactor Approximation Algorithm for the Metric Uncapacitated Facility Location Problem.",
            "The Local Nature of List Colorings for Graphs of High Girth.",
            "Approximate Satisfiability and Equivalence.",
            "Computing the Least Fixed Point of Positive Polynomial Systems.",
            "Quasi-Randomness and Algorithmic Regularity for Graphs with General Degree Distributions.",
            "On the k Shortest Simple Paths Problem in Weighted Directed Graphs.",
            "On the Impossibility of a Quantum Sieve Algorithm for Graph Isomorphism.",
            "Special Section On Foundations of Computer Science.",
            "The Computational Hardness of Estimating Edit Distance.",
            "Towards Sharp Inapproximability for Any 2-CSP.",
            "Pseudorandom Bits for Polynomials.",
            "Local Global Tradeoffs in Metric Embeddings.",
            "Any AND-OR Formula of Size N Can Be Evaluated in Time N1/2+o(1) on a Quantum Computer.",
            "On the Complexity of Nash Equilibria and Other Fixed Points.",
            "Hardness of Reconstructing Multivariate Polynomials over Finite Fields.",
            "The PSPACE-Completeness of Black-White Pebbling.",
            "Approximately Counting Integral Flows and Cell-Bounded Contingency Tables.",
            "Approximate Halfspace Range Counting.",
            "An O(1) RMRs Leader Election Algorithm.",
            "On the Implementation of Huge Random Objects.",
            "A Better Algorithm for Random k-SAT.",
            "Faster Algorithms for All-pairs Approximate Shortest Paths in Undirected Graphs.",
            "Local Monotonicity Reconstruction.",
            "An Efficient Algorithm for Partial Order Production.",
            "Quantum Hardcore Functions by Complexity-Theoretical Quantum List Decoding.",
            "An Approximation Algorithm for Max-Min Fair Allocation of Indivisible Goods.",
            "Preprocessing Imprecise Points and Splitting Triangulations.",
            "Approximating Steiner Networks with Node-Weights.",
            "Tractability and Learnability Arising from Algebras with Few Subpowers.",
            "Adaptive Local Ratio.",
            "Chosen-Ciphertext Security via Correlated Products.",
            "Quantum Computation and the Evaluation of Tensor Networks.",
            "Hardness Amplification Proofs Require Majority.",
            "Approximate Hypergraph Partitioning and Applications.",
            "Extensional Uniformity for Boolean Circuits.",
            "Unique Games with Entangled Provers Are Easy.",
            "Locally Testable Codes Require Redundant Testers.",
            "Small-Size $\\eps$-Nets for Axis-Parallel Rectangles and Boxes.",
            "Line Transversals of Convex Polyhedra in R3.",
            "Server Scheduling to Balance Priorities, Fairness, and Average Quality of Service.",
            "A Complexity Dichotomy for Partition Functions with Mixed Signs.",
            "Fault Tolerant Spanners for General Graphs.",
            "Left-to-Right Multiplication for Monotone Boolean Dualization.",
            "Bounded Independence Fools Halfspaces.",
            "Lower Bounds on Streaming Algorithms for Approximating the Length of the Longest Increasing Subsequence.",
            "Reaching and Distinguishing States of Distributed Systems.",
            "Explicit Construction of a Small Epsilon-Net for Linear Threshold Functions.",
            "Randomized Self-Assembly for Exact Shapes.",
            "Integrality Gaps of 2-o(1) for Vertex Cover SDPs in the Lov[a-acute]sz--Schrijver Hierarchy.",
            "Approximation Algorithms for Scheduling Parallel Jobs.",
            "Strict Cost Sharing Schemes for Steiner Forest.",
            "A General Approach for Incremental Approximation and Hierarchical Clustering.",
            "Extension Preservation Theorems on Classes of Acyclic Finite Structures.",
            "Quantified Equality Constraints.",
            "Fast Convergence to Wardrop Equilibria by Adaptive Sampling Methods.",
            "Deterministic Polynomial Time Algorithms for Matrix Completion Problems.",
            "Fast Access to Distributed Atomic Memory.",
            "Tightening Nonsimple Paths and Cycles on Surfaces.",
            "Linear-Time Algorithms for Geometric Graphs with Sublinearly Many Edge Crossings.",
            "Correctness of Gossip-Based Membership under Message Loss.",
            "Analysis of Delays Caused by Local Synchronization.",
            "Lower Bounds for Randomized Consensus under a Weak Adversary."
        ]
    },
    {
        "name": "SICOMP",
        "year": "2008",
        "info": "Volume 38, 2008/2009",
        "count": 101,
        "papers": [
            "On the Algorithmic Aspects of Discrete and Lexicographic Helly-Type Theorems and the Discrete LP-Type Model.",
            "Lower Bounds for Randomized and Quantum Query Complexity Using Kolmogorov Arguments.",
            "Minimizing Disjunctive Normal Form Formulas and AC0 Circuits Given a Truth Table.",
            "Uniform Hashing in Constant Time and Optimal Space.",
            "Fuzzy Extractors: How to Generate Strong Keys from Biometrics and Other Noisy Data.",
            "Sub-Constant Error Low Degree Test of Almost-Linear Size.",
            "On Approximating Restricted Cycle Covers.",
            "Testing Graph Isomorphism.",
            "Improving the Stretch Factor of a Geometric Network by Edge Augmentation.",
            "Equitable Cost Allocations via Primal--Dual-Type Algorithms.",
            "Vertical Ray Shooting and Computing Depth Orders for Fat Objects.",
            "Convergence of Autonomous Mobile Robots with Inaccurate Sensors and Movements.",
            "Plottable Real Number Functions and the Computable Graph Theorem.",
            "MAX ONES Generalized to Larger Domains.",
            "Exponential Separation of Quantum and Classical One-Way Communication Complexity.",
            "The Euclidean Orienteering Problem Revisited.",
            "Lower Bound for the Online Bin Packing Problem with Restricted Repacking.",
            "An APTAS for Generalized Cost Variable-Sized Bin Packing.",
            "Binary Space Partitions for Axis-Aligned Fat Rectangles.",
            "An O(logn loglogn) Space Algorithm for Undirected st-Connectivity.",
            "The Mixing Time of the Thorp Shuffle.",
            "Every Monotone Graph Property Is Testable.",
            "The Round Complexity of Two-Party Random Selection.",
            "Short PCPs with Polylog Query Complexity.",
            "Lower-Stretch Spanning Trees.",
            "Improved Approximation Algorithms for Minimum Weight Vertex Separators.",
            "Tree-Walking Automata Do Not Recognize All Regular Languages.",
            "New and Improved Constructions of Nonmalleable Cryptographic Protocols.",
            "Tensor Norms and the Classical Communication Complexity of Nonlocal Quantum Measurement.",
            "I/O-Efficient Planar Separators.",
            "Approximate Shortest Paths in Anisotropic Regions.",
            "A Primal-Dual Bicriteria Distributed Algorithm for Capacitated Vertex Cover.",
            "On the Complexity of Verifying Consistency of XML Specifications.",
            "Competitive Online Approximation of the Optimal Search Ratio.",
            "On Approximating the Depth and Related Problems.",
            "Efficient Algorithms for Description Problems over Finite Totally Ordered Domains.",
            "Approximating the Spanning Star Forest Problem and Its Application to Genomic Sequence Alignment.",
            "Simulating Quantum Computation by Contracting Tensor Networks.",
            "Efficient Colored Orthogonal Range Counting.",
            "Finding Branch-Decompositions and Rank-Decompositions.",
            "Query-Efficient Algorithms for Polynomial Interpolation over Composites.",
            "Exact Algorithms for Treewidth and Minimum Fill-In.",
            "Dimensions of Points in Self-Similar Fractals.",
            "The Complexity of Monadic Second-Order Unification.",
            "The Spectral Method for General Mixture Models.",
            "Improved Approximation Algorithms for Broadcast Scheduling.",
            "Geometric Complexity Theory II: Towards Explicit Obstructions for Embeddings among Class Varieties.",
            "Fault-Tolerant Quantum Computation with Constant Error Rate.",
            "Mitotic Classes in Inductive Inference.",
            "On Monotone Formula Composition of Perfect Zero-Knowledge Languages.",
            "Network Failure Detection and Graph Connectivity.",
            "Resolution Is Not Automatizable Unless W[P] Is Tractable.",
            "Preservation under Extensions on Well-Behaved Finite Structures.",
            "Closest Substring Problems with Small Distances.",
            "Approximation Algorithms for Data Placement Problems.",
            "Faster Algorithms for Minimum Cycle Basis in Directed Graphs.",
            "Linear Equations Modulo 2 and the L1 Diameter of Convex Bodies.",
            "Combination Can Be Hard: Approximability of the Unique Coverage Problem.",
            "Approximation Algorithm and Perfect Sampler for Closed Jackson Networks with Single Servers.",
            "Approximation Algorithms for Biclustering Problems.",
            "A Deterministic Subexponential Algorithm for Solving Parity Games.",
            "Linear-Time Algorithms for Dominators and Other Path-Evaluation Problems.",
            "The Combined Power of Conditions and Information on Failures to Solve Asynchronous Set Agreement.",
            "The Price of Stability for Network Design with Fair Cost Allocation.",
            "A Lower Bound for the Size of Syntactically Multilinear Arithmetic Circuits.",
            "Cost-Distance: Two Metric Network Design.",
            "Universal Arguments and their Applications.",
            "Exponential Separation for One-Way Quantum Communication Complexity, with Applications to Cryptography.",
            "Graph Distances in the Data-Stream Model.",
            "Private Approximation of Search Problems.",
            "Approximating Minimum Max-Stretch Spanning Trees on Unweighted Graphs.",
            "The CSP Dichotomy Holds for Digraphs with No Sources and No Sinks (A Positive Answer to a Conjecture of Bang-Jensen and Hell).",
            "Spanners of Complete k-Partite Geometric Graphs.",
            "Profiles of Tries.",
            "On Fixed-Points of Multivalued Functions on Complete Lattices and Their Application to Generalized Logic Programs.",
            "Impossibility Results and Lower Bounds for Consensus under Link Failures.",
            "Locally Decodable Codes from Nice Subsets of Finite Fields and Prime Factors of Mersenne Numbers.",
            "The Complexity of Weighted Boolean #CSP.",
            "On the Complexity of Numerical Analysis.",
            "Interval Completion Is Fixed Parameter Tractable.",
            "Optimizing Schema Languages for XML: Numerical Constraints and Interleaving.",
            "Stream Order and Order Statistics: Quantile Estimation in Random-Order Streams.",
            "Sampling Algorithms and Coresets for $\\ellp Regression.",
            "Hierarchical Unambiguity.",
            "SeparatingAC0 from Depth-2 Majority Circuits.",
            "Interpolation of Depth-3 Arithmetic Circuits with Two Multiplication Gates.",
            "Breaking a Time-and-Space Barrier in Constructing Full-Text Indices.",
            "Linear-Time Haplotype Inference on Pedigrees without Recombinations and Mating Loops.",
            "Efficient Algorithms for Reconstructing Zero-Recombinant Haplotypes on a Pedigree Based on Fast Elimination of Redundant Linear Equations.",
            "Polylogarithmic Independence Can Fool DNF Formulas.",
            "On the Value of Coordination in Network Design.",
            "Metric Embeddings with Relaxed Guarantees.",
            "The Connectivity of Boolean Satisfiability: Computational and Structural Dichotomies.",
            "The Undecidability of the Infinite Ribbon Problem: Implications for Computing by Self-Assembly.",
            "Dynamic Programming Optimization over Random Data: The Scaling Exponent for Near-Optimal Solutions.",
            "Random Hyperplane Search Trees.",
            "A Constant Factor Approximation for the Single Sink Edge Installation Problem.",
            "A 2EXPTIME Complete Varietal Membership Problem.",
            "Stateless Distributed Gradient Descent for Positive Linear Programs.",
            "Improved Lower Bounds for Embeddings intoL1$.",
            "Testing Hereditary Properties of Nonexpanding Bounded-Degree Graphs."
        ]
    },
    {
        "name": "SICOMP",
        "year": "2007",
        "info": "Volume 37, 2007",
        "count": 83,
        "papers": [
            "On the Computational Complexity of the Forcing Chromatic Number.",
            "Lower Bounds for Quantum Communication Complexity.",
            "Adiabatic Quantum State Generation.",
            "A Probabilistic Study on Combinatorial Expanders and Hashing.",
            "Hardness of the Undirected Congestion Minimization Problem.",
            "Constraint Satisfaction, Logic and Forbidden Patterns.",
            "Special Section on Foundations of Computer Science.",
            "Adiabatic Quantum Computation is Equivalent to Standard Quantum Computation.",
            "On the List and Bounded Distance Decodability of Reed-Solomon Codes.",
            "Quantum Walk Algorithm for Element Distinctness.",
            "Dynamic Optimality - Almost.",
            "Algebras with Polynomial Identities and Computing the Determinant.",
            "Worst-Case to Average-Case Reductions Based on Gaussian Measures.",
            "A Polynomial Time Algorithm for Computing an Arrow-Debreu Market Equilibrium for Linear Utilities.",
            "Optimal Inapproximability Results for MAX-CUT and Other 2-Variable CSPs?.",
            "Range-Efficient Counting of Distinct Elements in a Massive Data Stream.",
            "Derandomization in Cryptography.",
            "A 3/2-Approximation Algorithm for Scheduling Independent Monotonic Malleable Tasks.",
            "Quantum Algorithms for the Triangle Problem.",
            "Membership Problem for the Modular Group.",
            "Approximation Algorithms for Constrained Node Weighted Steiner Tree Problems.",
            "Testing versus Estimation of Graph Properties.",
            "Definability of Languages by Generalized First-Order Formulas over N+.",
            "Lines and Free Line Segments Tangent to Arbitrary Three-Dimensional Convex Polyhedra.",
            "One-Way Communication Complexity and the Ne[c-caron]iporuk Lower Bound on Formula Size.",
            "Optimal Expected-Case Planar Point Location.",
            "Self-Testing of Universal and Fault-Tolerant Sets of Quantum Gates.",
            "Faster and Simpler Algorithms for Multicommodity Flow and Other Fractional Packing Problems.",
            "Approximation Algorithms for Orienteering and Discounted-Reward TSP.",
            "Effective Strong Dimension in Algorithmic Information and Computational Complexity.",
            "New Approaches for Virtual Private Network Design.",
            "The Time-Complexity of Local Decision in Distributed Agreement.",
            "A Nearly Linear-Time Approximation Scheme for the Euclidean k-Median Problem.",
            "Hamming Codes, Hypercube Embeddings, and Fault Tolerance.",
            "Planar Earthmover Is Not in L1.",
            "Learning Monotone Decision Trees in Polynomial Time.",
            "Lower Bounds for Lov[a-acute]sz--Schrijver Systems and Beyond Follow from Multiparty Communication Complexity.",
            "Improved Bounds on Nonblocking 3-Stage Clos Networks.",
            "The Resolution Complexity of Random Constraint Satisfaction Problems.",
            "A Min-Max Theorem on Tournaments.",
            "The Power of Strong Fourier Sampling: Quantum Algorithms for Affine Groups and Hidden Shifts.",
            "Efficient Testing of Bipartite Graphs for Forbidden Induced Subgraphs.",
            "Observing Branching Structure through Probabilistic Contexts.",
            "Geometric Separators and Their Applications to Protein Folding in the HP-Model.",
            "Popular Matchings.",
            "A Geometric Approach to Information-Theoretic Private Information Retrieval.",
            "Stability of Multivalued Continuous Consensus.",
            "Parametric Duality and Kernelization: Lower Bounds and Upper Bounds on Kernel Size.",
            "Distribution-Free Property-Testing.",
            "Universal Bufferless Packet Switching.",
            "Distributed Selfish Load Balancing.",
            "Zone Diagrams: Existence, Uniqueness, and Algorithmic Challenge.",
            "Sampling and Meshing a Surface with Guaranteed Topology and Geometry.",
            "An Isomorphism Between Subexponential and Parameterized Complexity Theory.",
            "Localized Client-Server Load Balancing without Global Information.",
            "(t, k)-Diagnosability of Multiprocessor Systems with Applications to Grids and Tori.",
            "Oracles for Distances Avoiding a Failed Node or Link.",
            "A Group-Strategyproof Cost Sharing Mechanism for the Steiner Forest Game.",
            "The Forgetron: A Kernel-Based Perceptron on a Budget.",
            "On k-d Range Search with Patricia Tries.",
            "Quantum Property Testing.",
            "Compression in Finite Fields and Torus-Based Cryptography.",
            "Accelerating Simulated Annealing for the Permanent and Combinatorial Counting Problems.",
            "Improved Dynamic Reachability Algorithms for Directed Graphs.",
            "A Faster, Better Approximation Algorithm for the Minimum Latency Problem.",
            "Optimal Power-Down Strategies.",
            "Splitting NP-Complete Sets.",
            "Learning Mixtures of Product Distributions over Discrete Domains.",
            "Holographic Algorithms.",
            "Extra Unit-Speed Machines Are Almost as Powerful as Speedy Machines for Flow Time Scheduling.",
            "Randomization Does Not Reduce the Average Delay in Parallel Packet Switches.",
            "A Practical Shortest Path Algorithm with Linear Expected Time.",
            "Stability of Load Balancing Algorithms in Dynamic Adversarial Systems.",
            "The Complexity of Quantified Constraint Satisfaction: Collapsibility, Sink Algebras, and the Three-Element Case.",
            "Special Issue on Foundations of Computer Science.",
            "A Characterization of the (Natural) Graph Properties Testable with One-Sided Error.",
            "An Algorithmic Version of the Hypergraph Regularity Method.",
            "Agnostically Learning Halfspaces.",
            "Lower Bounds for the Noisy Broadcast Problem.",
            "The Symmetric Group Defies Strong Fourier Sampling.",
            "Cryptography in the Bounded-Quantum-Storage Model.",
            "Concurrent Nonmalleable Commitments.",
            "A Linear-Time Approximation Scheme for TSP in Undirected Planar Graphs with Edge-Weights."
        ]
    },
    {
        "name": "SICOMP",
        "year": "2006",
        "info": "Volume 36, 2006/2007",
        "count": 75,
        "papers": [
            "Scheduling Split Intervals.",
            "A Simple Algorithm for Mal'tsev Constraints.",
            "Identifying Clusters from Positive Data.",
            "Fault-Tolerant Gathering Algorithms for Autonomous Mobile Robots.",
            "Disproving the Single Level Conjecture.",
            "Reconstructing Chromosomal Evolution.",
            "Fast Monte Carlo Algorithms for Matrices I: Approximating Matrix Multiplication.",
            "Fast Monte Carlo Algorithms for Matrices II: Computing a Low-Rank Approximation to a Matrix.",
            "Fast Monte Carlo Algorithms for Matrices III: Computing a Compressed Approximate Matrix Decomposition.",
            "A Complete Classification of the Complexity of Propositional Abduction.",
            "Full Constraint Satisfaction Problems.",
            "Rapidly Mixing Markov Chains for Sampling Contingency Tables with a Constant Number of Rows.",
            "Erratum: Distributed Anonymous Mobile Robots: Formation of Geometric Patterns.",
            "Dominating Sets in Planar Graphs: Branch-Width and Exponential Speed-Up.",
            "Between O(nm) and O(nalpha).",
            "Certifying Algorithms for Recognizing Interval Graphs and Permutation Graphs.",
            "Lower Bounds for On-line Graph Problems with Application to On-line Circuit and Optical Routing.",
            "Efficient Bundle Sorting.",
            "Approximation Algorithms for Metric Facility Location Problems.",
            "An Unconditional Lower Bound on the Time-Approximation Trade-off for the Distributed Minimum Spanning Tree Problem.",
            "Toward a Topological Characterization of Asynchronous Complexity.",
            "Covering Problems with Hard Capacities.",
            "Properties of NP-Complete Sets.",
            "The Directed Steiner Network Problem is Tractable for a Constant Number of Terminals.",
            "Time-Space Lower Bounds for the Polynomial-Time Hierarchy on Randomized Machines.",
            "Infinitely-Often Autoreducible Sets.",
            "An Extension of the Lovász Local Lemma, and its Applications to Integer Programming.",
            "Approximating Longest Cycles in Graphs with Bounded Degrees.",
            "Fairness Measures for Resource Allocation.",
            "Dynamic Subgraph Connectivity with Geometric Applications.",
            "On the Number of Crossing-Free Matchings, Cycles, and Partitions.",
            "Counting and Enumerating Pointed Pseudotriangulations with the Greedy Flip Algorithm.",
            "Random k-SAT: Two Moments Suffice to Cross a Sharp Threshold.",
            "Quantum Algorithms for Some Hidden Shift Problems.",
            "Testing Polynomials over General Fields.",
            "Exponential Determinization for omega-Automata with a Strong Fairness Acceptance Condition.",
            "Computing Maximally Separated Sets in the Plane.",
            "A Probabilistic Approach to the Dichotomy Problem.",
            "Special Issue on Randomness and Complexity.",
            "Cryptography in NC0.",
            "Robust PCPs of Proximity, Shorter PCPs, and Applications to Coding.",
            "Assignment Testers: Towards a Combinatorial Proof of the PCP Theorem.",
            "Ruling Out PTAS for Graph Min-Bisection, Dense k-Subgraph, and Bipartite Clique.",
            "Deterministic Extractors for Bit-Fixing Sources by Obtaining an Independent Seed.",
            "Extracting Randomness Using Few Independent Sources.",
            "On Worst-Case to Average-Case Reductions for NP Problems.",
            "An Unconditional Study of Computational Zero Knowledge.",
            "Derandomizing Homomorphism Testing in General Groups.",
            "Deterministic Extractors for Bit-Fixing Sources and Exposure-Resilient Cryptography.",
            "Linear Upper Bounds for Random Walk on Small Density Random 3-CNFs.",
            "The Complexity of Computing the Size of an Interval.",
            "Chosen-Ciphertext Security from Identity-Based Encryption.",
            "A Deterministic Algorithm for Finding All Minimum k-Way Cuts.",
            "Online Conflict-Free Coloring for Intervals.",
            "Improved Combinatorial Group Testing Algorithms for Real-World Problem Sizes.",
            "The Hardness of Metric Labeling.",
            "Pseudorandom Bits for Constant-Depth Circuits with Few Arbitrary Symmetric Gates.",
            "Locally Decodable Codes with Two Queries and Polynomial Identity Testing for Depth 3 Circuits.",
            "The Probabilistic Relationship Between the Assignment and Asymmetric Traveling Salesman Problems.",
            "The Wake-Up Problem in MultiHop Radio Networks.",
            "Quantum and Classical Strong Direct Product Theorems and Optimal Time-Space Tradeoffs.",
            "Integrality Ratio for Group Steiner Trees and Directed Steiner Trees.",
            "Zaps and Their Applications.",
            "Complexity of Self-Assembled Shapes.",
            "First-Order Languages Expressing Constructible Spatial Database Queries.",
            "Quickest Flows Over Time.",
            "A Constant-Factor Approximation Algorithm for Optimal 1.5D Terrain Guarding.",
            "Finding Paths and Cycles of Superpolylogarithmic Length.",
            "An Optimal Cache-Oblivious Priority Queue and Its Application to Graph Algorithms.",
            "Online Learning and Resource-Bounded Dimension: Winnow Yields New Lower Bounds for Hard Sets.",
            "Online Scheduling of Equal-Length Jobs: Randomization and Restarts Help.",
            "Physical Limits of Heat-Bath Algorithmic Cooling.",
            "Whole Genome Duplications and Contracted Breakpoint Graphs.",
            "Approximating the Radii of Point Sets.",
            "Linear Recurrences with Polynomial Coefficients and Application to Integer Factorization and Cartier-Manin Operator."
        ]
    },
    {
        "name": "SICOMP",
        "year": "2005",
        "info": "Volume 35, 2005/2006",
        "count": 67,
        "papers": [
            "Some 3CNF Properties Are Hard to Test.",
            "A Probabilistic Analysis of Trie-Based Sorting of Large Collections of Line Segments in Spatial Databases.",
            "Holographic Proofs and Derandmization.",
            "Approximating the Weight of the Euclidean Minimum Spanning Tree in Sublinear Time.",
            "Polynomial Time Approximation Schemes for MAX-BISECTION on Planar and Geometric Graphs.",
            "Minimum-Weight Spanning Tree Construction in O(log log n) Communication Rounds.",
            "The Complexity of Approximating the Entropy.",
            "Well-Separated Pair Decomposition for the Unit-Disk Graph Metric and Its Applications.",
            "A Subexponential-Time Quantum Algorithm for the Dihedral Hidden Subgroup Problem.",
            "A Better-Than-Greedy Approximation Algorithm for the Minimum Set Cover Problem.",
            "A Superpolynomial Lower Bound for a Circuit Computing the Clique Function with at most (1/6)log log n Negation Gates.",
            "Bounds on the Efficiency of Generic Cryptographic Constructions.",
            "Approximating k-node Connected Subgraphs via Critical Graphs.",
            "A Parametrized Algorithm for Matroid Branch-Width.",
            "On the Performance of Greedy Algorithms in Packet Buffering.",
            "Analysis of Link Reversal Routing Algorithms.",
            "Two-Way Chaining with Reassignment.",
            "Cache-Oblivious B-Trees.",
            "A Powerful LL(k) Covering Transformation.",
            "Compressed Suffix Arrays and Suffix Trees with Applications to Text Indexing and String Matching.",
            "Recognizing More Unsatisfiable Random k-SAT Instances Efficiently.",
            "Optimal Online Algorithms for Multidimensional Packing Problems.",
            "Strictly Nonblocking WDM Cross-connects.",
            "Strong Spatial Mixing with Fewer Colors for Lattice Graphs.",
            "General Multiprocessor Task Scheduling: Approximate Solutions in Linear Time.",
            "Optimal Covering Tours with Turn Costs.",
            "On the Complexity of Network Synchronization.",
            "Stochastic Relations: Congruences, Bisimulations and the Hennessy--Milner Theorem.",
            "Sublinear Geometric Algorithms.",
            "Lowness for the Class of Schnorr Random Reals.",
            "An Efficient Algorithm for Computing Optimal Discrete Voltage Schedules.",
            "A Combinatorial Logarithmic Approximation Algorithm for the Directed Telephone Broadcast Problem.",
            "The Computational Complexity of Tutte Invariants for Planar Graphs.",
            "A Polynomial Time Approximation Scheme for the Multiple Knapsack Problem.",
            "The Rectilinear Steiner Arborescence Problem Is NP-Complete.",
            "Mapping Cycles and Trees on Wrap-Around Butterfly Graphs.",
            "WDM Switching Networks, Rearrangeable and Nonblocking [w, f]-connectors.",
            "Special Issue Dedicated To The Thirty-Sixth Annual ACM Symposium On Theory Of Computing (STOC 2004).",
            "Approximating the Cut-Norm via Grothendieck's Inequality.",
            "Lower Bounds for Local Search by Quantum Arguments.",
            "Approximating Fractional Packings and Coverings in O(1/epsilon) Iterations.",
            "Typical Properties of Winners and Losers in Discrete Optimization.",
            "Spectral Partitioning, Eigenvalue Bounds, and Circle Packings for Graphs of Bounded Genus.",
            "Using Nondeterminism to Amplify Hardness.",
            "Logarithmic Lower Bounds in the Cell-Probe Model.",
            "On Sums of Independent Random Variables with Unbounded Variance and Estimating the Average Degree in a Graph.",
            "Hit-and-Run from a Corner.",
            "Function Matching.",
            "Finding Four Independent Trees .",
            "Efficient Simulations by Queue Machines.",
            "The Complexity of the Local Hamiltonian Problem.",
            "Algorithms for Combining Rooted Triplets into a Galled Phylogenetic Network.",
            "Certifying Polynomial Time and Linear/Polynomial Space for Imperative Programs.",
            "Fast Construction of Nets in Low-Dimensional Metrics and Their Applications.",
            "Extracting Randomness via Repeated Condensing.",
            "Word Problems and Membership Problems on Compressed Words.",
            "Approximation Bounds for a General Class of Precedence Constrained Parallel Machine Scheduling Problems.",
            "Oblivious Polynomial Evaluation.",
            "An Algorithm for Computing Fundamental Solutions.",
            "Compact Labeling Scheme for Ancestor Queries.",
            "Quantum Query Complexity of Some Graph Problems.",
            "The Approximability of Three-valued MAX CSP.",
            "Balanced Allocations: The Heavily Loaded Case.",
            "Linearization and Completeness Results for Terminating Transitive Closure Queries on Spatial Databases.",
            "Partial Match Queries in Random k-d Trees.",
            "Power from Random Strings.",
            "Fully Dynamic Orthogonal Range Reporting on RAM."
        ]
    },
    {
        "name": "SICOMP",
        "year": "2004",
        "info": "Volume 34, 2004/2005",
        "count": 72,
        "papers": [
            "Fast Universalization of Investment Strategies.",
            "Labeling Schemes for Flow and Connectivity.",
            "A Characterization of Universal Stability in the Adversarial Queuing Model.",
            "Pseudorandom Generators in Propositional Proof Complexity.",
            "Algorithms for RH Mapping: New Ideas and Improved Analysis.",
            "Perfectness is an Elusive Graph Property.",
            "Almost Perfect Lattices, the Covering Radius Problem, and Applications to Ajtai's Connection Factor.",
            "Small Spans in Scaled Dimension.",
            "Random Walks on Truncated Cubes and Sampling 0-1 Knapsack Solutions.",
            "Balanced-Replication Algorithms for Distribution Trees.",
            "Multiembedding of Metric Spaces.",
            "Bounded-Depth Frege Lower Bounds for Weaker Pigeonhole Principles.",
            "A Complete Characterization of the Algebras of Minimal Bilinear Complexity.",
            "Nonindependent Randomized Rounding and an Application to Digital Halftoning.",
            "Instability of FIFO at Arbitrarily Low Rates in the Adversarial Queueing Model.",
            "Generalized Irreducibility of Consensus and the Equivalence of t-Resilient and Wait-Free Implementations of Consensus.",
            "Approximation Algorithms for the 0-Extension Problem.",
            "An Optimal Algorithm for the Maximum-Density Segment Problem.",
            "New Approximation Techniques for Some Linear Ordering Problems.",
            "Quick k-Median, k-Center, and Facility Location for Sparse Graphs.",
            "Online Scheduling to Minimize Average Stretch.",
            "Traveling with a Pez Dispenser (or, Routing Issues in MPLS).",
            "The Simplex Algorithm in Dimension Three.",
            "Temporal Reasoning about Two Concurrent Sequences of Events.",
            "Top-Down Analysis of Path Compression.",
            "Pseudo-Line Arrangements: Duality, Algorithms, and Applications.",
            "Layout of Graphs with Bounded Tree-Width.",
            "Abstract Combinatorial Programs and Efficient Property Testers.",
            "Load Balancing in Arbitrary Network Topologies with Stochastic Adversarial Input.",
            "A Second-Order Perceptron Algorithm.",
            "Nonmigratory Online Deadline Scheduling on Multiprocessors.",
            "On Even Triangulations of 2-Connected Embedded Graphs.",
            "Fault-Tolerant Scheduling.",
            "Classifying the Complexity of Constraints Using Finite Algebras.",
            "Online Scheduling of Precedence Constrained Tasks.",
            "Primal-Dual Meets Local Search: Approximating MSTs With Nonuniform Degree Bounds.",
            "The Complexity of the Union of (alpha, beta)-Covered Objects.",
            "Stochastic Machine Scheduling with Precedence Constraints.",
            "Improved Combinatorial Algorithms for Facility Location Problems.",
            "On the Relationship Between Clique-Width and Treewidth.",
            "Work-Competitive Scheduling for Cooperative Computing with Dynamic Groups.",
            "Curve-Sensitive Cuttings.",
            "Low-Dimensional Linear Programming with Violations.",
            "Dynamic LCA Queries on Trees.",
            "Orderly Spanning Trees with Applications.",
            "Omega(log n) Lower Bounds on the Amount of Randomness in 2-Private Computation.",
            "A Lower Bound on the Complexity of Polynomial Multiplication over Finite Fields.",
            "A Work-Optimal Deterministic Algorithm for the Certified Write-All Problem with a Nontrivial Number of Asynchronous Processors.",
            "The Bisimulation Problem for Equational Graphs of Finite Out-Degree.",
            "Learning Random Log-Depth Decision Trees under Uniform Distribution.",
            "A New Multilayered PCP and the Hardness of Hypergraph Vertex Cover.",
            "The Difficulty of Testing for Isomorphism against a Graph That Is Given in Advance.",
            "Fair Simulation Relations, Parity Games, and State Space Reduction for Bu\"chi Automata.",
            "The Complexity of Finding Paths in Graphs with Bounded Independence Number.",
            "Separating the Power of Monotone Span Programs over Different Fields.",
            "Efficiency of Oblivious versus Nonoblivious Schedulers for Optimistic, Rate-based Flow Control.",
            "Optimal Two-Stage Algorithms for Group Testing Problems.",
            "Strictly Nonblocking Multirate logd(N, m, p) Networks.",
            "SRT Division Algorithms as Dynamical Systems.",
            "Polynomial-Time Approximation Schemes for Geometric Intersection Graphs.",
            "Quantum Algorithms for Element Distinctness.",
            "Output-Sensitive Construction of the Union of Triangles.",
            "Extending Downward Collapse from 1-versus-2 Queries to m-versus-m + 1 Queries.",
            "Approximating the Minimum Spanning Tree Weight in Sublinear Time.",
            "Binary Space Partitions of Orthogonal Subdivisions.",
            "A Shortest Path Algorithm for Real-Weighted Undirected Graphs.",
            "On the Bounded Sum-of-Digits Discrete Logarithm Problem in Finite Fields.",
            "Duality Between Prefetching and Queued Writing with Parallel Disks.",
            "Decidable and Undecidable Problems about Quantum Automata.",
            "Novel Transformation Techniques Using Q-Heaps with Applications to Computational Geometry.",
            "Complexities for Generalized Models of Self-Assembly.",
            "Convergence Properties of the Gravitational Algorithm in Asynchronous Robot Systems."
        ]
    },
    {
        "name": "SICOMP",
        "year": "2003",
        "info": "Volume 33, 2003/2004",
        "count": 67,
        "papers": [
            "Improved Approximation Algorithms for the Uncapacitated Facility Location Problem.",
            "Faster Suffix Tree Construction with Missing Suffix Links.",
            "Nondeterministic Communication with a Limited Number of Advice Bits.",
            "Quality Meshing with Weighted Delaunay Refinement.",
            "Conflict-Free Colorings of Simple Geometric Regions with Applications to Frequency Assignment in Cellular Networks.",
            "Communication Complexity of Simultaneous Messages.",
            "Design and Analysis of Practical Public-Key Encryption Schemes Secure against Adaptive Chosen Ciphertext Attack.",
            "Counting Complexity Classes for Numeric Computations I: Semilinear Sets.",
            "An efficient polynomial time approximation scheme for the constrained minimum spanning tree problem using matroid intersection.",
            "Shape Fitting with Outliers.",
            "New stability results for adversarial queuing.",
            "On identifying codes in the triangular and square grids.",
            "A bound on the capacity of backoff and acknowledgment-based protocols.",
            "Stackelberg Scheduling Strategies.",
            "Hypergraphs in Model Checking: Acyclicity and Hypertree-Width versus Clique-Width.",
            "The Minimum All-Ones Problem for Trees.",
            "Scheduling with AND/OR Precedence Constraints.",
            "The Complexity of Choosing an H-Coloring (Nearly) Uniformly at Random.",
            "The Potential of the Approximation Method.",
            "Algorithms for Data Migration with Cloning.",
            "An Optimal Competitive Strategy for Walking in Streets.",
            "Learning a Hidden Matching.",
            "On Rational Number Reconstruction and Approximation.",
            "On Universal Classes of Extremely Random Constant-Time Hash Functions.",
            "Local Search Heuristics for k-Median and Facility Location Problems.",
            "Buffer Overflow Management in QoS Switches.",
            "On the Frame--Stewart Conjecture about the Towers of Hanoi.",
            "Incomplete Directed Perfect Phylogeny.",
            "(1+epsilon, beta)-Spanner Constructions for General Graphs.",
            "OPT Versus LOAD in Dynamic Storage Allocation.",
            "Distances and Finger Search in Random Binary Search Trees.",
            "The Effects of Temporary Sessions on Network Performance.",
            "Complete Axiomatizations for Reasoning about Knowledge and Time.",
            "Hardness of Approximation for Vertex-Connectivity Network Design Problems.",
            "The Glauber Dynamics on Colorings of a Graph with High Girth and Maximum Degree.",
            "Quantum Computation and Lattice Problems.",
            "Compaction, Retraction, and Constraint Satisfaction.",
            "Strict Polynomial-Time in Simulation and Extraction.",
            "The Complexity of Three-Way Statistical Tables.",
            "On Multidimensional Packing Problems.",
            "Counting Complexity of Solvable Black-Box Group Problems.",
            "Time of Deterministic Broadcasting in Radio Networks with Local Knowledge.",
            "The Parameterized Complexity of Counting Problems.",
            "On Worst-Case Robin Hood Hashing.",
            "Online Routing in Triangulations.",
            "Distributional Results for Costs of Partial Match Queries in Asymmetric K-Dimensional Tries.",
            "On Proving Circuit Lower Bounds against the Polynomial-Time Hierarchy.",
            "Efficient Algorithms for Optimal Stream Merging for Media-on-Demand.",
            "Better Online Algorithms for Scheduling with Machine Cost.",
            "Solving Equations in the Relational Algebra.",
            "Equivalences and Separations Between Quantum and Classical Learnability.",
            "On the Hardness of Graph Isomorphism.",
            "A Lambda Calculus for Quantum Computation.",
            "Circumference of Graphs with Bounded Degree.",
            "A Switching Lemma for Small Restrictions and Lower Bounds for k-DNF Resolution.",
            "Approximate Local Search in Combinatorial Optimization.",
            "A Note on the Homotopy Type of Wait-Free Atomic Snapshot Protocol Complexes.",
            "Average-Case Performance of the Apriori Algorithm.",
            "Fast, Distributed Approximation Algorithms for Positive Linear Programming with Applications to Flow Control.",
            "Preemptive Weighted Completion Time Scheduling of Parallel Jobs.",
            "Algebraic Properties for Selector Functions.",
            "Graphs with Tiny Vector Chromatic Numbers and Huge Chromatic Numbers.",
            "Disjoint NP-Pairs.",
            "Incremental Clustering and Dynamic Information Retrieval.",
            "Tight Bounds for Testing Bipartiteness in General Graphs.",
            "Depth Optimal Sorting Networks Resistant to k Passive Faults.",
            "Arithmetic Circuits and Polynomial Replacement Systems."
        ]
    },
    {
        "name": "SICOMP",
        "year": "2002",
        "info": "Volume 32, 2002/2003",
        "count": 79,
        "papers": [
            "Black-Box Concurrent Zero-Knowledge Requires (Almost) Logarithmically Many Rounds.",
            "The Nonstochastic Multiarmed Bandit Problem.",
            "A Virtually Synchronous Group Multicast Algorithm for WANs: Formal Approach.",
            "An Approximate L1-Difference Algorithm for Massive Data Streams.",
            "Limit Laws for Sums of Functions of Subtrees of Random Binary Search Trees.",
            "Approximating the Domatic Number.",
            "Machine-Independent Characterizations and Complete Problems for Deterministic Linear Time.",
            "Improved Approximations of Crossings in Graph Drawings and VLSI Layout Areas.",
            "Computational Complexity of Compaction to Reflexive Cycles.",
            "Backward Consistency and Sense of Direction in Advanced Distributed Systems.",
            "Binary Space Partitions for Line Segments with a Limited Number of Directions.",
            "Arc-Disjoint Paths in Expander Digraphs.",
            "The Probable Value of the Lovász--Schrijver Relaxations for Maximum Independent Set.",
            "Stability of Adaptive and Nonadaptive Packet Routing Policies in Adversarial Queueing Networks.",
            "Many to One Embeddings from Grids into Cylinders, Tori, and Hypercubes.",
            "Common-Face Embeddings of Planar Graphs.",
            "Accelerated Solution of Multivariate Polynomial Systems of Equations.",
            "New Bounds for Variable-Sized Online Bin Packing.",
            "On Local Search and Placement of Meters in Networks.",
            "Lower Bounds for Matrix Product in Bounded Depth Circuits with Arbitrary Gates.",
            "New Results on Monotone Dualization and Generating Hypergraph Transversals.",
            "Computing the Median with Uncertainty.",
            "Acceleration of Euclidean Algorithm and Rational Number Reconstruction.",
            "Rearrangeability of (2n-1)-Stage Shuffle-Exchange Networks.",
            "Identity-Based Encryption from the Weil Pairing.",
            "3-Dimensional Euclidean Voronoi Diagrams of Lines with a Fixed Number of Orientations.",
            "Setting Parameters by Example.",
            "An Approximation Algorithm for Minimum Convex Cover with Logarithmic Performance Guarantee.",
            "Parallel Processor Scheduling with Limited Number of Preemptions.",
            "Nondeterministic Quantum Query and Communication Complexities.",
            "Semi-Online Maintenance of Geometric Optima and Measures.",
            "Improved Bounds for the Online Scheduling Problem.",
            "New Lower Bound Techniques for Dynamic Partial Sums and Related Problems.",
            "The Reconstruction of Doubled Genomes.",
            "Expected-Case Complexity of Approximate Nearest Neighbor Searching.",
            "The Online Median Problem.",
            "A Faster Scaling Algorithm for Minimizing Submodular Functions.",
            "The Partition Technique for Overlays of Envelopes.",
            "Computing Phylogenetic Roots with Bounded Degrees and Errors.",
            "Lexicographical Generation of a Generalized Dyck Language.",
            "Partial Match Queries in Random Quadtrees.",
            "The Hidden Subgroup Problem and Quantum Computation Using Group Representations.",
            "Models for Random Constraint Satisfaction Problems.",
            "Macro Tree Translations of Linear Size Increase are MSO Definable.",
            "The Impact of Timing Knowledge on the Session Problem.",
            "Multirate Rearrangeable Clos Networks and a Generalized Edge-Coloring Problem on Bipartite Graphs.",
            "An Approximation Algorithm for the Minimum-Cost k-Vertex Connected Subgraph.",
            "Tree Pattern Matching to Subset Matching in Linear Time.",
            "Revisiting Tucker's Algorithm to Color Circular Arc Graphs.",
            "Genetic Design of Drugs Without Side-Effects.",
            "Windows Scheduling Problems for Broadcast Systems.",
            "A Polynomial-Time Algorithm for Near-Perfect Phylogeny.",
            "The 3-Colorability Problem on Graphs with Maximum Degree Four.",
            "Algorithms for Boolean Function Query Properties.",
            "On Testing Convexity and Submodularity.",
            "Lower Bounds for Matrix Product.",
            "Searching for Sorted Sequences of Kings in Tournaments.",
            "An Optimal Algorithm for Checking Regularity.",
            "Dimension in Complexity Classes.",
            "The Natural Work-Stealing Algorithm is Stable.",
            "The Algebraic Approach to the Discrete Cosine and Sine Transforms and Their Fast Algorithms.",
            "Approximation Schemes for Minimum Latency Problems.",
            "Reachability and Distance Queries via 2-Hop Labels.",
            "On the Complexity of Matrix Product.",
            "Minimizing Total Completion Time on Parallel Machines with Deadline Constraints.",
            "Kolmogorov Complexity and Deterministic Context-Free Languages.",
            "Finding a Path of Superlogarithmic Length.",
            "Better Algorithms for Unfair Metrical Task Systems and Applications.",
            "Matrix Rounding under the Lp-Discrepancy Measure and Its Application to Digital Halftoning.",
            "Finding Points on Curves over Finite Fields.",
            "On Frictional Mechanical Systems and Their Computational Power.",
            "Computing Elementary Symmetric Polynomials with a Subpolynomial Number of Multiplications.",
            "Optimal External Memory Interval Management.",
            "Covering Rectilinear Polygons with Axis-Parallel Rectangles.",
            "On the Autoreducibility of Random Sequences.",
            "The Quantum Communication Complexity of Sampling.",
            "The Expected Number of 3D Visibility Events Is Linear.",
            "Pseudotriangulations from Surfaces and a Novel Type of Edge Flip.",
            "A Subquadratic Sequence Alignment Algorithm for Unrestricted Scoring Matrices."
        ]
    },
    {
        "name": "SICOMP",
        "year": "2001",
        "info": "Volume 31, 2001/2002",
        "count": 96,
        "papers": [
            "A Polynomial Time Approximation Scheme for General Multiprocessor Job Scheduling.",
            "A Decomposition Theorem for Maximum Weight Bipartite Matchings.",
            "Traveling Salesman-Based Curve Reconstruction in Polynomial Time.",
            "Tree Search on an Atomic Model for Message Passing.",
            "On-line Randomized Call Control Revisited .",
            "Fixed-Parameter Tractability, Definability, and Model-Checking.",
            "Approximation Techniques for Average Completion Time Scheduling.",
            "Markov Chain Algorithms for Planar Lattice Structures.",
            "There are No Sparse NPw-Hard Sets.",
            "Randomness and Recursive Enumerability.",
            "Treewidth and Minimum Fill-in: Grouping the Minimal Separators.",
            "The Accommodating Function: A Generalization of the Competitive Ratio.",
            "Generating Bracelets in Constant Amortized Time.",
            "Disjunctions of Horn Theories and Their Cores.",
            "A Fully Dynamic Algorithm for Recognizing and Representing Proper Interval Graphs.",
            "Provably Fast and Accurate Recovery of Evolutionary Trees through Harmonic Greedy Triplets.",
            "Proportion Extend Sort.",
            "Approximating the Throughput of Multiple Machines in Real-Time Scheduling.",
            "Low Redundancy in Static Dictionaries with Constant Query Time.",
            "Maintaining Minimum Spanning Forests in Dynamic Graphs.",
            "Evolutionary Trees Can be Learned in Polynomial Time in the Two-State General Markov Model.",
            "The Complexity of Counting in Sparse, Regular, and Planar Graphs.",
            "Matchings Meeting Quotas and Their Impact on the Blow-Up Lemma.",
            "Optimal Buy-and-Hold Strategies for Financial Markets with Bounded Daily Returns.",
            "Quantum Formulas: A Lower Bound and Simulation.",
            "A 2-Approximation Algorithm for the Directed Multiway Cut Problem.",
            "The Global Power of Additional Queries to P-Random Oracles.",
            "Geometric Complexity Theory I: An Approach to the P vs. NP and Related Problems.",
            "On-Line Load Balancing in a Hierarchical Server Topology.",
            "Checking Approximate Computations of Polynomials and Functional Equations.",
            "The Polygon Exploration Problem.",
            "On the Computational Complexity of Upward and Rectilinear Planarity Testing.",
            "New Algorithmic Aspects of the Local Lemma with Applications to Routing and Partitioning.",
            "Adaptive and Efficient Algorithms for Lattice Agreement and Renaming.",
            "Algorithms for Capacitated Vehicle Routing.",
            "Optimal Sampling Strategies in Quicksort and Quickselect.",
            "The Compactness of Interval Routing for Almost All Graphs.",
            "Topological Lower Bounds on Algebraic Random Access Machines.",
            "Succinct Representation of Balanced Parentheses and Static Trees.",
            "Temporal Logic and Semidirect Products: An Effective Characterization of the Until Hierarchy.",
            "Parallel Quantum Computation and Quantum Codes.",
            "Analysis of Timing-Based Mutual Exclusion with Random Times.",
            "A Characterization of Eventual Byzantine Agreement.",
            "Evasiveness of Subgraph Containment and Related Properties.",
            "Compressibility and Resource Bounded Measure.",
            "Resource-Bounded Kolmogorov Complexity Revisited.",
            "Separation of NP-Completeness Notions.",
            "Approximation Algorithms for Single-Source Unsplittable Flow.",
            "Proof Techniques for Cryptographic Processes.",
            "Corrigendum: Proximity in Arrangements of Algebraic Sets.",
            "A Layered Analysis of Consensus.",
            "On Binary Searching with Nonuniform Costs.",
            "The Efficiency of Resolution and Davis--Putnam Procedures.",
            "A Decision Procedure for Unitary Linear Quantum Cellular Automata.",
            "A Polylogarithmic Approximation of the Minimum Bisection.",
            "Lattice Embeddings for Abstract Bounded Reducibilities.",
            "Decidability of Termination of Grid String Rewriting Rules.",
            "Randomness, Computability, and Density.",
            "Space Complexity in Propositional Calculus.",
            "An Enumerative Geometry Framework for Algorithmic Line Problems in $\\mathbb R^3$.",
            "Quantum Circuits That Can Be Simulated Classically in Polynomial Time.",
            "Finding Double Euler Trails of Planar Graphs in Linear Time.",
            "The Combinatorial Structure of Wait-Free Solvable Tasks.",
            "Recognizing Dart-Free Perfect Graphs.",
            "Algorithms for a Minimum Volume Enclosing Simplex in Three Dimensions.",
            "Perceptron, Winnow, and PAC Learning.",
            "Minimizing the Flow Time Without Migration.",
            "Pseudorandom Functions and Factoring.",
            "Generators of $H_1(\\Gamma_{h}, \\mathbbZ)$ for Triangulated Surfaces: Construction and Classification.",
            "A Theorem on Sensitivity and Applications in Private Computation.",
            "A Linear Algorithm for Finding the Invariant Edges of an Edge-Weighted Graph.",
            "Characterizations of 1-Way Quantum Finite Automata.",
            "Fast Greedy Algorithms for Constructing Sparse Geometric Spanners.",
            "Graph Nonisomorphism Has Subexponential Size Proofs Unless the Polynomial-Time Hierarchy Collapses.",
            "On Counting Independent Sets in Sparse Graphs.",
            "Safe Weak Minimization Revisited.",
            "Testing Membership in Languages that Have Small Width Branching Programs.",
            "Self-Stabilizing Symmetry Breaking in Constant Space.",
            "Approximating the Longest Cycle Problem in Sparse Graphs.",
            "Improved Approximation Algorithms for the Vertex Cover Problem in Graphs and Hypergraphs.",
            "Dual-Bounded Generating Problems: All Minimal Integer Solutions for a Monotone System of Linear Inequalities.",
            "Lower Bounds for Leader Election and Collective Coin-Flipping in the Perfect Information Model.",
            "Hardness of Approximate Hypergraph Coloring.",
            "Phase Change of Limit Laws in the Quicksort Recurrence under Varying Toll Functions.",
            "Are Bitvectors Optimal?",
            "On the Boundary Complexity of the Union of Fat Triangles.",
            "Approximate String Matching: A Simpler Faster Algorithm.",
            "A Matter of Degree: Improved Approximation Algorithms for Degree-Bounded Minimum Spanning Trees.",
            "Maintaining Stream Statistics over Sliding Windows.",
            "Curvature-Constrained Shortest Paths in a Convex Polygon.",
            "Parallel Integer Sorting Is More Efficient Than Parallel Comparison Sorting on Exclusive Write PRAMs.",
            "A Randomized Time-Work Optimal Parallel Algorithm for Finding a Minimum Spanning Forest.",
            "Lower Bounds for Lucas Chains.",
            "Simple Learning Algorithms for Decision Trees and Multivariate Polynomials.",
            "A Deterministic Polynomial-Time Algorithm for Heilbronn's Problem in Three Dimensions.",
            "The Minimization Problem for Boolean Formulas."
        ]
    },
    {
        "name": "SICOMP",
        "year": "2000",
        "info": "Volume 30, 2000",
        "count": 90,
        "papers": [
            "On the Dynamic Finger Conjecture for Splay Trees. Part I: Splay Sorting log n-Block Sequences.",
            "On the Dynamic Finger Conjecture for Splay Trees. Part II: The Proof.",
            "On RAM Priority Queues.",
            "Robot Navigation with Distance Queries.",
            "Preemptive Scheduling of Parallel Jobs on Multiprocessors.",
            "Nonuniform Discretization for Kinodynamic Motion Planning and its Applications.",
            "Allocating Bandwidth for Bursty Connections.",
            "Motion Planning of Legged Robots.",
            "Tight Fault Locality.",
            "Convergence Criteria for Genetic Algorithms.",
            "A More Efficient Approximation Scheme for Tree Alignment.",
            "Beyond Competitive Analysis.",
            "On the Difficulty of Designing Good Classifiers.",
            "Two-Prover Protocols - Low Error at Affordable Rates.",
            "Message Multicasting in Heterogeneous Networks.",
            "Complexity of Some Problems Concerning Varieties and Quasi-Varieties of Algebras.",
            "An Algorithm for Heilbronn's Problem.",
            "Nonmalleable Cryptography.",
            "Time and Space Lower Bounds for Nonblocking Implementations.",
            "Efficient Search for Approximate Nearest Neighbor in High Dimensional Spaces.",
            "When Hamming Meets Euclid: The Approximability of Geometric TSP and Steiner Tree.",
            "Self-Stabilization by Counter Flushing.",
            "The Power of Migration in Multiprocessor Scheduling of Real-Time Systems.",
            "Approximating Minimum-Size k-Connected Spanning Subgraphs via Matching.",
            "Random Sampling, Halfspace Range Reporting, and Construction of (<= k)-Levels in Three Dimensions.",
            "A Generalization of Resource-Bounded Measure, with Application to the BPP vs. EXP Problem.",
            "Cavity Matchings, Label Compressions, and Unrooted Evolutionary Trees.",
            "Constructive, Deterministic Implementation of Shared Memory on Meshes.",
            "How to Make a Square Grid Framework with Cables Rigid.",
            "On a Conjecture by Coffman, Flatto, and Wright on Stochastic Machine Minimization.",
            "All of Us Are Smarter than Any of Us: Nondeterministic Wait-Free Hierarchies Are Not Robust.",
            "From Gene Trees to Species Trees.",
            "The General Structure of Edge-Connectivity of a Vertex Subset in a Graph and its Incremental Maintenance. Odd Case.",
            "Formal-Language-Constrained Path Problems.",
            "A Fast General Methodology for Information-Theoretically Optimal Encodings of Graphs.",
            "Efficiently Constructing the Visibility Graph of a Simple Polygon with Obstacles.",
            "Optimal Worst Case Formulas Comparing Cache Memory Associativity.",
            "Markov Paging.",
            "Asymptotic Behavior of the Height in a Digital Search Tree and the Longest Phrase of the Lempel-Ziv Scheme.",
            "Simple Confluently Persistent Catenable Lists.",
            "Approximating the Stretch Factor of Euclidean Graphs.",
            "The Formula Isomorphism Problem.",
            "The Computational Complexity to Evaluate Representations of General Linear Groups.",
            "The Computational Complexity of Immanants.",
            "An Algorithmic Regularity Lemma for Hypergraphs.",
            "A Polynomial Approximation Algorithm for the Minimum Fill-In Problem.",
            "Parallel Complexity of Computations with General and Toeplitz-Like Matrices Filled with Integers and Extensions.",
            "From Static to Dynamic Routing: Efficient Transformations of Store-and-Forward Protocols.",
            "Determining Consensus Numbers.",
            "Early Detection of Message Forwarding Faults.",
            "The Density of Weakly Complete Problems under Adaptive Reductions.",
            "A Finite State Version of the Kraft--McMillan Theorem.",
            "An 8-Approximation Algorithm for the Subset Feedback Vertex Set Problem.",
            "Computationally Sound Proofs.",
            "The Complexity of Modular Graph Automorphism.",
            "Approximating Shortest Paths on a Nonconvex Polyhedron.",
            "Taking a Walk in a Planar Arrangement.",
            "Finding Sets Covering a Point with Application to Mesh-Free Galerkin Methods.",
            "An O(nlog n) Algorithm for the Maximum Agreement Subtree Problem for Binary Trees.",
            "The WARM-UP Algorithm: A Lagrangian Construction of Length Restricted Huffman Codes.",
            "A Near-Tight Lower Bound on the Time Complexity of Distributed Minimum-Weight Spanning Tree Construction.",
            "Fast and Optimal Parallel Multidimensional Search in PRAMs with Applications to Linear Programming and Related Problems.",
            "On the Relative Complexity of Resolution Refinements and Cutting Planes Proof Systems.",
            "Randomness is Hard.",
            "On the Determinization of Weighted Finite Automata.",
            "Algorithms for the Relaxed Online Bin-Packing Model.",
            "Tight Bounds for Searching a Sorted Array of Strings.",
            "Minimum Networks in Uniform Orientation Metrics.",
            "General Dynamic Routing with Per-Packet Delay Guarantees of O(Distance + 1/Session Rate).",
            "A Decomposition Theorem for Task Systems and Bounds for Randomized Server Problems.",
            "Linear Time Algorithms for Hamiltonian Problems on (Claw, Net)-Free Graphs.",
            "Squarish k-d Trees.",
            "Computations of Uniform Recurrence Equations Using Minimal Memory Size.",
            "Approximation Algorithms for Curvature-Constrained Shortest Paths.",
            "On Bipartite Drawings and the Linear Arrangement Problem.",
            "Edge-Disjoint Paths in Expander Graphs.",
            "Efficient Dynamic Traitor Tracing.",
            "Quantum Entanglement and Communication Complexity.",
            "Regular Languages are Testable with a Constant Number of Queries.",
            "The Approximability of Constraint Satisfaction Problems.",
            "Dual-Issue Scheduling for Binary Trees with Spills and Pipelined Loads.",
            "A Polynomial Time Approximation Scheme for Inferring Evolutionary Trees from Quartet Topologies and Its Application.",
            "An Extension of Path Coupling and Its Application to the Glauber Dynamics for Graph Colorings.",
            "Optimal Simulations between Unary Automata.",
            "An Approximation Algorithm for Feedback Vertex Sets in Tournaments.",
            "The Shortest Vector in a Lattice is Hard to Approximate to within Some Constant.",
            "Dual-Bounded Generating Problems: Partial and Multiple Transversals of a Hypergraph.",
            "A Constant-Factor Approximation Algorithm for Packet Routing and Balancing Local vs. Global Criteria.",
            "Variable-Sized Bin Packing: Tight Absolute Worst-Case Performance Ratios for Four Approximation Algorithms.",
            "First-Order Specifications of Programmable Data Types."
        ]
    },
    {
        "name": "SICOMP",
        "year": "1999",
        "info": "Volume 29, 1999/2000",
        "count": 95,
        "papers": [
            "Multiple NonInteractive Zero Knowledge Proofs Under General Assumptions.",
            "Tight Analyses of Two Local Load Balancing Algorithms.",
            "An Algorithm for Shortest Paths in Bipartite Digraphs with Concave Weight Matrices and its Applications.",
            "Regular Closure of Deterministic Languages.",
            "Constructing Evolutionary Trees in the Presence of Polymorphic Characters.",
            "The Complexity of Tree Automata and Logics of Programs.",
            "Finding Separator Cuts in Planar Graphs within Twice the Optimal.",
            "Balanced Allocations.",
            "The Algorithmic Aspects of Uncrowded Hypergraphs.",
            "Achilles, Turtle, and Undecidable Boundedness Problems for Small DATALOG Programs.",
            "Tight Bounds on the Size of Fault-Tolerant Merging and Sorting Networks with Destructive Faults.",
            "Routing with Minimum Wire Length in the Dogleg-Free Manhattan Model is NP-Complete.",
            "On Regular Tree Embeddings.",
            "Equivalence of Measures of Complexity Classes.",
            "The Swapping Problem on a Line.",
            "How Good is the Goemans-Williamson MAX CUT Algorithm?",
            "Solvability in Asynchronous Environments II: Finite Interactive Tasks.",
            "Weakly Triangulated Comparability Graphs.",
            "On Approximately Counting Colorings of Small Degree Graphs.",
            "Ranking Primitive Recursions: The Low Grzegorczyk Classes Revisited.",
            "Communication-Efficient Parallel Sorting.",
            "Proximity in Arrangements of Algebraic Sets.",
            "Better Bounds for Online Scheduling.",
            "Tight Bounds for On-Line Tree Embeddings.",
            "A Randomized Fully Polynomial Time Approximation Scheme for the All-Terminal Network Reliability Problem.",
            "On the Maximum Scatter Traveling Salesperson Problem.",
            "The Parametrized Complexity of Some Fundamental Problems in Coding Theory.",
            "Two- and Higher-Dimensional Pattern Matching in Optimal Expected Time.",
            "Kolmogorov Random Graphs and the Incompressibility Method.",
            "Self-Stabilizing Algorithms for Finding Centers and Medians of Trees.",
            "Automatic Methods for Hiding Latency in Parallel and Distributed Computation.",
            "Improved Approximation Guarantees for Packing and Covering Integer Programs.",
            "An Efficient Algorithm for Generating Necklaces with Fixed Density.",
            "Finding an Even Simple Path in a Directed Planar Graph.",
            "The Angular-Metric Traveling Salesman Problem.",
            "On Learning Functions from Noise-Free and Noisy Samples via Occam's Razor.",
            "Navigation in Hypertext Is Easy Only Sometimes.",
            "A Polynomial-Time Approximation Scheme for Minimum Routing Cost Spanning Trees.",
            "Complexity of Deciding Sense of Direction.",
            "Rigorous Time/Space Trade-offs for Inverting Functions.",
            "Bubbles: Adaptive Routing Scheme for High-Speed Dynamic Networks.",
            "Randomly Sampling Molecules.",
            "Computational Sample Complexity.",
            "A Faster and Simpler Algorithm for Sorting Signed Permutations by Reversals.",
            "Compression of Low Entropy Strings with Lempel-Ziv Algorithms.",
            "Vertical Decomposition of Shallow Levels in 3-Dimensional Arrangements and Its Applications.",
            "A 2½-Approximation Algorithm for Shortest Superstring.",
            "On the Structure of Logspace Probabilistic Complexity Classes.",
            "Approximation Algorithms for the Orthogonal Z-Oriented Three-Dimensional Packing Problem.",
            "Examining Computational Geometry, Van Emde Boas Trees, and Hashing from the Perspective of the Fusion Tree.",
            "Near-Optimal Parallel Prefetching and Caching.",
            "Complexity Results for First-Order Two-Variable Logic with Counting.",
            "Making Nondeterminism Unambiguous.",
            "A Combinatorial Consistency Lemma with Application to Proving the PCP Theorem.",
            "Verification of Identities.",
            "Exploring Unknown Environments.",
            "Reducibility and Completeness in Private Computations.",
            "Lower Bounds for (MODp-MODm) Circuits.",
            "Shortest Path Queries Among Weighted Obstacles in the Rectilinear Plane.",
            "Reducing Randomness via Irrational Numbers.",
            "On the Power of Logic Resynthesis.",
            "Application-Controlled Paging for a Shared Cache.",
            "Perfect-Information Leader Election with Optimal Resilience.",
            "Node-Disjoint Paths on the Mesh and a New Trade-Off in VLSI Layout.",
            "Quality Mesh Generation in Higher Dimensions.",
            "Containment and Optimization of Object-Preserving Conjunctive Queries.",
            "Robust Plane Sweep for Intersecting Segments.",
            "Binary Space Partitions for Fat Rectangles.",
            "Wait-Free k-Set Agreement is Impossible: The Topology of Public Knowledge.",
            "An Optimal Algorithm for Monte Carlo Estimation.",
            "Separating Complexity Classes Using Autoreducibility.",
            "Maintenance of 2- and 3-Edge-Connected Components of Graphs II.",
            "Restructuring Partitioned Normal Form Relations without Information Loss.",
            "Linear-Time Approximation Algorithms for Computing Numerical Summation with Provably Small Errors.",
            "Precision-Sensitive Euclidean Shortest Path in 3-Space.",
            "Optimal Information Gathering on the Internet with Time and Cost Constraints.",
            "Virtual Path Layouts in ATM Networks.",
            "Self-Testing without the Generator Bottleneck.",
            "Safe Constraint Queries.",
            "On Broadcast Disk Paging.",
            "Contention Resolution in Hashing Based Shared Memory Simulations.",
            "All-Pairs Almost Shortest Paths.",
            "Improved Data Structures for Fully Dynamic Biconnectivity.",
            "Optimal Combinatorial Functions Comparing Multiprocess Allocation Performance in Multiprocessor Systems.",
            "The CREW PRAM Complexity of Modular Inversion.",
            "Dynamic Maintenance of Maxima of 2-d Point Sets.",
            "The Complexity of the A B C Problem.",
            "The Load and Availability of Byzantine Quorum Systems.",
            "An Online Algorithm for Improving Performance in Navigation.",
            "On Interpolation and Automatization for Frege Systems.",
            "Space-Time Tradeoffs for Emptiness Queries.",
            "Parallel Sorting with Limited Bandwidth.",
            "Constructing Planar Cuttings in Theory and Practice.",
            "On Quiescent Reliable Communication.",
            "Gadgets, Approximation, and Linear Programming."
        ]
    },
    {
        "name": "SICOMP",
        "year": "1999",
        "info": "Volume 28, 1999",
        "count": 115,
        "papers": [
            "Optimal Biweighted Binary Trees and the Complexity of Maintaining Partial Sums.",
            "Dynamic 2-Connectivity with Backtracking.",
            "On the Structure of NP_C.",
            "Weighted NP Optimization Problems: Logical Definability and Approximation Properties.",
            "The Computational Structure of Monotone Monadic SNP and Constraint Satisfaction: A Study through Datalog and Group Theory.",
            "Asymptotically Tight Bounds for Performing BMMC Permutations on Parallel Disk Systems.",
            "L-Printable Sets.",
            "The Inverse Satisfiability Problem.",
            "On Syntactic versus Computational Views of Approximability.",
            "Maximum k-Chains in Planar Point Sets: Combinatorial Structure and Algorithms.",
            "Fast Algorithms for Constructing t-Spanners and Paths with Stretch t.",
            "Smart SMART Bounds for Weighted Response Time Scheduling.",
            "New Approximation Guarantees for Minimum-Weight k-Trees and Prize-Collecting Salesmen.",
            "Near-Linear Time Construction of Sparse Neighborhood Covers.",
            "Unoriented Theta-Maxima in the Plane: Complexity and Algorithms.",
            "A Spectral Algorithm for Seriation and the Consecutive Ones Problem.",
            "New Collapse Consequences of NP Having Small Circuits.",
            "Sublogarithmic Bounds on Space and Reversals.",
            "Separator-Based Sparsification II: Edge and Vertex Connectivity.",
            "A Downward Collapse within the Polynomial Hierarchy.",
            "Genericity, Randomness, and Polynomial-Time Approximations.",
            "Universal Limit Laws for Depths in Random Trees.",
            "Average-Case Lower Bounds for Noisy Boolean Decision Trees.",
            "Competitive Algorithms for Layered Graph Traversal.",
            "On Multirate Rearrangeable Clos Networks.",
            "Finding the Constrained Delaunay Triangulation and Constrained Voronoi Diagram of a Simple Polygon in Linear Time.",
            "Reconstructing Algebraic Functions from Mixed Data.",
            "Optimal Broadcast with Partial Knowledge.",
            "Primal-Dual RNC Approximation Algorithms for Set Cover and Covering Integer Programs.",
            "Optimal Construction of Edge-Disjoint Paths in Random Graphs.",
            "Fully Dynamic Algorithms for Bin Packing: Being (Mostly) Myopic Helps.",
            "Dynamic Trees and Dynamic Point Location.",
            "Query Order.",
            "Finding the k Shortest Paths.",
            "Exact Learning of Discretized Geometric Concepts.",
            "Fast Exponentiation Using Data Compression.",
            "A Polynomial Time Complexity Bound for Computations on Curves.",
            "Stochastic Contention Resolution With Short Delays.",
            "Asymptotically Optimal Election on Weighted Rings.",
            "The Queue-Read Queue-Write PRAM Model: Accounting for Contention in Parallel Algorithms.",
            "A Constant-Factor Approximation Algorithm for the Geometric k-MST Problem in the Plane.",
            "Solvability of Consensus: Composition Breaks Down for NonDeterministic Types.",
            "A Lower Bound for Integer Multiplication with Read-Once Branching Programs.",
            "Total Coloring With Delta + (log Delta) Colors.",
            "Computing components and projections of curves over finite fields.",
            "Bipartite Edge Coloring in O(Delta m) Time.",
            "Row-Major Sorting on Meshes.",
            "Robust Proximity Queries: An Illustration of Degree-Driven Algorithm Design.",
            "Failure Detection and Randomization: A Hybrid Approach to Solve Consensus.",
            "Average Profile of the Generalized Digital Search Tree and the Generalized Lempel-Ziv Algorithm.",
            "The Maximum Partition Matching Problem with Applications.",
            "Optimal Bidding Algorithms Against Cheating in Multiple-Object Auctions.",
            "Three-Processor Tasks Are Undecidable.",
            "Simple Algorithms for Routing on Butterfly Networks with Bounded Queues.",
            "Fast and Simple Algorithms for Recognizing Chordal Comparability Graphs and Interval Graphs.",
            "Fast Connected Components Algorithms for the EREW PRAM.",
            "Products and Help Bits in Decision Trees.",
            "A Time-Space Tradeoff for Undirected Graph Traversal by Walking Automata.",
            "On the Approximability of Numerical Taxonomy (Fitting Distances by Tree Metrics).",
            "Competitive On-Line Algorithms for Distributed Data Management.",
            "Efficient Database Updates with Independent Schemes.",
            "Learning DNF over the Uniform Distribution Using a Quantum Example Oracle.",
            "Approximability and Nonapproximability Results for Minimizing Total Flow Time on a Single Machine.",
            "Fast Estimation of Diameter and Shortest Paths (Without Matrix Multiplication).",
            "Constructing Approximate Shortest Path Maps in Three Dimensions.",
            "New Lower Bounds for Convex Hull Problems in Odd Dimensions.",
            "The Height and Size of Random Hash Trees and Random Pebbled Hash Trees.",
            "On Rearrangeability of Multirate Clos Networks.",
            "Design of On-Line Algorithms Using Hitting Times.",
            "Efficient Generation of Minimal Length Addition Chains.",
            "Distributional Word Problem for Groups.",
            "Linear Time Algorithms for Dominating Pairs in Asteroidal Triple-free Graphs.",
            "Guillotine Subdivisions Approximate Polygonal Subdivisions: A Simple Polynomial-Time Approximation Scheme for Geometric TSP, k-MST, and Related Problems.",
            "Fine Separation of Average-Time Complexity Classes.",
            "Buckets, Heaps, Lists, and Monotone Priority Queues.",
            "Distributed Anonymous Mobile Robots: Formation of Geometric Patterns.",
            "A Pseudorandom Generator from any One-way Function.",
            "Local Labeling and Resource Allocation Using Preprocessing.",
            "Space-efficient Routing Tables for Almost All Networks and the Incompressibility Method.",
            "Computing with Very Weak Random Sources.",
            "Lower Bounds in a Parallel Model without Bit Operations.",
            "Stack and Queue Layouts of Directed Acyclic Graphs: Part I.",
            "Diagnosis of Wiring Networks: An Optimal Randomized Algorithm for Finding Connected Components of Unknown Graphs.",
            "Product Range Spaces, Sensitive Sampling, and Derandomization.",
            "Automatic Nonzero Structure Analysis.",
            "Stack and Queue Layouts of Directed Acyclic Graphs: Part II.",
            "Membership in Constant Time and Almost-Minimum Space.",
            "Derandomizing Approximation Algorithms Based on Semidefinite Programming.",
            "The Dynamic Parallel Complexity of Computational Circuits.",
            "The Relationship Between Breaking the Diffie-Hellman Protocol and Computing Discrete Logarithms.",
            "Selecting the Median.",
            "Structure in Approximation Classes.",
            "An Efficient Data Structure for Lattice Operations.",
            "Bandwidth Allocation with Preemption.",
            "An Optical Simulation of Shared Memory.",
            "Time-Lapse Snapshots.",
            "The Construction of Huffman Codes is a Submodular (\"Convex\") Optimization Problem Over a Lattice of Binary Trees.",
            "Tractability of Parameterized Completion Problems on Chordal, Strongly Chordal, and Proper Interval Graphs.",
            "Tree Data Structures for N-Body Simulation.",
            "The Power of Vacillation in Language Learning.",
            "An Associative Block Design ABD(8, 5).",
            "On the Robustness of Functional Equations.",
            "New Results on the Old k-opt Algorithm for the Traveling Salesman Problem.",
            "Parallel Complexity of Numerically Accurate Linear System Solvers.",
            "Approximate Complex Polynomial Evaluation in Near Constant Work Per Point.",
            "Optimal Search in Trees.",
            "Weak Random Sources, Hitting Sets, and BPP Simulations.",
            "Dominators in Linear Time.",
            "Approximating Capacitated Routing and Delivery Problems.",
            "On Floor-Plan of Plane Graphs.",
            "Horn Extensions of a Partially Defined Boolean Function.",
            "Fast Approximate Graph Partitioning Algorithms.",
            "An Optimal Algorithm for Euclidean Shortest Paths in the Plane.",
            "Tight Lower Bounds for st-Connectivity on the NNJAG Model.",
            "Computing Two-Dimensional Integer Hulls."
        ]
    },
    {
        "name": "SICOMP",
        "year": "1998",
        "info": "Volume 27, 1998",
        "count": 81,
        "papers": [
            "Hypercubic Sorting Networks.",
            "The Shrinkage Exponent of de Morgan Formulas is 2.",
            "Shared Memory Consistency Conditions for Nonsequential Execution: Definitions and Programming Strategies.",
            "Two-Dimensional Periodicity in Rectangular Arrays.",
            "A Fast Discrete Approximation Algorithm for the Radon Transform.",
            "Value Sets of Some Polynomials Over Finite Fields GF(22m).",
            "Optimal Upward Planarity Testing of Single-Source Digraphs.",
            "Linear and O(n log n) Time Minimum-Cost Matching Algorithms for Quasi-Convex Tours.",
            "Space-Efficient Scheduling of Multithreaded Computations.",
            "Simulating Threshold Circuits by Majority Circuits.",
            "Fully Polynomial Byzantine Agreement for n > 3t Processors in t + 1 Rounds.",
            "An O(log k) Approximate Min-Cut Max-Flow Theorem and Approximation Algorithm.",
            "A Sublinear Time Distributed Algorithm for Minimum-Weight Spanning Trees.",
            "Atomic Snapshots in O(n log n) Operations.",
            "Circuit Bottom Fan-In and Computational Power.",
            "On the Complexity of Computing Mixed Volumes.",
            "Interpolating Arithmetic Read-Once Formulas in Parallel.",
            "An On-Line Algorithm for Some Uniform Processor Scheduling.",
            "The Load, Capacity, and Availability of Quorum Systems.",
            "Space-Efficient Deterministic Simulation of Probabilistic Automata.",
            "Efficient Matrix Chain Ordering in Polylog Time.",
            "Computing Many Faces in Arrangements of Lines and Segments.",
            "Fault-Tolerant Computation in the Full Information Model.",
            "A Spectral Approach to Lower Bounds with Applications to Geometric Searching.",
            "Incremental String Comparison.",
            "Localizing a Robot with Minimum Travel.",
            "Listing All Minimal Separators of a Graph.",
            "Efficient Self-Embedding of Butterfly Networks with Random Faults.",
            "Splittings, Robustness, and Structure of Complete Sets.",
            "Constructing Levels in Arrangements and Higher Order Voronoi Diagrams.",
            "A Constant Time Optimal Parallel Algorithm for Two-Dimensional Pattern Matching.",
            "Improved Randomized On-Line Algorithms for the List Update Problem.",
            "Computing the Additive Complexity of Algebraic Circuits with Root Extracting.",
            "An Omega(D log (N/D)) Lower Bound for Broadcast in Radio Networks.",
            "Optimal On-Line Search and Sublinear Time Update in String Matching.",
            "Introduction to Special Section on Probabilistic Proof Systems.",
            "On the Power of Finite Automata with Both Nondeterministic and Probabilistic States.",
            "A Parallel Repetition Theorem.",
            "Free Bits, PCPs, and Nonapproximability-Towards Tight Results.",
            "Fast Gossiping by Short Messages.",
            "Approximation Algorithms for the Feedback Vertex Set Problem with Applications to Constraint Satisfaction and Bayesian Inference.",
            "Planar Integer Linear Programming is NC Equivalent to Euclidean GCD.",
            "All Highest Scoring Paths in Weighted Grid Graphs and Their Application to Finding All Approximate Repeats in Strings.",
            "Bounding the Power of Preemption in Randomized Scheduling.",
            "Surface Approximation and Geometric Partitions.",
            "Randomized Data Structures for the Dynamic Closest-Pair Problem.",
            "Separating Exponentially Ambiguous Finite Automata from Polynomially Ambiguous Finite Automata.",
            "An Omega(sqrt{log log n}) Lower Bound for Routing in Optical Networks.",
            "Computing Matrix Eigenvalues and Polynomial Zeros Where the Output is Real.",
            "Computational Complexity and Knowledge Complexity.",
            "The Complexity of Planar Counting Problems.",
            "Guaranteeing Fair Service to Persistent Dependent Tasks.",
            "Time-Space Lower Bounds for Directed st-Connectivity on Graph Automata Models.",
            "A Chernoff Bound for Random Walks on Expander Graphs.",
            "Processor-Ring Communication: A Tight Asymptotic Bound on Packet Waiting Times.",
            "Approximation Algorithms for PSPACE-Hard Hierarchically and Periodically Specified Problems.",
            "Approximately Counting Hamilton Paths and Cycles in Dense Graphs.",
            "A Sublinear Space, Polynomial Time Algorithm for Directed s-t Connectivity.",
            "Monotone Circuits for Connectivity Have Depth (log n)2-o(1).",
            "Complexity Analysis of a Parallel Lattice Basis Reduction Algorithm.",
            "On the Fault Tolerance of Some Popular Bounded-Degree Networks.",
            "On the Complexity of Negation-Limited Boolean Networks.",
            "Simple Fast Parallel Hashing by Oblivious Execution.",
            "A Filter Model for Concurrent lambda-Calculus.",
            "Downward Separation Fails Catastrophically for Limited Nondeterminism Classes.",
            "The PL Hierarchy Collapses.",
            "Generating Low-Degree 2-Spanners.",
            "Performing Work Efficiently in the Presence of Faults.",
            "Time-Space Tradeoffs For Undirected st-Connectivity on a Graph Automata.",
            "On Learning Read-k-Satisfy-j DNF.",
            "Log-Space Polynomial End-to-End Communication.",
            "Lower Bounds for Randomized Mutual Exclusion.",
            "Adaptive Heuristics for Binary Search Trees and Constant Linkage Cost.",
            "Tree Contractions and Evolutionary Trees.",
            "Optimal Prediction for Prefetching in the Worst Case.",
            "A Correctness Condition for High-Performance Multiprocessors.",
            "Efficient Algorithms for the Domination Problems on Interval and Circular-Arc Graphs.",
            "Computing the Local Consensus of Trees.",
            "Parallel Algorithms with Optimal Speedup for Bounded Treewidth.",
            "First-Order Queries on Finite Structures Over the Reals.",
            "Spirality and Optimal Orthogonal Drawings."
        ]
    },
    {
        "name": "SICOMP",
        "year": "1997",
        "info": "Volume 26, 1997",
        "count": 84,
        "papers": [
            "The Average-Case Complexity of Determining the Majority.",
            "Amplification by Read-Once Formulas.",
            "Minimal Ascending and Descending Tree Automata.",
            "Threshold Computation and Cryptographic Security.",
            "Disjoint Rooted Spanning Trees with Small Depths in deBruijn and Kautz Graphs.",
            "Polynomial-Time Recognition of 2-Monotonic Positive Boolean Functions Given by an Oracle.",
            "Navigating in Unfamiliar Geometric Terrain.",
            "Finite Moniods: From Word to Circuit Evaluation.",
            "Parallelism Always Helps.",
            "Stochastic Scheduling with Variable Profile and Precedence Constraints.",
            "On Bounded Queries and Approximation.",
            "Sparse Dynamic Programming for Evolutionary-Tree Comparison.",
            "Total Protection of Analytic-Invariant Information in Cross-Tabulated Tables.",
            "On the Power of Real Turing Machines Over Binary Inputs.",
            "An NC Algorithm for Minimum Cuts.",
            "Resource Bounds for Self-Stabilizing Message-Driven Protocols.",
            "Fail-Stop Signatures.",
            "The Vertex-Disjoint Menger Problem in Planar Graphs.",
            "Randomized Distributed Edge Coloring via an Extension of the Chernoff-Hoeffding Bounds.",
            "Random Debaters and the Hardness of Approximating Stochastic Functions.",
            "A Strip-Packing Algorithm with Absolute Performance Bound 2.",
            "Approximating Shortest Superstrings.",
            "Bounded Concurrent Time-Stamping.",
            "Probe Order Backtracking.",
            "Ambivalent Data Structures for Dynamic 2-Edge-Connectivity and k Smallest Spanning Trees.",
            "Time-Adaptive Algorithms for Synchronization.",
            "A First-Order Isomorphism Theorem.",
            "General Techniques for Analyzing Recursive Algorithms with Applications.",
            "Potentials in Undirected Graphs and Planar Multiflows.",
            "Boolean Circuits, Tensor Ranks, and Communication Complexity.",
            "Unambiguous Computation: Boolean Hierarchies and Sparse Turing-Complete Sets.",
            "Ray Shooting Amidst Spheres in Three Dimensions and Related Problems.",
            "On the Complexity of Finding a Minimum Cycle Cover of a Graph.",
            "An Optimal Algorithm for Scanning All Spanning Trees of Undirected Graphs.",
            "Size-Depth Tradeoffs for Threshold Circuits.",
            "Bounds for the Computational Power and Learning Complexity of Analog Neural Nets.",
            "On the Amount of Nondeterminism and the Power of Verifying.",
            "Bounds on the Number of Examples Needed for Learning Functions.",
            "A Pumping Condition for Regular Sets.",
            "Leader Election in Complete Networks.",
            "The Cost of Derandomization: Computability or Competitiveness.",
            "Tighter Upper Bounds on the Exact Complexity of String Matching.",
            "The k-Steiner Ratio in Graphs.",
            "A Note on \"An On-Line Scheduling Heuristic with Better Worst Case Ratio than Graham's List Scheduling\".",
            "An Optimal Probabilistic Protocol for Synchronous Byzantine Agreement.",
            "Error-Resilient Optimal Data Compression.",
            "Constant-Time Randomized Parallel String Matching.",
            "Learning from Multiple Sources of Inaccurate Data.",
            "Singular and Plural Nondeterministic Parameters.",
            "Data Structures' Maxima.",
            "Oracles that Compute Values.",
            "Fast Discrete Polynomial Transforms with Applications to Data Analysis for Distance Transitive Graphs.",
            "Doubly Logarithmic Communication Algorithms for Optical-Communication Parallel Computers.",
            "The Robot Localization Problem.",
            "A Fast Algorithm for Optimally Increasing the Edge Connectivity.",
            "Graph Decomposition is NP-Complete: A Complete Proof of Holyer's Conjecture.",
            "The Fourth Moment Method.",
            "Testing Shared Memories.",
            "Polynomial Methods for Separable Convex Optimization in Unimodular Linear Spaces with Applications.",
            "Algorithms for the Certified Write-All Problem.",
            "Computational Modeling for Genetic Splicing Systems.",
            "Fast Management of Permutation Groups I.",
            "Parameterized Duplication in Strings: Algorithms and an Application to Software Maintenance.",
            "The Maximum Latency and Identification of Positive Boolean Functions.",
            "An Expander-Based Approach to Geometric Optimization.",
            "Introduction to Special Section on Quantum Computation.",
            "Quantum Complexity Theory.",
            "On the Power of Quantum Computation.",
            "Polynomial-Time Algorithms for Prime Factorization and Discrete Logarithms on a Quantum Computer.",
            "Strengths and Weaknesses of Quantum Computing.",
            "Quantum Computability.",
            "Stabilization of Quantum Computations by Symmetrization.",
            "The Random Adversary: A Lower-Bound Technique for Randomized Parallel Algorithms.",
            "Reconfiguring Arrays with Faults Part I: Worst-Case Faults.",
            "Matrix Searching with the Shortest-Path Metric.",
            "Randomized Õ(M(|V|)) Algorithms for Problems in Matching Theory.",
            "Maximum Agreement Subtree in a Set of Evolutionary Trees: Metrics and Efficient Algorithms.",
            "The Union of Convex Polyhedra in Three Dimensions.",
            "Star Unfolding of a Polytope with Applications.",
            "Computing Envelopes in Four Dimensions with Applications.",
            "A Spectral Technique for Coloring Random 3-Colorable Graphs.",
            "A Fast Algorithm for the Computation and Enumeration of Perfect Phylogenies.",
            "Fault-Tolerant Meshes with Small Degree.",
            "On Translational Motion Planning of a Convex Polyhedron in 3-Space."
        ]
    },
    {
        "name": "SICOMP",
        "year": "1996",
        "info": "Volume 25, 1996",
        "count": 62,
        "papers": [
            "Asymptotic Conditional Probabilities: The Unary Case.",
            "A Fast Derandomization Scheme and Its Applications.",
            "Weighted Multidimensional Search and Its Application to Convex Optimization.",
            "Ray Shooting amidst Convex Polyhedra and Polyhedral Terrains in Three Dimensions.",
            "A New Characterization of Type-2 Feasibility.",
            "Linear Time and Memory-Efficient Computation.",
            "On the Composition of Zero-Knowledge Proof Systems.",
            "The Isomorphism Conjecture Holds Relative to an Oracle.",
            "A Unified Approach to Dynamic Point Location, Ray Shooting, and Shortest Paths in Planar Maps.",
            "Approximate Max-Flow Min-(Multi)Cut Theorems and Their Applications.",
            "Robust Characterizations of Polynomials with Applications to Program Testing.",
            "Genome Rearrangements and Sorting by Reversals.",
            "Note on \"A Linear-Time Algorithm for Computing K-Terminal Reliability in a Series-Parallel Network\".",
            "Upward Planning of Single-Source Acyclic Digraphs.",
            "An Efficient Parallel Algorithm for the General Planar Monotone Circuit Value Problem.",
            "The Boolean Hierarchy and the Polynomial Hierarchy: A Closer Connection.",
            "Low-Degree Spanning Trees of Small Weight.",
            "Optimal Clock Synchronization under Different Delay Assumptions.",
            "Linear-Time Representation Algorithms for Proper Circular-Arc Graphs and Proper Interval Graphs.",
            "An O(N+M)-Time Algorithm for Finding a Minimum-Weight Dominating Set in a Permutation Graph.",
            "Generalized Kraft's Inequality and Discrete k-Modal Search.",
            "An Algebraic Model for Combinatorial Problems.",
            "Strongly Competitive Algorithms for Paging with Locality of Reference.",
            "On the Value of Coordination in Distributed Decision Making.",
            "Complexity of Sub-Bus Mesh Computations.",
            "Pathwidth, Bandwidth, and Completion Problems to Proper Interval Graphs with Small Cliques.",
            "Efficiently Planning Compliant Motion in the Plane.",
            "On-Line Algorithms for Path Selection in a Nonblocking Network.",
            "The Linkage of a Graph.",
            "An Algorithm for Locating Nonoverlapping Regions of Maximum Alignment Score.",
            "Full Abstraction and the Context Lemma.",
            "Computing Solutions Uniquely Collapses the Polynomial Hierarchy.",
            "A Method of Constructing Selection Networks with O(log n) Depth.",
            "Analysis of Backoff Protocols for Multiple Access Channels.",
            "New Techniques for Exact and Approximate Dynamic Closest-Point Problems.",
            "Efficient Parallel Algorithms for Chordal Graphs.",
            "The Sublogarithmic Alternating Space World.",
            "Tree-Adjoining Language Parsing in o(n^6) Time.",
            "An Efficient Parallel Algorithm for the Martix-Chain-Product Problem.",
            "Convergence in Distribution for Best-Fit Decreasing.",
            "Alphabet-Independent Two-Dimensional Witness Computation.",
            "The Tree Model for Hashing: Lower and Upper Bounds.",
            "On-Line Planarity Testing.",
            "Parallel Suffix-Prefix-Matching Algorithm and Applications.",
            "Randomized Consensus in Expected O(n log² n) Operations Per Processor.",
            "Optimal Group Gossiping in Hypercubes under a Circuit-Switching Model.",
            "On Point Location and Motion Planning among Simplices.",
            "Bounds on the Efficiency of Message-Passing Protocols for Parallel Computers.",
            "On-Line Scheduling of Imprecise Computations to Minimize Error.",
            "Kolmogorov Complexity and Instance Complexity of Recursively Enumerable Sets.",
            "An o(n³)-Time Algorithm Maximum-Flow Algorithm.",
            "A Deterministic Poly(log log N)-Time N-Processor Algorithm for Linear Programming in Fixed Dimensions.",
            "Feasible Time-Optimal Algorithms for Boolean Functions on Exclusive-Write Parallel Random-Access Machines.",
            "Lower Bounds for Geometrical and Physical Problems.",
            "Average and Randomized Complexity of Distributed Problems.",
            "Learning Behaviors of Automata from Multiplicity and Equivalence Queries.",
            "Prefix Codes: Equiprobable Words, Unequal Letter Costs.",
            "On Unapproximable Versions of NP-Complete Problems.",
            "A Linear-Time Algorithm for Finding Tree-Decompositions of Small Treewidth.",
            "An Optimal O(log log N)-Time Parallel Algorithm for Detecting All Squares in a String.",
            "The Wakeup Problem.",
            "Erratum: Fast Parallel Computation of the Polynomial Remainder Sequence via Bezout and Hankel Matrices."
        ]
    },
    {
        "name": "SICOMP",
        "year": "1995",
        "info": "Volume 24, 1995",
        "count": 78,
        "papers": [
            "Matrix Transformation Is Complete for the Average Case.",
            "Tighter Lower Bounds on the Exact Complexity of String Matching.",
            "Planar Strong Connectivity Helps in Parallel Depth-First Search.",
            "Fast Parallel Computation of the Polynomial Remainder Sequence Via Bezout and Hankel Matrices.",
            "A Graph-Theoretic Game and Its Application to the k-Server Problem.",
            "Finding k Cuts within Twice the Optimal.",
            "The Serial Transitive Closure Problem for Trees.",
            "New Decidability Results Concerning Two-Way Counter Machines.",
            "On the Optimality of Randomized alpha-beta Search.",
            "Greedy Packet Scheduling.",
            "Optimal File Sharing in Distributed Networks.",
            "An Optimal Algorithm for Computing Visibility in the Plane.",
            "A Randomized Maximum-Flow Algorithm.",
            "Sparse Approximate Solutions to Linear Systems.",
            "A Heuristic Scheduling of Independent Tasks with Bottleneck Resource Constraints.",
            "On Computing Algebraic Functions Using Logarithms and Exponentials.",
            "Algorithms for Enumerating All Spanning Trees of Undirected and Weighted Graphs.",
            "Permuting in Place.",
            "The Complexity and Distribution of Hard Problems.",
            "A General Approximation Technique for Constrained Forest Problems.",
            "D^over: An Optimal On-Line Scheduling Algorithm for Overloaded Uniprocessor Real-Time Systems.",
            "Ordered and Unordered Tree Inclusion.",
            "Randomized Interpolation and Approximation of Sparse Polynomials.",
            "An NC Algorithm for Evaluating Monotone Planar Circuits.",
            "Private Computations over the Integers.",
            "Sparse Polynomial Interpolation in Nonstandard Bases.",
            "A New Approach to Formal Language Theory by Kolmogorov Complexity.",
            "O(M*N) Algorithms for the Recognition and Isomorphism Problems on Circular-Arc Graphs.",
            "When Trees Collide: An Approximation Algorithm for the Generalized Steiner Problem on Networks.",
            "Rectilinear Path Problems among Rectilinear Obstacles Revisited.",
            "Evaluation of Polynomials Using the Structure of the Coefficients.",
            "When is the Assignment Bound Tight for the Asymmetric Traveling-Salesman Problem?",
            "Scaling Algorithms for the Shortest Paths Problem.",
            "Counterexamples for Directed and Node Capacitated Cut-Trees.",
            "Tree Reconstruction from Partial Orders.",
            "A Generalization of the Suffix Tree to Square Matrices, with Applications.",
            "Efficient Algorithms for the Hitchcock Transportation Problem.",
            "Approximate Max-Flow on Small Depth Networks.",
            "A Fast Approximation Algorithm for Computing the Frequencies of Subgraphs in a Given Graph.",
            "A Variational Method for Analysing Unit Clause Search.",
            "A General Approach to Removing Degeneracies.",
            "A Priori Bounds on the Euclidean Traveling Salesman.",
            "SPARSE Reduces Conjunctively to TALLY.",
            "Size-Depth Tradeoffs for Algebraic Formulas.",
            "Learning Arithmetic Read-Once Formulas.",
            "Amortized Communication Complexity.",
            "An Optimal Execution Time Estimate of Static Versus Dynamic Allocation in Multiprocessor Systems.",
            "Computing the Degree of Determinants Via Combinatorial Relaxation.",
            "Scheduling Tasks with AND/OR Precedence Constraints.",
            "Work-Preserving Speed-Up of Parallel Matrix Computations.",
            "Integer Linear Programs and Local Search for Max-Cut.",
            "Easily Checked Generalized Self-Reducibility.",
            "Approximating the Minimum Equivalent Digraph.",
            "Fixed-Parameter Tractability and Completeness I: Basic Results.",
            "Computational Complexity of Two-Dimensional Regions.",
            "Nearly Optimal Algorithms for Canonical Matrix Forms.",
            "Dynamic Graph Drawings: Trees, Series-Parallel Digraphs, and Planar ST-Digraphs.",
            "Flow in Planar Graphs with Multiple Sources and Sinks.",
            "A Subexponential Algorithm for Abstract Optimization Problems.",
            "Randomness-Optimal Unique Element Isolation with Applications to Perfect Matching and Related Problems.",
            "Minimum Cost Paths in Periodic Graphs.",
            "Polynomial-Time Membership Comparable Sets.",
            "With Quasilinear Queries EXP Is Not Polynomial Time Turing Reducible to Sparse Sets.",
            "New Tight Bounds on Uniquely Represented Dictionaries.",
            "Scheduling Jobs with Temporal Distance Constraints.",
            "On the Approximation of Shortest Common Supersequences and Longest Common Subsequences.",
            "On the Generation of Random Binary Search Trees.",
            "On the Variance of the Height of Random Binary Search Trees.",
            "Constructing Huffman Trees in Parallel.",
            "Weakly Hard Problems.",
            "Data-Structural Bootstrapping, Linear Path Compression, and Catenable Heap-Ordered Double-Ended Queues.",
            "Adaptive Pattern Matching.",
            "Finding Regular Simple Paths in Graph Databases.",
            "What Can be Computed Locally?",
            "Identifying the Minimal Transversals of a Hypergraph and Related Problems.",
            "On the Reuse of Additions in Matrix Multiplication.",
            "Scheduling Parallel Machines On-Line.",
            "Computing Minimal Spanning Subgraphs in Linear Time."
        ]
    },
    {
        "name": "SICOMP",
        "year": "1994",
        "info": "Volume 23, 1994",
        "count": 79,
        "papers": [
            "Computational Complexity of Sparse Rational Interpolation.",
            "Tight Upper and Lower Bounds on the Path Length of Binary Trees.",
            "Unique Binary-Search-Tree Representations and Equality Testing of Sets and Sequences.",
            "A Complexity Index for Satisfiability Problems.",
            "The Set Union Problem With Unlimited Backtracking.",
            "The Profile Minimization Problem in Trees.",
            "Modifications of Competitive Group Testing.",
            "The Complexity of Decision Versus Search.",
            "Homeomorphism of 2-Complexes is Graph Isomorphism Complete.",
            "On Collision-Free Placements of Simplices and the Closest Pair of Lines in 3-Space.",
            "Fat Triangles Determine Linearly Many Holes.",
            "Three-Dimensional Statistical Data Security Problems.",
            "An NC Algorithm for Scheduling Unit-Time Jobs With Arbitrary Release Times and Deadlines.",
            "Broadcasting and Gossiping in de Bruijn Networks.",
            "A Linear-Time Algorithm for the Homotopic Routing Problem in Grid Graphs.",
            "Some Results on Elusive Graph Properties.",
            "Closeness of NP-Hard Sets to Other Complexity Classes.",
            "Complexity-Restricted Advice Functions.",
            "Deterministic Simulations of PRAMs on Bounded Degree Networks.",
            "Lower Bounds for Randomized k-Server and Motion-Planning Algorithms.",
            "An Alphabet Independent Approach to Two-Dimensional Pattern Matching.",
            "Trading Space for Time in Undirected s-t Connectivity.",
            "Bounds on the Costs of Multivalued Register Implementations.",
            "Parallel Information Dissemination by Packets.",
            "Generating Linear Extensions Fast.",
            "Randomized Parallel Algorithms for Matroid Union and Intersection, With Applications to Arboresences and Edge-Disjoint Spanning Trees.",
            "On the Consecutive-Retrieval Problem.",
            "Polynomial Root-Finding Algorithms and Branched Covers.",
            "Computing and Verifying Depth Orders.",
            "Erratum: Optimal Parallel Randomized Algorithms for Three-Dimensional Convex Hulls and Related Problems.",
            "Top-Bottom Routing Around a Rectangle is as Easy as Computing Prefix Minima.",
            "Faster Approximation Algorithms for the Unit Capacity Concurrent Flow Problem with Applications to Routing and Finding Sparse Cuts.",
            "The Extended Low Hierarchy is an Infinite Hierarchy.",
            "Complexity of Network Reliability and Optimal Resource Placement Problems.",
            "Polynomial Algorithms for Hamiltonian Cycle in Cocomparability Graphs.",
            "Packet Transmission in a Noisy-Channel Ring Network.",
            "Subquadratic Simulations of Balanced Formulae by Branching Programs.",
            "Linear Time Algorithms and NP-Complete Problems.",
            "Digital Search Trees Again Revisited: The Internal Path Length Perspective.",
            "Improved Approximation Algorithms for Shop Scheduling Problems.",
            "Randomized Algorithms for Binary Search and Load Balancing on Fixed Connection Networks with Geometric Applications.",
            "Communication-Space Tradeoffs for Unrestricted Protocols.",
            "A New Insight into the Coffman-Graham Algorithm.",
            "A New Approach to Stable Matching Problems.",
            "Wait-Free Consensus Using Asynchronous Hardware.",
            "Inferring Evolutionary History from DNA Sequences.",
            "Dynamic Perfect Hashing: Upper and Lower Bounds.",
            "Measure, Stochasticity, and the Density of Hard Languages.",
            "Finding k Disjoint Paths in a Directed Planar Graph.",
            "Finite Automata Computing Real Functions.",
            "On the Complexity of Bilinear Forms over Associative Algebras.",
            "A New Lower Bound Technique and its Application: Tight Lower Bound for a Polygon Triangulation Problem.",
            "On \"Axiomatising Finite Concurrent Processes\".",
            "The Complexity of Multiterminal Cuts.",
            "Diagnosis of t/(t+1)-Diagnosable Systems.",
            "Improved Algorithms for Bipartite Network Flow.",
            "New Resultant Inequalities and Complex Polynomial Factorization.",
            "Randomized Algorithms for Multiprocessor Page Migration.",
            "Near-Optimal Time-Space Tradeoff for Element Distinctness.",
            "Existence and Construction of Edge-Disjoint Paths on Expander Graphs.",
            "Separating Distribution-Free and Mistake-Bound Learning Models over the Boolean Domain.",
            "Computing with Noisy Information.",
            "On Competitive Group Testing.",
            "A Uniform Circuit Lower Bound for the Permanent.",
            "The Joint Distribution of Elastic Buckets in Multiway Search Trees.",
            "Tight Bounds on the Complexity of the Boyer-Moore String Matching Algorithm.",
            "A Grammar-Based Approach Towards Unifying Hierarchical Data Models.",
            "Selecting Heavily Covered Points.",
            "Distributed Algorithms for Unidirectional Networks.",
            "Simple and Fast Algorithms for Linear and Integer Programs With Two Variables per Inequality.",
            "Computing the Order of a Locally Testable Automaton.",
            "A Polynomial-Time Algorithm for the Perfect Phylogeny Problem when the Number of Character States is Fixed.",
            "Priority Queues and Permutations.",
            "A Model for Asynchronous Shared Memory Parallel Computation.",
            "Tight Pounds on Oblivious Chaining.",
            "Requirements for Deadlock-Free, Adaptive Packet Routing.",
            "On Languages Reducible to Algorithmically Random Languages.",
            "A Fast Algorithm for Optimum Height-Limited Alphabetic Binary Trees.",
            "Improved Algorithms for Linear Inequalities With Two Variables per Inequality."
        ]
    },
    {
        "name": "SICOMP",
        "year": "1993",
        "info": "Volume 22, 1993",
        "count": 81,
        "papers": [
            "Implicit O(1) Probe Search.",
            "Maintaining the 3-Edge-Connected Components of a Graph On-Line.",
            "On the Boundedness of Constant-Time-Maintainable Database Schemes.",
            "Tight Worst-Case Performance Bounds for Next-k-Fit Bin Packing.",
            "A Note on the Complexity of a Simple Transportation Problem.",
            "A Lower Bound on the Size of Shellsort Sorting Networks.",
            "A Note on Poset Geometries.",
            "An O(n) Algorithm for Determining the Subregion-Tree Representation of a Rectangular Dissection.",
            "Tally Versions of the Savitch and Immerman-Szelepcsenyi Theorems for Sublogarithmic Space.",
            "NV-Sequentiality: A Decidable Condition for Call-by-Need Computations in Term-Rewriting Systems.",
            "ASPACE(o(log log n)) is Regular.",
            "The Complexity of Malign Measures.",
            "Scan-First Search and Sparse Certificates: An Improved Parallel Algorithms for k-Vertex Connectivity.",
            "Decomposing Finite-Valued Transducers and Deciding Their Equivalence.",
            "One More Occurrence of Variables Makes Satisfiability Jump From Trivial to NP-Complete.",
            "Rounds in Communication Complexity Revisited.",
            "Recursive Star-Tree Parallel Data Structure.",
            "Approximate Boyer-Moore String Matching.",
            "Two Probabilistic Results on Merging.",
            "Optimal Randomized Algorithms for Local Sorting and Set-Maxima.",
            "A Monte-Carlo Algorithm for Estimating the Permanent.",
            "Limiting Negations in Constant Depth Circuits.",
            "Average Time Analysis of Clause Order Backtracking.",
            "Factoring Rational Polynomials Over the Complex Numbers.",
            "Optimal Stochastic Allocation of Machines Under Waiting-Time Constraints.",
            "An On-Line Scheduling Heuristic With Better Worst Case Ratio Than Graham's List Scheduling.",
            "Theoretical Aspects of VLSI Pin Limitations.",
            "Gap Theorems for Distributed Computation.",
            "On Languages With Very High Space-Bounded Kolmogorov Complexity.",
            "Coin-Flipping Games Immune Against Linear-Sized Coalitions.",
            "On the Zone Theorem for Hyperplane Arrangements.",
            "Linear-Processor NC Algorithms for Planar Directed Graphs I: Strongly Connected Components.",
            "Linear-Processor NC Algorithms for Planar Directed Graphs II: Directed Spanning Trees.",
            "Blocking Small Cuts in a Network, and Related Problems.",
            "Floor-Planning by Graph Dualization: 2-Concave Rectilinear Modules.",
            "A Quadratic Time Algorithm for the Minimax Length Triangulation.",
            "Inverting Polynomials and Formal Power Series.",
            "Nondeterminism Within P.",
            "Parallel Complexity of the Connected Subgraph Problem.",
            "Finding Triconnected Components by Local Replacement.",
            "Improved Parallel Polynomial Division.",
            "The Complexity of Processing Hierarchical Specifications.",
            "A Stochastic Checkpoint Optimization Problem.",
            "Regular Resolution Versus Unrestricted Resolution.",
            "Local Randomness in Polynomial Random Number and Random Function Generators.",
            "Applying Coding Theory to Sparse Interpolation.",
            "Exact Identification of Read-Once Formulas Using Fixed Points of Amplification Functions.",
            "Asynchronous Fault-Tolerant Total Ordering Algorithms.",
            "A Fibonacci Version of Kraft's Inequality Applied to Discrete Unimodal Search.",
            "Counting Circular Arc Intersections.",
            "Ray Shooting and Parametric Search.",
            "Learning in the Presence of Malicious Errors.",
            "Small-Bias Probability Spaces: Efficient Constructions and Applications.",
            "Deciding Properties of Nonregular Programs.",
            "Multiple Communication in Multihop Radio Networks.",
            "Finding a Smallest Augmentation to Biconnect a Graph.",
            "Different Modes of Communication.",
            "Suffix Arrays: A New Method for On-Line String Searches.",
            "Randomizing Reductions of Search Problems.",
            "An Optimal Algorithm for the Maximum Three-Chain Problem.",
            "Random-Self-Reducibility of Complete Sets.",
            "Learning Binary Relations and Total Orders.",
            "Drawing Graphs in the Plane with High Resolution.",
            "Probabilistic Analysis of Disjoint Set Union Algorithms.",
            "A Pseudorandom Oracle Characterization of BPP.",
            "Polynomial-Time Approximation Algorithms for the Ising Model.",
            "Minimal NFA Problems are Hard.",
            "An O(m log n)-Time Algorithm for the Maximal Planar Subgraph Problem.",
            "On the Existence of Pseudorandom Generators.",
            "A Generalized Suffix Tree and its (Un)expected Asymptotic Behaviors.",
            "Finding the Hidden Path: Time Bounds for All-Pairs Shortest Paths.",
            "On Finding the Rectangular Duals of Planar Triangular Graphs.",
            "Fast and Efficient Parallel Solution of Sparse Linear Systems.",
            "On-Line Bin Packing of Items of Random Sizes, II.",
            "On the Computational Complexity of Small Descriptions.",
            "VC Dimension and Uniform Learnability of Sparse Polynomials and Rational Functions.",
            "Computing a Face in an Arrangement of Line Segments and Related Problems.",
            "A Better Heuristic for Preemptive Parallel Machine Scheduling with Batch Setup Times.",
            "A New Method for Computing Page-Fault Rates.",
            "Learning Decision Trees Using the Fourier Spectrum.",
            "Correction: Parallel Merge Sort."
        ]
    },
    {
        "name": "SICOMP",
        "year": "1992",
        "info": "Volume 21, 1992",
        "count": 71,
        "papers": [
            "Efficient Motion Planning for an L-Shaped Object.",
            "On the Average Size of the Intersection of Binary Trees.",
            "Polynomial Threshold Functions, AC^0 Functions, and Spectral Norms.",
            "The Average Complexity of Parallel Comparison Merging.",
            "A Note on the Height of Suffix Trees.",
            "Computing Algebraic Formulas Using a Constant Number of Registers.",
            "Asymptotic Analysis of an Algorithm for Balanced Parallel Processor Scheduling.",
            "Conditions for Unique Graph Realizations.",
            "Simplification of Nested Radicals.",
            "Gossiping in Minimal Time.",
            "Using Interior-Point Methods for Fast Parallel Algorithms for Bipartite Matching and Related Problems.",
            "Efficient Embeddings of Trees in Hypercubes.",
            "On the Exact Location of Steiner Points in General Dimension.",
            "On Learning Ring-Sum-Expansions.",
            "Locality in Distributed Graph Algorithms.",
            "Partitioning Planar Graphs.",
            "A Polynomial-Time Algorithm for the Equivalence of Probabilistic Automata.",
            "Subgroup Refinement Algorithms for Root Finding in GF(q).",
            "Learning Integer Lattices.",
            "Efficient Point Location in a Convex Spatial Cell-Complex.",
            "A Heuristic of Scheduling Parallel Tasks and its Analysis.",
            "Heuristic Sampling: A Method for Predicting the Performance of Tree Searching Programs.",
            "Counting Classes are at Least as Hard as the Polynomial-Time Hierarchy.",
            "Lower Bounds for Threshold and Symmetric Functions in Parallel Computation.",
            "Convex Decomposition of Polyhedra and Robustness.",
            "Fast Gossiping for the Hypercube.",
            "Recognizing P_4 Sparse Graphs in Linear Time.",
            "On the Exact Complexity of String Matching: Upper Bounds.",
            "Probably Approximate Learning Over Classes of Distributions.",
            "The Complexity of the Lin-Kernighan Heuristic for the Traveling Salesman Problem.",
            "Optimal Parallel Randomized Algorithms for Three-Dimensional Convex Hulls and Related Problems.",
            "Processor Efficient Parallel Algorithms for the Two Disjoint Paths Problem and for Finding a Kuratowski Homeomorph.",
            "Algorithms for Splicing Systems.",
            "Relating Equivalence and Reducibility to Sparse Sets.",
            "Ray Shooting and Other Applications of Spanning Trees with Low Stabbing Number.",
            "The Nilpotency Problem of One-Dimensional Cellular Automata.",
            "Learning Monotone Boolean Functions by Uniformly Distributed Examples.",
            "Shortest Paths Help Solve Geometric Optimization Problems in Planar Regions.",
            "Dynamic Tree Embeddings in Butterflies and Hypercubes.",
            "Circuit Definitions of Nondeterministic Complexity Classes.",
            "An Optimal Algorithm for Intersecting Three-Dimensional Convex Polyhedra.",
            "The Power of the Queue.",
            "Maximum Size of a Dynamic Data Structure: Hashing with Lazy Deletion Revisited.",
            "Complete Problems and Strong Polynomial Reducibilities.",
            "On the Structure of Bounded Queries to Arbitrary NP Sets.",
            "An Optimal Parallel Algorithm for Formula Evaluation.",
            "On the Complexity of Polynomial Zeros.",
            "Increasing the Size of a Network by a Constant Factor can Increase Performance by more than a Constant Factor.",
            "Representability of Design Objects by Ancestor-Controlled Hierarchical Specifications.",
            "A Lower Bound for Parallel String Matching.",
            "Searching for a Mobile Intruder in a Polygonal Region.",
            "Determinism vs. Nondeterminism in Multiparty Communication Complexity.",
            "On Threshold Circuits and Polynomial Computation.",
            "Generalizing the Continued Fraction Algorithm to Arbitrary Dimensions.",
            "Laying out Graphs Using Queues.",
            "Optimal On-Line Simulations of Tree Machines by Random Access Machines.",
            "New Results on Dynamic Planar Point Location.",
            "Addendum: Minimum Weighted Coloring of Triangulated Graphs, with Application to Maximum Weight Vertex Packing and Clique Finding in Arbitrary Graphs.",
            "Reducing the Steiner Problem in a Normed Space.",
            "On the Computational Complexity of Approximating Solutions for Real Algebraic Formulae.",
            "An O(n² log n) Algorithm for the Hamiltonian Cycle Problem on Circular-Arc Graphs.",
            "Fully Dynamic Algorithms for 2-Edge Connectivity.",
            "Work-Optimal Asynchronous Algorithms for Shared Memory Parallel Computers.",
            "Polynomial Time Productivity, Approximations, and Levelability.",
            "Optimal Reductions of Two-Terminal Directed Acyclic Graphs.",
            "Preemptive Ensemble Motion Planning on a Tree.",
            "Lower Bounds on Universal Traversal Sequences for Cycles and Other Low Degree Graphs.",
            "Approximation and Small-Depth Frege Proofs.",
            "External Internal Nodes in Digital Search Trees via Mellin Transforms.",
            "Verification and Sensitivity Analysis of Minimum Spanning Trees in Linear Time.",
            "Optimal Algorithms for Multiplication in Certain Finite Fields Using Elliptic Curves."
        ]
    },
    {
        "name": "SICOMP",
        "year": "1991",
        "info": "Volume 20, 1991",
        "count": 72,
        "papers": [
            "Absolute Factorization of Polynomials: A Geometric Approach.",
            "Deterministic Sampling - A New Technique for Fast Pattern Matching.",
            "Amplification of Bounded Depth Monotone Read-Once Boolean Formulae.",
            "Simple Local Search Problems That are Hard to Solve.",
            "Improved Upper and Lower Time Bounds for Parallel Random Access Machines Without Simultaneous Writes.",
            "High-Probability Parallel Transitive-Closure Algorithms.",
            "Complexity of Sentences Over Number Rings.",
            "An Optimal On-Line Algorithm for k-Servers on Trees.",
            "The Complexity of the Residual Node Connectedness Reliability Problem.",
            "More Nearly Optimal Algorithms for Unbounded Searching, Part I: The Finite Case.",
            "More Nearly Optimal Algorithms for Unbounded Searching, Part II: The Transfinite Case.",
            "Minimum Weighted Coloring of Triangulated Graphs, with Application to Maximum Weight Vertex Packing and Clique Finding in Arbitrary Graphs.",
            "Approximate Levels in Line Arrangements.",
            "Parallel Algorithms for Channel Routing in the Knock-Knee Model.",
            "Some Observations on Separating Complexity Classes.",
            "An O(n log² h) Time Algorithm for the Three-Dimensional Convex Hull Problem.",
            "A General Sequential Time-Space Tradeoff for Finding Unique Elements.",
            "The Power of Alternating One-Reversal Counters and Stacks.",
            "Interpolation and Approximation of Sparse Multivariate Polynomials over GF(2).",
            "Lower Bounds for Computations with the Floor Operation.",
            "Probably Approximate Learning of Sets and Functions.",
            "Efficient Parallel Algorithms for Testing k-Connectivity and Finding Disjoint s-t Paths in Graphs.",
            "Time and Message Bounds for Election in Synchronous and Asynchronous Complete Networks.",
            "Good and Bad Radii of Convex Polygons.",
            "Erratum: The Polynomial Time Hierarchy Collapses if the Boolean Hierarchy Collapses.",
            "Fast Matching Algorithms for Points on a Polygon.",
            "The Communication Complexity of Atomic Commitment and of Gossiping.",
            "Some Lower and Upper Complexity Bounds for Generalized Fourier Transforms and their Inverses.",
            "On Vertical Visibility in Arrangements of Segments and the Queue Size in the Bentley-Ottmann Line Sweeping Algorithm.",
            "On Polynomial-Time Bounded Truth-Table Reducibility of NP Sets to Sparse Sets.",
            "Nondeterministic Computations in Sublogarithmic Space and Space Constructibility.",
            "A 4n Lower Bound on the Combinational Complexity of Certain Symmetric Boolean Functions over the Basis of Unate Dyadic Boolean Functions.",
            "Near-Testable Sets.",
            "Compression and Ranking.",
            "Algorithms for Scheduling Imprecise Computations with Timing Constraints.",
            "Boolean Functions, Invariance Groups, and Parallel Complexity.",
            "Tests for Permutation Polynomials.",
            "Constructive Whitney-Graustein Theorem: Or How to Untangle Closed Planar Curves.",
            "Reversal Complexity.",
            "Computing the Strength of a Graph.",
            "Lower Bounds for Algebraic Computation Trees with Integer Inputs.",
            "Minimization of Rational Word Functions.",
            "The Fast m-Transform: A Fast Computation of Cross-Correlations with Binary m-Sequences.",
            "On Counting Lattice Points in Polyhedra.",
            "Parallel Transitive Closure and Point Location in Planar Structures.",
            "On Nonblocking Multirate Interconnection Networks.",
            "Intersecting Line Segments in Parallel with an Output-Sensitive Number of Processors.",
            "Fast Parallel Arithmetic via Modular Representation.",
            "Equality-Test and If-Then-Else Algebras: Axiomatization and Specification.",
            "The Maximum Size of Dynamic Data Structures.",
            "Time Complexity of Boolean Functions on CREW PRAMs.",
            "Embedding of Grids into Optimal Hypercubes.",
            "PP is as Hard as the Polynomial-Time Hierarchy.",
            "Selection Networks.",
            "An Output-Sensitive Algorithm for Computing Visibility Graphs.",
            "Learning Simple Concept Under Simple Distributions.",
            "On the Communication Complexity of Solving a Polynomial Equation.",
            "The Spectra of Infinite Hypertrees.",
            "On the Complexity of Learning Minimum Time-Bounded Turing Machines.",
            "Minimum Diameter Spanning Trees and Related Problems.",
            "Erratum: Factoring Polynomials Over Algebraic Number Fields.",
            "CREW PRAMs and Decision Trees.",
            "On the Exact Complexity of String Matching: Lower Bounds.",
            "Self-P-Printability and Polynomial Time Turing Equivalence to a Tally Set.",
            "New Upper Bounds in Klee's Measure Problem.",
            "An Optimal Randomized Parallel Algorithm for Finding Connected Components in a Graph.",
            "Asymptotically Fast Triangularization of Matrices Over Rings.",
            "Noninteractive Zero-Knowledge.",
            "Elimination of Infrequent Variables Improves Average Case Performance of Satisfiability Algorithms.",
            "Parallel Tree Contraction, Part 2: Further Applications.",
            "On Sets with Efficient Implicit Membership Tests.",
            "An Almost Linear-Time Algorithm for the Dense Subset-Sum Problem."
        ]
    },
    {
        "name": "SICOMP",
        "year": "1990",
        "info": "Volume 19, 1990",
        "count": 77,
        "papers": [
            "An Optimal Linear-Time Parallel Parser for Tree Adjoining Languages.",
            "Complexity and Unsolvability Properties of Nilpotency.",
            "The Complexity of Very Simple Boolean Formulas with Applications.",
            "Lower Bounds for the Stable Marriage Problem and its Variants.",
            "A Rewriting System for Categorical Combinators with Multiple Arguments.",
            "The Inverses of Block Hankel and Block Toeplitz Matrices.",
            "A Density Theorem for Purely Iterative Zero Finding Methods.",
            "A Fast Parallel Horner Algorithm.",
            "Very Simple Methods for All Pairs Network Flow Analysis.",
            "On the Expected Capacity of Binomial and Random Concentrators.",
            "Space-Efficient Message Routing in c-Decomposable Networks.",
            "Feasible Real Functions and Arithmetic Circuits.",
            "Erratum: Generalized Selection and Ranking: Sorted Matrices.",
            "Reversal Complexity Classes for Alternating Turing Machines.",
            "The Complexity of File Transfer Scheduling with Forwarding.",
            "Characterization of Associative Operations with Prefix Circuits of Constant Depth and Linear Size.",
            "A Time-Randomness Trade-Off for Oblivious Routing.",
            "A Heuristic Algorithm for Small Separators in Arbitrary Graphs.",
            "On the Efficient Generation of Language Instances.",
            "Red-Blue Intersection Detection Algorithms, with Applications to Motion Planning and Collision Detection.",
            "Towards an Architecture-Independent Analysis of Parallel Algorithms.",
            "Addition Machines.",
            "Semantic Correctness for a Parallel Object-Oriented Language.",
            "On the Decomposability of NC and AC.",
            "Parallel Depth-First Search in General Directed Graphs.",
            "Expressibility and Nonuniform Complexity Classes.",
            "Deciding Equivalence of Finite Tree Automata.",
            "A Nontrivial Lower Bound for an NP Problem on Automata.",
            "Multiplication of Polynomials over Finite Fields.",
            "A Class of Projective Transformations for Linear Programming.",
            "Maximal Rank of m x n x (mn - k) Tensors.",
            "Flipping Persuasively in Constant Time.",
            "Reset Sequences for Monotonic Automata.",
            "Fast Simulations of Time-Bounded One-Tape Turing Machines by Space-Bounded Ones.",
            "Unbounded Searching Slgorithms.",
            "The Euclidean Algorithm and the Degree of the Gauss Map.",
            "Group Action Graphs and Parallel Architectures.",
            "Embedding Trees in a Hypercube is NP-Complete.",
            "Erratum: Weighted Leaf AVL-Trees.",
            "The Number of Shortest Paths on the Surface of a Polyhedron.",
            "Improving the Time Complexity of Message-Optimal Distributed Algorithms for Minimum-Weight Spanning Trees.",
            "On the Analysis of Synchronous Computing Systems.",
            "Partial Types and Intervals.",
            "Shortest Circuit Covers and Postman Tours in Graphs with a Nowhere Zero 4-Flow.",
            "Greedy Matching on the Line.",
            "A Note on Bennett's Time-Space Tradeoff for Reversible Computation.",
            "Planar Depth-First Search in O(log n) Parallel Time.",
            "A Note on Optimal Bin Packing and Optimal Bin Covering with Items of Random Size.",
            "Some Observations on Parallel Algorithms for Fast Exponentiation in GF(2^n).",
            "Toward Understanding Exclusive Read.",
            "Scheduling Sequential Loops on Parallel Processors.",
            "On Finding and Verifying Locally Optimal Solutions.",
            "The Structure of Polynomial Ideals and Gröbner Bases.",
            "The Spatial Complexity of Oblivious k-Probe Hash Functions.",
            "Domino Games and Complexity.",
            "The Hough Transform has O(N) Complexity on N x N Mesh Connected Computers.",
            "An Analysis of Random d-Dimensional Quad Trees.",
            "Bounded Query Classes.",
            "On Three-Dimensional Packing.",
            "Postorder Disjoint Set Union is Linear.",
            "A Semiring on Convex Polygons and Zero-Sum Cycle Problems.",
            "On the Complexity of a Game Related to the Dictionary Problem.",
            "Linear-Time Test for Small Face Covers in Any Fixed Surface.",
            "Optimal Size Integer Division Circuits.",
            "Sorting Points Along an Algebraic Curve.",
            "Efficient Parallel Algorithms for String Editing and Related Problems.",
            "An Improved Algorithm for Approximate String Matching.",
            "Linear Programming with Two Variables per Inequality in Poly-Log Time.",
            "A Time Complexity Gap for Two-Way Probabilistic Finite-State Automata.",
            "The Searchlight Scheduling Problem.",
            "Minimum Cuts for Circular-Arc Graphs.",
            "An Optimal O(log log n) Time Parallel String Matching Algorithm.",
            "Fast Parallel Algorithms for Sparse Multivariate Polynomial Interpolation over Finite Fields.",
            "Linear Circuits over GF(2).",
            "Random Polynomials and Approximate Zeros of Newton's Method.",
            "Category and Measure in Complexity Classes.",
            "Computing Puiseux-Series Solutions to Determinantal Equations via Combinatorial Relaxation."
        ]
    },
    {
        "name": "SICOMP",
        "year": "1989",
        "info": "Volume 18, 1989",
        "count": 84,
        "papers": [
            "Amortized Analysis of Algorithms for Set Union with Backtracking.",
            "The Bit Complexity of Randomized Leader Election on a Ring.",
            "A Fast Parametric Maximum Flow Algorithm and Applications.",
            "Lower Bounds for Accessing Binary Search Trees with Rotations.",
            "An Incremental Linear-Time Algorithm for Recognizing Interval Graphs.",
            "Minimum Delay Codes.",
            "The Boolean Hierarchy II: Applications.",
            "Algorithms and Data Structures for an Expanded Family of Matroid Intersection Problems.",
            "Optimal Bin Packing with Items of Random Sizes II.",
            "Minimal Threshold Separators and Memory Requirements for Synchronization.",
            "Algorithms for Packing Squares: A Probabilistic Analysis.",
            "The Knowledge Complexity of Interactive Proof Systems.",
            "A Lower Bound on the Complexity of Division in Finite Extension Fields and Inversion in Quadratic Alternative Algebras.",
            "Adaptive Bitonic Sorting: An Optimal Parallel Algorithm for Shared-Memory Machines.",
            "The Token Distribution Problem.",
            "Scheduling Precedence Graphs in Systems with Interprocessor Communication Times.",
            "Finding an Approximate Maximum.",
            "Bounds on Universal Sequences.",
            "Worst-Case Growth Rates of Some Classical Problems of Combinatorial Optimization.",
            "Optimal Parallel 5-Colouring of Planar Graphs.",
            "Nonblocking Multirate Networks.",
            "Minimizing Schedule Length Subject to Minimum Flow Time.",
            "Fast Parallel Algorithms for Chordal Graphs.",
            "On the Worst-Case Arithmetic Complexity of Approximating Zeros of Systems of Polynomials.",
            "Partitioning Space for Range Queries.",
            "CNF Satisfiability Test by Counting and Polynomial Average Time.",
            "Relativized Polynomial Time Hierarchies Having Exactly K Levels.",
            "Exponential Average Time for the Pure Literal Rule.",
            "A New Parallel Algorithm for the Maximal Independent Set Problem.",
            "A Design Theory for Solving the Anomalies Problem.",
            "On Tally Relativizations of BP-Complexity Classes.",
            "Dynamic Programming by Exchangeability.",
            "Optimal Bin Packing with Items of Random Sizes III.",
            "Optimal Bin Covering with Items of Random Size.",
            "Cascading Divide-and-Conquer: A Technique for Designing Parallel Algorithms.",
            "A New Pebble Game That Characterizes Parallel Complexity Classes.",
            "Succinct Certificates for Almost All Subset Sum Problems.",
            "Two Applications of Inductive Counting for Complementation Problems.",
            "Note on Weintraub's Minimum-Cost Circulation Algorithm.",
            "Fast Fourier Transforms for Metabelian Groups.",
            "Optimal and Sublogarithmic Time Randomized Parallel Sorting Algorithms.",
            "Precise Analyses of the Right- and Left-Shift Greatest Common Divisor Algorithms for GF(q)[x].",
            "Expressibility and Parallel Complexity.",
            "Matrix Padé Fractions and Their Computation.",
            "Worst-Case Complexity Bounds on Algorithms for Computing the Canonical Structure of Finite Abelian Groups and the Hermite and Smith Normal Forms of an Integer Matrix.",
            "Worst-Case Complexity Bounds on Algorithms for Computing the Canonical Structure of Infinite Abelian Groups and Solving Systems of Linear Diophantine Equations.",
            "On the Complexity of Partial Order Productions.",
            "A Fast Algorithm for Multiprocessor Scheduling of Unit-Length Jobs.",
            "Minimum-Knowledge Interactive Proofs for Decision Problems.",
            "An Optimal Synchronizer for the Hypercube.",
            "Space-Time Trade-Offs for Orthogonal Range Queries.",
            "A Lower Bound for Matrix Multiplication.",
            "Time/Space Trade-Offs for Reversible Computation.",
            "Ultimate Characterizations of the Burst Response of an Interval Searching Algorithm: A Study of a Functional Equation.",
            "An Optimal-Time Algorithm for Slope Selection.",
            "Fully Dynamic Point Location in a Monotone Subdivision.",
            "On the Limit Sets of Cellular Automata.",
            "Efficient Message Routing in Planar Networks.",
            "Polynomial Time Algorithms for Finding Integer Relations among Real Numbers.",
            "Ranking the Best Binary Trees.",
            "An Analysis of the Rational Exponential Integral.",
            "An Analysis of a Good Algorithm for the Subtree Problem, Corrected.",
            "The Complete Convergence of Best Fit Decreasing.",
            "The Complete Convergence of First Fit Decreasing.",
            "Improved Time Bounds for the Maximum Flow Problem.",
            "Very Fast Parallel Polynomial Arithmetic.",
            "Topological Completeness in an Ideal Model for Polymorphic Types.",
            "The Distributed Firing Squad Problem.",
            "Faster Scaling Algorithms for Network Problems.",
            "A New Base Change Algorithm for Permutation Groups.",
            "Ratio Estimators are Maximum-Likelihood Estimators for Non-Context-Free Grammars.",
            "Analysis of Preflow Push Algorithms for Maximum Network Flow.",
            "Polynomial Space Counting Problems.",
            "Scheduling Arithmetic and Load Operations in Parallel with No Spilling.",
            "Computing Simple Circuits from a Set of Line Segments is NP-Complete.",
            "The Two-Processor Scheduling Problem is in Random NC.",
            "Approximating the Permanent.",
            "A Correction Network for N-Sorters.",
            "Solution of a Divide-and-Conquer Maximin Recurrence.",
            "Geometry Helps in Matching.",
            "On Relaxed Squashed Embedding of Graphs into a Hypercube.",
            "Simple Fast Algorithms for the Editing Distance Between Trees and Related Problems.",
            "Relating the Type of Ambiguity of Finite Automata to the Succinctness of Their Representation.",
            "Erratum: Two Applications of Inductive Counting for Complementation Problems."
        ]
    },
    {
        "name": "SICOMP",
        "year": "1988",
        "info": "Volume 17, 1988",
        "count": 79,
        "papers": [
            "On Bounded Database Schemes and Bounded Horn-Clause Programs.",
            "Analysis of a Hybrid Algorithm for Packing Unequal Bins.",
            "An Optimal Algorithm for Finding a Maximum Independent Set of a Circular-Arc Graph.",
            "On the Complexity of Covering Vertices by Faces in a Planar Graph.",
            "Fast Simulation of Turing Machines by Random Access Machines.",
            "Designing a Uniform Random Number Generator Whose Subsequences are k-Distributed.",
            "Sorting and Recognition Problems for Ordered Sets.",
            "Expected Performance of m-Solution Backtracking.",
            "Approximate Parallel Scheduling. Part I: The Basic Technique with Applications to Optimal Parallel List Ranking in Logarithmic Time.",
            "An O(n log log n)-Time Algorithm for Triangulating a Simple Polygon.",
            "How to Generate Factored Random Numbers.",
            "RSA and Rabin Functions: Certain Parts are as Hard as the Whole.",
            "Privacy Amplification by Public Discussion.",
            "Unbiased Bits from Sources of Weak Randomness and Probabilistic Communication Complexity.",
            "Reconstructing Truncated Integer Variables Satisfying Linear Congruences.",
            "A Digital Signature Scheme Secure Against Adaptive Chosen-Message Attacks.",
            "Complexity Measures for Public-Key Cryptosystems.",
            "Solving Simultaneous Modular Equations of Low Degree.",
            "Unique Extrapolation of Polynomial Recurrences.",
            "The Discrete Logarithm Hides O(log n) Bits.",
            "How to Construct Pseudorandom Permutations from Pseudorandom Functions.",
            "A Pipeline Architecture for Factoring Large Integers with the Quadratic Sieve Algorithm.",
            "Efficient Parallel Pseudorandom Number Generation.",
            "The Notion of Security for Probabilistic Cryptosystems.",
            "A Functional Approach to Data Structures and Its Use in Multidimensional Searching.",
            "Parallel Time O(log n) Acceptance of Deterministic CFLs on an Exclusive-Write P-RAM.",
            "A Nearly Optimal Parallel Algorithm for Constructing Depth First Spanning Trees in Planar Graphs.",
            "On Search Times for Early-Insertion Coalesced Hashing.",
            "Lowness Properties of Sets in the Exponential-Time Hierarchy.",
            "Monotone Bipartite Graph Properties are Evasive.",
            "Distance-Hereditary Graphs, Steiner Trees, and Connected Domination.",
            "A Polynomial Approximation Scheme for Scheduling on Uniform Processors: Using the Dual Approximation Approach.",
            "A Graph Theoretic Approach to Statistical Data Security.",
            "Minimum Spanning Trees in k-Dimensional Space.",
            "Some Geometry for General River Routing.",
            "Relations Between Concurrent-Write Models of Parallel Computation.",
            "Erratum: On Restricting the Size of Oracles Compared with Restricting Access to Oracles.",
            "Existence, Uniqueness, and Construction of Rewrite Systems.",
            "A New Lower Bound for the Set-Partitioning Problem.",
            "On the Expected Sublinearity of the Boyer-Moore Algorithm.",
            "Locality, Communication, and Interconnect Length in Multicomputers.",
            "Isomorphism Testing of Unary Algebras.",
            "Efficient Parallel Evaluation of Straight-Line Code and Arithmetic Circuits.",
            "The Complexity of Near-Optimal Programmable Logic Array Folding.",
            "Parallel Algorithms for Term Matching.",
            "The Probabilistic Analysis of a Heuristic for the Assignment Problem.",
            "The Structure of the Stable Roommate Problem: Efficient Representation and Enumeration of All Stable Assignments.",
            "Parallel Merge Sort.",
            "A Natural NP-Complete Problem with a Nontrivial Lower Nound.",
            "Scheduling UET Systems on Two Uniform Processors and Length Two Pipelines.",
            "A Randomized Algorithm for Closest-Point Queries.",
            "Efficient Solutions to Some Transportation Problems with Applications to Minimizing Robot Arm Travel.",
            "Probing Convex Polygons with X-Rays.",
            "Deferred Data Structuring.",
            "On Sets Truth-Table Reducible to Sparse Sets.",
            "An Approximation Scheme for Finding Steiner Trees with Obstacles.",
            "Nondeterministic Space is Closed Under Complementation.",
            "Varieties of Iteration Theories.",
            "On the Complexity of Computing the Volume of a Polyhedron.",
            "Fault Tolerance in Networks of Bounded Degree.",
            "Natural Self-Reducible Sets.",
            "Axiomatising Finite Concurrent Processes.",
            "A Linear Algorithm for Topological Bandwidth in Degree-Three Trees.",
            "Optimal Bounds for Solving Tridiagonal Systems with Preconditioning.",
            "Average-Case Lower Bounds for Searching.",
            "Erratum: An O(n log log n)-Time Algorithm for Triangulating a Simple Polygon.",
            "Efficient Solution of Connectivity Problems on Hierarchically Defined Graphs.",
            "A Fast Parallel Algorithm for Determining all Roots of a Polynomial with Real Roots.",
            "A Lower Bound on the Complexity of the Union-Split-Find Problem.",
            "A Short-Term Neural Network Memory.",
            "Transitive Orientations of Graphs.",
            "Readies and Failures in the Algebra of Communicating Processes.",
            "The Average Complexity of Deterministic and Randomized Parallel Comparison-Sorting Algorithms.",
            "P-Printable Sets.",
            "Search in an Ordered Array Having Variable Probe Cost.",
            "The Decomposition of a Rectangle into Rectangles of Minimal Perimeter.",
            "The Boolean Hierarchy I: Structural Properties.",
            "On Finding Lowest Common Ancestors: Simplification and Parallelization.",
            "The Polynomial Time Hierarchy Collapses if the Boolean Hierarchy Collapses."
        ]
    },
    {
        "name": "SICOMP",
        "year": "1987",
        "info": "Volume 16, 1987",
        "count": 73,
        "papers": [
            "On Stochastic Scheduling with In-Tree Precedence Constraints.",
            "Sublinear Parallel Algorithm for Computing the Greatest Common Divisor of Two Integers.",
            "Complexity of Views: Tree and Cyclic Schemas.",
            "Data Movement Techniques for the Pyramid Computer.",
            "On k-Hulls and Related Problems.",
            "Power Diagrams: Properties, Algorithms and Applications.",
            "A Time-Space Tradeoff for Element Distinctness.",
            "The Complexity of Parallel Sorting.",
            "A Note on Bottom-Up Skew Heaps.",
            "Three Fast Algorithms for Four Problems in Stable Marriage.",
            "On the Computational Complexity of Algebra on Lattices.",
            "An Efficient Approximation Scheme for Variable-Sized Bin Packing.",
            "Scheduling File Transfers for Trees and Odd Cycles.",
            "Stability of a Queueing System with Concurrent Service and Locking.",
            "On Proving Limiting Completeness.",
            "Speed-Up of Turing Machines with One Work Tape and a Two-Way Input Tape.",
            "Random Iterations of Threshold Networks and Associative Memory.",
            "The Equivalence Problem for Single-Valued Two-Way Transducers (on NPDT0L Languages) is Decidable.",
            "The Optimality of Distributive Constructions of Minimum Weight and Degree Restricted Spanning Trees in a Complete Network of Processors.",
            "Fast Algorithms for Bipartite Network Flow.",
            "Tensor Rank and Border Rank of Band Toeplitz Matrices.",
            "Graph Minimal Uncolorability is D^P-Complete.",
            "The Computational Complexity of Division in Quadratic Extension Fields.",
            "An Application of Duality to Edge-Deletion Problems.",
            "On the Axiomatization of \"If-Then-Else\".",
            "A Polynomial-Time Algorithm to Find the Shortest Cycle Basis of a Graph.",
            "On Efficient Simulations of Systolic Arrays of Random-Access Machines.",
            "Asymptotic Expansions for a Closed Multiple Access System.",
            "On the Optimal Control of Two Queues with Server Setup Times and its Analysis.",
            "On Embedding a Graph in the Grid with the Minimum Number of Bends.",
            "Fast Distributed Agreement.",
            "Tight Comparison Bounds on the Complexity of Parallel Sorting.",
            "Equational Bases for If-Then-Else.",
            "Expected Computation Time for Hamiltonian Path Problem.",
            "Weighted Leaf AVL-Trees.",
            "The Complexity of Reliable Concurrency Control.",
            "Tighter Bounds for LPT Scheduling on Uniform Processors.",
            "On Shortest Paths Amidst Convex Polyhedra.",
            "Binary Search on a Tape.",
            "Factoring Multivariate Polynomials over Algebraic Number Fields.",
            "Optimal Mixed Graph Augmentation.",
            "Oracles for Deterministic versus Alternating Classes.",
            "The Least Weight Subsequence Problem.",
            "A Communication-Time Tradeoff.",
            "The Discrete Geodesic Problem.",
            "A 1.6 Approximation Algorithm for Routing Multiterminal Nets.",
            "List Organizing Strategies Using Stochastic Move-to-Front and Stochastic Move-to-Rear Operations.",
            "Generating Random Unlabelled Graphs.",
            "On Some Distance Problems in Fixed Orientations.",
            "Two Processor Scheduling is in NC.",
            "Languages that Capture Complexity Classes.",
            "Logspace Hierarchies, Polynomial Time and the Complexity of Fairness Problems Concerning Omega-Machines.",
            "Deterministic Simulation of Idealized Parallel Computers on More Realistic Ones.",
            "A DNF without Regular Shortest Consensus Path.",
            "Independent and Separable Database Schemes.",
            "A Note on Randomized Polynomial Time.",
            "Doubly Lexical Orderings of Matrices.",
            "The Parallel Complexity of Abelian Permutation Group Problems.",
            "Nonlinear Algebra and Optimization on Rings are \"Hard\".",
            "Computing Powers in Parallel.",
            "On the Optimal Layout of Planar Graphs with Fixed Boundary.",
            "Three Partition Refinement Algorithms.",
            "Optimal Parallel Sorting Scheme by Order Statistics.",
            "Fast Algorithms for Shortest Paths in Planar Graphs, with Applications.",
            "An All Pairs Shortest Path Algorithm with Expected Time O(n² log n).",
            "Sorting and Selecting in Rounds.",
            "Generalized String Matching.",
            "On the Exact Solution of Random Travelling Salesman Problems with Medium Size Integer Coefficients.",
            "Padded Lists Revisited.",
            "Height Restricted Optimal Binary Trees.",
            "Almost Sure Fault Tolerance in Random Graphs.",
            "On One-Way Cellular Arrays.",
            "A Queueing Analysis of Hashing with Lazy Deletion."
        ]
    },
    {
        "name": "SICOMP",
        "year": "1986",
        "info": "Volume 15, 1986",
        "count": 84,
        "papers": [
            "Integration in Finite Terms with Special Functions: The Logarithmic Integral.",
            "An Amortized Analysis of Insertions into AVL-Trees.",
            "The Signature of a Plane Curve.",
            "Self-Adjusting Heaps.",
            "The complexity of Languages Generated by Attribute Grammars.",
            "Upper and Lower Time Bounds for Parallel Random Access Machines without Simultaneous Writes.",
            "The Boyer-Moore-Galil String Searching Strategies Revisited.",
            "Efficient Simulations Among Several Models of Parallel Computers.",
            "An O(EV log V) Algorithm for Finding a Maximal Weighted Matching in General Graphs.",
            "Optimal Termination Protocols for Network Partitioning.",
            "Computational Complexity: On the Geometry of Polynomials and a Theory of Cost: II.",
            "A Provably Good Algorithm for the Two Module Routing Problem.",
            "Alphabetic Minimax Trees of Degree at Most t.",
            "On Shortest Paths in Polyhedral Spaces.",
            "An Efficient Algorithm for Generating Linear Transformations in a Shuffle-Exchange Network.",
            "Variable Sized Bin Packing.",
            "Logarithmic Depth Circuits for Algebraic Functions.",
            "Algebraic Computations of Scaled Padé Fractions.",
            "Constructing Belts in Two-Dimensional Arrangements with Applications.",
            "Average Case Complete Problems.",
            "The Ultimate Planar Convex Hull Algorithm?",
            "Computing the Largest Empty Rectangle.",
            "Optimal Point Location in a Monotone Subdivision.",
            "Constructing Arrangements of Lines and Hyperplanes with Applications.",
            "A Simple Unpredictable Pseudo-Random Number Generator.",
            "Evaluating Rational Functions: Infinite Precision is Finite Cost and Tractable on Average.",
            "Optimal Approximations and Polynomially Levelable Sets.",
            "Probabilistic Bounds on the Performance of List Scheduling.",
            "Minimal Representation of Directed Hypergraphs.",
            "Representations and Parallel Computations for Rational Functions.",
            "On the Complexity of Nonconvex Covering.",
            "Log-Logarithmic Selection Resolution Protocols in a Multiple Access Channel.",
            "Efficient Algorithms for Geometric Graph Search Problems.",
            "Planar Multicommodity Flows, Maximum Matchings and Negative Cycles.",
            "Relativizations of Unambiguous and Random Polynomial Time Classes.",
            "Probabilities Related to Father-Son Distances in Binary Search Trees.",
            "Negation is Powerless for Boolean Slice Functions.",
            "On the Lagarias-Odlyzko Algorithm for the Subset Sum Problem.",
            "Constant Time Generation of Free Trees.",
            "Bounds for Width Two Branching Programs.",
            "On the Probable Performance of Heuristics for Bandwidth Minimization.",
            "The Complexity of the Membership Problem for Two Subclasses of Polynomial Ideals.",
            "Noncommutative Bilinear Algorithms for 3 x 3 Matrix Multiplication.",
            "Collections of Functions for Perfect Hashing.",
            "Recognizing Composite Graphs is Equivalent to Testing Graph Isomorphism.",
            "Register Allocation for Unary-Binary Trees.",
            "Constructing O(n log n) Size Monotone Formulae for the k-th Threshold Function of n Boolean Variables.",
            "The Complexity of Counting Stable Marriages.",
            "On Deterministic Multi-Pass Analysis.",
            "The Complexity of Reliability Computations in Planar and Acyclic Graphs.",
            "Filtering Search: A New Approach to Query-Answering.",
            "On a Multidimensional Search Technique and its Application to the Euclidean One-Centre Problem.",
            "Sparse Sets, Lowness and Highness.",
            "Digital Search Trees Revisited.",
            "Reducing Multiple Object Motion Planning to Graph Searching.",
            "Church-Rosser Thue Systems that Present Free Monoids.",
            "Three-Dimensional Circuit Layouts.",
            "Parallel Algorithms for Depth-First Searches I. Planar Graphs.",
            "Recursion Schemes and Recursive Programs are Exponentially Hard to Analyze.",
            "A Binary Search with a Parallel Recovery of the Bits.",
            "Relative Information Capacity of Simple Relational Database Schemata.",
            "Analysis of Henriksen's Algorithm for the Simulation Event Set.",
            "The Risch Differential Equation Problem.",
            "Data Structures for Retrieval on Square Grids.",
            "Communication Complexity of Computing the Hamming Distance.",
            "Improved Bounds for Matroid Partition and Intersection Algorithms.",
            "An Inhomogeneity in the Structure of Karp Degrees.",
            "Heaps on Heaps.",
            "On Approximations and Incidence in Cylindrical Algebraic Decompositions.",
            "Log Depth Circuits for Division and Related Problems.",
            "On the Validity of the Direct Sum Conjecture.",
            "On the Single-Operation Worst-Case Time Complexity of the Disjoint Set Union Problem.",
            "Ranking and Unranking of AVL-Trees.",
            "A Simple Parallel Algorithm for the Maximal Independent Set Problem.",
            "Finding a Maximum Clique in an Arbitrary Graph.",
            "Average Case Analysis of Marking Algorithms.",
            "Searching in Trees, Series-Parallel and Interval Orders.",
            "Processor-Shared Time-Sharing Models in Heavy Traffic.",
            "Some Observations about the Randomness of Hard Problems.",
            "Probabilistic Analysis of Two Heuristics for the 3-Satisfiability Problem.",
            "Worst Case Bound of an LRF Schedule for the Mean Weighted Flow-Time Problem.",
            "On Maintaining Dynamic Information in a Concurrent Environment.",
            "Sums of Divisors, Perfect Numbers and Factoring.",
            "Completion of a Set of Rules Modulo a Set of Equations."
        ]
    },
    {
        "name": "SICOMP",
        "year": "1985",
        "info": "Volume 14, 1985",
        "count": 73,
        "papers": [
            "An Optimal Simulation of Counter Machines.",
            "An Optimal Simulation of Counter Machines: The ACM Case.",
            "On Circuit-Size Complexity and the Low Hierarchy in NP.",
            "The Complexity of Distributed Concurrency Control.",
            "Unbounded Speed Variability in Distributed Communications Systems.",
            "Voronoi Diagram in the Laguerre Geometry and its Applications.",
            "An Efficient Formula for Linear Recurrences.",
            "Sparse Sets in NP - P: Relativizations.",
            "On Fault-Tolerant Networks for Sorting.",
            "On the Expected Performance of Path Compression Algorithms.",
            "Finding Extremal Polygons.",
            "Simplicity, Relativizations and Nondeterminism.",
            "Polynomial Time Algorithms for the Min Cut Problem on Degree Restricted Trees.",
            "Additive Complexity and Zeros of Real Polynomials.",
            "Factoring Polynomials Over Algebraic Number Fields.",
            "The Computational Complexity of Simultaneous Diophantine Approximation Problems.",
            "Arboricity and Subgraph Listing Algorithms.",
            "Maximum Weight Clique Algorithms for Circular-Arc Graphs and Circle Graphs.",
            "New Data Structures for Orthogonal Range Queries.",
            "Addendum: Simple Linear-Time Algorithms to Test Chordality of Graphs, Test Acyclicity of Hypergraphs, and Selectively Reduce Acyclic Hypergraphs.",
            "Priority Search Trees.",
            "On the Complexity of Maintaining Partial Sums.",
            "An Efficient Algorithm for Finding Multicommodity Flows in Planar Networks.",
            "Trade-Offs Between Depth and Width in Parallel Computation.",
            "On the Movement of Robot Arms in 2-Dimensional Bounded Regions.",
            "Some Results on the Representative Instance in Relational Databases.",
            "Rectilinear Graphs and their Embeddings.",
            "Axioms for the Theory of Lambda-Conversion.",
            "On the Multiplicative Complexity of Modules Over Associative Algebras.",
            "Probabilistic Parallel Algorithms for Sorting and Selection.",
            "An \"Interchange Lemma\" for Context-Free Languages.",
            "A Stochastic Model of Fragmentation in Dynamic Storage Allocation.",
            "Sequential Machine Characterizations of Trellis and Cellular Automata and Applications.",
            "Intersection and Closest-Pair Problems for a Set of Planar Discs.",
            "Polynomial-Time Reductions from Multivariate to Bi- and Univariate Integral Polynomial Factorization.",
            "Optimum Algorithms for a Model of Direct Chaining.",
            "Composing Functions to Minimize Image Size.",
            "Shift-Register Synthesis (Modulo m).",
            "Alphabetic Minimax Trees.",
            "Solving Undirected Graph Problems on VLSI.",
            "Biased Search Trees.",
            "Priority Networks of Communicating Finite State Machines.",
            "On Restricting the Size of Oracles Compared with Restricting Access to Oracles.",
            "On the Equivalence and Containment Problems for Unambiguous Regular Expressions, Regular Grammars and Finite Automata.",
            "An O(n log2 n) Algorithm for Maximum Flow in Undirected Planar Networks.",
            "An O(E log E + I) Expected Time Algorithm for the Planar Segment Intersection Problem.",
            "Scheduling Flat Graphs.",
            "On Comparability and Permutation Graphs.",
            "The Implication Problem for Functional and Inclusion Dependencies is Undecidable.",
            "A Lower Bound for the Formula Size of Rational Functions.",
            "On Parallel Searching.",
            "Approximation of the Consecutive Ones Matrix Augmentation Problem.",
            "Optimal Allocation of Area for Single-Chip Computations.",
            "Scheduling File Transfers.",
            "Data Structures for On-Line Updating of Minimum Spanning Trees, with Applications.",
            "Decomposing a Polygon into Simpler Components.",
            "A Linear-Time Algorithm for Computing K-Terminal Reliability in Series-Parallel Networks.",
            "A Depth-Universal Circuit.",
            "Searching Semisorted Tables.",
            "On Approximation Algorithms for #P.",
            "An Efficient Parallel Biconnectivity Algorithm.",
            "Distributed Multi-Destination Routing: The Constraints of Local Information.",
            "Finding Minimal Pass Sequences for Attribute Grammars.",
            "Optimum Communication Spanning Trees in Series-Parallel Networks.",
            "A Linear Recognition Algorithm for Cographs.",
            "Equations Between Regular Terms and an Application to Process Logic.",
            "The Pure Literal Rule and Polynomial Average Time.",
            "Algorithmic approaches to setup minimization.",
            "An Extension of Liouville's Theorem on Integration in Finite Terms.",
            "Concurrent Probabilistic Programs, Or: How to Schedule if You Must.",
            "Searching Unindexed and Nonuniformly Generated Files in log log N Time.",
            "Probabilistic Models and Asymptotic Results for Concurrent Processing with Exclusive and Non-Exclusive Locks.",
            "The Knuth-Bendix Completion Procedure and Thue Systems."
        ]
    },
    {
        "name": "SICOMP",
        "year": "1984",
        "info": "Volume 13, 1984",
        "count": 55,
        "papers": [
            "On the Existence of Cook Semantics.",
            "Generalized Selection and Ranking: Sorted Matrices.",
            "Linear Time Algorithms for Two- and Three-Variable Linear Programs.",
            "On Synchronous Parallel Computations with Independent Probabilistic Choice.",
            "Clique Covering of Graphs IV. Algorithms.",
            "Formal Systems for Tuple and Equality Generating Dependencies.",
            "The Traveling Salesman Problem with Many Visits to Few Cities.",
            "The Effect of Number of Hamiltonian Paths on the Complexity of a Vertex-Coloring Problem.",
            "Optimizing Chain Queries in a Distributed Database System.",
            "Alternating Pushdown and Stack Automata.",
            "Limitations on Explicit Constructions of Expanding Graphs.",
            "Pushdown Permuter Characterization Theorem.",
            "Tighter Bounds for the Multifit Processor Scheduling Algorithm.",
            "On the Complexity of Some Common Geometric Location Problems.",
            "Minimal-Cost Brother Trees.",
            "Two Tapes are Better than One for Nondeterministic Machines.",
            "Computation of Matrix Chain Products. Part II.",
            "N by N Checkers is Exptime Complete.",
            "Parallel Solution of Certain Toeplitz Linear Systems.",
            "Self-Organizing Heuristics for Implicit Data Structures.",
            "Verification of Probabilistic Programs.",
            "Constrained Optimum Communication Trees and Sensitivity Analysis.",
            "Immunity, Relativizations, and Nondeterminism.",
            "Fast Algorithms for Finding Nearest Common Ancestors.",
            "The Spectra of First-Order Sentences and Computational Complexity.",
            "Recursive Programs as Definitions in First Order Logic.",
            "Simulation of Parallel Random Access Machines by Circuits.",
            "Constant Depth Reducibility.",
            "An Algorithm for the General Petri Net Reachability Problem.",
            "Quantitative Relativizations of Complexity Classes.",
            "Convex Partitions of Polyhedra: A Lower Bound and Worst-Case Optimal Algorithm.",
            "Consistency and Serializability in Concurrent Database Systems.",
            "The Organ Pipe Permutation.",
            "A Mathematical Model for the Verification of Systolic Networks.",
            "Simple Linear-Time Algorithms to Test Chordality of Graphs, Test Acyclicity of Hypergraphs, and Selectively Reduce Acyclic Hypergraphs.",
            "Efficient Parallel Algorithms for a Class of Graph Theoretic Problems.",
            "Insertion and Compaction Algorithms in Sequentially Allocated Storage.",
            "Movement Problems for 2-Dimensional Linkages.",
            "On the Optimum Checkpoint Selection Problem.",
            "On Some Variants of the Bandwidth Minimization Problem.",
            "Disk Performance in a Transaction-Oriented System.",
            "Equivalence Relations, Invariants, and Normal Forms.",
            "Preemptive Scheduling of a Multiprocessor System with Memories to Minimize Maximum Lateness.",
            "Scheduling Independent Tasks on Uniform Processors.",
            "On Relativized Polynomial and Exponential Computations.",
            "The Power of Synchronization Mechanisms.",
            "n-Rational Algebras I. Basic Properties and Free Algebras.",
            "n-Rational Algebras II. Varieties and Logic of Inequalities.",
            "The Information-Theoretic Bound is Good for Merging.",
            "Parallel Algorithms for Algebraic Problems.",
            "Is the Interesting Part of Process Logic Uninteresting? A Translation from PL to PDL.",
            "Information Transfer under Different Sets of Protocols.",
            "How to Generate Cryptographically Strong Sequences of Pseudo-Random Bits.",
            "Cylindrical Algebraic Decomposition I: The Basic Algorithm.",
            "Cylindrical Algebraic Decomposition II: An Adjacency Algorithm for the Plane."
        ]
    },
    {
        "name": "SICOMP",
        "year": "1983",
        "info": "Volume 12, 1983",
        "count": 54,
        "papers": [
            "The Computational Complexity of Continued Fractions.",
            "Optimal Search in Planar Subdivisions.",
            "Tools for Template Dependencies.",
            "Bounds for Multifit Scheduling on Uniform Processors.",
            "Minimum s-t Cut of a Planar Undirected Network in O(n log2(n)) Time.",
            "A Technique for Establishing Completeness Results in Theorem Proving with Equality.",
            "Characterization of Division Algebras of Minimal Rank and the Structure of Their Algorithm Varieties.",
            "Divide and Conquer Heuristics for Minimum Weighted Euclidean Matching.",
            "The Travelling Salesman Problem and Minimum Matching in the Unit Square.",
            "Simple Construction for Multi-Terminal Network Flow Synthesis.",
            "Formal Semantics and Abstract Properties of String Pattern Operations and Extended Formal Language Description Mechanisms.",
            "On Proving Uniform Termination and Restricted Termination of Rewriting Systems.",
            "Concurrency Control by Locking.",
            "Dynamic Bin Packing.",
            "Whether a Set of Multivalued Dependencies Implies a Join Dependency is NP-Hard.",
            "The Equivalence of Two Semantic Definitions: A Case Study in LCF.",
            "Computing Rational Zeros of Integral Polynomials by p-adic Expansion.",
            "Multiprocessor Scheduling of Unit-Time Jobs with Arbitrary Release Times and Deadlines.",
            "Properties of Finite and Pushdown Transducers.",
            "Quadratic Algorithms for Minimizing Joins in Restricted Relational Expressions.",
            "The Worst and the Most Probable Performance of a Class of Set-Covering Algorithms.",
            "Towards a Genuinely Polynomial Algorithm for Linear Programming.",
            "VLSI Algorithms for the Connected Component Problem.",
            "Initial and Final Algebra Semantics for Data Type Specifications: Two Characterization Theorems.",
            "Some Time-Space Tradeoff Results Concerning Single-Tape and Offline TM's.",
            "Generalized p-adic Constructions.",
            "On Certain Polynomial-Time Truth-Table Reducibilities of Complete Sets to Sparse Sets.",
            "Construction of Optimal alpha-beta Leaf Trees with Applications to Prefix Code and Information Retrieval.",
            "Optimal Placement for River Routing.",
            "Optimal Dynamic Embedding of Trees into Arrays.",
            "A Generalized Class of Polynomials that are Hard to Factor.",
            "Multidimensional Sorting.",
            "Shelf Algorithms for Two-Dimensional Packing Problems.",
            "On the Selection of Test Data for Vector-Valued Recursive Subroutines.",
            "One Step Transformation of Periodic Sequences by Cellular Automata.",
            "Tree Traversal Related Algorithms for Generating Integer Partitions.",
            "Positive Relativizations of Complexity Classes.",
            "Two Results on Polynomial Time Truth-Table Reductions to Sparse Sets.",
            "A Shortest-Path Algorithm with Expected Time O(n2 log n log* n).",
            "On the Complexity of General Graph Factor Problems.",
            "The Ranks of m * n * (mn-2) Tensors.",
            "Optimizing Conjunctive Queries that Contain Untyped Variables.",
            "Fast Parallel Computation of Polynomials Using Few Processors.",
            "Uniform Random Generation of Strings in a Context-Free Language.",
            "Authenticated Algorithms for Byzantine Agreement.",
            "Analysis of Early-Insertion Standard Coalesced Hashing.",
            "Varieties of \"if-then-else\".",
            "On the Space and Time Complexity of Functions Computable by Simple Programs.",
            "An Analysis of Backtracking with Search Rearrangement.",
            "Convex Clusters in a Discrete m-Dimensional Space.",
            "New Results on the Complexity of p-Center Problems.",
            "Linear-Time Algorithms for Linear Programming in R3 and Related Problems.",
            "The Complexity of Counting Cuts and of Computing the Probability that a Graph is Connected.",
            "Asymptotic Expansions of Moments of the Waiting Time in a Shared-Processor of an Interactive System."
        ]
    },
    {
        "name": "SICOMP",
        "year": "1982",
        "info": "Volume 11, 1982",
        "count": 64,
        "papers": [
            "Straight-Line Programs with One Input Variable.",
            "The Complexity of the Equivalence Problem for Simple Loop-Free Programs.",
            "A Fast Algorithm for the Euclidean Traveling Salesman Problem, Optimal with Probability One.",
            "Dynamic Programming is Optimal for Nonserial Optimization Problems.",
            "On the Expected Performance of Scanning Disks.",
            "A Hidden-Line Algorithm for Hyperspace.",
            "Symbolic Program Analysis in Almost-Linear Time.",
            "Analysis of a General Mass Storage System.",
            "Algorithms for Edge Coloring Bipartite Graphs and Multigraphs.",
            "Two Familiar Transitive Closure Algorithms Which Admit No Polynomial Time, Sublinear Space Implementations.",
            "Minimum Variance Huffman Codes.",
            "Polygon Retrieval.",
            "A Polynomial Time Algorithm for Deciding the Equivalence Problem for 2-Tape Deterministic Finite State Acceptors.",
            "Complexity of Matroid Property Algorithms.",
            "Dominating Sets in Chordal Graphs.",
            "Continuous Data Types.",
            "Geometric Problems with Application to Hashing.",
            "Graphs that are Almost Binary Trees.",
            "An Asymptotically Optimal Algorithm for the Dutch National Flag Problem.",
            "Some Properties of Disjoint Sums of Tensors Related to Matrix Multiplication.",
            "On Transforming Control Structures.",
            "A Time-Space Tradeoff for Sorting on a General Sequential Model of Computation.",
            "The Recognition of Series Parallel Digraphs.",
            "Parallel Algorithms in Graph Theory: Planarity Testing.",
            "Planar Formulae and Their Uses.",
            "On the Accepting Density Hierarchy in NP.",
            "A Scheme for Fast Parallel Communication.",
            "Computation of Matrix Chain Products. Part I.",
            "On Primality Tests.",
            "The Complexity of Finding Cycles in Periodic Functions.",
            "Freedom from Deadlock of Safe Locking Policies.",
            "The Counterfeit Coin Problem Revisited.",
            "Omega(n log n) Lower Bounds on Length of Boolean Formulas.",
            "On the Average-Case Complexity of Selecting the kth Best.",
            "The Equivalence Problem for Deterministic Two-Way Sequential Transducers is Decidable.",
            "The Working Set Size Distribution for the Markov Chain Model of Program Behavior.",
            "Rapid Multiplication of Rectangular Matrices.",
            "On the Asymptotic Complexity of Matrix Multiplication.",
            "A Lubricant for Data Flow Analysis.",
            "Complexity Results for Scheduling Tasks in Fixed Intervals on Two Types of Machines.",
            "Completions of Partially Ordered Sets.",
            "The Hamiltonian Circuit Problem is Polynomial for 4-Connected Planar Graphs.",
            "On Edge Coloring Bipartite Graphs.",
            "Computational Power in Query Languages.",
            "Approximation Algorithms for the Set Covering and Vertex Cover Problems.",
            "Two Spectra of Self-Organizing Sequential Search Algorithms.",
            "Finding the Cyclic Index of an Irreducible, Nonnegative Matrix.",
            "Relativizing Time, Space, and Time-Space.",
            "Ranking and Unranking of 2-3 Trees.",
            "On Some Deterministic Space Complexity Problems.",
            "Finding Augmented-Set Bases.",
            "Predicting the Number of Distinct Elements in a Multiset.",
            "On Linear Characterizations of Combinatorial Optimization Problems.",
            "Evaluation of Arithmetic Expressions with Algebraic Identities.",
            "An Approximation Algorithm for the Maximum Independent Set Problem on Planar Graphs.",
            "Hamilton Paths in Grid Graphs.",
            "Algorithms for the Solution of Systems of Linear Diophantine Equations.",
            "Scheduling the Open Shop to Minimize Mean Flow Time.",
            "On Constructing Minimum Spanning Trees in k-Dimensional Spaces and Related Problems.",
            "Some Area-Time Tradeoffs for VLSI.",
            "A Partial Analysis of Height-Balanced Trees Under Random Insertions and Deletions.",
            "The Category-Theoretic Solution of Recursive Domain Equations.",
            "Optimization of Cost and Delay in Cellular Permutation Networks.",
            "On a Primality Test of Solovay and Strassen."
        ]
    },
    {
        "name": "SICOMP",
        "year": "1981",
        "info": "Volume 10, 1981",
        "count": 63,
        "papers": [
            "Lower Bounds on the Complexity of Some Optimal Data Structures.",
            "Some NP-Complete Problems Similar to Graph Isomorphism.",
            "Characterizations of Presburger Functions.",
            "On ET0L Systems with Finite Tree-Rank.",
            "On the Selection of Test Data for Recursive Mathematical Subroutines.",
            "Generalization of Voronoi Diagrams in the Plane.",
            "Fast Sorting of Weyl Sequences Using Comparisons.",
            "Relative to a Random Oracle A, PA != NPA != co-NPA with Probability 1.",
            "A Note on the Complexity of General D0L Membership.",
            "On String Pattern Matching: A New Model with a Polynomial Time Algorithm.",
            "Listing and Counting Subtrees of a Tree.",
            "Nonpreemptive LP-Scheduling on Homogeneous Multiprocessor Systems.",
            "Operator Precedence Grammars and the Noncounting Property.",
            "Sequencing Jobs with Unequal Ready Times to Minimize Mean Flow Time.",
            "Linear Time Automorphism Algorithms for Trees, Interval Graphs, and Planar Graphs.",
            "The Total Correctness of Parallel Programs.",
            "An Algorithm for Finding K Minimum Spanning Trees.",
            "Scheduling Unit-Time Tasks with Arbitrary Release Times and Deadlines.",
            "Approximation Algorithms for Several Graph Augmentation Problems.",
            "The Rational Index: A Complexity Measure for Languages.",
            "Edge-Deletion Problems.",
            "Node-Deletion Problems on Bipartite Graphs.",
            "An O(n log2 n) Algorithm for the k-th Longest Path in a Tree with Applications to Location Problems.",
            "Optimization Problems on Graphs with Independent Random Edge Weights.",
            "Equivalence of Relational Database Schemes.",
            "An Extension of Strassen's Degree Bound.",
            "Languages Simultaneously Complete for One-Way and Two-Way Log-Tape Automata.",
            "Recursive Graphs, Recursive Labelings and Shortest Paths.",
            "An Analysis of a Memory Allocation Scheme for Implementing Stacks.",
            "Inferring a Tree from Lowest Common Ancestors with an Application to the Optimization of Relational Expressions.",
            "Optimal Multi-Way Search Trees.",
            "Partial and Total Matrix Multiplication.",
            "A T=O(2n/2), S=O(2n/4) Algorithm for Certain NP-Complete Problems.",
            "Parallel Sorting with Constant Time for Comparisons.",
            "A New Approach to Planar Point Location.",
            "Uniform Interpretations of Grammar Forms.",
            "Attribute Grammars and Mathematical Semantics.",
            "Automatic Programming of Finite State Linear Programs.",
            "Pumping Lemmas for Regular Sets.",
            "Worst-Case and Probabilistic Analysis of a Geometric Location Problem.",
            "Key Comparison Optimal 2-3 Trees with Maximum Utilization.",
            "Performance Bounds for Orthogonal Oriented Two-Dimensional Packing Algorithms.",
            "An Average Time Analysis of Backtracking.",
            "Deadlock-Free Packet Switching Networks.",
            "Corrigendum: Soundness and Completeness of an Axiom System for Program Verification.",
            "Exegesis of Self-Organizing Linear Search.",
            "Computing Sequences with Addition Chains.",
            "Preserving Functional Dependencies.",
            "Parallel Matrix and Graph Algorithms.",
            "On a Greedy Heuristic for Complete Matching.",
            "Fast, Efficient Parallel Algorithms for Some Graph Problems.",
            "Information Dissemination in Trees.",
            "Some Complexity Results in the Design of Deadlock-Free Packet Switching Networks.",
            "The NP-Completeness of Some Edge-Partition Problems.",
            "The NP-Completeness of Edge-Coloring.",
            "Optimal Retrieval Algorithms for Small Region Queries.",
            "Limitations on Separating Nondeterministic Complexity Classes.",
            "Covering Graphs by Simple Circuits.",
            "Power of Natural Semijoins.",
            "Minimizing the Number of Evaluation Passes for Attribute Grammars.",
            "Completeness, Approximation and Density.",
            "An Efficient Cycle Vector Space Algorithm for Listing all Cycles of a Planar Graph.",
            "Distributed Processor Scheduling and User Countermeasures."
        ]
    },
    {
        "name": "SICOMP",
        "year": "1980",
        "info": "Volume 9, 1980",
        "count": 64,
        "papers": [
            "An Efficient Test for Circular-Arc Graphs.",
            "Solutions of the Iteration Equation and Extensions of the Scalar Iteration Operation.",
            "Refining Nondeterminism in Relativized Polynomial-Time Bounded Computations.",
            "On the Complexity of Composition and Generalized Composition of Power Series.",
            "The Semantics of Call-By-Value and Call-By-Name in a Nondeterministic Environment.",
            "On the Optimality of Linear Merge.",
            "Bounds for List Schedules on Uniform Processors.",
            "Worst Case Exponential Lower Bounds for Input Resolution with Paramodulation.",
            "An Efficient Method for Weighted Sampling Without Replacement.",
            "On the Succinctness of Different Representations of Languages.",
            "Addition Chain Methods for the Evaluation of Specific Polynomials.",
            "On the Complexity of Searching a Set of Vectors.",
            "Combinatorial Gray codes.",
            "A Note on Gray Code and Odd-Even Merge.",
            "Monoids for Rapid Data Flow Analysis.",
            "Finding the Vertex Connectivity of Graphs.",
            "Voronoi Diagrams in L1 (Linfty) Metrics with 2-Dimensional Storage Applications.",
            "On the Complexity of Canonical Labeling of Strongly Regular Graphs.",
            "Corrigendum: A New Representation of the Rational Numbers for Fast Easy Arithmetic.",
            "A Multi-Terminal Minimum Cut Algorithm for Planar Graphs.",
            "On Multiplication of Polynomials Modulo a Polynomial.",
            "On the Evaluation of Powers and Monomials.",
            "Efficient Synthesis and Implementation of Large Discrete Fourier Transformations.",
            "Probabilistic Algorithms in Finite Fields.",
            "A Theoretical Analysis of Various Heuristics for the Graph Isomorphism Problem.",
            "Optimal Merging of 3 Elements with n Elements.",
            "New Fast Algorithms for Matrix Operations.",
            "On the Polyhedral Decision Problem.",
            "Path Systems: Constructions, Solutions and Applications.",
            "Code Motion.",
            "On the Computational Complexity of Program Scheme Equivalence.",
            "Saving Space in Fast String-Matching.",
            "Corrigendum: A Family of Algorithms for Powering Sparse Polynomials.",
            "The Mathematics of Record Handling.",
            "Conditions for Optimality of the Huffman Algorithm.",
            "Storage Modification Machines.",
            "A Correct Preprocessing Algorithm for Boyer-Moore String-Searching.",
            "The Pebbling Problem is Complete in Polynomial Space.",
            "Vector Iteration in Pointed Iterative Theories.",
            "Bounds on the Scheduling of Typed Task Systems.",
            "Random Graphs and Graph Optimization Problems.",
            "Generating all Maximal Independent Sets: NP-Hardness and Polynomial-Time Algorithms.",
            "Bounds on Selection Networks.",
            "An Optimal Algorithm for Symbolic Factorization of Symmetric Matrices.",
            "Design and Analysis of a Data Structure for Representing Sorted Lists.",
            "Applications of a Planar Separator Theorem.",
            "Random Graph Isomorphism.",
            "Space Lower Bounds for Maze Threadability on Restricted Machines.",
            "Predictors of Context-Free Grammars.",
            "Completeness with Finite Systems of Intermediate Assertions for Recursive Program Schemes.",
            "A New Proof of the Linearity of the Boyer-Moore String Searching Algorithm.",
            "Compatible Orderings on the Metric Theory of Trees.",
            "Approximate Solutions for the Bilinear Form Computational Problem.",
            "The Application of Multivariate Polynomials to Inference Rules and Partial Tests for Unsatisfiability.",
            "Constant Time Generation of Rooted Trees.",
            "On the Complexity of Bilinear Forms with Commutativity.",
            "Equality Sets and Complexity Classes.",
            "Finding Connected Components and Connected Ones on a Mesh-Connected Parallel Computer.",
            "Factorization of Symmetric Matrices and Trace-Orthogonal Bases in Finite Fields.",
            "A Model and Proof Technique for Message-Based Systems.",
            "Efficient On-Line Construction and Correction of Position Trees.",
            "Performance Bounds for Level-Oriented Two-Dimensional Packing Algorithms.",
            "A Polynomial Time Algorithm for Solving Systems of Linear Inequalities with Two Variables per Inequality.",
            "Orthogonal Packings in Two Dimensions."
        ]
    },
    {
        "name": "SICOMP",
        "year": "1979",
        "info": "Volume 8, 1979",
        "count": 52,
        "papers": [
            "Determining the Chromatic Number of a Graph.",
            "A Minimum Linear Arrangement Algorithm for Undirected Trees.",
            "A Partial Analysis of Random Height-Balanced Trees.",
            "Optimal 2, 3-Trees.",
            "A Round-Off Error Model with Applications to Arithmetic Expressions.",
            "Generating Trees and Other Combinatorial Objects Lexicographically.",
            "Heuristics That Dynamically Organize Data Structures.",
            "Total Ordering Problem.",
            "Lower Bounds on Synchronous Combinational Complexity.",
            "On the Parallel Evaluation of Multivariate Polynomials.",
            "A New Representation of the Rational Numbers for Fast Easy Arithmetic.",
            "Maximum Flow in Planar Networks.",
            "Provably Difficult Combinatorial Games.",
            "Dynamic Binary Search.",
            "A Counterexample to Reingold's Pushdown Permuter Characterization Theorem.",
            "Combinatorial Analysis of an Efficient Algorithm for Processor and Storage Allocation.",
            "Equivalences Among Relational Expressions.",
            "Decision Problems for Multivalued Dependencies in Relational Databases.",
            "Bottlenecks and Edge Connectivity in Unsymmetrical Networks.",
            "Nearly On Line Scheduling of a Uniform Processor System with Release Times.",
            "Automatic Asymptotic and Big-O Calculations Via Computer Algebra.",
            "New Algorithms for Polynomial Square-Free Decomposition Over the Integers.",
            "Symbolic Vector and Dyadic Analysis.",
            "A Natural Structure Theorem for Complex Fields.",
            "New Algorithms for Polynomial Multiplication.",
            "Some Remarks on Computing Galois Groups.",
            "Uniform Bounds for a Class of Algebraic Mappings.",
            "A Structure Theorem for Exponential and Primitive Functions.",
            "The Complexity of Pattern Matching for a Random String.",
            "On the Number of Comparisons to Find the Intersection of Two Relations.",
            "Scheduling Interval-Ordered Tasks.",
            "The Complexity of Enumeration and Reliability Problems.",
            "Multi-Terminal 0-1 Flow.",
            "A Note on Sparse Complete Sets.",
            "Polynomial Space and Transitive Closure.",
            "On the Expected Value of a Random Assignment Problem.",
            "Optimal Evaluation of Pairs of Bilinear Forms.",
            "Efficient Ordering of Hash Tables.",
            "Optimal and Near-Optimal Scheduling Algorithms for Batched Processing in Linear Storage.",
            "Polynomial Algorithms for Computing the Smith and Hermite Normal Forms of an Integer Matrix.",
            "Towards a Precise Characterization of the Complexity of Universal and Nonuniversal Turing Machines.",
            "On V-Optimal Trees.",
            "A Note on Locating a Set of Points in a Planar Subdivision.",
            "On the Semantics of \"Data Type\".",
            "A Patching Algorithm for the Nonsymmetric Traveling-Salesman Problem.",
            "Classes of Pebble Games and Complete Problems.",
            "Translatability and Decidability Questions for Restricted Classes of Program Schemas.",
            "An Efficient Method for Storing Ancestor Information in Trees.",
            "Node-Deletion NP-Complete Problems.",
            "A Family of Algorithms for Powering Sparse Polynomials.",
            "A Linear Time Algorithm for Finding Minimum Cutsets in Reducible Graphs.",
            "Corrigenda: A Completeness Criterion for Spectra."
        ]
    },
    {
        "name": "SICOMP",
        "year": "1978",
        "info": "Volume 7, 1978",
        "count": 43,
        "papers": [
            "An Application of Bin-Packing to Multiprocessor Scheduling.",
            "Minimean Merging and Sorting: An Algorithm.",
            "Simple Gödel Numberings, Isomorphisms, and Programming Properties.",
            "Polynomials with 0-1 Coefficients that Are Hard to Evaluate.",
            "Soundness and Completeness of an Axiom System for Program Verification.",
            "An Extension of Computational Duality to Sequences of Bilinear Computations.",
            "Computational Parallels Between the Regular and Context-Free Languages.",
            "The Time Measure of One-Tape Turing Machines Does Not Have the Parallel Computation Property.",
            "Erratum: A Fast Monte-Carlo Test for Primality.",
            "On Structure Preserving Reductions.",
            "An Algorithm for Transitive Closure with Linear Expected Time.",
            "Observations on the Complexity of Generating Quasi-Gray Codes.",
            "Selecting the Kth element in X + Y and X_1 + X_2 + ... + X_m.",
            "An O(N log N) Algorithm for a Class of Matching Problems.",
            "On Good E0L Forms.",
            "Linear Languages and the Intersection Closures of Classes of Languages.",
            "Approximation Algorithms for Some Routing Problems.",
            "Rudimentary Predicates and Relative Computation.",
            "Finite Capacity Queuing Systems with Applications in Computer Modeling.",
            "Parallel Computations in Graph Theory.",
            "Errata: On the Number of Multiplications Required for Matrix Multiplication.",
            "Data Movement in Odd-Even Merging.",
            "Isomorphism Testing for Graphs, Semigroups, and Finite Automata Are Polynomially Equivalent Problems.",
            "Finding All Spanning Trees of Directed and Undirected Graphs.",
            "Efficient Calculation of Expected Miss Ratios in the Independent Reference Model.",
            "Implementation and Analysis of Binomial Queue Algorithms.",
            "Deadlock Prediction: Easy and Difficult Cases.",
            "Approximate Reduction and Lambda Calculus Models.",
            "Correcting Counter-Automaton-Recognizable Languages.",
            "Generalized Syntax Directed Translation, Tree Transducers, and Linear Space.",
            "Complexity of Task Sequencing with Deadlines, Set-Up Times and Changeover Costs.",
            "Polynomial Algorithms for Deterministic Pushdown Automata.",
            "Finding a Minimum Circuit in a Graph.",
            "Generating t-ary Trees Lexicographically.",
            "Polynomial Time Enumeration Reducibility.",
            "Some Polynomial and Integer Divisibility problems are NP-Hard.",
            "Minimal-Comparison 2, 3-Trees.",
            "Tree Size by Partial Backtracking.",
            "Ranking and Listing Algorithms for k-ary Trees.",
            "Generalized Connectors.",
            "On the Loop Switching Addressing Problem.",
            "The Unsolvability of the Equivalence Problem for epsilon-Free NGSM's with Unary Input (Output) Alphabet and Applications.",
            "A Technique for Extending Rapid Exact-Match String Matching to Arrays of More Than One Dimension."
        ]
    },
    {
        "name": "SICOMP",
        "year": "1977",
        "info": "Volume 6, 1977",
        "count": 56,
        "papers": [
            "Optimal Polyphase Sorting.",
            "Single Machine Job Sequencing with Precedence Constraints.",
            "Smallest Augmentations to Biconnect a Graph.",
            "Polynomial Complete Consecutive Information Retrieval Problems.",
            "On the Complexity of Local Search for the Traveling Salesman Problem.",
            "A Fast Monte-Carlo Test for Primality.",
            "Comments on F. Hadlock's Paper: \"Finding a Maximum Cut of a Planar Graph in Polynomial Time\".",
            "A Graph-Theoretic Characterization of the PV_chunk Class of Synchronizing Primitives.",
            "Evaluating Relational Expressions with Dense and Sparse Arguments.",
            "Derivation Complexity in Context-Free Grammar Forms.",
            "Two Algorithms for Generating Weighted Spanning Trees in Order.",
            "A Linear Tree Partitioning Algorithm.",
            "Bounds for LPT Schedules on Uniform Processors.",
            "Task Scheduling on a Multiprocessor System with Independent Memories.",
            "Adequate Requirements for Rational Functions.",
            "Erratum: Lucid - A Formal System for Writing and Proving Programs.",
            "Optimum Sequence Trees.",
            "A Best Possible Bound for the Weighted Path Length of Binary Search Trees.",
            "Quicksort with Equal Keys.",
            "Some Remarks on p-Way Merging.",
            "Constraints on Structural Descriptions: Local Transformations.",
            "A Completeness Criterion for Spectra.",
            "Superconcentrators.",
            "On Isomorphisms and Density of NP and Other Complete Sets.",
            "Fast Pattern Matching in Strings.",
            "Stable Sorting and Merging with Optimal Space and Time Bounds.",
            "The Depth of All Boolean Functions.",
            "Some Preservation Properties of Normal Form Grammars.",
            "Implementation Correctness Involving a Language with goto Statements.",
            "Two-Processor Scheduling with Start-Times and Deadlines.",
            "A 2.5 n-Lower Bound on the Combinational Complexity of Boolean Functions.",
            "On Resolution with Clauses of Bounded Size.",
            "The Tape Complexity of Some Classes of Szilard Languages.",
            "The Computational Complexity of Provability in Systems of Modal Propositional Logic.",
            "A Linear Time Algorithm for a 2 × n Transportation Problem.",
            "Linear-Time Computation by Nondeterministic Multidimensional Iterative Arrays.",
            "A New Algorithm for Generating All the Maximal Independent Sets.",
            "Worst Case Analysis of Two Scheduling Algorithms.",
            "Finding a Maximum Independent Set.",
            "Succinctness of Descriptions of Unambiguous Context-Free Languages.",
            "The Partial Fraction Expansion Problem and Its Inverse.",
            "An Analysis of Several Heuristics for the Traveling Salesman Problem.",
            "Fast Algorithms for Partial Fraction Decomposition.",
            "Location of a Point in a Planar Subdivision and Its Applications.",
            "Internal Fragmentation in a Class of Buddy Systems.",
            "A New Algorithm for Minimum Cost Binary Trees.",
            "Determining the Stability Number of a Graph.",
            "Minimizing Garbage Collection as a Function of Region Size.",
            "On the Worst-Case Behavior of String-Searching Algorithms.",
            "Computational Complexity of Probabilistic Turing Machines.",
            "A Note on Spira's Algorithm for the All-Pairs Shortest-Path Problem.",
            "A Unified Treatment of Discrete Fast Unitary Transforms.",
            "Prospects and Limitations of Automatic Assertion Generation for Loop Programs.",
            "An Analysis of a Good Algorithm for the Subtree Problem.",
            "On Relating Time and Space to Size and Depth.",
            "Generating Binary Trees Lexicographically."
        ]
    },
    {
        "name": "SICOMP",
        "year": "1976",
        "info": "Volume 5, 1976",
        "count": 52,
        "papers": [
            "Sorting and Searching in Multisets.",
            "Optimal Alphabetic Trees.",
            "Partial-Match Retrieval Algorithms.",
            "Machine Selection of Elements in Crossword Puzzles: An Application of Computational Linguistics.",
            "Scheduling Graphs on Two Processors.",
            "New Bounds on the Complexity of the Shortest Path Problem.",
            "On Algorithms for Enumerating All Circuits of a Graph.",
            "On the Evaluation of Powers.",
            "b-Matchings in Trees.",
            "Bounds for Selection.",
            "On Finding Lowest Common Ancestors in Trees.",
            "A Fast Algorithm for Finding an Optimal Ordering for Vertex Elimination on a Graph.",
            "On the Number of Additions to Compute Specific Polynomials.",
            "A Comparison of Two Algorithms for Global Data Flow Analysis.",
            "Multidimensional Searching Problems.",
            "On the Additive Complexity of Matrix Multiplication.",
            "Graph Transformations for Roundoff Analysis.",
            "On Families of Languages Defined by Time-Bounded Random Access Machines.",
            "Noncanonical Extensions of Bottom-Up Parsing Techniques.",
            "Termination Properties of Generalized Petri Nets.",
            "Algorithmic Aspects of Vertex Elimination on Graphs.",
            "Decomposition Theorems for Various Kinds of Languages Parallel in Nature.",
            "Ranking Algorithms: The Symmetries and Colorations of the n-Cube.",
            "Local Adjunct Languages and Regular Sets.",
            "Synthesizing a Response Function with a Feedback Scheduling Algorithm.",
            "On Preserving Proximity in Extendible Arrays.",
            "Computational Complexity over Finite Fields.",
            "Lucid - A Formal System for Writing and Proving Programs.",
            "Proof Theory of Partial Correctness Verification Systems.",
            "Correct Computation Rules for Recursive Languages.",
            "Generalized Program Schemas.",
            "The Theoretical Aspects of the Optimal Fixed Point.",
            "Computational Complexity of Multiple Recursive Schemata.",
            "A Powerdomain Construction.",
            "The Relation Between Computational and Denotational Properties for Scott's Dinfty-Models of the Lambda-Calculus.",
            "Data Types as Lattices.",
            "Theory of Output Set Assignments and Degree Switching Operations.",
            "Ranking Algorithms for Lists of Partitions.",
            "Fast Parallel Matrix Inversion Algorithms.",
            "On the Number of Multiplications Required for Matrix Multiplication.",
            "General Results on Tour Lengths in Machines and Digraphs.",
            "On Sets Cook-Reducible to Sparse Sets.",
            "Augmentation Problems.",
            "Simple Programs Realize Exactly Presberger Formulas.",
            "On the Parallel Evaluation of Boolean Expressions.",
            "A Generalized Asymptotic Upper Bound on Fast Polynomial Evaluation and Interpolation.",
            "On the Complexity of Timetable and Multicommodity Flow Problems.",
            "The Planar Hamiltonian Circuit Problem is NP-Complete.",
            "An Account of Self-Organizing Systems.",
            "Finding Minimum Spanning Trees.",
            "Analysis of the Optimal, Look-Ahead Demand Paging Algorithms.",
            "Errata: On Optimal Processor Scheduling for Multiprogramming."
        ]
    },
    {
        "name": "SICOMP",
        "year": "1975",
        "info": "Volume 4, 1975",
        "count": 46,
        "papers": [
            "On Simple Gödel Numberings and Translations.",
            "Realization with Feedback Encoding. I: Analogues of the Classical Theory.",
            "Realization with Feedback Encoding. II: Applications to Distinguishing Sequences.",
            "Computational Complexity of Inner Products of Vectors (And That of Other Bilinear Forms) over a Noncommutative Ring (Auxiliary Functions Allowed).",
            "Faithful Representation of a Family of Sets by a Set of Intervals.",
            "A Decision Procedure for the First Order Theory of Real Addition with Order.",
            "Finding All the Elementary Circuits of a Directed Graph.",
            "State-Splitting for Stochastic Machines.",
            "Computational Complexity and Numerical Stability.",
            "Derivation of Confidence Intervals for Work Rate Estimators in a Closed Queuing Network.",
            "Translating Program Schemas to While-Schemas.",
            "Time Bounds on the Parallel Evaluation of Arithmetic Expressions.",
            "Solving a Problem in Eigenvalue Approximation with a Symbolic Algebra System.",
            "Matrix Factorization Over GF(2) and Trace-Orthogonal Bases of GF(2n).",
            "Bounds for Multiprocessor Scheduling with Resource Constraints.",
            "The Computation of Powers of Symbolic Polynomials.",
            "Computational Algorithms for the Enumeration of Group Invariant Partitions.",
            "Every Prime has a Succinct Certificate.",
            "Finding a Maximum Cut of a Planar Graph in Polynomial Time.",
            "Complete Register Allocation Problems.",
            "Worst-Case Analysis of a Placement Algorithm Related to Storage Allocation.",
            "Improved Divide/Sort/Merge Sorting Networks.",
            "Near-Optimal Solutions to a 2-Dimensional Placement Problem.",
            "Managing Storage for Extendible Arrays.",
            "Recursion Structure Simplification.",
            "Interactive Computation of Homology of Finite Partially Ordered Sets.",
            "The Power of Negative Thinking in Multiplying Boolean Matrices.",
            "Speed of Recognition of Context-Free Languages by Array Automata.",
            "Optimum Partitions of Tree Addressing Structures.",
            "Parallelism in Comparison Problems.",
            "The Renewal Model for Program Behavior.",
            "On Finding and Updating Spanning Trees and Shortest Paths.",
            "On the Number of Multiplications/Divisions Evaluating a Polynomial with Auxiliary Functions.",
            "An Algorithm for Determining Whether the Connectivity of a Graph is at Least k.",
            "Complexity Results for Multiprocessor Scheduling under Resource Constraints.",
            "Proving Theorems with the Modification Method.",
            "Relativizations of the P =? NP Question.",
            "Preserving Proximity in Arrays.",
            "Response Time of a Fixed-Head Disk to Transfers of Variable Length.",
            "The Enumeration of Generalized Double Stochastic Nonnegative Integer Square Matrices.",
            "On Scheduling Chains of Jobs on One Processor with Limited Preemption.",
            "A Convergence Theorem for Hierarchies of Model Neurones.",
            "Network Flow and Testing Graph Connectivity.",
            "A Simple Algorithm for Global Data Flow Analysis Problems.",
            "Evaluating Polynomials at Fixed Sets of Points.",
            "An Elementary Solution of the Queuing System G/G/1."
        ]
    },
    {
        "name": "SICOMP",
        "year": "1974",
        "info": "Volume 3, 1974",
        "count": 26,
        "papers": [
            "The Computing Time of the Euclidean Algorithm.",
            "Stack Replacement Algorithms for Two-Level Directly Addressable Paged Memories.",
            "Picture Skeletons Based on Eccentricities of Points of Minimum Spanning Trees.",
            "On Backtracking: A Combinatorial Description of the Algorithm.",
            "Computing the Weak Components of a Directed Graph.",
            "Finding Dominators in Directed Graphs.",
            "First Order Graph Grammars.",
            "Optimal Binary Search Trees with Restricted Maximal Depth.",
            "Jump PDA's and Hierarchies of Deterministic Context-Free Languages.",
            "Polynomials with Rational Coefficients Which are Hard to Compute.",
            "An Algorithm for the Computation of Linear Forms.",
            "Analysis of a Feedback Scheduler.",
            "Isomorph Rejection on Power Sets.",
            "A Hierarchy Theorem for Polynomial-Space Recognition.",
            "Optimum Communication Spanning Trees.",
            "Polynomial Multiplication, Powers and Asymptotic Analysis: Some Comments.",
            "On Hamiltonian Walks in Graphs.",
            "A Note on the Hecht-Ullman Characterization of Nonreducible Flow Graphs.",
            "On Bounded Right Context Languages and Grammars.",
            "The Number of 1's in Binary Integers: Bounds and Extremal Properties.",
            "Computationally Related Problems.",
            "A Note on Perfect Elimination Digraphs.",
            "Reversal-Bounded Acceptors and Intersections of Linear Languages.",
            "Existence of Graphs with Three Spanning Trees and Given Degree Sequence.",
            "Worst-Case Performance Bounds for Simple One-Dimensional Packing Algorithms.",
            "Erratum: Genetic Algorithms and the Optimal Allocation of Trials."
        ]
    },
    {
        "name": "SICOMP",
        "year": "1973",
        "info": "Volume 2, 1973",
        "count": 26,
        "papers": [
            "The Enumeration of Maximal Cliques of Large Graphs.",
            "The Specialization of Programs by Theorem Proving.",
            "Eulerian Walks in Graphs.",
            "A New Algorithm for Finding all Shortest Paths in a Graph of Positive Arcs in Average Time 0(n2 log2n).",
            "Binary Search Trees of Bounded Balance.",
            "Isomorph Rejection and a Theorem of De Bruijn.",
            "On the Number of Nonscalar Multiplications Necessary to Evaluate Polynomials.",
            "On the Equivalence of Asynchronous Control Structures.",
            "Genetic Algorithms and the Optimal Allocation of Trials.",
            "A Technique for Speeding up LR(k) Parsers.",
            "Transposition Graphs.",
            "Dividing a Graph into Triconnected Components.",
            "Duality Applied to the Complexity of Matrix Multiplication and Other Bilinear Forms.",
            "How to Make Arbitrary Grammars Look Like Context-Free Grammars.",
            "Approximate Models for Processor Utilization in Multiprogrammed Computer Systems.",
            "Finite State Representations of Discrete Optimization Problems.",
            "Enumeration of the Elementary Circuits of a Directed Graph.",
            "Toward Characterization of Perfect Elimination Digraphs.",
            "An n5/2 Algorithm for Maximum Matchings in Bipartite Graphs.",
            "Queueing Analysis of a Multiprogrammed Computer System Having a Multilevel Storage Hierarchy.",
            "Continuous Group Averaging and Pattern Classification Problems.",
            "On Optimal Processor Scheduling for Multiprogramming.",
            "An Algorithm for the Extreme Rays of a Pointed Convex Polyhedral Cone.",
            "Set Merging Algorithms.",
            "The Hardest Context-Free Language.",
            "An Algorithm for Determining the Chromatic Number of a Graph."
        ]
    },
    {
        "name": "SICOMP",
        "year": "1972",
        "info": "Volume 1, 1972",
        "count": 24,
        "papers": [
            "Optimization of Straight Line Programs.",
            "Terminal Context in Context-Sensitive Grammars.",
            "A Simple Algorithm for Merging Two Disjoint Linearly-Ordered Sets.",
            "Symmetries in Data Graphs.",
            "On Classes of Program Schemata.",
            "Some Undecidability Results for Parallel Program Schemata.",
            "The Transitive Reduction of a Directed Graph.",
            "Asymptotic Service System Output, with Application to Multiprogramming.",
            "Depth-First Search and Linear Graph Algorithms.",
            "A Note on Merging.",
            "Computational Complexity of Iterative Processes.",
            "Algorithms for Minimum Coloring, Maximum Clique, Minimum Covering by Cliques, and Maximum Independent Set of a Chordal Graph.",
            "Flow Graph Reducibility.",
            "Expectations of Functions of Sequences over Finite Alphabets with Given Transition Probabilities by Methods Independent of Sequence Length.",
            "Locality in Page Reference Strings.",
            "Program Schemes with Pushdown Stores.",
            "Analysis of Scanning Policies for Reducing Disk Seek Times.",
            "On Languages Accepted in Polynomial Time.",
            "A Note on the Intersection of Complexity Classes of Functions.",
            "Analysis and Synthesis of Sorting Algorithms.",
            "A Minimum Distance Error-Correcting Parser for Context-Free Languages.",
            "Compatibility and Complexity of Refinements of the Resolution Principle.",
            "Real-Time Strict Deterministic Languages.",
            "Infix to Prefix Translation: The Insufficiency of a Pushdown Stack."
        ]
    }
]