[
    {
        "name": "SIDMA",
        "year": "2021",
        "info": "2021: Volume 35",
        "count": 143,
        "papers": [
            "Improved Randomized Algorithm for k-Submodular Function Maximization.",
            "Ramsey Numbers Involving Large Books.",
            "On the Vanishing of Discrete Singular Cubical Homology for Graphs.",
            "Graph Classes and Forbidden Patterns on Three Vertices.",
            "Topological Bounds for Graph Representations over Any Field.",
            "Linear Kernels for Edge Deletion Problems to Immersion-Closed Graph Classes.",
            "Constructing Clustering Transformations.",
            "BCH Codes with Minimum Distance Proportional to Code Length.",
            "Sums, Products, and Dilates on Sparse Graphs.",
            "Counting Linear Extensions of Posets with Determinants of Hook Lengths.",
            "Globally Optimizing Small Codes in Real Projective Spaces.",
            "Transitive Tournament Tilings in Oriented Graphs with Large Minimum Total Degree.",
            "Large Induced Matchings in Random Graphs.",
            "The Size Ramsey Number of Graphs with Bounded Treewidth.",
            "On a Conjecture of Nagy on Extremal Densities.",
            "The Uniformity Conjecture in Additive Combinatorics.",
            "A Note on the Erdös Distinct Subset Sums Problem.",
            "On the Existence of Paradoxical Motions of Generically Rigid Graphs on the Sphere.",
            "Strong Chordality of Graphs with Possible Loops.",
            "Integer Flows and Modulo Orientations of Signed Graphs.",
            "K4-Subdivisions Have the Edge-Erdös-Pósa Property.",
            "Connectivity for Kite-Linked Graphs.",
            "Erdös-Hajnal Properties for Powers of Sparse Graphs.",
            "Lower and Upper Bounds on the Randomness Complexity of Private Computations of AND.",
            "Tournaments and Bipartite Tournaments without Vertex Disjoint Cycles of Different Lengths.",
            "Atomicity and Well Quasi-Order for Consecutive Orderings on Words and Permutations.",
            "Improved Bounds on Sizes of Generalized Caps in AG(n, q).",
            "Large Book-Cycle Ramsey Numbers.",
            "Parameterized Approximation Schemes for Steiner Trees with Small Number of Steiner Vertices.",
            "Parameterized Pre-Coloring Extension and List Coloring Problems.",
            "Packing and Covering Induced Subdivisions.",
            "Geometric Criteria for Realizability of Tensegrities in Higher Dimensions.",
            "Dense Induced Subgraphs of Dense Bipartite Graphs.",
            "Closing Gaps in Asymptotic Fair Division.",
            "Circularly Compatible Ones, D-Circularity, and Proper Circular-Arc Bigraphs.",
            "An Approximation Algorithm for Fully Planar Edge-Disjoint Paths.",
            "Notes on Hazard-Free Circuits.",
            "Fairly Allocating Many Goods with Few Queries.",
            "Gonality Sequences of Graphs.",
            "Kernelization of Graph Hamiltonicity: Proper H-Graphs.",
            "Erdös-Pósa Property for Labeled Minors: 2-Connected Minors.",
            "On Covering Numbers, Young Diagrams, and the Local Dimension of Posets.",
            "An Improved Bound for the Rigidity of Linearly Constrained Frameworks.",
            "Improved Bounds for the Excluded-Minor Approximation of Treedepth.",
            "A Proof of Brouwer's Toughness Conjecture.",
            "Faster Approximation Algorithms for Computing Shortest Cycles on Weighted Graphs.",
            "A Note on Color-Bias Hamilton Cycles in Dense Graphs.",
            "Exponential Sums with Sparse Polynomials over Finite Fields.",
            "Sprinkling a Few Random Edges Doubles the Power.",
            "Number of Hamiltonian Cycles in Planar Triangulations.",
            "Nearly Perfect Matchings in Uniform Hypergraphs.",
            "Extending Drawings of Complete Graphs into Arrangements of Pseudocircles.",
            "A Reciprocity on Finite Abelian Groups Involving Zero-Sum Sequences.",
            "The Cut Metric for Probability Distributions.",
            "Bipartite Independence Number in Graphs with Bounded Maximum Degree.",
            "Sublinear Separators in Intersection Graphs of Convex Shapes.",
            "Minimizing the Number of Edges in K(s, t)-Saturated Bipartite Graphs.",
            "The Effect of Adding Randomly Weighted Edges.",
            "On the Generation of Rank 3 Simple Matroids with an Application to Terao's Freeness Conjecture.",
            "Isometric Universal Graphs.",
            "On the Query Complexity of Estimating the Distance to Hereditary Graph Properties.",
            "On Nonnegative Integer Matrices and Short Killing Words.",
            "Splitting Necklaces, with Constraints.",
            "Perfect Matching Index versus Circular Flow Number of a Cubic Graph.",
            "Kernelization of Whitney Switches.",
            "Minimum Scan Cover with Angular Transition Costs.",
            "On the Highly Connected Dyadic, Near-Regular, and Sixth-Root-of-Unity Matroids.",
            "Phase Transition of the Reconstructability of a General Model with Different In-Community and Out-Community Mutations on an Infinite Tree.",
            "The Recognition Problem of Graph Search Trees.",
            "Covering 3-Edge-Colored Random Graphs with Monochromatic Trees.",
            "All Feedback Arc Sets of a Random Turán Tournament Have $\\lfloor {n}/{k}\\rfloor-{k}+1$ Disjoint k-Cliques (and This Is Tight).",
            "Tomescu's Graph Coloring Conjecture for ℓ-Connected Graphs.",
            "Counting Weighted Independent Sets beyond the Permanent.",
            "Maximum Size Intersecting Families of Bounded Minimum Positive Co-degree.",
            "Normality of the Kimura 3-Parameter Model.",
            "On the Codegree Density of PGm(q).",
            "Lower Bounds for Max-Cut in H-Free Graphs via Semidefinite Programming.",
            "Rainbow Hamilton Cycles in Randomly Colored Randomly Perturbed Dense Graphs.",
            "Majorization and Minimal Energy on Spheres.",
            "On the Stretch Factor of Polygonal Chains.",
            "A Mélange of Diameter Helly-Type Theorems.",
            "Entropy Inequalities for Sums in Prime Cyclic Groups.",
            "Generalized Schur Function Determinants Using the Bazin Identity.",
            "Sublinear Longest Path Transversals.",
            "Inequalities on Projected Volumes.",
            "On the Number of Circuits in Regular Matroids (with Connections to Lattices and Codes).",
            "K2-Hamiltonian Graphs: I.",
            "IC-Planar Graphs Are 6-Choosable.",
            "On the Length of Monotone Paths in Polyhedra.",
            "Vertex Partitions into an Independent Set and a Forest with Each Component Small.",
            "Identifiability of Graphs with Small Color Classes by the Weisfeiler-Leman Algorithm.",
            "Hamiltonicity of Random Graphs in the Stochastic Block Model.",
            "More Applications of the d-Neighbor Equivalence: Acyclicity and Connectivity Constraints.",
            "Rainbow Erdös-Rothschild Problem for the Fano Plane.",
            "Geometry of the Minimal Solutions of a Linear Diophantine Equation.",
            "Saturation Problems about Forbidden 0-1 Submatrices.",
            "Shellings and Sheddings Induced by Collapses.",
            "Parameterized Complexity of Conflict-Free Graph Coloring.",
            "Tight Gaps in the Cycle Spectrum of 3-Connected Planar Graphs.",
            "Parity-Unimodality and a Cyclic Sieving Phenomenon for Necklaces.",
            "On the Probabilistic Degrees of Symmetric Boolean Functions.",
            "Faces of Root Polytopes.",
            "Cycle Extendability of Hamiltonian Strongly Chordal Graphs.",
            "Lower Bounds on Sparse Spanners, Emulators, and Diameter-Reducing Shortcuts.",
            "Closing the Random Graph Gap in Tuza's Conjecture through the Online Triangle Packing Process.",
            "Relative Turán Problems for Uniform Hypergraphs.",
            "List Coloring of Two Matroids through Reduction to Partition Matroids.",
            "Ramsey Goodness of Clique Versus Paths in Random Graphs.",
            "Cubic Graphs with No Short Cycle Covers.",
            "On the Bar Visibility Number of Complete Bipartite Graphs.",
            "Repeated Patterns in Proper Colorings.",
            "How to Secure Matchings against Edge Failures.",
            "Rainbow Odd Cycles.",
            "Combinatorics of Polymer-Based Models of Early Metabolism.",
            "A Strengthening on Odd Cycles in Graphs of Given Chromatic Number.",
            "Semidefinite Programming and Ramsey Numbers.",
            "A Polynomial Time Algorithm for Solving the Closest Vector Problem in Zonotopal Lattices.",
            "Finding Large H-Colorable Subgraphs in Hereditary Graph Classes.",
            "A Deterministic Polynomial Kernel for Odd Cycle Transversal and Vertex Multiway Cut in Planar Graphs.",
            "Longest Paths in Random Hypergraphs.",
            "Bounding the Cop Number of a Graph by Its Genus.",
            "A Structure Theorem for Rooted Binary Phylogenetic Networks and Its Implications for Tree-Based Networks.",
            "On Sequential Basis Exchange in Matroids.",
            "Sufficient Conditions for 2-Dimensional Global Rigidity.",
            "A Note on Group Colorings and Group Structure.",
            "Finding Branch-Decompositions of Matroids, Hypergraphs, and More.",
            "Treewidth versus Clique Number. I. Graph Classes with a Forbidden Structure.",
            "A Complete Multipartite Basis for the Chromatic Symmetric Function.",
            "Market Pricing for Matroid Rank Valuations.",
            "Automatic Generation of FPTASes for Stochastic Monotone Dynamic Programs Made Easier.",
            "Maker-Breaker Games on Randomly Perturbed Graphs.",
            "Counting Homomorphisms to K4-Minor-Free Graphs, Modulo 2.",
            "Fractional Chromatic Number, Maximum Degree, and Girth.",
            "Orientation Ramsey Thresholds for Cycles and Cliques.",
            "Equidistributions around Special Kinds of Descents and Excedances.",
            "Dual Hoffman Bounds for the Stability and Chromatic Numbers Based on Semidefinite Programming.",
            "Tight Cycle Relaxations for the Cut Polytope.",
            "Tree Pivot-Minors and Linear Rank-Width.",
            "Constructing Partial MDS Codes from Reducible Algebraic Curves.",
            "Total Positivity from the Exponential Riordan Arrays.",
            "Superlinear Integrality Gaps for the Minimum Majority Problem.",
            "t-Strong Cliques and the Degree-Diameter Problem.",
            "Nonseparating Cocircuits in Binary Matroids."
        ]
    },
    {
        "name": "SIDMA",
        "year": "2020",
        "info": "2020: Volume 34",
        "count": 133,
        "papers": [
            "Rainbow Cycles in Flip Graphs.",
            "Avoiding Multiple Repetitions in Euclidean Spaces.",
            "Random Graphs with a Fixed Maximum Degree.",
            "A Computer-Assisted Proof of the Barnette-Goodey Conjecture: Not Only Fullerene Graphs Are Hamiltonian.",
            "Refined Vertex Sparsifiers of Planar Graphs.",
            "Improved Guarantees for Vertex Sparsification in Planar Graphs.",
            "The Matroid Secretary Problem for Minor-Closed Classes and Random Matroids.",
            "Local Properties via Color Energy Graphs and Forbidden Configurations.",
            "Short Cycle Covers of Cubic Graphs and Intersecting 5-Circuits.",
            "Global Rigidity of Unit Ball Graphs.",
            "Nonintersecting Ryser Hypergraphs.",
            "The Extremal Number of the Subdivisions of the Complete Bipartite Graph.",
            "Analyzing the Optimal Neighborhood: Algorithms for Partial and Budgeted Connected Dominating Set Problems.",
            "Anti-Ramsey Numbers of Paths and Cycles in Hypergraphs.",
            "Testing for Dense Subsets in a Graph via the Partition Function.",
            "Homomorphism Reconfiguration via Homotopy.",
            "Ramsey Problems for Berge Hypergraphs.",
            "Combinatorics for General Kinetically Constrained Spin Models.",
            "Books versus Triangles at the Extremal Density.",
            "Weighted Games of Best Choice.",
            "Directed Path-Decompositions.",
            "Obstructions for Three-Coloring and List Three-Coloring H-Free Graphs.",
            "A Notion of Total Dual Integrality for Convex, Semidefinite, and Extended Formulations.",
            "Circular Flows in Planar Graphs.",
            "Rainbow Coloring Hardness via Low Sensitivity Polymorphisms.",
            "Fractional Coloring of Planar Graphs of Girth Five.",
            "Turán Numbers of Bipartite Subdivisions.",
            "Finding Submodularity Hidden in Symmetric Difference.",
            "A Dichotomy Theorem for First-Fit Chain Partitions.",
            "On the Minimum Degree Required for a Triangle Decomposition.",
            "A Continuous Family of Marked Poset Polytopes.",
            "Solving Partition Problems Almost Always Requires Pushing Many Vertices Around.",
            "The Impact of Locality in the Broadcast Congested Clique Model.",
            "L-Infinity Optimization to Bergman Fans of Matroids with an Application to Phylogenetics.",
            "Length of the Longest Common Subsequence between Overlapping Words.",
            "On Expressing Majority as a Majority of Majorities.",
            "Sampling in Uniqueness from the Potts and Random-Cluster Models on Random Regular Graphs.",
            "The Second-Moment Phenomenon for Monochromatic Subgraphs.",
            "Sparsification of Binary CSPs.",
            "Enumerating Vertices of Covering Polyhedra with Totally Unimodular Constraint Matrices.",
            "An Improved Analysis of the Mömke-Svensson Algorithm for Graph-TSP on Subquartic Graphs.",
            "Multitasking Capacity: Hardness Results and Improved Constructions.",
            "Efficient Error-Correcting Codes for Sliding Windows.",
            "Large Deviation Theorem for Branches of the Random Binary Tree in the Horton-Strahler Analysis.",
            "On the Profile of Multiplicities of Complete Subgraphs.",
            "Scattered Classes of Graphs.",
            "Erratum for \"On the Inequalities of Projected Volumes and the Constructible Region\".",
            "On a Ramsey-Turán Variant of the Hajnal-Szemerédi Theorem.",
            "Finite Automata, Probabilistic Method, and Occurrence Enumeration of a Pattern in Words and Permutations.",
            "Almost Envy-Freeness with General Valuations.",
            "Upper Tails for Edge Eigenvalues of Random Graphs.",
            "Parameterized (Approximate) Defective Coloring.",
            "Clique-Width for Graph Classes Closed under Complementation.",
            "Set-Codes with Small Intersections and Small Discrepancies.",
            "Monomial Tropical Cones for Multicriteria Optimization.",
            "Minimum T-Joins and Signed-Circuit Covering.",
            "Infinitesimal Rigidity in Normed Planes.",
            "On the Bias of Reed-Muller Codes over Odd Prime Fields.",
            "Angle-Restricted Sets and Zero-Free Regions for the Permanent.",
            "Levelness of Order Polytopes.",
            "Lattice Points in the Newton Polytopes of Key Polynomials.",
            "A Conjecture of Verstraëte on Vertex-Disjoint Cycles.",
            "Path Contraction Faster than 2n.",
            "Regular Behavior of the Maximal Hypergraph Chromatic Number.",
            "LP Relaxation and Tree Packing for Minimum k-Cut.",
            "Extremal Graphs with Local Covering Conditions.",
            "Cops and Robbers on Graphs of Bounded Diameter.",
            "Odd Multiway Cut in Directed Acyclic Graphs.",
            "Tight Analysis of the Smartstart Algorithm for Online Dial-a-Ride on the Line.",
            "Complexity of Two-dimensional Bootstrap Percolation Difficulty: Algorithm and NP-Hardness.",
            "Partitioning Edge-Colored Hypergraphs into Few Monochromatic Tight Cycles.",
            "On the Maximum Weight Independent Set Problem in Graphs without Induced Cycles of Length at Least Five.",
            "The Turán Number of Berge-K4 in 3-Uniform Hypergraphs.",
            "Sparse Hypergraphs with Applications to Coding Theory.",
            "When Do Envy-Free Allocations Exist?",
            "The Unbreakable Frame Matroids.",
            "Finer Tight Bounds for Coloring on Clique-Width.",
            "Upper Tail Bounds for Cycles.",
            "Going Far from Degeneracy.",
            "Minimal Cohen-Macaulay Simplicial Complexes.",
            "Erdös-Pósa from Ball Packing.",
            "Order-Isomorphic Twins in Permutations.",
            "Hitting Minors on Bounded Treewidth Graphs. I. General Upper Bounds.",
            "Breaking 1 - 1/e Barrier for Nonpreemptive Throughput Maximization.",
            "A Rainbow Dirac's Theorem.",
            "Minor-Closed Graph Classes with Bounded Layered Pathwidth.",
            "Min-Orderable Digraphs.",
            "Sparse Graphs Are Near-Bipartite.",
            "Birkhoff-von Neumann Graphs that are PM-Compact.",
            "Dynamic Balanced Graph Partitioning.",
            "t-Wise Berge and t-Heavy Hypergraphs.",
            "k-Arrangements, Statistics, and Patterns.",
            "Tight Hardness Results for Consensus Problems on Circular Strings and Time Series.",
            "Ramsey Goodness of Cycles.",
            "Subgroup Perfect Codes in Cayley Graphs.",
            "Extremal Theory of Locally Sparse Multigraphs.",
            "Invariants of Rational Links Represented by Reduced Alternating Diagrams.",
            "Bipartite Analogues of Comparability and Cocomparability Graphs.",
            "Growth in Some Finite Three-Dimensional Matrix Groups.",
            "Color Isomorphic Even Cycles and a Related Ramsey Problem.",
            "A Short Note on Open-Neighborhood Conflict-Free Colorings of Graphs.",
            "Few Sequence Pairs Suffice: Representing All Rectangle Placements.",
            "Subcritical Random Hypergraphs, High-Order Components, and Hypertrees.",
            "Resolvability of Hamming Graphs.",
            "Rerouting Flows when Links Fail.",
            "Maximum and Minimum Degree Conditions for Embedding Trees.",
            "Bounds of Trilinear and Trinomial Exponential Sums.",
            "(3a: a)-List-Colorability of Embedded Graphs of Girth at Least Five.",
            "Flows on Signed Graphs without Long Barbells.",
            "Minimum Violation Vertex Maps and Their Applications to Cut Problems.",
            "Erdös-Falconer Distance Problem under Hamming Metric in Vector Spaces over Finite Fields.",
            "Progress on the Adjacent Vertex Distinguishing Edge Coloring Conjecture.",
            "Improved Bound for Tomaszewski's Problem.",
            "Coloring Hypergraphs Defined by Stabbed Pseudo-Disks and ABAB-Free Hypergraphs.",
            "A Ramsey Theorem for Biased Graphs.",
            "Near-Linear Time Algorithm for n-Fold ILPs via Color Coding.",
            "Binary Linear Codes with Near-Extremal Maximum Distance.",
            "Efficiently Realizing Interval Sequences.",
            "New Turán Exponents for Two Extremal Hypergraph Problems.",
            "Anti-Ramsey Number of Edge-Disjoint Rainbow Spanning Trees.",
            "A Parametric Version of LLL and Some Consequences: Parametric Shortest and Closest Vector Problems.",
            "Counting Partitions inside a Rectangle.",
            "Repeated Minimizers of p-Frame Energies.",
            "Hajós-Type Constructions and Neighborhood Complexes.",
            "On Generalized Perfect Difference Sumsets.",
            "A Topologically Complete Theory of Weaving.",
            "On the Voronoi Conjecture for Combinatorially Voronoi Parallelohedra in Dimension 5.",
            "The Spherical Kakeya Problem in Finite Fields.",
            "Solutions to the Minimum Variance Problem Using Delaunay Triangulation.",
            "Large Homogeneous Submatrices.",
            "A Large Gap in a Dilate of a Set.",
            "On the Number of Cliques in Graphs with a Forbidden Subdivision or Immersion.",
            "Erratum: The Bollobás-Scott Conjecture for 4-Uniform Hypergraphs."
        ]
    },
    {
        "name": "SIDMA",
        "year": "2019",
        "info": "2019: Volume 33",
        "count": 120,
        "papers": [
            "On the Circuit Diameter of Some Combinatorial Polytopes.",
            "The Highly Connected Even-Cycle and Even-Cut Matroids.",
            "The Maker-Breaker Rado Game on a Random Set of Integers.",
            "The Zero Forcing Number of Graphs.",
            "Adjacency Labeling Schemes and Induced-Universal Graphs.",
            "A Matroid Extension Result.",
            "Independent Sets in Hypergraphs and Ramsey Properties of Graphs and the Integers.",
            "Proof of a Conjecture of Reiner-Tenner-Yong on Barely Set-Valued Tableaux.",
            "Three-Color Bipartite Ramsey Number for Graphs with Small Bandwidth.",
            "Decompositions of Edge-Colored Digraphs: A New Technique in the Construction of Constant-Weight Codes and Related Families.",
            "On Tight Cycles in Hypergraphs.",
            "Modifying Maiorana-McFarland Type Bent Functions for Good Cryptographic Properties and Efficient Implementation.",
            "Curvature and Higher Order Buser Inequalities for the Graph Connection Laplacian.",
            "On the Number of Unknot Diagrams.",
            "Parameterized Single-Exponential Time Polynomial Space Algorithm for Steiner Tree.",
            "On the Block Number of Graphs.",
            "On a Generalization of Spikes.",
            "On the Number of Biased Graphs.",
            "The Turán Number of Berge K_4 in Triple Systems.",
            "Disjoint Odd Cycles in Cubic Solid Bricks.",
            "A Note on Large H-Intersecting Families.",
            "Sum-Free Sets of Integers with a Forbidden Sum.",
            "On Rectangular Unimodular Matrices over the Algebraic Integers.",
            "Packing Arborescences in Random Digraphs.",
            "Approximation Algorithms for Low-Distortion Embeddings into Low-Dimensional Spaces.",
            "Embedding Graphs Having Ore-Degree at Most Five.",
            "On the Complexity of Closest Pair via Polar-Pair of Point-Sets.",
            "Pattern Colored Hamilton Cycles in Random Graphs.",
            "Some Results on Chromatic Number as a Function of Triangle Count.",
            "Two Conjectures in Ramsey-Turán Theory.",
            "Listing Maximal Subgraphs Satisfying Strongly Accessible Properties.",
            "Acyclic Edge-Coloring of Planar Graphs: Δ Colors Suffice When Δ is Large.",
            "Induced Universal Hypergraphs.",
            "A Local Approach to the Erdös-Sós Conjecture.",
            "Self-Predicting Boolean Functions.",
            "On the Inequalities of Projected Volumes and the Constructible Region.",
            "An Optimization Parameter for Seriation of Noisy Data.",
            "Hypercontractivity of Spherical Averages in Hamming Space.",
            "Nonunique Lifting of Integer Variables in Minimal Inequalities.",
            "Shatter Functions with Polynomial Growth Rates.",
            "Editing to Connected F-Degree Graph.",
            "An Upper Bound for Weak Bk-Sets.",
            "Rollercoasters: Long Sequences without Short Runs.",
            "Hypergraphs Not Containing a Tight Tree with a Bounded Trunk.",
            "Square-Free Graphs with No Six-Vertex Induced Path.",
            "Orthogonal Symmetric Chain Decompositions of Hypercubes.",
            "Circuit Covers of Signed Eulerian Graphs.",
            "A Spacial Gradient Estimate for Solutions to the Heat Equation on Graphs.",
            "Maximal Spanning Time for Neighborhood Growth on the Hamming Plane.",
            "Distance-Uniform Graphs with Large Diameter.",
            "The Complexity of Counting Surjective Homomorphisms and Compactions.",
            "An Improved Sum-Product Bound for Quaternions.",
            "Complete Description of Matching Polytopes with One Linearized Quadratic Term for Bipartite Graphs.",
            "(2P2, K4)-Free Graphs are 4-Colorable.",
            "Submodular Maximization with Uncertain Knapsack Capacity.",
            "Counting Perfect Matchings and the Switch Chain.",
            "On Online Labeling with Large Label Set.",
            "Packing Cycles Faster Than Erdos-Posa.",
            "A Random Variant of the Game of Plates and Olives.",
            "The Hilton-Zhao Conjecture is True for Graphs with Maximum Degree 4.",
            "An Assmus-Mattson Theorem for Rank Metric Codes.",
            "Closing in on Hill's Conjecture.",
            "Rank Vertex Cover as a Natural Problem for Algebraic Compression.",
            "2-Distance Coloring of Planar Graphs without 4-Cycles and 5-Cycles.",
            "Kissing Numbers and Transference Theorems from Generalized Tail Bounds.",
            "The (2, 2) and (4, 3) Properties in Families of Fat Sets in the Plane.",
            "On the Expansion of Group-Based Lifts.",
            "On the Cover Time of Dense Graphs.",
            "Extension to 3-Colorable Triangulations.",
            "Fractional Coloring Methods with Applications to Degenerate Graphs and Graphs on Surfaces.",
            "Pareto Stable Matchings under One-Sided Matroid Constraints.",
            "Maximizing a Monotone Submodular Function with a Bounded Curvature under a Knapsack Constraint.",
            "Hypergraphs with Few Berge Paths of Fixed Length between Vertices.",
            "On Mergings in Acyclic Directed Graphs.",
            "Spanning Trees with Few Branch Vertices.",
            "Degree Conditions for Embedding Trees.",
            "A Tight Kernel for Computing the Tree Bisection and Reconnection Distance between Two Phylogenetic Trees.",
            "Rigid Colorings of Hypergraphs and Contiguity.",
            "Distance-Preserving Graph Contractions.",
            "The Slack Realization Space of a Polytope.",
            "A Short Derivation of the Structure Theorem for Graphs with Excluded Topological Minors.",
            "Interlocked Permutations.",
            "Packing Paths in Steiner Triple Systems.",
            "On k-Neighbor Separated Permutations.",
            "Matroidal Choice Functions.",
            "The Tropical Cayley-Menger Variety.",
            "Lossy Kernels for Connected Dominating Set on Sparse Graphs.",
            "Superlogarithmic Cliques in Dense Inhomogeneous Random Graphs.",
            "Book Embedding of Graphs on the Projective Plane.",
            "Edge Correlations in Random Regular Hypergraphs and Applications to Subgraph Testing.",
            "Representation Complexities of SemiAlgebraic Graphs.",
            "Balanced Judicious Bipartition is Fixed-Parameter Tractable.",
            "Tight Minimum Degree Condition for the Existence of Loose Cycle Tilings in 3-Graphs.",
            "A Characterization of Undirected Graphs Admitting Optimal Cost Shares.",
            "Dirac's Condition for Spanning Halin Subgraphs.",
            "Stability Results for Two Classes of Hypergraphs.",
            "A Degree Sequence Komlós Theorem.",
            "A Robust AFPTAS for Online Bin Packing with Polynomial Migration.",
            "The Parameterized Complexity of Finding a 2-Sphere in a Simplicial Complex.",
            "Flipping Out with Many Flips: Hardness of Testing k-Monotonicity.",
            "Trace of Products in Finite Fields from a Combinatorial Point of View.",
            "Higher Dimensional Lattice Walks: Connecting Combinatorial and Analytic Behavior.",
            "Monochromatic Schur Triples in Randomly Perturbed Dense Sets of Integers.",
            "Outerstring Graphs are χ-Bounded.",
            "On the Second Largest Component of Random Hyperbolic Graphs.",
            "Hedetniemi's Conjecture and Strongly Multiplicative Graphs.",
            "Paths in Hypergraphs: A Rescaling Phenomenon.",
            "Sublinear Time Estimation of Degree Distribution Moments: The Arboricity Connection.",
            "On e-Positivity and e-Unimodality of Chromatic Quasi-symmetric Functions.",
            "Bounds on the Expected Size of the Maximum Agreement Subtree for a Given Tree Shape.",
            "Finding Detours is Fixed-Parameter Tractable.",
            "Partite Saturation of Complete Graphs.",
            "Many H-Copies in Graphs with a Forbidden Tree.",
            "Rotor Walks on Transient Graphs and the Wired Spanning Forest.",
            "Gelfand-Tsetlin Polytopes: A Story of Flow and Order Polytopes.",
            "The Typical Structure of Gallai Colorings and Their Extremal Graphs.",
            "On the Number of Vertex-Disjoint Cycles in Digraphs.",
            "Characterizing the Integrality Gap of the Subtour LP for the Circulant Traveling Salesman Problem.",
            "New Upper Bounds for Equiangular Lines by Pillar Decomposition.",
            "Optimal Binary Linear Locally Repairable Codes with Disjoint Repair Groups."
        ]
    },
    {
        "name": "SIDMA",
        "year": "2018",
        "info": "2018: Volume 32",
        "count": 150,
        "papers": [
            "A Lower Bound Technique for Triangulations of Simplotopes.",
            "Mod (2p+1)-Orientation on Bipartite Graphs and Complementary Graphs.",
            "Approximation Algorithms for Stochastic and Risk-Averse Optimization.",
            "Generalized Permutohedra from Probabilistic Graphical Models.",
            "Fine Structure of 4-Critical Triangle-Free Graphs III. General Surfaces.",
            "A Super-Set of Patterson-Wiedemann Functions: Upper Bounds and Possible Nonlinearities.",
            "K4-Minor-Free Induced Subgraphs of Sparse Connected Graphs.",
            "Uniquely Restricted Matchings in Interval Graphs.",
            "Parametrizing an Integer Linear Program by an Integer.",
            "A Combinatorial Approach to the Symmetry of q, t-Catalan Numbers.",
            "Four Edge-Independent Spanning Trees.",
            "Pyramids Over Regular 3-Tori.",
            "On the Number of Cycles in a Graph with Restricted Cycle Lengths.",
            "Two Remarks on Eventown and Oddtown Problems.",
            "Coloring Graphs with Two Odd Cycle Lengths.",
            "Packing k-Matchings and k-Critical Graphs.",
            "Sublinear Bounds for a Quantitative Doignon-Bell-Scarf Theorem.",
            "Intersecting Families in Symmetric Unions of Direct Products of Set Families.",
            "On Rainbow Matchings for Hypergraphs.",
            "On Directed 2-factors in Digraphs and 2-factors Containing Perfect Matchings in Bipartite Graphs.",
            "Infinite Sidon Sets Contained in Sparse Random Sets of Integers.",
            "Large Induced Subgraphs with k Vertices of Almost Maximum Degree.",
            "A New Algorithm for Enumeration of Cells of Hyperplane Arrangements and a Comparison with Avis and Fukuda's Reverse Search.",
            "Stanley's Lemma and Multiple Theta Functions.",
            "The Bollobás-Scott Conjecture for 4-Uniform Hypergraphs.",
            "Almost Perfect Matchings in k-Partite k-Graphs.",
            "Additive Bases and Flows in Graphs.",
            "The Geodetic Hull Number is Hard for Chordal Graphs.",
            "Perfect Codes in Cayley Graphs.",
            "Making Bipartite Graphs DM-Irreducible.",
            "Fair Division and Generalizations of Sperner- and KKM-type Results.",
            "Finding and Using Expanders in Locally Sparse Graphs.",
            "Sensitivity of Mixing Times in Eulerian Digraphs.",
            "Fractals for Kernelization Lower Bounds.",
            "Revisiting Decomposition by Clique Separators.",
            "The Evolution of Random Graphs on Surfaces.",
            "NU Polymorphisms on Reflexive Digraphs.",
            "On the Optimality of the FCC Lattice for Soft Sphere Packing.",
            "Lozenge Tilings of a Halved Hexagon with an Array of Triangles Removed from the Boundary.",
            "Incidence Results and Bounds Of Trilinear and Quadrilinear Exponential Sums.",
            "Vertex Folkman Numbers and the Minimum Degree of Minimal Ramsey Graphs.",
            "Orthogonal Tree Decompositions of Graphs.",
            "Line Percolation in Finite Projective Planes.",
            "Generalized Pseudoforest Deletion: Algorithms and Uniform Kernel.",
            "Bounding the Order of a Graph Using Its Diameter and Metric Dimension: A Study Through Tree Decompositions and VC Dimension.",
            "On Perfect Matchings and Tilings in Uniform Hypergraphs.",
            "3-Uniform Hypergraphs and Linear Cycles.",
            "Odd Holes in Bull-Free Graphs.",
            "Signed Graphs: From Modulo Flows to Integer-Valued Flows.",
            "Matrix Rigidity from the Viewpoint of Parameterized Complexity.",
            "Enumerating Projections of Integer Points in Unbounded Polyhedra.",
            "Edge Conflicts do not Determine Geodesics in the Associahedron.",
            "Kneser Ranks of Random Graphs and Minimum Difference Representations.",
            "Lollipop and Lariat Symmetric Functions.",
            "Algebraic Properties of Generalized Graph Laplacians: Resistor Networks, Critical Groups, and Homological Algebra.",
            "3-Colorable Subclasses of P8-Free Graphs.",
            "A Characterization of Graphic Matroids Based on Circuit Orderings.",
            "Doubly Exponentially Many Ingleton Matroids.",
            "Codegree Turán Density of Complete r-Uniform Hypergraphs.",
            "The Stripping Process Can be Slow: Part II.",
            "Exact and Fixed Parameter Tractable Algorithms for Max-Conflict-Free Coloring in Hypergraphs.",
            "Characterization of Cycle Obstruction Sets for Improper Coloring Planar Graphs.",
            "Tropical Fermat-Weber Points.",
            "Frames, A-Paths, and the Erdös-Pósa Property.",
            "Rainbow Saturation and Graph Capacities.",
            "Local Testing of Lattices.",
            "On Symmetric But Not Cyclotomic Numerical Semigroups.",
            "Spanning Rigid Subgraph Packing and Sparse Subgraph Covering.",
            "On the Diameter of Hyperbolic Random Graphs.",
            "Online Coloring and L(2, 1)-Labeling of Unit Disk Intersection Graphs.",
            "Codimension Two and Three Kneser Transversals.",
            "Improved Bound on the Maximum Number of Clique-Free Colorings with Two and Three Colors.",
            "On Double-Resolution Imaging and Discrete Tomography.",
            "Sparse Graphs of High Gonality.",
            "Ollivier-Ricci Idleness Functions of Graphs.",
            "A Simpler Self-reduction Algorithm for Matroid Path-Width.",
            "On the Secrecy Gain of ℓ-Modular Lattices.",
            "The Densest k-Subhypergraph Problem.",
            "On Two Unsolved Problems Concerning Matching Covered Graphs.",
            "Packing Directed Hamilton Cycles Online.",
            "Dual Techniques for Scheduling on a Machine with Varying Speed.",
            "From Acute Sets to Centrally Symmetric 2-Neighborly Polytopes.",
            "Rainbow Matchings in Properly Colored Multigraphs.",
            "Elegantly Colored Paths and Cycles in Edge Colored Random Graphs.",
            "Kernelization of Cycle Packing with Relaxed Disjointness Constraints.",
            "MaxMinSum Steiner Systems for Access Balancing in Distributed Storage.",
            "On the Fine-Grained Complexity of Rainbow Coloring.",
            "On the Number of Distinct Rows of a Matrix with Bounded Subdeterminants.",
            "Expanding Generating Sets for Solvable Permutation Groups.",
            "Constructing Permutation Rational Functions from Isogenies.",
            "Delta Minors, Delta Free Clutters, and Entanglement.",
            "Fine Structure of 4-Critical Triangle-Free Graphs I. Planar Graphs with Two Triangles and 3-Colorability of Chains.",
            "A Randomized Polynomial Kernelization for Vertex Cover with a Smaller Parameter.",
            "On a Discrete Brunn-Minkowski Type Inequality.",
            "On 2-Level Polytopes Arising in Combinatorial Settings.",
            "The Corners of Core Partitions.",
            "Growing Half-Balls: Minimizing Storage and Communication Costs in Content Delivery Networks.",
            "Finite Dynamical Systems, Hat Games, and Coding Theory.",
            "Six New Classes of Permutation Trinomials over 픽2n.",
            "Deciding Parity of Graph Crossing Number.",
            "Phase Transitions in Random Dyadic Tilings and Rectangular Dissections.",
            "Positivity of Iterated Sequences of Polynomials.",
            "The Excess Degree of a Polytope.",
            "Leaf-Reconstructibility of Phylogenetic Networks.",
            "Optimization over Degree Sequences.",
            "The Crossing Number of the Cone of a Graph.",
            "Cubic TSP: A 1.3-Approximation.",
            "The Distribution of Minimum-Weight Cliques and Other Subgraphs in Graphs with Random Edge Weights.",
            "Constant Congestion Routing of Symmetric Demands in Planar Directed Graphs.",
            "On the VC-Dimension of Binary Codes.",
            "On the Size-Ramsey Number of Tight Paths.",
            "Deterministic Random Walks for Rapidly Mixing Chains.",
            "Connectivity of the k-Out Hypercube.",
            "On a Question of Erdös and Faudree on the Size Ramsey Numbers.",
            "A Bound on the Shannon Capacity via a Linear Programming Variation.",
            "Counting Blanks in Polygonal Arrangements.",
            "Approximation and Kernelization for Chordal Vertex Deletion.",
            "A Tight Erdös-Pósa Function for Wheel Minors.",
            "Stability of the Potential Function.",
            "Below All Subsets for Minimal Connected Dominating Set.",
            "Anagram-Free Colorings of Graph Subdivisions.",
            "On Mubayi's Conjecture and Conditionally Intersecting Sets.",
            "Avoiding Two Consecutive Blocks of Same Size and Same Sum over ℤ2.",
            "Discordant Voting Processes on Finite Graphs.",
            "Symbolic Trisection Polynomials for Genus 2 Curves in Odd Characteristic.",
            "Unbounded Discrepancy of Deterministic Random Walks on Grids.",
            "On a Conjecture of Erdös about Sets without k Pairwise Coprime Integers.",
            "Coloring and Covering Nowhere Dense Graphs.",
            "Bishellable drawings of Kn.",
            "Dimension-Free Lp-Maximal Inequalities for Spherical Means in the Hypercube.",
            "Covering Vectors by Spaces: Regular Matroids.",
            "High Dimensional Consistent Digital Segments.",
            "Rigidity of Frameworks on Expanding Spheres.",
            "Structured Connectivity Augmentation.",
            "Some Halting Problems for Abelian Sandpiles Are Undecidable in Dimension Three.",
            "Extremal Problems on the Hypercube and the Codegree Turán Density of Complete r-Graphs.",
            "Conflict-Free Coloring of Graphs.",
            "Relating Graph Thickness to Planar Layers and Bend Complexity.",
            "Approximation Schemes for Capacitated Geometric Network Design.",
            "Computing Weighted Strength and Applications to Partitioning.",
            "Every 4-Connected Graph with Crossing Number 2 is Hamiltonian.",
            "Semi-Baxter and Strong-Baxter: Two Relatives of the Baxter Sequence.",
            "A Linear-Time Algorithm for Maximum-Cardinality Matching on Cocomparability Graphs.",
            "Finite Field Kakeya and Nikodym Sets in Three Dimensions.",
            "The Symmetry of Littlewood-Richardson Coefficients: A New Hive Model Involutory Bijection.",
            "K5--Subdivision in 4-Connected Graphs.",
            "Short Monadic Second Order Sentences about Sparse Random Graphs.",
            "Optimal Control for Diffusions on Graphs.",
            "A Generalization of the Goresky-Klapper Conjecture, Part I.",
            "Corrigendum: Orthogonal Tree Decompositions of Graphs."
        ]
    },
    {
        "name": "SIDMA",
        "year": "2017",
        "info": "2017: Volume 31",
        "count": 132,
        "papers": [
            "The Space of Circular Planar Electrical Networks.",
            "Push is Fast on Sparse Random Graphs.",
            "Sufficient Conditions for Graphicality of Bidegree Sequences.",
            "The Minimal Hitting Set Generation Problem: Algorithms and Computation.",
            "Power of Preemption for Minimizing Total Completion Time on Uniform Parallel Machines.",
            "Small Dense Subgraphs of a Graph.",
            "One-Point Concentration of the Clique and Chromatic Numbers of the Random Cayley Graph on 픽2.",
            "Bounded-Degree Spanning Trees in Randomly Perturbed Graphs.",
            "The Complexity of the Partial Order Dimension Problem: Closing the Gap.",
            "Eulerian Circuits with No Monochromatic Transitions in Edge-Colored Digraphs with all Vertices of Outdegree Three.",
            "A Linear Time Algorithm for the 1-Fixed-Endpoint Path Cover Problem on Interval Graphs.",
            "On the Number of Neighbors in Normal Tiling.",
            "Templates for Binary Matroids.",
            "Locally Stable Marriage with Strict Preferences.",
            "Allowed Patterns of Symmetric Tent Maps via Commuter Functions.",
            "Partition Constrained Covering of a Symmetric Crossing Supermodular Function by a Graph.",
            "On Degree Sequences Forcing The Square of a Hamilton Cycle.",
            "The Excluded Minors for Isometric Realizability in the Plane.",
            "Minimum Cuts and Shortest Cycles in Directed Planar Graphs via Noncrossing Shortest Paths.",
            "A Power-of-Two-Choices Unbalanced Allocation Process.",
            "Minimum Cost Matching in a Random Graph with Random Costs.",
            "The Parameterized Complexity of Graph Cyclability.",
            "Dichotomy Results on the Hardness of H-free Edge Modification Problems.",
            "Covering the Large Spectrum and Generalized Riesz Products.",
            "Maximizing Barrier Coverage Lifetime with Mobile Sensors.",
            "Phase Transitions for the Uniform Distribution in the Pattern Maximum Likelihood Problem and its Bethe Approximation.",
            "Toward a 6/5 Bound for the Minimum Cost 2-Edge Connected Spanning Subgraph.",
            "Erratum: Constructing Optimal k-Radius Sequences.",
            "On the Push&Pull Protocol for Rumor Spreading.",
            "Total Weight Choosability of Trees.",
            "Spotting Trees with Few Leaves.",
            "Unavoidable Subtournaments in Large Tournaments with No Homogeneous Sets.",
            "List-Coloring Claw-Free Graphs with Δ-1 Colors.",
            "An Inequality for Gaussians on Lattices.",
            "A 4n-Point Elliptic Interpolation Formula and its Applications.",
            "Packing Edge-Disjoint Odd Eulerian Subgraphs Through Prescribed Vertices in 4-Edge-Connected Graphs.",
            "H-Representation of the Kimura-3 Polytope for the m-Claw Tree.",
            "Extremal Bases for Finite Cyclic Groups.",
            "Structure of Graphs with Locally Restricted Crossings.",
            "A Primal-Dual Approximation Algorithm for Min-Sum Single-Machine Scheduling Problems.",
            "When Can Splits be Drawn in the Plane?",
            "Bichromatic Lines in the Plane.",
            "Fine Structure of 4-Critical Triangle-Free Graphs II. Planar Triangle-Free Graphs with Two Precolored 4-Cycles.",
            "L-Infinity Optimization to Linear Spaces and Phylogenetic Trees.",
            "On Dominating Even Subgraphs in Cubic Graphs.",
            "New Bounds for Equiangular Lines and Spherical Two-Distance Sets.",
            "Brenti's Open Problem on the Real-Rootedness of q-Eulerian Polynomials of Type D.",
            "Covering Radius of Matrix Codes Endowed with the Rank Metric.",
            "The Approximate Loebl-Komlós-Sós Conjecture I: The Sparse Decomposition.",
            "The Approximate Loebl-Komlós-Sós Conjecture II: The Rough Structure of LKS Graphs.",
            "The Approximate Loebl-Komlós-Sós Conjecture III: The Finer Structure of LKS Graphs.",
            "The Approximate Loebl-Komlós-Sós Conjecture IV: Embedding Techniques and the Proof of the Main Result.",
            "A Tutte-Type Characterization for Graph Factors.",
            "Walksat Stalls Well Below Satisfiability.",
            "A Census of Plane Graphs with Polyline Edges.",
            "Combinatorial Algorithms for Minimizing the Maximum Laplacian and Signless Laplacian Eigenvalues of Weighted Graphs.",
            "Metric Dimension of Bounded Tree-length Graphs.",
            "Deciding Orthogonality in Construction-A Lattices.",
            "Sparsification of Two-Variable Valued Constraint Satisfaction Problems.",
            "Upper Bounds on the Size of Covering Arrays.",
            "Parameterized Complexity of Directed Steiner Tree on Sparse Graphs.",
            "On Treewidth and Related Parameters of Random Geometric Graphs.",
            "Large Independent Sets in Triangle-Free Planar Graphs.",
            "Almost Partitioning a 3-Edge-Colored Kn, n into Five Monochromatic Cycles.",
            "Bounding the Optimal Rate of the ICSI and ICCSI problem.",
            "Algebraic Combinatorics on Trace Monoids: Extending Number Theory to Walks on Graphs.",
            "Quasi-Cyclic Subcodes of Cyclic Codes.",
            "Packing a Knapsack of Unknown Capacity.",
            "An Asymptotic Multipartite Kühn-Osthus Theorem.",
            "Duality Theorems for Blocks and Tangles in Graphs.",
            "Refining a Tree-Decomposition which Distinguishes Tangles.",
            "Inapproximability of H-Transversal/Packing.",
            "Hadwiger's Conjecture for Graphs with Forbidden Holes.",
            "Hitting Selected (Odd) Cycles.",
            "t-Perfection in P5-Free Graphs.",
            "Diagonal Ramsey Numbers of Loose Cycles in Uniform Hypergraphs.",
            "Coloring Jordan Regions and Curves.",
            "Prophet Secretary.",
            "Number of Fixed Points and Disjoint Cycles in Monotone Boolean Networks.",
            "Representation of Large Matchings in Bipartite Graphs.",
            "Inducibility in Binary Trees and Crossings in Random Tanglegrams.",
            "Who Can Win a Single-Elimination Tournament?",
            "Similarity-First Search: A New Algorithm with Application to Robinsonian Matrix Recognition.",
            "Popular Matchings with Ties and Matroid Constraints.",
            "Two-Connected Spanning Subgraphs with at Most $\\frac{10}{7}{OPT}$ Edges.",
            "Plane Graphs without 4- and 5-Cycles and without Ext-Triangular 7-Cycles are 3-Colorable.",
            "On Two Problems in Ramsey-Turán Theory.",
            "Optimal Monotone Drawings of Trees.",
            "Variations on the Sum-Product Problem II.",
            "Improved Lower Bounds for Kissing Numbers in Dimensions 25 through 31.",
            "Group Connectivity, Strongly Z_m-Connectivity, and Edge Disjoint Spanning Trees.",
            "Odd Decompositions of Eulerian Graphs.",
            "Nowhere-Zero Flows on Signed Eulerian Graphs.",
            "Hook Formulas for Skew Shapes II. Combinatorial Proofs and Enumerative Applications.",
            "Extremal and Degree Conditions for Path Extendability in Digraphs.",
            "Convexity in Tree Spaces.",
            "Short Fans and the 5/6 Bound for Line Graphs.",
            "Bounds for Entries of γ-Vectors of Flag Homology Spheres.",
            "On some Multicolor Ramsey Properties of Random Graphs.",
            "The Poset of Proper Divisibility.",
            "Strong Spatial Mixing in Homomorphism Spaces.",
            "Uniformity of Point Samples in Metric Spaces Using Gap Ratio.",
            "Partial Vertex Cover and Budgeted Maximum Coverage in Bipartite Graphs.",
            "Shortest Reconfiguration Paths in the Solution Space of Boolean Formulas.",
            "Planar Digraphs of Digirth Four are 2-Colorable.",
            "Sparse Spanning k-Connected Subgraphs in Tournaments.",
            "Convergence and Correctness of Max-Product Belief Propagation for Linear Programming.",
            "The Smith Normal Form Distribution of A Random Integer Matrix.",
            "Improved Bounds on Sidon Sets via Lattice Packings of Simplices.",
            "Binarisation for Valued Constraint Satisfaction Problems.",
            "An Algorithmic Regularity Lemma for Lp Regular Sparse Matrices.",
            "Extremal Results for Berge Hypergraphs.",
            "Loose Hamiltonian Cycles Forced by Large (k-2)-Degree - Approximate Version.",
            "Popular Matchings with Two-Sided Preferences and One-Sided Ties.",
            "Two Double Poset Polytopes.",
            "Rumors Spread Slowly in a Small-World Spatial Network.",
            "Plane Triangulations Without a Spanning Halin Subgraph II.",
            "Maximum Minimal Vertex Cover Parameterized by Vertex Cover.",
            "Conformal Decomposition of Integral Tensions and Potentials of Signed Graphs.",
            "Constructive Packings of Triple Systems.",
            "Broadcast Transmission to Prioritizing Receivers.",
            "The Minimum Distance of Some Narrow-Sense Primitive BCH Codes.",
            "Quasisymmetric Functions for Nestohedra.",
            "Valid Plane Trees: Combinatorial Models for RNA Secondary Structures with Watson-Crick Base Pairs.",
            "Steiner Triple Systems with High Chromatic Index.",
            "On Ranks of Regular Polygons.",
            "Bi-Covering: Covering Edges with Two Small Subsets of Vertices.",
            "A Rainbow Erdös-Rothschild Problem.",
            "The Configuration Space of a Robotic Arm in a Tunnel.",
            "Graph Information Ratio.",
            "Prestress Stability of Triangulated Convex Polytopes and Universal Second-Order Rigidity.",
            "Planar Posets Have Dimension at Most Linear in Their Height."
        ]
    },
    {
        "name": "SIDMA",
        "year": "2016",
        "info": "2016: Volume 30",
        "count": 123,
        "papers": [
            "A Random Triadic Process.",
            "Domination Game: A proof of the 3/5-Conjecture for Graphs with Minimum Degree at Least Two.",
            "Fractional Triangle Decompositions in Graphs with Large Minimum Degree.",
            "Linear-Time Algorithms for Finding Tucker Submatrices and Lekkerkerker-Boland Subgraphs.",
            "Closedness of Integer Hulls of Simple Conic Sets.",
            "Pipe Dream Complexes and Triangulations of Root Polytopes Belong Together.",
            "5-Connected Toroidal Graphs are Hamiltonian-Connected.",
            "Lehman's Theorem and the Directed Steiner Tree Problem.",
            "Induced Matchings in Graphs of Degree at Most 4.",
            "Vacant Sets and Vacant Nets: Component Structures Induced by a Random Walk.",
            "Islands in Graphs on Surfaces.",
            "Parameterized Traveling Salesman Problem: Beating the Average.",
            "A Polyhedral Characterization of Border Bases.",
            "On the Black-box Use of Somewhat Homomorphic Encryption in NonInteractive Two-Party Protocols.",
            "Decomposition of Random Graphs into Complete Bipartite Graphs.",
            "Polynomial Time Algorithms for Computing a Minimum Hull Set in Distance-Hereditary and Chordal Graphs.",
            "A Note on the Ring Loading Problem.",
            "Bounding the Running Time of Algorithms for Scheduling and Packing Problems.",
            "On the Sums of Any k Points in Finite Fields.",
            "Hitting Forbidden Minors: Approximation and Kernelization.",
            "A Comprehensive Analysis of Polyhedral Lift-and-Project Methods.",
            "Constructing Optimal k-Radius Sequences.",
            "Random Hypergraph Irregularity.",
            "Packing A-Paths in Group-Labelled Graphs via Linear Matroid Parity.",
            "A Wheels-and-Whirls Theorem for 3-Connected 2-Polymatroids.",
            "Third Case of the Cyclic Coloring Conjecture.",
            "Bounds on Equiangular Lines and on Related Spherical Codes.",
            "Acquaintance Time of Random Graphs Near Connectivity Threshold.",
            "On the Power of Graph Searching for Cocomparability Graphs.",
            "Isolating Highly Connected Induced Subgraphs.",
            "On a Conjecture of Cusick Concerning the Sum of Digits of n and n+t.",
            "Cyclotomic Numerical Semigroups.",
            "Lattice 3-Polytopes with Few Lattice Points.",
            "Lattice 3-Polytopes with Six Lattice Points.",
            "On the Maximum Quartet Distance between Phylogenetic Trees.",
            "h-Polynomials of Reduction Trees.",
            "Sum of Squares Certificates for Containment of H-Polytopes in V-Polytopes.",
            "Approximating the Generalized Terminal Backup Problem via Half-Integral Multiflow Relaxation.",
            "Sampling and Counting 3-Orientations of Planar Triangulations.",
            "Claw-Free t-Perfect Graphs Can Be Recognized in Polynomial Time.",
            "Abelian Networks I. Foundations and Examples.",
            "Reassembling Trees for the Traveling Salesman.",
            "Bipartitions of Highly Connected Tournaments.",
            "Lengths of Attractors and Transients in Neuronal Networks with Random Connectivities.",
            "On the Use of the Klein Quadric for Geometric Incidence Problems in Two Dimensions.",
            "A Characterization of K2, 4-Minor-Free Graphs.",
            "A Characterization of Projective Unitary Equivalence of Finite Frames and Applications.",
            "On the Synchronizing Probability Function and the Triple Rendezvous Time for Synchronizing Automata.",
            "Deciding the Bell Number for Hereditary Graph Properties.",
            "An Upper Bound on the Sizes of Multiset-Union-Free Families.",
            "The Number of Labeled Connected Graphs Modulo Prime Powers.",
            "A Robust Khintchine Inequality, and Algorithms for Computing Optimal Constants in Fourier Analysis and High-Dimensional Geometry.",
            "Strongly Sublinear Separators and Polynomial Expansion.",
            "Removal and Stability for Erdös-Ko-Rado.",
            "Chip Firing on General Invertible Matrices.",
            "Constructing New Families of Nested Recursions with Slow Solutions.",
            "Lattice Point Inequalities for Centered Convex Bodies.",
            "The Erdös-Hajnal Conjecture for Long Holes and Antiholes.",
            "Coloring Sparse Hypergraphs.",
            "A Remark on Sieving in Biased Coin Convolutions.",
            "The Algebraic Method in Tree Percolation.",
            "Computing with Tangles.",
            "Nowhere-Zero Flows in Signed Series-Parallel Graphs.",
            "Minimal Balanced Triangulations of Sphere Bundles over the Circle.",
            "Graphs with Many Strong Orientations.",
            "On \"stability\" in the Erdös-Ko-Rado Theorem.",
            "Maximum Weighted Induced Bipartite Subgraphs and Acyclic Subgraphs of Planar Cubic Graphs.",
            "A Probabilistic Approach to Generalized Zeckendorf Decompositions.",
            "An Upper Bound for the Hales-Jewett Number $\\mathrm{HJ}(4, 2)$.",
            "On the Random Greedy F-Free Hypergraph Process.",
            "Perfect Matchings in Hypergraphs and the Erdös Matching Conjecture.",
            "Counting Co-Cyclic Lattices.",
            "Tree Deletion Set Has a Polynomial Kernel but No OPTO(1) Approximation.",
            "Cyclically Consecutive Permutation Avoidance.",
            "Bounding Connected Tree-Width.",
            "Partially Polynomial Kernels for Set Cover and Test Cover.",
            "To Approximate Treewidth, Use Treelength!",
            "Lower Bounds on the Probability of a Finite Union of Events.",
            "Near Perfect Matchings in k-Uniform Hypergraphs II.",
            "Generating Functions and Triangulations for Lecture Hall Cones.",
            "The Structure of U2, 5, U3, 5-Fragile Matroids.",
            "Maximizing the Order of a Regular Graph of Given Valency and Second Eigenvalue.",
            "A Combinatorial Proof of a Plethystic Murnaghan-Nakayama Rule.",
            "Exploiting Chordal Structure in Polynomial Ideals: A Gröbner Bases Approach.",
            "Cut Dominants and Forbidden Minors.",
            "Unavoidable Connected Matroids Retaining a Specified Minor.",
            "Hybridization Number on Three Rooted Binary Trees is EPT.",
            "s-Inversion Sequences and P-Partitions of Type B.",
            "On the Number of Ordinary Conics.",
            "Plane Permutations and Applications to a Result of Zagier-Stanley and Distances of Permutations.",
            "New Geometric Representations and Domination Problems on Tolerance and Multitolerance Graphs.",
            "On k-Submodular Relaxation.",
            "Combinatorial Hopf Algebras of Simplicial Complexes.",
            "Covering Intersecting Bi-set Families under Matroid Constraints.",
            "Single Commodity-Flow Algorithms for Lifts of Graphic and CoGraphic Matroids.",
            "Nonhomogeneous Beatty Sequences Leading to Invariant Games.",
            "Transversal Game on Hypergraphs and the 3/4-Conjecture on the Total Domination Game.",
            "Improved Bounds on Induced Acyclic Subgraphs in Random Digraphs.",
            "Large Area Convex Holes in Random Point Sets.",
            "Induced Matchings in Graphs of Bounded Maximum Degree.",
            "Chromatic Roots and Minor-Closed Families of Graphs.",
            "Codegree Thresholds for Covering 3-Uniform Hypergraphs.",
            "Dyck Algebras, Interval Temporal Logic, and Posets of Intervals.",
            "Coloring Powers and Girth.",
            "Representing Permutations with Few Moves.",
            "An Algorithmic View of Voting.",
            "Incidence Bounds for Block Designs.",
            "Disjoint Spread Systems and Fault Location.",
            "Efficient Ranking of Lyndon Words and Decoding Lexicographically Minimal de Bruijn Sequence.",
            "On the Stable Matchings That Can Be Reached When the Agents Go Marching in One By One.",
            "Tropical Complexity, Sidon Sets, and Dynamic Programming.",
            "Short Cycle Covers on Cubic Graphs by Choosing a 2-Factor.",
            "On Maximal Independent Arborescence Packing.",
            "Independent Sets in Polarity Graphs.",
            "Rapid Mixing and Markov Bases.",
            "Largest Eigenvalue of the Laplacian Matrix: Its Eigenspace and Transitive Orientations.",
            "Extension Complexity of Polytopes with Few Vertices or Facets.",
            "The Mixed Chinese Postman Problem Parameterized by Pathwidth and Treedepth.",
            "Maximal S-Free Convex Sets and the Helly Number.",
            "Factor of IID Percolation on Trees.",
            "Separating Hash Families: A Johnson-type bound and New Constructions.",
            "Neighborhoods of Phylogenetic Trees: Exact and Asymptotic Counts.",
            "Weighted Efficient Domination for P5-Free and P6-Free Graphs."
        ]
    },
    {
        "name": "SIDMA",
        "year": "2015",
        "info": "2015: Volume 29",
        "count": 128,
        "papers": [
            "Polynomial-Time Data Reduction for the Subset Interconnection Design Problem.",
            "A Relationship Between Thomassen's Conjecture and Bondy's Conjecture.",
            "Inapproximability of Minimum Vertex Cover on k-Uniform k-Partite Hypergraphs.",
            "Separation Dimension of Bounded Degree Graphs.",
            "Large Subgraphs without Short Cycles.",
            "Permutation Trinomials Over Finite Fields with Even Characteristic.",
            "Periodic Body-and-Bar Frameworks.",
            "On the Circuit Diameter of Dual Transportation Polyhedra.",
            "Fixed-Parameter Tractability of Multicut in Directed Acyclic Graphs.",
            "On-Line Vertex Ranking of Trees.",
            "On the Minimal Teaching Sets of Two-Dimensional Threshold Functions.",
            "Reverse Chvátal-Gomory Rank.",
            "Approximate Representations, Approximate Homomorphisms, and Low-Dimensional Embeddings of Groups.",
            "Empty Pentagons in Point Sets with Collinearities.",
            "Normal 0-1 Polytopes.",
            "Maximum Percolation Time in Two-Dimensional Bootstrap Percolation.",
            "Splitting Multidimensional Necklaces and Measurable Colorings of Euclidean Spaces.",
            "Improved Analysis of a Max-Cut Algorithm Based on Spectral Partitioning.",
            "Fourier Inversion for Finite Inverse Semigroups.",
            "Excluding a Substar and an Antisubstar.",
            "Total Transversals in Hypergraphs and Their Applications.",
            "When Does a Mixture of Products Contain a Product of Mixtures?",
            "Induced Disjoint Paths in Claw-Free Graphs.",
            "Cayley Graphs Generated by Small Degree Polynomials over Finite Fields.",
            "On Lattices Generated by Finite Abelian Groups.",
            "Plane 3-Trees: Embeddability and Approximation.",
            "Almost All Friendly Matrices Have Many Obstructions.",
            "Alexander Duality and Rational Associahedra.",
            "Sandpiles, Spanning Trees, and Plane Duality.",
            "Distinct Volume Subsets.",
            "A Decomposition Based Proof for Fast Mixing of a Markov Chain over Balanced Realizations of a Joint Degree Matrix.",
            "From Directed Path to Linear Order - The Best Choice Problem for Powers of Directed Path.",
            "Variations on the Sum-Product Problem.",
            "On the Chromatic Index of Random Uniform Hypergraphs.",
            "On Computing the Maximum Parsimony Score of a Phylogenetic Network.",
            "The Wiener Index of Random Digital Trees.",
            "Motors and Impossible Firing Patterns in the Parallel Chip-Firing Game.",
            "On Parity Check (0, 1)-Matrix over ℤp.",
            "The Catalan Case of Armstrong's Conjecture on Simultaneous Core Partitions.",
            "Hankel Determinant Solutions to Several Discrete Integrable Systems and the Laurent Property.",
            "Dual Toric Codes and Polytopes of Degree One.",
            "Steiner Triple Systems without Parallel Classes.",
            "The Characteristic Imset Polytope of Bayesian Networks with Ordered Nodes.",
            "Combined Degree and Connectivity Conditions for H-Linked Graphs.",
            "Matroids Denser than a Projective Geometry.",
            "Noncrossing Arc Diagrams and Canonical Join Representations.",
            "Tropicalizing the Simplex Algorithm.",
            "Matroids Representable Over Fields With a Common Subfield.",
            "Book Embeddings of Regular Graphs.",
            "New Constructions and Bounds for Winkler's Hat Game.",
            "Defining a Phylogenetic Tree with the Minimum Number of r-State Characters.",
            "Bent Functions, Spreads, and o-Polynomials.",
            "Turán Problems and Shadows III: Expansions of Graphs.",
            "Hamiltonian Chordal Graphs are not Cycle Extendable.",
            "Network-Based Vertex Dissolution.",
            "TSP Tours in Cubic Graphs: Beyond 4/3.",
            "Distinguished Minimal Topological Lassos.",
            "An Extension of the Blow-up Lemma to Arrangeable Graphs.",
            "Log-Concavity of Combinations of Sequences and Applications to Genus Distributions.",
            "Disjoint Chorded Cycles of the Same Length.",
            "The Phase Transition in Multitype Binomial Random Graphs.",
            "Constraint Satisfaction with Counting Quantifiers.",
            "On Secret Sharing with Nonlinear Product Reconstruction.",
            "On the Metric s-t Path Traveling Salesman Problem.",
            "The Recognition of Simple-Triangle Graphs and of Linear-Interval Orders is Polynomial.",
            "On the Concentration of the Domination Number of the Random Graph.",
            "On the Impossibility of Dimension Reduction for Doubling Subsets of ℓp.",
            "Phase coexistence and torpid mixing in the 3-coloring model on ℤd.",
            "The Number of Interlacing Equalities Resulting from Removal of a Vertex from a Tree.",
            "Infinitesimal Rigidity of Symmetric Bar-Joint Frameworks.",
            "A Polyhedral Frobenius Theorem with Applications to Integer Optimization.",
            "Optimal ε-Biased Sets with Just a Little Randomness.",
            "Light Spanners.",
            "Detecting and Counting Small Pattern Graphs.",
            "String Reconstruction from Substring Compositions.",
            "Computing Opaque Interior Barriers à la Shermer.",
            "Avoiding 5-Circuits in 2-Factors of Cubic Graphs.",
            "Homomorphisms of Trees into a Path.",
            "Plane Triangulations Without a Spanning Halin Subgraph: Counterexamples to the Lovász-Plummer Conjecture on Halin Graphs.",
            "Hadwiger Number of Graphs with Small Chordality.",
            "Preventing Unraveling in Social Networks: The Anchored k-Core Problem.",
            "Walker-Breaker Games.",
            "Rédei Actions on Finite Fields and Multiplication Map in Cyclic Group.",
            "The Codegree Threshold for 3-Graphs with Independent Neighborhoods.",
            "Product Construction of Affine Codes.",
            "Arbitrary Orientations of Hamilton Cycles in Digraphs.",
            "Recognizing Coverage Functions.",
            "Canonical Trees, Compact Prefix-Free Codes, and Sums of Unit Fractions: A Probabilistic Analysis.",
            "Smoothed Analysis on Connected Graphs.",
            "A Precise Threshold for Quasi-Ramsey Numbers.",
            "Building Spanning Trees Quickly in Maker-Breaker Games.",
            "Minimum Average Distance Clique Trees.",
            "Planar graphs with Δ ≥ 8 are (Δ+1)-edge-choosable.",
            "The Generalized Terminal Backup Problem.",
            "Integer Factorization of a Positive-Definite Matrix.",
            "Graphs with χ=Δ Have Big Cliques.",
            "Deterministic Algorithms for Matching and Packing Problems Based on Representative Sets.",
            "Minimally Unbalanced Diamond-Free Graphs and Dyck-Paths.",
            "Explicit Linear Kernels via Dynamic Programming.",
            "Improved Bounds on the Phase Transition for the Hard-Core Model in 2 Dimensions.",
            "Bergman Complexes of Lattice Path Matroids.",
            "NP-Hardness and Fixed-Parameter Tractability of Realizing Degree Sequences with Directed Acyclic Graphs.",
            "A Subexponential Parameterized Algorithm for Proper Interval Completion.",
            "A Folkman Linear Family.",
            "Number of Cliques in Graphs with a Forbidden Subdivision.",
            "Linear-Time Recognition of Probe Interval Graphs.",
            "Identifying Codes in Hereditary Classes of Graphs and VC-Dimension.",
            "Bounds on the Expected Size of the Maximum Agreement Subtree.",
            "Extension to Even Triangulations.",
            "Extremal Theorems for Degree Sequence Packing and the Two-Color Discrete Tomography Problem.",
            "Ihara Zeta Functions of Infinite Weighted Graphs.",
            "Linear Bound in Terms of Maxmaxflow for the Chromatic Roots of Series-Parallel Graphs.",
            "A Planarity Criterion for Graphs.",
            "Vector Flows and Integer Flows.",
            "No Laplacian Perfect State Transfer in Trees.",
            "Three Generalizations of Davenport-Schinzel Sequences.",
            "Small Stretch Pairwise Spanners and Approximate D-Preservers.",
            "Rainbow Connection of Random Regular Graphs.",
            "Matroid Toric Ideals: Complete Intersection, Minors, and Minimal Systems of Generators.",
            "Huge Unimodular n-Fold Programs.",
            "Cyclic Inclusion-Exclusion.",
            "Fixed Points of Boolean Networks, Guessing Graphs, and Coding Theory.",
            "Cycles of Given Size in a Dense Graph.",
            "Random Subgraphs in Sparse Graphs.",
            "Necessary Conditions for Tractability of Valued CSPs.",
            "A Relative of Hadwiger's Conjecture.",
            "Edge-Isoperimetric Problem for Cayley Graphs and Generalized Takagi Functions.",
            "A Characterization on the Adjacent Vertex Distinguishing Index of Planar Graphs with Large Maximum Degree."
        ]
    },
    {
        "name": "SIDMA",
        "year": "2014",
        "info": "2014: Volume 28",
        "count": 122,
        "papers": [
            "Interpolation of Fermat Quotients.",
            "Self-Complementary Circulants of Prime-Power Order.",
            "An Edge-Colored Version of Dirac's Theorem.",
            "Swendsen-Wang Is Faster than Single-Bond Dynamics.",
            "Approximation Algorithms for Nonbinary Agreement Forests.",
            "Tight Codegree Condition for the Existence of Loose Hamilton Cycles in 3-Graphs.",
            "Competition Numbers, Quasi-line Graphs, and Holes.",
            "On the Maximum Induced Density of Directed Stars and Related Problems.",
            "Submodularity Helps in Nash and Nonsymmetric Bargaining Games.",
            "Estimating the Number of Disjoint Edges in Simple Topological Graphs via Cylindrical Drawings.",
            "A Density Result for Random Packings of Unit Disks.",
            "Preserving Terminal Distances Using Minors.",
            "Bicontactual Regular Hypermaps.",
            "Multiply Chorded Cycles.",
            "An Entropic Proof of Chang's Inequality.",
            "Strong Immersions and Maximum Degree.",
            "Intertwining Connectivities in Representable Matroids.",
            "On the Irregularity Strength of Dense Graphs.",
            "Replacement Paths via Row Minima of Concise Matrices.",
            "Packing Triangles in Weighted Graphs.",
            "An Analysis of the Asymmetric Quadratic Traveling Salesman Polytope.",
            "Kernelization Lower Bounds by Cross-Composition.",
            "A Combinatorial Approach to Colourful Simplicial Depth.",
            "Escape Rates for Rotor Walks in Zd.",
            "Transversals of Longest Paths and Cycles.",
            "Analysis of an Exhaustive Search Algorithm in Random Graphs and the nclog n-Asymptotics.",
            "Hypergraphs of Bounded Disjointness.",
            "A Weak Version of Rota's Bases Conjecture for Odd Dimensions.",
            "Degree and Algebraic Properties of Lattice and Matrix Ideals.",
            "MacWilliams Identities for m-tuple Weight Enumerators.",
            "Optimal Matching Forests and Valuated Delta-Matroids.",
            "Induced Matchings in Subcubic Graphs.",
            "Construction and Comparison of Authentication Codes.",
            "Fast Deterministic Algorithms for Matrix Completion Problems.",
            "Immersions in Highly Edge Connected Graphs.",
            "4-Critical Graphs on Surfaces Without Contractible $(\\le\\!4)$-Cycles.",
            "Lower Bounds for the Isoperimetric Numbers of Random Regular Graphs.",
            "A Graph Reduction Step Preserving Element-Connectivity and Packing Steiner Trees and Forests.",
            "Robinson-Schensted-Knuth Algorithm, Jeu de Taquin, and Kerov-Vershik Measures on Infinite Tableaux.",
            "Blocking Quadruple: A New Obstruction to Circular-Arc Graphs.",
            "Shortest-Weight Paths in Random Regular Graphs.",
            "Computing with Voting Trees.",
            "Integral Cayley Graphs and Groups.",
            "Infinite Turán Problems for Bipartite Graphs.",
            "Turán Numbers for Forests of Paths in Hypergraphs.",
            "Dickson Polynomials of the Second Kind that Permute Zm.",
            "A Semialgebraic Description of the General Markov Model on Phylogenetic Trees.",
            "A Solution to the 2/3 Conjecture.",
            "Acquaintance Time of a Graph.",
            "Convergence Results for Systems of Linear Forms on Cyclic Groups and Periodic Nilsequences.",
            "Maximizing the Number of Nonnegative Subsets.",
            "Graphs Admitting k-NU Operations. Part 2: The Irreflexive Case.",
            "Phase Transition for Glauber Dynamics for Independent Sets on Regular Trees.",
            "Matroids with a Modular 4-Point Line.",
            "Long Circuits and Large Euler Subgraphs.",
            "Edge-Disjoint Cliques in Graphs with High Minimum Degree.",
            "An Extension of the Moser-Tardos Algorithmic Local Lemma.",
            "An Erdös-Ko-Rado Theorem for the Derangement Graph of PGL3(q) Acting on the Projective Plane.",
            "Matching Problems with Delta-Matroid Constraints.",
            "Hurwitzian Continued Fractions Containing a Repeated Constant and An Arithmetic Progression.",
            "Moving Robots Efficiently Using the Combinatorics of CAT(0) Cubical Complexes.",
            "Generating Functions for the q-Bernstein Bases.",
            "On Reconstructing Graphs and Their Complements.",
            "On the Weight of Halfspaces over Hamming Balls.",
            "On the Union of Arithmetic Progressions.",
            "Combinatorial Expansions for Families of Noncommutative k-Schur Functions.",
            "The Order Dimension of Planar Maps Revisited.",
            "An Upper Bound on the Fractional Chromatic Number of Triangle-Free Subcubic Graphs.",
            "Improved Approximation of Maximum Vertex Coverage Problem on Bipartite Graphs.",
            "Representing Partitions on Trees.",
            "Balancing Degree, Diameter, and Weight in Euclidean Spanners.",
            "Embedding Partial Steiner Triple Systems with Few Triples.",
            "ℓ-Degree Turán Density.",
            "Forbidden Subgraphs and 3-Colorings.",
            "Homological Face-Width Condition Forcing K6-Minors in Graphs on Surfaces.",
            "The Final Size of the Cℓ-free Process.",
            "Strict Inequalities for Connective Constants of Transitive Graphs.",
            "Beyond the Vizing's Bound for at Most Seven Colors.",
            "Hitting and Harvesting Pumpkins.",
            "Computing the Stretch of an Embedded Graph.",
            "Intertwining Connectivity in Matroids.",
            "Finding a Closest Point in a Lattice of Voronoi's First Kind.",
            "Popular Matchings: Structure and Strategic Issues.",
            "Pebbling in Split Graphs.",
            "Universality of Random Graphs for Graphs of Maximum Degree Two.",
            "Edgewise Subdivisions, Local h-Polynomials, and Excedances in the Wreath Product $\\mathbb{Z}_r \\wr \\mathfrak{S}_n$.",
            "On the Compatibility of Quartet Trees.",
            "Polyhedral Covers of Tree Space.",
            "Representing a Cubic Graph as the Intersection Graph of Axis-Parallel Boxes in Three Dimensions.",
            "Arithmetic of Marked Order Polytopes, Monotone Triangle Reciprocity, and Partial Colorings.",
            "Maximum Size Binary Matroids with no AG(3, 2)-Minor are Graphic.",
            "Musical Chairs.",
            "Recognition of C4-Free and 1/2-Hyperbolic Graphs.",
            "Proof of a Conjecture of Henning and Yeo on Vertex-Disjoint Directed Cycles.",
            "Nowhere-Zero 3-Flows in Signed Graphs.",
            "Correction: Basic Network Creation Games.",
            "Enumeration of 2-Polymatroids on up to Seven Elements.",
            "Sink-Stable Sets of Digraphs.",
            "On List Coloring and List Homomorphism of Permutation and Interval Graphs.",
            "On Packing Two Graphs with Bounded Sum of Sizes and Maximum Degree.",
            "Testing Similar Means.",
            "Fully Polynomial Time Approximation Schemes for Stochastic Dynamic Programs.",
            "Combinatorial Conditions for the Unique Completability of Low-Rank Matrices.",
            "On Mod (2s+1)-Orientations of Graphs.",
            "Oracle Tractability of Skew Bisubmodular Functions.",
            "Spectral Extremal Problems for Hypergraphs.",
            "A Min-Max Theorem for Transversal Submodular Functions and Its Implications.",
            "k-Blocks: A Connectivity Invariant for Graphs.",
            "Planar Graphs with $\\Delta\\ge 9$ are Entirely (Δ+2)-Colorable.",
            "On a Family of Diamond-Free Strongly Regular Graphs.",
            "On the Enumeration of Minimal Dominating Sets and Related Notions.",
            "A Finite Family of Pseudodiscs Must Include a \"Small\" Pseudodisc.",
            "Upper Bound Constructions for Untangling Planar Geometric Graphs.",
            "An Improved Kalai-Kleitman Bound for the Diameter of a Polyhedron.",
            "Making Octants Colorful and Related Covering Decomposition Problems.",
            "Lower Bounds on Geometric Ramsey Functions.",
            "From One Stable Marriage to the Next: How Long Is the Way?",
            "On the Number of Graphs Without Large Cliques.",
            "Cop and Robber Game and Hyperbolicity.",
            "A Characterization of Generically Rigid Frameworks on Surfaces of Revolution.",
            "Weighted Coloring in Trees.",
            "Longest Common Subsequences in Sets of Words."
        ]
    },
    {
        "name": "SIDMA",
        "year": "2013",
        "info": "2013: Volume 27",
        "count": 130,
        "papers": [
            "Flooding in Weighted Sparse Random Graphs.",
            "On the Number of Hamilton Cycles in Sparse Random Graphs.",
            "Near-Popular Matchings in the Roommates Problem.",
            "Mixed and Circular Multichromosomal Genomic Median Problem.",
            "Efficient Algorithms for Eulerian Extension and Rural Postman.",
            "A Local Strengthening of Reed's Omega, Delta, Chi Conjecture for Quasi-line Graphs.",
            "Stable Routing and Unique-Max Coloring on Trees.",
            "First-Fit Coloring of Incomparability Graphs.",
            "4, 5 Is Not Coverable: A Counterexample to a Conjecture of Kaiser and Škrekovski.",
            "Repeated Degrees in Random Uniform Hypergraphs.",
            "Rooted-Tree Decompositions with Matroid Constraints and the Infinitesimal Rigidity of Frameworks with Boundaries.",
            "A Submodular Optimization Approach to Bicriteria Scheduling Problems with Controllable Processing Times on Parallel Machines.",
            "Integer Representations of Convex Polygon Intersection Graphs.",
            "Maximum Size of Reverse-Free Sets of Permutations.",
            "Cover-Decomposition and Polychromatic Numbers.",
            "A Lower Bound for the Complexity of Monotone Graph Properties.",
            "Nonseparable, Concave Utilities Are Easy - in a Perfect Price Discrimination Market Model.",
            "Directed Hamilton Cycles in Digraphs and Matching Alternating Hamilton Cycles in Bipartite Graphs.",
            "Subset Feedback Vertex Set Is Fixed-Parameter Tractable.",
            "Target Set Selection Problem for Honeycomb Networks.",
            "Relationships between Pairs of Representations of Signed Binary Matroids.",
            "An Improved Upper Bound on the Length of the Longest Cycle of a Supercritical Random Graph.",
            "Adversarial Leakage in Games.",
            "Distributions of Sparse Spanning Subgraphs in Random Graphs.",
            "The Complexity of Deletion Problems for Matroids.",
            "Spanning Trees with Bounded Maximum Degrees of Graphs on Surfaces.",
            "Nonrepetitive Choice Number of Trees.",
            "On the Singularity of Random Combinatorial Matrices.",
            "A Tropical Intersection Product in Matroidal Fans.",
            "Nullity and Loop Complementation for Delta-Matroids.",
            "Hypergraphic LP Relaxations for Steiner Trees.",
            "Coloring Claw-Free Graphs with Delta-1 Colors.",
            "The Number of Edges in k-Quasi-planar Graphs.",
            "Minimizing the Number of Carries in Addition.",
            "Matroid-Based Packing of Arborescences.",
            "A Bound for the Maximum Weight of a Linear Code.",
            "A Relaxation of Steinberg's Conjecture.",
            "An Optimal Binding Number Condition for Bipancyclism.",
            "Improved Lower Bounds on Book Crossing Numbers of Complete Graphs.",
            "Diametral Pairs of Linear Extensions.",
            "Peeling the Grid.",
            "Basic Network Creation Games.",
            "Decomposition of Binary Signed-Graphic Matroids.",
            "Digraph Girth via Chromatic Number.",
            "Forcing Large Complete (Topological) Minors in Infinite Graphs.",
            "Uniqueness of Vertex Magic Constants.",
            "Geodetic Number versus Hull Number in P3-Convexity.",
            "Vertex-Pursuit in Random Directed Acyclic Graphs.",
            "Bridgeless Cubic Graphs Are (7, 2)-Edge-Choosable.",
            "On the Game Chromatic Number of Sparse Random Graphs.",
            "On the Fourier Spectra of New APN Functions.",
            "Bounds on the Maximum Multiplicity of Some Common Geometric Graphs.",
            "A Coxeter-Gram Classification of Positive Simply Laced Edge-Bipartite Graphs.",
            "Counting Reducible, Powerful, and Relatively Irreducible Multivariate Polynomials over Finite Fields.",
            "Counting and Detecting Small Subgraphs via Equations.",
            "The Exact Turán Number of F(3, 3) and All Extremal Configurations.",
            "Finding 2-Factors Closer to TSP Tours in Cubic Graphs.",
            "On the Number of Perfect Matchings in a Bipartite Graph.",
            "Self-Similarity of Graphs.",
            "On New Sum-Product-Type Estimates.",
            "Isostatic Block and Hole Frameworks.",
            "Perfect Matchings in 3-Uniform Hypergraphs with Large Vertex Degree.",
            "Jumps and Nonjumps in Multigraphs.",
            "Bounds for Approximate Discrete Tomography Solutions.",
            "Tilings by (0.5, n)-Crosses and Perfect Codes.",
            "The Diameter of the Rubik's Cube Group Is Twenty.",
            "Rainbow Graphs and Switching Classes.",
            "Skew Hadamard Difference Sets from Cyclotomic Strongly Regular Graphs.",
            "Algorithms for Symmetric Submodular Function Minimization under Hereditary Constraints and Generalizations.",
            "From Flag Complexes to Banner Complexes.",
            "Systematic Authentication Codes Based on a Class of Bent Functions and the Gray Map on a Galois Ring.",
            "Drawing Planar Graphs of Bounded Degree with Few Slopes.",
            "Bounding the Fractional Chromatic Number of KDelta-Free Graphs.",
            "Optimizing the Graph Minors Weak Structure Theorem.",
            "On the Maximum Density of Graphs with Unique-Path Labelings.",
            "Robust Matchings and Matroid Intersections.",
            "Robust Independence Systems.",
            "On Circuits and Serial Symmetric Basis-Exchange in Matroids.",
            "Caterpillar Dualities and Regular Languages.",
            "Energy Minimization of Repelling Particles on a Toric Grid.",
            "Neighbor Distinguishing Edge Colorings via the Combinatorial Nullstellensatz.",
            "Density Theorems for Intersection Graphs of t-Monotone Curves.",
            "On the Fast Computation of the Weight Enumerator Polynomial and the t Value of Digital Nets over Finite Abelian Groups.",
            "Universal Cycles for Weak Orders.",
            "Approximate Hamilton Decompositions of Robustly Expanding Regular Digraphs.",
            "Lower Bounding Edit Distances between Permutations.",
            "Visibility Number of Directed Graphs.",
            "Approximation Algorithms for Minimum-Cost $k\\hbox{-}(S, T)$ Connected Digraphs.",
            "On the Representability of the Biuniform Matroid.",
            "On the Convergence of the Affine Hull of the Chvátal-Gomory Closures.",
            "Steiner Forest Orientation Problems.",
            "On 3-Connected Graphs of Path-Width at Most Three.",
            "Approximate Min-Power Strong Connectivity.",
            "Computing Bounds for Entropy of Stationary Zd Markov Random Fields.",
            "Generalized Power Domination in Regular Graphs.",
            "Degree-Doubling Graph Families.",
            "Approximation Algorithms for Fault Tolerant Facility Allocation.",
            "On Maximal S-Free Sets and the Helly Number for the Family of S-Convex Sets.",
            "Forbidden Rainbow Subgraphs That Force Large Highly Connected Monochromatic Subgraphs.",
            "Deciding Positivity of Littlewood-Richardson Coefficients.",
            "Advancing the Transposition Distance and Diameter through Lonely Permutations.",
            "Geometric Sensitivity of Rigid Graphs.",
            "On the General Position Subset Selection Problem.",
            "Factors with Multiple Degree Constraints in Graphs.",
            "Coalescing Random Walks and Voting on Connected Graphs.",
            "Proximity Algorithms for Nearly Doubling Spaces.",
            "A Linear-Time Algorithm for Finding a Complete Graph Minor in a Dense Graph.",
            "Unique-Maximum and Conflict-Free Coloring for Hypergraphs and Tree Graphs.",
            "The Existence of a 2-Factor in a Graph Satisfying the Local Chvátal-Erdös Condition.",
            "Total Acquisition in Graphs.",
            "Simplicial Complexes Obtained from Qualitative Probability Orders.",
            "Sequence Covering Arrays.",
            "On the Existence of General Factors in Regular Graphs.",
            "Additive Decompositions of Subgroups of Finite Fields.",
            "On the Shard Intersection Order of a Coxeter Group.",
            "Hamiltonian Spider Intersection Graphs Are Cycle Extendable.",
            "Eulerian Circuits with No Monochromatic Transitions in Edge-colored Digraphs.",
            "Graphs Admitting k-NU Operations. Part 1: The Reflexive Case.",
            "A Polynomial Kernel for Proper Interval Vertex Deletion.",
            "Cyclic Codes from Some Monomials and Trinomials.",
            "On the Tree Packing Conjecture.",
            "Poincaré and Plancherel-Polya Inequalities in Harmonic Analysis on Weighted Combinatorial Graphs.",
            "Improper Choosability of Planar Graphs without 4-Cycles.",
            "On Four-Variable Expanders in Finite Fields.",
            "Local-Optimality Guarantees Based on Paths for Optimal Decoding.",
            "Asymptotic Enumeration of Sparse Multigraphs with Given Degrees.",
            "Extremal Problems for Game Domination Number.",
            "Preprocessing for Treewidth: A Combinatorial Analysis through Kernelization.",
            "Obtaining a Bipartite Graph by Contracting Few Edges.",
            "Sparse Graphs Are Not Flammable."
        ]
    },
    {
        "name": "SIDMA",
        "year": "2012",
        "info": "2012: Volume 26",
        "count": 113,
        "papers": [
            "Forbidden Induced Subgraphs of Double-split Graphs.",
            "A Deterministic Algorithm for the Frieze-Kannan Regularity Lemma.",
            "Binary Nontiles.",
            "On a Dispersion Problem in Grid Labeling.",
            "Labeling Planar Graphs without 4, 5-Cycles with a Condition on Distance Two.",
            "Formulae for the Alon-Tarsi Conjecture.",
            "Large Bd-Free and Union-free Subfamilies.",
            "Queue Layouts of Hypercubes.",
            "Cohen-Macaulay Graphs and Face Vectors of Flag Complexes.",
            "A Chain Theorem for 3+-Connected Graphs.",
            "Neighbor Systems, Jump Systems, and Bisubmodular Polyhedra.",
            "Griggs and Yeh's Conjecture and L(p, 1)-labelings.",
            "Random Lifts of $K_5\\backslashe$ are 3-Colorable.",
            "The Synchronizing Probability Function of an Automaton.",
            "Roman Domination on 2-Connected Graphs.",
            "Nested Recurrence Relations with Conolly-like Solutions.",
            "Nonextendible Latin Cuboids.",
            "The MST of Symmetric Disk Graphs (in Arbitrary Metric Spaces) is Light.",
            "Packing Squares with Profits.",
            "The Rigidity of Spherical Frameworks: Swapping Blocks and Holes.",
            "Graphs That Admit Polyline Drawings with Few Crossing Angles.",
            "Families of Graph-different Hamilton Paths.",
            "Reconstructing 3-Colored Grids from Horizontal and Vertical Projections is NP-Hard: A Solution to the 2-Atom Problem in Discrete Tomography.",
            "Universality of Random Graphs.",
            "Constructing Constant Composition Codes via Distance-Increasing Mappings.",
            "How to Choose the Best Twins.",
            "Vertices Belonging to All Critical Sets of a Graph.",
            "On the Complexity of MMSNP.",
            "On Optimal Weighted Balanced Clusterings: Gravity Bodies and Power Diagrams.",
            "Packing Tight Hamilton Cycles in Uniform Hypergraphs.",
            "A Fractional Analogue of Brooks' Theorem.",
            "Trait-Dependent Extinction Leads to Greater Expected Biodiversity Loss.",
            "All Alternating Groups An with $n\\geq12$ Have Polytopes of Rank $\\lfloor\\frac{n-1}{2}\\rfloor$.",
            "Linear Time Split Decomposition Revisited.",
            "On the Size of Lattice Simplices with a Single Interior Lattice Point.",
            "A q-Analogue of the Addressing Problem of Graphs by Graham and Pollak.",
            "Hitting Times for Random Walks with Restarts.",
            "Multidimensional Kruskal-Katona Theorem.",
            "The Incidence Hopf Algebra of Graphs.",
            "Cops and Robber with Constraints.",
            "Algorithms for Finding a Maximum Non-k-Linked Graph.",
            "De Bruijn Sequences for Fixed-Weight Binary Strings.",
            "Lower Bounds for Local Monotonicity Reconstruction from Transitive-Closure Spanners.",
            "Extending Fractional Precolorings.",
            "Book Embedding of Toroidal Bipartite Graphs.",
            "Creating Small Subgraphs in Achlioptas Processes With Growing Parameter.",
            "Vertex Disjoint Cycles of Different Length in Digraphs.",
            "Counting Subgraphs via Homomorphisms.",
            "Rent, Lease, or Buy: Randomized Algorithms for Multislope Ski Rental.",
            "Optimal Multivalued Shattering.",
            "Counting Lattice Paths via a New Cycle Lemma.",
            "The Internally 4-Connected Binary Matroids with No $M(K_{5}\\backslash e)$-Minor.",
            "The Satisfiability Threshold for a Seemingly Intractable Random Constraint Satisfaction Problem.",
            "Local Matching Indicators for Transport Problems with Concave Costs.",
            "Optimal Probability Inequalities for Random Walks Related to Problems in Extremal Combinatorics.",
            "Vertex Ramsey Problems in the Hypercube.",
            "The Disentangling Number for Phylogenetic Mixtures.",
            "Growing Without Cloning.",
            "An Invariant for Hypersurfaces in Prime Characteristic.",
            "Min-Max Relations for Odd Cycles in Planar Graphs.",
            "Rational Convex Programs and Efficient Algorithms for 2-Player Nash and Nonsymmetric Bargaining Games.",
            "The Complexity of Pebbling in Diameter Two Graphs.",
            "On the Carathéodory Number for the Convexity of Paths of Order Three.",
            "A Simple Polynomial Algorithm for the Longest Path Problem on Cocomparability Graphs.",
            "Optimal Packings of Hamilton Cycles in Sparse Random Graphs.",
            "A Curved Brunn-Minkowski Inequality on the Discrete Hypercube, Or: What Is the Ricci Curvature of the Discrete Hypercube?",
            "On the Permanents of Matrices with Restricted Entries Over Finite Fields.",
            "Computing the Cutwidth of Bipartite Permutation Graphs in Linear Time.",
            "Total Dual Integrality in Some Facility Location Problems.",
            "Probabilistic One-Player Ramsey Games via Deterministic Two-Player Games.",
            "Obstructions to Lifting Tropical Curves in Surfaces in 3-Space.",
            "An Improved Bound for First-Fit on Posets Without Two Long Incomparable Chains.",
            "Graphs for Orthogonal Arrays and Projective Planes of Even Order.",
            "Pairs of Heavy Subgraphs for Hamiltonicity of 2-Connected Graphs.",
            "Lattice-Width Directions and Minkowski's 3d-Theorem.",
            "Note on Large Subsets of Binary Vectors with Similar Distances.",
            "Graphs from Generalized Kac-Moody Algebras.",
            "Packing Directed Circuits through Prescribed Vertices Bounded Fractionally.",
            "New Lower Bounds for the Independence Number of Sparse Graphs and Hypergraphs.",
            "Sorting by Transpositions Is Difficult.",
            "Brownian Approximation to Counting Graphs.",
            "HITS Can Converge Slowly, But Not Too Slowly, in Score and Rank.",
            "An Application of Integer Programming to the Decomposition of Numerical Semigroups.",
            "Turán Numbers of Subdivided Graphs.",
            "On Some Multicolor Ramsey Numbers Involving K3+e and K4-e.",
            "On the Density of Nearly Regular Graphs with a Good Edge-Labeling.",
            "Planar Graphs Have Exponentially Many 3-Arboricities.",
            "Coloring Bull-Free Perfect Graphs.",
            "On the Growth Rate of the Input-Output Weight Distribution of Convolutional Encoders.",
            "The Maximum-Weight Stable Matching Problem: Duality and Efficiency.",
            "Symmetry Matters for Sizes of Extended Formulations.",
            "Induced Matchings in Subcubic Planar Graphs.",
            "Generic Rigidity Matroids with Dilworth Truncations.",
            "On Pósa's Conjecture for Random Graphs.",
            "Odd Cycle Transversals and Independent Sets in Fullerene Graphs.",
            "The Decimation Process in Random k-SAT.",
            "Graphs That Do Not Contain a Cycle with a Node That Has at Least Two Neighbors on It.",
            "On a Problem of Nathanson Related to Minimal Additive Complements.",
            "Majority Decisions in Overlapping Committees and Asymptotic Size of Dichotomies.",
            "Asymptotic Enumeration of Binary Matrices with Bounded Row and Column Sums.",
            "Monotone Proper Interval Digraphs and Min-Max Orderings.",
            "The Dichotomy of Minimum Cost Homomorphism Problems for Digraphs.",
            "Turán Densities of Some Hypergraphs Related to Kk+1k.",
            "Succinct Representation of Codes with Applications to Testing.",
            "Cycle Killer...Qu'est-ce que c'est? On the Comparative Approximability of Hybridization Number and Directed Feedback Vertex Set.",
            "Almost Intersecting Families of Sets.",
            "Nonconvex Representations of Plane Graphs.",
            "On 3-Colorable P5-Free Graphs.",
            "From Pathwidth to Connected Pathwidth.",
            "Rigidity of Frameworks Supported on Surfaces.",
            "Maximum r-Regular Induced Subgraph Problem: Fast Exponential Algorithms and Combinatorial Bounds.",
            "A Bound on the Minimum Distance of Quasi-cyclic Codes.",
            "Cycles in Graphs and Covers."
        ]
    },
    {
        "name": "SIDMA",
        "year": "2011",
        "info": "2011: Volume 25",
        "count": 112,
        "papers": [
            "On the p-Median Polytope and the Intersection Property: Polyhedra and Algorithms.",
            "Preemptive Online Scheduling with Reordering.",
            "Pseudorandomness and Dynamics of Fermat Quotients.",
            "Stable Roommates Matchings, Mirror Posets, Median Graphs, and the Local/Global Median Phenomenon in Stable Matchings.",
            "Facets in the Crossing Number Polytope.",
            "Linear Extension Diameter of Downset Lattices of Two-Dimensional Posets.",
            "On the Facial Structure of the Alldifferent System.",
            "Improved Bounds for r-Identifying Codes of the Hex Grid.",
            "Gallai's Theorem for List Coloring of Digraphs.",
            "Narrow-Shallow-Low-Light Trees with and without Steiner Points.",
            "Origins of Nonlinearity in Davenport-Schinzel Sequences.",
            "Subgraphs of Weakly Quasi-Random Oriented Graphs.",
            "Turán Graphs and the Number of Colorings.",
            "The Automorphism Group of a Johnson Graph.",
            "An Obstacle to a Decomposition Theorem for Near-Regular Matroids.",
            "When Does a Curve Bound a Distorted Disk?",
            "Navigating in a Graph by Aid of Its Spanning Tree Metric.",
            "Cop and Robber Games When the Robber Can Hide and Ride.",
            "Root Polytopes and Growth Series of Root Lattices.",
            "On Maximal S-Free Convex Sets.",
            "More Constructive Lower Bounds on Classical Ramsey Numbers.",
            "5-Coloring Graphs with 4 Crossings.",
            "Rotor Walks on General Trees.",
            "Front Representation of Set Partitions.",
            "Acyclic Edge-Coloring of Planar Graphs.",
            "Upward Topological Book Embeddings of DAGs.",
            "Near-Unanimity Polymorphisms on Structures with Finite Duality.",
            "Searching for a Visible, Lazy Fugitive.",
            "Every Plane Graph of Maximum Degree 8 has an Edge-Face 9-Coloring.",
            "On Vertex Partitions of Hypercubes by Isometric Trees.",
            "Bijective Proof of a Symplectic Dual Pair Identity.",
            "Estimate of The Bézout Number For Linear Piecewise Algebraic Curves Over Arbitrary Triangulations.",
            "Parameterized Complexity of Arc-Weighted Directed Steiner Problems.",
            "The α-Arboricity of Complete Uniform Hypergraphs.",
            "Eulerian Subgraphs Containing Given Vertices.",
            "Two-Generator Numerical Semigroups and Fermat and Mersenne Numbers.",
            "Sparse Balanced Partitions and the Complexity of Subgraph Problems.",
            "Boundary Length of Reconstructions in Discrete Tomography.",
            "The Bipartite Swapping Trick on Graph Homomorphisms.",
            "The Erdös-Falconer Distance Problem on the Unit Sphere in Vector Spaces Over Finite Fields.",
            "On a Certain Generalization of the Balog-Szemerédi-Gowers Theorem.",
            "Augmenting Undirected Node-Connectivity by One.",
            "On the Zone Complexity of a Vertex.",
            "Erratum: Lot-Sizing with Stock Upper Bounds and Fixed Charges.",
            "Special Section on Constraint Satisfaction Problems and Message Passing Algorithms.",
            "On the Diameter of the Set of Satisfying Assignments in Random Satisfiable k-CNF Formulas.",
            "Quiet Planting in the Locked Constraint Satisfaction Problems.",
            "Reconstruction and Clustering in Random Constraint Satisfaction Problems.",
            "Reconstruction for Colorings on Trees.",
            "The Glauber Dynamics for Colorings of Bounded Degree Trees.",
            "A Computational Method for Bounding the Probability of Reconstruction on Trees.",
            "Phylogenies without Branch Bounds: Contracting the Short, Pruning the Deep.",
            "The Multistate Hard Core Model on a Regular Tree.",
            "Limit Behavior of Locally Consistent Constraint Satisfaction Problems.",
            "Maximum Weight Partial Colorings on Sparse Random Graphs.",
            "Decay of Correlations for Sparse Graph Error Correcting Codes.",
            "Belief Propagation for Weighted b-Matchings on Arbitrary Graphs and its Relation to Linear Programs with Integer Solutions.",
            "Counting Independent Sets Using the Bethe Approximation.",
            "Strongly Conflict-Avoiding Codes.",
            "Monochromatic Boxes in Colored Grids.",
            "Graphs with Odd Cycle Lengths 5 and 7 are 3-Colorable.",
            "A Constant Factor Approximation for Minimum λ-Edge-Connected k-Subgraph with Metric Costs.",
            "A Zero-Free Interval for Chromatic Polynomials of Nearly 3-Connected Plane Graphs.",
            "Folder Complexes and Multiflow Combinatorial Dualities.",
            "Generalizing the Splits Equivalence Theorem and Four Gamete Condition: Perfect Phylogeny on Three-State Characters.",
            "On the Resilience of Hamiltonicity and Optimal Packing of Hamilton Cycles in Random Graphs.",
            "Fast Convergence of Markov Chain Monte Carlo Algorithms for Phylogenetic Reconstruction with Homogeneous Data on Closely Related Species.",
            "Acute Sets In Euclidean Spaces.",
            "Max-min Online Allocations with a Reordering Buffer.",
            "Improved Approximation Guarantees for Weighted Matching in the Semi-streaming Model.",
            "Note on the Number of Two-Dimensional Threshold Functions.",
            "Line-Polar Graphs: Characterization and Recognition.",
            "An improved sum-product estimate for general finite fields.",
            "Constructions for Cyclic Sieving Phenomena.",
            "Balancing Covectors.",
            "A New Upper Bound for the Irregularity Strength of Graphs.",
            "An Improved Algorithm for the Half-Disjoint Paths Problem.",
            "Approximating Width Parameters of Hypergraphs with Excluded Minors.",
            "Laplacians for flow networks.",
            "Counting Stars and Other Small Subgraphs in Sublinear-Time.",
            "Permutations as Product of Parallel Transpositions.",
            "Cutwidth of Split Graphs and Threshold Graphs.",
            "A Bound for the Cops and Robbers Problem.",
            "The Domination Number of Grids.",
            "Fractional colorings of cubic graphs with large girth.",
            "A Note on Bipartite Graph Tiling.",
            "Edge-Partitioning Regular Graphs for Ring Traffic Grooming with a Priori Placement of the ADMs.",
            "Computing Geodesic Distances in Tree Space.",
            "Labeled Ballot Paths and the Springer Numbers.",
            "A Complete Generalization of Clatworthy Group Divisible Designs.",
            "Sublinear Time Algorithms.",
            "Uniqueness in Discrete Tomography: Three Remarks and a Corollary.",
            "Finding Cycles with Topological Properties in Embedded Graphs.",
            "Asymptotic Study of Subcritical Graph Classes.",
            "A 3/2-Approximation Algorithm for Finding Spanning Trees with Many Leaves in Cubic Graphs.",
            "Stronger Bounds on Braess's Paradox and the Maximum Latency of Selfish Routing.",
            "Boxicity and Poset Dimension.",
            "Bounds on s-Distance Sets with Strength t.",
            "A Note on the Maximum Number of Edges of Nonflowerable Coin Graphs.",
            "A Linear Time Approximation Scheme for Maximum Quartet Consistency on Sparse Sampled Inputs.",
            "On the 2-Resonance of Fullerenes.",
            "Graphs with Two Crossings Are 5-Choosable.",
            "Perfect Matchings in Grid Graphs after Vertex Deletions.",
            "Face Numbers of Certain Cohen-Macaulay Flag Complexes.",
            "On Security of Statistical Databases.",
            "On Disjoint Common Bases in Two Matroids.",
            "Covering a Graph by Forests and a Matching.",
            "Proof of the Goresky Klapper Conjecture on Decimations of L-sequences.",
            "On Universal Cycles for new Classes of Combinatorial Structures.",
            "Broken Bracelets, Molien Series, Paraffin Wax, and an Elliptic Curve of Conductor 48.",
            "Deriving Finite Sphere Packings.",
            "Blocks and Cut Vertices of the Buneman Graph."
        ]
    },
    {
        "name": "SIDMA",
        "year": "2010",
        "info": "2010: Volume 24",
        "count": 113,
        "papers": [
            "Resilient Pancyclicity of Random and Pseudorandom Graphs.",
            "Combinatorics and Genus of Tropical Intersections and Ehrhart Theory.",
            "Spectrum of Sizes for Perfect Deletion-Correcting Codes.",
            "Star Coloring and Acyclic Coloring of Locally Planar Graphs.",
            "A Lower Bound for Network Navigability.",
            "Distinguishing Chromatic Number of Cartesian Products of Graphs.",
            "Retractions to Pseudoforests.",
            "Reductions of Young Tableau Bijections.",
            "Parameterized Tractability of Edge-Disjoint Paths on Directed Acyclic Graphs.",
            "Minimal Inequalities for an Infinite Relaxation of Integer Programs.",
            "1-Saturating Sets, Caps, and Doubling-Critical Sets in Binary Spaces.",
            "Interlacings for Random Walks on Weighted Graphs and the Interchange Process.",
            "Spherical Designs via Brouwer Fixed Point Theorem.",
            "Monotonic Directed Designs.",
            "Independent Sets of Maximum Weight in Apple-Free Graphs.",
            "Approximating Maximum Subgraphs without Short Cycles.",
            "Design is as Easy as Optimization.",
            "An Extension of the Nemhauser--Trotter Theorem to Generalized Vertex Cover with Applications.",
            "k-Robust Single-Message Transmission.",
            "On Computing the Frequencies of Induced Subhypergraphs.",
            "Short Cycle Covers of Graphs with Minimum Degree Three.",
            "Note on Bipartite Graph Tilings.",
            "On Abstract Rigidity Matroids.",
            "On Zero-Free Intervals in (1, 2) of Chromatic Polynomials of Some Families of Graphs.",
            "Removing Independently Even Crossings.",
            "The Conjectures of Alon--Tarsi and Rota in Dimension Prime Minus One.",
            "Drop Cost and Wavelength Optimal Two-Period Grooming with Ratio 4.",
            "Rank-Based Attachment Leads to Power Law Graphs.",
            "Permutation Capacities of Families of Oriented Infinite Paths.",
            "An EPTAS for Scheduling Jobs on Uniform Processors: Using an MILP Relaxation with a Constant Number of Integral Variables.",
            "2-Factors of Bipartite Graphs with Asymmetric Minimum Degrees.",
            "h-Fold Sums from a Set with Few Products.",
            "Voting Paths.",
            "Approximation Algorithms for Multicommodity Facility Location Problems.",
            "On Packable Digraphs.",
            "Hamilton Cycles in Random Graphs with a Fixed Degree Sequence.",
            "Complementary Iterated Floor Words and the Flora Game.",
            "A Subgroup of the Full Poset-Isometry Group.",
            "Cross-Intersecting Families of Partial Permutations.",
            "Computing the Girth of a Planar Graph in O(n logn) Time.",
            "Decomposition Construction for Secret Sharing Schemes with Graph Access Structures in Polynomial Time.",
            "Component Evolution in General Random Intersection Graphs.",
            "Bringing Toric Codes to the Next Dimension.",
            "Edge-Injective and Edge-Surjective Vertex Labellings.",
            "Formal Theory of Noisy Sensor Network Localization.",
            "The Last Fraction of a Fractional Conjecture.",
            "A Semiexact Degree Condition for Hamilton Cycles in Digraphs.",
            "The Alcuin Number of a Graph and Its Connections to the Vertex Cover Number.",
            "t-Perfection Is Always Strong for Claw-Free Graphs.",
            "On Optimal Strategies for a Hat Game on Graphs.",
            "Unitary Toric Classes, the Reality and Desire Diagram, and Sorting by Transpositions.",
            "A Spanning Tree Method for Bounding Hitting Times of Random Walks on Graphs.",
            "Transforming Triangulations on Nonplanar Surfaces.",
            "Bounds on Edge Colorings with Restrictions on the Union of Color Classes.",
            "Lot-Sizing with Stock Upper Bounds and Fixed Charges.",
            "Some Results for the Acceptance Urn Model.",
            "The Brunn--Minkowski Inequality and Nontrivial Cycles in the Discrete Torus.",
            "Connectivity of Random Cubic Sum Graphs.",
            "Dominating Subsets under Projections.",
            "Discrete Concavity and the Half-Plane Property.",
            "3-Choosability of Triangle-Free Planar Graphs with Constraints on 4-Cycles.",
            "On 3-Hypergraphs with Forbidden 4-Vertex Configurations.",
            "On Reverse-Free Codes and Permutations.",
            "Domination Game and an Imagination Strategy.",
            "A Value for Games Restricted by Augmenting Systems.",
            "Almost All C4-Free Graphs Have Fewer than (1-epsilon), ex(n, C4) Edges.",
            "On Face Vectors of Barycentric Subdivisions of Manifolds.",
            "Set Systems without a Strong Simplex.",
            "Flips in Graphs.",
            "An Algebraic Framework for Discrete Tomography: Revealing the Structure of Dependencies.",
            "The VPN Problem with Concave Costs.",
            "Cubic Graphs with Given Circular Chromatic Index.",
            "Chordal Graphs to Identify Graphical Model Solutions of Maximum of Entropy Under Constraints on Marginals.",
            "Rationality and Strongly Polynomial Solvability of Eisenberg--Gale Markets with Two Agents.",
            "On the Stable Paths Problem.",
            "3-Arc-Dominated Digraphs.",
            "Random Walks with Look-Ahead in Scale-Free Random Graphs.",
            "Vision-Based Pursuit-Evasion in a Grid.",
            "Hereditary Discrepancies in Different Numbers of Colors II.",
            "Embedding into Bipartite Graphs.",
            "On the Relative Generalized Hamming Weights of Linear Codes and their Subcodes.",
            "A Lower Bound on the Transposition Diameter.",
            "Hopf Structures on the Multiplihedra.",
            "Mixed Statistics on 01-Fillings of Moon Polyominoes.",
            "Symmetry as a Sufficient Condition for a Finite Flex.",
            "Complete Minors and Independence Number.",
            "Surviving Rates of Graphs with Bounded Treewidth for the Firefighter Problem.",
            "Strong Transversals in Hypergraphs and Double Total Domination in Graphs.",
            "Abacus Proofs of Schur Function Identities.",
            "The Tradeoff Function for a Class of $\\mathrm{RLL}(d, k)$ Constraints.",
            "Combinatorics and Geometry of Finite and Infinite Squaregraphs.",
            "Approximation of Partial Capacitated Vertex Cover.",
            "Edge-Connectivity, Eigenvalues, and Matchings in Regular Graphs.",
            "Routing Numbers of Cycles, Complete Bipartite Graphs, and Hypercubes.",
            "Embedding Spanning Trees in Random Graphs.",
            "Large-Girth Roots of Graphs.",
            "Multiple Coloring of Cone Graphs.",
            "Re-embeddings of Maximum 1-Planar Graphs.",
            "Designing Steiner Networks with Unicyclic Connected Components: An Easy Problem.",
            "The Limit Shape of Large Alternating Sign Matrices.",
            "Equitable Coloring of Sparse Planar Graphs.",
            "Ends and Vertices of Small Degree in Infinite Minimally k-(Edge)-Connected Graphs.",
            "The Balanced Decomposition Number and Vertex Connectivity.",
            "On the Number of Two-Dimensional Threshold Functions.",
            "Thomassen's Choosability Argument Revisited.",
            "Neighbor Systems and the Greedy Algorithm.",
            "A More Relaxed Model for Graph-Based Data Clustering: s-Plex Cluster Editing.",
            "On Additive Doubling and Energy.",
            "Flooding Time of Edge-Markovian Evolving Graphs.",
            "Obnoxious Centers in Graphs.",
            "Bridges in Highly Connected Graphs.",
            "A Construction of Infinite Sets of Intertwines for Pairs of Matroids.",
            "Bessel Polynomials and the Partial Sums of the Exponential Series."
        ]
    },
    {
        "name": "SIDMA",
        "year": "2009",
        "info": "2009/2010: Volume 23",
        "count": 142,
        "papers": [
            "Growth of Edge-Homogeneous Tessellations.",
            "Average Spectra and Minimum Distances of Low-Density Parity-Check Codes over Abelian Groups.",
            "The Linear Arboricity of Graphs on Surfaces of Negative Euler Characteristic.",
            "On Cosets of Weight 4 of BCH(2m, 8), m Even, and Exponential Sums.",
            "On the Distribution of Boolean Function Nonlinearity.",
            "K6-Minors in Triangulations on the Klein Bottle.",
            "Minimizing SONET ADMs in Unidirectional WDM Rings with Grooming Ratio Seven.",
            "The Erdös--Falconer Distance Problem, Exponential Sums, and Fourier Analytic Approach to Incidence Theorems in Vector Spaces over Finite Fields.",
            "Integer Exact Network Synthesis Problem.",
            "Ramsey-Type Problem for an Almost Monochromatic K4.",
            "Approximate Integer Decompositions for Undirected Network Design Problems.",
            "Integrality Gaps of Semidefinite Programs for Vertex Cover and Relations to l1 Embeddability of Negative Type Metrics.",
            "Disjoint Color-Avoiding Triangles.",
            "On (3, 1)*-Coloring of Plane Graphs.",
            "Geometric Realization of Möbius Triangulations.",
            "Cleaning Regular Graphs with Brushes.",
            "Approximating the Unweighted k-Set Cover Problem: Greedy Meets Local Search.",
            "Asymptotic Bounds on the Integrity of Graphs and Separator Theorems for Graphs.",
            "Can a Graph Have Distinct Regular Partitions?",
            "Coloring Random Intersection Graphs and Complex Networks.",
            "Centers for Random Walks on Trees.",
            "A Combinatorial Characterization of Coxeter Groups.",
            "On Cusick's Method and Value Sets of Certain Polynomials over Finite Fields.",
            "Matchings and Nonrainbow Colorings.",
            "Graph Searching in a Crime Wave.",
            "Reduction of Rota's Basis Conjecture to a Problem on Three Bases.",
            "6-Critical Graphs on the Klein Bottle.",
            "Toric Surface Codes and Minkowski Length of Polygons.",
            "Real Zeros and Normal Distribution for Statistics on Stirling Permutations Defined by Gessel and Stanley.",
            "A Bound on the Pathwidth of Sparse Graphs with Applications to Exact Algorithms.",
            "Maximal Label Search Algorithms to Compute Perfect and Minimal Elimination Orderings.",
            "More Patterns in Trees: Up and Down, Young and Old, Odd and Even.",
            "Spanning Directed Trees with Many Leaves.",
            "k-Chromatic Number of Graphs on Surfaces.",
            "Algorithms for Dualization over Products of Partially Ordered Sets.",
            "Linear Bound on the Irregularity Strength and the Total Vertex Irregularity Strength of Graphs.",
            "A General Lower Bound for Potentially H-Graphic Sequences.",
            "Distributive Lattices Defined for Representations of Rank Two Semisimple Lie Algebras.",
            "n-Ary Quasigroups of Order 4.",
            "Partial Gröbner Bases for Multiobjective Integer Linear Optimization.",
            "Fourier Spectra of Binomial APN Functions.",
            "An Arbitrary Starting Homotopy-Like Simplicial Algorithm for Computing an Integer Point in a Class of Polytopes.",
            "Pebbling Algorithms in Diameter Two Graphs.",
            "Computing the Degrees of All Cofactors in Mixed Polynomial Matrices.",
            "Yet Another Generalization of Postnikov's Hook Length Formula for Binary Trees.",
            "On the Integrality of Some Facility Location Polytopes.",
            "Steiner Trees and Convex Geometries.",
            "A Class of Arc-Transitive Cayley Graphs as Models for Interconnection Networks.",
            "Finding the Closest Lattice Point by Iterative Slicing.",
            "On Perfect Matchings in Uniform Hypergraphs with Large Minimum Vertex Degree.",
            "A Characterization of Almost CIS Graphs.",
            "Toric Geometry of Series-Parallel Graphs.",
            "The Number of Permutations Realized By a Shift.",
            "Crossings and Nestings of Two Edges in Set Partitions.",
            "Autocorrelation and Distinctness of Decimations of l-Sequences.",
            "Online Capacitated Interval Coloring.",
            "Decimations of l-Sequences and Permutations of Even Residues mod p.",
            "Minimum Transversals in Posimodular Systems.",
            "Classes of 3-Regular Graphs That Are (7, 2)-Edge-Choosable.",
            "Lexicographic Products and a Conjecture of Hahn and Jackson.",
            "Bipartite Graph Tiling.",
            "On Avoider-Enforcer Games.",
            "Clique-Width is NP-Complete.",
            "On Block Sequences of Steiner Quadruple Systems with Error Correcting Consecutive Unions.",
            "Wavelength Management in WDM Rings to Maximize the Number of Connections.",
            "A Step toward the Bermond--Thomassen Conjecture about Disjoint Cycles in Digraphs.",
            "Memoryless Rules for Achlioptas Processes.",
            "A Convex-Ear Decomposition for Rank-Selected Subposets of Supersolvable Lattices.",
            "On k-Resonant Fullerene Graphs.",
            "The Existence of r×4 Grid-Block Designs with r=3, 4.",
            "Backbone Colorings and Generalized Mycielski Graphs.",
            "Kneser Representations of Graphs.",
            "Designs from Matroids.",
            "Connectivity of Matching Graph of Hypercube.",
            "Universal Immersion Spaces for Edge-Colored Graphs and Nearest-Neighbor Metrics.",
            "Convex Rank Tests and Semigraphoids.",
            "The Co-2-plex Polytope and Integral Systems.",
            "Submodular Percolation.",
            "Planar Graphs without 7-Cycles Are 4-Choosable.",
            "Breaking the Symmetries of the Book Graph and the Generalized Petersen Graph.",
            "The Existence of N2 Resolvable Latin Squares.",
            "Relative Length of Longest Paths and Cycles in 2-Connected Graphs.",
            "Families of Sets with Intersecting Clusters.",
            "Divide-and-Conquer Approximation Algorithm for Vertex Cover.",
            "Half-Integral Vertex Covers on Bipartite Bidirected Graphs: Total Dual Integrality and Cut-Rank.",
            "Minconvex Factors of Prescribed Size in Graphs.",
            "On the Path-Width of Planar Graphs.",
            "Strong Hanani--Tutte on the Projective Plane.",
            "An Exact Result for Hypergraphs and Upper Bounds for the Tur[a-acute]n Density of Krr+1.",
            "An Ore-type Theorem for Perfect Packings in Graphs.",
            "Concentration of Random Determinants and Permanent Estimators.",
            "Optimal Real Number Graph Labellings of a Subfamily of Kneser Graphs.",
            "Approximation Algorithms and Hardness for Domination with Propagation.",
            "On the Approximability of Influence in Social Networks.",
            "A Simple Proof of the Karakhanyan--Riordan Theorem on the Even Discrete Torus.",
            "(1, -1)-Matrices with Near-Extremal Properties.",
            "Near-Universal Cycles for Subsets Exist.",
            "Optimizing Linear Extensions.",
            "On the Pagenumber of k-Trees.",
            "A New Lower Bound on the Number of Perfect Matchings in Cubic Graphs.",
            "Generating Facets for the Independence System Polytope.",
            "A Comparative Study of Periods in a Periodic-Finite-Type Shift.",
            "Improved Asymptotic Formulas for Counting Correlation Immune Boolean Functions.",
            "Matching Extendability in Hypercubes.",
            "The Two-Coloring Number and Degenerate Colorings of Planar Graphs.",
            "Network Perturbations and Asymptotic Periodicity of Recurrent Flows in Infinite Networks.",
            "Extremal Problems for Roman Domination.",
            "A Bijection for Rooted Maps on Orientable Surfaces.",
            "On the Size of Permutation Networks and Consequences for Efficient Simulation of Hypercube Algorithms on Bounded-Degree Networks.",
            "Edge-Face Total Chromatic Number of Halin Graphs.",
            "Paths with No Small Angles.",
            "Approximate Nonlinear Optimization over Weighted Independence Systems.",
            "Finding Planted Partitions in Random Graphs with General Degree Distributions.",
            "Probabilistic Analysis of a Motif Discovery Algorithm for Multiple Sequences.",
            "Multiple Random Walks in Random Regular Graphs.",
            "The Fractional Chromatic Number of Graphs of Maximum Degree at Most Three.",
            "Locating Errors Using ELAs, Covering Arrays, and Adaptive Testing Algorithms.",
            "A New Intersection Model and Improved Algorithms for Tolerance Graphs.",
            "The Surviving Rate of a Graph for the Firefighter Problem.",
            "A Tight Upper Bound on the Probabilistic Embedding of Series-Parallel Graphs.",
            "Upward Spirality and Upward Planarity Testing.",
            "The Ultimate Categorical Independence Ratio of Complete Multipartite Graphs.",
            "The LBFS Structure and Recognition of Interval Graphs.",
            "On-line Ramsey Numbers.",
            "Quasirandom Rumor Spreading on the Complete Graph Is as Fast as Randomized Rumor Spreading.",
            "First-Fit Algorithm for the On-Line Chain Partitioning Problem.",
            "An Efficient Sparse Regularity Concept.",
            "SC-Hamiltonicity and Its Linkages with Strong Hamiltonicity of a Graph.",
            "Direct Product Factorization of Bipartite Graphs with Bipartition-reversing Involutions.",
            "Maximizing Nonmonotone Submodular Functions under Matroid or Knapsack Constraints.",
            "Improved Compact Routing Tables for Planar Networks via Orderly Spanning Trees.",
            "On the Distribution of Orbits of PGL2(q) in Fqn and the Klapper Conjecture.",
            "Pancyclicity of Restricted Hypercube-Like Networks under the Conditional Fault Model.",
            "Repetition Error Correcting Sets: Explicit Constructions and Prefixing Methods.",
            "Large Bichromatic Point Sets Admit Empty Monochromatic 4-Gons.",
            "On the Complexity of Finding a Sun in a Graph.",
            "On the Hull Number of Triangle-Free Graphs.",
            "On the Classification of Type II Codes of Length 24.",
            "Asymptotic Enumeration ofk-Edge-Coloredk-Regular Graphs.",
            "A Short Note on an Advance in Estimating the Worst-Case Performance Ratio of the MPS Algorithm.",
            "A New Proof of the H-Coloring Dichotomy.",
            "The Joints Problem in $\\mathbb{R}^n$."
        ]
    },
    {
        "name": "SIDMA",
        "year": "2008",
        "info": "2008: Volume 22",
        "count": 98,
        "papers": [
            "Brooks-Type Theorems for Pair-List Colorings and List Homomorphisms.",
            "Faces of Generalized Cluster Complexes and Noncrossing Partitions.",
            "Switching Operations for Hadamard Matrices.",
            "Algorithms for Square-3PC(., .)-Free Berge Graphs.",
            "A New Algorithm for On-line Coloring Bipartite Graphs.",
            "Average Distance and Edge-Connectivity I.",
            "Tree-Related Widths of Graphs and Hypergraphs.",
            "Reconfigurations in Graphs and Grids.",
            "List-Coloring Squares of Sparse Subcubic Graphs.",
            "Phase Changes in Subtree Varieties in Random Recursive and Binary Search Trees.",
            "l-Chain Profile Vectors.",
            "Planarity, Colorability, and Minor Games.",
            "L(2, 1)-Labeling of Hamiltonian graphs with Maximum Degree 3.",
            "3-Facial Coloring of Plane Graphs.",
            "Normalized Matching Property of Restricted Subspace Lattices.",
            "Matroid Pathwidth and Code Trellis Complexity.",
            "On the Duals of Binary Hyper-Kloosterman Codes.",
            "Ore Condition and Nowhere-Zero 3-Flows.",
            "Large Monochromatic Components in Two-Colored Grids.",
            "Maximizing Supermodular Functions on Product Lattices, with Application to Maximum Constraint Satisfaction.",
            "On Planar Quasi-Parity Graphs.",
            "An Explicit Bound On Double Exponential Sums Related to Diffie--Hellman Distributions.",
            "Characterizing Ideal Weighted Threshold Secret Sharing.",
            "Adapted List Coloring of Graphs and Hypergraphs.",
            "Unit Circular-Arc Graph Representations and Feasible Circulations.",
            "Asymptotic Determination of Edge-Bandwidth of Multidimensional Grids and Hamming Graphs.",
            "Polychromatic Colorings of Subcubes of the Hypercube.",
            "Matroid Complexity and Nonsuccinct Descriptions.",
            "On Ramsey Minimal Graphs.",
            "Graph-Different Permutations.",
            "Realizing Degree Sequences with Graphs Having Nowhere-Zero 3-Flows.",
            "Hamilton Cycles in Random Lifts of Directed Graphs.",
            "Coloring of Triangle-Free Graphs on the Double Torus.",
            "Power Domination in Product Graphs.",
            "Planar Graphs of Odd-Girth at Least 9 are Homomorphic to the Petersen Graph.",
            "Hat Guessing Games.",
            "The Windy General Routing Polyhedron: A Global View of Many Known Arc Routing Polyhedra.",
            "On Complexity of the Subpattern Problem.",
            "Cubic Monomial Bent Functions: A Subclass of M.",
            "Rank-Width and Well-Quasi-Ordering.",
            "Coloring an Orthogonality Graph.",
            "Finding a Maximum Independent Set in a Sparse Random Graph.",
            "A Census of Small Latin Hypercubes.",
            "The Nine Morse Generic Tetrahedra.",
            "Walkers on the Cycle and the Grid.",
            "Combinatorial Properties of a Rooted Graph Polynomial.",
            "Testing Triangle-Freeness in General Graphs.",
            "A Note On Reed's Conjecture.",
            "The Minimum Number of Distinct Areas of Triangles Determined by a Set of n Points in the Plane.",
            "On the Complexity of Ordered Colorings.",
            "Hereditary Domination in Graphs: Characterization with Forbidden Induced Subgraphs.",
            "Matroid Parity and Jump Systems: A Solution to a Conjecture of Recski.",
            "Cycles Intersecting Edge-Cuts of Prescribed Sizes.",
            "Chains in the Noncrossing Partition Lattice.",
            "On the First-Fit Chromatic Number of Graphs.",
            "Nonlinear Matroid Optimization and Experimental Design.",
            "Spanning Trees with Many Leaves in Graphs With Minimum Degree Three.",
            "Near-Unanimity Functions and Varieties of Reflexive Graphs.",
            "Combinatorics of Pedigrees I: Counterexamples to a Reconstruction Question.",
            "Resonance Graphs and a Binary Coding for the 1-Factors of Benzenoid Systems.",
            "Largest Number of Subtrees of Trees with a Given Maximum Degree.",
            "Real Number Channel Assignments for Lattices.",
            "Computing Common Intervals of K Permutations, with Applications to Modular Decomposition of Graphs.",
            "Structure and Coloring of Graphs with Only Small Odd Cycles.",
            "On the Graph Bisection Cut Polytope.",
            "Labeled Partitions and the q-Derangement Numbers.",
            "Euler--Mahonian Statistics on Ordered Set Partitions.",
            "Long Local Searches for Maximal Bipartite Subgraphs.",
            "Elementary Incidence Theorems for Complex Numbers and Quaternions.",
            "Sequences with Changing Dependencies.",
            "Split Hypergraphs.",
            "Detecting a Theta or a Prism.",
            "Axis-Aligned Subdivisions with Low Stabbing Numbers.",
            "The Vector Space over GF(2) Generated by the Common Bases of Two Binary Matroids.",
            "Determinants and Longest Cycles of Graphs.",
            "Isometric Embeddings of Subdivided Complete Graphs in the Hypercube.",
            "Optimal Distance Labeling for Interval Graphs and Related Graph Families.",
            "A Unified View of Graph Searching.",
            "A Simple Linear Time LexBFS Cograph Recognition Algorithm.",
            "On Computing the Distinguishing Numbers of Planar Graphs and Beyond: A Counting Approach.",
            "Large Nearly Regular Induced Subgraphs.",
            "Perfect Codes of Length n with Kernels of Dimension n-log(n+1)-3.",
            "Incidence Matrices of Projective Planes and of Some Regular Bipartite Graphs of Girth 6 with Few Vertices.",
            "Nearly Optimal Visibility Representations of Plane Graphs.",
            "Hamilton Cycles in Planar Locally Finite Graphs.",
            "Prolific Codes with the Identifiable Parent Property.",
            "The Independent Even Factor Problem.",
            "Multidimensional Manhattan Street Networks.",
            "Partitions of Faulty Hypercubes into Paths with Prescribed Endvertices.",
            "Total-Coloring of Plane Graphs with Maximum Degree Nine.",
            "Odd Minimum Cut Sets and b-Matchings Revisited.",
            "Analysis of Serial Turbo Codes over Abelian Groups for Symmetric Channels.",
            "Tropical Linear Spaces.",
            "Bounds for the Real Number Graph Labellings and Application to Labellings of the Triangular Lattice.",
            "Orthogonal Drawings of Series-Parallel Graphs with Minimum Bends.",
            "How Many Points Can Be Reconstructed from k Projections?",
            "Minimum Cost Homomorphisms to Semicomplete Bipartite Digraphs.",
            "On the Polytope of the (1, 2)-Survivable Network Design Problem."
        ]
    },
    {
        "name": "SIDMA",
        "year": "2007",
        "info": "2007: Volume 21",
        "count": 78,
        "papers": [
            "A New Min-Cut Max-Flow Ratio for Multicommodity Flows.",
            "A Simple Gray Code to List All Minimal Signed Binary Representations.",
            "Crossing Graphs as Joins of Graphs and Cartesian Products of Median Graphs.",
            "Correlation of Graph-Theoretical Indices.",
            "The Spectrum of the Corona of Two Graphs.",
            "Sharp Threshold for Hamiltonicity of Random Geometric Graphs.",
            "Tur[a-acute]n's Theorem in the Hypercube.",
            "Every Monotone 3-Graph Property is Testable.",
            "A Generalization of Kotzig's Theorem and Its Application.",
            "Operations on M-Convex Functions on Jump Systems.",
            "A Natural Family of Flag Matroids.",
            "Algorithms for Fault-Tolerant Routing in Circuit-Switched Networks.",
            "The Complexity of Combinatorial Optimization Problems on d-Dimensional Boxes.",
            "Vertex-Magic Total Labelings of Regular Graphs.",
            "Two New Bounds for the Random-Edge Simplex-Algorithm.",
            "Quadratically Many Colorful Simplices.",
            "On Nearly Orthogonal Lattice Bases and Random Lattices.",
            "A Primal Barvinok Algorithm Based on Irrational Decompositions.",
            "Adjacent Vertex Distinguishing Edge-Colorings.",
            "On the Minimum Order of Extremal Graphs to have a Prescribed Girth.",
            "Precoloring Extension for 2-connected Graphs.",
            "Graphs Having Small Number of Sizes on Induced k-Subgraphs.",
            "Packing Odd Circuits.",
            "A Majorization Bound for the Eigenvalues of Some Graph Laplacians.",
            "A New Approximation Algorithm for the Nonpreemptive Scheduling of Independent Jobs on Identical Parallel Processors.",
            "Graph Powers, Delsarte, Hoffman, Ramsey, and Shannon.",
            "On Maximum Cost K{t, t}-Free t-Matchings of Bipartite Graphs.",
            "An Improved Approximation of the Achromatic Number on Bipartite Graphs.",
            "Small Diameters of Duals.",
            "Forbidden k-Sets in the Plane.",
            "The Mixing Set with Flows.",
            "RANDOM 2-SAT Does Not Depend on a Giant.",
            "On the Metric Dimension of Cartesian Products of Graphs.",
            "Ramsey Properties of Random k-Partite, k-Uniform Hypergraphs.",
            "Circular Coloring the Plane.",
            "The Lempel--Ziv Complexity of Fixed Points of Morphisms.",
            "Virtual Private Network Design: A Proof of the Tree Routing Conjecture on Ring Networks.",
            "Polynomial-Time Algorithms for Linear and Convex Optimization on Jump Systems.",
            "Further Results on Bar k-Visibility Graphs.",
            "Optimal Tree Structures for Group Key Management with Batch Updates.",
            "Erratum: Enumerating Typical Circulant Covering Projections onto a Circulant Graph.",
            "The Integer Knapsack Cover Polyhedron.",
            "Recognizing Chordal Probe Graphs and Cycle-Bicolorable Graphs.",
            "Prefix Reversals on Binary and Ternary Strings.",
            "Approximation Algorithms for Network Design with Metric Costs.",
            "Locating Servers for Reliability and Affine Embeddings.",
            "Discrete Lines and Wandering Paths.",
            "The Maximum Induced Bipartite Subgraph Problem with Edge Weights.",
            "On The Chromatic Number of Geometric Hypergraphs.",
            "Labelings of Graphs with Fixed and Variable Edge-Weights.",
            "Large Complete Bipartite Subgraphs In Incidence Graphs Of Points And Hyperplanes.",
            "Constructing Finite Field Extensions with Large Order Elements.",
            "A Two-Set Problem on Coloring the Integers.",
            "Crossing Stars in Topological Graphs.",
            "Optimal Lee-Type Local Structures in Cartesian Products of Cycles and Paths.",
            "Cayley Digraphs of Finite Abelian Groups and Monomial Ideals.",
            "Constructions of Optical Orthogonal Codes from Finite Geometry.",
            "Avoiding Monochromatic Sequences With Special Gaps.",
            "On Rota's Basis Conjecture.",
            "On Extremal k-Graphs Without Repeated Copies of 2-Intersecting Edges.",
            "Neighborhood Broadcasting in Hypercubes.",
            "Mod (2p + 1)-Orientations and $K1,2p+1-Decompositions.",
            "On the Existence of K5 \\setminuse-Designs with Application to Optical Networks.",
            "Improved Asymptotic Bounds for Codes Using Distinguished Divisors of Global Function Fields.",
            "The Complexity of the List Partition Problem for Graphs.",
            "Lower Bounds on Locality Sensitive Hashing.",
            "A Worst-Case Analysis of the Sequential Method to List the Minimal Hitting Sets of a Hypergraph.",
            "On the Number of Fixed Pairs in a Random Instance of the Stable Marriage Problem.",
            "Constant Weight Conflict-Avoiding Codes.",
            "Ramsey Numbers and the Size of Graphs.",
            "On k-Term DNF with the Largest Number of Prime Implicants.",
            "Coloring Bull-Free Perfectly Contractile Graphs.",
            "Combinatorial Optimization with Explicit Delineation of the Ground Set by a Collection of Subsets.",
            "Average Distance and Edge-Connectivity II.",
            "Explicit Construction of Small Folkman Graphs.",
            "Nonseparating Induced Cycles Consisting of Contractible Edges in k-Connected Graphs.",
            "Matched-Factor $d$-Domatic Coloring of Graphs.",
            "Cycle Systems in the Complete Bipartite Graph Plus a One-Factor."
        ]
    },
    {
        "name": "SIDMA",
        "year": "2006",
        "info": "2006: Volume 20",
        "count": 76,
        "papers": [
            "Girth, Pebbling, and Grid Thresholds.",
            "Computing Optimal Morse Matchings.",
            "Randomized Pursuit-Evasion with Local Visibility.",
            "Odd Hole Recognition in Graphs of Bounded Clique Size.",
            "Avoiding Patterns in Matrices Via a Small Number of Changes.",
            "A Theorem About a Contractible and Light Edge.",
            "Improved Bounds for Topological Cliques in Graphs of Large Girth.",
            "Optimum Secret Sharing Scheme Secure against Cheating.",
            "Differential Methods for Finding Independent Sets in Hypergraphs.",
            "Linear Orderings of Subfamilies of AT-Free Graphs.",
            "Embedding k-Outerplanar Graphs into l 1.",
            "Ranking Tournaments.",
            "The Linking Probability of Deep Spider-Web Networks.",
            "Full Rank Tilings of Finite Abelian Groups.",
            "Discrete Point X-rays.",
            "Improved Bounds for the Crossing Numbers of Km, n and Kn.",
            "Pairwise colliding permutations and the capacity of infinite graphs.",
            "M-Convex Functions on Jump Systems: A General Framework for Minsquare Graph Factor Problem.",
            "On Stability, Error Correction, and Noise Compensation in Discrete Tomography.",
            "Collective tree spanners of graphs.",
            "The Steiner k-Cut Problem.",
            "Multicolored Hamilton Cycles and Perfect Matchings in Pseudorandom Graphs.",
            "On Multicast Rearrangeable 3-stage Clos Networks Without First-Stage Fan-Out.",
            "A Dichotomy Theorem on Fixed Points of Several Nonexpansive Mappings.",
            "Real Number Graph Labellings with Distance Conditions.",
            "A Bound on the Precision Required to Estimate a Boolean Perceptron from Its Average Satisfying Assignment.",
            "The Minor Crossing Number.",
            "The Bidimensional Theory of Bounded-Genus Graphs.",
            "Classification of Bipartite Boolean Constraint Satisfaction through Delta-Matroid Intersection.",
            "The Volume of the Giant Component of a Random Graph with Given Expected Degrees.",
            "On the Spanning Ratio of Gabriel Graphs and beta-Skeletons.",
            "Full Color Theorems for L(2, 1)-Colorings.",
            "A Linear-Time Algorithm for Finding a Maximal Planar Subgraph.",
            "Sparse Sourcewise and Pairwise Distance Preservers.",
            "On the Greedy Superstring Conjecture.",
            "A Note on Unsatisfiable k-CNF Formulas with Few Occurrences per Variable.",
            "On Graph Associations.",
            "Construction of Large Graphs with No Optimal Surjective L(2, 1)-Labelings.",
            "On PreemptiveResource Constrained Scheduling: Polynomial-Time Approximation Schemes.",
            "Multicolored Parallelisms of Isomorphic Spanning Trees.",
            "Autocorrelations of Maximum Period FCSR Sequences.",
            "A Splitter Theorem for Internally 4-Connected Binary Matroids.",
            "Matroid $T$-Connectivity.",
            "A Note on Quasi-triangulated Graphs.",
            "Cycle Decompositions of Kn,n-I.",
            "Shortest Paths in the Tower of Hanoi Graph and Finite Automata.",
            "Dense Arrangements are Locally Very Dense. I.",
            "Comparing Partial Rankings.",
            "A Combinatorial Interpretation of the Chebyshev Polynomials.",
            "A New Periodicity Lemma.",
            "Cycle Extendability and Hamiltonian Cycles in Chordal Graph Classes.",
            "Cycle Extendability of Hamiltonian Interval Graphs.",
            "The Channel Assignment Problem with Variable Weights.",
            "Compact Routing with Name Independence.",
            "Reconstructing Chain Functions in Genetic Networks.",
            "On the Strong Chromatic Number of Graphs.",
            "Approximation Algorithms for Rectangle Stabbing and Interval Stabbing Problems.",
            "The Complexity of Graph Pebbling.",
            "On Graphs Having No Chromatic Zeros in (1, 2).",
            "Uniform Formulae for Coefficients of Meromorphic Functions in Two Variables. Part I.",
            "On Minimum Degree Implying That a Graph is H-Linked.",
            "Optimal Interleaving on Tori.",
            "On Budgeted Optimization Problems.",
            "0, 1/2-Cuts and the Linear Ordering Problem: Surfaces That Define Facets.",
            "Mod-2 Cuts Generation Yields the Convex Hull of Bounded Integer Feasible Sets.",
            "Factoring Finite Abelian Groups by Subsets with Maximal Span.",
            "Computing the Tutte Polynomial on Graphs of Bounded Clique-Width.",
            "Multivariable Codes Over Finite Chain Rings: Serial Codes.",
            "On Identities Concerning the Numbers of Crossings and Nestings of Two Edges in Matchings.",
            "On cost matrices with two and three distinct values of Hamiltonian paths and cycles.",
            "Toric Surface Codes and Minkowski Sums.",
            "Online Bin Packing with Cardinality Constraints.",
            "Set Systems with No Singleton Intersection.",
            "Rota's Basis Conjecture for Paving Matroids.",
            "Representing Small Identically Self-Dual Matroids by Self-Dual Codes.",
            "Higher-Dimensional Packing with Order Constraints."
        ]
    },
    {
        "name": "SIDMA",
        "year": "2005",
        "info": "2005: Volume 19",
        "count": 66,
        "papers": [
            "An Improved Analysis for Approximating the Smallest k-Edge Connected Spanning Subgraph of a Multigraph.",
            "Bimodality and Phase Transitions in the Profile Variance of Random Binary Search Trees.",
            "What Costs Are Minimized by Huffman Trees?",
            "Exact Minimum Density of Codes Identifying Vertices in the Square Grid.",
            "On Equitable Coloring of d-Degenerate Graphs.",
            "Computation in Noisy Radio Networks.",
            "The Coffman--Graham Algorithm Optimally Solves UET Task Systems with Overinterval Orders.",
            "Tighter Bounds for Graph Steiner Tree Approximation.",
            "Hamiltonian Cycles with Prescribed Edges in Hypercubes.",
            "On Projective Codes Satisfying the Chain Condition.",
            "A Random Version of Shepp's Urn Scheme.",
            "Alternative Digit Sets for Nonadjacent Representations.",
            "An Upper Bound for the d-Dimensional Analogue of Heilbronn's Triangle Problem.",
            "Enumerating Typical Circulant Covering Projections Onto a Circulant Graph.",
            "On the Structure of Graphs with Non-Surjective L(2, 1)-Labelings.",
            "Circular Distance Two Labeling and the lambda-Number for Outerplanar Graphs.",
            "Repeated Angles in Three and Four Dimensions.",
            "Constructive Bounds on Ordered Factorizations.",
            "A Strongly Polynomial Cut Canceling Algorithm for Minimum Cost Submodular Flow.",
            "Stabilization of Block-Type-Decodability Properties for Constrained Systems.",
            "Optimal Augmentation for Bipartite Componentwise Biconnectivity in Linear Time.",
            "Classification of Self-Orthogonal Codes over F3 and F4.",
            "On Unavoidable Sets of Word Patterns.",
            "A Convex Quadratic Characterization of the Lovász Theta Number.",
            "Enumeration of Branched Coverings of Nonorientable Surfaces With Cyclic Branch Points.",
            "Nonseparating Planar Chains in 4-Connected Graphs.",
            "Resolvable Steiner Quadruple Systems for the Last 23 Orders.",
            "Bounds on the Travel Cost of a Mars Rover Prototype Search Heuristic.",
            "Labeling Schemes for Small Distances in Trees.",
            "A Class of General Supertree Methods for Nested Taxa.",
            "Polynomial Representations of Symmetric Partial Boolean Functions.",
            "Two-Part and k-Sperner Families: New Proofs Using Permutations.",
            "Polyhedral Analysis for the Uncapacitated Hub Location Problem with Modular Arc Capacities.",
            "Traffic Grooming in Unidirectional Wavelength-Division Multiplexed Rings with Grooming Ratio C = 6.",
            "Disks on a Tree: Analysis of a Combinatorial Game.",
            "Algorithms for Perfectly Contractile Graphs.",
            "On the 3-Terminal Cut Polyhedron.",
            "A Brooks-Type Theorem for the Generalized List T-Coloring.",
            "Multilevel Distance Labelings for Paths and Cycles.",
            "Graph-Theoretic Generalization of the Secretary Problem: The Directed Path Case.",
            "Simplicial Complexes of Graphs and Hypergraphs with a Bounded Covering Number.",
            "Decycling Cartesian Products of Two Cycles.",
            "Isomorph-Free Exhaustive Generation of Designs with Prescribed Groups of Automorphisms.",
            "The Asymptotic Number of Binary Codes and Binary Matroids.",
            "Generalized Alon--Boppana Theorems and Error-Correcting Codes.",
            "The Strong Chromatic Index of Random Graphs.",
            "Solvability of Graph Inequalities.",
            "The PMU Placement Problem.",
            "On the Equivalence between the Primal-Dual Schema and the Local Ratio Technique.",
            "Integer Decomposition for Polyhedra Defined by Nearly Totally Unimodular Matrices.",
            "A Genus Bound for Digital Image Boundaries.",
            "Graph Minors and Reliable Single Message Transmission.",
            "Chain Decompositions of 4-Connected Graphs.",
            "Polylogarithmic Additive Inapproximability of the Radio Broadcast Problem.",
            "Computing Minimal Triangulations in Time O(nalpha log n) = o(n 2.376).",
            "Short Answers to Exponentially Long Questions: Extremal Aspects of Homomorphism Duality.",
            "An Application of Ramsey Theory to Coding for the Optical Channel.",
            "Dynamic TCP Acknowledgment: Penalizing Long Delays.",
            "Well-Covered Vector Spaces of Graphs.",
            "On the Complexity of Some Enumeration Problems for Matroids.",
            "Labelling Cayley Graphs on Abelian Groups.",
            "The Discrete Sine Transform and the Spectrum of the Finite q-ary Tree.",
            "Improved p-ary Codes and Sequence Families from Galois Rings of Characteristic p2.",
            "Sparse Distance Preservers and Additive Spanners.",
            "The Two-Batch Liar Game over an Arbitrary Channel.",
            "Bisubmodular Function Minimization."
        ]
    },
    {
        "name": "SIDMA",
        "year": "2004",
        "info": "2004/2005: Volume 18",
        "count": 64,
        "papers": [
            "Codes Closed under Arbitrary Abelian Group of Permutations.",
            "Improved Compact Visibility Representation of Planar Graph via Schnyder's Realizer.",
            "On the Hardness of 4-Coloring a 3-Colorable Graph.",
            "An Ear Decomposition Approach to Approximating the Smallest 3-Edge Connected Spanning Subgraph of a Multigraph.",
            "Counting Strings with Given Elementary Symmetric Function Evaluations II: Circular Strings.",
            "Recognizing Powers of Proper Interval, Split, and Chordal Graph.",
            "Small Examples of Nonconstructible Simplicial Balls and Spheres.",
            "A Note on Bandits with a Twist.",
            "The Nonapproximability of Non-Boolean Predicates.",
            "On Decimations of l-Sequences.",
            "Exact Word-Run Statistics in Random Orderings.",
            "A Characterization of Acyclic Switching Classes of Graphs Using Forbidden Subgraphs.",
            "On the Number of Minimum Cuts in a Graph.",
            "On the Band-, Tree-, and Clique-Width of Graphs with Bounded Vertex Degree.",
            "Improved Combinatorial Approximation Algorithms for the k-Level Facility Location Problem.",
            "Approximating Maximum Clique by Removing Subgraphs.",
            "Optimizing Bull-Free Perfect Graphs.",
            "Parsimonious Multigraphs.",
            "Constraining Plane Configurations in CAD: Circles, Lines, and Angles in the Plane.",
            "Dynamic Digraph Connectivity Hastens Minimum Sum-of-Diameters Clustering.",
            "Two Edge-Disjoint Hop-Constrained Paths and Polyhedra.",
            "A Note on the Proof of Niho's Conjecture.",
            "Deterministic Hypergraph Coloring and Its Applications.",
            "Faster Deterministic Broadcasting in Ad Hoc Radio Networks.",
            "On-Line Load Balancing of Temporary Tasks on Identical Machines.",
            "An Interlacing Result on Normalized Laplacians.",
            "Three-Dimensional Periodicity and Its Application to Pattern Matching.",
            "Resolving the Existence of Full-Rank Tilings of Binary Hamming Spaces.",
            "Extremal Graphs without Topological Complete Subgraphs.",
            "Noncrossing Partitions for the Group Dn.",
            "On the Multiplicity of Parts in a Random Composition of a Large Integer.",
            "Secure Hypergraphs: Privacy from Partial Broadcast.",
            "Coloring Powers of Chordal Graphs.",
            "The Bar Visibility Number of a Graph.",
            "The Radon Transform on nk ast.",
            "Orientable and Nonorientable Genera for Some Complete Tripartite Graphs.",
            "Finding Large Independent Sets in Graphs and Hypergraphs.",
            "Bidimensional Parameters and Local Treewidth.",
            "Partition-Optimization with Schur Convex Sum Objective Functions.",
            "Matroids Induced by Packing Subgraphs.",
            "Precoloring Extensions of Brooks' Theorem.",
            "Certifying LexBFS Recognition Algorithms for Proper Interval Graphs and Proper Interval Bigraphs.",
            "On the Co-P3-Structure of Perfect Graphs.",
            "Edge-Disjoint Isomorphic Multicolored Trees and Cycles in Complete Graphs.",
            "Detachment of Vertices of Graphs Preserving Edge-Connectivity.",
            "Automorphisms of Projective Spaces and Min-Wise Independent Sets of Permutations.",
            "A Linear Programming Formulation and Approximation Algorithms for the Metric Labeling Problem.",
            "A Tight Lower Bound for Online Monotonic List Labeling.",
            "Bridging Separations in Matroids.",
            "Lower Bounds for h-Vectors ofk-CM, Independence, and Broken Circuit Complexes.",
            "Combinatorial Constructions for Optimal Splitting Authentication Codes.",
            "Lower Bounds from Tile Covers for the Channel Assignment Problem.",
            "Learning a Hidden Subgraph.",
            "Set Systems with Restricted Cross-Intersections and the Minimum Rank of Inclusion Matrices.",
            "The Cover Time of Random Regular Graphs.",
            "A Recursive Construction For Regular Difference Triangle Sets.",
            "On Identifying Maximal Covers.",
            "Minimal-Time k-Line Broadcasting.",
            "Hypercubes As Direct Products.",
            "Small Contingency Tables with Large Gaps.",
            "On the Behavior of a Family of Meta-Fibonacci Sequences.",
            "On Optimal Edge-Robust and Vertex-Robust (1, leql)-Identifying Codes.",
            "Four Characters Suffice to Convexly Define a Phylogenetic Tree.",
            "On the Optimality of Coloring with a Lattice."
        ]
    },
    {
        "name": "SIDMA",
        "year": "2003",
        "info": "2003/2004: Volume 17",
        "count": 42,
        "papers": [
            "Some New Aspects of the Coupon Collector's Problem.",
            "Internet Routing and Related Topology Issues.",
            "On the Homology of the h, k-Equal Dowling Lattice.",
            "Detachments Preserving Local Edge-Connectivity of Graphs.",
            "Constrained Edge-Splitting Problems.",
            "On Z2k-Linear and Quaternary Codes.",
            "The Complexity of the Extendibility Problem for Finite Posets.",
            "Cooperative Games under Augmenting Systems.",
            "Comparing Top k Lists.",
            "Acyclic Homomorphisms and Circular Colorings of Digraphs.",
            "Bounds on the List-Decoding Radius of Reed-Solomon Codes.",
            "The Determination of the Chain Good Weight Hierarchies with High Dimension.",
            "Solutions for Two Conjectures on the Inverse Problem of the Wiener Index of Peptoids.",
            "Extremal Sets Minimizing Dimension-Normalized Boundary in Hamming Graphs.",
            "A 5/8 Approximation Algorithm for the Maximum Asymmetric TSP.",
            "Convex Matroid Optimization.",
            "Symmetric Codes over Rings.",
            "Labeling Planar Graphs with Conditions on Girth and Distance Two.",
            "Equalities among Capacities of (d, k)-Constrained Systems.",
            "Maximizing the Shannon Capacity of Constrained Systems with Two Constraints.",
            "On Regular Graphs Optimally Labeled with a Condition at Distance Two.",
            "Split-Perfect Graphs: Characterizations and Algorithmic Use.",
            "Coloring the Maximal Cliques of Graphs.",
            "Number Theoretic Designs for Directed Regular Graphs of Small Diameter.",
            "Improved Approximation Algorithms for the Demand Routing and Slotting Problem with Unit Demands on Rings.",
            "Graph Imperfection with a Co-Site Constraint.",
            "Error Exponents of Expander Codes under Linear-Complexity Decoding.",
            "Equivalence of the 1-Rate Model to the Classical Model on Strictly Nonblocking Switching Networks.",
            "Constraint Satisfaction Problems on Intervals and Length.",
            "The Degree-Diameter Problem for Several Varieties of Cayley Graphs I: The Abelian Case.",
            "Lower Bounds on the Broadcasting and Gossiping Time of Restricted Protocols.",
            "On Local Versus Global Satisfiability.",
            "On the Maximal Codes of Length 3 with the 2-Identifiable Parent Property.",
            "Radius Three Trees in Graphs with Large Chromatic Number.",
            "Minimizing Wirelength in Zero and Bounded Skew Clock Trees.",
            "Encoding Fullerenes and Geodesic Domes.",
            "Independent Sets in Regular Hypergraphs and Multidimensional Runlength-Limited Constraints.",
            "On Distributions Computable by Random Walks on Graphs.",
            "Listen to Your Neighbors: How (Not) to Reach a Consensus.",
            "Fractional Packing of T-Joins.",
            "Exact Formulae for the Lova'sz Theta Function of Sparse Circulant Graphs.",
            "Counting Strings with Given Elementary Symmetric Function Evaluations I: Strings over Zp with p Prime."
        ]
    },
    {
        "name": "SIDMA",
        "year": "2002",
        "info": "2002/2003: Volume 16",
        "count": 48,
        "papers": [
            "On the Structure of Some Spaces of Tilings.",
            "Testing Basic Boolean Formulae.",
            "Enumeration of Matchings in the Incidence Graphs of Complete and Complete Bipartite Graphs.",
            "Counting Claw-Free Cubic Graphs.",
            "Constructions of 3-Colorable Cores.",
            "The Special Function Field Sieve.",
            "Asymptotic Size Ramsey Results for Bipartite Graphs.",
            "Algebraic Techniques for Constructing Minimal Weight Threshold Functions.",
            "Facet Obtaining Procedures for Set Packing Problems.",
            "Improved Inclusion-Exclusion Identities and Bonferroni Inequalities with Reliability Applications.",
            "The Existence of 2x4 Grid-Block Designs and Their Applications.",
            "Stirling Numbers for Complex Arguments: Asymptotics and Identities.",
            "Minimizing a Convex Cost Closure Set.",
            "On Generalized Delannoy Paths.",
            "Contrast Optimal Threshold Visual Cryptography Schemes.",
            "Finite Subsets of the Plane are 18-Reconstructible.",
            "Random Krylov Spaces over Finite Fields.",
            "Makespan Minimization in Job Shops: A Linear Time Approximation Scheme.",
            "Testing Bandwidth k for k-Connected Graphs.",
            "Makespan Minimization in No-Wait Flow Shops: A Polynomial Time Approximation Scheme.",
            "1-Hyperbolic Graphs.",
            "Strongly Connected Spanning Subdigraphs with the Minimum Number of Arcs in Quasi-transitive Digraphs.",
            "A New Lower Bound for Tree-Width Using Maximum Cardinality Search.",
            "Nonlinearity of Boolean Functions and Hyperelliptic Curves.",
            "A High Girth Graph Construction.",
            "Complexes of t-Colorable Graphs.",
            "Full-Rank Tilings of $\\mathbbF^8_\\!2$ Do Not Exist.",
            "Testing of Clustering.",
            "The Spectra of Cycle Prefix Digraphs.",
            "On Polynomial-Factor Approximations to the Shortest Lattice Vector Length.",
            "A Theorem about the Channel Assignment Problem.",
            "Line Graphs of Helly Hypergraphs.",
            "List Partitions.",
            "Localized Eigenvectors from Widely Spaced Matrix Modifications.",
            "Frameproof Codes.",
            "On the b-Stable Set Polytope of Graphs without Bad K4.",
            "Bipartite Domination and Simultaneous Matroid Covers.",
            "Equitable Coloring of k-Uniform Hypergraphs.",
            "Amortizing Randomness in Private Multiparty Computations.",
            "Fourier Analysis of a Class of Finite Radon Transforms.",
            "Optimal Online Algorithms for Minimax Resource Scheduling.",
            "Projections of Binary Linear Codes onto Larger Fields.",
            "On Playing Golf with Two Balls.",
            "Nonseparating Cycles in 4-Connected Graphs.",
            "An Explicit Construction of Lower-Diameter Cubic Graphs.",
            "Graph Subcolorings: Complexity and Algorithms.",
            "Coloring Powers of Planar Graphs.",
            "Statistical Inference for Internal Network Reliability with Spatial Dependence."
        ]
    },
    {
        "name": "SIDMA",
        "year": "2001",
        "info": "2001/2002: Volume 15",
        "count": 37,
        "papers": [
            "An Algebraic Characterization of Completely Regular Codes in Distance-Regular Graphs.",
            "Determining When the Absolute State Complexity of a Hermitian Code Achieves Its DLP Bound.",
            "On the Distributed Complexity of Computing Maximal Matchings.",
            "Constructing Worst Case Instances for Semidefinite Programming Based Approximation Algorithms.",
            "Neighborhood Preserving Hashing and Approximate Queries.",
            "On Covering a Bipartite Graph with Cycles.",
            "Practical Approximation Algorithms for Zero- and Bounded-Skew Trees.",
            "Facets of the Weak Order Polytope Derived from the Induced Partition Projection.",
            "Efficiency of Local Search with Multiple Local Optima.",
            "Cyclic Colorings of 3-Polytopes with Large Maximum Face Size.",
            "On Some Polynomials Related to Weight Enumerators of Linear Codes.",
            "Single Machine Scheduling with Release Dates.",
            "Finding a 2-Core of a Tree in Linear Time.",
            "Testing k-colorability.",
            "Multicovering Bounds from Relative Covering Radii.",
            "Partial Cubes and Crossing Graphs.",
            "Exact Size of Binary Space Partitionings and Improved Rectangle Tiling Algorithms.",
            "Graphs with Connected Medians.",
            "Finding 1-Factors in Bipartite Regular Graphs and Edge-Coloring Bipartite Graphs.",
            "Infinite Families of 3-Designs from Z4-Goethals Codes with Block Size 8.",
            "Optimal Consecutive-k-out-of-n: G Cycle for n \\leq 2k+1.",
            "Fault-Tolerant Embeddings of Hamiltonian Circuits in k-ary n-Cubes.",
            "Ideal Binary Clutters, Connectivity, and a Conjecture of Seymour.",
            "Dominating Pair Graphs.",
            "Multidimensional Convolutional Codes.",
            "Interference Patterns in Regular Graphs with Bijective Colorings.",
            "Strong T-Perfection of Bad-K4-Free Graphs.",
            "How to Be an Efficient Snoop, or the Probe Complexity of Quorum Systems.",
            "Approximating Bandwidth by Mixing Layouts of Interval Graphs.",
            "Scheduling Unrelated Machines by Randomized Rounding.",
            "On the Facet-Inducing Antiweb-Wheel Inequalities for Stable Set Polytopes.",
            "Characterization of Efficiently Parallel Solvable Problems on Distance-Hereditary Graphs.",
            "Domination in Graphs Applied to Electric Power Networks.",
            "Robust Matchings.",
            "Choosability and Edge Choosability of Planar Graphs without Intersecting Triangles.",
            "A Fast Algorithm for Generating Nonisomorphic Chord Diagrams.",
            "Inverting Random Functions II: Explicit Bounds for Discrete Maximum Likelihood Estimation, with Applications."
        ]
    },
    {
        "name": "SIDMA",
        "year": "2001",
        "info": "2001: Volume 14",
        "count": 43,
        "papers": [
            "Improved Algorithms and Analysis for Secretary Problems and Generalizations.",
            "Labeling Products of Complete Graphs with a Condition at Distance Two.",
            "Sufficient Conditions for Two Tree Reconstruction Techniques to Succeed on Sufficiently Long Sequences.",
            "Compact Representations of Cuts.",
            "Better Approximation Guarantees for Job-Shop Scheduling.",
            "Enumeration of Equicolorable Trees.",
            "A Note on a Question of C. D. Savage.",
            "Cyclic Chromatic Number of 3-Connected Plane Graphs.",
            "Approximate Edge Splitting.",
            "Extremal Properties for Dissections of Convex 3-Polytopes.",
            "On the Distribution of Diffie-Hellman Triples with Sparse Exponents.",
            "Improving on the 1.5-Approximation of a Smallest 2-Edge Connected Spanning Subgraph.",
            "Compact Representations of the Intersection Structure of Families of Finite Sets.",
            "Sorting Strings by Reversals and by Transpositions.",
            "The Wakeup Problem in Synchronous Broadcast Systems.",
            "A New Property and a Faster Algorithm for Baseball Elimination.",
            "A Lower Bound for Heilbronn's Triangle Problem in d Dimensions.",
            "A Note on Iterating an alpha-ary Gray Code.",
            "The Number of Irreducible Polynomials and Lyndon Words with Given Trace.",
            "A 0.5-Approximation Algorithm for MAX DICUT with Given Sizes of Parts.",
            "Optimal (9v, 4, 1) Optical Orthogonal Codes.",
            "On the Optimality of General Lower Bounds for Broadcasting and Gossiping.",
            "Construction of Ferrero Pairs of All Possible Orders.",
            "Monochromatic Partitions of Complete Uniform Hypergraphs.",
            "An Efficient Algorithm for the Ring Loading Problem with Integer Demand Splitting.",
            "On Lower Bounds for Selecting the Median.",
            "Median Selection Requires (2+epsilon)n Comparisons.",
            "The Maximum Edge-Disjoint Paths Problem in Bidirected Trees.",
            "Partitions and (m and n) Sums of Products - Two Cell Partition.",
            "Minimum Span of No-Hole (r+1)-Distant Colorings.",
            "Transformations on Regular Nondominated Coteries and Their Applications.",
            "On Approximating the Achromatic Number.",
            "A Hypergraph Approach to the Identifying Parent Property: The Case of Multiple Parents.",
            "Forcing Structures and Cliques in Uniquely Vertex Colorable Graphs.",
            "Blocking Semiovals of Type (1, m+1, n+1).",
            "An Optimal Online Algorithm for Bounded Space Variable-Sized Bin Packing.",
            "Classification of Homomorphisms to Oriented Cycles and of k-Partite Satisfiability.",
            "Equireplicate Balanced Binary Codes for Oligo Arrays.",
            "The Obnoxious Center Problem on a Tree.",
            "Structural Diagnosis of Wiring Networks: Finding Connected Components of Unknown Subgraphs.",
            "Reserving Resilient Capacity in a Network.",
            "When is Individual Testing Optimal for Nonadaptive Group Testing?",
            "Asymptotic Minimum Covering Radius of Block Codes."
        ]
    },
    {
        "name": "SIDMA",
        "year": "2000",
        "info": "2000: Volume 13",
        "count": 38,
        "papers": [
            "Correction to Edge-Bandwidth of Graphs.",
            "Bounds for Dispersers, Extractors, and Depth-Two Superconcentrators.",
            "Nonhamiltonian 3-Connected Cubic Planar Graphs.",
            "Completely Disconnecting the Complete Graph.",
            "Recognizing Perfect 2-Split Graphs.",
            "A Best Possible Deterministic On-Line Algorithm for Minimizing Maximum Delivery Time on a Single Machine.",
            "Multiprocessor Scheduling with Rejection.",
            "The Weight Hierarchy of Hermitian Codes.",
            "Weight Divisibility of Cyclic Codes, Highly Nonlinear Functions on F2m, and Crosscorrelation of Maximum-Length Sequences.",
            "On Isoperimetric Connectivity in Vertex-Transitive Graphs.",
            "Optimal Rounding of Instantaneous Fractional Flows Over Time.",
            "Overlap and Covering Polynomials with Applications to Designs and Self-Dual Codes.",
            "Convex-Round and Concave-Round Graphs.",
            "Lattice-Simplex Coverings and the 84-Shape.",
            "Connected Domination and Spanning Trees with Many Leaves.",
            "Boolean Normal Forms, Shellability, and Reliability Computations.",
            "A Study on r-Configurations - A Resource Assignment Problem on Graphs.",
            "Approximating Minimum Subset Feedback Sets in Undirected Graphs with Applications.",
            "Directional Routing via Generalized st-Numberings.",
            "Two-Dimensional Gantt Charts and a Scheduling Algorithm of Lawler.",
            "The Size of a Graph Without Topological Complete Subgraphs.",
            "Evaluation, Strength, and Relevance of Variables of Boolean Functions.",
            "A Tight Bound on the Irregularity Strength of Graphs.",
            "Computing Functions of a Shared Secret.",
            "An Optimization Problem in Statistical Databases.",
            "The Graph of Linear Extensions Revisited.",
            "The Online Transportation Problem.",
            "Bin Packing with Discrete Item Sizes, Part I: Perfect Packing Theorems and the Average Case Behavior of Optimal Packings.",
            "The Capacitated K-Center Problem.",
            "Subset-Restricted Interchange for Dynamic Min-Max Scheduling Problems.",
            "Exact Analysis of Exact Change: The k-Payment Problem.",
            "Graph Searching and Interval Completion.",
            "Learning Deterministic Finite Automata from Smallest Counterexamples.",
            "Bounds for Codes Identifying Vertices in the Hexagonal Grid.",
            "Approximating Fractional Multicommodity Flow Independent of the Number of Commodities.",
            "Well-Spaced Labelings of Points in Rectangular Grids.",
            "Learning Polynomials with Queries: The Highly Noisy Case.",
            "Uniqueness of Some Resolution IV Two-Level Regular Fractional Factorial Designs."
        ]
    },
    {
        "name": "SIDMA",
        "year": "1999",
        "info": "1999: Volume 12",
        "count": 39,
        "papers": [
            "Flows in Undirected Unit Capacity Networks.",
            "A Linear Time Algorithm for Embedding Graphs in an Arbitrary Surface.",
            "Nonsystematic Perfect codes.",
            "Well-Ordered Steiner Triple Systems and 1-Perfect Partitions of the n-cube.",
            "Constructive Quasi-Ramsey Numbers and Tournament Ranking.",
            "Optimal Bounds for Matching Routing on Trees.",
            "On-Line Difference Maximization.",
            "Sorting Permutations by Reversals and Eulerian Cycle Decompositions.",
            "Median Graphs and Triangle-Free Graphs.",
            "Convexity and HHD-Free Graphs.",
            "Constraining Plane Configurations in Computer-Aided Design: Combinatorics of Directions and Lengths.",
            "On Stirling Numbers for Complex Arguments and Hankel Contours.",
            "Edge-Connectivity Augmentation with Partition Constraints.",
            "On Perfect Matchings and Hamilton Cycles in Sums of Random Trees.",
            "The Size of the Largest Components in Random Planar Maps.",
            "Graph Ear Decompositions and Graph Embeddings.",
            "New Bounds On Covering Radius as a Function of Dual Distance.",
            "Interconnecting Highways.",
            "Bounded Stable Sets: Polytopes and Colorings.",
            "Independent Sets in Asteroidal Triple-Free Graphs.",
            "A 2-Approximation Algorithm for the Undirected Feedback Vertex Set Problem.",
            "Switching Distance Between Graphs with the Same Degrees.",
            "Edge-Bandwidth of Graphs.",
            "Linear-Time Succinct Encodings of Planar Graphs via Canonical Orderings.",
            "New Facets of the Linear Ordering Polytope.",
            "Embedding Graphs into a Three Page Book with O(m log n) Crossings of Edges over the Spine.",
            "Finding Subsets Maximizing Minimum Structures.",
            "The Linear Extension Diameter of a Poset.",
            "Rankings of Directed Graphs.",
            "On-Line 3-Chromatic Graphs I. Triangle-Free Graphs.",
            "Note: An Upper Bound for the Diameter of a Graph.",
            "Complexes of Directed Graphs.",
            "A 3/2-Approximation Algorithm for the Mixed Postman Problem.",
            "On the Contour of Random Trees.",
            "The Compactness of Interval Routing.",
            "Determinant: Old Algorithms, New Insights.",
            "Star Extremal Circulant Graphs.",
            "Graph Partitioning and Continuous Quadratic Programming.",
            "On the Size of Minimum Super Arrovian Domains."
        ]
    },
    {
        "name": "SIDMA",
        "year": "1998",
        "info": "1998: Volume 11",
        "count": 47,
        "papers": [
            "The Ring Loading Problem.",
            "Interference-Minimizing Colorings of Regular Graphs.",
            "Combinatorial Properties and Constructions of Traceability Schemes and Frameproof Codes.",
            "The Number of Independent Sets in a Grid Graph.",
            "A Randomness-Rounds Tradeoff in Private Computation.",
            "Sometimes Travelling is Easy: The Master Tour Problem.",
            "Analysis of Algorithms for Listing Equivalence Classes of k-ary Strings.",
            "An Ordering on the Even Discrete Torus.",
            "Competition Graphs of Hamiltonian Digraphs.",
            "The Number of Intersection Points Made by the Diagonals of a Regular Polygon.",
            "Geometry and Diameter Bounds of Directed Cayley Graphs of Abelian Groups.",
            "Rankings of Graphs.",
            "An Optimal Acceptance Policy for an Urn Scheme.",
            "The Lovász Theta Function and a Semidefinite Programming Relaxation of Vertex Cover.",
            "On Perfect Codes and Tilings: Problems and Solutions.",
            "Sorting by Transpositions.",
            "Perfect Factors from Cyclic Codes and Interleaving.",
            "Isomorphism Classes of Concrete Graph Coverings.",
            "Enumeration of Regular Graph Coverings Having Finite Abelian Covering Transformation Groups.",
            "A Note on Counting Connected Graph Covering Projections.",
            "A Generalized Distance in Graphs and Centered Partitions.",
            "Cayley Digraphs Based on the de Bruijn Networks.",
            "A Greedy Algorithm Estimating the Height of Random Trees.",
            "Circulants and Sequences.",
            "Semikernels and (k, l)-Kernels in Digraphs.",
            "Matching Nuts and Bolts in O(n log n) Time.",
            "A Bound of 4 for the Diameter of the Symmetric Traveling Salesman Polytope.",
            "Iterating an alpha-ary Gray Code.",
            "Approximate Core Allocation for Binpacking Games.",
            "Time and Cost Trade-Offs in Gossiping.",
            "On Distance-Preserving and Domination Elimination Orderings.",
            "Dually Chordal Graphs.",
            "String Noninclusion Optimization Problems.",
            "Partial Intersection Theorem and Flows in Abstract Networks.",
            "Congestion-free Routings of Linear Complement Permutations.",
            "Fault-Tolerant Fixed Routings in Some Families of Digraphs.",
            "A Geometric Approach to Betweenness.",
            "The Graphs with All Subgraphs T-Perfect.",
            "Monochromatic Paths and Triangulated Graphs.",
            "Two Arc-Disjoint Paths in Eulerian Digraphs.",
            "Multiple Capacity Vehicle Routing on Paths.",
            "Edge-Connectivity Augmentation Preserving Simplicity.",
            "Dimension of Projections in Boolean Functions.",
            "k-Neighborhood-Covering and -Independence Problems for Chordal Graphs.",
            "Local Structure When All Maximal Independent Sets Have Equal Weight.",
            "On the Weakness of an Ordered Set.",
            "A New Decoding Algorithm for Complete Decoding of Linear Block Codes."
        ]
    },
    {
        "name": "SIDMA",
        "year": "1997",
        "info": "1997: Volume 10",
        "count": 46,
        "papers": [
            "Steiner Trees for Terminals Constrained to Curves.",
            "Partitions with Restricted Block Sizes, Möbius Functions, and the k-of-Each Problem.",
            "Isoperimetric Inequalities and Eigenvalues.",
            "q-Series Arising From The Study of Random Graphs.",
            "Obstructions For 2-Möbius Band Embedding Extension Problem.",
            "Stirling Numbers for Complex Arguments.",
            "Super Arrovian Domains with Strict Preferences.",
            "A Variant of the Buchberger Algorithm for Integer Programming.",
            "Clique r-Domination and Clique r-Packing Problems on Dually Chordal Graphs.",
            "On Coset Weight Distributions of the 3-Error-Correcting BCH-Codes.",
            "The Structure and Number of Obstructions to Treewidth.",
            "On Integer Multiflow Maximization.",
            "Worst Case Length of Nearest Neighbor Tours for the Euclidean Traveling Salesman Problem.",
            "A Min-Max Theorem for a Constrained Matching Problem.",
            "Hypercubes and Multicommodity Flows.",
            "Congestion-free Optimal Routings of Hypercube Automorphisms.",
            "Finding Even Cycles Even Faster.",
            "Load Balancing in Quorum Systems.",
            "Images and Preimages in Random Mappings.",
            "De Bruijn Sequences and Perfect Factors.",
            "On the Dimension of the Hull.",
            "A Min-Max Theorem for Bisubmodular Polyhedra.",
            "Decomposing 4-Regular Graphs into Triangle-Free 2-Factors.",
            "The Structure of Random Graph Orders.",
            "Bounding the Size of Planar Intertwines.",
            "The Length of a Leaf Coloration on a Random Binary Tree.",
            "Classes of Graphs that Are Not Vertex Ramsey.",
            "New Ramsey Bounds from Cyclic Graphs of Prime Order.",
            "Linear Steiner Trees for Infinite Spirals.",
            "Asteroidal Triple-Free Graphs.",
            "A Lower Bound for Adjacencies on the Traveling Salesman Polytope.",
            "Counting Problems Associated With Steiner Trees In Graphs.",
            "Optimal Cycle Codes Constructed From Ramanujan Graphs.",
            "A Construction for (t, m, s)-nets in Base q.",
            "Computing All Small Cuts in an Undirected Network.",
            "A Threshold Function for Harmonic Update.",
            "A Combinatorial Proof for Stockhausen's Problem.",
            "Steiner 2-Edge Connected Subgraph Polytopes on Series-Parallel Graphs.",
            "The Order Dimension of Planar Maps.",
            "Algorithms for Vertex Partitioning Problems on Partial k-Trees.",
            "Global Price Updates Help.",
            "Task Scheduling in Networks.",
            "Stack and Queue Layouts of Posets.",
            "Multimatroids I. Coverings by Independent Sets.",
            "Randomness in Private Computations.",
            "Realizing Interval Graphs with Size and Distance Constraints."
        ]
    },
    {
        "name": "SIDMA",
        "year": "1996",
        "info": "1996: Volume 9",
        "count": 49,
        "papers": [
            "A Characterization of Nonnegative Box-Greedy Matrices.",
            "Efficient Gossiping by Packets in Networks with Random Faults.",
            "Short Random Walks on Graphs.",
            "The Biased Coin Problem.",
            "Spanners of Hypercube-Derived Networks.",
            "Lower Bounds on Representing Boolean Functions as Polynomials in Zm.",
            "On Convex Subsets in Tournaments.",
            "Horizontal Principal Structure of Layered Mixed Matrices: Decomposition of Discrete Systems by Design-Variable Selections.",
            "Data Security Equals Graph Connectivity.",
            "On Linear Recognition of Tree-Width at Most Four.",
            "Chip-Firing Games on Mutating Graphs.",
            "Linear Algorithms for Partitioning Embedded Graphs of Bounded Genus.",
            "Nowhere-Zero 4-Flows and Cayley Graphs on Solvable Groups.",
            "Tight Bounds for Dynamic Storage Allocation.",
            "Finding a Domatic Partition of an Interval Graph in Time O(n).",
            "On a Question of Erdös on Subsequence Sums.",
            "Spanning Trees - Short or Small.",
            "On the Nonexistence of Perfect Codes in the Johnson Scheme.",
            "A Graph-Coloring Result and Its Consequences For Polygon-Guarding Problems.",
            "Classifying Hyperplanes in Hypercubes.",
            "Packing Steiner Trees: Separation Algorithms.",
            "On the Power of Democratic Networks.",
            "Bounding Functions and Rigid Graphs.",
            "A Linear Algorithm for Maximum Weight Cliques in Proper Circular Arc Graphs.",
            "The Ultimate Categorical Independence Ratio of a Graph.",
            "Random Walks on Regular and Irregular Graphs.",
            "The L(2, 1)-Labeling Problem on Graphs.",
            "Realizing Degree Sequences in Parallel.",
            "The Total Interval Number of a Graph II: Trees and Complexity.",
            "Angles of Planar Triangular Graphs.",
            "Constrained Embedding Probability for Two Binary Strings.",
            "On the Complexity of a Cutting Plane Algorithm for Solving Combinatorial Linear Programs.",
            "Cohen-Macaulay Rings in Network Reliability.",
            "Tilings of Binary Spaces.",
            "Nonequivalent q-ary Perfect Codes.",
            "Orthogonal Arrays, Resilient Functions, Error-Correcting Codes, and Linear Programming Bounds.",
            "Second-Order Rigidity and Prestress Stability for Tensegrity Frameworks.",
            "Approximation Algorithms for the k-Clique Covering Problem.",
            "Graph Algorithms for Conformance Testing Using the Rural Chinese Postman Tour.",
            "Multipartition Series.",
            "Valuated Matroid Intersection I: Optimality Criteria.",
            "Valuated Matroid Intersection II: Algorithms.",
            "Plane Embeddings of 2-trees and Biconnected Partial 2-Trees.",
            "On the Trellis Complexity of the Densest Lattice Packings in Rn.",
            "The Graphical Asymmetric Traveling Salesman Polyhedron: Symmetric Inequalities.",
            "Cayley Graphs with Neighbor Connectivity One.",
            "IIS-Hypergraphs.",
            "A Gray Code for Necklaces of Fixed Density.",
            "Finding Independent Sets in Triangle-free Graphs."
        ]
    },
    {
        "name": "SIDMA",
        "year": "1995",
        "info": "1995: Volume 8",
        "count": 43,
        "papers": [
            "Performance Guarantees for Approximation Algorithms Depending on Parametrized Triangle Inequalities.",
            "Delta-Matroids, Jump Systems, and Bisubmodular Polyhedra.",
            "Dual Eulerian Properties of Plane Multigraphs.",
            "Enumeration of Concrete Regular Covering Projections.",
            "Extremal Cayley Digraphs of Finite Cyclic Groups.",
            "Fractional Covers and Communication Complexity.",
            "On Lotteries with Unique Winners.",
            "Algorithms for Square Roots of Graphs.",
            "Search Problems in the Decision Tree Model.",
            "Sequential and Simultaneous Liftings of Minimal Cover Inequalities for Generalized Upper Bound Constrained Knapsack Polytopes.",
            "Preserving and Increasing Local Edge-Connectivity in Mixed Graphs.",
            "Competition Graphs of Strongly Connected and Hamiltonian Digraphs.",
            "A Competitive Strong Spanning Tree Algorithm for the Maximum Bipartite Matching Problem.",
            "Bounds for Binary Codes That Are Multiple Coverings of the Farthest-Off Points.",
            "The Existence of Homomorphisms to Oriented Cycles.",
            "Chernoff-Hoeffding Bounds for Applications with Limited Independence.",
            "Nonredundant 1's in Gamma-Free Matrices.",
            "Sliceable Floorplanning by Graph Dualization.",
            "Two-Way Rounding.",
            "Degree-Constrained Network Spanners with Nonconstant Delay.",
            "Analysis of a Recurrence Arising from a Construction for Nonblocking Networks.",
            "An Inequality for Probability Moments with Applications.",
            "Tree Spanners.",
            "Combinatorial Algorithm for a Lower Bound on Frame Rigidity.",
            "Approximation Algorithms for Minimum-Time Broadcast.",
            "Multidimensional Divide-and-Conquer Maximin Recurrences.",
            "P-Components and the Homogeneous Decomposition of Graphs.",
            "The Complexity of the Hajos Calculus.",
            "On-Line and First-Fit Coloring of Graphs That Do Not Induce P5.",
            "On the lambda-Number of Qn and Related Graphs.",
            "The Median Procedure in a Formal Theory of Consensus.",
            "Symmetric Matrices Representable by Weighted Trees Over a Cancellative Abelian Monoid.",
            "Correlation of Boolean Functions and Pathology in Recursion Trees.",
            "Lower Bounds on Formula Size of Boolean Functions Using Hypergraph Entropy.",
            "Feasible Offset and Optimal Offset for General Single-Layer Channel Routing.",
            "Canonical Encoders for Sliding Block Decoders.",
            "Treewidth and Pathwidth of Permutation Graphs.",
            "Salvage-Embeddings of Complete Trees.",
            "Upper and Lower Bounds on Constructing Alphabetic Binary Trees.",
            "On Families of Sets of Integral Vectors Whose Representatives form Sum-Distinct Sets.",
            "An Approximation Algorithm for Preemptive Scheduling on Parallel-Task Systems.",
            "Altshuler's Sphere m9963 Revisited.",
            "Equidistribution in All Dimensions of Worst-Case Point Sets for the Traveling Salesman Problem."
        ]
    },
    {
        "name": "SIDMA",
        "year": "1994",
        "info": "1994: Volume 7",
        "count": 64,
        "papers": [
            "Explicit Constructions of Depth-2 Majority Circuits for Comparison and Addition.",
            "The Number of Degree-Restricted Rooted Maps on the Sphere.",
            "The Graph Partitioning Polytope on Series-Parallel and4-Wheel Free Graphs.",
            "On the Interplay Between Interval Dimension and Dimension.",
            "The Private Neighbor Cube.",
            "Bell Inequalities, Grothendieck's Constant, and Root Two.",
            "Extremal Problems in the Construction of Distributed Loop Networks.",
            "On-Line Coloring and Recursive Graph Theory.",
            "Littlewood-Offord Inequalities for Random Variables.",
            "The Combinatorics of Perfect Authentication Schemes.",
            "Fault-Tolerant Circuit-Switching Networks.",
            "Sorting on a Mesh-Connected Computer with Delaying Links.",
            "Labeling Chordal Graphs: Distance Two Condition.",
            "Polyhedral Characterization of the Economic Lot-Sizing Problem with Start-Up Costs.",
            "A Note on Multiset Permutations.",
            "Indifference Digraphs: A Generalization of Indifference Graphs and Semiorders.",
            "Some New Bounds on Single-Change Covering Designs.",
            "On the Angular Resolution of Planar Graphs.",
            "Planar Separators.",
            "A Stochastic Process Interpretation of Partition Identities.",
            "The Square of a Hamiltonian Cycle.",
            "An 0(n log n) Algorithm for Bandwidth of Interval Graphs.",
            "The Laplacian Spectrum of a Graph II.",
            "A 2d-1 Lower Bound for Two-Layer Knock-Knee Channel Routing.",
            "The Divisors of x2m+x of Constant Derivatives and Degree 2m-2.",
            "The k-Edge-Connected Spanning Subgraph Polyhedron.",
            "Constructing Small Sample Spaces Satisfying Given Constraints.",
            "The Minimum Satisfiability Problem.",
            "On Optimal Depth Threshold Circuits for Multiplication and Related Problems.",
            "On Finding Critical Independent and Vertex Sets.",
            "Triangulating Vertex-Colored Graphs.",
            "Bipartite Subgraphs of Triangle-Free Graphs.",
            "Sums of Squares of Edge Lengths and Spacefilling Curve Heuristics for the Traveling Salesman Problem.",
            "Eulerian Self-Dual Codes.",
            "Clique Graphs of Chordal and Path Graphs.",
            "On Systematic Codes Obtained from Linear Codes Over GF(q2).",
            "Compositions of Graphs and Polyhedra I: Balanced Induced Subgraphs and Acyclic Subgraphs.",
            "Compositions of Graphs and Polyhedra II: Stable Sets.",
            "Compositions of Graphs and Polyhedra III: Graphs with No W4 Minor.",
            "Compositions of Graphs and Polyhedra IV: Acyclic Spanning Subgraphs.",
            "The All-Pairs Min Cut Problem and the Minimum Cycle Basis Problem on Planar Graphs.",
            "Random Set Partitions.",
            "Steiner Distance-Hereditary Graphs.",
            "An Upper Bound on the Diameter of a Graph from Eigenvalues Associated with its Laplacian.",
            "Random Resource Allocation Graphs and the Probability of Deadlock.",
            "Even Cycles in Directed Graphs.",
            "On the Size of Weights for Threshold Gates.",
            "Domination, Fractional Domination, 2-Packing, and Graph Products.",
            "Normal and Self-dual Normal Bases from Factorization of c xq+1 + d xq - ax - b.",
            "Routing Permutations on Graphs Via Matchings.",
            "Predicting Cause-Effect Relationships from Incomplete Discrete Observations.",
            "A Coding Approach to Signed Graphs.",
            "Generalized Hamming Weights of Melas Codes and Dual Melas Codes.",
            "Ramanujan Diagrams.",
            "On Path-Tough Graphs.",
            "A New Class of Pyramidally Solvable Symmetric Traveling Salesman Problems.",
            "Drawing Graphs on Surfaces.",
            "On Universal Cycles for k-Subsets of an n-Set.",
            "Further Results on T-Coloring and Frequency Assignment Problems.",
            "A Linear-Time Algorithm for Isomorphism of Graphs of Bounded Average Genus.",
            "Optimal Parallel Algorithms for Straight-Line Grid Embeddings of Planar Graphs.",
            "Treewidth of Circular-Arc Graphs.",
            "New 3/4-Approximation Algorithms for the Maximum Satisfiability Problem.",
            "Perfect Homomorphic Zero-Knowledge Threshold Schemes over any Finite Abelian Group."
        ]
    },
    {
        "name": "SIDMA",
        "year": "1993",
        "info": "1993: Volume 6",
        "count": 51,
        "papers": [
            "On Error-Correcting Codes and Invariant Linear Forms.",
            "Algorithmic Aspects of Neighborhood Numbers.",
            "On the Structure of the Strong Orientations of a Graph.",
            "Garden of Eden Configurations for Cellular Automata on Cayley Graphs of Groups.",
            "The Weighted Sparsity Problem: Complexity and Algorithms.",
            "Exact Formulas for Multitype Run Statistic in a Random Ordering.",
            "Characterization of the Homomorphic Preimages of Certain Oriented Cycles.",
            "Matchings in the Partition Lattice.",
            "Communication Complexity and Quasi Randomness.",
            "Discrete Logarithms in GF(P) Using the Number Field Sieve.",
            "Polyhedral Properties of Clutter Amalgam.",
            "Hamilton Cycles that Extend Transposition Matchings in Cayley Graphs of Sn.",
            "A New Triangulation for Simplicial Algorithms.",
            "The Pathwidth and Treewidth of Cographs.",
            "Hamiltonian Properties of Bipartite Graphs and Digraphs with Bipartite Independence 2.",
            "Limiting Distribution for the Depth in Patricia Tries.",
            "Representations of Planar Graphs.",
            "The Order Dimension of Convex Polytopes.",
            "Minkowski Addition of Polytopes: Computational Complexity and Applications to Gröbner Basis.",
            "Finding a Longest Path in a Complete Multipartite Digraph.",
            "An Exact Characterization of Greedy Structures.",
            "The Number of Maximal Independent Sets in Triangle-Free Graphs.",
            "Triangulating Three-Colored Graphs in Linear Time and Linear Space.",
            "Barker Arrays I: Even Number of Elements.",
            "Barker Arrays II: ODD Numer of Elements.",
            "On the Enumeration of Steiner-Tree Topologies for the Points on a Circle.",
            "Counting Embeddings of Planar Graphs Using DFS Trees.",
            "Induced Cycle Structures of the Hyperoctahedral Group.",
            "Collisions Among Random Walks on a Graph.",
            "Minimum Edge Dominating Sets.",
            "Reciprocal Sums over Partitions and Compositions.",
            "Domination on Cocomparability Graphs.",
            "Complexity of the Forwarding Index Problem.",
            "Parity Subgraph, Shortest Cycle Cover and Postman Tour.",
            "Complexity Results for Pomset Languages.",
            "An Efficient Parallel Algorithm that Finds Independent Sets of Guaranteed Size.",
            "Efficient Detection and Protection of Information in Cross Tabulated Tables I: Linear Invariant Test.",
            "The Lattice Structure of Flow in Planar Graphs.",
            "n+1 Segments Beat n.",
            "Replicating Tessellations.",
            "Fast Parallel Recognition of Ultrametrics and Tree Metrics.",
            "Monotone Optimal Multipartitions Using Schur Convexity with Respect to Partial Orders.",
            "Interactive Communication of Balanced Distributions and of Correlated Files.",
            "On Minimum Fault-Tolerant Networks.",
            "Improved Space for Bounded-Space, On-Line Bin-Packing.",
            "Surjective Extensions of Sliding-Block Codes.",
            "An Integer Polytope Related to the Design of Survivable Communication Networks.",
            "Edge-Chromatic Scheduling with Simultaneity Constraints.",
            "Embedding de Bruijn and Schuffle-Exchange Graphs in Five Pages.",
            "Representations of Borel Cayley Graphs.",
            "Errata: Lyapunov Functionals for Automata Networks Defined by Cyclically Monotone Functions."
        ]
    },
    {
        "name": "SIDMA",
        "year": "1992",
        "info": "1992: Volume 5",
        "count": 49,
        "papers": [
            "A Linear Time Approach to the Set Maxima Problem.",
            "Broadcasting in Bounded Degree Graphs.",
            "Augmenting Graphs to Meet Edge-Connectivity Requirements.",
            "Computing Edge-Connectivity in Multigraphs and Capacitated Graphs.",
            "A Forward Lower Restricted Ordering Algorithm for Digraphs.",
            "Generalized Chromatic Numbers of Random Graphs.",
            "A Technique for Lower Bounding the Cover Time.",
            "Bounded Round Interactive Proofs in Finite Groups.",
            "Disjoint Paths in a Planar Graph - A General Theorem.",
            "On Well-Partial-Order Theory and its Application to Combinatorial Problems of VLSI Design.",
            "On Tensor Powers of Integer Programs.",
            "Pair Labelings of Graphs.",
            "Routing with Polynomial Communication-Space Trade-Off.",
            "Chvátal Cuts and ODD Cycle Inequalities in Quadratic 0 - 1 Optimization.",
            "Minimum Time Broadcast Networks Tolerating a Logarithmic Number of Faults.",
            "Hamilton Paths in Graphs of Linear Extensions for Unions of Posets.",
            "On the Nonmultiplicativity of Oriented Cycles.",
            "Normal Limiting Distributions for Projection and Semijoin Sizes.",
            "Triangulating 3-Colored Graphs.",
            "Three-Stage Generalized Connectors.",
            "Privacy and Communication Complexity.",
            "An Optimal Algorithm for the Maximum Two-Chain Problem.",
            "On the Position Value for Communication Situations.",
            "Polyhedra of the Equivalent Subgraph Problem and Some Edge Connectivity Problems.",
            "Almost Safe Gossiping in Bounded Degree Networks.",
            "Galois Groups and Factoring Polynomials Over Finite Fields.",
            "A Polynomial Algorithm for the 2-Path Problem for Semicomplete Digraphs.",
            "Another Way of Counting NN.",
            "Infinite Graphs with Nonconstant Dirichlet Finite Harmonic Functions.",
            "Mean Passage Times and Nearly Uncoupled Markov Chains.",
            "Comparing Queues and Stacks as Mechanisms for Laying out Graphs.",
            "A Combinatorial Approach to Biorthogonal Polynomials.",
            "The Problem of Compatible Representatives.",
            "Short Encodings of Evolving Structures.",
            "Pair-Splitting Sets in AG(m, q).",
            "Laplacian Permanents of Trees.",
            "The 1/3-2/3 Conjecture for 5-Thin Posets.",
            "The Equivalent Subgraph and Directed Cut Polyhedra on Series-Parallel Graphs.",
            "Covering Graphs by Cycles.",
            "How to Guess a Generating Function.",
            "Some Results on Liu's Conjecture.",
            "2-Competition Graphs.",
            "On the p-Edge Clique Cover Number of Complete Bipartite Graphs.",
            "The Probabilistic Communication Complexity of Set Intersection.",
            "A Tight Lower Bound on the Size of Planar Permutation Networks.",
            "Hamiltonian Properties of Grid Graphs.",
            "Roots of the Reliability Polynomial.",
            "Labelling Graphs with a Condition at Distance 2.",
            "Implicit Representation of Graphs."
        ]
    },
    {
        "name": "SIDMA",
        "year": "1991",
        "info": "1991: Volume 4",
        "count": 51,
        "papers": [
            "The Weak Bruhat Order of SSigma, Consistent Sets, and Catalan Numbers.",
            "An Extremal Problem on Sparse 0-1 Matrices.",
            "A Polynomial Time Optimal Algorithm for Satellite-Switched Time-Division Multiple Access Satellite Communications with General Switching Modes.",
            "A Zero-One Law for Boolean Privacy.",
            "A Simple Proof of the O(sqrt(n log3/4 n) Upright Matching Bound.",
            "The Cycle Construction.",
            "Analysis of a Compound bin Packing Algorithm.",
            "Semikernels, Quasi Kernels, and Grundy Functions in the Line Digraph.",
            "Weak Three-Linking in Eulerian Digraphs.",
            "Spanning Trees with Many Leaves.",
            "Tree-Matchings in Graph Processes.",
            "The Expected Capacity of Concentrators.",
            "Edge-Disjoint Homotopic Paths in Straight-Line Planar Graphs.",
            "Representations of Graphs on a Cylinder.",
            "Motion Planning, Two-Directional Point Representations, and Ordered Sets.",
            "On the Complete Weight Enumerator of Reed-Solomon Codes.",
            "New Results on Server Problems.",
            "Towards a Large Set of Steiner Quadruple Systems.",
            "Maximal Independent Subsets in Steiner Systems and in Planar Sets.",
            "Lyapunov Functionals for Automata Networks Defined by Cyclically Monotone Functions.",
            "Tight Bounds on Minimum Broadcast Networks.",
            "Noncrossing Subgraphs in Topological Layouts.",
            "Three-Dimensional Stable Matching Problems.",
            "Special Rim Hook Tabloids and Some New Multiplicity-Free S-Series.",
            "Bootstrap Percolation, the Schröder Numbers, and the N-Kings Problem.",
            "Disjoint Covers in Replicated Heterogeneous Arrays.",
            "An Integer Program for Codes.",
            "A Formal Theory of Consensus.",
            "A New Approach to the Server Problem.",
            "Midpoints of Diagonals of Convex n-GONS.",
            "NC Algorithms for Recognizing Partial 2-Trees and 3-Trees.",
            "Rigidity Matroids.",
            "Dynamic Steiner Tree Problem.",
            "Optimal Parallel Algorithms for Region Labeling and Medial Axis Transform of Binary Images.",
            "On the Complexity of Colouring by Vertex-Transitive and Arc-Transitive Digraphs.",
            "A Lower Bound on Probabilistic Algorithms for Distributive Ring Coloring.",
            "Generating the Linear Extensions of Certain Posets by Transpositions.",
            "On the Power of Threshold Circuits with Small Weights.",
            "On the Geometry and Computational Complexity of Radon Partitions in the Integer Lattice.",
            "A Note on Planar Graphs and Circle Orders.",
            "Extendability, Dimensions, and Diagrams of Cycle Orders.",
            "Fault Tolerant Sorting Networks.",
            "Deterministic Decomposition of Recursive Graph Classes.",
            "The Detection of Cheaters in Threshold Schemes.",
            "On the Existence of Hamiltonian Circuits in Faulty Hypercubes.",
            "Compact Cylindrical Chromatic Scheduling.",
            "Bound Smoothing under Chirality Constraints.",
            "Obnoxious Facility Location on Graphs.",
            "Plane Trees and H-Vectors of Shellable Cubical Complexes.",
            "A Large Deviation Rate and Central Limit Theorem for Horton Ratios.",
            "Erratum: An Integer Program for Codes."
        ]
    },
    {
        "name": "SIDMA",
        "year": "1990",
        "info": "1990: Volume 3",
        "count": 52,
        "papers": [
            "Recognition of Tree Metrics.",
            "Sorting, Minimal Feedback Sets, and Hamilton Paths in Tournaments.",
            "Parallel Selection with High Probability.",
            "An Isoperimetric Inequality on the Discrete Torus.",
            "On the Distribution of Lengths of Evolutionary Trees.",
            "A Fast Perfect-Matching Algorithm in Random Graphs.",
            "Asymptotically Optimal Linear Algorithm for the Minimum k-Cut in a Random Graph.",
            "Brooks Coloring in Parallel.",
            "An Almost Linear Time Algorithm for Generalized Matrix Searching.",
            "The Boolean Basis Problem and How to Cover Some Polygons by Rectangles.",
            "A Theory of Proportional Representation.",
            "Bit Serial Multiplication in Finite Fields.",
            "Calcul Saalschützien des Partitions et des Dérangements Colorés.",
            "Advantageous Properties of Dual Transhipment Polyhedra.",
            "Harmonic Analysis of Polynomial Threshold Functions.",
            "Quasi-Symmetric 3-Designs and Elliptic Curves.",
            "Maximal Chains and Antichains in Boolean Lattices.",
            "Transversals of Vertex Partitions in Graphs.",
            "Singularity Analysis of Generating Functions.",
            "Reversible Turing Machines and Polynomial Time Reversibly Computable Functions.",
            "Monotone Circuits for Connectivity Require Super-Logarithmic Depth.",
            "Medians and Majorities in Semimodular Lattices.",
            "Locally Symmetric Graphs of Prescribed Girth and Coxeter Groups.",
            "On a Lower Bound for Short Noncontractible Cycles in Embedded Graphs.",
            "On Approximate Solutions for Combinatorial Optimization Problems.",
            "Random Paths and Cuts, Electrical Networks, and Reversible Markov Chains.",
            "On the Structure of Minimum-Weight k-Connected Spanning Networks.",
            "Generalizations of the Normal Basis Theorem of Finite Fields.",
            "Shrinking Lattice Polyhedra.",
            "Optimal Assembly of an s-Stage k-OUT-OF-n System.",
            "Canonical Antichains on the Circle and Applications.",
            "A New Basis for Trades.",
            "Computing the Bandwidth of Interval Graphs.",
            "One-Page Book Embedding Under Vertex-Neighborhood Constraints.",
            "On the 1.1 Edge-Coloring of Multigraphs.",
            "A Hierarchy of Relaxations Between the Continuous and Convex Hull Representations for Zero-One Programming Problems.",
            "Finding Critical Independent Sets and Critical Vertex Subsets are Polynomial Problems.",
            "Irregular Assignments of Trees and Forests.",
            "The Random Walk Construction of Uniform Spanning Trees and Uniform Labelled Trees.",
            "A Characterization of an Extension of the Banzhaf Value to Multicandidate Voting Games.",
            "Binary Probabilities Induced by Rankings.",
            "Thicknesses of Ordered Sets.",
            "Integer Polyhedra Arising from Certain Network Design Problems with Connectivity Constraints.",
            "Vertex Transitivity and Super Line Connectedness.",
            "The Domatic Number Problem in Interval Graphs.",
            "Polynomial Algorithms for Finding Cycles and Paths in Bipartite Tournaments.",
            "Cycle Lengths and Graph Orientations.",
            "A Minimax Arc Theorem for Reducible Flow Graphs.",
            "Generating Permutations with k-Differences.",
            "On the Number of Distinct Forests.",
            "A Simplified Anomaly and Reduction for Precedence Constrained Multiprocessor Scheduling.",
            "River Routing with a Small Number of Jogs."
        ]
    },
    {
        "name": "SIDMA",
        "year": "1989",
        "info": "1989: Volume 2",
        "count": 51,
        "papers": [
            "Analysis of an Infinite Product Algorithm.",
            "Intersection of Two Matroids: (Condensed) Border Graphs and Ranking.",
            "Codes from Symmetry Groups, and a [32, 17, 8] Code.",
            "Graph Bipartization and via Minimization.",
            "Impossibility of Decomposing the Complete Graph on n Points into n-1 Isomorphic Complete Bipartite Graphs.",
            "Low Rank Matrices with a Given Sign Pattern.",
            "A Note on the Vertex Arboricity of a Graph.",
            "On the Size of Systems of Sets Every t of Which Have an SDR, with an Application to the Worst-Case Ratio of Heuristics for Packing Problems.",
            "On Solving Rational Congruences.",
            "How Long can a Euclidean Traveling Salesman Tour Be?",
            "A Linear Reordering Algorithm for Parallel Pivoting of Chordal Graphs.",
            "Parallel Algorithms for Zero-One Supply-Demand Problems.",
            "Optimal Algorithms for a Pursuit-Evasion Problem in Grids.",
            "Universal Graphs for Bounded-Degree Trees and Planar Graphs.",
            "Vertex Types in Book-Embeddings.",
            "Scheduling Tree-Structured Tasks on Two Processors to Minimize Schedule Length.",
            "On Factorable Extensions and Subgraphs of Prime Graphs.",
            "Recursive Solutions for the Generalized Erlang Queueing Systems.",
            "Determining Resistances from Boundary Measurements in Finite Networks.",
            "A Robust Noncryptographic Protocol for Collective Coin Flipping.",
            "Geometric Containment and Partial Orders.",
            "A k-Tree Generalization that Characterizes Consistency of Dimensioned Engineering Drawings.",
            "The Radon Transform on Zn.",
            "Sorting in Average Time o(log) n.",
            "Leaf Pairs and Tree Dissections.",
            "On the Invertibility of the Discrete Radon Transform.",
            "Performance Guarantees on a Sweep-Line Heuristic for Covering Rectilinear Polygons with Rectangles.",
            "Constructing a Maximal Independent Set in Parallel.",
            "Single-Suit Two-Person Card Play III. The Misère Game.",
            "Divisors Without Unit-Congruent Ratios.",
            "Perturbations of Shifts of Finite Type.",
            "Identities Satisfied by Iterated Polynomials and (Q, x)-Binomial Coefficients.",
            "Perfect Graphs and Orthogonally Convex Covers.",
            "Random Sequential Adsorption on Graphs.",
            "A Ramsey-Type Theorem for Orderings of a Graph.",
            "Node-Packing Problems with Integer Rounding Properties.",
            "Gaussian Elimination with Pivoting is P-Complete.",
            "The Asymmetric Assignment Problem and Some New Facets of the Traveling Salesman Polytope on a Directed Graph.",
            "Induced Subgraphs of the Power of a Cycle.",
            "A Matter of Degree.",
            "Pebbling in Hypercubes.",
            "Complexity of Scheduling Parallel Task Systems.",
            "On Two Classical Ramsey Numbers of the Form R(3, n).",
            "Pair Labeelings with Given Distance.",
            "Y. C. Yao: Cutoff Point and Monotonicity Properties for Multinomial Group Testing.",
            "Average Performance of Heuristics for Satisfiability.",
            "Partitions of Aomega.",
            "The Average Number of Stable Matchings.",
            "A Mathematical Model for Periodic Scheduling Problems.",
            "Birigidity in the Plane.",
            "Prime Testing for the Split Decomposition of a Graph."
        ]
    },
    {
        "name": "SIDMA",
        "year": "1988",
        "info": "1988: Volume 1",
        "count": 51,
        "papers": [
            "Neural Networks, Acyclic Orientations of the Hypercube, and Sets of Orthogonal Vectors.",
            "Asymptotic Analysis of some Network Reliability Models.",
            "Upper and Lower Bounds on Time-Space Tradeoffs for Computations with Embedded Fast Fourier Transforms.",
            "Optimal Detection of Two Defectives with a Parity Check Device.",
            "On the Fractional Covering Number of Hypergraphs.",
            "Extremum Properties of Hexagonal Partitioning and the Uniform Distribution in Euclidean Location.",
            "Searching for Two Objects by Underweight Feedback.",
            "Graphs that Split Entropies.",
            "Universal Chains and Wiring Layouts.",
            "Hole Problems for Rectangles in the Plane.",
            "On Existence of t-Designs with Large v and lambda.",
            "A Note on Independent Sets in Trees.",
            "Quick Gossiping by Conference Calls.",
            "Some Applications of Affine Gale Diagrams to Polytopes with few Vertices.",
            "The Voronoi Region of E*7.",
            "Questions Related to the Erdös-Turan Conjecture.",
            "A Set System Polynomial with Colouring and Reliability Applications.",
            "Wide-Sense Nonblocking Networks.",
            "From Linear Separability to Unimodality: A Hierarchy of Pseudo-Boolean Functions.",
            "On Short Noncontractible Cycles in Embedded Graphs.",
            "Self-Complementary Normal Bases in Finite Fields.",
            "On the Optimal Strongly Connected Orientations of City Street Graphs I: Large Grids.",
            "An Optimality Criterion for Graph Embeddings of Metrics.",
            "A Combinatorial Approach to Threshold Schemes.",
            "The Union of Matroids and the Rigidity of Frameworks.",
            "A Fundamental Monotonicity in Group Testing.",
            "Almost Every Randomly Near-Traceable Graph Has Diameter at Most Two.",
            "Sorting, Approximate Sorting, and Searching in Rounds.",
            "The Complexity of Colouring by Semicomplete Digraphs.",
            "A New Heuristic for Partitioning the Nodes of a Graph.",
            "A Class of Polynomially Solvable Set-Covering Problems.",
            "Total Domination and Irredundance in Weighted Interval Graphs.",
            "The Diameter of a Cycle Plus a Random Matching.",
            "Unique Finite Difference Measurement.",
            "Separating Partition Systems and Locally Different Sequences.",
            "Certain Occupancy Numbers via an Algorithm for Computing Their Ratios.",
            "Tournament Ranking with Expected Profit in Polynomial Time.",
            "Improved Complexity Bounds for Center Location Problems on Networks by Using Dynamic Data Structures.",
            "Polynomial Bound for a Chip Firing Game on Graphs.",
            "The Parallel Complexity of Element Distinctness is Omega (sqrt(log n)).",
            "On the Influence of Single Participant in Coin Flipping Schemes.",
            "Matroids and Subset Interconnection Design.",
            "Laguerre Polynomials, Weighted Derangements, and Positivity.",
            "Parallel Symmetry-Breaking in Sparse Graphs.",
            "Recognizing Bellman-Ford-Orderable Graphs.",
            "On Restricted Two-Factors.",
            "Silverman Games on Disjoint Discrete Sets.",
            "The Linearity of First-Fit Coloring of Interval Graphs.",
            "Broadcast Networks of Bounded Degree.",
            "Distribution of the Symmetric Difference Metric on Phylogenetic Trees.",
            "The Complexity of Metric Realization."
        ]
    }
]