[
    {
        "year": "2021",
        "name": "37th SoCG 2021",
        "info": "Buffalo, NY, USA (Virtual Conference)",
        "venues": [
            {
                "sub_name_abbr": "conf/compgeom/2021",
                "sub_name": "37th International Symposium on Computational Geometry, SoCG 2021, June 7-11, 2021, Buffalo, NY, USA (Virtual Conference).",
                "count": 66,
                "papers": [
                    "Front Matter, Table of Contents, Preface, Conference Organization.",
                    "On Laplacians (Invited Talk).",
                    "3SUM and Related Problems in Fine-Grained Complexity (Invited Talk).",
                    "Classifying Convex Bodies by Their Contact and Intersection Graphs.",
                    "Approximate Nearest-Neighbor Search for Line Segments.",
                    "Chasing Puppies: Mobile Beacon Routing on Closed Curves.",
                    "Online Packing to Minimize Area or Perimeter.",
                    "Complexity of Maximum Cut on Interval Graphs.",
                    "Lower Bounds for Semialgebraic Range Searching and Stabbing Problems.",
                    "Rectilinear Steiner Trees in Narrow Strips.",
                    "Characterizing Universal Reconfigurability of Modular Pivoting Robots.",
                    "Adjacency Graphs of Polyhedral Surfaces.",
                    "On Undecided LP, Clustering and Active Learning.",
                    "Two-Sided Kirszbraun Theorem.",
                    "Orientation Preserving Maps of the Square Grid.",
                    "Light Euclidean Steiner Spanners in the Plane.",
                    "Counting Cells of Order-k Voronoi Tessellations in ℝ³ with Morse Theory.",
                    "Tracing Isomanifolds in ℝ^d in Time Polynomial in d Using Coxeter-Freudenthal-Kuhn Triangulations.",
                    "Translating Hausdorff Is Hard: Fine-Grained Lower Bounds for Hausdorff Distance Under Translation.",
                    "Optimal Bounds for the Colorful Fractional Helly Theorem.",
                    "An Integer Programming Formulation Using Convex Polygons for the Convex Partition Problem.",
                    "Geometric Algorithms for Sampling the Flux Space of Metabolic Networks.",
                    "A Family of Metrics from the Truncated Smoothing of Reeb Graphs.",
                    "Algorithms for Contractibility of Compressed Curves on 3-Manifold Boundaries.",
                    "Faster Algorithms for Largest Empty Rectangles and Boxes.",
                    "More Dynamic Data Structures for Geometric Set Cover with Sublinear Update Time.",
                    "Approximating the (Continuous) Fréchet Distance.",
                    "Computing the Multicover Bifiltration.",
                    "Escaping the Curse of Spatial Partitioning: Matchings with Low Crossing Numbers and Their Applications.",
                    "Colouring Polygon Visibility Graphs and Their Generalizations.",
                    "Computing Zigzag Persistence on Graphs in Near-Linear Time.",
                    "Minimal Delaunay Triangulations of Hyperbolic Surfaces.",
                    "The Density Fingerprint of a Periodic Point Set.",
                    "On the Edge Crossings of the Greedy Spanner.",
                    "On Ray Shooting for Triangles in 3-Space and Related Problems.",
                    "On Rich Lenses in Planar Arrangements of Circles and Related Problems.",
                    "Packing Squares into a Disk with Optimal Worst-Case Density.",
                    "Sunflowers in Set Systems of Bounded Dimension.",
                    "Strong Hanani-Tutte for the Torus.",
                    "Improved Approximation Algorithms for 2-Dimensional Knapsack: Packing into Multiple L-Shapes, Spirals, and More.",
                    "A Stepping-Up Lemma for Topological Set Systems.",
                    "Throwing a Sofa Through the Window.",
                    "Stabbing Convex Bodies with Lines and Flats.",
                    "Reliable Spanners for Metric Spaces.",
                    "A Practical Algorithm with Performance Guarantees for the Art Gallery Problem.",
                    "Approximate Range Counting Under Differential Privacy.",
                    "Sublinear Average-Case Shortest Paths in Weighted Unit-Disk Graphs.",
                    "No Krasnoselskii Number for General Sets.",
                    "On Guillotine Separable Packings for the Two-Dimensional Geometric Knapsack Problem.",
                    "Restricted Constrained Delaunay Triangulations.",
                    "Near Neighbor Search via Efficient Average Distortion Embeddings.",
                    "Convergence of Gibbs Sampling: Coordinate Hit-And-Run Mixes Fast.",
                    "Combinatorial Resultants in the Algebraic Rigidity Matroid.",
                    "Parameterized Complexity of Quantum Knot Invariants.",
                    "Efficient Generation of Rectangulations via Permutation Languages.",
                    "Polygon-Universal Graphs.",
                    "On Rich Points and Incidences with Restricted Sets of Lines in 3-Space.",
                    "Sketching Persistence Diagrams.",
                    "A Sparse Delaunay Filtration.",
                    "An Optimal Deterministic Algorithm for Geodesic Farthest-Point Voronoi Diagrams in Simple Polygons.",
                    "A Parallel Batch-Dynamic Data Structure for the Closest Pair Problem.",
                    "An Interactive Tool for Experimenting with Bounded-Degree Plane Geometric Spanners (Media Exposition).",
                    "Can You Walk This? Eulerian Tours and IDEA Instructions (Media Exposition).",
                    "Shadoks Approach to Low-Makespan Coordinated Motion Planning (CG Challenge).",
                    "Coordinated Motion Planning Through Randomized k-Opt (CG Challenge).",
                    "A Simulated Annealing Approach to Coordinated Motion Planning (CG Challenge)."
                ]
            }
        ]
    },
    {
        "year": "2020",
        "name": "36th SoCG 2020",
        "info": "Zürich, Switzerland",
        "venues": [
            {
                "sub_name_abbr": "conf/compgeom/2020",
                "sub_name": "36th International Symposium on Computational Geometry, SoCG 2020, June 23-26, 2020, Zürich, Switzerland.",
                "count": 86,
                "papers": [
                    "Front Matter, Table of Contents, Preface, Conference Organization.",
                    "An Almost Optimal Bound on the Number of Intersections of Two Simple Polygons.",
                    "Dynamic Geometric Set Cover and Hitting Set.",
                    "The Parameterized Complexity of Guarding Almost Convex Polygons.",
                    "Euclidean TSP in Narrow Strips.",
                    "The ε-t-Net Problem.",
                    "Terrain Visibility Graphs: Persistence Is Not Enough.",
                    "On β-Plurality Points in Spatial Voting Games.",
                    "Testing Polynomials for Vanishing on Cartesian Products of Planar Point Sets.",
                    "Extending Drawings of Graphs to Arrangements of Pseudolines.",
                    "Dimensionality Reduction for k-Distance Applied to Persistent Homology.",
                    "Persistent Homology Based Characterization of the Breast Cancer Immune Microenvironment: A Feasibility Study.",
                    "Homotopic Curve Shortening and the Affine Curve-Shortening Flow.",
                    "Empty Squares in Arbitrary Orientation Among Points.",
                    "Holes and Islands in Random Point Sets.",
                    "The Reeb Graph Edit Distance Is Universal.",
                    "Book Embeddings of Nonplanar Graphs with Small Faces in Few Pages.",
                    "Parallel Computation of Alpha Complexes for Biomolecules.",
                    "Relative Persistent Homology.",
                    "Edge Collapse and Persistence of Flag Complexes.",
                    "The Topological Correctness of PL-Approximations of Isomanifolds.",
                    "Minimum Bounded Chains and Minimum Homologous Chains in Embedded Simplicial Complexes.",
                    "On Rectangle-Decomposable 2-Parameter Persistence Modules.",
                    "Robust Anisotropic Power-Functions-Based Filtrations for Clustering.",
                    "Geometric Secluded Paths and Planar Satisfiability.",
                    "The Next 350 Million Knots.",
                    "Elder-Rule-Staircodes for Augmented Metric Spaces.",
                    "Faster Approximation Algorithms for Geometric Set Cover.",
                    "Further Results on Colored Range Searching.",
                    "A Generalization of Self-Improving Algorithms.",
                    "Dynamic Distribution-Sensitive Point Location.",
                    "No-Dimensional Tverberg Theorems and Algorithms.",
                    "Lexicographic Optimal Homologous Chains and Applications to Point Cloud Triangulations.",
                    "Finding Closed Quasigeodesics on Convex Polyhedra.",
                    "The Stretch Factor of Hexagon-Delaunay Triangulations.",
                    "Flipping Geometric Triangulations on Hyperbolic Surfaces.",
                    "An Efficient Algorithm for 1-Dimensional (Persistent) Path Homology.",
                    "Persistence of the Conley Index in Combinatorial Dynamical Systems.",
                    "On Implementing Straight Skeletons: Challenges and Experiences.",
                    "Removing Connected Obstacles in the Plane Is FPT.",
                    "A Toroidal Maxwell-Cremona-Delaunay Correspondence.",
                    "Combinatorial Properties of Self-Overlapping Curves and Interior Boundaries.",
                    "Worst-Case Optimal Covering of Rectangles by Disks.",
                    "Minimum Scan Cover with Angular Transition Costs.",
                    "ETH-Tight Algorithms for Long Path and Cycle on Unit Disk Graphs.",
                    "A Near-Linear Time Approximation Scheme for Geometric Transportation with Arbitrary Supplies and Spread.",
                    "Bounded VC-Dimension Implies the Schur-Erdős Conjecture.",
                    "Almost-Monochromatic Sets and the Chromatic Number of the Plane.",
                    "Almost Sharp Bounds on the Number of Discrete Chains in the Plane.",
                    "Convex Hulls of Random Order Types.",
                    "Fast Algorithms for Geometric Consensuses.",
                    "Dynamic Approximate Maximum Independent Set of Intervals, Hypercubes and Hyperrectangles.",
                    "How to Find a Point in the Convex Hull Privately.",
                    "Efficient Approximation of the Matching Distance for 2-Parameter Persistence.",
                    "Homotopy Reconstruction via the Cech Complex and the Vietoris-Rips Complex.",
                    "A Quasi-Polynomial Algorithm for Well-Spaced Hyperbolic TSP.",
                    "Intrinsic Topological Transforms via the Distance Kernel Embedding.",
                    "Long Alternating Paths Exist.",
                    "k-Median Clustering Under Discrete Fréchet and Hausdorff Distances.",
                    "Four-Dimensional Dominance Range Reporting in Linear Space.",
                    "Radon Numbers Grow Linearly.",
                    "Bounding Radon Number via Betti Numbers.",
                    "Barycentric Cuts Through a Convex Body.",
                    "Sketched MinDist.",
                    "Fast Algorithms for Minimum Cycle Basis and Minimum Homology Basis.",
                    "Dense Graphs Have Rigid Parts.",
                    "Incidences Between Points and Curves with Almost Two Degrees of Freedom.",
                    "Connectivity of Triangulation Flip Graphs in the Plane (Part II: Bistellar Flips).",
                    "On the Planar Two-Center Problem and Circular Hulls.",
                    "Algorithms for Subpath Convex Hull Queries and Ray-Shooting Among Segments.",
                    "GPU-Accelerated Computation of Vietoris-Rips Persistence Barcodes.",
                    "The Spiroplot App (Media Exposition).",
                    "Coordinated Particle Relocation with Global Signals and Local Friction (Media Exposition).",
                    "Space Ants: Constructing and Reconfiguring Large-Scale Structures with Finite Automata (Media Exposition).",
                    "How to Make a CG Video (Media Exposition).",
                    "Covering Rectangles by Disks: The Video (Media Exposition).",
                    "Step-By-Step Straight Skeletons (Media Exposition).",
                    "Computing Animations of Linkages with Rotational Symmetry (Media Exposition).",
                    "Hiding Sliding Cubes: Why Reconfiguring Modular Robots Is Not Easy (Media Exposition).",
                    "Dots & Polygons (Media Exposition).",
                    "Designing Art Galleries (Media Exposition).",
                    "Plane-Filling Trails (Media Exposition).",
                    "Visual Demo of Discrete Stratified Morse Theory (Media Exposition).",
                    "Computing Low-Cost Convex Partitions for Planar Point Sets with Randomized Local Search and Constraint Programming (CG Challenge).",
                    "Computing Low-Cost Convex Partitions for Planar Point Sets Based on a Memetic Approach (CG Challenge).",
                    "Computing Low-Cost Convex Partitions for Planar Point Sets Based on Tailored Decompositions (CG Challenge)."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "35th SoCG 2019",
        "info": "Portland, OR, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/compgeom/2019",
                "sub_name": "35th International Symposium on Computational Geometry, SoCG 2019, June 18-21, 2019, Portland, Oregon, USA.",
                "count": 67,
                "papers": [
                    "Front Matter, Table of Contents, Preface, Conference Organization.",
                    "A Geometric Data Structure from Neuroscience (Invited Talk).",
                    "Some Geometric and Computational Challenges Arising in Structural Molecular Biology (Invited Talk).",
                    "A New Lower Bound for Semigroup Orthogonal Range Searching.",
                    "Independent Range Sampling, Revisited Again.",
                    "An Efficient Algorithm for Generalized Polynomial Partitioning and Its Applications.",
                    "Efficient Algorithms for Geometric Partial Matching.",
                    "Connecting the Dots (with Minimum Crossings).",
                    "General Techniques for Approximate Incidences and Their Application to the Camera Posing Problem.",
                    "Circumscribing Polygons and Polygonizations for Disjoint Line Segments.",
                    "Morphing Contact Representations of Graphs.",
                    "When Convexity Helps Collapsing Complexes.",
                    "Optimal Algorithm for Geodesic Farthest-Point Voronoi Diagrams.",
                    "Upward Book Embeddings of st-Graphs.",
                    "Bounded Degree Conjecture Holds Precisely for c-Crossing-Critical Graphs with c <= 12.",
                    "Preconditioning for the Geometric Transportation Problem.",
                    "The One-Way Communication Complexity of Dynamic Time Warping Distance.",
                    "Walking the Dog Fast in Practice: Algorithm Engineering of the Fréchet Distance.",
                    "Polyline Simplification has Cubic Complexity.",
                    "A Spanner for the Day After.",
                    "Computing Shapley Values in the Plane.",
                    "On the Metric Distortion of Embedding Persistence Diagrams into Separable Hilbert Spaces.",
                    "Convex Polygons in Cartesian Products.",
                    "Smallest k-Enclosing Rectangle Revisited.",
                    "Dynamic Geometric Data Structures via Shallow Cuttings.",
                    "Lower Bounds for Electrical Reduction on Surfaces.",
                    "Maintaining the Union of Unit Discs Under Insertions with Near-Optimal Overhead.",
                    "Almost Tight Lower Bounds for Hard Cutting Problems in Embedded Graphs.",
                    "The VC Dimension of Metric Balls Under Fréchet and Hausdorff Distances.",
                    "Dual Circumference and Collinear Sets.",
                    "A Product Inequality for Extreme Distances.",
                    "Topological Data Analysis in Information Space.",
                    "Cubic Planar Graphs That Cannot Be Drawn On Few Lines.",
                    "Counting Polygon Triangulations is Hard.",
                    "Topologically Trivial Closed Walks in Directed Surface Graphs.",
                    "Packing Disks into Disks with Optimal Worst-Case Density.",
                    "Semi-Algebraic Colorings of Complete Graphs.",
                    "Chunk Reduction for Multi-Parameter Persistent Homology.",
                    "The Crossing Tverberg Theorem.",
                    "Z_2-Genus of Graphs and Minimum Rank of Partial Symmetric Matrices.",
                    "An Experimental Study of Forbidden Patterns in Geometric Permutations by Combinatorial Lifting.",
                    "Journey to the Center of the Point Set.",
                    "Preprocessing Ambiguous Imprecise Points.",
                    "Rods and Rings: Soft Subdivision Planner for R^3 x S^2.",
                    "3-Manifold Triangulations with Small Treewidth.",
                    "Algorithms for Metric Learning via Contrastive Embeddings.",
                    "Exact Computation of the Matching Distance on 2-Parameter Persistence Modules.",
                    "Probabilistic Smallest Enclosing Ball in High Dimensions via Subgradient Sampling.",
                    "A Weighted Approach to the Maximum Cardinality Bipartite Matching Problem with Applications in Geometric Settings.",
                    "The Unbearable Hardness of Unknotting.",
                    "On Grids in Point-Line Arrangements in the Plane.",
                    "On Weak epsilon-Nets and the Radon Number.",
                    "Dynamic Planar Point Location in External Memory.",
                    "Efficient Algorithms for Ortho-Radial Graph Drawing.",
                    "On the Chromatic Number of Disjointness Graphs of Curves.",
                    "Computing Persistent Homology of Flag Complexes via Strong Collapses.",
                    "Ham-Sandwich Cuts and Center Transversals in Subspaces.",
                    "Distribution-Sensitive Bounds on Relative Approximations of Geometric Ranges.",
                    "DTM-Based Filtrations.",
                    "A Divide-and-Conquer Algorithm for Two-Point L_1 Shortest Path Queries in Polygonal Domains.",
                    "Near-Optimal Algorithms for Shortest Paths in Weighted Unit-Disk Graphs.",
                    "Searching for the Closest-Pair in a Query Translate.",
                    "On the Complexity of the k-Level in Arrangements of Pseudoplanes.",
                    "Packing Geometric Objects with Optimal Worst-Case Density (Multimedia Exposition).",
                    "Properties of Minimal-Perimeter Polyominoes (Multimedia Exposition).",
                    "A Manual Comparison of Convex Hull Algorithms (Multimedia Exposition).",
                    "Fréchet View - A Tool for Exploring Fréchet Distance Algorithms (Multimedia Exposition)."
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "34th SoCG 2018",
        "info": "Budapest, Hungary",
        "venues": [
            {
                "sub_name_abbr": "conf/compgeom/2018",
                "sub_name": "34th International Symposium on Computational Geometry, SoCG 2018, June 11-14, 2018, Budapest, Hungary.",
                "count": 78,
                "papers": [
                    "Front Matter, Table of Contents, Foreword, Conference Organization, Additional Reviewers, Acknowledgement of Support, Invited Talks.",
                    "Sampling Conditions for Conforming Voronoi Meshing by the VoroCrust Algorithm.",
                    "Approximating Maximum Diameter-Bounded Subgraph in Unit Disk Graphs.",
                    "Vietoris-Rips and Cech Complexes of Metric Gluings.",
                    "Improved Dynamic Geodesic Nearest Neighbor Searching in a Simple Polygon.",
                    "O~(n^{1/3})-Space Algorithm for the Grid Graph Reachability Problem.",
                    "The Reverse Kakeya Problem.",
                    "Capacitated Covering Problems in Geometric Spaces.",
                    "Faster Algorithms for some Optimization Problems on Collinear Points.",
                    "Local Criteria for Triangulation of Manifolds.",
                    "The Reach, Metric Distortion, Geodesic Convexity and the Variation of Tangent Spaces.",
                    "Orthogonal Terrain Guarding is NP-complete.",
                    "QPTAS and Subexponential Algorithm for Maximum Clique on Disk Graphs.",
                    "Computational Complexity of the Interleaving Distance.",
                    "Sheaf-Theoretic Stratification Learning.",
                    "Realizations of Indecomposable Persistence Modules of Arbitrarily Large Dimension.",
                    "Approximating the Distribution of the Median and other Robust Estimators on Uncertain Data.",
                    "Consistent Sets of Lines with no Colorful Incidence.",
                    "The HOMFLY-PT Polynomial is Fixed-Parameter Tractable.",
                    "Practical Volume Computation of Structured Convex Bodies, and an Application to Modeling Portfolio Dependencies and Financial Crises.",
                    "Subquadratic Encodings for Point Configurations.",
                    "Algorithms for Low-Distortion Embeddings into Arbitrary 1-Dimensional Spaces.",
                    "Fast Approximation and Exact Computation of Negative Curvature Parameters of Graphs.",
                    "Tree Drawings Revisited.",
                    "Approximate Shortest Paths and Distance Oracles in Weighted Unit-Disk Graphs.",
                    "Dynamic Planar Orthogonal Point Location in Sublogarithmic Time.",
                    "The Density of Expected Persistence Diagrams and its Kernel Based Estimation.",
                    "Embedding Graphs into Two-Dimensional Simplicial Complexes.",
                    "On the Complexity of Closest Pair via Polar-Pair of Point-Sets.",
                    "Coordinated Motion Planning: Reconfiguring a Swarm of Labeled Robots with Bounded Stretch.",
                    "3D Snap Rounding.",
                    "Graph Reconstruction by Discrete Morse Theory.",
                    "Computing Bottleneck Distance for 2-D Interval Decomposable Modules.",
                    "Structure and Generation of Crossing-Critical Graphs.",
                    "The Multi-cover Persistence of Euclidean Balls.",
                    "Smallest Enclosing Spheres and Chernoff Points in BregmanGeometry.",
                    "Near Isometric Terminal Embeddings for Doubling Metrics.",
                    "Products of Euclidean Metrics and Applications to Proximity Questions among Curves.",
                    "Rainbow Cycles in Flip Graphs.",
                    "Hanani-Tutte for Approximating Maps of Graphs.",
                    "The Z_2-Genus of Kuratowski Minors.",
                    "Shellability is NP-Complete.",
                    "Optimal Morphs of Planar Orthogonal Drawings.",
                    "Computational Topology and the Unique Games Conjecture.",
                    "Solving Large-Scale Minimum-Weight Triangulation Instances to Provable Optimality.",
                    "Dynamic Smooth Compressed Quadtrees.",
                    "On the Treewidth of Triangulated 3-Manifolds.",
                    "On Partial Covering For Geometric Set Systems.",
                    "Optimality of Geometric Local Search.",
                    "Odd Yao-Yao Graphs are Not Spanners.",
                    "Deletion in Abstract Voronoi Diagrams in Expected Linear Time.",
                    "From a (p, 2)-Theorem to a Tight (p, q)-Theorem.",
                    "Coloring Intersection Hypergraphs of Pseudo-Disks.",
                    "Minimizing Crossings in Constrained Two-Sided Circular Graph Layouts.",
                    "Discrete Stratified Morse Theory: A User's Guide.",
                    "An Optimal Algorithm to Compute the Inverse Beacon Attraction Region.",
                    "On Optimal Polyline Simplification Using the Hausdorff and Fréchet Distance.",
                    "Graph-Based Time-Space Trade-Offs for Approximate Near Neighbors.",
                    "A Nearly Optimal Algorithm for the Geodesic Voronoi Diagram of Points in a Simple Polygon.",
                    "Further Consequences of the Colorful Helly Hypothesis.",
                    "Random Walks on Polytopes of Constant Corank.",
                    "Table Based Detection of Degenerate Predicates in Free Space Construction.",
                    "Approximate Range Queries for Clustering.",
                    "Point Location in Dynamic Planar Subdivisions.",
                    "Edge-Unfolding Nearly Flat Convex Caps.",
                    "A Crossing Lemma for Multigraphs.",
                    "Near-Optimal Coresets of Kernel Density Estimates.",
                    "Optimal Analysis of an Online Algorithm for the Bipartite Matching Problem on a Line.",
                    "Almost All String Graphs are Intersection Graphs of Plane Convex Sets.",
                    "An Improved Bound for the Size of the Set A/A+A.",
                    "Fractal Dimension and Lower Bounds for Geometric Problems.",
                    "The Trisection Genus of Standard Simply Connected PL 4-Manifolds.",
                    "An O(n log n)-Time Algorithm for the k-Center Problem in Trees.",
                    "New Bounds for Range Closest-Pair Problems.",
                    "Coordinated Motion Planning: The Video (Multimedia Exposition).",
                    "Geometric Realizations of the 3D Associahedron (Multimedia Exposition).",
                    "Star Unfolding of Boxes (Multimedia Exposition).",
                    "VoroCrust Illustrated: Theory and Challenges (Multimedia Exposition)."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "33rd SoCG 2017",
        "info": "Brisbane, QLD, Australia",
        "venues": [
            {
                "sub_name_abbr": "conf/compgeom/2017",
                "sub_name": "33rd International Symposium on Computational Geometry, SoCG 2017, July 4-7, 2017, Brisbane, Australia.",
                "count": 68,
                "papers": [
                    "Front Matter, Table of Contents, Foreword, Conference Organization, External Reviewers, Sponsors.",
                    "The Geometry and Topology of Crystals: From Sphere-Packing to Tiling, Nets, and Knots (Invited Talk).",
                    "The Algebraic Revolution in Combinatorial and Computational Geometry: State of the Art (Invited Talk).",
                    "Irrational Guards are Sometimes Needed.",
                    "Minimum Perimeter-Sum Partitions in the Plane.",
                    "Range-Clustering Queries.",
                    "Best Laid Plans of Lions and Men.",
                    "Faster Algorithms for the Geometric Transportation Problem.",
                    "A Superlinear Lower Bound on the Number of 5-Holes.",
                    "A Universal Slope Set for 1-Bend Planar Drawings.",
                    "Near-Optimal epsilon-Kernel Construction and Related Problems.",
                    "Exact Algorithms for Terrain Guarding.",
                    "Covering Lattice Points by Subspaces and Counting Point-Hyperplane Incidences.",
                    "Subquadratic Algorithms for Algebraic Generalizations of 3SUM.",
                    "Towards a Topology-Shape-Metrics Framework for Ortho-Radial Drawings.",
                    "On the Number of Ordinary Lines Determined by Sets in Complex Space.",
                    "On Optimal 2- and 3-Planar Graphs.",
                    "Reachability in a Planar Subdivision with Direction Constraints.",
                    "Fine-Grained Complexity of Coloring Unit Disks and Balls.",
                    "Anisotropic Triangulations via Discrete Riemannian Voronoi Diagrams.",
                    "An Approximation Algorithm for the Art Gallery Problem.",
                    "Self-Approaching Paths in Simple Polygons.",
                    "Maximum Volume Subset Selection for Anchored Boxes.",
                    "Declutter and Resample: Towards Parameter Free Denoising.",
                    "Ham Sandwich is Equivalent to Borsuk-Ulam.",
                    "Local Equivalence and Intrinsic Metrics between Reeb Graphs.",
                    "Applications of Chebyshev Polynomials to Low-Dimensional Computational Geometry.",
                    "Orthogonal Range Searching in Moderate Dimensions: k-d Trees and Range Trees Strike Back.",
                    "Dynamic Orthogonal Range Searching on the RAM, Revisited.",
                    "On Bend-Minimized Orthogonal Drawings of Planar 3-Graphs.",
                    "Adaptive Planar Point Location.",
                    "High Dimensional Consistent Digital Segments.",
                    "TSP With Locational Uncertainty: The Adversarial Model.",
                    "On Planar Greedy Drawings of 3-Connected Planar Graphs.",
                    "Origamizer: A Practical Algorithm for Folding Any Polyhedron.",
                    "Computing the Geometric Intersection Number of Curves.",
                    "Topological Analysis of Nerves, Reeb Spaces, Mappers, and Multiscale Mappers.",
                    "Locality-Sensitive Hashing of Curves.",
                    "Shallow Packings, Semialgebraic Set Systems, Macbeath Regions, and Polynomial Partitioning.",
                    "Topological Data Analysis with Bregman Divergences.",
                    "Finding Small Hitting Sets in Infinite Range Spaces of Bounded VC-Dimension.",
                    "A Nearly Quadratic Bound for the Decision Tree Complexity of k-SUM.",
                    "Computing the Fréchet Gap Distance.",
                    "Erdös-Hajnal Conjecture for Graphs with Bounded VC-Dimension.",
                    "Implementing Delaunay Triangulations of the Bolza Surface.",
                    "Lower Bounds for Differential Privacy from Gaussian Width.",
                    "Constrained Triangulations, Volumes of Polytopes, and Unit Equations.",
                    "Proper Coloring of Geometric Hypergraphs.",
                    "Computing Representative Networks for Braided Rivers.",
                    "A Proof of the Orbit Conjecture for Flipping Edge-Labelled Triangulations.",
                    "A Spectral Gap Precludes Low-Dimensional Embeddings.",
                    "Dynamic Geodesic Convex Hulls in Dynamic Simple Polygons.",
                    "Voronoi Diagrams for a Moderate-Sized Point-Set in a Simple Polygon.",
                    "A Quest to Unravel the Metric Structure Behind Perturbed Networks.",
                    "From Crossing-Free Graphs on Wheel Sets to Embracing Simplices and Polytopes with Few Vertices.",
                    "Approximate Range Counting Revisited.",
                    "Coloring Curves That Cross a Fixed Curve.",
                    "Barcodes of Towers and a Streaming Algorithm for Persistent Homology.",
                    "Algorithmic Interpretations of Fractal Dimension.",
                    "Disjointness Graphs of Segments.",
                    "Bicriteria Rectilinear Shortest Paths among Rectilinear Obstacles in the Plane.",
                    "Quickest Visibility Queries in Polygonal Domains.",
                    "Zapping Zika with a Mosquito-Managing Drone: Computing Optimal Flight Patterns with Minimum Turn Cost (Multimedia Contribution).",
                    "Ruler of the Plane - Games of Geometry (Multimedia Contribution).",
                    "Folding Free-Space Diagrams: Computing the Fréchet Distance between 1-Dimensional Curves (Multimedia Contribution).",
                    "Cardiac Trabeculae Segmentation: an Application of Computational Topology (Multimedia Contribution).",
                    "MatchTheNet - An Educational Game on 3-Dimensional Polytopes (Multimedia Contribution).",
                    "On Balls in a Hilbert Polygonal Geometry (Multimedia Contribution)."
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "32nd SoCG 2016",
        "info": "Boston, MA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/compgeom/2016",
                "sub_name": "32nd International Symposium on Computational Geometry, SoCG 2016, June 14-18, 2016, Boston, MA, USA.",
                "count": 73,
                "papers": [
                    "Front Matter, Table of Contents, Foreword, Conference Organization, External Reviewers, Sponsors.",
                    "Toward Pervasive Robots (Invited Talk).",
                    "Discrete Geometry, Algebra, and Combinatorics (Invited Talk).",
                    "Who Needs Crossings? Hardness of Plane Graph Rigidity.",
                    "Finding the Maximum Subset with Bounded Convex Curvature.",
                    "Coloring Points with Respect to Squares.",
                    "Approximating Dynamic Time Warping and Edit Distance for a Pair of Point Sequences.",
                    "An Improved Lower Bound on the Minimum Number of Triangulations.",
                    "Recognizing Weakly Simple Polygons.",
                    "Tight Lower Bounds for Data-Dependent Locality-Sensitive Hashing.",
                    "The Number of Holes in the Union of Translates of a Convex Set in Three Dimensions.",
                    "On the Combinatorial Complexity of Approximating Polytopes.",
                    "Efficient Algorithms to Decide Tightness.",
                    "Anchored Rectangle and Square Packings.",
                    "On Variants of k-means Clustering.",
                    "Incremental Voronoi diagrams.",
                    "Dimension Reduction Techniques for ℓp (1<p<2), with Applications.",
                    "Testing Convexity of Figures Under the Uniform Distribution.",
                    "Separating a Voronoi Diagram via Local Search.",
                    "On Visibility Representations of Non-Planar Graphs.",
                    "Delaunay Triangulations on Orientable Surfaces of Low Genus.",
                    "An Efficient Randomized Algorithm for Higher-Order Abstract Voronoi Diagrams.",
                    "All-Pairs Minimum Cuts in Near-Linear Time for Surface-Embedded Graphs.",
                    "Minimum Cycle and Homology Bases of Surface Embedded Graphs.",
                    "Finding Non-Orientable Surfaces in 3-Manifolds.",
                    "Structure and Stability of the 1-Dimensional Mapper.",
                    "Max-Sum Diversity Via Convex Programming.",
                    "Dynamic Streaming Algorithms for Epsilon-Kernels.",
                    "Two Approaches to Building Time-Windowed Geometric Data Structures.",
                    "Untangling Planar Curves.",
                    "Inserting Multiple Edges into a Planar Graph.",
                    "Polynomial-Sized Topological Approximations Using the Permutahedron.",
                    "Faster Algorithms for Computing Plurality Points.",
                    "Qualitative Symbolic Perturbation.",
                    "Finding Global Optimum for Truth Discovery: Entropy Based Geometric Variance.",
                    "On Expansion and Topological Overlap.",
                    "On the Number of Maximum Empty Boxes Amidst n Points.",
                    "Strongly Monotone Drawings of Planar Graphs.",
                    "Hyperplane Separability and Convexity of Probabilistic Point Sets.",
                    "Subexponential Algorithms for Rectilinear Steiner Tree and Arborescence Problems.",
                    "Random Sampling with Removal.",
                    "The Planar Tree Packing Theorem.",
                    "Crossing Number is Hard for Kernelization.",
                    "Shortest Path Embeddings of Graphs on Surfaces.",
                    "Simultaneous Nearest Neighbor Search.",
                    "Degree Four Plane Spanners: Simpler and Better.",
                    "A Lower Bound on Opaque Sets.",
                    "Fixed Points of the Restricted Delaunay Triangulation Operator.",
                    "Congruence Testing of Point Sets in 4-Space.",
                    "On the Complexity of Minimum-Link Path Problems.",
                    "A Quasilinear-Time Algorithm for Tiling the Plane Isohedrally with a Polyomino.",
                    "Eliminating Higher-Multiplicity Intersections, II. The Deleted Product Criterion in the r-Metastable Range.",
                    "Peeling and Nibbling the Cactus: Subexponential-Time Algorithms for Counting Triangulations and Related Problems.",
                    "Convergence between Categorical Representations of Reeb Space and Mapper.",
                    "New Lower Bounds for epsilon-Nets.",
                    "On Computing the Fréchet Distance Between Surfaces.",
                    "The Farthest-Point Geodesic Voronoi Diagram of Points on the Boundary of a Simple Polygon.",
                    "Avoiding the Global Sort: A Faster Contour Tree Algorithm.",
                    "Configurations of Lines in 3-Space and Rigidity of Planar Structures.",
                    "Weak 1/r-Nets for Moving Points.",
                    "Applications of Incidence Bounds in Point Covering Problems.",
                    "Grouping Time-Varying Data for Interactive Exploration.",
                    "On the Separability of Stochastic Geometric Objects, with Applications.",
                    "Approximating Convex Shapes With Respect to Symmetric Difference Under Homotheties.",
                    "Interactive Geometric Algorithm Visualization in a Browser.",
                    "Geometric Models for Musical Audio Data.",
                    "Visualizing Scissors Congruence.",
                    "Visualization of Geometric Spanner Algorithms.",
                    "Path Planning for Simple Robots using Soft Subdivision Search.",
                    "Exploring Circle Packing Algorithms.",
                    "The Explicit Corridor Map: Using the Medial Axis for Real-Time Path Planning and Crowd Simulation.",
                    "High-Dimensional Geometry of Sliding Window Embeddings of Periodic Videos.",
                    "Introduction to Persistent Homology."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "31st SoCG 2015",
        "info": "Eindhoven, The Netherlands",
        "venues": [
            {
                "sub_name_abbr": "conf/compgeom/2015",
                "sub_name": "31st International Symposium on Computational Geometry, SoCG 2015, June 22-25, 2015, Eindhoven, The Netherlands.",
                "count": 66,
                "papers": [
                    "Front Matter, Table of Contents, Preface, Conference Organization.",
                    "Combinatorial Discrepancy for Boxes via the gamma_2 Norm.",
                    "Tilt: The Video - Designing Worlds to Control Robot Swarms with Only Global Signals.",
                    "Automatic Proofs for Formulae Enumerating Proper Polycubes.",
                    "Visualizing Sparse Filtrations.",
                    "Visualizing Quickest Visibility Maps.",
                    "Sylvester-Gallai for Arrangements of Subspaces.",
                    "Computational Aspects of the Colorful Carathéodory Theorem.",
                    "Semi-algebraic Ramsey Numbers.",
                    "A Short Proof of a Near-Optimal Cardinality Estimate for the Product of a Sum Set.",
                    "A Geometric Approach for the Upper Bound Theorem for Minkowski Sums of Convex Polytopes.",
                    "Two Proofs for Shallow Packings.",
                    "Shortest Path in a Polygon using Sublinear Space.",
                    "Optimal Morphs of Convex Drawings.",
                    "1-String B_2-VPG Representation of Planar Graphs.",
                    "Spanners and Reachability Oracles for Directed Transmission Graphs.",
                    "Recognition and Complexity of Point Visibility Graphs.",
                    "Geometric Spanners for Points Inside a Polygonal Domain.",
                    "An Optimal Algorithm for the Separating Common Tangents of Two Polygons.",
                    "A Linear-Time Algorithm for the Geodesic Center of a Simple Polygon.",
                    "On the Smoothed Complexity of Convex Hulls.",
                    "Finding All Maximal Subsequences with Hereditary Properties.",
                    "Riemannian Simplices and Triangulations.",
                    "An Edge-Based Framework for Enumerating 3-Manifold Triangulations.",
                    "Order on Order Types.",
                    "Limits of Order Types.",
                    "Combinatorial Redundancy Detection.",
                    "Effectiveness of Local Search for Geometric Optimization.",
                    "On the Shadow Simplex Method for Curved Polyhedra.",
                    "Pattern Overlap Implies Runaway Growth in Hierarchical Tile Systems.",
                    "Space Exploration via Proximity Search.",
                    "Star Unfolding from a Geodesic Curve.",
                    "The Dirac-Motzkin Problem on Ordinary Lines and the Orchard Problem (Invited Talk).",
                    "On the Beer Index of Convexity and Its Variants.",
                    "Tight Bounds for Conflict-Free Chromatic Guarding of Orthogonal Art Galleries.",
                    "Low-Quality Dimension Reduction and High-Dimensional Approximate Nearest Neighbor.",
                    "Restricted Isometry Property for General p-Norms.",
                    "Strong Equivalence of the Interleaving and Functional Distortion Metrics for Reeb Graphs.",
                    "On Generalized Heawood Inequalities for Manifolds: A Van Kampen-Flores-type Nonembeddability Result.",
                    "Comparing Graphs via Persistence Distortion.",
                    "Bounding Helly Numbers via Betti Numbers.",
                    "Polynomials Vanishing on Cartesian Products: The Elekes-Szabó Theorem Revisited.",
                    "Bisector Energy and Few Distinct Distances.",
                    "Incidences between Points and Lines in Three Dimensions.",
                    "The Number of Unit-Area Triangles in the Plane: Theme and Variations.",
                    "On the Number of Rich Lines in Truly High Dimensional Sets.",
                    "Realization Spaces of Arrangements of Convex Bodies.",
                    "Computing Teichmüller Maps between Polygons.",
                    "On-line Coloring between Two Lines.",
                    "Building Efficient and Compact Data Structures for Simplicial Complexes.",
                    "Shortest Path to a Segment and Quickest Visibility Queries.",
                    "Trajectory Grouping Structure under Geodesic Distance.",
                    "From Proximity to Utility: A Voronoi Partition of Pareto Optima.",
                    "Faster Deterministic Volume Estimation in the Oracle Model via Thin Lattice Coverings.",
                    "Optimal Deterministic Algorithms for 2-d and 3-d Shallow Cuttings.",
                    "A Simpler Linear-Time Algorithm for Intersecting Two Convex Polyhedra in Three Dimensions.",
                    "Approximability of the Discrete Fréchet Distance.",
                    "The Hardness of Approximation of Euclidean k-Means.",
                    "A Fire Fighter's Problem.",
                    "Approximate Geometric MST Range Queries.",
                    "Maintaining Contour Trees of Dynamic Terrains.",
                    "Hyperorthogonal Well-Folded Hilbert Curves.",
                    "Topological Analysis of Scalar Fields with Outliers.",
                    "On Computability and Triviality of Well Groups.",
                    "Geometric Inference on Kernel Density Estimates.",
                    "Modeling Real-World Data Sets (Invited Talk)."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "30th SoCG 2014",
        "info": "Kyoto, Japan",
        "venues": [
            {
                "sub_name_abbr": "conf/compgeom/2014",
                "sub_name": "30th Annual Symposium on Computational Geometry, SoCG'14, Kyoto, Japan, June 08 - 11, 2014.",
                "count": 70,
                "papers": [
                    "Counting and Enumerating Crossing-free Geometric Graphs.",
                    "A Framework for Computing the Greedy Spanner.",
                    "There are Plane Spanners of Maximum Degree 4.",
                    "New and Improved Spanning Ratios for Yao Graphs.",
                    "On Constant Factors in Comparison-Based Geometric Algorithms and Data Structures.",
                    "Progressive Geometric Algorithms.",
                    "On the Impossibility of Dimension Reduction for Doubling Subsets of ℓp.",
                    "The limited blessing of low dimensionality: when 1-1/d is the best possible exponent for d-dimensional geometric problems.",
                    "Design of 3D printed mathematical art.",
                    "Embeddability in the 3-sphere is decidable.",
                    "The Connect-The-Dots Family of Puzzles: The Video.",
                    "LiveCG: an Interactive Visualization Environment for Computational Geometry.",
                    "Trajectory Grouping Structure: the Video.",
                    "Visualizing hyperbolic Voronoi diagrams.",
                    "Animation of an Algorithm for Drawing Graphs in 3D.",
                    "Visualization of Floater and Gotsman's Morphing Algorithm.",
                    "Geometric kth Shortest Paths: the Applet.",
                    "Polytope Offsets and Straight Skeletons in 3D.",
                    "Optimal Geometric Flows via Dual Programs.",
                    "Sub-linear Time Hybrid Approximations for Least Trimmed Squares Estimator and Related Problems.",
                    "Quasi-Polynomial Time Approximation Scheme for Sparse Subsets of Polygons.",
                    "A near-optimal approximation algorithm for Asymmetric TSP on embedded graphs.",
                    "Outerstring graphs are χ-bounded.",
                    "Improved bounds for the conflict-free chromatic art gallery problem.",
                    "Linear transformation distance for bichromatic matchings.",
                    "Delaunay triangulations with disconnected realization spaces.",
                    "Eliminating Tverberg Points, I. An Analogue of the Whitney Trick.",
                    "Higher Dimensional Cheeger Inequalities.",
                    "Incidences between points and lines in R4: Extended Abstract.",
                    "On triple intersections of three families of unit circles.",
                    "Finding the Largest Disk Containing a Query Point in Logarithmic Time with Linear Storage.",
                    "Smallest enclosing ball for probabilistic data.",
                    "Peeling Potatoes Near-Optimally in Near-Linear Time.",
                    "On the Complexity of Randomly Weighted Voronoi Diagrams.",
                    "A Census of Plane Graphs with Polyline Edges.",
                    "Polynomials vanishing on grids: The Elekes-Rónyai problem revisited.",
                    "Using Convex Relaxations for Efficiently and Privately Releasing Marginals.",
                    "Near-Linear Algorithms for Geometric Hitting Sets and Set Covers.",
                    "Better embeddings for planar Earth-Mover Distance over sparse sets.",
                    "Higher-Quality Tetrahedral Mesh Generation for Domains with Small Angles by Constrained Delaunay Refinement.",
                    "On the reconstruction of convex sets from random normal measurements.",
                    "Intersection of paraboloids and application to Minkowski-type problems.",
                    "Efficient Random-Walk Methods for Approximating Polytope Volume.",
                    "The Persistent Homology of Distance Functions under Random Projection.",
                    "Discrete Systolic Inequalities and Decompositions of Triangulated Surfaces.",
                    "Computing Topological Persistence for Simplicial Maps.",
                    "Induced Matchings of Barcodes and the Algebraic Stability of Persistence.",
                    "Towards Expressive 3D Modeling: new challenges for geometric computing.",
                    "Computing the Fréchet distance with shortcuts is NP-hard.",
                    "The Discrete Fréchet Distance with Shortcuts via Approximate Distance Counting and Selection.",
                    "Light spanners for Snowflake Metrics.",
                    "Continuously Flattening Polyhedra Using Straight Skeletons.",
                    "Two-Point L1 Shortest Path Queries in the Plane.",
                    "Better ϵ-Dependencies for Offline Approximate Nearest Neighbor Search, Euclidean Minimum Spanning Trees, and ϵ-Kernels.",
                    "Free Edge Lengths in Plane Graphs.",
                    "Weight Balancing on Boundaries and Skeletons.",
                    "Separation by Convex Pseudo-Circles.",
                    "Euclidean Steiner Shallow-Light Trees.",
                    "Measuring Distance between Reeb Graphs.",
                    "Stochastic Convergence of Persistence Landscapes and Silhouettes.",
                    "The Morse Theory of Čech and Delaunay Filtrations.",
                    "Gromov-Hausdorff Approximation of Filament Structure Using Reeb-type Graph.",
                    "Metric Embedding, Hyperbolic Space, and Social Networks.",
                    "Sampling with Removal in LP-type Problems.",
                    "Liftings and stresses for planar periodic frameworks.",
                    "The Opaque Square.",
                    "The JS-graphs of Join and Split Trees.",
                    "Distinct distances on algebraic curves in the plane.",
                    "Lower bounds on geometric Ramsey functions.",
                    "Curves in Rd intersecting every hyperplane at most d + 1 times."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "29th SoCG 2013",
        "info": "Rio de Janeiro, Brazil",
        "venues": [
            {
                "sub_name_abbr": "conf/compgeom/2013",
                "sub_name": "Symposium on Computational Geometry 2013, SoCG '13, Rio de Janeiro, Brazil, June 17-20, 2013.",
                "count": 55,
                "papers": [
                    "A simple aggregative algorithm for counting triangulations of planar point sets and related problems.",
                    "A sub-quadratic algorithm for bipartite matching of planar points with bounded integer coordinates.",
                    "A faster algorithm for computing motorcycle graphs.",
                    "The graphs of planar soap bubbles.",
                    "Efficiently hex-meshing things with topology.",
                    "Localized delaunay refinement for piecewise-smooth complexes.",
                    "A parallel algorithm for computing the flow complex.",
                    "Hyperbolic delaunay complexes and voronoi diagrams made practical.",
                    "On a forgotten conjecture from a famous paper of Erdös.",
                    "On planar point sets with the pentagon property.",
                    "Equal coefficients and tolerance in coloured tverberg partitions.",
                    "Improved bounds for incidences between points and circles.",
                    "Graph induced complex on point data.",
                    "Homological reconstruction and simplification in R3.",
                    "Parameterized complexity of discrete morse theory.",
                    "Kinetic data structures for all nearest neighbors and closest pair in the plane.",
                    "Kinetic 2-centers in the black-box model.",
                    "Competitive query strategies for minimising the ply of the potential locations of moving points.",
                    "Recent progress on the combinatorial diameter of polyhedra and simplicial complexes.",
                    "Complexity analysis of random geometric structures made simpler.",
                    "Union of random minkowski sums and network vulnerability analysis.",
                    "The maximum number of faces of the minkowski sum of three convex polytopes.",
                    "On the 2-sum embedding conjecture.",
                    "Diverse near neighbor problem.",
                    "Compressive sensing using locality-preserving matrices.",
                    "Range counting coresets for uncertain data.",
                    "Small-size relative (p, ε)-approximations for well-behaved range spaces.",
                    "A constant-factor approximation for multi-covering with disks.",
                    "Counting and sampling minimum cuts in genus g graphs.",
                    "Topological graphs: empty triangles and disjoint matchings.",
                    "Bichromatic compatible matchings.",
                    "Putting the turing into manufacturing: recent developments in algorithmic automation.",
                    "A new approach to output-sensitive voronoi diagrams and delaunay triangulations.",
                    "A fast algorithm for well-spaced points and approximate delaunay graphs.",
                    "Fast segment insertion and incremental construction of constrained delaunay triangulations.",
                    "Ramsey-type results for semi-algebraic relations.",
                    "Sharp bounds on Davenport-Schinzel sequences of every order.",
                    "Capture bounds for visibility-based pursuit evasion.",
                    "Polyominoes on twisted cylinders.",
                    "Interactive visualization of 3D configuration spaces.",
                    "Parametric search visualization.",
                    "Triangulating unknown environments using robot swarms.",
                    "Point guards and point clouds: solving general art gallery problems.",
                    "On soft predicates in subdivision motion planning.",
                    "A near-optimal algorithm for shortest paths among curved obstacles in the plane.",
                    "Computing shortest paths among curved obstacles in the plane.",
                    "The complexity of separating points in the plane.",
                    "Zigzag zoology: rips zigzags for homology inference.",
                    "Geometry in the space of persistence modules.",
                    "Computing closed essential surfaces in knot complements.",
                    "A new approach to crushing 3-manifold triangulations.",
                    "Measuring similarity between curves on 2-manifolds via homotopy area.",
                    "Lower bounds for k-distance approximation.",
                    "Systems of distant representatives in euclidean space.",
                    "Robust geometric spanners."
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "28th SCG 2012",
        "info": "Chapel Hill, NC, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/compgeom/2012",
                "sub_name": "Proceedings of the 28th ACM Symposium on Computational Geometry, Chapel Hill, NC, USA, June 17-20, 2012.",
                "count": 51,
                "papers": [
                    "On topological changes in the delaunay triangulation of moving points.",
                    "Geometric packing under non-uniform constraints.",
                    "Computing cartograms with optimal complexity.",
                    "Approximate bregman near neighbors in sublinear time: beyond the triangle inequality.",
                    "The point-set embeddability problem for plane graphs.",
                    "Algorithmic complexity of finding cross-cycles in flag complexes.",
                    "Counting crossing-free structures.",
                    "A fast and simple surface reconstruction algorithm.",
                    "Protein molecules in 3D: complex behavior from simple local geometry plus weak interactions.",
                    "Higher-order Erdos-Szekeres theorems.",
                    "Add isotropic Gaussian kernels at own risk: more and more resilient modes in higher dimensions.",
                    "On the expected complexity of voronoi diagrams on terrains.",
                    "On Klee's measure problem for grounded boxes.",
                    "How to walk your dog in the mountains with no magic leash.",
                    "Tracing compressed curves in triangulated surfaces.",
                    "Testing graph isotopies on surfaces.",
                    "On laplacians of random complexes.",
                    "Approximating low-dimensional coverage problems.",
                    "Improved range searching lower bounds.",
                    "An output-sensitive algorithm for computing projections of resultant polytopes.",
                    "Counting plane graphs: perfect matchings, spanning cycles, and Kasteleyn's technique.",
                    "Mappings and meshes.",
                    "Cubic plane graphs on a given point set.",
                    "Multinerves and helly numbers of acyclic families.",
                    "Duals of orphan-free anisotropic voronoi diagrams are embedded meshes.",
                    "Stability of Delaunay-type structures for manifolds: [extended abstract].",
                    "Linear-size approximations to the vietoris-rips filtration.",
                    "Alexander duality for functions: the persistent behavior of land and water and shore.",
                    "Certified computation of planar morse-smale complexes.",
                    "A deterministic o(m log m) time algorithm for the reeb graph.",
                    "Self-improving algorithms for coordinate-wise maxima.",
                    "Finding the maximal empty disk containing a query point.",
                    "Conflict-free coloring of points with respect to rectangles and approximation algorithms for discrete independent set.",
                    "Approximating Tverberg points in linear time for any fixed dimension.",
                    "Tessellation analysis of the cosmic web.",
                    "Stabbing horizontal segments with vertical rays.",
                    "Higher-dimensional orthogonal range reporting and rectangle stabbing in the pointer machine model.",
                    "A theorem of bárány revisited and extended.",
                    "Improved pointer machine and I/O lower bounds for simplex range reporting and related problems.",
                    "Periodic body-and-bar frameworks.",
                    "On sub-determinants and the diameter of polyhedra.",
                    "Optimal area-sensitive bounds for polytope approximation.",
                    "Object-image correspondence for curves under central and parallel projections.",
                    "Disjoint edges in complete topological graphs.",
                    "Representing a cubic graph as the intersection graph of axis-parallel boxes in three dimensions.",
                    "The 2-page crossing number of Kn.",
                    "String graphs and incomparability graphs.",
                    "Configuration space visualization.",
                    "Surface patches from unorganized space curves.",
                    "Lang's universal molecule algorithm.",
                    "The sticky geometry of the cosmic web."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "27th SCG 2011",
        "info": "Paris, France",
        "venues": [
            {
                "sub_name_abbr": "conf/compgeom/2011",
                "sub_name": "Proceedings of the 27th ACM Symposium on Computational Geometry, Paris, France, June 13-15, 2011.",
                "count": 64,
                "papers": [
                    "Orthogonal range searching on the RAM, revisited.",
                    "Convex hull of imprecise points in o(n log n) time after preprocessing.",
                    "A static optimality transformation with applications to planar point location.",
                    "Three problems about dynamic convex hulls.",
                    "Metric graph reconstruction from noisy data.",
                    "Comparing distributions and shapes using the kernel distance.",
                    "Witnessed k-distance.",
                    "Stochastic minimum spanning trees in euclidean spaces.",
                    "Can they cross? and how?: (the hitchhiker's guide to the universe of geometric intersection graphs).",
                    "Exploiting temporal coherence in forest dynamics simulation.",
                    "Compressive sensing with local geometric features.",
                    "Persistence-based clustering in riemannian manifolds.",
                    "A kuratowski-type theorem for planarity of partially embedded graphs.",
                    "A center transversal theorem for hyperplanes and applications to graph drawing.",
                    "Disjoint compatible geometric matchings.",
                    "The least spanning area of a knot and the optimal bounding chain problem.",
                    "A tree traversal algorithm for decision problems in knot theory and 3-manifold topology.",
                    "The pachner graph and the simplification of 3-sphere triangulations.",
                    "Space crossing numbers.",
                    "Theoretical and practical results on straight skeletons of planar straight-line graphs.",
                    "A generic algebraic kernel for non-linear geometric applications.",
                    "Deconstructing approximate offsets.",
                    "Stable snap rounding.",
                    "An output-sensitive algorithm for persistent homology.",
                    "Zigzag persistent homology in matrix multiplication time.",
                    "Reeb graphs: approximation and persistence.",
                    "Shortest non-trivial cycles in directed surface graphs.",
                    "Kinetic convex hulls and delaunay triangulations in the black-box model.",
                    "The geometric stability of voronoi diagrams with respect to small changes of the sites.",
                    "Improved upper bound on the stretch factor of delaunay triangulations.",
                    "Delaunay triangulations of point sets in closed euclidean d-manifolds.",
                    "Redelmeier's algorithm for counting lattice animals.",
                    "Geometric computation with smart pixels.",
                    "Ant-sweep: a decentral strategy for cooperative cleaning in expanding domains.",
                    "Visualization of discrete gradient construction.",
                    "Fitting spheres to electron density.",
                    "Minimum perimeter convex hull of imprecise points in convex regions.",
                    "A pedagogic JavaScript program for point location strategies.",
                    "Answering geographic questions with user generated content: experiences from the coal face.",
                    "Integer representations of convex polygon intersection graphs.",
                    "Sphere and dot product representations of graphs.",
                    "Contact representations of planar graphs with cubes.",
                    "Beating the spread: time-optimal point meshing.",
                    "Edge flips and deforming surface meshes.",
                    "Kinetic mesh refinement in 2D.",
                    "Minors in random and expanding hypergraphs.",
                    "Bounds on the complexity of halfspace intersections when the bounded faces have small dimension.",
                    "On the structure and composition of forbidden sequences, with geometric applications.",
                    "A new upper bound for the VC-dimension of visibility regions.",
                    "Guarding polyominoes.",
                    "Convex hulls of spheres and convex hulls of convex polytopes lying on parallel hyperplanes.",
                    "Approximation algorithms for computing partitions with minimum stabbing number of rectilinear and simple polygons.",
                    "Covering cubes and the closest vector problem.",
                    "The potential to improve the choice: list conflict-free coloring for geometric hypergraphs.",
                    "On the euclidean bottleneck full Steiner tree problem.",
                    "The euclidean bottleneck steiner path problem.",
                    "The frechet distance revisited and extended.",
                    "Tight lower bounds for the size of epsilon-nets.",
                    "No dimension independent core-sets for containment under homothetics.",
                    "Extremal reaches in polynomial time.",
                    "Exact workspace boundary by extremal reaches.",
                    "Vietoris-rips complexes also provide topologically correct reconstructions of sampled shapes.",
                    "Efficient data structure for representing and simplifying simplicial complexes in high dimensions.",
                    "Boundary of a non-uniform point cloud for reconstruction: extended abstract."
                ]
            }
        ]
    },
    {
        "year": "2010",
        "name": "26th SCG 2010",
        "info": "Snowbird, Utah, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/compgeom/2010",
                "sub_name": "Proceedings of the 26th ACM Symposium on Computational Geometry, Snowbird, Utah, USA, June 13-16, 2010.",
                "count": 54,
                "papers": [
                    "Optimal partition trees.",
                    "Consistent digital line segments.",
                    "The geometry of flocking.",
                    "Tight lower bounds for halfspace range searching.",
                    "Discrete geometric structures for architecture.",
                    "Better bounds on the union complexity of locally fat objects.",
                    "On the complexity of sets of free lines and line segments among balls in three dimensions.",
                    "Lines avoiding balls in three dimensions revisited.",
                    "Adding one edge to planar graphs makes crossing number hard.",
                    "Planar visibility: testing and counting.",
                    "The 2-center problem in three dimensions.",
                    "Linkless and flat embeddings in 3-space and the unknot problem.",
                    "Visualizing 3D Euler spirals.",
                    "Shape approximation using k-order alpha-hulls.",
                    "Constructing Reeb graphs using cylinder maps.",
                    "Convexification of polygons by length preserving transformations.",
                    "Geometric methods for multi-agent collision avoidance.",
                    "A geometric approach to collective motion.",
                    "Kinetic stable Delaunay graphs.",
                    "A kinetic triangulation scheme for moving points in the plane.",
                    "Output-sensitive algorithm for the edge-width of an embedded graph.",
                    "Finding shortest non-trivial cycles in directed graphs on surfaces.",
                    "Approximating loops in a shortest homology basis from point data.",
                    "A traveller's problem.",
                    "A constant-factor approximation algorithm for TSP with pairwise-disjoint connected neighborhoods in the plane.",
                    "New constructions of SSPDs and their applications.",
                    "The complexity of the normal surface solution space.",
                    "Distance k-sectors exist.",
                    "Zone diagrams in Euclidean spaces and in other normed spaces.",
                    "Klee's measure problem on fat boxes in time PARTIAL DIFFERENTIAL (n(d+2)/3).",
                    "An improved algorithm for computing the volume of the union of cubes.",
                    "Orthogonal range reporting: query lower bounds, optimal structures in 3-d, and higher-dimensional improvements.",
                    "A dynamic data structure for approximate range searching.",
                    "The tidy set: a minimal simplicial set for computing homology of clique complexes.",
                    "A randomized O(m log m) time algorithm for computing Reeb graphs of arbitrary simplicial complexes.",
                    "Topological inference via meshing.",
                    "Geometric tomography with topological guarantees.",
                    "On degrees in random triangulations of point sets.",
                    "Acute triangulations of polyhedra and the Euclidean space.",
                    "Dynamic well-spaced point sets.",
                    "Manifold reconstruction using tangential Delaunay complexes.",
                    "Optimal reconstruction might be hard.",
                    "Reconstructing shapes with guarantees by unions of convex sets.",
                    "Improving the first selection lemma in R3.",
                    "Points with large quadrant-depth.",
                    "Approximating the Fréchet distance for realistic curves in near linear time.",
                    "Computing similarity between piecewise-linear functions.",
                    "Applications of geometry and topology for quadrilateral meshprocessing and verifiable visualization.",
                    "Computing planar Voronoi diagrams in double precision: a further example of degree-driven algorithm design.",
                    "3D Euler spirals for 3D curve completion.",
                    "I/O-efficient computation of water flow across a terrain.",
                    "Incidences in three dimensions and distinct distances in the plane.",
                    "Tangencies between families of disjoint regions in the plane.",
                    "Steinitz theorems for orthogonal polyhedra."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "25th SCG 2009",
        "info": "Aarhus, Denmark",
        "venues": [
            {
                "sub_name_abbr": "conf/compgeom/2009",
                "sub_name": "Proceedings of the 25th ACM Symposium on Computational Geometry, Aarhus, Denmark, June 8-10, 2009.",
                "count": 54,
                "papers": [
                    "Lower bounds for weak epsilon-nets and stair-convexity.",
                    "Epsilon nets and union complexity.",
                    "PTAS for geometric hitting set problems via local search.",
                    "Near-linear approximation algorithms for geometric hitting sets.",
                    "Coresets for polytope distance.",
                    "Kinetic spanners in Rd.",
                    "Shooting permanent rays among disjoint polygons in the plane.",
                    "Computing hereditary convex structures.",
                    "Binary plane partitions for disjoint line segments.",
                    "Optimal in-place algorithms for 3-D convex hulls and 2-D segment intersection.",
                    "An IP solution to the art gallery problem.",
                    "Quadrilateral meshes with bounded minimum angle.",
                    "Animating a continuous family of two-site Voronoi diagrams (and a proof of a bound on the number of regions).",
                    "The scale axis picture show.",
                    "Rectangular cartograms: the game.",
                    "Geometric tomography: a limited-view approach for computed tomography.",
                    "Straight skeletons of three-dimensional polyhedra.",
                    "Reconstructing sharp features of triangular meshes.",
                    "High resolution surface reconstruction from overlapping multiple-views.",
                    "The scale axis transform.",
                    "Integral estimation from point cloud in d-dimensional space: a geometric view.",
                    "Cut locus and topology from surface point data.",
                    "An improved bound on the number of unit area triangles.",
                    "Halving lines and measure concentration in the plane.",
                    "Candle in the woods: asymptotic bounds on minimum blocking sets.",
                    "Approximate center points with proofs.",
                    "Computational origami: from flapping birds to space telescopes.",
                    "Visibility maps of realistic terrains have linear smoothed complexity.",
                    "Embedding rivers in polyhedral terrains.",
                    "The Euclidean degree-4 minimum spanning tree problem is NP-hard.",
                    "Divide-and-conquer for Voronoi diagrams revisited.",
                    "The geodesic farthest-site Voronoi diagram in a polygonal domain with holes.",
                    "Incremental construction of the delaunay triangulation and the delaunay graph in medium dimension.",
                    "Parallel geometric algorithms for multi-core computers.",
                    "Persistent cohomology and circular coordinates.",
                    "Proximity of persistence modules and their diagrams.",
                    "Zigzag persistent homology and real-valued functions.",
                    "Distributed vision with smart pixels.",
                    "Area-universal rectangular layouts.",
                    "Cache-oblivious range reporting with optimal queries requires superlinear space.",
                    "A general approach for cache-oblivious range reporting and approximate range counting.",
                    "A proof of the molecular conjecture.",
                    "Flattening single-vertex origami: the non-expansive case.",
                    "Arrangements of double pseudolines: extended abstract.",
                    "k-means requires exponentially many iterations even in the plane.",
                    "Approximation algorithms for maximum independent set of pseudo-disks.",
                    "On the set multi-cover problem in geometric settings.",
                    "Adaptive isotopic approximation of nonsingular curves: the parametrizability and nonlocal isotopy approach.",
                    "On the topology of planar algebraic curves.",
                    "Randomly removing g handles at once.",
                    "Minimum cuts and shortest homologous cycles.",
                    "Diameter of polyhedra: limits of abstraction.",
                    "Minimum Manhattan network is NP-complete.",
                    "On grids in topological graphs."
                ]
            }
        ]
    },
    {
        "year": "2008",
        "name": "24th SCG 2008",
        "info": "College Park, MD, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/compgeom/2008",
                "sub_name": "Proceedings of the 24th ACM Symposium on Computational Geometry, College Park, MD, USA, June 9-11, 2008.",
                "count": 51,
                "papers": [
                    "Dynamic coresets.",
                    "Optimizing active ranges for consistent dynamic map labeling.",
                    "Maximum thick paths in static and dynamic environments.",
                    "Circular partitions with applications to visualization and embeddings.",
                    "Delaunay triangulations of polyhedral surfaces, a discrete Laplace-Beltrami operator and applications.",
                    "Tighter bounds for random projections of manifolds.",
                    "Markov convexity and local rigidity of distorted metrics.",
                    "Diameters, centers, and approximating trees of delta-hyperbolicgeodesic spaces and graphs.",
                    "The complexity of the outer face in arrangements of random segments.",
                    "On s-intersecting curves and related problems.",
                    "On levels in arrangements of curves, iii: further improvements.",
                    "A (slightly) faster algorithm for klee's measure problem.",
                    "Walking your dog in the woods in polynomial time.",
                    "Hinged dissections exist.",
                    "Helly-type theorems for approximate covering.",
                    "I/o-efficient efficient algorithms for computing contours on a terrain.",
                    "External memory planar point location with logarithmic updates.",
                    "Self-improving algorithms for delaunay triangulations.",
                    "Markov incremental constructions.",
                    "Exact geometric-topological analysis of algebraic surfaces.",
                    "Predicates for line transversals to lines and line segments in three-dimensional space.",
                    "Robust construction of the three-dimensional flow complex.",
                    "On the complexity of checking self-duality of polytopes and its relations to vertex enumeration and graph isomorphism.",
                    "New existence proofs epsilon-nets.",
                    "Extremal problems on triangle areas in two and three dimensions.",
                    "Arrangements of geodesic arcs on the sphere.",
                    "Delpsc: a delaunay mesher for piecewise smooth complexes.",
                    "On the computation of 3d periodic triangulations.",
                    "Visualizing and exploring planar algebraic arrangements: a web application.",
                    "Analyzing rigidity with pebble games.",
                    "Minkowski sums of rotating convex polyhedra.",
                    "Routing a maximum number of disks through a scene of moving obstacles.",
                    "Towards persistence-based reconstruction in euclidean spaces.",
                    "Reeb spaces of piecewise linear mappings.",
                    "Testing contractibility in planar rips complexes.",
                    "Approximating the pathway axis and the persistence diagram of a collection of balls in 3-space.",
                    "Locally uniform anisotropic meshing.",
                    "Discrete laplace operator on meshed surfaces.",
                    "Untangling triangulations through local explorations.",
                    "Delaunay triangulations of imprecise pointsin linear time after preprocessing.",
                    "Geometry is everywhere, part XLVII: metrics, nets, dimensions, and measures.",
                    "A simple and efficient kinetic spanner.",
                    "Schnyder woods for higher genus triangulated surfaces.",
                    "Embedding and similarity search for point sets under translation.",
                    "Fast enumeration algorithms for non-crossing geometric graphs.",
                    "Polychromatic colorings of plane graphs.",
                    "Coloring kk-free intersection graphs of geometric objects in the plane.",
                    "Consistent digital rays.",
                    "Combinatorial genericity and minimal rigidity.",
                    "Improved upper bounds on the crossing number.",
                    "Intersecting convex sets by rays."
                ]
            }
        ]
    },
    {
        "year": "2007",
        "name": "23rd SCG 2007",
        "info": "Gyeongju, South Korea",
        "venues": [
            {
                "sub_name_abbr": "conf/compgeom/2007",
                "sub_name": "Proceedings of the 23rd ACM Symposium on Computational Geometry, Gyeongju, South Korea, June 6-8, 2007.",
                "count": 52,
                "papers": [
                    "A space-optimal data-stream algorithm for coresets in the plane.",
                    "A PTAS for k-means clustering based on weak coresets.",
                    "Bi-criteria linear-time approximations for generalized k-mean/median/center.",
                    "Guard placement for efficient point-in-polygon proofs.",
                    "Aperture-angle and Hausdorff-approximation of convex figures.",
                    "Traversing a set of points with a minimum number of turns.",
                    "Thick non-crossing paths and minimum-cost flows in polygonal domains.",
                    "Finding curvature-constrained paths that avoid polygonal obstacles.",
                    "Shortest paths on realistic polyhedra.",
                    "Querying approximate shortest paths in anisotropic regions.",
                    "Happy endings for flip graphs.",
                    "Offline variants of the \"lion and man\" problem.",
                    "Embedding 3-polytopes on a small grid.",
                    "Computing the exact arrangement of circles on a sphere, with applications in structural biology: video.",
                    "Visualizing bregman voronoi diagrams.",
                    "Medial axis approximation from inner Voronoi balls: a demo of the Mesecina tool.",
                    "Inflating the cube by shrinking.",
                    "Heilbronn's triangle problem.",
                    "Kinetic 3D convex hulls via self-adjusting computation.",
                    "Towards an implementation of the 3D visibility skeleton.",
                    "Decomposition of multiple coverings into many parts.",
                    "An optimal generalization of the centerpoint theorem, and its extensions.",
                    "There are not too many magic configurations.",
                    "Quadratic and cubic b-splines by generalizing higher-order voronoi diagrams.",
                    "Snap rounding of Bézier curves.",
                    "Optimal simplification of polygonal chain for rendering.",
                    "Streaming algorithms for line simplification.",
                    "The theory of multidimensional persistence.",
                    "Manifold reconstruction in arbitrary dimensions using witness complexes.",
                    "Probabilistic embeddings of bounded genus graphs into planar graphs.",
                    "Distributed computation of virtual coordinates.",
                    "On regular vertices on the union of planar objects.",
                    "On the number of k-rich transformations.",
                    "Similar simplices in a d-dimensional point set.",
                    "Weak epsilon-nets have basis of size o(1/epsilon log (1/epsilon)) in any dimension.",
                    "Line transversals to disjoint balls.",
                    "The voronoi diagram of three lines.",
                    "Between umbra and penumbra.",
                    "New upper bounds on the quality of the PCA bounding boxes in r2 and r3.",
                    "Pareto envelopes in R3 under l1 and linfinity distance functions.",
                    "Computing the volume of the union of cubes.",
                    "Approximating the centroid is hard.",
                    "On the hardness of minkowski addition and related operations.",
                    "A geometric framework for solving subsequence problems in computational biology efficiently.",
                    "On the exact maximum complexity of Minkowski sums of convex polyhedra.",
                    "On approximate halfspace range counting and relative epsilon-approximations.",
                    "On approximate range counting and depth.",
                    "A data structure for multi-dimensional range reporting.",
                    "Tight bounds for dynamic convex hull queries (again).",
                    "Kinetic KD-trees and longest-side KD-trees.",
                    "Fully dynamic geometric spanners.",
                    "Embeddings of surfaces, curves, and moving points in euclidean space."
                ]
            }
        ]
    },
    {
        "year": "2006",
        "name": "22nd SCG 2006",
        "info": "Sedona, Arizona, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/compgeom/2006",
                "sub_name": "Proceedings of the 22nd ACM Symposium on Computational Geometry, Sedona, Arizona, USA, June 5-7, 2006.",
                "count": 61,
                "papers": [
                    "Minimum weight triangulation is NP-hard.",
                    "The effect of corners on the complexity of approximate range searching.",
                    "Efficient algorithm for approximating maximum inscribed sphere in high dimensional polytope.",
                    "An optimal-time algorithm for shortest paths on a convex polytope in three dimensions.",
                    "Discrete differential forms and applications to surface tiling.",
                    "Conflict-free colorings of shallow discs.",
                    "How to play a coloring game against a color-blind adversary.",
                    "Colored intersection searching via sparse rectangular matrix multiplication.",
                    "Locked and unlocked chains of planar shapes.",
                    "Refolding planar polygons.",
                    "Computing the Fréchet distance between simple polygons in polynomial time.",
                    "Ray shooting and intersection searching amidst fat convex polyhedra in 3-space.",
                    "On the ICP algorithm.",
                    "An upper bound on the average size of silhouettes.",
                    "Topology guaranteeing manifold reconstruction using distance function to noisy data.",
                    "Vines and vineyards by updating persistence in linear time.",
                    "Persistence-sensitive simplification functions on 2-manifolds.",
                    "A fast k-means implementation using coresets.",
                    "How slow is the k-means method?",
                    "Lower bounds on locality sensitive hashing.",
                    "Simple and semi-dynamic structures for cache-oblivious planar orthogonal range searching.",
                    "I/O-efficient batched union-find and its applications to terrain analysis.",
                    "On realistic terrains.",
                    "Embedding ultrametrics into low-dimensional spaces.",
                    "Plane embeddings of planar graph metrics.",
                    "Volume distortion for subsets of Euclidean spaces: extended abstract.",
                    "Complete subdivision algorithms, I: intersection of Bezier curves.",
                    "The predicates for the Voronoi diagram of ellipses.",
                    "An approximate arrangement algorithm for semi-algebraic curves.",
                    "The orienteering problem in the plane revisited.",
                    "Degenerate crossing numbers.",
                    "On the maximum number of edges in topological graphs with no four pairwise crossing edges.",
                    "The density of iterated crossing points and a gap result for triangulations of finite point sets.",
                    "Random triangulations of planar point sets.",
                    "Pre-triangulations and liftable complexes.",
                    "Engineering a compact parallel delaunay algorithm in 3D.",
                    "Minimum-cost load-balancing partitions.",
                    "Optimal succinct representations of planar maps.",
                    "A sampling theory for compact sets in Euclidean space.",
                    "Medial axis approximation and unstable flow complex.",
                    "Provably good sampling and meshing of Lipschitz surfaces.",
                    "Sliver removal by lattice refinement.",
                    "Improved output-sensitive snap rounding.",
                    "Iterated snap rounding with bounded drift.",
                    "Hole detection or: \"how much geometry hides in connectivity?\".",
                    "Online geometric reconstruction.",
                    "On overlays and minimization diagrams.",
                    "How to get close to the median shape.",
                    "Envelope surfaces.",
                    "Splitting (complicated) surfaces is hard.",
                    "Computing shortest non-trivial cycles on orientable surfaces of bounded genus in almost linear time.",
                    "Tight bounds for connecting sites across barriers.",
                    "Minimum-cost coverage of point sets by disks.",
                    "Algorithms for two-box covering.",
                    "Exact computation of protein structure similarity.",
                    "Geometry-based reasoning for a large sensor network.",
                    "Projective clustering and its application to surface reconstruction: extended abstract.",
                    "A portable geometric algorithm visualization system with dynamic camera positioning for tracking 3D objects.",
                    "Illustrating the streaming construction of 2D delaunay triangulations.",
                    "Approximating minimum-cost polygonal paths of bounded number of links in weighted subdivisions.",
                    "On approximating the smallest enclosing Bregman Balls."
                ]
            }
        ]
    },
    {
        "year": "2005",
        "name": "21st SCG 2005",
        "info": "Pisa, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/compgeom/2005",
                "sub_name": "Proceedings of the 21st ACM Symposium on Computational Geometry, Pisa, Italy, June 6-8, 2005.",
                "count": 54,
                "papers": [
                    "Forbidden patterns and unit distances.",
                    "Hadwiger and Helly-type theorems for disjoint unit spheres in R3.",
                    "Incidences of not-too-degenerate hyperplanes.",
                    "Almost tight bound for a single cell in an arrangement of convex polyhedra in R3.",
                    "Clustered planarity.",
                    "Mountain reduction, block matching, and applications in intensity-modulated radiation therapy.",
                    "Dynamic maintenance of molecular surfaces under conformational changes.",
                    "The lifting model for reconfiguration.",
                    "The Visibility-Voronoi Complex and Its Applications.",
                    "Certifying and constructing minimally rigid graphs in the plane.",
                    "Pointed and colored binary encompassing trees.",
                    "Abstract order type extension and new results on the rectilinear crossing number.",
                    "An exact, complete and efficient implementation for computing planar maps of quadric intersection curves.",
                    "On the exact computation of the topology of real algebraic curves.",
                    "Shortest path amidst disc obstacles is computable.",
                    "Smaller coresets for k-median and k-means clustering.",
                    "Improved approximation algorithms for geometric set cover.",
                    "Sampling in dynamic data streams and applications.",
                    "Fast construction of nets in low dimensional metrics, and their applications.",
                    "Double-permutation sequences and pseudoline transversals.",
                    "Cache-oblivious planar orthogonal range searching and counting.",
                    "Cache-oblivious r-trees.",
                    "Multi-pass geometric algorithms.",
                    "Kinetic sorting and kinetic convex hulls.",
                    "Learning smooth objects by probing.",
                    "Provable dimension detection using principal component analysis.",
                    "Critical points of the distance to an epsilon-sampling of a surface and flow-complex-based surface reconstruction.",
                    "A time-optimal delaunay refinement algorithm in two dimensions.",
                    "Star splaying: an algorithm for repairing delaunay triangulations and convex hulls.",
                    "Inclusion-exclusion formulas from independent complexes.",
                    "Weak feature size and persistent homology: computing homology of solids in Rn from noisy data samples.",
                    "Stability of persistence diagrams.",
                    "Inequalities for the curvature of curves and surfaces.",
                    "Curvature-bounded traversals of narrow corridors.",
                    "Vertical ray shooting for fat objects.",
                    "The skip quadtree: a simple dynamic data structure for multidimensional data.",
                    "Space efficient dynamic orthogonal range reporting.",
                    "Efficient computation of query point visibility in polygons with holes.",
                    "Minimum dilation stars.",
                    "Finding the best shortcut in a geometric network.",
                    "Energy-aware stage illumination.",
                    "Guarding a terrain by two watchtowers.",
                    "Maximizing the overlap of two planar convex sets under rigid motions.",
                    "Learning smooth objects by probing.",
                    "Reconstructing collections of arbitrary curves.",
                    "Efficient geometric techniques for reconstructing 3D vessel trees from biplane image.",
                    "Implementing time-varying contour trees.",
                    "Rectangular cartograms: construction & animation.",
                    "Animation of curve constrained drawings of planar graphs.",
                    "Covering points with a polygon.",
                    "1-link shortest paths in weighted regions.",
                    "An extension of CGAL to the oriented projective plane T2 and its dynamic visualization system.",
                    "Exact Minkowski sums of convex polyhedra.",
                    "Fast and reliable collision detection using graphics processors."
                ]
            }
        ]
    },
    {
        "year": "2004",
        "name": "20th SCG 2004",
        "info": "Brooklyn, New York, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/compgeom/2004",
                "sub_name": "Proceedings of the 20th ACM Symposium on Computational Geometry, Brooklyn, New York, USA, June 8-11, 2004.",
                "count": 57,
                "papers": [
                    "Geodesic ham-sandwich cuts.",
                    "Separating point sets in polygonal environments.",
                    "Approximate convex decomposition of polygons.",
                    "Computing the visibility graph of points within a polygon.",
                    "On lines avoiding unit balls in three dimensions.",
                    "The number of lines tangent to arbitrary convex polyhedra in 3D.",
                    "Random monotone paths on polyhedra.",
                    "On distinct distances from a vertex of a convex polygon.",
                    "Algorithms for center and Tverberg points.",
                    "Improving the crossing lemma by finding more crossings in sparse graphs: [extended abstract].",
                    "Solution of Scott's problem on the number of directions determined by a point set in 3-space.",
                    "Continuous path verification in multi-axis NC-machining.",
                    "Finding planar regions in a terrain: in practice and with a guarantree.",
                    "A scalable simulator for forest dynamics.",
                    "Pushing squares around.",
                    "New results on shortest paths in three dimensions.",
                    "An energy-driven approach to linkage unfolding.",
                    "Deterministic sampling and range counting in geometric data streams.",
                    "Faster core-set constructions and data stream algorithms in fixed dimensions.",
                    "Range counting over multidimensional data streams.",
                    "An empirical comparison of techniques for updating Delaunay triangulations.",
                    "A 2D kinetic triangulation with near-quadratic topological changes.",
                    "Deformable spanners and applications.",
                    "A computational framework for incremental motion.",
                    "Counting and representing intersections among triangles in three dimensions.",
                    "Optimal adaptive algorithms for finding the nearest and farthest point on a parametric black-box curve.",
                    "Binary space partitions of orthogonal subdivisions.",
                    "Towards in-place geometric algorithms and data structures.",
                    "A near-linear constant-factor approximation for euclidean bipartite matching?",
                    "Locality-sensitive hashing scheme based on p-stable distributions.",
                    "Practical methods for shape fitting and kinetic data structures using core sets.",
                    "On the least median square problem.",
                    "Sampling and meshing a surface with guaranteed topology and geometry.",
                    "Quality meshing for polyhedra with small angles.",
                    "Spacetime meshing with adaptive refinement and coarsening.",
                    "A Bézier-based approach to unstructured moving meshes.",
                    "Low-dimensional embedding with extra information.",
                    "Provable surface reconstruction from noisy samples.",
                    "The geometric thickness of low degree graphs.",
                    "Computing persistent homology.",
                    "Extreme elevation on a 2-manifold.",
                    "Time-varying reeb graphs for continuous space-time data.",
                    "Searching for 2D RNA geometries in bacterial genomes.",
                    "On locally Delaunay geometric graphs.",
                    "On the union of kapa-round objects.",
                    "On empty convex polygons in a planar point set.",
                    "The criss-cross method can take Omega(nd) pivots.",
                    "Complete, exact, and efficient computations with cubic curves.",
                    "Intersecting quadrics: an efficient and exact implementation.",
                    "Inner and outer rounding of set operations on lattice polygonal regions.",
                    "Towards and open curved kernel.",
                    "Adaptive mesh generation for real-time terrain modeling.",
                    "Searching with an autonomous robot.",
                    "Morphing planar graphs.",
                    "The corner arc algorithm.",
                    "Single-strip triangulation of manifolds with arbitrary topology.",
                    "Approximate convex decomposition."
                ]
            }
        ]
    },
    {
        "year": "2003",
        "name": "19th SCG 2003",
        "info": "San Diego, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/compgeom/2003",
                "sub_name": "Proceedings of the 19th ACM Symposium on Computational Geometry, San Diego, CA, USA, June 8-10, 2003.",
                "count": 51,
                "papers": [
                    "Fault-tolerant geometric spanners.",
                    "Euclidean bounded-degree spanning tree ratios.",
                    "Approximation algorithms for aligning points.",
                    "Shape fitting with outliers.",
                    "High-dimensional shape fitting in linear time.",
                    "Smooth kinetic maintenance of clusters.",
                    "Polygon decomposition based on the straight line skeleton.",
                    "Efficient algorithms for shared camera control.",
                    "Good NEWS: partitioning a simple polygon by compass directions.",
                    "Geometric algorithms for static leaf sequencing problems in radiation therapy.",
                    "Topological graphs with no self-intersecting cycle of lenth 4.",
                    "Distinct distances in homogeneous sets.",
                    "A tight bound for the number of different directions in three dimensions.",
                    "On conflict-free coloring of points and simple regions in the plane.",
                    "Long monotone paths in line arrangements.",
                    "New constructions of weak epsilon-nets.",
                    "Curve-sensitive cuttings.",
                    "Spatial embedding of pseudo-triangulations.",
                    "Planar minimally rigid graphs and pseudo-triangulations.",
                    "The complexity of (un)folding.",
                    "Local polyhedra and geometric graphs.",
                    "Updating and constructing constrained delaunay and constrained regular triangulations by flips.",
                    "Anisotropic voronoi diagrams and guaranteed-quality anisotropic mesh generation.",
                    "Complexity of the delaunay triangulation of points on surfaces the smooth case.",
                    "Incremental constructions con BRIO.",
                    "Proximate planar point location.",
                    "Cost-driven octree construction schemes: an experimental study.",
                    "Cache-oblivious data structures for orthogonal range searching.",
                    "Near-optimal parameterization of the intersection of quadrics.",
                    "Constructive root bound for k-ary rational input numbers.",
                    "Controlled perturbation for arrangements of circles.",
                    "Optimized color gamuts for tiled displays.",
                    "Hausdorff distance under translation for points and balls.",
                    "The smallest enclosing ball of balls: combinatorial structure and algorithms.",
                    "Curve reconstruction from noisy samples.",
                    "Restricted delaunay triangulations and normal cycle.",
                    "Estimating surface normals in noisy point cloud data.",
                    "Shape dimension and intrinsic metric from samples of manifolds with high co-dimension.",
                    "An optimal algorithm for the minimum edge cardinality cut surface problem.",
                    "Loops in reeb graphs of 2-manifolds.",
                    "Molecular shape analysis based upon the morse-smale complex and the connolly function.",
                    "Morse-smale complexes for piecewise linear 3-manifolds.",
                    "the asteroid surveying problem and other puzzles.",
                    "VASCO: visualizing and animating spatial constructs and operations.",
                    "Billboard clouds.",
                    "A 3-D visualization of kirkpatrick's planar point location algorithm.",
                    "Morphing between shapes by using their straight skeletons.",
                    "3DTreeDraw: a thjree dimensional tree drawing system.",
                    "Online dispersion algorithms for swarms of robots.",
                    "Finding a curve in a map.",
                    "Fast penetration depth estimation using rasterization hardware and hierarchical refinement."
                ]
            }
        ]
    },
    {
        "year": "2002",
        "name": "18th SCG 2002",
        "info": "Barcelona, Spain",
        "venues": [
            {
                "sub_name_abbr": "conf/compgeom/2002",
                "sub_name": "Proceedings of the 18th Annual Symposium on Computational Geometry, Barcelona, Spain, June 5-7, 2002.",
                "count": 43,
                "papers": [
                    "Parametric search made practical.",
                    "A local search approximation algorithm for k-means clustering.",
                    "On the crossing number of complete graphs.",
                    "On the number of embeddings of minimally rigid graphs.",
                    "Collision detection for deforming necklaces.",
                    "Efficient maintenance and self-collision testing for Kinematic Chains.",
                    "Box-trees for collision checking in industrial installations.",
                    "Finite metric spaces: combinatorics, geometry and algorithms.",
                    "Finding the consensus shape for a protein family.",
                    "Paper position sensing.",
                    "A global approach to automatic solution of jigsaw puzzles.",
                    "The power of nonmonotonicity in geometric searching.",
                    "A lower bound on the distortion of embedding planar metrics into Euclidean space.",
                    "The one-round Voronoi game.",
                    "Approximate nearest neighbor algorithms for Frechet distance via product metrics.",
                    "Point-line incidences in space.",
                    "Incidences between points and circles in three and higher dimensions.",
                    "Lenses in arrangements of pseudo-circles and their applications.",
                    "Pseudotriangulations, polytopes, and how to expand linkages.",
                    "Guaranteed: quality parallel delaunay refinement for restricted polyhedral domains.",
                    "The Delaunay tetrahedralization from Delaunay triangulated surfaces Sunghee Choi.",
                    "Quickest paths, straight skeletons, and the city Voronoi diagram.",
                    "Testing Homotopy for paths in the plane.",
                    "Pseudo approximation algorithms, with applications to optimal motion planning.",
                    "Kinetic maintenance of context-sensitive hierarchical representations for disjoint simple polygons.",
                    "Interlocked open linkages with few joints.",
                    "Conforming Delaunay triangulations in 3D.",
                    "The probabilistic complexity of the Voronoi diagram of points on a polyhedron.",
                    "Three dimensional euclidean Voronoi diagrams of lines with a fixed number of orientations.",
                    "Polyhedral Voronoi diagrams of polyhedra in three dimensions.",
                    "Vertex-unfoldings of simplicial manifolds.",
                    "Optimally cutting a surface into a disk.",
                    "Optimal decomposition of polygonal models into triangle strips.",
                    "Hybrid meshes: multiresolution using regular and irregular refinement.",
                    "Exact minkowski sums and applications.",
                    "Homotopy techniques for real-time visualization of geometric tangent problems.",
                    "Growing fat graphs.",
                    "AUTO-FOLLOW: getting a piece of the action all the time.",
                    "Adventures of Möbius band: mathematical visualization in virtual environment.",
                    "Improved construction of vertical decompositions of three-dimensional arrangements.",
                    "Cost prediction for ray shooting.",
                    "Visibility preserving terrain simplification: an experimental study.",
                    "Projective clustering in high dimensions using core-sets."
                ]
            }
        ]
    },
    {
        "year": "2001",
        "name": "17th SCG 2001",
        "info": "Medford, MA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/compgeom/2001",
                "sub_name": "Proceedings of the Seventeenth Annual Symposium on Computational Geometry, Medford, MA, USA, June 3-5, 2001.",
                "count": 47,
                "papers": [
                    "On the number of congruent simplices in a point.",
                    "Enumerating order types for small sets with applications.",
                    "The union of congruent cubes in three dimensions.",
                    "On the distinct distances determined by a planar point set.",
                    "Schematization of road networks.",
                    "Simplifying a polygonal subdivision while keeping it simple.",
                    "Hardware-assisted view-dependent map simplification.",
                    "Efficient perspective-accurate silhouette computation and applications.",
                    "Sphere packings and generative.",
                    "Hierarchical morse complexes for piecewise linear 2-manifolds.",
                    "Computing a canonical polygonal schema of an orientable triangulated surface.",
                    "Area-preserving piecewise affine mappings.",
                    "Nice point sets can have nasty Delaunay triangulations.",
                    "Walking in a triangulation.",
                    "Sink-insertion for mesh improvement.",
                    "Box-trees and R-trees with near-optimal query time.",
                    "A segment-tree based kinetic BSP.",
                    "Binary space partitions for axis-parallel segments, rectangles, and hyperrectangles.",
                    "A note on binary plane partitions.",
                    "Exact Linfty Nearest Neighbor Search in High Dimensions.",
                    "Farthest neighbors and center points in the presence of rectangular obstacles.",
                    "A fully dynamic algorithm for planar.",
                    "A practical approach for computing the diameter of a point set.",
                    "Protein geometry as a function of time.",
                    "Discrete mobile centers.",
                    "Segment intersection searching problems in general settings.",
                    "On the complexity of halfspace area queries.",
                    "Algorithms for congruent sphere packing and applications.",
                    "Polymake: an approach to modular software design in computational geometry.",
                    "A randomized art-gallery algorithm for sensor placement.",
                    "Notes on computing peaks in k-levels and parametric spanning trees.",
                    "A tight bound on the number of geometric permutations of convex fat objects in Rd.",
                    "The Clarkson-Shor technique revisited and extended.",
                    "Detecting undersampling in surface reconstruction.",
                    "Computing a 3-dimensional cell in an arrangement of quadrics: exactly and actually!",
                    "PRECISE: efficient multiprecision evaluation of algebraic roots and predicates for reliable geometric computation.",
                    "Computational geometry for sculpture.",
                    "Different bounds on the different Betti numbers of semi-algebraic sets.",
                    "Efficient and small representation of line arrangements with applications.",
                    "A sum of squares theorem for visibility.",
                    "Monotone paths in line arrangement.",
                    "Balanced lines, halving triangles, and the generalized lower bound theorem.",
                    "Small representation of line arrangements.",
                    "The convex hull of ellipsoids.",
                    "2-point site Voronoi diagrams.",
                    "The connectivity shapes video.",
                    "A prototype system for visualizing time-dependent volume data."
                ]
            }
        ]
    },
    {
        "year": "2000",
        "name": "16th SCG 2000",
        "info": "Clear Water Bay, Hong Kong, China",
        "venues": [
            {
                "sub_name_abbr": "conf/compgeom/2000",
                "sub_name": "Proceedings of the Sixteenth Annual Symposium on Computational Geometry, Clear Water Bay, Hong Kong, China, June 12-14, 2000.",
                "count": 45,
                "papers": [
                    "Mesh generation for domains with small angles.",
                    "Triangulations in CGAL (extended abstract).",
                    "Improving the surface cycle structure for hexahedral mesh generation.",
                    "Computing integer points in Minkowski sums.",
                    "Point sets with many k-sets.",
                    "An improved bound for k-sets in three dimensions.",
                    "Origin-embracing distributions or a continuous analogue of the upper bound theorem.",
                    "A Helly-type theorem for hyperplane transversals to well-separated convex sets.",
                    "A trace bound for the hereditary discrepancy.",
                    "On the continuous Weber and k-median problems (extended abstract).",
                    "The 2-center problem with obstacles.",
                    "Random sampling in geometric optimization: new insights and applications.",
                    "The analysis of a simple k-means clustering algorithm.",
                    "An efficient, exact, and generic quadratic programming solver for geometric optimization.",
                    "Accurate and efficient unions of balls.",
                    "Fast software for box intersections.",
                    "Algebraic methods and arithmetic filtering for exact predicates on circle arcs.",
                    "Pitfalls in computing with pseudorandom determinants.",
                    "Look - a Lazy Object-Oriented Kernel for geometric computation.",
                    "When crossings count - approximating the minimum spanning tree.",
                    "Linear programming queries revisited.",
                    "Point set labeling with specified positions.",
                    "I/O-efficient dynamic planar point location (extended abstract).",
                    "Linear-time triangulation of a simple polygon made easier via randomization.",
                    "A simple algorithm for homeomorphic surface reconstruction.",
                    "Smooth surface reconstruction via natural neighbour interpolation of distance functions.",
                    "Reconstruction curves with sharp corners.",
                    "Voronoi-based interpolation with higher continuity.",
                    "Reachability by paths of bounded curvature in convex polygons.",
                    "An algorithm for searching a polygonal region with a flashlight.",
                    "Computing approximate shortest paths on convex polytopes.",
                    "Densest tanslational lattice packing of non-convex polygons (extended abstract).",
                    "Deterministic algorithms for 3-D diameter and some 2-D lower envelopes.",
                    "Approximating the diameter, width, smallest enclosing cylinder, and minimum-width annulus.",
                    "Testing the congruence of d-dimensional point sets.",
                    "Multivariate regression depth.",
                    "Kinetic collision detection for simple polygons.",
                    "Kinetic connectivity for unit disks.",
                    "Delaunay triangulations and Voronoi diagrams for Riemannian manifolds.",
                    "Sweep algorithms for constructing higher-dimensional constrained Delaunay triangulations.",
                    "Cutting glass.",
                    "Viro's method disproves Ragsdale's conjecture: a story.",
                    "Optimal robot localization in trees.",
                    "Fast computation of generalized Voronoi diagrams using graphics hardware.",
                    "The face fixer video."
                ]
            }
        ]
    },
    {
        "year": "1999",
        "name": "15th SCG 1999",
        "info": "Miami Beach, Florida, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/compgeom/1999",
                "sub_name": "Proceedings of the Fifteenth Annual Symposium on Computational Geometry, Miami Beach, Florida, USA, June 13-16, 1999.",
                "count": 55,
                "papers": [
                    "Sliver Exudation.",
                    "The Path of a Triangulation.",
                    "Edgewise Subdivision of a Simplex.",
                    "Efficient Algorithms for Maximum Regression Depth.",
                    "Spanning Trees Crossing Few Barriers.",
                    "Generalizing Ham Sandwich Cuts to Equitable Subdivisions.",
                    "Topological Beam Tracing.",
                    "A Geometric Approach to Computing Higher Order Form Factors.",
                    "Geometric Pattern Matching: A Performance Study.",
                    "Empirical Design of Geometric Algorithms.",
                    "Geometric Algorithms for Trap Design.",
                    "Folding Flat Silhouettes and Wrapping Polyhedral Packages: New Results in Computational Origami.",
                    "The Table Layout Problem.",
                    "New Bounds on Crossing Numbers.",
                    "The Complexity of the Union of (alpha, beta)-Covered Objects.",
                    "Pipes, Cigars, and Kreplach: The Union of Minkowski Sums in Three Dimensions.",
                    "Polytopes in Arrangements.",
                    "Controlled Perturbation for Arrangements of Polyhedral Surfaces with Application to Swept Volumes.",
                    "Motion Planning for a Rigid Body Using Random Networks on the Medial Axis of the Free Space.",
                    "On Deletion in Delaunay Triangulations.",
                    "Crust and Anti-Crust: A One-Step Boundary and Skeleton Extraction Algorithm.",
                    "Curve Reconstruction: Connecting Dots with Good Reason.",
                    "Curve Reconstruction, the Traveling Salesman Problem and Menger's Theorem on Length.",
                    "On Minimum Stars, Minimum Steiner Stars, and Maximum Matchings.",
                    "Hierarchical Vertical Decompositions, Ray Shooting, and Circular Arc Queries in Simple Polygons.",
                    "Kinetic Connectivity of Rectangles.",
                    "Lower Bounds for Kinetic Planar Subdivisions.",
                    "Interval Methods for Kinetic Simulations.",
                    "H-Walk: Hierarchical Distance Computation for Moving Convex Bodies.",
                    "Stretchability of Star-Like Pseudo-Visibility Graphs.",
                    "Visibility-Based Pursuit-Evasion in a Polygonal Room with a Door.",
                    "On Bisectors for Different Distance Functions.",
                    "Small Distortion and Volume Preserving Embeddings for Planar and Euclidean Metrics.",
                    "Computing Roundness is Easy if the Set is Almost Round.",
                    "Smooth Paths in a Polygonal Channel.",
                    "Determining an Optimal Penetration Among Weighted Regions in Two and Three Dimensions.",
                    "Error Bounded Regular Algebraic Spline Curves.",
                    "Efficient Exact Geometric Computation Made Easy.",
                    "A Core Library for Robust Numeric and Geometric Computation.",
                    "MAPC: A Library for Efficient and Exact Manipulation of Algebraic Points and Curves.",
                    "Efficient Algorithms for Line and Curve Segment Intersection Using Restricted Predicates.",
                    "Approximation and Exact Algorithms for Minimum-Width Annuli and Shells.",
                    "On Range Reporting, Ray Shooting and k-Level Construction.",
                    "Sharp Bounds on Geometric Permutations of Pairwise Disjoint Balls inRd.",
                    "Metamorphosis of the Cube.",
                    "The Video \"Geodesics and Waves\".",
                    "Polyhedron Realization and Its Application to Metamorphosis.",
                    "Feature-Based Surface Decomposition for Polyhedral Morphing.",
                    "Efficient Perspective-Accurate Silhouette Computation.",
                    "Mesh Collapse Compression.",
                    "Programming with CGAL: The Example of Triangulations.",
                    "The Crust Algorithm for 3D Surface Reconstruction.",
                    "Uncluttering Force-Directed Graph Layouts.",
                    "Kinetic Data Structures: Animating Proofs Through Time.",
                    "Graph Partitioning and Ordering for Interactive Proximity Queries."
                ]
            }
        ]
    },
    {
        "year": "1998",
        "name": "14th SCG 1998",
        "info": "Minneapolis, Minnesota, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/compgeom/1998",
                "sub_name": "Proceedings of the Fourteenth Annual Symposium on Computational Geometry, Minneapolis, Minnesota, USA, June 7-10, 1998.",
                "count": 51,
                "papers": [
                    "Rotational Polygon Containment and Minimum Enclosure.",
                    "A General Framework for Assembly Planning: The Motion Space Approach.",
                    "Multi-Criteria Geometric Optimization Problems in Layered Manufacturing.",
                    "Design and Analysis of Planar Shape Deformation.",
                    "Surface Reconstruction by Voronoi Filtering.",
                    "Cross-Ratios and Angles Determine a Polygon.",
                    "Raising Roofs, Crashing Cycles, and Playing Pool: Applications of a Data Structure for Finding Pairwise Interactions.",
                    "Construction of Contour Trees in 3D in O(n log n) Steps.",
                    "A Condition Guaranteeing the Existence of Higher-Dimensional Constrained Delaunay Triangulations.",
                    "Tetrahedral Mesh Generation by Delaunay Refinement.",
                    "Implementations of the LMT Heuristic for Minimum Weight Triangulation.",
                    "Improved Incremental Randomized Delaunay Triangulation.",
                    "Vertex-Rounding a Three-Dimensional Polyhedral Subdivision.",
                    "Exact Algorithms for Circles on the Sphere.",
                    "Cutting Cylces of Rods in Space.",
                    "Fly Cheaply: On the Minimum Fuel-Consumption Problem.",
                    "Designing a Data Structure for polyhedral Surfaces.",
                    "Improved Algorithms for Robust Point Pattern Matching and Applications to Image Registration.",
                    "Interval Arithmetic Yields Efficient Dynamic Filters for Computational Geometry.",
                    "Exact Geometric Predicates Using Cascaded Computation.",
                    "Geometric Graphs with Few Disjoint Edges.",
                    "Results on k-Sets and j-Facets via Continuous Motion.",
                    "Point-Sets with few k-Sets.",
                    "On the Union of k-Curved Objects.",
                    "Features of Deformation Grids: An Approach via Singularity Theory.",
                    "Effective Nearest Neighbors Searching on the Hyper-Cube, with Applications to Molecular Clustering.",
                    "Matching 2D Patterns of Protein Spots.",
                    "Multiresolution Banded Refinement to Accelerate Surface Reconstruction from Polygons.",
                    "Degenerate Convex Hulls On-Line in Any Fixed Dimension.",
                    "Randomized External-Memory Algorithms for Some Geometric Problems.",
                    "Geometric Applications of a Randomized Optimization Technique.",
                    "On Enumerating and Selecting Distances.",
                    "Drawing Planar Partitions I: LL-Drawings and LH-Drawings.",
                    "Approximation Algorithms for Multiple-Tool Miling.",
                    "Resource-Constrained Geometric Network Optimization.",
                    "Efficiently Approximating Polygonal Paths in Three and Higher Dimensions.",
                    "Constructing Cuttings in Theory and Practice.",
                    "Point Set Labeling with Sliding Labels.",
                    "A Unified Approach to Labeling Graphical Features.",
                    "An Output Sensitive Algorithm for Discrete Convex Hulls.",
                    "Asymmetric Rendezvous on the Plane.",
                    "Motion Planning for Multiple Robots.",
                    "Constructing Approximate Shortest Path Maps in Three Dimensions.",
                    "Curvature-Constrained Shortest Paths in a Convex Polygon (Extended Abstract).",
                    "Voronoi Diagrams by Divergences with Additive Weights.",
                    "GASP-II - A Geometric Algorithm Animation System for an Electronic Classroom.",
                    "Visualization of Color Image Quantization Using Pairwise Clustering.",
                    "Optimal Floodlight Illumination of Stages.",
                    "GAWAIN: Visualizing Geometric Algorithms with Web-Based Animation.",
                    "Viewspace Partitioning of Densely Occluded Scenes.",
                    "A Path Router for Graph Drawing."
                ]
            }
        ]
    },
    {
        "year": "1997",
        "name": "13th SCG 1997",
        "info": "Nice, France",
        "venues": [
            {
                "sub_name_abbr": "conf/compgeom/1997",
                "sub_name": "Proceedings of the Thirteenth Annual Symposium on Computational Geometry, Nice, France, June 4-6, 1997.",
                "count": 82,
                "papers": [
                    "Accelerated Occlusion Culling using Shadow Frusta.",
                    "Bucket-Like Space Partitioning Data Structures with Applications to Ray-Tracing.",
                    "On Fence Design and the Complexity of Push Plans for Orienting Parts.",
                    "On Levels in Arrangements of Lines, Segments, Planes, and Triangles.",
                    "Cylindrical Static and Kinetic Binary Space Partitions.",
                    "Primal-Dual Methods for Vertex and Facet Enumeration (Preliminary Version).",
                    "Construction of 1-d Lower Envelopes and Applications.",
                    "Minkowski Operations for Satellite Antenna Layout.",
                    "Necessary Conditions for Boundary Representation Variance.",
                    "Choosing Corners of Rectangles for Mapped Meshing.",
                    "Ramsey-Type Results for Geometric Graphs II.",
                    "On the Complexity of the Union of Fat Objects in the Plane.",
                    "Some PL Functions on Surfaces are not Height Functions.",
                    "Vertex-Edge Pseudo-Visibility Graphs: Characterization and Recognition.",
                    "A Complete Roundness Classification Procedure.",
                    "Fitting a Set of Points by a Circle.",
                    "The Discrete 2-Center Problem.",
                    "Robust Proximity Queries: An Illustration of Degree-Driven Algorithm Design.",
                    "Efficient Exact Evaluation of Signs of Determinants.",
                    "Computing Exact Geometric Predicates Using Modular Arithmetic with Single Precision.",
                    "A Perturbation Scheme for Spherical Arrangements with Application to Molecular Modeling.",
                    "Minimum Strictly Convex Quadrangulations of Convex Polygons.",
                    "Average-Case Ray Shooting and Minimum Weight Triangulations.",
                    "Contour Trees and Small Seed Sets for Isosurface Traversal.",
                    "Separating an Object from its Cast.",
                    "A Data Front-End for Layered Manufacturing.",
                    "Wall Thickness Control in Layered Manufacturing.",
                    "r-Regular Shape Reconstruction from Unorganized Points.",
                    "A Computational Basis for Higher-Dimensional Computational Geometry and Applications.",
                    "A New Algorithm for Computing Shortest Paths in Weighted Planar Subdivisions (Extended Abstract).",
                    "Approximating Weighted Shortest Paths on Polyhedral Surfaces.",
                    "Snap Rounding Line Segments Efficiently in Two and Three Dimensions.",
                    "Realistic Input Models for Geometric Algorithms.",
                    "Space-Time Tradeoffs for Emptiness Queries (Extended Abstract).",
                    "Distribution of Distances and Triangles in a Point Set and Algorithms for Computing the Largest Common Point Sets.",
                    "RAPID: Randomized Pharmacophore Identification for Drug Design.",
                    "Rotational Polygon Overlap Minimization.",
                    "Proximity Problems on Moving Points.",
                    "Approximate Nearest Neighbor Queries Revisited.",
                    "Approximate Shortest Paths and Geodesic Diameters on Convex Polytopes in Three Dimensions.",
                    "A-Shapes of a Finite Point Set.",
                    "Drawing Closed Rational Surfaces.",
                    "Fast Collision Detection Among Multiple Moving Spheres.",
                    "Robust and Efficient Evaluation of Functionals on Parametric Surfaces.",
                    "GASP-II: A Geometric Algorithm Animation System for an Electronic Classroom.",
                    "Practical Techniques for Constructing Binary Space Partitions for Orthogonal Rectangles.",
                    "Assembling Objects Through Parts Correlation.",
                    "A Practical Evaluation of Kinetic Data Structures.",
                    "Guaranteed-Quality Delaunay Meshing in 3D (Short Version).",
                    "Geometric Decision Trees for Optical Character Recognition (Extended Abstract).",
                    "A Wavelet Approach to Foveating Images.",
                    "Good Orders for Incremental (Re)construction.",
                    "Algorithmic Tolerances and Semantics in Data Exchange.",
                    "A General Method for Partial Point Set Matching.",
                    "An Interactive Environment for Visualizing and Animating Algorithms.",
                    "Classical Computational Geometry in GeomNet.",
                    "Empirical Testing of Algorithms for Variable-Sized Label Placement.",
                    "Voronoi Diagrams for Direction-Sensitive Distances.",
                    "Dynamic Visibility in Polygonal Scenes with the Visibility Complex.",
                    "Properties of the Delaunay Triangulation.",
                    "New Competitive Strategies for Searching in Unknown Star-Shaped Polygons.",
                    "Exact Primitives for Smallest Enclosing Ellipses.",
                    "Piecewise Linear Approximation of Bézier-Curves.",
                    "On Exact Solutions for the Rectilinear Steiner Tree Problem.",
                    "Clusters of Stars.",
                    "Probabilistic Analysis for Combinatorial Functions of Moving Points.",
                    "Position-Independent Near Optimal Searching and On-Line Recognition in Star Polygons.",
                    "Searching for Mobile Intruders in a Polygonal Region by a Group of Mobile Searchers (Extended Abstract).",
                    "A Polynomial Time Solution for Labeling a Rectilinear Map.",
                    "Time-Series Similarity Problems and Well-Separated Geometric Sets.",
                    "The Area Bisectors of a Polygon and Force Equilibria in Programmable Vector Fields.",
                    "Efficient Breakout Routing in Printed Circuit Boards.",
                    "Voronoi Diagram in Statistical Parametric Space by Kullback-Leibler Divergence.",
                    "Computing the Minimum Diameter for Moving Points: An Exact Implementation Using Parametric Search.",
                    "Sweeping Lines and Line Segments with a Heap.",
                    "The Bisector Surface of Freeform Rational Space Curves.",
                    "3D Visibility Made Visibly Simple: An Introduction to the Visibility Skeleton.",
                    "Application of an Effective Geometric Clustering Method to the Color Quantization Problem.",
                    "Animating the Polygon-Offset Distance Function.",
                    "A Triangulation-Based Object Reconstruction Method.",
                    "Approximating Weighted Shortest Paths on Polyhedral Surfaces.",
                    "Back-Face Computation of Polygon Clusters."
                ]
            }
        ]
    },
    {
        "year": "1996",
        "name": "12th SCG 1996",
        "info": "Philadelphia, PA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/compgeom/1996",
                "sub_name": "Proceedings of the Twelfth Annual Symposium on Computational Geometry, Philadelphia, PA, USA, May 24-26, 1996.",
                "count": 57,
                "papers": [
                    "New Lower Bounds for Convex Hull Problems in Odd Dimensions.",
                    "Shadows and Slices of Polytopes.",
                    "Vertical Decomposition of a Single Cell in a Three-Dimensional Arrangement of Surfaces and Its Applications.",
                    "On the Number of Arrangements of Pseudolines.",
                    "On Triangulating Three-Dimensional Polygons.",
                    "An Aspect Ratio Bound for Triangulating a d-Grid Cut by a Hyperplane (Extended Abstract).",
                    "Linear Complexity Hexahedral Mesh Generation.",
                    "Combinatorial and Experimental Results for Randomized Point Matching Algorithms.",
                    "Temporally Coherent Conservative Visibility (Extended Abstract).",
                    "Splitting a Complex of Convex Polytopes In Any Dimension.",
                    "A Computational Algorithm for Origami Design.",
                    "A Near-Linear Algorithm for the Planar 2-Center Problem.",
                    "On Piercing Sets of Objects.",
                    "Rectilinear and Polygonal p-Piercing and p-Center Problems.",
                    "Parallel Robust Algorithms for Constructing Strongly Convex Hulls.",
                    "Robust Adaptive Floating-Point Geometric Predicates.",
                    "On the Bit Complexity of Minimum Link Paths: Superquadratic Algorithms for Problems Solvable in Linear Time.",
                    "Checking Geometric Programs or Verification of Geometric Structures.",
                    "On Computing Voronoi Diagrams by Divide-Prune-and-Conquer.",
                    "Faster Output-Sensitive Parallel Convex Hulls for d<=3: Optimal Sublogarithmic Algorithms for Small Outputs.",
                    "Developing a Practical Projection-Based Parallel Delaunay Algorithm.",
                    "Approaching the Largest beta-Skeleton within a Minimum Weight Triangulation.",
                    "A (Usually?) Connected Subgraph of the Minimum Weight Triangulation.",
                    "Flipping Edges in Triangulations.",
                    "Enumeration of Regular Triangulations.",
                    "An Algorithm to Compute the Minkowski Sum Outer-face of Two Simple Polygons.",
                    "A Polynomial-Time Algorithm for Computing a Shortest Path of Bounded Curvature Amidst Moderate Obstacles (Extended Abstract).",
                    "d1-Optimal Motion for a Rod (Extended Abstract).",
                    "Optimal Robot Localization in Trees.",
                    "Fast Randomized Point Location Without Preprocessing in Two- and Three-dimensional Delaunay Triangulations.",
                    "Fixed-Dimensional Linear Programming Queries Made Easy.",
                    "Pseudo-Triangulations: Theory and Applications.",
                    "Improvements on Bottleneck Matching and Related Problems Using Geometry.",
                    "Approximating Monotone Polygonal Curves Using the Uniform Metric.",
                    "Convex Drawings of Graphs in Two and Three Dimensions (Preliminary Version).",
                    "Approximating Shortest Paths on a Convex Polytope in Three Dimensions.",
                    "Monotonicity of Rectilinear Geodesics in d-Space (Extended Abstract).",
                    "Disk Packings and Planar Separators.",
                    "Ramsey-Type Results for Geometric Graphs.",
                    "Experimental Results of Randomized Clustering Algorithm.",
                    "Animating Geometric Algorithms Over the Web.",
                    "Simple Traversal of a Subdivision Without Extra Storage.",
                    "The Graph of Triangulations of a Convex Polygon.",
                    "Partial Surface Matching by Using Directed Footprints.",
                    "On the Sectional Area of Convex Polytopes.",
                    "Smallest Enclosing Cylinders.",
                    "Curve Based Stereo Matching Using the Minimum Hausdorff Distance.",
                    "Geometric Tree Matching with Applications to 3D Lung Structures.",
                    "Four-Polytopes and a Funeral (for my conjecture).",
                    "Maintenance of the Set of Segments Visible from a Moving Viewpoint in Two Dimensions.",
                    "Testing Control Systems Through Dynamic Simulation.",
                    "On Computing Edges That Are In All Minimum-Weight Triangulations.",
                    "The Rotation Diagram and Optimal Containing Placements of a Convex Polygon.",
                    "Radiosity in Flatland Made Visibly Simple: Using the Visibility Complex for Lighting Simulation of Dynamic Scenes in Flatland.",
                    "Collision Detection for Fly-Throughs in Virtual Environments.",
                    "The Power of Coherence: Fast Tessellation of Surfaces.",
                    "A Package for Triangulations."
                ]
            }
        ]
    },
    {
        "year": "1995",
        "name": "11th SCG 1995",
        "info": "Vancouver, B.C., Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/compgeom/1995",
                "sub_name": "Proceedings of the Eleventh Annual Symposium on Computational Geometry, Vancouver, B.C., Canada, June 5-12, 1995.",
                "count": 65,
                "papers": [
                    "A Polynomial Time Algorithm for Minkowski Reconstruction.",
                    "Output-Sensitive Results on Convex Hulls, Extreme Points, and Related Problems.",
                    "How Good are Convex Hull Algorithms?",
                    "Immobilizing Polygons against a Wall.",
                    "Vertical Decomposition of Shallow Levels in 3-Dimensional Arrangements and Its Applications.",
                    "Efficient Collision Detection for Moving Polyhedra.",
                    "A Comparison of Sequential Delaunay Triangulation Algorithms.",
                    "Voronoi Diagrams and Containment of Families of Convex Sets on the Plane.",
                    "Voronoi Diagrams in Higher Dimensions under Certain Polyhedral Distance Functions.",
                    "The Voronoi Diagram of Curved Objects.",
                    "A Combinatorial Approach to Cartograms.",
                    "Map Labeling Heuristics: Provably Good and Practically Useful.",
                    "Overlaying Simply Connected Planar Subdivisions in Linear Time.",
                    "New Lower Bounds for Hopcroft's Problem (Extended Abstract).",
                    "A Helly-Type Theorem for Unions of Convex Sets.",
                    "On Conway's Thrackle Conjecture.",
                    "An Optimal Algorithm for Closest Pair Maintenance (Extended Abstract).",
                    "The Rectangle Enclosure and Point-Dominance Problems Revisited.",
                    "Approximate Range Searching.",
                    "The Overlay of Lower Envelopes in Three Dimensions and Its Applications.",
                    "Rounding Arrangements Dynamically.",
                    "A New Technique for Analyzing Substructures in Arrangements.",
                    "An Optimal Algorithm for Finding Segments Intersections.",
                    "Triangulations Intersect Nicely.",
                    "How to Cut Pseudo-Parabolas into Segments.",
                    "New Algorithms and Empirical Findings on Minimum Weight Triangulation Heuristics (Extended Abstract).",
                    "Computing the Visibility Graph via Pseudo-Triangulations.",
                    "Searching for the Kernel of a Polygon - A Competitive Strategy.",
                    "Stabbing Triangulations by Lines in 3D.",
                    "A Complete and Practical Algorithm for Geometric Theorem Proving (Extended Abstract).",
                    "Monte Carlo Approximation of Form Factors with Error Bounded a Priori.",
                    "Strategies for Polyhedral Surface Decomposition: An Experimental Study.",
                    "An Experimental Comparison of Three Graph Drawing Algorithms (Extended Abstract).",
                    "Visibility with Reflection.",
                    "Efficient Randomized Algorithms for Some Geometric Optimization Problems.",
                    "Accounting for Boundary Effects in Nearest Neighbor Searching.",
                    "A Parallel Algorithm for Linear Programming in Fixed Dimension.",
                    "Precision-Sensitive Euclidean Shortest Path in 3-Space (Extended Abstract).",
                    "Approximation Algorithms for Geometric Tour and Network Design Problems (Extended Abstract).",
                    "Shortest Path Queries Among Weighted Obstacles in the Rectilinear Plane.",
                    "Rectilinear Geodesics in 3-Space (Extended Abstract).",
                    "Union of Spheres (UoS) Model for Volumetric Data.",
                    "Hexahedral Mesh Generation via the Dual.",
                    "Fast and Robust Computation of Molecular Surfaces.",
                    "Representation and Computation of Boolean Combinations of Sculptured Models.",
                    "The Extensible Drawing Editor Ipe.",
                    "Geomview: A System for Geometric Visualization.",
                    "VideHoc: A Visualizer for Homogeneous Coordinates.",
                    "Evaluation of a New Method to Compute Signs of Determinants.",
                    "Exact Geometric Computation in LEDA.",
                    "A Global Motion Planner for a Mobile Robot on a Terrain.",
                    "Complete Algorithms for Reorienting Polyhedral Parts Using a Pivoting Gripper.",
                    "Geometry in GIS is not Combinatorial: Segment Intersection for Polygon Overlay.",
                    "On Levels of Detail in Terrains.",
                    "An Animated Library of Combinatorial VLSI-Routing Algorithms.",
                    "Printed Circuit Board Simplification: Simplifying Subdivisions in Practice.",
                    "An Implementation for Maintaining Arrangements of Polygons.",
                    "Minimal Enclosing Parallelogram with Application.",
                    "Topologically Sweeping the Visibility Complex of Polygonal Scenes.",
                    "The Visibility Complex Made Visibly Simple: An Introduction to 2D Structures of Visibility.",
                    "An Animation of Euclid's Proposition 47: The Pythagorean Theorem.",
                    "HIPAIR: Interactive Mechanism Analysis and Design Using Configuration Spaces.",
                    "Incremental Collision Detection for Polygonal Models.",
                    "Convex Surface Decomposition.",
                    "3D Modeling using the Delaunay Triangulation."
                ]
            }
        ]
    },
    {
        "year": "1994",
        "name": "10th SCG 1994",
        "info": "Stony Brook, New York, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/compgeom/1994",
                "sub_name": "Proceedings of the Tenth Annual Symposium on Computational Geometry, Stony Brook, New York, USA, June 6-8, 1994.",
                "count": 50,
                "papers": [
                    "Vertical Decompositions for Triangles in 3-Space.",
                    "Almost Tight Upper Bounds for the Single Cell and Zone Problems in Three Dimensions.",
                    "On Translational Motion Planning in 3-Space.",
                    "Motion Planning Amidst Fat Obstacles (Extended Abstract).",
                    "Approximate Euclidean Shortest Path in 3-Space.",
                    "The Realization Problem for Euclidean Minimum Spanning Trees is NP-hard.",
                    "Optimal Parallel Randomized Algorithms for the Voronoi Diagram of Line Segments in the Plane and Related Problems.",
                    "Constructing Levels in Arrangements and Higher Order Voronoi Diagrams.",
                    "Computing Many Faces in Arrangements of Lines and Segments.",
                    "Matching Shapes with a Reference Point.",
                    "Piecewise-Linear Interpolation Between Polygonal Slices.",
                    "Practical Methods for Approximate Geometric Pattern Matching Under Rigid Motions (Preliminary Version).",
                    "Spheres, Molecules, and Hidden Surface Removal.",
                    "Determining the Castability of Simple Polyhedra.",
                    "A Fast Algorithm for Constructing Sparse Euclidean Spanners.",
                    "Dynamic Maintenance of Maximas of 2-P Point Sets.",
                    "Biased Finger Trees and Three-Dimensional Layers of Maxima (Preliminary Version).",
                    "An Algorithm for Approximate Closest-Point Queries.",
                    "New Techniques for Exact and Approximate Dynamic Closest-Point Problems.",
                    "Competitive Searching in a Generalized Street.",
                    "The Tight Lower Bound for the Steiner Ratio in Minkowski Planes.",
                    "Bounding the Number of Geometric Permutations Induced by k-Transversals.",
                    "Applications of the Crossing Number.",
                    "Cutting Dense Point Sets in Half.",
                    "Fast Greedy Triangulation Algorithms.",
                    "Linear-Size Nonobtuse Triangulation of Polygons.",
                    "Bounds on the Size of Tetrahedralizations.",
                    "An Optimal Bound for Conforming Quality Triangulations (Extended Abstract).",
                    "On the Maximum Degree of Minimum Spanning Trees.",
                    "Optimal Linear-Time Algorithm for the Shortest Illuminating Line Segment in a Polygon.",
                    "Morphing Simple Polygons.",
                    "A New Technique to Compute Polygonal Schema for 2-Manifolds with Application to Null-Homotopy Detection.",
                    "Triangulating Topological Spaces.",
                    "Almost Optimal Set Covers in Finite VC-Dimension (Preliminary Version).",
                    "An Efficient Algorithm for the Euclidean Two-Center Problem.",
                    "On Geometric Optimization with Few Violated Constraints.",
                    "Efficient Piecewise-Linear Function Approximation Using the Uniform Metric (Preliminary Version).",
                    "Applications of Weighted Voronoi Diagrams and Randomization to Variance-Based k-Clustering (Extended Abstract).",
                    "Bounded Boxes, Hausdorff Distance, and a New Proof of an Interesting Helly-Type Theorem.",
                    "Computing Envelopes in Four Dimensions with Applications.",
                    "Query-Sensitive Ray Shooting.",
                    "Efficient Algorithms for Generalized Intersection Searching on Non-Iso-Oriented Objects.",
                    "An O(n log n) Implementation of the Douglas-Peucker Algorithm for Line Simplification.",
                    "Computing the Rectangle Discrepancy.",
                    "An Animation of a Fixed-Radius All-Nearest-Neighbors Algorithm.",
                    "GASP: A System to Facilitate Animating Geometric Algorithms.",
                    "Penumbral Shadows.",
                    "Exact Collision Detection for Interactive Environments (Extended Abstract).",
                    "Almost Optimal Polyhedral Separators.",
                    "Interactive Visualization of Weighted Three-Dimensional Alpha Hulls."
                ]
            }
        ]
    },
    {
        "year": "1993",
        "name": "9th SCG 1993",
        "info": "San Diego, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/compgeom/1993",
                "sub_name": "Proceedings of the Ninth Annual Symposium on Computational GeometrySan Diego, CA, USA, May 19-21, 1993.",
                "count": 51,
                "papers": [
                    "Generalized Hidden Surface Removal.",
                    "New Bounds for Lower Envelopes in Three Dimensions, with Applications to Visibility in Terrains.",
                    "On Lines Missing Polyhedral Sets in 3-Space.",
                    "Combinatorial Complexity of Translating a Box in Polyhedral 3-Space.",
                    "An Optimal Algorithm for the (<= k)-Levels, with Applications to Separation and Transversal Problems.",
                    "Computing the Discrepancy.",
                    "Optimally Sparse Spanners in 3-Dimensional Euclidean Space.",
                    "Helly Theorems and Generalized Linear Programming.",
                    "Geometric Partitioning Made Easier, Even in Parallel.",
                    "Computing a Centerpoint of a Finite Planar Set of Points in Linear Time.",
                    "Approximating Center Points with Iterated Radon Points.",
                    "A Deterministic Linear Time Algorithm for Geometric Separators and its Applications.",
                    "On the Topological Shape of Planar Voronoi Diagrams.",
                    "Convex Distance Functions in 3-Space are Different.",
                    "A Linear-Time Randomized Algorithm for the Bounded Voronoi Diagram of a Simple Polygon.",
                    "Tentative Prune-and-Search for Computing Voronoi Vertices.",
                    "Optimal Motion Planning for a Rod in the Plane Subject to Velocity Constraints.",
                    "A Compaction Algorithm for Non-Convex Polygons and Its Application.",
                    "Efficient Exact Arithmetic for Computational Geometry.",
                    "Area Optimization of Simple Polygons.",
                    "Worst-Case Bounds for Subadditive Geometric Graphs.",
                    "Finding a Minimum Weight K-Link Path in Graphs with Monge Property and Applications.",
                    "An Expander-Based Approach to Geometric Optimization.",
                    "Dominance Range-Query: The One-Reporting Case.",
                    "The Union of Balls and Its Dual Shape.",
                    "An Incremental Algorithm for Betti Numbers of Simplicial Complexes.",
                    "Dehn-Sommerville Relations, Upper Bound Theorem, and Levels in Arrangements.",
                    "Objects That Cannot be Taken Apart with Two Hands.",
                    "Long Non-Crossing Configurations in the Plane.",
                    "Some Geometric Applications of Dilworth's Theorem.",
                    "Counting Triangle Crossings and Halving Planes.",
                    "Guaranteed-Quality Mesh Generation for Curved Surfaces.",
                    "Compatible Tetrahedralizations.",
                    "An NC Parallel 3D Convex Hull Algorithm.",
                    "Scalable Parallel Geometric Algorithms for Coarse Grained Multicomputers.",
                    "Shortest Paths Among Obstacles in the Plane.",
                    "Dynamic Ray Shooting and Shortest Paths Via Balanced Geodesic Triangulations.",
                    "The Visibility Complex.",
                    "Can Visibility Graphs be Represented Compactly?",
                    "An Optimal Algorithm for the Two-Guard Problem.",
                    "Area-Efficient Upward Tree Drawings.",
                    "Decision Trees for Geometric Models.",
                    "The Power of Geometric Duality and Minkowski Sums in Optical Computational Geometry.",
                    "Visualizing Fortune's Sweepline Algorithm for Planar Voronoi Diagrams.",
                    "Building and Using Polyhedral Hierarchies.",
                    "Moving a Disc Between Polygons.",
                    "Compliant Motion in a Simple Polygon.",
                    "Implementation of a Motion Planning System in Three Dimensions.",
                    "Animation of Geometric Algorithms Using GeoLab.",
                    "Ranger: A Tool for Nearest Neighbor Search in High Dimensions.",
                    "Video: Objects that Cannot be Taken Apart with Two Hands."
                ]
            }
        ]
    },
    {
        "year": "1992",
        "name": "8th SCG 1992",
        "info": "Berlin, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/compgeom/1992",
                "sub_name": "Proceedings of the Eighth Annual Symposium on Computational Geometry, Berlin, Germany, June 10-12, 1992.",
                "count": 43,
                "papers": [
                    "A Subexponential Bound for Linear Programming.",
                    "A Class of Convex Programs with Applications to Computational Geometry.",
                    "Linear Optimization Queries.",
                    "Degenerate Convex Hulls in High Dimensions without Extra Storage.",
                    "Optimal Parallel Algorithms for Triangulated Simple Polygons.",
                    "Incremental Topological Flipping Works for Regular Triangulations.",
                    "An Upper Bound for Conforming Delaunay Triangulations.",
                    "An Optimal Parallel Algorithm for Detecting Weak Visibility of a Simple Polygon.",
                    "Digital Geometry (Abstract).",
                    "An Efficient Approach to Removing Geometric Degeneracies.",
                    "Numerical Stability of Algorithms for 2D Delaunay Triangulations.",
                    "Approximate Decision Algorithms for Point Set Congruence.",
                    "Measuring the Resemblance of Polygonal Curves.",
                    "On Dynamic Voronoi Diagrams and the Minimum Hausdorff Distance for Point Sets Under Euclidean Motion in the Plane.",
                    "Diameter, Width, Closest Line Pair, and Parametric Searching.",
                    "Incidence and Nearest-Neighbor Problems for Lines in 3-Space.",
                    "Computing and Verifying Depth Orders.",
                    "Castles in the Air Revisited.",
                    "Piercing Convex Sets.",
                    "Computing the Volume, Counting Integral Points, and Exponential Sums.",
                    "There is a Universal Topological Plane.",
                    "A Linear-Time Algorithm for Testing the Inscribability of Trivalent Polyhedra.",
                    "On Euclidean Spanner Graphs with Small Degree.",
                    "New Sparseness Results on Graph Spanners.",
                    "Coping with Inconsistencies: A New Approach to Produce Quality Triangulations of Polygonal Domains with Holes.",
                    "Quality Mesh Generation in Three Dimensions.",
                    "Triangulating Polygons without Large Angles.",
                    "Optical Computational Geometry.",
                    "Stable Placements for Spider Robots.",
                    "A Rational Rotation Method for Robust Geometric Algorithms.",
                    "A Framework for Dynamic Graph Drawing.",
                    "How Hard is Halfspace Range Searching?",
                    "Range Searching with Efficient Hierarchical Cuttings.",
                    "Ray Shooting in Convex Polytopes.",
                    "Minimum Dissection of Rectilinear Polygon with Arbitrary Holes into Rectangles.",
                    "Intersection Detection and Separators for Simple Polygons.",
                    "Manhattonian Proximity in a Simple Polygon.",
                    "Finding k Farthest Pairs and k Closest/Farthest Bichromatic Pairs for Points in the Plane.",
                    "An Optimal Algorithm for the On-Line Closest-Pair Problem.",
                    "On-Line Steiner Trees in the Euclidean Plane.",
                    "A Priori Inequalities for the Euclidean Traveling Salesman.",
                    "Minkowski-Type Theorems and Least-Squares Partitioning.",
                    "Determining Contractibility of Curves."
                ]
            }
        ]
    },
    {
        "year": "1991",
        "name": "7th SCG 1991",
        "info": "North Conway, NH, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/compgeom/1991",
                "sub_name": "Proceedings of the Seventh Annual Symposium on Computational Geometry, North Conway, NH, USA, , June 10-12, 1991.",
                "count": 42,
                "papers": [
                    "Efficient Partition Trees.",
                    "Counting Circular Arc Intersections.",
                    "Efficient Ray Shooting and Hidden Surface Removal.",
                    "Efficient Hidden Surface Removal for Objects with small Union Size.",
                    "Intersection Queries for Curved Objects (Extended Abstract).",
                    "Shortest Path Queries in Rectilinear Worlds of Higher Dimension (Extended Abstract).",
                    "Dynamization of the Trapezoid Method for Planar Point Location (Extended Abstract).",
                    "Computing Shortest Transversals of Sets (Extended Abstract).",
                    "Optimal Algorithms for Some Smallest Intersection Radius Problems (Extended Abstract).",
                    "Orthogonal Trees.",
                    "A Pivoting Algorithm for Convex Hulls and Vertex Enumeration of Arrangements and Polyhedra.",
                    "Nonoverlap of the Star Unfolding.",
                    "A Generalization of Dehn-Sommerville Relations to Simple Stratified Spaces.",
                    "Randomized Multidimensional Search Trees: Dynamic Sampling (Extended Abstract).",
                    "Dynamic Point Location in Arrangements of Hyperplanes.",
                    "A Simple On-Line Randomized Incremental Algorithm for Computing Higher Order Voronoi Diagrams.",
                    "Randomized Parallel Algorithms for Trapezoidal Diagrams.",
                    "On the Convex Hull of the Integer Points in a Disc.",
                    "The Two Guards Problem.",
                    "Extremal Polygon Containment Problems.",
                    "Approximate Matching of Polygonal Shapes (Extended Abstract).",
                    "The Upper Envelope of Voronoi Surfaces and Its Applications.",
                    "Minimal Surfaces, Crystals, and Norms on Rn.",
                    "Multiplicatively Weighted Crystal Growth Voronoi Diagrams (Extended Abstract).",
                    "Nearest Neighbor Problems.",
                    "Enumerating k Distances for n Points in the Plane.",
                    "Transitions in Geometric Minimum Spanning Trees (Extended Abstract).",
                    "How to Take Short Cuts.",
                    "Construction of Multidimensional Spanner Graphs, with Applications to Minimum Spanning Trees.",
                    "Geometric Algorithms for a Minimum Cost Assignment Problem.",
                    "On Upward Drawing Testing of Triconnected Digraphs (Extended Abstract).",
                    "A Packing Problem with Applications to Lettering of Maps.",
                    "Distance Visibility Graphs.",
                    "Walking on an Arrangement Topologically.",
                    "On the Sum of Squares of Cell Complexities in Hyperplane Arrangements.",
                    "On the Complexity of a Single Cell in Certain Arrangements of Surfaces in 3-Space (Extended Abstract).",
                    "Arrangements of Segments that Share Endpoints: Single Face Results.",
                    "Numerical Stability of Algorithms for Line Arrangements.",
                    "Polynomial-Size Nonobtuse Triangulation of Polygons.",
                    "Crossing Families.",
                    "Optimality of the Delaunay Triangulation in Rd.",
                    "Triangulation and CSG Representation of Polyhedra with Arbitrary Genus."
                ]
            }
        ]
    },
    {
        "year": "1990",
        "name": "6th SCG 1990",
        "info": "Berkeley, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/compgeom/1990",
                "sub_name": "Proceedings of the Sixth Annual Symposium on Computational Geometry, Berkeley, CA, USA, June 6-8, 1990.",
                "count": 41,
                "papers": [
                    "Cutting Hyperplane Arrangements.",
                    "Some New Bounds for Epsilon-Nets.",
                    "How to Net a Lot with Little: Small epsilon-Nets for Disks and Halfspaces.",
                    "Quasi-Optimal Upper Bounds for Simplex Range Searching and New Zone Theorems.",
                    "Polygon Triangulation in O(n log log n) Time with Simple Data-Structures.",
                    "An O(n2log n) Time Algorithm for the MinMax Angle Triangulation.",
                    "Structured Visibility Profiles with Applications to Problems in Simple Polygons (Extended Abstract).",
                    "Minimum-Link Paths Among Obstacles in the Plane.",
                    "Parallel Methods for Visibility and Shortest Path Problems in Simple Polygons (Preliminary Version).",
                    "The Combinatorial Complexity of Hyperplane Transversals.",
                    "On the Limited Power of Linear Probes and Other Optimization Oracles.",
                    "Computational Complexity of Combinatorial Surfaces.",
                    "Points and Triangles in the Plane and Halving Planes in Space.",
                    "Slimming Down by Adding: Selecting Heavily Covered Points.",
                    "Tiling the Plane with One Tile.",
                    "A Trivial Knot Whose Spanning Disks Have Exponential Size.",
                    "Geometric Computations with Algebraic Varieties of Bounded Degree.",
                    "On Computing the Intersection of B-Splines (Extended Abstract).",
                    "Merging Visibility Maps.",
                    "Stabbing and Ray Shooting in 3 Dimensional Space.",
                    "K-d Trees for Semidynamic Point Sets.",
                    "On the Optimal Bisection of a Polygon (Extended Abstract).",
                    "Euclidean Minimum Spanning Trees and Bichromatic Closest Pairs.",
                    "Linear Programming and Convex Hulls Made Easy.",
                    "On Simultaneous Inner and Outer Approximation of Shapes.",
                    "Maximin Location of Convex Objects in a Polygon and Related Dynamic Voronoi Diagrams.",
                    "Constructing Strongly Convex Hulls Using Exact or Rounded Arithmetic.",
                    "Finding Compact Coordinate Representations for Polygons and Polyhedra.",
                    "Some Provably Hard Crossing Number Problems.",
                    "Enumeration and Visibility Problems in Integer Lattices (Extended Abstract).",
                    "An Exact Algorithm for Kinodynamic Planning in the Plane.",
                    "Approximate Motion Planning and the Complexity of the Boundary of the Union of Simple Geometric Figures.",
                    "Provably Good Approximation Algorithms for Optimal Kinodynamic Planning for Cartesian Robots and Open Chain Manipulators.",
                    "Shortest Rectilinear Paths among Weighted Obstacles.",
                    "On Minimal Rectilinear Steiner Trees in All Dimensions.",
                    "Selecting Distances in the Plane.",
                    "Reconstructing Sets from Interpoint Distances (Extended Abstract).",
                    "Computing the Minimum Hausdorff Distance for Point Sets Under Translation.",
                    "On Solving Geometric Optimization Problems Using Shortest Paths.",
                    "Shortest Paths on a Polyhedron.",
                    "A Computational geometry Workbench."
                ]
            }
        ]
    },
    {
        "year": "1989",
        "name": "5th SCG 1989",
        "info": "Saarbrücken, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/compgeom/1989",
                "sub_name": "Proceedings of the Fifth Annual Symposium on Computational Geometry, Saarbrücken, Germany, June 5-7, 1989.",
                "count": 43,
                "papers": [
                    "Construction of epsilon Nets.",
                    "A Deterministic Algorithm for Partitioning Arrangements of Lines and Its Application.",
                    "Binary Partitions with Applications to Hidden Surface Removal and Solid Modelling.",
                    "A Fast Planar Partition Algorithm, II.",
                    "Detecting and Decomposing Self-Overlapping Curves.",
                    "Area Requirement and Symmetry Display in Drawing Graphs.",
                    "Kink-Free Deformations of Polygons.",
                    "An Efficient Algorithm for Link-Distance Problems.",
                    "Computing the Irreducible Real Factors and Components of an Algebraic Curve.",
                    "Degree Complexity Bounds on the Intersection of Algebraic Curves.",
                    "Hermite Interpolation of Rational Space Curves Using Real Algebraic Surfaces.",
                    "On the Parallel Decomposability of Geometric Problems.",
                    "Optimal Parallel Algorithm for Visibility of a Simple Polygon from a Point.",
                    "Good Splitters for Counting Points in Triangles.",
                    "Computing Partial Sums in Multidimensional Arrays.",
                    "On the Number of Halving Planes.",
                    "An Acyclicity Theorem for Cell Complexes in d Dimensions.",
                    "Necessary and Sufficient Conditions for Hyperplane Transversals.",
                    "Efficient Motion Planning for an L-Shaped Object.",
                    "Placing the Largest Similar Copy of a Convex Polygon Among Polygonal Obstacles.",
                    "Compliant Motion in a Simple Polygon.",
                    "An Efficient Algorithm for One-Step Planar Complaint Motion Planning with Uncertainty.",
                    "Calculating Approximate Curve Arrangements Using Rounded Arithmetic.",
                    "Minimax Geometric Fitting of Two Corresponding Sets of Points.",
                    "Epsilon Geometry: Building Robust Algorithms from Imprecise Computations.",
                    "Representing Geometric Structures in d Dimensions: Topology and Order.",
                    "Subdivisions of n-Dimensional Spaces and n-Dimensional Generalized Maps.",
                    "Probing a Scene of Non Convex Polyhedra.",
                    "Determining Sector Visibility of a Polygon.",
                    "Finding Tailored Partitions.",
                    "Bounded-Diameter Minimum Spanning Trees and Related Problems.",
                    "Fining k Points with Minimum Spanning Trees and Related Problems.",
                    "Fast Geometric Approximation Techniques and Geometric Embedding Problems.",
                    "On Geometric Matching.",
                    "Ray Shooting and Other Applications of Spanning Trees with Low Stabbing Number.",
                    "Higher-Dimensional Voronoi Diagrams in Linear Expected Time.",
                    "On Monotone Paths Among Obstacles with Applications to Planning Assemblies.",
                    "Minimum Partitioning Simple Rectilinear Polygons in o(n log log n) Time.",
                    "Sweeping Arrangements of Curves.",
                    "Stabbing Pairwise Disjoint Translates in Linear Time.",
                    "Computing the Geodesic Diameter of a 3-Polytope.",
                    "On the Difficulty of Tetrahedralizing 3-Dimensional Non-Convex Polyhedra.",
                    "Triangulating a Non-Convex Polytype."
                ]
            }
        ]
    },
    {
        "year": "1988",
        "name": "4th SCG 1988",
        "info": "Urbana-Champaign, IL, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/compgeom/1988",
                "sub_name": "Proceedings of the Fourth Annual Symposium on Computational Geometry, Urbana-Champaign, IL, USA, June 6-8, 1988.",
                "count": 40,
                "papers": [
                    "Applications of Random Sampling in Computational Geometry, II.",
                    "Algorithms for Diametral Pairs and Convex Hulls That Are Optimal, Randomized, and Incremental.",
                    "A Fast Las Vegas Algorithm for Triangulating a Simple Polygon.",
                    "Partition Trees for Triangle Counting and Other Range Searching Problems.",
                    "Quasi-Valid Range Querying and Its Implications for Nearest Neighbor Problems.",
                    "The Complexity of Many Faces in Arrangements of Lines of Segments.",
                    "Implicitly Representing Arrangements of Lines or Segments.",
                    "Red-Blue Intersection Detection Algorithms, with Applications to Motion Planning and Collision Detection.",
                    "Algebraic Methods for Non-Linear Computational Geometry (Invited Address).",
                    "The Design of LINETOOL, a Geometric Editor.",
                    "Recipes for Geometry and Numerical Analysis - Part I: An Empirical Study.",
                    "Towards Implementing Robust Geometric Computations.",
                    "Simulation of Simplicity: A Technique to Cope with Degenerate Cases in Geometric Algorithms.",
                    "A Geometric Consistency Theorem for a Symbolic Perturbation Scheme.",
                    "Globally-Equiangular Triangulations of Co-Circular Points in 0(n log n) Time.",
                    "Analysis of a Simple Yet Efficient Convex Hull Algorithm.",
                    "New Methods for Computing Visibility Graphs.",
                    "Efficient Algorithms for Euclidean Shortest Path and Visibility Problems with Polygonal Obstacles.",
                    "Hidden Surface Removal for Rectangles.",
                    "An Efficient Output-Sensitive Hidden Surface Removal Algorithm and Its Parallelization.",
                    "Optimal Parallel Algorithms for Polygon and Point-Set Problems.",
                    "Covering Orthogonal Polygons with Star Polygons: The Perfect Graph Approach.",
                    "Searching for Empty Convex Polygons.",
                    "The Furthest-Site Geodesic Voronoi Diagram.",
                    "Computing Euclidean Maximum Spanning Trees.",
                    "Clustering Algorithms Based on Minimum and Maximum Spanning Trees.",
                    "On Arrangements of Jordan Arcs with Three Intersections per Pair.",
                    "Path Planning in 0/1/infinity Weighted Regions with Applications.",
                    "Motion Planning in the Presence of Movable Obstacles.",
                    "On the General Motion Planning Problem with Two Degrees of Freedom.",
                    "On Planning Assemblies.",
                    "The Complexity of Planar Compliant Motion Planning Under Uncertainty.",
                    "Coordinated Motion Planning for Two Independent Robots.",
                    "An Automatic Motion Planning System for a Convex Polygonal Mobile Robot in 2-Dimensional Polygonal Space.",
                    "On Maximum Flows in Polyhedral Domains.",
                    "Algorithms for Vertical and Orthogonal L1 Linear Approximation of Points.",
                    "Skewed Projections with an Application to Line Stabbing in R3.",
                    "Arrangements of Lines in 3-Space: A Data Structure with Applications.",
                    "Triangles in Space or Building (and Analyzing) Castles in the Air.",
                    "On Continuous Homotopic One Layer Routing."
                ]
            }
        ]
    },
    {
        "year": "1987",
        "name": "3rd SCG 1987",
        "info": "Waterloo, Ontario, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/compgeom/1987",
                "sub_name": "Proceedings of the Third Annual Symposium on Computational Geometry, Waterloo, Ontario, Canada, June 8-10, 1987.",
                "count": 38,
                "papers": [
                    "Computing the Link Center of a Simple Polygon.",
                    "Finding the Visibility Graph of a Simple Polygon in Time Proportional to its Size.",
                    "Jordan Sorting Via Convex Hulls of Certain Non-Simple Polygons.",
                    "The Weighted Region Problem.",
                    "On the Geodesic Voronoi Diagram of Point Sites in a Simple Polygon.",
                    "Optimal Shortest Path Queries in a Simple Polygon.",
                    "The All-Geodesic-Furthest Neighbor Problem for Simple Polygons.",
                    "Oriented Projective Geometry.",
                    "Primitives for the Manipulation of Three-Dimensional Subdivisions.",
                    "A Graph Based Approach to Object Feature Recognition.",
                    "Polygon Properties Calculated from the Vertex Neighborhoods.",
                    "Numerical Stability of Geometric Algorithms.",
                    "Discrete Simulation of NC Machining.",
                    "Moving a Ladder in Three Dimensions: Upper and Lower Bounds.",
                    "On Detecting the Orientation of Polygons and Polyhedra.",
                    "Simplified Voronoi Diagrams.",
                    "An Optimal O(n log n) Algorithm for Contour Reconstruction from Rays.",
                    "Compliant Motion Planning with Geometric Models.",
                    "On the Number of Faces in Higher-Dimensional Voronoi Diagrams.",
                    "Toughness and Delaunay Triangulations.",
                    "Joint Triangulations and Triangulation Maps.",
                    "Parallel Processing for Efficient Subdivision Search.",
                    "Constrained Delaunay Triangulations.",
                    "An Optimal Algorithm for Constructing the Delaunay Triangulation of a Set of Line Segments.",
                    "A Note on Relative Neighborhood Graphs.",
                    "Simultaneous Containment of Several Polygons.",
                    "Rectilinear Shortest Paths Through Polygonal Obstacles in O(n (log n)2) Time.",
                    "A Bucketing Algorithm for the Orthogonal Segment Intersection Search Problem and Its Practical Efficiency.",
                    "Covering a Simple Orthogonal Polygon with a Minimum Number of Orthogonally Convex Polygons.",
                    "Fast Algorithms for Computing the Largest Empty Rectangle.",
                    "Variations on Visibility.",
                    "Algorithms for Line Transversals in Space.",
                    "Congruence, Similarity, and Symmetries of Geometric Objects.",
                    "Establishing Order in Planar Subdivisions.",
                    "Computing Simple Circuits from a Set of Line Segments is NP-Complete.",
                    "Partitioning and Geometric Embedding of Range Spaces of Finite Vapnik-Chervonenkis Dimension.",
                    "Blending Quadric Surfaces with Wuadric and Cubic Surfaces.",
                    "Analyzing Surfaces: The Truth About Elimination Theory."
                ]
            }
        ]
    },
    {
        "year": "1986",
        "name": "2nd SCG 1986",
        "info": "Yorktown Heights, NY, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/compgeom/1986",
                "sub_name": "Proceedings of the Second Annual ACM SIGACT/SIGGRAPH Symposium on Computational Geometry, Yorktown Heights, NY, USA, June 2-4, 1986.",
                "count": 34,
                "papers": [
                    "Linear Time Algorithms for Visibility and Shortest Path Problems Inside Simple Polygons.",
                    "Worst-Case Optimal Algorithms for Constructing Visibility Polygons with Holes.",
                    "Optimum Watchman Routes.",
                    "Finding the Minimum Visible Vertex Distance Between Two Non-Intersecting Simple Polygons.",
                    "Minimally Covering a Horizontally Convex Orthogonal Polygon.",
                    "On Computing Simple Circuits on a Set of Line Segments.",
                    "Epsilon-Nets and Simplex Range Queries.",
                    "On Approximation Behavior and Implementation of the Greedy Triangulation for Convex Planar Point Sets.",
                    "On the Application of Shared Retrieval to Orthogonal Range Queries.",
                    "Computing Convolutions by Reciprocal Search.",
                    "Fast Heuristics for Minimum Length Rectangular Partitions of Polygons.",
                    "Optimal Dynamic Solutions for Fixed Windowing Problems.",
                    "Geometry of Planar Graphs with Angles.",
                    "Scene Analysis and Geometric Homology.",
                    "Triangulating Simplicial Point Sets in Space.",
                    "Two Algorithms for Polyhedral Pictures.",
                    "Storing the Subdivision of a Polyhedral Surface.",
                    "A Defect-Correction algorithm for Minimizing the Volume of a Simple Polyhedron Which Circumscribes a Sphere.",
                    "There is a Planar Graph Almost as Good as the Complete Graph.",
                    "A New Efficient Motion-Planning Algorithm for a Rod in Polygonal Space.",
                    "Moving a Polygon Around the Corner in a Corridor.",
                    "On Shortest Paths Amidst Convex Polyhedra.",
                    "An Efficient Algorithm to Determine the Image of a Parallelepiped Under a Linear Transformation.",
                    "Efficient Plane Sweeping in Parallel.",
                    "Smoothing of Polyhedral Hodels.",
                    "CSG Set-Theoretic Solid Modelling and NC Machining of Blend Aurfaces.",
                    "Implementing Watson's Algorithm in Three Dimensions.",
                    "The Hierarchical Representation of Objects: The Delaunay Tree.",
                    "Quadratic Bounds for Hidden Line Elimination.",
                    "A Simple Divide-and-Conquer Algorithm for Computing Delaunay Triangulations in O(n log log n) Expected Time.",
                    "Geometric Applications of a Matrix Searching Algorithm.",
                    "Linear Data Structures for Two Types of Range Search.",
                    "Deferred Data Structuring: Query-Driven Preprocessing for Geometric Search Problems.",
                    "A Sweepline Algorithm for Voronoi Diagrams."
                ]
            }
        ]
    },
    {
        "year": "1985",
        "name": "1st SCG 1985",
        "info": "Baltimore, Maryland, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/compgeom/1985",
                "sub_name": "Proceedings of the First Annual Symposium on Computational Geometry, Baltimore, Maryland, USA, June 5-7, 1985.",
                "count": 41,
                "papers": [
                    "Computating the width of a set.",
                    "Computing separating planes for pairs of disjoint polytopes.",
                    "Extended Gaussian images, mixed volumes, shape reconstruction.",
                    "Finding the optimal shadows of a convex polytope.",
                    "Consistent calculations for solids modeling.",
                    "Exploiting topological and geometric properties for selective subdivision.",
                    "Reconstruction of solids.",
                    "The geometry of beam tracing.",
                    "On the complexity of reachability and motion planning questions (extended abstract).",
                    "A geometric reasoning system for moving an object while maintaining contact with others.",
                    "An efficient algorithm for planning collision-free translational motion of a convex polygonal object in 2-dimensional space amidst polygonal obstacles.",
                    "The direct dominance problem.",
                    "Output-size sensitive algorithms for finding maximal vectors.",
                    "Decomposing polygonal regions into convex quadrilaterals.",
                    "Halfspace range search: an algorithmic application of K-sets.",
                    "On the partitionability of point sets in space (preliminary report).",
                    "Modeling planar configurations.",
                    "New techniques for computing order statistics in Euclidean space (extended abstract).",
                    "Visibility and intersectin problems in plane geometry.",
                    "Characterizing bar line-of-sight graphs.",
                    "A method for drawing graphs.",
                    "Computing the largest empty convex subset of a set of points.",
                    "Dynamization of geometric data structures.",
                    "Range searching in a set of line segments.",
                    "Distance problems in computational geometry with fixed orientations.",
                    "Sorting Jordan sequences in linear time.",
                    "Rectilinear shortest paths with rectangular barriers.",
                    "Planning the shortest path for a disc in O(n2log n) time.",
                    "An efficient and simple motion planning algorithm for a ladder moving in two-dimensional space amidst polygonal barriers (extended abstract).",
                    "An improved algorithm for constructing kth-order Voronoi diagrams.",
                    "Voronoi diagrams based on convex distance functions.",
                    "A computational geometry approach to clustering problems.",
                    "Voronoi diagrams and arrangements.",
                    "Pyramid computer algorithms for determining geometric properties of images.",
                    "Quadtrees, octrees, hyperoctrees: a unified analytical approach to tree data structures used in graphics, geometric modeling and image processing.",
                    "Bounds for partitioning rectilinear polygons.",
                    "On partitioning polygons.",
                    "Finding minimal convex nested polygons.",
                    "Turtlegons: generating simple polygons for sequences of angles.",
                    "Computing a convex skill of an orthogonal polygon.",
                    "The complexity of cutting paper (extended abstract)."
                ]
            }
        ]
    }
]