[
    {
        "year": "2022",
        "name": "39th STACS 2022",
        "info": "Marseille, France (Virtual Conference)",
        "venues": [
            {
                "sub_name_abbr": "conf/stacs/2022",
                "sub_name": "39th International Symposium on Theoretical Aspects of Computer Science, STACS 2022, March 15-18, 2022, Marseille, France (Virtual Conference).",
                "count": 61,
                "papers": [
                    "Front Matter, Table of Contents, Preface, Conference Organization.",
                    "Local Limit of Random Discrete Surface with (Or Without!) a Statistical Physics Model (Invited Talk).",
                    "Generalization Guarantees for Data-Driven Mechanism Design (Invited Talk).",
                    "Deterministic Distributed Symmetry Breaking at the Example of Distributed Graph Coloring (Invited Talk).",
                    "Mapping Networks via Parallel kth-Hop Traceroute Queries.",
                    "On Robustness for the Skolem and Positivity Problems.",
                    "Approximability of Robust Network Design: The Directed Case.",
                    "Existential Definability over the Subword Ordering.",
                    "Intrinsic Complexity of Recursive Functions on Natural Numbers with Standard Order.",
                    "Subquadratic-Time Algorithm for the Diameter and All Eccentricities on Median Graphs.",
                    "Faster Counting and Sampling Algorithms Using Colorful Decision Oracle.",
                    "Probabilistic vs Deterministic Gamblers.",
                    "Single-Source Shortest p-Disjoint Paths: Fast Computation and Sparse Preservers.",
                    "A 10-Approximation of the π/2-MST.",
                    "On Explicit Constructions of Extremely Depth Robust Graphs.",
                    "Reconfiguration of Spanning Trees with Degree Constraint or Diameter Constraint.",
                    "Characterizing Omega-Regularity Through Finite-Memory Determinacy of Games on Infinite Graphs.",
                    "On Testing Decision Tree.",
                    "The Ideal Membership Problem and Abelian Groups.",
                    "The Aperiodic Domino Problem in Higher Dimension.",
                    "Symmetry and Quantum Query-To-Communication Simulation.",
                    "Near-Optimal Algorithms for Point-Line Covering Problems.",
                    "Towards Uniform Certification in QBF.",
                    "Blazing a Trail via Matrix Multiplications: A Faster Algorithm for Non-Shortest Induced Paths.",
                    "Depth Lower Bounds in Stabbing Planes for Combinatorial Principles.",
                    "Linear Space Data Structures for Finite Groups with Constant Query-Time.",
                    "The Isomorphism Problem for Plain Groups Is in Σ₃𝖯.",
                    "Centralized, Parallel, and Distributed Multi-Source Shortest Paths via Hopsets and Rectangular Matrix Multiplication.",
                    "Cardinality Constrained Scheduling in Online Models.",
                    "Detours in Directed Graphs.",
                    "Delay-Robust Routes in Temporal Graphs.",
                    "Maximally Satisfying Lower Quotas in the Hospitals/Residents Problem with Ties.",
                    "Online Scheduling on Identical Machines with a Metric State Space.",
                    "A Simplicial Model for KB4_n: Epistemic Logic with Agents That May Die.",
                    "Star Transposition Gray Codes for Multiset Permutations.",
                    "Improved Quantum Lower and Upper Bounds for Matrix Scaling.",
                    "Tight Bounds for Counting Colorings and Connected Edge Sets Parameterized by Cutwidth.",
                    "Satisfiability of Circuits and Equations over Finite Malcev Algebras.",
                    "Classes of Intersection Digraphs with Good Algorithmic Properties.",
                    "Further Exploiting c-Closure for FPT Algorithms and Kernels for Domination Problems.",
                    "Obstructions for Matroids of Path-Width at most k and Graphs of Linear Rank-Width at most k.",
                    "Fairly Popular Matchings and Optimality.",
                    "Covering Many (Or Few) Edges with k Vertices in Sparse Graphs.",
                    "One-To-Two-Player Lifting for Mildly Growing Memory.",
                    "If VNP Is Hard, Then so Are Equations for It.",
                    "Determining a Slater Winner Is Complete for Parallel Access to NP.",
                    "Improved Ackermannian Lower Bound for the Petri Nets Reachability Problem.",
                    "Scheduling with Communication Delay in Near-Linear Time.",
                    "Extending the Reach of the Point-To-Set Principle.",
                    "One-Way Communication Complexity and Non-Adaptive Decision Trees.",
                    "Isolation Schemes for Problems on Decomposable Graphs.",
                    "Oritatami Systems Assemble Shapes No Less Complex Than Tile Assembly Model (ATAM).",
                    "Compact Representation for Matrices of Bounded Twin-Width.",
                    "On Finer Separations Between Subclasses of Read-Once Oblivious ABPs.",
                    "A Relativization Perspective on Meta-Complexity.",
                    "Superlinear Lower Bounds Based on ETH.",
                    "NP-Completeness of Perfect Matching Index of Cubic Graphs.",
                    "Optimal Oracles for Point-To-Set Principles.",
                    "High Quality Consistent Digital Curved Rays via Vector Field Rounding.",
                    "Sharp Indistinguishability Bounds from Non-Uniform Approximations.",
                    "Analyzing XOR-Forrelation Through Stochastic Calculus."
                ]
            }
        ]
    },
    {
        "year": "2021",
        "name": "38th STACS 2021",
        "info": "Saarbrücken, Germany (Virtual Conference)",
        "venues": [
            {
                "sub_name_abbr": "conf/stacs/2021",
                "sub_name": "38th International Symposium on Theoretical Aspects of Computer Science, STACS 2021, March 16-19, 2021, Saarbrücken, Germany (Virtual Conference).",
                "count": 60,
                "papers": [
                    "Front Matter, Table of Contents, Preface, Conference Organization.",
                    "Optimization, Complexity and Invariant Theory (Invited Talk).",
                    "First-Order Transductions of Graphs (Invited Talk).",
                    "On the Fluted Fragment (Invited Talk).",
                    "Improved (Provable) Algorithms for the Shortest Vector Problem via Bounded Distance Decoding.",
                    "An FPT Algorithm for Elimination Distance to Bounded Degree Graphs.",
                    "A Unified Framework of Quantum Walk Search.",
                    "Achieving Anonymity via Weak Lower Bound Constraints for k-Median and k-Means.",
                    "Bidimensional Linear Recursive Sequences and Universality of Unambiguous Register Automata.",
                    "Tight Approximation Guarantees for Concave Coverage Problems.",
                    "Symmetric Promise Constraint Satisfaction Problems: Beyond the Boolean Case.",
                    "A Characterization of Wreath Products Where Knapsack Is Decidable.",
                    "Synchronizing Strongly Connected Partial DFAs.",
                    "On Euclidean Steiner (1+ε)-Spanners.",
                    "A Nearly Optimal Deterministic Online Algorithm for Non-Metric Facility Location.",
                    "An Asymptotically Fast Polynomial Space Algorithm for Hamiltonicity Detection in Sparse Directed Graphs.",
                    "Online Simple Knapsack with Reservation Costs.",
                    "Inapproximability of Diameter in Super-Linear Time: Beyond the 5/3 Ratio.",
                    "The Approximation Ratio of the 2-Opt Heuristic for the Euclidean Traveling Salesman Problem.",
                    "A Framework of Quantum Strong Exponential-Time Hypotheses.",
                    "The Complexity of the Distributed Constraint Satisfaction Problem.",
                    "Distance Computations in the Hybrid Network Model via Oracle Simulations.",
                    "Simple Multi-Pass Streaming Algorithms for Skyline Points and Extreme Points.",
                    "One-Tape Turing Machine and Branching Program Lower Bounds for MCSP.",
                    "Inference and Mutual Information on Random Factor Graphs.",
                    "The Edit Distance to k-Subsequence Universality.",
                    "Barrington Plays Cards: The Complexity of Card-Based Protocols.",
                    "Round-Competitive Algorithms for Uncertainty Problems with Parallel Queries.",
                    "Church Synthesis on Register Automata over Linearly Ordered Data Domains.",
                    "A Faster Algorithm for Finding Tarski Fixed Points.",
                    "Solving One Variable Word Equations in the Free Group in Cubic Time.",
                    "Diverse Collections in Matroids and Graphs.",
                    "Rice-Like Theorems for Automata Networks.",
                    "Auction Algorithms for Market Equilibrium with Weak Gross Substitute Demands and Their Applications.",
                    "Efficiently Testing Simon's Congruence.",
                    "Finding an Optimal Alphabet Ordering for Lyndon Factorization Is Hard.",
                    "Reachability in Two-Parametric Timed Automata with One Parameter Is EXPSPACE-Complete.",
                    "Refined Notions of Parameterized Enumeration Kernels with Applications to Matching Cut Enumeration.",
                    "Average-Case Algorithms for Testing Isomorphism of Polynomials, Algebras, and Multilinear Forms.",
                    "Geometric Cover with Outliers Removal.",
                    "Parameterised Counting in Logspace.",
                    "Digraph Coloring and Distance to Acyclicity.",
                    "Good r-Divisions Imply Optimal Amortized Decremental Biconnectivity.",
                    "b-Coloring Parameterized by Clique-Width.",
                    "A Ramsey Theorem for Finite Monoids.",
                    "An Improved Sketching Algorithm for Edit Distance.",
                    "Locality Sensitive Hashing for Efficient Similar Polygon Retrieval.",
                    "Binary Matrix Completion Under Diameter Constraints.",
                    "Absorbing Patterns in BST-Like Expression-Trees.",
                    "Cluster Editing Parameterized Above Modification-Disjoint P₃-Packings.",
                    "Exploiting Dense Structures in Parameterized Complexity.",
                    "Subgroup Membership in GL(2, Z).",
                    "Lower Bounds for Graph-Walking Automata.",
                    "An Improved Approximation Algorithm for the Maximum Weight Independent Set Problem in d-Claw Free Graphs.",
                    "Complexity of the List Homomorphism Problem in Hereditary Graph Classes.",
                    "Spectrum Preserving Short Cycle Removal on Regular Graphs.",
                    "Fine-Grained Complexity of the List Homomorphism Problem: Feedback Vertex Set and Cutwidth.",
                    "6-Uniform Maker-Breaker Game Is PSPACE-Complete.",
                    "Resolution with Symmetry Rule Applied to Linear Equations.",
                    "Quantum Approximate Counting with Nonadaptive Grover Iterations."
                ]
            }
        ]
    },
    {
        "year": "2020",
        "name": "37th STACS 2020",
        "info": "Montpellier, France",
        "venues": [
            {
                "sub_name_abbr": "conf/stacs/2020",
                "sub_name": "37th International Symposium on Theoretical Aspects of Computer Science, STACS 2020, March 10-13, 2020, Montpellier, France.",
                "count": 61,
                "papers": [
                    "Front Matter, Table of Contents, Preface, Conference Organization.",
                    "Statistical Physics and Algorithms (Invited Talk).",
                    "Weisfeiler and Leman's Unlikely Journey from Graph Isomorphism to Neural Networks (Invited Talk).",
                    "Computability, Complexity and Programming with Ordinary Differential Equations (Invited Talk).",
                    "Graphical Models: Queries, Complexity, Algorithms (Tutorial).",
                    "Inapproximability Results for Scheduling with Interval and Resource Restrictions.",
                    "An Automaton Group with PSPACE-Complete Word Problem.",
                    "A Trichotomy for Regular Trail Queries.",
                    "Descriptive Complexity on Non-Polish Spaces.",
                    "NP-Completeness, Proof Systems, and Disjoint NP-Pairs.",
                    "String Indexing with Compressed Patterns.",
                    "An FPT Algorithm for Minimum Additive Spanner Problem.",
                    "New Bounds for Randomized List Update in the Paid Exchange Model.",
                    "On Covering Segments with Unit Intervals.",
                    "Decidability and Periodicity of Low Complexity Tilings.",
                    "The Tandem Duplication Distance Is NP-Hard.",
                    "Existential Length Universality.",
                    "On the Termination of Flooding.",
                    "Generalised Pattern Matching Revisited.",
                    "Parameterized Pre-Coloring Extension and List Coloring Problems.",
                    "Oracle Complexity Classes and Local Measurements on Physical Hamiltonians.",
                    "Secret Key Agreement from Correlated Data, with No Prior Information.",
                    "Using Statistical Encoding to Achieve Tree Succinctness Never Seen Before.",
                    "Quantum Distributed Algorithm for Triangle Finding in the CONGEST Model.",
                    "Lower Bounds for Arithmetic Circuits via the Hankel Matrix.",
                    "Solving Vertex Cover in Polynomial Time on Hyperbolic Random Graphs.",
                    "Domino Problem Under Horizontal Constraints.",
                    "Computing Maximum Matchings in Temporal Graphs.",
                    "Tight Bounds for the Cover Times of Random Walks with Heterogeneous Step Lengths.",
                    "Solving Connectivity Problems Parameterized by Treedepth in Single-Exponential Time and Polynomial Space.",
                    "Non-Rectangular Convolutions and (Sub-)Cadences with Three Elements.",
                    "Maximum Matchings in Geometric Intersection Graphs.",
                    "Unambiguous Separators for Tropical Tree Automata.",
                    "Asymptotic Quasi-Polynomial Time Approximation Scheme for Resource Minimization for Fire Containment.",
                    "Streaming Complexity of Spanning Tree Computation.",
                    "Shortest Reconfiguration of Colorings Under Kempe Changes.",
                    "Elimination Distances, Blocking Sets, and Kernels for Vertex Cover.",
                    "Near-Optimal Complexity Bounds for Fragments of the Skolem Problem.",
                    "Efficient Parameterized Algorithms for Computing All-Pairs Shortest Paths.",
                    "Relational Width of First-Order Expansions of Homogeneous Graphs with Bounded Strict Width.",
                    "Succinct Population Protocols for Presburger Arithmetic.",
                    "A Sub-Quadratic Algorithm for the Longest Common Increasing Subsequence Problem.",
                    "Fixed-Parameter Algorithms for Unsplittable Flow Cover.",
                    "Identifiability of Graphs with Small Color Classes by the Weisfeiler-Leman Algorithm.",
                    "Better Approximations for General Caching and UFP-Cover Under Resource Augmentation.",
                    "Improved Bounds on Fourier Entropy and Min-Entropy.",
                    "Information Distance Revisited.",
                    "On Computing Multilinear Polynomials Using Multi-r-ic Depth Four Circuits.",
                    "Observation and Distinction. Representing Information in Infinite Games.",
                    "How Fast Can You Escape a Compact Polytope?",
                    "The SDP Value for Random Two-Eigenvalue CSPs.",
                    "Asymptotic Divergences and Strong Dichotomy.",
                    "Perfect Resolution of Conflict-Free Colouring of Interval Hypergraphs.",
                    "Constant-Time Dynamic (Δ+1)-Coloring.",
                    "Cryptocurrency Mining Games with Economic Discount and Decreasing Rewards.",
                    "Randomness and Initial Segment Complexity for Probability Measures.",
                    "Computing Shrub-Depth Decompositions.",
                    "Typical Sequences Revisited - Computing Width Parameters of Graphs.",
                    "Grundy Coloring & Friends, Half-Graphs, Bicliques.",
                    "Lower Bounds Against Sparse Symmetric Functions of ACC Circuits: Expanding the Reach of #SAT Algorithms.",
                    "Reversible Pebble Games and the Relation Between Tree-Like and General Resolution Space."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "36th STACS 2019",
        "info": "Berlin, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/stacs/2019",
                "sub_name": "36th International Symposium on Theoretical Aspects of Computer Science, STACS 2019, March 13-16, 2019, Berlin, Germany.",
                "count": 60,
                "papers": [
                    "Front Matter, Table of Contents, Preface, Conference Organization.",
                    "Computational Complexity and Partition Functions (Invited Talk).",
                    "The Many Facets of String Transducers (Invited Talk).",
                    "Algorithmic Data Science (Invited Talk).",
                    "Fine-Grained Complexity Theory (Tutorial).",
                    "From Graph Theory to Network Science: The Natural Emergence of Hyperbolicity (Tutorial).",
                    "The Semialgebraic Orbit Problem.",
                    "Best-Of-Two-Worlds Analysis of Online Search.",
                    "Bipartite Diameter and Other Measures Under Translation.",
                    "Solving Simple Stochastic Games with Few Random Nodes Faster Using Bland's Rule.",
                    "Distributed Coloring of Graphs with an Optimal Number of Colors.",
                    "On the Descriptive Complexity of Color Coding.",
                    "Bounding Quantum-Classical Separations for Classes of Nonlocal Games.",
                    "Token Sliding on Split Graphs.",
                    "Building Strategies into QBF Proofs.",
                    "Tight Analysis of the Smartstart Algorithm for Online Dial-a-Ride on the Line.",
                    "Enumerating Minimal Dominating Sets in Triangle-Free Graphs.",
                    "Sparsification of Binary CSPs.",
                    "Tractable QBF by Knowledge Compilation.",
                    "A Tight Extremal Bound on the Lovász Cactus Number in Planar Graphs.",
                    "Average-Case Completeness in Tag Systems.",
                    "Pairwise Preferences in the Stable Marriage Problem.",
                    "Closure Properties of Synchronized Relations.",
                    "Resource-Bounded Kolmogorov Complexity Provides an Obstacle to Soficness of Multidimensional Shifts.",
                    "Constant-Time Retrieval with O(log m) Extra Bits.",
                    "Complexity of the Steiner Network Problem with Respect to the Number of Terminals.",
                    "Space Lower Bounds for the Signal Detection Problem.",
                    "Progressive Algorithms for Domination and Independence.",
                    "Modification to Planarity is Fixed Parameter Tractable.",
                    "Visibly Pushdown Languages over Sliding Windows.",
                    "Fast and Longest Rollercoasters.",
                    "Wealth Inequality and the Price of Anarchy.",
                    "Lean Tree-Cut Decompositions: Obstructions and Algorithms.",
                    "Dispersing Obnoxious Facilities on a Graph.",
                    "Reachability in O(log n) Genus Graphs is in Unambiguous Logspace.",
                    "Dominating Sets and Connected Dominating Sets in Dynamic Graphs.",
                    "On Kernelization for Edge Dominating Set under Structural Parameters.",
                    "Compressed Decision Problems in Hyperbolic Groups.",
                    "How to Secure Matchings Against Edge Failures.",
                    "A Deterministic Polynomial Kernel for Odd Cycle Transversal and Vertex Multiway Cut in Planar Graphs.",
                    "A Characterization of Subshifts with Computable Language.",
                    "Lower Bounds for DeMorgan Circuits of Bounded Negation Width.",
                    "Depth First Search in the Semi-streaming Model.",
                    "On Finite Monoids over Nonnegative Integer Matrices and Short Killing Words.",
                    "Tight Complexity Lower Bounds for Integer Linear Programming with Few Constraints.",
                    "The Set Cover Conjecture and Subgraph Isomorphism with a Tree Pattern.",
                    "Algorithmic Properties of Sparse Digraphs.",
                    "Tree Automata with Global Constraints for Infinite Trees.",
                    "Constructive Discrepancy Minimization with Hereditary L2 Guarantees.",
                    "Quantum Advantage for the LOCAL Model in Distributed Computing.",
                    "Lifting Theorems for Equality.",
                    "Car-Sharing on a Star Network: On-Line Scheduling with k Servers.",
                    "Beyond Boolean Surjective VCSPs.",
                    "The Containment Problem for Unambiguous Register Automata.",
                    "Stabilization Time in Weighted Minority Processes.",
                    "Finite Sequentiality of Unambiguous Max-Plus Tree Automata.",
                    "Paging with Dynamic Memory Capacity.",
                    "Random Noise Increases Kolmogorov Complexity and Hausdorff Dimension.",
                    "A Unified Approach to Tail Estimates for Randomized Incremental Construction.",
                    "A ZPPNP[1] Lifting Theorem."
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "35th STACS 2018",
        "info": "Caen, France",
        "venues": [
            {
                "sub_name_abbr": "conf/stacs/2018",
                "sub_name": "35th Symposium on Theoretical Aspects of Computer Science, STACS 2018, February 28 to March 3, 2018, Caen, France.",
                "count": 59,
                "papers": [
                    "Front Matter, Table of Contents, Preface, Conference Organization.",
                    "Recursive Combinatorial Structures: Enumeration, Probabilistic Analysis and Random Generation.",
                    "Lower Bound Techniques for QBF Proof Systems.",
                    "On the Positive Calculus of Relations with Transitive Closure.",
                    "The Open Shop Scheduling Problem.",
                    "Approximating Airports and Railways.",
                    "Property Testing for Bounded Degree Databases.",
                    "Erdös-Pósa Property of Obstructions to Interval Graphs.",
                    "All Classical Adversary Methods are Equivalent for Total Functions.",
                    "Computing Hitting Set Kernels By AC^0-Circuits.",
                    "Parameterized (Approximate) Defective Coloring.",
                    "The Relation between Polynomial Calculus, Sherali-Adams, and Sum-of-Squares Proofs.",
                    "Genuine Lower Bounds for QBF Expansion.",
                    "Efficient Oracles and Routing Schemes for Replacement Paths.",
                    "On the Tree Conjecture for the Network Creation Game.",
                    "On Low for Speed Oracles.",
                    "Large Flocks of Small Birds: on the Minimal Size of Population Protocols.",
                    "Communicating Finite-State Machines and Two-Variable Logic.",
                    "On Approximating the Stationary Distribution of Time-reversible Markov Chains.",
                    "On Singleton Arc Consistency for CSPs Defined by Monotone Patterns.",
                    "The Firing Squad Problem Revisited.",
                    "Small-depth Multilinear Formula Lower Bounds for Iterated Matrix Multiplication, with Applications.",
                    "Upper and Lower Bounds for Dynamic Data Structures on Strings.",
                    "Lower Bounds for Combinatorial Algorithms for Boolean Matrix Multiplication.",
                    "Solving the Rubik's Cube Optimally is NP-complete.",
                    "Approximation Algorithms for Scheduling with Resource and Precedence Constraints.",
                    "Parameterized Approximation Schemes for Steiner Trees with Small Number of Steiner Vertices.",
                    "Finding List Homomorphisms from Bounded-treewidth Graphs to Reflexive Graphs: a Complete Complexity Characterization.",
                    "Small Resolution Proofs for QBF using Dependency Treewidth.",
                    "Lossy Kernels for Connected Dominating Set on Sparse Graphs.",
                    "The Intersection Problem for Finite Monoids.",
                    "Automata Theory on Sliding Windows.",
                    "Knapsack Problems for Wreath Products.",
                    "On Structural Parameterizations of the Bounded-Degree Vertex Deletion Problem.",
                    "Dependences in Strategy Logic.",
                    "Colouring Square-Free Graphs without Long Induced Paths.",
                    "Optimal Dislocation with Persistent Errors in Subquadratic Time.",
                    "An Improved Bound for Random Binary Search Trees with Concurrent Insertions.",
                    "String Periods in the Order-Preserving Model.",
                    "Beyond JWP: A Tractable Class of Binary VCSPs via M-Convex Intersection.",
                    "Nonuniform Reductions and NP-Completeness.",
                    "On the Power of Tree-Depth for Fully Polynomial FPT Algorithms.",
                    "A Unified Polynomial-Time Algorithm for Feedback Vertex Set on Graphs of Bounded Mim-Width.",
                    "Generalizing the Kawaguchi-Kyan Bound to Stochastic Parallel Machine Scheduling.",
                    "Space-Efficient Algorithms for Longest Increasing Subsequence.",
                    "Rational, Recognizable, and Aperiodic Sets in the Partially Lossy Queue Monoid.",
                    "Relations Between Greedy and Bit-Optimal LZ77 Encodings.",
                    "Width of Non-deterministic Automata.",
                    "Computing the Longest Common Prefix of a Context-free Language in Polynomial Time.",
                    "Surjective H-Colouring over Reflexive Digraphs.",
                    "Pumping Lemmas for Weighted Automata.",
                    "Closure of Resource-Bounded Randomness Notions Under Polynomial-Time Permutations.",
                    "Succinct Oblivious RAM.",
                    "Recursion Schemes and the WMSO+U Logic.",
                    "Sums of Palindromes: an Approach via Automata.",
                    "On the Containment Problem for Linear Sets.",
                    "Improving the Upper Bound on the Length of the Shortest Reset Word.",
                    "Power of Uninitialized Qubits in Shallow Quantum Circuits.",
                    "Lower Bounds on Black-Box Reductions of Hitting to Density Estimation."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "34th STACS 2017",
        "info": "Hannover, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/stacs/2017",
                "sub_name": "34th Symposium on Theoretical Aspects of Computer Science, STACS 2017, March 8-11, 2017, Hannover, Germany.",
                "count": 59,
                "papers": [
                    "Front Matter, Table of Contents, Foreword, Conference Organization, External Reviewers.",
                    "Computational Aspects of Logics in Team Semantics (Tutorial).",
                    "Recompression: New Approach to Word Equations and Context Unification (Invited Talk).",
                    "Discrete Logarithms in Small Characteristic Finite Fields: a Survey of Recent Advances (Invited Talk).",
                    "Applications of Algorithmic Metatheorems to Space Complexity and Parallelism (Invited Talk).",
                    "Split Contraction: The Untold Story.",
                    "The Operator Approach to Entropy Games.",
                    "Parameterized Complexity of Small Weight Automorphisms.",
                    "What Can Be Verified Locally?.",
                    "Improved Time-Space Trade-Offs for Computing Voronoi Diagrams.",
                    "Energy-Efficient Delivery by Heterogeneous Mobile Agents.",
                    "Towards Tighter Space Bounds for Counting Triangles and Other Substructures in Graph Streams.",
                    "On Polynomial Approximations Over Z/2^kZ*.",
                    "Existential-R-Complete Decision Problems about Symmetric Nash Equilibria in Symmetric Multi-Player Games.",
                    "On Büchi One-Counter Automata.",
                    "Optimizing Tree Decompositions in MSO.",
                    "Complexity of Token Swapping and its Variants.",
                    "Monte Carlo Computability.",
                    "The Parameterized Complexity of Finding a 2-Sphere in a Simplicial Complex.",
                    "On Long Words Avoiding Zimin Patterns.",
                    "Extended Learning Graphs for Triangle Finding.",
                    "Lower Bounds for Elimination via Weak Regularity.",
                    "Parameterized and Approximation Results for Scheduling with a Low Rank Processing Time Matrix.",
                    "Fractional Coverings, Greedy Coverings, and Rectifier Networks.",
                    "Separability of Reachability Sets of Vector Addition Systems.",
                    "Counting Edge-Injective Homomorphisms and Matchings on Restricted Graph Classes.",
                    "Robust and Adaptive Search.",
                    "Graphic TSP in Cubic Graphs.",
                    "Independent Sets near the Lower Bound in Bounded Degree Graphs.",
                    "Semialgebraic Invariant Synthesis for the Kannan-Lipton Orbit Problem.",
                    "The First-Order Logic of Hyperproperties.",
                    "Improving and Extending the Testing of Distributions for Shape-Restricted Properties.",
                    "Matrix Rigidity from the Viewpoint of Parameterized Complexity.",
                    "Deterministic Regular Expressions with Back-References.",
                    "On the Decomposition of Finite-Valued Streaming String Transducers.",
                    "Circuit Evaluation for Finite Semirings.",
                    "Combining Treewidth and Backdoors for CSP.",
                    "On the Complexity of Partial Derivatives.",
                    "Set Membership with Non-Adaptive Bit Probes.",
                    "Pro-Aperiodic Monoids via Saturated Models.",
                    "Trimming and Gluing Gray Codes.",
                    "Mixing of Permutations by Biased Transposition.",
                    "Efficient Quantum Walk on the Grid with Multiple Marked Elements.",
                    "On OBDD-Based Algorithms and Proof Systems That Dynamically Change Order of Variables.",
                    "Multiple Random Walks on Paths and Grids.",
                    "On the Size of Lempel-Ziv and Lyndon Factorizations.",
                    "Voting and Bribing in Single-Exponential Time.",
                    "A Complexity Dichotomy for Poset Constraint Satisfaction.",
                    "Structural Properties and Constant Factor-Approximation of Strong Distance-r Dominating Sets in Sparse Directed Graphs.",
                    "Computing Majority by Constant Depth Majority Circuits with Low Fan-in Gates.",
                    "Minkowski Games.",
                    "On the Sensitivity Complexity of k-Uniform Hypergraph Properties.",
                    "The Complexity of Knapsack in Graph Groups.",
                    "Algorithmic Information, Plane Kakeya Sets, and Conditional Dimension.",
                    "On the Synchronisation Problem over Cellular Automata.",
                    "Word Equations Where a Power Equals a Product of Powers.",
                    "Improved Distance Queries and Cycle Counting by Frobenius Normal Form.",
                    "Lower Bounds on Key Derivation for Square-Friendly Applications.",
                    "List Approximation for Increasing Kolmogorov Complexity."
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "33rd STACS 2016",
        "info": "Orléans, France",
        "venues": [
            {
                "sub_name_abbr": "conf/stacs/2016",
                "sub_name": "33rd Symposium on Theoretical Aspects of Computer Science, STACS 2016, February 17-20, 2016, Orléans, France.",
                "count": 59,
                "papers": [
                    "Front Matter, Foreword, Conference Organization, External Reviewers, Table of Contents.",
                    "Ideal Decompositions for Vector Addition Systems (Invited Talk).",
                    "Complexity and Expressive Power of Ontology-Mediated Queries (Invited Talk).",
                    "Fine-Grained Algorithms and Complexity (Invited Talk).",
                    "Tutorial on Cellular Automata and Tilings (Tutorial).",
                    "Graph Reconstruction with a Betweenness Oracle.",
                    "Airports and Railways: Facility Location Meets Network Design.",
                    "Simultaneous Feedback Vertex Set: A Parameterized Perspective.",
                    "On Regularity of Unary Probabilistic Automata.",
                    "The Expanding Search Ratio of a Graph.",
                    "Derandomizing Isolation Lemma for K3, 3-free and K5-free Bipartite Graphs.",
                    "Entropy Games and Matrix Multiplication Games.",
                    "Good Predictions Are Worth a Few Comparisons.",
                    "Dense Subset Sum May Be the Hardest.",
                    "Computing the L1 Geodesic Diameter and Center of a Polygonal Domain.",
                    "Are Short Proofs Narrow? QBF Resolution is not Simple.",
                    "Faster Algorithms for the Constrained k-Means Problem.",
                    "A Catalog of EXISTS-R-Complete Decision Problems About Nash Equilibria in Multi-Player Games.",
                    "Multiple-Edge-Fault-Tolerant Approximate Shortest-Path Trees.",
                    "On a Fragment of AMSO and Tiling Systems.",
                    "The Complexity of Phylogeny Constraint Satisfaction.",
                    "The MSO+U Theory of (N, <) Is Undecidable.",
                    "Time-Approximation Trade-offs for Inapproximable Problems.",
                    "External Memory Three-Sided Range Reporting and Top-k Queries with Sublogarithmic Updates.",
                    "Catalytic Space: Non-determinism and Hierarchy.",
                    "Testing Shape Restrictions of Discrete Distributions.",
                    "Deciding Circular-Arc Graph Isomorphism in Parameterized Logspace.",
                    "Bottleneck Paths and Trees and Deterministic Graphical Games.",
                    "Packing Groups of Items into Multiple Knapsacks.",
                    "Cost Functions Definable by Min/Max Automata.",
                    "Varieties of Cost Functions.",
                    "Kernelization and Sparseness: the Case of Dominating Set.",
                    "Canonizing Graphs of Bounded Tree Width in Logspace.",
                    "Preprocessing Under Uncertainty.",
                    "Characterisation of an Algebraic Algorithm for Probabilistic Automata.",
                    "Semantic Versus Syntactic Cutting Planes.",
                    "Editing to Connected f-Degree Graph.",
                    "Sub-exponential Approximation Schemes for CSPs: From Dense to Almost Sparse.",
                    "The Complexity of the Hamilton Cycle Problem in Hypergraphs of High Minimum Codegree.",
                    "Efficiently Finding All Maximal alpha-gapped Repeats.",
                    "On the Number of Lambda Terms With Prescribed Size of Their De Bruijn Representation.",
                    "Tightening the Complexity of Equivalence Problems for Commutative Grammars.",
                    "Autoreducibility of NP-Complete Sets.",
                    "A Randomized Polynomial Kernel for Subset Feedback Vertex Set.",
                    "Periods and Borders of Random Words.",
                    "Constrained Bipartite Vertex Cover: The Easy Kernel is Essentially Tight.",
                    "Separation Between Read-once Oblivious Algebraic Branching Programs (ROABPs) and Multilinear Depth Three Circuits.",
                    "Towards an Atlas of Computational Learning Theory.",
                    "Quantum Query Complexity of Subgraph Isomorphism and Homomorphism.",
                    "Faster Exact and Parameterized Algorithm for Feedback Vertex Set in Tournaments.",
                    "Knapsack in Graph Groups, HNN-Extensions and Amalgamated Products.",
                    "FPTAS for Hardcore and Ising Models on Hypergraphs.",
                    "Efficient Enumeration of Solutions Produced by Closure Operations.",
                    "Copyless Cost-Register Automata: Structure, Expressiveness, and Closure Properties.",
                    "Algorithmic Statistics, Prediction and Machine Learning.",
                    "Polynomial Kernels for Deletion to Classes of Acyclic Digraphs.",
                    "Size-Treewidth Tradeoffs for Circuits Computing the Element Distinctness Function.",
                    "On Space Efficiency of Algorithms Working on Structural Decompositions of Graphs.",
                    "Improved Approximation Algorithms for Balanced Partitioning Problems."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "32nd STACS 2015",
        "info": "Garching, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/stacs/2015",
                "sub_name": "32nd International Symposium on Theoretical Aspects of Computer Science, STACS 2015, March 4-7, 2015, Garching, Germany.",
                "count": 61,
                "papers": [
                    "Front Matter, Table of Contents, Preface, Conference Organization.",
                    "Overcoming Intractability in Unsupervised Learning (Invited Talk).",
                    "The Complexity of Constraint Satisfaction Problems (Invited Talk).",
                    "Parallel Algorithms Reconsidered (Invited Talk).",
                    "Computational Social Choice (Tutorial).",
                    "Algorithmic Game Theory (Tutorial).",
                    "The Minimum Oracle Circuit Size Problem.",
                    "Graph Searching Games and Width Measures for Directed Graphs.",
                    "Subset Sum in the Absence of Concentration.",
                    "On Sharing, Memoization, and Polynomial Time.",
                    "Proof Complexity of Resolution-based QBF Calculi.",
                    "Welfare Maximization with Friends-of-Friends Network Externalities.",
                    "Markov Decision Processes and Stochastic Games with Total Effective Payoff.",
                    "Advice Complexity for a Class of Online Problems.",
                    "Las Vegas Computability and Algorithmic Randomness.",
                    "Understanding Model Counting for beta-acyclic CNF-formulas.",
                    "Parameterized Complexity Dichotomy for Steiner Multicut.",
                    "Solving Totally Unimodular LPs with the Shadow Vertex Algorithm.",
                    "Improved Local Search for Geometric Hitting Set.",
                    "Arc Diagrams, Flip Distances, and Hamiltonian Triangulations.",
                    "Tractable Probabilistic mu-Calculus That Expresses Probabilistic Temporal Logics.",
                    "Tribes Is Hard in the Message Passing Model.",
                    "Network Design Problems with Bounded Distances via Shallow-Light Steiner Trees.",
                    "Combinatorial Expressions and Lower Bounds.",
                    "Construction of mu-Limit Sets of Two-dimensional Cellular Automata.",
                    "Derandomized Graph Product Results Using the Low Degree Long Code.",
                    "Space-efficient Basic Graph Algorithms.",
                    "Pattern Matching with Variables: Fast Algorithms and New Hardness Results.",
                    "Approximating the Generalized Terminal Backup Problem via Half-integral Multiflow Relaxation.",
                    "On Matrix Powering in Low Dimensions.",
                    "The Complexity of Recognizing Unique Sink Orientations.",
                    "New Geometric Representations and Domination Problems on Tolerance and Multitolerance Graphs.",
                    "Comparing 1D and 2D Real Time on Cellular Automata.",
                    "Tropical Effective Primary and Dual Nullstellens\"atze.",
                    "Upper Tail Estimates with Combinatorial Proofs.",
                    "Minimum Cost Flows in Graphs with Unit Capacities.",
                    "Inductive Inference and Reverse Mathematics.",
                    "Dynamic Planar Embeddings of Dynamic Graphs.",
                    "On the Information Carried by Programs about the Objects They Compute.",
                    "Communication Complexity of Approximate Matching in Distributed Graphs.",
                    "Stochastic Scheduling of Heavy-tailed Jobs.",
                    "On Finding the Adams Consensus Tree.",
                    "Flip Distance Is in FPT Time O(n+ k * c^k).",
                    "New Pairwise Spanners.",
                    "Multi-k-ic Depth Three Circuit Lower Bound.",
                    "Automorphism Groups of Geometrically Represented Graphs.",
                    "Correlation Clustering and Two-edge-connected Augmentation for Planar Graphs.",
                    "Extended Formulation Lower Bounds via Hypergraph Coloring?.",
                    "Lempel-Ziv Factorization May Be Harder Than Computing All Runs.",
                    "Visibly Counter Languages and Constant Depth Circuits.",
                    "Optimal Decremental Connectivity in Planar Graphs.",
                    "Testing Small Set Expansion in General Graphs.",
                    "Paid Exchanges are Worth the Price.",
                    "Undecidability in Binary Tag Systems and the Post Correspondence Problem for Five Pairs of Words.",
                    "Separation and the Successor Relation.",
                    "Computing 2-Walks in Polynomial Time.",
                    "Towards an Isomorphism Dichotomy for Hereditary Graph Classes.",
                    "Existential Second-order Logic over Graphs: A Complete Complexity-theoretic Classification.",
                    "The Returning Secretary.",
                    "Homomorphism Reconfiguration via Homotopy.",
                    "Computing Downward Closures for Stacked Counter Automata."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "31st STACS 2014",
        "info": "Lyon, France",
        "venues": [
            {
                "sub_name_abbr": "conf/stacs/2014",
                "sub_name": "31st International Symposium on Theoretical Aspects of Computer Science (STACS 2014), STACS 2014, March 5-8, 2014, Lyon, France.",
                "count": 59,
                "papers": [
                    "Frontmatter, Table of Contents, Preface, Conference Organization.",
                    "Keeping a Crowd Safe: On the Complexity of Parameterized Verification (Invited Talk).",
                    "Semi-algebraic geometry in computational game theory - a consumer's perspective (Invited Talk).",
                    "A glimpse on constant delay enumeration (Invited Talk).",
                    "Arithmetic Circuit Complexity (Tutorial).",
                    "Submodular Stochastic Probing on Matroids.",
                    "On Symmetric Circuits and Fixed-Point Logics.",
                    "Throughput Maximization in the Speed-Scaling Setting.",
                    "Efficient Computation of Optimal Energy and Fractional Weighted Flow Trade-off Schedules.",
                    "Weighted Coloring in Trees.",
                    "Generalized Reordering Buffer Management.",
                    "Shapley meets Shapley.",
                    "Complexity classes on spatially periodic Cellular Automata.",
                    "Asymmetry of the Kolmogorov complexity of online predicting odd and even bits.",
                    "Two-Page Book Embeddings of 4-Planar Graphs.",
                    "Palindrome Recognition In The Streaming Model.",
                    "New Bounds and Extended Relations Between Prefix Arrays, Border Arrays, Undirected Graphs, and Indeterminate Strings.",
                    "Online Bin Packing with Advice.",
                    "Balls into bins via local search: cover time and maximum load.",
                    "Meet Your Expectations With Guarantees: Beyond Worst-Case Synthesis in Quantitative Games.",
                    "Chordal Editing is Fixed-Parameter Tractable.",
                    "Online Dynamic Power Management with Hard Real-Time Guarantees.",
                    "Depth-4 Lower Bounds, Determinantal Complexity: A Unified Approach.",
                    "Constant Factor Approximation for Capacitated k-Center with Outliers.",
                    "Bounds on the Cover Time of Parallel Rotor Walks.",
                    "Packing a Knapsack of Unknown Capacity.",
                    "Exploring Subexponential Parameterized Complexity of Completion Problems.",
                    "From Small Space to Small Width in Resolution.",
                    "Explicit Linear Kernels via Dynamic Programming.",
                    "Partition Expanders.",
                    "Testing Generalised Freeness of Words.",
                    "Counting Homomorphisms to Cactus Graphs Modulo 2.",
                    "Irreversible computable functions.",
                    "Ehrenfeucht-Fraïssé Games on Omega-Terms.",
                    "Faster Sparse Suffix Sorting.",
                    "Generalized Wong sequences and their applications to Edmonds' problems.",
                    "Read-Once Branching Programs for Tree Evaluation Problems.",
                    "Computability of the entropy of one-tape Turing machines.",
                    "Computing Optimal Tolls with Arc Restrictions and Heterogeneous Players.",
                    "Approximation of smallest linear tree grammar.",
                    "Coloring 3-colorable graphs with o(n^{1/5}) colors.",
                    "Randomized Online Algorithms with High Probability Guarantees.",
                    "An optimal quantum algorithm for the oracle identification problem.",
                    "A Solution to Wiehagen's Thesis.",
                    "Space-Efficient String Indexing for Wildcard Pattern Matching.",
                    "Synchronizing Relations on Words.",
                    "On Boolean closed full trios and rational Kripke frames.",
                    "Everything you always wanted to know about the parameterized complexity of Subgraph Isomorphism (but were afraid to ask).",
                    "Data-Oblivious Data Structures.",
                    "Higher randomness and forcing with closed sets.",
                    "Near-Optimal Generalisations of a Theorem of Macbeath.",
                    "Non-autoreducible Sets for NEXP.",
                    "Differentiability of polynomial time computable functions.",
                    "2-Stack Sorting is polynomial.",
                    "Communication Lower Bounds for Distributed-Memory Computations.",
                    "Stochastic Scheduling on Unrelated Machines.",
                    "Computational Complexity of the Extended Minimum Cost Homomorphism Problem on Three-Element Domains.",
                    "The Complexity of Deciding Statistical Properties of Samplable Distributions.",
                    "Faster Compact On-Line Lempel-Ziv Factorization."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "30th STACS 2013",
        "info": "Kiel, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/stacs/2013",
                "sub_name": "30th International Symposium on Theoretical Aspects of Computer Science, STACS 2013, February 27 - March 2, 2013, Kiel, Germany.",
                "count": 60,
                "papers": [
                    "Frontmatter, Table of Contents, Preface, Workshop Organization.",
                    "The complexity of analyzing infinite-state Markov chains, Markov decision processes, and stochastic games (Invited talk).",
                    "Graph coloring, communication complexity and the stubborn problem (Invited talk).",
                    "Physarum Computations (Invited talk).",
                    "Algorithmic Graph Structure Theory (Tutorial).",
                    "Searching for better fill-in.",
                    "Probably Optimal Graph Motifs.",
                    "Tight bounds for Parameterized Complexity of Cluster Editing.",
                    "Bounded-width QBF is PSPACE-complete.",
                    "Model Counting for CNF Formulas of Bounded Modular Treewidth.",
                    "Backdoors to q-Horn.",
                    "On Polynomial Kernels for Sparse Integer Linear Programs.",
                    "Linear kernels for (connected) dominating set on graphs with excluded topological subgraphs.",
                    "The PCP theorem for NP over the reals.",
                    "Mutual Dimension.",
                    "Exact and Approximation Algorithms for the Maximum Constraint Satisfaction Problem over the Point Algebra.",
                    "Local Search is Better than Random Assignment for Bounded Occurrence Ordering k-CSPs.",
                    "The complexity of approximating conservative counting CSPs.",
                    "Lossy Chains and Fractional Secret Sharing.",
                    "Two Hands Are Better Than One (up to constant factors): Self-Assembly In The 2HAM vs. aTAM.",
                    "Unlabeled Data Does Provably Help.",
                    "Computing cutwidth and pathwidth of semi-complete digraphs via degree orderings.",
                    "On Pairwise Spanners.",
                    "Excluded vertex-minors for graphs of linear rank-width at most k.",
                    "Recompression: a simple and powerful technique for word equations.",
                    "Fast Algorithms for Abelian Periods in Words and Greatest Common Divisor Queries.",
                    "Finding Pseudo-repetitions.",
                    "Algorithms for Designing Pop-Up Cards.",
                    "Space-Time Trade-offs for Stack-Based Algorithms.",
                    "L_1 Shortest Path Queries among Polygonal Obstacles in the Plane.",
                    "Quantifier Alternation in Two-Variable First-Order Logic with Successor Is Decidable.",
                    "FO^2 with one transitive relation is decidable.",
                    "Two-variable first order logic with modular predicates over words.",
                    "Abusing the Tutte Matrix: An Algebraic Instance Compression for the K-set-cycle Problem.",
                    "Subexponential-Time Parameterized Algorithm for Steiner Tree on Planar Graphs.",
                    "The arithmetic complexity of tensor contractions.",
                    "Search versus Decision for Election Manipulation Problems.",
                    "Improved Bounds for Online Preemptive Matching.",
                    "Parameterized Matching in the Streaming Model.",
                    "Popular Matchings: Structure and Cheating Strategies.",
                    "Fooling One-Sided Quantum Protocols.",
                    "Explicit relation between all lower bound techniques for quantum query complexity.",
                    "Optimal quantum query bounds for almost all Boolean functions.",
                    "Streaming Complexity of Checking Priority Queues.",
                    "Deterministic algorithms for skewed matrix products.",
                    "The Simulated Greedy Algorithm for Several Submodular Matroid Secretary Problems.",
                    "Hardness of Conjugacy, Embedding and Factorization of multidimensional Subshifts of Finite Type.",
                    "The finiteness of a group generated by a 2-letter invertible-reversible Mealy automaton is decidable.",
                    "Mortality of Iterated Piecewise Affine Functions over the Integers: Decidability and Complexity (extended abstract).",
                    "On the practically interesting instances of MAXCUT.",
                    "First Fit bin packing: A tight analysis.",
                    "Constrained Binary Identification Problem.",
                    "Regular languages of thin trees.",
                    "Approximate comparison of distance automata.",
                    "The Rank of Tree-Automatic Linear Orderings.",
                    "A general framework for the realistic analysis of sorting and searching algorithms. Application to some popular algorithms.",
                    "Search using queries on indistinguishable items.",
                    "Pebbling, Entropy and Branching Program Size Lower Bounds.",
                    "Advice Lower Bounds for the Dense Model Theorem.",
                    "Author Index."
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "29th STACS 2012",
        "info": "Paris, France",
        "venues": [
            {
                "sub_name_abbr": "conf/stacs/2012",
                "sub_name": "29th International Symposium on Theoretical Aspects of Computer Science, STACS 2012, February 29th - March 3rd, 2012, Paris, France.",
                "count": 59,
                "papers": [
                    "Frontmatter, Foreword, Conference Organization, External Reviewers, Table of Contents.",
                    "Forms of Determinism for Automata (Invited Talk).",
                    "Iterative Methods in Combinatorial Optimization (Invited Talk).",
                    "On Randomness in Hash Functions (Invited Talk).",
                    "Pseudo-deterministic Algorithms (Invited Talk).",
                    "13/9-approximation for Graphic TSP.",
                    "A (k+3)/2-approximation algorithm for monotone submodular k-set packing and general k-exchange systems.",
                    "A Pumping Lemma for Pushdown Graphs of Any Level.",
                    "Algorithmic Meta Theorems for Circuit Classes of Constant and Logarithmic Depth.",
                    "An Approximation Algorithm for #k-SAT.",
                    "Asymptotic enumeration of Minimal Automata.",
                    "Balanced Partitions of Trees and Applications.",
                    "Cache-Oblivious Implicit Predecessor Dictionaries with the Working-Set Property.",
                    "Chernoff-Hoeffding Bounds for Markov Chains: Generalized and Simplified.",
                    "Compressed Membership for NFA (DFA) with Compressed Labels is in NP (P).",
                    "Concurrency Makes Simple Theories Hard.",
                    "Conflict-free Chromatic Art Gallery Coverage.",
                    "Constant compression and random weights.",
                    "Contraction checking in graphs on surfaces.",
                    "Distribution of the number of accessible states in a random deterministic automaton.",
                    "Edge-disjoint Odd Cycles in 4-edge-connected Graphs.",
                    "Efficient algorithms for highly compressed data: The Word Problem in Higman's group is in P.",
                    "Efficiently Decodable Compressed Sensing by List-Recoverable Codes and Recursion.",
                    "Ehrenfeucht-Fraïssé goes elementarily automatic for structures of bounded degree.",
                    "Improved Bounds for Bipartite Matching on Surfaces.",
                    "Improved Spectral Sparsification and Numerical Algorithms for SDD Matrices.",
                    "Linear min-max relation between the treewidth of H-minor-free graphs and its largest grid.",
                    "Linear-Space Data Structures for Range Mode Query in Arrays.",
                    "Log-supermodular functions, functional clones and counting CSPs.",
                    "Low Randomness Rumor Spreading via Hashing.",
                    "Lower Bounds on the Complexity of MSO_1 Model-Checking.",
                    "LP can be a cure for Parameterized Problems.",
                    "Mind Change Speed-up for Learning Languages from Positive Data.",
                    "Monomials in arithmetic circuits: Complete problems in the counting hierarchy.",
                    "Motion planning with pulley, rope, and baskets.",
                    "On Computing Pareto Stable Assignments.",
                    "On the separation question for tree languages.",
                    "On the treewidth and related parameters of random geometric graphs.",
                    "Optimizing Linear Functions with Randomized Search Heuristics - The Robustness of Mutation.",
                    "Parameterized Complexity of Connected Even/Odd Subgraph Problems.",
                    "Playing Mastermind With Constant-Size Memory.",
                    "Polynomial-time Isomorphism Test for Groups with Abelian Sylow Towers.",
                    "Preemptive and Non-Preemptive Generalized Min Sum Set Cover.",
                    "Randomized Communication Complexity for Linear Algebra Problems over Finite Fields.",
                    "Regular tree languages, cardinality predicates, and addition-invariant FO.",
                    "Simpler Approximation of the Maximum Asymmetric Traveling Salesman Problem.",
                    "Stabilization of Branching Queueing Networks.",
                    "Stronger Lower Bounds and Randomness-Hardness Trade-Offs Using Associated Algebraic Complexity Classes.",
                    "Surface Split Decompositions and Subgraph Isomorphism in Graphs on Surfaces.",
                    "The Denjoy alternative for computable functions.",
                    "The Determinacy of Context-Free Games.",
                    "The dimension of ergodic random sequences.",
                    "The Field of Reals is not omega-Automatic.",
                    "The Limits of Decidability for First Order Logic on CPDA Graphs.",
                    "The Power of Local Search: Maximum Coverage over a Matroid.",
                    "Trichotomy for Integer Linear Systems Based on Their Sign Patterns.",
                    "Tying up the loose ends in fully LZW-compressed pattern matching.",
                    "Variable time amplitude amplification and quantum algorithms for linear algebra problems.",
                    "Weak MSO+U over infinite trees."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "28th STACS 2011",
        "info": "Dortmund, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/stacs/2011",
                "sub_name": "28th International Symposium on Theoretical Aspects of Computer Science, STACS 2011, March 10-12, 2011, Dortmund, Germany.",
                "count": 58,
                "papers": [
                    "Frontmatter, Table of Contents, Preface, Conference Organization.",
                    "Algorithms for Dynamic Speed Scaling.",
                    "Structural Decomposition Methods and What They are Good For.",
                    "How to prove security of communication protocols? A discussion on the soundness of formal models w.r.t. computational ones.",
                    "Local dependency dynamic programming in the presence of memory faults.",
                    "Tight bounds for rumor spreading in graphs of a given conductance.",
                    "Tight Bounds For Distributed MST Verification.",
                    "Automata based verification over linearly ordered data domains.",
                    "Bottom-up automata on data trees and vertical XPath.",
                    "Data Monoids.",
                    "Minimum s-t cut in undirected planar graphs when the source and the sink are close.",
                    "Towards Duality of Multicommodity Multiroute Cuts and Flows: Multilevel Ball-Growing.",
                    "Compact Visibility Representation of Plane Graphs.",
                    "Telling convex from reflex allows to map a polygon.",
                    "Cross-Composition: A New Technique for Kernelization Lower Bounds.",
                    "Vertex Cover Kernelization Revisited: Upper and Lower Bounds for a Refined Parameter.",
                    "Hitting forbidden minors: Approximation and Kernelization.",
                    "Self-Assembly of Arbitrary Shapes Using RNAse Enzymes: Meeting the Kolmogorov Bound with Small Scale Factor (extended abstract).",
                    "Weakly Unambiguous Morphisms.",
                    "On Minimal Sturmian Partial Words.",
                    "Improving PPSZ for 3-SAT using Critical Variables.",
                    "The Complexity of Weighted Boolean #CSP Modulo k.",
                    "The #CSP Dichotomy is Decidable.",
                    "A speed-up of oblivious multi-head finite automata by cellular automata.",
                    "Stochastic Cellular Automata Solve the Density Classification Problem with an Arbitrary Precision.",
                    "Probabilistic cellular automata, invariant measures, and perfect sampling.",
                    "Analysis of Agglomerative Clustering.",
                    "Measuring Learning Complexity with Criteria Epitomizers.",
                    "On Parsimonious Explanations For 2-D Tree- and Linearly-Ordered Data.",
                    "Unary negation.",
                    "First-order Fragments with Successor over Infinite Words.",
                    "The model checking problem for propositional intuitionistic logic with one variable is AC^1-complete.",
                    "A Fast Algorithm for Multi-Machine Scheduling Problems with Jobs of Equal Processing Times.",
                    "Scheduling for Weighted Flow Time and Energy with Rejection Penalty.",
                    "Clique-width: When Hard Does Not Mean Impossible.",
                    "From Pathwidth to Connected Pathwidth.",
                    "Polynomial Fitting of Data Streams with Applications to Codeword Testing.",
                    "Spectral Sparsification in the Semi-Streaming Setting.",
                    "Solovay functions and K-triviality.",
                    "Everywhere complex sequences and the probabilistic method.",
                    "Online Scheduling with Interval Conflicts.",
                    "Analysis of multi-stage open shop processing systems.",
                    "Graphs Encoded by Regular Expressions.",
                    "Extended Regular Expressions: Succinctness and Decidability.",
                    "New Exact and Approximation Algorithms for the Star Packing Problem in Undirected Graphs.",
                    "Balanced Interval Coloring.",
                    "Symmetric Determinantal Representation of Weakly-Skew Circuits.",
                    "Randomness Efficient Testing of Sparse Black Box Identities of Unbounded Degree over the Reals.",
                    "On Isomorphism Testing of Groups with Normal Hall Subgroups.",
                    "Space Complexity of Perfect Matching in Bounded Genus Bipartite Graphs.",
                    "The Recognition of Triangle Graphs.",
                    "Collapse Operation Increases Expressive Power of Deterministic Higher Order Pushdown Automata.",
                    "Temporal Synthesis for Bounded Systems and Environments.",
                    "Linear temporal logic for regular cost functions.",
                    "Bounds on the maximum multiplicity of some common geometric graphs.",
                    "On the computational complexity of Ham-Sandwich cuts, Helly sets, and related problems.",
                    "Quantum query complexity of minor-closed graph properties.",
                    "Three Query Locally Decodable Codes with Higher Correctness Require Exponential Length."
                ]
            }
        ]
    },
    {
        "year": "2010",
        "name": "27th STACS 2010",
        "info": "Nancy, France",
        "venues": [
            {
                "sub_name_abbr": "conf/stacs/2010",
                "sub_name": "27th International Symposium on Theoretical Aspects of Computer Science, STACS 2010, March 4-6, 2010, Nancy, France.",
                "count": 59,
                "papers": [
                    "Foreword -- 27th International Symposium on Theoretical Aspects of Computer Science.",
                    "Table of Contents - 27th International Symposium on Theoretical Aspects of Computer Science.",
                    "Beyond omega-Regular Languages.",
                    "Reflections on Multivariate Algorithmics and Problem Parameterization.",
                    "Mathematics, Cryptology, Security.",
                    "Large-Girth Roots of Graphs.",
                    "The Tropical Double Description Method.",
                    "The Remote Point Problem, Small Bias Spaces, and Expanding Generator Sets.",
                    "Evasiveness and the Distribution of Prime Numbers.",
                    "Dynamic Sharing of a Multiple Access Channel.",
                    "Exact Covers via Determinants.",
                    "On Iterated Dominance, Matrix Elimination, and Matched Paths.",
                    "AMS Without 4-Wise Independence on Product Domains.",
                    "Quantum Algorithms for Testing Properties of Distributions.",
                    "Optimal Query Complexity for Reconstructing Hypergraphs.",
                    "Ultimate Traces of Cellular Automata.",
                    "Two-phase Algorithms for the Parametric Shortest Path Problem.",
                    "Continuous Monitoring of Distributed Data Streams over a Time-based Sliding Window.",
                    "Robust Fault Tolerant Uncapacitated Facility Location.",
                    "Efficient and Error-Correcting Data Structures for Membership and Polynomial Evaluation.",
                    "Log-space Algorithms for Paths and Matchings in k-trees.",
                    "Restricted Space Algorithms for Isomorphism on Bounded Treewidth Graphs.",
                    "The Traveling Salesman Problem under Squared Euclidean Distances.",
                    "Beyond Bidimensionality: Parameterized Subexponential Algorithms on Directed Graphs.",
                    "Planar Subgraph Isomorphism Revisited.",
                    "Intrinsic Universality in Self-Assembly.",
                    "Sponsored Search, Market Equilibria, and the Hungarian Method.",
                    "Dispersion in Unit Disks.",
                    "Long Non-crossing Configurations in the Plane.",
                    "The Complexity of Approximating Bounded-Degree Boolean #CSP.",
                    "The Complexity of the List Homomorphism Problem for Graphs.",
                    "Improved Approximation Guarantees for Weighted Matching in the Semi-Streaming Model.",
                    "Computing Least Fixed Points of Probabilistic Systems of Polynomials.",
                    "The k-in-a-path Problem for Claw-free Graphs.",
                    "Finding Induced Subgraphs via Minimal Triangulations.",
                    "Inseparability and Strong Hypotheses for Disjoint NP Pairs.",
                    "Branching-time Model Checking of One-counter Processes.",
                    "Evolving Multialgebras Unify All Usual Sequential Computation Models.",
                    "Collapsing and Separating Completeness Notions under Average-Case and Worst-Case Hypotheses.",
                    "Revisiting the Rice Theorem of Cellular Automata.",
                    "On Optimal Heuristic Randomized Semidecision Procedures, with Application to Proof Complexity.",
                    "Weakening Assumptions for Deterministic Subexponential Time Non-Singular Matrix Completion.",
                    "On Equations over Sets of Integers.",
                    "Randomized Algorithm for Agreeable Deadlines Packet Scheduling.",
                    "Collapsible Pushdown Graphs of Level 2 are Tree-Automatic.",
                    "Approximate Shortest Paths Avoiding a Failed Vertex: Optimal Size Data Structures for Unweighted Graphs.",
                    "Holant Problems for Regular Graphs with Complex Edge Functions.",
                    "Is Ramsey's Theorem omega-automatic?.",
                    "An Efficient Quantum Algorithm for Some Instances of the Group Isomorphism Problem.",
                    "Treewidth Reduction for Constrained Separation and Bipartization Problems.",
                    "Online Correlation Clustering.",
                    "The Recognition of Tolerance and Bounded Tolerance Graphs.",
                    "Decidability of the Interval Temporal Logic ABB over the Natural Numbers.",
                    "Relaxed Spanners for Directed Disk Graphs.",
                    "Unsatisfiable Linear CNF Formulas Are Large and Complex.",
                    "Construction Sequences and Certifying 3-Connectedness.",
                    "Named Models in Coalgebraic Hybrid Logic.",
                    "A Dichotomy Theorem for the General Minimum Cost Homomorphism Problem.",
                    "Alternation-Trading Proofs, Linear Programming, and Lower Bounds."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "26th STACS 2009",
        "info": "Freiburg, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/stacs/2009",
                "sub_name": "26th International Symposium on Theoretical Aspects of Computer Science, STACS 2009, February 26-28, 2009, Freiburg, Germany, Proceedings.",
                "count": 58,
                "papers": [
                    "Preface - 26th International Symposium on Theoretical Aspects of Computer Science.",
                    "A Comparison of Techniques for Sampling Web Pages.",
                    "Profinite Methods in Automata Theory.",
                    "Lower Bounds for Multi-Pass Processing of Multiple Data Streams.",
                    "Shortest Paths Avoiding Forbidden Subpaths.",
                    "Generating Shorter Bases for Hard Random Lattices.",
                    "Quantum Query Complexity of Multilinear Identity Testing.",
                    "An Order on Sets of Tilings Corresponding to an Order on Languages.",
                    "Compressed Representations of Permutations, and Applications.",
                    "On the Average Complexity of Moore's State Minimization Algorithm.",
                    "Testing Linear-Invariant Non-Linear Properties.",
                    "Kolmogorov Complexity and Solovay Functions.",
                    "Weak MSO with the Unbounding Quantifier.",
                    "Polynomial-Time Approximation Schemes for Subset-Connectivity Problems in Bounded-Genus Graphs.",
                    "A Polynomial Kernel for Multicut in Trees.",
                    "On Local Symmetries and Universality in Cellular Automata.",
                    "Qualitative Reachability in Stochastic BPA Games.",
                    "Locally Decodable Quantum Codes.",
                    "Enumerating Homomorphisms.",
                    "Hardness and Algorithms for Rainbow Connectivity.",
                    "Nonclairvoyant Speed Scaling for Flow and Energy.",
                    "An Approximation Algorithm for linfinity Fitting Robinson Structures to Distances.",
                    "Almost-Uniform Sampling of Points on High-Dimensional Algebraic Varieties.",
                    "Reverse Engineering Prefix Tables.",
                    "The Price of Anarchy in Cooperative Network Creation Games.",
                    "Error-Correcting Data Structures.",
                    "Fragments of First-Order Logic over Infinite Words.",
                    "Undecidable Properties of Limit Set Dynamics of Cellular Automata.",
                    "Semi-Online Preemptive Scheduling: One Algorithm for All Variants.",
                    "Improved Approximations for Guarding 1.5-Dimensional Terrains.",
                    "Cover Time and Broadcast Time.",
                    "Economical Caching.",
                    "Computing Graph Roots Without Short Cycles.",
                    "A Generalization of Nemhauser and Trotter's Local Optimization Theorem.",
                    "Kernel(s) for Problems with No Kernel: On Out-Trees with Many Leaves.",
                    "Forward Analysis for WSTS, Part I: Completions.",
                    "Approximating Acyclicity Parameters of Sparse Hypergraphs.",
                    "Optimal Cache-Aware Suffix Selection.",
                    "Randomness on Computable Probability Spaces - A Dynamical Point of View.",
                    "The Dynamic Complexity of Formal Languages.",
                    "A Complexity Dichotomy for Partition Functions with Mixed Signs.",
                    "Asymptotically Optimal Lower Bounds on the NIH-Multi-Party Information Complexity of the AND-Function and Disjointness.",
                    "More Haste, Less Waste: Lowering the Redundancy in Fully Indexable Dictionaries.",
                    "A Unified Algorithm for Accelerating Edit-Distance Computation via Text-Compression.",
                    "Random Fruits on the Zielonka Tree.",
                    "Ambiguity and Communication.",
                    "On the Borel Inseparability of Game Tree Languages.",
                    "Equations over Sets of Natural Numbers with Addition Only.",
                    "Deciding Unambiguity and Sequentiality of Polynomially Ambiguous Min-Plus Automata.",
                    "Polynomial Kernelizations for MIN F+Pi1 and MAX NP.",
                    "Local Multicoloring Algorithms: Computing a Nearly-Optimal TDMA Schedule in Constant Time.",
                    "Efficient Isomorphism Testing for a Class of Group Extensions.",
                    "On Approximating Multi-Criteria TSP.",
                    "Tractable Structures for Constraint Satisfaction with Truth Tables.",
                    "Büchi Complementation Made Tight.",
                    "Strong Completeness of Coalgebraic Modal Logics.",
                    "A Stronger LP Bound for Formula Size Lower Bounds via Clique Constraints.",
                    "Extracting the Kolmogorov Complexity of Strings and Sequences from Sources with Limited Independence."
                ]
            }
        ]
    },
    {
        "year": "2008",
        "name": "25th STACS 2008",
        "info": "Bordeaux, France",
        "venues": [
            {
                "sub_name_abbr": "conf/stacs/2008",
                "sub_name": "STACS 2008, 25th Annual Symposium on Theoretical Aspects of Computer Science, Bordeaux, France, February 21-23, 2008, Proceedings.",
                "count": 59,
                "papers": [
                    "Abstracts Collection - 25th International Symposium on Theoretical Aspects of Computer Science.",
                    "Preface - 25th International Symposium on Theoretical Aspects of Computer Science.",
                    "Understanding Maximal Repetitions in Strings.",
                    "A Little Bit Infinite? On Adding Data to Finitely Labelled Structures (Abstract).",
                    "Equilibria, Fixed Points, and Complexity Classes.",
                    "Pushdown Compression.",
                    "Quantum search with variable times.",
                    "Structural aspects of tilings.",
                    "Limit complexities revisited.",
                    "Trimmed Moebius Inversion and Graphs of Bounded Degree.",
                    "On the Complexity of the Interlace Polynomial.",
                    "Minimizing Flow Time in the Wireless Gathering Problem.",
                    "On Termination for Faulty Channel Machines.",
                    "Stackelberg Network Pricing Games.",
                    "Sublinear Communication Protocols for Multi-Party Pointer Jumping and a Related Lower Bound.",
                    "Finding Irrefutable Certificates for S2p via Arthur and Merlin.",
                    "Quantifying Homology Classes.",
                    "Shortest Vertex-Disjoint Two-Face Paths in Planar Graphs.",
                    "Geodesic Fréchet Distance Inside a Simple Polygon.",
                    "Improved Algorithms for the Range Next Value Problem and Applications.",
                    "Connecting Polygonizations via Stretches and Twangs.",
                    "Deterministically Isolating a Perfect Matching in Bipartite Planar Graphs.",
                    "Tight Bounds for Blind Search on the Integers.",
                    "Discrete Jordan Curve Theorem: A proof formalized in Coq with hypermaps.",
                    "Trimming of Graphs, with Application to Point Labeling.",
                    "Computing Minimum Spanning Trees with Uncertainty.",
                    "Convergence Thresholds of Newton's Method for Monotone Polynomial Equations.",
                    "Model Checking Games for the Quantitative µ-Calculus.",
                    "Order-Invariant MSO is Stronger than Counting MSO in the Finite.",
                    "Succinctness of the Complement and Intersection of Regular Expressions.",
                    "Efficient Algorithms for Membership in Boolean Hierarchies of Regular Languages.",
                    "On the Complexity of Elementary Modal Logics.",
                    "Fixed Parameter Polynomial Time Algorithms for Maximum Agreement and Compatible Supertrees.",
                    "Complexity of solutions of equations over sets of natural numbers.",
                    "Cardinality and counting quantifiers on omega-automatic structures.",
                    "On the Induced Matching Problem.",
                    "On Geometric Spanners of Euclidean and Unit Disk Graphs.",
                    "The Frobenius Problem in a Free Monoid.",
                    "Space Hierarchy Results for Randomized Models.",
                    "Ehrenfeucht-Fraïssé Goes Automatic for Real Addition.",
                    "New Combinatorial Complete One-Way Functions.",
                    "Compatibility of Shelah and Stupp's and Muchnik's iteration with fragments of monadic second order logic.",
                    "Geometric Set Cover and Hitting Sets for Polytopes in R3.",
                    "A Theory for Valiant's Matchcircuits (Extended Abstract).",
                    "Rent, Lease or Buy: Randomized Algorithms for Multislope Ski Rental.",
                    "Lower bounds for adaptive linearity tests.",
                    "An Improved Randomized Truthful Mechanism for Scheduling Unrelated Machines.",
                    "Lagrangian Relaxation and Partial Cover (Extended Abstract).",
                    "On Dynamic Breadth-First Search in External-Memory.",
                    "Analytic aspects of the shuffle product.",
                    "Weak index versus Borel rank.",
                    "A Mahler's theorem for functions from words to integers.",
                    "Distinguishing Short Quantum Computations.",
                    "Factoring Polynomials over Finite Fields using Balance Test.",
                    "On the decomposition of k-valued rational relations.",
                    "The Isomorphism Problem for Planar 3-Connected Graphs is in Unambiguous Logspace.",
                    "Efficient Minimization of DFAs with Partial Transition.",
                    "Design by Measure and Conquer, A Faster Exact Algorithm for Dominating Set.",
                    "Weighted Matching in the Semi-Streaming Model."
                ]
            }
        ]
    },
    {
        "year": "2007",
        "name": "24th STACS 2007",
        "info": "Aachen, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/stacs/2007",
                "sub_name": "STACS 2007, 24th Annual Symposium on Theoretical Aspects of Computer Science, Aachen, Germany, February 22-24, 2007, Proceedings.",
                "count": 59,
                "papers": [
                    "A Calculus and Algebra for Distributed Data Management.",
                    "The Büchi Complementation Saga.",
                    "Speed-Up Techniques for Shortest-Path Computations.",
                    "Compact Forbidden-Set Routing.",
                    "A New Bound for Pure Greedy Hot Potato Routing.",
                    "Wavelength Management in WDM Rings to Maximize the Number of Connections.",
                    "A First Investigation of Sturmian Trees.",
                    "On the Size of the Universal Automaton of a Regular Language.",
                    "Correlations of Partial Words.",
                    "Testing Convexity Properties of Tree Colorings.",
                    "Why Almost All k -Colorable Graphs Are Easy.",
                    "On Defining Integers in the Counting Hierarchy and Proving Arithmetic Circuit Lower Bounds.",
                    "A New Rank Technique for Formula Size Lower Bounds.",
                    "Hard Metrics from Cayley Graphs of Abelian Groups.",
                    "Broadcasting vs. Mixing and Information Dissemination on Cayley Graphs.",
                    "Light Orthogonal Networks with Constant Geometric Dilation.",
                    "Admissibility in Infinite Games.",
                    "Pure Stationary Optimal Strategies in Markov Decision Processes.",
                    "Symmetries and the Complexity of Pure Nash Equilibrium.",
                    "Computing Representations of Matroids of Bounded Branch-Width.",
                    "Characterizing Minimal Interval Completions.",
                    "The Complexity of Unions of Disjoint Sets.",
                    "Kolmogorov-Loveland Stochasticity and Kolmogorov Complexity.",
                    "Bounded-Hop Energy-Efficient Broadcast in Low-Dimensional Metrics Via Coresets.",
                    "On the Complexity of Affine Image Matching.",
                    "On Fixed Point Equations over Commutative Semirings.",
                    "An Exponential Lower Bound for Prefix Gröbner Bases in Free Monoid Rings.",
                    "A Cubic Kernel for Feedback Vertex Set.",
                    "The Union of Minimal Hitting Sets: Parameterized Combinatorial Bounds and Counting.",
                    "An Optimal, Edges-Only Fully Dynamic Algorithm for Distance-Hereditary Graphs.",
                    "A Search Algorithm for the Maximal Attractor of a Cellular Automaton.",
                    "Universal Tilings.",
                    "On the Complexity of Unary Tiling-Recognizable Picture Languages.",
                    "A Characterization of Strong Learnability in the Statistical Query Model.",
                    "On the Consistency of Discrete Bayesian Learning.",
                    "VPSPACE and a Transfer Theorem over the Reals.",
                    "On Symmetric Signatures in Holographic Algorithms.",
                    "Randomly Rounding Rationals with Cardinality Constraints and Derandomizations.",
                    "Cheating to Get Better Roommates in a Random Stable Matching.",
                    "A Deterministic Algorithm for Summarizing Asynchronous Streams over a Sliding Window.",
                    "Arithmetizing Classes Around NC 1 and L.",
                    "The Polynomially Bounded Perfect Matching Problem Is in NC 2.",
                    "Languages with Bounded Multiparty Communication Complexity.",
                    "New Approximation Algorithms for Minimum Cycle Bases of Graphs.",
                    "On Completing Latin Squares.",
                    "Small Space Representations for Metric Min-Sum k -Clustering and Their Applications.",
                    "An Optimal Tableau-Based Decision Algorithm for Propositional Neighborhood Logic.",
                    "Bounded-Variable Fragments of Hybrid Logics.",
                    "Rank-1 Modal Logics Are Coalgebraic.",
                    "An Efficient Quantum Algorithm for the Hidden Subgroup Problem in Extraspecial Groups.",
                    "Weak Fourier-Schur Sampling, the Hidden Subgroup Problem, and the Quantum Collision Problem.",
                    "Quantum Network Coding.",
                    "Reachability in Unions of Commutative Rewriting Systems Is Decidable.",
                    "Associative-Commutative Deducibility Constraints.",
                    "On the Automatic Analysis of Recursive Security Protocols with XOR.",
                    "Improved Online Algorithms for the Sorting Buffer Problem.",
                    "Cost Sharing Methods for Makespan and Completion Time Scheduling.",
                    "Planar Graphs: Logical Complexity and Parallel Isomorphism Tests.",
                    "Enumerating All Solutions for Constraint Satisfaction Problems."
                ]
            }
        ]
    },
    {
        "year": "2006",
        "name": "23rd STACS 2006",
        "info": "Marseille, France",
        "venues": [
            {
                "sub_name_abbr": "conf/stacs/2006",
                "sub_name": "STACS 2006, 23rd Annual Symposium on Theoretical Aspects of Computer Science, Marseille, France, February 23-25, 2006, Proceedings.",
                "count": 57,
                "papers": [
                    "The Ubiquitous Digital Tree.",
                    "Flat Holonomies on Automata Networks.",
                    "Interprocedurally Analyzing Polynomial Identities.",
                    "External String Sorting: Faster and Cache-Oblivious.",
                    "Amortized Rigidness in Dynamic Cartesian Trees.",
                    "Distribution-Sensitive Construction of Minimum-Redundancy Prefix Codes.",
                    "On Critical Exponents in Fixed Points of Binary k-Uniform Morphisms.",
                    "Equivalence of F-Algebras and Cubic Forms.",
                    "Complete Codes in a Sofic Shift.",
                    "Kolmogorov Complexity with Error.",
                    "Kolmogorov Complexity and the Recursion Theorem.",
                    "Entanglement in Interactive Proof Systems with Binary Answers.",
                    "Quantum Algorithms for Matching and Network Flows.",
                    "The Number of Runs in a String: Improved Analysis of the Linear Upper Bound.",
                    "Estimating Entropy and Entropy Norm on Data Streams.",
                    "Pay Today for a Rainy Day: Improved Approximation Algorithms for Demand-Robust Min-Cut and Shortest Path Problems.",
                    "Exact Price of Anarchy for Polynomial Congestion Games.",
                    "Oblivious Symmetric Alternation.",
                    "Combining Multiple Heuristics.",
                    "Conflict-Free Colorings of Rectangles Ranges.",
                    "Grid Vertex-Unfolding Orthogonal Polyhedra.",
                    "Theory and Application of Width Bounded Geometric Separator.",
                    "Invariants of Automatic Presentations and Semi-synchronous Transductions.",
                    "On the Accepting Power of 2-Tape Büchi Automata.",
                    "Weighted Picture Automata and Weighted Logics.",
                    "Markov Decision Processes with Multiple Objectives.",
                    "The Algorithmic Structure of Group Strategyproof Budget-Balanced Cost-Sharing Mechanisms.",
                    "Convergence and Approximation in Potential Games.",
                    "Fast FPT-Algorithms for Cleaning Grids.",
                    "Tradeoffs in Depth-Two Superconcentrators.",
                    "On Hypergraph and Graph Isomorphism with Bounded Color Classes.",
                    "Forbidden Substrings, Kolmogorov Complexity and Almost Periodic Sequences.",
                    "Online Learning and Resource-Bounded Dimension: Winnow Yields New Lower Bounds for Hard Sets.",
                    "Regularity Problems for Visibly Pushdown Languages.",
                    "Regular Expressions and NFAs Without epsilon-Transitions.",
                    "Redundancy in Complete Sets.",
                    "Sparse Selfreducible Sets and Polynomial Size Circuit Lower Bounds.",
                    "Linear Advice for Randomized Logarithmic Space.",
                    "Nested Pebbles and Transitive Closure.",
                    "Definability of Languages by Generalized First-Order Formulas over (N, +).",
                    "Generalized Modal Satisfiability.",
                    "Strategy Improvement and Randomized Subexponential Algorithms for Stochastic Parity Games.",
                    "DAG-Width and Parity Games.",
                    "Reliable Computations Based on Locally Decodable Codes.",
                    "Convergence of Autonomous Mobile Robots with Inaccurate Sensors and Movements.",
                    "A Faster Algorithm for the Steiner Tree Problem.",
                    "Generating Randomized Roundings with Cardinality Constraints and Derandomizations.",
                    "Online Sorting Buffers on Line.",
                    "Optimal Node Routing.",
                    "Memoryless Facility Location in One Pass.",
                    "Energy-Efficient Algorithms for Flow Time Minimization.",
                    "Efficient Qualitative Analysis of Classes of Recursive Markov Decision Processes and Simple Stochastic Games.",
                    "Datalog and Constraint Satisfaction with Infinite Templates.",
                    "Evaluating Monotone Circuits on Cylinders, Planes and Tori.",
                    "Constant-Depth Circuits for Arithmetic in Finite Fields of Characteristic Two.",
                    "Weighted Asynchronous Cellular Automata.",
                    "On the Complexity of the \"Most General\" Firing Squad Synchronization Problem."
                ]
            }
        ]
    },
    {
        "year": "2005",
        "name": "22nd STACS 2005",
        "info": "Stuttgart, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/stacs/2005",
                "sub_name": "STACS 2005, 22nd Annual Symposium on Theoretical Aspects of Computer Science, Stuttgart, Germany, February 24-26, 2005, Proceedings.",
                "count": 57,
                "papers": [
                    "Automorphisms of Finite Rings and Applications to Complexity of Problems.",
                    "Algebraic Generating Functions in Enumerative Combinatorics and Context-Free Languages.",
                    "Algorithmics in Exponential Time.",
                    "Worst-Case and Average-Case Approximations by Simple Randomized Search Heuristics.",
                    "Sampling Sub-problems of Heterogeneous Max-cut Problems and Approximation Algorithms.",
                    "Truthful Approximation Mechanisms for Scheduling Selfish Related Machines.",
                    "Counting in the Two Variable Guarded Logic with Transitivity.",
                    "The Variable Hierarchy of the µ-Calculus Is Strict.",
                    "The Core of a Countably Categorical Structure.",
                    "How Common Can Be Universality for Cellular Automata?.",
                    "Cellular Automata: Real-Time Equivalence Between One-Dimensional Neighborhoods.",
                    "On the Decidability of Temporal Properties of Probabilistic Pushdown Automata.",
                    "Deciding Properties of Contract-Signing Protocols.",
                    "Polylog-Time Reductions Decrease Dot-Depth.",
                    "On the Computational Complexity of the Forcing Chromatic Number.",
                    "More Efficient Queries in PCPs for NP and Improved Approximation Hardness of Maximum CSP.",
                    "Three Optimal Algorithms for Balls of Three Colors.",
                    "Cost Sharing and Strategyproof Mechanisms for Set Cover Games.",
                    "On Weighted Balls-into-Bins Games.",
                    "Computing Minimal Multi-homogeneous Bézout Numbers Is Hard.",
                    "Dynamic Complexity Theory Revisited.",
                    "Parametric Duality and Kernelization: Lower Bounds and Upper Bounds on Kernel Size.",
                    "Shortest Monotone Descent Path Problem in Polyhedral Terrain.",
                    "Packet Buffering: Randomization Beats Deterministic Algorithms.",
                    "Solving Medium-Density Subset Sum Problems in Expected Polynomial Time.",
                    "Quantified Constraint Satisfaction, Maximal Constraint Languages, and Symmetric Polymorphisms.",
                    "Regular Tree Languages Definable in FO.",
                    "Recursive Markov Chains, Stochastic Grammars, and Monotone Systems of Nonlinear Equations.",
                    "Connectivity for Wireless Agents Moving on a Cycle or Grid.",
                    "Improved Algorithms for Dynamic Page Migration.",
                    "Approximate Range Mode and Range Median Queries.",
                    "Topological Automata.",
                    "Minimizing NFA's and Regular Expressions.",
                    "Increasing Kolmogorov Complexity.",
                    "Kolmogorov-Loveland Randomness and Stochasticity.",
                    "Information Theory in Property Testing and Monotonicity Testing in Higher Dimension.",
                    "On Nash Equilibria in Non-cooperative All-Optical Networks.",
                    "Speed Scaling to Manage Temperature.",
                    "The Complexity of Solving Linear Equations over a Finite Ring.",
                    "A Lower Bound on the Complexity of Polynomial Multiplication Over Finite Fields.",
                    "Characterizing TC0 in Terms of Infinite Groups.",
                    "Fast Pruning of Geometric Spanners.",
                    "The PIGs Full Monty - A Floor Show of Minimal Separators.",
                    "Centrality Measures Based on Current Flow.",
                    "Varieties of Codes and Kraft Inequality.",
                    "Improving the Alphabet-Size in High Noise, Almost Optimal Rate List Decodable Codes.",
                    "The Power of Commuting with Finite Sets of Words.",
                    "Exact Quantum Algorithms for the Leader Election Problem.",
                    "Robust Polynomials and Quantum Algorithms.",
                    "Quantum Interactive Proofs with Competing Provers.",
                    "Roundings Respecting Hard Constraints.",
                    "Sorting Stably, In-Place, with O(n log n) Comparisons and O(n) Moves.",
                    "Cycle Cover with Short Cycles.",
                    "A Polynomial Time Algorithm for Minimum Cycle Basis in Directed Graphs.",
                    "All-Pairs Nearly 2-Approximate Shortest-Paths in O(n2 polylog n) Time.",
                    "Pattern Occurrences in Multicomponent Models.",
                    "Automatic Presentations for Finitely Generated Groups."
                ]
            }
        ]
    },
    {
        "year": "2004",
        "name": "21st STACS 2004",
        "info": "Montpellier, France",
        "venues": [
            {
                "sub_name_abbr": "conf/stacs/2004",
                "sub_name": "STACS 2004, 21st Annual Symposium on Theoretical Aspects of Computer Science, Montpellier, France, March 25-27, 2004, Proceedings.",
                "count": 57,
                "papers": [
                    "Approximation Schemes for Metric Clustering Problems.",
                    "Positional Determinacy of Infinite Games.",
                    "Individual Communication Complexity: Extended Abstract.",
                    "The Complexity of Satisfiability Problems over Finite Lattices.",
                    "Constant Width Planar Computation Characterizes ACC0.",
                    "A Simple and Fast Approach for Solving Problems on Planar Graphs.",
                    "Sum-Multicoloring on Paths.",
                    "Matching Algorithms Are Fast in Sparse Random Graphs.",
                    "Algebraic Results on Quantum Automata.",
                    "Quantum Identification of Boolean Oracles.",
                    "Local Limit Distributions in Pattern Statistics: Beyond the Markovian Models.",
                    "A Discontinuity in Pattern Inference.",
                    "Algorithms for SAT Based on Search in Hamming Balls.",
                    "Identifying Efficiently Solvable Cases of Max CSP.",
                    "The Complexity of Boolean Constraint Isomorphism.",
                    "On Minimizing the Total Weighted Tardiness on a Single Machine.",
                    "Online Competitive Algorithms for Maximizing Weighted Throughput of Unit Jobs.",
                    "Optimal and Online Preemptive Scheduling on Uniformly Related Machines.",
                    "Parallel Prefetching and Caching Is Hard.",
                    "Strongly Stable Matchings in Time O(nm) and Extension to the Hospitals-Residents Problem.",
                    "Approximation Algorithms for Minimizing Average Distortion.",
                    "Digraphs Exploration with Little Memory.",
                    "Approximate Path Coloring with Applications to Wavelength Assignment in WDM Optical Networks.",
                    "An Algorithmic View on OVSF Code Assignment.",
                    "The Syntactic Graph of a Sofic Shift.",
                    "Periodicity and Unbordered Words: A Proof of Duval?s Conjecture.",
                    "Desert Automata and the Finite Substitution Problem.",
                    "Satisfiability Problems Complete for Deterministic Logarithmic Space.",
                    "A Logspace Approximation Scheme for the Shortest Path Problem for Graphs with Bounded Independence Number.",
                    "The Minimal Logically-Defined NP-Complete Problem.",
                    "Solving the 2-Disjoint Paths Problem in Nearly Linear Time.",
                    "Simpler Computation of Single-Source Shortest Paths in Linear Average Time.",
                    "Lattices with Many Cycles Are Dense.",
                    "Automata-Based Analysis of Recursive Cryptographic Protocols.",
                    "On Minimum Circular Arrangement.",
                    "Integral Symmetric 2-Commodity Flows.",
                    "Efficient Algorithms for Low-Energy Bounded-Hop Broadcast in Ad-Hoc Wireless Networks.",
                    "On the Expressiveness of Deterministic Transducers over Infinite Trees.",
                    "Definability and Regularity in Automatic Structures.",
                    "Active Context-Free Games.",
                    "Worst Case Performance of an Approximation Algorithm for Asymmetric TSP.",
                    "On Visibility Representation of Plane Graphs.",
                    "Topology Matters: Smoothed Competitiveness of Metrical Task Systems.",
                    "A Randomized Competitive Algorithm for Evaluating Priced AND/OR Trees.",
                    "The Plurality Problem with Three Colors.",
                    "A Measured Collapse of the Modal µ-Calculus Alternation Hierarchy.",
                    "An Information Theoretic Lower Bound for Broadcasting in Radio Networks.",
                    "A New Model for Selfish Routing.",
                    "Broadcast in the Rendezvous Model.",
                    "Time-Space Tradeoff in Derandomizing Probabilistic Logspace.",
                    "What Can be Efficiently Reduced to the K-Random Strings?",
                    "Regular Language Matching and Other Decidable Cases of the Satisfiability Problem for Constraints between Regular Open Terms.",
                    "Deterministic Truthful Approximation Mechanisms for Scheduling Related Machines.",
                    "The Expected Competitive Ratio for Weighted Completion Time Scheduling.",
                    "Effective Strong Dimension in Algorithmic Information and Computational Complexity.",
                    "A Lower Bound on the Competitive Ratio of Truthful Auctions.",
                    "Errata to Analysis of the Harmonic Algorithm for Three Servers."
                ]
            }
        ]
    },
    {
        "year": "2003",
        "name": "20th STACS 2003",
        "info": "Berlin, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/stacs/2003",
                "sub_name": "STACS 2003, 20th Annual Symposium on Theoretical Aspects of Computer Science, Berlin, Germany, February 27 - March 1, 2003, Proceedings.",
                "count": 60,
                "papers": [
                    "Logic as a Query Language: From Frege to XML.",
                    "How Does Computer Science Change Molecular Biology?",
                    "Improved Compact Visibility Representation of Planar Graph via Schnyder's Realizer.",
                    "Rectangle Visibility Graphs: Characterization, Construction, and Compaction.",
                    "Approximating Geometric Bottleneck Shortest Paths.",
                    "Optimization in Arrangements.",
                    "Complete Classifications for the Communication Complexity of Regular Languages.",
                    "The Commutation with Codes and Ternary Sets of Words.",
                    "On the Confluence of Linear Shallow Term Rewrite Systems.",
                    "Wadge Degrees of omega-Languages of Deterministic Turing Machines.",
                    "Faster Deterministic Broadcasting in Ad Hoc Radio Networks.",
                    "Private Computations in Networks: Topology versus Randomness.",
                    "On Shortest-Path All-Optical Networks without Wavelength Conversion Requirements.",
                    "Lattice Reduction by Random Sampling and Birthday Methods.",
                    "On the Ultimate Complexity of Factorials.",
                    "On the Effective Jordan Decomposability.",
                    "Fast Algorithms for Extended Regular Expression Matching and Searching.",
                    "Algorithms for Transposition Invariant String Matching.",
                    "On the Complexity of Finding a Local Maximum of Functions on Discrete Planar Subsets.",
                    "Some Results on Derandomization.",
                    "On the Representation of Boolean Predicates of the Diffie-Hellman Function.",
                    "Quantum Circuits with Unbounded Fan-out.",
                    "Analysis of the Harmonic Algorithm for Three Servers.",
                    "Non-clairvoyant Scheduling for Minimizing Mean Slowdown.",
                    "Space Efficient Hash Tables with Worst Case Constant Access Time.",
                    "Randomized Jumplists: A Jump-and-Walk Dictionary Data Structure.",
                    "Complexity Theoretical Results on Nondeterministic Graph-Driven Read-Once Branching Programs.",
                    "Randomness versus Nondeterminism for Read-Once and Read- k Branching Programs.",
                    "Branch-Width, Parse Trees, and Monadic Second-Order Logic for Matroids.",
                    "Algebraic Characterizations of Small Classes of Boolean Functions.",
                    "On the Difficulty of Some Shortest Path Problems.",
                    "Representing Graph Metrics with Fewest Edges.",
                    "Computing Shortest Paths with Uncertainty.",
                    "Solving Order Constraints in Logarithmic Space.",
                    "The Inversion Problem for Computable Linear Operators.",
                    "Algebras of Minimal Rank over Arbitrary Fields.",
                    "Evolutionary Algorithms and the Maximum Matching Problem.",
                    "Alternative Algorithms for Counting All Matchings in Graphs.",
                    "Strong Stability in the Hospitals/Residents Problem.",
                    "The Inference Problem for Propositional Circumscription of Affine Formulas Is coNP-Complete.",
                    "Decidable Theories of Cayley-Graphs.",
                    "The Complexity of Resolution with Generalized Symmetry Rules.",
                    "Colouring Random Graphs in Expected Polynomial Time.",
                    "An Information-Theoretic Upper Bound of Planar Graphs Using Triangulation.",
                    "Finding Large Independent Sets in Polynomial Expected Time.",
                    "Distributed Soft Path Coloring.",
                    "Competing Provers Yield Improved Karp-Lipton Collapse Results.",
                    "One Bit of Advice.",
                    "Strong Reductions and Immunity for Exponential Time.",
                    "The Complexity of Membership Problems for Circuits over Sets of Natural Numbers.",
                    "Performance Ratios for the Differencing Method Applied to the Balanced Number Partitioning Problem.",
                    "Cake-Cutting Is Not a Piece of Cake.",
                    "The Price of Truth: Frugality in Truthful Mechanisms.",
                    "Untameable Timed Automata!",
                    "The Intrinsic Universality Problem of One-Dimensional Cellular Automata.",
                    "On Sand Automata.",
                    "Adaptive Sorting and the Information Theoretic Lower Bound.",
                    "A Discrete Subexponential Algorithm for Parity Games.",
                    "Cryptographically Sound and Machine-Assisted Verification of Security Protocols.",
                    "Durations, Parametric Model-Checking in Timed Automata with Presburger Arithmetic."
                ]
            }
        ]
    },
    {
        "year": "2002",
        "name": "19th STACS 2002",
        "info": "Antibes Juan-les-Pins, France",
        "venues": [
            {
                "sub_name_abbr": "conf/stacs/2002",
                "sub_name": "STACS 2002, 19th Annual Symposium on Theoretical Aspects of Computer Science, Antibes - Juan les Pins, France, March 14-16, 2002, Proceedings.",
                "count": 53,
                "papers": [
                    "Hyper-Encryption and Everlasting Security.",
                    "Models and Techniques for Communication in Dynamic Networks.",
                    "What Is a Theory?",
                    "A Space Lower Bound for Routing in Trees.",
                    "Labeling Schemes for Dynamic Tree Networks.",
                    "Tight Bounds for the Performance of Longest-in-System on DAGs.",
                    "Approximate Strong Separation with Application in Fractional Graph Coloring and Preemptive Scheduling.",
                    "Balanced Coloring: Equally Easy for All Numbers of Colors?",
                    "The Complexity of Graph Isomorphism for Colored Graphs with Color Classes of Size 2 and 3.",
                    "On the Complexity of Generating Maximal Frequent and Minimal Infrequent Sets.",
                    "On Dualization in Products of Forests.",
                    "An Asymptotic O(ln rho/ln ln rho)-Approximation Algorithm for the Scheduling Problem with Duplication on Large Communication Delay Graphs.",
                    "Scheduling at Twilight the Easy Way.",
                    "Complexity of Multi-dimensional Loop Alignment.",
                    "A Probabilistic 3-SAT Algorithm Further Improved.",
                    "The Secret of Selective Game Tree Search, When Using Random-Error Evaluations.",
                    "Randomized Acceleration of Fundamental Matrix Computations.",
                    "Approximations for ATSP with Parametrized Triangle Inequality.",
                    "A New Diagram from Disks in the Plane.",
                    "Computing the Maximum Detour and Spanning Ratio of Planar Paths, Trees, and Cycles.",
                    "On the Parameterized Intractability of CLOSEST SUBSTRINGsize and Related Problems.",
                    "On the Complexity of Protein Similarity Search under mRNA Structure Constraints.",
                    "Pure Dominance Constraints.",
                    "Improved Quantum Communication Complexity Bounds for Disjointness and Equality.",
                    "On Quantum Computation with Some Restricted Amplitudes.",
                    "A Quantum Goldreich-Levin Theorem with Cryptographic Applications.",
                    "On Quantum and Approximate Privacy.",
                    "On Quantum Versions of the Yao Principle.",
                    "Describing Parameterized Complexity Classes.",
                    "On the Computational Power of Boolean Decision Lists.",
                    "How Many Missing Answers Can Be Tolerated by Query Learners?",
                    "Games with a Uniqueness Property.",
                    "Bi-Immunity Separates Strong NP-Completeness Notions.",
                    "Complexity of Semi-algebraic Proofs.",
                    "A Lower Bound Technique for Restricted Branching Programs and Applications.",
                    "The Complexity of Constraints on Intervals and Lengths.",
                    "Nesting Until and Since in Linear Temporal Logic.",
                    "Comparing Verboseness for Finite Automata and Turing Machines.",
                    "On the Average Parallelism in Trace Monoids.",
                    "A Further Step towards a Theory of Regular MSC Languages.",
                    "Existential and Positive Theories of Equations in Graph Products.",
                    "The Membership Problem for Regular Expressions with Intersection Is Complete in LOGCFL.",
                    "Recognizable Sets of Message Sequence Charts.",
                    "Strong Bisimilarity and Regularity of Basic Parallel Processes Is PSPACE-Hard.",
                    "On the Enumerative Sequences of Regular Languages on k Symbols.",
                    "Ground Tree Rewriting Graphs of Bounded Tree Width.",
                    "Timed Control Synthesis for External Specifications.",
                    "Axiomatizing GSOS with Termination.",
                    "Axiomatising Tree-Interpretable Structures.",
                    "EXPSPACE-Complete Variant of Guarded Fragment with Transitivity.",
                    "A Parametric Analysis of the State Explosion Problem in Model Checking.",
                    "Generalized Model-Checking over Locally Tree-Decomposable Classes.",
                    "Learnability and Definability in Trees and Similar Structures."
                ]
            }
        ]
    },
    {
        "year": "2001",
        "name": "18th STACS 2001",
        "info": "Dresden, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/stacs/2001",
                "sub_name": "STACS 2001, 18th Annual Symposium on Theoretical Aspects of Computer Science, Dresden, Germany, February 15-17, 2001, Proceedings.",
                "count": 49,
                "papers": [
                    "Recurrence in Infinite Words.",
                    "Generalized Model-Checking Problems for First-Order Logic.",
                    "Myhill-Nerode Relations on Automatic Systems and the Completeness of Kleene Algebra.",
                    "2-Nested Simulation Is Not Finitely Equationally Axiomatizable.",
                    "On the Difference between Polynomial-Time Many-One and Truth-Table Reducibilities on Distributional Problems.",
                    "Matching Polygonal Curves with Respect to the Fréchet Distance.",
                    "On the Class of Languages Recognizable by 1-Way Quantum Finite Automata.",
                    "Star-Free Open Languages and Aperiodic Loops.",
                    "A (5/2)n2-Lower Bound for the Multiplicative Complexity of n×n-Matrix Multiplication.",
                    "Evasiveness of Subgraph Containment and Related Properties.",
                    "On the Complexity of Computing Minimum Energy Consumption Broadcast Subgraphs.",
                    "On Presburger Liveness of Discrete Timed Automata.",
                    "Residual Finite State Automata.",
                    "Deterministic Radio Broadcasting at Low Cost.",
                    "The Existential Theory of Equations with Rational Constraints in Free Groups is PSPACE-Complete.",
                    "Recursive Randomized Coloring Beats Fair Dice Random Colorings.",
                    "Randomness, Computability, and Density.",
                    "On Multipartition Communication Complexity.",
                    "Scalable Sparse Topologies with Small Spectrum.",
                    "Optimal Preemptive Scheduling on Uniform Processors with Non-decreasing Speed Ratios.",
                    "The UPS Problem.",
                    "Gathering of Asynchronous Oblivious Robots with Limited Visibility.",
                    "Generalized Langton's Ant: Dynamical Behavior and Complexity.",
                    "Optimal and Approximate Station Placement in Networks (With Applications to Multicasting and Space Efficient Traversals).",
                    "Learning Expressions over Monoids.",
                    "Efficient Recognition of Random Unsatisfiable k-SAT Instances by Spectral Methods.",
                    "On the Circuit Complexity of Random Generation Problems for Regular and Context-Free Languages.",
                    "Efficient Minimal Perfect Hashing in Nearly Minimal Space.",
                    "Small PCPs with Low Query Complexity.",
                    "Space Efficient Algorithms for Series-Parallel Graphs.",
                    "A Toolkit for First Order Extensions of Monadic Games.",
                    "Polynomial Time Approximation Schemes for MAX-BISECTION on Planar and Geometric Graphs.",
                    "Refining the Hierarchy of Blind Multicounter Languages.",
                    "A Simple Undecidable Problem: The Inclusion Problem for Finite Substitutions on ab*c.",
                    "New Results on Alternating and Non-deterministic Two-Dimensional Finite-State Automata.",
                    "The Complexity of Minimal Satisfiability Problems.",
                    "On the Minimal Hardware Complexity of Pseudorandom Function Generators.",
                    "Approximation Algorithms for Minimum Size 2-Connectivity Problems.",
                    "A Model Theoretic Proof of Büchi-Type Theorems and First-Order Logic for N-Free Pomsets.",
                    "An Ehrenfeucht-Fraïssé Approach to Collapse Results for First-Order Queries over Embedded Databases.",
                    "A New Logical Characterization of Büchi Automata.",
                    "A Primal-Dual Approximation Algorithm for the Survivable Network Design Problem in Hypergraph.",
                    "The Complexity of Copy Constant Detection in Parallel Programs.",
                    "Approximation Algorithms for the Bottleneck Stretch Factor Problem.",
                    "Semantical Principles in the Modal Logic of Coalgebras.",
                    "The #a = #b Pictures Are Recognizable.",
                    "A Logical Approach to Decidability of Hierarchies of Regular Star-Free Languages.",
                    "Regular Languages Defined by Generalized First-Order Formulas with a Bounded Number of Bound Variables.",
                    "New Bounds on the OBDD-Size of Integer Multiplication via Universal Hashing."
                ]
            }
        ]
    },
    {
        "year": "2000",
        "name": "17th STACS 2000",
        "info": "Lille, France",
        "venues": [
            {
                "sub_name_abbr": "conf/stacs/2000",
                "sub_name": "STACS 2000, 17th Annual Symposium on Theoretical Aspects of Computer Science, Lille, France, February 2000, Proceedings.",
                "count": 54,
                "papers": [
                    "Codes and Graphs.",
                    "A Classification of Symbolic Transition Systems.",
                    "Circuits versus Trees in Algebraic Complexity.",
                    "On the Many Faces of Block Codes.",
                    "A New Algorithm for MAX-2-SAT.",
                    "Bias Invariance of Small Upper Spans.",
                    "The Complexity of Planarity Testing.",
                    "About Cube-Free Morphisms.",
                    "Linear Cellular Automata with Multiple State Variables.",
                    "Two-Variable Word Equations.",
                    "Average-Case Quantum Query Complexity.",
                    "Tradeoffs between Nondeterminism and Complexity for Communication Protocols and Branching Programs.",
                    "The Boolean Hierarchy of NP-Partitions.",
                    "Binary Exponential Backoff Is Stable for High Arrival Rates.",
                    "The Data Broadcast Problem with Preemption.",
                    "An Approximate Lp-Difference Algorithm for Massive Data Streams.",
                    "Succinct Representations of Model Based Belief Revision.",
                    "Logics Capturing Local Properties.",
                    "The Complexity of Poor Man's Logic.",
                    "Fast Integer Sorting in Linear Space.",
                    "On the Performance of WEAK-HEAPSORT.",
                    "On the Two-Variable Fragment of the Equational Theory of the Max-Sum Algebra of the Natural Numbers.",
                    "Real-Time Automata and the Kleene Algebra of Sets of Real Numbers.",
                    "Small Progress Measures for Solving Parity Games.",
                    "Multi-linearity Self-Testing with Relative Error.",
                    "Nondeterministic Instance Complexity and Hard-to-Prove Tautologies.",
                    "Hard Instances of Hard Problems.",
                    "Simulation and Bisimulation over One-Counter Processes.",
                    "Decidability of Reachability Problems for Classes of Two Counters Automata.",
                    "Hereditary History Preserving Bisimilarity Is Undecidable.",
                    "The Hardness of Approximating Spanner Problems.",
                    "An Improved Lower Bound on the Approximability of Metric TSP and Approximation Algorithms for the TSP with Sharpened Triangle Inequality.",
                    "lambda-Coloring of Graphs.",
                    "Optimal Proof Systems and Sparse Sets.",
                    "Almost Complete Sets.",
                    "Graph Isomorphism Is Low for ZPP(NP) and Other Lowness Results.",
                    "An Approximation Algorithm for the Precedence Constrained Scheduling Problem with Hierarchical Communications.",
                    "Polynomial Time Approximation Schemes for the Multiprocessor Open and Flow Shop Scheduling Problem.",
                    "Controlled Conspiracy-2 Search.",
                    "The Stability of Saturated Linear Dynamical Systems Is Undecidable.",
                    "Tilings: Recursivity and Regularity.",
                    "Listing All Potential Maximal Cliques of a Graph.",
                    "Distance Labeling Schemes for Well-Separated Graph Classes.",
                    "Pruning Graphs with Digital Search Trees. Application to Distance Hereditary Graphs.",
                    "Characterizing and Deciding MSO-Definability of Macro Tree Transductions.",
                    "Languages of Dot-Depth 3/2.",
                    "Random Generation and Approximate Counting of Ambiguously Described Combinatorial Structures.",
                    "The CNN Problem and Other k-Server Variants.",
                    "The Weighted 2-Server Problem.",
                    "On the Competitive Ratio of the Work Function Algorithm for the k-Server Problem.",
                    "Spectral Bounds on General Hard Core Predicates.",
                    "Randomness in Visual Cryptography.",
                    "Online Dial-a-Ride Problems: Minimizing the Completion Time.",
                    "The Power Range Assignment Problem in Radio Networks on the Plane."
                ]
            }
        ]
    },
    {
        "year": "1999",
        "name": "16th STACS 1999",
        "info": "Trier, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/stacs/1999",
                "sub_name": "STACS 99, 16th Annual Symposium on Theoretical Aspects of Computer Science, Trier, Germany, March 4-6, 1999, Proceedings.",
                "count": 54,
                "papers": [
                    "Algorithms for Selfish Agents.",
                    "The Reduced Genus of a Multigraph.",
                    "Classifying Discrete Temporal Properties.",
                    "Circuit Complexity of Testing Square-Free Numbers.",
                    "Relating Branching Program Size and Formula Size over the Full Binary Basis.",
                    "Memory Organization Schemes for Large Shared Data: A Randomized Solution for Distributed Memory Machines.",
                    "The Average Time Complexity to Compute Prefix Functions in Processor Networks.",
                    "On the Hardness of Permanent.",
                    "One-sided Versus Two-sided Error in Probabilistic Computation.",
                    "An Optimal Competitive Strategy for Walking in Streets.",
                    "An Optimal Strategy for Searching in Unknown Streets.",
                    "Parallel Searching on m Rays.",
                    "A Logical Characterisation of Linear Time on Nondeterministic Turing Machines.",
                    "Descriptive Complexity of Computable Sequences.",
                    "Complexity of Some Problems in Universal Algebra.",
                    "New Branchwidth Territories.",
                    "Balanced Randomized Tree Splitting with Applications to Evolutionary Tree Constructions.",
                    "Treewidth and Minimum Fill-in of Weakly Triangulated Graphs.",
                    "Decidability and Undecidability of Marked PCP.",
                    "On Quadratic Word Equations.",
                    "Some Undecidability Results Related to the Star Problem in Trace Monoids.",
                    "An Approximation Algorithm for Max p-Section.",
                    "Approximating Bandwidth by Mixing Layouts of Interval Graphs.",
                    "Linear Time 1/2-Approximation Algorithm for Maximum Weighted Matching in General Graphs.",
                    "Extending Downward Collapse from 1-versus-2 Queries to j-versus-j+1 Queries.",
                    "Sparse Sets, Approximable Sets, and Parallel Queries to NP.",
                    "External Selection.",
                    "Fast Computations of the Exponential Function.",
                    "A Model of Behaviour Abstraction for Communicating Processes.",
                    "Model Checking Lossy Vector Addition Systems.",
                    "Constructing Light Spanning Trees with Small Routing Cost.",
                    "Finding Paths with the Right Cost.",
                    "In How Many Steps the k Peg Version of the Towers of Hanoi Game Can Be Solved?",
                    "Lower Bounds for Dynamic Algebraic Problems.",
                    "An Explicit Lower Bound for TSP with Distances One and Two.",
                    "Scheduling Dynamic Graphs.",
                    "Supporting Increment and Decrement Operations in Balancing Networks.",
                    "Worst-case Equilibria.",
                    "A Complete and Tight Average-Case Analysis of Learning Monomials.",
                    "Costs of General Purpose Learning.",
                    "Universal Distributions and Time-Bounded Kolmogorov Complexity.",
                    "The Descriptive Complexity Approach to LOGCFL.",
                    "The Weakness of Self-Complementation.",
                    "On the Difference of Horn Theories.",
                    "On Quantum Algorithms for Noncommutative Hidden Subgroups.",
                    "On the Size of Randomized OBDDs and Read-Once Branching Programs for k-Stable Functions.",
                    "How to Forget a Secret.",
                    "A Modal Fixpoint Logic with Chop.",
                    "Completeness of Neighbourhood Logic.",
                    "Eliminating Recursion in the µ-Calculus.",
                    "On Optimal Algorithms and Optimal Proof Systems.",
                    "Space Bounds for Resolution.",
                    "Upper Bounds for Vertex Cover Further Improved.",
                    "Online Matching for Scheduling Problems."
                ]
            }
        ]
    },
    {
        "year": "1998",
        "name": "15th STACS 1998",
        "info": "Paris, France",
        "venues": [
            {
                "sub_name_abbr": "conf/stacs/1998",
                "sub_name": "STACS 98, 15th Annual Symposium on Theoretical Aspects of Computer Science, Paris, France, February 25-27, 1998, Proceedings.",
                "count": 54,
                "papers": [
                    "Random Graphs, Random Walks, Differential Equations and the Probabilistic Analysis of Algorithms.",
                    "Distributed Online Frequency Assignment in Cellular Networks.",
                    "Floats, Integers, and Single Source Shortest Paths.",
                    "A Synthesis on Partition Refinement: A Useful Routine for Strings, Graphs, Boolean Matrices and Automata.",
                    "Simplifying the Modal Mu-Calculus Alternation Hierarchy.",
                    "On Disguised Double Horn Functions and Extensions.",
                    "The Complexity of Propositional Linear Temporal Logics in Simple Cases (Extended Abstract).",
                    "Searching Constant Width Mazes Captures the AC0 Hierarchy.",
                    "Nearly Optimal Language Compression Using Extractors.",
                    "Random Sparse Bit Strings at the Threshold of Adjacency.",
                    "Lower Bounds for Randomized Read-k-Times Branching Programs (Extended Abstract).",
                    "Inducing an Order on Cellular Automata by a Grouping Operation.",
                    "Attractors of D-dimensional Linear Cellular Automata.",
                    "Optimal Simulations Between Unary Automata.",
                    "Shuffle of omega-Words: Algebraic Aspects (Extended Abstract).",
                    "A Generalization of Resource-Bounded Measure, With an Application (Extended Abstract).",
                    "The Complexity of Modular Graph Automorphism.",
                    "Unary Quantifiers, Transitive Closure, and Relations of Large Degree.",
                    "On the Structure of Valiant's Complexity Classes.",
                    "On the Existence of Polynomial Time Approximation Schemes for OBDD Minimization (Extended Abstract).",
                    "Complexity of Problems on Graphs Represented as OBDDs (Extended Abstract).",
                    "Equivalence Test and Ordering Transformation for Parity-OBDDs of Different Variable Ordering.",
                    "Size and Structure of Random Ordered Binary Decision Diagrams (Extended Abstract).",
                    "Provable Security for Block Ciphers by Decorrelation.",
                    "On the Approximation of Finding A(nother) Hamilton Cycle in Cubic Hamilton Graphs (Extended Abstract).",
                    "The Mutual Exclusion Scheduling Problem for Permutation and Comparability Graphs.",
                    "Massaging a Linear Programming Solution to Give a 2-Approximation for a Generalization of the Vertex Cover Problem.",
                    "Partially Persistent Search Trees with Transcript Operations.",
                    "Relating Hierarchies of Word and Tree Automata.",
                    "Languages Defined With Modular Counting Quantifiers (Extended Abstract).",
                    "Hierarchies of Principal Twist-Closed Trios.",
                    "Radix Representations of Algebraic Number Fields and Finite Automata.",
                    "Sorting and Searching on the Word RAM.",
                    "Communication-Efficient Deterministic Parallel Algorithms for Planar Point Location and 2d Voronoi Diagram.",
                    "On Batcher's Merge Sorts as Parallel Sorting Algorithms.",
                    "Minimum Spanning Trees for Minor-Closed Graph Classes in Parallel.",
                    "Optimal Broadcasting in Almost Trees and Partial k-trees.",
                    "Local Normal Forms for First-Order Logic with Applications to Games and Automata.",
                    "Axiomatizing the Equational Theory of Regular Tree Languages (Extended Anstract).",
                    "A Logical Characterization of Systolic Languages.",
                    "Optimal Proof Systems for Propositional Logic and Complete Sets.",
                    "The (Parallel) Approximability of Non-Boolean Satisfiability Problems and Restricted Integer Programming.",
                    "Interactive Protocols on the Reals.",
                    "Result-Indistinguishable Zero-Knowledge Proofs: Increased Power and Constant-Round Protocols.",
                    "Bounded Size Dictionary Compression: SCk-Completeness and NC Algorithms.",
                    "Expressive Completeness of LTrL on Finite Traces: An Algebraic Proof.",
                    "On Uniform DOL Words.",
                    "Series-Parallel Posets: Algebra, Automata and Languages.",
                    "On the Expected Number of Nodes at Level k in 0-balanced Trees.",
                    "Cell Flipping in Permutation Diagrams.",
                    "Construction of Non-intersecting Colored Flows Through a Planar Cellular Figure.",
                    "Recursively Enumerable Reals and Chaitin Omega Numbers.",
                    "Uniformly Defining Complexity Classes of Functions.",
                    "Recognizability Equals Monadic Second-Order Definability for Sets of Graphs of Bounded Tree-Width."
                ]
            }
        ]
    },
    {
        "year": "1997",
        "name": "14th STACS 1997",
        "info": "Lübeck, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/stacs/1997",
                "sub_name": "STACS 97, 14th Annual Symposium on Theoretical Aspects of Computer Science, Lübeck, Germany, February 27 - March 1, 1997, Proceedings.",
                "count": 49,
                "papers": [
                    "Unifying Models.",
                    "Predecessor Queries in Dynamic Integer Sets.",
                    "Semi-Dynamic Shortest Paths and Breadth-First Search in Digraphs.",
                    "Greibach Normal Form Transformation, Revisited.",
                    "Translating Regular Expressions into Small epsilon-Free Nondeterministic Finite Automata.",
                    "Memory Management for Union-Find Algorithms.",
                    "Fast Online Multiplication of Real Numbers.",
                    "The Operators min and max on the Polynomial Hierarchy.",
                    "Resource-Bounded Kolmogorov Complexity Revisited.",
                    "Las Vegas Versus Determinism for One-way Communication Complexity, Finite Automata, and Polynomial-time Computations.",
                    "Interactive Proof Systems with Public Coin: Lower Space Bounds and Hierarchies of Complexity Classes.",
                    "MODp-tests, Almost Independence and Small Probability Spaces (Extended Abstract).",
                    "Hybrid Diagrams: A Deductive-Algorithmic Approach to Hybrid System Verification.",
                    "Temporal Logics for the Specification of Performance and Reliability.",
                    "Efficient Scaling-Invariant Checking of Timed Bisimulation.",
                    "Gossiping and Broadcasting versus Computing Functions in Networks.",
                    "On the Descriptive and Algorithmic Power of Parity Ordered Binary Decision Diagrams.",
                    "A Reducibility Concept for Problems Defined in Terms of Ordered Binary Decision Diagrams.",
                    "On the Classification of Computable Languages.",
                    "A Conditional-Logical Approach to Minimum Cross-Entropy.",
                    "Undecidability Results on Two-Variable Logics.",
                    "Methods and Applications of (MAX, +) Linear Algebra.",
                    "Regular Expressions and Context-Free Grammars for Picture Languages.",
                    "Measuring Nondeterminism in Pushdown Automata.",
                    "On Polynomially D-Verbose Sets.",
                    "A Downward Translation in the Polynomial Hierarchy.",
                    "Strict Sequential P-completeness.",
                    "An Unambiguous Class Possessing a Complete Set.",
                    "Deadlock-Free Interval Routing Schemes.",
                    "Power Consumption in Packet Radio Networks (Extended Abstract).",
                    "The Complexity of Generating Test Instances.",
                    "Efficient Construction of Hitting Sets for Systems of Linear Functions.",
                    "Protocols for Collusion-Secure Asymmetric Fingerprinting (Extended Abstract).",
                    "Minimal Transition Systems for History-Preserving Bisimulation.",
                    "On Ergodic Linear Cellular Automata over Zm.",
                    "Intrinsic Universality of a 1-Dimensional Reversible Cellular Automaton.",
                    "The Computational Complexity of Some Problems of Linear Algebra (Extended Abstract).",
                    "Algebraic and Logical Characterizations of Deterministic Linear Time Classes.",
                    "Finding the k Shortest Paths in Parallel.",
                    "Sequential and Parallel Algorithms on Compactly Represented Chordal and Strongly Chordal Graphs.",
                    "Distance Approximating Spanning Trees.",
                    "A Better Upper Bound on the Bisection Width of de Bruijn Networks (Extended Abstract).",
                    "An Information-Theoretic Treatment of Random-Self-Reducibility (Extended Abstract).",
                    "Equivalence of Measures of Complexity Classes.",
                    "Better Algorithms for Minimum Weight Vertex-Connectivity Problems.",
                    "RNC-Approximation Algorithms for the Steiner Problem.",
                    "Pattern Matching in Trace Monoids (Extended Abstract).",
                    "Removing epsilon-Transitions in Timed Automata.",
                    "Probabilistic Proof Systems - A Survey."
                ]
            }
        ]
    },
    {
        "year": "1996",
        "name": "13th STACS 1996",
        "info": "Grenoble, France",
        "venues": [
            {
                "sub_name_abbr": "conf/stacs/1996",
                "sub_name": "STACS 96, 13th Annual Symposium on Theoretical Aspects of Computer Science, Grenoble, France, February 22-24, 1996, Proceedings.",
                "count": 54,
                "papers": [
                    "New Trends in Quantum Computing.",
                    "Compressibility and Resource Bounded Measure.",
                    "On the Complexity of Random Strings (Extended Abstract).",
                    "Remarks on Generalized Post Correspondence Problem.",
                    "Cyclic Languages and Strongly Cyclic Languages.",
                    "Resource-Bounded Balanced Genericity, Stochasticity and Weak Randomness.",
                    "The Complexity of Generating and Checking Proffs of Membership.",
                    "Observations on Measure and Lowness for Delta^P_2.",
                    "Solvable Black-Box Group Problems Are Low for PP.",
                    "Languages Recognized by Finite Aperiodic Groupoids.",
                    "Star-Height of an N-Rational Series.",
                    "An Aperiodic Set of Wang Cubes.",
                    "Lyndon Factorization of Infinite Words.",
                    "Embedding Graphs with Bounded Treewidth into Optimal Hypercubes.",
                    "Parallel Comparability Graph Recognition and Modular Decomposition.",
                    "Fault-Tolerant Shared Memory Simulations.",
                    "On Word-Level Parallelism in Fault-Tolerant Computing.",
                    "Learning with Confidence.",
                    "Extracting Best Consensus Motifs from Positive and Negative Examples.",
                    "PAC Learning with Simple Examples.",
                    "General Inductive Inference Types Based on Linearly-Ordered Sets.",
                    "On the Power of Non-Observable Actions in Timed Automata.",
                    "Trace Rewriting: Computing Normal Forms in Time O(n log n).",
                    "A Decision Procedure for Well-Formed Linear Quantum Cellular Automata.",
                    "On the Complexity of Worst Case and Expected Time in a Circuit.",
                    "On the Existence of Hard Sparse Sets under Weak Reductions.",
                    "Optimal Bounds on the Approximation of Boolean Functions with Consequences on the Concept of Hardware.",
                    "Fine Separation of Average Time Complexity Classes.",
                    "Compositional Specification of Timed Systems (Extended Abstract).",
                    "Optimal Tree-Based One-Time Digital Signature Schemes.",
                    "The Action of a Few Random Permutations on r-Tuples and an Application to Cryptography.",
                    "A Unified and Generalized Treatment of Authentification Theory.",
                    "Monadic Second Order Logic on Tree-Like Structures.",
                    "On Bijections vs. Unary Functions.",
                    "The 3 Frenchmen Method Proves Undecidability of the Uniform Boundedness for Single Recursive Rule Ternary DATALOG Programs.",
                    "A Combinatorial Design Approach to MAXCUT.",
                    "Characterizing the Complexity of Subgraph Isomorphism for Graphs of Bounded Path-Width.",
                    "A Characterization of the Quadrilateral Meshes of a Surface Which Admit a Compatible Hexahedral Mesh of the Enclosed Volume.",
                    "On the Expressivity of the Modal Mu-Calculus.",
                    "Read-once Projections and Formal Circuit Verification with Binary Decision Diagrams.",
                    "\"Optimal\" Collecting Semantics for Analysis in a Hierarchy of Logic Program Semantics.",
                    "Flip-Flop Nets.",
                    "Lower Bounds for Compact Routing (Extended Abstract).",
                    "On the Successor Function in Non-Classical Numeration Systems.",
                    "Minimal Forbidden Words and Symbolic Dynamics.",
                    "Universal Hashing and k-Wise Independent Random Variables via Integer Arithmetic without Primes.",
                    "Ranking and Unranking Trees Using Regular Reductions.",
                    "On Competitive On-Line Paging with Lookahead.",
                    "Hypothesis Testing in Perfect Phylogeny for a Bounded Number of Characters.",
                    "The \"log Rank\" Conjecture for Modular Communication Complexity.",
                    "Upper Bounds on Multiparty Communication Complexity of Shifts.",
                    "Some Bounds on Multiparty Communication Complexity of Pointer Jumping.",
                    "Optimal Schedules for d-D Grid Graphs with Communication Delays (Extended Abstract).",
                    "Linear Programming - Randomization and Abstract Frameworks."
                ]
            }
        ]
    },
    {
        "year": "1995",
        "name": "12th STACS 1995",
        "info": "Munich, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/stacs/1995",
                "sub_name": "STACS 95, 12th Annual Symposium on Theoretical Aspects of Computer Science, Munich, Germany, March 2-4, 1995, Proceedings.",
                "count": 56,
                "papers": [
                    "On the Synthesis of Strategies in Infinite Games.",
                    "Finding the Maximum with Linear Error Probabilities: A Sequential Analysis Approach.",
                    "Completeness and Weak Completeness Under Polynomial-Size Circuits.",
                    "Communication Complexity of Key Agreement on Small Ranges.",
                    "Pseudorandom Generators and the Frequency of Simplicity.",
                    "Classes of Bounded Counting Type and their Inclusion Relations.",
                    "Lower Bounds for Depth-Three Circuits With Equals and Mod-Gates.",
                    "On Realizing Iterated Multiplication by Small Depth Threshold Circuits.",
                    "A Random NP-Complete Problem for Inversion of 2D Cellular Automata.",
                    "On the Subword Equivalence Problem for Infinite Words.",
                    "On the Separators on an Infinite Word Generated by a Morphism.",
                    "Systolic Tree Omega-Languages.",
                    "Structural Complexity of Omega-Automata.",
                    "Algorithms Explained by Symmetries.",
                    "Generalized Scans and Tri-Diagonal Systems.",
                    "Two-Dimensional Pattern Matching in Linear Time and Small Space.",
                    "On-line and Dynamic Algorithms for Shorted Path Problems.",
                    "On Compact Representations of Propositional Circumscription.",
                    "A Set-Theoretic Translation Method for (Poly)modal Logics.",
                    "On the Synthesis of Discrete Controllers for Timed Systems (An Extended Abstract).",
                    "A Fully Abstract Semantics for Causality in the Pi-Calculus.",
                    "On the Sizes of Permutation Networks and Consequences for Efficient Simulation of Hypercube Algorithms on Bounded-Degree Networks.",
                    "Exploiting Storage Redundancy to Speed Up Randomized Shared Memory Simulations.",
                    "Interval Routing Schemes.",
                    "A Packet Routing Protocol for Arbitrary Networks.",
                    "A Family of Tag Systems for Paperfolding Sequences.",
                    "Growing Context-Sensitive Languages and Church-Rosser Languages.",
                    "Deterministic Generalized Automata.",
                    "Optimal Simulation of Automata by Neural Nets.",
                    "Concurrent Process Equivalences: Some Decision Problems (Abstract).",
                    "Optimal Lower Bounds on the Multiparty Communication Complexity.",
                    "Simultaneous Messages vs. Communication.",
                    "Coding and Strong Coding in Trace Monoids.",
                    "On Codings of Traces.",
                    "Finding Largest Common Embeddable Subtrees.",
                    "The Chi-t-Coloring Problem.",
                    "Expander Properties in Random Regular Graphs with Edge Faults.",
                    "Dynamic Analysis of the Sizes of Relations.",
                    "On Slender Context-free Languages.",
                    "Partial Derivates of Regular Expressions and Finite Automata Constructions.",
                    "Dependence Orders for Computations of Concurrent Automata.",
                    "On the Undecidability of Deadlock Detection in Families of Nets.",
                    "On the Average Running Time of Odd-Even Merge Sort.",
                    "Optimal Average Case Sorting on Arrays.",
                    "Normal Numbers and Sources for BPP.",
                    "Lower Bounds on Learning Decision Lists and Trees (Extended Abstract).",
                    "Line Segmentation of Digital Curves in Parallel.",
                    "Computability of Convex Sets (Extended Abstract).",
                    "Enumerating Extreme Points in Higher Dimensions.",
                    "The Number of Views of Piecewise-Smooth Algebraic Objects.",
                    "On the Structure of Log-Space Probabilistic Complexity Classes (Extended Abstract).",
                    "Resource-Bounded Instance Complexity (Extended Abstract).",
                    "On the Sparse Set Conjecture for Sets with Low Denisty.",
                    "Beyond P^(NP) - NEXP.",
                    "Malign Distributions for Average Case Circuit Complexity.",
                    "A Prossible Code in the Genetic Code."
                ]
            }
        ]
    },
    {
        "year": "1994",
        "name": "11th STACS 1994",
        "info": "Caen, France",
        "venues": [
            {
                "sub_name_abbr": "conf/stacs/1994",
                "sub_name": "STACS 94, 11th Annual Symposium on Theoretical Aspects of Computer Science, Caen, France, February 24-26, 1994, Proceedings.",
                "count": 63,
                "papers": [
                    "The Nature and Meaning of Perturbations in Geometric Computing.",
                    "One Binary Horn Clause is Enough.",
                    "Transforming Constraint Logic Programs.",
                    "A Hierarchy of Temporal Logics with Past (Extended Abstract).",
                    "The Complexity of Resource-Bounded First-Order Classical Logic.",
                    "Two Proof Procedures for a Cardinality Based Language in Propositional Calculus.",
                    "The Alternation Hierarchy for Machines with Sublogarithmic Space is Infinite.",
                    "Quasilinear Time Complexity Theory.",
                    "Space-Efficient Deterministic Simulation of Probabilistic Automata (Extended Abstract).",
                    "Reachability and the Power of Local Ordering.",
                    "Are Parallel Machines Always Faster than Sequential Machines? (Preliminary Version).",
                    "Ground Reducibility and Automata with Disequality Constraints.",
                    "Perpetuality and Strong Normalization in Orthogonal Term Rewriting Systems.",
                    "About Changing the Ordering During Knuth-Bendix Completion.",
                    "Combination of Matching Algorithms.",
                    "Periodic Constant Depth Sorting Networks.",
                    "Optimal Pattern Matching on Meshes.",
                    "Faster Sorting and Routing on Grids with Diagonals.",
                    "Deterministic 1-k Routing on Meshes.",
                    "A Unifying Type-Theoretic Framework for Objects.",
                    "Operational Specifications with Built-Ins.",
                    "Reactive Variables for System Specification and Design.",
                    "A New Parallel Vector Model, with Exact Characterization of NC^k.",
                    "On Adaptive Dlogtime and Polylogtime Reductions (Extended Abstract).",
                    "NC^k(NP) = AC^(k-1)(NP).",
                    "Hypertransition Systems.",
                    "On the Star Operation and the Finite Power Property in Free Partially Commutative Monoids (Extended Abstract).",
                    "Coding with Traces.",
                    "Monadic Second-Order Logic Over Pictures and Recognizability by Tiling Systems.",
                    "q-Grammars: Results, Implementation.",
                    "A Topology for Complete Semirings.",
                    "The Global Power of Additional Queries to Random Oracles.",
                    "Cook Versus Karp-Levin: Separating Completeness Notions if NP Is not Small (Extended Abstract).",
                    "On Sets Bounded Truth-Table Reducible to P-selective Sets.",
                    "Two Refinements of the Polynomial Hierarcht.",
                    "On Different Reducibility Notions for Function Classes.",
                    "Optimal Parallelization of Las Vegas Algorithms.",
                    "Efficient Parallel Algorithms for Geometric k-Clustering Problems.",
                    "A Simple Optimal Parallel Algorithm for Reporting Paths in a Tree.",
                    "Parallel Detection of all Palindromes in a String.",
                    "On the Structure of Parameterized Problems in NP (Extended Abstract).",
                    "On the Approximability of Finding Maximum Feasible Subsystems of Linear Systems.",
                    "On the Acceptance Power of Regular Languages.",
                    "Complexity Classes with Finite Acceptance Types.",
                    "The Complete Axiomatization of Cs-congruence.",
                    "Transition System Specifications in Stalk Formal with Bisimulation as a Congruence.",
                    "Decidability Questions for Bismilarity of Petri Nets and Some Related Problems.",
                    "The Variable Membership Problem: Succinctness Versus Complexity.",
                    "Economy of Description for Single-valued Transducers.",
                    "Automaticity: Properties of a Measure of Descriptional Complexity.",
                    "Towards a Theory of Recursive Structures.",
                    "Finding Minimal Generalizations for Unions of Pattern Languages and Its Application to Inductive Inference from Positive Data.",
                    "Nondeterminism in Patterns.",
                    "Upper Bounds for the Expected Length of a Longest Common Subsequence of Two Binary Sequences.",
                    "The Ambiguity of Primitive Words.",
                    "On Codes Having no Finite Completion.",
                    "A New Approach To Information Theory.",
                    "On Voronoi Diagrams in the L_p-Metric in Higher Dimensions.",
                    "Total Protection of Analytic Invariant Information in Cross Tabulated Tables.",
                    "Dominating Cliques in Graphs with Hypertree Structures.",
                    "On Vertex Ranking for Permutations and Other Graphs.",
                    "Finding All Minimal Separators of a Graph.",
                    "On the Complexity of the Maximum Cut Problem."
                ]
            }
        ]
    },
    {
        "year": "1993",
        "name": "10th STACS 1993",
        "info": "Würzburg, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/stacs/1993",
                "sub_name": "STACS 93, 10th Annual Symposium on Theoretical Aspects of Computer Science, Würzburg, Germany, February 25-27, 1993, Proceedings.",
                "count": 71,
                "papers": [
                    "Causal and Distributed Semantics for Concurrent Processes (Abstract).",
                    "The Alternation Hierarchy for Sublogarithmic Space: An Exciting Race to STACS'93 (Editorial Note).",
                    "Alternation for Two-way Machines with Sublogarithmic Space.",
                    "Separating the Lower Levels of the Sublogarithmic Space Hierarchy.",
                    "Locating P/poly Optimally in the Extended Low Hierarchy.",
                    "Measure, Stochasticity, and the Density of Hard Languages.",
                    "Halting Problem of One Binary Horn Clause is Undecidable.",
                    "Decidability and Undecidability Results for Duration Calculus.",
                    "Defining Lambda-Typed Lambda-Calculi by Axiomatizing the Typing Relation.",
                    "The Complexity of Logic-Based Abduction.",
                    "Treewidth of Bipartite Graphs.",
                    "On Paths in Networks with Valves.",
                    "Scheduling Interval Ordered Tasks in Parallel.",
                    "On O(sqrt(n))-Worst-Case-Time Solution to the Granularity Problem.",
                    "The Synthesis Problem of Petri Nets.",
                    "General Refinement and Recursion Operators for the Petri Box Calculus.",
                    "On Fairness in Distributed Automated Deduction.",
                    "Divide-and-Conquer Algorithms on the Hypercube.",
                    "A First-Order Isomorphism Theorem.",
                    "Splittings, Robustness and Structure of Complete Sets.",
                    "Defying Upward and Downward Separation.",
                    "Counting, Selecting, adn Sorting by Query-Bounded Machines.",
                    "Cancellation on Context-Free Languages: Enrichment by Reduction.",
                    "Counting Overlap-Free Binary Words.",
                    "The Limit Set of Recognizable Substitution Systems.",
                    "Partially Commutative Lyndon Words.",
                    "Parallel Architectures: Design and Efficient Use.",
                    "Weighted Closest Pairs.",
                    "Rectilinear Path Queries in a Simple Rectilinear Polygon.",
                    "Parallel Algorithm for the Matrix Chain Product and the Optimal Triangulation Problems (Extended Abstract).",
                    "Multi-List Ranking: Complexity and Applications.",
                    "Exact Algorithms for a Geometric Packing Problem (Extended Abstract).",
                    "A Decomposition Theorem for Probabilistic Transition Systems.",
                    "Local Automata and Completion.",
                    "Efficient Compression of Wavelet Coefficients for Smooth and Fractal-like Data.",
                    "On the Equivalence of Two-way Pushdown Automata and Counter Machines over Bounded Languages.",
                    "Computability Properties of Low-dimensional Dynamical Systems.",
                    "Fixed-Parameter Intractability II (Extended Abstract).",
                    "Limits on the Power of Parallel Random Access Machines with Weak Forms of Write Conflict Resolution.",
                    "On Using Oracles That Compute Values.",
                    "Multicounter Automata with Sublogarithmic Reversal Bounds.",
                    "Structured Operational Semantics for Concurrency and Hierarchy.",
                    "The Complexity of Verifying Functional Programs.",
                    "Towards the Formal Design of Self-Stabilizing Distributed Algorithms.",
                    "Axiomatizations of Temporal Logics on Trace Systems.",
                    "Capabilities and Complexity of Computations with Integer Division.",
                    "Extended Locally Definable Acceptance Types (Extended Abstract).",
                    "Gap-Definability as a Closure Property.",
                    "On the Logical Definability of Some Rational Trace Languages.",
                    "Solving Systems of Set Constraints using Tree Automata.",
                    "Complement Problems and Tree Automata in AC-like Theories (Extended Abstract).",
                    "Transparent (Holographic) Proofs.",
                    "Computing Symmetric Functions with AND/OR Circuits and a Single MAJORITY Gate.",
                    "Threshold Circuits for Iterated Multiplication: Using AC0 for Free.",
                    "A Non-Probabilistic Switching Lemma for the Sipser Function.",
                    "Frontiers of Feasible and Probabilistic Feasible Boolean Manipulation with Branching Programs.",
                    "On Syntactic Congruences for Omega-Languages.",
                    "Polynomial Time Algorithm for the Equivalence of two Morphisms on Omega-Regular Languages.",
                    "Locally Threshold Testable Languages of Infinite Words.",
                    "Deterministic Asynchronous Automata for Infinite Traces.",
                    "Recursive Automata on Infinite Words.",
                    "A Complexity Theoretic Approach to Incremental Computation.",
                    "Precise Average Case Complexity.",
                    "The Bit Probe Complexity Measure Revisited.",
                    "Language Learning With Some Negative Information.",
                    "Language Learning with a Bounded Number of Mind Changes.",
                    "Efficient Sharing of Many Secrets.",
                    "The KIV System: A Tool for Formal Program Development.",
                    "1st Grade - A System for Implementation, Testing and Animation of Graph Algorithms.",
                    "The Program Verifier Tatzelwurm.",
                    "LEDA: A Library of Efficient Data Types and Algorithms."
                ]
            }
        ]
    },
    {
        "year": "1992",
        "name": "9th STACS 1992",
        "info": "Cachan, France",
        "venues": [
            {
                "sub_name_abbr": "conf/stacs/1992",
                "sub_name": "STACS 92, 9th Annual Symposium on Theoretical Aspects of Computer Science, Cachan, France, February 13-15, 1992, Proceedings.",
                "count": 56,
                "papers": [
                    "Structuring and Modularizing Algebraic Specifications: The PLUSS Specification Language, Evolutions and Perspectives.",
                    "The Parallel Complexity of Tree Embedding Problems (Extended Abstract).",
                    "A Theory of Strict P-completeness.",
                    "Fast and Optimal Simulations between CRCW PRAMs.",
                    "Suitability of the Propositional Temporal Logic to Express Properties of Real-Time Systems.",
                    "Axiomatizations of Backtracking.",
                    "Joining k- and l-Recognizable Sets of Natural Numbers.",
                    "On the Performance of Networks with Multiple Busses.",
                    "Efficient Algorithms for Solving Systems of Linear Equations and Path Problems.",
                    "Efficient Sublinear Time Parallel Algorithms for Dynamic Programming and Context-Free Recognition.",
                    "A Simplified Technique for Hidden-Line Elimination in Terrains.",
                    "A Competitive Analysis of Nearest Neighbor Based Algorithms for Searching Unknown Scenes (Preliminary Version).",
                    "Equality and Disequality Constraints on Direct Subterms in Tree Automata.",
                    "Deterministic Regular Languages.",
                    "The Extended Low Hierarchy Is an Infinite Hierarchy.",
                    "Locally Definable Acceptance Types for Polynomial Time Machines.",
                    "The Theory of the Polynomial Many-One Degrees of Recursive Sets is Undecidable.",
                    "A Plane-Sweep Algorithm for Finding a Closest Pair Among Convex Planar Objects.",
                    "Linear Approximation of Simple Objects.",
                    "Language Learning without Overgeneralization.",
                    "The Log-Star Revolution.",
                    "Separating Counting Communication Complexity Classes.",
                    "A Nonlinear Lower Bound on the Practical Combinational Complexity.",
                    "Characterizations of Some Complexity Classes Between Theta^p_2 and Delta^p_2.",
                    "On Complexity Classes and Algorithmically Random Languages (Extended Abstract).",
                    "New Time Hierarchy Results for Deterministic TMs.",
                    "Unconditional Byzantine Agreement for any Number of Faulty Processors.",
                    "Broadcasting in Butterfly and DeBruijn Networks.",
                    "Interval Approximations of Message Causality in Distributed Executions.",
                    "On the Approximability of the Maximum Common Subgraph Problem.",
                    "The Complexity of Colouring Circle Graphs (Extended Abstract).",
                    "Graph Isomorphism is Low for PP.",
                    "A Simple Linear Time Algorithm for Triangulating Three-Colored Graphs.",
                    "On Locally Optimal Alignments in Genetic Sequences.",
                    "Secure Commitment Against A Powerful Adversary.",
                    "Communication Efficient Zero-Knowledge Proofs of Knowledge (With Applications to Electronic Cash).",
                    "Four Results on Randomized Incremental Constructions.",
                    "Enclosing Many Boxes by an Optimal Pair of Boxes.",
                    "Performance Driven k-Layer Wiring.",
                    "Synthesis for Testability: Binary Decision Diagrams.",
                    "Compression and Entropy.",
                    "Iterative Devices Generating Infinite Words.",
                    "On the Factorization Conjecture.",
                    "Conditional Seme-Thue Systems for Presenting Monoids.",
                    "A Combinatorial Bound for Linear Programming and Related Problems.",
                    "In-place Linear Probing Sort.",
                    "Speeding Up Two String-Matching Algorithms.",
                    "The ANIGRAF System.",
                    "A Programming Language for Symbolic Computation of Regular Languages, Automata and Semigroups.",
                    "Mu-SPEED: A System for the Specification and Verification of Microprocessors.",
                    "A Discrete Event Simulator of Communication Algorithms in Interconnection Networks.",
                    "Alpha du Centaur: An Environment for the Design of Systolic Arrays.",
                    "Verification of Communicating Processes by Means of Automata Reduction and Abstraction.",
                    "Distributed System Simulator (DSS).",
                    "An Interactive Proof Tool for Process Algebras.",
                    "SPECI90: A Term Rewriting and Narrowing System."
                ]
            }
        ]
    },
    {
        "year": "1991",
        "name": "8th STACS 1991",
        "info": "Hamburg, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/stacs/1991",
                "sub_name": "STACS 91, 8th Annual Symposium on Theoretical Aspects of Computer Science, Hamburg, Germany, February 14-16, 1991, Proceedings.",
                "count": 51,
                "papers": [
                    "Polymorphism, Parameterization and Typing: An Algebraic Specification Perspective.",
                    "Executable Higher-Order Algebraic Specifications.",
                    "Efficient Memory Access in Large-Scale Computation.",
                    "l-Occurrences of Avoidable Patterns.",
                    "Rational Ralations with Bounded Delay.",
                    "On the Power of Several Queues.",
                    "On Aperiodic Trace Languages.",
                    "Recognizable and Rational Languages of Finite and Infinite Traces.",
                    "On the Concatenation of Infinite Traces.",
                    "Tight RNC Approximations to Max Flow.",
                    "A Natural Metric for Curves - Computing the Distance for Polygonal Chains and Approximation Algorithms.",
                    "The Worst Case Complexity of McDiarmid and Reed's Variant of Bottom-Up-Heap Sort is Less Than n log n + 1.1n.",
                    "Decision Problems for Term Rewriting Systems and Recognizable Tree Languages.",
                    "Decidable Sentences for Context-Free Groups.",
                    "The Owner Concept for PRAMs.",
                    "Actors as a Parallel Programming Model.",
                    "Average Case Analysis of Unification Algorithms.",
                    "Methodology for Proving the Termination of Logic Programs.",
                    "Polynomial Size Constant Depth Circuits with a Limited Number of Negations.",
                    "Randomized Polynomials, Threshold Circuits, and the Polynomial Hierarchy.",
                    "Computationally Convincing Proofs of Knowledge.",
                    "Interactive Proof Systems and Alternating Time-Space Complexity.",
                    "Optimal Tradeoffs Between Time And Bit Complexity In Distributed Synchronous Rings.",
                    "Unconditional Byzantine Agreement with Good Majority.",
                    "A New Compacting Garbage-Collection Algorithm with a Good Average-Case Performance.",
                    "Bisimulation and Action Refinement.",
                    "Testing for Unboundedness of FIFO Channels.",
                    "Detection of Deadlocks in an Infinite Family of Nets.",
                    "Nondterminism Within P.",
                    "Structure and Importance of Logspace-MOD-Classes.",
                    "Complexity Classification of Truth Maintenance Systems.",
                    "Reachability in Reversible Free Choice Systems.",
                    "Compositional Generation of Home States in Free Choice Systems.",
                    "Bounded Reductions.",
                    "Functional Oracle Queries as a Measure of Parallel Time.",
                    "Optimal Parallel Recognition of Bracket Languages on Hypercubes.",
                    "Constant Queue Routing on a Mesh.",
                    "The Complexity of the Max Word Problem.",
                    "The Expressive Power of Second Order Horn Logic.",
                    "Tight Bounds on the Path Length of Binary Trees.",
                    "The Random Testability of the n-Input AND Gate.",
                    "An Observational Subset of First-Order Logic Cannot Specify the Behaviour of a Counter (Extended Abstract).",
                    "Unfolding, Procedural and Fixpoint Semantics of Logic Programs.",
                    "A Modal Semantics for the Negation as Failure and the Closed World Assumption Rules.",
                    "The RELVIEW-System.",
                    "Geometry Models Design System GammaPOM.",
                    "The PROSPECTRA System.",
                    "Prototype of a Verification Tool.",
                    "IPG - An Interactive Parser Generator.",
                    "A Placement System for Constrained Blocks with Flexible Shapes.",
                    "Algebraic Program Interpreter APREX2."
                ]
            }
        ]
    },
    {
        "year": "1990",
        "name": "7th STACS 1990",
        "info": "Rouen, France",
        "venues": [
            {
                "sub_name_abbr": "conf/stacs/1990",
                "sub_name": "STACS 90, 7th Annual Symposium on Theoretical Aspects of Computer Science, Rouen, France, February 22-24, 1990, Proceedings.",
                "count": 26,
                "papers": [
                    "A Note on the Almost-Everywhere Hierarchy for Nondeterministic Time.",
                    "The Ring of k-Regular Sequences.",
                    "Minimal Pairs and Complete Problems.",
                    "Hiding Instances in Multioracle Queries.",
                    "Counting Classes: Thresholds, Parity, Mods, and Fewness.",
                    "Playing Games of Incomplete Information.",
                    "Caterpillars and Context-Free Languages.",
                    "Semi-Commutations and Algebraic Languages.",
                    "Towards a Process Semantics in the Logic Programming Style.",
                    "Parallel Computations on Strings and Arrays.",
                    "Minimum Vertex Hulls for Polyhedral Domains.",
                    "Combinatorial Rewriting on Traces.",
                    "Kolmogorov Complexity, Restrited Nondeterminism and Generalized Spectra.",
                    "Relation-Sorted Algebraic Specifications with Built-in Coercers: Basic Notions and Results.",
                    "Computational Power of One-Way Multihead Finite Automata.",
                    "Updating Almost Complete Trees or One Level Makes All the Difference.",
                    "Sorting the Sums (xi+yj) in O(n²) Comparisons.",
                    "Efficient Checking of Computations.",
                    "Hard Promise Problems and Nonuniform Complexity.",
                    "On the Construction of Abstract Voronoi Diagrams.",
                    "Approximation of Convex Figures by Pairs of Rectangles.",
                    "Nonblocking Graphs: Greedy Algorithms to Compute Disjoint Paths.",
                    "Infinite Trees and Automaton Definable Relations over Omega-Words.",
                    "Enumerative Combinatorics and Computer Science.",
                    "Failures Semantics Based on Interval Semiwords is a Congruence for Refinement.",
                    "The Analysis of Local Search Problems and Their Heuristics."
                ]
            }
        ]
    },
    {
        "year": "1989",
        "name": "6th STACS 1989",
        "info": "Paderborn, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/stacs/1989",
                "sub_name": "STACS 89, 6th Annual Symposium on Theoretical Aspects of Computer Science, Paderborn, FRG, February 16-18, 1989, Proceedings.",
                "count": 51,
                "papers": [
                    "On Genuinely Time Bounded Compuations.",
                    "Unified Algebras and Action Semantics.",
                    "Properties of Infinite Words: Recent Result.",
                    "A First Order Logic for Partial Functions (Extended Abstract).",
                    "Observational Implementations.",
                    "On the Boundary of a Union of Rays.",
                    "Dynamic Planar Point Location with Optimal Query Time.",
                    "An O(n log n) Algorithm for Computing a Link Center in a Simple Polygon.",
                    "Polynomial Graph-Colorings.",
                    "Time-Optimal Simulations of Networks by Universal Parallel Computers.",
                    "Classes of Picture Languages that Cannot be Distinguished in the Chain Code Concept and Deletion of Redundant Retreats.",
                    "Linear Numeration Systems, Theta-Developments and Finite Automata.",
                    "A Generalization of Automatic Sequences.",
                    "Word Problems over TRaces Which are Solvable in Linear Time.",
                    "Computing Minimum Spanning Forests on 1- and 2-Dimensional Processor Arrays.",
                    "Parallel Computation of Discrete Voronoi Diagrams (Extended Abstract).",
                    "Successive Approximation in Parallel Graph Algorithms.",
                    "Reversals and Alternation.",
                    "On the Power of Parity Polynomial Time.",
                    "Complete Problems and Strong Polynomial Reducibilities.",
                    "If Deterministic and Nondeterministic Space Complexities are Equal for log log n then they are also Equal for log n.",
                    "On the Complexity of Approximating the Independent Set Problem.",
                    "Average Number of Messages for Distributed Leader Finding in Rings of Processors.",
                    "TIME vs BITS.",
                    "Distributed Computing on TRansitive Networks: The Thorus.",
                    "Time is Not a Healer.",
                    "Area Efficient Methods to Increase the Reliability of Combinatorial Circuits.",
                    "Fault Masking Probabilities with Single and Multiple Signature Analysis.",
                    "Chain Properties of Rule Closures.",
                    "It is Undecidable Whether the Knuth-Bendix Completion Procedure Generates a Crossed Pair.",
                    "Algebraic Specifications for Domain THeory.",
                    "The Query Topology in Logic Programming.",
                    "Testing Membership: Beyond Permutation Groups (Extended Abstract).",
                    "Membership in Plynomial Ideals over Q Is Exponential Space Complete.",
                    "Some Complexity Theoretic Aspects of AC Rewriting.",
                    "Deciding Bisimulation Equivalences for a Class of Non-Finite-State Programs.",
                    "Measure of Parallelism of Distributed Computations.",
                    "Decidability of Waek Fairness in Petri Nets.",
                    "New Results on the Generalized Star-Height Problem.",
                    "On the Equivalence Problem for Deterministic Multitape Automata and Transducers.",
                    "Deciding Equivalence of Finite Tree Automata.",
                    "Concatenable Segment Trees (Extended Abstract).",
                    "Shorest Edge-Disjoint Paths in Graphs.",
                    "Rounds versus Time for the Two Person Pebble Game (Extended Abstract).",
                    "AXE: The Syntax Driven Diagram Editor for Visual Languages used in the Software Engineering Environments AxIS.",
                    "Graph^Ed: An Interactive Garpg Editor.",
                    "SAMPLE: A Language Dependent Prototyping Environment.",
                    "Examining the Satisfiability of Formulas of Propositional Dynamic Logic.",
                    "AMORE: A System for Computing Automata, MOnoids, and Regular Expressions.",
                    "A Proof System for Type Theory and CCS.",
                    "Implementation of a Transition Sematics for Parallel Programs with Shared Variables."
                ]
            }
        ]
    },
    {
        "year": "1988",
        "name": "5th STACS 1988",
        "info": "Bordeaux, France",
        "venues": [
            {
                "sub_name_abbr": "conf/stacs/1988",
                "sub_name": "STACS 88, 5th Annual Symposium on Theoretical Aspects of Computer Science, Bordeaux, France, February 11-13, 1988, Proceedings.",
                "count": 43,
                "papers": [
                    "Geometry of Numbers and Integer Programming (Summary).",
                    "Getting Back to the Past in the Union-Find Problem.",
                    "On the Construction of Optimal Time Adders (Extended Abstract).",
                    "On Computations with Integer Division.",
                    "Maintaining Range Trees in Secondary Memory (Extended Abstract).",
                    "Solving Parametric Problems on Trees.",
                    "On the k-Colouring of Circle-Graphs.",
                    "Functional Equations for Data Structures.",
                    "The Power of Polynomial Size Omega-Branching Programs.",
                    "Collapsing Oracle Hierarchies, Census Functions and Logarithmically Many Queries.",
                    "Domino Games with an Application to the Complexity of Boolean Algebras with Bounded Quantifier Alternations.",
                    "An Automatic Speed-up of Random Access Machines with Powerful Arithmetic Instructions.",
                    "Characterizing the Polynomial Hierarchy by Alternating Auxiliary Pushdown Automata.",
                    "Hotz-Isomorphism Theorems in Formal Language Theory.",
                    "First-Order Properties of Trees, Star-Free Expressions, adn Aperiodicity.",
                    "Cyclic Rational Transductions and Polynomials of Rational Functions.",
                    "Construction of a Family of Finite Maximal Codes.",
                    "Fonctions Génératrices Transcendantes à Coefficients Engendrés par Automates.",
                    "The Relation of Two Patterns with Comparable Languages.",
                    "Hierarchical Contextual Rewriting with Several Levels.",
                    "Generalized Bisimulation in Relational Specifications.",
                    "On Polynomial Time Graph Grammars.",
                    "An Axiomatic Definition of Context-Free Rewriting and its Application to NLC Graph Grammars.",
                    "Efficient Distributed Algorithms by Using the Archemedean Time Assumption.",
                    "A Simple Protocol for Secure Circuit Evaluation.",
                    "Scheduling Independent Jobs on Hypercubes.",
                    "Voronoi Diagrams Based on General Metrics in the Plane.",
                    "Geometric Containment, Common Roots of Polynomials and Partial Orders.",
                    "Extension of the Notion of Map and Subdivisions of a Three-Dimensional Space.",
                    "An Optimal Algorithm for Detecting Weak Visibility of a Polygon (Preliminary Version).",
                    "Polygon Placement Under Translation and Rotation.",
                    "On the Existence of the Minimum Asynchronous Automaton and on Decision Problems for Unambiguous Regular Trace Languages.",
                    "On Morphisms of Trace Monoids.",
                    "An Automaton Characterization of Fairness in SCCS.",
                    "A Compositional Semantics for Concurrent Prolog.",
                    "Functions and Relations: The GRAAL System.",
                    "LPC: A Concurrent Programming Laboratory.",
                    "Darwin: Computer Algebra and Enumerative Combinatorics.",
                    "Some Tools for an Inference Laboratory (ATINF).",
                    "MODULOG and the MODULA WorkStation.",
                    "The Granules, Blutton: An Idea, an Algorithm to Implement on Multiprocessor.",
                    "Prototype de Venus: Un Outil d'Aide à la Verification de Systemes Communicants.",
                    "PLEXUS: A System for Implementing Hierarchical Graph Algorithms."
                ]
            }
        ]
    },
    {
        "year": "1987",
        "name": "4th STACS 1987",
        "info": "Passau, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/stacs/1987",
                "sub_name": "STACS 87, 4th Annual Symposium on Theoretical Aspects of Computer Science, Passau, Germany, February 19-21, 1987, Proceedings.",
                "count": 47,
                "papers": [
                    "Towards a Theory of Relativizations: Positive Relativizations.",
                    "Natural Semantics.",
                    "On Local Routing of Two-Terminal Nets.",
                    "Geometric Relations Among Voronoi Diagrams.",
                    "Finding the Largest Empty Rectangle on a Grated Surface.",
                    "Efficient Graph Algorithm Using Limited Communication on a Fixed-Size Array of Processors.",
                    "On Selecting the Largest Element in Spite of Erroneous Information.",
                    "The Correlation Between the Complexities of the Nonhierarchical and Hierarchical Versions of Graph Problems.",
                    "Graph Isomorphism is in the Low Hierarchy.",
                    "A Hierarchy Theorem for Almost Everywhere Complex Sets With Application to Polynomial Complexity Degrees.",
                    "Self-Reducibility.",
                    "Probability One Separation of the Boolean Hierarchy.",
                    "Reversal Complexity of Multicounter and Multihead Machines.",
                    "Computing the Counting Function of Context-Free Languages.",
                    "On the k-Freeness of Morphisms on Free Monoids.",
                    "Avoidable Patterns on 2 Letters.",
                    "Polynomial Operations on Rational Languages.",
                    "Some Structural Aspects of Hypergraph Languages Generated by Hyperedge Replacement.",
                    "Specification and Implementation of Concurrently Accessed Data Structures: An Abstract Data Type Approach.",
                    "On Implementations of Loose Abstract Data Type Specifications and Their Vertical Composition.",
                    "Are Homomorphisms Sufficient for Behavioural Implementations of Deterministic and Nondeterministic Data Types?",
                    "Some Remarks on Presentations by Finite Church-Rosser Thue Systems.",
                    "Ground Term Confluence in Parametric Conditional Equational Specifications.",
                    "Describing Semantic Domains with Sprouts.",
                    "Comparing Direct and Continuation Semantics Styles for Concurrent Languages: Revisiting an Old Problem from a New Viewpoint.",
                    "Expressibility of First Order Logic with a Nondeterministic Inductive Operator.",
                    "Bounded Nondeterminism and the Approximation Induction Principle in Process Algebra.",
                    "The Step Failure Semantics.",
                    "On the Complexity of Containment, Equivalence and Reachability for Finite and 2-Dimensional Vector Addition Systems with States.",
                    "Closure Properties of Deterministic Petri Nets.",
                    "Some Results on Fairness: The Regular Case.",
                    "Decidability Questions for Fairness in Petri Nets.",
                    "Optimal Sorting on Multi-Dimensionally Mesh-Connected Computers.",
                    "On the Contact-Minimization-Problem.",
                    "Making Distributed Spanning Tree Algorithms Fault-Resilient.",
                    "The Derivation of on-the-fly Garbage Collection Algorithms from Distributed Termination Detection Protocols.",
                    "On the Expected Complexity of Distributed Selection.",
                    "LPG: A Generic, Logic and Functional Programming Language.",
                    "CEC (Conditional Equations Completion).",
                    "Asspegique: An Integrated Specification Environment.",
                    "REVEUR4: A Laboratory for Conditional Rewriting.",
                    "An Interactive, Incremental and Portable Computer Algebra System for Lambda-Calculus and Combinatory Logic Based on Video Edition and Rewriting Techniques.",
                    "The Passau RAP System: Rapid Prototyping for Algebraic Specifications.",
                    "SPRAC: A Software Engineering Environment.",
                    "SLOG: A Logic Interpreter for Equational Clauses.",
                    "An Algebraic Transformation System for Occam Programs.",
                    "REVE: A Rewrite Rule Laboratory."
                ]
            }
        ]
    },
    {
        "year": "1986",
        "name": "3rd STACS 1986",
        "info": "Orsay, France",
        "venues": [
            {
                "sub_name_abbr": "conf/stacs/1986",
                "sub_name": "STACS 86, 3rd Annual Symposium on Theoretical Aspects of Computer Science, Orsay, France, January 16-18, 1986, Proceedings.",
                "count": 30,
                "papers": [
                    "Abstract Interpretation of Denotational Definions (A Survey).",
                    "Temporal Reasoning Under Generalized Fairness Constraints.",
                    "Décidabiité de l'égalité des Languages Algébriques Infinitaires Simples.",
                    "Some Probabilistic Powerdomains in the Category SFP.",
                    "Icons and Local Definitions in Logic Programming.",
                    "Input Sensitive, Optimal Parallel Randomized Algorithms for Addition and Identification.",
                    "A Parallel Statistical Cooling Algorithm.",
                    "Subgraph Isomorphism for Biconnected Outerplanar Graphs in Cubic Time.",
                    "Polynomial Time Algorithms for Finding Integer Relations Among Real Numbers.",
                    "New Upperbounds for Decentralized Extrema-Finding in a Ring of Processors.",
                    "Algorithms for Visibility Representations of Planar Graphs.",
                    "Speeding up Random Access Machines by Few Processors.",
                    "Efficient Algorithms for Finding Minimum Spanning Forests of Hierarchically Defined Graphs.",
                    "On Sparseness, Ambiguity and other Decision Problems for Acceptors and Transducers.",
                    "Variétés de Semis Groupes et Mots Infinis.",
                    "Equations in Free Partially Commutative Monoids.",
                    "Separating and Testing.",
                    "Décomposition de Fonctions Rationnelles.",
                    "Long Unavoidable Patterns.",
                    "Abstract Implementations and Correctness Proofs.",
                    "Strictness and Serializability.",
                    "Towards Specification and Proof of Asynchronous Systems.",
                    "Monotone Boolean Formulas, Distributive Lattices, and the Complexities of Logics, Algebraic Structures, and Computation Structures (Preliminary Report).",
                    "Concurrent Conciseness of Degree, Probabilistic, Nondeterministic and Deterministic Finite Automata (Extended Abstract).",
                    "Logspace Hierarchies, Polynomial Time and the Complexity of Fairness Problems Concerning omega-Machines.",
                    "On Sparse Oracles Separating Feasible Complexity Classes.",
                    "On Generalized Kolmogorov Complexity.",
                    "Area-time Optimal Division for T=Omega(log n)1+epsilon.",
                    "A Time-Space Tradeoff for Element Distinctness.",
                    "Parallel Machines and their Communication Theoretical Limits."
                ]
            }
        ]
    },
    {
        "year": "1985",
        "name": "2nd STACS 1985",
        "info": "Saarbrücken, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/stacs/1985",
                "sub_name": "STACS 85, 2nd Symposium of Theoretical Aspects of Computer Science, Saarbrücken, Germany, January 3-5, 1985, Proceedings.",
                "count": 36,
                "papers": [
                    "On the Relative Complexity of Subproblems of Intractable Problems.",
                    "On Lovász' Lattice Reduction and the Nearest Lattice Point Problem (Shortened Version).",
                    "Layouts with Wires of Balanced Length.",
                    "On the Single-Operation Worst-Case Time Complexity on the Disjoint Set Union Problem.",
                    "Deterministic Languages and Non-Generators.",
                    "Simulation of Large Networks on Smaller Networks.",
                    "Petri Nets and Algebraic Calculi of Processes.",
                    "Non-Deterministic Two-Tape Automata are More Powerful Then Deterministic Ones.",
                    "Construction of a Family of Factorizing Codes.",
                    "On Hotz Groups and Homomorphic Images of Sentential Form Languages.",
                    "Using Domain Algebras to Prove the Correctness of a Compiler.",
                    "Sorting and Recognition Problems for Ordered Sets.",
                    "Tree Automata and Logic Programs.",
                    "Structure of Relations Satisfying Certain Families of Dependencies.",
                    "A Single Source Shortest Path Algorithm for a Planar Distributed Network.",
                    "An Algorithm for Two-Layer Channel Routing.",
                    "New Algorithms for Special Cases of the Hidden Line Elimination Problem.",
                    "An Algorithm to Construct Minkowski-Reduced Lattice-Bases.",
                    "Base non finie de varietes.",
                    "Proximity of a Grid.",
                    "An O(N^(1.5+epsilon)) Expected Time Algorithm for Canonization and Isomorphism Testing of Trivalent Garphs.",
                    "On the Complexity of Deadlock Recovery.",
                    "On the Planar Monotone Computation of Threshold Functions.",
                    "Planar Circuits Have Short Specifications.",
                    "Shortest Paths on Polyhedral Surfaces.",
                    "Fairness in Context-Free Grammars under Canonical Derivations.",
                    "Distributed Termination in CSP: Symmetric Solutions with Minimal Storage.",
                    "A Dynamization of the All Pairs Least Cost Path Problem.",
                    "Boundedness, Empty Channel Detection and Synchronization for Communicating Finite State Machines.",
                    "Deriving Stack Semantics Congruent to Standard Denotational Semantics.",
                    "Translating Polygons in the Plane.",
                    "Geometric Containment is not Reducible to Pareto Dominance.",
                    "The Volume of the Union of Many Sheres and Point Inclusion Problems.",
                    "Combined Simplicity and Immunity in Relativized NP.",
                    "Groups, Codes and Unambiguous Automata.",
                    "Reduced Memory Space for Multi-Dimensional Search Trees (Extended Abstract)."
                ]
            }
        ]
    },
    {
        "year": "1984",
        "name": "1st STACS 1984",
        "info": "Paris, France",
        "venues": [
            {
                "sub_name_abbr": "conf/stacs/1984",
                "sub_name": "STACS 84, Symposium of Theoretical Aspects of Computer Science, Paris, France, 11-13 April, 1984, Proceedings.",
                "count": 30,
                "papers": [
                    "Key-Problems and Key-Methods in Computational Geormetry.",
                    "Some Recent Results on Squarefree Words.",
                    "Transformations Realizing Fairness Assumptions for Parallel Programs.",
                    "Computing the Largest Empty Rectangle.",
                    "Approximation Schemes for Covering and Packing Problems in Robotics and VLSI.",
                    "Covering Polygons with Minimum Number of Rectangles.",
                    "On Expressive Interpretations of a Hoare-Logic for Clarke's Language L4.",
                    "Towards Executable Specifications Using Conditional Axioms.",
                    "Proprietes Church-Rosser de systemes de reecriture equationnels ayant la propriete de terminaison faible.",
                    "On a General Weight of Trees.",
                    "From Expanders to Better Superconcentrators without Cascading.",
                    "Locally Synchronous Complexity in the Light of the Trans-Box Method.",
                    "A New Definition of Morphism on Petri Nets.",
                    "Blocage et vivacité dans les réseaux a pile-file.",
                    "Denotational Semantics of Concurrent Programs with Shared Memory.",
                    "Higher Order Data Structures: Cartesian Closure Versus Lambda-Calculus.",
                    "Computability in Higher Types and the Universal Domain P_omega.",
                    "On the Structure of Polynomial Time Degrees.",
                    "Optimal Layouts of the Tree of Meshes with Vertices on the Perimeter of the Bounding Convex Region.",
                    "Efficient Simulations among Several Models of Parallel Computers.",
                    "Bornes inferieures sur la complexite des facteurs des mots infinis engendres par morphimes iteres.",
                    "Adherence Equivalence Is Decidable for DOL Languages.",
                    "Pushdown Space Complexity and Related Full-AFLs.",
                    "Automates a pile sur des alphabets infinis.",
                    "Logic Programs and Many-Valued Logic.",
                    "Algebre de machines et logique temporelle.",
                    "Algebraic and Topological Theory of Languages and Computation, Part I: Theorems for Arbitrary Labguages Generalizing the Theorems of Eilenberg, Kleene, Schützenberger and Straubing.",
                    "A Property of Three-Element Codes.",
                    "Polynomial Time Inference of General Pattern Languages.",
                    "On Extendibility of Unavoidable Sets."
                ]
            }
        ]
    }
]