[
    {
        "name": "TALG",
        "year": "2022",
        "info": "Volume 18: 2022",
        "count": 10,
        "papers": [
            "Algorithms for Weighted Independent Transversals and Strong Colouring.",
            "A Simple Algorithm for Optimal Search Trees with Two-way Comparisons.",
            "Dynamic Distribution-Sensitive Point Location.",
            "Introduction to the ACM-SIAM Symposium on Discrete Algorithms (SODA) 2019 Special Issue.",
            "Polynomial-time Algorithm for Maximum Weight Independent Set on P6-free Graphs.",
            "I/O-Efficient Algorithms for Topological Sort and Related Problems.",
            "SETH-based Lower Bounds for Subset Sum and Bicriteria Path.",
            "Optimal Las Vegas Approximate Near Neighbors in ℓp.",
            "Tight Bounds for ℓ1 Oblivious Subspace Embeddings.",
            "Max Flows in Planar Graphs with Vertex Capacities."
        ]
    },
    {
        "name": "TALG",
        "year": "2021",
        "info": "Volume 17: 2021",
        "count": 37,
        "papers": [
            "Oblivious Resampling Oracles and Parallel Algorithms for the Lopsided Lovász Local Lemma.",
            "Deterministic APSP, Orthogonal Vectors, and More: Quickly Derandomizing Razborov-Smolensky.",
            "Tight Bounds for Online TSP on the Line.",
            "Zeros of Holant Problems: Locations and Algorithms.",
            "Fine-grained Complexity Analysis of Two Classic TSP Variants.",
            "Randomized Contractions Meet Lean Decompositions.",
            "Optimal Substring Equality Queries with Applications to Sparse Text Indexing.",
            "Optimal-Time Dictionary-Compressed Indexes.",
            "Journey to the Center of the Point Set.",
            "r-Simple k-Path and Related Problems Parameterized by k/r.",
            "2-Approximating Feedback Vertex Set in Tournaments.",
            "Parameterized Approximation Algorithms for Bidirected Steiner Network Problems.",
            "Finding a Shortest Odd Hole.",
            "Node-weighted Network Design in Planar and Minor-closed Families of Graphs.",
            "Navigating in Trees with Permanently Noisy Advice.",
            "Graph Sparsification for Derandomizing Massively Parallel Computation with Low Space.",
            "Sparse Backbone and Optimal Distributed SINR Algorithms.",
            "Memory-Adjustable Navigation Piles with Applications to Sorting and Convex Hulls.",
            "Editorial.",
            "Improving the Smoothed Complexity of FLIP for Max Cut Problems.",
            "The Infinite Server Problem.",
            "The Combined Basic LP and Affine IP Relaxation for Promise VCSPs on Infinite Domains.",
            "The Complexity of Approximately Counting Retractions to Square-free Graphs.",
            "Online Service with Delay.",
            "On β-Plurality Points in Spatial Voting Games.",
            "Discrete Fréchet Distance under Translation: Conditional Hardness and an Improved Algorithm.",
            "Approximate Counting of k-Paths: Simpler, Deterministic, and in Polynomial Space.",
            "The Quest for Strong Inapproximability Results with Perfect Completeness.",
            "Sublinear Random Access Generators for Preferential Attachment Graphs.",
            "A Deamortization Approach for Dynamic Spanner and Dynamic Maximal Matching.",
            "Smaller Cuts, Higher Lower Bounds.",
            "Querying a Matrix through Matrix-Vector Products.",
            "The Complexity of the Ideal Membership Problem for Constrained Problems Over the Boolean Domain.",
            "Approximating Geometric Knapsack via L-packings.",
            "Zip Trees.",
            "Approximation Algorithms for the Bottleneck Asymmetric Traveling Salesman Problem.",
            "Better Distance Preservers and Additive Spanners."
        ]
    },
    {
        "name": "TALG",
        "year": "2020",
        "info": "Volume 16: 2020",
        "count": 54,
        "papers": [
            "Introduction to the Special Issue on SODA'18.",
            "A Faster Algorithm for Minimum-cost Bipartite Perfect Matching in Planar Graphs.",
            "Optimal Streaming and Tracking Distinct Elements with High Probability.",
            "A New Algorithm for Fast Generalized DFTs.",
            "Proximity Results and Faster Algorithms for Integer Programming Using the Steinitz Lemma.",
            "Tight Analysis of Parallel Randomized Greedy MIS.",
            "More Logarithmic-factor Speedups for 3SUM, (median, +)-convolution, and Some Geometric 3SUM-hard Problems.",
            "Distributed Edge Coloring and a Special Case of the Constructive Lovász Local Lemma.",
            "Scheduling When You Do Not Know the Number of Machines.",
            "Algorithms to Approximate Column-sparse Packing Problems.",
            "Solving the Sigma-Tau Problem.",
            "Approximation Schemes for Low-rank Binary Matrix Approximation Problems.",
            "A Time- and Message-Optimal Distributed Algorithm for Minimum Spanning Trees.",
            "Randomized Memoryless Algorithms for the Weighted and the Generalized k-server Problems.",
            "Faster Replacement Paths and Distance Sensitivity Oracles.",
            "Submatrix Maximum Queries in Monge and Partial Monge Matrices Are Equivalent to Predecessor Search.",
            "Linear-time String Indexing and Analysis in Small Space.",
            "Testing Bounded Arboricity.",
            "Ramsey Spanning Trees and Their Applications.",
            "Doubly Balanced Connected Graph Partitioning.",
            "Subexponential Algorithms for Rectilinear Steiner Tree and Arborescence Problems.",
            "k-center Clustering under Perturbation Resilience.",
            "Holant Clones and the Approximability of Conservative Holant Problems.",
            "A Unified PTAS for Prize Collecting TSP and Steiner Tree Problem in Doubling Metrics.",
            "Lower Bounds for the Parameterized Complexity of Minimum Fill-in and Other Completion Problems.",
            "Fully Dynamic MIS in Uniformly Sparse Graphs.",
            "A Linear-Time Algorithm for Seeds Computation.",
            "Nearly ETH-tight Algorithms for Planar Steiner Tree with Terminals on Few Faces.",
            "The Complexity of Cake Cutting with Unequal Shares.",
            "Periods of Iterations of Functions with Restricted Preimage Sizes.",
            "Tight Bounds on Online Checkpointing Algorithms.",
            "Covering Small Independent Sets and Separators with Applications to Parameterized Algorithms.",
            "Approximating Spanners and Directed Steiner Forest: Upper and Lower Bounds.",
            "An Improved Isomorphism Test for Bounded-tree-width Graphs.",
            "Time- and Space-optimal Algorithm for the Many-visits TSP.",
            "Structure Learning of H-Colorings.",
            "Random Walks on Small World Networks.",
            "A PTAS for Euclidean TSP with Hyperplane Neighborhoods.",
            "Enumerating Minimal Dominating Sets in Kt-free Graphs and Variants.",
            "Clustering in Hypergraphs to Minimize Average Edge Service Time.",
            "Improved Dynamic Graph Coloring.",
            "Parameterized Hardness of Art Gallery Problems.",
            "Symmetry Exploitation for Online Machine Covering with Bounded Migration.",
            "Approximate Single-Source Fault Tolerant Shortest Path.",
            "Dynamic Parameterized Problems and Algorithms.",
            "The Non-Uniform k-Center Problem.",
            "A Colored Path Problem and Its Applications.",
            "Tree Edit Distance Cannot be Computed in Strongly Subcubic Time (Unless APSP Can).",
            "Maximum Matching in the Online Batch-arrival Model.",
            "Deterministic Sparse Suffix Sorting in the Restore Model.",
            "Polylogarithmic Approximation Algorithms for Weighted-ℱ-deletion Problems.",
            "Edge Estimation with Independent Set Oracles.",
            "A Complexity Theoretical Study of Fuzzy K-Means.",
            "Point-Width and Max-CSPs."
        ]
    },
    {
        "name": "TALG",
        "year": "2019",
        "info": "Volume 15: 2019",
        "count": 55,
        "papers": [
            "Distribution-free Junta Testing.",
            "An Optimal Algorithm for ℓ1-Heavy Hitters in Insertion Streams and Related Problems.",
            "Entropy and Optimal Compression of Some General Plane Trees.",
            "Efficient Algorithms for Constructing Very Sparse Spanners and Emulators.",
            "The Simplex Algorithm Is NP-Mighty.",
            "An O(log k)-Competitive Algorithm for Generalized Caching.",
            "The Complexity of Independent Set Reconfiguration on Bipartite Graphs.",
            "Deterministic Graph Exploration with Advice.",
            "Clique-width III: Hamiltonian Cycle and the Odd Case of Graph Coloring.",
            "Improved Analysis of Deterministic Load-Balancing Schemes.",
            "Feedback Vertex Set Inspired Kernel for Chordal Vertex Deletion.",
            "Common Tangents of Two Disjoint Polygons in Linear Time and Constant Workspace.",
            "Subquadratic Kernels for Implicit 3-Hitting Set and 3-Set Packing Problems.",
            "On Problems Equivalent to (min, +)-Convolution.",
            "A Dual Descent Algorithm for Node-capacitated Multiflow Problems and Its Applications.",
            "Editorial.",
            "Introduction to the Special Issue on SODA 2017.",
            "A (2+ε)-Approximation for Maximum Weight Matching in the Semi-streaming Model.",
            "Beating Approximation Factor Two for Weighted Tree Augmentation with Bounded Costs.",
            "Firefighting on Trees Beyond Integrality Gaps.",
            "Subquadratic Algorithms for the Diameter and the Sum of Pairwise Distances in Planar Graphs.",
            "Even Delta-Matroids and the Complexity of Planar Boolean CSPs.",
            "Completeness for First-order Properties on Sparse Structures with Algorithmic Applications.",
            "Polynomial Kernels and Wideness Properties of Nowhere Dense Graph Classes.",
            "Domination When the Stars Are Out.",
            "Approximation Schemes for Clustering with Outliers.",
            "Metastability of the Logit Dynamics for Asymptotically Well-Behaved Potential Games.",
            "The (h, k)-Server Problem on Bounded Depth Trees.",
            "Sparse Dynamic Programming on DAGs with Small Width.",
            "Online Submodular Maximization with Preemption.",
            "Approximation Schemes for Machine Scheduling with Resource (In-)dependent Processing Times.",
            "Sparse Approximation via Generating Point Sets.",
            "Fully Polynomial FPT Algorithms for Some Classes of Bounded Clique-width Graphs.",
            "Locating Errors in Faulty Formulas.",
            "Bloom Filters in Adversarial Environments.",
            "A Lottery Model for Center-Type Problems With Outliers.",
            "Ascending-Price Algorithms for Unknown Markets.",
            "Online Vertex-Weighted Bipartite Matching: Beating 1-1/e with Random Arrivals.",
            "Distributed Dominating Set Approximations beyond Planar Graphs.",
            "Faster Pseudopolynomial Time Algorithms for Subset Sum.",
            "Generalized Center Problems with Outliers.",
            "Deciding the Confusability of Words under Tandem Repeats in Linear Time.",
            "Derandomized Concentration Bounds for Polynomials, and Hypergraph Maximal Independent Set.",
            "A Tractable Class of Binary VCSPs via M-Convex Intersection.",
            "Faster Carry Bit Computation for Adder Circuits with Prescribed Arrival Times.",
            "Dynamic Beats Fixed: On Phase-based Algorithms for File Migration.",
            "Faster Approximation Schemes for the Two-Dimensional Knapsack Problem.",
            "An Optimal O(nm) Algorithm for Enumerating All Walks Common to All Closed Edge-covering Walks of a Graph.",
            "Exponential Separations in the Energy Complexity of Leader Election.",
            "Recognizing Weak Embeddings of Graphs.",
            "Heavy Hitters and the Structure of Local Privacy.",
            "Spanning Circuits in Regular Matroids.",
            "Ordered Level Planarity and Its Relationship to Geodesic Planarity, Bi-Monotonicity, and Variations of Level Planarity.",
            "Improving TSP Tours Using Dynamic Programming over Tree Decompositions.",
            "A 4/3-Approximation Algorithm for the Minimum 2-Edge Connected Subgraph Problem."
        ]
    },
    {
        "name": "TALG",
        "year": "2018",
        "info": "Volume 14: 2018",
        "count": 56,
        "papers": [
            "Cache-Oblivious Buffer Heap and Cache-Efficient Computation of Shortest Paths in Graphs.",
            "The Parametric Closure Problem.",
            "Independence and Efficient Domination on P6-free Graphs.",
            "Binary Adder Circuits of Asymptotically Minimum Depth, Linear Size, and Fan-Out Two.",
            "Primal Dual Gives Almost Optimal Energy-Efficient Online Algorithms.",
            "Kernels for (Connected) Dominating Set on Graphs with Excluded Topological Minors.",
            "Linear Time Parameterized Algorithms for Subset Feedback Vertex Set.",
            "Scaling Algorithms for Weighted Matching in General Graphs.",
            "Reducing Curse of Dimensionality: Improved PTAS for TSP (with Neighborhoods) in Doubling Metrics.",
            "Fault-Tolerant Approximate BFS Structures.",
            "Selection and Sorting in the \"Restore\" Model.",
            "Analyzing Node-Weighted Oblivious Matching Problem via Continuous LP with Jump Discontinuity.",
            "Known Algorithms on Graphs of Bounded Treewidth Are Probably Optimal.",
            "Deterministic Truncation of Linear Matroids.",
            "Efficient Computation of Middle Levels Gray Codes.",
            "Approximation Algorithms for Minimum-Load k-Facility Location.",
            "Incremental Exact Min-Cut in Polylogarithmic Amortized Update Time.",
            "Randomized Embeddings with Slack and High-Dimensional Approximate Nearest Neighbor.",
            "The Alternating Stock Size Problem and the Gasoline Puzzle.",
            "Perfect Phylogenies via Branchings in Acyclic Digraphs and a Generalization of Dilworth's Theorem.",
            "Distributed Online and Stochastic Queueing on a Multiple Access Channel.",
            "Computing 2-Walks in Polynomial Time.",
            "Tight Space Bounds for Two-Dimensional Approximate Range Counting.",
            "Computing the Gromov-Hausdorff Distance for Metric Trees.",
            "Exact Algorithms for Terrain Guarding.",
            "Editorial: ACM-SIAM Symposium on Discrete Algorithms (SODA) 2016 Special Issue.",
            "Subtree Isomorphism Revisited.",
            "On the Integrality Gap of Degree-4 Sum of Squares for Planted Clique.",
            "CoveringLSH: Locality-Sensitive Hashing without False Negatives.",
            "Improved Deterministic Algorithms for Linear Programming in Low Dimensions.",
            "A Faster Subquadratic Algorithm for Finding Outlier Correlations.",
            "Deterministic Algorithms for Submodular Maximization Problems.",
            "Near-Optimal Light Spanners.",
            "Fully Polynomial-Time Parameterized Computations for Graphs and Matrices of Low Treewidth.",
            "Subexponential Parameterized Algorithm for Interval Completion.",
            "Faster Algorithms for Computing Plurality Points.",
            "Erratum: Approximating Minimum-Cost Connectivity Problems via Uncrossable Bifamilies.",
            "Exploring the Complexity of Layout Parameters in Tournaments and Semicomplete Digraphs.",
            "Data Structures for Weighted Matching and Extensions to b-matching and f-factors.",
            "Graph Reconstruction and Verification.",
            "Batched Point Location in SINR Diagrams via Algebraic Tools.",
            "Conditional Lower Bounds for All-Pairs Max-Flow.",
            "The Dependent Doors Problem: An Investigation into Sequential Decisions without Feedback.",
            "An Efficient Representation for Filtrations of Simplicial Complexes.",
            "Approximation Guarantees for the Minimum Linear Arrangement Problem by Higher Eigenvalues.",
            "An Efficient Algorithm for Computing High-Quality Paths amid Polygonal Obstacles.",
            "Deterministic Parallel Algorithms for Fooling Polylogarithmic Juntas and the Lovász Local Lemma.",
            "Streaming Algorithms for Estimating the Matching Size in Planar Graphs and Beyond.",
            "Adaptive Computation of the Swap-Insert Correction Distance.",
            "Dynamic Time Warping and Geometric Edit Distance: Breaking the Quadratic Barrier.",
            "Packing Groups of Items into Multiple Knapsacks.",
            "Stream Sampling Framework and Application for Frequency Cap Statistics.",
            "Network Sparsification for Steiner Problems on Planar and Bounded-Genus Graphs.",
            "Windrose Planarity: Embedding Graphs with Direction-Constrained Edges.",
            "A Mazing 2+ϵ Approximation for Unsplittable Flow on a Path.",
            "Online Submodular Maximization with Free Disposal."
        ]
    },
    {
        "name": "TALG",
        "year": "2016",
        "info": "Volume 13: 2016/2017",
        "count": 55,
        "papers": [
            "Inapproximability of the Multilevel Uncapacitated Facility Location Problem.",
            "Better Balance by Being Biased: A 0.8776-Approximation for Max Bisection.",
            "Nearest-Neighbor Searching Under Uncertainty II.",
            "Tabulating Pseudoprimes and Tabulating Liars.",
            "An Improved Approximation Algorithm for the Edge-Disjoint Paths Problem with Congestion Two.",
            "Semi-Streaming Set Cover.",
            "On the Tradeoff between Stability and Fit.",
            "How Good Is Multi-Pivot Quicksort?",
            "2-Edge Connectivity in Directed Graphs.",
            "Smoothed Analysis of the 2-Opt Algorithm for the General TSP.",
            "Sparse Fault-Tolerant BFS Structures.",
            "Waste Makes Haste: Bounded Time Algorithms for Envy-Free Cake Cutting with Free Disposal.",
            "Minimum Latency Submodular Cover.",
            "Cheeger-Type Approximation for Sparsest st-Cut.",
            "A New Approach to Online Scheduling: Approximating the Optimal Competitive Ratio.",
            "Algorithms for Hub Label Optimization.",
            "Lopsidependency in the Moser-Tardos Framework: Beyond the Lopsided Lovász Local Lemma.",
            "Editorial.",
            "Tight Bounds on Vertex Connectivity Under Sampling.",
            "Property Testing on Product Distributions: Optimal Testers for Bounded Derivative Properties.",
            "Dynamic Facility Location via Exponential Clocks.",
            "On Uniform Capacitated k-Median Beyond the Natural LP Relaxation.",
            "An Improved Approximation for k-Median and Positive Correlation in Budgeted Optimization.",
            "Generating Random Permutations by Coin Tossing: Classical Algorithms, New Analysis, and Modern Implementation.",
            "Smoothed Analysis of Local Search for the Maximum-Cut Problem.",
            "Submatrix Maximum Queries in Monge Matrices and Partial Monge Matrices, and Their Applications.",
            "A Fast and Simple Surface Reconstruction Algorithm.",
            "Asymptotically Optimal Encodings of Range Data Structures for Selection and Top-k Queries.",
            "Discovering Archipelagos of Tractability for Constraint Satisfaction and Counting.",
            "Faster and Simpler Sketches of Valuation Functions.",
            "Time vs. Information Tradeoffs for Leader Election in Anonymous Trees.",
            "For-All Sparse Recovery in Near-Optimal Time.",
            "Algorithmic and Enumerative Aspects of the Moser-Tardos Distribution.",
            "Nearly Optimal Deterministic Algorithm for Sparse Walsh-Hadamard Transform.",
            "Uniform Kernelization Complexity of Hitting Forbidden Minors.",
            "Representative Families of Product Families.",
            "Combinatorial Algorithm for Restricted Max-Min Fair Allocation.",
            "Cost-Oblivious Storage Reallocation.",
            "Maximizing Symmetric Submodular Functions.",
            "Improved Approximation Algorithm for Steiner k-Forest with Nearly Uniform Weights.",
            "Max-Sum Diversification, Monotone Submodular Functions, and Dynamic Updates.",
            "Hollow Heaps.",
            "Tight Kernel Bounds for Problems on Graphs with Small Degeneracy.",
            "Separate, Measure and Conquer: Faster Polynomial-Space Algorithms for Max 2-CSP and Counting Dominating Sets.",
            "A Data Structure for Nearest Common Ancestors with Linking.",
            "Linear-Time Parameterized Algorithms via Skew-Symmetric Multicuts.",
            "Exact and Asymptotic Solutions of a Divide-and-Conquer Recurrence Dividing at Half: Theory and Applications.",
            "Counting Thin Subgraphs via Packings Faster than Meet-in-the-Middle Time.",
            "Spider Covers for Prize-Collecting Network Activation Problem.",
            "Distributed Private Data Analysis: Lower Bounds and Practical Constructions.",
            "Sublinear-Time Maintenance of Breadth-First Spanning Trees in Partially Dynamic Networks.",
            "Approximation Algorithms for Computing Maximin Share Allocations.",
            "Parallel Algorithms and Concentration Bounds for the Lovász Local Lemma via Witness DAGs.",
            "Maximizing Polynomials Subject to Assignment Constraints.",
            "Toward Optimal Self-Adjusting Heaps."
        ]
    },
    {
        "name": "TALG",
        "year": "2016",
        "info": "Volume 12: 2016",
        "count": 57,
        "papers": [
            "Editorial to the Special Issue on SODA'12.",
            "Approximation Algorithms and Hardness of the k-Route Cut Problem.",
            "Computing the Distance between Piecewise-Linear Bivariate Functions.",
            "Fast Zeta Transforms for Lattices with Few Irreducibles.",
            "Width of Points in the Streaming Model.",
            "Bypassing UGC from Some Optimal Geometric Inapproximability Results.",
            "Simple Deterministic Algorithms for Fully Dynamic Maximal Matching.",
            "On the k-Independence Required by Linear Probing and Minwise Independence.",
            "Sparse Sums of Positive Semidefinite Matrices.",
            "Robust and MaxMin Optimization under Matroid and Knapsack Uncertainty Sets.",
            "Dominator Tree Certification and Divergent Spanning Trees.",
            "Approximating the Diameter of Planar Graphs in Near Linear Time.",
            "Quasi-Polynomial Local Search for Restricted Max-Min Fair Allocation.",
            "A New Approach to Incremental Cycle Detection and Related Problems.",
            "Anarchy Is Free in Network Creation.",
            "Simultaneous PQ-Ordering with Applications to Constrained Embedding Problems.",
            "Faster Spectral Sparsification and Numerical Algorithms for SDD Matrices.",
            "Optimal Partitioning for Dual-Pivot Quicksort.",
            "Sorting and Selection with Imprecise Comparisons.",
            "Improved Approximation Algorithms for Relay Placement.",
            "Linear Kernels and Single-Exponential Algorithms Via Protrusion Decompositions.",
            "Forbidden-Set Distance Labels for Graphs of Bounded Doubling Dimension.",
            "A Simplified 1.5-Approximation Algorithm for Augmenting Edge-Connectivity of a Graph from 1 to 2.",
            "The Minset-Poset Approach to Representations of Graph Connectivity.",
            "Label Cover Instances with Large Girth and the Hardness of Approximating Basic k-Spanner.",
            "Segmentation of Trajectories on Nonmonotone Criteria.",
            "Scale-Free Compact Routing Schemes in Networks of Low Doubling Dimension.",
            "Distributed Algorithms for End-to-End Packet Scheduling in Wireless Ad Hoc Networks.",
            "Fast Constructions of Lightweight Spanners for General Graphs.",
            "The Two-Edge Connectivity Survivable-Network Design Problem in Planar Graphs.",
            "LIMITS and Applications of Group Algebras for Parameterized Problems.",
            "Approximating Semi-matchings in Streaming and in Two-Party Communication.",
            "Optimal Orthogonal Graph Drawing with Convex Bend Costs.",
            "A Simple and Efficient Algorithm for Computing Market Equilibria.",
            "Families with Infants: Speeding Up Algorithms for NP-Hard Problems Using FFT.",
            "A Constant Factor Approximation Algorithm for Fault-Tolerant k-Median.",
            "On the Expected Complexity of Voronoi Diagrams on Terrains.",
            "All-Or-Nothing Generalized Assignment with Application to Scheduling Advertising Campaigns.",
            "Sparse Text Indexing in Small Space.",
            "Point Line Cover: The Easy Kernel is Essentially Tight.",
            "On Problems as Hard as CNF-SAT.",
            "Approximation Algorithms for Stochastic Submodular Set Cover with Applications to Boolean Function Evaluation and Min-Knapsack.",
            "The Traveling Salesman Problem for Lines, Balls, and Planes.",
            "A Faster Algorithm for Computing Straight Skeletons.",
            "Adaptive and Approximate Orthogonal Range Counting.",
            "Agnostic Learning in Permutation-Invariant Domains.",
            "Maximizing k-Submodular Functions and Beyond.",
            "Tight Lower Bound for the Channel Assignment Problem.",
            "Improved Approximation Algorithms for Matroid and Knapsack Median Problems and Applications.",
            "A Linear-Size Logarithmic Stretch Path-Reporting Distance Oracle for General Graphs.",
            "Space-Constrained Interval Selection.",
            "Compressed Cache-Oblivious String B-Tree.",
            "Data Structures for Path Queries.",
            "Approximation Algorithms for Movement Repairmen.",
            "On Hierarchical Routing in Doubling Metrics.",
            "Addendum to \"Dominator Tree Certification and Divergent Spanning Trees\".",
            "Deletion Without Rebalancing in Binary Search Trees."
        ]
    },
    {
        "name": "TALG",
        "year": "2014",
        "info": "Volume 11: 2014/2015",
        "count": 35,
        "papers": [
            "Gathering Despite Mischief.",
            "Distributed Selfish Load Balancing on Networks.",
            "Better Scalable Algorithms for Broadcast Scheduling.",
            "Constraint Solving via Fractional Edge Covers.",
            "Approximation Algorithms for Min-Max Generalization Problems.",
            "Union-Find with Constant Time Deletions.",
            "Annotations in Data Streams.",
            "Approximating Rooted Steiner Networks.",
            "Quasirandom Rumor Spreading.",
            "Deterministic Network Exploration by Anonymous Silent Agents with Local Traffic Reports.",
            "Dynamic Ray Stabbing.",
            "Two-Dimensional Parameterized Matching.",
            "Kernelization Lower Bounds Through Colors and IDs.",
            "Minimizing Movement: Fixed-Parameter Tractability.",
            "Faster Parameterized Algorithms Using Linear Programming.",
            "Min st-Cut Oracle for Planar Graphs with Near-Linear Preprocessing Time.",
            "Maximizing the Minimum Load for Random Processing Times.",
            "Time Complexity of Link Reversal Routing.",
            "A Polynomial-Time Approximation Scheme for Euclidean Steiner Forest.",
            "Faster Fully Compressed Pattern Matching by Recompression.",
            "Interval Deletion Is Fixed-Parameter Tractable.",
            "Average Case and Distributional Analysis of Dual-Pivot Quicksort.",
            "Minimum Makespan Multi-Vehicle Dial-a-Ride.",
            "A Quasi-Polynomial Time Partition Oracle for Graphs with an Excluded Minor.",
            "On the Performance of Smith's Rule in Single-Machine Scheduling with Nonlinear Cost.",
            "Computing Shortest Paths among Curved Obstacles in the Plane.",
            "Fixed-Parameter Algorithms for Minimum-Cost Edge-Connectivity Augmentation.",
            "Directed Subset Feedback Vertex Set Is Fixed-Parameter Tractable.",
            "The Discrete and Semicontinuous Fréchet Distance with Shortcuts via Approximate Distance Counting and Selection.",
            "Rank-Balanced Trees.",
            "Optimal Lower and Upper Bounds for Representing Sequences.",
            "Testing Planarity of Partially Embedded Graphs.",
            "Mapping Simple Polygons: The Power of Telling Convex from Reflex.",
            "A Bounded Budget Network Creation Game.",
            "An Improved Competitive Algorithm for Reordering Buffer Management."
        ]
    },
    {
        "name": "TALG",
        "year": "2014",
        "info": "Volume 10: 2014",
        "count": 24,
        "papers": [
            "A logarithmic approximation for unsplittable flow on line graphs.",
            "Weighted popular matchings.",
            "The fréchet distance revisited and extended.",
            "Geometric optimization and sums of algebraic functions.",
            "Price-based protocols for fair resource allocation: Convergence time analysis and extension to leontief utilities.",
            "Socially desirable approximations for dodgson's voting rule.",
            "Envy-free pricing in multi-item markets.",
            "Dynamic programming for graphs on surfaces.",
            "Race to idle: New algorithms for speed scaling with a sleep state.",
            "Algebraic Algorithms for Linear Matroid Parity Problems.",
            "Approximate Privacy: Foundations and Quantification.",
            "Deterministic Rendezvous, Treasure Hunts, and Strongly Universal Exploration Sequences.",
            "Node-Weighted Steiner Tree and Group Steiner Tree in Planar Graphs.",
            "Faster Algorithms for Semi-Matching Problems.",
            "Fast Convergence for Consensus in Dynamic Networks.",
            "Fully Functional Static and Dynamic Succinct Trees.",
            "Testing Properties of Sparse Images.",
            "Maximum Quadratic Assignment Problem: Reduction from Maximum Label Cover and LP-based Approximation Algorithm.",
            "Co-Nondeterminism in Compositions: A Kernelization Lower Bound for a Ramsey-Type Problem.",
            "Compression via Matroids: A Randomized Polynomial Kernel for Odd Cycle Transversal.",
            "Exponential Time Complexity of the Permanent and the Tutte Polynomial.",
            "Real-Time Streaming String-Matching.",
            "Alphabet-Independent Compressed Text Indexing.",
            "Principles of Robust Medium Access and an Application to Leader Election."
        ]
    },
    {
        "name": "TALG",
        "year": "2012",
        "info": "Volume 9: 2012/2013",
        "count": 34,
        "papers": [
            "Approximating minimum-cost connectivity problems via uncrossable bifamilies.",
            "Prize-collecting steiner network problems.",
            "Distributed algorithms for multicommodity flow problems via approximate steepest descent framework.",
            "A compact routing scheme and approximate distance oracle for power-law graphs.",
            "Online scheduling of packets with agreeable deadlines.",
            "Algorithms and complexity for periodic real-time scheduling.",
            "Wireless scheduling with power control.",
            "Combinatiorial algorithms for wireless information flow.",
            "On the set multicover problem in geometric settings.",
            "Approximating parameterized convex optimization problems.",
            "Polynomial kernels for dominating set in graphs of bounded degeneracy and beyond.",
            "On exact algorithms for treewidth.",
            "Cycle detection and correction.",
            "Replacement Paths and Distance Sensitivity Oracles via Fast Matrix Multiplication.",
            "Approximating the Girth.",
            "An O(log n)-Approximation Algorithm for the Edge-Disjoint Paths Problem in Eulerian Planar Graphs.",
            "Delays Induce an Exponential Memory Gap for Rendezvous in Trees.",
            "Speed Scaling with an Arbitrary Power Function.",
            "Approximation Algorithms for a Minimization Variant of the Order-Preserving Submatrices and for Biclustering Problems.",
            "Foreword to the Special Issue on SODA'11.",
            "An Almost Optimal Unrestricted Fast Johnson-Lindenstrauss Transform.",
            "Persistent Predecessor Search and Orthogonal Point Location on the Word RAM.",
            "On the Complexity of Approximating a Nash Equilibrium.",
            "Bin Packing via Discrepancy of Permutations.",
            "Optimal Pattern Matching in LZW Compressed Strings.",
            "Optimal Bounds for Johnson-Lindenstrauss Transforms and Streaming Problems with Subconstant Error.",
            "Improved Deterministic Algorithms for Decremental Reachability and Strongly Connected Components.",
            "Sparse Euclidean Spanners with Tiny Diameter.",
            "Morphing orthogonal planar graph drawings.",
            "Finding small separators in linear time via treewidth reduction.",
            "Optimal lower bounds for projective list update algorithms.",
            "Submodular secretary problem and extensions.",
            "On the matrix berlekamp-massey algorithm.",
            "Corrigendum: Improved results for data migration and open shop scheduling."
        ]
    },
    {
        "name": "TALG",
        "year": "2012",
        "info": "Volume 8: 2012",
        "count": 44,
        "papers": [
            "Adaptive Uncertainty Resolution in Bayesian Combinatorial Optimization Problems.",
            "Online Optimization with Uncertain Information.",
            "Incremental Cycle Detection, Topological Ordering, and Strong Component Maintenance.",
            "Cache-Oblivious Algorithms.",
            "Adversarial Queuing on the Multiple Access Channel.",
            "Iterative Expansion and Color Coding: An Improved Algorithm for 3D-Matching.",
            "Improved Fixed-Parameter Algorithms for Minimum-Flip Consensus Trees.",
            "Even Faster Exact Bandwidth.",
            "Dotted interval graphs.",
            "Succinct geometric indexes supporting point location queries.",
            "A precise analysis of Cuckoo hashing.",
            "Multidimensional online tracking.",
            "The price of anarchy in network creation games.",
            "Elimination graphs.",
            "On the query complexity of testing orientations for being Eulerian.",
            "How to trim a MST: A 2-Approximation algorithm for minimum cost-tree cover.",
            "On approximating multicriteria TSP.",
            "The traveling salesman problem in bounded degree graphs.",
            "On the hardness of losing weight.",
            "Assignment problem in content distribution networks: Unsplittable hard-capacitated facility location.",
            "Expansion properties of (secure) wireless networks.",
            "I/O-efficient shortest path algorithms for undirected graphs with random or bounded edge lengths.",
            "Improved algorithms for orienteering and related problems.",
            "Santa claus meets hypergraph matchings.",
            "The speed of convergence in congestion games under best-response dynamics.",
            "Polynomial-time algorithms for minimum energy scheduling.",
            "Tight approximation algorithms for scheduling with fixed jobs and nonavailability.",
            "Scalably scheduling processes with arbitrary speedup curves.",
            "Entropy, triangulation, and point location in planar subdivisions.",
            "Smoothed analysis of left-to-right maxima with applications.",
            "Counting occurrences for a finite set of words: Combinatorial methods.",
            "Testing nilpotence of galois groups in polynomial time.",
            "Replacement paths and k simple shortest paths in unweighted directed graphs.",
            "All-pairs shortest paths for unweighted undirected graphs in o(mn) time.",
            "Fully dynamic randomized algorithms for graph spanners.",
            "The effectiveness of stackelberg strategies and tolls for network congestion games.",
            "How to meet asynchronously (almost) everywhere.",
            "Kernel(s) for problems with no kernel: On out-trees with many leaves.",
            "An online scalable algorithm for average flow time in broadcast scheduling.",
            "An FPTAS for the minimum total weighted tardiness problem with a fixed number of distinct due dates.",
            "Parallel pipelined filter ordering with precedence constraints.",
            "Succinct ordinal trees based on tree covering.",
            "Range searching on uncertain data.",
            "The smoothed complexity of edit distance."
        ]
    },
    {
        "name": "TALG",
        "year": "2010",
        "info": "Volume 7: 2010/2011",
        "count": 54,
        "papers": [
            "Computing large matchings fast.",
            "Approximation algorithms for the sex-equal stable marriage problem.",
            "A faster algorithm for computing the girth of planar and bounded genus graphs.",
            "Length-bounded cuts and flows.",
            "Additive spanners and (alpha, beta)-spanners.",
            "On the bicriteria k-server problem.",
            "On the online unit clustering problem.",
            "Clustering lines in high-dimensional space: Classification of incomplete data.",
            "Geodesic Fréchet distance inside a simple polygon.",
            "The compressed permuterm index.",
            "I/O-efficient batched union-find and its applications to terrain analysis.",
            "How to probe for an extreme value.",
            "Taxes for linear atomic congestion games.",
            "Data structures for mergeable trees.",
            "Decision trees for entity identification: Approximation algorithms and hardness results.",
            "Constant factor approximations for the hotlink assignment problem.",
            "Tree exploration with logarithmic memory.",
            "Set connectivity problems in undirected graphs and the directed steiner network problem.",
            "Shortest vertex-disjoint two-face paths in planar graphs.",
            "Streaming and fully dynamic centralized algorithms for constructing and maintaining sparse spanners.",
            "Algorithms for distributed functional monitoring.",
            "Sum edge coloring of multigraphs via configuration LP.",
            "Competitive analysis of flash memory algorithms.",
            "Finding witnesses by peeling.",
            "Constrained pattern matching.",
            "Discovering almost any hidden motif from multiple sequences.",
            "Computing the inverse sort transform in linear time.",
            "Minimizing movement in mobile facility location problems.",
            "How well can primal-dual and local-ratio algorithms perform?",
            "S-T connectivity on digraphs with a known stationary distribution.",
            "Routing (un-) splittable flow in games with player-specific affine latency functions.",
            "Rate vs. buffer size-greedy information gathering on the line.",
            "Minimizing flow time in the wireless gathering problem.",
            "Randomized rendezvous with limited memory.",
            "Max-coloring and online coloring with bandwidths on interval graphs.",
            "To fill or not to fill: The gas station problem.",
            "The optimality of the online greedy algorithm in carpool and chairman assignment problems.",
            "The tree inclusion problem: In linear space and faster.",
            "Improved approximations for the hotlink assignment problem.",
            "Philippe flajolet, the father of analytic combinatorics.",
            "Three-coloring triangle-free planar graphs in linear time.",
            "Partial convex recolorings of trees and galled networks: Tight upper and lower bounds.",
            "Geometric clustering: Fixed-parameter tractability and lower bounds with respect to the dimension.",
            "Tight bounds and a fast FPT algorithm for directed Max-Leaf Spanning Tree.",
            "All-pairs shortest paths with a sublinear additive error.",
            "Fast computation of small cuts via cycle space sampling.",
            "Broadcast scheduling: Algorithms and complexity.",
            "An improved approximation algorithm for resource allocation.",
            "Memoryless facility location in one pass.",
            "A new upper bound 2.5545 on 2D Online Bin Packing.",
            "Cake cutting really is not a piece of cake.",
            "Succinct indexes for strings, binary relations and multilabeled trees.",
            "Fully compressed suffix trees.",
            "Carry propagation in multiplication by constants."
        ]
    },
    {
        "name": "TALG",
        "year": "2009",
        "info": "Volume 6: 2009/2010",
        "count": 72,
        "papers": [
            "Resilient dictionaries.",
            "An optimal decomposition algorithm for tree edit distance.",
            "Improved approximate string matching and regular expression matching on Ziv-Lempel compressed texts.",
            "Updating relaxed K-d trees.",
            "Approximating connectivity augmentation problems.",
            "Trading off space for passes in graph streaming problems.",
            "Low distortion spanners.",
            "Minimum cycle bases: Faster and simpler.",
            "Exponential time algorithms for the minimum dominating set problem on some graph classes.",
            "Optimizing throughput and energy in online deadline scheduling.",
            "Admission control to minimize rejections and online set cover with repetitions.",
            "Jitter regulation for multiple streams.",
            "Latency-constrained aggregation in sensor networks.",
            "Time-dependent multi-scheduling of multicast.",
            "Improved online algorithms for the sorting buffer problem on line metrics.",
            "Simultaneous source location.",
            "The Knuth-Yao quadrangle-inequality speedup is a consequence of total monotonicity.",
            "Approximating the minimum quadratic assignment problems.",
            "Quantum algorithms for Simon's problem over nonabelian groups.",
            "Computing rank-convolutions with a mask.",
            "Inverse auctions: Injecting unique minima into random sets.",
            "Editorial Note.",
            "Foreword to special issue SODA 2009.",
            "Finding shortest contractible and shortest separating cycles in embedded graphs.",
            "Approximate shared-memory counting despite a strong adversary.",
            "Comparison-based time-space lower bounds for selection.",
            "Perfect matchings via uniform sampling in regular bipartite graphs.",
            "Reasoning about online algorithms with weighted automata.",
            "Approximating fractional hypertree width.",
            "Shortest paths in directed planar graphs with negative lengths: A linear-space O(n log2 n)-time algorithm.",
            "Maximal biconnected subgraphs of random planar graphs.",
            "A 4k2 kernel for feedback vertex set.",
            "Discounted deterministic Markov decision processes and discounted all-pairs shortest paths.",
            "Efficient algorithms for the 2-gathering problem.",
            "Dynamic pricing for impatient bidders.",
            "Truthful unsplittable flow for large capacity networks.",
            "Facility location with hierarchical facility costs.",
            "Mechanism design for fractional scheduling on unrelated machines.",
            "Labeling schemes for vertex connectivity.",
            "Optimization problems in multiple-interval graphs.",
            "Dial a Ride from k-forest.",
            "A fast algorithm to generate open meandric systems and meanders.",
            "Periodicity testing with sublinear samples and space.",
            "Finding heaviest H-subgraphs in real weighted graphs, with applications.",
            "An explicit universal cycle for the (n-1)-permutations of an n-set.",
            "An approximation algorithm for the maximum leaf spanning arborescence problem.",
            "The directed circular arrangement problem.",
            "Distributed error confinement.",
            "Achieving anonymity via clustering.",
            "Competitive weighted throughput analysis of greedy protocols on DAGs.",
            "A near-optimal algorithm for estimating the entropy of a stream.",
            "Approximating the distance to monotonicity in high dimensions.",
            "Adaptive sampling strategies for quickselects.",
            "Balanced families of perfect hash functions and their applications.",
            "Ordering by weighted number of wins gives a good ranking for weighted tournaments.",
            "Approximating corridors and tours via restriction and relaxation techniques.",
            "Editorial note.",
            "Foreword to special issue on SODA 2008.",
            "Clustering for metric and nonmetric distance measures.",
            "A local algorithm for finding dense subgraphs.",
            "Finding one tight cycle.",
            "On the bichromatic k-set problem.",
            "Coresets, sparse greedy approximation, and the Frank-Wolfe algorithm.",
            "A near-linear-time algorithm for computing replacement paths in planar directed graphs.",
            "Two-phase greedy algorithms for some classes of combinatorial linear programs.",
            "On distributing symmetric streaming computations.",
            "Geodesic delaunay triangulations in bounded planar domains.",
            "Fast asynchronous Byzantine agreement and leader election with full information.",
            "Lower-bounded facility location.",
            "Nondecreasing paths in a weighted graph or: How to optimally read a train schedule.",
            "Hausdorff distance under translation for points and balls.",
            "Finding equitable convex partitions of points in a polygon efficiently."
        ]
    },
    {
        "name": "TALG",
        "year": "2008",
        "info": "Volume 5: 2008/2009",
        "count": 46,
        "papers": [
            "SRPT optimally utilizes faster machines to minimize flow time.",
            "Online nonpreemptive scheduling of equal-length jobs on two identical machines.",
            "Competitive buffer management for shared-memory switches.",
            "Kinetic and dynamic data structures for closest pair and all nearest neighbors.",
            "Algorithms for center and Tverberg points.",
            "Distributed weighted vertex cover via maximal matchings.",
            "On hard instances of approximate vertex cover.",
            "Combinatorial dominance guarantees for problems with infeasible solutions.",
            "Combinatorial bounds via measure and conquer: Bounding minimal dominating sets and applications.",
            "Approximating rank-width and clique-width quickly.",
            "Structure and linear-time recognition of 4-leaf powers.",
            "On the minimum common integer partition problem.",
            "On an infinite family of solvable Hanoi graphs.",
            "Multipartite priority queues.",
            "Testing bipartiteness of geometric intersection graphs.",
            "Online conflict-free coloring for halfplanes, congruent disks, and axis-parallel rectangles.",
            "Average-case analysis of some plurality algorithms.",
            "Throughput maximization of real-time scheduling with batching.",
            "Bicriteria approximation tradeoff for the node-cost budget problem.",
            "A polynomial-time approximation scheme for embedding hypergraph in a cycle.",
            "A 1.8 approximation algorithm for augmenting edge-connectivity of a graph from 1 to 2.",
            "Approximating the distance to properties in bounded-degree and general sparse graphs.",
            "Linear time 3-approximation for the MAST problem.",
            "Algorithms for distributional and adversarial pipelined filter ordering problems.",
            "Foreword to special issue on SODA 2007.",
            "Making deterministic signatures quickly.",
            "Compacting cuts: A new linear formulation for minimum cut.",
            "Optimal dynamic vertical ray shooting in rectilinear planar subdivisions.",
            "Squarepants in a tree: Sum of subtree clustering and hyperbolic pants decomposition.",
            "Minimizing movement.",
            "An O(n log n) approximation scheme for Steiner tree in planar graphs.",
            "Near-optimal algorithms for maximum constraint satisfaction problems.",
            "Instability of FIFO in the permanent sessions model at arbitrarily small network loads.",
            "Approximation algorithms for data placement on parallel disks.",
            "Sublinear estimation of entropy and information distances.",
            "A generalized minimum cost k-clustering.",
            "Bootstrapping a hop-optimal network in the weak sensor model.",
            "All maximal independent sets and dynamic dominance for sparse graphs.",
            "A linear-time algorithm to find a separator in a graph excluding a minor.",
            "Enumeration of isolated cliques and pseudo-cliques.",
            "A better approximation ratio for the vertex cover problem.",
            "A linear algorithm for computing convex hulls for random lines.",
            "Randomized fast design of short DNA words.",
            "Parametric analysis for ungapped Markov models of evolution.",
            "Polynomial constraint satisfaction problems, graph bisection, and the Ising partition function.",
            "Low-dimensional lattice basis reduction revisited."
        ]
    },
    {
        "name": "TALG",
        "year": "2008",
        "info": "Volume 4: 2008",
        "count": 52,
        "papers": [
            "Uniform deterministic dictionaries.",
            "No sorting? better searching!",
            "Thin heaps, thick heaps.",
            "Alternation and redundancy analysis of the intersection problem.",
            "Randomized minimum spanning tree algorithms using exponentially fewer random bits.",
            "A faster and simpler fully dynamic transitive closure.",
            "Finding a long directed cycle.",
            "Rectangular layouts and contact graphs.",
            "The priority R-tree: A practically efficient and worst-case optimal R-tree.",
            "Approximate distance oracles for geometric spanners.",
            "Improved bounds for scheduling conflicting jobs with minsum criteria.",
            "The collective memory of amnesic processes.",
            "Faster approximation schemes for fractional multicommodity flow problems.",
            "Hierarchical bin buffering: Online local moments for dynamic external memory arrays.",
            "Path decomposition under a new cost measure with applications to optical network design.",
            "Guest editorial.",
            "Compact dictionaries for variable-length keys and data with applications.",
            "Provably good moving least squares.",
            "Dissections, orientations, and trees with applications to optimal mesh encoding and random sampling.",
            "Primal-dual approach for directed vertex connectivity augmentation and generalizations.",
            "An asymptotic approximation scheme for multigraph edge coloring.",
            "Embeddings of negative-type metrics and an improved approximation to generalized sparsest cut.",
            "On the approximability of some network design problems.",
            "Limitations of cross-monotonic cost-sharing schemes.",
            "Optimality of an algorithm solving the Bottleneck Tower of Hanoi problem.",
            "Determining plurality.",
            "Average-case lower bounds for the plurality problem.",
            "Balanced parentheses strike back.",
            "Roundtrip spanners and roundtrip routing in directed graphs.",
            "Optimal branch-decomposition of planar graphs in O(n3) Time.",
            "Testing Euclidean minimum spanning trees in the plane.",
            "Dynamic entropy-compressed sequences and full-text indexes.",
            "Writing-all deterministically and optimally using a nontrivial number of asynchronous processors.",
            "Algorithms for capacitated rectangle stabbing and lot sizing with joint set-up costs.",
            "Clustering, community partition and disjoint spanning trees.",
            "Improved algorithms for the minmax-regret 1-center and 1-median problems.",
            "Compact name-independent routing with minimum stretch.",
            "Getting the best response for your erg.",
            "An O(n2.75) algorithm for incremental topological ordering.",
            "Fully dynamic algorithms for chordal graphs and split graphs.",
            "Dynamic routing schemes for graphs with low local density.",
            "Label-guided graph exploration by a finite automaton.",
            "Dense subgraph problems with output-density conditions.",
            "Deterministic conflict-free coloring for intervals: From offline to online.",
            "Improved algorithms for optimal embeddings.",
            "Ordinal embeddings of minimum relaxation: General properties, trees, and ultrametrics.",
            "A new approximation algorithm for the asymmetric TSP with triangle inequality.",
            "The relative worst order ratio applied to seat reservation.",
            "Approximation schemes for wireless networks.",
            "Approximation algorithms for a facility location problem with service capacities.",
            "Fault-tolerant facility location.",
            "Atomic congestion games among coalitions."
        ]
    },
    {
        "name": "TALG",
        "year": "2007",
        "info": "Volume 3: 2007",
        "count": 52,
        "papers": [
            "Foreword to special issue on SODA 2002.",
            "The string edit distance matching problem with moves.",
            "Frugal path mechanisms.",
            "Tight bounds for worst-case equilibria.",
            "On the difficulty of some shortest path problems.",
            "A data structure for a sequence of string accesses in external memory.",
            "Entropy-based bounds for online algorithms.",
            "An improved algorithm for radio broadcast.",
            "Querying priced information in databases: The conjunctive case.",
            "Algorithmic aspects of bandwidth trading.",
            "Multiplierless multiple constant multiplication.",
            "Phase changes in random point quadtrees.",
            "Retroactive data structures.",
            "Improved algorithms for weakly chordal graphs.",
            "Strongly stable matchings in time O(nm) and extension to the hospitals-residents problem.",
            "Deterministic sampling and range counting in geometric data streams.",
            "A simple entropy-based algorithm for planar point location.",
            "An algorithm for deciding zero equivalence of nested polynomially recurrent sequences.",
            "Dynamic text and static pattern matching.",
            "Compressed representations of sequences and full-text indexes.",
            "Compressed indexes for dynamic text collections.",
            "The relative worst order ratio for online algorithms.",
            "Sharing the cost more efficiently: Improved approximation for multicommodity rent-or-buy.",
            "The NP-completeness column: Finding needles in haystacks.",
            "Faster algorithms for sorting by transpositions and sorting by block interchanges.",
            "Constructing pairwise disjoint paths with few links.",
            "Multicommodity demand flow in a tree and packing integer programs.",
            "Windows scheduling as a restricted version of bin packing.",
            "Approximate parameterized matching.",
            "Improved approximation results for the stable marriage problem.",
            "Nearest-neighbor-preserving embeddings.",
            "Convergence time to Nash equilibrium in load balancing.",
            "Routing and scheduling in multihop wireless networks with time-varying channels.",
            "Novel architectures for P2P applications: The continuous-discrete approach.",
            "Problems column.",
            "Introduction to SODA 2002 and 2003 special issue.",
            "Skip graphs.",
            "Optimal parallel selection.",
            "Minimizing weighted flow time.",
            "The k-traveling repairmen problem.",
            "Algorithms for power savings.",
            "Guessing secrets efficiently via list decoding.",
            "Succinct indexable dictionaries with applications to encoding k-ary trees, prefix sums and multisets.",
            "Partial fillup and search time in LC tries.",
            "Finding the k shortest simple paths: A new algorithm and its implementation.",
            "Edge-disjoint paths revisited.",
            "Packing element-disjoint steiner trees.",
            "Approximation algorithms and hardness results for cycle packing problems.",
            "Energy-efficient algorithms for flow time minimization.",
            "Improved online algorithms for buffer management in QoS switches.",
            "Oblivious routing on node-capacitated and directed graphs.",
            "Routing selfish unsplittable traffic."
        ]
    },
    {
        "name": "TALG",
        "year": "2006",
        "info": "Volume 2: 2006",
        "count": 37,
        "papers": [
            "Generating rooted and free plane trees.",
            "Finding 3-shredders efficiently.",
            "Pattern matching for arc-annotated sequences.",
            "The minimum generalized vertex cover problem.",
            "Online scheduling of splittable tasks.",
            "Minimizing total completion time on uniform machines with deadline constraints.",
            "Improved results for data migration and open shop scheduling.",
            "Problems column.",
            "A loopless Gray code for rooted trees.",
            "Algorithmic construction of sets for k-restrictions.",
            "Bipartite roots of graphs.",
            "Efficient algorithms for bichromatic separability.",
            "This side up!",
            "Minimizing mean flow time for UET tasks.",
            "Robust subgraphs for trees and paths.",
            "An improved algorithm for CIOQ switches.",
            "The cyclic multi-peg Tower of Hanoi.",
            "The register function for t-ary trees.",
            "Oracles for bounded-length shortest paths in planar graphs.",
            "Online topological ordering.",
            "Optimal constrained graph exploration.",
            "Faster fixed parameter tractable algorithms for finding feedback vertex sets.",
            "An approximation algorithm for scheduling malleable tasks under general precedence constraints.",
            "Secure multiparty computation of approximations.",
            "The NP-completeness column: The many limits on approximation.",
            "Foreword.",
            "Quasiconvex analysis of multivariate recurrence equations for backtracking algorithms.",
            "Succinct ordinal trees with level-ancestor queries.",
            "Melding priority queues.",
            "Approximate distance oracles for unweighted graphs in expected O(n2) time.",
            "Experimental analysis of dynamic all pairs shortest path algorithms.",
            "Rank-maximal matchings.",
            "When indexing equals compression: Experiments with compressing suffix arrays and applications.",
            "A general approach to online network optimization problems.",
            "Optimally scheduling video-on-demand to minimize delay when sender and receiver bandwidth may differ.",
            "Computing equilibria for a service provider game with (Im)perfect information.",
            "Generic quantum Fourier transforms."
        ]
    },
    {
        "name": "TALG",
        "year": "2005",
        "info": "Volume 1: 2005",
        "count": 20,
        "papers": [
            "Editor's foreword.",
            "Fast sparse matrix multiplication.",
            "A maiden analysis of longest wait first.",
            "Fixed-parameter algorithms for (k, r)-center in planar graphs and map graphs.",
            "Pricing multicasting in more flexible network models.",
            "On network design problems: fixed cost flows and the covering steiner problem.",
            "Black box for constant-time insertion in priority queues (note).",
            "A linear-time approximation algorithm for weighted matchings in graphs.",
            "Analysis of linear combination algorithms in cryptography.",
            "On a generalization of the stable roommates problem.",
            "Problems column.",
            "The NP-completeness column.",
            "Individual displacements for linear probing hashing with different insertion policies.",
            "Exact distribution of individual displacements in linear probing hashing.",
            "Maintaining information in fully dynamic trees with top trees.",
            "Approximation algorithms for the capacitated minimum spanning tree problem and its variants in network design.",
            "Computing almost shortest paths.",
            "An O(VE) algorithm for ear decompositions of matching-covered graphs.",
            "Approximate majorization and fair online load balancing.",
            "The greedy algorithm for the minimum common string partition problem."
        ]
    }
]