[
    {
        "name": "Theory of Computing Systems",
        "year": "2022",
        "info": "2022: Volume\n66",
        "count": 10,
        "papers": [
            "Generating Visual Invariants -a New Approach to Invariant Recognition.",
            "An Alternating Algorithm for Finding Linear Arrow-Debreu Market Equilibria.",
            "Univariate Ideal Membership Parameterized by Rank, Degree, and Number of Generators.",
            "Exact Multi-Covering Problems with Geometric Sets.",
            "Radio k-chromatic Number of Full m-ary Trees.",
            "FKT is Not Universal - A Planar Holant Dichotomy for Symmetric Constraints.",
            "The Complexity of Counting CSPd.",
            "Stable Multi-Level Monotonic Eroders.",
            "Multi-Pass Streaming Algorithms for Monotone Submodular Function Maximization.",
            "The Power of the Weighted Sum Scalarization for Approximating Multiobjective Optimization Problems."
        ]
    },
    {
        "name": "Theory of Computing Systems",
        "year": "2021",
        "info": "2021: Volume\n65",
        "count": 55,
        "papers": [
            "Special Issue on Database Theory.",
            "Characterizing Tractability of Simple Well-Designed Pattern Trees with Projection.",
            "Index-based, High-dimensional, Cosine Threshold Querying with Optimality Guarantees.",
            "Semi-Oblivious Chase Termination: The Sticky Case.",
            "Consistent Query Answering for Primary Keys in Datalog.",
            "On the Expressive Power of Linear Algebra on Graphs.",
            "Correction to: On the Expressive Power of Linear Algebra on Graphs.",
            "Preservation of Normality by Non-Oblivious Group Selection.",
            "Exploration of Dynamic Cactuses with Sub-logarithmic Overhead.",
            "On the Relation Between Structured d-DNNFs and SDDs.",
            "Fast Scheduling in Distributed Transactional Memory.",
            "Faster Parameterized Algorithm for Cluster Vertex Deletion.",
            "On the Complexity of the Smallest Grammar Problem over Fixed Alphabets.",
            "Computability of Products of Chainable Continua.",
            "Stable Divisorial Gonality is in NP.",
            "Derandomization for Sliding Window Algorithms with Strict Correctness∗.",
            "Special Issue on Computer Science Symposium in Russia (2019).",
            "On Decidability of Theories of Regular Languages.",
            "Transition Property for Cube-Free Words.",
            "Nearly Linear Time Isomorphism Algorithms for Some Nonabelian Group Classes.",
            "Parameterized Complexity of Conflict-Free Set Cover.",
            "Belga B-Trees.",
            "The Non-hardness of Approximating Circuit Size.",
            "Unpopularity Factor in the Marriage and Roommates Problems.",
            "Forward Looking Huffman Coding.",
            "On Tseitin Formulas, Read-Once Branching Programs and Treewidth.",
            "Preface of STACS 2019 Special Issue.",
            "First-Order Orbit Queries.",
            "Token Sliding on Split Graphs.",
            "Space Lower Bounds for the Signal Detection Problem.",
            "The Containment Problem for Unambiguous Register Automata and Unambiguous Timed Automata.",
            "Finite Sequentiality of Unambiguous Max-Plus Tree Automata.",
            "Constructing Antidictionaries of Long Texts in Output-Sensitive Space.",
            "Approximability of open k-monopoly problems.",
            "Minimum Reload Cost Graph Factors.",
            "On the Complexity of the Clone Membership Problem.",
            "Computing the Number of Affine Equivalent Classes on ℛ(s, n)/ℛ(k, n).",
            "The subset sum game revisited.",
            "Preface.",
            "Approximation Results for Makespan Minimization with Budgeted Uncertainty.",
            "Streaming Algorithms for Bin Packing and Vector Scheduling.",
            "Managing Multiple Mobile Resources.",
            "On the Cycle Augmentation Problem: Hardness and Approximation Algorithms.",
            "Greedy is Optimal for Online Restricted Assignment and Smart Grid Scheduling for Unit Size Jobs.",
            "On the Expressive Power of Stateless Ordered Restart-Delete Automata.",
            "The Price of Fairness for Indivisible Goods.",
            "The Minimum Tollbooth Problem in Atomic Network Congestion Games with Unsplittable Flows.",
            "Lower-Bounds on the Growth of Power-Free Languages Over Large Alphabets.",
            "Computationally Efficient Approach to Implementation of the Chinese Remainder Theorem Algorithm in Minimally Redundant Residue Number System.",
            "Correction to: Parameterized Complexity of Min-Power Asymmetric Connectivity.",
            "Restart Strategies in a Continuous Setting.",
            "On Triangle Estimation Using Tripartite Independent Set Queries.",
            "Property Testing of the Boolean and Binary Rank.",
            "Reachability Problems on Reliable and Lossy Queue Automata.",
            "A Parameterized Complexity View on Collapsing k-Cores."
        ]
    },
    {
        "name": "Theory of Computing Systems",
        "year": "2020",
        "info": "2020: Volume\n64",
        "count": 64,
        "papers": [
            "CSR 2018 Special Issue on TOCS.",
            "Recognizing Read-Once Functions from Depth-Three Formulas.",
            "The Clever Shopper Problem.",
            "Slopes of Multidimensional Subshifts.",
            "Fixed-Parameter Tractable Algorithm and Polynomial Kernel for Max-Cut Above Spanning Tree.",
            "Quadratically Tight Relations for Randomized Query Complexity.",
            "Complexity and Inapproximability Results for Parallel Task Scheduling and Strip Packing.",
            "Grammar-Based Compression of Unranked Trees.",
            "Periodicity in Data Streams with Wildcards.",
            "New Bounds for Truthful Scheduling on Two Unrelated Selfish Machines.",
            "Optimal Path Discovery Problem with Homogeneous Knowledge.",
            "On the Parameterized Complexity of Graph Modification to First-Order Logic Properties.",
            "Cache Me if You Can: Capacitated Selfish Replication Games in Networks.",
            "Profit Maximization in Flex-Grid All-Optical Networks.",
            "Algorithm for Online 3-Path Vertex Cover.",
            "Improving Selfish Routing for Risk-Averse Players.",
            "Preface of the Special Issue on Theoretical Aspects of Computer Science (2018).",
            "Computing Hitting Set Kernels By AC0-Circuits.",
            "Lower Bound Techniques for QBF Expansion.",
            "On the Tree Conjecture for the Network Creation Game.",
            "On Approximating the Stationary Distribution of Time-Reversible Markov Chains.",
            "Dependences in Strategy Logic.",
            "Optimal Dislocation with Persistent Errors in Subquadratic Time.",
            "Space-Efficient Algorithms for Longest Increasing Subsequence.",
            "Additive Number Theory via Automata Theory.",
            "Special Issue on Approximation and Online Algorithms.",
            "Correction to: Special Issue on Approximation and Online Algorithms.",
            "Deterministic Min-Cost Matching with Delays.",
            "Advice Complexity of Priority Algorithms.",
            "Approximating Node-Weighted k-MST on Planar Graphs.",
            "An Optimally-Competitive Algorithm for Maximum Online Perfect Bipartite Matching with i.i.d. Arrivals.",
            "Longest Increasing Subsequence under Persistent Comparison Errors.",
            "On the Stab Number of Rectangle Intersection Graphs.",
            "Extension Complexity of Formal Languages.",
            "Scheduling MapReduce Jobs on Identical and Unrelated Processors.",
            "On Normality in Shifts of Finite Type.",
            "On Limitations of Structured (Deterministic) DNNFs.",
            "Special Issue on the 2018 International Conference on Database Theory.",
            "Enumeration Complexity of Conjunctive Queries with Functional Dependencies.",
            "Connecting Knowledge Compilation Classes and Width Parameters.",
            "Correction to: Connecting Knowledge Compilation Classes and Width Parameters.",
            "A More General Theory of Static Approximations for Conjunctive Queries.",
            "Distribution Policies for Datalog.",
            "Optimizing Social Welfare for Network Bargaining Games in the Face of Instability, Greed and Idealism.",
            "Generalized Graph k-Coloring Games.",
            "Countable Sofic Shifts with a Periodic Direction.",
            "Conflict Free Version of Covering Problems on Graphs: Classical and Parameterized.",
            "On the Fixed-Parameter Tractability of the Maximum Connectivity Improvement Problem.",
            "Effective Categoricity of Automatic Equivalence and Nested Equivalence Structures.",
            "Santha-Vazirani sources, deterministic condensers and very strong extractors.",
            "Editorial: Special Issue on International Workshop on Combinatorial Algorithms (IWOCA 2019).",
            "Parameterized Complexity of Min-Power Asymmetric Connectivity.",
            "Complexity of Fall Coloring for Restricted Graph Classes.",
            "On the Average Case of MergeInsertion.",
            "Complexity and Algorithms for Semipaired Domination in Graphs.",
            "Analyzing Clustering and Partitioning Problems in Selected VLSI Models.",
            "Fast Algorithms for the Shortest Unique Palindromic Substring Problem on Run-Length Encoded Strings.",
            "Computing the k-Visibility Region of a Point in a Polygon.",
            "Fixed-Parameter Tractability of (n - k) List Coloring.",
            "An Improved FPT Algorithm for Independent Feedback Vertex Set.",
            "Multiplication Algorithm Based on Collatz Function.",
            "On Envy-Free Revenue Approximation for Combinatorial Buyers with Budgets.",
            "Dichotomy for Holant∗ Problems on the Boolean Domain.",
            "Satisfiability Algorithm for Syntactic Read-k-times Branching Programs."
        ]
    },
    {
        "name": "Theory of Computing Systems",
        "year": "2019",
        "info": "2019: Volume\n63",
        "count": 76,
        "papers": [
            "A Message from the Springer Editorial Team.",
            "Preface to the Special Issue on Algorithmic Game Theory.",
            "Designing Cost-Sharing Methods for Bayesian Games.",
            "Logarithmic Query Complexity for Approximate Nash Computation in Large Games.",
            "The Impact of Worst-Case Deviations in Non-Atomic Network Routing Games.",
            "Price of Anarchy for Highly Congested Routing Games in Parallel Networks.",
            "An Almost Ideal Coordination Mechanism for Unrelated Machine Scheduling.",
            "The Stable Roommates Problem with Short Lists.",
            "Analyzing Power in Weighted Voting Games with Super-Increasing Weights.",
            "Editor's Note: Special Issue on Stabilization, Safety, and Security of Distributed Systems.",
            "Self-Stabilizing Metric Graphs.",
            "Synchronous Gathering without Multiplicity Detection: a Certified Algorithm.",
            "Wait-free Solvability of Colorless Tasks in Anonymous Shared-memory Model.",
            "Packet Efficient Implementation of the Omega Failure Detector.",
            "Self-Stabilizing Byzantine Clock Synchronization with Optimal Precision.",
            "On-Line Path Computation and Function Placement in SDNs.",
            "Snap-Stabilizing Tasks in Anonymous Networks.",
            "Making Local Algorithms Wait-Free: the Case of Ring Coloring.",
            "Better Complexity Bounds for Cost Register Automata.",
            "Nondeterminisic Sublinear Time Has Measure 0 in P.",
            "Computing Parameters of Sequence-Based Dynamic Graphs.",
            "Property Testing Lower Bounds via a Generalization of Randomized Parity Decision Trees.",
            "On Tradeoffs Between Width- and Fill-like Graph Parameters.",
            "Motivating Time-Inconsistent Agents: A Computational Approach.",
            "Process Algebra with Strategic Interleaving.",
            "Pattern Matching and Consensus Problems on Weighted Sequences and Profiles.",
            "Capturing Points with a Rotating Polygon (and a 3D Extension).",
            "Algorithmic Randomness and Fourier Analysis.",
            "On the Parameterized Complexity of Contraction to Generalization of Trees.",
            "A Unifying Approach to Algebraic Systems Over Semirings.",
            "Foreword.",
            "Cascade Heap: Towards Time-Optimal Extractions.",
            "An Adequacy Theorem for Dependent Type Theory.",
            "Green's Relations in Deterministic Finite Automata.",
            "Unary Coded PSPACE-Complete Languages in ASPACE(loglog n).",
            "Verification of Quantum Computation: An Overview of Existing Approaches.",
            "The Conjugacy Problem in Free Solvable Groups and Wreath Products of Abelian Groups is in TC 0.",
            "On Algorithmic Statistics for Space-bounded Algorithms.",
            "Generic Results for Concatenation Hierarchies.",
            "The Descriptive Complexity of Subgraph Isomorphism Without Numerics.",
            "Guest Editorial: Special Issue on Theoretical Aspects of Computer Science.",
            "On Long Words Avoiding Zimin Patterns.",
            "Computing Majority by Constant Depth Majority Circuits with Low Fan-in Gates.",
            "Counting Edge-injective Homomorphisms and Matchings on Restricted Graph Classes.",
            "Complete Semialgebraic Invariant Synthesis for the Kannan-Lipton Orbit Problem.",
            "Improved Distance Queries and Cycle Counting by Frobenius Normal Form.",
            "Mixing of Permutations by Biased Transpositions.",
            "The Operator Approach to Entropy Games.",
            "Minimal Distance of Propositional Models.",
            "Unit Cost Buyback Problem.",
            "On Black-Box Transformations in Downward-Closed Environments.",
            "On Stackelberg Strategies in Affine Congestion Games.",
            "On the Relative Succinctness of Sentential Decision Diagrams.",
            "A Group Algebraic Approach to NPN Classification of Boolean Functions.",
            "The Number of Clones Determined by Disjunctions of Unary Relations.",
            "Strategic Network Formation Through an Intermediary.",
            "Bounds on the Bend Number of Split and Cocomparability Graphs.",
            "Comparing Linear Width Parameters for Directed Graphs.",
            "Weak Completeness Notions for Exponential Time.",
            "Parameterized Analysis of the Online Priority and Node-Weighted Steiner Tree Problems.",
            "Guest Editorial: Special Issue on Algorithmic Game Theory.",
            "Tight Welfare Guarantees for Pure Nash Equilibria of the Uniform Price Auction.",
            "Online Random Sampling for Budgeted Settings.",
            "Tradeoffs Between Information and Ordinal Approximation for Bipartite Matching.",
            "Opinion Formation Games with Aggregation and Negative Influence.",
            "The Real Computational Complexity of Minmax Value and Equilibrium Refinements in Multi-player Games.",
            "Guest Editorial: Special Issue on Database Theory.",
            "How Many Variables are Needed to Express an Existential Positive Query?",
            "Better Streaming Algorithms for the Maximum Coverage Problem.",
            "Evaluating Datalog via Tree Automata and Cycluits.",
            "A Logic for Document Spanners.",
            "Guest Editorial: Special Issue on Approximation and Online Algorithms.",
            "Lower Bounds for Several Online Variants of Bin Packing.",
            "On Conceptually Simple Algorithms for Variants of Online Bipartite Matching.",
            "On-line Search in Two-Dimensional Environment.",
            "Efficient Dynamic Approximate Distance Oracles for Vertex-Labeled Planar Graphs."
        ]
    },
    {
        "name": "Theory of Computing Systems",
        "year": "2018",
        "info": "2018: Volume\n62",
        "count": 79,
        "papers": [
            "Preface of STACS 2016 Special Issue.",
            "Testing Shape Restrictions of Discrete Distributions.",
            "A Randomized Polynomial Kernel for Subset Feedback Vertex Set.",
            "Faster Algorithms for the Constrained k-means Problem.",
            "Catalytic Space: Non-determinism and Hierarchy.",
            "Size-Treewidth Tradeoffs for Circuits Computing the Element Distinctness Function.",
            "Tighter Bounds and Optimal Algorithms for All Maximal α-gapped Repeats and Palindromes - Finding All Maximal α-gapped Repeats and Palindromes in Optimal Worst Case Time on Integer Alphabets.",
            "Knapsack in Graph Groups.",
            "WAOA 2015 Special Issue on TOCS.",
            "Constant-Time Local Computation Algorithms.",
            "Geometric Hitting Set for Segments of Few Orientations.",
            "Scheduling Parallel Jobs Online with Convex and Concave Parallelizability.",
            "Maximum ATSP with Weights Zero and One via Half-Edges.",
            "Shortest Augmenting Paths for Online Matchings on Trees.",
            "Tight Bounds for Double Coverage Against Weak Adversaries.",
            "On the Smoothness of Paging Algorithms.",
            "Efficient Vertex-Label Distance Oracles for Planar Graphs.",
            "Approximation Algorithms for Connected Graph Factors of Minimum Weight.",
            "Preface to the Special Issue on Computer Science in Russia 2016.",
            "Level Two of the Quantifier Alternation Hierarchy Over Infinite Words.",
            "Tropically Convex Constraint Satisfaction.",
            "Improved Approximation Algorithms for Minimum Cost Node-Connectivity Augmentation Problems.",
            "On Approximating (Connected) 2-Edge Dominating Set by a Tree.",
            "Comparing Representations for Function Spaces in Computable Analysis.",
            "On Slepian-Wolf Theorem with Interaction.",
            "Computing and Listing st-Paths in Public Transportation Networks.",
            "Some Complete and Intermediate Polynomials in Algebraic Complexity Theory.",
            "Prediction of Infinite Words with Automata.",
            "The Word Problem for Omega-Terms over the Trotter-Weil Hierarchy.",
            "Parameterizing Edge Modification Problems Above Lower Bounds.",
            "Foreword: Special Issue on Database Theory.",
            "Complexity and Expressive Power of Weakly Well-Designed SPARQL.",
            "It's All a Matter of Degree - Using Degree Information to Optimize Multiway Joins.",
            "Document Spanners: From Expressive Power to Decision Problems.",
            "Limits of Schema Mappings.",
            "Reasoning about integrity constraints for tree-structured data.",
            "Self-Stabilizing Leader Election in Dynamic Networks.",
            "Exact Localisations of Feedback Sets.",
            "A Closer Look at Fault Tolerance.",
            "Co-c.e. Sets with Disconnected Complements.",
            "Bounded-Depth Succinct Encodings and the Structure they Imply on Graphs.",
            "Exploration of the T-Interval-Connected Dynamic Graphs: the Case of the Ring.",
            "The Complexity of Tensor Rank.",
            "Syntactic Complexity of Regular Ideals.",
            "From Tree Automata to String Automata Minimization.",
            "Collaborative Exploration of Trees by Energy-Constrained Mobile Robots.",
            "The Algebraic Theory of Parikh Automata.",
            "On Effective Birkhoff's Ergodic Theorem for Computable Actions of Amenable Groups.",
            "A Unifying Tool for Bounding the Quality of Non-Cooperative Solutions in Weighted Congestion Games.",
            "Homonym Population Protocols.",
            "Editorial: Special Issue on \"Combinatorial Algorithms\" (IWOCA 2016).",
            "Speeding up dynamic programming in the line-constrained k-median.",
            "Online Chromatic Number is PSPACE-Complete.",
            "Minimax Regret 1-Median Problem in Dynamic Path Networks.",
            "Finding Cactus Roots in Polynomial Time.",
            "The Solution Space of Sorting with Recurring Comparison Faults.",
            "Weighted Online Problems with Advice.",
            "Partial Covering Arrays: Algorithms and Asymptotics.",
            "Monotone Paths in Geometric Triangulations.",
            "Covering Triangles in Edge-Weighted Graphs.",
            "Preface.",
            "Finite-State Independence.",
            "Liouville, Computable, Borel Normal and Martin-Löf Random Numbers.",
            "Bounded Turing Reductions and Data Processing Inequalities for Sequences.",
            "Coherence of Reducibilities with Randomness Notions.",
            "Effective Hausdorff Dimension in General Metric Spaces.",
            "The Random Members of a Π10 Class.",
            "Approximation and Heuristic Algorithms for Computing Backbones in Asymmetric Ad-hoc Networks.",
            "Revisiting Connected Vertex Cover: FPT Algorithms and Lossy Kernels.",
            "Finger Search in Grammar-Compressed Strings.",
            "Space Efficient Linear Time Algorithms for BFS, DFS and Applications.",
            "Set Cover Problems with Small Neighborhood Covers.",
            "Parameterized Complexity of Voter Control in Multi-Peaked Elections.",
            "Reasoning About XML Constraints Based on XML-to-Relational Mappings.",
            "Parameterised Algorithms for Deletion to Classes of DAGs.",
            "Polynomial Kernels for Vertex Cover Parameterized by Small Degree Modulators.",
            "Primitivity, Uniform Minimality, and State Complexity of Boolean Operations.",
            "Online Bin Packing with Advice of Small Size.",
            "The Most Points Connected-Covering Problem with Two Disks."
        ]
    },
    {
        "name": "Theory of Computing Systems",
        "year": "2017",
        "info": "2017: Volumes\n60,\n61",
        "count": 87,
        "papers": [
            "50 Years of TOCS.",
            "Incremental Problems in the Parameterized Complexity Setting.",
            "Local Restrictions from the Furst-Saxe-Sipser Paper.",
            "Arithmetic for Rooted Trees.",
            "Notes on Computable Analysis.",
            "On the Chromatic Number of Non-Sparse Random Intersection Graphs.",
            "Composition Closure of Linear Extended Top-down Tree Transducers.",
            "Fixed Points, Nash Equilibria, and the Existential Theory of the Reals.",
            "Distance Vector-based Advance Reservation with Delay Performance Guarantees.",
            "Path-Disruption Games: Bribery and a Probabilistic Model.",
            "The Complexity of Finding Effectors.",
            "Sophistication vs Logical Depth.",
            "A Difference in Complexity Between Recursion and Tail Recursion.",
            "Conditional Measure and the Violation of Van Lambalgen's Theorem for Martin-Löf Randomness.",
            "Small-Bias is Not Enough to Hit Read-Once CNF.",
            "The Behavior of Clique-Width under Graph Operations and Graph Transformations.",
            "Editor's Note.",
            "Partition Expanders.",
            "Genericity of Weakly Computable Objects.",
            "Higher Randomness and Forcing with Closed Sets.",
            "On Boolean Closed Full Trios and Rational Kripke Frames.",
            "New Bounds and Extended Relations Between Prefix Arrays, Border Arrays, Undirected Graphs, and Indeterminate Strings.",
            "A Solution to Wiehagen's Thesis.",
            "On Symmetric Circuits and Fixed-Point Logics.",
            "2-Stack Sorting is Polynomial.",
            "Tight Lower and Upper Bounds for the Complexity of Canonical Colour Refinement.",
            "Polynomial Kernelization for Removing Induced Claws and Diamonds.",
            "Multi-processor Search and Scheduling Problems with Setup Cost.",
            "On the Generic Undecidability of the Halting Problem for Normalized Turing Machines.",
            "Atomic Read/Write Memory in Signature-Free Byzantine Asynchronous Message-Passing Systems.",
            "The Complexity of Model Checking Multi-Stack Systems.",
            "Paradigms for Parameterized Enumeration.",
            "Tai Mapping Hierarchy for Rooted Labeled Trees Through Common Subforest.",
            "Foreword: Special Issue on Database Theory.",
            "Answering Conjunctive Queries with Inequalities.",
            "Regular Queries on Graph Databases.",
            "Games for Active XML Revisited.",
            "Asymptotic Determinacy of Path Queries Using Union-of-Paths Views.",
            "From Causes for Database Queries to Repairs and Model-Based Diagnosis and Back.",
            "Optimal Broadcasting Strategies for Conjunctive Queries over Distributed Data.",
            "Preface.",
            "The Connectivity of Boolean Satisfiability: Dichotomies for Formulas and Circuits.",
            "Space Saving by Dynamic Algebraization Based on Tree-Depth.",
            "The Query Complexity of Witness Finding.",
            "Processing Succinct Matrices and Vectors.",
            "The Half-Levels of the FO2 Alternation Hierarchy.",
            "Separation Logic with One Quantified Variable.",
            "Guest Editorial: Computer Science Symposium in Russia.",
            "Bounds in Ontology-Based Data Access via Circuit Complexity.",
            "Equations Over Free Inverse Monoids with Idempotent Variables.",
            "Some Properties of Antistochastic Strings.",
            "Rewriting Higher-Order Stack Trees.",
            "Generalized LR Parsing Algorithm for Grammars with One-Sided Contexts.",
            "Optimizing Binary Heaps.",
            "On Compiling Structured CNFs to OBDDs.",
            "On the Satisfiability of Quantum Circuits of Small Treewidth.",
            "Satisfiability of ECTL∗ with Local Tree Constraints.",
            "Parameterized Algorithms for Graph Partitioning Problems.",
            "Online Regenerator Placement.",
            "On Oblivious Branching Programs with Bounded Repetition that Cannot Efficiently Compute CNFs of Bounded Treewidth.",
            "Parameterized Complexity Dichotomy for (r, ℓ)-Vertex Deletion.",
            "Parameterized Complexity of Secluded Connectivity Problems.",
            "Adversarial Multiple Access Channels with Individual Injection Rates.",
            "The Parameterized Space Complexity of Embedding Along a Path.",
            "A PTAS for the Geometric Connected Facility Location Problem.",
            "The 2-Rainbow Domination of Sierpiński Graphs and Extended Sierpiński Graphs.",
            "The Complexity of Optimal Design of Temporally Connected Graphs.",
            "Editorial: Special Issue on \"Theoretical Aspects of Computer Science\" (STACS 2015).",
            "Welfare Maximization with Friends-of-Friends Network Externalities.",
            "Minimum-Cost Flows in Unit-Capacity Networks.",
            "New Pairwise Spanners.",
            "Optimal Decremental Connectivity in Planar Graphs.",
            "Dynamic Planar Embeddings of Dynamic Graphs.",
            "Towards an Isomorphism Dichotomy for Hereditary Graph Classes.",
            "The Advice Complexity of a Class of Hard Online Problems.",
            "Characterisation of Limit Measures of Higher-Dimensional Cellular Automata.",
            "On the Information Carried by Programs About the Objects they Compute.",
            "Multi-k-ic Depth Three Circuit Lower Bound.",
            "Guest Editorial: Tenth International Conference on Computability, Complexity and Randomness (CCR 2015).",
            "Semiautomatic Structures.",
            "Exact Constructive and Computable Dimensions.",
            "Conditional Probabilities and van Lambalgen's Theorem Revisited.",
            "A Generalized Characterization of Algorithmic Probability.",
            "Layerwise Computability and Image Randomness.",
            "On the Uniform Computational Content of Computability Theory.",
            "On the Complexity of Automatic Complexity.",
            "Short lists with short programs from programs of functions and strings."
        ]
    },
    {
        "name": "Theory of Computing Systems",
        "year": "2016",
        "info": "2016: Volumes\n58,\n59",
        "count": 67,
        "papers": [
            "Foreword of the Special Issue Dedicated to the 2013 Workshop on Approximation and Online Algorithms.",
            "On Fixed Cost k-Flow Problems.",
            "Improved Approximation Algorithm for k-level Uncapacitated Facility Location Problem (with Penalties).",
            "Approximately Counting Approximately-Shortest Paths in Directed Acyclic Graphs.",
            "Degree-Constrained Graph Orientation: Maximum Satisfaction and Minimum Violation.",
            "Min-Sum 2-Paths Problems.",
            "Approximating the Sparsest k-Subgraph in Chordal Graphs.",
            "Low Dimensional Embeddings of Doubling Metrics.",
            "Online Knapsack Revisited.",
            "On Two Continuum Armed Bandit Problems in High Dimensions.",
            "Upper Bounds on Number of Steals in Rooted Trees.",
            "An Improved Exact Algorithm for TSP in Graphs of Maximum Degree 4.",
            "Exact Algorithms for Intervalizing Coloured Graphs.",
            "When Diameter Matters: Parameterized Approximation Algorithms for Bounded Diameter Minimum Steiner Tree Problem.",
            "Speed Scaling for Maximum Lateness.",
            "Online Scheduling FIFO Policies with Admission and Push-Out.",
            "The Outer-connected Domination Number of Sierpiński-like Graphs.",
            "A Fast Branching Algorithm for Cluster Vertex Deletion.",
            "Erratum to: \"Top-down Tree Transducers with Regular Look-ahead\".",
            "Editorial: Special Issue on Computability, Complexity and Randomness.",
            "Polynomial-Time Algorithms for Checking Some Properties of Boolean Functions Given by Polynomials.",
            "Normality and Finite-State Dimension of Liouville Numbers.",
            "On Stability of Probability Laws with Respect to Small Violations of Algorithmic Randomness.",
            "The Sum 2 KM(x)-K(x) Over All Prefixes x of Some Binary Sequence Can be Infinite.",
            "Reducibilities Relating to Schnorr Randomness.",
            "Algorithmic Minimal Sufficient Statistics: a New Approach.",
            "Relating and Contrasting Plain and Prefix Kolmogorov Complexity.",
            "Preface of STACS 2013 Special Issue.",
            "The Arithmetic Complexity of Tensor Contraction.",
            "Towards a Realistic Analysis of the QuickSelect Algorithm.",
            "Approximate Comparison of Functions Computed by Distance Automata.",
            "Regular Languages of Thin Trees.",
            "Automaton Semigroups: The Two-state Case.",
            "The Simulated Greedy Algorithm for Several Submodular Matroid Secretary Problems.",
            "On the Stability of Generalized Second Price Auctions with Budgets.",
            "On the Parameterised Complexity of String Morphism Problems.",
            "The Computational Complexity of Iterated Elimination of Dominated Strategies.",
            "Complexity of Approximating CSP with Balance / Hard Constraints.",
            "A Self-Tester for Linear Functions over the Integers with an Elementary Proof of Correctness.",
            "The Update Complexity of Selection and Related Problems.",
            "Holant Problems for 3-Regular Graphs with Complex Edge Functions.",
            "Preface.",
            "Weak Abelian Periodicity of Infinite Words.",
            "Walking on Data Words.",
            "QuickHeapsort: Modifications and Improved Analysis.",
            "Multi-weighted Automata and MSO Logic.",
            "An Improved Approximation Scheme for Variable-Sized Bin Packing.",
            "Complexity of Fixed-Size Bit-Vector Logics.",
            "Information Lower Bounds via Self-Reducibility.",
            "Network Formation for Asymmetric Players and Bilateral Contracting.",
            "Counting the Number of Perfect Matchings in K 5-Free Graphs.",
            "Assignment Games with Conflicts: Robust Price of Anarchy and Convergence Results via Semi-Smoothness.",
            "On the Advice Complexity of the k-server Problem Under Sparse Metrics.",
            "Learning Sets of Antecedent-restricted Functional and Multivalued Dependencies with Queries.",
            "Distinguishing Two Probability Ensembles with One Sample from each Ensemble.",
            "On the Minimization of (Complete) Ordered Binary Decision Diagrams.",
            "Preface to Special Issue on Algorithmic Game Theory.",
            "Profit Sharing with Thresholds and Non-monotone Player Utilities.",
            "Welfare Guarantees for Proportional Allocations.",
            "On the Efficiency of the Proportional Allocation Mechanism for Divisible Resources.",
            "Efficient Money Burning in General Domains.",
            "Towards More Practical Linear Programming-based Techniques for Algorithmic Mechanism Design.",
            "Prediction and Welfare in Ad Auctions.",
            "Stable Marriage with General Preferences.",
            "Pareto Optimal Matchings in Many-to-Many Markets with Ties.",
            "When Can Limited Randomness Be Used in Repeated Games?",
            "Network Characterizations for Excluding Braess's Paradox."
        ]
    },
    {
        "name": "Theory of Computing Systems",
        "year": "2015",
        "info": "2015: Volumes\n56,\n56",
        "count": 82,
        "papers": [
            "Special Issue on Approximation and Online Algorithms.",
            "On Online Algorithms with Advice for the k-Server Problem.",
            "OnlineMin: A Fast Strongly Competitive Randomized Paging Algorithm.",
            "Improved Lower Bound for Online Strip Packing.",
            "A Lower Bound on Deterministic Online Algorithms for Scheduling on Related Machines Without Preemption.",
            "Non-clairvoyant Weighted Flow Time Scheduling on Different Multi-processor Models.",
            "Approximation Algorithms for Fragmenting a Graph Against a Stochastically-Located Threat.",
            "Special Issue on Approximation and Online Algorithms.",
            "Online Results for Black and White Bin Packing.",
            "Some Anomalies of Farsighted Strategic Behavior.",
            "Approximating Spanning Trees with Few Branches.",
            "Advice Complexity of Maximum Independent set in Sparse and Bipartite Graphs.",
            "On Minimum- and Maximum-Weight Minimum Spanning Trees with Neighborhoods.",
            "Probabilistic k-Median Clustering in Data Streams.",
            "On the Turing Completeness of the Semantic Web.",
            "Rent or Buy Problems with a Fixed Time Horizon.",
            "New Results on Polynomial Inapproximabilityand Fixed Parameter Approximability of Edge Dominating Set.",
            "Estimating the Volume of Solution Space for Satisfiability Modulo Linear Real Arithmetic.",
            "Hardness of Approximation for Knapsack Problems.",
            "Sitting Closer to Friends than Enemies, Revisited.",
            "Topological Approach to Multivalued Information System.",
            "Generalized River Crossing Problems.",
            "Editorial.",
            "Feasible Analysis, Randomness, and Base Invariance.",
            "Schnorr Triviality and Its Equivalent Notions.",
            "Trivial Measures are not so Trivial.",
            "Topological Arguments for Kolmogorov Complexity.",
            "Symbolic Dynamics: Entropy = Dimension = Complexity.",
            "Cryptography and Algorithmic Randomness.",
            "On Optimal Language Compression for Sets in PSPACE/poly.",
            "Preface.",
            "Towards Optimal Degree Distributions for Left-Perfect Matchings in Random Bipartite Graphs.",
            "Some Results on More Flexible Versions of Graph Motif.",
            "New Lower Bounds on Circuit Size of Multi-output Functions.",
            "On Extracting Space-bounded Kolmogorov Complexity.",
            "Two-Way Automata Characterizations of L/poly Versus NL.",
            "Omega-Rational Expressions with Bounded Synchronization Delay.",
            "Generalized Post Embedding Problems.",
            "On the Parameterized Complexity of Computing Balanced Partitions in Graphs.",
            "The Complexity of Debate Checking.",
            "Minimizing Rosenthal Potential in Multicast Games.",
            "Deciding Determinism of Regular Languages.",
            "Finding Disjoint Paths in Split Graphs.",
            "Lower Bounds for Tropical Circuits and Dynamic Programs.",
            "Restarting Transducers, Regular Languages, and Rational Relations.",
            "Random Sequences with Respect to a Measure Defined by Two Linear Fractional Transformations.",
            "LP-Based Covering Games with Low Price of Anarchy.",
            "On Avoiding Spare Aborts in Transactional Memory.",
            "Synchronizing Relations on Words.",
            "A Split-Based Incremental Deterministic Automata Minimization Algorithm.",
            "Schemas for Unordered XML on a DIME.",
            "The Strong Price of Anarchy of Linear Bottleneck Congestion Games.",
            "FNB: Fast Non-Blocking Coordinated Checkpointing Protocol for Distributed Systems.",
            "Solving Sparse Instances of Max SAT via Width Reduction and Greedy Restriction.",
            "Enhancing the Computation of Distributed Shortest Paths on Power-law Networks in Dynamic Scenarios.",
            "An analytic System with a Computable Hyperbolic Sink Whose Basin of Attraction is Non-Computable.",
            "Preface.",
            "Mechanisms for Scheduling with Single-Bit Private Values.",
            "Uniform Price Auctions: Equilibria and Efficiency.",
            "Capacitated Network Design Games.",
            "Congestion Games with Capacitated Resources.",
            "Minimizing Expectation Plus Variance.",
            "Network Bargaining: Using Approximate Blocking Sets to Stabilize Unstable Instances.",
            "Preface to Special Issue on Algorithmic Game Theory - Dedicated to the Memory of Berthold Vöcking.",
            "Imperfect Best-Response Mechanisms.",
            "Friend of My Friend: Network Formation with Two-Hop Benefit.",
            "Copula-based Randomized Mechanisms for Truthful Scheduling on Two Unrelated Machines.",
            "Inefficiency of Games with Social Context.",
            "Editor's Note: Special Issue on Database Theory.",
            "Optimal Probabilistic Generation of XML Documents.",
            "On the Data Complexity of Consistent Query Answering.",
            "Certain Answers over Incomplete XML Documents: Extending Tractability Boundary.",
            "Highly Expressive Query Languages for Unordered Data Trees.",
            "Deciding Twig-definability of Node Selecting Tree Automata.",
            "Parallel Skyline Queries.",
            "Deciding Confluence for a Simple Class of Relational Transducer Networks.",
            "Foreword: Special Issue on Database Theory.",
            "Fast Learning of Restricted Regular Expressions and DTDs.",
            "Lower Bounds on the Error of Query Sets Under the Differentially-Private Matrix Mechanism.",
            "Structural Tractability of Counting of Solutions to Conjunctive Queries.",
            "Which XML Schemas are Streaming Bounded Repairable?",
            "XML Compression via Directed Acyclic Graphs."
        ]
    },
    {
        "name": "Theory of Computing Systems",
        "year": "2014",
        "info": "2014: Volumes\n54,\n55",
        "count": 73,
        "papers": [
            "On Edge Irregular Total Labeling of Categorical Product of Two Cycles.",
            "Optimal Collapsing Protocol for Multiparty Pointer Jumping.",
            "The Bell Is Ringing in Speed-Scaled Multiprocessor Scheduling.",
            "Parameterized Domination in Circle Graphs.",
            "On the Hardness of Losing Width.",
            "Computational Aspects of Uncertainty Profiles and Angel-Daemon Games.",
            "Word-Mappings of Level 2.",
            "Editor's Note.",
            "On Equilibria in Quantitative Games with Reachability/Safety Objectives.",
            "Prehistoric Graph in Modal Derivations and Self-Referentiality.",
            "Approximating the Minimum Length of Synchronizing Words Is Hard.",
            "Growth of Power-Free Languages over Large Alphabets.",
            "Obtaining Online Ecological Colourings by Generalizing First-Fit.",
            "Lower Bound on Average-Case Complexity of Inversion of Goldreich's Function by Drunken Backtracking Algorithms.",
            "Quotient Complexity of Closed Languages.",
            "Computational Complexity of Certain Problems Related to Carefully Synchronizing Words for Partial Automata and Directing Words for Nondeterministic Automata.",
            "Encoding Invariance in Average Case Complexity.",
            "Balancing Bounded Treewidth Circuits.",
            "Validating the Knuth-Morris-Pratt Failure Function, Fast and Online.",
            "Special Issue on Algorithmic Game Theory.",
            "Scheduling Without Payments.",
            "A Truthful Mechanism for Value-Based Scheduling in Cloud Computing.",
            "Strategic Pricing in Next-Hop Routing with Elastic Demands.",
            "Weakly-Acyclic (Internet) Routing Games.",
            "Repeated Budgeted Second Price Ad Auction.",
            "Random Bimatrix Games Are Asymptotically Easy to Solve (A Simple Proof).",
            "Complexity of Rational and Irrational Nash Equilibria.",
            "Editorial: Fun with Algorithms.",
            "Picture-Hanging Puzzles.",
            "The Coolest Way to Generate Binary Strings.",
            "Perfect Strategies for the Ulam-Rényi Game with Multi-interval Questions.",
            "Gaming Is a Hard Job, but Someone Has to Do It!",
            "Optimal Sensor Networks for Area Monitoring Using Rotating and Beam Sensors.",
            "Computational Aspects of M.C. Escher's Ribbon Patterns.",
            "Practical Algorithms for Generating a Random Ordering of the Elements of a Weighted Set.",
            "Scandinavian Thins on Top of Cake: New and Improved Algorithms for Stacking and Packing.",
            "The Kissing Problem: How to End a Gathering When Everyone Kisses Everyone Else Goodbye.",
            "Spanning Trees and the Complexity of Flood-Filling Games.",
            "Distributed Knowledge Justification Logics.",
            "String Indexing for Patterns with Wildcards.",
            "Constant Thresholds Can Make Target Set Selection Tractable.",
            "Accepting Networks of Evolutionary Processors with Subregular Filters.",
            "A Note on the Parallel Runtime of Self-Stabilizing Graph Linearization.",
            "Decidability of Branching Bisimulation on Normed Commutative Context-Free Processes.",
            "Constant Unary Constraints and Symmetric Real-Weighted Counting Constraint Satisfaction Problems.",
            "Improved Randomized Online Scheduling of Intervals and Jobs.",
            "Dynamic Matrix Rank with Partial Lookahead.",
            "The Failure of the Strong Pumping Lemma for Multiple Context-Free Languages.",
            "Editorial.",
            "The Equivalence of Sampling and Searching.",
            "Improving the Space-Bounded Version of Muchnik's Conditional Complexity Theorem via \"Naive\" Derandomization.",
            "Pseudo-Random Graphs and Bit Probe Schemes with One-Sided Error.",
            "An Extended Tree-Width Notion for Directed Graphs Related to the Computation of Permanents.",
            "Join-Reachability Problems in Directed Graphs.",
            "The Complexity of Solving Reachability Games Using Value and Strategy Iteration.",
            "Learning Read-Constant Polynomials of Constant Degree Modulo Composites.",
            "Two-Way Automata Versus Logarithmic Space.",
            "Foreword: Parallelism in Algorithms and Architectures.",
            "Tight Bounds for Adopt-Commit Objects.",
            "Highly-Efficient Wait-Free Synchronization.",
            "Nearly-Linear Work Parallel SDD Solvers, Low-Diameter Decomposition, and Low-Stretch Subgraphs.",
            "Software Engineering with Transactional Memory Versus Locks in Practice.",
            "Re-Chord: A Self-stabilizing Chord Overlay Network.",
            "On a Local Protocol for Concurrent File Transfers.",
            "Preface of STACS 2012 Special Issue.",
            "13/9 -Approximation for Graphic TSP.",
            "Playing Mastermind with Constant-Size Memory.",
            "The Complexity of Compressed Membership Problems for Finite Automata.",
            "Linear-Space Data Structures for Range Mode Query in Arrays.",
            "Efficient Algorithms for Highly Compressed Data: The Word Problem in Generalized Higman Groups Is in P.",
            "On First-Order Logic and CPDA Graphs.",
            "On the Separation Question for Tree Languages.",
            "Model-Theoretic Properties of ω-Automatic Structures."
        ]
    },
    {
        "name": "Theory of Computing Systems",
        "year": "2013",
        "info": "2013: Volumes\n52,\n53",
        "count": 67,
        "papers": [
            "Computability, Complexity and Randomness.",
            "Maximal Pairs of Computably Enumerable Sets in the Computably Lipschitz Degrees.",
            "On the Gap Between Trivial and Nontrivial Initial Segment Prefix-Free Complexity.",
            "Effective Randomness of Unions and Intersections.",
            "Martin-Löf Randomness, Invariant Measures and Countable Homogeneous Structures.",
            "Time-Bounded Kolmogorov Complexity and Solovay Functions.",
            "Dimension Is Compression.",
            "Characterization of Kurtz Randomness by a Differentiation Theorem.",
            "Using Ideas of Kolmogorov Complexity for Studying Biological Texts.",
            "Axiomatizing Kolmogorov Complexity.",
            "One-Way Functions Using Algorithmic and Classical Information Theories.",
            "Deterministic Rendezvous of Asynchronous Bounded-Memory Agents in Polygonal Terrains.",
            "Strategic Multiway Cut and Multicut Games.",
            "Parameterized Random Complexity.",
            "A Combinatorial Analysis for the Critical Clause Tree.",
            "Energy-Efficient Communication in Multi-interface Wireless Networks.",
            "An Additivity Theorem for Plain Kolmogorov Complexity.",
            "On Reversible Cascades in Scale-Free and Erdős-Rényi Random Graphs.",
            "On the Expansion and Diameter of Bluetooth-Like Topologies.",
            "Preface.",
            "(Approximate) Uncertain Skylines.",
            "Querying Probabilistic Business Processes for Sub-Flows.",
            "Knowledge Compilation Meets Database Theory: Compiling Queries to Decision Diagrams.",
            "Data Cleaning and Query Answering with Matching Dependencies and Matching Functions.",
            "Relaxed Notions of Schema Mapping Equivalence Revisited.",
            "Generating, Sampling and Counting Subclasses of Regular Tree Languages.",
            "On Rationality of Verbal Subsets in a Group.",
            "The Rank-Width of Edge-Coloured Graphs.",
            "Colorings with few Colors: Counting, Enumeration and Combinatorial Bounds.",
            "Improved Lower Bounds on the Price of Stability of Undirected Network Design Games.",
            "Partition Into Triangles on Bounded Degree Graphs.",
            "Parameterized Complexity of Satisfying Almost All Linear Equations over $\\mathbb{F}_{2}$.",
            "Built-in Coloring for Highly-Concurrent Doubly-Linked Lists.",
            "Collusion in Atomic Splittable Routing Games.",
            "Preface to Special Issue on Algorithmic Game Theory.",
            "Mixing Time and Stationary Expected Social Welfare of Logit Dynamics.",
            "On the Rate of Convergence of Fictitious Play.",
            "The Price of Anarchy in Network Creation Games Is (Mostly) Constant.",
            "Partition Equilibrium Always Exists in Resource Selection Games.",
            "Braess's Paradox for Flows over Time.",
            "On the Structure of Weakly Acyclic Games.",
            "Preface of Special Issue on Theoretical Aspects of Computer Science.",
            "Series Parallel Digraphs with Loops - Graphs Encoded by Regular Expression.",
            "Extended Regular Expressions: Succinctness and Decidability.",
            "Nominal Monoids.",
            "Stochastic Cellular Automata Solutions to the Density Classification Problem - When Randomness Helps Computing.",
            "Spectral Sparsification in the Semi-streaming Setting.",
            "Vertex Cover Kernelization Revisited - Upper and Lower Bounds for a Refined Parameter.",
            "Online Scheduling with Interval Conflicts.",
            "Tight Bounds for Distributed Minimum-Weight Spanning Tree Verification.",
            "Towards Duality of Multicommodity Multiroute Cuts and Flows: Multilevel Ball-Growing.",
            "Global Strong Defensive Alliances of Sierpiński-Like Graphs.",
            "Static Strategies for Worksharing with Unrecoverable Interruptions.",
            "Nonpreemptive Coordination Mechanisms for Identical Machines.",
            "On the Complexity of Pareto-Optimal Nash and Strong Equilibria.",
            "Unbalanced Graph Partitioning.",
            "The Complexity of Computing Minimal Unidirectional Covering Sets.",
            "Comments on Arithmetic Complexity, Kleene Closure, and Formal Power Series.",
            "Normalized Range Voting Broadly Resists Control.",
            "On Enumerating Monomials and Other Combinatorial Structures by Polynomial Interpolation.",
            "Motion Planning with Pulley, Rope, and Baskets.",
            "Compact DSOP and Partial DSOP Forms.",
            "A Polynomial Kernel for Feedback Arc Set on Bipartite Tournaments.",
            "Sofic Tree-Shifts.",
            "A Process Calculus with Finitary Comprehended Terms.",
            "Log-Space Algorithms for Paths and Matchings in k-Trees.",
            "Corrigendum. The Linear Arrangement Problem Parameterized Above Guaranteed Value."
        ]
    },
    {
        "name": "Theory of Computing Systems",
        "year": "2012",
        "info": "2012: Volumes\n50,\n51",
        "count": 66,
        "papers": [
            "Special Issue on Fun with Algorithms.",
            "Christmas Gift Exchange Games.",
            "The Feline Josephus Problem.",
            "On Approximate Jumbled Pattern Matching in Strings.",
            "Guessing Bank PINs by Winning a Mastermind Game.",
            "The Complexity of Flood Filling Games.",
            "Simple Wriggling is Hard Unless You Are a Fat Hippo.",
            "In-place Algorithm for Erasing a Connected Component in a Binary Image.",
            "Scheduling with Bully Selfish Jobs.",
            "Maintaining Privacy on a Line.",
            "Searching for Black Holes in Subways.",
            "Two Skew-Binary Numeral Systems and One Application.",
            "The Navigational Power of Web Browsers.",
            "A Büchi-Like Theorem for Weighted Tree Automata over Multioperator Monoids.",
            "Layered Hashing Algorithm for Real-time Systems.",
            "On Empirical Meaning of Randomness with Respect to Parametric Families of Probability Distributions.",
            "On the Expressiveness of Single-Pass Instruction Sequences.",
            "On the Expression Complexity of Equivalence and Isomorphism of Primitive Positive Formulas.",
            "Computing Conformal Maps of Finitely Connected Domains onto Canonical Slit Domains.",
            "Computing Space-Filling Curves.",
            "The Baire Partial Quasi-Metric Space: A Mathematical Tool for Asymptotic Complexity Analysis in Computer Science.",
            "The Complexity of Circumscriptive Inference in Post's Lattice.",
            "A Note on Exact Algorithms for Vertex Ordering Problems on Graphs.",
            "How to Prove Impossibility Under Global Fairness: On Space Complexity of Self-Stabilizing Leader Election on a Population Protocol Model.",
            "Trichotomies in the Complexity of Minimal Inference.",
            "Faster Approximate String Matching for Short Patterns.",
            "On the Correlation Between Parity and Modular Polynomials.",
            "Irregular Total Labellings of Generalized Petersen Graphs.",
            "An Improved Approximation Algorithm for the Most Points Covering Problem.",
            "The Impact of Social Ignorance on Weighted Congestion Games.",
            "An Effective Carathéodory Theorem.",
            "The Efficiency of Fair Division.",
            "Cops and Robber Game Without Recharging.",
            "Effective Versions of Local Connectivity Properties.",
            "Structure of Polynomial-Time Approximation.",
            "Parameterizing by the Number of Numbers.",
            "Second-Level Algorithms, Superrecursivity, and Recovery Problem in Distributed Systems.",
            "On the Contribution of Backward Jumps to Instruction Sequence Expressiveness.",
            "Linear-Time Algorithm for the Paired-Domination Problem in Convex Bipartite Graphs.",
            "Computability in Europe 2009.",
            "Minimum Entropy Combinatorial Optimization Problems.",
            "Program Self-Reference in Constructive Scott Subdomains.",
            "Cutting Planes and the Parameter Cutwidth.",
            "Representation Theorems for Analytic Machines and Computability of Analytic Functions.",
            "Non-determinism in Gödel's System T.",
            "Comparing Nontriviality for E and EXP.",
            "Theoretical Aspects of Computer Science.",
            "Dispersion in Disks.",
            "The Complexity of the List Homomorphism Problem for Graphs.",
            "On Optimal Heuristic Randomized Semidecision Procedures, with Applications to Proof Complexity and Cryptography.",
            "Representing Hyper-arithmetical Sets by Equations over Sets of Integers.",
            "Inseparability and Strong Hypotheses for Disjoint NP Pairs.",
            "Collapsing and Separating Completeness Notions Under Average-Case and Worst-Case Hypotheses.",
            "Programs, Proofs, Processes.",
            "A Faster Algorithm for Finding Minimum Tucker Submatrices.",
            "Avoiding Simplicity is Complex.",
            "The Complexity of Explicit Constructions.",
            "Proofs, Programs, Processes.",
            "How Powerful Are Integer-Valued Martingales?",
            "Computability of Countable Subshifts in One Dimension.",
            "Approximate Self-Assembly of the Sierpinski Triangle.",
            "Special Issue on Distributed Computing.",
            "Generating Fast Indulgent Algorithms.",
            "A Single-Version STM that Is Multi-Versioned Permissive.",
            "Efficient Decentralized Algorithms for the Distributed Trigger Counting Problem.",
            "A Near Optimal Periodic Transmission Schedule in Bounded Degree Wireless Sensor Network."
        ]
    },
    {
        "name": "Theory of Computing Systems",
        "year": "2011",
        "info": "2011: Volumes\n48,\n49",
        "count": 80,
        "papers": [
            "Performance of Scheduling Policies in Adversarial Networks with Non-synchronized Clocks.",
            "Weighted Logics for Unranked Tree Automata.",
            "Weighted Picture Automata and Weighted Logics.",
            "Improved Results for a Memory Allocation Problem.",
            "Fixpoint Logics over Hierarchical Structures.",
            "RFID Authentication Efficient Proactive Information Security within Computational Security.",
            "Parallelizing Time with Polynomial Circuits.",
            "New Results on the Most Significant Bit of Integer Multiplication.",
            "An Almost Quadratic Time Algorithm for Sparse Spliced Alignment.",
            "Privacy in Non-private Environments.",
            "Notes on Sum-Tests and Independence Tests.",
            "Optimal Cache-Oblivious Mesh Layouts.",
            "Beta-Shifts, Their Languages, and Computability.",
            "Complexity of Equations over Sets of Natural Numbers.",
            "A Hierarchy of Monotone Deterministic Non-Forgetting Restarting Automata.",
            "The Strongest Model of Computation Obeying 0-1 Principles.",
            "Spreading of Messages in Random Graphs.",
            "Vertex Cover Problem Parameterized Above and Below Tight Bounds.",
            "Tilings and Submonoids of Metabelian Groups.",
            "Sublinear Time Algorithms for Earth Mover's Distance.",
            "Preface: Special Issue on Theoretical Aspects of Computer Science (STACS).",
            "Tractable Structures for Constraint Satisfaction with Truth Tables.",
            "Randomness on Computable Probability Spaces - A Dynamical Point of View.",
            "Fragments of First-Order Logic over Infinite Words.",
            "Ambiguity and Communication.",
            "Generating Shorter Bases for Hard Random Lattices.",
            "Weak MSO with the Unbounding Quantifier.",
            "Semi-Online Preemptive Scheduling: One Algorithm for All Variants.",
            "Computability in Europe 2008.",
            "Computability and Complexity in Self-assembly.",
            "Model Checking Weighted Integer Reset Timed Automata.",
            "On the Complexity of Computing Winning Strategies for Finite Poset Games.",
            "Topological Dynamics of Cellular Automata: Dimension Matters.",
            "Enhanced Mobile Membranes: Computability Results.",
            "Polylog Space Compression, Pushdown Compression, and Lempel-Ziv Are Incomparable.",
            "Conditional Fuzzy Entropy of Maps in Fuzzy Systems.",
            "Stackelberg Strategies and Collusion in Network Games with Splittable Flow.",
            "Lower Bounds for Kernelizations and Other Preprocessing Procedures.",
            "Straight-line Instruction Sequence Completeness for Total Calculation on Cancellation Meadows.",
            "Algorithms for Finding a Most Similar Subforest.",
            "Preface: Algorithmic Game Theory.",
            "Non-clairvoyant Scheduling Games.",
            "Performance of One-Round Walks in Linear Congestion Games.",
            "Characterizing the Existence of Potential Functions in Weighted Congestion Games.",
            "Nash Equilibria and the Price of Anarchy for Flows over Time.",
            "Price of Stability in Survivable Network Design.",
            "The Computational Complexity of Weak Saddles.",
            "On the Complexity of Iterated Weak Dominance in Constant-Sum Games.",
            "The Balloon Popping Problem Revisited: Lower and Upper Bounds.",
            "Truthful Mechanisms for Selfish Routing and Two-Parameter Agents.",
            "Editorial.",
            "Variations on Muchnik's Conditional Complexity Theorem.",
            "On the Complexity of Matroid Isomorphism Problem.",
            "New Plain-Exponential Time Classes for Graph Homomorphism.",
            "Compressed Word Problems in HNN-extensions and Amalgamated Products.",
            "Concatenation of Regular Languages and Descriptional Complexity.",
            "One-Nonterminal Conjunctive Grammars over a Unary Alphabet.",
            "Lower Bounds for the Determinantal Complexity of Explicit Low Degree Polynomials.",
            "Unique Decipherability in the Monoid of Languages: An Application of Rational Relations.",
            "Foreword.",
            "Querying Data Sources that Export Infinite Sets of Views.",
            "Containment of Conjunctive Queries on Annotated Relations.",
            "Reconcilable Differences.",
            "Query Languages for Data Exchange: Beyond Unions of Conjunctive Queries.",
            "Area, Curve Complexity, and Crossing Resolution of Non-Planar Graph Drawings.",
            "A Property Tester for Tree-Likeness of Quartet Topologies.",
            "The Hub Number of Sierpiński-Like Graphs.",
            "Dimension, Halfspaces, and the Density of Hard Sets.",
            "Approximating the Metric TSP in Linear Time.",
            "Generalized Semimagic Squares for Digital Halftoning.",
            "Regular Languages of Nested Words: Fixed Points, Automata, and Synchronization.",
            "Guest Editorial: Parallelism in Algorithms and Architectures.",
            "Local Approximability of Max-Min and Min-Max Linear Programs.",
            "Inherent Limitations on Disjoint-Access Parallel Implementations of Transactional Memory.",
            "Finding Similar Users in Social Networks.",
            "Buffer Management for Colored Packets with Deadlines.",
            "Scheduling to Minimize Staleness and Stretch in Real-Time Data Warehouses.",
            "Gradient Clock Synchronization in Dynamic Networks.",
            "Speed Scaling of Processes with Arbitrary Speedup Curves on a Multiprocessor.",
            "Approximation Algorithms for Time-Constrained Scheduling on Line Networks."
        ]
    },
    {
        "name": "Theory of Computing Systems",
        "year": "2010",
        "info": "2010: Volumes\n46,\n47",
        "count": 83,
        "papers": [
            "Preface.",
            "Generic Complexity of Presburger Arithmetic.",
            "On the Complexity of Matrix Rank and Rigidity.",
            "Conjunctive Grammars over a Unary Alphabet: Undecidability and Unbounded Growth.",
            "A Fast Algorithm for the Path 2-Packing Problem.",
            "Equivalence Problems for Circuits over Sets of Natural Numbers.",
            "Maximal Intersection Queries in Randomized Input Models.",
            "Efficient Algorithms for Sparse Cyclotomic Integer Zero Testing.",
            "Does the Polynomial Hierarchy Collapse if Onto Functions are Invertible?",
            "Disc Covering Problem with Application to Digital Halftoning.",
            "A New Characterization of NP, P, and PSPACE with Accepting Hybrid Networks of Evolutionary Processors.",
            "The 1-Versus-2 Queries Problem Revisited.",
            "On the Autoreducibility of Functions.",
            "Class Constrained Bin Covering.",
            "Fixed-Parameter Enumerability of Cluster Editing and Related Problems.",
            "Bijective Linear Time Coding and Decoding for k-Trees.",
            "Entropy of Operators or why Matrix Multiplication is Hard for Depth-Two Circuits.",
            "W-Hierarchies Defined by Symmetric Gates.",
            "Computing Interpolating Sequences.",
            "On Bounded Rational Trace Languages.",
            "Approximability of Clausal Constraints.",
            "Preface of STACS 2007 Special Issue.",
            "On Symmetric Signatures in Holographic Algorithms.",
            "Small Space Representations for Metric Min-sum k-Clustering and Their Applications.",
            "Sturmian Trees.",
            "A Search Algorithm for Subshift Attractors of Cellular Automata.",
            "Arithmetizing Classes Around NC\\textsf{NC}1 and L\\textsf{L}.",
            "Why Almost All k-Colorable Graphs Are Easy to Color.",
            "A Cubic Kernel for Feedback Vertex Set and Loop Cutset.",
            "Kolmogorov-Loveland Stochasticity and Kolmogorov Complexity.",
            "Preface.",
            "Comparing Universal Covers in Polynomial Time.",
            "Self-Referential Justifications in Epistemic Logic.",
            "Unidirectional Lambek Grammars in Polynomial Time.",
            "A Semantic Proof of Polytime Soundness of Light Affine Logic.",
            "Complexity of the Bollobás-Riordan Polynomial. Exceptional Points and Uniform Reductions.",
            "Two Sources Are Better than One for Increasing the Kolmogorov Complexity of Infinite Sequences.",
            "Simple and Improved Parameterized Algorithms for Multiterminal Cuts.",
            "Logic and Rational Languages of Words Indexed by Linear Orderings.",
            "On the Expressive Power of Permanents and Perfect Matchings of Matrices of Bounded Pathwidth/Cliquewidth.",
            "Preface.",
            "Sensitivity of Wardrop Equilibria.",
            "Non-Cooperative Cost Sharing Games via Subsidies.",
            "Atomic Congestion Games: Fast, Myopic and Concurrent.",
            "Facets of the Fully Mixed Nash Equilibrium Conjecture.",
            "Congestion Games with Linearly Independent Paths: Convergence Time and Price of Anarchy.",
            "TCP is Competitive with Resource Augmentation.",
            "The Deduction Theorem for Strong Propositional Proof Systems.",
            "Border Correlations of Partial Words.",
            "Fixed-Parameter Algorithms for Cluster Vertex Deletion.",
            "Stackelberg Strategies for Atomic Congestion Games.",
            "The Solvability Problem for Quadratic Equations over Free Groups is NP-Complete.",
            "Strongly Terminating Early-Stopping k-Set Agreement in Synchronous Systems with General Omission Failures.",
            "Reductions to Graph Isomorphism.",
            "Time and Space Complexity for Splicing Systems.",
            "Non-Uniform Reductions.",
            "New Fixed-Parameter Algorithms for the Minimum Quartet Inconsistency Problem.",
            "Sublinear Fully Distributed Partition with Applications.",
            "Computing Nash Equilibria for Scheduling on Restricted Parallel Links.",
            "Stochastic Models and Adaptive Algorithms for Energy Balance in Sensor Networks.",
            "The Complexity of Problems for Quantified Constraints.",
            "On the Automatizability of Polynomial Calculus.",
            "Designing Fast Converging Cost Sharing Methods for Multicast Transmissions.",
            "Constrained-Path Labellings on Graphs of Bounded Clique-Width.",
            "Automatic Presentations and Semigroup Constructions.",
            "Exact OBDD Bounds for Some Fundamental Functions.",
            "STACS 2008 Foreword.",
            "Trimming of Graphs, with Application to Point Labeling.",
            "Trimmed Moebius Inversion and Graphs of Bounded Degree.",
            "The Isomorphism Problem for Planar 3-Connected Graphs Is in Unambiguous Logspace.",
            "Connecting Polygonizations via Stretches and Twangs.",
            "Model Checking Games for the Quantitative µ-Calculus.",
            "Limit Complexities Revisited.",
            "Deterministically Isolating a Perfect Matching in Bipartite Planar Graphs.",
            "Lexicographic Decomposition of k-Valued Transducers.",
            "Quantum Search with Variable Times.",
            "Foreword.",
            "Distributed Approximation of Capacitated Dominating Sets.",
            "Strong-Diameter Decompositions of Minor Free Graphs.",
            "Approximation Algorithms for Multiprocessor Scheduling under Uncertainty.",
            "The Cache-Oblivious Gaussian Elimination Paradigm: Theoretical Framework, Parallelization and Experimental Evaluation.",
            "Local MST Computation with Short Advice.",
            "Optimal Sparse Matrix Dense Vector Multiplication in the I/O-Model."
        ]
    },
    {
        "name": "Theory of Computing Systems",
        "year": "2009",
        "info": "2009: Volumes\n44,\n45",
        "count": 85,
        "papers": [
            "Composing Stack-Attributed Tree Transducers.",
            "Nonblocking k -Compare-Single-Swap.",
            "Paging with Request Sets.",
            "The Complexity of Deciding if a Boolean Function Can Be Computed by Circuits over a Restricted Basis.",
            "Applying Modular Decomposition to Parameterized Cluster Editing Problems.",
            "On Embedding of a Hypercube in a Completely Overlapping Network.",
            "Isomorphic Implication.",
            "Foreword.",
            "On Embedding a Graph in the Grid with the Maximum Number of Bends and Other Bad Features.",
            "Wooden Geometric Puzzles: Design and Hardness Proofs.",
            "The Worst Page-Replacement Policy.",
            "Contiguous Search Problem in Sierpinski Graphs.",
            "Die Another Day.",
            "The Ferry Cover Problem.",
            "Drawing Borders Efficiently.",
            "Cryptographic and Physical Zero-Knowledge Proof Systems for Solutions of Sudoku Puzzles.",
            "Pictures from Mongolia. Extracting the Top Elements from a Partially Ordered Set.",
            "Two-Dimensional Packet Classification and Filter Conflict Resolution in the Internet.",
            "Adversarial Queueing Model for Continuous Network Dynamics.",
            "Applying Approximate Counting for Computing the Frequency Moments of Long Data Streams.",
            "A Linear-Time Algorithm for Hamming Distance with Shifts.",
            "Computing Graph Automorphism from Partial Solutions.",
            "Machines that Can Output Empty Words.",
            "Minimization Problems for Parity OBDDs.",
            "On Characteristics of Information System Homomorphisms.",
            "Hairpin Structures Defined by DNA Trajectories.",
            "A Kleene Theorem for Weighted Tree Automata over Distributive Multioperator Monoids.",
            "Foreword.",
            "Query Evaluation on a Database Given by a Random Graph.",
            "Database Query Processing Using Finite Cursor Machines.",
            "Axiomatizing the Logical Core of XPath 2.0.",
            "Structural Recursion as a Query Language on Lists and Ordered Trees.",
            "Modulo Constraints and the Complexity of Typechecking XML Views.",
            "Fault-Tolerant Sequential Scan.",
            "Polynomial-Size Binary Decision Diagrams for the Exactly Half-d-Hyperclique Problem Reading Each Input Bit Twice.",
            "Degree-Optimal Routing for P2P Systems.",
            "An Outer-Measure Approach for Resource-Bounded Measure.",
            "Probabilistic Length-Reducing Two-Pushdown Automata.",
            "On the Theory of Matchgate Computations.",
            "Infinite Traces and Symbolic Dynamics.",
            "Sophistication Revisited.",
            "Multiobjective Optimization: Improved FPTAS for Shortest Paths and Non-Linear Objectives with Applications.",
            "Foreword.",
            "Exponential Separation of Quantum and Classical Online Space Complexity.",
            "The Cache Complexity of Multithreaded Cache Oblivious Algorithms.",
            "Towards a Scalable and Robust DHT.",
            "Tell Me Who I Am: An Interactive Recommendation System.",
            "On the Price of Heterogeneity in Parallel Systems.",
            "Network Design with Weighted Players.",
            "Smooth Scheduling under Variable Rates or the Analog-Digital Confinement Game.",
            "A New Efficient Algorithm for Computing the Longest Common Subsequence.",
            "Bounds on Mincut for Cayley Graphs over Abelian Groups.",
            "Unavoidable Sets of Partial Words.",
            "Fault-Tolerant Embedding of Pairwise Independent Hamiltonian Paths on a Faulty Hypercube with Edge Faults.",
            "WAOA 2006 Special Issue of TOCS.",
            "Online Dynamic Programming Speedups.",
            "Covering Many or Few Points with Unit Disks.",
            "Online k-Server Routing Problems.",
            "A Randomized Algorithm for Online Unit Clustering.",
            "On Hierarchical Diameter-Clustering and the Supplier Problem.",
            "Network Design with Edge-Connectivity and Degree Constraints.",
            "Competitive Online Multicommodity Routing.",
            "Analysis of Approximation Algorithms for k-Set Cover Using Factor-Revealing Linear Programs.",
            "The Complexity of Finding SUBSEQ(A).",
            "Quantum Algorithms for Matching Problems.",
            "On the Black-Box Complexity of Sperner's Lemma.",
            "Computation and Logic in the Real World: CiE 2007.",
            "Between Order and Chaos: The Quest for Meaningful Information.",
            "Planar and Grid Graph Reachability Problems.",
            "Depth as Randomness Deficiency.",
            "Constructive Dimension and Turing Degrees.",
            "Characterizing Programming Systems Allowing Program Self-Reference.",
            "Resource Restricted Computability Theoretic Learning: Illustrative Topics and Problems.",
            "Two Algorithms in Search of a Type-System.",
            "The Complexity Ecology of Parameters: An Illustration Using Bounded Max Leaf Number.",
            "Input-Dependence in Function-Learning.",
            "Circuit Complexity of Regular Languages.",
            "Speed-Up Theorems in Type-2 Computations Using Oracle Turing Machines.",
            "Enumerations and Completely Decomposable Torsion-Free Abelian Groups.",
            "Nash Stability in Additively Separable Hedonic Games and Community Structures.",
            "Theory of Computing Systems (TOCS) Submission Version Finding Most Likely Solutions.",
            "Finding Most Likely Solutions.",
            "Comparing Notions of Computational Entropy.",
            "The lambda-Calculus and the Unity of Structural Proof Theory.",
            "On the Universal Computing Power of Amorphous Computing Systems."
        ]
    },
    {
        "name": "Theory of Computing Systems",
        "year": "2008",
        "info": "2008: Volumes\n42,\n43",
        "count": 61,
        "papers": [
            "Preface.",
            "Traffic Engineering of Management Flows by Link Augmentations on Confluent Trees.",
            "Collaborate with Strangers to Find Own Preferences.",
            "Adaptive Energy Management for Incremental Deployment of Heterogeneous Wireless Sensors.",
            "Processor Efficient Parallel Matching.",
            "Selfish Routing with Incomplete Information.",
            "Partial Bi-immunity, Scaled Dimension, and NP-Completeness.",
            "A Generalization of Magic Squares with Applications to Digital Halftoning.",
            "Storage Products and Linear Control of Derivations.",
            "A Revised Transformation Protocol for Unconditionally Secure Secret Key Exchange.",
            "Efficient Algorithms for Anonymous Byzantine Agreement.",
            "Complexity of Clausal Constraints Over Chains.",
            "Languages of Dot-Depth 3/2.",
            "Foreword.",
            "Grasp and Delivery for Moving Objects on Broken Lines.",
            "Logical Equivalence for Subtyping Object and Recursive Types.",
            "Improved Algorithms for Polynomial-Time Decay and Time-Decay with Additive Error.",
            "Model Checking Abilities of Agents: A Closer Look.",
            "A New Combinatorial Approach to Sequence Comparison.",
            "Optimal On-Line Algorithms to Minimize Makespan on Two Machines with Resource Augmentation.",
            "Synthesis of Autosymmetric Functions in a New Three-Level Form.",
            "On \"Exploiting\" Node-Heterogeneous Clusters Optimally.",
            "On the Complexity of 2-Monotone Restarting Automata.",
            "Store-and-Forward Multicast Routing on the Mesh.",
            "Pattern Matching and Membership for Hierarchical Message Sequence Charts.",
            "Provably Fast Training Algorithms for Support Vector Machines.",
            "Relations between Average-Case and Worst-Case Complexity.",
            "On Aperiodic and Star-Free Formal Power Series in Partially Commuting Variables.",
            "Asymptotically Optimal Solutions for Small World Graphs.",
            "WAOA 2005 Special Issue of TOCS.",
            "Improved Approximation Algorithm for Convex Recoloring of Trees.",
            "Approximately Fair Cost Allocation in Metric Traveling Salesman Games.",
            "Online Removable Square Packing.",
            "Maximum k -Splittable s , t -Flows.",
            "Speed Scaling of Tasks with Precedence Constraints.",
            "Approximation Schemes for Packing with Item Fragmentation.",
            "Foreword.",
            "SZK Proofs for Black-Box Group Problems.",
            "Tuples of Disjoint NP-Sets.",
            "The Complexity of Equality Constraint Languages.",
            "Incremental Branching Programs.",
            "Feasible Operations on Proofs: The Logic of Proofs for Bounded Arithmetic.",
            "On Short Paths Interdiction Problems: Total and Node-Wise Limited Interdiction.",
            "Enumerate and Expand: Improved Algorithms for Connected Vertex Cover and Tree Cover.",
            "Branching Time Logics BTLU, SN, N-1(Z)a with Operations Until and Since Based on Bundles of Integer Numbers, Logical Consecutions, Deciding Algorithms.",
            "Interacting Explicit Evidence Systems.",
            "Computability in Europe 2006.",
            "A Provably Correct Translation of the lambda -Calculus into a Mathematical Model of C++.",
            "Abstract Interface Behavior of Object-Oriented Languages with Monitors.",
            "Datatype-Generic Termination Proofs.",
            "Coinduction for Exact Real Number Computation.",
            "Division Safe Calculation in Totalised Fields.",
            "Dimension Extractors and Optimal Decompression.",
            "A Hierarchy below the Halting Problem for Additive Machines.",
            "Scaled Dimension and the Kolmogorov Complexity of Turing-Hard Sets.",
            "Bounds on Sizes of Finite Bisimulations of Pfaffian Dynamical Systems.",
            "Complexity-Theoretic Hierarchies Induced by Fragments of Gödel's T.",
            "From a Zoo to a Zoology: Towards a General Theory of Graph Polynomials.",
            "Risk Assessment for One-Counter Threads.",
            "Realizability interpretation of proofs in constructive analysis.",
            "Classification of Computably Approximable Real Numbers."
        ]
    },
    {
        "name": "Theory of Computing Systems",
        "year": "2007",
        "info": "2007: Volumes\n40,\n41",
        "count": 65,
        "papers": [
            "Odometers on Regular Languages.",
            "Chinese Remaindering with Multiplicative Noise.",
            "The Structure of Infinite Solutions of Marked and Binary Post Correspondence Problems.",
            "Compact Labeling Scheme for XML Ancestor Queries.",
            "OBDD-Based Cryptanalysis of Oblivious Keystream Generators.",
            "A Simple 3-Edge-Connected Component Algorithm.",
            "Rendezvous and Election of Mobile Agents: Impact of Sense of Direction.",
            "Query Learning of Regular Tree Languages: How to Avoid Dead States.",
            "Constant Approximation Algorithms for Rectangle Stabbing and Related Problems.",
            "Distribution of Additive Functions with Respect to Numeration Systems on Regular Languages.",
            "Efficient Exploration of Faulty Trees.",
            "Randomized Algorithms for 3-SAT.",
            "Dichotomies in the Complexity of Solving Systems of Equations over Finite Semigroups.",
            "Foreword.",
            "Characterizing TC0 in Terms of Infinite Groups.",
            "Sorting Stably, in Place, with O(n log n) Comparisons and O(n) Moves.",
            "Dynamic Complexity Theory Revisited.",
            "Robust Polynomials and Quantum Algorithms.",
            "Topological Automata.",
            "Cellular Automata: Real-Time Equivalence between One-Dimensional Neighborhoods.",
            "Truthful Approximation Mechanisms for Scheduling Selfish Related Machines.",
            "The Variable Hierarchy of the µ-Calculus Is Strict.",
            "Roundings Respecting Hard Constraints.",
            "Algorithms to Compute Minimum Cycle Basis in Directed Graphs.",
            "Varieties of Codes and Kraft Inequality.",
            "The Power of Commuting with Finite Sets of Words.",
            "Computing Minimal Multi-Homogeneous Bezout Numbers Is Hard.",
            "Theory of Computation at CiE 2005.",
            "A Thread Algebra with Multi-Level Strategic Interleaving.",
            "Optimal Semicomputable Approximations to Reachable and Invariant Sets.",
            "Shrad: A Language for Sequential Real Number Computation.",
            "Some Relations between Approximation Problems and PCPs over the Real Numbers.",
            "The Computational Complexity of One-Dimensional Sandpiles.",
            "Productivity of Edalat-Potts Exact Arithmetic in Constructive Type Theory.",
            "Computable Analysis of a Boundary-Value Problem for the Korteweg-de Vries Equation.",
            "Real Hypercomputation and Continuity.",
            "Preface.",
            "On the Incompressibility of Monotone DNFs.",
            "Leftist Grammars and the Chomsky Hierarchy.",
            "Polynomial-Space Decidable Membership Problems for Recurrent Systems over Sets of Natural Numbers.",
            "On the Power of Unambiguity in Alternating Machines.",
            "Logspace Optimization Problems and Their Approximability Properties.",
            "Average-Case Non-Approximability of Optimisation Problems.",
            "A Simple and Fast Min-Cut Algorithm.",
            "Exact Algorithms for Graph Homomorphisms.",
            "Foreword.",
            "Pseudo-Kernelization: A Branch-then-Reduce Approach for FPT Problems.",
            "Crown Structures for Vertex Cover Kernelization.",
            "The Parameterized Approximability of TSP with Deadlines.",
            "Algorithms in the W-Hierarchy.",
            "The Complexity of Polynomial-Time Approximation.",
            "An O(2O(k)n3) FPT Algorithm for the Undirected Feedback Vertex Set Problem.",
            "Dynamic Programming for Minimum Steiner Trees.",
            "Parameterized Complexity of Vertex Cover Variants.",
            "The Linear Arrangement Problem Parameterized Above Guaranteed Value.",
            "A Faster FPT Algorithm for the Maximum Agreement Forest Problem.",
            "Some Hard Problems on Matroid Spikes.",
            "Efficient Exact Algorithms through Enumerating Maximal Independent Sets and Other Techniques.",
            "Compressed Suffix Trees with Full Functionality.",
            "The Convergence of Realistic Distributed Load-Balancing Algorithms.",
            "Formal Efficiency Analysis for Tree Transducer Composition.",
            "The Hardness of Approximating Spanner Problems.",
            "Toward Maximizing the Quality of Results of Dependent Tasks Computed Unreliably.",
            "The Complexity of the Descriptiveness of Boolean Circuits over Different Sets of Gates.",
            "Bounded-Diameter Minimum-Cost Graph Problems."
        ]
    },
    {
        "name": "Theory of Computing Systems",
        "year": "2006",
        "info": "Volume 39, 2006",
        "count": 50,
        "papers": [
            "Foreword.",
            "Matching Algorithms Are Fast in Sparse Random Graphs.",
            "A Burnside Approach to the Finite Substitution Problem.",
            "Solving the 2-Disjoint Paths Problem in Nearly Linear Time.",
            "Constant Width Planar Computation Characterizes ACC0.",
            "Approximation Algorithms for Minimizing Average Distortion.",
            "Simpler Computation of Single-Source Shortest Paths in Linear Average Time.",
            "The Expected Competitive Ratio for Weighted Completion Time Scheduling.",
            "Complexity of Regular Language Matching and Other Decidable Cases of the Satisfiability Problem for Constraints Between Regular Open Terms.",
            "Algebraic Results on Quantum Automata.",
            "Time-Space Tradeoff in Derandomizing Probabilistic Logspace.",
            "Local Limit Properties for Pattern Statistics and Rational Models.",
            "Active Context-Free Games.",
            "Why Computational Complexity Requires Stricter Martingales.",
            "The Expressive Power of Bijections over Weakly Arithmetized Structures.",
            "Algebraic Characterization of Reversible Logic Gates.",
            "Optimal Implicit Dictionaries over Unbounded Universes.",
            "Reachability Problems on Regular Ground Tree Rewriting Graphs.",
            "A Reference Correction of \"Effective Jordan Decomposition\".",
            "Foreword.",
            "Insertion Sort is O(n log n).",
            "The Graham-Knowlton Problem Revisited.",
            "More Fun with Symmetric Venn Diagrams.",
            "Juggling with Pattern Matching.",
            "Morpion Solitaire.",
            "Sequencing from Compomers: The Puzzle.",
            "Puzzles, Art, and Magic with Algorithms.",
            "Exploiting Regularities for Boolean Function Synthesis.",
            "Superposition Based on Watson-Crick-Like Complementarity.",
            "Upper and Lower Bounds for Randomized Search Heuristics in Black-Box Optimization.",
            "Parameterized Intractability of Distinguishing Substring Selection.",
            "Clique-Width for 4-Vertex Forbidden Subgraphs.",
            "Energy-Efficient Wireless Network Design.",
            "Useful Templates and Iterated Template-Guided DNA Recombination in Ciliates.",
            "Complexity of the Exact Domatic Number Problem and of the Exact Conveyor Flow Shop Problem.",
            "The Complexity of Finding Top-Toda-Equivalence-Class Members.",
            "Selection Functions that Do Not Preserve Normality.",
            "A Note on MODp - MODm Circuits.",
            "Some Results on Effective Randomness.",
            "Generating Instances for MAX2SAT with Optimal Solutions.",
            "A Special Case of a Unary Regular Language Containment.",
            "An Infinite Hierarchy in a Class of Polynomial-Time Program Schemes.",
            "Foreword.",
            "Simple Efficient Load-Balancing Algorithms for Peer-to-Peer Systems.",
            "On Delivery Times in Packet Networks under Adversarial Traffic.",
            "Parallelism versus Memory Allocation in Pipelined Router Forwarding Engines.",
            "Online Hierarchical Cooperative Caching.",
            "Dynamic Analysis of the Arrow Distributed Protocol.",
            "The Effect of Faults on Network Expansion.",
            "Balanced Graph Partitioning."
        ]
    },
    {
        "name": "Theory of Computing Systems",
        "year": "2005",
        "info": "Volume 38, 2005",
        "count": 37,
        "papers": [
            "A Kleene Theorem for Weighted Tree Automata.",
            "Decidable First-Order Theories of One-Step Rewriting in Trace Monoids.",
            "NP-Partitions over Posets with an Application to Reducing the Set of Solutions of NP Problems.",
            "A Simple Optimal Solution for the Temporal Precedence Problem on Pure Pointer Machines.",
            "Foreword.",
            "Complete Classifications for the Communication Complexity of Regular Languages.",
            "Commutation with Ternary Sets of Words.",
            "The Complexity of Resolution with Generalized Symmetry Rules.",
            "Effective Jordan Decomposition.",
            "Some Results on Derandomization.",
            "Space Efficient Hash Tables with Worst Case Constant Access Time.",
            "Foreword.",
            "Bounded-Degree Independent Sets in Planar Graphs.",
            "The Clique Problem in Intersection Graphs of Ellipses and Triangles.",
            "Crossing Minimization for Symmetries.",
            "Simultaneous Embedding of a Planar Graph and Its Dual on the Grid.",
            "Approximating MIN 2-SAT and MIN 3-SAT.",
            "Probabilistic Algorithms for the Wake-Up Problem in Single-Hop Radio Networks.",
            "Foreword.",
            "Graph-Modeled Data Clustering: Exact Algorithms for Clique Generation.",
            "Unlocking the Advantages of Dynamic Service Selection and Pricing.",
            "Efficient Update Strategies for Geometric Computing with Uncertainty.",
            "The Impact of Network Structure on the Stability of Greedy Protocols.",
            "On-line Stream Merging with Max Span and Min Coverage.",
            "XOR-Based Schemes for Fast Parallel IP Lookups.",
            "Efficient Data Storage in Large Nanoarrays.",
            "The Effect of Synchronicity on the Behavior of Autonomous Mobile Robots.",
            "Correspondence Principles for Effective Dimensions.",
            "Multi-Linearity Self-Testing with Relative Error.",
            "Hierarchy Among Automata on Linear Orderings.",
            "New Graph Classes of Bounded Clique-Width.",
            "Tractable Fragments of Presburger Arithmetic.",
            "A Lower Bound Technique for Nondeterministic Graph-Driven Read-Once-Branching Programs and Its Applications.",
            "Structure-Preserving Hierarchical Decompositions.",
            "Closure Properties of Real Number Classes under CBV Functions.",
            "Resource Bounds and Subproblem Independence.",
            "Improved Approximations for Weighted and Unweighted Graph Problems."
        ]
    },
    {
        "name": "Theory of Computing Systems",
        "year": "2004",
        "info": "Volume 37, 2004",
        "count": 34,
        "papers": [
            "Axiomatising Tree-Interpretable Structures.",
            "Games with Uniqueness Properties.",
            "Labeling Schemes for Dynamic Tree Networks.",
            "How Many Missing Answers Can Be Tolerated by Query Learners?",
            "Comparing Verboseness for Finite Automata and Turing Machines.",
            "Nesting Until and Since in Linear Temporal Logic.",
            "Existential and Positive Theories of Equations in Graph Products.",
            "Generalized Model-Checking over Locally Tree-Decomposable Classes.",
            "Learnability and Definability in Trees and Similar Structures.",
            "Quantum and Approximate Privacy.",
            "Characterizations of Classes of Graphs Recognizable by Local Computations.",
            "A Note on N-Body Computations with Cutoffs.",
            "Foreword.",
            "Extra Processors versus Future Information in Optimal Deadline Scheduling.",
            "Congestion, Dilation, and Energy in Radio Networks.",
            "Õ(Congestion + Dilation) Hot-Potato Routing on Leveled Networks.",
            "The Lazy Adversary Conjecture Fails.",
            "Distributed Object Location in a Dynamic Network.",
            "Nearest Common Ancestors: A Survey and a New Algorithm for a Distributed Environment.",
            "Distributed Streams Algorithms for Sliding Windows.",
            "Obituary: Shimon Even.",
            "Determinization of Transducers over Infinite Words: The General Case.",
            "A Simple Boosting Algorithm Using Multi-Way Branching Decision Trees.",
            "Quadratic Sequential Computations of Boolean Mappings.",
            "An Optimal Parallel Co-Connectivity Algorithm.",
            "Generalized Diameters of the Mesh of Trees.",
            "Periodic Gossiping in Commuted Networks.",
            "Compact Routing Schemes for Dynamic Ring Networks.",
            "Chomskian Hierarchies of Families of Sets of Piecewise Continuous Functions.",
            "2nd International Workshop on Complexity in Automated Deduction (CiAD) - Foreword.",
            "Finite Presentations of Infinite Structures: Automata and Interpretations.",
            "Fixed-Point Logics and Solitaire Games.",
            "A Dichotomy in the Complexity of Propositional Circumscription.",
            "The Complexity of Linear and Stratified Context Matching Problems."
        ]
    },
    {
        "name": "Theory of Computing Systems",
        "year": "2003",
        "info": "Volume 36, 2003",
        "count": 35,
        "papers": [
            "Polynomial Time Introreducibility.",
            "An Efficient Algorithm for Finding All Hinge Vertices on Trapezoid Graphs.",
            "Regular Languages Defined by Generalized First-Order Formulas with a Bounded Number of Bound Variables.",
            "Graph Complexity and Slice Functions.",
            "The Equivalence Problem of Polynomially Bounded D0L Systems - a Bound Depending Only on the Size of the Alphabet.",
            "Essentially Every Unimodular Matrix Defines an Expander.",
            "Routing in Series Parallel Networks.",
            "The Power of Nondeterminism and Randomness for Oblivious Branching Programs.",
            "Extending Stochastic and Quantum Functions.",
            "PP-Lowness and a Simple Definition of AWPP.",
            "Semantical Counting Circuits.",
            "Undecidable Problems for Probabilistic Automata of Fixed Dimension.",
            "Tree Series Transformations that Respect Copying.",
            "A Note on Square Rooting of Time Functions of Turing Machines.",
            "Arithmetic Complexity, Kleene Closure, and Formal Power Series.",
            "Dynamic Generation of Discrete Random Variates.",
            "The (Non)Enumerability of the Determinant and the Rank.",
            "Exact Complexity of the Winner Problem for Young Elections.",
            "A Note on Non-Deterministic Communication Complexity with Few Witnesses.",
            "Scalable Room Synchronizations.",
            "Automatable Verification of Sequential Consistency.",
            "On Spectral Bounds for the k-Partitioning of Graphs.",
            "Deterministic Resource Discovery in Distributed Networks.",
            "Approximation Algorithms for Data Management in Networks.",
            "Towards a First Vertical Prototyping of an Extremely Fine-Grained Parallel Programming Approach.",
            "Attack Propagation in Networks.",
            "A Cost-Effective Architecture for Vectorizable Numerical and Multimedia Applications.",
            "Avoiding Routing Loops on the Internet.",
            "Distributed Search Trees: Fault Tolerance in an Asynchronous Environment.",
            "Deducible and Equivalent Structural Knowledges in Distributed Algorithms.",
            "Asymmetric Communication Protocols via Hotlink Assignments.",
            "Hierarchical Ring Network design.",
            "Approximate Equilibria and Ball Fusion.",
            "Communication-Efficient Broadcasting in Complete Networks with Dynamic Faults.",
            "Broadcasting Spanning Forests on a Multiple-Access Channel."
        ]
    },
    {
        "name": "Theory of Computing Systems",
        "year": "2002",
        "info": "Volume 35, 2002",
        "count": 35,
        "papers": [
            "Improved Bounds for Functions Related to Busy Beavers.",
            "On the Representation of Real Numbers Using Regular Languages.",
            "Cross-Correlation Analysis of Cryptographically Useful Boolean Functions and S-Boxes.",
            "Hamiltonicity of the Hierarchical Cubic Network.",
            "Computing Complete Graph Isomorphisms and Hamiltonian Cycles from Partial Ones.",
            "SPAA 1999 - Guest Editors' Foreword.",
            "Sorting and Counting Networks of Arbitrary Width and Small Depth.",
            "A Comparison of Asymptotically Scalable Superscalar Processors.",
            "Scheduling Threads for Low Space Requirement and Good Locality.",
            "A Simple and Efficient Parallel Disk Mergesort.",
            "Data Management in Networks: Experimental Evaluation of a Provably Good Strategy.",
            "Guest Editor's Foreward.",
            "On Generalized Connection Caching.",
            "Optimizing Traffic in DSM Clusters: Fine-Grain Memory Caching versus Page Migration/Replication.",
            "Online Scheduling of Parallel Programs on Heterogeneous Systems with Applications to Cilk.",
            "Diffusion Schemes for Load Balancing on Heterogeneous Networks.",
            "The Data Locality of Work Stealing.",
            "DCAS-Based Concurrent Deques.",
            "Editorial Statement.",
            "Black-Box Correctness Tests for Basic Parallel Data Structures.",
            "The Mortality Problem for Matrices of Low Dimensions.",
            "The Difference between Polynomial-Time Many-One and Truth-Table Reducibilities on Distributional Problems.",
            "Corrigendum Learning Two-Type Automata from Queries and Counterexamples.",
            "Guest Editors' Foreword.",
            "P Systems with Global Rules.",
            "Programmed Mutagenesis Is Universal.",
            "Characterizing the Micronuclear Gene Patterns in Ciliates.",
            "Efficient On-Line Frequency Allocation and Call Control in Cellular Networks.",
            "Laying Out the Interconnection Network of the Transpose Bijection.",
            "The Fully Polynomial Approximation Algorithm for the 0-1 Knapsack Problem.",
            "Bulk Synchronous Parallel Algorithms for the External Memory Model.",
            "Scheduling Time-Constrained Communication in Linear Networks.",
            "Competitive Call Control in Mobile Networks.",
            "Polynomial-Time Algorithms for Minimum-Time Broadcast in Trees.",
            "Average-Case Analysis of Greedy Packet Scheduling."
        ]
    },
    {
        "name": "Theory of Computing Systems",
        "year": "2001",
        "info": "Volume 34, 2001",
        "count": 18,
        "papers": [
            "Editorial Statement.",
            "On Recognizing a String on an Anonymous Ring.",
            "Sharing Resources at Nonuniform Access Rates.",
            "Numeration Systems on a Regular Language.",
            "The Universality of Higher-Order Attributed Tree Transducers.",
            "Analyses of Load Stealing Models Based on Families of Differential Equations.",
            "A Framework for Simple Sorting Algorithms on Parallel Disk Systems.",
            "Thread Scheduling for Multiprogrammed Multiprocessors.",
            "Blocking in Parallel Multisearch Problems.",
            "Decidability Equivalence between the Star Problem and the Finite Power Problem in Trace Monoids.",
            "An Improved Stability Bound for Binary Exponential Backoff.",
            "Distributionally Hard Languages.",
            "A Polynomial Bound for Certain Cases of the D0L Sequence Equivalence Problem.",
            "Polynomially Improved Efficiency for Fast Parallel Single-Source Lexicographic Depth-First Search, Breadth-First Search, and Topological-First Search.",
            "An Internal Presentation of Regular Graphs by Prefix-Recognizable Graphs.",
            "Computing the Optimal Bridge between Two Polygons.",
            "A Polynomial-Time Algorithm for Max-Min Partitioning of Ladders.",
            "Special Factors and Uniqueness Conditions in Rational Trees."
        ]
    },
    {
        "name": "Theory of Computing Systems",
        "year": "2000",
        "info": "Volume 33, 2000",
        "count": 22,
        "papers": [
            "On Approximation Scheme Preserving Reducibility and Its Applications.",
            "Learning Monotone Log-Term DNF Formulas under the Uniform Distribution.",
            "Team Learning of Computable Languages.",
            "Spinal-Formed Context-Free Tree Grammars.",
            "The Characterization of Data-Accumulating Algorithms.",
            "An Efficient Algorithm for Generating Prüfer Codes from Labelled Trees.",
            "Erratum: Diagonal Polynomials and Diagonal Orders on Multidimensional Lattices.",
            "Modeling Time-Bounded Prefix Kolmogorov Complexity.",
            "Linear Time Solvable Optimization Problems on Graphs of Bounded Clique-Width.",
            "Resource-Bounded Measure and Learnability.",
            "Efficient Scheduling of Strict Multithreaded Computations.",
            "A Superlogarithmic Lower Bound for Shuffle-Unshuffle Sorting Networks.",
            "Tree Adjoining Languages and Multipushdown Languages.",
            "On Multidimensional Curves with Hilbert Property.",
            "An Improved Hierarchy Result for Partitioned BDDs.",
            "Editorial Message.",
            "Guest Editors' Foreword.",
            "Efficient Communication Strategies for Ad Hoc Wireless Networks.",
            "On the Flattest Common Supersequence Method for Deadlock-Free Routing in Arbitrary Networks.",
            "Robust Parallel Computations through Randomization.",
            "Recovery Time of Dynamic Allocation Processes.",
            "On Scheduling Parallel Tasks at Twilight."
        ]
    },
    {
        "name": "Theory of Computing Systems",
        "year": "1999",
        "info": "Volume 32, 1999",
        "count": 26,
        "papers": [
            "Equational Elements in Additive Algebras.",
            "Some Bounds on the Computational Power of Piecewise Constant Derivative Systems.",
            "DNA Computing Based on Splicing: The Existence of Universal Computers.",
            "On Approximation Properties of the Independent Set Problem for Low Degree Graphs.",
            "Descendants of Primitive Substitutions.",
            "A Characterization of the Sets of Hypertrees Generated by Hyperedge-Replacement Graph Grammars.",
            "Editors' Foreword.",
            "Pipelining with Futures.",
            "Accessing Nearby Copies of Replicated Objects in a Distributed Environment.",
            "Allocating Weighted Jobs in Parallel.",
            "Efficient Detection of Determinacy Races in Cilk Programs.",
            "Can a Shared-Memory Model Serve as a Bridging Model for Parallel Computation?",
            "On the Analysis of Randomized Load Balancing Schemes.",
            "Simple, Efficient Routing Schemes for All-Optical Networks.",
            "Zero-Dimensional Dynamical Systems, Formal Languages, and Universality.",
            "Bounding the Expected Length of Longest Common Subsequences and Forests.",
            "Exponential Sums and Circuits with a Single Threshold Gate and Mod-Gates.",
            "Integer Linear Programming and the Analysis of Some Petri Net Problems.",
            "Complexity Theoretical Results on Partitioned (Nondeterministic) Binary Decision Diagrams.",
            "An Isoperimetric Problem in Cayley Graphs.",
            "Randomness, Stochasticity, and Approximations.",
            "Processor - Time Tradeoffs under Bounded-Speed Message Propagation: Part II, Lower Bounds.",
            "Flexible Usage of Redundancy in Disk Arrays.",
            "Optimal High-Performance Parallel Text Retrieval via Fat-Trees.",
            "Robust Reductions.",
            "A Characterization of Attributed Tree Transformations by a Subclass of Macro Tree Transducers."
        ]
    },
    {
        "name": "Theory of Computing Systems",
        "year": "1998",
        "info": "Volume 31, 1998",
        "count": 35,
        "papers": [
            "A Strange Application of Kolmogorov Complexity.",
            "Computing with Time-Varying Data: Sequential Complexity and Parallel Speed-Up.",
            "Isolating an Odd Number of Elements and Applications in Complexity Theory.",
            "Potential Function Analysis of Greedy Hot-Potato Routing.",
            "Comments on the Oblivious Routing Algorithm of Kaklamanis, Krizanc, and Tsantilas in the Hypercube.",
            "Frobenius's Degree Formula and Toda's Polynomials.",
            "Functions Computable with Nonadaptive Queries to NP.",
            "The Chain Method to Separate Counting Classes.",
            "Greedy Numeration Systems and Regularity.",
            "An Experimental Analysis of Parallel Sorting Algorithms.",
            "Sorting Algorithms.",
            "A Generalization of Cobham's Theorem.",
            "Sharply Bounded Alternation and Quasilinear Time.",
            "A. Tight Upper Bound on Kolmogorov Complexity and Uniformly Optimal Prediction.",
            "Expressiveness and Complexity of Generic Graph Machines.",
            "Don't Be Too Clever: Routing BMMC Permutations on the MasPar MP-2.",
            "Embedding Complete Binary Trees Into Star and Pancake Graphs.",
            "RS N1-tt (NP) Distinguishes Robust Many-One and Turing Completeness.",
            "First- and Second-Order Diffusive Methods for Rapid, Coarse, Distributed Load Balancing.",
            "Verification of Cache Coherence Protocols by Aggregation of Distributed Transactions.",
            "Asynchronous Shared Memory Search Structures.",
            "A Steady State Analysis of Diffracting Trees.",
            "Universal Continuous Routing Strategies.",
            "Scope Consistency: A Bridge between Release Consistency and Entry Consistency.",
            "A Tight Layout of the Butterfly Network.",
            "Competitive Analysis of On-Line Disk Scheduling.",
            "Minimum Convex Partition of a Polygon with Holes by Cuts in Given Directions.",
            "RUSPACE(log n) $\\subseteq$ DSPACE (log2 n / log log n).",
            "Periodic Merging Networks.",
            "OBDDs of a Monotone Function and Its Prime Implicants.",
            "Efficient List Ranking on the Reconfigurable Mesh with Applications.",
            "Computing the Maximum Overlap of Two Convex Polygons under Translations.",
            "Edge-Packing in Planar Graphs.",
            "Expansivity, Permutivity, and Chaos for Cellular Automata.",
            "On the Computational Complexity of Some Classical Equivalence Relations on Boolean Functions."
        ]
    },
    {
        "name": "Theory of Computing Systems",
        "year": "1997",
        "info": "Volume 30, 1997",
        "count": 33,
        "papers": [
            "Editor's Foreword.",
            "Practical Constructive Schemes for Deterministic Shared-Memory Access.",
            "New Graph Decompositions with Applications to Emulations.",
            "Graph Embeddings and Simplicial Maps.",
            "Approximation Algorithms for the Bandwidth Minimization Problem for a Large Class of Trees.",
            "Multihead Two-Way Probabilistic Finite Automata.",
            "On Covering Problems of Codes.",
            "Regular Languages and Stone Duality.",
            "On Sets Turing Reducible to p-Selective Sets.",
            "Wang Tilings and Distributed Verification on Anonymous Torus Networks.",
            "Helping by Unambiguous Computation and Probabilistic Computation.",
            "Approximation Algorithms for DNF Under Distributions with Limited Independence.",
            "On the Cobham-Semenov Theorem.",
            "Reaction-Diffusion Automata: Three States Implies Universality.",
            "The Complexity of Deterministic PRAM Simulation on Distributed Memory Machines.",
            "A Characterization and Nearly Linear-Time Equivalence Test for µ-Branching Programs.",
            "Automatic Maps in Exotic Numeration System.",
            "Monadic Second-Order Definable Text Languages.",
            "Expressing Uniformity via Oracles.",
            "Diagonal Polynomials and Diagonal Orders on Multidimensional Lattices.",
            "Ponynominal Closure and Unambiguous Product.",
            "Complexity of Presburger Arithmetic with Fixed Quantifier Dimension.",
            "Observations on Measure and Lowness for \\Delta^p_2.",
            "The Use of a Synchronizer Yields the Maximum Computation Rate in Distributed Networks.",
            "Deciding a Class of Path Formulas for Conflict-Free Petri Nets.",
            "A Reducibility Concept for Problems Defined in Terms of Ordered Binary Decision Diagrams.",
            "Processor-Time Tradeoffs under Bounded-Speed Message Propagation: Part I, Upper Bounds.",
            "A Randomized Parallel Three-Dimensional Convex Hull Algorithm for Coarse-Grained Multicomputers.",
            "On Probabilistic Networks for Selection, Merging, and Sorting.",
            "Parallel Algorithms for the Circuit Value Update Problem.",
            "Lower Bounds for Randomized Exclusive Write PRAMs.",
            "Optimal Tradeoffs Between Size and Slowdown for Universal Parallel Networks.",
            "Elimination Trees and the Construction of Pools and Stacks."
        ]
    },
    {
        "name": "Theory of Computing Systems",
        "year": "1996",
        "info": "Volume 29, 1996",
        "count": 36,
        "papers": [
            "Experimental Studies of Algorithms.",
            "Probabilistic Asynchronous Automata.",
            "On the Power of Generalized MOD-Classes.",
            "Representation of Reversible Cellular Automata with Block Permutations.",
            "Upper Bounds for the Complexity of Sparse and Tally Descriptions.",
            "The Bisection Width of Grid Graphs.",
            "Representing Shared Data in Distributed-Memory Parallel Computers.",
            "Improved Approximations for the Minimum-Cut Ratio and the Flux.",
            "A Hierarchy of Deterministic Top-Down Tree Transformations.",
            "Two-Way Automata and Length-Preserving Homomorphisms.",
            "Tree-Stack Automata.",
            "On the Correlation of Symmetric Functions.",
            "Learning Two-Tape Automata from Queries and Counterexamples.",
            "Relations Between Varieties of Kolmogorov Complexities.",
            "An Enlarged Family of Packing Polynomials on Multidemensional Lattices.",
            "Diagonal Polynomials for Small Dimensions.",
            "Flit-Serial Packet Routing on Meshes and Tori.",
            "Computing Functions on Asynchronous Anonymous Networks.",
            "Pi-Sigma-Pi Threshold Formulas.",
            "A Note on Busy Beavers and Other Creatures.",
            "DNA Sequencing and String Learning.",
            "On Small Cuts Separating an Abelian Cayley Graph into Two Equal Parts.",
            "On Balanced Versus Unbalanced Computation Trees.",
            "UP and the Low and High Hierarchies: A Relativized Separatin.",
            "Algebraic Specification of Interconnection Network Relationships by Permutation Voltage Graph Mappings.",
            "The Shuffle Exchange Network has a Hamiltonian Path.",
            "NP-Creative Sets: A New Class of Creative Sets in NP.",
            "Superlinear Deterministic Top-Down Tree Transducers.",
            "Strong Self-Reducibility Precludes Strong Immunity.",
            "Bounded Dilation Maps of Hypercubes into Cayley Graphs on the Symmetric Group.",
            "The Bounded Membership Problem of the Monoid SL_2(N).",
            "Node Bisectors of Cayley Graphs.",
            "Set-Driven and Rearrangement-Independent Learning of Recursive Languages.",
            "On Digital Nondeterminism.",
            "Lower Bounds for the Majority Communication Complexity of Various Graph Accessibility Problems.",
            "Alternating Time Versus Deterministic Time: A Separation."
        ]
    },
    {
        "name": "Theory of Computing Systems",
        "year": "1995",
        "info": "Volume 28, 1995",
        "count": 29,
        "papers": [
            "Robust Algorithms for Packet Routing in a Mesh.",
            "A Fast Algorithm To Compute Irreducible and Primitive Polynomials in Finite Fields.",
            "Separating Complexity Classes Related to Bounded Alternating \\omega-Branching Programs.",
            "Different Local Controls for Graph Relabeling Systems.",
            "On Unification of Terms with Integer Exponents.",
            "Fast Parallel Lyndon Factorization with Applications.",
            "Productive Functions and Isomorphisms.",
            "Adaptive Logspace Reducibility and Parallel Time.",
            "Learning Reliably and with One-Sided Error.",
            "On Computing Boolean Connectives of Characteristic Functions.",
            "Pumping Lemmas for the Control Language Hierarchy.",
            "Communication Complexity of Matrix Computation over Finite Fields.",
            "On Closure Properties of Bounded Two-Sided Error Complexity Classes.",
            "Power of Interconnections and of Nondeterminism in Regular Y-Tree Systolic Automata.",
            "Prudence in Vacillatory Language Identification.",
            "A Lower Bound for Monotone Perceptrons.",
            "A Refinement of the Low and High Hierarchies.",
            "On the Power of 1-Tape Off-Line ATMs Running in a Bounded Number of Reversals.",
            "On Confluence of One-Rule Trace-Rewriting Systems.",
            "On Confluence Versus Strong Confluence for One-Rule Trace-Rewriting Systems.",
            "Recognizing Binary Hamming Graphs in O(n² log n) Time.",
            "Logical Definability of Some Rational Trace Languages.",
            "Unison, Canon, and Sluggish Clocks in Networks Controlled by a Synchronizer.",
            "Rational Transductions and Complexity of Counting Problems.",
            "The Performance of Greedy Algorithms for the On-Line Steiner Tree and Related Problems.",
            "Linear-Time Snapshot Implementations in Unbalanced Systems.",
            "OptP as the Normal Behavior of NP-Complete Problems.",
            "A Logical Characterization of the Sets of Hypergraphs Defined by Hyperedge Replacement Grammars.",
            "Variation Ranks of Communication Matrices and Lower Bounds for Depth-Two Circuits Having Nearly Symmetric Gates with Unbounded Fan-In."
        ]
    },
    {
        "name": "Theory of Computing Systems",
        "year": "1994",
        "info": "Volume 27, 1994",
        "count": 26,
        "papers": [
            "On the Capabilities of Systolic Systems.",
            "Parallel Algorithms for Routing in Nonblocking Networks.",
            "An Approach To Emulating Separable Graphs.",
            "Understanding Retiming Through Maximum Avarage-Delay Cycles.",
            "Optimal Speedup for Backtrack Search on a Butterfly Network.",
            "Some Results on Uniform Arithmetic Circuit Complexity.",
            "On Completeness for NP via Projection Translations.",
            "Semantics of Trees.",
            "An Application of the Translational Method.",
            "Generalized Theorems on Relationships Among Reducibility Notions to Certain Complexity Classes.",
            "An Observation on Probability Versus Randomness with Applications to Complexity Classes.",
            "A Framework for Polynomial-Time Query Learnability.",
            "Structural Analysis of Polynomial-Time Query Learnability.",
            "On the Complexity of Graph Reconstruction.",
            "Computability by Finite Automata and Pisot Bases.",
            "Equivalence of Finite-Valued Tree Transducers Is Decidable.",
            "A Note on Polynomial-Size Circuits with Low Resource-Bounded Kolmogorov Complexity.",
            "A New Polynomial-Time Algorithm for the Maximum Weighted (\\chi(G) - 1)-Coloring Problem in Comparability Graphs.",
            "Statistical Properties of Finite Sequences with High Kolmogorov Complexity.",
            "Universality of Iterated Networks.",
            "Designing Broadcasting Algorithms in the Postal Model for Message-Passing Systems.",
            "Primitives for Asynchronous List Compression.",
            "Branch-and-Bound and Backtrack Search on Mesh-Connected Arrays of Processors.",
            "A Lower Bound for Sorting Networks Based on the Shuffle Permutation.",
            "The Equivalence of Four Extensions of Context-Free Grammars.",
            "Efficiency of Semisynchronous Versus."
        ]
    },
    {
        "name": "Theory of Computing Systems",
        "year": "1994",
        "info": "Volume 26, 1994",
        "count": 18,
        "papers": [
            "Cloture Votes: n/4-Resilient Distributed Consensus in t+1 Rounds.",
            "A Partial Equivalence Between Shared-Memory and Message-Passing in an Asynchronous Fail-Stop Distributed Environment.",
            "Message-Optimal Protocols for Byzantine Agreement.",
            "The Failure Discovery Problem.",
            "Modular Cosntruction of an Efficient 1-Bit Byzantine Agreement Protocol.",
            "A Note on Balanced Immunity.",
            "Distance Automata Having Large Finite Distance or Finite Ambiguity.",
            "On Lower Bounds of the Closeness Between Complexity Classes.",
            "Structural Analysis of the Complexity of Inverse Functions.",
            "On the Power of Deterministic Reductions to C=P.",
            "State-Complexity of Finite-State Devices, State Compressibility and Incompressibility.",
            "On the Diameter and Bisector Size of Cayley Graphs.",
            "A Relationship Between Difference Hierarchies and Relativized Polynomial Hierarchies.",
            "On Reducing the Number of Stack Symbols in a PDA.",
            "On the Effective Generation of Set Elements Within Specified Ranges.",
            "A Model of Sequential Computation with Pipelines Access to Memory.",
            "Complexity Analysis of Propositional Concurrent Programs Using Domino Tiling.",
            "Concise Representations of Regular Languages by Degree and Probabilistic Finite Automata."
        ]
    },
    {
        "name": "Theory of Computing Systems",
        "year": "1992",
        "info": "Volume 25, 1992",
        "count": 17,
        "papers": [
            "Constructing Sets of Functions Which Have a Given F-Cardinality.",
            "Simultaneous Strong Separations of Probabilistic and Unambiguous Complexity Classes.",
            "Representations of Numbers and Finite Automata.",
            "The Equivalence of pre-NTS Grammars is Decidable.",
            "A Time-Space Hierarchy Between Polynomial Time and Polynomial Space.",
            "Efficient Distributed Algorithms for Single-Source Shortest Paths and Related Problems on Plane Networks.",
            "A Note on Weighted Distributed Match-Making.",
            "On the Time and Space Complexity of Computation Using Write-Once Memory Or Is Pen Really Much Worse Than Pencil?",
            "The Parallel Complexity of Approximation Algorithms for the Maximum Acyclic Subgraph Problem.",
            "Structural Properties for Feasibly Computable Classes of Type Two.",
            "A Survey of One-Way Functions in Complexity Theory.",
            "Structure and Importance of Logspace-MOD Class.",
            "The Problem of Deciding Confluence on a Given Congruence Class is Tractable for Finite Special String-Rewriting Systems.",
            "Semigroups of Shift Register Counting Matrices.",
            "General Circular Permutation Layout.",
            "The Complexity of On-Line Simulations Between Multidimensional Turing Machines and Random Access Machines.",
            "A Result About Languages Concerning Paperfolding Sequences."
        ]
    },
    {
        "name": "Theory of Computing Systems",
        "year": "1991",
        "info": "Volume 24, 1991",
        "count": 17,
        "papers": [
            "On Intractability of the Class UP.",
            "A Polynomial Algorithm for Recognizing Bounded Cutwidth in Hypergraphs.",
            "On Problems for Which no Oracle Can Help.",
            "Limitations of the Upward Separation Technique.",
            "On Polynomial-Time Truth-Table Reducibility of Intractable Sets to P-Selective Sets.",
            "Self-Reducible Sets of Small Sensity.",
            "A Computer-Assisted Optimal Depth Lower Bound for Nine-Input Sorting Networks.",
            "A Geometrical View of the Determinization and Minimization of Finite-State Automata.",
            "On Limitations of Transformations Between Combinatorial Problems.",
            "Bandwidth Minimization: An Approximation Algorithm for Caterpillars.",
            "Completeness for Nondeterministic Complexity Classes.",
            "Selection and Sorting in Totally Monotone Arrays.",
            "Tight Bounds for Oblivious Routing in the Hypercube.",
            "A Unified Framework for Off-Line Permutation Routing in Parallel Networks.",
            "Fast Algorithms for Bit-Serial Routing on a Hypercube.",
            "Fast Fault-Tolerant Parallel Communication and On-Line Maintenance for Hypercubes Using Information Dispersal.",
            "Routing Multiple Paths in Hypercubes."
        ]
    },
    {
        "name": "Theory of Computing Systems",
        "year": "1990",
        "info": "Volume 23, 1990",
        "count": 16,
        "papers": [
            "The Complexity of Ranking Simple Languages.",
            "Classes of Bounded Nondeterminism.",
            "Communicating Processes, Scheduling, and the Complexity of Nondeterminism.",
            "Optimal Embeddings of Butterfly-Like Graphs in the Hypercube.",
            "Single-Exception Sorting Networks and the Computational Complexity of Optimal Sorting Network Verification.",
            "On the Power of Parity Polynomial Time.",
            "One-Way Multihead Finite Automata and 2-Bounded Languages.",
            "Guest Editors' Note: Special Issue in Honor of Robert McNaughton.",
            "Some Remarks.",
            "Extensions of an Idea of McNaughton.",
            "Characterizing Polynomial Complexity Classes by Reducibilities.",
            "Unnecessary Inferences in Associative-Commutative Completion Procedures.",
            "Guest Editors' Note: Special Issue in Honor of Robert McNaughton.",
            "Power Indices and Easier Hard Problems.",
            "Exposing Graph Uniformities via Algebraic Specification.",
            "It is Decidable Whether a Monadic Thue System is Canonical Over a Regular Set."
        ]
    },
    {
        "name": "Theory of Computing Systems",
        "year": "1989",
        "info": "Volume 22, 1989",
        "count": 15,
        "papers": [
            "Characterizations of the Decidability of Some Problems for Regular Trace Languages.",
            "Absolute Results Concerning One-Way Functions and Their Applications.",
            "Generalized Lowness and Highness and Probabilistic Complexity Classes.",
            "The Lexicographically First Maximum Subgraph Problems: P-Completeness and NC Algorithms.",
            "Actor Grammars.",
            "Reduced-Order Controllers in H^\\infty-Optimal Synthesis Methods of the First Kind.",
            "Cardinality Problems of Composition of Morphisms and Inverse Morphisms.",
            "On the Synchronization of Traces.",
            "Supremal and Maximal Sublanguages Arising in Supervisor Synthesis Problems with Partial Observations.",
            "Feedback Transformations on Tori.",
            "Algebraic Representation of Dynamics and Behavior for Continuous-Time Linear Systems.",
            "Optimal q-Markov COVER for Finite Wordlength Implementation.",
            "Strong Decoupling in Singular Systems.",
            "Synthesis of Nonlinear Observers: A Harmonic-Analysis Approach.",
            "Recursive Order Estimation of Stochastic Control Systems."
        ]
    },
    {
        "name": "Theory of Computing Systems",
        "year": "1988",
        "info": "Volume 21, 1988/1989",
        "count": 13,
        "papers": [
            "Sublogarithmic-Space Turing Machines, Nonuniform Space Complexity, and Closure Properties.",
            "Equivalence of Input-Output Stability and Exponential Stability for Infinite-Dimensional Systems.",
            "A Convolution Method for Inverse Heat Conduction Problems.",
            "Correction: Vandermonde and Resultant Matrices: An Abstract Approach.",
            "Exact Linearization of Nonlinear Systems with Outputs.",
            "Minimum-Diameter Cyclic Arrangements in Mapping Data-Flow Graphs onto VLSI Arrays.",
            "A Second Step Toward the Strong Polynomial-Time Hierarchy.",
            "Variants of Top-Down Tree Transducers With Look-Ahead.",
            "Realization Theory in Hilbert Space.",
            "Synthesis of H^\\infty-Optimal Linear Feedback Systems.",
            "The Monadic Second-Order Logic of Graphs, II: Infinite Graphs of Bounded Width.",
            "Comparisons Between Some Pumping Conditions for Context-Free Languages.",
            "Functional Expansions for Nonlinear Discrete-Time Systems."
        ]
    },
    {
        "name": "Theory of Computing Systems",
        "year": "1987",
        "info": "Volume 20, 1987",
        "count": 18,
        "papers": [
            "On Relativizations with Restricted Number of Accesses to the Oracle Set.",
            "Relativized NC.",
            "On Two-Way Weak Counter Machines.",
            "On the Computational Power of Totalistic Cellular Automata.",
            "Differential Geometry of a Parametric Family of Invertible Linear Systems - Riemannian Metric, Dual Affine Connections, and Divergence.",
            "Graph Expressions and Graph Rewritings.",
            "On P-Subset Structures.",
            "On the Stability of Asynchronous Iterative Processes.",
            "State Representations for m-D Systems with Generalized Causality Structures.",
            "Vandermonde and Resultant Matrices: An Abstract Approach.",
            "Lie Algebraic Canonical Representations in Nonlinear Control Systems.",
            "Prolongations and Stability Analysis via Lyapunov Functions of Dynamical Polysystems.",
            "A Variation on the Min Cut Linear Arrangement Problem.",
            "Finite Canonical Rewriting Systems for Congruences Generated by Concurrency Relations.",
            "A New Normal Form for the Compositions of Morphisms and Inverse Morphisms.",
            "The Equivalence of Deterministic GSM Replications on Q-Rational Languages is Decidable.",
            "On the Small Time Behavior of the Nonlinear Estimation Problem for Finite Bandwidth Signals.",
            "Correction: On Realization of Nonlinear Systems Described by Higher-Order Differential Equations."
        ]
    },
    {
        "name": "Theory of Computing Systems",
        "year": "1986",
        "info": "Volume 19, 1986/1987",
        "count": 18,
        "papers": [
            "Minced Trees, with Applications to Fault-Tolerant VLSI Processor Arrays.",
            "On Time versus Space III.",
            "Complete Sets and Closeness to Complexity Classes.",
            "Local Accessibility, Local Reachability, and Representations of Compact Groups.",
            "Local System Equivalence.",
            "Zeros at Infinity for Nonlinear Discrete Time Systems.",
            "State Trajectories in Hilbert Resolution Spaces.",
            "Global Observability of Flows on the Torus: An Application to Number Theory.",
            "Iterated Linear Control and Iterated One-Turn Pushdowns.",
            "Unitary Immersions of Nonlinear Systems.",
            "Topology of the Moduli Space for Reachable Linear Dynamical Systems: The Complex Case.",
            "A Unified Approach to Layout Wirability.",
            "Lie Algebraic Representation Results for Nonstationary Evolution Operators.",
            "Realizations of Nonlinear Analytic Input-Output Maps.",
            "On Realization of Nonlinear Systems Described by Higher-Order Differential Equations.",
            "Uniform Simulations of Nondeterministic Real Time Multitape Turing Machines.",
            "A Complexity Calculus for Recursive Tree Algorithms.",
            "Lyapunov Functions and Stability of Dynamical Polysystems."
        ]
    },
    {
        "name": "Theory of Computing Systems",
        "year": "1985",
        "info": "Volume 18, 1985",
        "count": 20,
        "papers": [
            "Bi-Immune Sets for Complexity Classes.",
            "On Efficient Deterministic Simulation of Turing Machine Computations Below Logspace.",
            "On the Usefulness of Bifaithful Rational Cones.",
            "Quantum Nondemolition Filters.",
            "Structure of the Boundary of the Attainable Set in Certain Nonlinear Systems.",
            "Partial Symmetries for Nonlinear Systems.",
            "Geometric Properties of Linearizable Control Systems.",
            "Sur la structure de l'ensemble d'accessibilité de certains systèmes: Application à l'equivalence des systèmes.",
            "A Note on Thue Systems with a Single Defining Relation.",
            "On Reduced Thue Systems.",
            "Gradually Intractable Problems and Nondeterministic Log-Space Lower Bounds.",
            "Universal Quantifiers and Time Complexity of Random Access Machines.",
            "Nonlevelable Sets and Immune Sets in the Accepting Density Hierarchy in NP.",
            "A Combinatorial Property of EOL Languages.",
            "Stabilizability of Linear Systems Defined over C*-Algebras.",
            "A Local Implicit Function Theorem and Applications to Systems of Differential Equations.",
            "Controlled Invariance for Hamiltonian Systems.",
            "Editor's Introduction to Euler's \"An Essay on Continued Fractions\" Translated by B. F. Wyman and M. F. Wyman.",
            "An Essay on Continued Fractions.",
            "Global Structure of Families of Multivariable Linear Systems with an Application to Identification."
        ]
    },
    {
        "name": "Theory of Computing Systems",
        "year": "1984",
        "info": "Volume 17, 1984",
        "count": 21,
        "papers": [
            "Editorial: Special FOCS Issue - Twenty-Second Annual IEEE Symposium on Foundations of Computer Science.",
            "A Time-Space Tradeoff for Language Recognition.",
            "Parity, Circuits, and the Polynomial-Time Hierarchy.",
            "Towards Separating Nondeterminism from Determinism.",
            "New Lower Bound Techniques for VLSI.",
            "Relativized Polynomial Hierarchies Extending Two Levels.",
            "A Note on the Complexity of Program Evaluation.",
            "A Several Complex Variables Approach to Feedback Stabilization of Linear Neutral Delay-Differential Systems.",
            "Decoupling of Linear Systems by Dynamic Output Feedback.",
            "Observability for Two-Dimensional Systems.",
            "Regular Prefix Relations.",
            "Permutation-Exchange Graphs That Emulate the Binary Cube.",
            "Recurrent Words for Substitution.",
            "Time-Varying Systems and Crossed Products.",
            "Wazewski's Topological Method for Caratheodory Systems.",
            "Characterizations of Reduction Classes Modulo Oracle Conditions.",
            "Semitopological Semirings and Pushdown Automata.",
            "On Finite Volterra Series which Admit Hamiltonian Realizations.",
            "Structurally Stable Nonlinear Regulation with Step Inputs.",
            "Invertibility of Quantum-Mechanical Control Systems.",
            "A Note on the Controllability of Nonlinear Systems."
        ]
    },
    {
        "name": "Theory of Computing Systems",
        "year": "1983",
        "info": "Volume 16, 1983",
        "count": 21,
        "papers": [
            "Optimal Three-Dimensional VLSI Layouts.",
            "Space-Time Tradeoffs for Linear Recursion.",
            "Some Formal Results about Stratificational Grammars and Their Relevance to Linguistics.",
            "A Note on Special Thue Systems with a Single Defining Relation.",
            "A Note on Finitely-Valued and Finitely Ambiguous Transducers.",
            "Operator Factorization on Partially Ordered Hilbert Resolution Spaces.",
            "On the Relationship Between Global and Local Controllability.",
            "On the Definitions of some Complexity Classes of Real Numbers.",
            "Some Applications of Topology to Program Semantics.",
            "Codes and Bernoulli Partitions.",
            "Matching and Spanning in Certain Planar Graphs.",
            "A Note on Memoryless Operators.",
            "An Axiomatic Approach to the Korenjak-Hopcroft Algorithms.",
            "Prolongations and Lyapunov Functions in Control Systems.",
            "Duality Between Reachability and Observability for Adjoint Systems.",
            "On the Periodic Solutions of the Matrix Riccati Equation.",
            "A Note on Relativized Log Space.",
            "Pushdown Tree Automata.",
            "Stability and Nonsingular Stable Precompensation: An Algebraic Approach.",
            "Lie and Morse Theory for Periodic Orbits of Vector Fields and Matrix Riccati Equations, II.",
            "Identification and Filtering."
        ]
    },
    {
        "name": "Theory of Computing Systems",
        "year": "1981",
        "info": "Volume 15, 1981/1982",
        "count": 24,
        "papers": [
            "Lower Bounds on the Efficiency of Transforming Static Data sSructures into Dynamic Structures.",
            "k-visit Attribute Grammars.",
            "Recursive Paths in Cross-Connected Trees and an Application to Cell Spaces.",
            "A New Performance Measure for Stochastic Optimization in Hilbert Space.",
            "Realization Theory of Infinite-Dimensional linear Systems - Part I.",
            "Contrôlabilité des systèmes bilinéaires.",
            "Three Hierarchies of Transducers.",
            "Complexity Classes and Theories of Finite Models.",
            "Hamiltonian Dynamics with External Forces and Observations.",
            "Realization Theory of Infinite-Dimensional Linear Systems. Part II.",
            "Parallel Random Access Machines with Powerful Instruction Sets.",
            "(Semi)Alternating Stack Automata.",
            "Transductions of Dags and Trees.",
            "Finitary and Infinitary Interpretations of Languages.",
            "In Scott-Strachey Style Denotational Semantics, Parallelism Implies Nondeterminism.",
            "Lie and Morse Theory for Periodic Orbits of Vector Fields and Matrix Riccati Equations, I: General Lie-Theoretic Methods.",
            "Semantics of Looping Programs in Propositional Dynamic Logic.",
            "A Priority Queue in Which Initialization and Queue Operations Take O(log log D) Time.",
            "A Note on Complete Sets and Transitive Closure.",
            "On Reducing the Number of States in a PDA.",
            "Stability Analysis of the Orbits of Control Systems.",
            "The Theory of Equivalence of Pfaffian Systems and Input Systems Under Feedback.",
            "Some Classes of Automata as Partially Ordered Sets.",
            "A Note on Single Input Controllability for Normal Systems."
        ]
    },
    {
        "name": "Theory of Computing Systems",
        "year": "1981",
        "info": "Volume 14, 1981",
        "count": 21,
        "papers": [
            "Three Write Heads Are as Good as k.",
            "Bicontinuous Extensions of Invertible Combinatorial Functions.",
            "The Malliavin Calculus and its Application to Second Order Parabolic Differential Equations: Part I.",
            "On Factoring the Polyvariance Operator.",
            "Abstract Bilinear Systems: The Forward Shift Approach.",
            "Algebraic Specification of Data Types: A Synthetic Approach.",
            "The Malliavin Calculus and its Application to Second Order Parabolic Differential Equations: Part II.",
            "Duality Theorems on Control and Observation of Discrete-Time Infinite-Dimensional Systems.",
            "A Remark About a Substitution Property.",
            "Relative Complexity of Algebras.",
            "Space-Bounded Simulation of Multitape Turing Machines.",
            "A Note on Context Free Languages, Complexity Classes, and Diagonalization.",
            "Strict Interpretations of Deterministic Pushdown Acceptors.",
            "On Restricted One-counter Machines.",
            "Sur une Propriété d'Itération des Langages Algébriques Déterministes.",
            "A Normal Form Theorem for Label Grammars.",
            "Transformations of Structures: an Algebraic Approach.",
            "An Unsolvable Problem with Products of Matrices.",
            "Causal Polynomial Approximation for Input-Output Maps on Hilbert Spaces.",
            "Realization Algorithms for Systems over a Principal Ideal Domain.",
            "The Structure of Nonsingular Polynomial Matrices."
        ]
    },
    {
        "name": "Theory of Computing Systems",
        "year": "1979",
        "info": "Volume 13, 1979/1980",
        "count": 22,
        "papers": [
            "An Order-Algebraic Definition of Knuthian Semantics.",
            "Complexity of Some Problems Concerning L Systems.",
            "Satisfiability Problems for Propositional Calculi.",
            "P-selective Sets, Tally Languages, and the Behavior of Polynomial Time Reducibilities on NP.",
            "Dolezals's Theorem Revisited.",
            "Indecomposable Local Maps of Tesselation Automata.",
            "A Constructive Generalization of the Borel-Cantelli Lemma with Application to the Complexity of Infinite Strings.",
            "Storage Representations for Tree-Like Data Structures.",
            "Infinite Trees in Normal Form and Recursive Equations Having a Unique Solution.",
            "Restricted One-Counter Machines with Undecidable Universe Problems.",
            "Relative Complexity of Operations on Numeric and Bit-String Algebras.",
            "On The Existence of Optimal Fixpoints.",
            "Formal Computations of Non Deterministic Recursive Program Schemes.",
            "Multiple Signal Extraction by Polynomial Filtering.",
            "Categorical and Topological Aspects of Formal Languages.",
            "Le Théorème de Transversale Rationnelle dans les Langages d'Arbres.",
            "On Relativizing Auxiliary Pushdown Machines.",
            "On the Depth Complexity of Formulas.",
            "On Comparing LL(k) and LR(k) Grammars.",
            "Compelled Operations and Operations of Degree P.",
            "Control Sets on Grammars Using Depth-First Derivations.",
            "Global Controllability of Nonlinear Systems in Two Dimensions."
        ]
    },
    {
        "name": "Theory of Computing Systems",
        "year": "1978",
        "info": "Volume 12, 1978/1979",
        "count": 22,
        "papers": [
            "Refining Nondeterminism in Context-free Languages.",
            "Bounds on the Costs of Data Encodings.",
            "Closure Properties and Homomorphisms of Time-varying Systems.",
            "Doubly-Indexed Dynamical Systems: State-Space Models and Structural Properties.",
            "A Model for Pattern Perception with Musical Applications Part III: The Graph Embedding of Pitch Structures.",
            "Une Relation d'Equivalence Decidable sur la Classe des Forêts Reconnaissables.",
            "A Short Note on Simultaneous Splitting.",
            "Euclidean Controllable Realizations of Linear Hereditary Systems.",
            "Data Spaces with Indirect Addressing.",
            "Basic Optimal Estimation and Control Problems in Hilbert Space.",
            "A Difference in Expressive Power Between Flowcharts and Recursion Schemes.",
            "On \"Provable\" Analogs of P and MP.",
            "Real-Time Computations with Restricted Nondeterminism.",
            "On Strict Interpretations of Grammar Forms.",
            "Polynomial Enumeration of Multidimensional Lattices.",
            "On Minimal Splitting Subspaces and Markovian Representations.",
            "Predicting the Future of Functions on Flows.",
            "On Non Context-Free Grammar Forms.",
            "The Minimum Number of Edges in Graphs with Prescribed Paths.",
            "Convergence Theorems for Stochastic Automata and Learning Systems.",
            "Controllability of General Nonlinear Systems.",
            "Single-Input Observability of Continuous-Time Systems."
        ]
    },
    {
        "name": "Theory of Computing Systems",
        "year": "1977",
        "info": "Volume 11, 1977/1978",
        "count": 25,
        "papers": [
            "Inclusion Complete Tally Languages and the Hartmanis-Berman Conjecture.",
            "Simple Context-Free Languages and Free Monadic Recursion Schemes.",
            "Continuous Operations on Languages.",
            "Size, Index, and Context-Sensitivity of Controlled Partition Grammars.",
            "On the Characterization of Linear and Linearizable Automata by a Superposition Principle.",
            "On Random Nonlinear Contractions.",
            "Correction: Space Bounds for a Game on Graphs.",
            "On Jump-Deterministic Pushdown Automata.",
            "Real-Time Recognition of Substring Repetition and Reversal.",
            "Le Cylindre des Langages Linéaires.",
            "Non-Principalité du Cylindre des Langages à Compteur.",
            "The Lattice of Minimal Realizations of Response Maps Over Rings.",
            "The Existence of Solutions, Stability, and Linearization of Volterra Systems.",
            "A Model for Pattern Perception with Musical Applications Part I: Pitch Structures as Order-Preserving Maps.",
            "Une Note sur la Propriété de Prefixe.",
            "The Cartesian Composition of Automata.",
            "Approximation by Bernstein Systems.",
            "Measure-Preserving Homeomorphisms of the Torus Represent All Finite Entropy Ergodic Transformations.",
            "Causal C_0 Operators and Feedback Stability.",
            "The Complexity of Monotone Boolean Functions.",
            "A Generalization of Leftmost Derivations.",
            "Local Maps Inducing Surjective Global Maps of One-Dimensional Tesselation Automata.",
            "A Model for Pattern Perception with Musical Applications Part II: The Information Content of Pitch structures.",
            "Representation of a Word Function as the Sum of Two Functions.",
            "Corrigendum: Context Free Languages and Rudimentary Attributes."
        ]
    },
    {
        "name": "Theory of Computing Systems",
        "year": "1976",
        "info": "Volume 10, 1976/1977",
        "count": 27,
        "papers": [
            "New Problems Complete for Nondeterministic Loc Space.",
            "Relativization of Questions About Log Space Computability.",
            "On the Complexity of Finite, Pushdown, and Stack Automata.",
            "A Class of Infinite Dimensional Linear Systems.",
            "Almost Surely Continuous Solutions of a Nonlinear Stochastic Integral Equation.",
            "On the Asymptotic Behaviour of Solutions of Differential Equations in a Banach Space.",
            "On Perturbing Lyapunov Functions.",
            "A Forbidden Subposet Characterization of an Order-Dimension Inequality.",
            "Design and Implementation of an Efficient Priority Queue.",
            "Information Theory and the Complexity of Boolean Functions.",
            "Some Bilinear Forms Whose Multiplicative Complexity Depends on the Field of Constants.",
            "Total Complexity and the Inference of Best Programs.",
            "On Storing Ragged Arrays by Hashing.",
            "Some Open Problems in the Theory of Computation as Questions about Two-Way Deterministic Pushdown Automaton Languages.",
            "On Languages With a Certain Prefix Property.",
            "Space Bounds for a Game on Graphs.",
            "Observations about Bounded Languages and Developmental Systems.",
            "On the Point Transitivity of Symbolic Flows.",
            "Existence and Uniqueness of Minimal Realizations of Nonlinear Systems.",
            "Perturbations of Open Sets of Attainability.",
            "Top-down Tree Transducers with Regular Look-ahead.",
            "Comparing Language Operations.",
            "On the Combinational Complexity of Certain Symmetric Boolean Functions.",
            "Rudimentary Relations and Stack Languages.",
            "Deterministic Representation of Probabilistic Systems by Ergodic Machines.",
            "Moduli and Canonical Forms for Linear Dynamical Systems II: The Topological Case.",
            "The Growth of Configurations."
        ]
    },
    {
        "name": "Theory of Computing Systems",
        "year": "1975",
        "info": "Volume 9, 1975/1976",
        "count": 31,
        "papers": [
            "On Representation and Boundedness of Solutions of a Functional Differential Equation.",
            "Admissibility Results on Subspaces of C(R, R^n) and LL^p(R, R^n).",
            "Linearization and Asymptotic Behavior.",
            "Local Controllability of a Nonlinear Wave Equation.",
            "A Universal Topological Transformation Group in L²(G \\times G).",
            "A Necessary and Sufficient Condition for Planar Flows.",
            "On an Algebraic Theory of Systems Defined by Convolution Operators.",
            "Recursive Properties of Transformation Groups in Hyperspaces.",
            "Minimal-Program Complexity of Pseudo-Recursive and Pseudo-Random Sequences.",
            "Description of Restricted Automata by First-Order Formulae.",
            "Periodic Points Under Expansive Homeomorphisms.",
            "On Ergodic Homeomorphisms.",
            "On Preserving Stability of Volterra Integral Equations under a General Class of Perturbations.",
            "On the Ergodic Theory of Cellular Automata.",
            "Topologies on Formal Languages.",
            "Local Determinacy of Abstract Local Dynamical Systems.",
            "Context-free Preserving Functions.",
            "Bottom-up and Top-down Tree Transformations - A Comparison.",
            "Liapunov Criteria for Uniformity.",
            "A Uniqueness Theorem on the Resultant of Two Non-Differentiable Motions.",
            "Relationships between Pushdown Automata with Counters and Complexity Classes.",
            "Three-Valued Representative Systems.",
            "On the Boundedness Properties of a Perturbed Nonlinear System.",
            "Fixed and Periodic Points of Local Contraction Mappings on Probabilistic Metric Spaces.",
            "Surjectivity of Functors on Grammars.",
            "Asymptotic Equilibrium of Ordinary Differential Systems in a Banach Space.",
            "Recursive Generation of Local Adjunct Languages.",
            "On Linear Systems and Noncommutative Rings.",
            "Singular Shift Registers Over Residue Class Rings.",
            "Uniqueness For Ordinary Differential Equations.",
            "On Dynamical Systems of Characteristic O^+."
        ]
    },
    {
        "name": "Theory of Computing Systems",
        "year": "1974",
        "info": "Volume 8, 1974/1975",
        "count": 40,
        "papers": [
            "Duality for Differential Games and Optimal Control.",
            "Semigroups and Automorphism Groups of Strongly Connected Automata.",
            "Periodicity in Generations of Automata.",
            "Affine Transformations and Coalescence.",
            "Discontinuous Scalar Functions and Ordinary Differential Equations.",
            "Topological Power Automata with Quasi-Power Morphisms.",
            "Algebraic Decision Procedures for Local Testability.",
            "On the Structure of Irreducible State Representations of a Causal System.",
            "Power-Separating Regular Languages.",
            "On the Uniqueness of the Equilibrium State.",
            "Semantic Preserving Translations.",
            "Free Gerbiers and Nets.",
            "On Realization of Linear Systems and Applications to Some Questions of Stability.",
            "Semiflows Associated with Compact and Uniform Processes.",
            "Image Theorems for Simple Matrix Languages and n-Parallel Languages.",
            "Computational Complexity of Formal Translations.",
            "Endomorphisms of Irreducible Subshifts of Finite Type.",
            "Maximally Independent Sets, Minimal Generating Sets, and Irreducibles.",
            "Optimal Enumerations and Optimal Gödel Numberings.",
            "Some Systems with Unique Equilibrium States.",
            "Cores of Targets in Linear Control Systems.",
            "Almost Periodic Perturbations of nth-Order Differential-Difference Equations.",
            "A Decidability Result in Algebraic Language Theory.",
            "Locating Limit Sets with Weak Nonautonomous Liapunov Functions.",
            "Group-Complexity and Reversals of Finite Semigroups.",
            "Algebraic and Other Entropies of Group Endomorphisms.",
            "The Shift and Commutivity II.",
            "Normal and Quasiregular Points for Automorphisms of the Torus.",
            "Semi-Flows on Spaces of Probability Measures.",
            "Existence of Bounded Solutions and Asymptotic Relationships for Nonlinear Volterra Integral Equations.",
            "A Semigroup Associated with an Invariant Measure on a Transformation Group.",
            "Bernoulli Equilibrium States for Axiom A Diffeomorphisms.",
            "Models of Deterministic Systems.",
            "Minimal Symbolic Flows Having Minimal Block Growth.",
            "Description of Developmental Languages Using Recurrence Systems.",
            "Induced Function Theorems in Topology.",
            "Abstract Scattering for Nonlinear Evolution Equations.",
            "Generalized Addressing Schemes for Data Graphs.",
            "Representation of Continuous Curves on the 3-Dimensional Rotation Group.",
            "Sequences with Minimal Block Growth II."
        ]
    },
    {
        "name": "Theory of Computing Systems",
        "year": "1973",
        "info": "Volume 7, 1973/1974",
        "count": 40,
        "papers": [
            "Cutting and Independent Stacking of Intervals.",
            "A Standard Form for Sequential Stochastic Control.",
            "A Counterexample in Asymptotic Behavior of Holomorphic Functions.",
            "A Number-Theoretic Class of Weak Bernoulli Transformations.",
            "On the Asymptotic Stability of Differential Equations in Banach Spaces.",
            "Topological Models for Generators.",
            "The Mixing Properties of Certain Processes Related to Markov Chains.",
            "The Range of a Vector-Valued Measure.",
            "A Stochastic Integral Equation in Hilbert Space with a Discrete Version and Application to Stochastic Systems.",
            "Lyapunov Functions and Autonomous Differential Equations in a Banach Space.",
            "Minimal Flows Arising from Substitutions of Non-Constant Length.",
            "On Induced Transformations of Bernoulli Shifts.",
            "Error Detection in Precedence Parsers.",
            "Une Hiérarchie des Parties Rationelles de N².",
            "Sequences with Minimal Block Growth.",
            "A Classification of the Singularities of (X, f).",
            "On a Random Volterra Integral Equation.",
            "Asymptotic Equivalence for two Nonlinear Systems.",
            "On the Properties of the Realizations of Linear Dynamical Systems.",
            "An Infinite Hierarchy of Intersections of Context-Free Language.",
            "On Strong Stability for Linear Integral Equations.",
            "Cascades of Tree-Automata and Computations in Universal Algebras.",
            "Admissibility and Integra Operators.",
            "Representation for Solutions of Linear Neutral Functional Differential Equations.",
            "Isomorphism and Parallelizability in Dynamical Systems Theory.",
            "Trajectories and the Attainable Set of an Abstract Linear Control System.",
            "Global Aspects of the Matrix Riccati Equation.",
            "A Class of Finite Commutative Archimedean Semigroups.",
            "On B-Convex Banach Spaces.",
            "Maximizing Entropy for a Hyperbolic Flow.",
            "A Category Theory for Programming Languages.",
            "Restricted Topological Entropy and Expansive Mappings.",
            "Causality for Nonlinear Systems in Hilbert Space.",
            "Actions on Plane Continua.",
            "Attainable Sets in Infinite-Dimensional Spaces.",
            "Corrigendum: Speed-ups by Changing the Order in which Sets are Enumerated.",
            "Propriétés Booléennes des Langages Stochastiques.",
            "Strong Stability of Perturbed Systems of Volterra Integral Equations.",
            "Measurable Selectors of Multifunctions and Applications.",
            "Expansiveness on Locally Compact Spaces."
        ]
    },
    {
        "name": "Theory of Computing Systems",
        "year": "1972",
        "info": "Volume 6, 1972",
        "count": 41,
        "papers": [
            "A Method for Minimizing the Number of States for a Restricted Class of Incompletely Specified Sequential Machines.",
            "Subrecursiveness: Machine-Independent Notions of Computability in Restricted Time and Storage.",
            "Minimal Sets with Discrete Abelian Phase Group.",
            "Averages of Functions and Ergodic Measures in F-Spaces.",
            "Inverses of Recurrent and Periodic Points under Homomorphisms of Dynamical Systems.",
            "Multi-Stack-Counter Languages.",
            "A Note on Topological Linearization of Locally Compact Transformation Groups in Hilbert Space.",
            "Non-Unique Critical Points of Ordinary Differential Equations.",
            "On Nondeterministic-Causal Time Systems.",
            "On Positively Expansive Maps.",
            "The Shift and Commutativity.",
            "On the Definition of the Variables Used and Set by a Computation.",
            "Universal Dynamical Systems.",
            "Fixed Points of Contraction Mappings on Probabilistic Metric Spaces.",
            "On the Time Required to Detect Cycles and Connectivity in Graphs.",
            "Homomorphisms of Symbolic Dynamical Systems.",
            "Quasi-Disjointness, Products and Inverse Limits.",
            "Expansive Self-Homeomorphisms of the Cantor Set.",
            "Global Parallelizability of Local Dynamical Systems.",
            "Regular Minimal Sets over the Circle and the Ellis Minimal Set.",
            "Uniform Tag Seqences.",
            "Right Topological Groups, Distal Flows, and a Fixed-Point Theorem.",
            "The Addition of Dynamical Systems.",
            "Sur un Algorithme Donnant les Codes Bipréfixes Finis.",
            "A Nonlinear Variation of Constants Formula for Volterra Equations.",
            "A Model for Ergodic Automorphisms on Groups.",
            "On the Largest Full SubAFL of an AFL.",
            "Algebraic Structure Theory of Stochastic Machines.",
            "A Medvedev Characterization of Sets Recognized by Generalized Finite Automata.",
            "States and the Free Orthogonality Monoid.",
            "Laws of Large Numbers for Random Linear Programs.",
            "Terminal Manifolds and Switching Locus.",
            "Lifting Recursion Properties.",
            "On Weak Mixing of Cascades.",
            "Approximation of Measure-Preserving Transformations.",
            "Context-Sensitive Immediate Constituent Analysis: Context-Free Languages Revisited.",
            "Some Results in Tree Automata.",
            "A Nonlinear Variation-of-Constants Formula for Functional Differential Equations.",
            "On the Semigroup of a Linear Nonsingular Automaton.",
            "Realization is Universal.",
            "A Functional Approach to Fixed-Point Analysis of Noncompact Operators."
        ]
    },
    {
        "name": "Theory of Computing Systems",
        "year": "1971",
        "info": "Volume 5, 1971",
        "count": 45,
        "papers": [
            "A Note on Series Parallel Irreducibility.",
            "Topological Entropy and Measure-Theoretic Entropy for Automorphisms on Compact Groups.",
            "On the Prime Decomposition Theorem for Finite Monoids.",
            "The Green's Function for nth-Order Periodic Differential-Difference Equations.",
            "A Basic Optimization Problem in Linear Systems.",
            "Graph Property Recognition Machines.",
            "Records of Turing Machines.",
            "Stability and Summability of Solutions of Difference Equations.",
            "A Note on Dense and Nondense Families of Complexity Classes.",
            "Topological Transitivity and Ergodic Measures.",
            "Distal and Proximal Extensions of Minimal Flows.",
            "Inverse Limits and Embedding of Compact Totally Disconnected Machines.",
            "Correction: Semantics of Context-Free Languages.",
            "Techniques for Establishing Star Height of Regular Sets.",
            "When is a Sequential Machine the Realization of Another?",
            "A Note on Some Systems of Lindenmayer.",
            "A Structure Theorem for \\delta-Classes of Compact Semigroup Actions.",
            "The Range of a Vector Measure with Values in a Montel Space.",
            "Speed-Ups by Changing the Order in which Sets are Enumerated.",
            "Strong Attraction and Classification of Certain Continuous Flows.",
            "On Two-Way, Two-Tape Automata.",
            "A Note on W-Groups.",
            "Characterizations and Extensions of Pushdown Translations.",
            "On Semigroups in a Non-Compact Transformation Group.",
            "A Partition on a Bernoulli Shift which is not Weakly Bernoulli.",
            "Approximations of the Principal Eigenelements in K-Positive Non-Selfadjoint Eigenvalue Problems.",
            "Images of AFL under Certain Families of Homomorphisms.",
            "The Automorphisms of the Shift Dynamical System are Relatively Sparse.",
            "Computational Complexity of Random Acess Stored Program Machines.",
            "A Unified Approach to the Definition of Random Sequences.",
            "On Boolean Functions and Connected Sets.",
            "Characterizations of Transductions Defined by Abstract Families of Transducers.",
            "Connected Sets: Bases and Metrics.",
            "Limit Points which are not Sequentially Attainable.",
            "Upper Semi-Continuous Decompositions of an Are.",
            "Cycle Periods of Perturbed Dynamical Systems.",
            "Lifting Dynamical Properties.",
            "Some Structural Properties of Generalized Automata and Algebras.",
            "On Category of Mixing in Infinite Measure Spaces.",
            "On Restricted Turing Computability.",
            "Decomposition of Banach-Valued Quasimartingales.",
            "Identification of Control Systems by Performance.",
            "Controllability of General Systems.",
            "Extension of Minimal Transformation Groups.",
            "Types of Isomorphisms of Transformation Groups."
        ]
    },
    {
        "name": "Theory of Computing Systems",
        "year": "1970",
        "info": "Volume 4, 1970",
        "count": 39,
        "papers": [
            "The Existence of the Best Stabilizing Control in Higher Dimensions.",
            "On Multidimensional Generalized Homogeneous Random Fields in R^n;.",
            "Spectral Factorization of Time-varying Covariance Functions: The Singular Case.",
            "A Note on One-Way and Two-Way Automata.",
            "Equicontinuous Semi-Flows (One-Parameter Semi-Groups) on Locally Compact or Complete Metric Spaces.",
            "On Input Semigroups of Automata.",
            "A Theorem on Liapunov Functions Using V.",
            "A Contribution to the Frobenius Theory of Positive Operators. Comparison Theorems.",
            "On the Definition of a Stochastic Differential Game.",
            "Classification Problems.",
            "Canonical Systems which Produce Periodic Sets.",
            "Universal Coalgebra and Categories of Transition Systems.",
            "Quasi-Realtime Languages.",
            "On the Decomposition of Measures with Applications to Continuum Physics.",
            "On Sequence Entropy I.",
            "On Sequence Entropy II.",
            "A Modofication of a Substitution Theorem and Some Neccessary and Sufficient Conditions for Sets to be Context-Free.",
            "Differential Inequalities and Non-Lipschitz Scalar Functions.",
            "Compactness and Asymptotic Stability.",
            "A Characterization of Symbolic Cascades in Terms of Expansiveness and Topological Entropy.",
            "Zur Theorie Agorithmisch Abgeschlossener Modellklassen.",
            "Decomposition of Linear Sequential Machines. II.",
            "Commuting Continuous Flows on Manifolds.",
            "Structural Equivalence of Automata.",
            "Synchronization of Interacting Automata.",
            "Chains of Full AFL's.",
            "A Construction of the Greatest Ambit.",
            "Homomorphisms of Expansive Transformation Groups.",
            "Mappings and Grammars on Trees.",
            "On the Group of Automorphisms of Strongly Connected Automata.",
            "On Categories of Infinite Automata.",
            "An Alternative Method Based on Approximate Solutions.",
            "Independence Results Concerning a Problem of N. Lusin.",
            "Homeomorphisms with Discrete Centralizers and Ergodic Properties.",
            "Conjugacy Properties of Affine Transformations of Nilmanifolds.",
            "Generalizations of a Theorem of Dolezal.",
            "Operator-Valued Wide-Sense Markov Processes and Solutions of Infinite-Dimensional Linear Differential Systems Driven by White Noise.",
            "Direct and Subdirect Product Structure Theorems for Non-Deterministic Automata.",
            "On the Endomorphisms of Finite Automata."
        ]
    },
    {
        "name": "Theory of Computing Systems",
        "year": "1969",
        "info": "Volume 3, 1969",
        "count": 32,
        "papers": [
            "Local Isomorphismus and Local Parallelizability in Dynamical Systems Theory.",
            "Contributions to the Theory of Generalized Differential Equations. I.",
            "Generators for Topological Entropy and Expansiveness.",
            "Asymptotic Properties of Expansive Homeomorphisms.",
            "Dolezal's Theorem, Linear Algebra With Continuously Parametrized Elements, and Time-Varying Systems.",
            "Minimal Solutions of Paull-Unger Problems.",
            "On Characterisations of Mixing Properties of Measure-Preserving Transformations.",
            "On Closedness under Switching in Banach Space.",
            "Context-Free Languages and Rudimentary Attributes.",
            "Remarks on Algebraic Decomposition of Automata.",
            "On the Equivalence and Containment Problems for Context-Free Languages.",
            "Two Memory Bounds for the Recognition of Primes by Automata.",
            "Non-Tangential Limits of a Solution of a Bondary-Value Problem for the Heat Equation.",
            "Group-Like Extensions and Similar Algebras.",
            "Convolution of Invariant Measures, Maximal Entropy.",
            "Stability of some Linear Time-Varying Systems.",
            "Contributions to the Theory of Generalized Equations. II.",
            "An Embedding Theorem for Contracting Homeomorphisms.",
            "P-Recursion and Transformation Groups Having an Equicontinuous Replete Semigroup.",
            "Control Dynamical Systems.",
            "On the Base-Dependence of Sets of Numbers Recognizable by Finite Automata.",
            "A General Theory of Translation.",
            "On a Stochastic Integral Equation of the Volterra Type.",
            "Vectorial Approximation by Restricted Rationals.",
            "Externally Induced Operations.",
            "Decomposition of Linear Sequential Machines.",
            "Lattice Representation of General Algebraic Dependence.",
            "Maximin Sequential-Like Machines and Chains.",
            "A Note on Complete Closure Algebras.",
            "Quasi-dynamical Systems.",
            "Endomorphisms and Automorphisms of the Shift Dynamical Systems.",
            "Decision Problems for omega-Automata."
        ]
    },
    {
        "name": "Theory of Computing Systems",
        "year": "1968",
        "info": "Volume 2, 1968",
        "count": 29,
        "papers": [
            "A Note on Undecidable Properties of Formal Languages.",
            "Lifting and Projecting Expansive Homeomorphisms.",
            "Local Characterisation of Load Semi-Dynamical Systems.",
            "Small Subcategories and Completeness.",
            "A Criterion for Weak Controllability.",
            "Generalized Finite Automata Theory with an Application to a Decision Problem of Second-Order Logic.",
            "Permutation Automata.",
            "Lifting Expansive Homeomorphisms to Symbolic Flows.",
            "The Theory of Languages.",
            "Semantics of Context-Free Languages.",
            "An Efficient Syntactic Analyser of Certain Formal Languages.",
            "Control Sets on Grammars.",
            "Some Characteristic Properties of Dynamical Systems with Quasi-discrete Spectra.",
            "A Helpful Result for Proving Inherent Ambiguity.",
            "Linear Semi-Dynamical Systems.",
            "Auxiliary Functions and Constructive Specification of General Systems.",
            "Homomorphisms Between Stochastic Sequential Machines and Related Problems.",
            "Transitive Homeomorphisms of the Circle.",
            "On the Range of an Unbounded Vector-Valued Measure.",
            "Real-Time Solutions of the Origin-Crossing Problem.",
            "Counter Machines and Counter Languages.",
            "Deductive Systems and Categories I. Syntactic Calculus and Residuated Categories.",
            "Equivariant Maps onto Minimal Flows.",
            "On Finite 0-Simple Semigroups and Graph Theory.",
            "On Regular Expressions and Regular Canonical Systems.",
            "On Some Metamathematical Results As Properties of General Systems.",
            "Linearization of Locally Compact Transformation Groups in Hilbert Space.",
            "Correction: Yet Another Proof of the Cascade Decomposition Theorem for Finite Automata.",
            "Correction: Invariance for Ordinary Differential Equations."
        ]
    },
    {
        "name": "Theory of Computing Systems",
        "year": "1967",
        "info": "Volume 1, 1967",
        "count": 30,
        "papers": [
            "Disjointness in Ergodic Theory, Minimal Sets, and a Problem in Diophantine Approximation.",
            "Finitely Convex Sets of Nonlinear Differential Equations.",
            "A Fixed-Point Theorem.",
            "Complexity of Ideals in Finite Semigroups and Finite-State Machines.",
            "Categories of Semimodules: The Categorical Structural Properties of Transition Systems.",
            "A Stability Criterion for General Systems.",
            "A Proof of the Independence of the Continuum Hypothesis.",
            "On Asymptotic Stability in Dynamical Systems.",
            "Weak Attractors in R^n.",
            "Extended Topology and Systems.",
            "Some Perturbation Problems in the Theory of Integral Equations.",
            "Construction of Locally Almost Periodic Minimal Transformation Groups.",
            "The Proximal Relation in a Class of Substitution Minimal Sets.",
            "On Asymptotically Autonomous Differential Equations.",
            "Algorithmic Properties of Structures.",
            "Probabilistic Automata and Stochastic Transformations.",
            "Finite Approximants of Compact Totally Disconnected Machines.",
            "A Relation-Theoretic Result with Applications in Topological Algebra.",
            "Yet Another Proof of the Cascade Decomposition Theorem for Finite Automata.",
            "Extremal Problems in Linear Topological Spaces. I.",
            "Regionally Almost Periodic Transformation Groups.",
            "Hereditary Structure in Differential Equations.",
            "Mathematical Systems Theory: Causality.",
            "A Homomorphism Theorem for Finite Semigroups.",
            "Multiplication Induced in the State-Space of an Act.",
            "Congruence Separation of Subsets of a Monoid with Applications to Automata.",
            "Overlapping Algorithms.",
            "Optimal Control in a Banach Space.",
            "Invariance for Ordinary Differential Equations.",
            "Correction: Complexity of Ideals in Finite Semigroups and Finite-State Machines."
        ]
    }
]