[
    {
        "name": "TOCL",
        "year": "2022",
        "info": "Volume 23, 2022",
        "count": 13,
        "papers": [
            "Graphs Identified by Logics with Counting.",
            "A Formal System for the Universal Quantification of Schematic Variables.",
            "Tractability Frontier of Data Complexity in Team Semantics.",
            "Local Belief Dynamics in Network Knowledge Bases.",
            "Universal Equivalence and Majority of Probabilistic Programs over Finite Fields.",
            "Symmetric Circuits for Rank Logic.",
            "Piecewise Linear Valued CSPs Solvable by Linear Programming Relaxation.",
            "Being Correct Is Not Enough: Efficient Verification Using Robust Linear Temporal Logic.",
            "O-Minimal Invariants for Discrete-Time Dynamical Systems.",
            "Asynchronous Announcements.",
            "Coalgebraic Reasoning with Global Assumptions in Arithmetic Modal Logics.",
            "Zero-One Laws for Existential First-Order Sentences of Bounded Quantifier Depth.",
            "Logics with Multiteam Semantics."
        ]
    },
    {
        "name": "TOCL",
        "year": "2021",
        "info": "Volume 22, 2021",
        "count": 26,
        "papers": [
            "Principles of KLM-style Defeasible Description Logics.",
            "Beyond Uniform Equivalence between Answer-set Programs.",
            "Decidability of a Sound Set of Inference Rules for Computational Indistinguishability.",
            "α β-Relations and the Actual Meaning of α-Renaming.",
            "Strategy Logic with Imperfect Information.",
            "Stratification in Approximation Fixpoint Theory and Its Application to Active Integrity Constraints.",
            "Alternating Tree Automata with Qualitative Semantics.",
            "Expressiveness and Nash Equilibrium in Iterated Boolean Games.",
            "Reasoning about Petri Nets: A Calculus Based on Resolution and Dynamic Logic.",
            "Action Logic is Undecidable.",
            "Small Circuits and Dual Weak PHP in the Universal Theory of p-time Algorithms.",
            "Higher-order Recursion Schemes and Collapsible Pushdown Automata: Logical Properties.",
            "Inference from Visible Information and Background Knowledge.",
            "The Effects of Adding Reachability Predicates in Quantifier-Free Separation Logic.",
            "Kripke Semantics for Intersection Formulas.",
            "Collapsible Pushdown Parity Games.",
            "Strategic Knowledge Acquisition.",
            "Slanted Canonicity of Analytic Inductive Inequalities.",
            "From 2-Sequents and Linear Nested Sequents to Natural Deduction for Normal Modal Logics.",
            "Display to Labeled Proofs and Back Again for Tense Logics.",
            "The Complexity of Counting Problems Over Incomplete Databases.",
            "Complete Abstractions for Checking Language Inclusion.",
            "Reiterman's Theorem on Finite Algebras for a Monad.",
            "EXPSPACE-Completeness of the Logics K4 × S5 and S4 × S5 and the Logic of Subset Spaces.",
            "Generalized Realizability and Basic Logic.",
            "Lower Bounds on OBDD Proofs with Several Orders."
        ]
    },
    {
        "name": "TOCL",
        "year": "2020",
        "info": "Volume 21, 2020",
        "count": 34,
        "papers": [
            "Typing Messages for Free in Security Protocols.",
            "Verification Methods for the Computationally Complete Symbolic Attacker Based on Indistinguishability.",
            "Reason-maintenance Belief Logic with Uncertain Information.",
            "Fixed-point Elimination in the Intuitionistic Propositional Calculus.",
            "Runtime Verification over Out-of-order Streams.",
            "Monadic Datalog, Tree Validity, and Limited Access Containment.",
            "Satisfiability of Modal Inclusion Logic: Lax and Strict Semantics.",
            "Dynamic QBF Dependencies in Reduction and Expansion.",
            "Adding Successor: A Transfer Theorem for Separation and Covering.",
            "Idempotent Anti-unification.",
            "Model-Checking on Ordered Structures.",
            "MTL and TPTL for One-Counter Machines: Expressiveness, Model Checking, and Satisfiability.",
            "Extending Liquid Types to Arrays.",
            "Intuitionistic Linear Temporal Logics.",
            "The Power of the Weak.",
            "A First-order Logic for Reasoning about Knowledge and Probability.",
            "Why Liveness for Timed Automata Is Hard, and What We Can Do About It.",
            "Linking Focusing and Resolution with Selection.",
            "The Bernays-Schönfinkel-Ramsey Class of Separation Logic with Uninterpreted Predicates.",
            "Dichotomies in Ontology-Mediated Querying with the Guarded Fragment.",
            "How Good Is a Strategy in a Game with Nature?",
            "Duality between Unprovability and Provability in Forward Refutation-search for Intuitionistic Propositional Logic.",
            "Toward a Uniform Theory of Effectful State Machines.",
            "Inputs and Outputs in CSP: A Model and a Testing Theory.",
            "Typal Heterogeneous Equality Types.",
            "Model Checking MITL Formulae on Timed Automata: A Logic-based Approach.",
            "Finite Open-world Query Answering with Number Restrictions.",
            "A New Perspective on FO Model Checking of Dense Graph Classes.",
            "First-Order Interpretations of Bounded Expansion Classes.",
            "Metric Temporal Description Logics with Interval-Rigid Names.",
            "Non-well-founded Proof Theory of Transitive Closure Logic.",
            "Undecidable Cases of Model Checking Probabilistic Temporal-Epistemic Logic.",
            "Applying Visible Strong Equivalence in Answer-Set Program Transformations.",
            "Model Checking a Logic for True Concurrency."
        ]
    },
    {
        "name": "TOCL",
        "year": "2019",
        "info": "Volume 20, 2019",
        "count": 25,
        "papers": [
            "Proof Complexity Meets Algebra.",
            "Checking Admissibility Using Natural Dualities.",
            "Generalized Eilenberg Theorem: Varieties of Languages in a Category.",
            "Interval vs. Point Temporal Logic Model Checking: An Expressiveness Comparison.",
            "A Higher-Order Calculus of Computational Fields.",
            "A Theoretical and Numerical Analysis of the Worst-Case Size of Reduced Ordered Binary Decision Diagrams.",
            "Modularisation of Sequent Calculi for Normal and Non-normal Modalities.",
            "The Complexity of Minimal Inference Problem for Conservative Constraint Languages.",
            "Tight Bounds on the Asymptotic Descriptive Complexity of Subgraph Isomorphism.",
            "Reasoning about Strategic Abilities: Agents with Truly Perfect Recall.",
            "Synchronizing Data Words for Register Automata.",
            "Fast Query Answering over Existential Rules.",
            "Pure Sequent Calculi: Analyticity and Decision Procedure.",
            "Binary Reachability of Timed-register Pushdown Automata and Branching Vector Addition Systems.",
            "A SAT Approach to Branchwidth.",
            "On the Verification of Livelock-Freedom and Self-Stabilization on Parameterized Rings.",
            "1-Safe Petri Nets and Special Cube Complexes: Equivalence and Applications.",
            "Parallel-Correctness and Containment for Conjunctive Queries with Union and Negation.",
            "Central Limit Model Checking.",
            "A Representation Theorem for Change through Composition of Activities.",
            "Reasoning about Cognitive Trust in Stochastic Multiagent Systems.",
            "De Morgan Dual Nominal Quantifiers Modelling Private Names in Non-Commutative Logic.",
            "Modal Resolution: Proofs, Layers, and Refinements.",
            "Probabilistic Epistemic Updates on Algebras.",
            "Incomplete SMT Techniques for Solving Non-Linear Formulas over the Integers."
        ]
    },
    {
        "name": "TOCL",
        "year": "2018",
        "info": "Volume 19, 2018",
        "count": 31,
        "papers": [
            "Are Short Proofs Narrow? QBF Resolution Is Not So Simple.",
            "Complexity of Propositional Logics in Team Semantic.",
            "Characterisation of Normalisation Properties for λμ using Strict Negated Intersection Types.",
            "Completeness of Flat Coalgebraic Fixpoint Logics.",
            "Subatomic Proof Systems: Splittable Systems.",
            "Typed Nominal Rewriting.",
            "Definability of Cai-Fürer-Immerman Problems in Choiceless Polynomial Time.",
            "Finite Satisfiability of the Two-Variable Guarded Fragment with Transitive Guards and Related Variants.",
            "Quantitative Aspects of Linear and Affine Closed Lambda Terms.",
            "Compositional Synthesis of Piece-Wise Functions by Learning Classifiers.",
            "Hypersequents and Systems of Rules: Embeddings and Applications.",
            "Syntax-Preserving Belief Change Operators for Logic Programs.",
            "Modular Labelled Sequent Calculi for Abstract Separation Logics.",
            "Finite-State Map-Reduce Computation and Relational Algebra Queries.",
            "Path Categories and Propositional Identity Types.",
            "Hierarchies in Inclusion Logic with Lax Semantics.",
            "Game-Theoretic Semantics for Alternating-Time Temporal Logic.",
            "Automated Deduction in Gödel Logic.",
            "Incremental Linearization for Satisfiability and Verification Modulo Nonlinear Arithmetic and Transcendental Functions.",
            "Minkowski Games.",
            "Interaction Graphs: Non-Deterministic Automata.",
            "An Operational Semantics for the Cognitive Architecture ACT-R and Its Translation to Constraint Handling Rules.",
            "Relating Paths in Transition Systems: The Fall of the Modal Mu-Calculus.",
            "A Modular Type Reconstruction Algorithm.",
            "Geometry of Interaction for MALL via Hughes-Van Glabbeek Proof-Nets.",
            "An Epistemic Strategy Logic.",
            "An Automatic Proving Approach to Parameterized Verification.",
            "Automated Equivalence Checking of Concurrent Quantum Systems.",
            "Some Subsystems of Constant-Depth Frege with Parity.",
            "A Simple Modal Logic for Reasoning in Multigranulation Rough Set Model.",
            "Parallel Cost Analysis."
        ]
    },
    {
        "name": "TOCL",
        "year": "2017",
        "info": "Volume 18, 2017",
        "count": 33,
        "papers": [
            "Parametrised Complexity of Satisfiability in Temporal Logic.",
            "Quantified Constraint Satisfaction Problem on Semicomplete Digraphs.",
            "A Hoare Logic for GPU Kernels.",
            "Equations, Contractions, and Unique Solutions.",
            "Datalog Queries Distributing over Components.",
            "Merging in the Horn Fragment.",
            "Abstract Program Slicing: An Abstract Interpretation-Based Approach to Program Slicing.",
            "Automated Generation of Erotetic Search Scenarios: Classification, Optimization, and Knowledge Extraction.",
            "Expressiveness of Logic Programs under the General Stable Model Semantics.",
            "Graph Logics with Rational Relations: The Role of Word Combinatorics.",
            "The NP Search Problems of Frege and Extended Frege Proofs.",
            "Faster Statistical Model Checking for Unbounded Temporal Properties.",
            "An O(mlogn) Algorithm for Computing Stuttering Equivalence and Branching Bisimulation.",
            "Verifying Procedural Programs via Constrained Rewriting Induction.",
            "Possibilistic Justification Logic: Reasoning About Justified Uncertain Beliefs.",
            "Progression of Decomposed Local-Effect Action Theories.",
            "Uniqueness of Normal Forms for Shallow Term Rewrite Systems.",
            "The Probability of a Computable Output from a Random Oracle.",
            "Differential Hybrid Games.",
            "Monadic Second-Order Logic with Arbitrary Monadic Predicates.",
            "On the Parameterized Complexity of Finding Small Unsatisfiable Subsets of CNF Formulas and CSP Instances.",
            "Horn Fragments of the Halpern-Shoham Interval Temporal Logic.",
            "The Complexity of Phylogeny Constraint Satisfaction Problems.",
            "The Logical View on Continuous Petri Nets.",
            "Collapsible Pushdown Automata and Recursion Schemes.",
            "Algorithmic Compression of Finite Tree Languages by Rigid Acyclic Grammars.",
            "Managing Change in Graph-Structured Data Using Description Logics.",
            "Detecting Decidable Classes of Finitely Ground Logic Programs with Function Symbols.",
            "One Hierarchy Spawns Another: Graph Deconstructions and the Complexity Classification of Conjunctive Queries.",
            "An Effective Characterization of the Alternation Hierarchy in Two-Variable Logic.",
            "Nested Weighted Automata.",
            "Information Flow under Budget Constraints.",
            "Succinctness of Order-Invariant Logics on Depth-Bounded Structures."
        ]
    },
    {
        "name": "TOCL",
        "year": "2015",
        "info": "Volume 17, 2015/2016",
        "count": 32,
        "papers": [
            "Differential Game Logic.",
            "On the Decidability of Elementary Modal Logics.",
            "From Security Protocols to Pushdown Automata.",
            "Optimal Tableau Method for Constructive Satisfiability Testing and Model Synthesis in the Alternating-Time Temporal Logic ATL+.",
            "Lax Theory Morphisms.",
            "An Assertional Proof of the Stability and Correctness of Natural Mergesort.",
            "Backdoors to Normality for Disjunctive Logic Programs.",
            "Effective Interpolation and Preservation in Guarded Logics.",
            "Belief Merging by Examples.",
            "Model Checking Existential Logic on Partially Ordered Sets.",
            "May-Happen-in-Parallel Analysis for Actor-Based Concurrency.",
            "Expressive Completeness of Separation Logic with Two Variables and No Separating Conjunction.",
            "The Hoare Logic of Deterministic and Nondeterministic Monadic Recursion Schemes.",
            "Limiting Until in Ordered Tree Query Languages.",
            "Convolution as a Unifying Concept: Applications in Separation Logic, Interval Calculi, and Concurrency.",
            "Zeno, Hercules, and the Hydra: Safety Metric Temporal Logic is Ackermann-Complete.",
            "Power and Limits of Structural Display Rules.",
            "Correctness and Completeness of Logic Programs.",
            "Narrow Proofs May Be Maximally Long.",
            "Belief Merging within Fragments of Propositional Logic.",
            "Rational Region-Based Affine Logic of the Real Plane.",
            "A Model for Phase Transition of Random Answer-Set Programs.",
            "Automated Verification of Equivalence Properties of Cryptographic Protocols.",
            "Index Problems for Game Automata.",
            "Where First-Order and Monadic Second-Order Logic Coincide.",
            "On the Proof Complexity of Paris-Harrington and Off-Diagonal Ramsey Tautologies.",
            "On Well-Founded Set-Inductions and Locally Monotone Operators.",
            "Taming Multirelations.",
            "The Equivalence of the Torus and the Product of Two Circles in Homotopy Type Theory.",
            "How Hard Is Positive Quantification?",
            "Two-Variable Logic with Counting and Trees.",
            "Complexity of Two-Variable Logic on Finite Trees."
        ]
    },
    {
        "name": "TOCL",
        "year": "2014",
        "info": "Volume 16, 2014/2015",
        "count": 36,
        "papers": [
            "Minimizing Deterministic Lattice Automata.",
            "Logical Characterizations of Behavioral Relations on Transition Systems of Probability Distributions.",
            "A Conceptual Framework for Secrecy-preserving Reasoning in Knowledge Bases.",
            "Decidability of Approximate Skolem Problem and Applications to Logical Verification of Dynamical Properties of Markov Chains.",
            "Taming Paraconsistent (and Other) Logics: An Algorithmic Approach.",
            "Parameterized Weighted Containment.",
            "Why Is It Hard to Obtain a Dichotomy for Consistent Query Answering?",
            "An Evaluation-Driven Decision Procedure for G3i.",
            "The Complexity of Decomposing Modal and First-Order Theories.",
            "A Confluent Rewriting System Having No Computable, One-Step, Normalizing Strategy.",
            "Probabilistic Event Calculus for Event Recognition.",
            "Optimization Modulo Theories with Linear Rational Costs.",
            "Normal Higher-Order Termination.",
            "Layer Systems for Proving Confluence.",
            "Two-Variable Separation Logic and Its Inner Circle.",
            "Efficiently Deciding μ-Calculus with Converse over Finite Trees.",
            "On the Variable Hierarchy of First-Order Spectra.",
            "Higher Homotopies in a Hierarchy of Univalent Universes.",
            "On the Power of Substitution in the Calculus of Structures.",
            "Nonelementary Complexities for Branching VASS, MELL, and Extensions.",
            "Bounds for the Quantifier Depth in Finite-Variable Logics: Alternation Hierarchy.",
            "On the Complexity of Probabilistic Abstract Argumentation Frameworks.",
            "The Local Universes Model: An Overlooked Coherence Construction for Dependent Type Theories.",
            "A SAT Approach to Clique-Width.",
            "Reasoning About Substructures and Games.",
            "Computational Complexity Via Finite Types.",
            "Undecidable Propositional Bimodal Logics and One-Variable First-Order Linear Temporal Logics with Counting.",
            "From Small Space to Small Width in Resolution.",
            "Abstraction in Fixpoint Logic.",
            "Concurrent Dynamic Algebra.",
            "DL-Lite Ontology Revision Based on An Alternative Semantic Characterization.",
            "Dynamic Reasoning Systems.",
            "Łukasiewicz Games: A Logic-Based Approach to Quantitative Strategic Interactions.",
            "Ramsey-Based Inclusion Checking for Visibly Pushdown Automata.",
            "Logic of Intuitionistic Interactive Proofs (Formal Theory of Perfect Knowledge Transfer).",
            "Erratum for \"Randomization in Automata on Infinite Trees\"."
        ]
    },
    {
        "name": "TOCL",
        "year": "2014",
        "info": "Volume 15, 2014",
        "count": 35,
        "papers": [
            "A PSPACE-complete first-order fragment of computability logic.",
            "Improved witnessing and local improvement principles for second-order bounded arithmetic.",
            "Algebra-coalgebra duality in Brzozowski's minimization algorithm.",
            "Non-finite axiomatizability of dynamic topological logic.",
            "Quantifier-free interpolation in combinations of equality interpolating theories.",
            "Degree lower bounds of tower-type for approximating formulas with parity quantifiers.",
            "Using tableau to decide description logics with full role negation and identity.",
            "Extending two-variable logic on data trees with order on data values and its automata.",
            "On the complexity of existential positive queries.",
            "A resolution calculus for the branching-time temporal logic CTL.",
            "Preferred First-Order Answer Set Programs.",
            "Formalizing Negotiations Using Logic Programming.",
            "Safety and Liveness, Weakness and Strength, and the Underlying Topological Relations.",
            "Symbolic Bisimulation for Quantum Processes.",
            "Pebble Weighted Automata and Weighted Logics.",
            "Partial-Observation Stochastic Games: How to Win when Belief Fails.",
            "Parity Games and Propositional Proofs.",
            "Super-Solutions: Succinctly Representing Solutions in Abductive Annotated Probabilistic Temporal Logic.",
            "Complexity Classifications for Logic-Based Argumentation.",
            "LoCo - A Logic for Configuration Problems.",
            "Structural Focalization.",
            "Model-Checking Linear-Time Properties of Quantum Systems.",
            "A Certified Reduction Strategy for Homological Image Processing.",
            "Randomization in Automata on Infinite Trees.",
            "A Cookbook for Temporal Conceptual Data Modelling with Description Logics.",
            "Refining the Process Rewrite Systems Hierarchy via Ground Tree Rewrite Systems.",
            "Temporal Specifications with Accumulative Values.",
            "Identifying Efficient Abductive Hypotheses Using Multicriteria Dominance Relation.",
            "The Ordering Principle in a Fragment of Approximate Counting.",
            "Fuzzy Time in Linear Temporal Logic.",
            "A Sound and Complete Proof Technique for Linearizability of Concurrent Data Structures.",
            "Terminating Evaluation of Logic Programs with Finite Three-Valued Models.",
            "Inference of Field-Sensitive Reachability and Cyclicity.",
            "Reasoning About Strategies: On the Model-Checking Problem.",
            "A General Theory of Barbs, Contexts, and Labels."
        ]
    },
    {
        "name": "TOCL",
        "year": "2013",
        "info": "Volume 14, 2013",
        "count": 34,
        "papers": [
            "Linear-Logic Based Analysis of Constraint Handling Rules with Disjunction.",
            "Complexities of Horn Description Logics.",
            "Computing Loops with at Most One External Support Rule.",
            "YAPA: A Generic Tool for Computing Intruder Knowledge.",
            "Proof Nets for Herbrand's Theorem.",
            "Nondeterministic Phase Semantics and the Undecidability of Boolean BI.",
            "Sound and Complete Axiomatizations of Coalgebraic Language Equivalence.",
            "First-Order Logic on Higher-Order Nested Pushdown Trees.",
            "Fair Synthesis for Asynchronous Distributed Systems.",
            "Using Generalized Annotated Programs to Solve Social Network Diffusion Optimization Problems.",
            "Instantiation Schemes for Nested Theories.",
            "Parallel Abductive Query Answering in Probabilistic Logic Programs.",
            "Topological Logics with Connectedness over Euclidean Spaces.",
            "A Model-Theoretic Approach to Belief Change in Answer Set Programming.",
            "Tableau Calculi for Logic Programs under Answer Set Semantics.",
            "Query-Driven Procedures for Hybrid MKNF Knowledge Bases.",
            "Constraint Propagation for First-Order Logic and Inductive Definitions.",
            "Does Treewidth Help in Modal Satisfiability?",
            "Graph Reachability and Pebble Automata over Infinite Alphabets.",
            "Parameterized Complexity of DPLL Search Procedures.",
            "Extensional Higher-Order Logic Programming.",
            "On the Inference of Resource Usage Upper and Lower Bounds.",
            "Common Knowledge in Email Exchanges.",
            "Propositional Update Operators Based on Formula/Literal Dependence.",
            "Enumeration of monadic second-order queries on trees.",
            "Computing persistent homology within Coq/SSReflect.",
            "A unified semantic framework for fully structural propositional sequent systems.",
            "Logical foundations for more expressive declarative temporal logic programming languages.",
            "Three syntactic theories for combinatory graph reduction.",
            "Constraint satisfaction tractability from semi-lattice operations on infinite sets.",
            "Least upper bounds on the size of confluence and church-rosser diagrams in term rewriting and λ-calculus.",
            "Logical relations for a logical framework.",
            "Verification of linear duration properties over continuous-time markov chains.",
            "Algebra, proof theory and applications for an intuitionistic logic of propositions, actions and adjoint modal operators."
        ]
    },
    {
        "name": "TOCL",
        "year": "2012",
        "info": "Volume 13, 2012",
        "count": 34,
        "papers": [
            "Robust Vacuity for Branching Temporal Logic.",
            "Least and Greatest Fixed Points in Linear Logic.",
            "Topological and Simplicial Models of Identity Types.",
            "Succinctness of the Complement and Intersection of Regular Expressions.",
            "The Complexity of Positive First-Order Logic without Equality.",
            "On the Expressive Power of Multiple Heads in CHR.",
            "Reachability Problems in Piecewise FIFO Systems.",
            "Structural Analysis of Boolean Equation Systems.",
            "The Complexity of Proving the Discrete Jordan Curve Theorem.",
            "Nominal Unification from a Higher-Order Perspective.",
            "Interactive Realizers: A New Approach to Program Extraction from Nonconstructive Proofs.",
            "Model Checking of Recursive Probabilistic Systems.",
            "Annotated Probabilistic Temporal Logic: Approximate Fixpoint Implementation.",
            "Simplification Rules for Intuitionistic Propositional Tableaux.",
            "Complexity of Data Dependence Problems for Program Schemas with Concurrency.",
            "On the Relative Strength of Pebbling and Resolution.",
            "The Complexity of Reasoning for Fragments of Autoepistemic Logic.",
            "An Implicit Characterization of PSPACE.",
            "The dynamic complexity of formal languages.",
            "Permissive-nominal logic: First-order logic over nominal terms and sets.",
            "LTL over description logic axioms.",
            "Calculus of cooperation and game-based reasoning about protocol privacy.",
            "Deductive inference for the interiors and exteriors of horn theories.",
            "Arithmetic complexity via effective names for random sequences.",
            "Graded computation tree logic.",
            "Well-structured program equivalence is highly undecidable.",
            "Algorithmic analysis of array-accessing programs.",
            "Epistemic Strategies and Games on Concurrent Processes.",
            "Translating to Co-Büchi Made Tight, Unified, and Useful.",
            "Maps in Multiple Belief Change.",
            "Hierarchies in Dependence Logic.",
            "A Generalized QSQR Evaluation Method for Horn Knowledge Bases.",
            "Fuzzy Equilibrium Logic: Declarative Problem Solving in Continuous Domains.",
            "Decidability of Downward XPath."
        ]
    },
    {
        "name": "TOCL",
        "year": "2010",
        "info": "Volume 12, 2010/2011",
        "count": 29,
        "papers": [
            "A counterexample-guided abstraction-refinement framework for markov decision processes.",
            "On (Omega-)regular model checking.",
            "Monadic datalog over finite structures of bounded treewidth.",
            "Optimality of size-degree tradeoffs for polynomial calculus.",
            "Unicast and multicast QoS routing with soft-constraint logic programming.",
            "An inclusion theorem for defeasible logics.",
            "Efficient generation of craig interpolants in satisfiability modulo theories.",
            "A theory of sampling for continuous-time metric temporal logic.",
            "Logic of infons: The propositional case.",
            "Safety alternating automata on data words.",
            "Well-founded semantics for description logic programs in the semantic web.",
            "Monadic second order logic on graphs with local cardinality constraints.",
            "The tractability of model checking for LTL: The good, the bad, and the ugly fragments.",
            "Annotated probabilistic temporal logic.",
            "Mechanizing the metatheory of LF.",
            "Persistent queries in the behavioral theory of algorithms.",
            "MWeb: A principled framework for modular web rule bases and its semantics.",
            "Modal abstractions of concurrent behavior.",
            "Alternating automata on data trees and XPath satisfiability.",
            "Embedding nonground logic programs into autoepistemic logic for knowledge-base combination.",
            "Proposition algebra.",
            "A calculus of multiary sequent terms.",
            "A system of interaction and structure IV: The exponentials and decomposition.",
            "Complexity of conservative constraint satisfaction problems.",
            "Logic programs with propositional connectives and aggregates.",
            "Unification and matching on compressed terms.",
            "Two-variable logic on data words.",
            "Qualitative concurrent parity games.",
            "Logics for information systems and their dynamic extensions."
        ]
    },
    {
        "name": "TOCL",
        "year": "2009",
        "info": "Volume 11, 2009/2010",
        "count": 29,
        "papers": [
            "Finitary winning in omega-regular games.",
            "Automated termination proofs for logic programs by term rewriting.",
            "Tableau-based decision procedures for logics of strategic ability in multiagent systems.",
            "Regular tree languages definable in FO and in FOmod.",
            "The formal system lambdadelta.",
            "Higher-order term indexing using substitution trees.",
            "A general framework for sound and complete Floyd-Hoare logics.",
            "Logical queries over views: Decidability and expressiveness.",
            "Deciding security properties for cryptographic protocols. application to key cycles.",
            "Annotated RDF.",
            "Weyl's predicative classical mathematics as a logic-enriched type theory.",
            "Undecidability and intractability results concerning datalog programs and their persistency numbers.",
            "Proof search specifications of bisimulation and modal logics for the pi-calculus.",
            "FDNC: Decidable nonmonotonic disjunctive logic programs with function symbols.",
            "A fast algorithm and datalog inexpressibility for temporal reasoning.",
            "On the completeness of compositional reasoning methods.",
            "Deciding strategy properties of contract-signing protocols.",
            "Complexity of propositional proofs under a promise.",
            "Lower bounds for bounded depth Frege proofs via Pudlák-Buss games.",
            "On the distributivity of LTL specifications.",
            "CSL 2008 special issue.",
            "A tight Karp-Lipton collapse result in bounded arithmetic.",
            "Quantitative languages.",
            "Nonuniform Boolean constraint satisfaction problems with cardinality constraint.",
            "On isomorphisms of intersection types.",
            "Pure pointer programs with iteration.",
            "Superposition for fixed domains.",
            "Typing streams in the Λµ-calculus.",
            "Erratum for \"What causes a system to satisfy a specification?\"."
        ]
    },
    {
        "name": "TOCL",
        "year": "2009",
        "info": "Volume 10, 2009",
        "count": 29,
        "papers": [
            "Specifying norm-governed computational societies.",
            "Arithmetic complexity.",
            "Certainty closure: Reliable constraint reasoning with incomplete or erroneous data.",
            "New results on rewrite-based satisfiability procedures.",
            "Reasoning about actions with sensing under qualitative and probabilistic uncertainty.",
            "A finite equational base for CCS with left merge and communication merge.",
            "A logical characterization of the counting hierarchy.",
            "The geometry of linear higher-order recursion.",
            "Probabilistic bisimulation as a congruence.",
            "Termination of rewriting under strategies.",
            "A compositional semantics for CHR.",
            "Proofs, tests and continuation passing style.",
            "PSPACE bounds for rank-1 modal logics.",
            "On the proof complexity of deep inference.",
            "Checking timed Büchi automata emptiness on simulation graphs.",
            "LTL with the freeze quantifier and register automata.",
            "Generalizing consistency and other constraint properties to quantified constraints.",
            "Analytic tableaux calculi for KLM logics of nonmonotonic reasoning.",
            "An algebra of quantum processes.",
            "Simultaneous checking of completeness and ground confluence for algebraic specifications.",
            "Tableau calculus for preference-based conditional logics: PCL and its extensions.",
            "Differential recursion.",
            "Guest editorial: Special issue on implicit computational complexity.",
            "A new function algebra of EXPTIME functions by safe nested recursion.",
            "Context semantics, linear logic, and computational complexity.",
            "Extending the loop language with higher-order procedural variables.",
            "Sup-interpretations, a semantic method for static analysis of program resources.",
            "A flow calculus of mwp-bounds for complexity analysis.",
            "Resource control graphs."
        ]
    },
    {
        "name": "TOCL",
        "year": "2007",
        "info": "Volume 9, 2007/2008",
        "count": 29,
        "papers": [
            "A game-based framework for CTL counterexamples and 3-valued abstraction-refinement.",
            "A formally verified proof of the prime number theorem.",
            "Polymorphic type inference for the named nested relational calculus.",
            "Predicate abstraction with indexed predicates.",
            "Verifying nondeterministic probabilistic channel systems against ω-regular linear-time properties.",
            "A concrete framework for environment machines.",
            "Outlier detection by logic programming.",
            "A comprehensive combination framework.",
            "Coordination in answer set programming.",
            "Alternating timed automata.",
            "Bounds on the automata size for Presburger arithmetic.",
            "Durations and parametric model-checking in timed automata.",
            "First-order complete and computationally complete query languages for spatio-temporal databases.",
            "A logic of nonmonotone inductive definitions.",
            "A uniform approach to constraint-solving for lists, multisets, compact lists, and sets.",
            "Foundational certified code in the Twelf metalogical framework.",
            "Inferring non-suspension conditions for logic programs with dynamic scheduling.",
            "Program termination and well partial orderings.",
            "Abstract state machines capture parallel algorithms: Correction and extension.",
            "What causes a system to satisfy a specification?.",
            "Proof search in Hájek's basic logic.",
            "Conjunctive query containment and answering under description logic constraints.",
            "Contextual modal type theory.",
            "Complexity results for security protocols with Diffie-Hellman exponentiation and commuting public key encryption.",
            "Undecidability of the unification and admissibility problems for modal and description logics.",
            "Open answer set programming with guarded programs.",
            "Reasoning with recursive loops under the PLP framework.",
            "Flat and one-variable clauses: Complexity of verifying cryptographic protocols with single blind copying.",
            "Verifiable agent interaction in abductive logic programming: The SCIFF framework."
        ]
    },
    {
        "name": "TOCL",
        "year": "2007",
        "info": "Volume 8, 2007",
        "count": 24,
        "papers": [
            "A system of interaction and structure.",
            "Compilability of propositional abduction.",
            "Results on the quantitative µ-calculus qMµ.",
            "On compositionality and its limitations.",
            "Logical characterizations of heap abstractions.",
            "Abstract canonical inference.",
            "Erratum to splitting an operator: Algebraic modularity results for logics with fixpoint semantics.",
            "Sound and complete elimination of singleton kinds.",
            "Recycling computed answers in rewrite systems for abduction.",
            "Where fail-safe default logics fail.",
            "Logical definability and query languages over ranked and unranked trees.",
            "On unification for bounded distributive lattices.",
            "The arithmetical complexity of dimension and randomness.",
            "PELCR: Parallel environment for optimal lambda-calculus reduction.",
            "Ordinary interactive small-step algorithms, II.",
            "Ordinary interactive small-step algorithms, III.",
            "Semantical characterizations and complexity of equivalences in answer set programming.",
            "Paraconsistent reasoning and preferential entailments by signed quantified Boolean formulae.",
            "The axiomatic translation principle for modal logic.",
            "Probabilistic abstraction for model checking: An approach based on property testing.",
            "First-order queries on structures of bounded degree are computable with constant delay.",
            "A sequent calculus and a theorem prover for standard conditional logics.",
            "Removing propagation redundant constraints in redundant modeling.",
            "Probabilistic interval XML."
        ]
    },
    {
        "name": "TOCL",
        "year": "2006",
        "info": "Volume 7, 2006",
        "count": 24,
        "papers": [
            "Unfolding partiality and disjunctions in stable model semantics.",
            "Predicate-calculus-based logics for modeling and solving search problems.",
            "Complexity results on DPLL and resolution.",
            "Monodic temporal resolution.",
            "Heterogeneous temporal probabilistic agents.",
            "Constant-depth Frege systems with counting axioms polynomially simulate Nullstellensatz refutations.",
            "Optimizing optimal reduction: A type inference algorithm for elementary affine logic.",
            "Why are there so many loop formulas?",
            "Decidability results for sets with atoms.",
            "Propositional computability logic I.",
            "Propositional computability logic II.",
            "Ordinary interactive small-step algorithms, I.",
            "Logic program-based updates.",
            "Fast verification of MLL proof nets via IMLL.",
            "The DLV system for knowledge representation and reasoning.",
            "Soft concurrent constraint programming.",
            "Comprehending software correctness implies comprehending an intelligence-related limitation.",
            "Domain-dependent knowledge in answer set planning.",
            "Defining functions on equivalence classes.",
            "Extensional equivalence and singleton types.",
            "Efficient solving of quantified inequality constraints over the real numbers.",
            "The strength of replacement in weak arithmetic.",
            "Splitting an operator: Algebraic modularity results for logics with fixpoint semantics.",
            "Kleene algebra with domain."
        ]
    },
    {
        "name": "TOCL",
        "year": "2005",
        "info": "Volume 6, 2005",
        "count": 28,
        "papers": [
            "A classification of symbolic transition systems.",
            "Making abstract domains condensing.",
            "On equivalence and canonical forms in the LF type theory.",
            "A new decidability technique for ground term rewriting systems with applications.",
            "A modal logic framework for multi-agent belief fusion.",
            "Eternity variables to prove simulation of specifications.",
            "Induction from answer sets in nonmonotonic logic programs.",
            "Complexity of propositional nested circumscription and nested abnormality theories.",
            "From linear time to branching time.",
            "Comparisons and computation of well-founded semantics for disjunctive logic programs.",
            "Equivalences among aggregate queries with negation.",
            "Knuth-Bendix constraint solving is NP-complete.",
            "Reasoning about evolving nonmonotonic knowledge bases.",
            "Minimum model semantics for logic programs with negation-as-failure.",
            "An elementary fragment of second-order lambda calculus.",
            "Datalog programs and their persistency numbers.",
            "On the complexity of the disjunction property in intuitionistic and modal logics.",
            "Disjunction and modular goal-directed proof search.",
            "Sequent and hypersequent calculi for abelian and Łukasiewicz logics.",
            "An effective decision procedure for linear arithmetic over the integers and reals.",
            "Arithmetic, first-order logic, and counting quantifiers.",
            "Editorial.",
            "LICS 2003 special issue.",
            "Automatic linear orders and trees.",
            "About the undecidability of program equivalence in finitary languages with state.",
            "Convergence law for random graphs with specified degree sequence.",
            "A proof theory for generic judgments.",
            "Proof nets for unit-free multiplicative-additive linear logic."
        ]
    },
    {
        "name": "TOCL",
        "year": "2004",
        "info": "Volume 5, 2004",
        "count": 23,
        "papers": [
            "Deterministic generators and games for Ltl fragments.",
            "Precongruence formats for decorated trace semantics.",
            "A modal logic for mobile agents.",
            "Super logic programs.",
            "Automatic generation of rule-based constraint solvers over finite domains.",
            "A logic programming approach to knowledge-state planning: Semantics and complexity.",
            "Convergent approximate solving of first-order constraints by approximate quantifiers.",
            "Inflationary fixed points in modal logic.",
            "Optimal length tree-like resolution refutations for 2SAT formulas.",
            "Classes of term rewrite systems with polynomial confluence problems.",
            "Some applications of logic to feasibility in higher types.",
            "A decomposition-based implementation of search strategies.",
            "Basic theory of feature trees.",
            "Finite state machines for strings over infinite alphabets.",
            "Symbolic semantic rules for producing compact STGLAs from value passing process descriptions.",
            "Termination of simply moded logic programs with dynamic scheduling.",
            "Hypothesis-based semantics of logic programs in multivalued logics.",
            "Reflective metalogical frameworks.",
            "A theory of normed simulations.",
            "Abstract versus concrete computation on metric partial algebras.",
            "NEXP TIME-complete description logics with concrete domains.",
            "Proving correctness of timed concurrent constraint programs.",
            "Interval constraint solving for camera control and motion planning."
        ]
    },
    {
        "name": "TOCL",
        "year": "2003",
        "info": "Volume 4, 2003",
        "count": 22,
        "papers": [
            "The marriage of effects and monads.",
            "Deciding the confluence of ordered term rewrite systems.",
            "Resource-distribution via Boolean constraints.",
            "Fixed-parameter complexity of semantics for logic programs.",
            "A complete characterization of complete intersection-type preorders.",
            "On proving left termination of constraint logic programs.",
            "Computational properties of metaquerying problems.",
            "Simulation-based minimazation.",
            "On proving left termination of constraint logic programs.",
            "Logics of metric spaces.",
            "LICS 2001 special issue.",
            "An n! lower bound on formula size.",
            "Typechecking XML views of relational databases.",
            "Substructural logic and partial correctness.",
            "Topological incompleteness and order incompleteness of the lambda calculu.",
            "Eliminating definitions and Skolem functions in first-order logic.",
            "A dynamic approach to characterizing termination of general logic programs.",
            "Variable independence for first-order definable constraints.",
            "Model checking stochastic automata.",
            "Higher-order pattern complement and the strict lambda-calculus.",
            "Interaction between path and type constraints.",
            "Abstract state machines capture parallel algorithms."
        ]
    },
    {
        "name": "TOCL",
        "year": "2002",
        "info": "Volume 3, 2002",
        "count": 18,
        "papers": [
            "The intuitionism behind Statecharts steps.",
            "Datalog LITE: a deductive query language with linear time model checking.",
            "Reasoning with higher-order abstract syntax in a logical framework.",
            "Intuitionistic Light Affine Logic.",
            "Description logics of minimal knowledge and negation as failure.",
            "Sequent calculi for propositional nonmonotonic logics.",
            "Abstract computability and algebraic specification.",
            "Editorial.",
            "On first-order topological queries.",
            "Probabilistic game semantics.",
            "A syntactical analysis of non-size-increasing polynomial time computation.",
            "Resource-bounded continuity and sequentiality for type-two functionals.",
            "Back and forth between guarded and modal logics.",
            "Deciding and axiomatizing weak ST bisimulation for a process algebra with recursion and action refinement.",
            "Polynomial-time computation via local inference relations.",
            "Revisiting quantification in autoepistemic logic.",
            "Typed interpretations of extensible objects.",
            "Boolean satisfiability with transitivity constraints."
        ]
    },
    {
        "name": "TOCL",
        "year": "2001",
        "info": "Volume 2, 2001",
        "count": 21,
        "papers": [
            "Inadequacy of computable loop invariants.",
            "Clausal temporal resolution.",
            "Termination proofs for logic programs with tabling.",
            "Processor verification using efficient reductions of the logic of uninterpreted functions to propositional logic.",
            "Logics capturing local properties.",
            "A decision procedure for term algebras with queues.",
            "How to optimize proof-search in modal logics: new methods of proving redundancy criteria for sequent calculi.",
            "MSO definable string transductions and two-way finite-state transducers.",
            "Representation results for defeasible logic.",
            "Probabilistic logic programming with conditional constraints.",
            "Proof-complexity results for nonmonotonic reasoning.",
            "Parametric temporal logic for \"model measuring\".",
            "Weak alternating automata are not that weak.",
            "Editorial.",
            "On knowledge-based programming with sensing in the situation calculus.",
            "An extended transformation approach to inductive logic programming.",
            "Incremental execution of guarded theories.",
            "Strongly equivalent logic programs.",
            "Verifying security protocols as planning in logic programming.",
            "A computational theory of normative positions.",
            "Logic programming revisited: Logic programs as inductive definitions."
        ]
    },
    {
        "name": "TOCL",
        "year": "2000",
        "info": "Volume 1, 2000",
        "count": 12,
        "papers": [
            "Mechanizing UNITY in Isabelle.",
            "Logics with counting and local properties.",
            "On Hoare logic and Kleene algebra with tests.",
            "Sequential abstract-state machines capture sequential algorithms.",
            "Locality of order-invariant first-order formulas.",
            "Compilability and compact representations of revision of Horn knowledge bases.",
            "Model-checking continous-time Markov chains.",
            "A note on the complexity of propositional Hoare logic.",
            "First-order conditional logic for default reasoning revisited.",
            "Probabilistic agent programs.",
            "Knowledge in multiagent systems: initial configurations and broadcast.",
            "Search and strategies in OPL."
        ]
    }
]