[
    {
        "name": "TOMS",
        "year": "2022",
        "info": "Volume 48: 2022",
        "count": 12,
        "papers": [
            "GraphBLAST: A High-Performance Linear Algebra-based Graph Framework on the GPU.",
            "Ginkgo: A Modern Linear Operator Algebra Framework for High Performance Computing.",
            "Reproduced Computational Results Report for \"Ginkgo: A Modern Linear Operator Algebra Framework for High Performance Computing\".",
            "An Algorithm for the Complete Solution of the Quartic Eigenvalue Problem.",
            "A Computational Study of Using Black-box QR Solvers for Large-scale Sparse-dense Linear Least Squares Problems.",
            "Exploiting Problem Structure in Derivative Free Optimization.",
            "Source-to-Source Automatic Differentiation of OpenMP Parallel Loops.",
            "Bringing Trimmed Serendipity Methods to Computational Practice in Firedrake.",
            "Formalization of Double-Word Arithmetic, and Comments on \"Tight and Rigorous Error Bounds for Basic Building Blocks of Double-Word Arithmetic\".",
            "Remark on Algorithm 982: Explicit Solutions of Triangular Systems of First-order Linear Initial-value Ordinary Differential Equations with Constant Coefficients.",
            "Algorithm 1019: A Task-based Multi-shift QR/QZ Algorithm with Aggressive Early Deflation.",
            "Algorithm 1020: Computation of Multi-Degree Tchebycheffian B-Splines."
        ]
    },
    {
        "name": "TOMS",
        "year": "2021",
        "info": "Volume 47: 2021",
        "count": 39,
        "papers": [
            "Strengths and Limitations of Stretching for Least-squares Problems with Some Dense Rows.",
            "ArborX: A Performance Portable Geometric Search Library.",
            "H2Pack: High-performance H2 Matrix Package for Kernel Matrices Using the Proxy Point Method.",
            "GetFEM: Automated FE Modeling of Multiphysics Problems Based on a Generic Weak Form Language.",
            "An Enhancement of the Bisection Method Average Performance Preserving Minmax Optimality.",
            "Automatic Code Generation for High-performance Discontinuous Galerkin Methods on Modern Architectures.",
            "A Flexible, Parallel, Adaptive Geometric Multigrid Method for FEM.",
            "Algorithm 1013: An R Implementation of a Continuous Spectral Algorithm for Simulating Vector Gaussian Random Fields in Euclidean Spaces.",
            "Algorithm 1014: An Improved Algorithm for hypot(x, y).",
            "Confidence Intervals for Stochastic Arithmetic.",
            "Improved Arithmetic of Complex Fans.",
            "Supporting Mixed-domain Mixed-precision Matrix Multiplication within the BLIS Framework.",
            "Recycling Krylov Subspaces and Truncating Deflation Subspaces for Solving Sequence of Linear Systems.",
            "Adaptive Precision Block-Jacobi for High Performance Preconditioning in the Ginkgo Linear Algebra Software.",
            "Replicated Computational Results (RCR) Report for \"Adaptive Precision Block-Jacobi for High Performance Preconditioning in the Ginkgo Linear Algebra Software\".",
            "hIPPYlib: An Extensible Software Framework for Large-Scale Inverse Problems Governed by PDEs: Part I: Deterministic Inversion and Linearized Bayesian Inference.",
            "fenicsR13: A Tensorial Mixed Finite Element Solver for the Linear R13 Equations Using the FEniCS Computing Platform.",
            "Algorithm 1015: A Fast Scalable Solver for the Dense Linear (Sum) Assignment Problem.",
            "Algorithm 1016: PyMGRIT: A Python Package for the Parallel-in-time Method MGRIT.",
            "PLANC: Parallel Low-rank Approximation with Nonnegativity Constraints.",
            "A Set of Batched Basic Linear Algebra Subprograms and LAPACK Routines.",
            "Linnea: Automatic Generation of Efficient Linear Algebra Programs.",
            "NEP: A Module for the Parallel Solution of Nonlinear Eigenvalue Problems in SLEPc.",
            "Fast Matching Pursuit with Multi-Gabor Dictionaries.",
            "PCPATCH: Software for the Topological Construction of Multigrid Relaxation Methods.",
            "FAME: Fast Algorithms for Maxwell's Equations for Three-dimensional Photonic Crystals.",
            "HyperNOMAD: Hyperparameter Optimization of Deep Neural Networks Using Mesh Adaptive Direct Search.",
            "Medusa: A C++ Library for Solving PDEs Using Strong Form Mesh-free Methods.",
            "Algorithm 1017: fuzzyreg: An R Package for Fitting Fuzzy Regression Models.",
            "Irksome: Automating Runge-Kutta Time-stepping for Finite Element Methods.",
            "Abstractions and Automated Algorithms for Mixed Domain Finite Element Methods.",
            "Propagating Geometry Information to Finite Element Computations.",
            "hyper.deal: An Efficient, Matrix-free Finite-element Library for High-dimensional Partial Differential Equations.",
            "PySPH: A Python-based Framework for Smoothed Particle Hydrodynamics.",
            "Exactly Computing the Tail of the Poisson-Binomial Distribution.",
            "Scrambled Linear Pseudorandom Number Generators.",
            "Corrigendum: Remark on Algorithm 723: Fresnel Integrals.",
            "Remark on Algorithm 992: An OpenGL- and C++-based Function Library for Curve and Surface Modeling in a Large Class of Extended Chebyshev Spaces.",
            "Algorithm 1018: FaVeST - Fast Vector Spherical Harmonic Transforms."
        ]
    },
    {
        "name": "TOMS",
        "year": "2020",
        "info": "Volume 46: 2020",
        "count": 38,
        "papers": [
            "Strassen's Algorithm Reloaded on GPUs.",
            "A Software Platform for Adaptive High Order Multistep Methods.",
            "High-order Numerical Quadratures in a Tetrahedron with an Implicitly Defined Curved Interface.",
            "Product Algebras for Galerkin Discretisations of Boundary Integral Operators and their Applications.",
            "PETSc DMNetwork: A Library for Scalable Network PDE-Based Multiphysics Simulations.",
            "Architecture and Performance of Devito, a System for Automated Stencil Computation.",
            "Algorithm 1003: Mongoose, a Graph Coarsening and Partitioning Library.",
            "Algorithm 1004: The Iisignature Library: Efficient Calculation of Iterated-Integral Signatures and Log Signatures.",
            "Algorithm 1005: Fortran Subroutines for Reverse Mode Algorithmic Differentiation of BLAS Matrix Operations.",
            "Algorithm 1006: Fast and Accurate Evaluation of a Generalized Incomplete Gamma Function.",
            "Error Analysis of Some Operations Involved in the Cooley-Tukey Fast Fourier Transform.",
            "H-Revolve: A Framework for Adjoint Computation on Synchronous Hierarchical Platforms.",
            "TuckerMPI: A Parallel C++/MPI Software Package for Large-scale Data Compression via the Tucker Tensor Decomposition.",
            "Bidiagonal SVD Computation via an Associated Tridiagonal Eigenproblem.",
            "The BLAS API of BLASFEO: Optimizing Performance for Small Matrices.",
            "JGraphT - A Java Library for Graph Data Structures and Algorithms.",
            "Algorithm 1007: QNSTOP - Quasi-Newton Algorithm for Stochastic Optimization.",
            "Algorithm 1008: Multicomplex Number Class for Matlab, with a Focus on the Accurate Calculation of Small Imaginary Terms for Multicomplex Step Sensitivity Calculations.",
            "Algorithm 1009: MieSolver - An Object-Oriented Mie Series Software for Wave Scattering by Cylinders.",
            "Algorithm 1010: Boosting Efficiency in Solving Quartic Equations with No Compromise in Accuracy.",
            "Faithfully Rounded Floating-point Computations.",
            "Algorithms for Efficient Reproducible Floating Point Summation.",
            "MultiZ: A Library for Computation of High-order Derivatives Using Multicomplex or Multidual Numbers.",
            "SODECL: An Open-Source Library for Calculating Multiple Orbits of a System of Stochastic Differential Equations in Parallel.",
            "CGPOPS: A C++ Software for Solving Multiple-Phase Optimal Control Problems Using Adaptive Gaussian Quadrature Collocation and Sparse Nonlinear Programming.",
            "Analysis and Performance Evaluation of Adjoint-guided Adaptive Mesh Refinement for Linear Hyperbolic PDEs Using Clawpack.",
            "Automating the Formulation and Resolution of Convex Variational Problems: Applications from Image Processing to Computational Mechanics.",
            "Polynomial Evaluation on Superscalar Architecture, Applied to the Elementary Function ex.",
            "Algorithm 1011: Improved Invariant Polytope Algorithm and Applications.",
            "New Numerical Algorithm for Deflation of Infinite and Zero Eigenvalues and Full Solution of Quadratic Eigenvalue Problems.",
            "PHIST: A Pipelined, Hybrid-Parallel Iterative Solver Toolkit.",
            "Parallel Tree Algorithms for AMR and Non-Standard Data Access.",
            "Variable Step-Size Control Based on Two-Steps for Radau IIA Methods.",
            "Yet Another Tensor Toolbox for Discontinuous Galerkin Methods and Other Applications.",
            "A Shift Selection Strategy for Parallel Shift-invert Spectrum Slicing in Symmetric Self-consistent Eigenvalue Computation.",
            "A Feature-complete SPIKE Dense Banded Solver.",
            "Error Analysis and Improving the Accuracy of Winograd Convolution for Deep Neural Networks.",
            "Algorithm 1012: DELAUNAYSPARSE: Interpolation via a Sparse Subset of the Delaunay Triangulation in Medium to High Dimensions."
        ]
    },
    {
        "name": "TOMS",
        "year": "2019",
        "info": "Volume 45: 2019",
        "count": 46,
        "papers": [
            "Computing the Braid Monodromy of Completely Reducible n-gonal Curves.",
            "Performance and Scalability of the Block Low-Rank Multifrontal Factorization on Multicore Architectures.",
            "Hierarchical Matrix Operations on GPUs: Matrix-Vector Multiplication and Compression.",
            "randUTV: A Blocked Randomized Algorithm for Computing a Rank-Revealing UTV Factorization.",
            "Mathematics and Speed for Interval Arithmetic: A Complement to IEEE 1788.",
            "Polar Affine Arithmetic: Optimal Affine Approximation and Operation Development for Computation in Polar Form Under Uncertainty.",
            "A Unified 2D/3D Large-Scale Software Environment for Nonlinear Inverse Problems.",
            "Extended BACOLI: Solving One-Dimensional Multiscale Parabolic PDE Systems With Error Control.",
            "Verified Newton-Raphson Iteration for Multiplicative Inverses Modulo Powers of Any Base.",
            "Spin Summations: A High-Performance Perspective.",
            "On Quality of Implementation of Fortran 2008 Complex Intrinsic Functions on Branch Cuts.",
            "Algorithm 991: The 2D Tree Sliding Window Discrete Fourier Transform.",
            "Algorithm 992: An OpenGL- and C++-based Function Library for Curve and Surface Modeling in a Large Class of Extended Chebyshev Spaces.",
            "The Peano Software - Parallel, Automaton-based, Dynamically Adaptive Grid Traversals.",
            "Batched Triangular Dense Linear Algebra Kernels for Very Small Matrix Sizes on GPUs.",
            "PLASMA: Parallel Linear Algebra Software for Multicore Using OpenMP.",
            "Automated Tiling of Unstructured Mesh Computations with Application to Seismological Modeling.",
            "A QDWH-based SVD Software Framework on Distributed-memory Manycore Systems.",
            "Client-side Computational Optimization.",
            "A Note on Using Performance and Data Profiles for Training Algorithms.",
            "ChASE: Chebyshev Accelerated Subspace Iteration Eigensolver for Sequences of Hermitian Eigenvalue Problems.",
            "Algorithm 993: Efficient Computation with Kronecker Products.",
            "Algorithm 994: Fast Implementations of the Brouwer-Zimmermann Algorithm for the Computation of the Minimum Distance of a Random Linear Code.",
            "Remark on \"Algorithm 680: Evaluation of the Complex Error Function\": Cause and Remedy for the Loss of Accuracy Near the Real Axis.",
            "High-performance Implementation of Elliptic Curve Cryptography Using Vector Instructions.",
            "Adjoint Code Design Patterns.",
            "Enclosing Chebyshev Expansions in Linear Time.",
            "The Implementation of the Colored Abstract Simplicial Complex and Its Application to Mesh Generation.",
            "Fast Matrix-Free Evaluation of Discontinuous Galerkin Finite Element Operators.",
            "Computing Hypergeometric Functions Rigorously.",
            "Tree Partitioning Reduction: A New Parallel Partition Method for Solving Tridiagonal Systems.",
            "Improving the Flexibility and Robustness of Model-based Derivative-free Optimization Solvers.",
            "Algorithm 995: An Efficient Parallel Anisotropic Delaunay Mesh Generator for Two-Dimensional Finite Element Analysis.",
            "Algorithm 996: BBCPOP: A Sparse Doubly Nonnegative Relaxation of Polynomial Optimization Problems With Binary, Box, and Complementarity Constraints.",
            "Algorithm 997: pySDC - Prototyping Spectral Deferred Corrections.",
            "Algorithm 998: The Robust LMI Parser - A Toolbox to Construct LMI Conditions for Uncertain Systems.",
            "A Wolfe Line Search Algorithm for Vector Optimization.",
            "High-Performance Derivative Computations using CoDiPack.",
            "On Kummer Lines with Full Rational 2-torsion and Their Usage in Cryptography.",
            "FloatX: A C++ Library for Customized Floating-Point Arithmetic.",
            "Code Generation for Generally Mapped Finite Elements.",
            "Replicated Computational Results (RCR) Report for \"Code Generation for Generally Mapped Finite Elements\".",
            "Algorithm 999: Computation of Multi-Degree B-Splines.",
            "Algorithm 1000: SuiteSparse: GraphBLAS: Graph Algorithms in the Language of Sparse Linear Algebra.",
            "Algorithm 1001: IPscatt - A MATLAB Toolbox for the Inverse Medium Problem in Scattering.",
            "Algorithm 1002: Graph Coloring Based Parallel Push-relabel Algorithm for the Maximum Flow Problem."
        ]
    },
    {
        "name": "TOMS",
        "year": "2017",
        "info": "Volume 44: 2017/2018",
        "count": 49,
        "papers": [
            "SYM-ILDL: Incomplete LDLT Factorization of Symmetric Indefinite and Skew-Symmetric Matrices.",
            "Complex Additive Geometric Multilevel Solvers for Helmholtz Equations on Spacetrees.",
            "An Algorithm for the Optimization of Finite Element Integration Loops.",
            "On the Robustness of the 2Sum and Fast2Sum Algorithms.",
            "On Orienting Edges of Unstructured Two- and Three-Dimensional Meshes.",
            "BFO, A Trainable Derivative-free Brute Force Optimizer for Nonlinear Bound-constrained Optimization and Equilibrium Computations with Continuous and Discrete Variables.",
            "Implementing High-performance Complex Matrix Multiplication via the 3m and 4m Methods.",
            "Performance Evaluation of a Two-Dimensional Lattice Boltzmann Solver Using CUDA and PGAS UPC Based Parallelisation.",
            "Algorithm 975: TMATROM - A T-Matrix Reduced Order Model Software.",
            "Algorithm 976: Bertini_real: Numerical Decomposition of Real Algebraic Curves and Surfaces.",
            "Algorithm 977: A QR-Preconditioned QR SVD Method for Computing the SVD with High Accuracy.",
            "Algorithm 978: Safe Scaling in the Level 1 BLAS.",
            "Numerically Aware Orderings for Sparse Symmetric Indefinite Linear Systems.",
            "Geometric Reconstruction of Implicitly Defined Surfaces and Domains with Topological Guarantees.",
            "TTC: A High-Performance Compiler for Tensor Transpositions.",
            "Tight and Rigorous Error Bounds for Basic Building Blocks of Double-Word Arithmetic.",
            "Algorithm 979: Recursive Algorithms for Dense Linear Algebra - The ReLAPACK Collection.",
            "Algorithm 980: Sparse QR Factorization on the GPU.",
            "Algorithm 981: Talbot Suite DE: Application of Modified Talbot's Method to Solve Differential Problems.",
            "Algorithm 982: Explicit Solutions of Triangular Systems of First-Order Linear Initial-Value Ordinary Differential Equations with Constant Coefficients.",
            "Algorithm 983: Fast Computation of the Non-Asymptotic Cochran's Q Statistic for Heterogeneity Detection.",
            "Algorithm 984: ADiGator, a Toolbox for the Algorithmic Differentiation of Mathematical Functions in MATLAB Using Source Transformation via Operator Overloading.",
            "Algorithm 985: Simple, Efficient, and Relatively Accurate Approximation for the Evaluation of the Faddeyeva Function.",
            "Algorithm 986: A Suite of Compact Finite Difference Schemes.",
            "Remark on Algorithm 539: A Modern Fortran Reference Implementation for Carefully Computing the Euclidean Norm.",
            "Numerical Bifurcation Analysis of Homoclinic Orbits Embedded in One-Dimensional Manifolds of Maps.",
            "SparseX: A Library for High-Performance Sparse Matrix-Vector Multiplication on Multicore Platforms.",
            "Simultaneous Conversions with the Residue Number System Using Linear Algebra.",
            "Design of a High-Performance GEMM-like Tensor-Tensor Multiplication.",
            "Efficient Parallel Random Sampling - Vectorized, Cache-Efficient, and Online.",
            "Implementing 64-bit Maximally Equidistributed F2-Linear Generators with Mersenne Prime Period.",
            "Automatic Reformulation of ODEs to Systems of First-Order Equations.",
            "Quasi-matrix-free Hybrid Multigrid on Dynamically Adaptive Cartesian Grids.",
            "On Roundoff Error Growth in Elliptic Problems.",
            "A Domain-Specific Language and Editor for Parallel Particle Methods.",
            "Algorithm 987: MANBIS - A C++ Mathematical Software Package for Locating and Computing Efficiently Many Roots of a Function: Theoretical Issues.",
            "Algorithm 988: AMGKQ: An Efficient Implementation of Adaptive Multivariate Gauss-Kronrod Quadrature for Simultaneous Integrands in Octave/MATLAB.",
            "A Computational Architecture for Coupling Heterogeneous Numerical Models and Computing Coupled Derivatives.",
            "Practical Polytope Volume Approximation.",
            "BootCMatch: A Software Package for Bootstrap AMG Based on Graph Weighted Matching.",
            "Solution of Dense Linear Systems via Roundoff-Error-Free Factorization Algorithms: Theoretical Connections and Computational Comparisons.",
            "Interval Enclosures of Upper Bounds of Roundoff Errors Using Semidefinite Programming.",
            "BLASFEO: Basic Linear Algebra Subroutines for Embedded Optimization.",
            "ROPTLIB: An Object-Oriented C++ Library for Optimization on Riemannian Manifolds.",
            "Validated and Numerically Efficient Chebyshev Spectral Methods for Linear Ordinary Differential Equations.",
            "Secure and Fast Encryption (SAFE) with Classical Random Number Generators.",
            "Design and Implementation of Adaptive SpMV Library for Multicore and Many-Core Architecture.",
            "Algorithm 989: perm_mateda: A Matlab Toolbox of Estimation of Distribution Algorithms for Permutation-based Combinatorial Optimization Problems.",
            "Algorithm 990: Efficient Atlasing and Search of Configuration Spaces of Point-Sets Constrained by Distance Intervals."
        ]
    },
    {
        "name": "TOMS",
        "year": "2016",
        "info": "Volume 43: 2016/2017",
        "count": 39,
        "papers": [
            "General Template Units for the Finite Volume Method in Box-Shaped Domains.",
            "WorkStream - A Design Pattern for Multicore-Enabled Finite Element Computations.",
            "On BLAS Level-3 Implementations of Common Solvers for (Quasi-) Triangular Generalized Lyapunov Equations.",
            "A Nonlinear QR Algorithm for Banded Nonlinear Eigenvalue Problems.",
            "Modular SIMD arithmetic in Mathemagix.",
            "A High Performance QDWH-SVD Solver Using Hardware Accelerators.",
            "A Robust and Scalable Implementation of the Parks-McClellan Algorithm for Designing FIR Filters.",
            "Algorithm 965: RIDC Methods: A Family of Parallel Time Integrators.",
            "ADiJaC - Automatic Differentiation of Java Classfiles.",
            "Stability and Performance of Various Singular Value QR Implementations on Multicore CPU with a GPU.",
            "Pipelined Iterative Solvers with Kernel Fusion for Graphics Processing Units.",
            "Analytical Modeling Is Enough for High-Performance BLIS.",
            "Implementing Multifrontal Sparse Solvers for Multicore Architectures with Sequential Task Flow Runtime Systems.",
            "Topology-Oriented Incremental Algorithm for the Robust Construction of the Voronoi Diagrams of Disks.",
            "A Note on Performance Profiles for Benchmarking Software.",
            "Algorithm 966: A Practical Iterative Algorithm for the Art Gallery Problem Using Integer Linear Programming.",
            "Algorithm 967: A Distributed-Memory Fast Multipole Method for Volume Potentials.",
            "Systematic Alias Sampling: An Efficient and Low-Variance Way to Sample from a Discrete Distribution.",
            "Parallel Memory-Efficient Adaptive Mesh Refinement on Structured Triangular Meshes with Billions of Grid Cells.",
            "IEEE754 Precision-k base-β Arithmetic Inherited by Precision-m Base-β Arithmetic for k < m.",
            "PSelInv - A Distributed Memory Parallel Algorithm for Selected Inversion: The Symmetric Case.",
            "GPU-Accelerated Generation of Correctly Rounded Elementary Functions.",
            "An Efficient Representation Format for Fuzzy Intervals Based on Symmetric Membership Functions.",
            "Firedrake: Automating the Finite Element Method by Composing Abstractions.",
            "Algorithm 968: DISODE45: A Matlab Runge-Kutta Solver for Piecewise Smooth IVPs of Filippov Type.",
            "Algorithm 969: Computation of the Incomplete Gamma Function for Negative Values of the Argument.",
            "Algorithm 970: Optimizing the NIST Statistical Test Suite and the Berlekamp-Massey Algorithm.",
            "Algorithm 971: An Implementation of a Randomized Algorithm for Principal Component Analysis.",
            "Algorithm 972: jMarkov: An Integrated Framework for Markov Chain Modeling.",
            "Sparse Matrix-Vector Multiplication on GPGPUs.",
            "Parallel Minimum Norm Solution of Sparse Block Diagonal Column Overlapped Underdetermined Systems.",
            "BiqCrunch: A Semidefinite Branch-and-Bound Method for Solving Binary Quadratic Problems.",
            "Chopping a Chebyshev Series.",
            "Certified Roundoff Error Bounds Using Semidefinite Programming.",
            "Algorithmic Differentiation of Code with Multiple Context-Specific Activities.",
            "The State-of-the-Art of Preconditioners for Sparse Linear Least-Squares Problems.",
            "Algorithm 973: Extended Rational Fejér Quadrature Rules Based on Chebyshev Orthogonal Rational Functions.",
            "Algorithm 974: The OutlierLib - A MATLAB Library for Outliers' Detection.",
            "Remark on Algorithm 936: A Fortran Message Processor."
        ]
    },
    {
        "name": "TOMS",
        "year": "2016",
        "info": "Volume 42: 2016",
        "count": 34,
        "papers": [
            "A Sparse Symmetric Indefinite Direct Solver for GPU Architectures.",
            "Replicated Computational Results (RCR) Report for A Sparse Symmetric Indefinite Direct Solver for GPU Architectures.",
            "Sampling Exactly from the Normal Distribution.",
            "Testing Matrix Function Algorithms Using Identities.",
            "ShearLab 3D: Faithful Digital Shearlet Transforms Based on Compactly Supported Shearlets.",
            "Parameterized Complexity of Discrete Morse Theory.",
            "Algorithm 955: Approximation of the Inverse Poisson Cumulative Distribution Function.",
            "Algorithm 956: PAMPAC, A Parallel Adaptive Method for Pseudo-Arclength Continuation.",
            "Algorithm 957: Evaluation of the Repeated Integral of the Coerror Function by Half-Range Gauss-Hermite Quadrature.",
            "Remark on \"Algorithm 673: Dynamic Huffman Coding\".",
            "A Source Transformation via Operator Overloading Method for the Automatic Differentiation of Mathematical Functions in MATLAB.",
            "The BLIS Framework: Experiments in Portability.",
            "A Competitive Divide-and-Conquer Algorithm for Unconstrained Large-Scale Black-Box Optimization.",
            "What are the Correct Results for the Special Values of the Operands of the Power Operation?",
            "Algorithm 958: Lattice Builder: A General Software Tool for Constructing Rank-1 Lattice Rules.",
            "Algorithm 959: VBF: A Library of C++ Classes for Vector Boolean Functions in Cryptography.",
            "PUMI: Parallel Unstructured Mesh Infrastructure.",
            "KBLAS: An Optimized Library for Dense Matrix-Vector Multiplication on GPU Accelerators.",
            "A Radix-Independent Error Analysis of the Cornea-Harrison-Tang Method.",
            "Matrix Multiplication Over Word-Size Modular Rings Using Approximate Formulas.",
            "A Parallel Geometric Multifrontal Solver Using Hierarchically Semiseparable Structure.",
            "An Efficient Hybrid Algorithm for the Separable Convex Quadratic Knapsack Problem.",
            "Algorithm 960: POLYNOMIAL: An Object-Oriented Matlab Library of Fast and Efficient Algorithms for Polynomials.",
            "Algorithm 961: Fortran 77 Subroutines for the Solution of Skew-Hamiltonian/Hamiltonian Eigenproblems.",
            "Algorithm 962: BACOLI: B-spline Adaptive Collocation Software for PDEs with Interpolation-Based Spatial Error Control.",
            "Remark on \"Algorithm 916: Computing the Faddeyeva and Voigt Functions\": Efficiency Improvements and Fortran Translation.",
            "A Distributed-Memory Package for Dense Hierarchically Semi-Separable Matrix Computations Using Randomization.",
            "Replicated Computational Results (RCR) Report for \"A Distributed-Memory Package for Dense Hierarchically Semi-Separable Matrix Computations Using Randomization\".",
            "Matslise 2.0: A Matlab Toolbox for Sturm-Liouville Computations.",
            "An Experimental Exploration of Marsaglia's xorshift Generators, Scrambled.",
            "Manycore Algorithms for Batch Scalar and Block Tridiagonal Solvers.",
            "Discrete Wavelet Transforms in the Large Time-Frequency Analysis Toolbox for MATLAB/GNU Octave.",
            "Algorithm 963: Estimation of Stochastic Covariance Models using a Continuum of Moment Conditions.",
            "Algorithm 964: An Efficient Algorithm to Compute the Genus of Discrete Surfaces and Applications to Turbulent Flows."
        ]
    },
    {
        "name": "TOMS",
        "year": "2014",
        "info": "Volume 41: 2014/2015",
        "count": 30,
        "papers": [
            "GPOPS-II: A MATLAB Software for Solving Multiple-Phase Optimal Control Problems Using hp-Adaptive Gaussian Quadrature Collocation Methods and Sparse Nonlinear Programming.",
            "A Comparison of hp-Adaptive Strategies for Elliptic Partial Differential Equations.",
            "A Parallel Sparse Direct Solver via Hierarchical DAG Scheduling.",
            "StaRMAP - A Second Order Staggered Grid Method for Spherical Harmonics Moment Equations of Radiative Transfer.",
            "Algorithm 947: Paraperm - Parallel Generation of Random Permutations with MPI.",
            "Solving Boundary Integral Problems with BEM++.",
            "On the Error of Computing ab+cd using Cornea, Harrison and Tang's Method.",
            "Solving Basis Pursuit: Heuristic Optimality Check and Solver Comparison.",
            "DAESA - A Matlab Tool for Structural Analysis of Differential-Algebraic Equations: Theory.",
            "FSAIPACK: A Software Package for High-Performance Factored Sparse Approximate Inverse Preconditioning.",
            "TetGen, a Delaunay-Based Quality Tetrahedral Mesh Generator.",
            "Algorithm 948: DAESA - A Matlab Tool for Structural Analysis of Differential-Algebraic Equations: Software.",
            "Editorial: ACM TOMS Replicated Computational Results Initiative.",
            "BLIS: A Framework for Rapidly Instantiating BLAS Functionality.",
            "Replicated Computational Results (RCR) Report for \"BLIS: A Framework for Rapidly Instantiating BLAS Functionality\".",
            "Numerical Integration of Discontinuous Functions in Many Dimensions.",
            "odeToJava: A PSE for the Numerical Solution of IVPs.",
            "Reliable Generation of High-Performance Matrix Algebra.",
            "Complex Root Finding Algorithm Based on Delaunay Triangulation.",
            "Algorithm 949: MATLAB Tools for HDG in Three Dimensions.",
            "Algorithm 950: Ncpol2sdpa - Sparse Semidefinite Programming Relaxations for Polynomial Optimization Problems of Noncommuting Variables.",
            "Remark on Algorithm 897: VTDIRECT95: Serial and Parallel Codes for the Global Optimization Algorithm DIRECT.",
            "CGALmesh: A Generic Framework for Delaunay Mesh Generation.",
            "Efficient Calculations of Faithfully Rounded l2-Norms of n-Vectors.",
            "Optimizing Sparse Matrix - Matrix Multiplication for the GPU.",
            "Algorithmic Differentiation of Numerical Methods: Tangent and Adjoint Solvers for Parameterized Systems of Nonlinear Equations.",
            "Algorithm 951: Cayley Analysis of Mechanism Configuration Spaces using CayMos: Software Functionalities and Architecture.",
            "Algorithm 952: PHquintic: A Library of Basic Functions for the Construction and Analysis of Planar Quintic Pythagorean-Hodograph Curves.",
            "Algorithm 953: Parallel Library Software for the Multishift QR Algorithm with Aggressive Early Deflation.",
            "Algorithm 954: An Accurate and Efficient Cubic and Quartic Equation Solver for Physical Applications."
        ]
    },
    {
        "name": "TOMS",
        "year": "2013",
        "info": "Volume 40: 2013/2014",
        "count": 31,
        "papers": [
            "ColPack: Software for graph coloring and related problems in scientific computing.",
            "CHEBINT: A MATLAB/Octave toolbox for fast multivariate integration and interpolation based on chebyshev approximations over hypercubes.",
            "gHull: A GPU algorithm for 3D convex hull.",
            "Pivoting strategies for tough sparse indefinite systems.",
            "Algorithm 931: An algorithm and software for computing multiplicity structures at zeros of nonlinear systems.",
            "Algorithm 932: PANG: Software for nonmatching grid projections in 2D and 3D with linear complexity.",
            "Algorithm 933: Reliable calculation of numerical rank, null space bases, pseudoinverse solutions, and basic solutions using suitesparseQR.",
            "Algorithm 934: Fortran 90 subroutines to compute Mathieu functions for complex values of the parameter.",
            "Unified form language: A domain-specific language for weak formulations of partial differential equations.",
            "Computing the sparsity pattern of Hessians using automatic differentiation.",
            "How do you compute the midpoint of an interval?",
            "Optimally packed chains of bulges in multishift QR algorithms.",
            "A parallel implementation of Davidson methods for large-scale eigenvalue problems in SLEPc.",
            "Algorithm 935: IIPBF, a MATLAB toolbox for infinite integral of products of two Bessel functions.",
            "Algorithm 936: A Fortran message processor.",
            "Algorithm 937: MINRES-QLP for symmetric and Hermitian linear equations and least-squares problems.",
            "Algorithm 938: Compressing circular buffers.",
            "Restructuring the Tridiagonal and Bidiagonal QR Algorithms for Performance.",
            "A Pthreads Wrapper for Fortran 2003.",
            "Algorithm 939: Computation of the Marcum Q-Function.",
            "Algorithm 940: Optimal Accumulator-Based Expression Evaluation through the Use of Expression Templates.",
            "Algorithm 941: htucker - A Matlab Toolbox for Tensors in Hierarchical Tucker Format.",
            "Algorithm 942: Semi-Stencil.",
            "HSL_MI28: An Efficient and Robust Limited-Memory Incomplete Cholesky Factorization Code.",
            "High-Performance Evaluation of Finite Element Variational Forms via Commuting Diagrams and Duality.",
            "Fast Reverse-Mode Automatic Differentiation using Expression Templates in C++.",
            "Computing Petaflops over Terabytes of Data: The Case of Genome-Wide Association Studies.",
            "Algorithm 943: MSS: MATLAB Software for L-BFGS Trust-Region Subproblems for Large-Scale Optimization.",
            "Algorithm 944: Talbot Suite: Parallel Implementations of Talbot's Method for the Numerical Inversion of Laplace Transforms.",
            "Algorithm 945: modred - A Parallelized Model Reduction Library.",
            "Algorithm 946: ReLIADiff - A C++ Software Package for Real Laplace Transform Inversion based on Algorithmic Differentiation."
        ]
    },
    {
        "name": "TOMS",
        "year": "2012",
        "info": "Volume 39: 2012/2013",
        "count": 28,
        "papers": [
            "Graph-Based Software Design for Managing Complexity and Enabling Concurrency in Multiphysics PDE Software.",
            "Families of Algorithms for Reducing a Matrix to Condensed Form.",
            "PyDEC: Software and Algorithms for Discretization of Exterior Calculus.",
            "Computing the Crosscap Number of a Knot Using Integer Programming and Normal Surfaces.",
            "Algorithm 924: TIDES, a Taylor Series Integrator for Differential EquationS.",
            "Algorithm 925: Parallel Solver for Semidefinite Programming Problem having Sparse Schur Complement Matrix.",
            "NLEVP: A Collection of Nonlinear Eigenvalue Problems.",
            "Accelerating Linear System Solutions Using Randomization Techniques.",
            "Level-3 Cholesky Factorization Routines Improve Performance of Many Cholesky Algorithms.",
            "Finite Element Integration on GPUs.",
            "A Runge-Kutta BVODE Solver with Global Error and Defect Control.",
            "Variants of Mersenne Twister Suitable for Graphic Processors.",
            "Elemental: A New Framework for Distributed Memory Dense Matrix Computations.",
            "Algorithm 926: Incomplete Gamma Functions with Negative Arguments.",
            "Algorithm 927: The MATLAB Code bvptwp.m for the Numerical Solution of Two Point Boundary Value Problems.",
            "High-performance bidiagonal reduction using tile algorithms on homogeneous multicore architectures.",
            "An efficient overloaded method for computing derivatives of mathematical functions in MATLAB.",
            "An algorithm for the complete solution of quadratic eigenvalue problems.",
            "Efficient generalized Hessenberg form and applications.",
            "The Tapenade automatic differentiation tool: Principles, model, and specification.",
            "Algorithm 928: A general, parallel implementation of dantzig-wolfe decomposition.",
            "Scaling LAPACK panel operations using parallel cache assignment.",
            "Evaluating an element of the Clarke generalized Jacobian of a composite piecewise differentiable function.",
            "Reducing the influence of tiny normwise relative errors on performance profiles.",
            "On Ziv's rounding test.",
            "Optimized code generation for finite element local assembly using symbolic manipulation.",
            "Algorithm 929: A suite on wavelet differentiation algorithms.",
            "Algorithm 930: FACTORIZE: An object-oriented linear system solver for MATLAB."
        ]
    },
    {
        "name": "TOMS",
        "year": "2011",
        "info": "Volume 38: 2011/2012",
        "count": 30,
        "papers": [
            "The university of Florida sparse matrix collection.",
            "Exploiting parallelism in matrix-computation kernels for symmetric multiprocessor systems: Matrix-multiplication and matrix-addition algorithm optimizations by software pipelining and threads allocation.",
            "Computing the volume of a union of balls: A certified algorithm.",
            "High-performance up-and-downdating via householder-like transformations.",
            "Algorithm 913: An elegant IDR(s) variant that efficiently exploits biorthogonality properties.",
            "Algorithm 914: Parabolic cylinder function W(a, x) and its derivative.",
            "Remark on \"algorithm 778: L-BFGS-B: Fortran subroutines for large-scale bound constrained optimization\".",
            "Algorithm 915, SuiteSparseQR: Multifrontal multithreaded rank-revealing sparse QR factorization.",
            "Corrigendum: Algorithm 902: GPOPS, a MATLAB software for solving multiple-phase optimal control problems using the gauss pseudospectral method.",
            "Partial factorization of a dense symmetric indefinite matrix.",
            "Validated computation of certain hypergeometric functions.",
            "A note on shifted Hessenberg systems and frequency response computation.",
            "Design, implementation, and analysis of maximum transversal algorithms.",
            "Algorithms and data structures for massively parallel generic adaptive finite element codes.",
            "Algorithm 916: Computing the Faddeyeva and Voigt Functions.",
            "Using Multicomplex Variables for Automatic Computation of High-Order Derivatives.",
            "Parallel and Cache-Efficient In-Place Matrix Storage Format Conversion.",
            "Interactive Initialization and Continuation of Homoclinic and Heteroclinic Orbits in MATLAB.",
            "Estimating Derivatives of Noisy Simulations.",
            "Algorithm 917: Complex Double-Precision Evaluation of the Wright ω Function.",
            "Algorithm 918: specdicho: A MATLAB Program for the Spectral Dichotomy of Regular Matrix Pencils.",
            "Algorithm 919: A Krylov Subspace Algorithm for Evaluating the ϕ-Functions Appearing in Exponential Integrators.",
            "Object-Oriented Techniques for Sparse Matrix Computations in Fortran 2003.",
            "An Empirical Analysis of the Performance of Preconditioners for SPD Systems.",
            "A Runtime System for Programming Out-of-Core Matrix Algorithms-by-Tiles on Multithreaded Architectures.",
            "Automatic Fréchet Differentiation for the Numerical Solution of Boundary-Value Problems.",
            "Algorithm 920: SFSDP: A Sparse Version of Full Semidefinite Programming Relaxation for Sensor Network Localization Problems.",
            "Algorithm 921: alphaCertified: Certifying Solutions to Polynomial Systems.",
            "Algorithm 922: A Mixed Finite Element Method for Helmholtz Transmission Eigenvalues.",
            "Algorithm 923: Efficient Numerical Computation of the Pfaffian for Dense and Banded Skew-Symmetric Matrices."
        ]
    },
    {
        "name": "TOMS",
        "year": "2010",
        "info": "Volume 37: 2010/2011",
        "count": 47,
        "papers": [
            "ScaLAPACK's MRRR algorithm.",
            "Certification of bounds on expressions involving rounded operators.",
            "Design patterns for multiphysics modeling in Fortran 2003 and C++.",
            "Computing correctly rounded integer powers in floating-point arithmetic.",
            "Singularity-free evaluation of collapsed-coordinate orthogonal polynomials.",
            "On the efficiency of symbolic computations combined with code generation for finite element methods.",
            "Cache-optimal algorithms for option pricing.",
            "Optimizations for quadrature representations of finite element tensors through automated code generation.",
            "Algorithm 898: Efficient multiplication of dense matrices over GF(2).",
            "Algorithm 899: The Matlab postprocessing toolkit.",
            "Algorithm 900: A discrete time Kalman filter package for large scale problems.",
            "Algorithm 901: LMEF - A program for the construction of linear multistep methods with exponential fitting for the numerical solution of ordinary differential equations.",
            "EFCOSS: An interactive environment facilitating optimal experimental design.",
            "Efficient controls for finitely convergent sequential algorithms.",
            "Stepsize selection for ordinary differential equations.",
            "Efficient and formally proven reduction of large integers by small moduli.",
            "A fast and robust mixed-precision solver for the solution of sparse symmetric linear systems.",
            "Rectangular full packed format for cholesky's algorithm: factorization, solution, and inversion.",
            "Scaling and pivoting in an out-of-core sparse direct solver.",
            "DOLFIN: Automated finite element computing.",
            "PRIMME: preconditioned iterative multimethod eigensolver - methods and software description.",
            "Algorithm 902: GPOPS, A MATLAB software for solving multiple-phase optimal control problems using the gauss pseudospectral method.",
            "Algorithm 903: FRB-Fortran routines for the exact computation of free rigid body motions.",
            "Computing Tutte Polynomials.",
            "A Code Based on the Two-Stage Runge-Kutta Gauss Formula for Second-Order Initial Value Problems.",
            "Increasing the Reliability of Adaptive Quadrature Using Explicit Interpolants.",
            "Adaptive Projection Subspace Dimension for the Thick-Restart Lanczos Method.",
            "Unified Tables for Exponential and Logarithm Families.",
            "An Interoperable, Data-Structure-Neutral Component for Mesh Query and Manipulation.",
            "MLD2P4: A Package of Parallel Algebraic Multilevel Domain Decomposition Preconditioners in Fortran 95.",
            "Parallel Colt: A High-Performance Java Library for Scientific Computing and Image Processing.",
            "Parallel Solvers for Sylvester-Type Matrix Equations with Applications in Condition Estimation, Part I: Theory and Algorithms.",
            "Algorithm 904: The SCASY Library - Parallel Solvers for Sylvester-Type Matrix Equations with Applications in Condition Estimation, Part II.",
            "Algorithm 905: Modified Shepard Algorithm for Interpolation of Scattered Multivariate Data.",
            "Algorithm 906: elrint3d - A Three-Dimensional Nonadaptive Automatic Cubature Routine Using a Sequence of Embedded Lattice Rules.",
            "Algorithm 907: KLU, A Direct Sparse Solver for Circuit Simulation Problems.",
            "Algorithm 908: Online Exact Summation of Floating-Point Streams.",
            "Partitioned Triangular Tridiagonalization.",
            "Solving Very Sparse Rational Systems of Equations.",
            "SelInv - An Algorithm for Selected Inversion of a Sparse Symmetric Matrix.",
            "Costas Arrays: Survey, Standardization, and MATLAB Toolbox.",
            "An Optimal Iterative Solver for Symmetric Indefinite Systems Stemming from Mixed Approximation.",
            "A Supernodal Approach to Incomplete LU Factorization with Partial Pivoting.",
            "Algorithm 909: NOMAD: Nonlinear Optimization with the MADS Algorithm.",
            "Algorithm 910: A Portable C++ Multiple-Precision System for Special-Function Calculations.",
            "Algorithm 911: Multiple-Precision Exponential Integral and Related Functions.",
            "Algorithm 912: A Module for Calculating Cylindrical Functions of Complex Order and Complex Argument."
        ]
    },
    {
        "name": "TOMS",
        "year": "2009",
        "info": "Volume 36: 2009",
        "count": 22,
        "papers": [
            "A numerical evaluation of preprocessing and ILU-type preconditioners for the solution of unsymmetric sparse linear systems using iterative methods.",
            "SBA: A software package for generic sparse bundle adjustment.",
            "Adaptive Winograd's matrix multiplications.",
            "Data structures and requirements for hp finite element software.",
            "Algorithm 891: A fortran virtual memory system.",
            "Algorithm 892: DISPMODULE, a Fortran 95 module for pretty-printing matrices.",
            "Algorithm 893: TSPACK: tension spline package for curve design and data fitting.",
            "A software framework for abstract expression of coordinate-free linear algebra and optimization algorithms.",
            "An out-of-core sparse Cholesky solver.",
            "KSSOLV - a MATLAB toolbox for solving the Kohn-Sham equations.",
            "Distributed SBP Cholesky factorization algorithms with near-optimal scheduling.",
            "Algorithm 894: On a block Schur-Parlett algorithm for phi-functions based on the sep-inverse estimate.",
            "Anasazi software for the numerical solution of large-scale eigenvalue problems.",
            "Programming matrix algorithms-by-blocks for thread-level parallelism.",
            "Algorithm 895: A continued fractions package for special functions.",
            "Algorithm 896: LSA: Algorithms for large-scale optimization.",
            "Algorithm 897: VTDIRECT95: Serial and parallel codes for the global optimization algorithm direct.",
            "An Object-Oriented Design for Two-Dimensional Vortex Particle Methods.",
            "Using NFFT 3 - A Software Library for Various Nonequispaced Fast Fourier Transforms.",
            "pyMDO: An Object-Oriented Framework for Multidisciplinary Design Optimization.",
            "Accurate Numerical Integration of Perturbed Oscillatory Systems in Two Frequencies.",
            "C++ Bindings to External Software Libraries with Examples from BLAS, LAPACK, UMFPACK, and MUMPS."
        ]
    },
    {
        "name": "TOMS",
        "year": "2008",
        "info": "Volume 35: 2008/2009",
        "count": 29,
        "papers": [
            "Hybrid differentiation strategies for simulation and analysis of applications in C++.",
            "Optimal vertex elimination in single-expression-use graphs.",
            "Families of algorithms related to the inversion of a Symmetric Positive Definite matrix.",
            "High-performance implementation of the level-3 BLAS.",
            "Evaluating exact VARMA likelihood and its gradient when data are incomplete.",
            "Algorithm 878: Exact VARMA likelihood and its gradient for complete and incomplete data with Matlab.",
            "Algorithm 879: EIGENTEST - a test matrix generator for large-scale eigenproblems.",
            "Algorithm 880: A testing infrastructure for symmetric tridiagonal eigensolvers.",
            "SNOBFIT - Stable Noisy Optimization by Branch and Fit.",
            "Benchmarking Domain-Specific Compiler Optimizations for Variational Forms.",
            "Updating an LU Factorization with Pivoting.",
            "On the Failure of Rank-Revealing QR Factorization Software - A Case Study.",
            "Algorithm 881: A Set of Flexible GMRES Routines for Real and Complex Arithmetics on High-Performance Computers.",
            "Algorithm 882: Near-Best Fixed Pole Rational Interpolation with Applications in Spectral Methods.",
            "Algorithm 883: SparsePOP - A Sparse Semidefinite Programming Relaxation of Polynomial Optimization Problems.",
            "Algorithm 884: A Simple Matlab Implementation of the Argyris Element.",
            "Algorithms and Data Structures for Multi-Adaptive Time-Stepping.",
            "CGMN Revisited: Robust and Efficient Solution of Stiff Linear Systems Derived from Elliptic Partial Differential Equations.",
            "Dense Linear Algebra over Word-Size Prime Fields: the FFLAS and FFPACK Packages.",
            "Algorithm 885: Computing the Logarithm of the Normal Distribution.",
            "Algorithm 886: Padua2D - Lagrange Interpolation at Padua Points on Bivariate Domains.",
            "Algorithm 887: CHOLMOD, Supernodal Sparse Cholesky Factorization and Update/Downdate.",
            "Algorithm 888: Spherical Harmonic Transform Algorithms.",
            "Algorithm 889: Jet_fitting_3: - A Generic C++ Package for Estimating the Differential Properties on Sampled Surfaces via Polynomial Fitting.",
            "A Standard and Software for Numerical Metadata.",
            "CONTEST: A Controllable Test Matrix Toolbox for MATLAB.",
            "Dynamic Supernodes in Sparse Cholesky Update/Downdate and Triangular Solves.",
            "Extra-Precise Iterative Refinement for Overdetermined Least Squares Problems.",
            "Algorithm 890: Sparco: A Testing Framework for Sparse Reconstruction."
        ]
    },
    {
        "name": "TOMS",
        "year": "2008",
        "info": "Volume 34: 2008",
        "count": 22,
        "papers": [
            "Block variants of Hammarling's method for solving Lyapunov equations.",
            "A grid-free abstraction of the Navier-Stokes equations in Fortran 95/2003.",
            "Computing sparse Hessians with automatic differentiation.",
            "Algorithm 870: A static geometric Medial Axis domain decomposition in 2D Euclidean space.",
            "Algorithm 871: A C/C++ precompiler for autogeneration of multiprecision programs.",
            "Algorithm 872: Parallel 2D constrained Delaunay mesh generation.",
            "PyTrilinos: High-performance distributed-memory solvers for Python.",
            "Parallel unsymmetric-pattern multifrontal sparse LU with column preordering.",
            "On the design of interfaces to sparse direct solvers.",
            "Scalable parallelization of FLAME code via the workqueuing model.",
            "Algorithm 873:: LSTRS: MATLAB software for large-scale trust-region subproblems and regularization.",
            "Anatomy of high-performance matrix multiplication.",
            "An event-driven method to simulate Filippov systems with accurate computing of sliding motions.",
            "Cache efficient bidiagonalization using BLAS 2.5 operators.",
            "Algorithm 874: BACOLR - spatial and temporal error control software for PDEs based on high-order adaptive collocation.",
            "Algorithm 875: DSDP5 - software for semidefinite programming.",
            "Using Mixed Precision for Sparse Matrix Computations to Enhance the Performance while Achieving 64-bit Accuracy.",
            "OpenAD/F: A Modular Open-Source Tool for Automatic Differentiation of Fortran Codes.",
            "Efficient Contouring on Unstructured Meshes for Partial Differential Equations.",
            "An Implementation and Evaluation of the AMLS Method for Sparse Eigenvalue Problems.",
            "Algorithm 876: Solving Fredholm Integral Equations of the Second Kind in Matlab.",
            "Algorithm 877: A Subroutine Package for Cylindrical Functions of Complex Order and Nonnegative Argument."
        ]
    },
    {
        "name": "TOMS",
        "year": "2007",
        "info": "Volume 33: 2007",
        "count": 28,
        "papers": [
            "Robust and reliable defect control for Runge-Kutta methods.",
            "Complex standard functions and their implementation in the CoStLy library.",
            "FILTRANE, a Fortran 95 filter-trust-region package for solving nonlinear least-squares and nonlinear feasibility problems.",
            "EXPINT - A MATLAB package for exponential integrators.",
            "Using dense storage to solve small sparse linear systems.",
            "Algorithm 863: L2WPMA, a Fortran 77 package for weighted least-squares piecewise monotonic data approximation.",
            "Algorithm 864: General and robot-packable variants of the three-dimensional bin packing problem.",
            "Algorithm 865: Fortran 95 subroutines for Cholesky factorization in block hybrid format.",
            "SIPs: Shift-and-invert parallel spectral transformations.",
            "A numerical evaluation of sparse direct solvers for the solution of large sparse symmetric linear systems of equations.",
            "Using the GA and TAO toolkits for solving large-scale optimization problems on parallel computers.",
            "OPT++: An object-oriented toolkit for nonlinear optimization.",
            "MPFR: A multiple-precision binary floating-point library with correct rounding.",
            "Algorithm 866: IFISS, a Matlab toolbox for modelling incompressible flow.",
            "Remark on algorithm 515: Generation of a vector from the lexicographical index combinations.",
            "An accurate nonuniform fourier transform for SPRITE magnetic resonance imaging data.",
            "Efficient compilation of a class of variational forms.",
            "Experiences of sparse direct symmetric solvers.",
            "Efficient Gauss-related quadrature for two classes of logarithmic weight functions.",
            "Algorithm 867: QUADLOG - a package of routines for generating Gauss-related quadrature for two classes of logarithmic weight functions.",
            "Algorithm 868: Globally doubly adaptive quadrature - reliable Matlab codes.",
            "TestU01: A C library for empirical testing of random number generators.",
            "hpGEM - A software framework for discontinuous Galerkin finite element methods.",
            "deal.II - A general-purpose object-oriented finite element library.",
            "A parallel symmetric block-tridiagonal divide-and-conquer algorithm.",
            "Accurate numerical derivatives in MATLAB.",
            "Algorithm 869: ODRPACK95: A weighted orthogonal distance regression code with bound constraints.",
            "Remark on Algorithm 644."
        ]
    },
    {
        "name": "TOMS",
        "year": "2006",
        "info": "Volume 32: 2006",
        "count": 34,
        "papers": [
            "Improved long-period generators based on linear recurrences modulo 2.",
            "Constructing memory-minimizing schedules for multifrontal methods.",
            "Nonorthogonal decomposition of binary matrices for bounded-error data compression and analysis.",
            "Computing the real parabolic cylinder functions U(a, x), V(a, x).",
            "Algorithm 850: Real parabolic cylinder functions U(a, x), V(a, x).",
            "Algorithm 851: CG_DESCENT, a conjugate gradient method with guaranteed descent.",
            "Algorithm 852: RealPaver: an interval solver using constraint satisfaction techniques.",
            "Algorithm 853: An efficient algorithm for solving rank-deficient least squares problems.",
            "Remark on Algorithm 815: FORTRAN subroutines for computing approximate solutions of feedback set problems using GRASP.",
            "Accumulating Householder transformations, revisited.",
            "Improving the performance of reduction to Hessenberg form.",
            "An efficient overloaded implementation of forward mode automatic differentiation in MATLAB.",
            "Optimizing FIAT with level 3 BLAS.",
            "Computing machine-efficient polynomial approximations.",
            "Sequential reservoir sampling with a nonuniform distribution.",
            "A matlab package for automatically generating Runge-Kutta trees, order conditions, and truncation error coefficients.",
            "FILIB++, a fast interval library supporting containment computations.",
            "Error bounds from extra-precise iterative refinement.",
            "Algorithm 854: Fortran 77 subroutines for computing the eigenvalues of Hamiltonian matrices II.",
            "N-body simulations: The performance of some integrators.",
            "An object-oriented framework for the development of scalable parallel multilevel preconditioners.",
            "A compiler for variational forms.",
            "An out-of-core sparse symmetric-indefinite factorization method.",
            "Algorithm 855: Subroutines for the computation of Mathieu characteristic numbers and their general orders.",
            "Algorithm 856: APPSPACK 4.0: asynchronous parallel pattern search for derivative-free optimization.",
            "Inverting the symmetrical beta distribution.",
            "Block algorithms for reordering standard and generalized schur forms.",
            "The design and implementation of the MRRR algorithm.",
            "Algorithm 857: POLSYS_GLP - a parallel general linear product homotopy code for solving polynomial systems of equations.",
            "Algorithm 858: Computing infinite range integrals of an arbitrary product of bessel functions.",
            "Algorithm 859: BABDCR - a Fortran 90 package for the solution of bordered ABD linear systems.",
            "Algorithm 860: SimpleS---an extension of Freudenthal's simplex subdivision.",
            "Algorithm 861: Fortran 90 subroutines for computing the expansion coefficients of Mathieu functions using Blanch's algorithm.",
            "Algorithm 862: MATLAB tensor classes for fast algorithm prototyping."
        ]
    },
    {
        "name": "TOMS",
        "year": "2005",
        "info": "Volume 31: 2005",
        "count": 30,
        "papers": [
            "The science of deriving dense linear algebra algorithms.",
            "Representing linear algebra algorithms in code: the FLAME application program interfaces.",
            "Parallel out-of-core computation and updating of the QR factorization.",
            "Using AD to solve BVPs in MATLAB.",
            "SlideCont: An auto97 driver for bifurcation analysis of filippov systems.",
            "SFCGen: A framework for efficient generation of multi-dimensional space-filling curves by recursion.",
            "Algorithm 840: computation of grid points, quadrature weights and derivatives for spectral element methods using prolate spheroidal wave functions - prolate elements.",
            "Algorithm 841: BHESS: Gaussian reduction to a similar banded hessenberg form.",
            "Implementation of hierarchical bases in FEMLAB for simplicial elements.",
            "A fully portable high performance minimal storage hybrid format cholesky algorithm.",
            "Algorithm 842: A set of GMRES routines for real and complex arithmetics on high performance computers.",
            "Algorithm 843: Improvements to the schwarz--christoffel toolbox for MATLAB.",
            "Algorithm 844: Computing sparse reduced-rank approximations to sparse matrices.",
            "Algorithm 845: EIGIFP: a MATLAB program for solving large symmetric generalized eigenvalue problems.",
            "Introduction to the special issue on the Advanced CompuTational Software (ACTS) collection.",
            "An overview of the Advanced CompuTational Software (ACTS) collection.",
            "An overview of SuperLU: Algorithms, implementation, and user interface.",
            "Pursuing scalability for hypre's conceptual interfaces.",
            "SLEPc: A scalable and flexible toolkit for the solution of eigenvalue problems.",
            "SUNDIALS: Suite of nonlinear and differential/algebraic equation solvers.",
            "An overview of the Trilinos project.",
            "FEMSTER: An object-oriented class library of high-order discrete differential forms.",
            "A differentiation-enabled fortran 95 compiler.",
            "DFTI---a new interface for fast fourier transform libraries.",
            "PDE.Mart: A network-based problem-solving environment for PDEs.",
            "MATSLISE: A MATLAB package for the numerical solution of sturm-liouville and schrödinger equations.",
            "Algorithm 846: MixedVol: a software package for mixed-volume computation.",
            "Algorithm 847: Spinterp: piecewise multilinear hierarchical sparse grid interpolation in MATLAB.",
            "Algorithm 848: A recursive fixed-point algorithm for the infinity-norm case.",
            "Algorithm 849: A concise sparse cholesky factorization package."
        ]
    },
    {
        "name": "TOMS",
        "year": "2004",
        "info": "Volume 30: 2004",
        "count": 28,
        "papers": [
            "Two-step error estimators for implicit Runge-Kutta methods applied to stiff systems.",
            "The design and implementation of a new out-of-core sparse cholesky factorization method.",
            "SIPAMPL: Semi-infinite programming with AMPL.",
            "Vector reduction/transformation operators.",
            "Algorithm 830: Another visit with standard and modified givens transformations and a remark on algorithm 539.",
            "A parallel direct solver for large sparse highly unsymmetric linear systems.",
            "MA57 - a code for the solution of sparse symmetric definite and indefinite systems.",
            "Computing solutions of the modified Bessel differential equation for imaginary orders and positive arguments.",
            "Algorithm 831: Modified Bessel functions of imaginary order and positive argument.",
            "A column pre-ordering strategy for the unsymmetric-pattern multifrontal method.",
            "Algorithm 832: UMFPACK V4.3 - an unsymmetric-pattern multifrontal method.",
            "Algorithm 833: CSRFPACK - interpolation of scattered data with a C1 convexity-preserving surface.",
            "Algorithm 834: glsurf - an interactive surface plotting program using OpenGL.",
            "Algorithm 835: MultRoot - a Matlab package for computing polynomial roots and multiplicities.",
            "ProtoMol, an object-oriented framework for prototyping novel algorithms for molecular dynamics.",
            "Jacobian code generated by source transformation and vertex elimination can be as efficient as hand-coding.",
            "A numerical evaluation of HSL packages for the direct solution of large sparse, symmetric linear systems of equations.",
            "Block tridiagonalization of \"effectively\" sparse symmetric matrices.",
            "A column approximate minimum degree ordering algorithm.",
            "Algorithm 836: COLAMD, a column approximate minimum degree ordering algorithm.",
            "Algorithm 837: AMD, an approximate minimum degree ordering algorithm.",
            "Efficient scaling for complex division.",
            "Analysis and applications of Priest's distillation.",
            "Automating the implementation of Kalman filter algorithms.",
            "BACOL: B-spline adaptive collocation software for 1-D parabolic PDEs.",
            "Computation of complex Airy functions and their zeros using asymptotics and the differential equation.",
            "Algorithm 838: Airy Functions.",
            "Algorithm 839: FIAT, a new paradigm for computing finite element basis functions."
        ]
    },
    {
        "name": "TOMS",
        "year": "2003",
        "info": "Volume 29: 2003",
        "count": 26,
        "papers": [
            "Digital filters in adaptive time-stepping.",
            "Scalar fused multiply-add instructions produce floating-point matrix arithmetic provably accurate to the penultimate digit.",
            "Remark on algorithm 659: Implementing Sobol's quasirandom sequence generator.",
            "Object-oriented software for quadratic programming.",
            "Induced well-distributed sets in Riemannian spaces.",
            "Algorithm 823: Implementing scrambled digital sequences.",
            "SuperLU_DIST: A scalable distributed-memory sparse direct solver for unsymmetric linear systems.",
            "MATCONT: A MATLAB package for numerical bifurcation analysis of ODEs.",
            "GloptiPoly: Global optimization over polynomials with Matlab and SeDuMi.",
            "The spectral signal processing suite.",
            "Formal derivation of algorithms: The triangular sylvester equation.",
            "The complex-step derivative approximation.",
            "ACETAF: A software package for computing validated bounds for Taylor coefficients of analytic functions.",
            "Algorithm 824: CUBPACK: a package for automatic cubature; framework description.",
            "An adaptive numerical cubature algorithm for simplices.",
            "Algorithm 825: A deep-cut bisection envelope algorithm for fixed points.",
            "Algorithm 826: A parallel eigenvalue routine for complex Hessenberg matrices.",
            "Algorithm 827: irbleigs: A MATLAB program for computing a few eigenpairs of a large sparse Hermitian matrix.",
            "Remark on Algorithm 769: Fortran subroutines for approximate solution of sparse quadratic assignment problems using GRASP.",
            "GALAHAD, a library of thread-safe Fortran 90 packages for large-scale nonlinear optimization.",
            "CUTEr and SifDec: A constrained and unconstrained testing environment, revisited.",
            "Parallel frontal solvers for large sparse linear systems.",
            "Fast contouring of solutions to partial differential equations.",
            "Modeling the performance of interface contraction.",
            "Algorithm 828: DNSPLIN1: discrete nonlinear spline interpolation.",
            "Algorithm 829: Software for generation of classes of test functions with known local and global minima for global optimization."
        ]
    },
    {
        "name": "TOMS",
        "year": "2002",
        "info": "Volume 28: 2002",
        "count": 22,
        "papers": [
            "Numerical bifurcation analysis of delay differential equations using DDE-BIFTOOL.",
            "Efficient and automatic implementation of the adjoint state method.",
            "An extension of the divide-and-conquer method for a class of symmetric block-tridiagonal eigenproblems.",
            "Renovating the collected algorithms from ACM.",
            "Algorithm 816: r2d2lri: an algorithm for automatic two-dimensional cubature.",
            "Algorithm 817 P2MESH: generic object-oriented interface between 2-D unstructured meshes and FEM/FVM-based PDE solvers.",
            "Preface to the special issue on the basic linear algebra subprograms (BLAS).",
            "Design, implementation and testing of extended and mixed precision BLAS.",
            "On computing givens rotations reliably and efficiently.",
            "An overview of the sparse basic linear algebra subprograms: The new standard from the BLAS technical forum.",
            "Algorithm 818: A reference model implementation of the sparse BLAS in fortran 95.",
            "A comment on the presentation and testing of CALGO codes and a remark on algorithm 639: To integrate some infinite oscillating tails.",
            "Recent advances in direct methods for solving unsymmetric sparse systems of linear equations.",
            "Algorithm 819: AIZ, BIZ: two Fortran 77 routines for the computation of complex airy functions.",
            "Algorithm 820: A flexible implementation of matching pursuit for Gabor functions on the interval.",
            "Algorithm 821: A Fortran interface to POSIX threads.",
            "Remark on algorithm 705: A Fortran-77 software package for solving the Sylvester matrix equation AXBT + CXDT = E.",
            "Implementing Hager's exchange methods for matrix profile reduction.",
            "Recursive blocked algorithms for solving triangular systems - Part I: one-sided and coupled Sylvester-type matrix equations.",
            "Recursive blocked algorithms for solving triangular systems - Part II: two-sided and generalized Sylvester and Lyapunov matrix equations.",
            "Algorithm 822: GIZ, HIZ: two Fortran 77 routines for the computation of complex Scorer functions.",
            "A software package for sparse orthogonal factorization and updating."
        ]
    },
    {
        "name": "TOMS",
        "year": "2001",
        "info": "Volume 27: 2001",
        "count": 21,
        "papers": [
            "Solving systems of partial differential equations using object-oriented programming techniques with coupled heat and fluid flow as example.",
            "Estimation of parameters and eigenmodes of multivariate autoregressive models.",
            "Algorithm 808: ARfit - a matlab package for the estimation of parameters and eigenmodes of multivariate autoregressive models.",
            "A simple universal generator for continuous and discrete univariate T-concave distributions.",
            "Algorithm 809: PREQN: Fortran 77 subroutines for preconditioning the conjugate gradient method.",
            "A precision- and range-independent tool for testing floating-point arithmetric I: basic operations, square root, and remainder.",
            "A precision- and range-independent tool for testing floating-point arithmetic II: conversions.",
            "Algorithm 810: The SLEIGN2 Sturm-Liouville Code.",
            "Algorithm 811: NDA: algorithms for nondifferentiable optimization.",
            "A recursive formulation of Cholesky factorization of a matrix in packed storage.",
            "An automatic continuation strategy for the solution of singularly perturbed nonlinear boundary value problems.",
            "Algorithm 812: BPOLY: An object-oriented library of numerical algorithms for polynomials in Bernstein form.",
            "A BVP solver based on residual control and the Maltab PSE.",
            "Compression of particle data from hierarchical approximate methods.",
            "Algorithm 813: SPG - Software for Convex-Constrained Optimization.",
            "A revised simplex method with integer Q-matrices.",
            "A case study in the performance and scalability of optimization algorithms.",
            "Algorithm 814: Fortran 90 software for floating-point multiple precision arithmetic, gamma and related functions.",
            "Analysis and comparison of two general sparse solvers for distributed memory computers.",
            "FLAME: Formal Linear Algebra Methods Environment.",
            "Algorithm 815: FORTRAN subroutines for computing approximate solutions of feedback set problems using GRASP."
        ]
    },
    {
        "name": "TOMS",
        "year": "2000",
        "info": "Volume 26: 2000",
        "count": 32,
        "papers": [
            "NEOS and Condor: solving optimization problems over the Internet.",
            "Algorithm 799: revolve: an implementation of checkpointing for the reverse or adjoint mode of computational differentiation.",
            "Remark on Algorithm 761: scattered-data surface fitting that has the accuracy of a cubic polynomial.",
            "Algorithm 800: Fortran 77 subroutines for computing the eigenvalues of Hamiltonian matrices. I: the square-reduced method.",
            "Automatic sampling with the ratio-of-uniforms method.",
            "HPFBench: a high performance Fortran benchmark suite.",
            "ADMIT-1: automatic differentiation and MATLAB interface toolbox.",
            "Algorithm 801: POLSYS_PLP: a partitioned linear product homotopy code for solving polynomial systems of equations.",
            "Algorithm 802: an automatic generator for bivariate log-concave distributions.",
            "Editorial: special issue in honor of John Rice's 65th birthday.",
            "PYTHIA-II: a knowledge/database system for managing performance data and recommending scientific software.",
            "Mining and visualizing recommendation spaces for elliptic PDEs with continuous attributes.",
            "Accurate approximate solution of partial differential equations at off-mesh points.",
            "How to vectorize the algebraic multilevel iteration.",
            "Algorithm 803: a simpler macro processor.",
            "Superconvergent interpolants for collocation methods applied to mixed-order BVODEs.",
            "Remark on algorithm 746: new features of PCOMP, a Fortran code for automatic differentiation.",
            "A simple method for generating gamma variables.",
            "On stopping criteria in verified nonlinear systems or optimization algorithms.",
            "Algorithms for the computation of all Mathieu functions of integer orders.",
            "Algorithm 804: subroutines for the computation of Mathieu functions of integer orders.",
            "Algorithm 805: computation and uses of the semidiscrete matrix decomposition.",
            "Algorithm 806: SPRNG: a scalable library for pseudorandom number generation.",
            "A MATLAB differentiation matrix suite.",
            "An observation on bisection software for the symmetric tridiagonal eigenvalue problem.",
            "PSBLAS: a library for parallel linear algebra computation on sparse matrices.",
            "Band reduction algorithms revisited.",
            "Note on generalization in experimental algorithmics.",
            "A framework for symmetric band reduction.",
            "Algorithm 807: The SBR Toolbox - software for successive band reduction.",
            "Remark on algorithm 723: Fresnel integrals.",
            "Corrigendum: Algorithm 806: SPRNG: a scalable library for pseudorandom number generation."
        ]
    },
    {
        "name": "TOMS",
        "year": "1999",
        "info": "Volume 25: 1999",
        "count": 28,
        "papers": [
            "A combined unifrontal/multifrontal method for unsymmetric sparse matrices.",
            "A test package for Sturm-Liouville solvers.",
            "Algorithm 789: SLTSTPAK: : a test package for Sturm-Liouville solvers.",
            "Algorithm 790: CSHEP2D: cubic Shepard method for bivariate interpolation of scattered data.",
            "Algorithm 791: TSHEP2D: cosine series Shepard method for bivariate interpolation of scattered data.",
            "Algorithm 792: accuracy test of ACM algorithms for interpolation of scattered data in the plane.",
            "Remark on Algorithm 716.",
            "Remark on Algorithm 751.",
            "Remark on Algorithm 752.",
            "A note on the recursive calculation of incomplete gamma functions.",
            "Remark on Algorithm 702 - the updated truncated Newton minimization package.",
            "Self-adapting Fortran 77 machine constants: comment on Algorithm 528.",
            "Complex fans: a representation for vectors in polar form with interval attributes.",
            "An interface optimization and application for the numerical solution of optimal control problems.",
            "C++ classes for linking optimization with complex simulations.",
            "Algorithm 793: GQRAT - Gauss quadrature for rational functions.",
            "Algorithm 794: numerical Hankel transform by the Fortran program HANKEL.",
            "Algorithm 795: PHCpack: a general-purpose solver for polynomial systems by homotopy continuation.",
            "An implementation of a Fourier series method for the numerical inversion of the Laplace transform.",
            "Algorithm 796: a Fortran software package for the numerical inversion of the Laplace transform based on a Fourier series method.",
            "The RISC BLAS: a blocked implementation of level 3 BLAS for RISC processors.",
            "Algorithm 797: Fortran subroutines for approximate solution of graph planarization problems using GRASP.",
            "Algorithm 798: high-dimensional interpolation using the modified Shepard method.",
            "Beware of linear congruential generators with multipliers of the form a = ±2q ±2r.",
            "C++ implementations of numerical methods for solving differential-algebraic equations: design and optimization considerations.",
            "A frontal code for the solution of sparse positive-definite symmetric systems arising from finite-element applications.",
            "Blocked algorithms and software for reduction of a regular matrix pair to generalized Schur form.",
            "Characteristic spectra of the curvature functional: a numerical study in bifurcation."
        ]
    },
    {
        "name": "TOMS",
        "year": "1998",
        "info": "Volume 24: 1998",
        "count": 29,
        "papers": [
            "Algorithm 779: Fermi-Dirac Functions of Order -;1/2, 1/2, 3/2, 5/2.",
            "Generation of High-Order Interpolants for Explicit Runge-Kutta Pairs.",
            "PELLPACK: A Problem-Solving Environment for PDE-Based Applications on Multicomputer Platforms.",
            "The Design, Implementation, and Evaluation of a Symmetric Banded Linear Solver for Distributed-Memory Parallel Computers.",
            "Algorithm 780: Exponential Pseudorandom Distribution.",
            "The Computation of Spectral Density Functions for Singular Sturm-Liouville Problems Involving Simple Continuous Spectra.",
            "Expokit: A Software Package for Computing Matrix Exponentials.",
            "An Object-Oriented Framework for Block Preconditioning.",
            "Algorithm 781: Generating Hilbert's Space-Filling Curve by Recursion.",
            "The Automatic Generation of Sparse Primitives.",
            "Computing Rank-Revealing QR Factorizations of Dense Matrices.",
            "Algorithm 782: Codes for Rank-Revealing QR Factorizations of Dense Matrices.",
            "Algorithm 783: Pcp2Nurb - smooth free-form surfacing with linearly trimmed bicubic B-splines.",
            "GEMM-based level 3 BLAS: high-performance model implementations and performance evaluation benchmark.",
            "Algorithm 784: GEMM-based level 3 BLAS: portability and optimization issues.",
            "Algorithm 785: a software package for computing Schwarz-Christoffel conformal transformation for doubly connected polygonal regions.",
            "Remark on algorithm 706: DCUTRI - an algorithm for adaptive cubature over a collection of triangles.",
            "Remark on algorithm 622: a simple macroprocessor.",
            "The Monty Python method for generating random variables.",
            "Certification of algorithm 734: a Fortran 90 code for unconstrained nonlinear minimization.",
            "Remark on algorithm 726: ORTHPOL - A package of routines for generating orthogonal polynomials and Gauss-type quadrature rules.",
            "Algorithm 786: Multiple-Precision Complex Arithmetic and Functions.",
            "Stiffness Detection and Estimation of Dominant Spectrum with Explicit Runge-Kutta Methods.",
            "Remark on Algorithm 761.",
            "Algorithm 787: Fortran Subroutines for Approximate Solution of Maximum Independent Set Problems Using GRASP.",
            "Algorithm 788: Automatic Boundary Integral Equation Programs for the Planar Laplace Equation.",
            "Implementation of Hopf and Double-Hopf Continuation Using Bordering Methods.",
            "Recipes for adjoint code construction.",
            "SPRINT2D: Adaptive Software for PDEs."
        ]
    },
    {
        "name": "TOMS",
        "year": "1997",
        "info": "Volume 23: 1997",
        "count": 30,
        "papers": [
            "Algorithm 764: Cubpack++: A C++ Package for Automatic Two-Dimensional Cubature.",
            "Local Error Estimates and Regularity Tests for the Implementation of Double Adaptive Quadrature.",
            "Fortran 90: An Entry to Object-Oriented Programming for the Solution of Partial Differential Equations.",
            "Object-Oriented Design of Preconditioned Iterative Methods in Diffpack.",
            "Algorithm 765: STENMIN: A Software Package for Large, Sparse Unconstrained Optimization Using Tensor Methods.",
            "Algorithm 766: Experiments with a Weakly Stable Algorithm for Computing Padé-Hermite and Simultaneous Padé Approximants.",
            "Algorithm 767: A Fortran 77 Package for Column Reduction of Polynomial Matrices.",
            "Practical Experience in the Numerical Dangers of Heterogeneous Computing.",
            "Distributed Nested Decomposition of Staircase Linear Programs.",
            "Algorithm 768: TENSOLVE: A Software Package for Solving Systems of Nonlinear Equations and Nonlinear Least-Squares Problems Using Tensor Methods.",
            "Algorithm 769: Fortran Subroutines for Approximate Solution of Sparse Quadratic Assignment Problems Using GRASP.",
            "Enhanced Simulated Annealing for Globally Minimizing Functions of Many-Continuous Variables.",
            "Boundary-Valued Shape-Preserving Interpolating Splines.",
            "Algorithm 770: BVSPIS - A Package for Computing Boundary-Valued Shape-Preserving Interpolating Splines.",
            "Multiplicative, Congruential Random-Number Generators with Multiplier ± 2k1 ± 2k2 and modulus 2p -; 1.",
            "Computational Investigations of Low-Discrepancy Sequences.",
            "Implementing the Complex Arcsine and Arccosine Functions Using Exception Handling.",
            "Compiler Blockability of Dense Matrix Factorizations.",
            "Efficient Householder QR Factorization for Superscalar Processors.",
            "Level 3 Basic Linear Algebra Subprograms for Sparse Matrices: A User-Level Interface.",
            "Algorithm 771: rksuite_90: Fortran 90 Software for Ordinary Differential Equation Initial-Value Problems.",
            "Algorithm 772: STRIPACK: Delaunay Triangulation and Voronoi Diagram on the Surface of a Sphere.",
            "Algorithm 773: SSRFPACK: Interpolation of Scattered Data on the Surface of a Sphere with a Surface under Tension.",
            "Generating Box-Constrained Optimization Problems.",
            "Algorithm 774: Fortran Subroutines for Generating Box-Constrained Optimization Problems.",
            "Algorithm 775: The Code SLEUTH for Solving Fourth-Order Sturm-Liouville Problems.",
            "Algorithm 776: SRRIT: A Fortran Subroutine to Calculate the Dominant Invariant Subspace of N nonsymmetric Matrix.",
            "Algorithm 777: HOMPACK90: A Suite of Fortran 90 Codes for Globally Convergent Homotopy Algorithms.",
            "Algorithm 778: L-BFGS-B: Fortran Subroutines for Large-Scale Bound-Constrained Optimization.",
            "High-Precision Division and Square Root."
        ]
    },
    {
        "name": "TOMS",
        "year": "1996",
        "info": "Volume 22: 1996",
        "count": 33,
        "papers": [
            "Algorithm 751: TRIPACK: A Constrained Two-Dimensional Delaunay Triangulation Package.",
            "Algorithm 752: SRFPACK: Software for Scattered Data Fitting with a Constrained Surface Under Tension.",
            "Efficient Vector and Parallel Manipulation of Tensor Products.",
            "Algorithm 753: TENPACK: A LAPACK-Based Library for the Computer Manipulation of Tensor Products.",
            "The Design of a New Frontal Code for Solving Sparse, Unsymmetric Systems.",
            "QMRPACK: A Package of QMR Algorithms.",
            "LAPACK-Style Algorithms and Software for Solving the Generalized Sylvester Equation and Estimating the Separation Between Regular Matrix Pairs.",
            "Algorithm 754: Fortran Subroutines for Approximate Solution of Dense Quadratic Assignment Problems Using GRASP.",
            "Fast Pseudorandom Generators for Normal and Exponential Variates.",
            "Algorithm 755: ADOL-C: A Package for the Automatic Differentiation of Algorithms Written in C/C++.",
            "Algorithm 756: A MATLAB Toolbox for Schwarz-Christoffel Mapping.",
            "The Design of MA48: A Code for the Direct Solution of Sparse Unsymmetric Linear Systems of Equations.",
            "Exploiting Zeros on the Diagonal in the Direct Solution of Indefinite Sparse Symmetric Linear Systems.",
            "Remark on Algorithm 715.",
            "The Mathematical Basis and a Prototype Implementation of a New Polynomial Rootfinder With Quadratic Convergence.",
            "Note on the End Game in Homotopy Zero Curve Tracking.",
            "Algorithm 757: MISCFUN, A Software Package to Compute Uncommon Special Functions.",
            "Algorithm 758: VLUGR2: A Vectorizable Adaptive-Grid Solver for PDEs in 2D.",
            "Algorithm 759: VLUGR3: A Vectorizable Adaptive-Grid Solver for PDEs in 3D - Part II, Code Description.",
            "A Modified Schur-Complement Method for Handling Dense Columns in Interior-Point Methods for Linear Programming.",
            "Algorithm 760: Rectangular-Grid-Data Surface Fitting That Has the Accuracy of a Bicubic Polynomial.",
            "Algorithm 761: Scattered-Data Surface Fitting That Has the Accuracy of a Cubic Polynomial.",
            "Algorithm 762: LLDRLF, log-Likelihood and Some Derivatives for log-F Models.",
            "Algorithm 763; INTERVAL_ARITHMETIC: A Fortran 90 Module for an Interval Data Type.",
            "The Computation of Elementary Unitary Matrices.",
            "DESI Methods for Stiff Initial-Value Problems.",
            "Using the SLEDGE Package on Sturm-Liouville Problems Having Nonempty Essential Spectra.",
            "PYTHIA: A Knowledge-Based System to Select Scientific Algorithms.",
            "The Quickhull Algorithm for Convex Hulls.",
            "A Composition-Alias Method for Generating Gamma Variates With Shape Parameter Greater Than 1.",
            "A Remark on Bartels and Conn's Linearly Constrained, Discrete l1 Problems.",
            "Remark on \"Fast Floating-Point Processing in Common Lisp\".",
            "Remark on Algorithm 723: Fresnel Integrals."
        ]
    },
    {
        "name": "TOMS",
        "year": "1995",
        "info": "Volume 21: 1995",
        "count": 30,
        "papers": [
            "Purpose and Scope: TOMS.",
            "Purpose and Scope: CALGO.",
            "An Improved Incomplete Cholesky Factorization.",
            "Algorithm 740: Fortran Subroutines to Compute Improved Incomplete Cholesky Factorizations.",
            "Algorithm 741: Least Squares Solution of a Linear Bordered, Block-diagonal System of Equations.",
            "Fast Floating Point Processing in Common Lisp.",
            "A Fortran 90 Environment for Research and Prototyping of Enclosure Algorithms for Nonlinear Equations and Global Optimization.",
            "Software Distribution using XNETLIB.",
            "Repository Mirroring.",
            "Algorithm 742: L2CXFT: A Fortran Subroutine for Least Squares Data Fitting with Nonnegative Second Divided Differences.",
            "The Accelerated Integer GCD Algorithm.",
            "CUTE: Constrained and Unconstrained Testing Environment.",
            "Real Values of the W-Function.",
            "Algorithm 743: WAPR: A Fortran Routine for Calculating Real Values of the W-Function.",
            "A Rejection Technique for Sampling from T-Concave Distributions.",
            "Algorithm 744: A Stochastic Algorithm for Global Optimization with Constraints.",
            "Algorithm 745: Computation of the Complete and Incomplete Fermi-Dirac Integral.",
            "Algorithm 746: PCOMP: A Fortran Code for Automatic Differentiation.",
            "Numerical Analysis Using Nonprocedural Paradigms.",
            "Algorithm 747: A Fortran Subroutine to Solve the Eigenvalue Assignment Problem for Multiinput Systems Using State Feedback.",
            "Algorithm 748: Enclosing Zeros of Continuous Functions.",
            "A Modification of Talbot's Method for the Simultaneous Approximation of Several Values of the Inverse Laplace Transform.",
            "Algorithm 749: Fast Discrete Cosine Transform.",
            "A Fortran-90 Based Multiprecision System.",
            "A Remark on Algorithm 644: A Portable Package for Bessel Functions of a Complex Argument and Nonnegative Order.",
            "Exact Solution of Large Scale Asymmetric Travelling Salesman Problems.",
            "Algorithm 750: CDT: A Subroutine for the Exact Solution of Large-Scale Asymmetric Travelling Salesman Problems.",
            "A Set of Ada Packages for High Precision Calculations.",
            "An Arnoldi Code for Computing Selected Eigenvalues of Sparse, Real, Unsymmetric Matrices.",
            "Computing the MDMT Decomposition."
        ]
    },
    {
        "name": "TOMS",
        "year": "1994",
        "info": "Volume 20: 1994",
        "count": 32,
        "papers": [
            "A noniterative thinning algorithm.",
            "Algorithm 726; ORTHPOL - a package of routines for generating orthogonal polynomials and Gauss-type quadrature rules.",
            "New NAG library software for first-order partial differential equations.",
            "Algorithm 727; Quantile estimation using overlapping batch statistics.",
            "Generating quadratic bilevel programming test problems.",
            "Algorithm 728; FORTRAN subroutines for generating quadratic bilevel programming test problems.",
            "The evaluation of trigonometric integrals avoiding spurious discontinuities.",
            "Sparse QR factorization in MATLAB.",
            "Corrigendum: Algorithm 729; FORTRAN subroutines for general Toeplitz systems.",
            "Corrigendum: Algorithm 730; An implementation of a divide and conquer algorithm for the unitary eigenproblem.",
            "GFUN: a Maple package for the manipulation of generating and holonomic functions in one variable.",
            "A parallel block implementation of Level-3 BLAS for MIMD vector processors.",
            "Algorithm 731; a moving-grid interface for systems of one-dimensional time-dependent partial differential equations.",
            "Implementing complex elementary functions using exception handling.",
            "Algorithm 732; solvers for self-adjoint elliptic problems in irregular two-dimensional domains.",
            "Algorithm 733; TOMP - Fortran modules for optimal control calculations.",
            "Remark on Algorithm 566.",
            "Line search algorithms with guaranteed sufficient decrease.",
            "Conversion to Fortran 90: a case study.",
            "Algorithm 734; a Fortran 90 code for unconstrained nonlinear minimization.",
            "A primal null-space affine-scaling method.",
            "Certification of Algorithm 708: significant-digit computation of the incomplete beta.",
            "Algorithm 735; Wavelet transform algorithms for finite-duration discrete-time signals.",
            "Computing hyperelliptic integrals for surface measure of ellipsoids.",
            "Algorithm 736; hyperelliptic integrals and the surface measure of ellipsoids.",
            "A new algorithm for the evaluation of the incomplete gamma function on vector computers.",
            "Algorithm 737; INTLIB: a portable Fortran 77 interval standard-function library.",
            "Evaluation and approximate evaluation of the multivariate Bernstein-Bézier form on a regularly partitioned simplex.",
            "Programs to generate Niederreiter's low-discrepancy sequences.",
            "Control-theoretic techniques for stepsize selection in implicit Runge-Kutta methods.",
            "Algorithm 738; a software package for unconstrained optimization using tensor methods.",
            "A data-level parallel linear-quadratic penalty algorithm for multicommodity network flows."
        ]
    },
    {
        "name": "TOMS",
        "year": "1993",
        "info": "Volume 19: 1993",
        "count": 35,
        "papers": [
            "Algorithm 714: CELEFUNT: a portable test package for complex elementary functions.",
            "Algorithm 715: SPECFUN-a portable FORTRAN package of special function routines and test drivers.",
            "An accurate computation of the hypergeometric distribution function.",
            "ODEXPERT: an expert system to select numerical solvers for initial value ODE systems.",
            "A modified Adams method for nonstiff and mildly stiff initial value problems.",
            "Algorithm 716: TSPACK: tension spline curve-fitting package.",
            "Computing tensor product decompositions.",
            "Algorithm 717: Subroutines for maximum likelihood and quasi-likelihood estimation of parameters in nonlinear regression models.",
            "Computing Selected Eigenvalues of Sparse Unsymmetric Matrices Using Subspace Iteration.",
            "The generalized Schur decomposition of an arbitrary pencil A-λB - robust software with error bounds and applications. Part I: theory and algorithms.",
            "The generalized Schur decomposition of an arbitrary pencil A-λB - robust software with error bounds and applications. Part II: software and applications.",
            "On computing condition numbers for the nonsymmetric eigenproblem.",
            "Algorithm 718: A FORTRAN subroutine to solve the eigenvalue allocation problem for single-input systems.",
            "Enhancements of ANALYZE: a computer-assisted analysis system for linear programming.",
            "Generating a sample from a k-cell table with changing probabilities in O(log2k time.",
            "Template-driven interfaces for numerical subroutines.",
            "Algorithm 719: Multiprecision translation and execution of FORTRAN programs.",
            "Algorithm 720: An algorithm for adaptive cubature over a collection of 3-dimensional simplices.",
            "On the numerical inversion of Laplace transforms: comparison of three new methods on characteristic problems from applications.",
            "Mathematical software for Sturm-Liouville problems.",
            "The computation of eigenvalues and solutions of Mathieu's differential equation for noninteger order.",
            "Algorithm 721: MTIEU1 and MTIEU2: two subroutines to compute eigenvalues and solutions to Mathieu's differential equation for noninteger and integer order.",
            "QR-like algorithms for the nonsymmetric eigenvalue problem.",
            "Implementation and computational results for the hierarchical algorithm for making sparse matrices sparser.",
            "Algorithm 722: Functions to support the IEEE standard for binary floating-point arithmetic.",
            "Algorithm 723: Fresnel integrals.",
            "Toward parallel mathematical software for elliptic partial differential equations.",
            "Applying series expansion to the inverse beta distribution to find percentiles of the F-distribution.",
            "Algorithm 724; Program to calculate F-Percentiles.",
            "A remark on algorithm 643: FEXACT: an algorithm for performing Fisher's exact test in r x c contingency tables.",
            "A portable random number generator well suited for the rejection method.",
            "Rounding errors in certain algorithms involving Markov chains.",
            "A test problem generator for the Steiner problem in graphs.",
            "Implementation of a lattice method for numerical multiple integration.",
            "Corrigendum: Algorithm 725: Computation of the multivariate normal integral."
        ]
    },
    {
        "name": "TOMS",
        "year": "1992",
        "info": "Volume 18: 1992",
        "count": 36,
        "papers": [
            "A prototyping environment for differential equations.",
            "Automated selection of mathematical software.",
            "A flexible thinning algorithm allowing parallel, sequential, and distributed application.",
            "TNPACK - A truncated Newton minimization package for large-scale problems: I. Algorithm and usage.",
            "TNPACK - a truncated Newton minimization package for large-scale problems: II. Implementation examples.",
            "A quadratic-tensor model algorithm for nonlinear least-squares problems with linear constraints.",
            "A test for cancellation errors in quasi-Newton methods.",
            "Algorithm 702: TNPACK-a truncated Newton minimization package for large-scale problems: I. Algorithm and usage.",
            "An MEBDF code for stiff initial value problems.",
            "Algorithm 703: MEBDF: a FORTRAN subroutine for solving first-order systems of stiff initial value problems for ordinary differential equations.",
            "An efficient method for the numerical evaluation of partial derivatives of arbitrary order.",
            "Exact equations of the nonlinear spline.",
            "The solution of almost block diagonal linear systems arising in spline collocation at Gaussian points with monomial basis functions.",
            "Algorithm 704: ABDPACK and ABBPACK-FORTRAN programs for the solution of almost block diagonal linear systems arising in spline collocation at Gaussian points with monomial basis functions.",
            "Table-driven implementation of the Expm1 function in IEEE floating-point arithmetic.",
            "Solution of the Sylvester matrix equation AXBT + CXDT = E.",
            "Algorithm 705; a FORTRAN-77 software package for solving the Sylvester matrix equation AXBT + CXDT = E.",
            "A portable code generator for CRAY FORTRAN.",
            "FORTRAN subroutines for general Toeplitz systems.",
            "Stability of block algorithms with fast level-3 BLAS.",
            "An implementation of a divide and conquer algorithm for the unitary eigen problem.",
            "LSNNO, a FORTRAN subroutine for solving large-scale nonlinear network optimization problems.",
            "Algorithm 706: DCUTRI: an algorithm for adaptive cubature over a collection of triangles.",
            "Remark on algorithm 540.",
            "Algorithm 707: CONHYP: a numerical evaluator of the confluent hypergeometric function for complex arguments of large magnitudes.",
            "Real zero isolation for trigonometric polynomials.",
            "Algorithm 708: Significant digit computation of the incomplete beta function ratios.",
            "Algorithm 709: testing algorithm implementations.",
            "Algorithm 710: FORTRAN subroutines for computing the eigenvalues and eigenvectors of a general matrix by reduction to general tridiagonal form.",
            "Discrete-time optimal control problems with general constraints.",
            "Algorithm 711: BTN: software for parallel unconstrained optimization.",
            "A fast normal random number generator.",
            "Algorithm 712: A normal random number generator.",
            "Portable vectorized software for Bessel function evaluation.",
            "Computation of the multivariate normal integral.",
            "Precise computation using range arithmetic, via C++."
        ]
    },
    {
        "name": "TOMS",
        "year": "1991",
        "info": "Volume 17: 1991",
        "count": 41,
        "papers": [
            "Algorithm 687: a decision tree for the numerical solution of initial value ordinary differential equations.",
            "Reliable solution of special event location problems for ODEs.",
            "An accurate elementary mathematical library for the IEEE floating point standard.",
            "Performance evaluation of programs related to the real gamma function.",
            "The use of Taylor series to test accuracy of function programs.",
            "On computational aspects of bounded linear least squares problems.",
            "Construction of test problems in quadratic bivalent programming.",
            "On finding the closest bitwise matches in a fixed set.",
            "Implementing a random number package with splitting facilities.",
            "A generalized envelope method for sparse factorization by rows.",
            "On recursive calculation of the generalized inverse of a matrix.",
            "Algorithm 688: EPDCOL: a more efficient PDECOL code.",
            "Algorithm 689: Discretized collocation and iterated collocation for nonlinear Volterra integral equations of the second kind.",
            "Algorithm 690: Chebyshev polynomial software for elliptic-parabolic systems of PDEs.",
            "Interpolatory integration formulas for optimal composition.",
            "Algorithm 691: Improving QUADPACK automatic integration routines.",
            "Error estimation in automatic quadrature routines.",
            "Sparse extensions to the FORTRAN Basic Linear Algebra Subprograms.",
            "Algorithm 692: Model implementation and test package for the Sparse Basic Linear Algebra Subprograms.",
            "Algorithm 693: a FORTRAN package for floating-point multiple-precision arithmetic.",
            "Algorithm 694: a collection of test matrices in MATLAB.",
            "Algorithm 695: software for a new modified Cholesky factorization.",
            "Efficient sparse matrix factorization on high performance workstations - exploiting the memory hierarchy.",
            "Algorithm 696: an inverse rayleigh iteration for complex band matrices.",
            "A method of univariate interpolation that has the accuracy of a third-degree polynomial.",
            "Algorithm 697: univariate interpolation that has the accuracy of a third-degree polynomial.",
            "Highly continuous Runge-Kutta interpolants.",
            "Numerical comparisons of some explicit Runge-Kutta pairs of orders 4 through 8.",
            "Fast evaluation of elementary mathematical functions with correctly rounded last bit.",
            "Remark on algorithm 669.",
            "ACM Algorithms Policy.",
            "An adaptive algorithm for the approximate calculation of multiple integrals.",
            "Algorithm 698: DCUHRE: an adaptive multidemensional integration routine for a vector of integrals.",
            "Algorithm 699: a new representation of Patterson's quadrature formulae.",
            "SENAC: a high-level interface for the NAG library.",
            "Certification of algorithm 700 numerical tests of the SLEIGN software for Sturm-Liouville problems.",
            "Eigenvalue and eigenfunction computations for Sturm-Liouville problems.",
            "Algorithm 700: A Fortran software package for Sturm-Liouville problems.",
            "The exact analysis of sparse rectangular linear systems.",
            "Algorithm 701: Goliath - a software system for the exact analysis of rectangular rank-deficient sparse rational linear systems.",
            "Control theoretic techniques for stepsize selection in explicit Runge-Kutta methods."
        ]
    },
    {
        "name": "TOMS",
        "year": "1990",
        "info": "Volume 16: 1990",
        "count": 30,
        "papers": [
            "A set of level 3 basic linear algebra subprograms.",
            "Algorithm 679; a set of level 3 basic linear algebra subprograms: model implementation and test programs.",
            "Performance evaluation of programs for the error and complementary error functions.",
            "More efficient computation of the complex error function.",
            "Algorithm 680: evaluation of the complex error function.",
            "An adaptive mesh-moving and local refinement method for time-dependent partial differential equations.",
            "Designing software for one-dimensional partial differential equations.",
            "Polynomial evaluation with scaling.",
            "Weyl group orbits.",
            "Integrating network optimization capabilities into a high-level modeling language.",
            "Chemical equilibrium systems as numerical test problems.",
            "Algorithm 681: INTBIS, a portable interval Newton/bisection package.",
            "Algorithm 682: Talbot's method of the Laplace inversion problems.",
            "Computation of exponential integrals of a complex argument.",
            "Algorithms 683: a portable FORTRAN subroutine for exponential integrals of a complex argument.",
            "Accurate and efficient testing of the exponential and logarithm functions.",
            "A variable order Runge-Kutta method for initial value problems with rapidly varying right-hand sides.",
            "A study of scalar compilation techniques for pipelined supercomputers.",
            "Efficient formulation of a bivariate nonic C2-hermite polynomial on triangles.",
            "Algorithm 684: C1- and C2-interplation on triangles with quintic and nonic bivariate polynomials.",
            "Finding boundaries of the domain of definition for functions along a one-dimensional ray.",
            "A dynamic hierarchical subdivision algorithm for computing Delaunay triangulations and other closest-point problems.",
            "Computing the block triangular form of a sparse matrix.",
            "Algorithm 658: a program for solving separable elliptic equations.",
            "Exploiting fast matrix multiplication within the level 3 BLAS.",
            "Algorithm 686: FORTRAN subroutines for updating the QR decomposition.",
            "Table-driven implementation of the logarithm function in IEEE floating-point arithmetic.",
            "Remark on algorithm 620.",
            "Remark on algorithm 644.",
            "Remark on algorithm 662."
        ]
    },
    {
        "name": "TOMS",
        "year": "1989",
        "info": "Volume 15: 1989",
        "count": 32,
        "papers": [
            "Sparse matrix test problems.",
            "A block 6(4) Runge-Kutta formula for nonstiff initial value problems.",
            "Algorithm 669: BRKF45: a FORTRAN subroutine for solving first-order systems of nonstiff initial value problems for ordinary differential equations.",
            "Algorithm 670: a Runge-Kutta-Nyström code.",
            "Performance evaluation of programs for certain Bessel functions.",
            "Numerical experience with sequential quadratic programming algorithms for equality constrained nonlinear programming.",
            "An improved primal simplex variant for pure processing networks.",
            "Algorithm 671: FARB-E-2D: fill area with bicubics on rectangles - a contour plot program.",
            "Finding all isolated solutions to polynomial systems using HOMPACK.",
            "An algorithm for generating interpolatory quadrature rules of the highest degree of precision with preassigned nodes for general weight functions.",
            "Algorithm 672: generation of interpolatory quadrature rules of the highest degree of precision with preassigned nodes for general weight functions.",
            "Table-driven implementation of the exponential function in IEEE floating-point arithmetic.",
            "Algorithm 673: Dynamic Huffman coding.",
            "Algorithm 674: Fortran codes for estimating the one-norm of a real or complex matrix, with applications to condition estimation.",
            "ACM Algorithms Policy.",
            "A fast adaptive grid scheme for elliptic partial differential equations.",
            "A graph partitioning algorithm by node separators.",
            "Constrained nonlinear least squares: an exact penalty approach with projected structured quasi-Newton updates.",
            "Algorithm 675: Fortran subroutines for computing the square root covariance filter and square root information filter in dense or Hessenberg forms.",
            "Remark on algorithm 587.",
            "Remark on algorithm 630.",
            "Residual hermite normal form computations.",
            "Corrigenda: \"Two FORTRAN Packages for Assessing Initial Value Methods\".",
            "Corrigenda: \"An Efficient Derivative-Free Method for Solving Nonlinear Equations\".",
            "Corrigenda: \"Minimizing Multimodal Functions of Continuous Variables with the 'Simulated Annealing' Algorithm\".",
            "The influence of relaxed supernode partitions on the multifrontal method.",
            "The multifrontal method and paging in sparse Cholesky factorization.",
            "A comparison of adaptive refinement techniques for elliptic problems.",
            "Algorithm 676: ODRPACK: software for weighted orthogonal distance regression.",
            "Algorithm 677 C1 surface interpolation.",
            "Indefinite integration with validation.",
            "Algorithm 678: BTPEC: sampling from the binomial distribution."
        ]
    },
    {
        "name": "TOMS",
        "year": "1988",
        "info": "Volume 14: 1988",
        "count": 39,
        "papers": [
            "An extended set of FORTRAN basic linear algebra subprograms.",
            "Algorithm 656: an extended set of basic linear algebra subprograms: model implementation and test programs.",
            "Plotting contour surfaces of a function of three variables.",
            "Algorithm 657: software for plotting contour surfaces of a function of three var.",
            "The simultaneous solution and sensitivity analysis of systems described by ordinary differential equations.",
            "Algorithm 658: ODESSA-an ordinary differential equation solver with explicit simultaneous sensitivity analysis.",
            "Towards efficient implementation of singly-implicit methods.",
            "A routine for converting regression algorithms into corresponding orthogonal regression algorithms.",
            "Algorithm 659: Implementing Sobol's quasirandom sequence generator.",
            "Best \"ordering\" for floating-point addition.",
            "Corrigendum: \"An Algorithm for Generating Chi Random Variables\".",
            "Multicolor reordering of sparse matrices resulting from irregular grids.",
            "Multivariate interpolation of large sets of scattered data.",
            "Algorithm 660: QSHEP2D: Quadratic Shepard Method for Bivariate Interpolation of Scattered Data.",
            "Algorithm 661: QSHEP3D: quadratic Shepard method for trivariate interpolation of scattered data.",
            "An algorithm for multidimensional data clustering.",
            "Software for an implementation of Weeks' method for the inverse Laplace transform.",
            "Algorithm 662: A Fortran software package for the numerical inversion of the Laplace transform based on Weeks' method.",
            "Algorithm 663: Translation of Algorithm 539: basic linear algebra subprograms for FORTRAN usage in FORTRAN 200 for the Cyber 205.",
            "Remark on \"Algorithm 603: COLROW and ARCECO: FORTRAN Packages for Solving Certain Almost Block Diagonal Linear Systems by Modified Alternate Row and Column Elimination\".",
            "Exception handling in scientific computing.",
            "Dagwood: a system for manipulating polynomials given by straight-line programs.",
            "Solution of large, dense symmetric generalized eigenvalue problems using secondary storage.",
            "Algorithm 664: A Gauss algorithm to solve systems with large, banded matrices using random-access disk storage.",
            "Generating gamma variates.",
            "Remarks on implementation of O(n1/2tau) assignment algorithms.",
            "Remark on \"Algorithm 346: F-Test Probabilities\".",
            "ACM Algorithms Policy.",
            "Corrigendum: \"Interpolation with Interval and Point Tension Controls Using Cubic Weighted v-Splines\".",
            "Algorithm 665: Machar: a subroutine to dynamically determined machine parameters.",
            "Solving systems of nonlinear equations using the nonzero value of the topological degree.",
            "Algorithm 666: Chabis: a mathematical software package for locating and evaluating roots of systems of nonlinear equations.",
            "An algorithm for the multiplication of symmetric polynomials.",
            "A global optimization algorithm using stochastic differential equations.",
            "Algorithm 667: Sigma - a stochastic-integration global minimization algorithm.",
            "FORTRAN codes for estimating the one-norm of a real or complex matrix, with applications to condition estimation.",
            "Algorithm 668: H2PEC: sampling from the hypergeometric distribution.",
            "Corrigenda: \"An Extended Set of FORTRAN Basic Linear Algebra Subprograms\".",
            "Corrigenda: \"Some Tests of Generalized Bisection\"."
        ]
    },
    {
        "name": "TOMS",
        "year": "1987",
        "info": "Volume 13: 1987",
        "count": 29,
        "papers": [
            "Two FORTRAN packages for assessing initial value methods.",
            "Algorithm 648: NSDTST and STDTST: routines for assessing the performance of IV solvers.",
            "A fast, low-space algorithm for multiplying dense multivariate polynomials.",
            "An efficient algorithm for sequential random sampling.",
            "Interpolation with interval and point tension controls using cubic weighted v-splines.",
            "Algorithm 649: A package for computing trigonometric Fourier coefficients based on Lyness's algorithm.",
            "Interactive ELLPACK: an interactive problem-solving environment for elliptic partial differential equations.",
            "Generation of large-scale quadratic programs for use as global optimization test problems.",
            "Algorithm 650: Efficient square root implementation on the 68000.",
            "Box-bisection for solving second-degree systems and the problem of clustering.",
            "An algorithm for generating chi random variables.",
            "A partial pivoting strategy for sparse symmetric matrix decomposition.",
            "ACM algorithms policy.",
            "Some tests of generalized bisection.",
            "A fourth-order-accurate Fourier method for the Helmholtz equation in three dimensions.",
            "Algorithm 651: Algorithm HFFT-high-order fast-direct solution of the Helmholtz equation.",
            "On threshold pivoting in the multifrontal method for sparse indefinite systems.",
            "Minimizing multimodal functions of continuous variables with the \"simulated annealing\" algorithm.",
            "Algorithm 652: HOMPACK: a suite of codes for globally convergent homotopy algorithms.",
            "Algorithm 653: Translation of algorithm 539: PC-BLAS, basic linear algebra subprograms for FORTRAN usage with the INTEL 8087, 80287 numeric data processor.",
            "Algorithm 654: FORTRAN subroutines for computing the incomplete gamma function ratios and their inverse.",
            "Corrigendum: \"Algorithm 650: efficient square root implementation on the 68000\" [ACM Trans. Math. Software 13(2) 138-151 (1987)].",
            "A practical parallel algorithm for solving band symmetric positive definite systems of linear equations.",
            "Software considerations for the \"black box\" solver FIDISOL for partial differential equations.",
            "Nonlinear programming on generalized networks.",
            "The multiple prime random number generator.",
            "The expanding equilibrium algorithm.",
            "Algorithm 655: IQPACK: FORTRAN subroutines for the weights of interpolatory quadratures.",
            "Corrigendum: \"Box-Bisection for Solving Second-Degree Systems and the Problem of Clustering\"."
        ]
    },
    {
        "name": "TOMS",
        "year": "1986",
        "info": "Volume 12: 1986",
        "count": 34,
        "papers": [
            "Fixed versus variable order Runge-Kutta.",
            "Algorithm 639: To integrate some infinite oscillating tails.",
            "Algorithm 640: Efficient calculation of frequency response matrices from state space models.",
            "The economical method for generating random samples from discrete distributions.",
            "A node-addition model for symbolic factorization.",
            "Exact solution of general integer systems of linear equations.",
            "High-accuracy arithmetic software - some tests of the ACRITH problem-solving routines.",
            "Remark on \"Algorithm 584: CUBTRI: Automatic Cubature over a Triangle\".",
            "Remark on \"Algorithm 631: Finding a Bracketed Zero by Larkin's Method of Rational Interpolation\".",
            "Variable precision exponential function.",
            "A generalized model management system for mathematical programming.",
            "A compact row storage scheme for Cholesky factors using elimination trees.",
            "Algorithm 641: Exact Solution of General Systems of Linear Equations.",
            "Algorithm 642: A fast procedure for calculating minimum cross-validation cubic smoothing splines.",
            "ALGORITHM 643: FEXACT: a FORTRAN subroutine for Fisher's exact test on unordered r×c contingency tables.",
            "Iterated interpolation using a systolic array.",
            "ACM Algorithms Policy.",
            "Equilibrium states of Runge-Kutta schemes: part II.",
            "Interpolants for Runge-Kutta formulas.",
            "Plane curves of minimal energy.",
            "Note on blended linear multistep formulas.",
            "Computer-aided modeling and planning(CAMP).",
            "On the storage requirement in the out-of-core multifrontal method for sparse factorization.",
            "Algorithm 644: A portable package for Bessel functions of a complex argument and nonnegative order.",
            "Algorithm 645: Subroutines for testing programs that compute the generalized inverse of a matrix.",
            "Algorithm 646: PDFIND: a routine to find a positive definite linear combination of two real symmetric matrices.",
            "Remark on \"Algorithm 569: COLSYS: Collocation Software for Boundary-Value ODEs [D2]\".",
            "Corrigendum: \"A Note on Complex Division\".",
            "On computational efficiency of the iterative methods for the simultaneous approximation of polynomial zeros.",
            "Implementation aids for optimization algorithms that solve sequences of linear programs.",
            "Transforming FORTRAN DO loops to improve performance on vector architectures.",
            "The solution of a combustion problem with Rosenbrock methods.",
            "Algorithm 647: Implementation and Relative Efficiency of Quasirandom Sequence Generators.",
            "Computation of the incomplete gamma function ratios and their inverse."
        ]
    },
    {
        "name": "TOMS",
        "year": "1985",
        "info": "Volume 11: 1985",
        "count": 40,
        "papers": [
            "Integration of a Primal Simplex Network Algorithm with a Large-Scale Mathematical Programming System.",
            "Evaluation of Step Directions in Optimization Algorithms.",
            "Computational Implementation of the Multivariate Halley Method for Solving Nonlinear Systems of Equations.",
            "Random Sampling with a Reservoir.",
            "Algorithm 627: A FORTRAN Subroutine for Solving Volterra Integral Equations.",
            "Algorithm 628: An Algorithm for Constructing Canonical Bases of Polynomial Ideals.",
            "Algorithm 629: An Integral Equation Program for Laplace's Equation in Three Dimensions.",
            "A Test Problem Generator for Large-Scale Unconstrained Optimization.",
            "Algorithm 630: BBVSCG - A Variable Storage Algorithm for Function Minimization.",
            "Algorithm 631: Finding a Bracketed Zero by Larkin's Method of Rational Interpolation.",
            "Algorithm 632: A Program for the 0-1 Multiple Knapsack Problem.",
            "Modification of the Minimum-Degree Algorithm by Multiple Elimination.",
            "A Note on Combination Generators.",
            "Sequential Random Sampling.",
            "Algorithm 633: An Algorithm for Linear Dependency Analysis of Multivariate Data.",
            "Remark on \"Algorithm 30: Numerical Solution of the Polynomial Equation\".",
            "Remark on \"Algorithm 299: Chi-Squared Integral\".",
            "Remark on \"Algorithm 526: Bivariate Interpolation and Smooth Surface Fitting for Irregularly Distributed Data Points [E1]\".",
            "Corrections to \"The Computation and Communication Complexity of a Parallel Banded System Solver\".",
            "ACM Algorithms Policy.",
            "Least-Squares Fitting Using Orthogonal Multinomials.",
            "Algorithm 634: CONSTR and EVAL: Routines for Fitting Multinomials in a Least-Squares Sense.",
            "Properly Rounded Variable Precision Square Root.",
            "A Note on Complex Division.",
            "Algorithm 635: An Algorithm for the Solution of Systems of Complex Linear Equations in the L_\\infty Norm with Constraints on the Unknowns.",
            "An Efficient Derivative-Free Method for Solving Nonlinear Equations.",
            "An Evaluation of Some New Cyclic Linear Multistep Formulas for Stiff ODEs.",
            "Solving Narrow Banded Systems on Ensemble Architectures.",
            "Equilibrium States of Runge Kutta Schemes.",
            "Inverse Pairs of Test Matrices.",
            "Remark on \"Algorithm 620: References and Keywords for Collected Algorithms of the ACM\".",
            "GAMS: A Framework for the Management of Scientific Software.",
            "On the Parallel Risch Algorithm (II).",
            "Software for Estimating Sparse Hessian Matrices.",
            "Algorithm 636: FORTRAN Subroutines for Estimating Sparse Hessian Matrices.",
            "Collocation Software for Second-Order Elliptic Partial Differential Equations.",
            "Algorithm 637: GENCOL: Collocation of General Domains with Bicubic Hermite Polynomials.",
            "Algorithm 638: INTCOL and HERMCOL: Collocation on Rectangular Domains with Bicubic Hermite Polynomials.",
            "A Modular System of Algorithms for Unconstrained Minimization.",
            "Remark on \"Algorithm 246: Graycode [Z]\"."
        ]
    },
    {
        "name": "TOMS",
        "year": "1984",
        "info": "Volume 10: 1984",
        "count": 46,
        "papers": [
            "An Algorithm for Automatic Integration Over a Triangle Using Nonlinear Extrapolation.",
            "Algorithm 612: TRIEX: Integration Over a TRIangle Using Nonlinear EXtrapolation.",
            "Solving Ordinary Differential Equations with Discontinuities.",
            "Asymptotic (h\\rightarrow\\infty) Absolute Stability for BDFs Applied to Stiff Differential Equations.",
            "A Performance Evaluation of Some FORTRAN Subroutines for the Solution of Stiff Oscillatory Ordinary Differential Equations.",
            "Banded Eigenvalue Solvers on Vector Machines.",
            "Randomly Generated Test Problems for Positive Definite Quadratic Programming.",
            "A Significance Rule for Multiple-Precision Arithmetic.",
            "Algorithm 613: Minimum Spanning Tree for Moderate Integer Weights.",
            "Increasing robustness in global adaptive quadrature through interval selection heuristics.",
            "Optimal quadratures in H(sub)p spaces.",
            "Algorithm 614: a FORTRAN subroutine for numerical integration in H(sub)p.",
            "Differentiation in PASCAL-SC: type GRADIENT.",
            "The computation and communication complexity of a parallel banded system solver.",
            "On solving almost block diagonal (staircase) linear systems.",
            "Algorithm 615: the best subset of parameters in leasst absolute value regression.",
            "Remark on algorithm 590.: Fortran subroutines for computing deflating subspaces with specified spectrum.",
            "ACM algorithms policy.",
            "Squeezing the most out of an algorithm in CRAY FORTRAN.",
            "A program complex for solving systems of linear algebraic equations.",
            "Design and data structure of fully adaptive, multigrid, finite-element software.",
            "Algorithm 616: fast computation of the Hodges-Lehmann location estimator.",
            "An acceptance-complement analogue of the mixture-plus-acceptance-rejection method for generating random variables.",
            "Procedures for optimization problems with a mixture of bounds and general linear constraints.",
            "A differential-equations algorithm for nonlinear equations.",
            "Algorithm 617: DAFNE: a differential-equations algorithm for nonlinear equations.",
            "Multiprecision integer division examples using arbitrary radix.",
            "Software for estimating sparse Jacobian matrices.",
            "Algorithm 618: FORTRAN subroutines for estimating sparse Jacobian Matrices.",
            "Algorithm 619: automatic numerical inversion of the Laplace transform [D5].",
            "Remark on algorithm 354: numerical inversion of Laplace transform.",
            "Algorithm 620: References and Keywords for Collected Algorithms of the ACM.",
            "The Need for an Industry Standard of Accuracy for Elementary-Function Programs.",
            "A bisection method for systems of nonlinear equations.",
            "Algorithm 621: Software with Low Storage Requirements for Two-Dimensional, Nonlinear, Parabolic Differential Equations.",
            "A generalized interval package and its use for semantic checking.",
            "Algorithm 622: A Simple Macroprocessor.",
            "Interpolation of data on the surface of a sphere.",
            "Algorithm 623: Interpolation on the Surface of a Sphere.",
            "Algorithm 624: Triangulation and Interpolation at Arbitrarily Distributed Points in the Plane.",
            "Numerical Computation with General Two-Dimensional Domains.",
            "Algorithm 625: A Two-Dimensional Domain Processor.",
            "Computing contours by successive solution of quintic polynomial equations.",
            "Algorithm 626: TRICP: a contour plot program triangular meshes.",
            "Remark on \"Algorithm 535: The QZ Algorithm to Solve the Generalized Eigenvalue Problem for Complex Matrices [F2]\".",
            "Remark: Corrections and Errors in John Ivie's Some MACSYMA Programs for Solving Recurrence Relations."
        ]
    },
    {
        "name": "TOMS",
        "year": "1983",
        "info": "Volume 9: 1983",
        "count": 44,
        "papers": [
            "A Method for Computing All Solutions to Systems of Polynomials Equations.",
            "A Functional Description of ANALYZE: A Computer-Assisted Analysis System for Linear Programming Models.",
            "A Reduced Gradient Algorithm for Nonlinear Network Problems.",
            "Controlling the defect in existing variable-order Adams codes for initial-value problems.",
            "Algorithm 592: A FORTRAN Subroutine for Computing the Optimal Estimate of f(x).",
            "Algorithm 593: A Package for the Helmholtz Equation in Nonrectangular Planar Regions.",
            "Algorithm 594: Software for Relative Error Analysis.",
            "Algorithm 595: An Enumerative Algorithm for Finding Hamiltonian Circuits in a Directed Graph.",
            "Remark on \"Algorithm 573: NL2SOL - An Adaptive Nonlinear Least-Squares Algorithm\".",
            "Corrigendum: Remark on \"Algorithm 539: Basic Linear Algebra Subroutines for FORTRAN Usage\".",
            "Modeling languages versus matrix generators for linear programming.",
            "A computational study of a multiple-choice knapsack algorithm.",
            "Minkowski matrices.",
            "The efficient solution of linear complementarity problems for tridiagonal Minkowski matrices.",
            "A locally parameterized continuation process.",
            "Algorithm 596: a program for a locally parameterized.",
            "Algorithm 597: sequence of modified Bessel functions of the first kind.",
            "Algorithm 598: an algorithm to compute solvent of the matrix equation AX2 + BX + C = 0.",
            "Algorithm 599: sampling from Gamma and Poisson distributions.",
            "Algorithm 600: translation of algorithm 507. procedures for quintic natural spline interpolation.",
            "Remark on algorithm 562: shortest path lengths.",
            "ACM algorithms policy.",
            "A Quantitative Evaluation of the Feasibility of, and Suitable Hardware Architectures for, an Adaptive, Parallel Finite-Element System.",
            "The Numerical Solution of Separably Stiff Systems by Precise Partitioning.",
            "The Multifrontal Solution of Indefinite Sparse Symmetric Linear.",
            "Space-Efficient Implementations of Graph Search Methods.",
            "A Sparse Matrix Package - Part II: Special Cases.",
            "Algorithm 601: A Sparse-Matrix Package - Part II: Special Cases.",
            "HURRY: An Acceleration Algorithm for Scalar Sequences and Series.",
            "Algorithm 602: HURRY: An Acceleration Algorithm for Scalar Sequences and Series.",
            "FORTRAN Packages for Solving Certain Almost Block Diagonal Linear Systems by Modified Alternate Row and Column Elimination.",
            "Algorithm 603: COLROW and ARCECO: FORTRAN Packages for Solving Certain Almost Block Diagonal Linear Systems by Modified Alternate Row and Column Elimination.",
            "Algorithm 604: A FORTRAN Program for the Calculation of an Extremal Polynomial.",
            "Algorithm 605: PBASIC: A Verifier Program for American National Standard Minimal BASIC.",
            "NITPACK: An Interactive Tree Package.",
            "Algorithm 606: NITPACK: An Interactive Tree Package.",
            "Algorithm 607: Text Exchange System: A Transportable System for Management and Exchange of Programs and other Text.",
            "The Curve of Least Energy.",
            "Algorithm 608: Approximate Solution of the Quadratic Assignment Problem.",
            "Uniform Asymptotic Expansions for Exponential Integrals E_n(x) and Bickley Functions Kin (x).",
            "Algorithm 609: A Portable FORTRAN Subroutine for the Bickley Functions Kin (x).",
            "Algorithm 610: A Portable FORTRAN Subroutine for Derivatives of the Psi Function.",
            "Algorithm 611: Subroutines for Unconstrained Minimization Using a Model/Trust-Region Approach.",
            "Remark on \"Algorithm 556: Exponential Integrals\"."
        ]
    },
    {
        "name": "TOMS",
        "year": "1982",
        "info": "Volume 8: 1982",
        "count": 34,
        "papers": [
            "ACM Algorithms Policy.",
            "An Evaluation of Mathematical Software That Solves Systems of Nonlinear Equations.",
            "Choice of Basis for Chebyshev Approximation.",
            "Algorithms for Generating Fundamental Cycles in a Graph.",
            "LSQR: An Algorithm for Sparse Linear Equations and Sparse Least Squares.",
            "An Improved Algorithm for Computing the Singular Value Decomposition.",
            "Algorithm 581: An Improved Algorithm for Computing the Singular Value Decomposition [F1].",
            "Remark on \"Algorithm 334: Normal Random Deviates\".",
            "Implementation of Rosenbrock Methods.",
            "Solving Ordinary Differential Equations Using Taylor Series.",
            "Exploratory Data Analysis in a Study of the Performance of Nonlinear Optimization Routines.",
            "Computer Generation of Poisson Deviates from Modified Normal Distributions.",
            "Implementation of the Gibbs-Poole-Stockmeyer and Gibbs-King Algorithms.",
            "Algorithm 582: The Gibbs-Poole-Stockmeyer and Gibbs-King Algorithms for Reordering Sparse Matrices.",
            "Algorithm 583: LSQR: Sparse Linear Equations and Least Squares Problems.",
            "Algorithm 584: CUBTRI: Automatic Cubature over a Triangle.",
            "Remark on \"Algorithm 506: HQR3 and EXCHNG: Fortran Subroutines for Calculating and Ordering the Eigenvalues of a Real Upper Hessenberg Matrix\".",
            "Remark on \"Algorithms 508 and 509: Matrix Bandwidth and Profile Reduction and A Hybrid Profile Reduction Algorith\".",
            "UIMP: User Interface for Mathematical Programming.",
            "A New Implementation of Sparse Gaussian Elimination.",
            "Efficient Gaussian Elimination Method for Symbolic Determinants and Linear Systems.",
            "Algorithm 585: A Subroutine for the General Interpolation and Extrapolation Problems.",
            "Algorithm 586: ITPACK 2C: A FORTRAN Package for Solving Large Sparse Linear Systems by Adaptive Accelerated Iterative Methods.",
            "Algorithm 587: Two Algorithms for the Linearly Constrained Least Squares Problem.",
            "Remark on \"Algorithm 507: Procedures for Quintic Natural Spline Interpolation\".",
            "Checking the Calculation of Gradients.",
            "Fast Hankel Transforms Using Related and Lagged Convolutions.",
            "Algorithm 588: Fast Hankel Transforms Using Related and Lagged Convolutions.",
            "Algorithm 589: SICEDR: A FORTRAN Subroutine for Improving the Accuracy of Computed Matrix Eigenvalues.",
            "Algorithm 590: DSUBSP and EXCHQZ: FORTRAN Subroutines for Computing Deflating Subspaces with Specified Spectrum.",
            "Algorithm 591: A Comprehensive Matrix-Free Algorithm for Analysis of Variance.",
            "Remark on \"Algorithm 535: The QZ Algorithm to Solve the Generalized Eigenvalue Problem\".",
            "Remark on \"Algorithm 539: Basic Linear Algebra Subprograms for Fortran Usage\".",
            "Remark on \"Algorithm 580: QRUP: A Set of FORTRAN Routines for Updating QR Factorizations\"."
        ]
    },
    {
        "name": "TOMS",
        "year": "1981",
        "info": "Volume 7: 1981",
        "count": 46,
        "papers": [
            "An Evaluation of Mathematical Software that Solves Nonlinear Least Squares Problems.",
            "Testing Unconstrained Optimization Software.",
            "A Comparison of Combination Generation Methods.",
            "Double Integration Using One-Dimensional Adaptive Quadrature Routines: A Software Interface Problem.",
            "A Nested Partitioning Procedure for Numerical Multiple Integration.",
            "Extended-Range Arithmetic and Normalized Legendre Polynomials.",
            "General Software for Two-Dimensional Nonlinear Partial Differential Equations.",
            "Algorithm 565: PDETWO/PSETM/GEARB: Solution of Systems of Two-Dimensional Nonlinear Partial Differential Equations [D3].",
            "Algorithm 566: FORTRAN Subroutines for Testing Unconstrained Optimization Software [C5], [E4].",
            "Algorithm 567: Extended-Range Arithmetic and Normalized Legendre Polynomials [A1], [C1].",
            "A Block Lanczos Method for Computing the Singular Values and Corresponding Singular Vectors of a Matrix.",
            "A Parallel Method for Tridiagonal Equations.",
            "A Simultaneous Iteration Algorithm for Real Matrices.",
            "Evaluation and Inversion of the Ratios of Modified Bessel Functions, I1(x) /I0 (x) and I 1.5(x)/ I0.5(x).",
            "Collocation Software for Boundary-Value ODEs.",
            "Algorithm 569: COLSYS: Collocation Software for Boundary-Value ODEs [D2].",
            "Algorithm 570: LOPSI: A Simultaneous Iteration Method for Real Matrices [F2].",
            "Algorithm 571: Statistics for von Mises' and Fisher's Distributions of Directions: I1(x) /I0 (x), I 1.5(x)/ I0.5(x)and Their Inverses [S14].",
            "Algorithm 572: Solution of the Helmholtz Equation for the Dirichlet Problem on General Bounded Three-Dimensional Regions [D3].",
            "Remark on \"Algorithm 395: Student's t-Distribution [S14]\".",
            "Remark on \"Algorithm 396: Student's t-Quantiles [S14]\".",
            "Corrigenda: \"Double Integration Using One-Dimensional Adaptive Quadrature Routines: A Software Interface Problem\".",
            "On the calculation of the effects of roundoff errors.",
            "Software for Doubled-Precision Floating-Point Computations.",
            "Cross-Bispectrum Computation and Variance Estimation.",
            "A Set of Library Routines for Solving Parabolic Equations in One Space Variable.",
            "On Algorithms for Obtaining a Maximum Transversal.",
            "An Algorithm for Computing a Shape-Preserving Osculatory Quadratic Spline.",
            "An Adaptive Nonlinear Least-Squares Algorithm.",
            "Algorithm 573: NL2SOL - An Adaptive Nonlinear Least-Squares Algorithm [E4].",
            "Algorithm 574: Shape-Preserving Osculatory Quadratic Splines [E1, E2].",
            "Algorithm 575: Permutations for a Zero-Free Diagonal [F1].",
            "Algorithm 576: A FORTRAN Program for Solving Ax=b[F4].",
            "Algorithm 577: Algorithms for Incomplete Elliptic Integrals [S21].",
            "Remark on \"Algorithm 498: Airy Functions Using Chebyshev Series Approximations\".",
            "Evaluation of a Test Set for Stiff ODE Solvers.",
            "Control of Interpolatory Error in Retarded Differential Equations.",
            "A Simple but Realistic Model of Floating-Point Computation.",
            "The Design of the XMP Linear Programming Library.",
            "An Efficient Algorithm for Determining the Length of the Longest Dead Path in a \"LIFO\" Branch-and-Bound Exploration Schema.",
            "ME28: A Sparse Unsymmetric Linear Equation Solver for Complex Equations.",
            "Numerical Differentiation of Analytic Functions.",
            "Solving Large Full Sets of Linear Equations in a Paged Virtual Store.",
            "Algorithm 578: Solution of Real Linear Equations in a Paged Virtual Store [F4].",
            "Algorithm 579: CPSC: Complex Power Series Coefficients [D4].",
            "Algorithm 580: QRUP: A Set of FORTRAN Routines for Updating QR Factorizations [F5]."
        ]
    },
    {
        "name": "TOMS",
        "year": "1980",
        "info": "Volume 6: 1980",
        "count": 57,
        "papers": [
            "Computational Comparison of Eight Methods for the Maximum Network Flow Problem.",
            "A Comparative Study of Two Methods for Staircase Linear Programs.",
            "A Mathematical Program Generator MPGENR.",
            "Automatic Curve Fitting Using an Adaptive Local Algorithm.",
            "Recursive Estimation of the Variance of the Sample Average.",
            "Internal Sorting Using a Minimal Tree Merge Strategy.",
            "SOLVEBLOK: A Package for Solving Almost Block Diagonal Linear Systems.",
            "Algorithm 546: SOLVEBLOK [F4].",
            "Algorithm 547: Fortran Routines for Discrete Cubic Spline Interpolation and Smoothing [E1], [E3].",
            "Algorithm 548: Solution of the Assignment Problem [H].",
            "Algorithm 549: Weierstrass' Elliptic Functions [S21].",
            "Algorithm 550: Solid Polyhedron Measures [Z].",
            "ACM Algorithms Distribution Service Expanded.",
            "A Numerical Library and Its Support.",
            "An AUGMENT Interface for Brent's Multiple Precision Arithmetic Package.",
            "Automatic Differentiation of Computer Programs.",
            "On a Data Structure for Adaptive Finite Element Mesh Refinements.",
            "An Implementation of a Class of Stabilized Explicit Methods for the Time Integration of Parabolic Equations.",
            "Solving Sparse Symmetric Sets of Linear Equations by Preconditioned Conjugate Gradients.",
            "L1 Solution of Overdetermined Systems of Linear Equations.",
            "Algorithm 551: A Fortran Subroutine for the L1 Solution of Overdetermined Systems of Linear Equations [F4].",
            "Algorithm 552: Solution of the Constrained I1 Linear Approximation Problem [F4].",
            "Algorithm 553: M3RK, An Explicit Time Integrator for Semidiscrete Parabolic Equations [D3].",
            "Algorithm 554: BRENTM, A Fortran Subroutine for the Numerical Solution of Nonlinear Equations [C5].",
            "Algorithm 555: Chow-Yorke Algorithm for Fixed Points or Zeros of C2 Maps [C5].",
            "Runge-Kutta Starters for Multistep Methods.",
            "On Taylor Series and Stiff Equations.",
            "An Alternative Implementation of Variable Step-Size Multistep Formulas for Stiff ODEs.",
            "A Note About Overhead Costs in ODE Solvers.",
            "A System of Subroutines for Iteratively Reweighted Least Squares Computations.",
            "A Fast Implementation of the Minimum Degree Algorithm Using Quotient Graphs.",
            "Generating Sorted Lists of Random Numbers.",
            "Computation of Exponential Integrals.",
            "PAGP, A Partitioning Algorithm for (Linear) Goal Programming Problems.",
            "Multifacility Location Problem with Rectilinear Distance by the Minimum-Cut Approach.",
            "A Compact Algorithm for Computing the Stationary Point of a Quadratic Function Subject to Linear Constraints.",
            "An Algorithm for Numerical Computation of the Jordan Normal Form of a Complex Matrix.",
            "Algorithm 556: Exponential Integrals [S13].",
            "Algorithm 557: PAGP, A Partitioning Algorithm for (Linear) Goal Programming Problems [H].",
            "Algorithm 558: A Program for the Multifacility Location Problem with Rectilinear Distance by the Minimum-Cut Approach [H].",
            "Algorithm 559: The Stationary Point of a Quadratic Function Subject to Linear Constraints [E4].",
            "Algorithm 560: JNF, An Algorithm for Numerical Computation of the Jordan Normal Form of a Complex Matrix [F2].",
            "Algorithm 561: Fortran Implementation of Heap Programs for Efficient Table Maintenance [Z].",
            "Algorithm 562: Shortest Path Lengths [H].",
            "Remark on \"Algorithm 408: A Sparse Matrix Package (Part 1) [F4]\".",
            "A Survey of Software for Partial Differential Equations.",
            "PERUSE: An Interactive System for Mathematical Programs.",
            "Environment Parameters and Basic Functions for Floating-Point Computation.",
            "Computing the Singular-Value Decomposition on the ILLIAC IV.",
            "Fixed Leading Coefficient Implementation of SD-Formulas for Stiff ODEs.",
            "Optimal Expected-Time Algorithms for Closest Point Problems.",
            "On Temme's Algorithm for the Modified Bessel Function of the Third Kind.",
            "A Test Problem Generator for Discrete Linear L1 Approximation Problems.",
            "Linearly Constrained Discrete l1 Problems.",
            "Algorithm 563: A Program for Linearly Constrained Discrete l1 Problems.",
            "Algorithm 564: A Test Problem Generator for Discrete Linear L1 Approximation Problems.",
            "Remark on \"Algorithm 500: Minimization of Unconstrained Multivariate Functions [E4]\"."
        ]
    },
    {
        "name": "TOMS",
        "year": "1979",
        "info": "Volume 5: 1979",
        "count": 54,
        "papers": [
            "Design of an Adaptive, Parallel Finite-Element System.",
            "Some Design Features of a Sparse Matrix Code.",
            "Numerical Solution of Helmholtz's Equation by Implicit Capacitance Matrix Methods.",
            "Software for Interval Arithmetic: A Reasonably Portable Package.",
            "Numerical Solution of Nonlinear Equations.",
            "An Experimental Algorithm for N-Dimensional Adaptive Quadrature.",
            "An Efficient One-Way Enciphering Algorithm.",
            "Algorithm 536: An Efficient One-Way Enciphering Algorithm [Z].",
            "Algorithm 537: Characteristic Values of Mathieu's Differential Equation.",
            "Algorithm 538: Eigenvectors, Eigenvalues of Real Generalized Symmetric Matrices by Simultaneous Iteration [F2].",
            "ACM Algorithms Policy.",
            "A More Portable Fortran Random Number Generator.",
            "The Design of a User Interface for a Sparse Matrix Package.",
            "Combination Generators.",
            "Efficient Computer Manipulation of Tensor Products.",
            "Analysis of an Algorithm for Finding Nearest Neighbors in Euclidean Space.",
            "On Reporting Computational Experiments with Mathematical Software.",
            "A Versatile Precompiler for Nonstandard Arithmetics.",
            "Symbolic Computation of Padé Approximants.",
            "Addendum to \"Analytically Solving Integral Equations by Using Computer Algebra\".",
            "Remark on \"Algorithm 395: Student's t-Distribution\" and Remark on \"Algorithm 396: Student's Quantiles [S14]\".",
            "Remark on \"Algorithm 424: Clenshaw-Curtis Quadrature [O1]\".",
            "Remark on \"Algorithm 474: Bivariate Interpolation and Smooth Surface Fitting Based on Local Procedures\".",
            "Remark on \"Algorithm 526: Bivariate Interpolation and Smooth Surface Fitting for Irregularly Distributed Data Points [E1]\".",
            "Storage Reduction for Runge-Kutta Codes.",
            "Solving the Biharmonic Equation on Irregular Regions.",
            "The Design and Structure of a Fortran Program Library for Optimization.",
            "An Implementation of a Pseudoperipheral Node Finder.",
            "A Single-Point Exchange Algorithm for Approximating Functions of Two Variables.",
            "Basic Linear Algebra Subprograms for Fortran Usage.",
            "Algorithm 539: Basic Linear Algebra Subprograms for Fortran Usage [F1].",
            "Algorithm 540: PDECOL, General Collocation Software for Partial Differential Equations [D3].",
            "Algorithm 541: Efficient Fortran Subprograms for the Solution of Separable Elliptic Partial Differential Equations [D3].",
            "Certification of \"Algorithm 541: Efficient Fortran Subprograms for the Solution of Separable Elliptic Partial Differential Equations [D3]\".",
            "Errata: \"Efficient Calculation of the Effects of Roundoff Errors\".",
            "Editor's Note.",
            "Automatic Partitioning of Stiff Systems and Exploiting the Resulting Structure.",
            "Initial Value Routines in the NAG Library.",
            "Automatic Solution of Differential Equations Based on the User of Linear Multistep Methods.",
            "Global Error Estimation in Adams PC-Codes.",
            "High-Order Fast Elliptic Equation Solvers.",
            "Application of Dense Householder Transformation to a Sparse Matrix.",
            "On Computing the Smith Normal Form of an Integer Matrix.",
            "Solutions to Weighted Least Squares Problems by Modified Gram-Schmidt with Iterative Refinement.",
            "A Computational Procedure for Incomplete Gamma Functions.",
            "Algorithm 542: Incomplete Gamma Functions [S14].",
            "Algorithm 543: FFT9, Fast Solution of Helmholtz-Type Partial Differential Equations [D3].",
            "Algorithm 544: L2A and L2B, Weighted Least Squares Solutions by Modified Gram-Schmidt with Iterative Refinement [F4].",
            "Algorithm 545: An Optimized Mass Storage FFT [C6].",
            "Remark on \"Algorithm 524: MP, A Fortran Multiple-Precision Arithmetic Package [A1]\".",
            "Remark on \"Algorithm 513: Analysis of In-Situ Transposition [F1]\" and Remark on \"Algorithm 467: Matrix Transposition in Place\".",
            "Remark on \"Algorithm 475: Visible Surface Plotting Program\".",
            "Remark on \"Algorithm 528: Framework for a Portable Library [Z]\".",
            "Corrigenda: \"Efficient Computer Manipulation of Tensor Products\"."
        ]
    },
    {
        "name": "TOMS",
        "year": "1978",
        "info": "Volume 4: 1978",
        "count": 43,
        "papers": [
            "Sensitivity Analysis Procedures for Geometric Programs: Computational Aspects.",
            "A Portable Fortran Program to Find the Euclidean Norm of a Vector.",
            "Some MACSYMA Programs for Solving Recurrence Relations.",
            "Design and Testing of a Generalized Reduced Gradient Code for Nonlinear Programming.",
            "On Multipoint Numerical Interpolation.",
            "A Fortran Multiple-Precision Arithmetic Package.",
            "Algorithm 524: MP, A Fortran Multiple-Precision Arithmetic Package [A1].",
            "Algorithm 525: ADAPT, Adaptive Smooth Curve Fitting [E2].",
            "Remark on \"Fortran Translation of Algorithm 409: Discrete Chebychev Curve Fit [E2]\".",
            "Remark on \"Algorithm 149: Complete Elliptic Integral [S21]\".",
            "Algorithms Policy.",
            "Parametrization of the Environment for Transportable Numerical Software.",
            "The PORT Mathematical Subroutine Library.",
            "Improving the Efficiency of Matrix Operations in the Numerical Solution of Stiff Ordinary Differential Equations.",
            "An Implementation of Tarjan's Algorithm for the Block Triangularization of a Matrix.",
            "A Method of Bivariate Interpolation and Smooth Surface Fitting for Irregularly Distributed Data Points.",
            "Algorithm 526: Bivariate Interpolation and Smooth Surface Fitting for Irregularly Distributed Data Points [E1].",
            "Algorithm 527: A Fortran Implementation of the Generalized Marching Algorithm [D3].",
            "Algorithm 528: Framework for a Portable Library [Z].",
            "Algorithm 529: Permutations To Block Triangular Form [F1].",
            "Automatic Solution of the Sturm-Liouville Problem.",
            "TEDDY2, A Program Package for Parabolic Composite Region Problems.",
            "Efficient Calculation of the Effects of Roundoff Errors.",
            "The Subresultant PRS Algorithm.",
            "Two Fast Algorithms for Sparse Matrices: Multiplication and Permuted Transposition.",
            "Practical Parallel Band Triangular Systems Solvers.",
            "Eigensystem Computation for Skew-Symmetric and a Class of Symmetric Matrices.",
            "Algorithm 530: An Algorithm for Computing the Eigensystem of Skew-Symmetric Matrices and a Class of Symmetric Matrices [F2].",
            "Algorithm 531: Contour Plotting [J6].",
            "Remark on \"Algorithm 49: Spherical Neumann Function\".",
            "Remark on \"Algorithm 408: A Sparse Matrix Package (Part I) [F4]\".",
            "Remark on \"Algorithm 435: Modified Incomplete Gamma Function [S14]\".",
            "Stability Analysis of Certain Runge-Kutta Procedures for Volterra Integral Equations.",
            "An Investigation of Romberg Quadrature.",
            "Stability Properties of Adams Codes.",
            "Algorithms for Sparse Gaussian Elimination with Partial Pivoting.",
            "A Stiffly Stable Integration Process Using Cyclic Composite Methods.",
            "Software for Roundoff Analysis II.",
            "Algorithm 532: Software for Roundoff Analysis [Z].",
            "Algorithm 533: NSPIV, A Fortran Subroutine for Sparse Gaussian Elimination with Partial Pivoting [F4].",
            "Algorithm 534: STINT: STiff (differential equations) INTegrator [D2].",
            "Algorithm 535: The QZ Algorithm to Solve the Generalized Eigenvalue Problem for Complex Matrices [F2].",
            "Erratum: \"Algorithm 511: CDC 6600 Subroutines IBESS and JBESS for Bessel Functions Inu(x) and Jnu(x), x>=0, nu>=0 [S18]\"."
        ]
    },
    {
        "name": "TOMS",
        "year": "1977",
        "info": "Volume 3: 1977",
        "count": 46,
        "papers": [
            "The Exact Solution of Linear Equations with Rational Function Coefficients.",
            "Automatic Error Analysis Using Computer Algebraic Manipulation.",
            "Stiff and Nonstiff Differential Equation Solvers, II: Detecting Stiffness with Runge-Kutta Methods.",
            "Floating Point Fast Fourier Transform Computation Using Double Precision Floating Point Accumulators.",
            "An Efficient Algorithm for the Kolmogorov-Smirnov and Lilliefors Tests.",
            "Some Thoughts on the QZ Algorithm for Solving the Generalized Eigenvalue Problem.",
            "CDC 6600 Subroutines IBESS and JBESS for Bessel Functions Inu(x) and Jnu(x), x >= 0, nu >= 0.",
            "Algorithm 511: CDC 6600 Subroutines IBESS and JBESS for Bessel Functions Inu(x) and Jnu(x), x >= 0, nu >= 0 [S18].",
            "Algorithm 512: A Normalized Algorithm for Solution of the Positive Definite Symmetric Quindiagonal Systems of Linear Equations [F4].",
            "Algorithm 513: Analysis of In-Situ Transposition [F1].",
            "Remark on \"Algorithm 486: Numerical Inversion of Laplace Transform\".",
            "Remark on \"Algorithm 500: Minimization of Unconstrained Multivariate Functions [E4]\".",
            "Portability of Mathematical Software Coded in Fortran.",
            "Analytically Solving Integral Equations by Using Computer Algebra.",
            "A Comparison of Algorithms for the Exact Solution of Linear Equations.",
            "The Solution of a Special Set of Hermitian Toeplitz Linear Equations.",
            "Curve Fitting by a One-Pass Method With a Piecewise Cubic Polynomial.",
            "Algorithm 514: A New Method of Cubic Curve Fitting Using Local Data [E2].",
            "Algorithm 515: Generation of a Vector from the Lexicographical Index [G6].",
            "Algorithm 516: An Algorithm for Obtaining Confidence Intervals and Point Estimates Based on Ranks in the Two Sample Location Problem [G1].",
            "Algorithm 517: A Program for Computing the Condition Numbers of Matrix Eigenvalues Without Computing Eigenvectors [F2].",
            "Remark on \"Some Performance Tests of Quicksort and Descendants\".",
            "Remark on \"Algorithm 259: Legendre Functions for Arguments Larger than One\".",
            "An Algorithm for Finding Best Matches in Logarithmic Expected Time.",
            "The Matrix Rearrangement Procedure for Graph-Theoretical Algorithms and Its Application to the Generation of Fundamental Cycles.",
            "The Computation of Real Fractional Order Bessel Functions of the Second Kind.",
            "Evaluation of Repeated Integrals of the Coerror Function.",
            "An Efficient Method for Generating Discrete Random Variables with General Distributions.",
            "Computer Generation of Random Variables Using the Ratio of Uniform Deviates.",
            "Symbolic Solution of Finite-Difference Equations.",
            "An Algorithm for Deciding the Convergence of the Rational Iteration xn+1 = f(xn).",
            "Algorithm 518: Incomplete Bessel Function I0. The Von Mises Distribution [S14].",
            "Algorithm 519: Three Algorithms for Computing Kolmogorov-Smirnov Probabilities with Arbitrary Boundaries and a Certification of Algorithm 487 [S14].",
            "Algorithm 520: An Automatic Revised Simplex Method for Constrained Resource Network Scheduling [H].",
            "Algorithm 521: Repeated Integrals of the Coerror Function [S15].",
            "Remark on \"Algorithm 408: A Sparse Matrix Package (Part I) [F4]\".",
            "Remark on \"Algorithm 219: Topological Ordering for PERT Networks\".",
            "A Simulation Test Approach to the Evaluation of Nonlinear Optimization Algorithms.",
            "Piecewise Quadratic Approximations on Triangles.",
            "Blended Linear Multistep Methods.",
            "Normal Random Numbers: Using Machine Analysis to Choose the Best Algorithm.",
            "An Improved Program for the Full Steiner Tree Problem.",
            "Congruence Techniques for the Exact Solution of Integer Systems of Linear Equations.",
            "A New Convex Hull Algorithm for Planar Sets.",
            "Algorithm 522: ESOLVE, Congruence Techniques for the Exact Solution of Integer Systems of Linear Equations [F4].",
            "Algorithm 523: CONVEX, A New Convex Hull Algorithm for Planar Sets [Z]."
        ]
    },
    {
        "name": "TOMS",
        "year": "1976",
        "info": "Volume 2: 1976",
        "count": 49,
        "papers": [
            "Parallel Algorithms for Adaptive Quadrature. III. Program Correctness.",
            "The Algebraic Solution of Sparse Linear Systems via Minor Expansion.",
            "Generating and Compounding Product-Type Newton-Coates Quadrature Formulas.",
            "Improving a Poor Random Number Generator.",
            "Comments on the Nature of Automatic Quadrature Routines.",
            "Algorithm 499: An Efficient Scanning Technique [Z].",
            "Algorithm 500: Minimization of Unconstrained Multivariate Functions [E4].",
            "Algorithm 501: Fortran Translation of Algorithm 409, Discrete Chebychev Curve Fit [E2].",
            "Algorithm 502: Dependence of Solution of Nonlinear Systems on a Parameter [C5].",
            "Remark on \"Algorithm 434: Exact Probabilities for R * C Contingency Tables [G2]\".",
            "Remark on \"Algorithm 475: Visible Surface Plotting Program [J6]\".",
            "Remark on \"Algorithm 479: A Minimal Spanning Tree Clustering Method [Z]\".",
            "Remark on \"Algorithm 487: Exact Cumulative Distribution of the Kolmogorov-Smirnov Statistic for Small Samples [S14]\".",
            "Remark on \"Algorithm 490: The Dilogarithm Function of a Real Argument [S22]\".",
            "TOMS Policy Statement: The Rights of Program Authors in the Evaluation of Programs.",
            "Developing a Single Numerical Algorithms Library for Different Machine Ranges.",
            "Should the Elementary Function Library Be Incorporated Into Computer Instruction Sets?",
            "A List Insertion Sort for Keys With Arbitrary Key Distribution.",
            "An Automatic Program for Linear Fredholm Integral Equations of the Second Kind.",
            "Global Error Estimates for Ordinary Differential Equations.",
            "Implementation of a Convective Problem Requiring Auxiliary Storage.",
            "Algorithm 503: An Automatic Program for Fredholm Integral Equations of the Second Kind [D5].",
            "Algorithm 504: GERK: Global Error Estimation For Ordinary Differential Equations [D].",
            "Algorithm 505: A List Insertion Sort for Keys with Arbitrary Key Distribution [S20].",
            "Remark on \"Algorithm 179: Incomplete Beta Ratio [S14]\".",
            "Remark on \"Algorithm 433: Interpolation and Smooth Curve Fitting Based on Local Procedures [E2]\".",
            "A Portable Extended Precision Arithmetic Package and Library With Fortran Precompiler.",
            "Analysis of Algorithms, A Case Study: Determinants of Matrices with Polynomial Entries.",
            "A Comparison of Algorithms for Solving Symmetric Indefinite Systems of Linear Equations.",
            "Hermite Interpolation Using a Triangular Polynomial Basis.",
            "Numerical Solution of Steady State Heat Flow Problems Over Curved Domains.",
            "Algorithm 506: HQR3 and EXCHNG: Fortran Subroutines for Calculating and Ordering the Eigenvalues of a Real Upper Hessenberg Matrix [F2].",
            "Algorithm 507: Procedures for Quintic Natural Spline Interpolation [E1].",
            "Survey on Algorithms 347, 426, and Quicksort.",
            "Remark on \"Algorithm 450: Rosenbrock Function Minimization [E4]\".",
            "Remark on \"Algorithm 489: The Algorithm SELECT - for Finding the ith Smallest of n Elements [M1]\".",
            "The Use of Algorithms of Piecewise Approximations for Picture Processing Applications.",
            "A Comparison of Several Bandwidth and Profile Reduction Algorithms.",
            "A Comparison of Three Algorithms for Linear Zero-One Programs.",
            "Factoring Polynomials Over Algebraic Number Fields.",
            "An Exact Method for Finding the Roots of a Complex Polynomial.",
            "Partition of Integers.",
            "Algorithm 508: Matrix Bandwidth and Profile Reduction [F1].",
            "Algorithm 509: A Hybrid Profile Reduction Algorithm [F1].",
            "Algorithm 510: Piecewise Linear Approximation to Tabulated Data [E2].",
            "Remark on \"Algorithm 284: Interchange of Two Blocks of Data [K2]\".",
            "Remark on \"Algorithm 299: Chi-Squared Integral [S15]\".",
            "Remark on \"Algorithm 486: Numerical Inversion of Laplace Transform [D5]\".",
            "Remark on \"Algorithm 496: The LZ Algorithm to Solve the Generalized Eigenvalue Problem for Complex Matrices [F2]\"."
        ]
    },
    {
        "name": "TOMS",
        "year": "1975",
        "info": "Volume 1: 1975",
        "count": 36,
        "papers": [
            "Purpose and Scope.",
            "Algorithms Distribution Service.",
            "Algorithms Policy.",
            "Papers from Mathematical Software II.",
            "The FUNPACK Package of Special Function Subroutines.",
            "Principles for Testing Polynomial Zerofinding Programs.",
            "The Influence of the Compiler on the Cost of Mathematical Software - In Particular on the Cost of Triangular Factorization.",
            "Real World Applications of Network Related Problems and Breakthroughs in Solving Them Efficiently.",
            "A Comparison of Computational Methods and Algorithms for the Complex Gamma Function.",
            "A Polyalgorithm for the Numerical Solution of Ordinary Differential Equations.",
            "A View of Unconstrained Minimization Algorithms that Do Not Require Derivatives.",
            "Software for Roundoff Analysis.",
            "Local Versus Global Strategies for Adaptive Quadrature.",
            "Analytical Optimization Using Computer Algebraic Manipulation.",
            "Some Experience with Constructing, Testing, and Certifying a Standard Mathematical Subroutine Library.",
            "Algorithm 493: Zeros of a Real Polynomial [C2].",
            "Software Package Policy.",
            "Usage and Argument Monitoring of Mathematical Library Routines.",
            "Algorithms to Reveal the Representation of Characters, Integers, and Floating-Point Numbers.",
            "Computable Accurate Upper and Lower Error Bounds for Approximate Solutions of Linear Algebraic Systems.",
            "Software for Nonlinear Partial Differential Equations.",
            "Algorithm 494: PDEONE, Solutions of Systems of Partial Differential Equations [D3].",
            "Algorithm 495: Solution of an Overdetermined System of Linear Equations in the Chebychev Norm [F4].",
            "Algorithm 496: The LZ Algorithm to Solve the Generalized Eigenvalue Problem for Complex Matrices [F2].",
            "Remark on \"Algorithm 236: Bessel Functions of the First Kind [S17]\".",
            "Remark on \"Algorithm 483: Masked Three-Dimensional Plot Program with Rotations [J6]\".",
            "Remark on \"Algorithm 246: Graycode [Z]\".",
            "Parallel Tridiagonal Equation Solvers.",
            "The Solution of Tridiagonal Linear Systems on the CDC STAR 100 Computer.",
            "Two Efficient Algorithms with Guaranteed Convergence for Finding a Zero of a Function.",
            "Computing with Formal Power Series.",
            "Automatic Integration of Functional Differential Equations: An Approach.",
            "Algorithm 497: Automatic Integration of Functional Differential Equations [D2].",
            "Algorithm 498: Airy Functions Using Chebyshev Series Approximations.",
            "Certification of \"Algorithm 349: Polygamma Functions with Arbitrary Precision\".",
            "Certification of \"Algorithm 475: Visible Surface Plotting Program [J6]\"."
        ]
    }
]