[
    {
        "year": "2022",
        "name": "20th APBC 2022",
        "info": "Virtual Event, Malaysia",
        "venues": []
    },
    {
        "year": "2021",
        "name": "19th APBC 2021",
        "info": "Tainan, Taiwan / Virtual Conference",
        "venues": []
    },
    {
        "year": "2020",
        "name": "18th APBC 2020",
        "info": "Seoul, Korea",
        "venues": []
    },
    {
        "year": "2019",
        "name": "17th APBC 2019",
        "info": "Wuhan, China",
        "venues": []
    },
    {
        "year": "2018",
        "name": "16th APBC 2018",
        "info": "Yokohama, Japan",
        "venues": []
    },
    {
        "year": "2017",
        "name": "15th APBC 2017",
        "info": "Shenzhen, China",
        "venues": []
    },
    {
        "year": "2016",
        "name": "14th APBC 2016",
        "info": "San Francisco, USA",
        "venues": []
    },
    {
        "year": "2015",
        "name": "13th APBC 2015",
        "info": "HsinChu, Taiwan",
        "venues": []
    },
    {
        "year": "2014",
        "name": "12th APBC 2014",
        "info": "Shanghai, China",
        "venues": []
    },
    {
        "year": "2013",
        "name": "11th APBC 2013",
        "info": "Vancouver, BC, Canada",
        "venues": []
    },
    {
        "year": "2012",
        "name": "10th APBC 2012",
        "info": "Melbourne, Australia",
        "venues": []
    },
    {
        "year": "2011",
        "name": "9th APBC 2011",
        "info": "Inchon, Korea",
        "venues": []
    },
    {
        "year": "2010",
        "name": "8th APBC 2010",
        "info": "Bangalore, India",
        "venues": []
    },
    {
        "year": "2009",
        "name": "7th APBC 2009",
        "info": "Beijing, China",
        "venues": []
    },
    {
        "year": "2008",
        "name": "6th APBC 2008",
        "info": "Kyoto, Japan",
        "venues": [
            {
                "sub_name_abbr": "conf/apbc/2008",
                "sub_name": "Proceedings of the 6th Asia-Pacific Bioinformatics Conference, APBC 2008, 14-17 January 2008, Kyoto, Japan.",
                "count": 40,
                "papers": [
                    "Preface.",
                    "Recent Progress in Phylogenetic Combinatorics.",
                    "KEGG for Medical and Pharmaceutical Applications.",
                    "Protein Interactions Extracted from Genomes and Papers.",
                    "String Kernels with Feature Selection for SVM Protein Classification.",
                    "Predicting Nucleolar Proteins Using Support-Vector Machines.",
                    "Supervised Ensembles of Prediction Methods for Subcellular Localization.",
                    "Chemical Compound Classification with Automatically Mined Structure Patterns.",
                    "Structure-Approximating Design of Stable Proteins in 2D HP Model Fortified by Cysteine Monomers.",
                    "Discrimination of Native Folds Using Network Properties of Protein Structures.",
                    "Interacting Amino Acid Preferences of 3D Pattern Pairs at the Binding Sites of Transient and Obligate Protein Complexes.",
                    "Structural Descriptors of Protein-Protein Binding Sites.",
                    "A Memory Efficient Algorithm for Structural Alignment of RNAs with Embedded Simple Pseudoknots.",
                    "A Novel Method for Reducing Computational Complexity of Whole Genome Sequence Alignment.",
                    "fRMSDAlign: Protein Sequence Alignment Using Predicted Local Structure Information for Pairs with Low Sequence Identity.",
                    "Run Probability of High-Order Seed Patterns and its Applications to Finding Good Transition Seeds.",
                    "Seed Optimization Is No Easier than Optimal Golomb Ruler Design.",
                    "Integrating Hierarchical Controlled Vocabularies With OWL Ontology: A Case Study from the Domain of Molecular Interactions.",
                    "Semantic Similarity Definition over Gene Ontology by Further Mining of the Information Content.",
                    "From Text to Pathway: Corpus Annotation for Knowledge Acquisition from Biomedical Literature.",
                    "Classification of Protein Sequences Based on Word Segmentation Methods.",
                    "Analysis of Structural Strand Asymmetry in Non-coding RNAs.",
                    "Finding Non-coding RNAs Through Genome-Scale Clustering.",
                    "A Fixed-Parameter Approach for Weighted Cluster Editing.",
                    "Image Compression-based Approach to Measuring the Similarity of Protein Structures.",
                    "Genome Halving with Double Cut and Join.",
                    "Phylogenetic Reconstruction from Complete Gene Orders of Whole Genomes.",
                    "SPR-based Tree Reconciliation: Non-binary Trees and Multiple Solutions.",
                    "Alignment of Minisatellite Maps: A Minimum Spanning Tree-based Approach.",
                    "Metabolic Pathway Alignment (M-Pal) Reveals Diversity and Alternatives in Conserved Networks.",
                    "Automatic Modeling of Signal Pathways from Protein-Protein Interaction Networks.",
                    "Simultaneously Segmenting Multiple Gene Expression Time Courses by Analyzing Cluster Dynamics.",
                    "Symbolic Approaches for Finding Control Strategies in Boolean Networks.",
                    "Estimation of Population Allele Frequencies from Small Samples Containing Multiple Generations.",
                    "Linear Time Probabilistic Algorithms for the Singular Haplotype Reconstruction Problem from SNP Fragments.",
                    "Optimal Algorithm for Finding DNA Motifs with Nucleotide Adjacent Dependency.",
                    "Primer Selection Methods for Detection of Genomic Inversions and Deletions via PAMP.",
                    "GenePC and ASPIC Integrate Gene Predictions with Expressed Sequence Alignments To Predict Alternative Transcripts.",
                    "Comparing and Analysing Gene Expression Patterns Across Animal Species Using 4DXpress.",
                    "Near-sigmoid Modeling to Simultaneously Profile Genome-wide DNA Replication Timing and Efficiency in Single DNA Replication Microarray Studies."
                ]
            }
        ]
    },
    {
        "year": "2007",
        "name": "5th APBC 2007",
        "info": "Hong Kong, China",
        "venues": [
            {
                "sub_name_abbr": "conf/apbc/2007",
                "sub_name": "Proceedings of 5th Asia-Pacific Bioinformatics Conference, APBC 2007, 15-17 January 2007, Hong Kong, China.",
                "count": 39,
                "papers": [
                    "Preface.",
                    "Exploring Genomes of Distantly Related Mammals.",
                    "Bugs, Guts and Fat - A Systems Approach to the Metabolic 'Axis of Evil'.",
                    "Protein Identification via Spectral Networks Analysis.",
                    "etagenome Analysis using Megan.",
                    "Algorithmic Approaches to Selecting Control Clones in DNA Array Hybridization Experiments.",
                    "Subtle Motif Discovery for Detection of DNA Regulatory Sites.",
                    "An Effective Promoter Detection Method using the Adaboost Algorithm.",
                    "A New Strategy of Geometrical Biclustering for Microarray Data Analysis.",
                    "Using Formal Concept Analysis for Microarray Data Comparison.",
                    "An Efficient Biclustering Algorithm for Finding Genes with Similar Patterns in Time-series Expression Data.",
                    "Selecting Genes with Dissimilar Discrimination Strength for Sample Class Prediction.",
                    "Computing the All-Pairs Quartet Distance on a Set of Evolutionary Trees.",
                    "Computing the Quartet Distance Between Evolutionary Trees of Bounded Degree.",
                    "A Global Maximum Likelihood Super-Quartet Phylogeny Method.",
                    "A Randomized Algorithm for Comparing Sets of Phylogenetic Trees.",
                    "Protein Structure-Structure Alignment with Discrete Fr'echet Distance.",
                    "Deriving Protein Structure Topology from the Helix Skeletion in Low Resolution Density Map using Rosetta.",
                    "Fitting Protein Chains to Cubic Lattice is NP-Complete.",
                    "Inferring a Chemical Structure from a Feature Vector Based on Frequency of Labeled Paths and Small Fragments.",
                    "Exact and Heuristic Approaches for Identifying Disease-Associated SNP Motifs.",
                    "Genotype-Based Case-Control Analysis, Violation of Hardy-Weinberg Equilibrium, and Phase Diagrams.",
                    "A Probabilistic Method to Identify Compensatory Substitutions for Pathogenic Mutations.",
                    "Exploring Genome Rearrangements using Virtual Hybridization.",
                    "Two Plus Two Does not Equal Three: Statistical Tests for Multiple Genome Comparison.",
                    "The Distance Between Randomly Constructed Genomes.",
                    "Computing the Breakpoint Distance between Partially Ordered Genomes.",
                    "Inferring Gene Regulatory Networks by Machine Learning Methods.",
                    "A Novel Clustering Method for Analysis of Biological Networks using Maximal Components of Graphs.",
                    "Gene Regulatory Network Inference via Regression Based Topological Refinement.",
                    "Algorithm Engineering for Color-Coding to Facilitate Signaling Pathway Detection.",
                    "De Novo Peptide Sequencing for Mass Spectra Based on Multi-Charge Strong Tags.",
                    "Complexities and Algorithms for Glycan Structure Sequencing using Tandem Mass Spectrometry.",
                    "Semi-supervised Pattern Learning for Extracting Relations from Bioscience Texts.",
                    "Flow Model of the Protein-protein Interaction Network for Finding Credible Interactions.",
                    "All Hits All The Time: Parameter Free Calculation of Seed Sensitivity.",
                    "Fast Structural Similarity Search Based on Topology String Matching.",
                    "Simple and Fast Alignment of Metabolic Pathways by Exploiting Local Diversity.",
                    "Combining N-grams and Alignment in G-protein Coupling Specificity Prediction."
                ]
            }
        ]
    },
    {
        "year": "2006",
        "name": "4th APBC 2006",
        "info": "Taipei, Taiwan",
        "venues": [
            {
                "sub_name_abbr": "conf/apbc/2006",
                "sub_name": "Proceedings of 4th Asia-Pacific Bioinformatics Conference. 13-16 February 2006, Taipei, Taiwan.",
                "count": 39,
                "papers": [
                    "Preface.",
                    "On the Inference of Regulatory Elements, Circuits, and Modules.",
                    "Automating the Search for Lateral Gene Transfer.",
                    "Whole Genome Optical Mapping.",
                    "Accuracy of Four Heuristics for the Full Sibship Reconstruction Problem in the Presence of Genotype Errors.",
                    "Inference of Gene Regulatory Networks from Microarray Data: A Fuzzy Logic Approach.",
                    "System Identification and Robustness Analysis of the Circadian Regulatory Network via Microarray Data in Arabidopsis Thaliana.",
                    "Protein Subcellular Localisation Prediction with WoLF PSORT.",
                    "Predicting Ranked SCOP Domains by Mining Associations of Visual Contents in Distance Matrices.",
                    "RECOMP: A Parsimony-Based Method for Detecting Recombination.",
                    "AlignScope: A Visual Mining Tool for Gene Team Finding with Whole Genome Alignment.",
                    "An Efficient Algorithm for String Motif Discovery.",
                    "Discriminative Detection of Cis-Acting Regulatory Variation From Location Data.",
                    "On the Complexity of Finding Control Strategies for Boolean Networks.",
                    "Characterization of Multi-Charge Mass Spectra for Peptide Sequencing.",
                    "EDAM: An Efficient Clique Discovery Algorithm with Frequency Transformation for Finding Motifs.",
                    "A Recursive Method for Solving Haplotype Frequencies in Multiple Loci Linkage Analysis.",
                    "Trends in Codon and Amino Acid Usage in Human Pathogen Tropheryma Whipplei, the only Known Actinobacteria with Reduced Genome.",
                    "Consequences of Mutation, Selection, and Physico-Chemical Properties of Encoded Proteins on Synonymous Codon Usage in Adenoviruses.",
                    "Microarray Missing Value Imputation by Iterated Local Least Squares.",
                    "Property-Dependent Analysis of Aligned Proteins from Two Or More Populations.",
                    "A Generalized Output-Coding Scheme with SVM for Multiclass Microarray Classification.",
                    "Techniques for Assessing Phylogenetic Branch Support: A Performance Study.",
                    "Analyzing Inconsistency Toward Enhancing Integration of Biological Molecular Databases.",
                    "A Novel Approach for Structured Consensus Motif Inference Under Specificity and Quorum Constraints.",
                    "A Randomized Algorithm for Learning Mahalanobis Metrics: Application to Classification and Regression of Biological Data.",
                    "Disentangling the Role of Tetranucleotide in the Sequence-Dependence of DNA Conformation: A Molecular Dynamics Approach.",
                    "A New Neural Network for B-Turn Prediction: the Effect of Site-Specific Amino Acid Preference.",
                    "Identification of Over-Represented Combinations of Transcription Factor Binding Sites in Sets of Co-Expressed Genes.",
                    "A Knowledge-Based Approach to Protein Local Structure Prediction.",
                    "Identification of MicroRNA Precursors via SVM.",
                    "Genome Wide Computational Analysis of Small Nuclear RNA Genes for Oryza Sativa (Indica and Japonica).",
                    "Resolving the Gene Tree and Species Tree Problem by Phylogenetic Mining.",
                    "Characterization of the Existence of Galled-Tree Networks.",
                    "Semi-Supervised Threshold Queries on Pharmacogenomics Time Sequences.",
                    "Structure-Based Chemical Shift Prediction Using Random Forests Non-Linear Regression.",
                    "ONBRIRES: Ontology-Based Biological Relation Extraction System.",
                    "A More Accurate and Efficient Whole Genome Phylogeny.",
                    "Gene Expression Data Clustering Based on Local Similarity Combination."
                ]
            }
        ]
    },
    {
        "year": "2005",
        "name": "3rd APBC 2005",
        "info": "Singapore",
        "venues": [
            {
                "sub_name_abbr": "conf/apbc/2005",
                "sub_name": "Proceedings of 3rd Asia-Pacific Bioinformatics Conference, 17-21 January 2005, Singapore.",
                "count": 40,
                "papers": [
                    "Preface.",
                    "Allowing mismatches in anchors for wholw genome alignment: Generation and effectiveness.",
                    "A better gap penalty for pairwise SVM.",
                    "High dimensional indexing for protein structure matching using bowties.",
                    "A graph database with visual queries for genomics.",
                    "Improved algorithms for multiplex PCR primer set selection with amplification length constraints.",
                    "Clique-based algorithms for protein threading with profiles and constraints.",
                    "Classification of protein 3D folds by hidden Markov learning on sequences of structural alphabets.",
                    "Consensus fold recognition by predicted model quality.",
                    "Profiles and fuzzy K-nearest neighbor algorithm for protein secondary structure prediction.",
                    "Protein folding trajectory analysis using patterned clusters.",
                    "The use of functional domains to improve transmembrane protein topology prediction.",
                    "A novel method for protein subcellular localization: Combining residue-couple model and SVM.",
                    "Detecting residues in targeting peptides.",
                    "BLOMAP: An encoding of amino acids which improves signal peptide cleavage site prediction.",
                    "Cells In Silico (CIS): A biomedical simulation framework based on Markov random field.",
                    "Toward discovering disease-specific gene networks from online literature.",
                    "A new regulatory interaction suggested by simulations for circadian genetic control mechanism in mammals.",
                    "PRIME: Peptide robust identification from MS/MS spectra.",
                    "SVM-RFE peak selection for cancer classification with mass spectrometry data.",
                    "Hybrid registration for two-dimensional gel protein images.",
                    "Feature dimension reduction for microarray data analysis using locally linear embedding.",
                    "PLS and SVD based penalized logistic regression for cancer classification using microarray data.",
                    "Genetic algorithms and silhouette measures applied to microarray data classification.",
                    "Exact algorithms for motif search.",
                    "Exact algorithms for planted motif challenge problems.",
                    "Voting algorithms for discovering long motifs.",
                    "A highly scalable algorithm for the extraction of CIS-regulatory regions.",
                    "Modeling 5' regions of histone genes using Bayesian networks.",
                    "Unique peptide prediction of RNase family sequences based on reinforced merging algorithms.",
                    "Bacterial population assay via k-mer analysis.",
                    "A database to aid probe design for virus identification.",
                    "A support vector machine approach for prediction of T Cell epitopes.",
                    "Faster solution to the maximum quartet consistency problem with constraint programming.",
                    "Inferring phylogenetic relationships avoiding forbidden rooted triplets.",
                    "An O(N2) algorithm for signed translocation problem.",
                    "Protein informatics towards integration of data grid and computing grid.",
                    "Computing the Assignment of Orthologous Genes via Genome Rearrangement.",
                    "Comparison of core promoters in Fugu rubripes and human.",
                    "Trends in bioinformatics research and Singapore's role."
                ]
            }
        ]
    },
    {
        "year": "2004",
        "name": "2nd APBC 2004",
        "info": "Dunedin, New Zealand",
        "venues": [
            {
                "sub_name_abbr": "conf/apbc/2004",
                "sub_name": "Second Asia-Pacific Bioinformatics Conference (APBC 2004), January 18-22, 2004, Dunedin, New Zealand.",
                "count": 50,
                "papers": [
                    "Recognition Sequences in the Restriction Endonucleases.",
                    "The Future of Bioinformatics.",
                    "Constructing Genome Scale Suffix Trees.",
                    "Dispensation Order Generation for Pyrosequencing.",
                    "Phylogenetic Trees: An Information Visualisation Perspective.",
                    "Variable-length Intervals in Homology Search.",
                    "Classification Comparison of Prediction of Solvent Accessibility From Protein Sequences.",
                    "An Empirical Bayes Adjustment to Multiple p-values for the Detection of Differentially Expressed Genes in Microarray Experiments.",
                    "A Dihedral Angle Database of Short Sub-sequences for Protein Structure Prediction.",
                    "RNA Secondary Structure Prediction with Simple Pseudoknots.",
                    "EMAGEN: An Efficient Approach to Multiple Whole Genome Alignment.",
                    "Protein Side-chain Packing Problem: A Maximum Edge-weight Clique Algorithmic Approach.",
                    "Representing Experimental Biological Data in Metabolic Networks.",
                    "Molecular Imaging and Biomedical Process Modeling.",
                    "A Pathway Editor for Literature-based Knowledge Curation.",
                    "A Novel Feature Selection Method to Improve Classification of Gene Expression Data.",
                    "A Brief Introduction to the Phylogentics Analysis Library V1.5.",
                    "A Novel Method for Protein Subcellular Localization Based on Boosting and Probabilistic Neural Network..",
                    "A Rapid Method of Whole Genome Visualisation Illustrating Features in Both Coding and Non-coding Regions.",
                    "Evolving Genetic Regulatory Networks Using an Artificial Genome.",
                    "Detecting Local Symmetry Axis in 3-dimensional Virus Structures.",
                    "Empirical Knowledge and Genetic Algorithms for Selection of Amide I Frequencies in Protein Secondary Structure Prediction.",
                    "BRINet: A BioResource Integration Network.",
                    "Cluster Ensemble and Its Applications in Gene Expression Analysis.",
                    "Transmembrane Region Prediction with Hydropathy Index/Charge Two-Dimensional Trajectories of Stochastic Dynamical Systems.",
                    "Support Vector Machine Approach for Cancer Detection Using Amplified Fragment Length Polymorphism (AFLP) Screening Method..",
                    "Informative 3D Visualization of Multiple Protein Structures.",
                    "Use of Built-in Features in the Interpretation of High-dimensional Cancer Diagnosis Data..",
                    "Initial SARS Genome Data Analysis Using a Bioinformatics Platform.",
                    "Identifying Character Non-Independence in Phylogenetic Data Using Data Mining Techniques.",
                    "On the Simultaneous Use of Clinical and Microarray Expression Data in the Cluster Analysis of Tissue Samples.",
                    "Evolution of Relative Synonymous Codon Usage in Human Immunodeficiency Virus Type 1.",
                    "Integrating Biopathway Databases for Large-scale Modeling and Simulation.",
                    "Nonparametric Approaches to Detecting Differentially Expressed Genes in Replicated Microarray Experiments.",
                    "Whole-Genome Functional Classification of Genes by Latent Semantic Analysis on Microarray Data.",
                    "Towards a Theory of Protein Adsorption: Predicting the Adsorption of Proteins on Surfaces via a Piecewise Linear Model.",
                    "Ladderlike Stepping and Interval Jumping Searching Algorithms for DNA Sequences.",
                    "Multiple Sequence Alignment Using Tabu Search.",
                    "Structure-Function Relationship in DNA Sequence Recognition by Transcription Factors.",
                    "THEMATICS is Effective for Active Site Prediction in Comparative Model Structures.",
                    "Local Prediction Approach of Protein Classification using Probabilistic Suffix Trees.",
                    "Mega Weaver: A Simple Iterative Approach for BAC Consensus Assembly.",
                    "Filtering of Ineffective siRNAs and Improved siRNA Design Tool.",
                    "A Combined Model and a Varied Gibbs Sampling Algorithm Used for Motif Discovery.",
                    "Advanced Texturing Techniques for the Effective Visualization of Neoroanatomy from Diffusion Tensor Imaging Data.",
                    "Exact Pattern Matching for RNA Secondary Structures.",
                    "PathwayFinder: Paving the Way Towards Automatic Pathway Extraction.",
                    "Measuring Correlation between Microarray Time-series Data using Dominant Spectrum Component.",
                    "Using Emerging Pattern Based Projected Clustering and Gene Expression Data for Cancer Detection.",
                    "Phylogenetic Tree of Prokaryotes Based on the Complete Genomes using Fractal and Correlation Analyses."
                ]
            }
        ]
    },
    {
        "year": "2003",
        "name": "1st APBC 2003",
        "info": "Adelaide, Australia",
        "venues": [
            {
                "sub_name_abbr": "conf/apbc/2003",
                "sub_name": "First Asia-Pacific Bioinformatics Conference (APBC 2003), February 4-7, 2003, Adelaide, Australia.",
                "count": 26,
                "papers": [
                    "From Informatics to Bioinformatics.",
                    "Inferring an Original Sequence from Erroneous Copies : A Bayesian Approach.",
                    "A New Program to Compute the Surface Properties of Biomolecules.",
                    "Oracle's Technology for Bioinformatics and Future Directions.",
                    "Evaluation of Unique Sequences on the European Data Grid.",
                    "Towards Transparent Access to Multiple Biological Databanks.",
                    "A New Approach to Protein Structure and Function Analysis Using Semi-structured Databases.",
                    "BLAST++ : A Tool for BLASTing Queries in Batches.",
                    "Visualisation and Comparison of DNA Sequences by Use of Three-Dimensional Trajectories.",
                    "Comparison of Metabolic Pathways using Constraint Graph Drawing.",
                    "Microarray Image Processing Based on Clustering and Morphological Analysis.",
                    "The Visualization and Measurement of Left Ventricular Deformation.",
                    "Feature Space Transformation and Decision Results Interpretation.",
                    "Model-Based Clustering in Gene Expression Microarrays: An Application to Breast Cancer Data.",
                    "Gene Expression Data Clustering and Visualization Based on a Binary Heirarchical Clustering Framework.",
                    "Towards an understanding of protein-protein interaction network heirarchies. Analysis of DnaN-binding peptide motifs in members of protein families interacting with the eubacterial processivity clamp, the subunit of DNA Polymerase III.",
                    "A Framework for Improving Protein Structure Predictions by Teamwork.",
                    "A Platform for the Description, Distribution and Analysis of Genetic Polymorphism Data.",
                    "Analysing MEG-Data by a Combination of Different Neural Networks.",
                    "Machine Learning in DNA Microarray Analysis for Cancer Classification.",
                    "A Generic Connectionist-Based Method for On-Line Feature Selection and Modelling with a Case Study of Gene Expression Data Analysis.",
                    "Signals in mRNAs that Influence the Initiation of Translation.",
                    "Using Text Classification to Predict the Gene Knockout Behaviour of S. Cerevisiae.",
                    "Let the Shoemaker Make the Shoes - An Abstraction Layer is Needed Between Bioinformatic Analysis, Tools, Data and Equipment : An Agenda for the Next Five Years.",
                    "An Empirical Comparison of Supervised Machine Learning Techniques in Bioinformatics.",
                    "Novel Elastic Registration for 2-D Medical and Gel Protein Images."
                ]
            }
        ]
    }
]