[
    {
        "name": "Briefings in Bioinformatics",
        "year": "2022",
        "info": "Volume 23, 2022",
        "count": 310,
        "papers": [
            "Genome sequencing data analysis for rare disease gene discovery.",
            "Identifying multi-functional bioactive peptide functions using multi-label deep learning.",
            "MathFeature: feature extraction package for DNA, RNA and protein sequences based on mathematical descriptors.",
            "A similarity-based deep learning approach for determining the frequencies of drug side effects.",
            "Molecular persistent spectral image (Mol-PSI) representation for machine learning models in drug design.",
            "Heavy chain sequence-based classifier for the specificity of human antibodies.",
            "FedSPL: federated self-paced learning for privacy-preserving disease diagnosis.",
            "Tumor immune microenvironment lncRNAs.",
            "circRNA-binding protein site prediction based on multi-view deep learning, subspace learning and multi-view classifier.",
            "ZoomQA: residue-level protein model accuracy estimation with machine learning on sequential and 3D structural features.",
            "Distant metastasis identification based on optimized graph representation of gene interaction patterns.",
            "Computationally prioritized drugs inhibit SARS-CoV-2 infection and syncytia formation.",
            "Computational anti-COVID-19 drug design: progress and challenges.",
            "DeepCap-Kcr: accurate identification and investigation of protein lysine crotonylation sites based on capsule network.",
            "eSCAN: scan regulatory regions for aggregate association testing using whole-genome sequencing data.",
            "Predicting drug-drug interactions by graph convolutional network with multi-kernel.",
            "A novel convolution attention model for predicting transcription factor binding sites by combination of sequence and shape.",
            "Predicting miRNA-disease associations using an ensemble learning framework with resampling method.",
            "Machine learning methods, databases and tools for drug combination prediction.",
            "Assessing deep learning methods in cis-regulatory motif finding based on genomic sequencing data.",
            "A network-based method for brain disease gene prediction by integrating brain connectome and molecular network.",
            "Combining power of different methods to detect associations in large data sets.",
            "Prediction of drug-disease associations by integrating common topologies of heterogeneous networks and specific topologies of subnets.",
            "SGNNMD: signed graph neural network for predicting deregulation types of miRNA-disease associations.",
            "ResNet18DNN: prediction approach of drug-induced liver injury by deep neural network with ResNet18.",
            "EGFI: drug-drug interaction extraction and generation with fusion of enriched entity and sentence information.",
            "An overview of machine learning methods for monotherapy drug response prediction.",
            "Representation of molecules for drug response prediction.",
            "MAResNet: predicting transcription factor binding sites by combining multi-scale bottom-up and top-down attention and residual network.",
            "Comprehensive characterization genetic regulation and chromatin landscape of enhancer-associated long non-coding RNAs and their implication in human cancer.",
            "Artificial intelligence in drug discovery: applications and techniques.",
            "preMLI: a pre-trained method to uncover microRNA-lncRNA potential interactions.",
            "Two-stage-vote ensemble framework based on integration of mutation data and gene interaction network for uncovering driver genes.",
            "High dimensionality reduction by matrix factorization for systems pharmacology.",
            "SC-MEB: spatial clustering with hidden Markov random field using empirical Bayes.",
            "Locus-specific expression analysis of transposable elements.",
            "Genome optimization via virtual simulation to accelerate maize hybrid breeding.",
            "Network analytics for drug repurposing in COVID-19.",
            "Exploring the immune evasion of SARS-CoV-2 variant harboring E484K by molecular dynamics simulations.",
            "Integrative COVID-19 biological network inference with probabilistic core decomposition.",
            "Multiomics integration-based molecular characterizations of COVID-19.",
            "Detection of transcription factors binding to methylated DNA by deep recurrent neural network.",
            "A deep learning model to identify gene expression level using cobinding transcription factor signals.",
            "Positive-unlabeled learning in bioinformatics and computational biology: a brief review.",
            "MDF-SA-DDI: predicting drug-drug interaction events based on multi-source drug fusion, multi-source feature fusion and transformer self-attention mechanism.",
            "A point cloud-based deep learning strategy for protein-ligand binding affinity prediction.",
            "A versatile and scalable single-cell data integration algorithm based on domain-adversarial and variational approximation.",
            "PHIAF: prediction of phage-host interactions with GAN-based data augmentation and sequence-based feature fusion.",
            "ARIC: accurate and robust inference of cell type proportions from bulk gene expression or DNA methylation data.",
            "Minimal information for chemosensitivity assays (MICHA): a next-generation pipeline to enable the FAIRification of drug screening experiments.",
            "DeNOPA: decoding nucleosome positions sensitively with sparse ATAC-seq data.",
            "Development of interactive biological web applications with R/Shiny.",
            "miRPreM and tiRPreM: Improved methodologies for the prediction of miRNAs and tRNA-induced small non-coding RNAs for model and non-model organisms.",
            "CSM-carbohydrate: protein-carbohydrate binding affinity prediction and docking scoring function.",
            "The substitution spectra of coronavirus genomes.",
            "Network-based analysis revealed significant interactions between risk genes of severe COVID-19 and host genes interacted with SARS-CoV-2 proteins.",
            "Identification of potential therapeutic targets and mechanisms of COVID-19 through network analysis and screening of chemicals and herbal ingredients.",
            "A tale of solving two computational challenges in protein science: neoantigen prediction and protein structure prediction.",
            "KGANCDA: predicting circRNA-disease associations based on knowledge graph attention network.",
            "Detection of minor variants in Mycobacterium tuberculosis whole genome sequencing data.",
            "Challenges and opportunities in network-based solutions for biological questions.",
            "A deep learning method for repurposing antiviral drugs against new viruses via multi-view nonnegative matrix factorization and its application to SARS-CoV-2.",
            "BlockPolish: accurate polishing of long-read assembly via block divide-and-conquer.",
            "Epigenome signature as an immunophenotype indicator prompts durable clinical immunotherapy benefits in lung adenocarcinoma.",
            "Erratum to: Machine learning meets omics applications and perspectives.",
            "Differential RNA methylation using multivariate statistical methods.",
            "PKSPS: a novel method for predicting kinase of specific phosphorylation sites based on maximum weighted bipartite matching algorithm and phosphorylation sequence enrichment analysis.",
            "An integrated brain-specific network identifies genes associated with neuropathologic and clinical traits of Alzheimer's disease.",
            "Optimizing genomic control in mixed model associations with binary diseases.",
            "A deep learning-based approach to model anomalous diffusion of membrane proteins: the case of the nicotinic acetylcholine receptor.",
            "Bioinformatics mentorship in a resource limited setting.",
            "A novel fast multiple nucleotide sequence alignment method based on FM-index.",
            "NiPTUNE: an automated pipeline for noninvasive prenatal testing in an accurate, integrative and flexible framework.",
            "A roadmap for multi-omics data integration using deep learning.",
            "Matrix factorization for biomedical link prediction and scRNA-seq data imputation: an empirical survey.",
            "A cross-study analysis of drug response prediction in cancer cell lines.",
            "RNA-RNA interactions between SARS-CoV-2 and host benefit viral development and evolution during COVID-19 infection.",
            "A network embedding framework based on integrating multiplex network for drug combination prediction.",
            "DeepDDS: deep graph neural network with attention mechanism to predict synergistic drug combinations.",
            "HINGRL: predicting drug-disease associations with graph representation learning on heterogeneous information networks.",
            "PhosPiR: an automated phosphoproteomic pipeline in R.",
            "MEANGS: an efficient seed-free tool for de novo assembling animal mitochondrial genome using whole genome NGS data.",
            "scIAE: an integrative autoencoder-based ensemble classification framework for single-cell RNA-seq data.",
            "scHiCStackL: a stacking ensemble learning-based method for single-cell Hi-C classification using cell embedding.",
            "Disease category-specific annotation of variants using an ensemble learning framework.",
            "ChIP-AP: an integrated analysis pipeline for unbiased ChIP-seq analysis.",
            "Letter to the Editor: on the stability and internal consistency of component-wise sparse mixture regression-based clustering.",
            "DeepMotifSyn: a deep learning approach to synthesize heterodimeric DNA motifs.",
            "Stratified neural networks in a time-to-event setting.",
            "Corrigendum to: Machine learning approach to gene essentiality prediction: a review.",
            "Learning representation for multiple biological networks via a robust graph regularized integration approach.",
            "AMDBNorm: an approach based on distribution adjustment to eliminate batch effects of gene expression data.",
            "Artificial intelligence in the prediction of protein-ligand interactions: recent advances and future directions.",
            "Ensemble of kernel ridge regression-based small molecule-miRNA association prediction in human disease.",
            "Artificial intelligence in clinical research of cancers.",
            "FusionDTA: attention-based feature polymerizer and knowledge distillation for drug-target binding affinity prediction.",
            "Using molecular embeddings in QSAR modeling: does it make a difference?",
            "Impact of computational approaches in the fight against COVID-19: an AI guided review of 17 000 studies.",
            "A systematic comparison of novel and existing differential analysis methods for CyTOF data.",
            "Immuno-informatics analysis predicts B and T cell consensus epitopes for designing peptide vaccine against SARS-CoV-2 with 99.82% global population coverage.",
            "Drug-drug interaction prediction with learnable size-adaptive molecular substructures.",
            "Comparison of imputation and imputation-free methods for statistical analysis of mass spectrometry data with missing data.",
            "A comprehensive review of online resources for microRNA-diseases associations: the state of the art.",
            "How much can deep learning improve prediction of the responses to drugs in cancer cell lines?",
            "Quantitative model suggests both intrinsic and contextual features contribute to the transcript coding ability determination in cells.",
            "Accelerating bioactive peptide discovery via mutual information-based meta-learning.",
            "DeepHost: phage host prediction with convolutional neural network.",
            "Heterogeneous graph attention network based on meta-paths for lncRNA-disease association prediction.",
            "Deep learning tackles single-cell analysis - a survey of deep learning for scRNA-seq analysis.",
            "DeepDISOBind: accurate prediction of RNA-, DNA- and protein-binding intrinsically disordered residues with deep multi-task learning.",
            "ScCAEs: deep clustering of single-cell RNA-seq via convolutional autoencoder embedding and soft K-means.",
            "Protein-RNA interaction prediction with deep learning: structure matters.",
            "A general optimization protocol for molecular property prediction using a deep learning network.",
            "LR-GNN: a graph neural network based on link representation for predicting molecular associations.",
            "Machine learning meets omics: applications and perspectives.",
            "GVDTI: graph convolutional and variational autoencoders with attribute-level attention for drug-protein interaction prediction.",
            "TMNP: a transcriptome-based multi-scale network pharmacology platform for herbal medicine.",
            "Enhancing discoveries of molecular QTL studies with small sample size using summary statistic imputation.",
            "Ferroptosis-related lncRNA pairs to predict the clinical outcome and molecular characteristics of pancreatic ductal adenocarcinoma.",
            "A comparison of deep learning-based pre-processing and clustering approaches for single-cell RNA sequencing data.",
            "Sensitive, reliable and robust circRNA detection from RNA-seq with CirComPara2.",
            "Consensus-based clustering of single cells by reconstructing cell-to-cell dissimilarity.",
            "Study of transcription factor druggabilty for prostate cancer using structure information, gene regulatory networks and protein moonlighting.",
            "iProbiotics: a machine learning platform for rapid identification of probiotic properties from whole-genome primary sequences.",
            "High-throughput single-cell RNA-seq data imputation and characterization with surrogate-assisted automated deep learning.",
            "Impact of mutations in SARS-COV-2 spike on viral infectivity and antigenicity.",
            "OPUS-Rota4: a gradient-based protein side-chain modeling framework assisted by deep learning-based predictors.",
            "mCNN-ETC: identifying electron transporters and their functional families by using multiple windows scanning techniques in convolutional neural networks with evolutionary information of protein sequences.",
            "Rossmann-toolbox: a deep learning-based protocol for the prediction and design of cofactor specificity in Rossmann fold proteins.",
            "scDEA: differential expression analysis in single-cell RNA-sequencing data via ensemble learning.",
            "AMDE: a novel attention-mechanism-based multidimensional feature encoder for drug-drug interaction prediction.",
            "StaBle-ABPpred: a stacked ensemble predictor based on biLSTM and attention mechanism for accelerated discovery of antibacterial peptides.",
            "Deep-AFPpred: identifying novel antifungal peptides using pretrained embeddings from seq2vec with 1DCNN-BiLSTM.",
            "A multi-step and multi-scale bioinformatic protocol to investigate potential SARS-CoV-2 vaccine targets.",
            "Evaluating the state of the art in missing data imputation for clinical data.",
            "iRice-MS: An integrated XGBoost model for detecting multitype post-translational modification sites in rice.",
            "A protocol for dynamic model calibration.",
            "A survey of circular RNAs in complex diseases: databases, tools and computational methods.",
            "MZINBVA: variational approximation for multilevel zero-inflated negative-binomial models for association analysis in microbiome surveys.",
            "Benchmark of filter methods for feature selection in high-dimensional gene expression survival data.",
            "PTMdyna: exploring the influence of post-translation modifications on protein conformational dynamics.",
            "epitope3D: a machine learning method for conformational B-cell epitope prediction.",
            "A survey on computational methods in discovering protein inhibitors of SARS-CoV-2.",
            "Deep learning-based advances and applications for single-cell RNA-sequencing data analysis.",
            "DeepLncLoc: a deep learning framework for long non-coding RNA subcellular localization prediction based on subsequence embedding.",
            "Subtype-WESLR: identifying cancer subtype with weighted ensemble sparse latent representation of multi-view data.",
            "Integration of pairwise neighbor topologies and miRNA family and cluster attributes for miRNA-disease association prediction.",
            "Improving cancer driver gene identification using multi-task learning on graph convolutional network.",
            "T4SEfinder: a bioinformatics tool for genome-scale prediction of bacterial type IV secreted effectors using pre-trained protein language model.",
            "Prediction of disease-associated nsSNPs by integrating multi-scale ResNet models with deep feature fusion.",
            "Erratum to: Evaluation of in silico tools for the prediction of protein and peptide aggregation on diverse datasets.",
            "Identifying pleiotropic genes for complex phenotypes with summary statistics from a perspective of composite null hypothesis testing.",
            "Metrics for evaluating differentially methylated region sets predicted from BS-seq data.",
            "Estimating cell type-specific differential expression using deconvolution.",
            "Managing the life cycle of a portfolio of open data resources at the SIB Swiss Institute of Bioinformatics.",
            "Ensemble modeling with machine learning and deep learning to provide interpretable generalized rules for classifying CNS drugs with high prediction power.",
            "NmRF: identification of multispecies RNA 2'-O-methylation modification sites from RNA sequences.",
            "Multi contact-based folding method for de novo protein structure prediction.",
            "Identifying correlations driven by influential observations in large datasets.",
            "Comprehensive assessment of deep generative architectures for de novo drug design.",
            "Focused goodness of fit tests for gene set analyses.",
            "Characterizing viral circRNAs and their application in identifying circRNAs in viruses.",
            "Addressing noise in co-expression network construction.",
            "HiC1Dmetrics: framework to extract various one-dimensional features from chromosome structure data.",
            "Accurate protein function prediction via graph attention networks with predicted structure information.",
            "MOAI: a multi-outcome interaction identification approach reveals an interaction between vaspin and carcinoembryonic antigen on colorectal cancer prognosis.",
            "Dual-Network Collaborative Matrix Factorization for predicting small molecule-miRNA associations.",
            "Prediction of RNA secondary structure including pseudoknots for long sequences.",
            "Deep learning in retrosynthesis planning: datasets, models and tools.",
            "Integrating single-cell datasets with ambiguous batch information by incorporating molecular network features.",
            "Active disease-related compound identification based on capsule network.",
            "Calling small variants using universality with Bayes-factor-adjusted odds ratios.",
            "sciCNV: high-throughput paired profiling of transcriptomes and DNA copy number variations at single-cell resolution.",
            "Are dropout imputation methods for scRNA-seq effective for scATAC-seq data?",
            "Mining plant endogenous target mimics from miRNA-lncRNA interactions based on dual-path parallel ensemble pruning method.",
            "Characterization of gastric cancer stem-like molecular features, immune and pharmacogenomic landscapes.",
            "Advances, challenges and opportunities of phylogenetic and social network analysis using COVID-19 data.",
            "sAMP-PFPDeep: Improving accuracy of short antimicrobial peptides prediction using three different sequence encodings and deep neural networks.",
            "A comprehensive review of the analysis and integration of omics data for SARS-CoV-2 and COVID-19.",
            "META-DDIE: predicting drug-drug interaction events with few-shot learning.",
            "GraphCDR: a graph neural network method with contrastive learning for cancer drug response prediction.",
            "Somatic variant analysis suite: copy number variation clonal visualization online platform for large-scale single-cell genomics.",
            "Comparative analysis of machine learning-based approaches for identifying therapeutic peptides targeting SARS-CoV-2.",
            "Serverless computing in omics data analysis and integration.",
            "Prospects and challenges of cancer systems medicine: from genes to disease networks.",
            "GCRFLDA: scoring lncRNA-disease associations using graph convolution matrix completion with conditional random field.",
            "Botanical drugs: a new strategy for structure-based target prediction.",
            "SIGNET: single-cell RNA-seq-based gene regulatory network prediction using multiple-layer perceptron bagging.",
            "Dissecting and predicting different types of binding sites in nucleic acids based on structural information.",
            "BioNet: a large-scale and heterogeneous biological network model for interaction prediction with graph convolution.",
            "iCRISEE: an integrative analysis of CRISPR screen by reducing false positive hits.",
            "BML: a versatile web server for bipartite motif discovery.",
            "Graph representation learning in bioinformatics: trends, methods and applications.",
            "Drug-target interaction predication via multi-channel graph neural networks.",
            "STALLION: a stacking-based ensemble learning framework for prokaryotic lysine acetylation site prediction.",
            "CRAFT: a bioinformatics software for custom prediction of circular RNA functions.",
            "A robust and scalable graph neural network for accurate single-cell classification.",
            "Comprehensive evaluation of noise reduction methods for single-cell RNA sequencing data.",
            "Bridging-BPs: a novel approach to predict potential drug-target interactions based on a bridging heterogeneous graph and BPs2vec.",
            "An inductive transfer learning force field (ITLFF) protocol builds protein force fields in seconds.",
            "IndGOterm: a qualitative method for the identification of individually dysregulated GO terms in cancer.",
            "Learning multi-scale heterogenous network topologies and various pairwise attributes for drug-disease association prediction.",
            "Accurate flexible refinement for atomic-level protein structure using cryo-EM density maps and deep learning.",
            "A review on the application of bioinformatics tools in food microbiome studies.",
            "Evaluation of phenotype-driven gene prioritization methods for Mendelian diseases.",
            "Computational analyses of bacterial strains from shotgun reads.",
            "ADENet: a novel network-based inference method for prediction of drug adverse events.",
            "Adapt-Kcr: a novel deep learning framework for accurate prediction of lysine crotonylation sites based on learning embedding features and attention architecture.",
            "Letter regarding article named 'Is acupuncture effective in the treatment of COVID-19 related symptoms? Based on bioinformatics/network topology strategy'.",
            "An enhanced cascade-based deep forest model for drug combination prediction.",
            "SARS-CoV-2 transmissibility compared between variants of concern and vaccination status.",
            "StackTADB: a stacking-based ensemble learning model for predicting the boundaries of topologically associating domains (TADs) accurately in fruit flies.",
            "Anc2vec: embedding gene ontology terms by preserving ancestors relationships.",
            "CharID: a two-step model for universal prediction of interactions between chromatin accessible regions.",
            "cropCSM: designing safe and potent herbicides with graph-based signatures.",
            "Critical assessment of computational tools for prokaryotic and eukaryotic promoter prediction.",
            "ORI-Deep: improving the accuracy for predicting origin of replication sites by using a blend of features and long short-term memory network.",
            "Digital DNA lifecycle security and privacy: an overview.",
            "RiboChat: a chat-style web interface for analysis and annotation of ribosome profiling data.",
            "Capturing large genomic contexts for accurately predicting enhancer-promoter interactions.",
            "GPS-Uber: a hybrid-learning framework for prediction of general and E3-specific lysine ubiquitination sites.",
            "A simple guide to de novo transcriptome assembly and annotation.",
            "MiRNA-disease association prediction based on meta-paths.",
            "hDirect-MAP: projection-free single-cell modeling of response to checkpoint immunotherapy.",
            "Shedding light on the hidden human proteome expands immunopeptidome in cancer.",
            "Multi-variable AUC for sifting complementary features and its biomedical application.",
            "Deciphering the etiology and role in oncogenic transformation of the CpG island methylator phenotype: a pan-cancer analysis.",
            "Comethyl: a network-based methylome approach to investigate the multivariate nature of health and disease.",
            "Biomedical data, computational methods and tools for evaluating disease-disease associations.",
            "Learning protein subcellular localization multi-view patterns from heterogeneous data of imaging, sequence and networks.",
            "SRDFM: Siamese Response Deep Factorization Machine to improve anti-cancer drug recommendation.",
            "TP53_PROF: a machine learning model to predict impact of missense mutations in TP53.",
            "Network-based integrative analysis of single-cell transcriptomic and epigenomic data for cell types.",
            "A weighted bilinear neural collaborative filtering approach for drug repositioning.",
            "Deep learning-based identification of genetic variants: application to Alzheimer's disease classification.",
            "Accurate and fast cell marker gene identification with COSG.",
            "EGRET: edge aggregated graph attention networks and transfer learning improve protein-protein interaction site prediction.",
            "Toward accurate diagnosis and surveillance of bacterial infections using enhanced strain-level metagenomic next-generation sequencing of infected body fluids.",
            "Multimodal deep learning for biomedical data fusion: a review.",
            "Molecular substructure tree generative model for de novo drug design.",
            "SAM-TB: a whole genome sequencing data analysis website for detection of Mycobacterium tuberculosis drug resistance and transmission.",
            "Protein turnover models for LC-MS data of heavy water metabolic labeling.",
            "CRISP: a deep learning architecture for GC × GC-TOFMS contour ROI identification, simulation and analysis in imaging metabolomics.",
            "Learning spatial structures of proteins improves protein-protein interaction prediction.",
            "Predicting protein stability changes upon single-point mutation: a thorough comparison of the available tools on a new dataset.",
            "RadSigBench: a framework for benchmarking functional genomics signatures of cancer cell radiosensitivity.",
            "Correction to: PHR-search: a search framework for protein remote homology detection based on the predicted protein hierarchical relationships.",
            "Identifying drug-target interactions via heterogeneous graph attention networks combined with cross-modal similarities.",
            "Vec2image: an explainable artificial intelligence model for the feature representation and classification of high-dimensional biological data by vector-to-image conversion.",
            "DLRAPom: a hybrid pipeline of Optimized XGBoost-guided integrative multiomics analysis for identifying targetable disease-related lncRNA-miRNA-mRNA regulatory axes.",
            "Systematic evaluation of computational tools to predict the effects of mutations on protein stability in the absence of experimental structures.",
            "Visualization, benchmarking and characterization of nested single-cell heterogeneity as dynamic forest mixtures.",
            "Rare variant association tests for ancestry-matched case-control data based on conditional logistic regression.",
            "Proteoform identification based on top-down tandem mass spectra with peak error corrections.",
            "AlphaFold2-aware protein-DNA binding site prediction using graph transformer.",
            "Librator: a platform for the optimized analysis, design, and expression of mutable influenza viral antigens.",
            "Assessment of selection pressure exerted on genes from complete pangenomes helps to improve the accuracy in the prediction of new genes.",
            "ASPIRER: a new computational approach for identifying non-classical secreted proteins based on deep learning.",
            "Coronavirus GenBrowser for monitoring the transmission and evolution of SARS-CoV-2.",
            "MiRLoc: predicting miRNA subcellular localization by incorporating miRNA-mRNA interactions and mRNA subcellular localization.",
            "PHR-search: a search framework for protein remote homology detection based on the predicted protein hierarchical relationships.",
            "Ontology-aware neural network: a general framework for pattern mining from microbiome data.",
            "Predicting protein-membrane interfaces of peripheral membrane proteins using ensemble machine learning.",
            "Deep structural clustering for single-cell RNA-seq data jointly through autoencoder and graph neural network.",
            "CRESSP: a comprehensive pipeline for prediction of immunopathogenic SARS-CoV-2 epitopes using structural properties of proteins.",
            "Identification of alternative splicing-derived cancer neoantigens for mRNA vaccine development.",
            "Persistent spectral based ensemble learning (PerSpect-EL) for protein-protein binding affinity prediction.",
            "Simultaneous test and estimation of total genetic effect in eQTL integrative analysis through mixed models.",
            "Reconstruction of human protein-coding gene functional association network based on machine learning.",
            "A universal approach for integrating super large-scale single-cell transcriptomes by exploring gene rankings.",
            "SIFLoc: a self-supervised pre-training method for enhancing the recognition of protein subcellular localization in immunofluorescence microscopic images.",
            "RiboReport - benchmarking tools for ribosome profiling-based identification of open reading frames in bacteria.",
            "Analysis of cancer omics data: a selective review of statistical techniques.",
            "Identification of drug-target interactions via multiple kernel-based triple collaborative matrix factorization.",
            "TIGER: technical variation elimination for metabolomics data using ensemble learning architecture.",
            "Comprehensive evaluation of computational methods for predicting cancer driver genes.",
            "HCRNet: high-throughput circRNA-binding event identification from CLIP-seq data using deep temporal convolutional network.",
            "DSGAT: predicting frequencies of drug side effects by graph attention networks.",
            "A comprehensive comparison of supervised and unsupervised methods for cell type identification in single-cell RNA-seq.",
            "Out-of-the-box deep learning prediction of quantum-mechanical partial charges by graph representation and transfer learning.",
            "ALDPI: adaptively learning importance of multi-scale topologies and multi-modality similarities for drug-protein interaction prediction.",
            "RdRp-based sensitive taxonomic classification of RNA viruses for metagenomic data.",
            "SVPath: an accurate pipeline for predicting the pathogenicity of human exon structural variants.",
            "Transcriptome analysis method based on differential distribution evaluation.",
            "A compressed variance component mixed model framework for detecting small and linked QTL-by-environment interactions.",
            "sc-REnF: An entropy guided robust feature selection for single-cell RNA-seq data.",
            "Drug-target interactions prediction via deep collaborative filtering with multiembeddings.",
            "PRODeepSyn: predicting anticancer synergistic drug combinations by embedding cell lines with protein-protein interaction network.",
            "Assessment of human microbiota stability across longitudinal samples using iteratively growing-partitioned clustering.",
            "BERT6mA: prediction of DNA N6-methyladenine site using deep learning-based approaches.",
            "Towards routine employment of computational tools for antimicrobial resistance determination via high-throughput sequencing.",
            "Improving bulk RNA-seq classification by transferring gene signature from single cells in acute myeloid leukemia.",
            "MetaLogo: a heterogeneity-aware sequence logo generator and aligner.",
            "JEBIN: analyzing gene co-expressions across multiple datasets by joint network embedding.",
            "Multi-channel graph attention autoencoders for disease-related lncRNAs prediction.",
            "Accelerating the discovery of antifungal peptides using deep temporal convolutional networks.",
            "Predicting protein phosphorylation sites in soybean using interpretable deep tabular learning network.",
            "Predicting miRNA-disease associations based on graph random propagation network and attention network.",
            "Fully exploiting SNP arrays: a systematic review on the tools to extract underlying genomic structure.",
            "scHFC: a hybrid fuzzy clustering method for single-cell RNA-seq data optimized by natural computation.",
            "Prediction of potential miRNA-disease associations based on stacked autoencoder.",
            "A reproducibility analysis-based statistical framework for residue-residue evolutionary coupling detection.",
            "A hybrid deep learning framework for gene regulatory network inference from single-cell transcriptomic data.",
            "S2DV: converting SMILES to a drug vector for predicting the activity of anti-HBV small molecules.",
            "POSREG: proteomic signature discovered by simultaneously optimizing its reproducibility and generalizability.",
            "ABC-Net: a divide-and-conquer based deep learning architecture for SMILES recognition from molecular images.",
            "TCRpower: quantifying the detection power of T-cell receptor sequencing with a novel computational pipeline calibrated by spike-in sequences.",
            "Deep latent space fusion for adaptive representation of heterogeneous multi-omics data.",
            "PGS-server: accuracy, robustness and transferability of polygenic score methods for biobank scale studies.",
            "CoverageMaster: comprehensive CNV detection and visualization from NGS short reads for genetic medicine applications."
        ]
    },
    {
        "name": "Briefings in Bioinformatics",
        "year": "2021",
        "info": "Volume 22, 2021",
        "count": 772,
        "papers": [
            "Integrative bioinformatics and omics data source interoperability in the next-generation sequencing era - Editorial.",
            "Molecular dynamics simulations for genetic interpretation in protein coding regions: where we are, where to go and when.",
            "Computational methods for the integrative analysis of single-cell data.",
            "The road towards data integration in human genomics: players, steps and interactions.",
            "Using conceptual modeling to improve genome data management.",
            "GenoPheno: cataloging large-scale phenotypic and next-generation sequencing data within human datasets.",
            "Machine learning-based analysis of multi-omics data on the cloud for investigating gene regulations.",
            "Structured sparsity regularization for analyzing high-dimensional omics data.",
            "Comparison of microbiome samples: methods and computational challenges.",
            "Epidemiological data analysis of viral quasispecies in the next-generation sequencing era.",
            "Pathway Tools version 23.0 update: software for pathway/genome informatics and systems biology.",
            "The effect of tissue composition on gene co-expression.",
            "Current RNA-seq methodology reporting limits reproducibility.",
            "An extensive review of tools for manual annotation of documents.",
            "A survey on adverse drug reaction studies: data, tasks and machine learning methods.",
            "Current challenges and best-practice protocols for microbiome analysis.",
            "Deep learning for mining protein data.",
            "Computational resources and strategies to assess single-molecule dynamics of the translation process in S. cerevisiae.",
            "A survey and systematic assessment of computational methods for drug response prediction.",
            "Machine learning approaches and databases for prediction of drug-target interaction: a survey paper.",
            "Structural dynamics and allostery of Rab proteins: strategies for drug discovery and design.",
            "Closing the circle: current state and perspectives of circular RNA databases.",
            "EPSD: a well-annotated data resource of protein phosphorylation sites in eukaryotes.",
            "Domain-specific introduction to machine learning terminology, pitfalls and opportunities in CRISPR-based gene editing.",
            "Human body-fluid proteome: quantitative profiling and computational prediction.",
            "High-dimensional variable selection for ordinal outcomes with error control.",
            "Improving drug response prediction by integrating multiple data sources: matrix factorization, kernel and network-based approaches.",
            "Deep learning for drug response prediction in cancer.",
            "Computational annotation of miRNA transcription start sites.",
            "Deep learning-based clustering approaches for bioinformatics.",
            "SCDC: bulk gene expression deconvolution by multiple single-cell RNA sequencing references.",
            "Predicting drug-induced hepatotoxicity based on biological feature maps and diverse classification strategies.",
            "Hybrid modelling of biological systems using fuzzy continuous Petri nets.",
            "DTI-CDF: a cascade deep forest model towards the prediction of drug-target interactions based on hybrid features.",
            "Small noncoding RNA discovery and profiling with sRNAtools based on high-throughput sequencing.",
            "BioMedR: an R/CRAN package for integrated data analysis pipeline in biomedical study.",
            "NCMCMDA: miRNA-disease association prediction through neighborhood constraint matrix completion.",
            "Can machine learning consistently improve the scoring power of classical scoring functions? Insights into the role of machine learning in scoring functions.",
            "CpG-island-based annotation and analysis of human housekeeping genes.",
            "Design powerful predictor for mRNA subcellular location prediction in Homo sapiens.",
            "GCdiscrimination: identification of gastric cancer based on a milliliter of blood.",
            "Toward a gold standard for benchmarking gene set enrichment analysis.",
            "Meta-Prism: Ultra-fast and highly accurate microbial community structure search utilizing dual indexing and parallel computation.",
            "Drug-target prediction utilizing heterogeneous bio-linked network embeddings.",
            "A network-based algorithm for the identification of moonlighting noncoding RNAs and its application in sepsis.",
            "Systematical identification of cell-specificity of CTCF-gene binding based on epigenetic modifications.",
            "On the critical review of five machine learning-based algorithms for predicting protein stability changes upon mutation.",
            "Erratum to: Molecular dynamics simulations for genetic interpretation in protein coding regions: where we are, where to go and when.",
            "Erratum to: LARMD: integration of bioinformatic resources to profile ligand-driven protein dynamics with a case on the activation of estrogen receptor.",
            "Erratum to: Machine learning approaches and databases for prediction of drug-target interaction: a survey paper.",
            "Erratum to: Machine learning-based analysis of multi-omics data on the cloud for investigating gene regulations.",
            "Closing the gap between formats for storing layout information in systems biology.",
            "Corrigendum to: Computational annotation of miRNA transcription start sites.",
            "Corrigendum to: Bioinformatics: scalability, capabilities and training in the data-driven era.",
            "Corrigendum to: Assessment of metagenomic assemblers based on hybrid reads of real and simulated metagenomic sequences.",
            "Bioinformatics helping to mitigate the impact of COVID-19 - Editorial.",
            "Next generation sequencing of SARS-CoV-2 genomes: challenges, applications and opportunities.",
            "Bioinformatics resources for SARS-CoV-2 discovery and surveillance.",
            "Computational strategies to combat COVID-19: useful tools to accelerate SARS-CoV-2 and coronavirus research.",
            "A review on viral data sources and search systems for perspective mitigation of COVID-19.",
            "Comprehensive pathway enrichment analysis workflows: COVID-19 case study.",
            "Web tools to fight pandemics: the COVID-19 experience.",
            "A review of COVID-19 biomarkers and drug targets: resources and tools.",
            "Bioinformatics resources facilitate understanding and harnessing clinical research of SARS-CoV-2.",
            "A review on drug repurposing applicable to COVID-19.",
            "The impact of structural bioinformatics tools and resources on SARS-CoV-2 research and therapeutic strategies.",
            "SARS-CoV-2 3D database: understanding the coronavirus proteome and evaluating possible drug targets.",
            "Text mining approaches for dealing with the rapidly expanding literature on COVID-19.",
            "How do we share data in COVID-19 research? A systematic review of COVID-19 datasets in PubMed Central Articles.",
            "Health informatics and EHR to support clinical research in the COVID-19 pandemic: an overview.",
            "Robots as intelligent assistants to face COVID-19 pandemic.",
            "HVIDB: a comprehensive database for human-virus protein-protein interactions.",
            "Genome annotation of disease-causing microorganisms.",
            "Data science in unveiling COVID-19 pathogenesis and diagnosis: evolutionary origin to drug repurposing.",
            "The Cellular basis of loss of smell in 2019-nCoV-infected individuals.",
            "Virus-CKB: an integrated bioinformatics platform and analysis resource for COVID-19 research.",
            "Application of Bayesian phylogenetic inference modelling for evolutionary genetic analysis and dynamic changes in 2019-nCoV.",
            "Origin-independent analysis links SARS-CoV-2 local genomes with COVID-19 incidence and mortality.",
            "Unveiling COVID-19-associated organ-specific cell types and cell-specific pathway cascade.",
            "A computational toolset for rapid identification of SARS-CoV-2, other viruses and microorganisms from sequencing data.",
            "Computer-aided prediction and design of IL-6 inducing peptides: IL-6 plays a crucial role in COVID-19.",
            "MCCS: a novel recognition pattern-based method for fast track discovery of anti-SARS-CoV-2 drugs.",
            "Key residues influencing binding affinities of 2019-nCoV with ACE2 in different species.",
            "iDMer: an integrative and mechanism-driven response system for identifying compound interventions for sudden virus outbreak.",
            "Inferring microenvironmental regulation of gene expression from single-cell RNA sequencing data using scMLnet with an application to COVID-19.",
            "Evolutionary and codon usage preference insights into spike glycoprotein of SARS-CoV-2.",
            "A comprehensive drug repurposing study for COVID19 treatment: novel putative dihydroorotate dehydrogenase inhibitors show association to serotonin-dopamine receptors.",
            "Serial co-expression analysis of host factors from SARS-CoV viruses highly converges with former high-throughput screenings and proposes key regulators.",
            "Ligand-based approach for predicting drug targets and for virtual screening against COVID-19.",
            "An integrated approach to determine the abundance, mutation rate and phylogeny of the SARS-CoV-2 genome.",
            "DrugRepV: a compendium of repurposed drugs and chemicals targeting epidemic and pandemic viruses.",
            "Identifying anti-coronavirus peptides by incorporating different negative datasets and imbalanced learning strategies.",
            "Roles of host small RNAs in the evolution and host tropism of coronaviruses.",
            "Whole genome analysis of more than 10 000 SARS-CoV-2 virus unveils global genetic diversity and target region of NSP6.",
            "Comparison of the binding characteristics of SARS-CoV and SARS-CoV-2 RBDs to ACE2 at different temperatures by MD simulations.",
            "The miRNA: a small but powerful RNA for COVID-19.",
            "Discovery of G-quadruplex-forming sequences in SARS-CoV-2.",
            "Integrative pharmacological mechanism of vitamin C combined with glycyrrhizic acid against COVID-19: findings of bioinformatics analyses.",
            "Pathogenetic profiling of COVID-19 and SARS-like viruses.",
            "A diagnostic genomic signal processing (GSP)-based system for automatic feature analysis and detection of COVID-19.",
            "Comparative host-pathogen protein-protein interaction analysis of recent coronavirus outbreaks and important host targets identification.",
            "Identification of the RNase-binding site of SARS-CoV-2 RNA for anchor primer-PCR detection of viral loading in 306 COVID-19 patients.",
            "Potential inhibitors for the novel coronavirus (SARS-CoV-2).",
            "Adverse events associated with potential drugs for COVID-19: a case study from real-world data.",
            "Systemic effects of missense mutations on SARS-CoV-2 spike glycoprotein stability and receptor-binding affinity.",
            "Network-based identification genetic effect of SARS-CoV-2 infections to Idiopathic pulmonary fibrosis (IPF) patients.",
            "Compositional diversity and evolutionary pattern of coronavirus accessory proteins.",
            "Network Pharmacology and bioinformatics analyses identify intersection genes of niacin and COVID-19 as potential therapeutic targets.",
            "Bioinformatic analysis of SMN1-ACE/ACE2 interactions hinted at a potential protective effect of spinal muscular atrophy against COVID-19-induced lung injury.",
            "Identification and characterization of circRNAs encoded by MERS-CoV, SARS-CoV-1 and SARS-CoV-2.",
            "Design of an epitope-based peptide vaccine against the SARS-CoV-2: a vaccine-informatics approach.",
            "Gene expression profiling of SARS-CoV-2 infections reveal distinct primary lung cell and systemic immune infection responses that identify pathways relevant in COVID-19 disease.",
            "SARS-CoV-2 hot-spot mutations are significantly enriched within inverted repeats and CpG island loci.",
            "Identifying the natural polyphenol catechin as a multi-targeted agent against SARS-CoV-2 for the plausible therapy of COVID-19: an integrated computational approach.",
            "Exploration of natural compounds with anti-SARS-CoV-2 activity via inhibition of SARS-CoV-2 Mpro.",
            "Transcriptome analysis of cepharanthine against a SARS-CoV-2-related coronavirus.",
            "Bioinformatics and system biology approach to identify the influences of COVID-19 on cardiovascular and hypertensive comorbidities.",
            "Virtual screening and molecular dynamics simulation study of plant-derived compounds to identify potential inhibitors of main protease from SARS-CoV-2.",
            "Diseasome and comorbidities complexities of SARS-CoV-2 infection with common malignant diseases.",
            "Integrated network analysis reveals new genes suggesting COVID-19 chronic effects and treatment.",
            "Functional alterations caused by mutations reflect evolutionary trends of SARS-CoV-2.",
            "Identification of biomarkers and pathways for the SARS-CoV-2 infections that make complexities in pulmonary arterial hypertension patients.",
            "Lysosome activation in peripheral blood mononuclear cells and prognostic significance of circulating LC3B in COVID-19.",
            "A molecular modelling approach for identifying antiviral selenium-containing heterocyclic compounds that inhibit the main protease of SARS-CoV-2: an in silico investigation.",
            "A model for pH coupling of the SARS-CoV-2 spike protein open/closed equilibrium.",
            "Drug repurposing for COVID-19: could vitamin C combined with glycyrrhizic acid be at play by the findings of Li et al.'s database-based network pharmacology analysis?",
            "Corrigendum to: Inferring microenvironmental regulation of gene expression from single-cell RNA sequencing data using scMLnet with an application to COVID-19.",
            "Deep learning in bioinformatics and biomedicine.",
            "Biological network analysis with deep learning.",
            "Deep learning meets metabolomics: a methodological perspective.",
            "Deep learning in systems medicine.",
            "Deep learning for brain disorders: from data processing to disease treatment.",
            "Deep learning approaches for neural decoding across architectures and recording modalities.",
            "Unsupervised and self-supervised deep learning approaches for biomedical text mining.",
            "Biomedical data and computational models for drug repositioning: a comprehensive review.",
            "Mass spectrometry-based protein identification in proteomics - a review.",
            "Network analyses in microbiome based on high-throughput multi-omics data.",
            "Exploration of databases and methods supporting drug repurposing: a comprehensive survey.",
            "Biological applications of knowledge graph embedding models.",
            "A survey of gene expression meta-analysis: methods and applications.",
            "The bioinformatics toolbox for circRNA discovery and analysis.",
            "Proteoform characterization based on top-down mass spectrometry.",
            "Addressing the heterogeneity in liver diseases using biological networks.",
            "Deep learning for biological age estimation.",
            "Essentiality-specific pathogenicity prioritization gene score to improve filtering of disease sequence data.",
            "Virtual screening web servers: designing chemical probes and drug candidates in the cyberspace.",
            "Homoeologous gene expression and co-expression network analyses and evolutionary inference in allopolyploids.",
            "GPS-Palm: a deep learning-based graphic presentation system for the prediction of S-palmitoylation sites in proteins.",
            "Setting the basis of best practices and standards for curation and annotation of logical models in biology - highlights of the [BC]2 2019 CoLoMoTo/SysMod Workshop.",
            "The mechanistic, diagnostic and therapeutic novel nucleic acids for hepatocellular carcinoma emerging in past score years.",
            "Prediction of drug adverse events using deep learning in pharmaceutical discovery.",
            "Application of deep learning methods in biological networks.",
            "EP3: an ensemble predictor that accurately identifies type III secreted effectors.",
            "TRlnc: a comprehensive database for human transcriptional regulatory information of lncRNAs.",
            "A computational platform to identify origins of replication sites in eukaryotes.",
            "Toward a high-quality pan-genome landscape of Bacillus subtilis by removal of confounding strains.",
            "idenPC-MIIP: identify protein complexes from weighted PPI networks using mutual important interacting partner relation.",
            "Cooperative driver pathway discovery via fusion of multi-relational data of genes, miRNAs and pathways.",
            "RFPR-IDP: reduce the false positive rates for intrinsically disordered protein and region prediction by incorporating both fully ordered proteins and disordered proteins.",
            "Regression on imperfect class labels derived by unsupervised clustering.",
            "Immune cell infiltration-based signature for prognosis and immunogenomic analysis in breast cancer.",
            "SG-LSTM-FRAME: a computational frame using sequence and geometrical information via LSTM to predict miRNA-gene associations.",
            "Adaptive multi-source multi-view latent feature learning for inferring potential disease-associated miRNAs.",
            "Drug repositioning by prediction of drug's anatomical therapeutic chemical code via network-based inference approaches.",
            "DeepCPP: a deep neural network based on nucleotide bias information and minimum distribution similarity feature selection for RNA coding potential prediction.",
            "MeSHHeading2vec: a new method for representing MeSH headings as vectors based on graph embedding algorithm.",
            "Integrating multi-network topology for gene function prediction using deep neural networks.",
            "TOD-CUP: a gene expression rank-based majority vote algorithm for tissue origin diagnosis of cancers of unknown primary.",
            "MPTherm: database for membrane protein thermodynamics for understanding folding and stability.",
            "Computational prediction and interpretation of both general and specific types of promoters in Escherichia coli by exploiting a stacked ensemble-learning framework.",
            "Identifying drug-target interactions based on graph convolutional network and deep neural network.",
            "An absolute human stemness index associated with oncogenic dedifferentiation.",
            "Coupled matrix-matrix and coupled tensor-matrix completion methods for predicting drug-target interactions.",
            "DNA sequence symmetries from randomness: the origin of the Chargaff's second parity rule.",
            "VirusCircBase: a database of virus circular RNAs.",
            "PL-search: a profile-link-based search method for protein remote homology detection.",
            "A statistical framework for predicting critical regions of p53-dependent enhancers.",
            "mUSP: a high-accuracy map of the in situ crosstalk of ubiquitylation and SUMOylation proteome predicted via the feature enhancement approach.",
            "M6A2Target: a comprehensive database for targets of m6A writers, erasers and readers.",
            "CeRNASeek: an R package for identification and analysis of ceRNA regulation.",
            "Disease characterization using a partial correlation-based sample-specific network.",
            "iPiDi-PUL: identifying Piwi-interacting RNA-disease associations based on positive unlabeled learning.",
            "Comprehensive analysis reveals distinct mutational signature and its mechanistic insights of alcohol consumption in human cancers.",
            "Attentional multi-level representation encoding based on convolutional and variance autoencoders for lncRNA-disease association prediction.",
            "Detection of somatic structural variants from short-read next-generation sequencing data.",
            "A novel deep learning method for predictive modeling of microbiome data.",
            "PedMiner: a tool for linkage analysis-based identification of disease-associated variants using family based whole-exome sequencing data.",
            "Therapeutic targets and signaling mechanisms of vitamin C activity against sepsis: a bioinformatics study.",
            "Comprehensive fundamental somatic variant calling and quality management strategies for human cancer genomes.",
            "gutMEGA: a database of the human gut MEtaGenome Atlas.",
            "Scoring functions for drug-effect similarity.",
            "Using off-target data from whole-exome sequencing to improve genotyping accuracy, association analysis and polygenic risk prediction.",
            "Sequence repetitiveness quantification and de novo repeat detection by weighted k-mer coverage.",
            "The impact of compound library size on the performance of scoring functions for structure-based virtual screening.",
            "miRactDB characterizes miRNA-gene relation switch between normal and cancer tissues across pan-cancer.",
            "Improving structure-based virtual screening performance via learning from scoring function components.",
            "ExoBCD: a comprehensive database for exosomal biomarker discovery in breast cancer.",
            "Federated sharing and processing of genomic datasets for tertiary data analysis.",
            "Reconstruction of plasmids by shotgun sequencing from environmental DNA: which bioinformatic workflow?",
            "Evaluation of gene-drug common module identification methods using pharmacogenomics data.",
            "MetaFS: Performance assessment of biomarker discovery in metaproteomics.",
            "MLCDForest: multi-label classification with deep forest in disease prediction for long non-coding RNAs.",
            "DenvInD: dengue virus inhibitors database for clinical and molecular research.",
            "SMNN: batch effect correction for single-cell RNA-seq data via supervised mutual nearest neighbor detection.",
            "A novel privacy-preserving federated genome-wide association study framework and its application in identifying potential risk variants in ankylosing spondylitis.",
            "CCLA: an accurate method and web server for cancer cell line authentication using gene expression profiles.",
            "Enriching contextualized language model from knowledge graph for biomedical information extraction.",
            "Comparison of high-throughput single-cell RNA sequencing data processing pipelines.",
            "PredCID: prediction of driver frameshift indels in human cancer.",
            "RNCE: network integration with reciprocal neighbors contextual encoding for multi-modal drug community study on cancer targets.",
            "MiRACLe: an individual-specific approach to improve microRNA-target prediction based on a random contact model.",
            "Dr AFC: drug repositioning through anti-fibrosis characteristic.",
            "DeepTorrent: a deep learning-based approach for predicting DNA N4-methylcytosine sites.",
            "Joint reconstruction of cis-regulatory interaction networks across multiple tissues using single-cell chromatin accessibility data.",
            "DeepVF: a deep learning-based hybrid framework for identifying virulence factors using the stacking strategy.",
            "scCancer: a package for automated processing of single-cell RNA-seq data in cancer.",
            "A comprehensive integrated drug similarity resource for in-silico drug repositioning and beyond.",
            "Evaluating assembly and variant calling software for strain-resolved analysis of large DNA viruses.",
            "Testing cell-type-specific mediation effects in genome-wide epigenetic studies.",
            "SCEBE: an efficient and scalable algorithm for genome-wide association studies on longitudinal outcomes with mixed-effects modeling.",
            "Gene-based mediation analysis in epigenetic studies.",
            "Predicting microRNA-disease associations from lncRNA-microRNA interactions via Multiview Multitask Learning.",
            "Mutations in transmembrane proteins: diseases, evolutionary insights, prediction and comparison with globular proteins.",
            "Exploring transcriptional switches from pairwise, temporal and population RNA-Seq data using deepTS.",
            "Metabolic networks of the Nicotiana genus in the spotlight: content, progress and outlook.",
            "State-of-the-art web services for de novo protein structure prediction.",
            "Genome-wide circadian rhythm detection methods: systematic evaluations and practical guidelines.",
            "Benchmarking variant callers in next-generation and third-generation sequencing analysis.",
            "Integrative biomarker detection on high-dimensional gene expression data sets: a survey on prior knowledge approaches.",
            "Investigations of sequencing data and sample type on HLA class Ia typing with different computational tools.",
            "Irinotecan and vandetanib create synergies for treatment of pancreatic cancer patients with concomitant TP53 and KRAS mutations.",
            "Predicting human microbe-disease associations via graph attention networks with inductive matrix completion.",
            "A large-scale investigation and identification of methicillin-resistant Staphylococcus aureus based on peaks binning of matrix-assisted laser desorption ionization-time of flight MS spectra.",
            "Spatial molecular profiling: platforms, applications and analysis tools.",
            "Publishing reproducible dynamic kinetic models.",
            "A survey on predicting microbe-disease associations: biological data and computational methods.",
            "DeepATT: a hybrid category attention neural network for identifying functional effects of DNA sequences.",
            "Microbes and complex diseases: from experimental results to computational models.",
            "Integrative, normalization-insusceptible statistical analysis of RNA-Seq data, with improved differential expression and unbiased downstream functional analysis.",
            "MolAICal: a soft tool for 3D drug design of protein targets by artificial intelligence and classical algorithm.",
            "Prognosis and personalized treatment prediction in TP53-mutant hepatocellular carcinoma: an in silico strategy towards precision oncology.",
            "Integrated omics analysis reveals the alteration of gut microbe-metabolites in obese adults.",
            "SurvivalMeth: a web server to investigate the effect of DNA methylation-related functional elements on prognosis.",
            "RNA-binding protein recognition based on multi-view deep feature and multi-label learning.",
            "Heritability jointly explained by host genotype and microbiome: will improve traits prediction?",
            "A powerful framework for an integrative study with heterogeneous omics data: from univariate statistics to multi-block analysis.",
            "Interpretation of deep learning in genomics and epigenomics.",
            "TERL: classification of transposable elements by convolutional neural networks.",
            "Ori-Finder 3: a web server for genome-wide prediction of replication origins in Saccharomyces cerevisiae.",
            "Spatial density of open chromatin: an effective metric for the functional characterization of topologically associated domains.",
            "Scanning window analysis of non-coding regions within normal-tumor whole-genome sequence samples.",
            "Analysis, identification and visualization of subgroups in genomics.",
            "Topoly: Python package to analyze topology of polymers.",
            "TEnGExA: an R package based tool for tissue enrichment and gene expression analysis.",
            "Meta-i6mA: an interspecies predictor for identifying DNA N6-methyladenine sites of plant genomes by exploiting informative features in an integrative machine-learning framework.",
            "Drug-pathway association prediction: from experimental results to computational models.",
            "Systematic evaluation of machine learning methods for identifying human-pathogen protein-protein interactions.",
            "Mechanistically derived patient-level framework for precision medicine identifies a personalized immune prognostic signature in high-grade serous ovarian cancer.",
            "iWhale: a computational pipeline based on Docker and SCons for detection and annotation of somatic variants in cancer WES data.",
            "Beware of the generic machine learning-based scoring functions in structure-based virtual screening.",
            "RSVdb: a comprehensive database of transcriptome RNA structure.",
            "Boosting predictabilities of agronomic traits in rice using bivariate genomic selection.",
            "Landscape of drug-resistance mutations in kinase regulatory hotspots.",
            "Survey and comparative assessments of computational multi-omics integrative methods with multiple regulatory networks identifying distinct tumor compositions across pan-cancer data sets.",
            "Reference genome and annotation updates lead to contradictory prognostic predictions in gene expression signatures: a case study of resected stage I lung adenocarcinoma.",
            "Computationally predicting binding affinity in protein-ligand complexes: free energy-based simulations and machine learning-based scoring functions.",
            "Current development of integrated web servers for preclinical safety and pharmacokinetics assessments in drug development.",
            "Vertical integration methods for gene expression data analysis.",
            "Deep-belief network for predicting potential miRNA-disease associations.",
            "The winning methods for predicting cellular position in the DREAM single-cell transcriptomics challenge.",
            "Towards multi-omics characterization of tumor heterogeneity: a comprehensive review of statistical and machine learning approaches.",
            "LncR2metasta: a manually curated database for experimentally supported lncRNAs during various cancer metastatic events.",
            "Proteome-scale analysis of phase-separated proteins in immunofluorescence images.",
            "Expression profile of immune checkpoint genes and their roles in predicting immunotherapy response.",
            "Genome-wide discovery of pre-miRNAs: comparison of recent approaches based on machine learning.",
            "DeepAtomicCharge: a new graph convolutional network-based architecture for accurate prediction of atomic charges.",
            "Scopy: an integrated negative design python library for desirable HTS/VS database design.",
            "LncAS2Cancer: a comprehensive database for alternative splicing of lncRNAs across human cancers.",
            "The microRNA target site landscape is a novel molecular feature associating alternative polyadenylation with immune evasion activity in breast cancer.",
            "A comprehensive survey of regulatory network inference methods using single cell RNA sequencing data.",
            "Challenges in gene-oriented approaches for pangenome content discovery.",
            "Discerning novel drug targets for treating Mycobacterium avium ss. paratuberculosis-associated autoimmune disorders: an in silico approach.",
            "Extended application of genomic selection to screen multiomics data for prognostic signatures of prostate cancer.",
            "How bioinformatics resources work with G4 RNAs.",
            "An approach for normalization and quality control for NanoString RNA expression data.",
            "NAMS webserver: coding potential assessment and functional annotation of plant transcripts.",
            "The functional determinants in the organization of bacterial genomes.",
            "AlzRiskMR database: an online database for the impact of exposure factors on Alzheimer's disease.",
            "Benchmarking orthology methods using phylogenetic patterns defined at the base of Eukaryotes.",
            "Depiction of tumor stemlike features and underlying relationships with hazard immune infiltrations based on large prostate cancer cohorts.",
            "Modular arrangements of sequence motifs determine the functional diversity of KDM proteins.",
            "FS-GBDT: identification multicancer-risk module via a feature selection algorithm by integrating Fisher score and GBDT.",
            "Recent advances in biomedical literature mining.",
            "Accurate multistage prediction of protein crystallization propensity using deep-cascade forest with sequence-based features.",
            "Computational principles and practice for decoding immune contexture in the tumor microenvironment.",
            "RaacLogo: a new sequence logo generator by using reduced amino acid clusters.",
            "Different molecular enumeration influences in deep learning: an example using aqueous solubility.",
            "Large-scale benchmark study of survival prediction methods using multi-omics data.",
            "DTI-MLCD: predicting drug-target interactions using multi-label learning with community detection method.",
            "Letter to the Editor: Methods for mapping quantitative trait loci in autotetraploid species.",
            "Distance-based phylogenetic inference from typing data: a unifying view.",
            "AntiCP 2.0: an updated model for predicting anticancer peptides.",
            "In silico prediction of host-pathogen protein interactions in melioidosis pathogen Burkholderia pseudomallei and human reveals novel virulence factors and their targets.",
            "CHTKC: a robust and efficient k-mer counting algorithm based on a lock-free chaining hash table.",
            "Tensor decomposition with relational constraints for predicting multiple types of microRNA-disease associations.",
            "In silico tools for accurate HLA and KIR inference from clinical sequencing data empower immunogenetics on individual-patient and population scales.",
            "Normal tissue content impact on the GBM molecular classification.",
            "Docking of peptides to GPCRs using a combination of CABS-dock with FlexPepDock refinement.",
            "Predicting the stability of mutant proteins by computational approaches: an overview.",
            "Recent advances of automated methods for searching and extracting genomic variant information from biomedical literature.",
            "ProtFold-DFG: protein fold recognition by combining Directed Fusion Graph and PageRank algorithm.",
            "FoldRec-C2C: protein fold recognition by combining cluster-to-cluster model and protein similarity network.",
            "Proper imputation of missing values in proteomics datasets for differential expression analysis.",
            "Microsatellite instability status differentially associates with intratumoral immune microenvironment in human cancers.",
            "Recent advances in user-friendly computational tools to engineer protein function.",
            "Prostate cancer early diagnosis: circulating microRNA pairs potentially beyond single microRNAs upon 1231 serum samples.",
            "CodAn: predictive models for precise identification of coding regions in eukaryotic transcripts.",
            "Bioinformatics toolbox for exploring protein phosphorylation network.",
            "Deep4mC: systematic assessment and computational prediction for DNA N4-methylcytosine sites by deep learning.",
            "Computational recognition of lncRNA signature of tumor-infiltrating B lymphocytes with potential implications in prognosis and immunotherapy of bladder cancer.",
            "An in silico approach to identification, categorization and prediction of nucleic acid binding proteins.",
            "Using deep neural networks and biological subwords to detect protein S-sulfenylation sites.",
            "Identifying the tissues-of-origin of circulating cell-free DNAs is a promising way in noninvasive diagnostics.",
            "IHP-PING - generating integrated human protein-protein interaction networks on-the-fly.",
            "GP4: an integrated Gram-Positive Protein Prediction Pipeline for subcellular localization mimicking bacterial sorting.",
            "Revisiting genome-wide association studies from statistical modelling to machine learning.",
            "Sample-specific perturbation of gene interactions identifies breast cancer subtypes.",
            "Systematic characterization and prediction of coenzyme A-associated proteins using sequence and network information.",
            "CellTalkDB: a manually curated database of ligand-receptor interactions in humans and mice.",
            "Pathogenic gene prediction based on network embedding.",
            "MCCS, a novel characterization method for protein-ligand complex.",
            "iCircRBP-DHN: identification of circRNA-RBP interaction sites using deep hierarchical network.",
            "Do we need different machine learning algorithms for QSAR modeling? A comprehensive assessment of 16 machine learning algorithms on 14 QSAR data sets.",
            "A systematic analysis of miRNA markers and classification algorithms for forensic body fluid identification.",
            "Prediction of driver variants in the cancer genome via machine learning methodologies.",
            "Synthetic observations from deep generative models and binary omics data with limited sample size.",
            "Current challenges for unseen-epitope TCR interaction prediction and a new perspective derived from image classification.",
            "nMAGMA: a network-enhanced method for inferring risk genes from GWAS summary statistics and its application to schizophrenia.",
            "Precise uncertain significance prediction using latent space matrix factorization models: genomics variant and heterogeneous clinical data-driven approaches.",
            "Are dropout imputation methods for scRNA-seq effective for scHi-C data?",
            "Novel ChIP-seq simulating program with superior versatility: isChIP.",
            "NGPINT: a next-generation protein-protein interaction software.",
            "Multimodal analysis of gene expression from postmortem brains and blood identifies synaptic vesicle trafficking genes to be associated with Parkinson's disease.",
            "Recent advances in network-based methods for disease gene prediction.",
            "InstaDock: A single-click graphical user interface for molecular docking-based virtual high-throughput screening.",
            "NetCoMi: network construction and comparison for microbiome data in R.",
            "Sequencing dropout-and-batch effect normalization for single-cell mRNA profiles: a survey and comparative analysis.",
            "Cloud 3D-QSAR: a web tool for the development of quantitative structure-activity relationship models in drug discovery.",
            "A deep learning approach for filtering structural variants in short read sequencing data.",
            "Iterative feature representation algorithm to improve the predictive performance of N7-methylguanosine sites.",
            "Predicting drug-disease associations through layer attention graph convolutional network.",
            "A graph auto-encoder model for miRNA-disease associations prediction.",
            "Semantic similarity and machine learning with ontologies.",
            "DeepHPV: a deep learning model to predict human papillomavirus integration sites.",
            "Capacity building for whole genome sequencing of Mycobacterium tuberculosis and bioinformatics in high TB burden countries.",
            "Machine learning application identifies novel gene signatures from transcriptomic data of spontaneous canine hemangiosarcoma.",
            "VPTMdb: a viral posttranslational modification database.",
            "The status of causality in biological databases: data resources and data retrieval possibilities to support logical modeling.",
            "Computational methods for annotation of plant regulatory non-coding RNAs using RNA-seq.",
            "Prediction of protein-carbohydrate complex binding affinity using structural features.",
            "ColorCells: a database of expression, classification and functions of lncRNAs in single cells.",
            "Deep forest ensemble learning for classification of alignments of non-coding RNA sequences based on multi-view structure representations.",
            "A practical guide to mechanistic systems modeling in biology using a logic-based approach.",
            "DeepYY1: a deep learning approach to identify YY1-mediated chromatin loops.",
            "A comprehensive survey on computational methods of non-coding RNA and disease association prediction.",
            "Molecular characterization, biological function, tumor microenvironment association and clinical significance of m6A regulators in lung adenocarcinoma.",
            "SICaRiO: short indel call filtering with boosting.",
            "ABCModeller: an automatic data mining tool based on a consistent voting method with a user-friendly graphical interface.",
            "Prognostic outcome prediction by semi-supervised least squares classification.",
            "Negative Binomial mixed models estimated with the maximum likelihood method can be used for longitudinal RNAseq data.",
            "FunRes: resolving tissue-specific functional cell states based on a cell-cell communication network model.",
            "DeepSSV: detecting somatic small variants in paired tumor and normal sequencing data with convolutional neural network.",
            "Understanding the unimodal distributions of cancer occurrence rates: it takes two factors for a cancer to occur.",
            "Topological network measures for drug repositioning.",
            "Drug-drug interaction prediction with Wasserstein Adversarial Autoencoder-based knowledge graph embeddings.",
            "LDBlockShow: a fast and convenient tool for visualizing linkage disequilibrium and haplotype blocks based on variant call format files.",
            "Predicting enhancer-promoter interactions by deep learning and matching heuristic.",
            "Machine learning-based integrative analysis of methylome and transcriptome identifies novel prognostic DNA methylation signature in uveal melanoma.",
            "A genome-wide association study to identify candidate genes for erectile dysfunction.",
            "Optimized combination methods for exploring and verifying disease-resistant transcription factors in melon.",
            "Dynamics of transcriptional and post-transcriptional regulation.",
            "A comprehensive comparison of residue-level methylation levels with the regression-based gene-level methylation estimations by ReGear.",
            "kTWAS: integrating kernel machine with transcriptome-wide association studies improves statistical power and reveals novel genes.",
            "Evaluation of consensus strategies for haplotype phasing.",
            "ChemFLuo: a web-server for structure analysis and identification of fluorescent compounds.",
            "A spectral clustering with self-weighted multiple kernel learning method for single-cell RNA-seq data.",
            "KNIndex: a comprehensive database of physicochemical properties for k-tuple nucleotides.",
            "Transcriptional landscape of cholangiocarcinoma revealed by weighted gene coexpression network analysis.",
            "Epigenetically regulated gene expression profiles reveal four molecular subtypes with prognostic and therapeutic implications in colorectal cancer.",
            "Computational drug repositioning based on the relationships between substructure-indication.",
            "scAPAtrap: identification and quantification of alternative polyadenylation sites from single-cell RNA-seq data.",
            "A survey on deep learning in DNA/RNA motif mining.",
            "Tracing the footsteps of autophagy in computational biology.",
            "Identification of pan-cancer Ras pathway activation with deep learning.",
            "PERHAPS: Paired-End short Reads-based HAPlotyping from next-generation Sequencing data.",
            "ChemGenerator: a web server for generating potential ligands for specific targets.",
            "Robust Huber-LASSO for improved prediction of protein, metabolite and gene expression levels relying on individual genotype data.",
            "MloDisDB: a manually curated database of the relations between membraneless organelles and diseases.",
            "Computational drug repositioning based on multi-similarities bilinear matrix factorization.",
            "TrimNet: learning molecular representation from triplet messages for biomedicine.",
            "GuidingNet: revealing transcriptional cofactor and predicting binding for DNA methyltransferase by network regularization.",
            "Predicting the interaction biomolecule types for lncRNA: an ensemble deep learning approach.",
            "DiSNEP: a Disease-Specific gene Network Enhancement to improve Prioritizing candidate disease genes.",
            "Deep-DRM: a computational method for identifying disease-related metabolites based on graph deep learning approaches.",
            "A review of digital cytometry methods: estimating the relative abundance of cell types in a bulk of cells.",
            "Unveiling the immune infiltrate modulation in cancer and response to immunotherapy by MIXTURE - an enhanced deconvolution method.",
            "Computational prediction and interpretation of cell-specific replication origin sites from multiple eukaryotes by exploiting stacking framework.",
            "Deep-Kcr: accurate detection of lysine crotonylation sites using deep learning method.",
            "Deep-joint-learning analysis model of single cell transcriptome and open chromatin accessibility data.",
            "MSIsensor-ct: microsatellite instability detection using cfDNA sequencing data.",
            "Identification of haploinsufficient genes from epigenomic data using deep forest.",
            "Is acupuncture effective in the treatment of COVID-19 related symptoms? Based on bioinformatics/network topology strategy.",
            "Benchmarking network-based gene prioritization methods for cerebral small vessel disease.",
            "A survey on computational models for predicting protein-protein interactions.",
            "ATSE: a peptide toxicity predictor by exploiting structural and evolutionary information based on graph neural network and attention mechanism.",
            "Pan-cancer analyses reveal regulation and clinical outcome association of the shelterin complex in cancer.",
            "eQTLHap: a tool for comprehensive eQTL analysis considering haplotypic and genotypic effects.",
            "m6A regulator-mediated methylation modification patterns and characteristics of immunity and stemness in low-grade glioma.",
            "A comprehensive overview and critical evaluation of gene regulatory network inference technologies.",
            "Feature extraction approaches for biological sequences: a comparative study of mathematical features.",
            "GAERF: predicting lncRNA-disease associations by graph auto-encoder and random forest.",
            "Prediction and collection of protein-metabolite interactions.",
            "siGCD: a web server to explore survival interaction of genes, cells and drugs in human cancers.",
            "SBGN Bricks Ontology as a tool to describe recurring concepts in molecular networks.",
            "Inflated false discovery rate due to volcano plots: problem and solutions.",
            "Choice of assemblers has a critical impact on de novo assembly of SARS-CoV-2 genome and characterizing variants.",
            "DeFusion: a denoised network regularization framework for multi-omics integration.",
            "HISNAPI: a bioinformatic tool for dynamic hot spot analysis in nucleic acid-protein interface with a case study.",
            "DSTG: deconvoluting spatial transcriptomics data through graph-based artificial intelligence.",
            "A community-supported metaproteomic pipeline for improving peptide identifications in hydrothermal vent microbiota.",
            "Deep drug-target binding affinity prediction with multiple attention blocks.",
            "DeepDTAF: a deep learning method to predict protein-ligand binding affinity.",
            "Accurate feature selection improves single-cell RNA-seq cell clustering.",
            "Accuracy or novelty: what can we gain from target-specific machine-learning-based scoring functions in virtual screening?",
            "A transformer architecture based on BERT and 2D convolutional neural network to identify DNA enhancers from sequence information.",
            "Oxford nanopore sequencing in clinical microbiology and infection diagnostics.",
            "An end-to-end heterogeneous graph representation learning-based framework for drug-target interaction prediction.",
            "CanDriS: posterior profiling of cancer-driving sites based on two-component evolutionary model.",
            "Anthem: a user customised tool for fast and accurate prediction of binding between peptides and HLA class I molecules.",
            "Implementing FAIR data management within the German Network for Bioinformatics Infrastructure (de.NBI) exemplified by selected use cases.",
            "Rank normalization empowers a t-test for microbiome differential abundance analysis while controlling for false discoveries.",
            "RNA2HLA: HLA-based quality control of RNA-seq datasets.",
            "Deep learning of gene relationships from single cell time-course expression data.",
            "Tools for time-course simulation in systems biology: a brief overview.",
            "ExonSkipAD provides the functional genomic landscape of exon skipping events in Alzheimer's disease.",
            "ngsComposer: an automated pipeline for empirically based NGS data quality filtering.",
            "A comprehensive review of the imbalance classification of protein post-translational modifications.",
            "Parallel computing for genome sequence processing.",
            "A spatial-temporal gated attention module for molecular property prediction based on molecular geometry.",
            "Comprehensive benchmarking of software for mapping whole genome bisulfite data: from read alignment to DNA methylation analysis.",
            "Comprehensive review and evaluation of computational methods for identifying FLT3-internal tandem duplication in acute myeloid leukaemia.",
            "Decoding the role of long noncoding RNAs in the healthy aging of centenarians.",
            "usDSM: a novel method for deleterious synonymous mutation prediction using undersampling scheme.",
            "Hyperbolic relational graph convolution networks plus: a simple but highly efficient QSAR-modeling method.",
            "Deep-ABPpred: identifying antibacterial peptides in protein sequences using bidirectional LSTM with word2vec.",
            "Corrigendum to: Systemic effects of missense mutations on SARS-CoV-2 spike glycoprotein stability and receptor-binding affinity.",
            "Exploring associations of non-coding RNAs in human diseases via three-matrix factorization with hypergraph-regular terms on center kernel alignment.",
            "Hypergraph-based persistent cohomology (HPC) for molecular representations in drug design.",
            "iDHS-Deep: an integrated tool for predicting DNase I hypersensitive sites by deep neural network.",
            "Computational resources for identifying and describing proteins driving liquid-liquid phase separation.",
            "Machine learning revealed stemness features and a novel stemness-based classification with appealing implications in discriminating the prognosis, immunotherapy and temozolomide responses of 906 glioblastoma patients.",
            "Contribution of structural accessibility to the cooperative relationship of TF-lncRNA in myopia.",
            "Classification and gene selection of triple-negative breast cancer subtype embedding gene connectivity matrix in deep neural network.",
            "Deep embedded clustering with multiple objectives on scRNA-seq data.",
            "Inference of dynamic spatial GRN models with multi-GPU evolutionary computation.",
            "HCC subtypes based on the activity changes of immunologic and hallmark gene sets in tumor and nontumor tissues.",
            "MITGARD: an automated pipeline for mitochondrial genome assembly in eukaryotic species using RNA-seq data.",
            "Elucidating transcriptomic profiles from single-cell RNA sequencing data using nature-inspired compressed sensing.",
            "Multilevel prioritization of gene regulators associated with consensus molecular subtypes of colorectal cancer.",
            "A map of mass spectrometry-based in silico fragmentation prediction and compound identification in metabolomics.",
            "TIPS: trajectory inference of pathway significance through pseudotime comparison for functional assessment of single-cell RNAseq data.",
            "The landscape of different molecular modules in an immune microenvironment during tuberculosis infection.",
            "Comparative phylogenetic analysis of SARS-CoV-2 spike protein - possibility effect on virus spillover.",
            "IsAb: a computational protocol for antibody design.",
            "Machine learning application for patient stratification and phenotype/genotype investigation in a rare disease.",
            "Machine learning for phytopathology: from the molecular scale towards the network scale.",
            "SGANRDA: semi-supervised generative adversarial networks for predicting circRNA-disease associations.",
            "New framework for recombination and adaptive evolution analysis with application to the novel coronavirus SARS-CoV-2.",
            "Application of learning to rank in bioinformatics tasks.",
            "Anticancer peptides prediction with deep representation learning features.",
            "NCBRPred: predicting nucleic acid binding residues in proteins based on multilabel learning.",
            "iCysMod: an integrative database for protein cysteine modifications in eukaryotes.",
            "Multigene editing: current approaches and beyond.",
            "Towards deep phenotyping pregnancy: a systematic review on artificial intelligence and machine learning methods to improve pregnancy outcomes.",
            "Bioinformatics and machine learning approach identifies potential drug targets and pathways in COVID-19.",
            "jSRC: a flexible and accurate joint learning algorithm for clustering of single-cell RNA-sequencing data.",
            "PreDTIs: prediction of drug-target interactions based on multiple feature information using gradient boosting framework with data balancing and feature selection techniques.",
            "Analyzing master regulators and scRNA-seq of COVID-19 patients reveals an underlying anti-SARS-CoV-2 mechanism of ZNF proteins.",
            "iSMNN: batch effect correction for single-cell RNA-seq data via iterative supervised mutual nearest neighbor refinement.",
            "DisBalance: a platform to automatically build balance-based disease prediction models and discover microbial biomarkers from microbiome data.",
            "SAResNet: self-attention residual network for predicting DNA-protein binding.",
            "Multi-omics approaches for revealing the complexity of cardiovascular disease.",
            "On the limits of active module identification.",
            "Systematic benchmark of ancient DNA read mapping.",
            "Deciphering the genetic code of DNA methylation.",
            "A comprehensive review of scaffolding methods in genome assembly.",
            "Pharmacometabonomics: data processing and statistical analysis.",
            "Machine learning on ligand-residue interaction profiles to significantly improve binding affinity prediction.",
            "GutBalance: a server for the human gut microbiome-based disease prediction and biomarker discovery with compositionality addressed.",
            "Hierarchical mixed-model expedites genome-wide longitudinal association analysis.",
            "Comprehensive characterization of alternative splicing in renal cell carcinoma.",
            "Integrating multi-scale neighbouring topologies and cross-modal similarities for drug-protein interaction prediction.",
            "Comprehensive assessment of machine learning-based methods for predicting antimicrobial peptides.",
            "DECO: a framework for jointly analyzing de novo and rare case/control variants, and biological pathways.",
            "Reusability and composability in process description maps: RAS-RAF-MEK-ERK signalling.",
            "Identification of active molecules against Mycobacterium tuberculosis through machine learning.",
            "Riboexp: an interpretable reinforcement learning framework for ribosome density modeling.",
            "Discovering novel cancer bio-markers in acquired lapatinib resistance using Bayesian methods.",
            "Multi-omic analysis suggests tumor suppressor genes evolved specific promoter features to optimize cancer resistance.",
            "Explainability in transformer models for functional genomics.",
            "ToxCodAn: a new toxin annotator and guide to venom gland transcriptomics.",
            "MicroRNA annotation in plants: current status and challenges.",
            "MMRFBiolinks: an R-package for integrating and analyzing MMRF-CoMMpass data.",
            "Improving feature selection performance for classification of gene expression data using Harris Hawks optimizer with variable neighborhood learning.",
            "Current status and future perspectives of computational studies on human-virus protein-protein interactions.",
            "DeepDRK: a deep learning framework for drug repurposing through kernel-based multi-omics integration.",
            "NIDM: network impulsive dynamics on multiplex biological network for disease-gene prediction.",
            "Critical downstream analysis steps for single-cell RNA sequencing data.",
            "XGSEA: CROSS-species gene set enrichment analysis via domain adaptation.",
            "NMCMDA: neural multicategory MiRNA-disease association prediction.",
            "Insights into the evolutionary forces that shape the codon usage in the viral genome segments encoding intrinsically disordered protein regions.",
            "Persistent spectral hypergraph based machine learning (PSH-ML) for protein-ligand binding affinity prediction.",
            "NPI-GNN: Predicting ncRNA-protein interactions with deep graph neural networks.",
            "Accurate prediction of inter-protein residue-residue contacts for homo-oligomeric protein complexes.",
            "The stacking strategy-based hybrid framework for identifying non-coding RNAs.",
            "Why can deep convolutional neural networks improve protein fold recognition? A visual explanation by interpretation.",
            "Comparison of methods for estimating genetic correlation between complex traits using GWAS summary statistics.",
            "Corrigendum to: FunRes: resolving tissue-specific functional cell states based on a cell-cell communication network model.",
            "Developing intuitive and explainable algorithms through inspiration from human physiology and computational biology.",
            "Locating transcription factor binding sites by fully convolutional neural network.",
            "ADeditome provides the genomic landscape of A-to-I RNA editing in Alzheimer's disease.",
            "PySmash: Python package and individual executable program for representative substructure generation and application.",
            "Network-based modeling of herb combinations in traditional Chinese medicine.",
            "Snipe: highly sensitive pathogen detection from metagenomic sequencing data.",
            "SMMPPI: a machine learning-based approach for prediction of modulators of protein-protein interactions and its application for identification of novel inhibitors for RBD: hACE2 interactions in SARS-CoV-2.",
            "Bioinformatics and machine learning methodologies to identify the effects of central nervous system disorders on glioblastoma progression.",
            "mi-IsoNet: systems-scale microRNA landscape reveals rampant isoform-mediated gain of target interaction diversity and signaling specificity.",
            "Exploring TEAD2 as a drug target for therapeutic intervention of cancer: A multi-computational case study.",
            "A comprehensive survey for human transcription factors on expression, regulation, interaction, phenotype and cancer survival.",
            "Pharmacoinformatics and molecular dynamics simulation-based phytochemical screening of neem plant (Azadiractha indica) against human cancer by targeting MCM7 protein.",
            "Bridging heterogeneous mutation data to enhance disease gene discovery.",
            "Converting single nucleotide variants between genome builds: from cautionary tale to solution.",
            "QSAR-assisted-MMPA to expand chemical transformation space for lead optimization.",
            "FifBase: a comprehensive fertility-associated indicators factor database for domestic animals.",
            "AlignGraph2: similar genome-assisted reassembly pipeline for PacBio long reads.",
            "Computational approaches to amino acid side-chain conformation using combined NMR theoretical and experimental results: leucine-67 in Desulfovibrio vulgaris flavodoxin.",
            "MRCIP: a robust Mendelian randomization method accounting for correlated and idiosyncratic pleiotropy.",
            "Systems pharmacology: a combination strategy for improving efficacy of PD-1/PD-L1 blockade.",
            "Genome-resolved metagenomics using environmental and clinical samples.",
            "Prediction of RNA-binding protein and alternative splicing event associations during epithelial-mesenchymal transition based on inductive matrix completion.",
            "DeepCNV: a deep learning approach for authenticating copy number variations.",
            "SubLocEP: a novel ensemble predictor of subcellular localization of eukaryotic mRNA based on machine learning.",
            "CNA2Subpathway: identification of dysregulated subpathway driven by copy number alterations in cancer.",
            "Progress and challenge for computational quantification of tissue immune cells.",
            "Integrated hybrid de novo assembly technologies to obtain high-quality pig genome using short and long reads.",
            "Erratum to: Comprehensive benchmarking of software for mapping whole genome bisulfite data: from read alignment to DNA methylation analysis.",
            "Analysis of selection in protein-coding sequences accounting for common biases.",
            "Venn diagrams in bioinformatics.",
            "Machine learning approach to gene essentiality prediction: a review.",
            "TAD boundary and strength prediction by integrating sequence and epigenetic profile information.",
            "Transcriptomic studies revealed pathophysiological impact of COVID-19 to predominant health conditions.",
            "Comparative analysis of molecular fingerprints in prediction of drug combination effects.",
            "Comparison of approaches to transcriptomic analysis in multi-sampled tumors.",
            "Corrigendum to: Computational design of ultrashort peptide inhibitors of the receptor-binding domain of the SARS-CoV-2 S protein.",
            "SSI-DDI: substructure-substructure interactions for drug-drug interaction prediction.",
            "Quercetin for COVID-19 and DENGUE co-infection: a potential therapeutic strategy of targeting critical host signal pathways triggered by SARS-CoV-2 and DENV.",
            "Integrative machine learning framework for the identification of cell-specific enhancers from the human genome.",
            "ADEIP: an integrated platform of age-dependent expression and immune profiles across human tissues.",
            "Tracing the evolution of aneuploid cancers by multiregional sequencing with CRUST.",
            "Multi-omics data integration and network-based analysis drives a multiplex drug repurposing approach to a shortlist of candidate drugs against COVID-19.",
            "DevOmics: an integrated multi-omics database of human and mouse early embryo.",
            "Shall genomic correlation structure be considered in copy number variants detection?",
            "Knowledge bases and software support for variant interpretation in precision oncology.",
            "Chrom-Lasso: a lasso regression-based model to detect functional interactions using Hi-C data.",
            "A machine learning framework to predict antibiotic resistance traits and yet unknown genes underlying resistance to specific antibiotics in bacterial strains.",
            "SSG-LUGIA: Single Sequence based Genome Level Unsupervised Genomic Island Prediction Algorithm.",
            "Defining the functional divergence of orthologous genes between human and mouse in the context of miRNA regulation.",
            "The accurate prediction and characterization of cancerlectin by a combined machine learning and GO analysis.",
            "Deep learning methods for biomedical named entity recognition: a survey and qualitative comparison.",
            "Anti-bias training for (sc)RNA-seq: experimental and computational approaches to improve precision.",
            "MHCBI: a pipeline for calculating peptide-MHC binding energy using semi-empirical quantum mechanical methods with explicit/implicit solvent models.",
            "Forman persistent Ricci curvature (FPRC)-based machine learning models for protein-ligand binding affinity prediction.",
            "Predicting MHC class I binder: existing approaches and a novel recurrent neural network solution.",
            "AVPIden: a new scheme for identification and functional prediction of antiviral peptides based on machine learning approaches.",
            "Corrigendum to: Genetic mechanisms of COVID-19 and its association with smoking and alcohol consumption.",
            "Machine learning approaches for drug combination therapies.",
            "A genomic data resource for predicting antimicrobial resistance from laboratory-derived antimicrobial susceptibility phenotypes.",
            "Mol2Context-vec: learning molecular representation from context awareness for drug discovery.",
            "Leveraging the attention mechanism to improve the identification of DNA N6-methyladenine sites.",
            "RefRGim: an intelligent reference panel reconstruction method for genotype imputation with convolutional neural networks.",
            "FROGS: a powerful tool to analyse the diversity of fungi with special management of internal transcribed spacers.",
            "Genetic mechanisms of COVID-19 and its association with smoking and alcohol consumption.",
            "Circular RNAs and complex diseases: from experimental results to computational models.",
            "An effective self-supervised framework for learning expressive molecular global representations to drug discovery.",
            "APPTEST is a novel protocol for the automatic prediction of peptide tertiary structures.",
            "Reconciling multiple connectivity scores for drug repurposing.",
            "Exosomal ncRNAs profiling of mycobacterial infection identified miRNA-185-5p as a novel biomarker for tuberculosis.",
            "Improving Single-Cell RNA-seq Clustering by Integrating Pathways.",
            "Machine learning builds full-QM precision protein force fields in seconds.",
            "Machine-learning scoring functions trained on complexes dissimilar to the test set already outperform classical counterparts on a blind benchmark.",
            "Exploring effectiveness of ab-initio protein-protein docking methods on a novel antibacterial protein complex dataset.",
            "A novel graph attention model for predicting frequencies of drug-side effects from multi-view data.",
            "Computationally scalable regression modeling for ultrahigh-dimensional omics data with ParProx.",
            "DISMIR: Deep learning-based noninvasive cancer detection by integrating DNA sequence and methylation information of individual cell-free DNA reads.",
            "Network-based identification of key master regulators associated with an immune-silent cancer phenotype.",
            "WEVar: a novel statistical learning framework for predicting noncoding regulatory variants.",
            "Understanding structural malleability of the SARS-CoV-2 proteins and relation to the comorbidities.",
            "Discovering common pathogenetic processes between COVID-19 and diabetes mellitus by differential gene expression pattern analysis.",
            "Deep learning-based real-time detection of novel pathogens during sequencing.",
            "Chromatin loop anchors predict transcript and exon usage.",
            "A heterogeneous network embedding framework for predicting similarity-based drug-target interactions.",
            "COVID-19 biomarkers and their overlap with comorbidities in a disease biomarker data model.",
            "EMNUSS: a deep learning framework for secondary structure annotation in cryo-EM maps.",
            "Updates to HCOP: the HGNC comparison of orthology predictions tool.",
            "A new thinking: extended application of genomic selection to screen multiomics data for development of novel hypoxia-immune biomarkers and target therapy of clear cell renal cell carcinoma.",
            "Performance evaluation of transcriptomics data normalization for survival risk prediction.",
            "Elucidation of dynamic microRNA regulations in cancer progression using integrative machine learning.",
            "COSMIC Cancer Gene Census 3D database: understanding the impacts of mutations on cancer targets.",
            "Web repositories of natural agents promote pests and pathogenic microbes management.",
            "Distinct effect of prenatal and postnatal brain expression across 20 brain disorders and anthropometric social traits: a systematic study of spatiotemporal modularity.",
            "REBET: a method to determine the number of cell clusters based on batch effect removal.",
            "Published anti-SARS-CoV-2 in vitro hits share common mechanisms of action that synergize with antivirals.",
            "GESLM algorithm for detecting causal SNPs in GWAS with multiple phenotypes.",
            "Selecting gene features for unsupervised analysis of single-cell gene expression data.",
            "XOmiVAE: an interpretable deep learning model for cancer classification using high-dimensional omics data.",
            "Detecting methylation quantitative trait loci using a methylation random field method.",
            "Addressing data imbalance problems in ligand-binding site prediction using a variational autoencoder and a convolutional neural network.",
            "ProtCHOIR: a tool for proteome-scale generation of homo-oligomers.",
            "Bioinformatics and system biology approaches to identify the diseasome and comorbidities complexities of SARS-CoV-2 infection with the digestive tract disorders.",
            "A systematic comparison of normalization methods for eQTL analysis.",
            "An artificial neural network model based on DNA damage response genes to predict outcomes of lower-grade glioma patients.",
            "High-dimensional generalized propensity score with application to omics data.",
            "Molecular design in drug discovery: a comprehensive review of deep generative models.",
            "PScL-HDeep: image-based prediction of protein subcellular location in human tissue using ensemble learning of handcrafted and deep learned features with two-layer feature selection.",
            "Prediction of RBP binding sites on circRNAs using an LSTM-based deep sequence learning architecture.",
            "Data-driven identification of SARS-CoV-2 subpopulations using PhenoGraph and binary-coded genomic data.",
            "Identification of viral-mediated pathogenic mechanisms in neurodegenerative diseases using network-based approaches.",
            "DITHER: an algorithm for Defining IntraTumor Heterogeneity based on EntRopy.",
            "Corrigendum to: Evaluation of machine learning approaches for cell-type identification from single-cell transcriptomics data.",
            "Improved prediction of protein-protein interaction using a hybrid of functional-link Siamese neural network and gradient boosting machines.",
            "iAMP-CA2L: a new CNN-BiLSTM-SVM classifier based on cellular automata image for identifying antimicrobial peptides and their functional types.",
            "Consensus clustering of single-cell RNA-seq data by enhancing network affinity.",
            "In silico model for miRNA-mediated regulatory network in cancer.",
            "Human host status inference from temporal microbiome changes via recurrent neural networks.",
            "Improving protein fold recognition using triplet network and ensemble deep learning.",
            "Tripal, a community update after 10 years of supporting open source, standards-based genetic, genomic and breeding databases.",
            "NeuroPred-FRL: an interpretable prediction model for identifying neuropeptide using feature representation learning.",
            "Systematic evaluation of transcriptomics-based deconvolution methods and references using thousands of clinical samples.",
            "A transferable deep learning approach to fast screen potential antiviral drugs against SARS-CoV-2.",
            "KCRR: a nonlinear machine learning with a modified genomic similarity matrix improved the genomic prediction efficiency.",
            "Integrative-omics for discovery of network-level disease biomarkers: a case study in Alzheimer's disease.",
            "Local ancestry inference in heterogeneous populations - Are recent recombination events more relevant?",
            "PreTP-EL: prediction of therapeutic peptides based on ensemble learning.",
            "Identifying complex gene-gene interactions: a mixed kernel omnibus testing approach.",
            "An integrated computational pipeline for designing high-affinity nanobodies with expanded genetic codes.",
            "Polyadenylation-related isoform switching in human evolution revealed by full-length transcript structure.",
            "Characterization and comparison of gene-centered human interactomes.",
            "A comparison of metabolic labeling and statistical methods to infer genome-wide dynamics of RNA turnover.",
            "A predictive paradigm for COVID-19 prognosis based on the longitudinal measure of biomarkers.",
            "ENNAVIA is a novel method which employs neural networks for antiviral and anti-coronavirus activity prediction for therapeutic peptides.",
            "A multiple network-based bioinformatics pipeline for the study of molecular mechanisms in oncological diseases for personalized medicine.",
            "Resolving complex structures at oncovirus integration loci with conjugate graph.",
            "Comparison of sparse biclustering algorithms for gene expression datasets.",
            "A novel computational framework for genome-scale alternative transcription units prediction.",
            "Assessing the performance of computational predictors for estimating protein stability changes upon missense mutations.",
            "TransRef enables accurate transcriptome assembly by redefining accurate neo-splicing graphs.",
            "Likelihood-based tests for detecting circadian rhythmicity and differential circadian patterns in transcriptomic applications.",
            "Improving distance measures between genomic tracks with mutual proximity.",
            "ProTICS reveals prognostic impact of tumor infiltrating immune cells in different molecular subtypes.",
            "Pan-cancer application of a lung-adenocarcinoma-derived gene-expression-based prognostic predictor.",
            "oncoPredict: an R package for predicting in vivo or cancer patient drug response and biomarkers from cell line screening data.",
            "Evaluation of in silico tools for the prediction of protein and peptide aggregation on diverse datasets.",
            "A multi-modal data harmonisation approach for discovery of COVID-19 drug targets.",
            "A new method to accurately identify single nucleotide variants using small FFPE breast samples.",
            "QuantifyPoly(A): reshaping alternative polyadenylation landscapes of eukaryotes with weighted density peak clustering.",
            "nhKcr: a new bioinformatics tool for predicting crotonylation sites on human nonhistone proteins based on deep learning.",
            "Deep learning model reveals potential risk genes for ADHD, especially Ephrin receptor gene EPHA5.",
            "Network-guided identification of cancer-selective combinatorial therapies in ovarian cancer.",
            "In silico binding profile characterization of SARS-CoV-2 spike protein and its mutants bound to human ACE2 receptor.",
            "EcTracker: Tracking and elucidating ectopic expression leveraging large-scale scRNA-seq studies.",
            "Comprehensive analysis of partial methylation domains in colorectal cancer based on single-cell methylation profiles.",
            "scAdapt: virtual adversarial domain adaptation network for single cell RNA-seq data classification across platforms and species.",
            "Porpoise: a new approach for accurate prediction of RNA pseudouridine sites.",
            "Utilizing graph machine learning within drug discovery and development.",
            "Systematic comparison of ligand-based and structure-based virtual screening methods on poly (ADP-ribose) polymerase-1 inhibitors.",
            "Identifying complex motifs in massive omics data with a variable-convolutional layer in deep neural network.",
            "Evotuning protocols for Transformer-based variant effect prediction on multi-domain proteins.",
            "TSSFinder - fast and accurate ab initio prediction of the core promoter in eukaryotic genomes.",
            "Identification of multiple RNAs using feature fusion.",
            "bayesynergy: flexible Bayesian modelling of synergistic interaction effects in in vitro drug combination experiments.",
            "PCLasso: a protein complex-based, group lasso-Cox model for accurate prognosis and risk protein complex discovery.",
            "Integration and interplay of machine learning and bioinformatics approach to identify genetic interaction related to ovarian cancer chemoresistance.",
            "Supervised application of internal validation measures to benchmark dimensionality reduction methods in scRNA-seq data.",
            "An end-to-end heterogeneous graph attention network for Mycobacterium tuberculosis drug-resistance prediction.",
            "DNAgenie: accurate prediction of DNA-type-specific binding residues in protein sequences.",
            "Aperture: alignment-free detection of structural variations and viral integrations in circulating tumor DNA.",
            "Reviewing and assessing existing meta-analysis models and tools.",
            "Matrix factorization-based data fusion for the prediction of RNA-binding proteins and alternative splicing event associations during epithelial-mesenchymal transition.",
            "Drug sensitivity prediction from cell line-based pharmacogenomics data: guidelines for developing machine learning models.",
            "Tracking the pipeline: immunoinformatics and the COVID-19 vaccine design.",
            "MIMIC: an optimization method to identify cell type-specific marker panel for cell sorting.",
            "Prediction of tumor purity from gene expression data using machine learning.",
            "Knowledge bases and software support for variant interpretation in precision oncology.",
            "An integrated approach for copy number variation discovery in parent-offspring trios.",
            "Computational design of ultrashort peptide inhibitors of the receptor-binding domain of the SARS-CoV-2 S protein.",
            "Co-mutation modules capture the evolution and transmission patterns of SARS-CoV-2.",
            "Demystifying emerging bulk RNA-Seq applications: the application and utility of bioinformatic methodology.",
            "DeepR2cov: deep representation learning on heterogeneous drug networks to discover anti-inflammatory agents for COVID-19.",
            "NSL2CD: identifying potential circRNA-disease associations based on network embedding and subspace learning.",
            "PSSP-MVIRT: peptide secondary structure prediction based on a multi-view deep learning architecture.",
            "Detecting SARS-CoV-2 and its variant strains with a full genome tiling array.",
            "Erratum: usDSM: a novel method for deleterious synonymous mutation prediction using undersampling scheme.",
            "The peripheral and core regions of virus-host network of COVID-19.",
            "A novel framework integrating AI model and enzymological experiments promotes identification of SARS-CoV-2 3CL protease inhibitors and activity-based probe.",
            "NeuroPpred-Fuse: an interpretable stacking model for prediction of neuropeptides by fusing sequence information and feature selection methods.",
            "An approach to gene-based testing accounting for dependence of tests among nearby genes.",
            "Erratum to: Analysis, identification and visualization of subgroups in genomics.",
            "A systematic evaluation of the computational tools for lncRNA identification.",
            "DeepFeature: feature selection in nonimage data using convolutional neural network.",
            "De novo generation of dual-target ligands using adversarial training and reinforcement learning.",
            "DeepDRIM: a deep neural network to reconstruct cell-type-specific gene regulatory network using single-cell RNA-seq data.",
            "HelPredictor models single-cell transcriptome to predict human embryo lineage allocation.",
            "Large scale RNA-binding proteins/LncRNAs interaction analysis to uncover lncRNA nuclear localization mechanisms.",
            "Functional meta-omics provide critical insights into long- and short-read assemblies.",
            "iDeepSubMito: identification of protein submitochondrial localization with deep learning.",
            "Improved protein contact prediction using dimensional hybrid residual networks and singularity enhanced loss function.",
            "DLpTCR: an ensemble deep learning framework for predicting immunogenic peptide recognized by T cell receptor.",
            "Cell fate conversion prediction by group sparse optimization method utilizing single-cell and bulk OMICs data.",
            "ARAMIS: From systematic errors of NGS long reads to accurate assemblies.",
            "Global characterization of B cell receptor repertoire in COVID-19 patients by single-cell V(D)J sequencing.",
            "Recent omics-based computational methods for COVID-19 drug discovery and repurposing.",
            "MDA-GCNFTG: identifying miRNA-disease associations based on graph convolutional networks via graph sampling through the feature and topology graph.",
            "Single-cell Hi-C data analysis: safety in numbers.",
            "MG-BERT: leveraging unsupervised atomic representation learning for molecular property prediction.",
            "Deep fusion learning facilitates anatomical therapeutic chemical recognition in drug repurposing and discovery.",
            "Application of artificial intelligence and machine learning for COVID-19 drug discovery and vaccine design.",
            "Artificial intelligence and machine learning methods in predicting anti-cancer drug combination effects.",
            "A comparative benchmark of classic DNA motif discovery tools on synthetic data.",
            "High-performance deep learning pipeline predicts individuals in mixtures of DNA using sequencing data.",
            "Predicting potential small molecule-miRNA associations based on bounded nuclear norm regularization.",
            "A gentle introduction to understanding preclinical data for cancer pharmaco-omic modeling.",
            "Genome-wide hierarchical mixed model association analysis.",
            "Identification of miRNA-disease associations via multiple information integration with Bayesian ranking.",
            "A systematic comparison of data- and knowledge-driven approaches to disease subtype discovery.",
            "Distance-guided protein folding based on generalized descent direction.",
            "Detection algorithms and attentive points of safety signal using spontaneous reporting systems as a clinical data source.",
            "Mendelian randomization under the omnigenic architecture.",
            "Learning to SMILES: BAN-based strategies to improve latent representation learning from molecules.",
            "A comprehensive comparative assessment of 3D molecular similarity tools in ligand-based virtual screening.",
            "A comparative analysis of RNA-binding proteins binding models learned from RNAcompete, RNA Bind-n-Seq and eCLIP data.",
            "High-resolution transcription factor binding sites prediction improved performance and interpretability by deep learning method.",
            "DeepImmuno: deep learning-empowered prediction and generation of immunogenic peptides for T-cell immunity.",
            "Erratum to: Evotuning protocols for Transformer-based variant effect prediction on multi-domain proteins.",
            "Methods of privacy-preserving genomic sequencing data alignments.",
            "Resilience function uncovers the critical transitions in cancer initiation.",
            "A new approach to decode DNA methylome and genomic variants simultaneously from double strand bisulfite sequencing.",
            "Structure-based drug repurposing against COVID-19 and emerging infectious diseases: methods, resources and discoveries.",
            "Identification of genetic variations associated with drug resistance in non-small cell lung cancer patients undergoing systemic treatment.",
            "MMFGRN: a multi-source multi-model fusion method for gene regulatory network reconstruction.",
            "Recognizing binding sites of poorly characterized RNA-binding proteins on circular RNAs using attention Siamese network.",
            "Single-cell multi-omics sequencing: application trends, COVID-19, data analysis issues and prospects.",
            "Erratum to: Identification of multiple RNAs using feature fusion.",
            "AniAMPpred: artificial intelligence guided discovery of novel antimicrobial peptides in animal kingdom.",
            "A novel antibacterial peptide recognition algorithm based on BERT.",
            "LSTM-PHV: prediction of human-virus protein-protein interactions by LSTM with word2vec.",
            "Strand Orientation Bias Detector to determine the probability of FFPE sequencing artifacts.",
            "ConsRM: collection and large-scale prediction of the evolutionarily conserved RNA methylation sites, with implications for the functional epitranscriptome.",
            "Benchmarking association analyses of continuous exposures with RNA-seq in observational studies.",
            "WDNE: an integrative graphical model for inferring differential networks from multi-platform gene expression data with missing values.",
            "Multi-view Multichannel Attention Graph Convolutional Network for miRNA-disease association prediction.",
            "Drug repositioning based on the heterogeneous information fusion graph convolutional network.",
            "StackIL6: a stacking ensemble model for improving the prediction of IL-6 inducing peptides."
        ]
    },
    {
        "name": "Briefings in Bioinformatics",
        "year": "2020",
        "info": "Volume 21, 2020",
        "count": 177,
        "papers": [
            "Sequence clustering in bioinformatics: an empirical study.",
            "CPPred-FL: a sequence-based predictor for large-scale identification of cell-penetrating peptides by feature representation learning.",
            "Strategies for calibrating models of biology.",
            "Comprehensive and critical evaluation of individualized pathway activity measurement tools on pan-cancer data.",
            "MicroRNA-small molecule association identification: from experimental results to computational models.",
            "Human-like layout algorithms for signalling hypergraphs: outlining requirements.",
            "The landscape of miRNA-related ceRNA networks for marking different renal cell carcinoma subtypes.",
            "Landscape of SNPs-mediated lncRNA structural variations and their implication in human complex diseases.",
            "The application of Hadoop in structural bioinformatics.",
            "Comparative analysis and prediction of quorum-sensing peptides using feature representation learning and machine learning algorithms.",
            "A comprehensive review of computational prediction of genome-wide features.",
            "Characteristics of plant circular RNAs.",
            "Dating admixture events is unsolved problem in multi-way admixed populations.",
            "Multilevel heterogeneous omics data integration with kernel fusion.",
            "Comprehensive review of the identification of essential genes using computational methods: focusing on feature implementation and assessment.",
            "Network embedding in biomedical data science.",
            "Fuzzy Petri nets for modelling of uncertain biological systems.",
            "Interactive visual analysis of drug-target interaction networks using Drug Target Profiler, with applications to precision medicine and drug repurposing.",
            "Quantifying Waddington's epigenetic landscape: a comparison of single-cell potency measures.",
            "Algebraic shortcuts for leave-one-out cross-validation in supervised network inference.",
            "Copy number aberrations from Affymetrix SNP 6.0 genotyping data - how accurate are commonly used prediction approaches?",
            "Comprehensive assessment of nine docking programs on type II kinase inhibitors: prediction accuracy of sampling power, scoring power and screening power.",
            "HITS-PR-HHblits: protein remote homology detection by combining PageRank and Hyperlink-Induced Topic Search.",
            "dbCPM: a manually curated database for exploring the cancer passenger mutations.",
            "AIMMS suite: a web server dedicated for prediction of drug resistance on protein mutation.",
            "gmRAD: an integrated SNP calling pipeline for genetic mapping with RADseq across a hybrid population.",
            "Cancer-specific expression quantitative loci are affected by expression dysregulation.",
            "CytoPred: 7-gene pair metric for AML cytogenetic risk prediction.",
            "Bioinformatics methodologies for coeliac disease and its comorbidities.",
            "Graph- and rule-based learning algorithms: a comprehensive review of their applications for cancer type classification and prognosis using genomic data.",
            "Homeolog expression quantification methods for allopolyploids.",
            "Empirical comparison and analysis of web-based cell-penetrating peptide prediction tools.",
            "Investigating the role of Simpson's paradox in the analysis of top-ranked features in high-dimensional bioinformatics datasets.",
            "Computational medicine: quantitative modeling of complex diseases.",
            "Decoding competing endogenous RNA networks for cancer biomarker discovery.",
            "Disentangling the complexity of low complexity proteins.",
            "Evaluation of ontology structural metrics based on public repository data.",
            "Computational methods for identifying the critical nodes in biological networks.",
            "In silico drug repositioning based on drug-miRNA associations.",
            "Ensuring privacy and security of genomic data and functionalities.",
            "A comparison of deterministic and stochastic approaches for sensitivity analysis in computational systems biology.",
            "Evaluation of integrative clustering methods for the analysis of multi-omics data.",
            "Sensitivity and specificity of information criteria.",
            "Network-based methods for predicting essential genes or proteins: a survey.",
            "New approaches for metagenome assembly with short reads.",
            "Computational prediction and analysis of species-specific fungi phosphorylation via feature optimization strategy.",
            "Structure-based prediction of post-translational modification cross-talk within proteins using complementary residue- and residue pair-based features.",
            "ANPELA: analysis and performance assessment of the label-free quantification workflow for metaproteomic studies.",
            "Long non-coding RNA transcriptome of uncharacterized samples can be accurately imputed using protein-coding genes.",
            "Clinical trials, progression-speed differentiating features and swiftness rule of the innovative targets of first-in-class drugs.",
            "Cancer Target Gene Screening: a web application for breast cancer target gene screening using multi-omics data analysis.",
            "CAFU: a Galaxy framework for exploring unmapped RNA-Seq data.",
            "MinE-RFE: determine the optimal subset from RFE by minimizing the subset-accuracy-defined energy.",
            "miR+Pathway: the integration and visualization of miRNA and KEGG pathways.",
            "MCAM abnormal expression and clinical outcome associations are highly cancer dependent as revealed through pan-cancer analysis.",
            "Delivering blended bioinformatics training in resource-limited settings: a case study on the University of Khartoum H3ABioNet node.",
            "Performance of gene expression-based single sample predictors for assessment of clinicopathological subgroups and molecular subtypes in cancers: a case comparison study in non-small cell lung cancer.",
            "The global dissemination of bacterial infections necessitates the study of reverse genomic epidemiology.",
            "Corrigendum to: Dating admixture events is unsolved problem in multi-way admixed populations.",
            "Corrigendum to: gm RAD: an integrated SNP calling pipeline for genetic mapping with RADseq across a hybrid population.",
            "Optimal selection of genetic variants for adjustment of population stratification in European association studies.",
            "Evaluation of drug efficacy based on the spatial position comparison of drug-target interaction centers.",
            "Assessment of metagenomic assemblers based on hybrid reads of real and simulated metagenomic sequences.",
            "Validation strategies for target prediction methods.",
            "Comparing enrichment analysis and machine learning for identifying gene properties that discriminate between gene classes.",
            "Integration of network models and evolutionary analysis into high-throughput modeling of protein dynamics and allosteric regulation: theory, tools and applications.",
            "Shaping the nebulous enhancer in the era of high-throughput assays and genome editing.",
            "Comparison of haplotype-based tests for detecting gene-environment interactions with rare variants.",
            "MicroRNAs and nervous system diseases: network insights and computational challenges.",
            "Molecular Biology Information Service: an innovative medical library-based bioinformatics support service for biomedical researchers.",
            "100 Years of evolving gene-disease complexities and scientific debutants.",
            "DNA methylation analysis in plants: review of computational tools and future perspectives.",
            "Graph convolutional networks for computational drug development and discovery.",
            "Implementing the FAIR Data Principles in precision oncology: review of supporting initiatives.",
            "Transcription factors-DNA interactions in rice: identification and verification.",
            "A comprehensive overview of oncogenic pathways in human cancer.",
            "Comparison and integration of computational methods for deleterious synonymous mutation prediction.",
            "Evaluation of different computational methods on 5-methylcytosine sites identification.",
            "Meta-GDBP: a high-level stacked regression model to improve anticancer drug response prediction.",
            "Platform-independent approach for cancer detection from gene expression profiles of peripheral blood cells.",
            "Identifying psychiatric disorder-associated gut microbiota using microbiota-related gene set enrichment analysis.",
            "Genome-wide identification and analysis of the eQTL lncRNAs in multiple sclerosis based on RNA-seq data.",
            "A feature-based approach to predict hot spots in protein-DNA binding interfaces.",
            "iLearn : an integrated platform and meta-learner for feature engineering, machine-learning analysis and modeling of DNA, RNA and protein sequence data.",
            "Consistent gene signature of schizophrenia identified by a novel feature selection strategy from comprehensive sets of transcriptomic data.",
            "PRISMOID: a comprehensive 3D structure database for post-translational modifications and mutations with functional impact.",
            "Single-cell transcriptome-based multilayer network biomarker for predicting prognosis and therapeutic response of gliomas.",
            "Characterization and identification of antimicrobial peptides with different functional activities.",
            "In silico signaling modeling to understand cancer pathways and treatment responses.",
            "Corrigendum to: Comprehensive and critical evaluation of individualized pathway activity measurement tools on pan-cancer data.",
            "A comprehensive review and performance evaluation of bioinformatics tools for HLA class I peptide-binding prediction.",
            "An overview of diffusion models for intracellular dynamics analysis.",
            "RNA-mediated translation regulation in viral genomes: computational advances in the recognition of sequences and structures.",
            "Comparative assessment of long-read error correction software applied to Nanopore RNA-sequencing data.",
            "Sepsis in the era of data-driven medicine: personalizing risks, diagnoses, treatments and prognoses.",
            "Clustering and classification methods for single-cell RNA-sequencing data.",
            "Machine learning and statistical methods for clustering single-cell RNA-sequencing data.",
            "Genome-wide functional association networks: background, data & state-of-the-art resources.",
            "Data-driven rational biosynthesis design: from molecules to cell factories.",
            "Closing the gap between formats for storing layout information in systems biology.",
            "A survey on identification and quantification of alternative polyadenylation sites from RNA-seq data.",
            "Consistency and overfitting of multi-omics methods on experimental data.",
            "A critical review of five machine learning-based algorithms for predicting protein stability changes upon mutation.",
            "Location deviations of DNA functional elements affected SNP mapping in the published databases and references.",
            "Simultaneous Enrichment Analysis of all Possible Gene-sets: Unifying Self-Contained and Competitive Methods.",
            "Circulating microRNA trafficking and regulation: computational principles and practice.",
            "Heterogeneous information network and its application to human health and disease.",
            "Systematic analysis of supervised machine learning as an effective approach to predicate β-lactam resistance phenotype in Streptococcus pneumoniae.",
            "iCircDA-MF: identification of circRNA-disease associations based on matrix factorization.",
            "Mitochondrial DNA enrichment reduced NUMT contamination in porcine NGS analyses.",
            "A critical assessment of the feature selection methods used for biomarker discovery in current metaproteomics studies.",
            "A comprehensive method protocol for annotation and integrated functional understanding of lncRNAs.",
            "New insights on human essential genes based on integrated analysis and the construction of the HEGIAP web-based platform.",
            "HiFreSP: A novel high-frequency sub-pathway mining approach to identify robust prognostic gene signatures.",
            "Predicting disease-associated circular RNAs using deep forests combined with positive-unlabeled learning methods.",
            "Protein functional annotation of simultaneously improved stability, accuracy and false discovery rate achieved by a sequence-based deep learning.",
            "Data imbalance in CRISPR off-target prediction.",
            "MENDA: a comprehensive curated resource of metabolic characterization in depression.",
            "Critical microRNAs and regulatory motifs in cleft palate identified by a conserved miRNA-TF-gene network approach in humans and mice.",
            "MutEx: a multifaceted gateway for exploring integrative pan-cancer genomic data.",
            "Some comments on certain statistical aspects of the study of the microbiome.",
            "Gene set analysis methods for the functional interpretation of non-mRNA data - Genomic range and ncRNA data.",
            "Accuracy of protein-level disorder predictions.",
            "Beware the Jaccard: the choice of similarity measure is important and non-trivial in genomic colocalisation analysis.",
            "A comprehensive review and evaluation of computational methods for identifying protein complexes from protein-protein interaction networks.",
            "Computational approaches to therapeutic antibody design: established methods and emerging trends.",
            "A comparison and assessment of computational method for identifying recombination hotspots in Saccharomyces cerevisiae.",
            "Evaluation of single-cell classifiers for single-cell RNA sequencing data sets.",
            "Predicting bacterial virulence factors - evaluation of machine learning and negative data strategies.",
            "Deep learning for drug-drug interaction extraction from the literature: a review.",
            "Critical evaluation of web-based prediction tools for human protein subcellular localization.",
            "Network control principles for identifying personalized driver genes in cancer.",
            "Computational/in silico methods in drug target and lead prediction.",
            "Comprehensive review and assessment of computational methods for predicting RNA post-transcriptional modification sites from RNA sequences.",
            "Community curation of bioinformatics software and data resources.",
            "Tools for fundamental analysis functions of TCR repertoires: a systematic comparison.",
            "Universal concept signature analysis: genome-wide quantification of new biological and pathological functions of genes and pathways.",
            "DeepSVM-fold: protein fold recognition by combining support vector machines and pairwise sequence similarity scores generated by deep learning networks.",
            "Computational identification of mutator-derived lncRNA signatures of genome instability for improving the clinical outcome of cancers: a case study in breast cancer.",
            "Quantile regression for challenging cases of eQTL mapping.",
            "A beginner's guide for FMDV quasispecies analysis: sub-consensus variant detection and haplotype reconstruction using next-generation sequencing.",
            "Optimization of in silico tools for predicting genetic variants: individualizing for genes with molecular sub-regional stratification.",
            "Flexible k-mers with variable-length indels for identifying binding sequences of protein dimers.",
            "Deep learning based prediction of reversible HAT/HDAC-specific lysine acetylation.",
            "Genotype imputation and reference panel: a systematic evaluation on haplotype size and diversity.",
            "CrossICC: iterative consensus clustering of cross-platform gene expression data without adjusting batch effect.",
            "Convolutional neural network-based annotation of bacterial type IV secretion system effectors with enhanced accuracy and reduced false discovery.",
            "FRANC: a unified framework for multi-way local ancestry deconvolution with high density SNP data.",
            "ACPred-Fuse: fusing multi-view information improves the prediction of anticancer peptides.",
            "Corrigendum to: Comprehensive review and empirical analysis of hallmarks of DNA-, RNA- and protein-binding residues in protein chains.",
            "Bioinformatics-assisted, integrated omics studies on medicinal plants.",
            "Towards scaling elementary flux mode computation.",
            "Methods and resources to access mutation-dependent effects on cancer drug treatment.",
            "Combining clinical and molecular data in regression prediction models: insights from a simulation study.",
            "A comparative study of multi-omics integration tools for cancer driver gene identification and tumour subtyping.",
            "An omics perspective on drug target discovery platforms.",
            "Managing batch effects in microbiome data.",
            "Critical assessment of bioinformatics methods for the characterization of pathological repeat expansions with single-molecule sequencing data.",
            "A benchmarking of pipelines for detecting ncRNAs from RNA-Seq data.",
            "What's the target: understanding two decades of in silico microRNA-target prediction.",
            "Clustering and variable selection evaluation of 13 unsupervised methods for multi-omics data integration.",
            "Cardioinformatics: the nexus of bioinformatics and precision cardiology.",
            "Systematic evaluation of differential splicing tools for RNA-seq studies.",
            "Deep learning of pharmacogenomics resources: moving towards precision oncology.",
            "Decoding the similarities and specific differences between latent and active tuberculosis infections based on consistently differential expression networks.",
            "A novel molecular representation with BiGRU neural networks for learning atom.",
            "Comprehensive evaluation of the MM-GBSA method on bromodomain-inhibitor sets.",
            "FluReassort: a database for the study of genomic reassortments among influenza viruses.",
            "MotifCNN-fold: protein fold recognition based on fold-specific features extracted by motif-based convolutional neural networks.",
            "A novel bioinformatics approach to identify the consistently well-performing normalization strategy for current metabolomic studies.",
            "Identification and comprehensive characterization of lncRNAs with copy number variations and their driving transcriptional perturbed subpathways reveal functional significance for cancer.",
            "RNAactDrug: a comprehensive database of RNAs associated with drug sensitivity from multi-omics data.",
            "Landscape of cancer diagnostic biomarkers from specifically expressed genes.",
            "Fold-LTR-TCP: protein fold recognition based on triadic closure principle.",
            "A comprehensive evaluation of connectivity methods for L1000 data.",
            "LARMD: integration of bioinformatic resources to profile ligand-driven protein dynamics with a case on the activation of estrogen receptor.",
            "Biomedical named entity recognition and linking datasets: survey and our recent development."
        ]
    },
    {
        "name": "Briefings in Bioinformatics",
        "year": "2019",
        "info": "Volume 20, 2019",
        "count": 189,
        "papers": [
            "OPATs: Omnibus P-value association tests.",
            "VirGenA: a reference-based assembler for variable viral genomes.",
            "Integrating regulatory features data for prediction of functional disease-associated SNPs.",
            "Detecting differential DNA methylation from sequencing of bisulfite converted DNA of diverse species.",
            "Accounting for differential variability in detecting differentially methylated regions.",
            "AtCircDB: a tissue-specific database for Arabidopsis circular RNAs.",
            "Systematic review regulatory principles of non-coding RNAs in cardiovascular diseases.",
            "Computational approaches for discovery of mutational signatures in cancer.",
            "Discovering cooperative biomarkers for heterogeneous complex disease diagnoses.",
            "Large-scale prediction of ADAR-mediated effective human A-to-I RNA editing.",
            "An account of in silico identification tools of secreted effector proteins in bacteria and future challenges.",
            "'Multi-omic' data analysis using O-miner.",
            "Computational resources for ribosome profiling: from database to Web server and software.",
            "Big data management challenges in health research - a literature review.",
            "Pathway enrichment analysis approach based on topological structure and updated annotation of pathway.",
            "A comparative study of rank aggregation methods for partial and top ranked lists in genomic applications.",
            "Facilitating prediction of adverse drug reactions by using knowledge graphs and multi-label learning models.",
            "MetSigDis: a manually curated resource for the metabolic signatures of diseases.",
            "A broken promise: microbiome differential abundance methods do not control the false discovery rate.",
            "Systematic comparative study of computational methods for T-cell receptor sequencing data analysis.",
            "Federation in genomics pipelines: techniques and challenges.",
            "Association score testing for rare variants and binary traits in family data with shared controls.",
            "Identifying mutual exclusivity across cancer genomes: computational approaches to discover genetic interaction and reveal tumor vulnerability.",
            "Understanding the disease genome: gene essentiality and the interplay of selection, recombination and mutation.",
            "Critical assessment and performance improvement of plant-pathogen protein-protein interaction prediction methods.",
            "Comparative analysis of differential gene expression tools for RNA sequencing time course data.",
            "Web-based drug repurposing tools: a survey.",
            "Principal component analysis of binary genomics data.",
            "A comprehensive review and comparison of existing computational methods for intrinsically disordered protein and region prediction.",
            "Advanced bioinformatics methods for practical applications in proteomics.",
            "On the dynamical incompleteness of the Protein Data Bank.",
            "Bioinformatics on a national scale: an example from Switzerland.",
            "Bioinformatics in Germany: toward a national-level infrastructure.",
            "Bioinformatics in the Netherlands: the value of a nationwide community.",
            "Establishing a distributed national research infrastructure providing bioinformatics support to life science researchers in Australia.",
            "Bioinformatics in Latin America and SoIBio impact, a tale of spin-off and expansion around genomes and protein structures.",
            "A global perspective on evolving bioinformatics and data science training needs.",
            "A new pan-European Train-the-Trainer programme for bioinformatics: pilot results on feasibility, utility and sustainability of learning.",
            "Degrees of freedom analysis in educational research and decision-making: leveraging qualitative data to promote excellence in bioinformatics training and education.",
            "Alignment-free inference of hierarchical and reticulate phylogenomic relationships.",
            "Elucidating the editome: bioinformatics approaches for RNA editing detection.",
            "Prediction of protein-protein interactions between fungus (Magnaporthe grisea) and rice (Oryza sativa L.).",
            "Translational medicine in the Age of Big Data.",
            "Toward completion of the Earth's proteome: an update a decade later.",
            "A benchmarking of workflows for detecting differential splicing and differential expression at isoform level in human RNA-seq studies.",
            "A rank-based algorithm of differential expression analysis for small cell line data with statistical control.",
            "Evaluation of variable selection methods for random forests and omics data sets.",
            "Machine learning approaches to decipher hormone and HER2 receptor status phenotypes in breast cancer.",
            "MicroRNAs and complex diseases: from experimental results to computational models.",
            "Harmonizing semantic annotations for computational models in biology.",
            "Prediction of lncRNAs and their interactions with nucleic acids: benchmarking bioinformatics tools.",
            "Progress in single-access information systems for wheat and rice crop improvement.",
            "Molecular subtyping of cancer: current status and moving toward clinical applications.",
            "Disease prediction by cell-free DNA methylation.",
            "Analysis of long noncoding RNAs highlights region-specific altered expression patterns and diagnostic roles in Alzheimer's disease.",
            "Navigating the disease landscape: knowledge representations for contextualizing molecular signatures.",
            "Robust genetic interaction analysis.",
            "iProt-Sub: a comprehensive package for accurately mapping and predicting protease-specific substrates and cleavage sites.",
            "Community-driven roadmap for integrated disease maps.",
            "Comparison and evaluation of integrative methods for the analysis of multilevel omics data: a study based on simulated and experimental cancer data.",
            "Pattern recognition analysis on long noncoding RNAs: a tool for prediction in plants.",
            "Post genome-wide association analysis: dissecting computational pathway/network-based approaches.",
            "Application of Atlas of Cancer Signalling Network in preclinical studies.",
            "Integrated use of bioinformatic resources reveals that co-targeting of histone deacetylases, IKBK and SRC inhibits epithelial-mesenchymal transition in cancer.",
            "Recent developments of software and database in microbial genomics and functional genomics.",
            "Bioinformatics: scalability, capabilities and training in the data-driven era.",
            "CircView: a visualization and exploration tool for circular RNAs.",
            "Precision medicine needs pioneering clinical bioinformaticians.",
            "Proteomics and phosphoproteomics in precision medicine: applications and challenges.",
            "Bioinformatics for precision oncology.",
            "Developing a 'personalome' for precision medicine: emerging methods that compute interpretable effect sizes from single-subject transcriptomes.",
            "Systems Bioinformatics: increasing precision of computational diagnostics and therapeutics through network-based approaches.",
            "Computational profiling of the gut-brain axis: microflora dysbiosis insights to neurological disorders.",
            "Translational bioinformatics in mental health: open access data sources and computational biomarker discovery.",
            "Assessing the heterogeneity of in silico plasmid predictions based on whole-genome-sequenced clinical isolates.",
            "Comprehensive evaluation of non-hybrid genome assembly tools for third-generation PacBio long-read sequence data.",
            "Coloured Petri nets for multilevel, multiscale and multidimensional modelling of biological systems.",
            "Privacy-preserving techniques of genomic data - a survey.",
            "RNA methylation and diseases: experimental results, databases, Web servers and computational models.",
            "A survey of software tools for microRNA discovery and characterization using RNA-seq.",
            "Systematic analysis and prediction of type IV secreted effector proteins by machine learning approaches.",
            "Computer-aided biomarker discovery for precision medicine: data resources, models and applications.",
            "Regulatory feedback loops bridge the human gene regulatory network and regulate carcinogenesis.",
            "Effect of normalization methods on the performance of supervised learning algorithms applied to HTSeq-FPKM-UQ data sets: 7SK RNA expression as a predictor of survival in patients with colon adenocarcinoma.",
            "An evaluation of noncoding genome annotation tools through enrichment analysis of 15 genome-wide association studies.",
            "A snapshot of 3649 Web-based services published between 1994 and 2017 shows a decrease in availability after 2 years.",
            "A review of databases predicting the effects of SNPs in miRNA genes or miRNA-binding sites.",
            "Construction of a hierarchical gene regulatory network centered around a transcription factor.",
            "Resources and tools for the high-throughput, multi-omic study of intestinal microbiota.",
            "Community effort endorsing multiscale modelling, multiscale data science and multiscale computing for systems medicine.",
            "Microbial genome analysis: the COG approach.",
            "MicroScope - an integrated resource for community expertise of gene functions and comparative analysis of microbial genomic and metabolic data.",
            "The BioCyc collection of microbial genomes and metabolic pathways.",
            "PATRIC as a unique resource for studying antimicrobial resistance.",
            "Recent development of antiSMASH and other computational approaches to mine secondary metabolite biosynthetic gene clusters.",
            "Recent development of Ori-Finder system and DoriC database for microbial replication origins.",
            "A review of methods and databases for metagenomic classification and assembly.",
            "Metagenomic assembly through the lens of validation: recent advances in assessing and improving the quality of genomes assembled from metagenomes.",
            "MG-RAST version 4 - lessons learned from a decade of low-budget ultra-high-throughput metagenome analysis.",
            "MAFFT online service: multiple sequence alignment, interactive sequence choice and visualization.",
            "Towards dynamic genome-scale models.",
            "Computational tools for plant small RNA detection and categorization.",
            "Systematic review of computational methods for identifying miRNA-mediated RNA-RNA crosstalk.",
            "Evaluation and comparison of methods for recapitulation of 3D spatial chromatin structures.",
            "A generally applicable lightweight method for calculating a value structure for tools and services in bioinformatics infrastructure projects.",
            "A survey and evaluations of histogram-based statistics in alignment-free sequence comparison.",
            "Conceptual and computational framework for logical modelling of biological networks deregulated in diseases.",
            "Comprehensive review and empirical analysis of hallmarks of DNA-, RNA- and protein-binding residues in protein chains.",
            "Multi-omics integration - a comparison of unsupervised clustering methodologies.",
            "BioSeq-Analysis: a platform for DNA, RNA and protein sequence analysis based on machine learning approaches.",
            "Link synthetic lethality to drug sensitivity of cancer cells.",
            "Drug knowledge bases and their applications in biomedical informatics research.",
            "SEGreg: a database for human specifically expressed genes and their regulations in cancer and normal tissue.",
            "Characteristics and evolution of the ecosystem of software tools supporting research in molecular biology.",
            "Computational prediction of drug-target interactions using chemogenomic approaches: an empirical survey.",
            "Upstream analysis of alternative splicing: a review of computational approaches to predict context-dependent splicing factors.",
            "Modeling biological problems in computer science: a case study in genome assembly.",
            "How to design a single-cell RNA-sequencing experiment: pitfalls, challenges and perspectives.",
            "Phylogenetic profiling, an untapped resource for the prediction of secreted proteins and its complementation with sequence-based classifiers in bacterial type III, IV and VI secretion systems.",
            "Inferring and analyzing module-specific lncRNA-mRNA causal regulatory networks in human cancer.",
            "Microarray is an efficient tool for circRNA profiling.",
            "Artificial intelligence in drug combination therapy.",
            "It is time to apply biclustering: a comprehensive review of biclustering applications in biological and biomedical data.",
            "Open-source chemogenomic data-driven algorithms for predicting drug-target interactions.",
            "Where to search top-K biomedical ontologies?",
            "Comprehensive analysis of Helicobacter pylori infection-associated diseases based on miRNA-mRNA interaction network.",
            "Distinct telomere length and molecular signatures in seminoma and non-seminoma of testicular germ cell tumor.",
            "Interactive and coordinated visualization approaches for biological data analysis.",
            "A survey and evaluation of Web-based tools/databases for variant analysis of TCGA data.",
            "Nanopore sequencing technology and tools for genome assembly: computational analysis of the current state, bottlenecks and future directions.",
            "PHAST, PHASTER and PHASTEST: Tools for finding prophage in bacterial genomes.",
            "DOOR: a prokaryotic operon database for genome analyses and functional inference.",
            "Visualizing and comparing circular genomes using the CGView family of tools.",
            "Evaluation of tools for highly variable gene discovery from single-cell RNA-seq data.",
            "Structural and functional analyses of microbial metabolic networks reveal novel insights into genome-scale metabolic fluxes.",
            "Proteomic analysis and prediction of amino acid variations that influence protein posttranslational modifications.",
            "Predicting novel microRNA: a comprehensive comparison of machine learning approaches.",
            "Survey of miRNA-miRNA cooperative regulation principles across cancer types.",
            "Regulatory variants: from detection to predicting impact.",
            "A comparison of mechanistic signaling pathway activity analysis methods.",
            "Toward more accurate prediction of caspase cleavage sites: a comprehensive review of current methods, tools and features.",
            "Microbial genomic island discovery, visualization and analysis.",
            "In silico clinical trials: concepts and early adoptions.",
            "A comprehensive survey of models for dissecting local ancestry deconvolution in human genome.",
            "Physiological RNA dynamics in RNA-Seq analysis.",
            "Evaluating the consistency of large-scale pharmacogenomic studies.",
            "Exploring the functional impact of alternative splicing on human protein isoforms using available annotation sources.",
            "Disease classification: from phenotypic similarity to integrative genomics and beyond.",
            "Versatile interactions and bioinformatics analysis of noncoding RNAs.",
            "Review of applications of high-throughput sequencing in personalized medicine: barriers and facilitators of future progress in research and clinical application.",
            "Landscape of the long non-coding RNA transcriptome in human heart.",
            "Function determinants of TET proteins: the arrangements of sequence motifs with specific codes.",
            "Trends in the development of miRNA bioinformatics tools.",
            "The small peptide world in long noncoding RNAs.",
            "A practical guide for DNase-seq data analysis: from data management to common applications.",
            "Recent applications of deep learning and machine intelligence on in silico drug discovery: methods, tools and databases.",
            "An efficient multi-locus mixed model framework for the detection of small and linked QTLs in F2.",
            "dbCID: a manually curated resource for exploring the driver indels in human cancer.",
            "ATAC-pipe: general analysis of genome-wide chromatin accessibility.",
            "Connectome verification: inter-rater and connection reliability of tract-tracing-based intrinsic hypothalamic connectivity.",
            "Corrigendum to: How trees allocate carbon for optimal growth: insight from a game-theoretic model.",
            "Metabolomics technology and bioinformatics for precision medicine.",
            "A review of metrics measuring dissimilarity for rooted phylogenetic networks.",
            "A brief history of bioinformatics.",
            "Sequencing era methods for identifying signatures of selection in the genome.",
            "LncFinder: an integrated platform for long non-coding RNA identification utilizing sequence intrinsic composition, structural information and physicochemical property.",
            "Recent advances and prospects of computational methods for metabolite identification: a review with emphasis on machine learning approaches.",
            "Interpretation of differential gene expression results of RNA-seq data: review and integration.",
            "A comparative analysis of cell-type adjustment methods for epigenome-wide association studies based on simulated and real data sets.",
            "Review and comparative assessment of similarity-based methods for prediction of drug-protein interactions in the druggable human proteome.",
            "Comprehensive comparative analysis of methods and software for identifying viral integrations.",
            "Computational resources associating diseases with genotypes, phenotypes and exposures.",
            "Machine learning meets genome assembly.",
            "Breast cancer prognosis signature: linking risk stratification to disease subtypes.",
            "Computational determination of gene age and characterization of evolutionary dynamics in human.",
            "Twenty years of bioinformatics research for protease-specific substrate and cleavage site prediction: a comprehensive revisit and benchmarking of existing methods.",
            "Binding site matching in rational drug design: algorithms and applications.",
            "Computational analysis and prediction of lysine malonylation sites by exploiting informative features in an integrative machine-learning framework.",
            "Principals about principal components in statistical genetics.",
            "Quick approximation of threshold values for genome-wide association studies.",
            "An evaluation of supervised methods for identifying differentially methylated regions in Illumina methylation arrays.",
            "Polygenic approaches to detect gene-environment interactions when external information is unavailable.",
            "Control principles for complex biological networks.",
            "Large-scale comparative assessment of computational predictors for lysine post-translational modification sites.",
            "PCA-based GRS analysis enhances the effectiveness for genetic correlation detection.",
            "Protein-peptide docking using CABS-dock and contact information.",
            "Revealing tumor heterogeneity of breast cancer by utilizing the linkage between somatic and germline mutations.",
            "Impact of similarity metrics on single-cell RNA-seq data clustering.",
            "TRCirc: a resource for transcriptional regulation information of circRNAs."
        ]
    },
    {
        "name": "Briefings in Bioinformatics",
        "year": "2018",
        "info": "Volume 19, 2018",
        "count": 120,
        "papers": [
            "A systematic evaluation of normalization methods in quantitative label-free proteomics.",
            "Inter-kingdom prediction certainty evaluation of protein subcellular localization tools: microbial pathogenesis approach for deciphering host microbe interaction.",
            "The present and future of de novo whole-genome assembly.",
            "A bioimage informatics platform for high-throughput embryo phenotyping.",
            "Combinatorial epigenetic regulation of non-coding RNAs has profound effects on oncogenic pathways in breast cancer subtypes.",
            "Synthetic data sets for the identification of key ingredients for RNA-seq differential analysis.",
            "Notions of similarity for systems biology models.",
            "The framework for population epigenetic study.",
            "Genome-wide DNA methylation analysis identifies candidate epigenetic markers and drivers of hepatocellular carcinoma.",
            "An empirical likelihood ratio test robust to individual heterogeneity for differential expression analysis of RNA-seq.",
            "Computational pan-genomics: status, promises and challenges.",
            "Transferring entropy to the realm of GxG interactions.",
            "Comprehensive assessment and performance improvement of effector protein predictors for bacterial secretion systems III, IV and VI.",
            "A graphical model approach visualizes regulatory relationships between genome-wide transcription factor binding profiles.",
            "A review of validation strategies for computational drug repositioning.",
            "Evaluation of computational programs to predict HLA genotypes from genomic sequencing data.",
            "Identification and analysis of the human sex-biased genes.",
            "Logic programming to infer complex RNA expression patterns from RNA-seq data.",
            "Visualizing and comparing results of different peptide identification methods.",
            "A large-scale comparative assessment of methods for residue-residue contact prediction.",
            "A comprehensive review and comparison of different computational methods for protein remote homology detection.",
            "MicroRNAs and their variants in an RNA world: implications for complex interactions and diverse roles in an RNA regulatory network.",
            "miRandb: a resource of online services for miRNA research.",
            "Predictive approaches for drug combination discovery in cancer.",
            "Data-driven approaches used for compound library design, hit triage and bioactivity modeling in high-throughput screening.",
            "Genome, transcriptome and proteome: the rise of omics data and their integration in biomedical sciences.",
            "Computational modelling folate metabolism and DNA methylation: implications for understanding health and ageing.",
            "Computational modeling of brain pathologies: the case of multiple sclerosis.",
            "A review on machine learning principles for multi-view biological data integration.",
            "What (not) to expect when classifying rare events.",
            "Design of RNAs: comparing programs for inverse RNA folding.",
            "Bioinformatics in the Netherlands: the value of a nationwide community.",
            "Bioinformatics tools for quantitative and functional metagenome and metatranscriptome data analysis in microbes.",
            "MTGIpick allows robust identification of genomic islands from a single genome.",
            "Statistical method evaluation for differentially methylated CpGs in base resolution next-generation DNA sequencing data.",
            "Exploiting next-generation sequencing to solve the haplotyping puzzle in polyploids: a simulation study.",
            "Evaluating approaches to find exon chains based on long reads.",
            "miRDis: a Web tool for endogenous and exogenous microRNA discovery based on deep-sequencing data analysis.",
            "Transformation and model choice for RNA-seq co-expression analysis.",
            "Plant genome and transcriptome annotations: from misconceptions to simple solutions.",
            "Kinase impact assessment in the landscape of fusion genes that retain kinase domains: a pan-cancer study.",
            "Mapping morphological shape as a high-dimensional functional curve.",
            "Survey of local and global biological network alignment: the need to reconcile the two sides of the same coin.",
            "Sixty-five years of the long march in protein secondary structure prediction: the final stretch?",
            "Comparing genome versus proteome-based identification of clinical bacterial isolates.",
            "A review of connectivity map and computational approaches in pharmacogenomics.",
            "Elemental metabolomics.",
            "How the strengths of Lisp-family languages facilitate building complex and flexible bioinformatics applications.",
            "Probabilistic natural mapping of gene-level tests for genome-wide association studies.",
            "High-throughput sequencing of the T-cell receptor repertoire: pitfalls and opportunities.",
            "VRprofile: gene-cluster-detection-based profiling of virulence and antibiotic resistance traits encoded within genome sequences of pathogenic bacteria.",
            "Gene co-expression analysis for functional classification and gene-disease predictions.",
            "How trees allocate carbon for optimal growth: insight from a game-theoretic model.",
            "HpQTL: a geometric morphometric platform to compute the genetic architecture of heterophylly.",
            "A simple way to detect disease-associated cellular molecular alterations from mixed-cell blood samples.",
            "hppRNA - a Snakemake-based handy parameter-free pipeline for RNA-Seq analysis of numerous samples.",
            "Genome-wide characterization of lncRNAs in acute myeloid leukemia.",
            "SmProt: a database of small proteins encoded by annotated coding and non-coding RNA loci.",
            "A landscape of synthetic viable interactions in cancer.",
            "Systematic analyses of drugs and disease indications in RepurposeDB reveal pharmacological, biological and epidemiological factors influencing drug repositioning.",
            "Measuring the diversity of the human microbiota with targeted next-generation sequencing.",
            "Top considerations for creating bioinformatics software documentation.",
            "Methodological implementation of mixed linear models in multi-locus genome-wide association studies.",
            "Feasibility of sample size calculation for RNA-seq studies.",
            "Benchmarking CRISPR on-target sgRNA design.",
            "GWAS summary-based pathway analysis correcting for the genetic confounding impact of environmental exposures.",
            "DNA copy number profiling using single-cell sequencing.",
            "A survey of the approaches for identifying differential methylation using bisulfite sequencing data.",
            "Genome-wide analysis reveals that exon methylation facilitates its selective usage in the human transcriptome.",
            "Strategies for processing and quality control of Illumina genotyping arrays.",
            "Selecting between-sample RNA-Seq normalization methods from the perspective of their assumptions.",
            "Individualized analysis of differentially expressed miRNAs with application to the identification of miRNAs deregulated commonly in lung cancer tissues.",
            "Circular RNA identification based on multiple seed matching.",
            "Comparison of the general co-expression landscapes between human and mouse.",
            "Review and comparative assessment of sequence-based predictors of protein-binding residues.",
            "Critical evaluation of bioinformatics tools for the prediction of protein crystallization propensity.",
            "Molecular dynamics recipes for genome research.",
            "Detection of drug-drug interactions through data mining studies using clinical sources, scientific literature and social media.",
            "A review of network-based approaches to drug repositioning.",
            "Comparative analysis of de novo assemblers for variation discovery in personal genomes.",
            "CASH: a constructing comprehensive splice site method for detecting alternative splicing events.",
            "Experimental design and data analysis of Ago-RIP-Seq experiments for the identification of microRNA targets.",
            "Long noncoding RNA: a crosslink in biological regulatory network.",
            "Row versus column correlations: avoiding the ecological fallacy in RNA/protein expression studies.",
            "Evaluating de novo sequencing in proteomics: already an accurate alternative to database-driven peptide identification?",
            "Identification of differentially expressed peptides in high-throughput proteomics data.",
            "Comprehensive assessment of flexible-ligand docking algorithms: current effectiveness and challenges.",
            "Context-based retrieval of functional modules in protein-protein interaction networks.",
            "The anatomy of phenotype ontologies: principles, properties and applications.",
            "Bioinformatics tools for the identification of gene clusters that biosynthesize specialized metabolites.",
            "Improving data workflow systems with cloud services and use of open data for bioinformatics research.",
            "Dynamic modeling and network approaches for omics time course data: overview of computational approaches and applications.",
            "An algorithmic perspective of de novo cis-regulatory motif finding based on ChIP-seq data.",
            "Next-generation sequencing data analysis.",
            "Mutational signatures and mutable motifs in cancer genomes.",
            "Genome-wide discovery of viral microRNAs based on phylogenetic analysis and structural evolution of various human papillomavirus subtypes.",
            "Bioinformatic analysis of bacteria and host cell dual RNA-sequencing experiments.",
            "Subcellular locations of potential cell wall proteins in plants: predictors, databases and cross-referencing.",
            "Large-scale data-driven integrative framework for extracting essential targets and processes from disease-associated gene data sets.",
            "In silico polypharmacology of natural products.",
            "Advances in computational approaches in identifying synergistic drug combinations.",
            "Pioneering topological methods for network-based drug-target prediction by exploiting a brain-network self-organization theory.",
            "Optimizing drug development in oncology by clinical trial simulation: Why and how?",
            "Seeing the wood for the trees: a forest of methods for optimization and omic-network integration in metabolic modelling.",
            "Deep learning for healthcare: review, opportunities and challenges.",
            "Power and sample size calculations for high-throughput sequencing-based experiments.",
            "Nanopore sequencing data analysis: state of the art, applications and challenges.",
            "ceRNAs in plants: computational approaches and associated challenges for target mimic research.",
            "Recent computational developments on CLIP-seq data analysis and microRNA targeting implications.",
            "Dynamic-BM: multispecies Dynamic BodyMap database from temporal RNA-seq data.",
            "Investigating microRNA-mediated regulation of the nascent nuclear transcripts in plants: a bioinformatics workflow.",
            "SEGtool: a specifically expressed gene detection tool and applications in human tissue and single-cell sequencing data.",
            "Proper joint analysis of summary association statistics requires the adjustment of heterogeneity in SNP coverage pattern.",
            "A comprehensive evaluation of popular proteomics software workflows for label-free proteome quantification and imputation.",
            "A strategy for multimodal data integration: application to biomarkers identification in spinocerebellar ataxia.",
            "Network approaches to systems biology analysis of complex disease: integrative methods for multi-omics data.",
            "Mathematical modeling and computational prediction of cancer drug resistance.",
            "Biomedical text mining for research rigor and integrity: tasks, challenges, directions.",
            "Bioinformatics tools for quantitative and functional metagenome and metatranscriptome data analysis in microbes.",
            "The genetic architecture of heterochrony as a quantitative trait: lessons from a computational model."
        ]
    },
    {
        "name": "Briefings in Bioinformatics",
        "year": "2017",
        "info": "Volume 18, 2017",
        "count": 106,
        "papers": [
            "Iterative error correction of long sequencing reads maximizes accuracy and improves contig assembly.",
            "Computational recognition for long non-coding RNA (lncRNA): Software and databases.",
            "MTD: a mammalian transcriptomic database to explore gene expression and regulation.",
            "Model parameters of molecular evolution explain genomic correlations.",
            "Computational methods to identify metabolic sub-networks based on metabolomic profiles.",
            "Multi-hierarchical profiling: an emerging and quantitative approach to characterizing diverse biological networks.",
            "A study of bias and increasing organismal complexity from their post-translational modifications and reaction site interplays.",
            "An analysis of human microbe-disease associations.",
            "GED: a manually curated comprehensive resource for epigenetic modification of gametogenesis.",
            "Translational bioinformatics in the era of real-time biomedical, health care and wellness data streams.",
            "The recent progress in proteochemometric modelling: focusing on target descriptors, cross-term descriptors and application scope.",
            "A computing platform to map ecological metabolism by integrating functional mapping and the metabolic theory of ecology.",
            "Making authentic science accessible - the benefits and challenges of integrating bioinformatics into a high-school science curriculum.",
            "Bridging semantics and syntax with graph algorithms - state-of-the-art of extracting biomedical relations.",
            "NCBI-compliant genome submissions: tips and tricks to save time and money.",
            "Effect of lossy compression of quality scores on variant calling.",
            "Multi-marker linkage disequilibrium mapping of quantitative trait loci.",
            "A benchmark of gene expression tissue-specificity metrics.",
            "Gene co-expression analyses: an overview from microarray collections in Arabidopsis thaliana.",
            "Resolving the problem of multiple accessions of the same transcript deposited across various public databases.",
            "A comprehensive overview of lncRNA annotation resources.",
            "iFORM/eQTL: an ultrahigh-dimensional platform for inferring the global genetic architecture of gene transcripts.",
            "Comparative evaluation of isoform-level gene expression estimation algorithms for RNA-seq and exon-array platforms.",
            "Prediction and identification of the effectors of heterotrimeric G proteins in rice (Oryza sativa L.).",
            "Recent advances in ChIP-seq analysis: from quality management to whole-genome annotation.",
            "A comprehensive study of RNA secondary structure alignment algorithms.",
            "The BRaliBase dent - a tale of benchmark design and interpretation.",
            "Effects of imputation on correlation: implications for analysis of mass spectrometry data from multiple biological matrices.",
            "Weak-binding molecules are not drugs? - toward a systematic strategy for finding effective weak-binding drugs.",
            "SDTNBI: an integrated network and chemoinformatics tool for systematic prediction of drug-target interactions and drug repositioning.",
            "Towards an open, collaborative, reusable framework for sharing hands-on bioinformatics training workshops.",
            "Zisland Explorer: detect genomic islands by combining homogeneity and heterogeneity properties.",
            "MuSERA: Multiple Sample Enriched Region Assessment.",
            "A high-dimensional linkage analysis model for characterizing crossover interference.",
            "Detecting multi-way epistasis in family-based association studies.",
            "Ontology-based annotations and semantic relations in large-scale (epi)genomics data.",
            "Impacts of somatic mutations on gene expression: an association perspective.",
            "Cell subpopulation deconvolution reveals breast cancer heterogeneity based on DNA methylation signature.",
            "Features that define the best ChIP-seq peak calling algorithms.",
            "Heterogeneous molecular processes among the causes of how sequence similarity scores can fail to recapitulate phylogeny.",
            "Template-based protein-protein docking exploiting pairwise interfacial residue restraints.",
            "Novel in silico tools for designing peptide-based subunit vaccines and immunotherapeutics.",
            "Interdisciplinary approach towards a systems medicine toolbox using the example of inflammatory diseases.",
            "Literature-based discovery of new candidates for drug repurposing.",
            "Analysis of metabolomic data: tools, current strategies and future challenges for omics data integration.",
            "Tensor factorization toward precision medicine.",
            "Optimization of cell lines as tumour models by integrating multi-omics data.",
            "A review of bioinformatic pipeline frameworks.",
            "Development of a cloud-based Bioinformatics Training Platform.",
            "Optimization of cell lines as tumour models by integrating multi-omics data.",
            "Circular RNA: an emerging key player in RNA world.",
            "Long non-coding RNAs and complex diseases: from experimental results to computational models.",
            "Computational methods for identifying miRNA sponge interactions.",
            "Predicting disease trait with genomic data: a composite kernel approach.",
            "Estimation of random effects and identifying heterogeneous genes in meta-analysis of gene expression studies.",
            "Exploring phenotype patterns of breast cancer within somatic mutations: a modicum in the intrinsic code.",
            "Embracing an integromic approach to tissue biomarker research in cancer: Perspectives and lessons learned.",
            "Computational prediction of methylation types of covalently modified lysine and arginine residues in proteins.",
            "Structural database resources for biological macromolecules.",
            "The role of drug profiles as similarity metrics: applications to repurposing, adverse effects detection and drug-drug interactions.",
            "Individualized network-based drug repositioning infrastructure for precision oncology in the panomics era.",
            "A comprehensive overview of computational resources to aid in precision genome editing with engineered nucleases.",
            "Dynamic and modular gene regulatory networks drive the development of gametogenesis.",
            "Bridging semantics and syntax with graph algorithms - state-of-the-art of extracting biomedical relations.",
            "OpenGeneMed: a portable, flexible and customizable informatics hub for the coordination of next-generation sequencing studies in support of precision medicine trials.",
            "Comparison of methods to detect differentially expressed genes between single-cell populations.",
            "Systematic bias of correlation coefficient may explain negative accuracy of genomic prediction.",
            "Evo-Devo-EpiR: a genome-wide search platform for epistatic control on the evolution of development.",
            "Comparative pan-cancer DNA methylation analysis reveals cancer common and specific patterns.",
            "BrowseVCF: a web-based application and workflow to quickly prioritize disease-causative variants in VCF files.",
            "Screening and validation of lncRNAs and circRNAs as miRNA sponges.",
            "Identification and function annotation of long intervening noncoding RNAs.",
            "Protein-protein interactions: detection, reliability assessment and applications.",
            "Computational models for predicting drug responses in cancer research.",
            "TBC2health: a database of experimentally validated health-beneficial effects of tea bioactive compounds.",
            "Comparative assessment of differential network analysis methods.",
            "Deep learning in bioinformatics.",
            "Graphics processing units in bioinformatics, computational biology and systems biology.",
            "Gene Ontology semantic similarity tools: survey on features and challenges for biological knowledge discovery.",
            "Notions of similarity for systems biology models.",
            "A review of connectivity map and computational approaches in pharmacogenomics.",
            "miRandb: a resource of online services for miRNA research.",
            "How the strengths of Lisp-family languages facilitate building complex and flexible bioinformatics applications.",
            "Methodological implementation of mixed linear models in multi-locus genome-wide association studies.",
            "Editorial.",
            "Benchmarking computational tools for polymorphic transposable element detection.",
            "AlloMap6: an R package for genetic linkage analysis in allohexaploids.",
            "What is the probability of replicating a statistically significant association in genome-wide association studies?",
            "Characterization of MinION nanopore data for resequencing analyses.",
            "Rare variant association test in family-based sequencing studies.",
            "Robust logistic regression to narrow down the winner's curse for rare and recessive susceptibility variants.",
            "Indel detection from RNA-seq data: tool evaluation and strategies for accurate detection of actionable mutations.",
            "Comprehensive characterization of tissue-specific circular RNAs in the human and mouse genomes.",
            "RNAEditor: easy detection of RNA editing events and the introduction of editing islands.",
            "miRNA-miRNA crosstalk: from genomics to phenomics.",
            "Unraveling chloroplast transcriptomes with ChloroSeq, an organelle RNA-Seq bioinformatics pipeline.",
            "Recording negative results of protein-protein interaction assays: an easy way to deal with the biases and errors of interactomic data sets.",
            "Recent advances in sequence-based protein structure prediction.",
            "Protein side-chain packing problem: is there still room for improvement?",
            "Exploring and visualizing multidimensional data in translational research platforms.",
            "A protein network descriptor server and its use in studying protein, disease, metabolic and drug targeted networks.",
            "A novel computational method for inferring competing endogenous interactions.",
            "Opportunities for community awareness platforms in personal genomics and bioinformatics education.",
            "Bioinformatics in Latin America and SoIBio impact, a tale of spin-off and expansion around genomes and protein structures.",
            "Critical evaluation of bioinformatics tools for the prediction of protein crystallization propensity.",
            "Systematic bias of correlation coefficient may explain negative accuracy of genomic prediction."
        ]
    },
    {
        "name": "Briefings in Bioinformatics",
        "year": "2016",
        "info": "Volume 17, 2016",
        "count": 93,
        "papers": [
            "Current Progress in Bioinformatics 2016.",
            "A survey of current trends in computational drug repositioning.",
            "The detection and characterization of pleiotropy: discovery, progress, and promise.",
            "Crowdsourcing in biomedicine: challenges and opportunities.",
            "Recent Advances and Emerging Applications in Text and Data Mining for Biomedical Discovery.",
            "Adapting bioinformatics curricula for big data.",
            "Robust and exact structural variation detection with paired-end and soft-clipped alignments: SoftSV compared with eight algorithms.",
            "Toward a next-generation atlas of RNA secondary structure.",
            "Individualized identification of disease-associated pathways with disrupted coordination of gene expression.",
            "A comprehensive comparative review of sequence-based predictors of DNA- and RNA-binding residues.",
            "Revealing protein-lncRNA interaction.",
            "Progress and challenges in predicting protein interfaces.",
            "Community challenges in biomedical text mining over 10 years: success, failure and the future.",
            "A primer on precision medicine informatics.",
            "Denoising DNA deep sequencing data - high-throughput sequencing errors and their correction.",
            "A very simple and fast way to access and validate algorithms in reproducible research.",
            "Evaluation of somatic copy number estimation tools for whole-exome sequencing data.",
            "Integrative approaches for predicting microRNA function and prioritizing disease-related microRNA using biological interaction networks.",
            "Normalization of circulating microRNA expression data obtained by quantitative real-time RT-PCR.",
            "Systematically evaluating interfaces for RNA-seq analysis from a life scientist perspective.",
            "Mitochondria sequence mapping strategies and practicability of mitochondria variant detection from exome and RNA sequencing data.",
            "Critical limitations of prognostic signatures based on risk scores summarized from gene expression levels: a case study for resected stage I non-small-cell lung cancer.",
            "Statistical detection of differentially expressed genes based on RNA-seq: from biological to phylogenetic replicates.",
            "Understanding tissue expression evolution: from expression phylogeny to phylogenetic network.",
            "Practical analysis of specificity-determining residues in protein families.",
            "Improving protein identification from tandem mass spectrometry data by one-step methods and integrating data from other platforms.",
            "Critical evaluation of in silico methods for prediction of coiled-coil domains in proteins.",
            "Microbial bioinformatics for food safety and production.",
            "A roadmap to multifactor dimensionality reduction methods.",
            "Current status and prospects of computational resources for natural product dereplication: a review.",
            "Bioinformatics methods in drug repurposing for Alzheimer's disease.",
            "Empirical comparison of structure-based pathway methods.",
            "VCF-Miner: GUI-based application for mining variants and annotations stored in VCF files.",
            "Building a virtual ligand screening pipeline using free software: a survey.",
            "Computational Systems Biomedicine.",
            "Review: High-performance computing to detect epistasis in genome scale data sets.",
            "The RNA world in the 21st century - a systems approach to finding non-coding keys to clinical questions.",
            "Gene set analysis approaches for RNA-seq data: performance evaluation and application guideline.",
            "Multiscale modelling in immunology: a review.",
            "Systems biological approaches to the cardiac signaling network.",
            "Untangling the complexity of blood coagulation network: use of computational modelling in pharmacology and diagnostics.",
            "Using prior knowledge from cellular pathways and molecular networks for diagnostic specimen classification.",
            "Personalized cancer immunotherapy using Systems Medicine approaches.",
            "A literature mining-based approach for identification of cellular pathways associated with chemoresistance in cancer.",
            "Dynamics of ubiquitin-mediated signalling: insights from mathematical modelling and experimental studies.",
            "Problems, challenges and promises: perspectives on precision medicine.",
            "Reasoning over genetic variance information in cause-and-effect models of neurodegenerative diseases.",
            "Computational analysis of protein interaction networks for infectious diseases.",
            "Systems medicine of inflammaging.",
            "Bioinformatics tools for the analysis of NMR metabolomics studies focused on the identification of clinically relevant biomarkers.",
            "Methodologies and experimental platforms for generating and analysing microarray and mass spectrometry-based omics data to support P4 medicine.",
            "Computational modelling of atherosclerosis.",
            "Big-data-based edge biomarkers: study on dynamical drug sensitivity and resistance in individuals.",
            "MST2-RASSF protein-protein interactions through SARAH domains.",
            "Public data and open source tools for multi-assay genomic investigation of disease.",
            "Image-based modelling of organogenesis.",
            "Dimension reduction techniques for the integrative analysis of multi-omics data.",
            "Advances in computational approaches for prioritizing driver mutations and significantly mutated genes in cancer genomes.",
            "Comparison of haplotype-based statistical tests for disease association with rare and common variants.",
            "Collaborative science in the next-generation sequencing era: a viewpoint on how to combine exome sequencing data across sites to identify novel disease susceptibility genes.",
            "The identification and characterization of novel transcripts from RNA-seq data.",
            "Algorithms for modeling global and context-specific functional relationship networks.",
            "Drug-target interaction prediction: databases, web servers and computational models.",
            "Will solid-state drives accelerate your bioinformatics? In-depth profiling, performance analysis and beyond.",
            "BATMat: Bioinformatics Autodiscovery of Training Materials.",
            "A review of ensemble methods for de novo motif discovery in ChIP-Seq data.",
            "How computer science can help in understanding the 3D genome architecture.",
            "Nucleosome positioning: resources and tools online.",
            "Discretization of gene expression data revised.",
            "Comparative study of joint analysis of microarray gene expression data in survival prediction and risk assessment of breast cancer patients.",
            "A Comparison of Base-calling Algorithms for Illumina Sequencing Technology.",
            "An evaluation of methods to test predefined genomic regions for differential methylation in bisulfite sequencing data.",
            "Multiple Testing of Gene Sets from Gene Ontology: Possibilities and Pitfalls.",
            "The digital revolution in phenotyping.",
            "Correct machine learning on protein sequences: a peer-reviewing perspective.",
            "Interpreting functional effects of coding variants: challenges in proteome-scale prediction, annotation and assessment.",
            "Computational resources and strategies to construct single-molecule metabolic models of microbial cells.",
            "Pathway Tools version 19.0 update: software for pathway/genome informatics and systems biology.",
            "Transcriptomic and metabolomic data integration.",
            "A survey of tools for analysing DNA fingerprints.",
            "Surveying and benchmarking techniques to analyse DNA gel fingerprint images.",
            "Statistical methods for detecting differentially methylated regions based on MethylCap-seq data.",
            "Evaluation of preprocessing, mapping and postprocessing algorithms for analyzing whole genome bisulfite sequencing data.",
            "A comprehensive comparison of tools for differential ChIP-seq analysis.",
            "Progress and challenges in bioinformatics approaches for enhancer identification.",
            "In the loop: promoter-enhancer interactions and bioinformatics.",
            "Systematic dissection of dysregulated transcription factor-miRNA feed-forward loops across tumor types.",
            "Multiple sequence alignment modeling: methods and applications.",
            "A proteogenomic approach to understand splice isoform functions through sequence and expression-based computational modeling.",
            "Analysis of sequencing data for probing RNA secondary structures and protein-RNA binding in studying posttranscriptional regulations.",
            "A network medicine approach to build a comprehensive atlas for the prognosis of human cancer.",
            "Towards improved genome-scale metabolic network reconstructions: unification, transcript specificity and beyond.",
            "Updates on drug-target network; facilitating polypharmacology and data integration by growth of DrugBank database."
        ]
    },
    {
        "name": "Briefings in Bioinformatics",
        "year": "2015",
        "info": "Volume 16, 2015",
        "count": 86,
        "papers": [
            "High-throughput DNA sequence data compression.",
            "The genomic and functional characteristics of disease genes.",
            "A QTL model to map the common genetic basis for correlative phenotypic plasticity.",
            "Allotetraploid and autotetraploid models of linkage analysis.",
            "RegScan: a GWAS tool for quick estimation of allele effects on continuous traits and their combinations.",
            "Transcription factor and microRNA co-regulatory loops: important regulatory motifs in biological processes and diseases.",
            "Comparison of software packages for detecting differential expression in RNA-seq studies.",
            "A survey on prediction of specificity-determining sites in proteins.",
            "The semantic web in translational medicine: current applications and future directions.",
            "LC-MS alignment in theory and practice: a comprehensive algorithmic review.",
            "Searching for repetitions in biological networks: methods, resources and tools.",
            "Investigating biocomplexity through the agent-based paradigm.",
            "On the validity of time-dependent AUC estimators.",
            "Pathogenicity phenomena in three model systems: from network mining to emerging system-level properties.",
            "Kernel methods for large-scale genomic data analysis.",
            "Sequencing technologies and tools for short tandem repeat variation detection.",
            "A multi-Poisson dynamic mixture model to cluster developmental patterns of gene expression by RNA-seq.",
            "A primer to frequent itemset mining for bioinformatics.",
            "An assessment of computational methods for estimating purity and clonality using genomic data derived from heterogeneous tumor tissue samples.",
            "Comparative analysis of methods for identifying somatic copy number alterations from deep sequencing data.",
            "Rich annotation of DNA sequencing variants by leveraging the Ensembl Variant Effect Predictor with plugins.",
            "Advances in network-based metabolic pathway analysis and gene expression data integration.",
            "Translational research platforms integrating clinical and omics data: a review of publicly available solutions.",
            "Combining multidimensional genomic measurements for predicting cancer prognosis: observations from TCGA.",
            "Genome-wide identification and predictive modeling of polyadenylation sites in eukaryotes.",
            "Towards more accurate prediction of protein folding rates: a review of the existing web-based bioinformatics approaches.",
            "Toward more realistic drug-target interaction predictions.",
            "Letter to the Editor: On the term 'interaction' and related phrases in the literature on Random Forests.",
            "How to establish a bioinformatics postgraduate degree programme - a case study from South Africa.",
            "Bioinformatics Education - Perspectives and Challenges out of Africa.",
            "Letter to the Editor: On Reviews and Papers on New Methods.",
            "Methodological aspects of whole-genome bisulfite sequencing analysis.",
            "Exome sequence read depth methods for identifying copy number changes.",
            "Exploring the function of genetic variants in the non-coding genomic regions: approaches for identifying human regulatory variants affecting gene expression.",
            "Deciphering oncogenic drivers: from single genes to integrated pathways.",
            "Review of statistical methodologies for the detection of parent-of-origin effects in family trio genome-wide association data with binary disease traits.",
            "An open-pollinated design for mapping imprinting genes in natural populations.",
            "Breast cancer classification: linking molecular mechanisms to disease prognosis.",
            "From miRNA regulation to miRNA-TF co-regulation: computational approaches and challenges.",
            "Current innovations and future challenges of network motif detection.",
            "Functional mapping of seasonal transition in perennial plants.",
            "Causes, consequences and solutions of phylogenetic incongruence.",
            "Systematic assessment of imputation performance using the 1000 Genomes reference panels.",
            "Rediscovery rate estimation for assessing the validation of significant findings in high-throughput studies.",
            "Comparative analysis of methods for genome-wide nucleosome cartography.",
            "Correcting Illumina data.",
            "Performance evaluation of DNA copy number segmentation methods.",
            "Predictive modelling of gene expression from transcriptional regulatory elements.",
            "Alternative applications for distinct RNA sequencing strategies.",
            "Towards more accurate prediction of ubiquitination sites: a comprehensive review of current methods, tools and features.",
            "Network inference from AP-MS data: computational challenges and solutions.",
            "Apoptosis regulatory protein-protein interaction demonstrates hierarchical scale-free fractal network.",
            "Buying in to bioinformatics: an introduction to commercial sequence analysis software.",
            "Bio/chemoinformatics in India: an outlook.",
            "Next Generation Microarray Bioinformatics: Methods and Protocols. Edited by Junbai Wang, Aik Choon Tan and Tianhai Tian.",
            "Measures for the degree of overlap of gene signatures and applications to TCGA.",
            "Environmental genes and genomes: understanding the differences and challenges in the approaches and software for their analyses.",
            "Detecting associations of rare variants with common diseases: collapsing or haplotyping?",
            "Pathogenicity prediction of non-synonymous single nucleotide variants in dilated cardiomyopathy.",
            "Comprehensive overview and assessment of computational prediction of microRNA targets in animals.",
            "Advantages of mixing bioinformatics and visualization approaches for analyzing sRNA-mediated regulatory bacterial networks.",
            "LncTar: a tool for predicting the RNA targets of long noncoding RNAs.",
            "Sample size calculation in metabolic phenotyping studies.",
            "Case study: using sequence homology to identify putative phosphorylation sites in an evolutionarily distant species (honeybee).",
            "A review of in silico approaches for analysis and prediction of HIV-1-human protein-protein interactions.",
            "Making the difference: integrating structural variation detection tools.",
            "The complexity, challenges and benefits of comparing two transporter classification systems in TCDB and Pfam.",
            "A selective review of robust variable selection with applications in bioinformatics.",
            "Discriminative pattern mining and its applications in bioinformatics.",
            "Virtual Reference Environments: a simple way to make research reproducible.",
            "2HiGWAS: a unifying high-dimensional platform to infer the global genetic architecture of trait development.",
            "Evaluation of a two-stage framework for prediction using big genomic data.",
            "Comparing the evolutionary conservation between human essential genes, human orthologs of mouse essential genes and human housekeeping genes.",
            "A comparative study of RNA-seq analysis strategies.",
            "Assessing the consistency of public human tissue RNA-seq data sets.",
            "Optimization of miRNA-seq data preprocessing.",
            "A review of ensemble methods for de novo motif discovery in ChIP-Seq data.",
            "Detecting and overcoming systematic bias in high-throughput screening technologies: a comprehensive review of practical issues and methodological solutions.",
            "Parameter estimation methods for gene circuit modeling from time-series mRNA data: a comparative study.",
            "Molecular portraits: the evolution of the concept of transcriptome-based cancer signatures.",
            "Circadian systems biology in Metazoa.",
            "Predicting protein interface residues using easily accessible on-line resources.",
            "Current status and future challenges in T-cell receptor/peptide/MHC molecular dynamics simulations.",
            "Docking small peptides remains a great challenge: an assessment using AutoDock Vina.",
            "Critical assessment of genome-scale metabolic networks: the need for a unified standard.",
            "The role of ontologies in biological and biomedical research: a functional perspective."
        ]
    },
    {
        "name": "Briefings in Bioinformatics",
        "year": "2014",
        "info": "Volume 15, 2014",
        "count": 83,
        "papers": [
            "Identifying miRNAs, targets and functions.",
            "Iteratively reweighted LASSO for mapping multiple quantitative trait loci.",
            "Towards a comprehensive picture of the genetic landscape of complex traits.",
            "Structural mapping: how to study the genetic architecture of a phenotypic trait through its formation mechanism.",
            "Alpha shape and Delaunay triangulation in studies of protein-related interactions.",
            "Data management strategies for multinational large-scale systems biology projects.",
            "The impact of HGT on phylogenomic reconstruction methods.",
            "Software applications toward quantitative metabolic flux analysis and modeling.",
            "Software applications for flux balance analysis.",
            "Reconciliation of metabolites and biochemical reactions for metabolic networks.",
            "Next-generation Bioinformatics: connecting bases to genes, networks and disease.",
            "A bioinformatician's guide to the forefront of suffix array construction algorithms.",
            "Bioinformatics approaches for functional annotation of membrane proteins.",
            "Evaluating template-based and template-free protein-protein complex structure prediction.",
            "Identifying protein complexes and functional modules - from static PPI networks to dynamic PPI networks.",
            "Supervised, semi-supervised and unsupervised inference of gene regulatory networks.",
            "Inference of dynamic networks using time-course data.",
            "Detecting tissue-specific early warning signals for complex diseases based on dynamical network biomarkers: study of type 2 diabetes by cross-tissue analysis.",
            "Identifying driver mutations from sequencing data of heterogeneous tumors in the era of personalized genome sequencing.",
            "A survey of tools for variant analysis of next-generation genome sequencing data.",
            "Boosting signals in gene-based association studies via efficient SNP selection.",
            "Reconsideration of in silico siRNA design from a perspective of heterogeneous data integration: problems and solutions.",
            "A statistical design for testing apomictic diversification through linkage analysis.",
            "A case-control design for testing and estimating epigenetic effects on complex diseases.",
            "A survey on annotation tools for the biomedical literature.",
            "Editorial: Alignment-free methods in computational biology.",
            "New developments of alignment-free sequence comparison: measures, statistics and next-generation sequencing.",
            "Pattern recognition and probabilistic measures in alignment-free sequence analysis.",
            "Sequence analysis by iterated maps, a review.",
            "Information theory applications for biological sequence analysis.",
            "Compressive biological sequence analysis and archival in the era of high-throughput sequencing technologies.",
            "Alignment-free phylogenetics and population genetics.",
            "Applications of alignment-free methods in epigenomics.",
            "Benchmarking of viral haplotype reconstruction programmes: an overview of the capacities and limitations of currently available programmes.",
            "Experimental evidence validating the computational inference of functional associations from gene fusion events: a critical survey.",
            "Knowledge representation in metabolic pathway databases.",
            "A review of genomic data warehousing systems.",
            "BLAST output visualization in the new sequencing era.",
            "Gene set analysis methods: statistical models and methodological differences.",
            "Reproducible probe-level analysis of the Affymetrix Exon 1.0 ST array with R/Bioconductor.",
            "A bi-Poisson model for clustering gene expression profiles by RNA-seq.",
            "Are all of the human exons alternatively spliced?",
            "Forward LASSO analysis for high-order interactions in genome-wide association study.",
            "An allometric model for mapping seed development in plants.",
            "Shape mapping: genetic mapping meets geometric morphometrics.",
            "Understanding and identifying amino acid repeats.",
            "Genome-scale bacterial transcriptional regulatory networks: reconstruction and integrated analysis with metabolic models.",
            "Network information improves cancer outcome prediction.",
            "Architecture for interoperable software in biology.",
            "Survey of MapReduce frame operation in bioinformatics.",
            "Pharmaco-miR: linking microRNAs and drug effects.",
            "Systems mapping: how to map genes for biomass allocation toward an ideotype.",
            "Similarity of markers identified from cancer gene expression studies: observations from GEO.",
            "Integrative approaches for predicting protein function and prioritizing genes for complex phenotypes using protein interaction networks.",
            "BioFNet: biological functional network database for analysis and synthesis of biological systems.",
            "Systems pharmacology in drug discovery and therapeutic insight for herbal medicines.",
            "Similarity-based machine learning methods for predicting drug-target interactions: a brief review.",
            "Fighting against uncertainty: an essential issue in bioinformatics.",
            "Controlling for confounding variables in MS-omics protocol: why modularity matters.",
            "Visualizing time-related data in biology, a review.",
            "DRISEE overestimates errors in metagenomic sequencing data.",
            "Web scraping technologies in an API world.",
            "Parallel stochastic systems biology in the cloud.",
            "An efficient approach to large-scale genotype-phenotype association analyses.",
            "Choosing appropriate models for protein-protein interaction networks: a comparison study.",
            "Data construction for phosphorylation site prediction.",
            "Biological network extraction from scientific literature: state of the art and challenges.",
            "Three-stage quality control strategies for DNA re-sequencing data.",
            "Alignment-free genetic sequence comparisons: a review of recent approaches by word analysis.",
            "A comparative study of statistical methods used to identify dependencies between gene expression signals.",
            "The dilemma of choosing the ideal permutation strategy while estimating statistical significance of genome-wide enrichment.",
            "A comprehensive overview of Infinium HumanMethylation450 data processing.",
            "Facilitating the use of large-scale biological data and tools in the era of translational bioinformatics.",
            "Bioinformatics approaches for improved recombinant protein production in Escherichia coli:  protein solubility prediction.",
            "Systematic identification of Class I HDAC substrates.",
            "Extracting reaction networks from databases-opening Pandora's box.",
            "Modern bioinformatics meets traditional Chinese medicine.",
            "Teaching the ABCs of bioinformatics: a brief introduction to the Applied Bioinformatics Course.",
            "A comparative evaluation on prediction methods of nucleosome positioning.",
            "Revealing the architecture of genetic and epigenetic regulation: a maximum likelihood model.",
            "A statistical model for QTL mapping in polysomic autotetraploids underlying double reduction.",
            "A model-free approach for detecting interactions in genetic association studies.",
            "A model for family-based case-control studies of genetic imprinting and epistasis."
        ]
    },
    {
        "name": "Briefings in Bioinformatics",
        "year": "2013",
        "info": "Volume 14, 2013",
        "count": 67,
        "papers": [
            "The automatic annotation of bacterial genomes.",
            "Class-imbalanced classifiers for high-dimensional data.",
            "Cancer gene prioritization by integrative analysis of mRNA expression and DNA copy number data: a comparative review.",
            "Detecting miRNAs in deep-sequencing data: a software performance comparison and evaluation.",
            "Analysis of insertion-deletion from deep-sequencing data: software evaluation for optimal detection.",
            "A survey of error-correction methods for next-generation sequencing.",
            "Review of tandem repeat search tools: a systematic approach to evaluating algorithmic performance.",
            "A dynamic framework for quantifying the genetic architecture of phenotypic plasticity.",
            "A unifying framework for bivalent multilocus linkage analysis of allotetraploids.",
            "Semantic Web meets Integrative Biology: a survey.",
            "Bioinformatics for Biologists. Edited by Pavel Pevzner and Ron Shamir.",
            "Editorial.",
            "A brief introduction to web-based genome browsers.",
            "The UCSC genome browser and associated tools.",
            "Using GBrowse 2.0 to visualize and share next-generation sequence data.",
            "Visualizing next-generation sequencing data with JBrowse.",
            "Integrative Genomics Viewer (IGV): high-performance genomics data visualization and exploration.",
            "Using Tablet for visual exploration of second-generation sequencing data.",
            "BamView: visualizing and interpretation of next-generation sequencing read alignments.",
            "Hawkeye and AMOS: visualizing and assessing the quality of genome assemblies.",
            "Motif discovery and transcription factor binding sites before and after the next-generation sequencing era.",
            "Bioinformatics opportunities for identification and study of medicinal plants.",
            "Machine learning approaches for the discovery of gene-gene interactions in disease data.",
            "Obituary: In memory of Jack Leunissen.",
            "Joint analysis of miRNA and mRNA expression data.",
            "A comparative analysis of biclustering algorithms for gene expression data.",
            "A reversed framework for the identification of microRNA-target pairs in plants.",
            "A statistical procedure to map high-order epistasis for complex traits.",
            "Data mining in the Life Sciences with Random Forest: a walk in the park or lost in the jungle?",
            "Towards a bioinformatics analysis of anti-Alzheimer's herbal medicines from a target network perspective.",
            "Systematic analysis of the Plk-mediated phosphoregulation in eukaryotes.",
            "Automated glycopeptide analysis - review of current state and future directions.",
            "Bioinformatics tools and challenges in structural analysis of lipidomics MS/MS data.",
            "Comparability and reproducibility of biomedical data.",
            "On the classification of microarray gene-expression data.",
            "Mathematical modeling of biological systems.",
            "Accounting for noise when clustering biological data.",
            "A practical guide for the functional annotation of genetic variations using SNPnexus.",
            "Congruency in the prediction of pathogenic missense mutations: state-of-the-art web-based tools.",
            "A multivalent three-point linkage analysis model of autotetraploids.",
            "Batch effect removal methods for microarray gene expression data integration: a survey.",
            "Network-based drug discovery by integrating systems biology and computational technologies.",
            "Application of next generation sequencing to human gene fusion detection: computational tools, features and perspectives.",
            "The Rat Genome Database 2013 - data, tools and users.",
            "Editorial: International, interdisciplinary, multi-level bioinformatics training and education.",
            "Best practices in bioinformatics training for life scientists.",
            "The challenges of delivering bioinformatics training in the analysis of high-throughput data.",
            "The NGS WikiBook: a dynamic collaborative online training effort with long-term sustainability.",
            "Navigating the changing learning landscape: perspective from bioinformatics.ca.",
            "Next-generation sequencing: a challenge to meet the increasing demand for training workshops in Australia.",
            "Environmental bio-monitoring with high-throughput sequencing.",
            "Bioinformatics and Systems Biology: bridging the gap between heterogeneous student backgrounds.",
            "Mathematics and evolutionary biology make bioinformatics education comprehensible.",
            "A first course in computing with applications to biology.",
            "Teaching the bioinformatics of signaling networks: an integrated approach to facilitate multi-disciplinary learning.",
            "Pattern recognition in bioinformatics.",
            "Integrating bioinformatics into senior high school: design principles and implications.",
            "A review of Bioinformatics training applied to research in Molecular Medicine, Agriculture and Biodiversity in Costa Rica and Central America.",
            "A comprehensive evaluation of normalization methods for Illumina high-throughput RNA sequencing data analysis.",
            "A solid quality-control analysis of AB SOLiD short-read sequencing data.",
            "Evaluation of research in biomedical ontologies.",
            "A quantitative model of transcriptional differentiation driving host-pathogen interactions.",
            "Assessing protein conformational sampling methods based on bivariate lag-distributions of backbone angles.",
            "Tools for the functional interpretation of metabolomic experiments.",
            "State-of-the-art technology in modern computer-aided drug design.",
            "A guide to in silico vaccine discovery for eukaryotic pathogens.",
            "Developing an online programme in computational biology."
        ]
    },
    {
        "name": "Briefings in Bioinformatics",
        "year": "2012",
        "info": "Volume 13, 2012",
        "count": 61,
        "papers": [
            "Travelling the world of gene-gene interactions.",
            "Probabilistic graphical models for genetic association studies.",
            "A computational framework for the inheritance pattern of genomic imprinting for complex traits.",
            "Tools for managing and analyzing microarray data.",
            "Combining literature text mining with microarray data: advances for system biology modeling.",
            "Caveats and pitfalls of ROC analysis in clinical microarray research (and how to avoid them).",
            "Building an HIV data mashup using Bio2RDF.",
            "A large-scale benchmark study of existing algorithms for taxonomy-independent microbial community analysis.",
            "The impact of taxon sampling on phylogenetic inference: a review of two decades of controversy.",
            "Bioinformatics tools and database resources for systems genetics analysis in mice - a short review and an evaluation of future needs.",
            "LEPSCAN - a web server for searching latent periodicity in DNA sequences.",
            "Learning transcriptional regulation on a genome scale: a theoretical analysis based on gene expression data.",
            "How to cluster gene expression dynamics in response to environmental signals.",
            "Dissection of human MiRNA regulatory influence to subpathway.",
            "Calculating transcription factor binding maps for chromatin.",
            "Biological network motif detection: principles and practice.",
            "GO-function: deriving biologically relevant functions from statistically significant functions.",
            "Detecting coevolving positions in a molecule: why and how to account for phylogeny.",
            "A toolbox for developing bioinformatics software.",
            "Tutorial videos of bioinformatics resources: online distribution trial in Japan named TogoTV.",
            "Comparative analysis of algorithms for whole-genome assembly of pyrosequencing data.",
            "Gene set enrichment analysis: performance evaluation and usage guidelines.",
            "Random forest Gini importance favours SNPs with large minor allele frequency: impact, sources and recommendations.",
            "Lessons from a decade of integrating cancer copy number alterations with gene expression profiles.",
            "Functional mapping of ontogeny in flowering plants.",
            "A practical guide for the computational selection of residues to be experimentally characterized in protein families.",
            "A review of statistical methods for prediction of proteolytic cleavage.",
            "Toward more accurate pan-specific MHC-peptide binding prediction: a review of current methods and tools.",
            "Integration of Boolean models exemplified on hepatocyte signal transduction.",
            "The relationship between rational drug design and drug side effects.",
            "Bioinformatics Training Network (BTN): a community resource for bioinformatics trainers.",
            "Principles of Computational Modeling in NeuroscienceDavid Sterratt, Bruce Graham, Andrew Gillies and David Willshaw.",
            "Editorial: Current progress in Bioinformatics 2012.",
            "Multiscale modeling of macromolecular biosystems.",
            "Identification of aberrant pathways and network activities from high-throughput data.",
            "Measuring the microbiome: perspectives on advances in DNA-based techniques for exploring microbial life.",
            "Reverse engineering biomolecular systems using -omic data: challenges, progress and opportunities.",
            "Network biology methods integrating biological data for translational science.",
            "Mining the pharmacogenomics literature - a survey of the state of the art.",
            "Bioinformatics for personal genome interpretation.",
            "Adjusting confounders in ranking biomarkers: a model-based ROC approach.",
            "Generic framework for high-dimensional fixed-effects ANOVA.",
            "Affymetrix GeneChip microarray preprocessing for multivariate analyses.",
            "Probe mapping across multiple microarray platforms.",
            "Bayesian inference for genomic imprinting underlying developmental characteristics.",
            "Semantic similarity analysis of protein data: assessment with biological features and issues.",
            "Protein inference: a review.",
            "Interfaces to PeptideAtlas: a case study of standard data access systems.",
            "Hive plots - rational approach to visualizing networks.",
            "Editorial.",
            "Taxonomic binning of metagenome samples generated by next-generation sequencing technologies.",
            "Ultrafast clustering algorithms for metagenomic sequence analysis.",
            "Classification of metagenomic sequences: methods and challenges.",
            "Reference databases for taxonomic assignment in metagenomics.",
            "Bioinformatic approaches for functional annotation and pathway inference in metagenomics data.",
            "Functional assignment of metagenomic data: challenges and applications.",
            "Current opportunities and challenges in microbial metagenome analysis - a bioinformatic perspective.",
            "Metagenomic analysis: the challenge of the data bonanza.",
            "Gut microbiota: methodological aspects to describe taxonomy and functionality.",
            "Data mining the human gut microbiota for therapeutic targets.",
            "Computational systems biology and in silico modeling of the human microbiome."
        ]
    },
    {
        "name": "Briefings in Bioinformatics",
        "year": "2011",
        "info": "Volume 12, 2011",
        "count": 74,
        "papers": [
            "Ensemble learning algorithms for classification of mtDNA into haplogroups.",
            "Preprocessing and downstream analysis of microarray DNA copy number profiles.",
            "A guide to web tools to prioritize candidate genes.",
            "Ranking prognosis markers in cancer genomic studies.",
            "PHAST and RPHAST: phylogenetic analysis with space/time models.",
            "Online resources of cancer data: barriers, benefits and lessons.",
            "Computational discrete models of tissue growth and regeneration.",
            "Bioinformatics.Charlie Hodgman, Andrew French and David Westhead Instant.",
            "Proteome Bioinformatics. Edited by Simon J. Hubbard and Andrew R. Jones, .",
            "Knowledge-Based Bioinformatics - From analysis to interpretation.Edited by Gil Alterovitz and Marco Ramoni.",
            "Letter to the Editor: Stability of Random Forest importance measures.",
            "Challenges in integrating Escherichia coli molecular biology data.",
            "Mutational analysis in RNAs: comparing programs for RNA deleterious mutation prediction.",
            "Computational analysis of miRNA targets in plants: current status and challenges.",
            "Evolution of gene regulation - on the road towards computational inferences.",
            "Comparative study of computational methods to detect the correlated reaction sets in biochemical networks.",
            "Targeted metabolic reconstruction: a novel approach for the characterization of plant-pathogen interactions.",
            "Critical assessment of structure-based sequence alignment methods at distant relationships.",
            "Protein mass spectra data analysis for clinical biomarker discovery: a global review.",
            "Editorial.",
            "An empirical assessment of validation practices for molecular classifiers.",
            "Using cross-validation to evaluate predictive accuracy of survival risk classifiers based on high-dimensional data.",
            "Added predictive value of high-throughput molecular data to clinical data and its validation.",
            "Biological feature validation of estimated gene interaction networks from microarray data: a case study on MYC in lymphomas.",
            "Validation of gene regulatory networks: scientific and inferential.",
            "Validation in Genetic Association Studies.",
            "The meta-analysis of genome-wide association studies.",
            "Result verification, code verification and computation of support values in phylogenetics.",
            "Design and validation issues in RNA-seq experiments.",
            "Case studies in reproducibility.",
            "Editorial: Computational methods for drug repurposing.",
            "Exploiting drug-disease relationships for computational drug repositioning.",
            "Old friends in new guise: repositioning of known drugs with structural bioinformatics.",
            "Mining small-molecule screens to repurpose drugs.",
            "Identify drug repurposing candidates by mining the Protein Data Bank.",
            "Database identifies FDA-approved drugs with potential to be repurposed for treatment of orphan diseases.",
            "Drug repositioning for orphan diseases.",
            "Literature mining, ontologies and information visualization for drug repurposing.",
            "Letter to the Editor: On the stability and ranking of predictors from random forest variable importance measures.",
            "Editorial: Orthology and applications.",
            "Obituary: Walter Fitch and the orthology paradigm.",
            "Computational methods for Gene Orthology inference.",
            "Models, algorithms and programs for phylogeny reconciliation.",
            "Positional orthology: putting genomic evolutionary relationships into context.",
            "Ortholog identification in the presence of domain architecture rearrangement.",
            "Conceptual framework and pilot study to benchmark phylogenomic databases based on reference gene trees.",
            "When orthologs diverge between human and mouse.",
            "Evidence for short-time divergence and long-time conservation of tissue-specific expression after gene duplication.",
            "Phylogenetic-based propagation of functional annotations within the Gene Ontology consortium.",
            "OrthoDisease: tracking disease gene orthologs across 100 species.",
            "Comparative genomics approach to detecting split-coding regions in a low-coverage genome: lessons from the chimaera Callorhinchus milii (Holocephali, Chondrichthyes).",
            "Letter to the Editor: SeqXML and OrthoXML: standards for sequence and orthology information.",
            "Base-calling for next-generation sequencing platforms.",
            "Missing value imputation for gene expression data: computational techniques to recover missing data from available information.",
            "Monovalent and divalent salt correction algorithms for Tm prediction - recommendations for Primer3 usage.",
            "Literature-aided interpretation of gene expression data with the weighted global test.",
            "Evolution and applications of plant pathway resources and databases.",
            "Letter to the Editor: Current progress in patient-specific modeling by Neal and Kerckhoffs (2010).",
            "Editorial.",
            "Tools and collaborative environments for bioinformatics research.",
            "Knowledge sharing and collaboration in translational research, and the DC-THERA Directory.",
            "Social pathway annotation: extensions of the systems biology metabolic modelling assistant.",
            "myMIR: a genome-wide microRNA targets identification and annotation tool.",
            "RNA tertiary structure prediction with ModeRNA.",
            "Computational challenges of sequence classification in microbiomic data.",
            "Rapid innovation in ChIP-seq peak-calling algorithms is outdistancing benchmarking efforts.",
            "Exon array data analysis using Affymetrix power tools and R statistical software.",
            "Toward microRNA-mediated gene regulatory networks in plants.",
            "Bioinformatics tools for the structural elucidation of multi-subunit protein complexes by mass spectrometric analysis of protein-protein cross-links.",
            "Critical assessment of high-throughput standalone methods for secondary structure prediction.",
            "GPU-powered tools boost molecular visualization.",
            "Protein-protein interaction and pathway databases, a graphical review.",
            "Principal component analysis based methods in bioinformatics studies.",
            "The what, where, how and why of gene ontology - a primer for bioinformaticians."
        ]
    },
    {
        "name": "Briefings in Bioinformatics",
        "year": "2010",
        "info": "Volume 11, 2010",
        "count": 55,
        "papers": [
            "Editorial: Current progress in Bioinformatics 2010.",
            "Genome variation discovery with high-throughput sequencing data.",
            "Toward the dynamic interactome: it's about time.",
            "Knowledge-based data analysis comes of age.",
            "Pathway Tools version 13.0: integrated software for pathway/genome informatics and systems biology.",
            "The challenges of informatics in synthetic biology: from biomolecular networks to artificial organisms.",
            "Advances in translational bioinformatics: computational approaches for the hunting of disease genes.",
            "Current progress in patient-specific modeling.",
            "Advances in metaheuristics for gene selection and classification of microarray data.",
            "Multi-scale modelling in computational biomedicine.",
            "Exploration of cellular reaction systems.",
            "Modern Genome Annotation . Edited by Dmitrij Frishman and Alfonso Valencia.",
            "Bioinformatics approaches for genomics and post genomics applications of next-generation sequencing.",
            "Detection of human interchromosomal trans-splicing in sequence databanks.",
            "Gene association analysis: a survey of frequent pattern mining from gene expression data.",
            "Bioinformatical approaches to characterize intrinsically disordered/unstructured proteins.",
            "Detection call algorithms for high-throughput gene expression microarray data.",
            "Dealing with missing values in large-scale studies: microarray data imputation and beyond.",
            "Data integration for plant genomics - exemplars from the integration of Arabidopsis thaliana databases.",
            "Editorial: Accelerating systems biology.",
            "BioModels.net Web Services, a free and integrated toolkit for computational modelling software.",
            "CaliBayes and BASIS: integrated tools for the calibration, simulation and storage of biological simulation models.",
            "Flexible experimentation in the modeling and simulation framework JAMES II - implications for computational systems biology.",
            "High-performance analysis of biological systems dynamics with the DiVinE model checker.",
            "Simulation of P systems with active membranes on CUDA.",
            "GPU computing for systems biology.",
            "High performance cellular level agent-based simulation with FLAME for the GPU.",
            "Real-time classification of datasets with hardware embedded neuromorphic neural networks.",
            "Estimating the divisibility of complex biological networks by sparseness indices.",
            "Fast and efficient searching of biological data resources - using EB-eye.",
            "Semiparametric prognosis models in genomic studies.",
            "SynBioSS designer: a web-based tool for the automated generation of kinetic models for synthetic biological constructs.",
            "Developing computational model-based diagnostics to analyse clinical chemistry data.",
            "Molecular networks for the study of TCM Pharmacology.",
            "Online tools for understanding rat physiology.",
            "DNA barcoding: a six-question tour to improve users' awareness about the method.",
            "Editorial: Second-generation sequencing.",
            "De novo assembly of short sequence reads.",
            "A survey of sequence alignment algorithms for next-generation sequencing.",
            "Challenges of sequencing human genomes.",
            "Next generation sequencing in functional genomics.",
            "Introduction into the analysis of high-throughput-sequencing based epigenome data.",
            "Application of second-generation sequencing to cancer genomics.",
            "Editorial: Bioinformatics education in the 21st century.",
            "Broader incorporation of bioinformatics in education: opportunities and challenges.",
            "Bioinformatics training: a review of challenges, actions and support requirements.",
            "Bioinformatics training: selecting an appropriate learning content management system - an example from the European Bioinformatics Institute.",
            "Education resources of the National Center for Biotechnology Information.",
            "Bioinformatics education dissemination with an evolutionary problem solving perspective.",
            "Multi-stage learning aids applied to hands-on software training.",
            "Perspectives on presentation and pedagogy in aid of bioinformatics education.",
            "OpenHelix: bioinformatics education outside of a different box.",
            "A model for Bioinformatics training: the marine biological laboratory.",
            "Bioinformatics education in India.",
            "The GTPB training programme in Portugal."
        ]
    },
    {
        "name": "Briefings in Bioinformatics",
        "year": "2009",
        "info": "Volume 10, 2009",
        "count": 59,
        "papers": [
            "Bringing Web 2.0 to bioinformatics.",
            "Knowledge-based expert systems and a proof-of-concept case study for multiple sequence alignment construction and analysis.",
            "Gene-set analysis and reduction.",
            "Next generation tools for the annotation of human SNPs.",
            "Biochemical simulations: stochastic, approximate stochastic and hybrid approaches.",
            "Web-based applications for building, managing and analysing kinetic models of biological systems.",
            "Towards the integrated analysis, visualization and reconstruction of microbial gene regulatory networks.",
            "Simulation of DNA sequence evolution under models of recent directional selection.",
            "Models of coding sequence evolution.",
            "Semantic Web for Health Care and Life Sciences: a review of the state of the art.",
            "Moby and Moby 2: Creatures of the Deep (Web).",
            "Building biomedical web communities using a semantically aware content management system.",
            "Linked data and provenance in biological data webs.",
            "Towards pharmacogenomics knowledge discovery with the semantic web.",
            "Scaling the walls of discovery: using semantic metadata for integrative problem solving.",
            "Semantic web for integrated network analysis in biomedicine.",
            "Life sciences on the Semantic Web: the Neurocommons and beyond.",
            "Domain mobility in proteins: functional and evolutionary implications.",
            "A survey of available tools and web servers for analysis of protein-protein interactions and interfaces.",
            "Progress and challenges in predicting protein-protein interaction sites.",
            "2D molecular graphics: a flattened world of chemistry and biology.",
            "Probes containing runs of guanines provide insights into the biophysics and bioinformatics of Affymetrix GeneChips.",
            "Taming the complexity of biological pathways through parallel computing.",
            "Potential Bias in GO: : TermFinder.",
            "A pitfall of wiki solution for biological databases.",
            "A roadmap of clustering algorithms: finding a match for a biomedical application.",
            "An introduction to artificial neural networks in bioinformatics - application to complex microarray and mass spectrometry datasets in cancer studies.",
            "ImmunoGrid, an integrative environment for large-scale simulation of the immune system for vaccine discovery, design and optimization.",
            "Introduction to Computational Genomics: A Case Studies Approach Nello Cristianini and Matthew W. Hahn.",
            "Editorial.",
            "Approaches to neuroscience data integration.",
            "Genome assembly reborn: recent computational challenges.",
            "Computational biology for cardiovascular biomarker discovery.",
            "FINDSITE: a combined evolution/structure-based approach to protein function prediction.",
            "Biological knowledge management: the emerging role of the Semantic Web technologies.",
            "Computational methods for discovering gene networks from expression data.",
            "Computational systems biology of the cell cycle.",
            "Flux balance analysis of biological systems: applications and challenges.",
            "The virtual cell - a candidate co-ordinator for 'middle-out' modelling of biological systems.",
            "Exploring autonomy through computational biomodelling.",
            "An Ariadne's thread to the identification and annotation of noncoding RNAs in eukaryotes.",
            "Expression profiling of microRNAs by deep sequencing.",
            "Towards accurate human promoter recognition: a review of currently used sequence features and classification methods.",
            "Computational methods for the detection of cis-regulatory modules.",
            "Finding sequence motifs in prokaryotic genomes - a brief practical guide for a microbiologist.",
            "Development of biomarker classifiers from high-dimensional data.",
            "Optimized detection of differential expression in global profiling experiments: case studies in clinical transcriptomic and quantitative proteomic datasets.",
            "Stability and aggregation of ranked gene lists.",
            "Architecture, function and prediction of long signal peptides.",
            "Recent advances in computer-aided drug design.",
            "Editorial.",
            "Computational approaches and software tools for genetic linkage map estimation in plants.",
            "De novo sequencing of plant genomes using second-generation technologies.",
            "Improved criteria and comparative genomics tool provide new insights into grass paleogenomics.",
            "Common introns within orthologous genes: software and application to plants.",
            "Bioinformatics in the orphan crops.",
            "Computational techniques for elucidating plant-pathogen interactions from large-scale experiments on fungi and oomycetes.",
            "Software engineering the mixed model for genome-wide association studies on large samples.",
            "Data integration for plant genomics - exemplars from the integration of Arabidopsis thaliana databases."
        ]
    },
    {
        "name": "Briefings in Bioinformatics",
        "year": "2008",
        "info": "Volume 9, 2008",
        "count": 57,
        "papers": [
            "Three lectures on case-control genetic association analysis.",
            "Biobanking for Europe.",
            "An overview of image-processing methods for Affymetrix GeneChips.",
            "Current trends in the bioinformatic sequence analysis of metabolic pathways in prokaryotes.",
            "Correlated substitution analysis and the prediction of amino acid structural contacts.",
            "Automation of in-silico data analysis processes through workflow management systems.",
            "Extensible open source content management systems and frameworks: a solution for many needs of a bioinformatics group.",
            "Biomedical ontologies: a functional perspective.",
            "Bioinformatics - From Genomes to Therapies: Edited by Thomas Lengauer.",
            "Bioinformatics, Genomics, and Proteomics: Getting the Big Picture (Biotechnology in the 21st Century): Ann Finney Batiza.",
            "Computational proteomics: management and analysis of proteomics data.",
            "Approaches to dimensionality reduction in proteomic biomarker studies.",
            "Machine learning methods for predictive proteomics.",
            "Classification of mass-spectrometric data in clinical proteomics using learning vector quantization methods.",
            "Algorithms and tools for analysis and management of mass spectrometry data.",
            "Computational methods for the comparative quantification of proteins in label-free LCn-MS experiments.",
            "The HUPO proteomics standards initiative - easing communication and minimizing data loss in a changing world.",
            "Information quality in proteomics.",
            "Gene-set approach for expression pattern analysis.",
            "ROC analysis: applications to the classification of biological sequences and 3D structures.",
            "Pfam 10 years on: 10 000 families and still growing.",
            "Interoperability with Moby 1.0 - It's better than sharing your toothbrush!",
            "A review of bioinformatics education in Germany.",
            "Two interactive Bioinformatics courses at the Bielefeld University Bioinformatics Server.",
            "The BREW workshop series: a stimulating experience in PhD education.",
            "Cardiac Gene Expression: Methods and Protocols.: Edited by Jun Zhang and Gregg Rokosh.",
            "Bioinformatics Basics: Applications in Biological Science and Medicine.: Edited by Lukas K. Buehler and Hooman H. Rashidi.",
            "Data Analysis and Graphics Using R: An Example-Based Approach, Second Edition.: John Maindonald and John Braun.",
            "Critical technologies for bioinformatics.",
            "IMGT, a system and an ontology that bridge biological and computational spheres in bioinformatics.",
            "Protein structure databases with new web services for structural biology and biomedical research.",
            "Recent developments in the MAFFT multiple sequence alignment program.",
            "MEGA: A biologist-centric software for evolutionary analysis of DNA and protein sequences.",
            "Computational intelligence approaches for pattern discovery in biological systems.",
            "VisANT: an integrative framework for networks in systems biology.",
            "The TRANSFAC project as an example of framework technology that supports the analysis of genomic regulation.",
            "Bioinformatics, multiscale modeling and the IUPS Physiome Project.",
            "Biodiversity informatics: the challenge of linking data and the role of shared identifiers.",
            "Detecting short tandem repeats from genome data: opening the software black box.",
            "The relative value of operon predictions.",
            "Identification of replication origins in prokaryotic genomes.",
            "Penalized feature selection and classification in bioinformatics.",
            "A structured approach for the engineering of biochemical network models, illustrated for signalling pathways.",
            "A critical examination of stoichiometric and path-finding approaches to metabolic pathways.",
            "The Beta Workbench: a computational tool to study the dynamics of biological systems.",
            "Gene-set approach for expression pattern analysis.",
            "Data and knowledge integration in the life sciences.",
            "Categorization of services for seeking information in biomedical literature: a typology for improvement of practice.",
            "Facts from text: can text mining help to scale-up high-quality manual curation of gene products with ontologies?",
            "Literature mining in support of drug discovery.",
            "Experience using web services for biological sequence analysis.",
            "Data curation + process curation=data integration + science.",
            "Building a knowledge base for systems pathology.",
            "Solutions for data integration in functional genomics: a critical assessment and case study.",
            "Methods in Microarray Normalization, Edited by Phillip Stafford.",
            "Mathematics of Evolution and Phylogeny, Edited by Olivier Gascuel.",
            "Problems and Solutions in Biological Sequence Analysis, Mark Borodovsky, Svetlana Ekisheva."
        ]
    },
    {
        "name": "Briefings in Bioinformatics",
        "year": "2007",
        "info": "Volume 8, 2007",
        "count": 55,
        "papers": [
            "Editorial.",
            "HCOP: a searchable database of human orthology predictions.",
            "A hitchhiker's guide to expressed sequence tag (EST) analysis.",
            "Statistically designing microarrays and microarray experiments to enhance sensitivity and specificity.",
            "Partial least squares: a versatile tool for the analysis of high-dimensional genomic data.",
            "Agents in bioinformatics, computational and systems biology.",
            "Abstracts.",
            "The growth of bioinformatics.",
            "Enrichment analysis in high-throughput genomics - accounting for dependency in the NULL.",
            "The WWWH of remote homolog detection: The state of the art.",
            "Evolving research trends in bioinformatics.",
            "Methods and protocols for prediction of immunogenic epitopes.",
            "Bayesian methods in bioinformatics and computational systems biology.",
            "Forensic DNA and bioinformatics.",
            "Abstracts.",
            "Knowledge networks in the age of the Semantic Web.",
            "SenseLab: new developments in disseminating neuroscience information.",
            "Alzforum and SWAN: the present and future of scientific web communities.",
            "Improving life sciences information retrieval using semantic web technology.",
            "Using provenance to manage knowledge of In Silico experiments.",
            "Boca: an open-source RDF store for building Semantic Web applications.",
            "Handbook of Computational Molecular Biology: Edited by Srinivas Aluru.",
            "Stochastic Modelling for Systems Biology: Darren J. Wilkinson.",
            "Knowledge Integration in Biomedicine: Technology and Community.",
            "BIB's first impact factor is 24.37.",
            "Integrative biology - the way forward.",
            "Petri net modelling of biological networks.",
            "Dynamical roles of biological regulatory circuits.",
            "Towards a calculus of biomolecular complexes at equilibrium.",
            "Modelling and simulation techniques for membrane biology.",
            "Combining experiments with multi-cell agent-based modeling to study biological tissue patterning.",
            "An integrative approach to understanding mechanosensation.",
            "Combined experimental and computational approaches to study the regulatory elements in eukaryotic genes.",
            "Handbook of Bioinspired Algorithms and Applications: Edited by Stephan Olariu and Albert Y.",
            "Current progress in bioinformatics 2007.",
            "Current Progress in computational metabolomics.",
            "Informatics challenges in structured RNA.",
            "Current trends in computational inference from mass spectrometry-based proteomics.",
            "Current progress in network research: toward reference networks for key model organisms.",
            "Protein interactions and disease: computational approaches to uncover the etiology of diseases.",
            "Biodiversity informatics: organizing and linking information across the spectrum of life.",
            "Frontiers of biomedical text mining: current progress.",
            "Bayesian Inference for Gene Expression and Proteomics.",
            "Normal Mode Analysis Theoretical and Applications to Biological and Chemical Systems.",
            "Knowledge Integration in Biomedicine: Technology and Community.",
            "Editorial.",
            "Discovering and detecting transposable elements in genome sequences.",
            "Statistical software for gene mapping by admixture linkage disequilibrium.",
            "A practical guide to the art of RNA gene prediction.",
            "A microarray analysis for differential gene expression in the soybean genome using Bioconductor and R.",
            "High-throughput modeling and analysis of protein structural dynamics.",
            "Informatics in neuroscience.",
            "BioManager: the use of a bioinformatics web application as a teaching tool in undergraduate bioinformatics training.",
            "Computational Genome Analysis: an Introduction: Richard C. Deonier, Simon Tavaré and Michael S. Waterman.",
            "Proteomics for Biological Discovery.: Edited by Timothy D. Veenstra and John R. Yates III."
        ]
    },
    {
        "name": "Briefings in Bioinformatics",
        "year": "2006",
        "info": "Volume 7, 2006",
        "count": 40,
        "papers": [
            "A new publisher for Briefings in Bioinformatics.",
            "Statistical significance in biological sequence analysis.",
            "Estimation and control of multiple testing error rates for microarray studies.",
            "Propagating uncertainty in microarray data analysis.",
            "Studying statistical properties of regulatory DNA sequences, and their use in predicting regulatory regions in the eukaryotic genomes.",
            "Bioinformatics of alternative splicing and its regulation.",
            "Biological applications of the theory of birth-and-death processes.",
            "Machine learning in bioinformatics.",
            "Pairwise sequence alignment - it's all about us!",
            "Abstracts.",
            "List mania: interpreting microarray results with the L2L server.",
            "Metabolomics and the challenges ahead.",
            "Metabolomics technology and bioinformatics.",
            "Flux balance analysis in the era of metabolomics.",
            "Review: On the analysis and interpretation of correlations in metabolomic data.",
            "Metabolomics Standards Workshop and the development of international standards for reporting metabolomics experimental results.",
            "Normalization and quantification of differential expression in gene expression microarrays.",
            "Advances in the Exon-Intron Database (EID).",
            "Computational aspects of systematic biology.",
            "Abstracts.",
            "Circumventing the cut-off for enrichment analysis.",
            "Annual Progress in Bioinformatics 2006.",
            "Navigating the HapMap.",
            "Automated protein function prediction - the genomic challenge.",
            "Graph-based methods for analysing networks in cell biology.",
            "Bio-ontologies: current trends and future directions.",
            "The Life Sciences Semantic Web is Full of Creeps!",
            "Open source tools and toolkits for bioinformatics: significance, and where are we?",
            "Statistical methods in genetics.",
            "Abstracts.",
            "Understanding the computational methodologies of systems biology.",
            "Resources for integrative systems biology: from data through databases to networks and dynamic system models.",
            "Representing, storing and accessing molecular interaction data: a review of models and tools.",
            "Computational methodologies for modelling, analysis and simulation of signalling networks.",
            "Strategies for dealing with incomplete information in the modeling of molecular interaction networks.",
            "Dynamic modelling and analysis of biochemical networks: mechanism-based models and model-based experiments.",
            "Application of wavelet-based tools to study the dynamics of biological processes.",
            "Advanced computing for systems biology.",
            "Mining literature for systems biology.",
            "Abstracts."
        ]
    },
    {
        "name": "Briefings in Bioinformatics",
        "year": "2005",
        "info": "Volume 6, 2005",
        "count": 34,
        "papers": [
            "Editorial: Annual progress in bioinformatics.",
            "The many faces of sequence alignment.",
            "Bioinformatics analysis of alternative splicing.",
            "Putting microarrays in a context: Integrated analysis of diverse biological data.",
            "Bioinformatics approaches and resources for single nucleotide polymorphism functional analysis.",
            "A survey of current work in biomedical text mining.",
            "Current efforts in the analysis of RNAi and RNAi target genes.",
            "There is no silver bullet - a guide to low-level data transforms and normalisation methods for microarray data.",
            "Editorial.",
            "Analysis of evolution of exon-intron structure of eukaryotic genes.",
            "Combining microarrays and genetic analysis.",
            "RNAi as a bioinformatics consumer.",
            "Mathematical models of cell cycle regulation.",
            "Evolution of web services in bioinformatics.",
            "VEGA, the genome browser with a difference.",
            "Biomolecular Interaction Network Database.",
            "Editorial.",
            "Hairpins in bookstacks: Information retrieval from biomedical text.",
            "Text mining and ontologies in biomedicine: Making sense of raw text.",
            "Information retrieval and knowledge discovery utilising a biomedical Semantic Web.",
            "Extraction of biological interaction networks from scientific literature.",
            "Online tools to support literature-based discovery in the life sciences.",
            "The next generation of literature analysis: Integration of genomic analysis into text mining.",
            "Get ready to GO! A biologist's guide to the Gene Ontology.",
            "Editorial.",
            "A Bayesian method for analysing spotted microarray data.",
            "Unsupervised pattern recognition: An introduction to the whys and wherefores of clustering microarray data.",
            "Evaluation of biomedical text-mining systems: Lessons learned from information retrieval.",
            "What makes a gene name? Named entity recognition in the biomedical literature.",
            "Software agents in molecular computational biology.",
            "Inferring network interactions within a cell.",
            "WinPop 2.5: Software for representing population genetics phenomena.",
            "Detecting horizontal gene transfer with T-REX and RHOM programs.",
            "Abstracts."
        ]
    },
    {
        "name": "Briefings in Bioinformatics",
        "year": "2004",
        "info": "Volume 5, 2004",
        "count": 36,
        "papers": [
            "Editorial: Building successful biological databases.",
            "Saccharomyces genome database: Underlying principles and organisation.",
            "The Protein Data Bank and lessons in data management.",
            "Biological database design and implementation.",
            "Swiss-Prot: Juggling between evolution and stability.",
            "Globally distributed object identification for biological knowledgebases.",
            "Tutorial section: Domains and motifs - proteins in bite-sized chunks.",
            "Abstracts.",
            "Software review: Analysis for free: Comparing programs for sequence analysis.",
            "News section.",
            "Editorial: The informatics of post-translational modification and its implications for systems biology.",
            "From masking repeats to identifying functional repeats in the mouse transcriptome.",
            "Probabilistic methods of identifying genes in prokaryotic genomes: Connections to the HMM theory.",
            "Computational approaches for the analysis of gene neighbourhoods in prokaryotic genomes.",
            "MEGA3: Integrated software for Molecular Evolutionary Genetics Analysis and sequence alignment.",
            "Bioinformatics for glycomics: Status, methods, requirements and perspectives.",
            "Delineation of modular proteins: Domain boundary prediction from sequence information.",
            "Jemboss reloaded.",
            "Abstracts.",
            "News section.",
            "Editorial.",
            "In silico representation and discovery of transcription factor binding sites.",
            "Comparative genome assembly.",
            "Integrated analysis of the genome and the transcriptome by FANTOM.",
            "Modelling the dynamics of biosystems.",
            "Representing bioinformatics causality.",
            "'We are gathered here today' - EST cluster databases.",
            "Editorial: Stable funding for open source software?",
            "Challenges and prospects in the analysis of large-scale gene expression data.",
            "Biological applications of support vector machines.",
            "Computational aspects of host-parasite phylogenies.",
            "A review of bioinformatics degrees in Australia.",
            "Linkage disequilibrium for different scales and applications.",
            "Genomes, genomes everywhere - but where to browse?",
            "Vector NTI, a balanced all-in-one sequence analysis suite.",
            "The Made-In-Israel Bioinformatics Portal."
        ]
    },
    {
        "name": "Briefings in Bioinformatics",
        "year": "2003",
        "info": "Volume 4, 2003",
        "count": 38,
        "papers": [
            "Editorial: Identity and Interoperability in Bioinformatics.",
            "A Review of Bioinformatics Education in the UK.",
            "The State of the Art of Mammalian Promoter Recognition.",
            "Clustering-based Approaches to Discovering and Visualising Microarray Data Patterns.",
            "Compositional Features of Eukaryotic Genomes for Checking Predicted Genes.",
            "Bioinformatics for Venom and Toxin Sciences.",
            "Current Approaches to Whole Genome Phylogenetic Analysis.",
            "Tutorial section: Biological Sequence Databases.",
            "Abstracts.",
            "News Section.",
            "Editorial.",
            "An Applications-focused Review of Comparative Genomics Tools: Capabilities, Limitations and Future Challenges.",
            "Viewing and Annotating Sequence Data with Artemis.",
            "Comparative Genomics Tools Applied to Bioterrorism Defence.",
            "Making Decisions for Structural Genomics.",
            "Dimensionality and Dependence Problems in Statistical Genomics.",
            "Tutorial Section: Entrez: Making Use of Its Power.",
            "Abstracts.",
            "Software Review: Protein Family Alignment Annotation.",
            "Computational analysis of mutation spectra.",
            "Inferring gene networks from time series microarray data using dynamic Bayesian networks.",
            "Modelling protein functional domains in signal transduction using Maude.",
            "An overview of data models for the analysis of biochemical pathways.",
            "Computational knowledge integration in biopharmaceutical research.",
            "Tutorial section: Hydropathy - A window on the evasion of water.",
            "Abstracts.",
            "Software review: Shopping in the genome market with EnsMart.",
            "News section.",
            "Editorial: Omics research and bioinformatics - joined-up thinking or anarchy?",
            "In silico tools for signal transduction research.",
            "Signal transduction-related bioinformatics services.",
            "Public services from the European Bioinformatics Institute.",
            "In silico prediction of the structure of membrane proteins: Is it feasible?",
            "GeneAnnot: Interfacing GeneCards with high-throughput gene expression compendia.",
            "Tutorial section: Designing microarray oligonucleotide probes.",
            "Abstracts.",
            "Software review: Federating data with Information Integrator.",
            "Book reviews."
        ]
    },
    {
        "name": "Briefings in Bioinformatics",
        "year": "2002",
        "info": "Volume 3, 2002",
        "count": 42,
        "papers": [
            "Editorial: Pathways of bioinformatics - from data to diseases.",
            "Large-scale analysis of gene expression profiles.",
            "The computational challenges of applying comparative-based computational methods to whole genomes.",
            "Algorithmic strategies for the single nucleotide polymorphism haplotype assembly problem.",
            "Functional annotation of proteomic sequences based on consensus of sequence and structural analysis.",
            "Using fold recognition to search for useful proteins: Bayesian approach to fold recognition.",
            "Application of in silico positional cloning and bioinformatic mutation analysis to the study of eye diseases.",
            "The role of quantitative structure-activity relationships (QSAR) in biomolecular discovery.",
            "Emboss opens up sequence analysis.",
            "Short EMBOSS User Guide.",
            "Editorial.",
            "Analytic approaches to twin data using structural equation models.",
            "Emerging bioinformatics for the metabolome.",
            "Genetic association studies: Design, analysis and interpretation.",
            "Information extraction in molecular biology.",
            "Conceptual data modelling for bioinformatics.",
            "Exact mapping of prokaryotic gene starts.",
            "Computer programs for eukaryotic gene prediction.",
            "BLAST and Go?",
            "InterPro: An Integrated Documentation Resource for Protein Families, Domains and Functional Sites.",
            "HMM-based databases in InterPro.",
            "ProDom: Automated Clustering of Homologous Domains.",
            "The PRINTS Database: A Resource for Identification of Protein Families.",
            "PROSITE: A Documented Database Using Patterns and Profiles as Motif Descriptors.",
            "High-quality Protein Knowledge Resource: SWISS-PROT and TrEMBL.",
            "Applications of InterPro in Protein Annotation and Genome Analysis.",
            "The Bio* toolkits - A Brief Preview.",
            "Multiple Sequence Alignment - The Gateway to Further Analysis.",
            "Abstracts.",
            "News section.",
            "Editorial: Bioinformatics and Economics.",
            "BioMOBY: An Open Source Biological Web Services Proposal.",
            "Phase4: Automatic Evaluation of Database Search Methods.",
            "Bioinformatics Training in the USA.",
            "Predicting Protein Subcellular Localisation From Amino Acid Sequence Information.",
            "Global Computing for Bioinformatics.",
            "Technologies for Integrating Biological Data.",
            "Pise: Software for Building Bioinformatics Webs.",
            "Protein.3D Structural Data - Where It Is, and Why We Need It.",
            "Abstracts.",
            "News Section.",
            "A Review of Bioinformatics Education in the UK."
        ]
    },
    {
        "name": "Briefings in Bioinformatics",
        "year": "2001",
        "info": "Volume 2, 2001",
        "count": 30,
        "papers": [
            "Functional Information in SWISS-PROT: the Basis for Large-scale Characterisation of Protein Sequences.",
            "Issues in Predicting Protein Function From Sequence.",
            "Links Between Kinetic Data and Sequences in the Alpha/beta-hydrolases Fold Database.",
            "Protein Function From the Perspective of Molecular Interactions and Genetic Networks.",
            "Making Sense of Score Statistics for Sequence Alignments.",
            "Phenotypic Data in FlyBase.",
            "From Molecular Activities and Processes to Biological Function.",
            "Protein Structure Prediction in Genomics.",
            "Analysis and Comparison of Metabolic Pathway Databases.",
            "A Comparison of Microarray Databases.",
            "The Edinburgh Mouse Atlas: Using the CD.",
            "Large-scale Production of Mouse Phenotypes: the Search for Animal Models for Inherited M. Diseases in Humans.",
            "On the Parallelisation of Bioinformatics Applications.",
            "Editorial: Modelling Cell Systems - The Post-genomic Challenge.",
            "Simultaneous Modelling of Metabolic, Genetic and Product-interaction Networks.",
            "Engineering Virtual Cardiac Tissue.",
            "An Approach to Modelling in Immunology.",
            "Systems Biology: the Reincarnation of Systems Theory Applied in Biology?.",
            "Computational Models of Cells and Tissues: Machines, Agents and Fungal Infection.",
            "Can Correlated Mutations in Protein Domain Families Be Used for Protein Design?",
            "Ontologies of Developmental Anatomy: Their Current and Future Roles.",
            "Gepasi 3.0.",
            "Editorial: The Future of Publishing Microarray Data.",
            "Open Source Software Meets Gene Expression.",
            "Microarray Probe Selection Strategies.",
            "Analysis of CDNA Microarray Images.",
            "Analysis of Large-scale Gene Expression Data.",
            "Exploiting Big Biology: Integrating Large-scale Biological Data for Function Inference.",
            "Allelic Association and Disease Mapping.",
            "Methods for Pattern Discovery in Unaligned Biological Sequences."
        ]
    },
    {
        "name": "Briefings in Bioinformatics",
        "year": "2000",
        "info": "Volume 1, 2000",
        "count": 39,
        "papers": [
            "Editorial.",
            "Wrapping and Interoperating Bioinformatics Resources Using CORBA.",
            "Database Searching with DNA and Protein Sequences: An Introduction.",
            "Computer Prediction of Sites Associated with Various Elements of the Nuclear Matrix.",
            "The Role of Pattern Databases in Sequence Analysis.",
            "Mouse-human Comparative Map Resources on the Web.",
            "Searching the Expressed Sequence Tag (EST) Databases: Panning for Genes.",
            "Mining of Assembled Expressed Sequence Tag (EST) Data for Protein Families: Application to the G Protein-coupled Receptor Superfamily.",
            "Software Review Introduction.",
            "Software Review.",
            "Editorial.",
            "Phylogenetic-evolutionary Approaches to Bioinformatics.",
            "Getting Started with Acedb.",
            "Plant Genome Databases: From References to Inference Tools.",
            "Farm Animal Genome Databases.",
            "Human Sequence Variation and Mutation Databases.",
            "Sensitive Protein Comparisons with Profiles and Hidden Markov Models.",
            "Epitope Scanning Using Virtual Matrix-based Algorithms.",
            "Data Warehousing in Molecular Biology.",
            "Software Review.",
            "Editorial.",
            "Comparing the Success of Different Prediction Software in Sequence Analysis: A Review.",
            "Information Resources for the Bioinformatician.",
            "The Untranslated Regions of Eukaryotic MRNAs: Structure, Function, Evolution and Bioinformatic Tools for Their Analysis.",
            "Proteomic Databases and Software on the Web.",
            "Prediction and Phylogenetic Analysis of Mammalian Short Interspersed Elements (SINEs).",
            "Protein Structure Prediction Methods for Drug Design.",
            "Tuberculosis Vaccine Design: Influence of the Completed Genome Sequence.",
            "Visualising Gene Expression in Its Metabolic Context.",
            "Software Review Exploring Protein Domain Structure.",
            "Editorial.",
            "Discriminant Analysis and Its Application in DNA Sequence Motif Recognition.",
            "Prediction of Exact Boundaries of Exons.",
            "Comparative Analysis of Regulatory Patterns in Bacterial Genomes.",
            "Identification and Functional Modelling of DNA Sequence Elements of Transcription.",
            "Genome Sequence Comparisons: Hurdles in the Fast Lane to Functional Genomics.",
            "Arabidopsis Genome Analysis As Exemplified By Analysis of Chromosome 4.",
            "Ontology-based Knowledge Representation for Bioinformatics.",
            "Software Review HOBACGEN: Homologous Bacterial Genes Database."
        ]
    }
]