[
    {
        "year": "2019",
        "name": "14th COSIT 2019",
        "info": "Regensburg, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/cosit/2019",
                "sub_name": "14th International Conference on Spatial Information Theory, COSIT 2019, September 9-13, 2019, Regensburg, Germany.",
                "count": 29,
                "papers": [
                    "Front Matter, Table of Contents, Preface, Conference Organization.",
                    "Human Vision at a Glance (Invited Talk).",
                    "Smartphone Usability for Emergency Evacuation Applications (Short Paper).",
                    "Functional Scales in Assisted Wayfinding (Short Paper).",
                    "Representation of Interdependencies Between Urban Networks by a Multi-Layer Graph (Short Paper).",
                    "Route Choice Through Regions by Pedestrian Agents (Short Paper).",
                    "Modeling and Representing Real-World Spatio-Temporal Data in Databases (Vision Paper).",
                    "Towards a Qualitative Reasoning on Shape Change and Object Division.",
                    "Reproducible Research in Geoinformatics: Concepts, Challenges and Benefits (Vision Paper).",
                    "Cross-Corpora Analysis of Spatial Language: The Case of Fictive Motion (Short Paper).",
                    "Talk of the Town: Discovering Open Public Data via Voice Assistants (Short Paper).",
                    "Detecting the Geospatialness of Prepositions from Natural Language Text (Short Paper).",
                    "Initial Analysis of Simple Where-Questions and Human-Generated Answers (Short Paper).",
                    "Spatial Information Theory and Construction Informatics - a Fruitful Symbiosis (Invited Talk).",
                    "A Case for Geographic Masses.",
                    "Formal Qualitative Spatial Augmentation of the Simple Feature Access Model.",
                    "Why Classificatory Information of Geographic Regions Is Quantum Information (Vision Paper).",
                    "The Language of Architectural Diagrams.",
                    "Enabling the Discovery of Thematically Related Research Objects with Systematic Spatializations.",
                    "The Future of Geographic Information Displays from GIScience, Cartographic, and Cognitive Science Perspectives (Vision Paper).",
                    "Twenty-Five Years of COSIT: A Brief and Tasty History (Invited Talk).",
                    "Perception of Space in Virtual and Augmented Reality (Invited Talk).",
                    "Planning and Explanations with a Learned Spatial Model.",
                    "Schematic Maps and Indoor Wayfinding.",
                    "Dyadic Route Planning and Navigation in Collaborative Wayfinding.",
                    "Assessing Spatial Information in Physical Environments (Short Paper).",
                    "lambdaProlog(QS): Functional Spatial Reasoning in Higher Order Logic Programming (Short Paper).",
                    "Towards Modeling Geographical Processes with Generative Adversarial Networks (GANs) (Short Paper).",
                    "Granular Spatial Calculi of Relative Directions or Movements with Parallelism: Consistent Account (Short Paper)."
                ]
            },
            {
                "sub_name_abbr": "conf/cosit/2019sol",
                "sub_name": "Proceedings of the Workshop on Speaking of Location 2019: Communicating about Space co-located with 14th International Conference on Spatial Information Theory (COSIT 2019), Regensburg, Germany, September 9-13, 2019.",
                "count": 9,
                "papers": [
                    "Speaking of Location: Communicating about Space with Geospatial Natural Language.",
                    "Bounded Space and Stratified Reference: A Look at Malayalam Directional Markers.",
                    "Geospatial Natural Language in Indigenous Australia: Research Priorities.",
                    "Modeling of Human Mental-Image Based Understanding of Spatiotemporal Language for Intuitive Human-Robot Interaction.",
                    "Investigating the Dimensions of Spatial Language.",
                    "Semi-automatic Description of Named Rivers and Bays for their Representation in a Terminological Knowledge Base.",
                    "Suggestion Sequences during Route Planning.",
                    "The Use of the Word \"Through\" in an Indoor Environment.",
                    "Natural-Language Scene Descriptions for Accessible Non-Visual Museum Exhibit Exploration and Engagement."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "13th COSIT 2017",
        "info": "L'Aquila, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/cosit/2017",
                "sub_name": "13th International Conference on Spatial Information Theory, COSIT 2017, September 4-8, 2017, L'Aquila, Italy.",
                "count": 23,
                "papers": [
                    "Front Matter, Table of Contents, Preface, Organization, List of Authors.",
                    "The Logic of Discrete Qualitative Relations.",
                    "A New Perspective on the Mereotopology of RCC8.",
                    "A Qualitative Spatial Descriptor of Group-Robot Interactions.",
                    "An Efficient Representation of General Qualitative Spatial Information Using Bintrees.",
                    "Towards a Quantum Theory of Geographic Fields.",
                    "Urban Artefacts and Their Social Roles: Towards an Ontology of Social Practices.",
                    "An Ontological Framework for Characterizing Hydrological Flow Processes.",
                    "Classification, Individuation and Demarcation of Forests: Formalising the Multi-Faceted Semantics of Geographic Terms.",
                    "Sense of Direction: One or Two Dimensions?.",
                    "How Subdimensions of Salience Influence Each Other. Comparing Models Based on Empirical Data.",
                    "Evidence-Based Parametric Design: Computationally Generated Spatial Morphologies Satisfying Behavioural-Based Design Constraints.",
                    "Targeted Cognitive Training of Spatial Skills: Perspective Taking in Robot Teleoperation.",
                    "What Makes the Difference When Learning Spatial Information Using Language? The Contribution of Visuo-Spatial Individual Factors.",
                    "Cities Untangled: Uncovering Order in Arterial Skeletons of Road Maps.",
                    "Uncertainty in Wayfinding: A Conceptual Framework and Agent-Based Model.",
                    "Timing of Pedestrian Navigation Instructions.",
                    "On Avoiding Traffic Jams with Dynamic Self-Organizing Trip Planning.",
                    "Global Landmarks in a Complex Indoor Environment.",
                    "A Crowdsourced Model of Landscape Preference.",
                    "Juxtaposing Thematic Regions Derived from Spatial and Platial User-Generated Content.",
                    "Using Flickr for Characterizing the Environment: An Exploratory Analysis.",
                    "Defining Local Experts: Geographical Expertise as a Basis for Geographic Information Quality."
                ]
            },
            {
                "sub_name_abbr": "conf/cosit/2017wp",
                "sub_name": "Proceedings of Workshops and Posters at the 13th International Conference on Spatial Information Theory, COSIT 2017, September 4-8, 2017, L'Aquila, Italy.",
                "count": 52,
                "papers": [
                    "COSIT 2017 Short Papers - Introduction.",
                    "Generating Spatial Footprints from Hiking Blogs.",
                    "Validating GEOBIA Based Terrain Segmentation and Classification for Automated Delineation of Cognitively Salient Landforms.",
                    "Boundary Based Navigation Is Impaired in Old Age.",
                    "Distributing Attention Between Environment and Navigation System to Increase Spatial Knowledge Acquisition During Assisted Wayfinding.",
                    "Lake District Soundscapes: Analysing Aural Experience Through Text.",
                    "Do Skyscrapers Facilitate Spatial Learning Under Stress? On the Cognitive Processing of Global Landmarks.",
                    "The Virtual Reconstruction Project of Unavailable Monuments: An Example of the Church of Santa Maria Paganica in L'Aquila.",
                    "Socio-spatial Networks, Multilingualism, and Language Use in a Rural African Context.",
                    "Reactive Obstacle Avoidance for Multicopter UAVs via Evaluation of Depth Maps.",
                    "New and Given Information in Alpine Route Directions.",
                    "Defining Spatial Boundaries: A Developmental Study.",
                    "Artificial Cognitive Maps: Selecting Heterogeneous Sets of Geographic Objects and Relations to Drive Highly Contextual Task-Oriented Map Views.",
                    "Categorizing Cognitive Scales of Spatial Information.",
                    "The Concept of Location in Astronomic Spaces.",
                    "Is Wireless Functional Near-Infrared Spectroscopy (fNIRS) 3D Neuroimaging Feasible to Map Human Navigation in the Real-World?",
                    "The Influence of the Web Mercator Projection on the Global-Scale Cognitive Map of Web Map Users.",
                    "Spatial Navigation by Boundaries and Landmarks in Williams Syndrome in a Virtual Environment.",
                    "Linked Data for a Digital Earth: Spatial Forecasting with Next Generation Geographical Data.",
                    "Route Learning from Maps or Navigation in Aging: The Role of Visuo-Spatial Abilities and Self-assessed Visuo-Spatial Inclinations.",
                    "Towards Personalized Landmarks.",
                    "Developing and Evaluating VR Field Trips.",
                    "A Reference Landform Ontology for Automated Delineation of Depression Landforms from DEMs.",
                    "Correspondence Between PLCA and Maptree: Representations of a Space Configuration.",
                    "Building Social Networks in Volunteered Geographic Information Communities: What Contributor Behaviours Reveal About Crowdsourced Data Quality.",
                    "Guiding People Along More Intuitive Indoor Paths.",
                    "Context and Vagueness in Automated Interpretation of Place Description: A Computational Model.",
                    "Modeling Spatio-Temporal Variations for the Language-Driven Development of Simulated Environment Generators.",
                    "Rethinking Wayfinding Support Systems - Introduction.",
                    "Supporting Orientation During Indoor and Outdoor Navigation.",
                    "Let's Put the Skyscrapers on the Display - Decoupling Spatial Learning from Working Memory.",
                    "Finding the Right Match: Human Cognition via Indoor Route Descriptions Versus Existing Indoor Networks and Algorithms to Support Navigation.",
                    "Considering Existing Indoor Navigational Aids in Navigation Services.",
                    "Speaking of Location: Future Directions in Geospatial Natural Language Research - Introduction.",
                    "Socioculturally Mediated Responses to Environment Shaping Universals and Diversity in Spatial Language.",
                    "Translating Verbally Communicated Local Geographic Knowledge Using Semantic Technologies: A Balinese Example.",
                    "Place as Location Categories: Learning from Language.",
                    "Frame-Relative Constructions in the Description of Motion.",
                    "When Environmental Information Is Conveyed Using Descriptions: The Role of Perspectives and Strategies.",
                    "The Role of Context in the Interpretation of Natural Language Location Descriptions.",
                    "Spatial Prepositions in Natural-Language Descriptions of Indoor Scenes.",
                    "Spatial Humanities Meets Spatial Information Theory: Space, Place, and Time in Humanities Research - Introduction.",
                    "Exploring Deep Mapping Concepts: Crosthwaite's Map and West's Picturesque Stations.",
                    "A Spatio-Temporal Linked Data Representation for Modeling Spatio-Temporal Dialect Data.",
                    "Considering Identification of Locality in Time: Theoretical and Practical Approach.",
                    "Cadmus and the Cow: A Digital Narratology of Space in Ovid's Metamorphoses.",
                    "Computing Techniques for Spatio-Temporal Data in Archaeology and Cultural Heritage - Introduction.",
                    "Immersive Technologies and Experiences for Archaeological Site Exploration and Analysis.",
                    "HBIM for the Archaeology of Standing Buildings: Case Study of the Church of San Cipriano in Castelvecchio Calvisio (L'Aquila, Italy).",
                    "An Analytical Framework for Classifying Software Tools and Systems Dealing with Cultural Heritage Spatio-Temporal Information.",
                    "Considering Rich Spatiotemporal Relationships in Cultural Heritage Information Management.",
                    "Towards the Extraction of Semantics from Incomplete Archaeological Records."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "12th COSIT 2015",
        "info": "Santa Fe, NM, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/cosit/2015",
                "sub_name": "Spatial Information Theory - 12th International Conference, COSIT 2015, Santa Fe, NM, USA, October 12-16, 2015, Proceedings.",
                "count": 22,
                "papers": [
                    "Outline of a Formal Theory of Processes and Events, and Why GIScience Needs One.",
                    "Extracting Causal Rules from Spatio-Temporal Data.",
                    "Modelling Spatial Structures.",
                    "Strong Spatial Cognition.",
                    "A Conceptual Quality Framework for Volunteered Geographic Information.",
                    "A Coq-Based Axiomatization of Tarski's Mereogeometry.",
                    "Shape Similarity Based on the Qualitative Spatial Reasoning Calculus eOPRAm.",
                    "From Metric to Topology: Determining Relations in Discrete Space.",
                    "Where Snow is a Landmark: Route Direction Elements in Alpine Contexts.",
                    "Spatial Natural Language Generation for Location Description in Photo Captions.",
                    "More Than a List: What Outdoor Free Listings of Landscape Categories Reveal About Commonsense Geographic Concepts and Memory Search Strategies.",
                    "Identifying the Geographical Scope of Prohibition Signs.",
                    "Conceptualizing Landscap - A Comparative Study of Landscape Categories with Navajo and English-Speaking Participants.",
                    "Citizen Science Land Cover Classification Based on Ground and Aerial Imagery.",
                    "Swiss Canton Regions: A Model for Complex Objects in Geographic Partitions.",
                    "Spatial Symmetry Driven Pruning Strategies for Efficient Declarative Spatial Reasoning.",
                    "On Distributive Subalgebras of Qualitative Spatial and Temporal Calculi.",
                    "What is in a Contour Map? - A Region-Based Logical Formalization of Contour Semantics.",
                    "Learning Spatial Models for Navigation.",
                    "Defensive Wayfinding: Incongruent Information in Route Following.",
                    "A Wayfinding Grammar Based on Reference System Transformations.",
                    "Quantifying the Significance of Semantic Landmarks in Familiar and Unfamiliar Environments."
                ]
            },
            {
                "sub_name_abbr": "conf/cosit/2015tstip",
                "sub_name": "Proceedings of the Workshop on Teaching Spatial Thinking from Interdisciplinary Perspectives, TSTIP 2015, co-located with Conference on Spatial Information Theory XII (COSIT 2015), Santa Fe, New Mexico, USA, October 12, 2015.",
                "count": 8,
                "papers": [
                    "Teaching Spatial Thinking from Interdisciplinary Perspective Workshop.",
                    "Crowdsourcing Spatial Thinking Resources across Disciplines and Educational Contexts.",
                    "Teaching Spatial Thinking, Computer Vision, and Qualitative Reasoning Methods.",
                    "Exploration of \"What-If\" Scenarios: A Prototype for Research Buildings at Stanford's School of Medicine.",
                    "Teaching the Complexities of Map Boundaries.",
                    "Thinking about Spatial Computing.",
                    "Spatial Thinking and GIS.",
                    "Teaching Spatial Thinking: Perspectives from Cognitive Psychology."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "11th COSIT 2013",
        "info": "Scarborough, UK",
        "venues": [
            {
                "sub_name_abbr": "conf/cosit/2013",
                "sub_name": "Spatial Information Theory - 11th International Conference, COSIT 2013, Scarborough, UK, September 2-6, 2013. Proceedings.",
                "count": 28,
                "papers": [
                    "Spatial Primitives from a Cognitive Perspective: Sensitivity to Changes in Various Geometric Properties.",
                    "Transitional Spaces: Between Indoor and Outdoor Spaces.",
                    "Representing and Reasoning about Changing Spatial Extensions of Geographic Features.",
                    "Trust and Reputation Models for Quality Assessment of Human Sensor Observations.",
                    "Using Maptrees to Characterize Topological Change.",
                    "Resolving Conceptual Mode Confusion with Qualitative Spatial Knowledge in Human-Robot Interaction.",
                    "Event Recognition during the Exploration of Line-Based Graphics in Virtual Haptic Environments.",
                    "Cognitive Transactions - A Communication Model.",
                    "Strategy-Based Dynamic Real-Time Route Prediction.",
                    "An Affordance-Based Simulation Framework for Assessing Spatial Suitability.",
                    "A Probabilistic Framework for Object Descriptions in Indoor Route Instructions.",
                    "Linked Data and Time - Modeling Researcher Life Lines by Events.",
                    "Human Spatial Behavior, Sensor Informatics, and Disaggregate Data.",
                    "Comparing Expert and Non-expert Conceptualisations of the Land: An Analysis of Crowdsourced Land Cover Data.",
                    "The Meanings of the Generic Parts of Toponyms: Use and Limitations of Gazetteers in Studies of Landscape Terms.",
                    "Creating a Corpus of Geospatial Natural Language.",
                    "From Descriptions to Depictions: A Conceptual Framework.",
                    "Reading Geography between the Lines: Extracting Local Place Knowledge from Text.",
                    "Modeling Spatial Knowledge from Verbal Descriptions.",
                    "A Computational Model for Reference Object Selection in Spatial Relations.",
                    "Fundamental Cognitive Concepts of Space (and Time): Using Cross-Linguistic, Crowdsourced Data to Cognitively Calibrate Modes of Overlap.",
                    "Kinds of Full Physical Containment.",
                    "A Vocabulary of Topological and Containment Relations for a Practical Biological Ontology.",
                    "A Geo-ontology Design Pattern for Semantic Trajectories.",
                    "RCC and the Theory of Simple Regions in ℝ2.",
                    "The Logic of NEAR and FAR.",
                    "The Topology of Spatial Scenes in ℝ2.",
                    "Algebraic Properties of Qualitative Spatio-temporal Calculi."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "10th COSIT 2011",
        "info": "Belfast, ME, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/cosit/2011",
                "sub_name": "Spatial Information Theory - 10th International Conference, COSIT 2011, Belfast, ME, USA, September 12-16, 2011. Proceedings.",
                "count": 23,
                "papers": [
                    "How Do Decision Time and Realism Affect Map-Based Decision Making?",
                    "Towards Cognitively Plausible Spatial Representations for Sketch Map Alignment.",
                    "Scalable Navigation Support for Crowds: Personalized Guidance via Augmented Signage.",
                    "Information on the Consequence of a Move and Its Use for Route Improvisation Support.",
                    "The Effect of Activity on Relevance and Granularity for Navigation.",
                    "I Can Tell by the Way You Use Your Walk: Real-Time Classification of Wayfinding Performance.",
                    "From Video to RCC8: Exploiting a Distance Based Semantics to Stabilise the Interpretation of Mereotopological Relations.",
                    "Decentralized Reasoning about Gradual Changes of Topological Relationships between Continuously Evolving Regions.",
                    "Spatio-temporal Evolution as Bigraph Dynamics.",
                    "On Optimal Arrangements of Binary Sensors.",
                    "A Hybrid Geometric-Qualitative Spatial Reasoning System and Its Application in GIS.",
                    "CLP(QS): A Declarative Spatial Reasoning Framework.",
                    "The Social Connection in Mental Representations of Space: Explicit and Implicit Evidence.",
                    "Revisiting the Plasticity of Human Spatial Cognition.",
                    "Linguistic and Cultural Universality of the Concept of Sense-of-Direction.",
                    "Towards a Formalization of Social Spaces for Socially Aware Robots.",
                    "Finite Relativist Geometry Grounded in Perceptual Operations.",
                    "Linking Spatial Haptic Perception to Linguistic Representations: Assisting Utterances for Tactile-Map Explorations.",
                    "Analyzing the Spatial-Semantic Interaction of Points of Interest in Volunteered Geographic Information.",
                    "A Model of Spatial Reference Frames in Language.",
                    "Universality, Language-Variability and Individuality: Defining Linguistic Building Blocks for Spatial Relations.",
                    "The Semantics of Farsi be: Applying the Principled Polysemy Model.",
                    "On the Explicit and Implicit Spatiotemporal Architecture of Narratives of Personal Experience."
                ]
            },
            {
                "sub_name_abbr": "conf/cosit/2011upsm",
                "sub_name": "Understanding and Processing Sketch Maps - Proceedings of the COSIT 2011 Workshop, Belfast, Maine, USA, September 2011.",
                "count": 6,
                "papers": [
                    "Sketch Mapping and Geographie Knowledge: What Role for Drawing Ability?",
                    "A System for Automatic Localization and Recognition of Sketch Map Objects.",
                    "Managing Qualitative Spatial Information to Support Query-by-Sketch.",
                    "Performance of Directional Estimates and Route Sketching: What Differentiates and What Predicts?",
                    "The Use of Sketch Maps as a Basis for Measures of Spatial Knowledge.",
                    "Using SparQ for Matching Sketch Maps."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "9th COSIT 2009",
        "info": "Aber Wrac'h, France",
        "venues": [
            {
                "sub_name_abbr": "conf/cosit/2009",
                "sub_name": "Spatial Information Theory, 9th International Conference, COSIT 2009, Aber Wrac'h, France, September 21-25, 2009, Proceedings.",
                "count": 30,
                "papers": [
                    "A Conceptual Model of the Cognitive Processing of Environmental Distance Information.",
                    "Spatial Cognition of Geometric Figures in the Context of Proportional Analogies.",
                    "Are Places Concepts? Familarity and Expertise Effects in Neighborhood Cognition.",
                    "A Metric Conceptual Space Algebra.",
                    "Grounding Geographic Categories in the Meaningful Environment.",
                    "Terabytes of Tobler: Evaluating the First Law in a Massive, Domain-Neutral Representation of World Knowledge.",
                    "Merging Qualitative Constraint Networks Defined on Different Qualitative Formalisms.",
                    "Semi-automated Derivation of Conceptual Neighborhood Graphs of Topological Relations.",
                    "Exploiting Qualitative Spatial Constraints for Multi-hypothesis Topological Map Learning.",
                    "Comparing Relations with a Multi-holed Region.",
                    "The Endpoint Hypothesis: A Topological-Cognitive Assessment of Geographic Scale Movement Patterns.",
                    "Evaluating the Effectiveness and Efficiency of Visual Variables for Geographic Information Visualization.",
                    "SeaTouch: A Haptic and Auditory Maritime Environment for Non Visual Cognitive Mapping of Blind Sailors.",
                    "Assigning Footprints to Dot Sets: An Analytical Survey.",
                    "Mental Tectonics - Rendering Consistent µMaps.",
                    "To Be and Not To Be: 3-Valued Relations on Graphs.",
                    "Map Algebraic Characterization of Self-adapting Neighborhoods.",
                    "Scene Modelling and Classification Using Learned Spatial Relations.",
                    "A Qualitative Approach to Localization and Navigation Based on Visibility Information.",
                    "Showing Where To Go by Maps or Pictures: An Empirical Case Study at Subway Exits.",
                    "The Abduction of Geographic Information Science: Transporting Spatial Reasoning to the Realm of Purpose and Design.",
                    "An Algebraic Approach to Image Schemas for Geographic Space.",
                    "Spatio-terminological Inference for the Design of Ambient Environments.",
                    "Defining Spatial Entropy from Multivariate Distributions of Co-occurrences.",
                    "Case-Based Reasoning for Eliciting the Evolution of Geospatial Objects.",
                    "Composing Models of Geographic Physical Processes.",
                    "Decentralized Time Geography for Ad-Hoc Collaborative Planning.",
                    "Adaptable Path Planning in Regionalized Environments.",
                    "An Analysis of Direction and Motion Concepts in Verbal Descriptions of Route Choices.",
                    "The Role of Angularity in Route Choice."
                ]
            }
        ]
    },
    {
        "year": "2007",
        "name": "8th COSIT 2007",
        "info": "Melbourne, Australia",
        "venues": [
            {
                "sub_name_abbr": "conf/cosit/2007",
                "sub_name": "Spatial Information Theory, 8th International Conference, COSIT 2007, Melbourne, Australia, September 19-23, 2007, Proceedings.",
                "count": 27,
                "papers": [
                    "Progress on Yindjibarndi Ethnophysiography.",
                    "Study of Cultural Impacts on Location Judgments in Eastern China.",
                    "Cross-Cultural Similarities in Topological Reasoning.",
                    "Thalassographeïn: Representing Maritime Spaces in Ancient Greece.",
                    "From Top-Level to Domain Ontologies: Ecosystem Classifications as a Case Study.",
                    "Semantic Categories Underlying the Meaning of 'Place'.",
                    "Spatial Semantics in Difference Spaces.",
                    "Evaluation of a Semantic Similarity Measure for Natural Language Spatial Relations.",
                    "Affordance-Based Similarity Measurement for Entity Types.",
                    "An Image-Schematic Account of Spatial Categories.",
                    "Specifying Essential Features of Street Networks.",
                    "Spatial Information Extraction for Cognitive Mapping with a Mobile Robot.",
                    "Spatial Mapping and Map Exploitation: A Bio-inspired Engineering Perspective.",
                    "Scale-Dependent Simplification of 3D Building Models Based on Cell Decomposition and Primitive Instancing.",
                    "Degradation in Spatial Knowledge Acquisition When Using Automatic Navigation Systems.",
                    "Stories as Route Descriptions.",
                    "Three Sampling Methods for Visibility Measures of Landscape Perception.",
                    "Reasoning on Spatial Semantic Integrity Constraints.",
                    "Spatial Reasoning with a Hole.",
                    "Geospatial Cluster Tessellation Through the Complete Order- k Voronoi Diagrams.",
                    "Drawing a Figure in a Two-Dimensional Plane for a Qualitative Representation.",
                    "Linguistic and Nonlinguistic Turn Direction Concepts.",
                    "A Uniform Handling of Different Landmark Types in Route Directions.",
                    "Effects of Geometry, Landmarks and Orientation Strategies in the 'Drop-Off' Orientation Task.",
                    "Data Quality Ontology: An Ontology for Imperfect Knowledge.",
                    "Triangulation of Gradient Polygons: A Spatial Data Model for Categorical Fields.",
                    "Relations in Mathematical Morphology with Applications to Graphs and Rough Sets."
                ]
            }
        ]
    },
    {
        "year": "2005",
        "name": "7th COSIT 2005",
        "info": "Ellicottville, NY, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/cosit/2005",
                "sub_name": "Spatial Information Theory, International Conference, COSIT 2005, Ellicottville, NY, USA, September 14-18, 2005, Proceedings.",
                "count": 32,
                "papers": [
                    "Anchoring: A New Approach to Handling Indeterminate Location in GIS.",
                    "Gradation and Map Analysis in Area-Class Maps.",
                    "Simulation of Obfuscation and Negotiation for Location Privacy.",
                    "Investigating the Need for Eliminatory Constraints in the User Interface of Bicycle Route Planners.",
                    "Path Memory in Real-World and Virtual Settings.",
                    "Shortest Path Search from a Physical Perspective.",
                    "Operationalising 'Sense of Place' as a Cognitive Operator for Semantics in Place-Based Ontologies.",
                    "Data-Driven Matching of Geospatial Schemas.",
                    "The Role of Spatial Relations in Automating the Semantic Annotation of Geodata.",
                    "Anatomical Information Science.",
                    "Matching Names and Definitions of Topological Operators.",
                    "Spatial Relations Between Classes of Individuals.",
                    "Casl Specifications of Qualitative Calculi.",
                    "A Spatial Form of Diversity.",
                    "Structure and Semantics of Arrow Diagrams.",
                    "Cognitive Maps Are over 60.",
                    "Categorical Methods in Qualitative Reasoning: The Case for Weak Representations.",
                    "On Internal Cardinal Direction Relations.",
                    "Dynamic Collectives and Their Collective Dynamics.",
                    "A Linguistics-Based Framework for Modeling Spatio-temporal Occurrences and Purposive Change.",
                    "Ordering Events for Dynamic Geospatial Domains.",
                    "Structural Salience of Landmarks for Route Directions.",
                    "Expert and Non-expert Knowledge of Loosely Structured Environments.",
                    "Landmark Extraction: A Web Mining Approach.",
                    "Satellite Images - A Source for Social Scientists? On Handling Multiple Conceptualisations of Space in Geographical Information Systems.",
                    "3D Topographic Data Modelling: Why Rigidity Is Preferable to Pragmatism.",
                    "Morse-Smale Decompositions for Modeling Terrain Knowledge.",
                    "2D-3D MultiAgent GeoSimulation with Knowledge-Based Agents of Customers' Shopping Behavior in a Shopping Mall.",
                    "Memory for Spatial Location: Influences of Environmental Cues and Task Field Rotation.",
                    "Network and Psychological Effects in Urban Movement.",
                    "Probabilistic Techniques for Mobile Robot Navigation.",
                    "Spatial Language, Spatial Thought: Parallels in Path Structure."
                ]
            }
        ]
    },
    {
        "year": "2003",
        "name": "6th COSIT 2003",
        "info": "Ittingen, Switzerland",
        "venues": [
            {
                "sub_name_abbr": "conf/cosit/2003",
                "sub_name": "Spatial Information Theory. Foundations of Geographic Information Science, International Conference, COSIT 2003, Ittingen, Switzerland, September 24-28, 2003, Proceedings.",
                "count": 26,
                "papers": [
                    "Desiderata for a Spatio-temporal Geo-ontology.",
                    "Scale in Object and Process Ontologies.",
                    "Landscape Categories in Yindjibarndi: Ontology, Environment, and Language.",
                    "Layers: A New Approach to Locating Objects in Space.",
                    "Spatial Reasoning about Relative Orientation and Distance for Robot Exploration.",
                    "Structuring a Wayfinder's Dynamic Space-Time Environment.",
                    "Systematic Distortions in Cognitive Maps: The North American West Coast vs. the (West) Coast of Israel.",
                    "Tripartite Line Tracks Qualitative Curvature Information.",
                    "Linearized Terrain: Languages for Silhouette Representations.",
                    "Maintaining Spatial Relations in an Incremental Diagrammatic Reasoner.",
                    "MAGS Project: Multi-agent GeoSimulation and Crowd Simulation.",
                    "\"Simplest\" Paths: Automated Route Selection for Navigation.",
                    "A Classification Framework for Approaches to Achieving Semantic Interoperability between GI Web Services.",
                    "Relative Adjacencies in Spatial Pseudo-Partitions.",
                    "A Geometry for Places: Representing Extension and Extended Objects.",
                    "Intuitive Modelling of Place Name Regions for Spatial Information Retrieval.",
                    "Convexity in Discrete Space.",
                    "Stratified Rough Sets and Vagueness.",
                    "Communicating Vague Spatial Concepts in Human-GIS Interactions: A Collaborative Dialogue Approach.",
                    "Wayfinding Choremes.",
                    "Testing the First Law of Cognitive Geography on Point-Display Spatializations.",
                    "Constructing Semantically Scalable Cognitive Spaces.",
                    "Route Adaptive Selection of Salient Features.",
                    "Referring to Landmark or Street Information in Route Directions: What Difference Does It Make?",
                    "Extracting Landmarks with Data Mining Methods.",
                    "Visual Attention during Route Learning: A Look at Selection and Engagement."
                ]
            }
        ]
    },
    {
        "year": "2001",
        "name": "5th COSIT 2001",
        "info": "Morro Bay, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/cosit/2001",
                "sub_name": "Spatial Information Theory: Foundations of Geographic Information Science, International Conference, COSIT 2001, Morro Bay, CA, USA, September 19-23, 2001, Proceedings.",
                "count": 33,
                "papers": [
                    "A Geographer Looks at Spatial Information Theory.",
                    "True Grid.",
                    "A Taxonomy of Granular Partitions.",
                    "A Geometric Theory of Vague Boundaries Based on Supervaluation.",
                    "When Tables Tell It All: Qualitative Spatial and Temporal Reasoning Based on Linear Orderings.",
                    "Computational Structure in Three-Valued Nearness Relations.",
                    "Qualitative Spatio-Temporal Continuity.",
                    "Application of Supervaluation Semantics to Vaguely Defined Spatial Concepts.",
                    "Spatial and Cognitive Simulation with Multi-agent Systems.",
                    "A Virtual Test Bed in Support of Cognitively-Aware Geomatics Technologies.",
                    "Evaluating the Usability of the Scale Metaphor for Querying Semantic Spaces.",
                    "A Semantic Map as Basis for the Decision Process in the www Navigation.",
                    "Pragmatism and Spatial Layout Design.",
                    "Spatial Frames of Reference Used in Identifying Direction of Movement: An Unexpected Turn.",
                    "The Role of a Self-Reference System in Spatial Navigation.",
                    "The Utility of Global Representations in a Cognitive Map.",
                    "How Spoken Language and Signed Language Structure Space Differently.",
                    "Two Path Prepositions: Along and Past.",
                    "Ambiguity in Acquiring Spatial Representation from Descriptions Compared to Depictions: The Role of Spatial Orientation.",
                    "When and Why Are Visual Landmarks Used in Giving Directions?",
                    "Recognition of Abstract Regions in Cartographic Maps.",
                    "Geographical Information Retrieval with Ontologies of Place.",
                    "Qualitative Spatial Representation for Information Retrieval by Gazetteers.",
                    "Spatial Representation and Updating: Evidence from Neuropsychological Investigations.",
                    "Mental Processing of Geographic Knowledge.",
                    "Spatial Cognition and the Processing of Verticality in Underground Environments.",
                    "Grid Patterns and Cultural Expectations in Urban Wayfinding.",
                    "The House Is North of the River: Relative Localization of Extended Objects.",
                    "Double-Crossing: Decidability and Computational Complexity of a Qualitative Calculus for Navigation.",
                    "Spatial Reasoning: No Need for Visual Information.",
                    "A Formal Theory of Objects and Fields.",
                    "What's in an Image?",
                    "Features, Objects, and Other Things: Ontological Distinctions in the Geographic Domain."
                ]
            }
        ]
    },
    {
        "year": "1999",
        "name": "4th COSIT 1999",
        "info": "Stade, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/cosit/1999",
                "sub_name": "Spatial Information Theory: Cognitive and Computational Foundations of Geographic Information Science, International Conference COSIT '99, Stade, Germany, August 25-29, 1999, Proceedings.",
                "count": 30,
                "papers": [
                    "Large-Scale Navigation: The Insect Case.",
                    "Route Navigation Using Motion Analysis.",
                    "The Nature of Landmarks for Real and Electronic Spaces.",
                    "Pictorial and Verbal Tools for Conveying Routes.",
                    "Elements of Good Route Directions in Familiar and Unfamiliar Environments.",
                    "The Production of Route Instructions in Underground and Urban Environments.",
                    "One Step up the Abstraction Ladder: Combining Algebras - From Functional Pieces to a Whole.",
                    "Formalizing Regions in the Spatial Semantic Hierarchy: An AH-Graphs Implementation Approach.",
                    "Abstraction, Levels of Detail, and Hierarchies in Map Series.",
                    "Topological Relations in Hierarchical Partitions.",
                    "A Predication Calculus for Qualitative Spatial Representations.",
                    "Simple Models for Simple Calculi.",
                    "Terminological Default Reasoning about Spatial Information: A First Step.",
                    "Reasoning about Cardinal Directions Using Grids as Qualitative Geographic Coordinates.",
                    "The Role of Identity Conditions in Ontology Design.",
                    "Atomicity vs. Infinite Divisibility of Space.",
                    "The Mereotopology of Discrete Space.",
                    "Agglomerations.",
                    "Ontology and Geographic Objects: An Empirical Study of Cognitive Categorization.",
                    "Modes of Connection.",
                    "Representation and Reasoning about Shapes: Cognitive and Computational Studies in Visual Reasoning in Design.",
                    "An Algebraic Interpretation of Semantic Networks.",
                    "Data Characterization Schema for Intelligent Support in Visual Data Analysis.",
                    "Recognition-Triggered Response and the View-Graph Approach to Spatial Cognition.",
                    "A Formal Model of the Process of Wayfinding in Built Environments.",
                    "A Spatial Model Based on the Notions of Spatial Conceptual Map and of Object's Influence Areas.",
                    "Granulation for Graphs.",
                    "On Ontology and Epistemology of Rough Location.",
                    "Qualitative Spatial Representation for Situational Awareness and Spatial Decision Support.",
                    "Qualitative Motion Representation in Egocentric and Allocentric Frames of Reference."
                ]
            }
        ]
    },
    {
        "year": "1997",
        "name": "3rd COSIT 1997",
        "info": "Laurel Highlands, Pennsylvania, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/cosit/1997",
                "sub_name": "Spatial Information Theory: A Theoretical Basis for GIS, International Conference COSIT '97, Laurel Highlands, Pennsylvania, USA, October 15-18, 1997, Proceedings.",
                "count": 38,
                "papers": [
                    "Continuous Change in Spatial Region.",
                    "Qualitative Representation of Change.",
                    "Image-Schemata-Based Spatial Inferences: The Container-Surface Algebra.",
                    "A City Metaphor to Support Navigation in Complex Information Spaces.",
                    "Using Hierarchical Spatial Data Structures for Hierarchical Spatial Reasoning.",
                    "Structuring Space with Image Schemata: Wayfinding in Airports as a Case Study.",
                    "Fiat and Bona Fide Boundaries: Towards on Ontology of Spatially Extended Objects.",
                    "A Representation-Oriented Taxonomy of Gradation.",
                    "Classification as an Impediment to Reliable and Valid Use of Spatial Information: A Disaggregate Approach.",
                    "What Maps Mean to People: Denotation, Connotation, and Geographic Visualization in Land-Use Debates.",
                    "The Algebraic Structure of Sets of Regions.",
                    "Complex Regions in Topological Queries.",
                    "A Cognitive Assessment of Topological Spatial Relations: Results from an Empirical Investigation.",
                    "Voronoï Diagrams on Line Segments: Measurements for Contextual Generalization Purposes.",
                    "A Qualitative Coordinate Language of Location of Figures within the Ground.",
                    "Identification of Fuzzy Objects from Field Obseravtion Data.",
                    "Long-Term Spatial Representations From Pictorial and Textual Input.",
                    "Feature Accumulation and Route Structuring in Distance Estimations - An Interdisciplinary Approach.",
                    "The Perception and Cognition of Environmental Distance: Direct Sources of Information.",
                    "Improving Multi-Purpose GIS Design: Participative Design.",
                    "Self-Organization, Cities, Cognitive Maps and Information Systems.",
                    "Cognitive Requirements on Making and Interpreting Maps.",
                    "From Knowledge to Words to Wayfinding: Issues in the Production and Comprehension of Route Directions.",
                    "Spatial Representation for Pragmatic Navigation.",
                    "Partition and Conquer.",
                    "Supporting Emergence in Spatial Reasoning With Shape Algebras and Formal Logic.",
                    "Linear Constraints: Geometric Objects Represented by Inequalities.",
                    "An Event-Based Approach to Spatial Information.",
                    "Geocognostics - A New Framework for Spatial Information Theory.",
                    "Graphical Modelling for Geographic Explanation.",
                    "Experiments Using Context and Significance to Enhance the Reporting Capabilities of GIS.",
                    "Automatic Summarization of Radiographic Imagery.",
                    "An Automated System for Name Placement which Complies with Cartographic Quality Criteria: The Hydrographic Network.",
                    "Agent-Based Simulations of a City Dynamics in a GIS Environment.",
                    "A Logical Approach to Incorporating Qualitative Spatial Reasoning into GIS (Extended Abstract).",
                    "User Interaction in a Sketch-Based GIS User Interface.",
                    "Metric Refinement of Topological Relations.",
                    "Approximation of Topological Relations Between Fuzzy Regions Satisfying a Linguistically Described Query."
                ]
            }
        ]
    },
    {
        "year": "1995",
        "name": "2nd COSIT 1995",
        "info": "Semmering, Austria",
        "venues": [
            {
                "sub_name_abbr": "conf/cosit/95",
                "sub_name": "Spatial Information Theory: A Theoretical Basis for GIS, International Conference COSIT '95, Semmering, Austria, September 21-23, 1995, Proceedings.",
                "count": 36,
                "papers": [
                    "Naive Geography.",
                    "Qualitative Spatial Reasoning Using Algebraic Topology.",
                    "Proximity Operators for Qualitative Spatial Reasoning.",
                    "Qualitative Distances.",
                    "Measuring without Measures: The Delta-Calculus.",
                    "The Millennium Project: Constructing a Dynamic 3+D Virtual Environment for Exploring Geographically, Temporally and Categorically Organized Historical Information.",
                    "Providing Spatial Navigation for the World Wide Web.",
                    "Structural Analysis of Geographic Information and GIS Operations from a User's Perspective.",
                    "A Loosely Coupled Interface to an Object-Oriented Geographic Database.",
                    "Overcoming the Knowledge Acquisition Bottleneck in Map Generalization: The Role of Interactive Systems and Computational Intelligence.",
                    "Spectral Representations of Linear Features for Generalisation.",
                    "A Triangulated Spatial Model for Cartographic Generalisation of Areal Objects.",
                    "Object Orientation and Location Updating During Nonvisual Navigation: The Characteristics and Effects of Object- Versus Trajectory-Centered Processing Modes.",
                    "Path Selection and Route Preference in Human Navigation: A Progress Report.",
                    "How Spatial Information Connects Visual Perception and Natural Language Generation in Dynamic Environments: Towards a Computational Model.",
                    "On the Determination of the Optimum Path in Space.",
                    "A Unifying Framework for Multilevel Description of Spatial Data.",
                    "Updating Visibility Information on Multiresolution Terrain Models.",
                    "Theory for the Integration of Scale and Representation Formats: Major Concepts and Practical Implications.",
                    "A Hierarchical Representation of Qualitative Shape based on Connection and Convexity.",
                    "Representational Structures for Cognitive Space: Trees, Ordered Trees and Semi-Lattices.",
                    "Reasoning About Ordering.",
                    "Improving the Selection of Appropriate Spatial Interpolation Methods.",
                    "Spatial Pattern and Spatial Autocorrelation.",
                    "Towards a Qualitative Theory of Movement.",
                    "Qualitative Causal Modeling in Temporal GIS.",
                    "A Design Support Environment for Spatio-Temporal Database Applications.",
                    "Internal vs. External Spatial Information and Cultural Emergence in a Self-Organizing City.",
                    "The Social Perception of Space: Non-Spatial Determinants of the Use of Directionals in Tongan (Polynesia).",
                    "Spatial Conceptualizations of Social Hierarchy in Pohnpei, Micronesia.",
                    "On Drawing Lines on a Map.",
                    "How Significant Are Cultural Differences in Spatial Cognition?",
                    "A Formalism for Model-Based Spatial Planning.",
                    "Object Localization: Selection of Optimal Reference Objects.",
                    "Range Queries Involving Spatial Relations: A Performance Analysis.",
                    "Evaluating and Refining Computational Models of Spatial Relations Through Cross-Linguistic Human-Subjects Testing."
                ]
            }
        ]
    },
    {
        "year": "1993",
        "name": "1st COSIT 1993",
        "info": "Marciana Marina, Elba Island, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/cosit/93",
                "sub_name": "Spatial Information Theory: A Theoretical Basis for GIS, International Conference COSIT '93, Marciana Marina, Elba Island, Italy, September 19-22, 1993, Proceedings.",
                "count": 31,
                "papers": [
                    "A Cognitive Model for the Process of Multimodal, Incremental Route Descriptions.",
                    "Cognitive Maps, Cognitive Collages, and Spatial Mental Models.",
                    "A Logical Framework for Reasoning about Space.",
                    "Maintaining Qualitative Spatial Knowledge.",
                    "Qualitative Triangulation for Spatial Reasoning.",
                    "Enhancing Qualitative Spatial Reasoning - Combining Orientation and Distance.",
                    "Map Semantics.",
                    "Development of a Cartographic Language.",
                    "Spatial Queries and Data Models.",
                    "Topological Querying of Multiple Map Layers.",
                    "Towards a Conceptual Data Model for the Analysis of Spatio-Temporal Processes: The Example of the Search for Optimal Grazing Strategies.",
                    "The Cognitive Structure of Space: An Analysis of Temporal Sequences.",
                    "Hierarchies of Space and Time.",
                    "The Voronoi Model and Cultural Space: Applications to the Social Sciences and Humanities.",
                    "Interaction with GIS Attribute Data Based on Categorial Coverages.",
                    "The Semantics of Relations in 2D Space Using Representative Points: Spatial Indexes.",
                    "Computing Visibility Maps on a Digital Terrain Model.",
                    "Toward a Theoretical Framework for Geographic Entity Types.",
                    "Land, Space and Spatial Planning in Three Time Regions.",
                    "Geographic and Manipulable Space in Two Tamil Linguistic Systems.",
                    "Scale and Multiple Psychologies of Space.",
                    "GIS and Modeling Prerequisites.",
                    "A Map Editing Kernel Implementation: Application to Multiple Scale Display.",
                    "Metaphors Create Theories For Users.",
                    "Using a Landscape Methaphor to Represent a Corpus of Documents.",
                    "From Interface to Interplace: The Spatial Environment as a Medium for Interaction.",
                    "A Keystroke Level Analysis of Manual Map Digitizing.",
                    "Critical Issues in the Evaluation of Spatial Autocorrelation.",
                    "A Directional Path Distance Model for Raster Distance Mapping.",
                    "Symbolic Spatial Reasoning on Object Shapes for Qualitative Matching.",
                    "Reasoning About Spatial Structure in Landscapes with Geographic Information Systems."
                ]
            }
        ]
    }
]