[
    {
        "name": "Cybernetics and Systems",
        "year": "2022",
        "info": "Volume 53, 2022",
        "count": 14,
        "papers": [
            "Interdisciplinary Methods and Approaches for Cybernetics and Systems Modeling.",
            "A Collaborative Robot for Tea Harvesting with Adjustable Autonomy.",
            "Iterative Learning Fuzzy Control for Nonlinear Systems with Adaptive Gain and without Resetting Condition.",
            "An Individualized Automatically Tuned TCI Strategy for Neuromuscular Blockade Control.",
            "Effect of Local Branching on the Iterative Rounding-Based Method: The Case of k-Clustering Minimum Completion Problems.",
            "Water Cycle Algorithm (WCA): A New Technique to Harvest Maximum Power from PV.",
            "Direct Power and Voltage Oriented Control Strategies of Grid-Connected Wind Energy Conversion System Based on Permanent Magnet Synchronous Generator.",
            "Brain Computer Interface for Speech Synthesis Based on Multilayer Differential Neural Networks.",
            "Optimal Adaptive Magnetic Suspension Control of Rotary Impeller for Artificial Heart Pump.",
            "Effect of Backtracking Strategy in Population-Based Approach: The Case of the Set-Union Knapsack Problem.",
            "Comparison of Deep Learning Architectures for Short-Term Electrical Load Forecasting Based on Multi-Modal Data.",
            "Gated Recurrent Units Based Recurrent Neural Network for Forecasting the Characteristics of the Next Earthquake.",
            "Pattern Detection on Glioblastoma's Waddington Landscape via Generative Adversarial Networks.",
            "A Systems Science Approach to Organizational Integrity. Case: Services Small and Medium Enterprises."
        ]
    },
    {
        "name": "Cybernetics and Systems",
        "year": "2021",
        "info": "Volume 52, 2021",
        "count": 38,
        "papers": [
            "Recent Developments in Dynamic Modeling, Control and Applications of Neural Networks.",
            "An Automatic Rehabilitation Assessment System for Hand Function Based on Leap Motion and Ensemble Learning.",
            "Multi-Background Island Bird Detection Based on Faster R-CNN.",
            "Efficient Hyperparameter Optimization for Convolution Neural Networks in Deep Learning: A Distributed Particle Swarm Optimization Approach.",
            "Sliding Mode Dynamic Surface Control for Multi-Machine Power Systems with Time Delays and Dead-Zones.",
            "A Competitive Mechanism Multi-Objective Particle Swarm Optimization Algorithm and Its Application to Signalized Traffic Problem.",
            "Investigation of Data Size Variability in Wind Speed Prediction Using AI Algorithms.",
            "General Ten-Instant DTDMSR Model for Dynamic Matrix Square Root Finding.",
            "Automatic Thresholding Technique Using Reconfigurable Hardware.",
            "Improving Spoofed Website Detection Using Machine Learning.",
            "The Organic Reach of Online Videos: Linking Viewers' Traits to Post-Viewing Behaviour.",
            "Consistency and Completeness in Model Systems.",
            "The Fuzzy Assembly Line Worker Assignment and Balancing Problem.",
            "Analysis of the Emotions in a Multi-Robot System in Emergent Contexts.",
            "Integrated Artificial Intelligence and Visualization Technique for Enhanced Management Decision in Today's Turbulent Business Environments.",
            "Cognitive Systems, Concepts, Processes, and Techniques for the Age of Industry 4.0.",
            "Experience-Based Product Inspection Planning for Industry 4.0.",
            "Smart Cities Concept - Readiness of City Halls as a Measure of Reaching a Smart City Perception.",
            "A Novel Approach for Mining Closed Clickstream Patterns.",
            "Evaluating Industry 4.0 Implementation Challenges Using Interpretive Structural Modeling and Fuzzy Analytic Hierarchy Process.",
            "Decision Support System for Solving Reviewer Assignment Problem.",
            "Centralization Measures for Social Networks.",
            "Toward Intelligent Recommendations Using the Neural Knowledge DNA.",
            "Polarization and Persuasion as Opposite Integration Strategies in Collective Models.",
            "Smart Approach for Glioma Segmentation in Magnetic Resonance Imaging using Modified Convolutional Network Architecture (U-NET).",
            "Where Did Knowledge Management Go?: A Comprehensive Survey.",
            "A New Routing Protocol for Energy Optimization in Mobile Ad Hoc Networks Using the Cuckoo Optimization and the TOPSIS Multi-Criteria Algorithm.",
            "On Sharma-Mittal's Entropy under Intuitionistic Fuzzy Environment.",
            "Incorporating Grey Relational Analysis into Grey Prediction Models to Forecast the Demand for Magnesium Materials.",
            "A Decision Algorithm for Motion Planning of Car-Like Robots in Dynamic Environments.",
            "Aggregate Selection, Individual Selection, and Cluster Selection: An Empirical Evaluation and Implications for Systems Research.",
            "Sustainable Management of the Supply Chain Based on Fuzzy Logic.",
            "Measuring Traffic Safety Culture toward Achieving Road Safety Performance: A DEA Approach with Undesirable Inputs-Outputs.",
            "RFID Indoor Localization Using Statistical Features.",
            "Visualization of Twitter Sentiments on Kashmir Territorial Conflict.",
            "Predicting Strategic Decisions Based on Emotional Signals.",
            "Cash Holdings Prediction Using Decision Tree Algorithms and Comparison with Logistic Regression Model.",
            "Labels Propagation for Profiles Categorization in Social Networks."
        ]
    },
    {
        "name": "Cybernetics and Systems",
        "year": "2020",
        "info": "Volume 51, 2020",
        "count": 43,
        "papers": [
            "Computing the Nash Bargaining Solution for Multiple Players in Discrete-Time Markov Chains Games.",
            "Bonferroni Distances and Their Application in Group Decision Making.",
            "Autonomous Vehicles and Avoiding the Trolley (Dilemma): Vehicle Perception, Classification, and the Challenges of Framing Decision Ethics.",
            "Smart Data, Information, and Knowledge Processing for Intelligence Amplification: Approaches, Models and Case Studies.",
            "Knowledge-Based Virtual Modeling and Simulation of Manufacturing Processes for Industry 4.0.",
            "Experience-Based Cognition for Driving Behavioral Fingerprint Extraction.",
            "Hybrid Deep Neural Network-Based Text Representation Model to Improve Microblog Retrieval.",
            "Mining Maximal High Utility Itemsets on Dynamic Profit Databases.",
            "Using Rule Quality Measures for Rule Base Refinement in Knowledge-Based Predictive Maintenance Systems.",
            "The Use of Context-Free Probabilistic Grammar to Anonymise Statistical Data.",
            "Comparative Usability Analysis of Selected Data Entry Methods for Web Systems.",
            "Stream Reasoning to Improve Decision-Making in Cognitive Systems.",
            "Modeling and Connecting Asset Administrative Shells for Mini Factories.",
            "Enhancing Product Manufacturing through Smart Virtual Product Development (SVPD) for Industry 4.0.",
            "The Neural Knowledge DNA Based Smart Internet of Things.",
            "A Methodology for Modeling and Optimizing Social Systems.",
            "Multivariate Time Series Clustering and its Application in Industrial Systems.",
            "New Methods and Approaches in Decision and Control of Intelligent and Cyber Systems.",
            "From Trajectory Tracking Control to Leader-Follower Formation Control.",
            "Robotic Process Automation (RPA) Using an Integer Linear Programming Formulation.",
            "A Global Maximum Error Controller Based Nonlinearity Aware TPWL Method for Reducing Nonlinear Systems.",
            "Non-Singular Kernels for Modelling Power Law Type Long Memory Behaviours and Beyond.",
            "Terminal Sliding-Mode Control of Virtual Humanoid Robot with Joint Restrictions Walking on stepping objects.",
            "Model Predictive Control of Glucose Concentration Based on Signal Temporal Logic Specifications with Unknown-Meals Occurrence.",
            "Flexible Distribution-Based Regression Models for Count Data: Application to Medical Diagnosis.",
            "Minimum Initial Marking Estimation of Labeled Petri Nets Based on GRASP Inspired Method (GMIM).",
            "Counterexamples to the Maximum Speed/Energy IMC Theory - A New Geometric Consideration Incorporates the Multivariable Perfect Control Defined in the LTI Discrete-Time State-Space Framework.",
            "Using Rhythm Network to Enhance Courses Engineering in E-Learning Environments.",
            "Development of a Novel Optimal Backstepping Control Algorithm of Magnetic Impeller-Bearing System for Artificial Heart Ventricle Pump.",
            "Robot Position/Force Control in Unknown Environment Using Hybrid Reinforcement Learning.",
            "Extraction of Moving Areas in Random-Dot Animation with Parallel Computation.",
            "Modeling Aleatory and Epistemic Uncertainty in Human Health Risk Assessment.",
            "On Degree of Fuzziness and Fuzzy Decision Making.",
            "Organizational Diseases.",
            "Applying Concept Drift to Understand Hepatitis Evolution in Brazil.",
            "Recent Advances on the Application of Soft Computing to Industrial and Environmental Enterprises.",
            "Comparative Study of One-Class Based Anomaly Detection Techniques for a Bicomponent Mixing Machine Monitoring.",
            "Context Quality Impact in Context-Aware Data Mining for Predicting Soil Moisture.",
            "Edge Computing and Adaptive Fault-Tolerant Tracking Control Algorithm for Smart Buildings: A Case Study.",
            "Heuristic and Backtracking Algorithm for Multimanned Assembly Line Balancing Problem with Location Constraints.",
            "Machine Learning to Forecast the Success of Infrastructure Projects Worldwide.",
            "Bayesian Approach for Estimating the Distribution of Magnitudes, Interevent Times and Distances of Earthquake Sequences.",
            "Do African Economies Grow Similarly?"
        ]
    },
    {
        "name": "Cybernetics and Systems",
        "year": "2019",
        "info": "Volume 50, 2019",
        "count": 41,
        "papers": [
            "Improving the Management of Industrial and Environmental Enterprises by means of Soft Computing.",
            "A General Meta-graph Strategy for Shape Evolution under Mechanical Stress.",
            "Selecting Features that Drive Internationalization of Spanish Firms.",
            "A Panoramic Survey on Grasping Research Trends and Topics.",
            "Particle Swarm Optimization and Pure Adaptive Search in Finish Goods' Inventory Management.",
            "Adding Smartness to Systems With Case Studies and Applications.",
            "Smart Condition Monitoring for Industry 4.0 Manufacturing Processes: An Ontology-Based Approach.",
            "Improving Explainability of Recommendation System by Multi-sided Tensor Factorization.",
            "Smart Cities Concept: Smart Mobility Indicator.",
            "Hypergraph Approach Towards Ontology Design in Association-Oriented Metamodel.",
            "Decisional-DNA Based Smart Production Performance Analysis Model.",
            "Towards Experience-Based Smart Product Design for Industry 4.0.",
            "An Analysis of Neural Word Representations for Wikipedia Articles Classification.",
            "Visual Content Learning in a Cognitive Vision Platform for Hazard Control (CVP-HC).",
            "Multi-step Consensus: An Effective Approach for Determining Consensus in Large Collectives.",
            "A Set of Experience-Based Smart Synergy Security Mechanism in Internet of Vehicles.",
            "Real-Time Active SLAM and Obstacle Avoidance for an Autonomous Robot Based on Stereo Vision.",
            "ε-Saddle point solution for a nonlinear robot coordination game.",
            "In Search of a Narrative for Human-Robot Relationships.",
            "A Control Architecture for Robot Swarms (AMEB).",
            "Malware Capability Assessment using Fuzzy Logic.",
            "Modeling Mentor-Mentee Dialogues in Film.",
            "Recent Developments in Cybernetics, from Cognition to Social Systems.",
            "An Analytical Model for Identifying Suspected Users on Twitter.",
            "A Comparative Study and Automated Detection of Illegal Weapon Procurement over Dark Web.",
            "A team formation method based on a Markov chains games approach.",
            "Studying the influence of algorithmic parameters and instance characteristics on the performance of a multiobjective algorithm using the Promethee method.",
            "Knowledge Reduction in Formal Contexts through CUR Matrix Decomposition.",
            "A Fusion Mechanism for Management Decision and Risk Analysis.",
            "Implementation of a Scale-Lab Lower-Limb Exoskeleton with Motion in Three Anatomical Planes.",
            "Intelligent Tracking of Moving Ships in Constrained Maritime Environments Using AIS.",
            "On Leverage Points for Curbing Corruption.",
            "Revisiting Online Video Popularity: A Sentimental Analysis.",
            "Online Learning Model for Handling Different Concept Drifts Using Diverse Ensemble Classifiers on Evolving Data Streams.",
            "Systems Thinkers: Check Your Scotomas and Watch Your Language!",
            "The Viable Smart Product Model: Designing Products that Undergo Disruptive Transformations.",
            "Guest Editorial: Special Issue on Intelligent Robotics and Multi-Agent Systems.",
            "Subspace Clustering for Situation Assessment in Aquatic Drones: A Sensitivity Analysis for State-Model Improvement.",
            "When Does Communication Learning Need Hierarchical Multi-Agent Deep Reinforcement Learning.",
            "Trail Formation Using Large Swarms of Minimal Robots.",
            "Coalition Formation for Multi-Robot Task Allocation via Correlation Clustering."
        ]
    },
    {
        "name": "Cybernetics and Systems",
        "year": "2018",
        "info": "Volume 49, 2018",
        "count": 30,
        "papers": [
            "Who is Who on Twitter-Spammer, Fake or Compromised Account? A Tool to Reveal True Identity in Real-Time.",
            "Heavy Moving Averages and Their Application in Econometric Forecasting.",
            "What about Privacy of My OSN Data?",
            "Improved Accuracy Function for Interval-Valued Intuitionistic Fuzzy Sets and Its Application to Multi-Attributes Group Decision Making.",
            "Optimal and Robust Control of Multi DOF Robotic Manipulator: Design and Hardware Realization.",
            "Cybernetics: A Bibliometric Analysis Snapshot.",
            "Big Data Framework for Zero-Day Malware Detection.",
            "Subdermal Magnetic Implants: An Experimental Study.",
            "Integrated Fuzzy DEA-ANFIS to Measure the Success Effect of Human Resource Spirituality.",
            "Latent-Function-Based Residual Discrete Grey Model for Short-Term Demand Forecasting.",
            "Email Sentiment Analysis Through k-Means Labeling and Support Vector Machine Classification.",
            "Computer Tools and Techniques for Lawyers and the Judiciary.",
            "Mining Mobility Patterns from Geotagged Photos Through Semantic Trajectory Clustering.",
            "Smart Data, Information, and Knowledge Engineering: Approaches, Techniques, and Case Studies.",
            "Intelligent Collectives: Theory, Applications, and Research Challenges.",
            "Manufacturing Data Analysis in Internet of Things/Internet of Data (IoT/IoD) Scenario.",
            "Experimental Evaluation of Agent-based Approaches to Solving Multi-mode Resource-Constrained Project Scheduling Problem.",
            "Method for Restoring Consistency in Probabilistic Knowledge Bases.",
            "Smart Innovation Engineering: Toward Intelligent Industries of the Future.",
            "Flexible Knowledge-Vision-Integration Platform for Personal Protective Equipment Detection and Classification Using Hierarchical Convolutional Neural Networks and Active Leaning.",
            "Hashtag Recommendation Approach Based on Content and User Characteristics.",
            "Visualizing Multidimensional Lifelogging Data: A Case Study on MyMovieHistory Project.",
            "Experience-Based Decisional DNA (DDNA) to Support Product Development.",
            "Toward Intelligent Vehicle Intrusion Detection Using the Neural Knowledge DNA.",
            "A Novel Approach to Improve the Speech Intelligibility Using Fractional Delta-amplitude Modulation Spectrogram.",
            "BMNABC: Binary Multi-Neighborhood Artificial Bee Colony for High-Dimensional Discrete Optimization Problems.",
            "Dealing with Collusion Attack in a Trust-Based MANET.",
            "IM-GSO: A Community Directed Group Search Optimization Approach for Influence Maximization.",
            "Whole-Body Balance Control of a Humanoid Robot in Real Time Based on ZMP Stability Regions Approach.",
            "Cyber-Physical Systems of Systems and Complexity Science: The Whole is More than the Sum of Individual and Autonomous Cyber-Physical Systems."
        ]
    },
    {
        "name": "Cybernetics and Systems",
        "year": "2017",
        "info": "Volume 48, 2017",
        "count": 34,
        "papers": [
            "A Supervised Learning Approach to Flashlight Detection.",
            "Fuzzy Logic-Based Multicast Routing in Multiradio Multichannel Wireless Mesh Networks.",
            "Malware Threat Assessment Using Fuzzy Logic Paradigm.",
            "Stability and Exponential Synchronization of High-Order Hopfield Neural Networks with Mixed Delays.",
            "Hybrid Consensus-Based Formation Control of Fixed-Wing MUAVs.",
            "Decoding the Dynamics of Value Cocreation in Consumer Tribes: An Agency Theory Approach.",
            "UAVs Mission Planning with Imposition of Flight Level through Fast Marching Square.",
            "Correlation Coefficient of Interval-Valued Intuitionistic Uncertain Linguistic Sets and Its Application.",
            "Guest Editorial: Information and Experience Engineering in Semantic Society: Some Challenges, Approaches, and Case Studies.",
            "GRSAT: A Novel Method on Group Recommendation by Social Affinity and Trustworthiness.",
            "Experience-Oriented Intelligence for Internet of Things.",
            "Predicting Patient Hospitalization after Emergency Readmission.",
            "Text Clustering Using Frequent Weighted Utility Itemsets.",
            "Improving Academic Event Recommendation Using Research Similarity and Interaction Strength Between Authors.",
            "A Semiautomatic Experience-Based Tool for Solving Product Innovation Problem.",
            "Extending Query-Subquery Nets for Deductive Databases under the Well-Founded Semantics.",
            "Adding Intelligence to Cars Using the Neural Knowledge DNA.",
            "Guest Editorial: Advances in Intelligent Techniques for Knowledge Management and Decision Making.",
            "A Fuzzy Logic-Based Knowledge Management Performance Measurement System for SMEs.",
            "Integrated Business Prestige and Artificial Intelligence for Corporate Decision Making in Dynamic Environments.",
            "Collaborative Model on the Agro-Industrial Supply Chain of Cocoa.",
            "A Neural Network Approach for Predicting Manufacturing Performance using Knowledge Management Metrics.",
            "A Hybrid Artificial Neural Network with Metaheuristic Algorithms for Predicting Stock Price.",
            "OMIR: Ontology-Based Multimedia Information Retrieval System for Web Usage Mining.",
            "Dual-Stage Biometrics-Based Password Authentication Scheme Using Smart Cards.",
            "Assembly Line Balancing Using Differential Evolution Models.",
            "Artificial Bee Colony Algorithm Based on Adaptive Search Equation and Extended Memory.",
            "Model for Selecting Project Members to Minimize Project Uncertainties.",
            "An Adaptive and Cost-Based Intrusion Response System.",
            "Language and Gender Classification of Speech Files Using Supervised Machine Learning Methods.",
            "NSGA-II-Based Design Space Exploration for Energy and Throughput Aware Multicore Architectures.",
            "Theoretical Drawbacks in Fuzzy Ranking Methods and Some Suggestions for a Meaningful Comparison: An Application to Fuzzy Risk Analysis.",
            "Strategic Talk in Film.",
            "Editorial Board EOV."
        ]
    },
    {
        "name": "Cybernetics and Systems",
        "year": "2016",
        "info": "Volume 47, 2016",
        "count": 39,
        "papers": [
            "Guest Editorial: Smart Experience and Knowledge Engineering for Optimization, Learning, and Classification/Recommendation Problems.",
            "Particle Swarm Optimization Quadrotor Control for Cooperative Aerial Transportation of Deformable Linear Objects.",
            "Agent-Based RBF Network Classifier with Feature Selection in a Kernel Space.",
            "Virtual Engineering Factory: Creating Experience Base for Industry 4.0.",
            "Empirical Evaluation of Multiobjective Optimization Algorithms Searching for Higher Order Mutants.",
            "A Preliminary Analysis of the Influence of the Inconsistency Degree on the Quality of Collective Knowledge.",
            "MyMovieHistory: Social Recommender System by Discovering Social Affinities Among Users.",
            "Weighting of Sports Categories Detected in Temporally Aggregated Sports News Videos.",
            "Experience-Based Electronic Health Records.",
            "When Neural Networks Meet Decisional DNA: A Promising New Perspective for Knowledge Representation and Sharing.",
            "Toward Smart Innovation Engineering: Decisional DNA-Based Conceptual Approach.",
            "An Improved Method for Edge Detection and Image Segmentation Using Fuzzy Cellular Automata.",
            "Modeling Regions of Interest on Orbital and Rover Imagery for Planetary Exploration Missions.",
            "Direct Solution of Time-Cost Tradeoff Problem with Fuzzy Decision Variables.",
            "Single Criterion Net Flow Using Concordance and Discordance Relations.",
            "ADRC Law of Spacecraft Rendezvous and Docking in Final Approach Phase.",
            "Implementation of Real-Time Vehicle Tracking in City-Scale Video Network.",
            "A Hybrid Detecting Fraudulent Financial Statements Model Using Rough Set Theory and Support Vector Machines.",
            "Metamodeling Methodology for Modeling Cyber-Physical Systems.",
            "Comparison of Arithmetic Operations of Generalized Fuzzy Numbers: Case Study in Risk Assessment.",
            "Assessing a Metaheuristic for Large-Scale Commercial Districting.",
            "The Observer-Generated Information Process: Composite Stages, Cooperative \"Logical\" Structure, and Self-Organization.",
            "An Extension of OWAD Operator and Its Application to Uncertain Multiple-Attribute Group Decision-Making.",
            "Efficient Methodologies to Determine the Relevancy of Hanging Pages Using Stability Analysis.",
            "Opaque Superlanguages and Sublanguages in Discrete Event Systems.",
            "An Evidential Spam-Filtering Framework.",
            "Fractional Control of a Humanoid Robot Reduced Model with Model Disturbances.",
            "Decision Making in Reinsurance with Induced OWA Operators and Minkowski Distances.",
            "A Statistical Framework for Online Arabic Character Recognition.",
            "Improved Fuzzy Rule Promotion-Based Localized Crop Knowledge Dissemination System for Farmers of Punjab (India) Using Mobile Phone Technology.",
            "Novel Autonomous Navigation Algorithms in Dynamic and Unknown Environments.",
            "A Test of the Viable System Model: Theoretical Claim vs. Empirical Evidence.",
            "An Approach to Investigating Reliability Indices for Tree Topology Network.",
            "Modified Artificial Bee Colony Algorithm with Self-Adaptive Extended Memory.",
            "Controlling Project Schedule Progress, Using Control Charts.",
            "Adaptive Data Hiding, Using Pixel-Value-Differencing and LSB Substitution.",
            "Classifying True and False Hebrew Stories Using Word N-Grams.",
            "Modeling Multileader-Follower Noncooperative Stackelberg Games.",
            "Followers or Fradulents? An Analysis and Classification of Twitter Followers Market Merchants."
        ]
    },
    {
        "name": "Cybernetics and Systems",
        "year": "2015",
        "info": "Volume 46, 2015",
        "count": 42,
        "papers": [
            "Guest Editorial: Knowledge and Experience Engineering: Recent Advances with Applications.",
            "Extended Reflexive Ontologies for the Generation of Clinical Recommendations.",
            "Experiments of Trust Prediction in Social Networks by Artificial Neural Networks.",
            "Virtual Engineering Object (VEO): Toward Experience-Based Design and Manufacturing for Industry 4.0.",
            "Ensemble Online Classifier Based on the One-Class Base Classifiers for Mining Data Streams.",
            "Privacy-Aware Framework for Matching Online Social Identities in Multiple Social Networking Services.",
            "Applying Decisional DNA to Internet of Things: The Concept and Initial Case Study.",
            "Comparison of Vehicle Control Systems Based on Multiple Features.",
            "Context-Aware Navigation Element for Collaborative Nonlinear Video Authoring Tool.",
            "Experience-Driven Model of Decision-Making Processes in Project Teams.",
            "Guest Editorial: Intelligent Systems in Business and Economics.",
            "Multicriteria Decision-Making Using Fuzzy Measures.",
            "Uncertain Induced Heavy Aggregation Distance Operator and its Application to Decision Making.",
            "Risk Strategy and Attitudinal Sensitivity.",
            "Processing Extreme Values in Sales Forecasting.",
            "Uplift Random Forests.",
            "Age Diversity: An Empirical Study in the Board of Directors.",
            "Leadership Styles and Innovative Entrepreneurship: An International Study.",
            "Modeling Local Social Migrations: A Cellular Automata Approach.",
            "Game-Theoretic Models of Incentive and Control Strategies in Social and Economic Systems.",
            "A Study on Automatic Classification of Users' Desktop Interactions.",
            "The Conceptual Model of Well-Being Management Based on Achieving Requisite Personal Holism.",
            "Using Estimated Personality of Social Network Members for Finding Influential Nodes in Viral Marketing.",
            "Guest Editorial: Belief Systems and Science.",
            "Language, Values, and Ideology in Complex Human Societies.",
            "Walking Through Cantor's Paradise and Escher's Garden: Epistemological Reflections on the Mathematical Infinite (I).",
            "Walking Through Cantor's Paradise and Escher's Garden: Epistemological Reflections on the Mathematical Infinite (II).",
            "Fuzzy Structure of Complex Belief Systems: Fuzzy Relations and Fuzzy Belief Sets.",
            "A Belief System's Organization Based on a Computational Model of the Dynamic Context: First Approximation.",
            "Knowledge and Belief: Some Clarifications.",
            "Diametric and Concentric Spatial Structures Framing Belief Systems - Précis of The Primordial Dance: Diametric and Concentric Spaces in the Unconscious World.",
            "A Spatial-Phenomenological Lens to Examine Psychological and Philosophical Issues in Thinking.",
            "Exploring the Belief Systems of Software Development Professionals.",
            "The Coconstruction of Scientific and Nonscientific Belief Systems in Educators.",
            "Integration | Innovation | Inclusion: Values, Variables and the Design of Human Environments.",
            "On Belief and the Making of All Things Beautiful and Sublime: Creation by Ordinance and Destruction by Chaos.",
            "Alternative Economics and Sustainable Future: Diverse Cultures/Beliefs/Values as Indispensable Factors.",
            "Solution Modeling Using Postfix Genetic Programming.",
            "An Approach for Dynamic Identification of Online Radicalization in Social Networks.",
            "Conceptual Model in the Formal Basis of Hierarchical Systems for Mechatronic Design.",
            "A Multidisciplinary View of Social and Labor Relations: Changes in Management in the U.S. and Russia as Examples.",
            "Finding Minimum Vertex Covering in Stochastic Graphs: A Learning Automata Approach."
        ]
    },
    {
        "name": "Cybernetics and Systems",
        "year": "2014",
        "info": "Volume 45, 2014",
        "count": 40,
        "papers": [
            "Coordination in Navigation of Multiple Mobile Robots.",
            "Discrete vs. Continuous Approach in Crowd Dynamics Modeling Using GPU Computing.",
            "Top-Down Approach for a Linguistic Fuzzy Logic Model.",
            "Driving Information Systems Security through Innovations - First Indications.",
            "Optimal Control of Uncertain Stochastic Systems with Markovian Switching and Its Applications to Portfolio Decisions.",
            "Guest Editorial: Designing and Developing Smart Cognitive Systems: Implementation Lessons from the Real World.",
            "Design and Development of a Mobile Cardiac Rehabilitation System.",
            "Universal Remote Delivery of Rehabilitation: Validation with Seniors' Joint Rehabilitation Therapy.",
            "Model of a Maturity Capsule in Managing IT Projects.",
            "Rule-Based Model for Selecting Integration Technologies for Smart Cities Systems.",
            "Trust-Based Consensus for Collaborative Ontology Building.",
            "<A, V>-Spear: A New Method for Expert Based Recommendation Systems.",
            "Comparative Analysis of Text Representation Methods Using Classification.",
            "Set of Experience Knowledge Structure (SOEKS) and Decisional DNA (DDNA): Past, Present and Future.",
            "Guest Editorial: Computational Approaches for Conflict Resolution in Decision Making: New Advances and Developments.",
            "Strategies for Cooperation Emergence in Distributed Service Discovery.",
            "Supporting an Autonomous Social Agent within a Competitive Environment.",
            "Toward a Computational Analysis of Probabilistic Argumentation Frameworks.",
            "Studying the effects of stress on Negotiation Behavior.",
            "An Intelligent Self-Configurable Mechanism for Distributed Energy Storage Systems.",
            "Tprank: contend with Web Spam using Trust Propagation.",
            "An Efficient Evolutionary Neural fuzzy controller for the Inverted Pendulum System.",
            "Probabilistic and Intuitionistic fuzzy Sets-Based Method for fuzzy Time Series Forecasting.",
            "Protection against System Research.",
            "Stigmergy-Based Synchronization of a sequence of Tasks in a Network of Asynchronous Nodes.",
            "Adaptive sliding-mode Control of spherical robot with estimated rolling Resistance.",
            "Intuitionistic uncertain Linguistic Weighted Bonferroni OWA operator and its Application to Multiple Attribute Decision Making.",
            "A Genetic Algorithm for the Economic manpower Shift Planning Problem.",
            "Simulating Demography and Human Development Dynamics.",
            "Variance-Based Harmony Search Algorithm for unimodal and Multimodal Optimization Problems with Application to Clustering.",
            "A Study for the Application of Automated Planning to Mobile assistive robots.",
            "Authorship Attribution of Responsa using Clustering.",
            "Co-Evolution Path Model (Cepm): Sustaining Enterprises as Complex Systems on the Edge of Chaos.",
            "Learning Behaviors by an Autonomous Social robot with Motivations.",
            "A New Distributed Location-Based Routing Algorithm for Wireless Sensor Networks.",
            "Obituary.",
            "Selection of Multiple Combination Strategies for Risk Assessment.",
            "An Improved Artificial Bee Colony Algorithm with Local Search for Traveling Salesman Problem.",
            "Agent-Based Simulation for Border Crossing Modeling.",
            "The Efficiency Challenges of Resource Discovery in Grid Environments."
        ]
    },
    {
        "name": "Cybernetics and Systems",
        "year": "2013",
        "info": "Volume 44, 2013",
        "count": 39,
        "papers": [
            "Systemic Modeling of Integrated Systems for Decision Making Early on in the Design Process.",
            "A cybernetic Decision Model of Market entry.",
            "Quantifying Nearness in Visual Spaces.",
            "Writer Identification of Arabic Text using Statistical and Structural Features.",
            "A New Distributed Job Scheduling Algorithm for Grid Systems.",
            "Current Research Advances and Implementations in Smart Knowledge-Based Systems: Part I.",
            "An Empirical Evaluation of Interest Point Detectors.",
            "A Proposal for a Knowledge Market Based on quantity and Quality of Knowledge.",
            "A Hybrid Method for Fuzzy Ontology Integration.",
            "Agent-Based Approach to the Design of RBF Networks.",
            "Prediction Based on Integration of Decisional DNA and a Feature Selection Algorithm Relief-F.",
            "Current Research Advances and Implementations in Smart Knowledge-Based Systems: Part II.",
            "Impact of Reflexive Ontologies in Semantic Clinical Decision Support Systems.",
            "Adaptive Decision Support System for Automatic Physical Effort Plan Generation - Data-Driven Approach.",
            "A Method for Temporal Knowledge Integration using Indeterminate Model of Time.",
            "Ontology-Driven Rule-Based Model for an Extension of Information Technology Infrastructure Library Processes.",
            "Toward a Fuzzy Model of Polish Internet Mortgage Market.",
            "Implementing Fuzzy Logic to Generate User Profile in Decisional DNA Television: the Concept and Initial Case Study.",
            "High-Speed PCA Encryption Algorithm using Reconfigurable Computing.",
            "Recognizing Key Service Factors of attracting New Virtual Community Members.",
            "Fast 3D Cluster Tracking for a Mobile Robot using 2D Techniques on Depth Images.",
            "Taguchi's Design of Experiment in Combination Selection for a Chaotic Time Series Forecasting Method using Ensemble Artificial Neural Networks.",
            "An Opinion Feature Extraction Approach Based on a Multidimensional Sentence Analysis Model.",
            "Brain Emotional Learning-Based Pattern recognizer.",
            "Features-Level Fusion of Face and Handwritten Signature in Multimodal Biometric Identification System.",
            "A New Approach to the Vertex Coloring Problem.",
            "Guest Editorial: Intelligent Network Security and Survivability.",
            "Mama: manifest Analysis for Malware Detection in Android.",
            "Swarm Graph Coloring for the Identification of User Groups on ERP Logs.",
            "Visualization and Clustering for SNMP Intrusion Detection.",
            "Spam Detection using Data Compression and Signatures.",
            "Comprehensive Approach to Information Sharing for increased Network Security and Survivability.",
            "Application of Adaptive Splitting and Selection Classifier to the Spam Filtering Problem.",
            "An Evolutionary Algorithm Approach for Dedicated Path Protection Problem in Elastic Optical Networks.",
            "Metaheuristic Algorithms for Optimization of Survivable Multicast Overlay in Dual homing Networks.",
            "A Model of Single-Agent illness Self-regulation.",
            "Adaptive Model Learning Based on Dyna-Q Learning.",
            "Modeling and Simulation of the humanoid robot HOAP-3 in the OpenHRP3 Platform.",
            "Multimodal Fusion as Communicative Acts during Human-robot Interaction."
        ]
    },
    {
        "name": "Cybernetics and Systems",
        "year": "2012",
        "info": "Volume 43, 2012",
        "count": 40,
        "papers": [
            "Degree-Constrained Minimum Spanning Tree Problem in Stochastic Graph.",
            "A Methodology for Provision of Sustainable Information Systems Security.",
            "Intuitionistic Fuzzy Sets Based Method for Fuzzy Time Series Forecasting.",
            "High-Order ILC with Initial State Learning for Discrete-Time Delayed Systems.",
            "Guest Editorial: Ontologies, Set of Experience, and Decisional DNA: Smart Tools and Techniques for Knowledge Engineering.",
            "Decisional DNA: the Concept and its Implementation Platforms.",
            "Using Set of Experience Knowledge Structure to Extend a Rule Set of Clinical Decision Support System for Alzheimer's Disease Diagnosis.",
            "Quality Assessment of Experiential Knowledge.",
            "Building Domain Ontologies from Engineering Standards.",
            "Making Digital TV Smarter: Capturing and Reusing Experience in Digital TV.",
            "Introducing the Concept of Decisional DNA-Based Web Content Mining.",
            "Integrating Path Planning, Routing, and Scheduling for Logistics Operations in manufacturing Facilities.",
            "Teo: Full-Size Humanoid Robot Design Powered by a fuel Cell System.",
            "A Mathematical Model that Learns an Adaptively Generated Novel Pattern in Quadruped Locomotion.",
            "Bandwidth-Sensitive Routing: from Individualism to Collectivism.",
            "Continuous Q-Learning for Multi-Agent Cooperation.",
            "Guest Editorial: Learning, Scheduling, Resource Optimization, and Evolution in Smart Artificial Systems: Challenges and Support.",
            "Improving the Control of Single Robot Hose Transport.",
            "Estimating Knowledge quantity in the E-Decisional Community.",
            "Hybrid Model of the Evolution of Information Technology (IT) Support Organization.",
            "Selecting a Representative Data Set of the Required Size Using the Agent-Based Population Learning Algorithm.",
            "A Method for Ontology Alignment Based on Semantics of Attributes.",
            "User Assignment and Movement Prediction in Wireless Networks.",
            "Client-Perceived Web Performance Knowledge Discovery through turning Bands Method.",
            "Design of a Prediction Model for Cement Rotary Kiln Using Wavelet Projection Fuzzy Inference System.",
            "Integrating Global and Local Voting of Classifiers.",
            "An Adaptive Expectation Genetic Algorithm Based on ANFIS and Multinational Stock Market volatility Causality for TAIEX Forecasting.",
            "A Hybrid Demand Forecasting Model Based on Empirical Mode Decomposition and Neural Network in TFT-LCD Industry.",
            "Market Area Analysis and Intelligence through GeoWeb Map Segmentation.",
            "Link-Based Spam Algorithms in Adversarial Information Retrieval.",
            "Variable patrol Planning of Multi-Robot Systems by a Cooperative Auction System.",
            "Challenging Managerial Dilemmas of Operations Management.",
            "Uncertain Bang-Bang Control for continuous Time Model.",
            "Performance Evaluation of Sugar plants by Fuzzy Technique for Order Performance by Similarity to Ideal Solution (TOPSIS).",
            "A Robust Boosting by using an Adaptive Weight Scheme.",
            "Centralized vs. Market-Based and Decentralized Decision Making: a Review.",
            "Risk Analysis in Diabetes Prediction Based on a New Approach of Ranking of generalized trapezoidal Fuzzy numbers.",
            "A Hybrid Metaheuristic for the Single-Machine total Weighted tardiness Problem.",
            "Service Idealism: the Sense Perception of Personality.",
            "Optimized Query Forwarding for Resource Discovery in Unstructured Peer-to-Peer Grids."
        ]
    },
    {
        "name": "Cybernetics and Systems",
        "year": "2011",
        "info": "Volume 42, 2011",
        "count": 39,
        "papers": [
            "On Realizing the Shortest Time Strategy in a CA FF Pedestrian Dynamics Model.",
            "Multi-Agent Intelligent Planning Architecture for People Location and Orientation Using RFID.",
            "Neighborhood-Based Vision Systems.",
            "A Binocular Vision System with Attentive saccade and Spatial Variant Vergence Control.",
            "Guest Editorial: Smart Modeling Support for Managing Complexities and Dynamics of Knowledge-Based Systems - Part 2.",
            "A Simulation Model of Dictyostelium discoideum for the Study of Evolutionary Selection Mechanisms.",
            "A Method for Scenario Recommendation in Intelligent E-Learning Systems.",
            "Dynamic Interaction Networks versus Local Trend Models for Multiple Time-Series Prediction.",
            "Preserving Virtual Engineering Knowledge through the Product Life Cycle.",
            "Smart Decision Infrastructure: Architecture Discussion.",
            "An Approach to Smart Experience Management.",
            "A Practical Approach to Prioritize Project Activities through Fuzzy Ranking.",
            "Automatically Identifying citations in Hebrew-Aramaic Documents.",
            "Toward Coherent Matching in Case-Based Classification.",
            "Integration of a Voice Recognition System in a Social Robot.",
            "Subjective Mental Workload Assessment Based on Generalized Fuzzy Numbers.",
            "Chord Recognition Using Neural Networks Based on Particle Swarm Optimization.",
            "Guest Editorial: Knowledge Processing Methodologies in Intelligent Autonomous Systems.",
            "Collaborative Urban Computing: Serendipitous Cooperation between Users in an Urban Environment.",
            "Agent-Based Modeling and Analysis of Socio-Technical Systems.",
            "Improving Efficiency of Service-Oriented Context-Driven Software Agents.",
            "Population-Based Multi-Agent Approach to Solving Machine Learning Problems.",
            "A Method for Complex Hierarchical Data Integration.",
            "Obituary: Professor Dr. Luigi M. Ricciardi.",
            "A Bit-Parallel Algorithm for Sequential Pattern Matching with Wildcards.",
            "A CBR-Based Delphi Model for Quality Group Decisions.",
            "Leap Effects among Robust Root Trajectories.",
            "Fuzzy Logic-Based Target Classification Using Kinematic Data.",
            "Understanding Normative Personality.",
            "Guest Editorial: Best OF \"Agent Based Modelling and Simulation 2010\" (ABModSim-3).",
            "Learning-by-Modeling: Insights from an Agent-Based Model of University-Industry Relationships.",
            "Large-Scale High-Fidelity Agent-Based Simulation in Air Traffic Domain.",
            "A Framework for Processing Agent-Based Pedestrian Activity Simulations in Shopping Environments.",
            "Monitoring Time-Aware Commitments within Agent-Based Simulation Environments.",
            "Scene-Retrieved Attributes for Automatic License Plate Localization.",
            "Building User Task Space by Mining Temporally Proximate Desktop Actions.",
            "Genetic Algorithm-Based Sensor Deployment with Area Priority.",
            "Efficient Methodologies to Handle Hanging Pages Using Virtual Node.",
            "Learning to Avoid Risky Actions."
        ]
    },
    {
        "name": "Cybernetics and Systems",
        "year": "2010",
        "info": "Volume 41, 2010",
        "count": 42,
        "papers": [
            "Editorial: Applied Intelligence and Knowledge Based Systems: Approaches and Case Studies - Part 2.",
            "Ontology-Based Information Retrieval Using Fuzzy Concept Documentation.",
            "Smart Knowledge-Sharing Platform for E-Decisional Community.",
            "The Experimental Design for Data Mining to Discover Web Performance Issues in a Wide Area Network.",
            "Smart Security Assessment of Composed Web Services.",
            "Validation of an Agent and Ontology-Based Information Technology Assessment System.",
            "Quality Analysis of Domain-Dependent Internet Archives.",
            "Guest Editorial: Introduction to the Special Issue on Social Awareness in Smart Spaces: Part I.",
            "Detection of Social Interaction in Smart Spaces.",
            "Quantitative Evaluation of Group User Experience in Smart Spaces.",
            "Ncash: NFC Phone-Enabled Personalized Context Awareness Smart-Home Environment.",
            "Toward Combining Automatic Resolution with Social Mediation for Resolving Multiuser Conflicts.",
            "Doubleface: Robust Reputation Ranking Based on Link Analysis in P2P Networks.",
            "Guest Editorial: Introduction to the Special Issue on Social Awareness in Smart Spaces - Part II.",
            "A Model for Addition of User Information to Sensor Data Obtained from Living Environment.",
            "A Need-Awaring Multi-Agent Approach for Ad Hoc Need Identification and Group Formation in Nomadic Community Computing.",
            "Mobile Location-Based Social Networking in Supported Employment for People with Cognitive Impairments.",
            "Daily Physiological Signal Monitoring System for Fostering Social Well-Being in Smart Spaces.",
            "Agent-Based Social Simulation: a Dynamical-Systems Viewpoint.",
            "A Demand Prediction Model for Replacement Parts Using a Markov renewal Process with Termination.",
            "Information Storage System.",
            "Indoor Wayfinding Based on Wireless Sensor Networks for Individuals with Multiple Special Needs.",
            "Stability Region Robustness.",
            "Revisiting Overlooked Foundations of Evolutionary Computation: Part I.",
            "The Fuzzy Generalized OWA Operator and its Application in Strategic Decision Making.",
            "Alerting Companies through on-Line Patent Trend Analysis.",
            "Synchronization of Chaotic Gyro Systems Using Recurrent Wavelet CMAC.",
            "Revisiting Overlooked Foundations of Evolutionary Computation: Part II.",
            "Automatic Flower Boundary Extraction Using Ipsoantk-Means Algorithm.",
            "Dynamic Environment Robot Path Planning Using Hierarchical Evolutionary Algorithms.",
            "A Note on Weighted Fuzzy k-Means Clustering for Concept Decomposition.",
            "Do We Agree? Measuring Agreement on the Human judgments in Emotion Annotation of News Sentences.",
            "Systems Theory Approach to the Health Care Organization on National Level.",
            "Interactive Fuzzy Programming Based on Fractile Criterion Optimization Model for Two-Level Stochastic Linear Programming Problems.",
            "Mobile Agent Security against Malicious Platforms.",
            "Uncertain Optimal Control with Application to a Portfolio Selection Model.",
            "Guest Editorial: Smart Modeling Support for Managing Complexities and Dynamics of Knowledge-Based Systems - Part 1.",
            "A Complex System Engineering Design Model.",
            "Using Human Behavior to Develop Knowledge-Based Virtual Organizations.",
            "Business-Oriented Admission Control and Request Scheduling for E-Commerce Websites.",
            "Translations of Service Level Agreement in Systems Based on Service-Oriented Architectures.",
            "Gaining Knowledge through Experience: Developing Decisional DNA Applications in Robotics."
        ]
    },
    {
        "name": "Cybernetics and Systems",
        "year": "2009",
        "info": "Volume 40, 2009",
        "count": 42,
        "papers": [
            "Comparative Study of Some Solution Methods for Traveling Salesman Problem Using Genetic Algorithms.",
            "Spherical Uncertainties in Discrete-Time Systems.",
            "Evaluating Performance of Flow Line Systems with Blocking under Fuzzy Environments.",
            "Modelling of Statistical Laws for Texts Using a Pearson System.",
            "Editorial: Applied Intelligent Systems.",
            "Agent Enabled Adaptive Management of QoS Assured Provision of Composite Services.",
            "Implementing Decisional Trust: a First Approach for Smart Reliable Systems.",
            "Experience-Based Knowledge Representation: Soeks.",
            "A Hybrid Method for Integrating Multiple Ontologies.",
            "Estimating Null Values in Relational Database Systems Having Negative Dependency Relationships between Attributes.",
            "Contextualized Recommendation Based on Reality Mining from Mobile Subscribers.",
            "Using Data Mining Algorithms in Web Performance Prediction.",
            "Arabic Character Recognition Using Modified Fourier Spectrum (MFS) vs. Fourier Descriptors.",
            "An Enhanced Deterministic Fuzzy Time Series Forecasting Model.",
            "Towards a Modeling of Natural Systems.",
            "Characterizing Classes of Structured Objects by Means of Information Inequalities.",
            "Solving the Open Shop Scheduling Problem via a Hybrid Genetic-Variable Neighborhood Search Algorithm.",
            "Cooperative Learning by Policy-Sharing in Multiple Agents.",
            "The Design of the Superheated-Steam temperature Immune Control System and its BIBO Stability Analysis.",
            "Interpretation of the Generalized Zipf-Mandelbrot Law Parameters.",
            "From Division to Integration of Natural and Social Sciences by \"the Universal Dialectical Systems Theory\".",
            "Guest Editorial: Best of \"Agent-Based Modeling and Simulation 2008\" (Abmodsim-2).",
            "Validation of CA Models of Pedestrian Dynamics with Fundamental Diagrams.",
            "Hybrid Simulation Algorithms for an Agent-Based Model of the Immune Response.",
            "A Neo-Schumpeterian Model of Energy Markets.",
            "Elements of a Documentation Framework for Agent-Based Simulation Models.",
            "A Practical Fuzzy Digraph Model for Modeling Manufacturing Flexibility.",
            "A Comparative Study on Particle Swarm Optimization and Genetic Algorithms for Traveling Salesman Problems.",
            "A New Hybrid Algorithm for Multi-Objective Distribution Feeder Reconfiguration.",
            "Generating Automatic Fuzzy System from Relational Database System for Estimating Null Values.",
            "A Physical System for Binocular Vision through saccade Generation and Vergence Control.",
            "Traffic Video-Based Moving Vehicle Detection and Tracking in the Complex Environment.",
            "Stability Region Gradients.",
            "Customer Segmentation and Classification from blogs by Using Data Mining: an Example of VoIP Phone.",
            "Using Multiple Correspondence Analysis with Membership Values when the System Study Yields Miscellaneous Datasets.",
            "Editorial: Applied Intelligence and Knowledge-Based Systems: Challenges, Approaches, and Case Studies - Part 1.",
            "An Effective Attribute Clustering Approach for Feature Selection and Replacement.",
            "Processing Inconsistency of Knowledge in Determining Knowledge of a Collective.",
            "A Vehicle License Plate Detection Method for Intelligent Transportation System Applications.",
            "Modeling and Optimization of Complex Services in Service-Based Systems.",
            "Investigating the Role of Knowledge-Based Technologies in the Sector of Nongovernmental Organizations.",
            "Workflow Centered Experience Management."
        ]
    },
    {
        "name": "Cybernetics and Systems",
        "year": "2008",
        "info": "Volume 39, 2008",
        "count": 45,
        "papers": [
            "Player Co-Modelling in a Strategy Board Game: Discovering How to Play Fast.",
            "Fewer Hyper-Ellipsoids Fuzzy Rules Generation Using Evolutional Learning Scheme.",
            "Vector Quantization of Images Using a Fuzzy Clustering Method.",
            "Exploitation Procedure Based on eigenvector Revisited: the Concept of Weighted Preference Flows in multicriteria outranking Analysis.",
            "Design and Implementation of GA-Based Fuzzy System on FPGA Chip.",
            "Smart Future of Knowledge Management.",
            "War, Peace, and Fuzzy Logic.",
            "Artificial Immune Systems in the Context of Misbehavior Detection.",
            "Parallel Processing of Connection Streams in Nodes of Packet-Switched Computer Communication Systems.",
            "Reflexive Ontologies: Enhancing Ontologies with Self-Contained Queries.",
            "Smart Systems Integration: toward Overcoming the Problem of Complexity.",
            "Genetic Algorithm Application to the Standard Arabic Phonemes Classification.",
            "Words as Classifiers of Documents According to their Historical Period and the Ethnic Origin of their Authors.",
            "Asymmetrical Conditional Bayes Parameter Identification for Control Engineering.",
            "Information macrodynamic Model and Information Structure of a Market Economic System.",
            "Design of an Aerospace Launch Vehicle Autopilot Based on Optimized Emotional Learning Algorithm.",
            "Guest Editorial: Papers in Sensing and in Reasoning (Marco Somalvico Memorial Issue).",
            "Ultrasonic-Based Localization of Cow Teats for Robotized Milking.",
            "Select Topics in Legal Evidence and Assistance by Artificial Intelligence Techniques.",
            "Very Strongly Constrained Problems: an Ant Colony Optimization Approach.",
            "Identifiability in Causal Bayesian Networks: a Gentle Introduction.",
            "The Spatial Semantic Hierarchy Implemented with an Omnidirectional Vision System.",
            "Some Time Random Variables Related to a Gompertz-Type Diffusion Process.",
            "The Admissible Spherical Uncertainty for Dynamic Systems in State Space.",
            "Influence of temperature on Swarmbots that Learn.",
            "Heuristic Particle Swarm Optimization Learning-Based Image Compression System.",
            "Editorial: Information and Knowledge Engineering for Intelligent Systems - Part I.",
            "Inconsistency of Knowledge and Collective Intelligence.",
            "A Method for Constructing a Pseudo Self-Dual Normal Basis.",
            "Applying Data Mining Techniques for Cancer Classification on gene Expression Data.",
            "A Solution of Real-World Ocst Problems with a New Tree Encoding-Based Genetic Algorithm.",
            "Decision Support with Logical and Fuzzy Petri Nets.",
            "Stereo Correspondence Estimation Using Multiwavelets Scale-Space Representation-Based Multiresolution Analysis.",
            "Editorial: Information and Knowledge Engineering for Intelligent Systems - Part II.",
            "An Improved Knowledge-Acquisition Strategy Based on Genetic Programming.",
            "Flar: an Adaptive Fuzzy Routing Algorithm for Communications Networks Using Mobile Ants.",
            "An Intelligent Security Agent for a Reliable Cipher System Using Pingpong.",
            "A Tool for Prototyping AIS Based Protection Systems for Ad Hoc and Sensor Networks.",
            "Combining Technologies to Achieve Decisional Trust.",
            "Using Autonomous System Topological Information in a Web Server Performance Prediction.",
            "Toward a Synergy between Simulation and Knowledge Management for Business Intelligence.",
            "Concurrent Path Construction for Global Map Building in Unknown Indoor Environments.",
            "Business Excellence in Public-Utility Companies by Innovativeness Based on Dialectical Systems Thinking.",
            "A Novel Method for Measuring the Structural Information Content of Networks.",
            "Integrated Communication and Control Systems with Occasional Information Feedback."
        ]
    },
    {
        "name": "Cybernetics and Systems",
        "year": "2007",
        "info": "Volume 38, 2007",
        "count": 44,
        "papers": [
            "Automatic Machine Learning of Keyphrase Extraction from Short Html Documents Written in Hebrew.",
            "Using Correspondence Analysis When the System Description Yields several Transition Matrices. Examples with Simulated Data and Real Driver-car-environment System Data.",
            "New Model Based on Cellular Automata and Multiagent Techniques.",
            "Reactive Tuning of Target Estimate Accuracy in Multisensor Data Fusion.",
            "Guaranteed Cost Control for a Class of Uncertain Switched Delay Systems: an Average Dwell-time Method.",
            "An Accelerated Algorithm for Density Estimation in Large Databases Using Gaussian Mixtures.",
            "Optimal Adaptive Controller for Multidimensional Armax Model.",
            "Project Team Selection Using Fuzzy Optimization Approach.",
            "Design of Decision Tree via Kernelized Hierarchical Clustering for Multiclass Support Vector Machines.",
            "Simple Fuzzy Grid Partition for Mining Multiple-level Fuzzy Sequential Patterns.",
            "Robustness and Dynamic Interaction.",
            "Multimodel Discrete Control with Online Updating of the Fractional Order Hold Gains.",
            "A Sociological Perspective on the Reordering Problem in Multipath Routing.",
            "Empirical Research of the Principal Component Analysis and Ordered Weighted Averaging Integrated Evaluation Model on Software Projects.",
            "A Simple Time Variant Method for Fuzzy Time Series Forecasting.",
            "Cybernetic Model (lopi) Simulation of Demographic Dynamics of Croatian Population.",
            "Semi-automated Annotation and Retrieval of Dance Media Objects.",
            "Complementarity of the Living Systems and the Dialectical Systems Theories: the Case of Public Medical Care in Slovenia.",
            "Attractors, Structural Functions, and the Water Cycle.",
            "Modeling and Simulation for Intelligent Control of Expansion Valve in Vapour Compression Refrigeration System.",
            "Optimal Feeder Reconfiguration for Loss Reduction by Robust Searching Hybrid Differential Evolution.",
            "Editorial: Knowledge Management and Ontologies - Part I.",
            "Dissimilar Sets of Experience Knowledge Structure: a Negotiation Process for Decisional Dna.",
            "Genetic Algorithms for Decisional Dna: Solving Sets of Experience Knowledge Structure.",
            "Brain Gene Ontology and Simulation System (bgos) for a Better Understanding of the Brain.",
            "Modeling and Control of Internal Combustion Engines Using Intelligent Techniques.",
            "Neural Networks and Optimization Algorithms Applied for Construction of Low Noise Tread Profiles.",
            "Design Information Handling in a Knowledge Based Intelligent Design System.",
            "Supporting the Cad Structural Design Process with Knowledge-based Tools.",
            "Knowledge Representation for Leadership Stories.",
            "Knowledge Management Based on Formal Models of Software Project Management.",
            "Guest Editorial: Best of \"agent-based Modeling and Simulation\" (abmodsim).",
            "Lumpy Investment and Endogenous Business Cycles in an Evolutionary Multi-agent Model.",
            "Simulating Knowledge-generation and Distribution Processes in Innovation Collaborations and Networks.",
            "A Generic Model of Collectivities.",
            "Multiscale Agent-based Simulation for Chondrogenic Pattern Formation in Vitro.",
            "Situated Cellular Agents Approach to Crowd Modeling and Simulation.",
            "Editorial: Knowledge Management and Ontologies - Part II.",
            "Immunity as a Design Decision Making Paradigm for Complex Systems: a Robustness Approach.",
            "A Method for Ontology Conflict Resolution and Integration on Relation Level.",
            "Using Reengineering for Knowledge-based Systems.",
            "Knowledge Management: an Integrative View and Empirical Examination.",
            "Adaptive and Intelligent Request Distribution for Content Delivery Networks.",
            "Towards the Construction of Decisional Dna: a Set of Experience Knowledge Structure Java Class within an Ontology System."
        ]
    },
    {
        "name": "Cybernetics and Systems",
        "year": "2006",
        "info": "Volume 37, 2006",
        "count": 47,
        "papers": [
            "Flexible aggregation in multiple attribute decision making: application to the kuranda range road upgrade.",
            "A multimodal biometric identification system using compressed finger images.",
            "An asp-based model employing a tabu search method for making e-logistics decisions.",
            "Interactive decision making using possibility and necessity measures for a fuzzy random multiobjective 0-1 programming problem.",
            "Environmental management revisited: lessons from a cybernetic intervention in colombia.",
            "Information and knowledge management: advances, approaches, challenges, and critical issues.",
            "Extending set of experience knowledge structure into a transportable language extensible markup language.",
            "Mobility implications for m-government platform design.",
            "The relationship of control and learning to project performance.",
            "Organizational memory: three experiments on the quality of information.",
            "Formal considerations of rule-based messaging for business process integration.",
            "Development of a knowledge-based economy in Poland.",
            "Ergonomic issues of the neural integrated human-computer interaction.",
            "Management of information changes by the use of software agents.",
            "The extended process model--transforming process specifications into ontological representations.",
            "Robustness Gradients for Discrete-time Control Systems.",
            "Approximating the Nonhomogeneous Lognormal Diffusion Process via Polynomial Exogenous Factors.",
            "A Team-oriented Cybernetic Approach for Value-added Quality Auditing.",
            "Design of a Fuzzy Min-max Hyperbox Classifier Using a Supervised Learning Method.",
            "Nonlinear Robust Control for Parallel AC/DC Transmission Systems: a New Adaptive Back-stepping Approach.",
            "The Information Density of Literary Works Through History.",
            "Editorial Retraction.",
            "Supply System Dynamics: Distributed Control in Supply Chains and Networks.",
            "A Pso-based Multivariable Fuzzy Decision-making Predictive Controller for a Once-through 300-MW Power Plant.",
            "A Deep Improver of Two-move Chess Mate Problems.",
            "Adaptive Hyper-fuzzy Partition Particle Swarm Optimization Clustering Algorithm.",
            "A Mixed Integer Dynamic Programming Approach to a Class of Optimal Control Problems in Hybrid Systems.",
            "Intelligent Information, Knowledge, and Technology Management.",
            "Knowledge Management, Knowledge Discovery, and Dynamic Intelligent Data Mining.",
            "Organizational Benefits of Communities of Practice: a Two-stage Information Processing Model.",
            "Developing Heterogeneous Similarity Metrics for Knowledge Administration.",
            "Layer Types: a Concept for Modeling Arrays of Communicating Objects.",
            "The Use of Data Mining to Predict Web Performance.",
            "An Integrated Intelligent Design Advisor System in Engineering Design.",
            "Anomaly Detection in Distributed Computer Communication Systems.",
            "A Multiagent Environment for the Flexible Enactment of Knowledge-intensive Processes.",
            "A Knowledge Base for Intelligent Information Management.",
            "Stability Margin and Spherical Uncertainty.",
            "A Pso-based Method for Extracting Fuzzy Rules Directly from Numerical Data.",
            "Simulating Structural Change in Adaptive Organizations.",
            "A Robust Approach of Fuzzy Clustering on Data Sets with Noise and Outliers.",
            "Data Clustering Using a Reorganizing Neural Network.",
            "Dynamic Fuzzy Owa Model for Evaluating the Risks of Software Development.",
            "Employee Diversity Management in the Context of Dialectial Systems Theory.",
            "A Self-organizing Quantum Neural Fuzzy Network and its Applications.",
            "Performance Evaluation of Open Queueing Networks with Fuzzy Parameters.",
            "An Analytical Development of a Universal Displacement Measurement System for Ultra-precision Metrology."
        ]
    },
    {
        "name": "Cybernetics and Systems",
        "year": "2005",
        "info": "Volume 36, 2005",
        "count": 42,
        "papers": [
            "A Biologically Inspired Hierarchical Reinforcement Learning System.",
            "A Requisitely Holistic View Of Human Resources Management In Innovative Enterprises.",
            "Robustly Stable Model-Following Control Of Uncertain Continuous Time Plants With The Use Of A Correcting Controller.",
            "Estimating Null Values In Relational Database Systems Based On Genetic Algorithms.",
            "Bringing Up Robot: Fundamental Mechanisms For Creating A Self-Motivated, Self-Organizing Architecture.",
            "Fuzzy Measures For Fuzzy Signal-To-Noise Ratios.",
            "A Reinforcement Learning Approach To Congestion Control Of High-Speed Multimedia Networks.",
            "Inference In Gompertz-Type Nonhomogeneous Stochastic Systems By Means Of Discrete Sampling.",
            "Parameters Estimation For Timed And Continuous Petri Nets: Application To The Identification And Monitoring Of Hybrid Systems.",
            "Quality-Of-Service Adaptive Control Of Multimedia Services In Short-Term Resource Reservation Networks.",
            "The Information Model Of Collective Dynamics.",
            "Aggregating Fuzzy Opinions In The Heterogeneous Group Decision-Making Environment.",
            "Regulation problems in explorer agents.",
            "Growing up: emerging complexity in living being.",
            "A new method to construct membership functions and generate weighted fuzzy rules from training instances.",
            "New learning method for cellular neural networks template based on combination between rough sets and genetic programming.",
            "an epidemiological model of knowledge diffusion in virtual learning networks: an application to learning statistics in medicine.",
            "Computing anticipatory property in stochastic differential systems.",
            "Sliding-mode adaptive control for flexible-link manipulators using a composite design.",
            "Increasing the capacity of companies to absorb inventions from research organizations and encouraging people to innovate.",
            "Multiple sliding surface control for systems in nonlinear block controllable form.",
            "A new fuzzy-data mining method for pattern classification by principal component analysis.",
            "Image analysis and fuzzy integration applied to print quality assessment.",
            "Computational methods through genetic algorithms for obtaining stackelberg solutions to two-level integer programming problems.",
            "A topsis-based centroid-index ranking method of fuzzy numbers and its application in decision-making.",
            "Significant fuzzy rules extraction by an SVD-QR-based approach.",
            "Self-generation fuzzy modeling systems through hierarchical recursive-based particle swarm optimization.",
            "A dialog-oriented and gradient-based stability margin in uncertain systems.",
            "A comparison of some fuzzy relation-based linguistic preference models for multiple-factor project assessment.",
            "Adaptive-improved genetic algorithm for the economic dispatch of units with multiple fuel options.",
            "Forecasting fuzzy time series on a heuristic high-order model.",
            "Introduction.",
            "Culture and indigenous knowledge systems: emergent order and the internal regulation of shared symbolic systems.",
            "Cultural algorithms: computational modeling of how cultures learn to solve problems: an engineering example.",
            "Some observations on resilience and robustness in human systems.",
            "on the \"globality hypothesis\" about social/cultural structure: an algebraic solution.",
            "Culture, cultural models, and the division of labor.",
            "Correspondence among mathematical treatments of culture theory.",
            "Self-organizing representations.",
            "On the nature of culture and communication: a complex systems perspective.",
            "The message is the medium: language, culture, and informatics.",
            "Culture and information: an anthropological examination of communication in cultural domains in Pakistan."
        ]
    },
    {
        "name": "Cybernetics and Systems",
        "year": "2004",
        "info": "Volume 35, 2004",
        "count": 47,
        "papers": [
            "Pattern Recognition and Image Analysis in Cybernetic Applications.",
            "Pattern Recognition Approaches for Speech-To-Speech Translation.",
            "Dealing with Color Changes Caused by Natural Illumination in Outdoor Machine Vision.",
            "Multiclass Object Recognition Using Class-Conditional Independent Component Analysis.",
            "A Comparative Study of Contextual Segmentation Methods for Digital Angiogram Analysis.",
            "Two-Dimensional-Three-Dimensional Correspondence in Mammography.",
            "Introduction.",
            "Panel Discussion.",
            "Why Model?",
            "What is \"Formal\" Analysis?",
            "Integrating Anthropological Approaches to the Study of Culture: The \"Hard\" and the \"Soft\".",
            "Mathematical Modeling Issues in Analytical Representations of Human Societies.",
            "Network Analysis and Social Dynamics.",
            "Modeling Context In Punjabi Conflict Resolution: Social Organizations As Context Agents.",
            "An Agent-Based Approach to Cultural (and Linguistic) Change.",
            "The Principles of Cognitive Relativity, Rationality and Clarity: Application to Cultural Theory.",
            "Why a Theory of History is Possible.",
            "Accounting for Human Activity Through Physics.",
            "Comment: Theory And Existence.",
            "Cultural Systems and Organizational Processes: Observations on the Conference Papers.",
            "Thyrotropic Feedback Control: Evidence For An Additional Ultrashort Feedback Loop From Fractal Analysis.",
            "The Genetic Design Of Hybrid Fuzzy Controllers.",
            "Requisitely Holistic ISO 9000 Audit Leads To Continuous Innovation/Improvement.",
            "\"We Can Never Know What Goes On In Somebody Else's Head\": Ernst Von Glasersfeld On Truth And Viability, Language And Knowledge, And The Premises Of Constructivist Education.",
            "Mining Dependent Patterns In Probabilistic Databases.",
            "Real And Virtual Environments In Environmental Engineering: Approaches, Models, Technologies, And Critical Issues.",
            "Computational Intelligence And Environmental Planning.",
            "Sustainable Urban Transportation: A Model-Based Approach.",
            "Design Of Knowledge-Based Systems In Environmental Engineering.",
            "A Gis And Web-Based Decision Support Tool For The Management Of Urban Soils.",
            "A Neural Network Interpretation Of Codons.",
            "Integration Platform For Multi-Agent Systems In Information-Rich Environments.",
            "Integrated Modeling Of Road Traffic Emissions: Application To Lisbon Air Quality Management.",
            "Data Defects In Material Flow Networks--Classification And Approaches.",
            "Descriptive Modeling Of Virtual Transactions.",
            "Guest Editorial Systems Modeling and Simulation for Environmental Management.",
            "A Reduced-Order Photochemical Air Quality Model.",
            "Evaluation of Environmental Impact of Air pollution Sources.",
            "Computational Study on Toxic Gases Released from Compartment Fires Suppressed with Halogenated Agents.",
            "A Web-Based Multi-Agent System for Transportation Management to Protect Our Natural Environment.",
            "DANUBIA: An Integrative Simulation System for Global Change Research in the Upper Danube Basin.",
            "Concurrent Engineering Design for Environment.",
            "Why you should use a relational database instead of a spreadsheet.",
            "eVEREst--Supporting Estimation of Real Estate Value.",
            "Raising Community Awareness About the Environment Through Dynamically Generated Stories.",
            "The Web, The Public, and the Global Warming Debate.",
            "Mobile Environmental Information Systems."
        ]
    },
    {
        "name": "Cybernetics and Systems",
        "year": "2003",
        "info": "Volume 34, 2003",
        "count": 35,
        "papers": [
            "Texture Algorithms: Performance Variability Across Data Sets.",
            "Combined PD-HX Approach To Control Of Flexible Link Manipulators Using Only Directly Measurable Variables.",
            "A New Method To Generate Fuzzy Rules From Relational Database Systems For Estimating Null Values.",
            "On Unbiased Parameter Estimation Of Linear Systems Using Noisy Measurements.",
            "Informal Systems Thinking Or Systems Theory.",
            "A Note On Fuzzy Time Series Model Selection With Sample Autocorrelation Functions.",
            "A New Method For Handling Multicriteria Fuzzy Decision-Making Problems Using FN-Iowa Operators.",
            "Design Of Fuzzy Systems With Fewer Rules.",
            "Fuzzy Activity Times In Critical Path And Project Crashing Problems.",
            "Automatic Classification Of Neural Spike Activity: An Application Of Minimum Distance Classifiers.",
            "Information Filtering For Emergency Management.",
            "A Modified Aggregation Of Fuzzy Opinions Under Group Decision Making.",
            "A New Method To Generate Fuzzy Rules From Training Instances For Handling Classification Problems.",
            "Building Blocks for an Artificial Intelligence Framework in the Field of Legal Evidence, Part I.",
            "About the Authors.",
            "Taking Agents Seriously.",
            "Two Conceptions of Relevance.",
            "Identification and Doing without It, I: A Situational Classification of Misapplied Personal Identity, with a Formalism for a Case of Multiple Usurped Identity in Marivaux.",
            "Identification and Doing without It, II: Visual Evidence for Pinpointing Identity. How Alexander Was Found Out: Purposeful Action, Enlisting Support, Assumed Identity, and Recognition. A Goal-Driven Formal Analysis.",
            "Facets of Abductive Reasoning.",
            "Expanding the Notion of \"Scientific\".",
            "Obituary: Marco Somalvico (1941-2002).",
            "Building Blocks for an Artificial Intelligence Framework in the Field of Legal Evidence, Part II.",
            "Maximal Consistency, Theory of Evidence, and Bayesian Conditioning in the Investigative Domain.",
            "Identification and Doing Without It, III: Authoritative Opinions, Purposeful Action, Relabeled Goods, and Forensic Examinations. The Case of the Stuffed Birds: Its Narrative Dynamics Set in Formulae.",
            "Identification and Doing Without It, IV: A Formal Mathematical Analysis for the Feveroles Case, of Mix-Up of Kinds and Ensuing Litigation; and a Formalism for the \"Cardiff Giant\" Double Hoax.",
            "Identification and Doing Without It, V: A Formal Mathematical Analysis for a Case of Mix-Up of Individuals, and of Recovery from Failure to Attain Identification.",
            "Control Systems Design Driven by Worst-Initial-Energy Sensitivity.",
            "Induction of Knowledge Using Evolutionary Rough Set Theory.",
            "A Humanlike Grasping Force Planner for Object Manipulation by Robot Manipulators.",
            "Aspiration Levels in a Land Use Simulation.",
            "Visual Search Characterized by New Metrics for Scaling and Analysis.",
            "Forecasting for the Univariate Lognormal Diffusion Process with Exogenous Factors.",
            "Adaptive LVQ Classifier for Invariant Face Recognition.",
            "Hybrid Trajectory Planning Using Reinforcement and Backpropagation through Time Techniques."
        ]
    },
    {
        "name": "Cybernetics and Systems",
        "year": "2002",
        "info": "Volume 33, 2002",
        "count": 39,
        "papers": [
            "Forecasting Enrollments Based on High-Order Fuzzy Time Series.",
            "A Method of Managing Complex Fuzzy Information.",
            "An Approach to Trip- and Route-Planning Problems.",
            "Multivariable Fuzzy Generalized Predictive Control.",
            "A Self-Improving Fuzzy Cerebellar Model Articulation Controller with Stochastic Action Generation.",
            "Robot Path Planning Based on Modified Grey Relational Analysis.",
            "Job Sequencing in an Evolutionary Paradigm.",
            "Fuzzy Adaptive Control of Nonlinear Processes with Feedforward Compensator and its Application.",
            "Notional Logic of Systems.",
            "Performance Evaluation of Genetic Algorithms and Evolutionary Programming in Optimization and Machine Learning.",
            "Web Information Monitoring for Competitive Intelligence.",
            "Fuzzy System Design by a GA-Based Method for Data Classification.",
            "Active vs. Passive Approaches to Intelligent Program Diagnosis.",
            "Special Issue on Soft Computing and Intelligent Systems for Industry - Volume I: Advances in Soft Modeling Techniques and Decision Support.",
            "Finding Underlying Factors in Timeseries.",
            "Two-Layer Stabilization of Continuous Neural Networks with Feedbacks.",
            "Adaptation Based on Memory Dynamics in a Chaotic Neural Network.",
            "The Unit RBFNetwork: Experiments and Preliminary Results.",
            "Studs Mating Immigrants in Evolutionary Algorithm to Solve the Earliness-Tardiness Scheduling Problem.",
            "Soft Modeling Support for Managing Knowledge-Based Information Technology (IT) Projects.",
            "Soft Modeling Support for Information Management.",
            "Modeling Fractal Dynamical Systems in the Complex Space. From Macro-Observation to Micro-Observation.",
            "A New Method for Fuzzy Query Processing in Relational Database Systems.",
            "Multivariable Fuzzy PID Control System for Deaerator's and Condenser's Levels in a Thermal Powerunit.",
            "Epistemological and Mathematical Considerations on the Structure of H-Semiotic Systems.",
            "Editorial.",
            "Multiagent System for Condition-Monitoring Applications.",
            "Parameter Settings and Representations in Pareto-Based Optimization for Job Shop Scheduling.",
            "Practical Intelligent Support for Rule Discovery in Fault Management Systems.",
            "Automatic Music Transcription and Audio Source Separation.",
            "Review of Intelligent Software Architectures for the Development of An Intelligent Decision Support System for Design Process Planning in Concurrent Engineering.",
            "Evaluation of Information Technology Projects.",
            "Modeling A Control System For Organizational Processes.",
            "Generating Fuzzy Rules From Training Data Containing Noise For Handling Classification Problems.",
            "Adaptive Control Of Manipulators With Improved Adaptation Transients By Using On-Line Supervision Of The Free-Parameters Of The Adaptation Algorithm And Of The Sampling Rate.",
            "Perspectives On The History Of The Cybernetics Movement: The Path To Current Research Through The Contributions Of Norbert Wiener, Warren Mcculloch, and John von Neumann.",
            "Model Management For Hierarchically Structured Models And Its Application.",
            "Sufficient Conditions For f-Stability Of Linear Time-Delay Systems.",
            "Improved Convergence Through Dynamic Programming Approach."
        ]
    },
    {
        "name": "Cybernetics and Systems",
        "year": "2001",
        "info": "Volume 32, 2001",
        "count": 41,
        "papers": [
            "Imitation in Natural and Artificial Systems.",
            "Like Me?- Measures of Correspondence and Imitation.",
            "Imitation in Animals: Evidence, Function, and Mechanisms.",
            "Body Imitation in an Enculturated Orangutan (pongo Pygmaeus).",
            "A Model of Imitation Learning of Algorithms from Worked Examples.",
            "Learning Motor Skills by Imitation: a Biologically Inspired Robotic Model.",
            "The Mechanisms of Imitation.",
            "Evolution and Memes: the Human Brain as a Selective Imitation Device.",
            "The Role of Hierarchy Levels in Vocal Imitations of Songbirds.",
            "Imitative versus Nonimitative Strategies in a Land-use Simulation.",
            "Preface.",
            "Time's Arrow in Particle Physics.",
            "Nonlocality and the Time-ordering of Events.",
            "Open Quantum Systems and Complete Positivity.",
            "Unavoidable Quantum Losses in Zeno-like Neutron Experiments.",
            "Time Operator in Quantum Mechanics and some Stochastic Processes with Long Memory.",
            "The Evolution of Perception.",
            "The Cognitive Ratchet - the Ratchet Effect as a Fundamental Principle in Evolution and Cognition.",
            "Irreversibility in Models of Macroevolution.",
            "Making Waves: the Paradigms of Developmental Biology and their Impact on Artificial Life and Embryonics.",
            "Grounding Emotions in Adaptive Systems: Volume I.",
            "Machinery for Artificial Emotions.",
            "Emotions and Adaptation in Autonomous Agents: a Design Perspective.",
            "Emotion-triggered Learning in Autonomous Robot Control.",
            "The Grounding Problem of Modeling Emotions in Adaptive Artifacts.",
            "Grounding Emotions in Adaptive Systems: Volume Ii.",
            "From Toda's Urge Theory to the Commitment Theory of Emotions.",
            "Emotional Learning: a Computational Model of the Amygdala.",
            "Self-learning Agents: a Connectionist Theory of Emotion Based on Crossbar Value Judgment.",
            "An Architecture of Emotion-based Behavior Selection for Mobile Robots.",
            "Intelligent Enterprise Management.",
            "Urging Desire: Motivational Mechanisms for Intelligent Agents with Minds of their Own.",
            "Developing Agile Manufacturing Strategy with Awesim Simulation Platform.",
            "Internet Based Design System for Globally Distributed Concurrent Engineering.",
            "A Blackboard Database Model of the Design Planning Process in Concurrent Engineering.",
            "Research Issues in E-commerce and Product Development.",
            "Nonlinear Controller Design Based on Optimal Matrix Assignment.",
            "Vibration Control of a Class of Generalized Gradient Systems.",
            "An Expertise Model for Therapy Planning Using Abductive Reasoning.",
            "Formal Validation and Verification of Atomic Resolution Microscope Control and Topography.",
            "Aggregation of Fuzzy Numbers in a Decision-making Situation."
        ]
    },
    {
        "name": "Cybernetics and Systems",
        "year": "2000",
        "info": "Volume 31, 2000",
        "count": 43,
        "papers": [
            "Reactive Agent Design for Intelligent Tutoring Systems.",
            "Pattern Modelling in Time-series Forecasting.",
            "Robust Adaptive Control for Robot Manipulators with Unmodelled Dynamics.",
            "Discover: an Intelligent Discovery Programming System.",
            "Reinforcement Linearization Control System.",
            "Uncertainty and Complementarity Principles in Ecological Models.",
            "Membership Functions Shape and its Influence on the Dynamical Behaviour of Fuzzy Logic Controller.",
            "Robust Hinfinity Control for Systems with Time-varying Parameter Uncertainty and Variance Constraints.",
            "Decentralized Robust Control Design for a Class of Similar Composite Systems with Uncertainties.",
            "Computational Methods through Genetic Algorithms for Obtaining Stackelberg Solutions to Two-level Mixed Zero-one Programming Problems.",
            "Editorial Special Issue on Intelligent Methods for Performance Enhancement in Industrial Systems Volume I: Soft Modelling and Simulation Tools for Decision Support.",
            "Ai and Intelligent Industrial Applications: the Rough Set Perspective.",
            "An Analysis of Neural Networks as Simulators and Emulators.",
            "The Inference Based on Molecular Computing.",
            "Application of Fuzzy Logic in Environmental Risk Assessment: some Thoughts on Fuzzy Sets.",
            "Simulation Modelling for Complex Production Systems.",
            "Membership Functions Shape and its Influence on the Stability of Fuzzy Control Systems.",
            "The Theory of Viable Joint Ventures.",
            "Virtual Communities and their Network Support: a Cybernetic Analysis.",
            "Selection of Surgical Residents: a Neural Network Approach.",
            "\"talk with the Experts\": Learning Management Decision-making Using Cai.",
            "Editorial for Special Issue on Intelligent Methods for Performance Enhancement in Industrial Systems Volume Ii: Intelligent Systems Development - Tools and Methodologies.",
            "Inductive Learning for Parameter Optimization.",
            "A Connectionist Method to Solve Job Shop Problems.",
            "Knowledge Management in Creating Hybrid Systems for Environmental Protection.",
            "Procedures of Designing Enterprise Network Communication Subsystems.",
            "Using Computational Intelligence in Fuzzy Engineering Design.",
            "Intelligold - an Expert System for Gold Plant Process Design.",
            "Theory of Quantized Systems: Devs Simulation of Perceiving Agents.",
            "Searching for Patterns in Political Event Sequences: Experiments with the Keds Database.",
            "Binary Control of Fermentation Processes.",
            "Firing Sequences and Firing Frequencies Estimation for Timed Petri Nets.",
            "Multituning Fuzzy Control Systems Design.",
            "A Robust Terminal Sliding Composite Adaptive Control Scheme for Rigid Robots.",
            "Design of Supervisory Control Functions Based on Feedforward Neural Networks.",
            "A New Method for Constructing Fuzzy Decision Trees and Generating Fuzzy Classification Rules from Training Examples.",
            "Realizing Fine Quality Real-time Fuzzy Control by a Simple Algorithm.",
            "Parametric Identification of Linear Noisy Input-output Systems.",
            "Obituary Robbin R. Hough, 1933-1999.",
            "A Fuzzy Self-learning Position Control of Hydraulic Drive.",
            "A Parameter-based Combined Classifier for Invariant Face Recognition.",
            "Estimating Null Values in the Distributed Relational Databases Environment.",
            "Position Control Employing Fuzzy-sliding Mode and Genetic Algorithms with a Modified Evolutionary Direction Operator."
        ]
    },
    {
        "name": "Cybernetics and Systems",
        "year": "1999",
        "info": "Volume 30, 1999",
        "count": 42,
        "papers": [
            "Cellular Meiosis: a System-linkage Theoretic Approach.",
            "Fuzzy Sliding Mode Controller Design: Indirect Adaptive Approach.",
            "On the Zero Decoupling Structures of Cascade-parallel Interconnected Systems.",
            "Robust Output Tracking Control for Nonlinear Interconnected Systems with Similar Structure.",
            "Evaluating the Rate of Aggregative Risk in Software Development Using Fuzzy Set Theory.",
            "Editorial Special Issue, Papers from the 1997 Meeting of the American Society for Cybernetics (part I).",
            "The Origins and Purposes of several Traditions in Systems Theory and Cybernetics.",
            "The Cybernetic Insights of Jean Piaget.",
            "What Is a Number?",
            "Computational Embodiment: Constructing Autonomous Software Systems.",
            "Autonomous Agents in User Interfaces.",
            "Information and Self-organization Revisited via Complex-valued Fractional Brownian Motion of Order N.",
            "A Note on the Maximum Missed-opportunity Cost Incurred by Minimizing Expected Losses in Genetic Algorithms.",
            "Voltage/reactive Power Control via Fuzzy Linear Programming Approach.",
            "Design of a Therapeutic Specialist for Acute Myocardial Infarct.",
            "Systems Approach to the Concept of Mutation.",
            "The Process Equation: Formulating and Testing the Process Theory of Systems.",
            "Editorial: Special Issue: Papers from the 1997 Meeting of the American Society for Cybernetics (part Ii).",
            "On the Theory and Psychology of Knowing and Learning and its Application to Qualitative Evaluation.",
            "\"cyberethics\": a Panel Discussion.",
            "The Stories of Ethics: Ethical Comportment and the Stories We Tell.",
            "An Analysis of Experience Replay in Temporal Difference Learning.",
            "A Formal Model of Organizational Argumentation: Applications of Informal Logic to a Committee Meeting.",
            "Towards a Logical Reconstruction of Information Retrieval Theory.",
            "Coincidences Are not Accidental: a Theorem.",
            "An Improver of Chess Problems.",
            "Challenging the Computational Metaphor: Implications for How We Think.",
            "A Generic Spatial Temporal Computation Model for Systemic Multimedia Presentations.",
            "Towards a Unified Messaging Environment over the Internet.",
            "Efficiency of Decomposition Method for Structured Multiobjective Linear Programming Problems with Fuzzy Numbers.",
            "Category-functor Modelling of Natural Systems.",
            "A Text Theory of Ecological System.",
            "Ila-2: an Inductive Learning Algorithm for Knowledge Discovery.",
            "A Genetic Navigation Algorithm for Autonomous Mobile Robots.",
            "Fuzzy Sliding Mode Control Systems with Adaptive Estimation.",
            "Dyadic Time, Dyadic Systems, and Evolution Operators.",
            "Statistical Linguistic Laws in Ecological Models.",
            "Fuzzy Logic Operators in Decision-making.",
            "Factor Selections for a System Development Process.",
            "Model Integration for Managerial Decision Support Using a Model Description Language with a Formal Semantics.",
            "Robust Decentralized Hinfinity Control for Nonlinear Interconnected Systems with Uncertainty.",
            "The Austrian Research Institute for Artificial Intelligence: a Short Presentation."
        ]
    },
    {
        "name": "Cybernetics and Systems",
        "year": "1998",
        "info": "Volume 29, 1998",
        "count": 45,
        "papers": [
            "Compression and Expansion of Fuzzy Rule Bases by Using Crisp-fuzzy Neural Networks.",
            "System-linkage: Structural Functions and Hierarchies.",
            "Concept of Visual Interfaces to Coordinate Real-time Decision Making in Hierarchical Structures.",
            "Unified Simulation Model of Medical Laboratory Organization.",
            "Adaptive Control for Nonlinear Systems Using Decomposed Neural Network.",
            "Changing Paradigms in Operational Research.",
            "A Cell Decomposition-based Collision Avoidance Algorithm for Robot Manipulators.",
            "A Clustering and Genetic Scheme for Large Tsp Optimization Problems.",
            "Efficient Derivation of the Optimal Assembly Sequence from Product Description.",
            "Learning Design Knowledge as Generalization.",
            "Obituary: Silvio Ceccato (1914-1997).",
            "Modeling Economic Learning as Modeling.",
            "Coping with Cyberspace.",
            "Concept Representation with Overlapping Feature Intervals.",
            "Implementation of Intelligent Controllers on Digital Signal Processors.",
            "Neural Network Modeling of Fermentation Processes: Specific Kinetic Rate Models.",
            "Uncolorable Trivalent Graphs.",
            "The Process Equation.",
            "Aggregating Fuzzy Opinions in the Group Decision-making Environment.",
            "Two-stage Identification and its Application to Robust Lqg Controller Design.",
            "On Generating Fuzzy Rules by an Evolutionary Approach.",
            "Optimizing Complex Functions by Chaos Search.",
            "Editorial.",
            "Nonmonotonic Temporal Reasoning: a Logic-based Approach to Declarative Modeling.",
            "A Self-organizing Model for Scheduling Distributed Autonomous Manufacturing Systems.",
            "System Modeling and Simulation for Predictive Maintenance.",
            "Management of Quality of Service with Software Agents.",
            "Design of Consistent Enterprise Models.",
            "Constructivism and Phenomenology What Do They Have in Common, and How Can They Be Told Apart?",
            "Information Filtering of on-line News Using Dynamic Abstract Generation.",
            "School Scheduling Using Threshold Accepting.",
            "Fuzzy Ordering on the Basis of Multicriteria Aggregation.",
            "Co-states, Constraints, and Diagrammatic Reasoning.",
            "Editorial for Special Issue on Intelligent Modelling and Simulation for Complex Systems, Volume Ii: Intelligent Modelling Tools.",
            "Genetic Algorithms: a Tool for Modelling, Simulation, and Optimization of Complex Systems.",
            "Rough Set Theory and its Applications to Data Analysis.",
            "Flexible Neuro-fuzzy Simulation Based on Abstract Model and Interface Definitions.",
            "Fuzzy Logic Application in Ergonomic Renewal of Multiagent Manufacturing Systems.",
            "Blackboard Approach in Design Planning for Concurrent Engineering Environment.",
            "What It Means to Be \"situated\".",
            "Multiple Interacting Programs: a Representation for Evolving Complex Behavior.",
            "On the Path Planning Problem in the Vicinity of Obstacles.",
            "The Use of Conventional and Minplus Algebra for the Modeling of Hybrid Petri Nets.",
            "Coevolutionary Genetic Algorithms for Nonconvex Nonlinear Programming Problems: Revised Genocop Iii.",
            "Identification of an Open System by its Resources."
        ]
    },
    {
        "name": "Cybernetics and Systems",
        "year": "1997",
        "info": "Volume 28, 1997",
        "count": 39,
        "papers": [
            "Wavelets in High-resolution Radar Imaging and Clinical Magnetic Resonance Tomography.",
            "Letter from the Editor.",
            "Mental Imagery as a Design Tool.",
            "Long-range Correlations in Computer Programs.",
            "Qualitative Support for Knowledge Retrieval for Autonomous Agents.",
            "Contributions to Data Envelopment Analysis.",
            "A Knowledge-based Method for Fuzzy Query Processing for Document Retrieval.",
            "Priorities as a Basis for Control in Nonsequential Systems.",
            "Hierarchy: a Method for Analysis and Synthesis of Hierarchies and Networks.",
            "For Nonlinearity in the Heartbeat Time Series.",
            "Searching for Language Mechanisms in the Brain.",
            "Synergies between Statistical Data Analysis and Neural Networks in the Control of Rotary Blood Pumps.",
            "Application of Wavelet Transform to Compression of Mechanical Vibration Data.",
            "An Interactive Fuzzy Satisficing Method for Multiobjective Linear Fractional Programs with Block Angular Structure.",
            "Variable Structure Control of Two Manipulators Handling a Constrained Object.",
            "Some Unsolved Problems in General Systems Theory (i).",
            "Maximum Entropy Principle in Fields of Probabilities. Application to Self-organizing Systems.",
            "Combining Creativity and Expertise.",
            "Determination of Optimal Bidding Profit Rate by Fuzzy Set Theory.",
            "Epistemological Aspects of Embodied Artificial Intelligence.",
            "Merleau-ponty, Embodied Cognition, and the Problem of Intentionality.",
            "The Epistemology of Autism: Making a Case for an Embodied, Dynamic, and Historical Explanation.",
            "I Could Be You: the Phenomenological Dimension of Social Understanding.",
            "Epistemological Aspects of Embodied Artificial Intelligence.",
            "Studying the Role of Embodiment in Cognition.",
            "Postmodular Systems: Architectural Principles for Cognitive Robotics.",
            "Emergence of Representation in Autonomous Agents.",
            "Autonomous Agents as Embodied Ai.",
            "Responsiveness in Dialog and Priorities for Language Research.",
            "A Comparison of List Scheduling Heuristics for Communication Intensive Task Graphs.",
            "Simple Asymptotic Stabilizing Control Laws for Linear Time-invariant Hybrid Systems.",
            "Knowledge-based Academic Advising Systems: Survey, Evaluation, and Recommendations.",
            "Some Unsolved Problems in General Systems Theory (ii).",
            "On the Calculation of the Transfer Function of Timed Event Petri Nets.",
            "Input/output Linearization for Nonlinear Systems with Uncertainties and Disturbances Using Tdc.",
            "Cybernetics of Conceptual Systems.",
            "Fuzzy Direct Adaptive Control for a Class of Decentralized Nonlinear Systems.",
            "Application of Fuzzy Set Theory to Electric Car Control.",
            "Generating Fuzzy Rules from Relational Database Systems for Estimating Null Values."
        ]
    },
    {
        "name": "Cybernetics and Systems",
        "year": "1980",
        "info": "Volume 10, 1980",
        "count": 22,
        "papers": [
            "Fuzzy Sets, Probabilities, and Decision.",
            "A Cybernetic Model of the Mbo Process.",
            "An Isomorphism of Control in Natural, Social, and Cybernetic Systems.",
            "Hierarchical Dynamic Optimization for Linear Discrete Systems.",
            "Using the Data Base as a Semantic Component to Aid in the Parsing of Natural Language Data Base Queries.",
            "Factors Affecting the Comparative Advantages of Sequential and Batched Decision Making.",
            "Organizational Behavior: a Vector of Single-valued Transformations within a Determinate Machine.",
            "Applications of Fuzzy Set Theory to Image Sciences.",
            "Fuzzy Subsets of Type Ii in Decisions.",
            "Simulation Results on the Evaluation of Economic Policies.",
            "A Foundation for a Theory of Possibility.",
            "Hierarchical Shape Description Based upon Convex Hulls of Concavities.",
            "Sequential Partition Detectors with Dependent Sampling.",
            "Shape Descriptors for Labeling Concavity Trees.",
            "Basic Concepts on the Theoretical Treatment of Cybernetic Queueing Systems.",
            "A Linguistic Variable for Importance of Fuzzy Sets.",
            "Properties of Analogue Neural Networks.",
            "Hi & Low-in & Out: Approaches to Social Status.",
            "Consciousness: and so On.",
            "Epistemology, Semantics, and Self-reference.",
            "Myocybernetics-a New Development in Neuromuscular Control.",
            "A System of Problems and How to Deal with It."
        ]
    }
]