[
    {
        "name": "FCS",
        "year": "2022",
        "info": "Volume 16: 2022",
        "count": 112,
        "papers": [
            "GridNet: efficiently learning deep hierarchical representation for 3D point cloud understanding.",
            "Understanding the role of human-inspired heuristics for retrieval models.",
            "Label distribution for multimodal machine learning.",
            "The LP-rounding plus greed approach for partial optimization revisited.",
            "OCSO-CA: opposition based competitive swarm optimizer in energy efficient IoT clustering.",
            "Improving accuracy of automatic optical inspection with machine learning.",
            "Cross-scene passive human activity recognition using commodity WiFi.",
            "An efficient memory data organization strategy for application-characteristic graph processing.",
            "A novel threshold changeable secret sharing scheme.",
            "MSDA: multi-subset data aggregation scheme without trusted third party.",
            "Weapon-target assignment in unreliable peer-to-peer architecture based on adapted artificial bee colony algorithm.",
            "LIDAR: learning from imperfect demonstrations with advantage rectification.",
            "IP-geolocater: a more reliable IP geolocation algorithm based on router error training.",
            "Implementing a sidechain-based asynchronous DPKI.",
            "A framework combines supervised learning and dense subgraphs discovery to predict protein complexes.",
            "DeepM6ASeq-EL: prediction of human N6-methyladenosine (m6A) sites with LSTM and ensemble learning.",
            "Side-channel analysis attacks based on deep learning network.",
            "Cancer classification with data augmentation based on generative adversarial networks.",
            "Return just your search: privacy-preserving homoglyph search for arbitrary languages.",
            "Automated detection on the security of the linked-list operations.",
            "THS-GWNN: a deep learning framework for temporal network link prediction.",
            "Relation Reconstructive Binarization of word embeddings.",
            "An improved branching algorithm for the proper interval edge deletion problem.",
            "Spatio-temporal keyword query in semantic trajectories.",
            "A comprehensive study on fault tolerance in stream processing systems.",
            "EcoVis: visual analysis of industrial-level spatio-temporal correlations in electricity consumption.",
            "iNet: visual analysis of irregular transition in multivariate dynamic networks.",
            "Defocus blur detection using novel local directional mean patterns (LDMP) and segmentation via KNN matting.",
            "Semantic and secure search over encrypted outsourcing cloud based on BERT.",
            "Improvement on a batch authenticated key agreement scheme.",
            "Robust watermarking of databases in order-preserving encrypted domain.",
            "TransRec++: Translation-based sequential recommendation with heterogeneous feedback.",
            "A bi-metric autoscaling approach for n-tier web applications on kubernetes.",
            "Local feature aggregation algorithm based on graph convolutional network.",
            "Similarity-based privacy protection for publishing k-anonymous trajectories.",
            "A subgraph matching algorithm based on subgraph index for knowledge graph.",
            "Speech-driven facial animation with spectral gathering and temporal attention.",
            "New construction of highly nonlinear resilient S-boxes via linear codes.",
            "Mean estimation over numeric data with personalized local differential privacy.",
            "An optimal differentially private data release mechanism with constrained error.",
            "Dynamic road crime risk prediction with urban open data.",
            "Multi-key FHE without ciphertext-expansion in two-server model.",
            "A verifiable privacy-preserving data collection scheme supporting multi-party computation in fog-based smart grid.",
            "A simple construction of CRT-based ideal secret sharing scheme and its security extension based on common factor.",
            "ForkXplorer: an approach of fork summary generation.",
            "Probabilistic synthesis against GR(1) winning condition.",
            "Towards better entity linking.",
            "Accelerating the cryo-EM structure determination in RELION on GPU cluster.",
            "Full friendly index sets of mCn.",
            "An improved multi-attribute decision-making based network selection algorithm for heterogeneous vehicular network.",
            "On the use of formal methods to model and verify neuronal archetypes.",
            "Compressed page walk cache.",
            "Model-based automated testing of JavaScript Web applications via longer test sequences.",
            "Mask guided diverse face image synthesis.",
            "On the learning dynamics of two-layer quadratic neural networks for understanding deep learning.",
            "Transferring priors from virtual data for crowd counting in real world.",
            "SCENERY: a lightweight block cipher based on Feistel structure.",
            "Collaborative eye tracking based code review through real-time shared gaze visualization.",
            "Exploiting user behavior learning for personalized trajectory recommendations.",
            "K-ary search tree revisited: improving construction and intersection efficiency.",
            "Monotonicity and nonmonotonicity in L3-valued propositional logic.",
            "SCARE and power attack on AES-like block ciphers with secret S-box.",
            "Exploring associations between streetscape factors and crime behaviors using Google Street View images.",
            "Accelerating temporal action proposal generation via high performance computing.",
            "Nighttime image dehazing using color cast removal and dual path multi-scale fusion strategy.",
            "Handling class imbalance problem in software maintainability prediction: an empirical investigation.",
            "Pusher: an augmented fuzzer based on the connection between input and comparison operand.",
            "Controllable data synthesis method for grammatical error correction.",
            "Polynomial stacked-attention network for nationality classification.",
            "Improving deep reinforcement learning by safety guarding model via hazardous experience planning.",
            "DRPS: efficient disk-resident parameter servers for distributed machine learning.",
            "The parametric complexity of bisimulation equivalence of normed pushdown automata.",
            "Demystifying Ethereum account diversity: observations, models and analysis.",
            "Image copy-move forgery passive detection based on improved PCNN and self-selected sub-images.",
            "An efficient and authenticated key establishment scheme based on fog computing for healthcare system.",
            "Precise sensitivity recognizing, privacy preserving, knowledge graph-based method for trajectory data publication.",
            "Flexibility and rigidity index for chromosome packing, flexibility and dynamics analysis.",
            "Disclosing incoherent sparse and low-rank patterns inside homologous GPCR tasks for better modelling of ligand bioactivities.",
            "SeBROP: blind ROP attacks without returns.",
            "Disk based pay-as-you-go record linkage.",
            "Self-corrected unsupervised domain adaptation.",
            "Challenges and future directions of secure federated learning: a survey.",
            "Exploiting natural language services: a polarity based black-box attack.",
            "Informative and diverse emotional conversation generation with variational recurrent pointer-generator.",
            "Citywide package deliveries via crowdshipping: minimizing the efforts from crowdsourcers.",
            "Multiband decomposition and spectral discriminative analysis for motor imagery BCI via deep neural network.",
            "Line drawing via saliency map and ETF.",
            "Towards a better prediction of subcellular location of long non-coding RNA.",
            "A survey of discourse parsing.",
            "A mobile edge computing-based applications execution framework for Internet of Vehicles.",
            "Endowing rotation invariance for 3D finger shape and vein verification.",
            "Metric learning for domain adversarial network.",
            "Performance optimization for cloud computing systems in the microservice era: state-of-the-art and research opportunities.",
            "Effort-aware cross-project just-in-time defect prediction framework for mobile apps.",
            "Exploiting comments information to improve legal public opinion news abstractive summarization.",
            "ResLNet: deep residual LSTM network with longer input for action recognition.",
            "A survey of music emotion recognition.",
            "Distant supervised relation extraction based on residual attention.",
            "Graph convolution machine for context-aware recommender system.",
            "String kernels construction and fusion: a survey with bioinformatics application.",
            "Revenue-maximizing online stable task assignment on taxi-dispatching platforms.",
            "Defense against local model poisoning attacks to byzantine-robust federated learning.",
            "Referring image segmentation with attention guided cross modal fusion for semantic oriented languages.",
            "Super solutions of the model RB.",
            "Data fusing and joint training for learning with noisy labels.",
            "CrowdDesigner: information-rich and personalized product description generation.",
            "Instance-sequence reasoning for video question answering.",
            "Power diagram based algorithm for the facility location and capacity acquisition problem with dense demand.",
            "Verifiable searchable symmetric encryption for conjunctive keyword queries in cloud storage.",
            "An approach for detecting LDoS attack based on cloud model.",
            "On the hardness of NTRU problems.",
            "A structural variation genotyping algorithm enhanced by CNV quantitative transfer."
        ]
    },
    {
        "name": "FCS",
        "year": "2021",
        "info": "Volume 15: 2021",
        "count": 96,
        "papers": [
            "SSDBA: the stretch shrink distance based algorithm for link prediction in social networks.",
            "Improving neural sentence alignment with word translation.",
            "Pointwise manifold regularization for semi-supervised learning.",
            "Determining node duty cycle using Q-learning and linear regression for WSN.",
            "Proactive planning of bandwidth resource using simulation-based what-if predictions for Web services in the cloud.",
            "Evaluating the usage of fault localization in automated program repair: an empirical study.",
            "Software debugging analysis based on developer behavior data.",
            "Biologically inspired visual computing: the state of the art.",
            "A framework based on sparse representation model for time series prediction in smart city.",
            "Where to go? Predicting next location in IoT environment.",
            "Entity set expansion in knowledge graph: a heterogeneous information network perspective.",
            "A survey of density based clustering algorithms.",
            "Mathematical model and simulated annealing algorithm for Chinese high school timetabling problems under the new curriculum innovation.",
            "Fingerprint matching, spoof and liveness detection: classification and literature review.",
            "Information retrieval: a view from the Chinese IR community.",
            "k-dominant Skyline query algorithm for dynamic datasets.",
            "Adversarial network embedding using structural similarity.",
            "Transportation mode detection using cumulative acoustic sensing and analysis.",
            "Integrating heterogeneous thesauruses for Chinese synonyms.",
            "An automated framework for advertisement detection and removal from sports videos using audio-visual cues.",
            "iMass: an approximate adaptive clustering algorithm for dynamic data using probability based dissimilarity.",
            "DFD-Net: lung cancer detection from denoised CT scan image using deep learning.",
            "A proactive secret sharing scheme based on Chinese remainder theorem.",
            "Ethereum smart contract security research: survey and future research opportunities.",
            "On designing an unaided authentication service with threat detection and leakage control for defeating opportunistic adversaries.",
            "A novel chaotic butterfly network topology based block scrambling and crown graph based bit-wise diffusion for image encryption.",
            "Simple index based symmetric searchable encryption with result verifiability.",
            "Predicting protein subchloroplast locations: the 10th anniversary.",
            "Migration of existing software systems to mobile computing platforms: a systematic mapping study.",
            "Evolutionary selection for regression test cases based on diversity.",
            "Task assignment for social-oriented crowdsourcing.",
            "Hierarchical data replication strategy to improve performance in cloud computing.",
            "An evaluation and query algorithm for the influence of spatial location based on RkNN.",
            "Attention based simplified deep residual network for citywide crowd flows prediction.",
            "Accurate and efficient follower log repair for Raft-replicated database systems.",
            "Optimal location query based on k nearest neighbours.",
            "The mass, fake news, and cognition security.",
            "Fine-grained management of I/O optimizations based on workload characteristics.",
            "Practical age estimation using deep label distribution learning.",
            "Detecting differential transcript usage across multiple conditions for RNA-seq data based on the smoothed LDA model.",
            "Tile selection method based on error minimization for photomosaic image creation.",
            "A novel DNA-inspired encryption strategy for concealing cloud storage.",
            "A survey of Intel SGX and its applications.",
            "Physical layer authentication for automotive cyber physical systems based on modified HB protocol.",
            "Resource abstraction and data placement for distributed hybrid memory pool.",
            "An integrated pipeline model for biomedical entity alignment.",
            "DOF: a generic approach of domain ontology fuzzification.",
            "Nested relation extraction with iterative neural network.",
            "Find truth in the hands of the few: acquiring specific knowledge with crowdsourcing.",
            "Unpaired image to image transformation via informative coupled generative adversarial networks.",
            "VColor*: a practical approach for coloring large graphs.",
            "Efficient k-dominant skyline query over incomplete data using MapReduce.",
            "An efficient indexing structure for multi-dimensional range query.",
            "A time-aware hybrid recommendation scheme combining content-based and collaborative filtering.",
            "Using BiLSTM with attention mechanism to automatically detect self-admitted technical debt.",
            "Rich-text document styling restoration via reinforcement learning.",
            "On the analysis of ant colony optimization for the maximum independent set problem.",
            "A systematic study on the role of SentiWordNet in opinion mining.",
            "Performance analysis of ASR system in hybrid DNN-HMM framework using a PWL euclidean activation function.",
            "Sub-Nyquist spectrum sensing and learning challenge.",
            "A comprehensive perspective of contrastive self-supervised learning.",
            "Compositional metric learning for multi-label classification.",
            "Sememe knowledge computation: a review of recent advances in application and expansion of sememe knowledge bases.",
            "An improved multi-objective evolutionary algorithm for computation offloading in the multi-cloudlet environment.",
            "ABDKS: attribute-based encryption with dynamic keyword search in fog computing.",
            "A multi-objective reinforcement learning algorithm for deadline constrained scientific workflow scheduling in clouds.",
            "Variant quantifiers in L3-valued first-order logic.",
            "A semi-transparent selective undo algorithm for multi-user collaborative editors.",
            "DP-UserPro: differentially private user profile construction and publication.",
            "Model learning: a survey of foundations, tools and applications.",
            "HSAEP: a new platform to evaluate hybrid simulation algorithms.",
            "MiTAR: a study on human activity recognition based on NLP with microscopic perspective.",
            "Multi-affect(ed): improving recommendation with similarity-enhanced user reliability and influence propagation.",
            "A quality status encoding scheme for PCB-based products in IoT-enabled remanufacturing.",
            "WOBTree: a write-optimized B+-tree for non-volatile memory.",
            "Parallel exploration via negatively correlated search.",
            "A Monte Carlo Neural Fictitious Self-Play approach to approximate Nash Equilibrium in imperfect-information dynamic games.",
            "Siamese single object tracking algorithm with natural language prior.",
            "Follow the perturbed approximate leader for solving semi-bandit combinatorial optimization.",
            "A novel privacy preserving data aggregation scheme with data integrity and fault tolerance for smart grid communications.",
            "WaveLines: towards effective visualization and analysis of stability in power grid simulation.",
            "Image smog restoration using oblique gradient profile prior and energy minimization.",
            "piEnPred: a bi-layered discriminative model for enhancers and their subtypes via novel cascade multi-level subset feature selection algorithm.",
            "Experience report: investigating bug fixes in machine learning frameworks/libraries.",
            "Adaptive watermark generation mechanism based on time series prediction for stream processing.",
            "An algorithm for solving satisfiability problem based on the structural information of formulas.",
            "Wi-Fi based non-invasive detection of indoor wandering using LSTM model.",
            "Heterogeneous-attributes enhancement deep framework for network embedding.",
            "Privacy preserving secure expansive aggregation with malicious node identification in linear wireless sensor networks.",
            "IBEET-AOK: ID-based encryption with equality test against off-line KGAs for cloud medical services.",
            "User-level failure detection and auto-recovery of parallel programs in HPC systems.",
            "Derivative-free reinforcement learning: a review.",
            "BIC-based node order learning for improving Bayesian network structure learning.",
            "Brain tumor localization and segmentation using mask RCNN.",
            "RS-store: RDMA-enabled skiplist-based key-value store for efficient range query.",
            "Accelerated algorithms for maximizing average happiness ratio in databases."
        ]
    },
    {
        "name": "FCS",
        "year": "2020",
        "info": "Volume 14: 2020",
        "count": 101,
        "papers": [
            "Compiler testing: a systematic literature analysis.",
            "Computer comparisons in the presence of performance variation.",
            "SLA-driven container consolidation with usage prediction for green cloud computing.",
            "Towards functional verifying a family of systemC TLMs.",
            "Ordinal factorization machine with hierarchical sparsity.",
            "A syntactic path-based hybrid neural network for negation scope detection.",
            "Automatic façade recovery from single nighttime image.",
            "A verification framework for spatio-temporal consistency language with CCSL as a specification language.",
            "Uncertain multicast under dynamic behaviors.",
            "AAMcon: an adaptively distributed SDN controller in data center networks.",
            "A survey of uncertain data management.",
            "Popular route planning with travel cost estimation from trajectories.",
            "HGeoHashBase: an optimized storage model of spatial objects for location-based services.",
            "Dynamic data auditing scheme for big data storage.",
            "New multi-objective approach for dynamic risk-driven intrusion responses.",
            "Answering range-based reverse kNN and why-not reverse kNN queries.",
            "Erratum to: Relative manifold based semi-supervised dimensionality reduction.",
            "Erratum to: Cuckoo search with varied scaling factor.",
            "Retraction Note: Sustainable cost and energy consumption analysis for cloud data centers.",
            "A survey on ensemble learning.",
            "Optimized high order product quantization for approximate nearest neighbors search.",
            "Leveraging proficiency and preference for online Karaoke recommendation.",
            "Graph-ranking collective Chinese entity linking algorithm.",
            "Abnormal event detection via the analysis of multi-frame optical flow information.",
            "NEXT: a neural network framework for next POI recommendation.",
            "Real-time manifold regularized context-aware correlation tracking.",
            "A primal perspective for indefinite kernel SVM problem.",
            "Enjoy the most beautiful scene now: a memetic algorithm to solve two-fold time-dependent arc orienteering problem.",
            "Sichuan dialect speech recognition with deep LSTM network.",
            "Meta-path-based outlier detection in heterogeneous information network.",
            "A unified latent variable model for contrastive opinion mining.",
            "Real-time visual tracking using complementary kernel support correlation filters.",
            "A survey of autoencoder-based recommender systems.",
            "iRNA-PseTNC: identification of RNA 5-methylcytosine sites using hybrid vector space of pseudo nucleotide composition.",
            "Transparent partial page migration between CPU and GPU.",
            "TRAP: trace runtime analysis of properties.",
            "A correlative denoising autoencoder to model social influence for top-N recommender system.",
            "Bangla language modeling algorithm for automatic recognition of hand-sign-spelled Bangla sign language.",
            "Connection models for the Internet-of-Things.",
            "Hybritus: a password strength checker by ensemble learning from the query feedbacks of websites.",
            "Evaluating and improving the interpretability of item embeddings using item-tag relevance information.",
            "Perspectives on search strategies in automated test input generation.",
            "Varna-based optimization: a novel method for capacitated controller placement problem in SDN.",
            "A privacy-enhancing scheme against contextual knowledge-based attacks in location-based services.",
            "Personalized query suggestion diversification in information retrieval.",
            "TPII: tracking personally identifiable information via user behaviors in HTTP traffic.",
            "Most similar maximal clique query on large graphs.",
            "Partition pruning for range query on distributed log-structured merge-tree.",
            "A provable-secure and practical two-party distributed signing protocol for SM2 signature algorithm.",
            "Software testing without the oracle correctness assumption.",
            "Efficient FPGA-based graph processing with hybrid pull-push computational model.",
            "Bayesian compressive principal component analysis.",
            "A revisit to MacKay algorithm and its application to deep network compression.",
            "Extracting a justification for OWL ontologies by critical axioms.",
            "Adaptive sparse and dense hybrid representation with nonconvex optimization.",
            "A novel classifier for multivariate instance using graph class signatures.",
            "Low-rank representation based robust face recognition by two-dimensional whitening reconstruction.",
            "An efficient multipath routing schema in multi-homing scenario based on protocol-oblivious forwarding.",
            "Proactive eviction of flow entry for SDN based on hidden Markov model.",
            "Plover: parallel logging for replication systems.",
            "Diversification on big data in query processing.",
            "A new fragments allocating method for join query in distributed database.",
            "Multipath affinage stacked - hourglass networks for human pose estimation.",
            "Practical continuous leakage-resilient CCA secure identity-based encryption.",
            "A topology and risk-aware access control framework for cyber-physical space.",
            "Zero-pole cancellation for identity-based aggregators: a constant-size designated verifier-set signature.",
            "A survey of current trends in computational predictions of protein-protein interactions.",
            "Benchmarking on intensive transaction processing.",
            "Adam revisited: a weighted past gradients perspective.",
            "Understanding urban structures and crowd dynamics leveraging large-scale vehicle mobility data.",
            "Entity-related paths modeling for knowledge base completion.",
            "Multi-task regression learning for survival analysis via prior information guided transductive matrix completion.",
            "EMSC: a joint multicast routing, scheduling, and call admission control in multi-radio multi-channel WMNs.",
            "A framework for cloned vehicle detection.",
            "An adaptive strategy for statistics collecting in distributed database.",
            "Advance on large scale near-duplicate video retrieval.",
            "Improving students' programming quality with the continuous inspection process: a social coding perspective.",
            "Example-based web page recoloring method.",
            "Multi-task MIML learning for pre-course student performance prediction.",
            "Probabilistic robust regression with adaptive weights - a case study on face recognition.",
            "Efficient private multi-party numerical records matching.",
            "An efficient GPU-based parallel tabu search algorithm for hardware/software co-design.",
            "Solving quantified constraint satisfaction problems with value selection rules.",
            "Event detection and evolution in multi-lingual social streams.",
            "Prototyping federated learning on edge computing systems.",
            "Use of sparse correlations for assessing financial markets.",
            "Guaranteeing the response deadline for general aggregation trees.",
            "A behavior-aware SLA-based framework for guaranteeing the security conformance of cloud service.",
            "Matching user identities across social networks with limited profile data.",
            "An enhanced authentication protocol for client server environment.",
            "Extreme vocabulary learning.",
            "Machine learning after the deep learning revolution.",
            "PSO-ACSC: a large-scale evolutionary algorithm for image matting.",
            "New phase transitions for formulas in Łukasiewicz logic.",
            "Text-enhanced network representation learning.",
            "Estimating posterior inference quality of the relational infinite latent feature model for overlapping community detection.",
            "The impact of information dissemination on purchasing behavior in social e-commerce environment.",
            "Properties of the satisfiability threshold of the strictly d-regular random (3, 2s)-SAT problem.",
            "A post-processing method for true random number generators based on hyperchaos with applications in audio-based generators.",
            "PopFlow: a novel flow management scheme for SDN switch of multiple flow tables based on flow popularity.",
            "A computer aided design method for car form and its application based on shape parameters."
        ]
    },
    {
        "name": "FCS",
        "year": "2019",
        "info": "Volume 13: 2019",
        "count": 99,
        "papers": [
            "Robust artificial intelligence and robust human organizations.",
            "Survey of visual just noticeable difference estimation.",
            "A high-performance and endurable SSD cache for parity-based RAID.",
            "Pinpointing and scheduling access conflicts to improve internal resource utilization in solid-state drives.",
            "A divide & conquer approach to liveness model checking under fairness & anti-fairness assumptions.",
            "FunctionFlow: coordinating parallel tasks.",
            "Empirical investigation of stochastic local search for maximum satisfiability.",
            "Towards making co-training suffer less from insufficient views.",
            "Efficient reinforcement learning in continuous state and action spaces with Dyna and policy approximation.",
            "Stance detection via sentiment information and neural network model.",
            "ComR: a combined OWL reasoner for ontology classification.",
            "EnAli: entity alignment across multiple heterogeneous data sources.",
            "A fast registration algorithm of rock point cloud based on spherical projection and feature extraction.",
            "Saliency-based framework for facial expression recognition.",
            "Visual tracking using discriminative representation with ℓ2 regularization.",
            "Community detection in scientific collaborative network with bayesian matrix learning.",
            "Statistical relational learning based automatic data cleaning.",
            "Launch of the Excellent Young Computer Scientists Forum.",
            "Practices of backuping homomorphically encrypted databases.",
            "From similarity perspective: a robust collaborative filtering approach for service recommendations.",
            "DFTracker: detecting double-fetch bugs by multi-taint parallel tracking.",
            "An effective method for service components selection based on micro-canonical annealing considering dependability assurance.",
            "Query by diverse committee in transfer active learning.",
            "Scene word recognition from pieces to whole.",
            "Soft video parsing by label distribution learning.",
            "Non-negative locality-constrained vocabulary tree for finger vein image retrieval.",
            "Optimal bundles for sponsored search auctions via bracketing scheme.",
            "Optimizing partitioning strategies for faster inverted index compression.",
            "CLS-Miner: efficient and effective closed high-utility itemset mining.",
            "Differentially private high-dimensional data publication via grouping and truncating techniques.",
            "Cursor momentum for fascination measurement.",
            "Increasing multicast transmission rate with localized multipath in software-defined networks.",
            "Physical-barrier detection based collective motion analysis.",
            "Learning distributed representations for community search using node embedding.",
            "An efficient energy aware virtual network migration based on genetic algorithm.",
            "A survey on fast simulation of elastic objects.",
            "Integrating GPS trajectory and topics from Twitter stream for human mobility estimation.",
            "The time model for event processing in internet of things.",
            "A novel index system describing program runtime characteristics for workload consolidation.",
            "Prefetch-aware fingerprint cache management for data deduplication systems.",
            "AADL+: a simulation-based methodology for cyber-physical systems.",
            "An effective framework for asynchronous incremental graph processing.",
            "An improved fireworks algorithm for the capacitated vehicle routing problem.",
            "CodeAttention: translating source code to comments by exploiting the code constructs.",
            "Crowd counting via learning perspective for multi-scale multi-view Web images.",
            "A self-adaptive correction method for perspective distortions of image.",
            "Cloud service selection using cloud service brokers: approaches and challenges.",
            "Enabling entity discovery in indoor commercial environments without pre-deployed infrastructure.",
            "Fingerprinting Android malware families.",
            "Distributed top-k similarity query on big trajectory streams.",
            "A visual hierarchical framework based model for underwater image enhancement.",
            "Safe semi-supervised learning: a brief introduction.",
            "Polychronous automata and their use for formal validation of AADL models.",
            "Template-based AADL automatic code generation.",
            "Towards a simple and safe Objective Caml compiling framework for the synchronous language SIGNAL.",
            "Inforence: effective fault localization based on information-theoretic analysis and statistical causal inference.",
            "Fault-tolerant precise data access on distributed log-structured merge-tree.",
            "Joint salient object detection and existence prediction.",
            "Locality-constrained framework for face alignment.",
            "Enhancing subspace clustering based on dynamic prediction.",
            "A maximum margin clustering algorithm based on indefinite kernels.",
            "A fully abstract semantics for value-passing CCS for trees.",
            "PAM: an efficient power-aware multilevel cache policy to reduce energy consumption of storage systems.",
            "Fast correlation coefficient estimation algorithm for HBase-based massive time series data.",
            "Universally composable oblivious transfer from ideal lattice.",
            "Detection of common wound infection bacteria based on FAIMS technology.",
            "A perspective on off-policy evaluation in reinforcement learning.",
            "Exploiting flash memory characteristics to improve performance of RAIS storage systems.",
            "A V2I communication-based pipeline model for adaptive urban traffic light scheduling.",
            "Automatic test report augmentation to assist crowdsourced testing.",
            "Reducing partition skew on MapReduce: an incremental allocation approach.",
            "A field-based service management and discovery method in multiple clouds context.",
            "Transfer synthetic over-sampling for class-imbalance learning with limited minority class data.",
            "Contextual modeling on auxiliary points for robust image reranking.",
            "Neural recovery machine for Chinese dropped pronoun.",
            "Design and optimization of VLC based small-world data centers.",
            "Patent expanded retrieval via word embedding under composite-domain perspectives.",
            "Answering why-not questions on KNN queries.",
            "A parallel data generator for efficiently generating \"realistic\" social streams.",
            "EDOA: an efficient delay optimization approach for mixed-polarity Reed-Muller logic circuits under the unit delay model.",
            "A parallel and robust object tracking approach synthesizing adaptive Bayesian learning and improved incremental subspace learning.",
            "Privacy-preserving edge-assisted image retrieval and classification in IoT.",
            "Algebraic criteria for finite automata understanding of regular language.",
            "System architecture for high-performance permissioned blockchains.",
            "State synchronization in process-oriented chaincode.",
            "New instant confirmation mechanism based on interactive incontestable signature in consortium blockchain.",
            "SMER: a secure method of exchanging resources in heterogeneous internet of things.",
            "Analyses for specific defects in android applications: a survey.",
            "Analyzing time-dimension communication characterizations for representative scientific applications on supercomputer systems.",
            "Non-negative matrix factorization based modeling and training algorithm for multi-label learning.",
            "Bayesian dual neural networks for recommendation.",
            "Focus-sensitive relation disambiguation for implicit discourse relation detection.",
            "Timestamp reassignment: taming transaction abort for serializable snapshot isolation.",
            "Understanding the mechanism of social tie in the propagation process of social network with communication channel.",
            "An efficient parallel algorithm of N-hop neighborhoods on graphs in distributed environment.",
            "Fast and accurate visual odometry from a monocular camera.",
            "Joint view synthesis and disparity refinement for stereo matching.",
            "A neighborhood proximity based algorithm for overlapping community structure detection in weighted networks.",
            "Non-sequential striping encoder from replication to erasure coding for distributed storage system."
        ]
    },
    {
        "name": "FCS",
        "year": "2018",
        "info": "Volume 12: 2018",
        "count": 89,
        "papers": [
            "CONET: a virtual human system-centered platform for drug discovery.",
            "Incomplete data management: a survey.",
            "Bioimage-based protein subcellular location prediction: a comprehensive review.",
            "Computational pricing in Internet era.",
            "A retrospective of knowledge graphs.",
            "Layered virtual machine migration algorithm for network resource balancing in cloud computing.",
            "Tuning parallel symbolic execution engine for better performance.",
            "GPS: a constraint-based gene position procurement in chromosome for solving large-scale multiobjective multiple knapsack problems.",
            "Distributed learning particle swarm optimizer for global optimization of multimodal problems.",
            "A multi-level approach to highly efficient recognition of Chinese spam short messages.",
            "Handling query skew in large indexes: a view based approach.",
            "Strength Pareto fitness assignment for pseudo-relevance feedback: application to MEDLINE.",
            "Efficient identity-based threshold decryption scheme from bilinear pairings.",
            "Binary relevance for multi-label learning: an overview.",
            "Set-based discrete particle swarm optimization and its applications: a survey.",
            "A survey on one-bit compressed sensing: theory and applications.",
            "Mobile crowd sensing task optimal allocation: a mobility pattern matching perspective.",
            "Online clustering of streaming trajectories.",
            "Efficient software product-line model checking using induction and a SAT solver.",
            "Combined classifier for cross-project defect prediction: an extended empirical study.",
            "On the selection of solutions for mutation in differential evolution.",
            "Sequential quadratic programming enhanced backtracking search algorithm.",
            "Evolutionary under-sampling based bagging ensemble method for imbalanced data classification.",
            "A formal model for plastic human computer interfaces.",
            "Decomposition for a new kind of imprecise information system.",
            "Comments on \"Some new distance measures for type-2 fuzzy sets and distance measure based ranking for group decision making problems\".",
            "Parallel intelligence: toward lifelong and eternal developmental AI and learning in cyber-physical-social spaces.",
            "Visual understanding by mining social media: recent advances and challenges.",
            "From one to crowd: a survey on crowdsourcing-based wireless indoor localization.",
            "Primitives towards verifiable computation: a survey.",
            "A survey on online feature selection with streaming features.",
            "Advanced forecasting of career choices for college students based on campus big data.",
            "NERank+: a graph-based approach for entity ranking in document collections.",
            "Improved expert selection model for forex trading.",
            "Effectiveness of exploring historical commits for developer recommendation: an empirical study.",
            "Resolving the GPU responsiveness dilemma through program transformations.",
            "Structural diversity for decision tree ensemble learning.",
            "Exploit latent Dirichlet allocation for collaborative filtering.",
            "Efficient sampling methods for characterizing POIs on maps based on road networks.",
            "Preferred search over encrypted data.",
            "Cyber-physical-social collaborative sensing: from single space to cross-space.",
            "Redesign of the gStore system.",
            "The role of model checking in software engineering.",
            "StreamTune: dynamic resource scheduling approach for workload skew in video data center.",
            "Fault-tolerant feedback virtual machine deployment based on user-personalized requirements.",
            "Dropout training for SVMs with data augmentation.",
            "Learning from context: A mutual reinforcement model for Chinese microblog opinion retrieval.",
            "Instance selection method for improving graph-based semi-supervised learning.",
            "Chromatic framework for quantum movies and applications in creating montages.",
            "Unification of identifiers in the Sea-Cloud system.",
            "Probabilistic verification of hierarchical leader election protocol in dynamic systems.",
            "Stable and realistic crack pattern generation using a cracking node method.",
            "A perceptual quality metric for 3D triangle meshes based on spatial pooling.",
            "Identification and prioritization of differentially expressed genes for time-series gene expression data.",
            "Large-scale video compression: recent advances and challenges.",
            "Learning deep representations for semantic image parsing: a comprehensive overview.",
            "Remote heart rate measurement using low-cost RGB face video: a technical literature review.",
            "VBMq: pursuit baremetal performance by embracing block I/O parallelism in virtualization.",
            "A communication-reduced and computation-balanced framework for fast graph computation.",
            "Software design pattern mining using classification-based techniques.",
            "Correlation-based software search by leveraging software term database.",
            "Achieving data-driven actionability by combining learning and planning.",
            "Polygene-based evolutionary algorithms with frequent pattern mining.",
            "Using partial evaluation in holistic subgraph search.",
            "Efficient histogram-based range query estimation for dirty data.",
            "Local features and manifold ranking coupled method for sketch-based 3D model retrieval.",
            "Applying rotation-invariant star descriptor to deep-sky image registration.",
            "A proof-based method of hybrid systems development using differential invariants.",
            "The more irresistible Hi(SRIQ) for meta-modeling and meta-query answering.",
            "Center-based clustering of categorical data using kernel smoothing methods.",
            "GL-RF: a reconciliation framework for label-free entity resolution.",
            "Video streaming distribution over mobile Internet: a survey.",
            "A survey of data-driven approach on multimedia QoE evaluation.",
            "IncPregel: an incremental graph parallel computation model.",
            "HSCS: a hybrid shared cache scheduling scheme for multiprogrammed workloads.",
            "Change profile analysis of open-source software systems to understand their evolutionary behavior.",
            "Automatic Web-based relational data imputation.",
            "Convolutional adaptive denoising autoencoders for hierarchical feature extraction.",
            "Filtering method of rock points based on BP neural network and principal component analysis.",
            "Robust feature learning for online discriminative tracking without large-scale pre-training.",
            "Fusing magnitude and phase features with multiple face models for robust face recognition.",
            "SMT-based query tracking for differentially private data analytics systems.",
            "Strongly connected components based efficient computation of page rank.",
            "Distribution-free data density estimation in large-scale networks.",
            "M-generalization for multipurpose transactional data publication.",
            "Mining fine-grained sequential travel patterns from social geo-tagged photos.",
            "A real-time hand-signs segmentation and classification system using fuzzy rule based RGB model and grid-pattern analysis.",
            "Forecasting time series with optimal neural networks using multi-objective optimization algorithm based on AICc.",
            "Geo-social network publication based on differential privacy."
        ]
    },
    {
        "name": "FCS",
        "year": "2017",
        "info": "Volume 11: 2017",
        "count": 81,
        "papers": [
            "Urban computing: enabling urban intelligence with big data.",
            "A survey of network update in SDN.",
            "Image categorization with resource constraints: introduction, challenges and advances.",
            "An identification model of urban critical links with macroscopic fundamental diagram theory.",
            "Understanding bike trip patterns leveraging bike sharing system open data.",
            "Real-time and generic queue time estimation based on mobile crowdsensing.",
            "ScenicPlanner: planning scenic travel routes leveraging heterogeneous user-generated digital footprints.",
            "HWM: a hybrid workload migration mechanism of metadata server cluster in data center.",
            "An efficient and highly available framework of data recency enhancement for eventually consistent data stores.",
            "Allocating workload to minimize the power consumption of data centers.",
            "Fast counting the cardinality of flows for big traffic over sliding windows.",
            "Understanding co-run performance on CPU-GPU integrated processors: observations, insights, directions.",
            "A genetic algorithm based entity resolution approach with active learning.",
            "Extracting optimal actionable plans from additive tree models.",
            "The role of prior in image based 3D modeling: a survey.",
            "Recent progress and trends in predictive visual analytics.",
            "VIPLFaceNet: an open source deep face recognition SDK.",
            "Attribute-based supervised deep learning model for action recognition.",
            "Robust visual tracking based on scale invariance and deep learning.",
            "Deep model-based feature extraction for predicting protein subcellular localizations from bio-images.",
            "Hierarchical deep hashing for image retrieval.",
            "Facial expression recognition via weighted group sparsity.",
            "Advancing the incremental fusion of robotic sensory features using online multi-kernel extreme learning machine.",
            "Factors attracting Chinese Generation Y in the smartphone application marketplace.",
            "String similarity join with different similarity thresholds based on novel indexing techniques.",
            "Improved shape from shading without initial information.",
            "Continuous optimization of interior carving in 3D fabrication.",
            "Optimizing product manufacturability in 3D printing.",
            "Lifelong machine learning: a paradigm for continuous learning.",
            "Optimization methods for regularization-based ill-posed problems: a survey and a multi-objective framework.",
            "Integrative cancer genomics: models, algorithms and analysis.",
            "Introduction to special section on advances of orange technologies.",
            "Constrained minimum power combination for broadband beamformer design in the STFT domain.",
            "Sound image externalization for headphone based real-time 3D audio.",
            "Spoken dialog summarization system with HAPPINESS/SUFFERING factor recognition.",
            "Automating identification of services and their variability for product lines using NSGA-II.",
            "Tenant-based access control model for multi-tenancy and sub-tenancy architecture in Software-as-a-Service.",
            "An approach to improve the quality of object-oriented models from novice modelers through project practice.",
            "Reasoning about knowledge, belief and certainty in hierarchical multi-agent systems.",
            "Hybrid immunizing solution for job recommender system.",
            "On the satisfiability of authorization requirements in business process.",
            "Finding susceptible and protective interaction patterns in large-scale genetic association study.",
            "A survey on Lyapunov-based methods for stability of linear time-delay systems.",
            "A comparative study of network robustness measures.",
            "A survey on formal specification and verification of separation kernels.",
            "A parallel computing framework for big data.",
            "A novel mapping algorithm for three-dimensional network on chip based on quantum-behaved particle swarm optimization.",
            "Local structured representation for generic object detection.",
            "E-GrabCut: an economic method of iterative video object extraction.",
            "An online electricity cost budgeting algorithm for maximizing green energy usage across data centers.",
            "Interest-suppression-based NDN live video broadcasting over wireless LAN.",
            "Discovering context-aware conditional functional dependencies.",
            "Time-aware conversion prediction.",
            "An improved brain MR image binarization method as a preprocessing for abnormality detection and features extraction.",
            "An efficient and fast polarity optimization approach for mixed polarity Reed-Muller logic circuits.",
            "Computer Graphics 2.0: towards end-user-generated contents.",
            "A survey of neural network accelerators.",
            "MSVL: a typed language for temporal logic programming.",
            "Topic evolution based on the probabilistic topic model: a review.",
            "Towards application-level elasticity on shared cluster: an actor-based approach.",
            "A secure and rapid response architecture for virtual machine migration from an untrusted hypervisor to a trusted one.",
            "Boosting imbalanced data learning with Wiener process oversampling.",
            "Ranking and tagging bursty features in text streams with context language models.",
            "Research on axial bearing capacity of rectangular concrete-filled steel tubular columns based on artificial neural networks.",
            "Algebraic state space approach to model and control combined automata.",
            "The B4-valued propositional logic with unary logical connectives ~1 / ~2 /¬.",
            "MapReduce-based entity matching with multiple blocking functions.",
            "A hierarchical similarity based job recommendation service framework for university students.",
            "User behavior modeling for better Web search ranking.",
            "Non-fragile control of fuzzy affine dynamic systems via piecewise Lyapunov functions.",
            "Using coalgebras and the Giry monad for interpreting game logics - a tutorial.",
            "Precise slicing of interprocedural concurrent programs.",
            "Towards a programming framework for activity-oriented context-aware applications.",
            "Mining coterie patterns from Instagram photo trajectories for recommending popular travel routes.",
            "Color space quantization-based clustering for image retrieval.",
            "Learning real-time search on c-space GVDs.",
            "Decision-aware data suppression in wireless sensor networks for target tracking applications.",
            "TCP-ACC: performance and analysis of an active congestion control algorithm for heterogeneous networks.",
            "A probabilistic framework of preference discovery from folksonomy corpus.",
            "Personal summarization from profile networks.",
            "Graphical password: prevent shoulder-surfing attack using digraph substitution rules."
        ]
    },
    {
        "name": "FCS",
        "year": "2016",
        "info": "Volume 10: 2016",
        "count": 82,
        "papers": [
            "Launch of the NSFC Excellent Young Scholars Forum.",
            "Large-scale virtual machines provisioning in clouds: challenges and approaches.",
            "Scene text detection and recognition: recent advances and future trends.",
            "Towards a verified compiler prototype for the synchronous language SIGNAL.",
            "An operational happens-before memory model.",
            "Writeback throttling in a virtualized system with SCM.",
            "Exploiting multi-channels deep convolutional neural networks for multivariate time series classification.",
            "Accuracy estimation of link-based similarity measures and its application.",
            "Sockpuppet gang detection on social media sites.",
            "Topic hierarchy construction from heterogeneous evidence.",
            "Low lighting image enhancement using local maximum color value prior.",
            "Improved rate-distortion optimized video coding using non-integer bit estimation and multiple Lambda search.",
            "Visual object tracking - classical and contemporary approaches.",
            "An automated pulmonary parenchyma segmentation method based on an improved region growing algorithmin PET-CT imaging.",
            "Evolvable dialogue state tracking for statistical dialogue management.",
            "Cognitive mechanism related to line drawings and its applications in intelligent process of visual media: a survey.",
            "A first-order coalition logic for BDI-agents.",
            "Improving differential evolution with a new selection method of parents for mutation.",
            "Recommender systems based on ranking performance optimization.",
            "Efficient multi-event monitoring using built-in search engines.",
            "Generating labeled samples for hyperspectral image classification using correlation of spectral bands.",
            "Max-margin non-negative matrix factorization with flexible spatial constraints based on factor analysis.",
            "Efficient graph similarity join for information integration on graphs.",
            "Skyline-join query processing in distributed databases.",
            "D-Ocean: an unstructured data management system for data ocean environment.",
            "Protecting personalized privacy against sensitivity homogeneity attacks over road networks in mobile services.",
            "Big graph search: challenges and techniques.",
            "String similarity search and join: a survey.",
            "A survey of RDF data management systems.",
            "Event analysis in social multimedia: a survey.",
            "A survey of cloud resource management for complex engineering applications.",
            "iGraph: an incremental data processing system for dynamic graph.",
            "Optimizing top-k retrieval: submodularity analysis and search strategies.",
            "Top-k probabilistic prevalent co-location mining in spatially uncertain data sets.",
            "Source code fragment summarization with small-scale crowdsourcing based features.",
            "Understanding information interactions in diffusion: an evolutionary game-theoretic perspective.",
            "FlexPoll: adaptive event polling for network-intensive applications.",
            "An efficient trust negotiation strategy towards the resource-limited mobile commerce environment.",
            "Joint study on VMs deployment, assignment and migration in geographically distributed data centers.",
            "Coordinating workload balancing and power switching in renewable energy powered data center.",
            "Learnware: on the future of machine learning.",
            "A survey of routing algorithm for mesh Network-on-Chip.",
            "Survey of visual sentiment prediction for social media analysis.",
            "Decomposing class responsibilities using distance-based method similarity.",
            "Variable strength combinatorial testing of concurrent programs.",
            "Major motivations for extract method refactorings: analysis based on interviews and change histories.",
            "Fault tolerant control based on neural network interval type-2 fuzzy sliding mode controller for octorotor UAV.",
            "A three-way incremental-learning algorithm for radar emitter identification.",
            "Real-time object tracking via compressive feature selection.",
            "Generating timeline summaries with social media attention.",
            "The M-computations induced by accessibility relations in nonstandard models M of Hoare logic.",
            "Reasoning and predicting POMDP planning complexity via covering numbers.",
            "Identity-based aggregate signcryption in the standard model from multilinear maps.",
            "Local outlier factor and stronger one class classifier based hierarchical model for detection of attacks in network intrusion detection dataset.",
            "A peep at knowledge science in a categorical prospect.",
            "Test-case prioritization: achievements and challenges.",
            "A survey on high coherence visual media retargeting: recent advances and applications.",
            "Detailed and clock-driven simulation for HPC interconnection network.",
            "IPSETFUL: an iterative process of selecting test cases for effective fault localization by exploring concept lattice of program spectra.",
            "Pose-robust feature learning for facial expression recognition.",
            "Multi-label active learning by model guided distribution matching.",
            "Multi-view dimensionality reduction via canonical random correlation analysis.",
            "Reasoning about actions with loops via Hoare logic.",
            "The power of comments: fostering social interactions in microblog networks.",
            "Optimizing guest swapping using elastic and transparent memory provisioning on virtualization platform.",
            "Adaptive data replication strategy in cloud computing for performance improvement.",
            "Energy efficient approximate self-adaptive data collection in wireless sensor networks.",
            "Prober: exploiting sequential characteristics in buffer for improving SSDs write performance.",
            "Rethinking big data in a networked world.",
            "A survey on barrier coverage with sensors.",
            "A survey of sketch based modeling systems.",
            "DPHK: real-time distributed predicted data collecting based on activity pattern knowledge mined from trajectories in smart environments.",
            "Adaptive genetic algorithms guided by decomposition for PCSPs: application to frequency assignment problems.",
            "Incorporating multi-kernel function and Internet verification for Chinese person name disambiguation.",
            "Research on Chinese negation and speculation: corpus annotation and identification.",
            "Constrained query of order-preserving submatrix in gene expression data.",
            "Benchmarking in-memory database.",
            "Impact of preprocessing on medical data classification.",
            "FSPM-P: towards a general functional-structural plant model for robust and comprehensive model development.",
            "Face recognition by decision fusion of two-dimensional linear discriminant analysis and local binary pattern.",
            "Base communication model of IP covert timing channels.",
            "Packet: a privacy-aware access control policy composition method for services composition in cloud environments."
        ]
    },
    {
        "name": "FCS",
        "year": "2015",
        "info": "Volume 9: 2015",
        "count": 74,
        "papers": [
            "Generalized interface automata with multicast synchronization.",
            "Integrating behavior analysis into architectural modeling.",
            "Melton: a practical and precise memory leak detection tool for C programs.",
            "Algorithms for tractable compliance problems.",
            "A complete coalition logic of temporal knowledge for multi-agent systems.",
            "Timed-pNets: a communication behavioural semantic model for distributed systems.",
            "A new fragment re-allocation strategy for NoSQL database systems.",
            "SAMES: deadline-constraint scheduling in MapReduce.",
            "An anonymous and efficient remote biometrics user authentication scheme in a multi server environment.",
            "Scalable protocol for cross-domain group password-based authenticated key exchange.",
            "Structural information aware deep semi-supervised recurrent neural network for sentiment analysis.",
            "Learning with privileged information using Bayesian networks.",
            "Understanding taxi drivers' routing choices from spatial and social traces.",
            "Product-oriented review summarization and scoring.",
            "Efficient query processing framework for big data warehouse: an almost join-free approach.",
            "A model-driven approach to semi-structured database design.",
            "Efficient subtree results computation for XML keyword queries.",
            "Discovering admissible Web services with uncertain QoS.",
            "A survey on trust based detection and isolation of malicious nodes in ad-hoc and sensor networks.",
            "Cloud authorization: exploring techniques and approach towards effective access control framework.",
            "Virtual machine selection and placement for dynamic consolidation in Cloud computing environment.",
            "Semantic theories of programs with nested interrupts.",
            "A novel strategy for automatic test data generation using soft computing technique.",
            "Verifying specifications with associated attributes in graph transformation systems.",
            "Hybrid fusion and interpolation algorithm with near-infrared image.",
            "Efficient image representation for object recognition via pivots selection.",
            "A hybrid biometric identification framework for high security applications.",
            "Pedestrian detection algorithm based on video sequences and laser point cloud.",
            "Extracting viewer interests for automated bookmarking in video-on-demand services.",
            "Memory bandwidth optimization of SpMV on GPGPUs.",
            "A balanced decomposition approach to real-time visualization of large vector maps in CyberGIS.",
            "Irradiance regression for efficient final gathering in global illumination.",
            "A hierarchical ontology context model for work-based learning.",
            "A sequential model of bargaining in logic programming.",
            "Research on self-adaptive decision-making mechanism for competition strategies in robot soccer.",
            "A high order collaboration and real time formal model for automatic testing of safety critical systems.",
            "Efficient approach of translating LTL formulae into Büchi automata.",
            "Understanding and identifying latent data races cross-thread interleaving.",
            "Runtime model based approach to IoT application development.",
            "Software crowdsourcing for developing Software-as-a-Service.",
            "Exploiting write power asymmetry to improve phase change memory system performance.",
            "XGRouter: high-quality global router in X-architecture with particle swarm optimization.",
            "Active transfer learning of matching query results across multiple sources.",
            "Combining long-term and short-term user interest for personalized hashtag recommendation.",
            "Cuckoo search with varied scaling factor.",
            "Basic theorem as representation of heterogeneous concept lattices.",
            "Identification of cytokine via an improved genetic algorithm.",
            "Detecting differential expression from RNA-seq data with expression measurement uncertainty.",
            "State of the art and prospects of structured sensing matrices in compressed sensing.",
            "Character recognition based on non-linear multi-projection profiles measure.",
            "Camera array calibration for light field acquisition.",
            "A novel adaptive image zooming scheme via weighted least-squares estimation.",
            "A statistical learning based image denoising approach.",
            "Adaptive segmentation based on multi-classification model for dermoscopy images.",
            "A pixel-based outlier-free motion estimation algorithm for scalable video quality enhancement.",
            "Fast approximate matching of binary codes with distinctive bits.",
            "Effects of smartphone icon background shapes and figure/background area ratios on visual search performance and user preferences.",
            "A new encryption scheme for surveillance videos.",
            "The optimal information rate for graph access structures of nine participants.",
            "Real-time performance analysis of non-saturated and non-slotted Ethernet based on a two-dimensional collision state model.",
            "Mathematical and computational approaches to epidemic modeling: a comprehensive review.",
            "A survey on software defined networking and its applications.",
            "Hierarchical caches in content-centric networks: modeling and analysis.",
            "Compound graph based hybrid data center topologies.",
            "A cost-effective scheme supporting adaptive service migration in cloud data center.",
            "Recommend trustworthy services using interval numbers of four parameters via cloud model for potential users.",
            "Adaptive and scalable load balancing for metadata server cluster in cloud-scale file systems.",
            "RDF partitioning for scalable SPARQL query processing.",
            "Equivalence checking between SLM and TLM using coverage directed simulation.",
            "BIFER: a biphasic trace filter approach to scalable prediction of concurrency errors.",
            "Distribution of action movements (DAM): a descriptor for human action recognition.",
            "Non-intrusive sleep pattern recognition with ubiquitous sensing in elderly assistive environment.",
            "Video structural description technology for the new generation video surveillance systems.",
            "3D object retrieval based on histogram of local orientation using one-shot score support vector machine."
        ]
    },
    {
        "name": "FCS",
        "year": "2014",
        "info": "Volume 8: 2014",
        "count": 82,
        "papers": [
            "Model checking with fairness assumptions using PAT.",
            "Runtime support for type-safe and context-based behavior adaptation.",
            "Organization-based agent-oriented programming: model, mechanisms, and language.",
            "A constraint-weaving approach to points-to analysis for AspectJ.",
            "Tag recommendation for open source software.",
            "MR-DBSCAN: a scalable MapReduce-based DBSCAN algorithm for heavily skewed data.",
            "Generalized multipath planning model for ride-sharing systems.",
            "PSG: a two-layer graph model for document summarization.",
            "Adaptive in-page logging for flash-memory storage systems.",
            "SWVFS: a saliency weighted visual feature similarity metric for image quality assessment.",
            "Splitting touching cells based on concave-point and improved watershed algorithms.",
            "Cryptanalysis and improvement of a certificateless encryption scheme in the standard model.",
            "Leach: an automatic learning cache for inline primary deduplication system.",
            "A sound and complete R-calculi with respect to contraction and minimal change.",
            "Proving total correctness and generating preconditions for loop programs via symbolic-numeric computation methods.",
            "A hybrid multi-objective PSO algorithm with local search strategy for VLSI partitioning.",
            "ECG beat classification using particle swarm optimization and support vector machine.",
            "Fusion of visible and thermal images for facial expression recognition.",
            "Novel infrared and visible image fusion method based on independent component analysis.",
            "Naive Bayes for value difference metric.",
            "Associative categorization of frequent patterns based on the probabilistic graphical model.",
            "Entity attribute discovery and clustering from online reviews.",
            "Recommendation algorithm based on item quality and user rating preferences.",
            "MViewer: mobile phone spatiotemporal data viewer.",
            "Learning to detect subway arrivals for passengers on a train.",
            "Interactive texture design and synthesis from mesh sketches.",
            "MilkyWay-2: back to the world Top 1.",
            "MilkyWay-2 supercomputer: system and application.",
            "The TH Express high performance interconnect networks.",
            "Hybrid hierarchy storage system in MilkyWay-2 supercomputer.",
            "Iaso: an autonomous fault-tolerant management system for supercomputers.",
            "Network and data location aware approach for simultaneous job scheduling and data replication in large-scale data grid environments.",
            "Towards energy-efficient storage placement in large scale sensor networks.",
            "Achieving high throughput and TCP Reno fairness in delay-based TCP over large networks.",
            "HAT: an efficient buffer management method for flash-based hybrid storage systems.",
            "Key continual-leakage resilient broadcast cryptosystem from dual system in broadcast networks.",
            "Construction of a key-dependent message secure symmetric encryption scheme in the ideal cipher model.",
            "A property-based testing framework for encryption programs.",
            "A short non-delegatable strong designated verifier signature.",
            "Cloud data auditing with designated verifier.",
            "Known-key distinguishers on type-1 Feistel scheme and near-collision attacks on its hashing modes.",
            "Efficient and effective Bayesian network local structure learning.",
            "RULES-IT: incremental transfer learning with RULES family.",
            "Dm-KDE: dynamical kernel density estimation by sequences of KDE estimators with fixed number of components over data streams.",
            "Clustering-based topical Web crawling using CFu-tree guided by link-context.",
            "An intelligent market making strategy in algorithmic trading.",
            "Emotion recognition from thermal infrared images using deep Boltzmann machine.",
            "Road scene analysis for determination of road traffic density.",
            "Generating Chinese named entity data from parallel corpora.",
            "Reference direction based immune clone algorithm for many-objective optimization.",
            "Cryptanalysis and improvement of a certificateless signcryption scheme without bilinear pairing.",
            "A lattice-based signcryption scheme without random oracles.",
            "Unbalanced graph cuts with minimum capacity.",
            "Property analysis of logic Petri nets by marking reachability graphs.",
            "Interpolation oriented parallel communication to optimize coupling in earth system modeling.",
            "A UTP semantic model for Orc language with execution status and fault handling.",
            "Generating test data for both paths coverage and faults detection using genetic algorithms: multi-path case.",
            "Some new distance measures for type-2 fuzzy sets and distance measure based ranking for group decision making problems.",
            "Tolerance-based multigranulation rough sets in incomplete systems.",
            "A novel binary image representation algorithm by using NAM and coordinate encoding procedure and its application to area calculation.",
            "Comparative performance analysis of stroke correspondence search methods for stroke-order free online multi-stroke character recognition.",
            "Linear discriminant analysis with worst between-class separation and average within-class compactness.",
            "Training SVMs on a bound vectors set based on Fisher projection.",
            "Dimensionality reduction via kernel sparse representation.",
            "Discovering top-k patterns with differential privacy-an accurate approach.",
            "Lattice-based certificateless encryption scheme.",
            "Key-insulated aggregate signature.",
            "A scheduling algorithm with dynamic properties in mobile grid.",
            "HC-Store: putting MapReduce's foot in two camps.",
            "An adaptive switching scheme for iterative computing in the cloud.",
            "Research on technology of desktop virtualization based on SPICE protocol and its improvement solutions.",
            "A survey on distributed compressed sensing: theory and applications.",
            "Image decomposing for inpainting using compressed sensing in DCT domain.",
            "Model based odia numeral recognition using fuzzy aggregated features.",
            "Relative manifold based semi-supervised dimensionality reduction.",
            "Feature selection on probabilistic symbolic objects.",
            "Semi-tensor product of matrices approach to reachability of finite automata with application to language recognition.",
            "A temporal programming model with atomic blocks based on projection temporal logic.",
            "Specifying redundancy tactics as crosscutting concerns using aspect-oriented modeling.",
            "Detection of semantically similar code.",
            "Error- and loss-tolerant bundle fragment authentication for space DTNs.",
            "Optimal binary codes and binary construction of quantum codes."
        ]
    },
    {
        "name": "FCS",
        "year": "2013",
        "info": "Volume 7: 2013",
        "count": 70,
        "papers": [
            "Consolidated cluster systems for data centers in the cloud age: a survey and analysis.",
            "Evaluation of RDF queries via equivalence.",
            "Design and verification of a lightweight reliable virtual machine monitor for a many-core architecture.",
            "VGQ-Vor: extending virtual grid quadtree with Voronoi diagram for mobile k nearest neighbor queries over mobile objects.",
            "Semantic separator learning and its applications in unsupervised Chinese text parsing.",
            "A novel unsupervised approach for multilevel image clustering from unordered image collection.",
            "A general framework for computing maximal contractions.",
            "Hybrid MARTE statecharts.",
            "A graph-based generic type system for object-oriented programs.",
            "Noisy component extraction with reference.",
            "Geometric attack resistant image watermarking based on MSER.",
            "Big data challenge: a data management perspective.",
            "Computing infrastructure for big data processing.",
            "Towards modeling popularity of microblogs.",
            "Co-occurrence prediction in a large location-based social network.",
            "Probability tree based passenger flow prediction and its application to the Beijing subway system.",
            "A semi-supervised hierarchical approach: two-dimensional clustering of microarray gene expression data.",
            "A novel requirement analysis approach for periodic control systems.",
            "Confinement framework for encapsulating objects.",
            "Supporting feature model refinement with updatable view.",
            "The autocorrelation distribution of balanced Boolean function.",
            "Design and formal verification of a CEM protocol with transparent TTP.",
            "KMcube: the compound of Kautz digraph and Möbius cube.",
            "FPGA based unified architecture for public key and private key cryptosystems.",
            "Preserving location privacy without exact locations in mobile services.",
            "Quantum software framework: a tentative study.",
            "Reversible spiking neural P systems.",
            "Co-metric: a metric learning algorithm for data with multiple views.",
            "A survey on temporal logics for specifying and verifying real-time systems.",
            "Task assignment for minimizing application completion time using honeybee mating optimization.",
            "CADSE: communication aware design space exploration for efficient run-time MPSoC management.",
            "An online service-oriented performance profiling tool for cloud computing systems.",
            "Topology-aware virtual network embedding based on closeness centrality.",
            "A benefit-aware on-demand provisioning approach for multi-tier applications in cloud computing.",
            "A grid-based clustering algorithm for wild bird distribution.",
            "Performance comparisons between cellular-only and cellular/WLAN integrated systems based on analytical models.",
            "Multiple target localization in wireless visual sensor networks.",
            "Architecture for mobile group communication in campus environment.",
            "Part-based methods for handwritten digit recognition.",
            "Online belief propagation algorithm for probabilistic latent semantic analysis.",
            "New forward-secure signature schemes with untrusted update.",
            "A novel pairing-free certificateless authenticated key agreement protocol with provable security.",
            "Assessing the quality of metamodels.",
            "Modelling priority queuing systems with varying service capacity.",
            "A matrix grammar approach for automatic distributed network resource management.",
            "Foreword to the special section on synchronous programming.",
            "Formal verification of synchronous data-flow program transformations toward certified compilers.",
            "Multi-threaded code generation from Signal program to OpenMP.",
            "Exploring system architectures in AADL via Polychrony and SynDEx.",
            "Scenario-based verification in presence of variability using a synchronous approach.",
            "A comparative study of two formal semantics of the SIGNAL language.",
            "An evaluation framework for software crowdsourcing.",
            "Algorithms for checking channel passing in web service choreography.",
            "An ACO-RFD hybrid method to solve NP-complete problems.",
            "Dimensionality reduction with adaptive graph.",
            "Reinforcement learning models for scheduling in wireless networks.",
            "Local feature based retrieval approach for iris biometrics.",
            "A comprehensive review of significant researches on content based indexing and retrieval of visual information.",
            "A decomposition based algorithm for maximal contractions.",
            "Integrity constraints in OWL ontologies based on grounded circumscription.",
            "Generating test data for both path coverage and fault detection using genetic algorithms.",
            "Image categorization using a semantic hierarchy model with sparse set of salient regions.",
            "Hybrid Bayesian estimation tree learning with discrete and fuzzy labels.",
            "Classifying and clustering in negative databases.",
            "Context-sensitive Web service discovery over the bipartite graph model.",
            "An automatic subdigraph renovation plan for failure recovery of composite semantic Web services.",
            "A novel architecture for ahead branch prediction.",
            "On applying stochastic network calculus.",
            "Towards estimating computer users' mood from interaction behaviour with keyboard and mouse.",
            "Threshold public key encryption scheme resilient against continual leakage without random oracles."
        ]
    },
    {
        "name": "FCS",
        "year": "2012",
        "info": "Volume 6: 2012",
        "count": 61,
        "papers": [
            "Formal engineering methods for software quality assurance.",
            "The use of mathematics in software quality assurance.",
            "rCOS: a formal model-driven engineering method for component-based software.",
            "An institution theory of formal meta-modelling in graphically extended BNF.",
            "SeVe: automatic tool for verification of security protocols.",
            "Mining the interests of Chinese microbloggers via keyword extraction.",
            "Enriching short text representation in microblog for clustering.",
            "Forecasting complex group behavior via multiple plan recognition.",
            "Prediction of urban human mobility using large-scale taxi traces and its applications.",
            "On social computing research collaboration patterns: a social network perspective.",
            "Multi-stream join answering for mining significant cross-stream correlations.",
            "Active improvement of hierarchical object features under budget constraints.",
            "An effective framework for characterizing rare categories.",
            "Resilient k-d trees: k-means in space revisited.",
            "Stratified sampling for data mining on the deep web.",
            "Two of a kind or the ratings game? Adaptive pairwise preferences and latent factor models.",
            "Managing advertising campaigns - an approximate planning approach.",
            "An approach for automatic sleep stage scoring and apnea-hypopnea detection.",
            "Tractable XML data exchange via relations.",
            "Composite recommendations: from items to packages.",
            "Matching dependencies: semantics and query answering.",
            "Linking temporal records.",
            "Adding regular expressions to graph reachability and pattern queries.",
            "How much power is needed for a billion-thread high-throughput server?",
            "CloudRank-D: benchmarking and ranking cloud computing systems for data processing applications.",
            "Dynamic cache partitioning based on hot page migration.",
            "Energy-aware application performance management in virtualized data centers.",
            "Towards architecture-based management of platforms in the cloud.",
            "Effectively deploying services on virtualization infrastructure.",
            "An efficient method for privacy preserving location queries.",
            "Efficient ID-based proxy multi-signature scheme secure in random oracle.",
            "An efficient MAC scheme for secure network coding with probabilistic detection.",
            "Classification-based self-adaptive differential evolution and its application in multi-lateral multi-issue negotiation.",
            "Bus holding strategy based on shuffled complex evolution method.",
            "A qualitative and quantitative study of color emotion using valence-arousal.",
            "A uniform solution to the independent set problem through tissue P systems with cell separation.",
            "Measure oriented training: a targeted approach to imbalanced classification problems.",
            "Improving bagging performance through multi-algorithm ensembles.",
            "A probabilistic model with multi-dimensional features for object extraction.",
            "A precise approach to tracking dim-small targets using spectral fingerprint features.",
            "Automatic object classification using motion blob based local feature fusion for traffic scene surveillance.",
            "Real-time urban traffic information estimation with a limited number of surveillance cameras.",
            "A group priority earliest deadline first scheduling algorithm.",
            "The ClasSi coefficient for the evaluation of ranking quality in the presence of class similarities.",
            "An efficient approach for continuous density queries.",
            "Rethinking the architecture design of data center networks.",
            "Fostering artificial societies using social learning and social control in parallel emergency management systems.",
            "Social influence and spread dynamics in social networks.",
            "A co-evolving memetic wrapper for prediction of patient outcomes in TCM informatics.",
            "A parallel scheduling algorithm for reinforcement learning in large state space.",
            "Listwise approaches based on feature ranking discovery.",
            "The Internet of data: a new idea to extend the IOT in the digital world.",
            "MiNT-OLAP cluster: minimizing network transmission cost in OLAP cluster for main memory analytical database.",
            "Access control scheme with tracing for outsourced databases.",
            "Continuous ranking on uncertain streams.",
            "ETI: an efficient index for set similarity queries.",
            "Publish/subscribe based information dissemination over VANET utilizing DHT.",
            "Towards module-based automatic partitioning of Java applications.",
            "Photographic composite detection using circles.",
            "Easy modeling of realistic trees from freehand sketches.",
            "New progress in geometric computing for image and video processing."
        ]
    },
    {
        "name": "FCS",
        "year": "2011",
        "info": "Volume 5: 2011",
        "count": 51,
        "papers": [
            "Property transformation under specification change.",
            "Abstraction for model checking multi-agent systems.",
            "Indeterminacy-aware service selection for reliable service composition.",
            "Behavior pattern extraction by trajectory analysis.",
            "Fuzzy c-means clustering with non local spatial information for noisy image segmentation.",
            "A fast algorithm for computing moments of gray images based on NAM and extended shading approach.",
            "Soft spectral clustering ensemble applied to image segmentation.",
            "Learning random forests for ranking.",
            "Identifying different community members in complex networks based on topology potential.",
            "Distance metric learning guided adaptive subspace semi-supervised clustering.",
            "Boosting performance in attack intention recognition by integrating multiple techniques.",
            "A metric normalization of tree edit distance.",
            "An analytical model for Network-on-Chip with finite input buffer.",
            "Resolving conflicts between negotiation success and sensitive information protection in automated trust negotiation.",
            "Fingerprint segmentation based on an AdaBoost classifier.",
            "A resynchronization attack on stream ciphers filtered by Maiorana-McFarland functions.",
            "A simple fingerprinting scheme for large user groups.",
            "Design and implementation of a portable TPM scheme for general-purpose trusted computing based on EFI.",
            "FlowTrust: trust inference with network flows.",
            "Dominance-based fuzzy rough approach to an interval-valued decision system.",
            "Type-2 fuzzy description logic.",
            "Individual difference of artificial emotion applied to a service robot.",
            "Efficient normalized cross correlation calculation method for stereo vision based robot navigation.",
            "Improving performance by creating a native join-index for OLAP.",
            "Psu: a novel low-latency constant-degree overlay network.",
            "Learning multiple metrics for ranking.",
            "An improved spectral clustering algorithm based on random walk.",
            "Human behavior clustering for anomaly detection.",
            "A temporal-spatial background modeling of dynamic scenes.",
            "An adaptive polling interval and short preamble media access control protocol for wireless sensor networks.",
            "Traceback in wireless sensor networks with packet marking and logging.",
            "Toward in vivo nanoscale communication networks: utilizing an active network architecture.",
            "Reasonable routing in delay/disruption tolerant networks.",
            "Security analysis of two recently proposed RFID authentication protocols.",
            "Pre-post notation is questionable in effectively specifying operations of object-oriented systems.",
            "Green challenges to system software in data centers.",
            "Static typing for a substructural lambda calculus.",
            "RBF neural network based on q-Gaussian function in function approximation.",
            "A robust extraction algorithm for biomedical signals from noisy mixtures.",
            "An efficient approach to representing and mining knowledge from Qing court medical records.",
            "Answering contextual questions based on ontologies and question templates.",
            "Nearest-neighbor classifier motivated marginal discriminant projections for face recognition.",
            "Approximation operators based on vague relations and roughness measures of vague sets.",
            "Identity-based key distribution for mobile Ad Hoc networks.",
            "On cross-correlation indicators of an S-box.",
            "Two-thirds simulation indexes and modal logic characterization.",
            "Certifying assembly programs with trails.",
            "A recursive model for static empty container allocation.",
            "Non-cooperative optimization games in market-oriented overlay networks: an integrated model of resource pricing and network formation.",
            "Research on resource allocation for multi-tier web applications in a virtualization environment.",
            "A PTS-PGATS based approach for data-intensive scheduling in data grids."
        ]
    },
    {
        "name": "FCS",
        "year": "2010",
        "info": "Volume 4: 2010",
        "count": 56,
        "papers": [
            "Recent advances in program verification through computer algebra.",
            "Static worst-case execution time analysis of the µC/OS-II real-time kernel.",
            "A semantic model of confinement and Locality theorem.",
            "TRainbow: a new trusted virtual machine based platform.",
            "Formal verification of concurrent programs with read-write locks.",
            "A new model for model checking: cycle-weighted Kripke structure.",
            "Mining non-redundant diverse patterns: an information theoretic perspective.",
            "A constraint-based topic modeling approach for name disambiguation.",
            "Improved feedback modeling of transport in enlarging urban areas of developing countries.",
            "Efficient distributed location verification in wireless sensor networks.",
            "An effective scheduling scheme for multi-hop multicast in wireless mesh networks.",
            "A MANET accessing Internet routing algorithm based on dynamic gateway adaptive selection.",
            "Documenting and verifying systems assembled from components.",
            "A concern-based approach to generating formal requirements specifications.",
            "On the computation of quotients and factors of regular languages.",
            "Financial information processing and development of emerging financial markets.",
            "Modeling default risk via a hidden Markov model of multiple sequences.",
            "Developing an SVM-based ensemble learning system for customer risk identification collaborating with customer relationship management.",
            "A class of life insurance reserve model and risk analysis in a stochastic interest rate environment.",
            "N-person credibilistic strategic game.",
            "Corporate financial distress diagnosis model and application in credit rating for listing firms in China.",
            "Evaluation of mutual funds using multi-dimensional information.",
            "Neural network methods for forecasting turning points in economic time series: an asymmetric verification to business cycles.",
            "Using jump-diffusion modeling for valuing real options in infrastructure projects.",
            "Partially funded public pension, human capital and endogenous growth.",
            "Knowledge discovery through directed probabilistic topic models: a survey.",
            "ID-based authenticated group key agreement from bilinear maps.",
            "Cognitive sense of China.",
            "Toward secure and private service discovery anywhere anytime.",
            "Three challenges in data mining.",
            "Long-term large-scale sensing in the forest: recent advances and future directions of GreenOrbs.",
            "iSensNet: an infrastructure for research and development in wireless sensor networks.",
            "Data-driven testing methodology for RFID systems.",
            "Packet transmission policies for battery operated wireless sensor networks.",
            "Development of foundation models for Internet of Things.",
            "Visual data security and management for smart cities.",
            "A 3D shape retrieval framework for 3D smart cities.",
            "Virtual cityscapes: recent advances in crowd modeling and traffic simulation.",
            "Applied research of data sensing and service to ubiquitous intelligent transportation system.",
            "Petaflop supercomputers of China.",
            "Evolution of supercomputers.",
            "Perspectives of China's HPC system development: a view from the 2009 China HPC TOP100 list.",
            "TH-1: China's first petaflop supercomputer.",
            "HPP controller: a system controller for high performance computing.",
            "Design and implementation of communication system of the Dawning 6000 supercomputer.",
            "DeepComp: towards a balanced system design for high performance computer systems.",
            "JASMIN: a parallel software infrastructure for scientific computing.",
            "One-to-one communication in twisted cubes under restricted connectivity.",
            "PopCap: popularity oriented proxy caching for peer-assisted Internet video-on-demand streaming services.",
            "Full and partial deniability for authentication schemes.",
            "Network intrusion detection based on system calls and data mining.",
            "Linear complexity and autocorrelation values of a polyphase generalized cyclotomic sequence of length pq.",
            "An immune memory clonal algorithm for numerical and combinatorial optimization.",
            "An enhanced swarm intelligence clustering-based RBFNN classifier and its application in deep Web sources classification.",
            "Fast motion and disparity estimation for multiview video coding.",
            "Human behavior classification by analyzing periodic motions."
        ]
    },
    {
        "name": "FCS",
        "year": "2009",
        "info": "Volume 3: 2009",
        "count": 59,
        "papers": [
            "From nature to computing and back.",
            "Pareto analysis of evolutionary and learning systems.",
            "Evolutionary multi-objective optimization: some current research trends and topics that remain to be explored.",
            "Monitoring of particle swarm optimization.",
            "A hybrid multi-swarm particle swarm optimization to solve constrained optimization problems.",
            "Forecasting - where computational intelligence meets the stock market.",
            "Runtime analysis of search heuristics on software engineering problems.",
            "Evolving Nash-optimal poker strategies using evolutionary computation.",
            "Integrative biological systems modeling: challenges and opportunities.",
            "Optimisation of algorithm control parameters in cultural differential evolution applied to molecular crystallography.",
            "Incorporating prior knowledge into learning by dividing training data.",
            "Evolutionary algorithm based on schemata theory.",
            "Symbolic model checking APSL.",
            "Financial information processing.",
            "Stock prediction: an event-driven approach based on bursty keywords.",
            "Risk aversion and agents' survivability in a financial market.",
            "Forecasting foreign exchange rates with an improved back-propagation learning algorithm with adaptive smoothing momentum terms.",
            "Daily prediction of short-term trends of crude oil prices using neural networks exploiting multimarket dynamics.",
            "A class of classification and regression methods by multiobjective programming.",
            "Benchmarking binary classification models on data sets with different degrees of imbalance.",
            "A novel PPGA-based clustering analysis method for business cycle indicator selection.",
            "Macro finance early warning system.",
            "Algorithmic trading system: design and applications.",
            "APF-guided adaptive immune network algorithm for robot path planning.",
            "Outage analysis of interference-limited systems using STBC with co-channel MIMO interferers.",
            "Energy-efficient cooperative routing in BER constrained multishop networks.",
            "Challenges and possible approaches: towards the petaflops computers.",
            "Four styles of parallel and net programming.",
            "Cluster based parallel database management system for data intensive computing.",
            "Minimizing interconnect length on reconfigurable meshes.",
            "Complex networks and computing.",
            "An alternative approach to characterize the topology of complex networks and its application in epidemic spreading.",
            "Multidimensional views on mobile call network.",
            "Correlation in mobile call networks from structure perspective.",
            "A new centrality measure based on sub-tree.",
            "SIS model of epidemic spreading on dynamical networks with community.",
            "Detecting community structure in networks by representative energy.",
            "Scale-free network models with accelerating growth.",
            "Hybrid information retrieval policies based on cooperative cache in mobile P2P networks.",
            "Class structure refactoring of object-oriented softwares using community detection in dependency networks.",
            "A fast iterative-clique percolation method for identifying functional modules in protein interaction networks.",
            "Evaluation of subgraph searching algorithms detecting network motif in biological networks.",
            "Improved collaborative filtering algorithm based on heat conduction.",
            "Generalized collaboration networks in software systems: a case study of Linux kernels.",
            "SWER: small world-based efficient routing for wireless sensor networks with mobile sinks.",
            "Socially inspired search and ranking in mobile social networking: concepts and challenges.",
            "Detecting academic experts by topic-sensitive link analysis.",
            "Knowledge fusion framework based on Web page texts.",
            "Measurement of refinement and correctness.",
            "Geometric algorithm for point projection and inversion onto Bézier surfaces.",
            "Validation indices for projective clustering.",
            "On the equal-weight symmetric Boolean functions.",
            "Security evaluation against differential and linear cryptanalyses for Feistel ciphers.",
            "A bipartite model for load balancing in grid computing environments.",
            "Approximation algorithm for constructing data aggregation trees for wireless sensor networks.",
            "Virtual node based adaptive routing in wireless ad hoc networks.",
            "Research of localization approach for the new comer in wireless sensor networks.",
            "A new parallel scheduling system for multiple radio wireless mesh network.",
            "Algorithm and axiomatization of rough fuzzy sets based finite dimensional fuzzy vectors."
        ]
    },
    {
        "name": "FCS",
        "year": "2008",
        "info": "Volume 2: 2008",
        "count": 42,
        "papers": [
            "Basic research in computer science and software engineering at SKLCS.",
            "Calculi of meta-variables.",
            "Human factors in continuous time-concerned cooperative systems represented by N Sigma-labeled calculus.",
            "Semantics of sub-probabilistic programs.",
            "Computational origami environment on the web.",
            "On the verification of polynomial system solvers.",
            "Fraction-free matrix factors: new forms for LU and QR factors.",
            "An extended EM algorithm for subspace clustering.",
            "Gibbs artifact reduction for POCS super-resolution image reconstruction.",
            "Arnetminer: expertise oriented search using social networks.",
            "ID-based deniable ring authentication with constant-size signature.",
            "Progress in theoretical quantum computing.",
            "Entanglement of formation and concurrence for mixed states.",
            "Decoherence control for high-temperature reservoirs.",
            "Quantum fixed-point search algorithm with general phase shifts.",
            "Constructing quantum codes.",
            "Controlled teleportation.",
            "Quantum programming languages.",
            "Duality quantum computing.",
            "Quantum probabilistically cloning and computation.",
            "High-dimension Bell inequalities.",
            "An overview of quantum computation models: quantum automata.",
            "Introduction to the special section on peer-to-peer computing and web data management.",
            "Using Wide Table to manage web data: a survey.",
            "Decentralized architecture for resource management of group-based distributed systems.",
            "Supporting K nearest neighbors query on high-dimensional data in P2P systems.",
            "Distributed query processing in flash-based sensor networks.",
            "Traceable P2P record exchange: a database-oriented approach.",
            "Status of pattern recognition with wavelet analysis.",
            "Median Fisher Discriminator: a robust feature extraction method with applications to biometrics.",
            "Dynamic description logic model for data integration.",
            "Pushing requirements changes through to changes in specifications.",
            "Verifying BPEL-like programs with Hoare logic.",
            "On automatic verification of self-stabilizing population protocols.",
            "Compositional encoding for bounded model checking.",
            "Automated verification of pointer programs in pointer logic.",
            "Workflow-based semantics for peer-to-peer specifications.",
            "A Petri net-based approach for supporting aspect-oriented modeling.",
            "Style transformation in natural languages.",
            "An improved algorithm for gray image representation using non-symmetry and anti-packing model with triangles and rectangles.",
            "A robust localization algorithm in wireless sensor networks.",
            "Types, structures and theories in NKI."
        ]
    },
    {
        "name": "FCS",
        "year": "2007",
        "info": "Volume 1: 2007",
        "count": 45,
        "papers": [
            "Mathematics mechanization and applications after thirty years.",
            "A model for BPEL-like languages.",
            "Dawning4000A high performance computer.",
            "Recognizing the agent's goals incrementally: planning graph as a basis.",
            "A quick overview of membrane computing with some details about spiking neural P systems.",
            "Supporting crosscutting concern modelling in software architecture design.",
            "HTRDP evaluations on Chinese information processing and intelligent human-machine interface.",
            "Compiler-directed power optimization of high-performance interconnection networks for load-balancing MPI applications.",
            "Extraction of delta-lognormal parameters from handwriting strokes.",
            "P2P worm detection based on application identification.",
            "Remarks on different reviews of Chinese character recognition.",
            "Chinese character recognition: history, status and prospects.",
            "Offline Chinese handwriting recognition: an assessment of current technology.",
            "Models of parallel computation: a survey and classification.",
            "A survey of passive technology for digital image forensics.",
            "On the design and implementation of a geometric-object-oriented language.",
            "Semantic interpretation of compositional logic in instantiation space.",
            "CMM: Credential migration management system based on trusted computing in CGSP.",
            "EMMP: a highly efficient membership management protocol.",
            "SONNET: subscription using path queries over structured overlay networks.",
            "On constructing disjoint linear codes.",
            "A data-distributed parallel algorithm for wavelet-based fusion of remote sensing images.",
            "A mesh-based automatic in-betweening algorithm in computer-assisted animation.",
            "Search an unsorted database with quantum mechanics.",
            "An overview of the haplotype problems and algorithms.",
            "Well limit behaviors of term rewriting systems.",
            "A pointer logic and certifying compiler.",
            "Research on dynamic update transaction for Java classes.",
            "Requirement emergence computation of networked software.",
            "Performance analysis of a dependable scheduling strategy based on a fault-tolerant grid model.",
            "An optimal replication strategy for data grid systems.",
            "High TPO/TCO for data storage: policy, algorithm and early practice.",
            "A hierarchical model for structure learning based on the physiological characteristics of neurons.",
            "Weakly distributive domains (II).",
            "Advances in cryptography and information security - introduction of 2002-2006 progress of SKLOIS.",
            "Online isolation of defects in cellular nanocomputers.",
            "Ranking with uncertain labels and its applications.",
            "Recent advances on NLP research in Harbin Institute of Technology.",
            "Inference and learning in hybrid probabilistic network.",
            "Discourage free riding in Peer-to-Peer file sharing systems with file migration and workload balancing approach.",
            "Towards structural Web Services matching based on Kernel methods.",
            "An improved algorithm for finding community structure in networks with an application to IPv6 backbone network.",
            "Adaptive scheduling for shared window joins over data streams.",
            "A high-speed and low-cost storage architecture based on virtual interface.",
            "Study on consistent query answering in inconsistent databases."
        ]
    }
]