[
    {
        "year": "2021",
        "name": "14th IEEE CLOUD 2021",
        "info": "Chicago, IL, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/IEEEcloud/2021",
                "sub_name": "14th IEEE International Conference on Cloud Computing, CLOUD 2021, Chicago, IL, USA, September 5-10, 2021.",
                "count": 89,
                "papers": [
                    "TRIGLAV: Remote Attestation of the Virtual Machine's Runtime Integrity in Public Clouds.",
                    "Cloud Property Graph: Connecting Cloud Security Assessments with Static Code Analysis.",
                    "Secure k-Anonymization over Encrypted Databases.",
                    "AI Multi-Tenancy on Edge: Concurrent Deep Learning Model Executions and Dynamic Model Placements on Edge Devices.",
                    "The Case for Adaptive Deep Neural Networks in Edge Computing.",
                    "Primitives Enhancing GPU Runtime Support for Improved DNN Performance.",
                    "Non-interactive Privacy Preserving Recurrent Neural Network Prediction with Homomorphic Encryption.",
                    "Image Disguising for Protecting Data and Model Confidentiality in Outsourced Deep Learning.",
                    "Origami Inference: Private Inference Using Hardware Enclaves.",
                    "ChatCache: A Hierarchical Semantic Redundancy Cache System for Conversational Services at Edge.",
                    "Into Summarization Techniques for IoT Data Discovery Routing.",
                    "Dynamic Edge-Twin Computing for Vehicle Tracking.",
                    "A system for proactive risk assessment of application changes in cloud operations.",
                    "Causal Modeling based Fault Localization in Cloud Systems using Golden Signals.",
                    "AI-Assisted Security Controls Mapping for Clouds Built for Regulated Workloads.",
                    "Performance Evaluation of Asynchronous FaaS.",
                    "Efficient Processing of Streaming Data using Multiple Abstractions.",
                    "Optimizing Cloud Function Configuration via Local Simulations.",
                    "Supporting Real-Time ${T}$-Queries on Network Traffic with a Cloud-Based Offloading Model.",
                    "Privacy-Preserving Decentralized Edge Caching in 5G Networks.",
                    "A Generalized Nesterov-Accelerated Hessian-Vector-Based Latent Factor Analysis Model for QoS Prediction.",
                    "Polaris Scheduler: Edge Sensitive and SLO Aware Workload Scheduling in Cloud-Edge-IoT Clusters.",
                    "EdgePS: Selective Parameter Aggregation for Distributed Machine Learning in Edge Computing.",
                    "HPTMT: Operator-Based Architecture for Scalable High-Performance Data-Intensive Frameworks.",
                    "A Deep Reinforcement Learning Approach to Resource Management in Hybrid Clouds Harnessing Renewable Energy and Task Scheduling.",
                    "Federated or Split? A Performance and Privacy Analysis of Hybrid Split and Federated Learning Architectures.",
                    "Knowledge & Learning-based Adaptable System for Sensitive Information Identification and Handling.",
                    "LEGATO: A LayerwisE Gradient AggregaTiOn Algorithm for Mitigating Byzantine Attacks in Federated Learning.",
                    "Prof-gen: Practical Study on System Call Whitelist Generation for Container Attack Surface Reduction.",
                    "Integrity Protection for Kubernetes Resource Based on Digital Signature.",
                    "Secure Offloading of Intrusion Detection Systems from VMs with Intel SGX.",
                    "Flexible and Efficient Blockchain-Based Cloud Storage.",
                    "An Evaluation of Serverless Computing on X86 and ARM platforms: Performance and Design Implications.",
                    "Agile and Dynamic Virtualized Network Functions Wiring in Network Services.",
                    "A Case for Function-as-a-Service with Disaggregated FPGAs.",
                    "T2FA: A Heuristic Algorithm for Deadline-Constrained Workflow Scheduling in Cloud with Multicore Resource.",
                    "Towards Consistent VNF Forwarding Graph Reconfiguration in Multi-domain Environments.",
                    "Impact of Distributed Rate Limiting on Load Distribution in a Latency-sensitive Messaging Service.",
                    "Oasis: Performance Matching IoT System Emulation.",
                    "Cost-Effective Dynamic Optimisation for Multi-Cloud Queries.",
                    "An Empirical Analysis of VM Startup Times in Public IaaS Clouds.",
                    "Theta-Scan: Leveraging Behavior-Driven Forecasting for Vertical Auto-Scaling in Container Cloud.",
                    "A Novel Middleware for Efficiently Implementing Complex Cloud-Native SLOs.",
                    "Energy and Expenditure Aware Data Replication Strategy.",
                    "A Mechanism Design and Learning Approach for Revenue Maximization on Cloud Dynamic Spot Markets.",
                    "SODA: A Semantics-Aware Optimization Framework for Data-Intensive Applications Using Hybrid Program Analysis.",
                    "Characterizing Loop Acceleration in Heterogeneous Computing.",
                    "HPKS: High Performance Kubernetes Scheduling for Dynamic Blockchain Workloads in Cloud Computing.",
                    "Optimizing VMs across Multiple Hosts with Transparent and Consistent Tracking of Unused Memory.",
                    "Architecture-Specific Performance Optimization of Compute-Intensive FaaS Functions.",
                    "Exploiting Sub-page Write Protection for VM Live Migration.",
                    "Performance Evaluation of Data-Centric Workloads in Serverless Environments.",
                    "Real-time task scheduling in a FaaS cloud.",
                    "RDOF: Deployment Optimization for Function as a Service.",
                    "Fast and Efficient Performance Tuning of Microservices.",
                    "Understanding Flash-Based Storage I/O Behavior of Games.",
                    "Skynet: Performance-driven Resource Management for Dynamic Workloads.",
                    "Fundy: A Scalable and Extensible Resource Manager for Cloud Resources.",
                    "Generalizing QoS-Aware Memory Bandwidth Allocation to Multi-Socket Cloud Servers.",
                    "Detecting Causal Structure on Cloud Application Microservices Using Granger Causality Models.",
                    "NL2Vul: Natural Language to Standard Vulnerability Score for Cloud Security Posture Management.",
                    "Ensemble of Unsupervised Parametric and Non-Parametric Techniques to Discover Change Actions.",
                    "Energy-Aware Learning Agent (EALA) for Disaggregated Cloud Scheduling.",
                    "Latency-aware Batch Task Offloading for Vehicular Cloud: Maximizing Submodular Bandit.",
                    "Quality-Aware Video Offloading in Mobile Edge Computing: A Data-driven Two-stage Stochastic Optimization.",
                    "A Cost-Efficient Resource Provisioning and Scheduling Approach for Deadline-Sensitive MapReduce Computations in Cloud Environment.",
                    "Run Wild: Resource Management System with Generalized Modeling for Microservices on Cloud.",
                    "Rightsizing Clusters for Time-Limited Tasks.",
                    "Para: Harvesting CPU time fragments in Big Data Analytics.",
                    "Towards A Robust Meta-Reinforcement Learning-Based Scheduling Framework for Time Critical Tasks in Cloud Environments.",
                    "DLB: Deep Learning Based Load Balancing.",
                    "A Holistic Approach to Data Access for Cloud-Native Analytics and Machine Learning.",
                    "Pogonip: Scheduling Asynchronous Applications on the Edge.",
                    "Air-to-Air Collaborative Learning: A Multi-Task Orchestration in Federated Aerial Computing.",
                    "Distributing intelligence for object detection using edge computing.",
                    "Usage Trends Aware VM Placement in Academic Research Computing Clouds.",
                    "Neon: Low-Latency Streaming Pipelines for HPC.",
                    "ACA: Application Containerization Advisory Framework for Modernizing Legacy Applications.",
                    "Edge Service Deployment via Online Learning.",
                    "Insights into Multi-Layered Fault Propagation and Analysis in a Cloud Stack.",
                    "Konveyor Move2Kube: Automated Replatforming of Applications to Kubernetes.",
                    "Exploring the Network-Sensitive Scheduling on Distributed Shared Memory.",
                    "An Automata-based Profit Optimization of Cloud Brokers in IaaS Environment.",
                    "Acceleration-as-a-µService: A Cloud-native Monte-Carlo Option Pricing Engine on CPUs, GPUs and Disaggregated FPGAs.",
                    "Performance Analysis of Zero-Trust multi-cloud.",
                    "HySec-Flow: Privacy-Preserving Genomic Computing with SGX-based Big-Data Analytics Framework.",
                    "@An automated self-service multi-cloud HPC platform applied to the simulation of cardiac valve disease with machine learning.",
                    "Challenges of Distributed Computing for Pandemic Spread Prediction based on Large-Scale Human Interaction Data.",
                    "Molecular Dynamics Simulations on Cloud Computing and Machine Learning Platforms."
                ]
            }
        ]
    },
    {
        "year": "2020",
        "name": "13th IEEE CLOUD 2020",
        "info": "Virtual Event",
        "venues": [
            {
                "sub_name_abbr": "conf/IEEEcloud/2020",
                "sub_name": "13th IEEE International Conference on Cloud Computing, CLOUD 2020, Virtual Event, 18-24 October 2020.",
                "count": 84,
                "papers": [
                    "Anomaly Detection in Cloud Components.",
                    "The Research on Agricultural Product Price Forecasting Service Based on Combination Model.",
                    "Recursive LSTM with Shift Embedding for Online User-Item Interaction Prediction.",
                    "Designing knowledge plane to optimize leaf and spine data center.",
                    "LambDP: Data Processing Framework for Terminal Applications in IoTs Services.",
                    "Adaptive Control Channel Traffic Shaping for Virtualized SDN in Clouds.",
                    "TensorExpress: In-Network Communication Scheduling for Distributed Deep Learning.",
                    "Offloading Deadline-aware Task in Edge Computing.",
                    "Analysis of SQL Workloads on an Enterprise Datalake.",
                    "Container Orchestration on HPC Systems.",
                    "Deep neural architecture for geospatial trajectory completion over occupancy gridmap.",
                    "Constrained Energy-Cost-Aware Workflow Scheduling for Cloud Environment.",
                    "Secure IoT Data Analytics in Cloud via Intel SGX.",
                    "Be Your Neighbor's Miner: Building Trust in Ledger Content via Reciprocally Useful Work.",
                    "The Million Dollar Handshake: Secure and Attested Communications in the Cloud.",
                    "ViCLOUD: Measuring Vagueness in Cloud Service Privacy Policies and Terms of Services.",
                    "VR Design and Display System of Ceramic Products Based on Cloud Service Platform.",
                    "Cloud Governance.",
                    "Service Management in the Edge Cloud for Stream Processing of IoT Data.",
                    "Service Load Prediction based on User Knowledge Level Evolution for Software Development Knowledge Base.",
                    "Scalable Graph Convolutional Network based Link Prediction on a Distributed Graph Database Server.",
                    "Resource and Job Execution Context-Aware Hadoop Configuration Tuning.",
                    "Toward Efficient Indoor Positioning for Cloud Services in SIoT.",
                    "VMatch: A Matching Theory Based VDC Reconfiguration Strategy.",
                    "Deep Unsupervised Workload Sequence Anomaly Detection with Fusion of Spatial and Temporal Features in the Cloud.",
                    "Serverless Elastic Exploration of Unbalanced Algorithms.",
                    "DEAR: Distributed Evaluation of Alerting Rules.",
                    "A Content-wise Data Placement Policy for Improving the Performance of MapReduce-based Video Processing Applications in Cloud Computing.",
                    "Collaborative Computation Offloading for Smart Cities in Mobile Edge Computing.",
                    "Optimal Application Deployment in Mobile Edge Computing Environment.",
                    "Proactive Data Caching and Replacement in the Edge Computing Environment.",
                    "MYSTIKO: Cloud-Mediated, Private, Federated Gradient Descent.",
                    "PONCHE: Personalized and Context-Aware Vehicle Rerouting Service.",
                    "Auto-Generation of Domain-Specific Systems: Cloud-Hosted DevOps for Business Users.",
                    "Auto-Scaling Cloud-Based Memory-Intensive Applications.",
                    "ImageJockey: A Framework for Container Performance Engineering.",
                    "Flexible and Efficient Partial Migration of Split-memory VMs.",
                    "A Hierarchical Control Plane Framework for Integrated SDN-SFC Management in Multi-tenant Cloud Data Centers.",
                    "Resource Optimization and Delay-aware Virtual Network Function Placement for Mapping SFC Requests in NFV-enabled Networks.",
                    "QoS Control Method Based on SDN for Mobile Cloud Service.",
                    "On the Use of Containers in High Performance Computing Environments.",
                    "Lambdata: Optimizing Serverless Computing by Making Data Intents Explicit.",
                    "Serverless Computing: Behind the Scenes of Major Platforms.",
                    "Realizing A Composable Enterprise Microservices Fabric with AI-Accelerated Material Discovery API Services.",
                    "Sledge: Towards Efficient Live Migration of Docker Containers.",
                    "RITA: Efficient Memory Allocation Scheme for Containerized Parallel Systems to Improve Data Processing Latency.",
                    "Allies: Tile-Based Joint Transcoding, Delivery and Caching of 360° Videos in Edge Cloud Networks.",
                    "Multi-objective Cross-layer Resource Scheduling for Internet of Things in Edge-Cloud Computing.",
                    "Wasmachine: Bring the Edge up to Speed with A WebAssembly OS.",
                    "Optimizing Allocation and Scheduling of Connected Vehicle Service Requests in Cloud/Edge Computing.",
                    "DeepPM: Efficient Power Management in Edge Data Centers using Energy Storage.",
                    "CFP: A Cross-layer Recommender System with Fine-grained Preloading for Short Video Streaming at Network Edge.",
                    "A Lightweight SOA-Based Network Slicing Creation System.",
                    "PCHA: A Fast Packet Classification Algorithm For IPv6 Based On Hash And AVL Tree.",
                    "An Efficient Database Backup and Recovery Scheme using Write-Ahead Logging.",
                    "The Design and Implementation of a Scalable Deep Learning Benchmarking Platform.",
                    "FedMax: Enabling a Highly-Efficient Federated Learning Framework.",
                    "Variable batch size across layers for efficient prediction on CNNs.",
                    "Towards Tracking Data Flows in Cloud Architectures.",
                    "Enforcing Corporate Governance's Internal Controls and Audit in the Cloud.",
                    "Maximizing Reliability of Data-Intensive Workflow Systems with Active Fault Tolerance Schemes in Cloud.",
                    "Modelling VM Latent Characteristics and Predicting Application Performance using Semi-supervised Non-negative Matrix Factorization.",
                    "Proactive Container Auto-scaling for Cloud Native Machine Learning Services.",
                    "What-if QoS Prediction of Cloud-hosted Web Services via Domain Adaptation in Evolutionary Scenarios.",
                    "Scheduling Physical Machine Maintenance on Qualified Clouds: What if Migration is not Allowed?",
                    "RAD: Detecting Performance Anomalies in Cloud-based Web Services.",
                    "A Noise-aware Asymmetric Spectral Regularization Collective Matrix Factorization Algorithm for Recommender System in Cloud Services.",
                    "Phase Aware Performance Modeling for Cloud Applications.",
                    "Cloud Resource Provisioning and Bottleneck Eliminating for Meshed Web Systems.",
                    "VM Migration for Secure Out-of-band Remote Management with Nested Virtualization.",
                    "A Prediction Based Replica Selection Strategy for Reducing Tail Latency in Distributed Systems.",
                    "Energy Efficient Decentralized Geographical Load Balancing via Dynamic Deferral of Workload.",
                    "Evaluating Concurrent Executions of Multiple Function-as-a-Service Runtimes with MicroVM.",
                    "A control system for managing the flexibility in BPMN models of cloud service workflows.",
                    "Spark-Tuner: An Elastic Auto-Tuner for Apache Spark Streaming.",
                    "Forward Secure Public Key Encryption with Keyword Search for Cloud-assisted IoT.",
                    "Robustness Analysis of Triangle Relations Attack in Social Recommender Systems.",
                    "LSH-based Collaborative Recommendation Method with Privacy-Preservation.",
                    "GMAS: A Geo-Aware MAS-Based Workflow Allocation Approach on Hybrid-Edge-Cloud Environment.",
                    "Multi-Request Scheduling and Collaborative Service Processing for DASH-Video Optimization in Cloud-Edge Network.",
                    "JANUS: Benchmarking Commercial and Open-Source Cloud and Edge Platforms for Object and Anomaly Detection Workloads.",
                    "RSDS: Getting System Call Whitelist for Container Through Dynamic and Static Analysis.",
                    "Skedulix: Hybrid Cloud Scheduling for Cost-Efficient Execution of Serverless Applications.",
                    "TOPOSCH: Latency-Aware Scheduling Based on Critical Path Analysis on Shared YARN Clusters."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "12th IEEE CLOUD 2019",
        "info": "Milan, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/IEEEcloud/2019",
                "sub_name": "12th IEEE International Conference on Cloud Computing, CLOUD 2019, Milan, Italy, July 8-13, 2019.",
                "count": 84,
                "papers": [
                    "Big Data Benchmarks of High-Performance Storage Systems on Commercial Bare Metal Clouds.",
                    "Anomaly Detection over Streaming Data: Indy500 Case Study.",
                    "Elevating the Edge to Be a Peer of the Cloud.",
                    "Cross-Layer Optimization of Big Data Transfer Throughput and Energy Consumption.",
                    "Exploring Potential for Non-Disruptive Vertical Auto Scaling and Resource Estimation in Kubernetes.",
                    "Managing Allocatable Resources.",
                    "An Economic Analysis of Cloud Computing Service Using Reclaimed Resources.",
                    "Cloud Readiness Planning Tool (CRPT): An AI-Based Framework to Automate Migration Planning.",
                    "A Deadline Constrained Preemptive Scheduler Using Queuing Systems for Multi-Tenancy Clouds.",
                    "Cloud VM Provisioning Using Analytical Performance Models.",
                    "Privacy-Preserving Smart Surveillance Using Local Color Correction and Optimized ElGamal Cryptosystem over Cloud.",
                    "Data Protection as a Service in the Multi-Cloud Environment.",
                    "Children Privacy Identification System in LINE Chatbot for Smart Toys.",
                    "Traffic-Aware and Reliability-Guaranteed Virtual Machine Placement Optimization in Cloud Datacenters.",
                    "Machine Learning for Performance Prediction of Spark Cloud Applications.",
                    "SafeDB: Spark Acceleration on FPGA Clouds with Enclaved Data Processing and Bitstream Protection.",
                    "Failure-Aware Application Placement Modeling and Optimization in High Turnover DevOps Environment.",
                    "An Approach to Cloud Execution Failure Diagnosis Based on Exception Logs in OpenStack.",
                    "Using Structural Similarity to Predict Future Workload Behavior in the Cloud.",
                    "Online VM Consolidation in Cloud Environments.",
                    "SLA-Aware and Deadline Constrained Profit Optimization for Cloud Resource Management in Big Data Analytics-as-a-Service Platforms.",
                    "A Framework for Monitoring Microservice-Oriented Cloud Applications in Heterogeneous Virtualization Environments.",
                    "DMFD: Non-Intrusive Dependency Inference and Flow Ratio Model for Performance Anomaly Detection in Multi-Tier Cloud Applications.",
                    "Toward an Online Network Intrusion Detection System Based on Ensemble Learning.",
                    "Anomaly Detection from System Tracing Data Using Multimodal Deep Learning.",
                    "Improving Big Data Application Performance in Edge-Cloud Systems.",
                    "Real-Time Workload Allocation Optimizer for Computing Systems by Using Deep Learning.",
                    "A Function Clustering Algorithm for Resource Utilization in Service Function Chaining.",
                    "Dynamic Virtual Machine Placement Considering CPU and Memory Resource Requirements.",
                    "Spock: Exploiting Serverless Functions for SLO and Cost Aware Resource Procurement in Public Cloud.",
                    "Cost-Efficient Stream Processing on the Cloud.",
                    "Utility-Based Strategy for Balanced Cost and Availability at the Cloud Spot Market.",
                    "Robust Management of Trans-Cloud Applications.",
                    "STRETCH: In-Memory Storage with Autoscaling for Cluster Computing.",
                    "A Transactional Framework for Broadening Access to Geo-Diversification.",
                    "Cognitive Compliance: Analyze, Monitor and Enforce Compliance in the Cloud.",
                    "Testing for Bugs of Cloud-Based Applications Resulting from Spot Instance Revocations.",
                    "Finding Risk Patterns in Cloud System Models.",
                    "Data Reduction, Compression, and Recovery for Online Performance Monitoring.",
                    "DAGBENCH: A Performance Evaluation Framework for DAG Distributed Ledgers.",
                    "Towards Latency Sensitive Cloud Native Applications: A Performance Study on AWS.",
                    "Adaptive Partition Migration for Irregular Graph Algorithms on Elastic Resources.",
                    "Towards the Modelling of Hybrid Cloud Applications.",
                    "An Adaptive Approach for Dealing with Flow Disruption in Virtualized Water-Cooled Data Centers.",
                    "DiCeS: Detecting Communities in Network Streams over the Cloud.",
                    "Non-Intrusive Cloud Application Transaction Pattern Discovery.",
                    "Empowering Owners with Control in Digital Data Markets.",
                    "Horizontal and Vertical Scaling of Container-Based Applications Using Reinforcement Learning.",
                    "Power and Time Aware VM Migration for Multi-Tier Applications over Geo-Distributed Clouds.",
                    "Multi-Objective Resource Mapping and Allocation for Volunteer Cloud Computing.",
                    "QuADD: QUantifying Accelerator Disaggregated Datacenter Efficiency.",
                    "Bolt: Towards a Scalable Docker Registry via Hyperconvergence.",
                    "z-READ: Towards Efficient and Transparent Zero-Copy Read.",
                    "TrIMS: Transparent and Isolated Model Sharing for Low Latency Deep Learning Inference in Function-as-a-Service.",
                    "Industrial-Scale Stateless Network Functions.",
                    "Karamel: A System for Timely Provisioning Large-Scale Software across IaaS Clouds.",
                    "Cuckoo: Opportunistic MapReduce on Ephemeral and Heterogeneous Cloud Resources.",
                    "Seneca: Fast and Low Cost Hyperparameter Search for Machine Learning Models.",
                    "Workload Characterization for a Non-Hyperscale Public Cloud Platform.",
                    "On-Premises Serverless Computing for Event-Driven Data Processing Applications.",
                    "Model-Driven Orchestration for Cloud Resources.",
                    "CadaML: A Modeling Language for Multi-Tenant Cloud Application Data Architectures.",
                    "A Framework for Collaborative Learning in Secure High-Dimensional Space.",
                    "Time-Sensitive Provisioning of Bare Metal Compute as a Cloud Service.",
                    "Novel Genetic Algorithm with Dual Chromosome Representation for Resource Allocation in Container-Based Clouds.",
                    "Distributing an SQL Query over a Cluster of Containers.",
                    "uSendfile: A User-Space Sendfile Verb Based on Flash and RDMA.",
                    "In Method We Trust: Towards an Open Method Kit for Characterizing Spot Cloud Service Pricing.",
                    "Evaluation of NUMA-Aware Scheduling in Warehouse-Scale Clusters.",
                    "Scalable Pathogen Pipeline Platform (SP3): Enabling Unified Genomic Data Analysis with Elastic Cloud Computing.",
                    "Towards Approximating Expected Job Completion Time in Dynamic Vehicular Clouds.",
                    "Blockchain-Based E-Vote-as-a-Service.",
                    "Privacy-Preserving Association Rule Mining Algorithm for Encrypted Data in Cloud Computing.",
                    "Virtual Machine Pre-Provisioning for Computation Offloading Service in Edge Cloud.",
                    "Fast and Lightweight Execution Time Predictions for Spark Applications.",
                    "A Highly Efficient Data Locality Aware Task Scheduler for Cloud-Based Systems.",
                    "Exploiting Serverless Runtimes for Large-Scale Optimization.",
                    "FunctionBench: A Suite of Workloads for Serverless Cloud Function Service.",
                    "FAVE: Bandwidth-Aware Failover in Virtualized SDN for Clouds.",
                    "GlobalFlow: A Cross-Region Orchestration Service for Serverless Computing Services.",
                    "Analysis and Evaluation of Kubernetes Based NFV Management and Orchestration.",
                    "Towards Scalable k-out-of-n Models for Assessing the Reliability of Large-Scale Function-as-a-Service Systems with Bayesian Networks.",
                    "Slimmer: Weight Loss Secrets for Docker Registries.",
                    "Efficient Deep Learning Hyperparameter Tuning Using Cloud Infrastructure: Intelligent Distributed Hyperparameter Tuning with Bayesian Optimization in the Cloud."
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "11th IEEE CLOUD 2018",
        "info": "San Francisco, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/IEEEcloud/2018",
                "sub_name": "11th IEEE International Conference on Cloud Computing, CLOUD 2018, San Francisco, CA, USA, July 2-7, 2018.",
                "count": 145,
                "papers": [
                    "DROPLET: Distributed Operator Placement for IoT Applications Spanning Edge and Cloud Resources.",
                    "Performance Evaluation of Low Latency Communication Alternatives in a Containerized Cloud Environment.",
                    "FIOS: Feature Based I/O Stream Identification for Improving Endurance of Multi-Stream SSDs.",
                    "DSES: A Blockchain-Powered Decentralized Service Eco-System.",
                    "Toward Cost-Effective Memory Scaling in Clouds: Symbiosis of Virtual and Physical Memory.",
                    "CloudInsight: Utilizing a Council of Experts to Predict Future Cloud Application Workloads.",
                    "Automated Enforcement of SLA for Cloud Services.",
                    "Cost-Benefit Analysis of Public Clouds for Offloading In-House HPC Jobs.",
                    "Latency-Aware Task Assignment and Scheduling in Collaborative Cloud Robotic Systems.",
                    "Performance and Behavior Characterization of Amazon EC2 Spot Instances.",
                    "Performance Interference-Aware Vertical Elasticity for Cloud-Hosted Latency-Sensitive Applications.",
                    "Estimating Cloud Application Performance Based on Micro-Benchmark Profiling.",
                    "Oases: An Online Scalable Spam Detection System for Social Networks.",
                    "Bandwidth Optimal Data/Service Delivery for Connected Vehicles via Edges.",
                    "Analyzing Moving Target Defense for Resilient Campus Private Cloud.",
                    "Flexible VM Provisioning for Time-Sensitive Applications with Multiple Execution Options.",
                    "Analysis of Dynamically Switching Energy-Aware Scheduling Policies for Varying Workloads.",
                    "Temporal Task Scheduling for Delay-Constrained Applications in Geo-Distributed Cloud Data Centers.",
                    "An Efficient Secure Distributed Cloud Storage for Append-Only Data.",
                    "Secure k-NN as a Service over Encrypted Data in Multi-User Setting.",
                    "Malware Detection in Cloud Infrastructures Using Convolutional Neural Networks.",
                    "I/O Characteristics Discovery in Cloud Storage Systems.",
                    "A Comparative Study of Containers and Virtual Machines in Big Data Environment.",
                    "Hybrid HPC Cloud Strategies from the Student Cluster Competition.",
                    "A Toolset for Detecting Containerized Application's Dependencies in CaaS Clouds.",
                    "PMDC: Programmable Mobile Device Clouds for Convenient and Efficient Service Provisioning.",
                    "Semantic-Aware Online Workload Characterization and Consolidation.",
                    "CAPI-Flash Accelerated Persistent Read Cache for Apache Cassandra.",
                    "Data Plane Offloading on a High-Speed Parallel Processing Architecture.",
                    "BloomStream: Data Temperature Identification for Flash Based Memory Storage Using Bloom Filters.",
                    "Towards Selecting Best Combination of SQL-on-Hadoop Systems and JVMs.",
                    "Tracing Function Dependencies across Clouds.",
                    "StackInsights: Cognitive Learning for Hybrid Cloud Readiness.",
                    "Dynamic Timestamp Allocation for Reducing Transaction Aborts.",
                    "Intermediate Data Caching Optimization for Multi-Stage and Parallel Big Data Frameworks.",
                    "S-memV: Split Migration of Large-Memory Virtual Machines in IaaS Clouds.",
                    "On Building Efficient Temporal Indexes on Hyperledger Fabric.",
                    "CloudPoS: A Proof-of-Stake Consensus Design for Blockchain Integrated Cloud.",
                    "Service Management of Blockchain Networks.",
                    "RIOT: A Stochastic-Based Method for Workflow Scheduling in the Cloud.",
                    "Beyond Generic Lifecycles: Reusable Modeling of Custom-Fit Management Workflows for Cloud Applications.",
                    "Exploring Serverless Computing for Neural Network Training.",
                    "Time Inference Attacks on Software Defined Networks: Challenges and Countermeasures.",
                    "FlowVirt: Flow Rule Virtualization for Dynamic Scalability of Programmable Network Virtualization.",
                    "Semi-Markov Process Based Reliability and Availability Prediction for Volunteer Cloud Systems.",
                    "Specifying Semantic Interoperability between Heterogeneous Cloud Resources with the FCLOUDS Formal Language.",
                    "SAM: A Semantic-Aware Middleware for Mobile Cloud Computing.",
                    "Twister: Net - Communication Library for Big Data Processing in HPC and Cloud Environments.",
                    "Privacy-Preserving and Updatable Block-Level Data Deduplication in Cloud Storage Services.",
                    "A Privacy-Preserving Voting Protocol on Blockchain.",
                    "Micky: A Cheaper Alternative for Selecting Cloud Instances.",
                    "Towards Automatic Tuning of Apache Spark Configuration.",
                    "Best First Fit (BFF): An Approach to Partially Reconfigurable Hybrid Circuit and Packet Switching.",
                    "Exploring the Fairness and Resource Distribution in an Apache Mesos Environment.",
                    "Evaluation of Production Serverless Computing Environments.",
                    "Serverless Data Analytics with Flint.",
                    "Making Serverless Computing More Serverless.",
                    "Challenges for Scheduling Scientific Workflows on Cloud Functions.",
                    "Evaluation of Container Orchestration Systems for Deploying and Managing NoSQL Database Clusters.",
                    "Real Time Metering of Cloud Resource Reading Accurate Data Source Using Optimal Message Serialization and Format.",
                    "Empowering Dynamic Task-Based Applications with Agile Virtual Infrastructure Programmability.",
                    "A Novel Automated Cloud Storage Tiering System through Hot-Cold Data Classification.",
                    "Embedding Index Maintenance in Store Routines to Accelerate Secondary Index Building in HBase.",
                    "Automatic Tuning of SQL-on-Hadoop Engines on Cloud Platforms.",
                    "Allocation of Publisher/Subscriber Data Links on a Set of Virtual Machines.",
                    "Business Modeling and Design in the Internet-of-Things Context.",
                    "Remote Monitoring and Online Testing of Machine Tools for Fault Diagnosis and Maintenance Using MTComm in a Cyber-Physical Manufacturing Cloud.",
                    "Building a Vertical Cloud Architecture for Education.",
                    "A2Cloud: An Analytical Model for Application-to-Cloud Matching to Empower Scientific Computing.",
                    "A Data Placement Strategy for Scientific Workflow in Hybrid Cloud.",
                    "Cloud Resellers on Bazaar-Based Cloud Markets.",
                    "Breaking Down the Barriers for Moving an Enterprise to Cloud.",
                    "(WIP) At Most M - A Flexible Redundancy Model for Cloud Robotics.",
                    "(WIP) Blockhub: Blockchain-Based Software Development System for Untrusted Environments.",
                    "(WIP) Evaluation of a Cloud-Based System for Delivering Adaptive Micro Open Education Resource to Fresh Learners.",
                    "Privacy-Preserving Multi-User Encrypted Access Control Scheme for Cloud-Assisted IoT Applications.",
                    "Lambda Containers: A Comprehensive Anti-Tamper Framework for Games by Simulating Client Behavior in a Cloud.",
                    "A Cross-Virtual Machine Network Channel Attack via Mirroring and TAP Impersonation.",
                    "Inter-Bank Payment System on Enterprise Blockchain Platform.",
                    "Cost Optimization Algorithms for Hot and Cool Tiers Cloud Storage Services.",
                    "BDUA: Blockchain-Based Data Usage Auditing.",
                    "Distributed Matrix Multiplication Performance Estimator for Machine Learning Jobs in Cloud Computing.",
                    "An Adaptive Workload Prediction Strategy for Non-Gaussian Cloud Service Using ARMA Model with Higher Order Statistics.",
                    "Efficient Key-Value Stores with Ranged Log-Structured Merge Trees.",
                    "Analytics of Performance and Data Quality for Mobile Edge Cloud Applications.",
                    "An Analytic Model of Traffic Surges for Multi-Server Queues in Cloud Environments.",
                    "Reviewing Cloud Monitoring: Towards Cloud Resource Profiling.",
                    "Comparing Cloud Content Delivery Networks for Adaptive Video Streaming.",
                    "DRESS: Dynamic RESource-Reservation Scheme for Congested Data-Intensive Computing Platforms.",
                    "A Near-Optimal Control Policy in Cloud Systems with Renewable Sources and Time-Dependent Energy Price.",
                    "Improving Energy Efficiency in NFV Clouds with Machine Learning.",
                    "Towards Economic and Compliant Deployment of Licenses in a Cloud Architecture.",
                    "It's Time to Migrate! A Game-Theoretic Framework for Protecting a Multi-Tenant Cloud against Collocation Attacks.",
                    "FEMCRA: Fine-Grained Elasticity Measurement for Cloud Resources Allocation.",
                    "Performance of Virtual Machines Using Diskfull and Diskless Compute Nodes.",
                    "COOL: A Cloud-Optimized Structure for MPI Collective Operations.",
                    "Performance Analysis of Large-Scale Distributed Stream Processing Systems on the Cloud.",
                    "Adaptive Online Runtime Prediction to Improve HPC Applications Latency in Cloud.",
                    "ACCORD: Automated Change Coordination across Independently Administered Cloud Services.",
                    "Migrating VM Workloads to Containers: Issues and Challenges.",
                    "Fair Protocols for Verifiable Computations Using Bitcoin and Ethereum.",
                    "Cloud Computing on Cooperative Cars (C4S): An Architecture to Support Navigation-as-a-Service.",
                    "A Proposal of Autonomic Edge Cloud Platform with CCN-Based Service Routing Protocol.",
                    "owlBIT: Orchestrating Wireless Transmissions for Launching Big Data Platforms in an Internet of Things Environment.",
                    "Revolver: Vertex-Centric Graph Partitioning Using Reinforcement Learning.",
                    "Supporting Mixed Workloads in OpenStack-Based Clouds.",
                    "EMARS: Efficient Management and Allocation of Resources in Serverless.",
                    "Optimal Cloud Resource Selection Method Considering Hard and Soft Constraints and Multiple Conflicting Objectives.",
                    "Distributed Hybrid Cloud Management Platform Based on Rule Engine.",
                    "Dependability Quantification of Cloud-Centric Authentication Frameworks.",
                    "Content Rating Technique for Cloud-Oriented Content Delivery Network Using Weighted Slope One Scheme.",
                    "Handling Co-Resident Attacks: A Case for Cost-Efficient Dedicated Resource Provisioning.",
                    "A Disturbing Question: What Is the Economical Impact of Cloud Computing? A Systematic Mapping.",
                    "Saranyu: Using Smart Contracts and Blockchain for Cloud Tenant Management.",
                    "FPGAVirt: A Novel Virtualization Framework for FPGAs in the Cloud.",
                    "Technological, Organisational and Environmental (TOE) Factors that Influence the Adoption of Cloud Based Service SMEs in India.",
                    "Federated Galaxy: Biomedical Computing at the Frontier.",
                    "Software Greenability: A Case Study of Cloud-Based Business Applications Provisioning.",
                    "HarmonicIO: Scalable Data Stream Processing for Scientific Datasets.",
                    "High-Resolution Ocean Winds: Hybrid-Cloud Infrastructure for Satellite Imagery Processing.",
                    "ORGODEX: Service Portfolios for the Cloud.",
                    "Towards Building a Scalable Data Analytics System on Clouds: An Early Experience on AliCloud.",
                    "PerfInsight: A Robust Clustering-Based Abnormal Behavior Detection System for Large-Scale Cloud.",
                    "Towards Quantum Computing Algorithms for Datacenter Workload Predictions.",
                    "Monitoring Data Integrity in Big Data Analytics Services.",
                    "Formal Analysis of Load Balancing in Microservices with Scenario Calculus.",
                    "Detecting Anomalous Behavior of Black-Box Services Modeled with Distance-Based Online Clustering.",
                    "Virtual Network Functions as Real-Time Containers in Private Clouds.",
                    "Toward Trustworthy Delegation: Verifiable Outsourced Decryption with Tamper-Resistance in Public Cloud Storage.",
                    "PU-ABE: Lightweight Attribute-Based Encryption Supporting Access Policy Update for Cloud Assisted IoT.",
                    "A Privacy-Preserving k-Means Clustering Algorithm Using Secure Comparison Protocol and Density-Based Center Point Selection.",
                    "Attribute Based Encryption for Secure Access to Cloud Based EHR Systems.",
                    "PRESEnCE: Performance Metrics Models for Cloud SaaS Web Services.",
                    "Towards Improving Data Center Utilisation by Reducing Fragmentation.",
                    "Managed Containers: A Framework for Resilient Containerized Mission Critical Systems.",
                    "The Performance Evaluation of Virtual Machine Placement Algorithm Based on WebCloudSim.",
                    "IaaS Reactive Autoscaling Performance Challenges.",
                    "A Cloud-Agnostic Container Orchestrator for Improving Interoperability.",
                    "OpenStack Network Acceleration Scheme for Datacenter Intelligent Applications.",
                    "A Novice Group Sharing Method for Public Cloud.",
                    "Deploying Microservice Based Applications with Kubernetes: Experiments and Lessons Learned.",
                    "Cloud Workflow Resource Shortage Prediction and Fulfillment Using Multiple Adaptation Strategies.",
                    "Logchain: Blockchain-Assisted Log Storage.",
                    "Blockchain-Based E-Voting System.",
                    "ChainFS: Blockchain-Secured Cloud Storage."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "10th IEEE CLOUD 2017",
        "info": "Honolulu, HI, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/IEEEcloud/2017",
                "sub_name": "2017 IEEE 10th International Conference on Cloud Computing (CLOUD), Honolulu, HI, USA, June 25-30, 2017.",
                "count": 114,
                "papers": [
                    "Coflourish: An SDN-Assisted Coflow Scheduling Framework for Clouds.",
                    "PARES: Packet Rewriting on SDN-Enabled Edge Switches for Network Virtualization in Multi-Tenant Cloud Data Centers.",
                    "Workload-Aware Revenue Maximization in SDN-Enabled Data Center.",
                    "Emerge: Self-Emerging Data Release Using Cloud Data Storage.",
                    "Arion: A Model-Driven Middleware for Minimizing Data Loss in Stream Data Storage.",
                    "Taming Performance Hotspots in Cloud Storage with Dynamic Load Redistribution.",
                    "Cloud Standards in Comparison: Are New Security Frameworks Improving Cloud Security?",
                    "End-to-End Policy Monitoring and Enforcement for Service-Oriented Architecture.",
                    "Privacy-Preserving Data Deduplication on Trusted Processors.",
                    "Cost-Effective Big Data Mining in the Cloud: A Case Study with K-means.",
                    "Benchmarking Harp-DAAL: High Performance Hadoop on KNL Clusters.",
                    "Hierarchical Spark: A Multi-Cluster Big Data Computing Framework.",
                    "DeepSpotCloud: Leveraging Cross-Region GPU Spot Instances for Deep Learning.",
                    "Leveraging Column Family to Improve Multidimensional Query Performance in HBase.",
                    "Cloudroid: A Cloud Framework for Transparent and QoS-Aware Robotic Computation Outsourcing.",
                    "Cloud-Based Positioning Method with Visualized Signal Images.",
                    "Enabling Software Defined Networking with QoS Guarantee for Cloud Applications.",
                    "Using Integer Programming for Workflow Scheduling in the Cloud.",
                    "Augmenting Amdahl's Second Law: A Theoretical Model to Build Cost-Effective Balanced HPC Infrastructure for Data-Driven Science.",
                    "Exploiting Synchrony in Replicated State Machines.",
                    "Efficient Hierarchical Traffic Measurement in Software-Defined Datacenter Networks.",
                    "WASP: Workload Adaptive Energy-Latency Optimization in Server Farms Using Server Low-Power States.",
                    "QPRED: Using Quantile Predictions to Improve Power Usage for Private Clouds.",
                    "Monitoring Performance in Large Scale Computing Clouds with Passive Benchmarking.",
                    "Taming Performance Degradation of Containers in the Case of Extreme Memory Overcommitment.",
                    "Online Learning-Assisted VNF Service Chain Scaling with Network Uncertainties.",
                    "Coalescing HDFS Blocks to Avoid Recurring YARN Container Overhead.",
                    "Minimal Coflow Routing and Scheduling in OpenFlow-Based Cloud Storage Area Networks.",
                    "DriftInsight: Detecting Anomalous Behaviors in Large-Scale Cloud Platform.",
                    "Cost-Aware Resource Management for Federated Clouds Using Resource Sharing Contracts.",
                    "Joint Computation Partitioning and Resource Allocation for Latency Sensitive Applications in Mobile Edge Clouds.",
                    "A Formal Framework of Resource Management for VNFaaS in Cloud.",
                    "Electron: Towards Efficient Resource Management on Heterogeneous Clusters with Apache Mesos.",
                    "Multi-Objective Virtual Machine Consolidation.",
                    "How to Supercharge the Amazon T2: Observations and Suggestions.",
                    "Cloud Security via Virtualized Out-of-Band Execution and Obfuscation.",
                    "A Security Benchmark for OpenStack.",
                    "Man in the Cloud (MITC) Defender: SGX-Based User Credential Protection for Synchronization Applications in Cloud Computing Platform.",
                    "A Comparison of System Performance on a Private OpenStack Cloud and Amazon EC2.",
                    "Intra-Cloud and Inter-Cloud Authentication.",
                    "Privacy-Preserving Multi-Party Clustering: An Empirical Study.",
                    "P-McDb: Privacy-Preserving Search Using Multi-Cloud Encrypted Databases.",
                    "Privacy-Preserving Multi-Party Analytics over Arbitrarily Partitioned Data.",
                    "Single-View Performance Monitoring of On-Line Applications Running on a Cloud.",
                    "FIM: Performance Prediction for Parallel Computation in Iterative Data Processing Applications.",
                    "An Experimental Study of the Impact of vCPU Provisioning on the Performance of a 2-Tier Application Running in Cloud.",
                    "Scalable Performance Tuning of Hadoop MapReduce: A Noisy Gradient Approach.",
                    "Generating Test Sequences to Assess the Performance of Elastic Cloud-Based Systems.",
                    "Scalable and Reliable Key Management for Secure Deduplication in Cloud Storage.",
                    "Context-Aware Data Loss Prevention for Cloud Storage Services.",
                    "Efficient Software Defined Systems Using Common Core Components.",
                    "A Self-Learning Scheduling in Cloud Software Defined Block Storage.",
                    "SFC Provisioning over NFV Enabled Clouds.",
                    "A Transactional Model for Parallel Programming of Graph Applications on Computing Clusters.",
                    "GraphSteal: Dynamic Re-Partitioning for Efficient Graph Processing in Heterogeneous Clusters.",
                    "LogSed: Anomaly Diagnosis through Mining Time-Weighted Control Flow Graph in Logs.",
                    "A Stochastic Optimization Approach for Cloud Elasticity.",
                    "Data-Aware Modeling of Elastic Processes for Elasticity Strategies Evaluation.",
                    "Autonomic Vertical Elasticity of Docker Containers with ELASTICDOCKER.",
                    "A Minimum-Cost Flow Model for Workload Optimization on Cloud Infrastructure.",
                    "PYTHIA: Admission Control for Multi-Framework, Deadline- Driven, Big Data Workloads.",
                    "CloudMix: Generating Diverse and Reducible Workloads for Cloud Systems.",
                    "A Robust Scheduler for Workflow Ensembles under Uncertainties of Available Bandwidth.",
                    "EAERS: An Enhanced Version of Autonomic and Elastic Resource Scheduling Framework for Cloud Applications.",
                    "Truthful Mechanism for Crowdsourcing Task Assignment.",
                    "On the Relatively Small Impact of Deep Dependencies on Cloud Application Reliability.",
                    "Harvesting Underutilized Resources to Improve Responsiveness and Tolerance to Crash and Silent Faults for Data-Intensive Applications.",
                    "FailureSim: A System for Predicting Hardware Failures in Cloud Data Centers Using Neural Networks.",
                    "Protection by Detection: A Signaling Game Approach to Mitigate Co-Resident Attacks in Cloud.",
                    "Data Protection in OpenStack.",
                    "An End-to-End Dynamic Trust Framework for Service-Oriented Architecture.",
                    "Service Selection in a Cloud Marketplace: A Multi-Perspective Solution.",
                    "Using Financial Options for Pricing of IaaS Cloud Resources.",
                    "Smart Contract Negotiation in Cloud Computing.",
                    "A Monitoring Approach for Policy Enforcement in Cloud Services.",
                    "Efficient Distributed Smith-Waterman Algorithm Based on Apache Spark.",
                    "Two-Stage Data Distribution for Distributed Surveillance Video Processing with Hybrid Storage Architecture.",
                    "Platform Support for Mobile Edge Computing.",
                    "Evaluating Adaptation Methods for Cloud Applications: An Empirical Study.",
                    "OneService - Generic Cache Aggregator Framework for Service Dependent Cloud Applications.",
                    "Typhon: Consistency Semantics for Multi-Representation Data Processing.",
                    "Mantus: Putting Aspects to Work for Flexible Multi-Cloud Deployment.",
                    "Data Governance and Semantic Recommendation Algorithms for Cloud Platform Selection.",
                    "Clustering-Based IaaS Cloud Monitoring.",
                    "Provenance in Context of Hadoop as a Service (HaaS) - State of the Art and Research Directions.",
                    "A Question and Answering System for Management of Cloud Service Level Agreements.",
                    "A Distributed Infrastructure for Democratic Cloud Federations.",
                    "COMS: Customer Oriented Migration Service.",
                    "Compliance-Aware Provisioning of Containers on Cloud.",
                    "Resource Allocation in the Cloud: From Simulation to Experimental Validation.",
                    "Does CloudSim Accurately Model Micro Datacenters?",
                    "Towards Formal-Based Semantic Interoperability in Multi-Clouds: The FCLOUDS Framework.",
                    "A \"No Data Center\" Solution to Cloud Computing.",
                    "Transparent Clouds: An Enhancement to Abstraction.",
                    "An MTD-Based Self-Adaptive Resilience Approach for Cloud Systems.",
                    "Reinsurance-Emulated Collaboration Mechanism in Cloud Federation.",
                    "High Efficiency Cloud Data Center Management System Using Live Migration.",
                    "Optimal Rule Mining for Dynamic Authorization Management in Collaborating Clouds Using Attribute-Based Access Control.",
                    "Detecting Virtualization Specific Vulnerabilities in Cloud Computing Environment.",
                    "An SDN Based Framework for Guaranteeing Security and Performance in Information-Centric Cloud Networks.",
                    "Malware Secrets: De-Obfuscating in the Cloud.",
                    "Privacy-Preserving Access Control in Cloud Federations.",
                    "Risk-Based Packet Routing for Privacy and Compliance-Preserving SDN.",
                    "A Privacy-Preserving kNN Classification Algorithm Using Yao's Garbled Circuit on Cloud Computing.",
                    "Privacy-Preserving Data Dissemination in Untrusted Cloud.",
                    "Cloud Bursting Scheduler for Cost Efficiency.",
                    "Effect of Human Learning on Performance of Cloud Applications.",
                    "Virtual Machine Scaling Method Considering Performance Fluctuation of Public Cloud.",
                    "Performance Analysis and Improvement of Replica Selection Algorithms for Key-Value Stores.",
                    "An Analysis of Open Ports and Port Pairs in EC2 Instances.",
                    "Breaking Down Hadoop Distributed File Systems Data Analytics Tools: Apache Hive vs. Apache Pig vs. Pivotal HWAQ.",
                    "Real-Time Virtual Network Function (VNF) Migration toward Low Network Latency in Cloud Environments.",
                    "Understanding the Influence of Configuration Settings: An Execution Model-Driven Framework for Apache Spark Platform.",
                    "Conceptualizing a Computing Platform for Science Beyond 2020: To Cloudify HPC, or HPCify Clouds?"
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "9th IEEE CLOUD 2016",
        "info": "San Francisco, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/IEEEcloud/2016",
                "sub_name": "9th IEEE International Conference on Cloud Computing, CLOUD 2016, San Francisco, CA, USA, June 27 - July 2, 2016.",
                "count": 141,
                "papers": [
                    "Empirical Evaluation of Workload Forecasting Techniques for Predictive Cloud Resource Scaling.",
                    "Workload and Resource Aware Proactive Auto-scaler for PaaS Cloud.",
                    "RC3E: Reconfigurable Accelerators in Data Centres and Their Provision by Adapted Service Models.",
                    "TAaaS: Trustworthy Authentication as a Service Based on Trusted Path.",
                    "Thwarting Market Specific Attacks in Cloud.",
                    "Secure Offloading of Legacy IDSes Using Remote VM Introspection in Semi-trusted Clouds.",
                    "OpenStack Security Modules: A Least-Invasive Access Control Framework for the Cloud.",
                    "End-to-End Security Formalization and Alignment for Federated Workflow Management.",
                    "An Integrated Privacy Preserving Attribute Based Access Control Framework.",
                    "Efficient Peak Shaving in a Data Center by Joint Optimization of Task Assignment and Energy Storage Management.",
                    "Energy Optimal VM Placement in the Cloud.",
                    "Hadoop in Flight: Migrating Live MapReduce Jobs for Power-Shifting Data Centers.",
                    "Elastic Stream Processing for the Internet of Things.",
                    "Enabling Elastic Stream Processing in Shared Clusters.",
                    "Utilizing Massive Viewers for Video Transcoding in Crowdsourced Live Streaming.",
                    "Fine-Grained Resource Scaling in a Public Cloud: A Tenant's Perspective.",
                    "Efficient Real-Time Auditing and Proof of Violation for Cloud Storage Systems.",
                    "Online VNF Scaling in Datacenters.",
                    "D3W: Towards Self-Management of Distributed Data-Driven Workflows with QoS Guarantees.",
                    "Optimized Durable Commitlog for Apache Cassandra Using CAPI-Flash.",
                    "Towards Cloudware Paradigm for Cloud Computing.",
                    "Litigo: A Cost-Driven Model for Opaque Cloud Services.",
                    "Vertigo: Programmable Micro-controllers for Software-Defined Object Storage.",
                    "Stage Aware Performance Modeling of DAG Based in Memory Analytic Platforms.",
                    "Experimental Performance Evaluation of Cloud-Based Analytics-as-a-Service.",
                    "Towards Performance Modeling as a Service by Exploiting Resource Diversity in the Public Cloud.",
                    "Towards Deadline Guaranteed Cloud Storage Services.",
                    "SCoPe: A Decision System for Large Scale Container Provisioning Management.",
                    "QoS Assurance through Low Level Analysis of Resource Utilization of the Cloud Applications.",
                    "A Testbed for Collecting QoS Data of Cloud-Based Analytic Services.",
                    "KCGS-Store: A Columnar Storage Based on Group Sorting of Key Columns.",
                    "Location-Aware Data Block Allocation Strategy for HDFS-Based Applications in the Cloud.",
                    "Scalable Transaction Management for Partially Replicated Data in Cloud Computing Environments.",
                    "MIST: Mitigating Host-Side Interference for Storage Traffic in Virtualized Data Centers.",
                    "Performance Interference of Memory Thrashing in Virtualized Cloud Environments: A Study of Consolidated n-Tier Applications.",
                    "Amazon Elastic Compute Cloud (EC2) vs. In-House HPC Platform: A Cost Analysis.",
                    "An Approach to Pinpointing Bug-Induced Failure in Logs of Open Cloud Platforms.",
                    "Detecting Incipient Faults in Software Systems: A Compressed Sampling-Based Approach.",
                    "An Efficient Approach for Multi-tenant Elastic Business Processes Management in Cloud Computing Environment.",
                    "Coarse-Grained Information Flow Control on Hybrid Clouds.",
                    "Automated Setup of Multi-cloud Environments for Microservices Applications.",
                    "Model-Driven Application Refactoring to Minimize Deployment Costs in Preemptible Cloud Resources.",
                    "iGen: A Realistic Request Generator for Cloud File Systems Benchmarking.",
                    "Migrating GIS Big Data Computing from Hadoop to Spark: An Exemplary Study Using Twitter.",
                    "Security, Compliance, and Agile Deployment of Personal Identifiable Information Solutions on a Public Cloud.",
                    "Towards Application-centric Fairness in Multi-tenant Clouds with Adaptive CPU Sharing Model.",
                    "VNF Placement and Chaining in Distributed Cloud.",
                    "A Utility-Aware Approach to Redundant Data Upload in Cooperative Mobile Cloud.",
                    "Understanding Data Sharing in Private Personal Clouds.",
                    "Cloud Event Programming Paradigms: Applications and Analysis.",
                    "An Approach for Evaluating Cloud Application Topologies Based on TOSCA.",
                    "rSLA: A Service Level Agreement Language for Cloud Services.",
                    "Modeling Interference for Apache Spark Jobs.",
                    "Disaster Recovery for Cloud-Hosted Enterprise Applications.",
                    "A Test Design Method for Resilient System on Cloud Infrastructure.",
                    "PaceMaker: When ZooKeeper Arteries Get Clogged in Storm Clusters.",
                    "Performance Measurement on Scale-Up and Scale-Out Hadoop with Remote and Local File Systems.",
                    "An Economic Model for Scaling Cloud Applications.",
                    "CSMiner: An Automated Tool for Analyzing Changes in Configuration Settings across Multiple Versions of Large Scale Cloud Software.",
                    "Streamlining Management of Multiple Cloud Services.",
                    "Towards Cloud-Aware Policy Enforcement with Universal Cloud Classification as a Service (UCCaaS) in Software Defined Networks.",
                    "Rolling Upgrade with Dynamic Batch Size for IaaS Cloud.",
                    "Breaking Down the Monarchy: Achieving Trustworthy and Open Cloud Ecosystem Governance with Separation-of-Powers.",
                    "PiBooster: Performance Accelerations in Page Table Management for Paravirtual VMs.",
                    "Acacia-RDF: An X10-Based Scalable Distributed RDF Graph Database Engine.",
                    "Comparisons of Heat Map and IFL Technique to Evaluate the Performance of Commercially Available Cloud Providers.",
                    "Exploring the Design Space for Optimizations with Apache Aurora and Mesos.",
                    "Auto-tuning Performance of MPI Parallel Programs Using Resource Management in Container-Based Virtual Cloud.",
                    "Self-Adaptive Resource Management System in IaaS Clouds.",
                    "Resource Management for Elastic Publish Subscribe Systems: A Performance Modeling-Based Approach.",
                    "Short Run: Heuristic Approaches for Cloud Resource Selection.",
                    "Uncertainty-Aware Real-Time Workflow Scheduling in the Cloud.",
                    "A Semantic Framework Supporting Cloud Resource Descriptions Interoperability.",
                    "Practical Privacy-Preserving Medical Diagnosis Using Homomorphic Encryption.",
                    "Tenants Attested Trusted Cloud Service.",
                    "Consumer Oriented Privacy Preserving Access Control for Electronic Health Records in the Cloud.",
                    "Anomaly Detection in the Cloud Using Data Density.",
                    "Reputation Audit in Multi-cloud Storage through Integrity Verification and Data Dynamics.",
                    "A Streaming Intrusion Monitoring and Classification System for IaaS Cloud.",
                    "A Profit Optimization Framework of Energy Storage Devices in Data Centers: Hierarchical Structure and Hybrid Types.",
                    "Accuracy of Energy Model Calibration with IPMI.",
                    "Application of Convolutional Neural Network to Prediction of Temperature Distribution in Data Centers.",
                    "LAST-HDFS: Location-Aware Storage Technique for Hadoop Distributed File System.",
                    "Uploading and Replicating Internet of Things (IoT) Data on Distributed Cloud Storage.",
                    "Improving Cloud-Based Online Social Network Data Placement and Replication.",
                    "CRED: Cloud Right-Sizing to Meet Execution Deadlines and Data Locality.",
                    "Eliminating OS-Caused Large JVM Pauses for Latency-Sensitive Java-Based Cloud Platforms.",
                    "Inter-player Delay Optimization in Multiplayer Cloud Gaming.",
                    "A Novel Multi-objective Optimization Scheme for Rebalancing Virtual Machine Placement.",
                    "Model-Driven Management of Docker Containers.",
                    "Tree Packing for Elastic Machine Allocation in RaaS Cloud.",
                    "A Novel Scheduling Mechanism For Hybrid Cloud Systems.",
                    "Optimizing Schedule for Parallel Software Deployments Based on Profiles of Network Activity and Installation Time in Cloud Environments.",
                    "SLA-Driven VM Scheduling in Mobile Edge Computing.",
                    "Container Based Video Surveillance Cloud Service with Fine-Grained Resource Provisioning.",
                    "MIaaS: Medical Image Archival and Analytics as-a-Service.",
                    "Reproducible Scientific Computing Environment with Overlay Cloud Architecture.",
                    "SDN-Based Framework for Infrastructure as a Service Clouds.",
                    "Optimizing Backup Resources in the Cloud.",
                    "Traffic-Aware Virtual Machine Migration Scheduling Problem in Geographically Distributed Data Centers.",
                    "Fast Resource Co-provisioning for Time Critical Applications Based on Networked Infrastructures.",
                    "Jugo: A Generic Architecture for Composite Cloud as a Service.",
                    "Gnafuy: A Framework for Ubiquitous Mobile Computation.",
                    "A Self-Evolving Method of Data Model for Cloud-Based Machine Data Ingestion.",
                    "A Black-Box Self-Learning Scheduler for Cloud Block Storage Systems.",
                    "Distributed Shared Memory Based Live VM Migration.",
                    "Automated Demand-Based Vertical Elasticity for Heterogeneous Real-Time Workloads.",
                    "Storage Benchmarking for Workload Aware Storage Platform.",
                    "Multi-code Distributed Storage.",
                    "Test-Based Cloud Service Certification of Opportunistic Providers.",
                    "Demonstrating Scalability and Efficiency of Pack-centric Resource Management for Cloud.",
                    "Managing QoS Constraints in a P2P-Cloud Video on Demand System.",
                    "Try Managing Your Deduplication Fine-Grained-ly: A Multi-tiered and Dynamic SLA-Driven Deduplication Framework for Primary Storage.",
                    "Systemic Risks in the Cloud Computing Model: Complex Systems Perspective.",
                    "On-Demand Bandwidth Pricing for Congestion Control in Core Switches in Cloud Networks.",
                    "Dynamic Modelling of Tactics Impact on the Stability of Self-Aware Cloud Architectures.",
                    "Integrating Clustering and Learning for Improved Workload Prediction in the Cloud.",
                    "A Reliable Cloud-Based Feedback Control System.",
                    "Toward Real-Time and Fine-Grained Monitoring of Software-Defined Networking in the Cloud.",
                    "P-Cop: A Cloud Administration Proxy to Enforce Bipartite Maintenance of PaaS Services.",
                    "Improved Lightweight Proxy Re-encryption for Flexible and Scalable Mobile Revocation Management in Cloud Computing.",
                    "SECAP: Towards Securing Application Provenance in the Cloud.",
                    "The End of Effective Law Enforcement in the Cloud? - To Encrypt, or Not to Encrypt.",
                    "COR-Honeypot: Copy-On-Risk, Virtual Machine as Honeypot in the Cloud.",
                    "Performance, Resource, and Cost Aware Resource Provisioning in the Cloud.",
                    "TaskInsight: A Fine-Grained Performance Anomaly Detection and Problem Locating System.",
                    "On Service Level Agreement Assurance in Cloud Computing Data Centers.",
                    "Dynamic Deployment and Auto-scaling Enterprise Applications on the Heterogeneous Cloud.",
                    "Improving Coding Performance and Energy Efficiency of Erasure Coding Process for Storage Systems - A Parallel and Scalable Approach.",
                    "TrustyDrive, a Multi-cloud Storage Service That Protects Your Privacy.",
                    "Protect Both Integrity and Confidentiality in Outsourcing Collaborative Filtering Computations.",
                    "Resource Allocation Algorithms for Multicast Streaming in Elastic Cloud-Based Media Collaboration Services.",
                    "Bidimensional Cross-Cloud Management with TOSCA and Brooklyn.",
                    "Performance Analysis of a Multi-tenant In-Memory Data Grid.",
                    "A Dynamic Programming Offloading Algorithm Using Biased Randomization.",
                    "An SLA and Operation Cost Aware Performance Re-tuning Algorithm for Cloud Databases.",
                    "Efficient Processing of Encrypted Data in Honest-but-Curious Clouds.",
                    "CloudMeasure: A Platform for Performance Analysis of Cloud Computing Systems.",
                    "MemNet: Enhancing Throughput and Energy Efficiency for Hybrid Workloads via Para-virtualized Memory Sharing.",
                    "SMPA: An Energy-Aware Service Migration Strategy in Cloud Networks.",
                    "Managing Cloud Storage Obliviously."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "8th IEEE CLOUD 2015",
        "info": "New York City, NY, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/IEEEcloud/2015",
                "sub_name": "8th IEEE International Conference on Cloud Computing, CLOUD 2015, New York City, NY, USA, June 27 - July 2, 2015.",
                "count": 159,
                "papers": [
                    "A Cost-Effective Method to Keep Availability of Many Cloud-Connected Devices.",
                    "Femto Clouds: Leveraging Mobile Devices to Provide Cloud Service at the Edge.",
                    "Cost-Efficient Scheduling of Elastic Processes in Hybrid Clouds.",
                    "Towards Automatic Application Migration to Clouds.",
                    "A Pattern-Based Code Transformation Approach for Cloud Application Migration.",
                    "Application Migration Effort in the Cloud - The Case of Cloud Platforms.",
                    "On Exploiting Page Sharing in a Virtualised Environment - An Empirical Study of Virtualization Versus Lightweight Containers.",
                    "Leveraging Metadata in No SQL Storage Systems.",
                    "Server Provisioning in Content Delivery Clouds.",
                    "Data Vaporizer - Towards a Configurable Enterprise Data Storage Framework in Public Cloud.",
                    "From Relations to Multi-dimensional Maps: Towards an SQL-to-HBase Transformation Methodology.",
                    "Dart: A Geographic Information System on Hadoop.",
                    "Performance Metrics for Data Center Communication Systems.",
                    "Network-centric Performance Improvement for Live VM Migration.",
                    "Instrumentation and Trace Analysis for Ad-Hoc Python Workflows in Cloud Environments.",
                    "Hiding Media Data via Shaders: Enabling Private Sharing in the Clouds.",
                    "Privacy-Preserving Data Publishing in the Cloud: A Multi-level Utility Controlled Approach.",
                    "A Trust and Reputation System for Energy Optimization in Cloud Data Centers.",
                    "Cost-Minimizing Online VM Purchasing for Application Service Providers with Arbitrary Demands.",
                    "A Cloud Controller for Performance-Based Pricing.",
                    "A Joint Optimization Framework for Request Scheduling and Energy Storage Management in a Data Center.",
                    "Hierarchical Virtual Machine Placement in Modular Data Centers.",
                    "RT-Open Stack: CPU Resource Management for Real-Time Cloud Computing.",
                    "Memory Reclamation and Compression Using Accurate Working Set Size Estimation.",
                    "VMcSim: A Detailed Manycore Simulator for Virtualized Systems.",
                    "aDock: A Cloud Infrastructure Experimentation Environment Based on Open Stack and Docker.",
                    "PICS: A Public IaaS Cloud Simulator.",
                    "QoS Prediction for the Cloud Service Marketplace: A Grassmann Manifold Approach.",
                    "End-to-End QoS Prediction of Vertical Service Composition in the Cloud.",
                    "QoS-Aware Service Selection for Customisable Multi-tenant Service-Based Systems: Maturity and Approaches.",
                    "Policy-Driven Configuration Management for NoSQL.",
                    "Cloud Armor: Protecting Cloud Commands from Compromised Cloud Services.",
                    "Shared Memory Optimization in Virtualized Cloud.",
                    "Dynamic Memory and Core Scaling in Virtual Machines.",
                    "Proactive Memory Scaling of Virtualized Applications.",
                    "Cost-Aware Cloud Metering with Scalable Service Management Infrastructure.",
                    "Forget the Deadline: Scheduling Interactive Applications in Data Centers.",
                    "A Self-Cloning Agents Based Model for High-Performance Mobile-Cloud Computing.",
                    "Dynamically Controlling Node-Level Parallelism in Hadoop.",
                    "Less Can Be More: Micro-managing VMs in Amazon EC2.",
                    "Airfoil: A Topology Aware Distributed Load Balancing Service.",
                    "Remote Restart for a High Performance Virtual Machine Recovery in a Cloud.",
                    "MSSF: User-Friendly Multi-cloud Data Dispersal.",
                    "Dynamic Tailoring and Cloud-Based Deployment of Containerized Service Middleware.",
                    "Why Reading Patterns Matter in Storage Coding & Scheduling Design.",
                    "Roboconf: A Hybrid Cloud Orchestrator to Deploy Complex Applications.",
                    "A Hybrid Cloud Framework for Scientific Computing.",
                    "Utilization Prediction Aware VM Consolidation Approach for Green Cloud Computing.",
                    "UniCrawl: A Practical Geographically Distributed Web Crawler.",
                    "Service Mobility in Mobile Networks.",
                    "Learning from Metadata: A Fuzzy Token Matching Based Configuration File Discovery Approach.",
                    "Geographical Job Scheduling in Data Centers with Heterogeneous Demands and Servers.",
                    "Dyn Tail - Dynamically Tailored Deployment Engines for Cloud Applications.",
                    "Dynamic Fine-Grained Resource Provisioning for Heterogeneous Applications in Virtualized Cloud Data Center.",
                    "OCF: An Open Cloud Forensics Model for Reliable Digital Forensics.",
                    "A Simulated Annealing Based Approach for Power Efficient Virtual Machines Consolidation.",
                    "vHaul: Towards Optimal Scheduling of Live Multi-VM Migration for Multi-tier Applications.",
                    "Evaluation of MapReduce in a Large Cluster.",
                    "A Provisioning Approach of Cloud Resources for Dynamic Workflows.",
                    "CHASE: Component High Availability-Aware Scheduler in Cloud Computing Environment.",
                    "On Datacenter-Network-Aware Load Balancing in MapReduce.",
                    "An Innovative Energy-Aware Cloud Task Scheduling Framework.",
                    "A Semi-distributed Access Control Management Scheme for Securing Cloud Environment.",
                    "An Efficient Conjunctive Keyword and Phase Search Scheme for Encrypted Cloud Storage Systems.",
                    "User-Friendly and Secure Architecture (UFSA) for Authentication of Cloud Services.",
                    "Managing Big Data with Information Flow Control.",
                    "Cloud Docs: Secure Scalable Document Sharing on Public Clouds.",
                    "Utilizing Homomorphic Encryption to Implement Secure and Private Medical Cloud Computing.",
                    "Another Look at Secure Big Data Processing: Formal Framework and a Potential Approach.",
                    "Security-Aware Virtual Machine Allocation in the Cloud: A Game Theoretic Approach.",
                    "Toward Security and Performance Certification of Open Stack.",
                    "Multistage OCDO: Scalable Security Provisioning Optimization in SDN-Based Cloud.",
                    "Keyword Search over Shared Cloud Data without Secure Channel or Authority.",
                    "Microarchitecture-Aware Virtual Machine Placement under Information Leakage Constraints.",
                    "Data-Intensive HPC Tasks Scheduling with SDN to Enable HPC-as-a-Service.",
                    "Cost Effective, Reliable, and Secure Workflow Deployment over Federated Clouds.",
                    "Performance Analysis of Encryption in Securing the Live Migration of Virtual Machines.",
                    "Everything as a Service (XaaS) on the Cloud: Origins, Current and Future Trends.",
                    "Mycocloud: Elasticity through Self-Organized Service Placement in Decentralized Clouds.",
                    "Performance Metrics of Virtual Machine Live Migration.",
                    "A REST Service Framework for Fine-Grained Resource Management in Container-Based Cloud.",
                    "A Constrained Genetic Algorithm for Rebalancing of Services in Cloud Data Centers.",
                    "Cloud Brokering Architecture for Dynamic Placement of Virtual Machines.",
                    "Toward Optimal Resource Provisioning for Cloud MapReduce and Hybrid Cloud Applications.",
                    "PBAD: Perception-Based Anomaly Detection System for Cloud Datacenters.",
                    "Multi-cloud Application Design through Cloud Service Composition.",
                    "VDEP: VM Dependency Discovery in Multi-tier Cloud Applications.",
                    "Cloud Query Manager: Using Semantic Web Concepts to Avoid IaaS Cloud Lock-In.",
                    "Improving Serviceability for Virtual Clusters in Bandwidth-Constrained Datacenters.",
                    "Sharing-Aware Online Algorithms for Virtual Machine Packing in Cloud Environments.",
                    "Automating Resource Selection and Configuration in Inter-clouds through a Software Product Line Method.",
                    "A XaaS Savvy Automated Approach to Composite Applications.",
                    "HEROS: Energy-Efficient Load Balancing for Heterogeneous Data Centers.",
                    "Virtual Machine Consolidation with Usage Prediction for Energy-Efficient Cloud Data Centers.",
                    "Cool Cloud: A Practical Dynamic Virtual Machine Placement Framework for Energy Aware Data Centers.",
                    "Improving the Performance of Biological Data Analysis in Cloud Computing Platforms.",
                    "Scalable Euclidean Embedding for Big Data.",
                    "The Impact of Vectorization on Erasure Code Computing in Cloud Storages - A Performance and Power Consumption Study.",
                    "HVPI: Extending Hadoop to Support Video Analytic Applications.",
                    "Analytical Modeling of Reactive Autonomic Management Techniques in IaaS Clouds.",
                    "Hierarchical Deployment and Control of Energy Storage Devices in Data Centers.",
                    "Performance Inference: A Novel Approach for Planning the Capacity of IaaS Cloud Applications.",
                    "EHadoop: Network I/O Aware Scheduler for Elastic MapReduce Cluster.",
                    "Multicast Tree Repair and Maintenance in the Cloud.",
                    "SLA-Aware Dynamic CPU Scaling in Business Cloud Computing Environments.",
                    "Quality-Driven Architectural Patterns for Self-Aware Cloud-Based Software.",
                    "A Precise Metamodel for Open Cloud Computing Interface.",
                    "SLO-Aware Deployment of Web Applications Requiring Strong Consistency Using Multiple Clouds.",
                    "A Context Sensitive Offloading Scheme for Mobile Cloud Computing Service.",
                    "SNACS: Social Network-Aware Cloud Assistance for Online Propagated Video Sharing.",
                    "Simulation Runner: A Cloud-Based Parallel and Distributed HPC Platform.",
                    "Iterative Hadoop MapReduce-Based Subgraph Enumeration in Network Motif Analysis.",
                    "A MapReduce Algorithm for Polygon Retrieval in Geospatial Analysis.",
                    "Cloud-Based Control: A Multi-tenant, Horizontally Scalable Soft-PLC.",
                    "QoE Driven Server Selection for VoD in the Cloud.",
                    "Dynalize: Dynamic Analysis of Mobile Apps in a Platform-as-a-Service Cloud.",
                    "Cloud Standby Deployment: A Model-Driven Deployment Method for Disaster Recovery in the Cloud.",
                    "Performance Measurement and Interference Profiling in Multi-tenant Clouds.",
                    "A Hardware/Software Approach for Mitigating Performance Interference Effects in Virtualized Environments Using SR-IOV.",
                    "A Novel Parallel Computation Model with Efficient Local Memory Management for Data-Intensive Applications.",
                    "A Competitive Penalty Model for Availability Based Cloud SLA.",
                    "Cost-Aware Elastic Cloud Provisioning for Scientific Workloads.",
                    "Budget Constrained Execution of Multiple Bag-of-Tasks Applications on the Cloud.",
                    "EPCloud Flow: Load Prediction and Migration Optimizations for EPC Network on Cloud.",
                    "Optimizing Cloud Data Center Energy Efficiency via Dynamic Prediction of CPU Idle Intervals.",
                    "Evaluation of a Tenant Level Checkpointing Technique for SaaS Applications.",
                    "Cloud Analytics for Wireless Metric Prediction - Framework and Performance.",
                    "Evaluation of Influencing Factors in an Impact Analysis Methodology for the Adoption of Cloud-Based Services.",
                    "Cloud Application HA Using SDN to Ensure QoS.",
                    "Scalable Network Traffic Classification Using Distributed Support Vector Machines.",
                    "Towards Migratable Elastic Virtual Clusters on Hybrid Clouds.",
                    "Experimental Proof: Data Remanence in Cloud VMs.",
                    "Networking Architecture for Seamless Cloud Interoperability.",
                    "Toward Automatically Deducing Key Device States for the Live Migration of Virtual Machines.",
                    "Cloud Services Brokerage: A Survey and Research Roadmap.",
                    "Subgraph Matching for Resource Allocation in the Federated Cloud Environment.",
                    "Towards Automated Workflow Deployment in the Cloud Using TOSCA.",
                    "EdgeX: Edge Replication for Web Applications.",
                    "K-Feed - A Data-Oriented Approach to Application Performance Management in Cloud.",
                    "ssCloud: A Smart Storage for Distributed DaaS on the Cloud.",
                    "Runtime Composition for Extensible Big Data Processing Platforms.",
                    "MILP-Based Approach for Efficient Cloud IaaS Resource Allocation.",
                    "Ad Hoc Cloud Computing.",
                    "A Knowledge Base Driven Solution for Smart Cloud Management.",
                    "Designing a Distributed Design Exploration Framework in the Inter-cloud Environment.",
                    "DLG-Hypertree: A Low-Diameter, Server-centric Datacenter Network Architecture.",
                    "A Semantic Approach to Cloud Security and Compliance.",
                    "Encrypted SVM for Outsourced Data Mining.",
                    "Opportunities in Using a Secure Element to Increase Confidence in Cloud Security Monitoring.",
                    "Privacy Preserving Data Integration across Autonomous Cloud Services.",
                    "PLAG: Practical Landmark Allocation for Cloud Geolocation.",
                    "A Cloud-Based Platform for Supporting Research Collaboration.",
                    "Towards Mobile Opportunistic Computing.",
                    "Software Rejuvenation Based Fault Tolerance Scheme for Cloud Applications.",
                    "Protecting Critical Cloud Infrastructures with Predictive Capability.",
                    "Industry Cloud: A Driver for Enterprise Transformation.",
                    "Big SaaS: The Next Step beyond Big Data.",
                    "Clouds for Masses - Toward Ubiquitous and Transparent Clouds.",
                    "Realizing the Potential of IoT Using Software-Defined Ecosystems."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "7th IEEE CLOUD 2014",
        "info": "Anchorage, AK, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/IEEEcloud/2014",
                "sub_name": "2014 IEEE 7th International Conference on Cloud Computing, Anchorage, AK, USA, June 27 - July 2, 2014.",
                "count": 142,
                "papers": [
                    "Cache Policies for Cloud-Based Systems: To Keep or Not to Keep.",
                    "Processing of Mixed-Sensitivity Video Surveillance Streams on Hybrid Clouds.",
                    "Elastic Message Queues.",
                    "IO Performance Interference among Consolidated n-Tier Applications: Sharing Is Better Than Isolation for Disks.",
                    "PriDyn: Framework for Performance Specific QoS in Cloud Storage.",
                    "Fast Live Migration with Small IO Performance Penalty by Exploiting SAN in Parallel.",
                    "PowerCass: Energy Efficient, Consistent Hashing Based Storage for Micro Clouds Based Infrastructure.",
                    "Time-Constrained Live VM Migration in Share-Nothing IaaS-Clouds.",
                    "Improving Users' Isolation in IaaS: Virtual Machine Placement with Security Constraints.",
                    "A Predictive Method for Identifying Optimum Cloud Availability Zones.",
                    "Replica Placement in Cloud through Simple Stochastic Model Predictive Control.",
                    "Optimizing IaaS Reserved Contract Procurement Using Load Prediction.",
                    "Workload Shaping to Mitigate Variability in Renewable Power Use by Data Centers.",
                    "Energy-Aware Dynamic VM Consolidation in Cloud Data Centers Using Ant Colony System.",
                    "Exact and Heuristic Graph-Coloring for Energy Efficient Advance Cloud Resource Reservation.",
                    "SCDA: SLA-Aware Cloud Datacenter Architecture for Efficient Content Storage and Retrieval.",
                    "On the Feasibility of Deploying Software Attestation in Cloud Environments.",
                    "Data Centre Optimisation Enhanced by Software Defined Networking.",
                    "Automated Selection and Configuration of Cloud Environments Using Software Product Lines Principles.",
                    "Core-Selecting Auctions for Dynamically Allocating Heterogeneous VMs in Cloud Computing.",
                    "Lego4TOSCA: Composable Building Blocks for Cloud Applications.",
                    "Data-Driven Workflows in Multi-cloud Marketplaces.",
                    "Taming Computation Skews of Block-Oriented Iterative Scientific Applications in MapReduce Systems.",
                    "HaSTE: Hadoop YARN Scheduling Based on Task-Dependency and Resource-Demand.",
                    "Energy and Performance-Aware Task Scheduling in a Mobile Cloud Computing Environment.",
                    "CellCloud: A Novel Cost Effective Formation of Mobile Cloud Based on Bidding Incentives.",
                    "Cost of Tape versus Disk for Archival Storage.",
                    "UniCache: Hypervisor Managed Data Storage in RAM and Flash.",
                    "Secure Multiparty Data Sharing in the Cloud Using Hardware-Based TPM Devices.",
                    "Enabling Non-repudiable Data Possession Verification in Cloud Storage Systems.",
                    "Optimizing Power and Performance Trade-offs of MapReduce Job Processing with Heterogeneous Multi-core Processors.",
                    "Towards Dynamic Application Distribution Support for Performance Optimization in the Cloud.",
                    "Performance Modeling to Divide Performance Interference of Virtualization and Virtual Machine Combination.",
                    "A More Efficient and Effective Heuristic Algorithm for the MapReduce Placement Problem in Cloud Computing.",
                    "Introducing SSDs to the Hadoop MapReduce Framework.",
                    "PFC: Privacy Preserving FPGA Cloud - A Case Study of MapReduce.",
                    "A Capacity Allocation Approach for Volunteer Cloud Federations Using Poisson-Gamma Gibbs Sampling.",
                    "Federated Private Clouds via Broker's Marketplace: A Stackelberg-Game Perspective.",
                    "QBROKAGE: A Genetic Approach for QoS Cloud Brokering.",
                    "Incentive-Compatible Online Mechanisms for Resource Provisioning and Allocation in Clouds.",
                    "The Impact of Software Resource Allocation on Consolidated n-Tier Applications.",
                    "Evaluating Dynamic Resource Allocation Strategies in Virtualized Data Centers.",
                    "Encrypted Scalar Product Protocol for Outsourced Data Mining.",
                    "On Deletion of Outsourced Data in Cloud Computing.",
                    "Multiple Two-Phase Data Processing with MapReduce.",
                    "RLC - A Reliable Approach to Fast and Efficient Live Migration of Virtual Machines in the Clouds.",
                    "Adaptive Live VM Migration over a WAN: Modeling and Implementation.",
                    "Fast Server Deprovisioning through Scatter-Gather Live Migration of Virtual Machines.",
                    "Impact of Pacemaker Failover Configuration on Mean Time to Recovery for Small Cloud Clusters.",
                    "On the Interplay between Network Traffic and Energy Consumption in Virtualized Environment: An Empirical Study.",
                    "Improving MapReduce Performance in a Heterogeneous Cloud: A Measurement Study.",
                    "Dependency-Aware Data Locality for MapReduce.",
                    "Deadline-Constrained MapReduce Scheduling Based on Graph Modelling.",
                    "Optimal Virtual Machine Placement in Large-Scale Cloud Systems.",
                    "Improving Hadoop Service Provisioning in a Geographically Distributed Cloud.",
                    "Palantir: Reseizing Network Proximity in Large-Scale Distributed Computing Frameworks Using SDN.",
                    "Exploiting User Patience for Scaling Resource Capacity in Cloud Services.",
                    "Performance Variations in Resource Scaling for MapReduce Applications on Private and Public Clouds.",
                    "Lightweight Automatic Resource Scaling for Multi-tier Web Applications.",
                    "A Virtual Machine Placement Algorithm for Balanced Resource Utilization in Cloud Data Centers.",
                    "Multicast Virtual Network Embedding in Cloud Data Centers with Delay Constraints.",
                    "Minimizing WAN Communications in Inter-datacenter Key-Value Stores.",
                    "D-Mash: A Framework for Privacy-Preserving Data-as-a-Service Mashups.",
                    "Privacy-Preserving Decentralized Access Control for Cloud Storage Systems.",
                    "Game Theoretic Modeling of Security and Interdependency in a Public Cloud.",
                    "Workload Prediction of Virtual Machines for Harnessing Data Center Resources.",
                    "'Time' for Cloud? Design and Implementation of a Time-Based Cloud Resource Management System.",
                    "iOverbook: Intelligent Resource-Overbooking to Support Soft Real-Time Applications in the Cloud.",
                    "Performance and Cost Modeling Strategy for Cloud Infrastructure Planning.",
                    "Enabling Performance as a Service for a Cloud Storage System.",
                    "Simulating the Effects of Cloud-Based Oversubscription on Datacenter Revenues and Performance in Single and Multi-class Service Levels.",
                    "Evolving Big Data Stream Classification with MapReduce.",
                    "MapReduce Algorithms for Processing Universal Quantifier Queries.",
                    "Speculative Execution for a Single Job in a MapReduce-Like System.",
                    "Scalability Analysis and Improvement of Hadoop Virtual Cluster with Cost Consideration.",
                    "Scalability and Robustness of Time-Series Databases for Cloud-Native Monitoring of Industrial Processes.",
                    "A Competitive Scalability Approach for Cloud Architectures.",
                    "Ensuring High-Performance of Mission-Critical Java Applications in Multi-tenant Cloud Platforms.",
                    "Bridging the Virtualization Performance Gap for HPC Using SR-IOV for InfiniBand.",
                    "GPU Passthrough Performance: A Comparison of KVM, Xen, VMWare ESXi, and LXC for CUDA and OpenCL Applications.",
                    "User-Controlled Identity Provisioning for Secure Account Sharing.",
                    "Trusting the Cloud: A PROV + RBAC Approach.",
                    "Non-intrusive Critical System Event Recognition and Prediction in Cloud.",
                    "Model of an Encrypted Cloud Relational Database Supporting Complex Predicates in WHERE Clause.",
                    "RESeED: Regular Expression Search over Encrypted Data in the Cloud.",
                    "GISQF: An Efficient Spatial Query Processing System.",
                    "Cost Optimization in Multi-site Multi-cloud Environments with Multiple Pricing Schemes.",
                    "Design Support for Cost-Efficient Application Distribution in the Cloud.",
                    "Adaptive Market Mechanism for Efficient Cloud Services Trading.",
                    "MediaPaaS: A Cloud-Based Media Processing Platform for Elastic Live Broadcasting.",
                    "The Use of Distributed Processing and Cloud Computing in Agricultural Decision-Making Support Systems.",
                    "CURLA: Cloud-Based Spam URL Analyzer for Very Large Datasets.",
                    "Image Transfer and Storage Cost Aware Brokering Strategies for Multiple Clouds.",
                    "A Software Product Line Approach for Configuring Cloud Robotics Applications.",
                    "Industry Cloud - Effective Adoption of Cloud Computing for Industry Solutions.",
                    "FRESH: Fair and Efficient Slot Configuration and Scheduling for Hadoop Clusters.",
                    "PAD: Performance Anomaly Detection in Multi-server Distributed Systems.",
                    "Smart CloudMonitor - Providing Visibility into Performance of Black-Box Clouds.",
                    "Using Elasticity to Improve Inline Data Deduplication Storage Systems.",
                    "Elasticity Management in Private and Hybrid Clouds.",
                    "Crowdsourced Resource-Sizing of Virtual Appliances.",
                    "AppCloak: Rapid Migration of Legacy Applications into Cloud.",
                    "Migrating Agile Development into the Cloud Computing Environment.",
                    "Use of Network Latency Profiling and Redundancy for Cloud Server Selection.",
                    "What Can OpenStack Adopt from a Ganeti-Based Open-Source IaaS?",
                    "Cloudburst - Simulating Workload for IaaS Clouds.",
                    "WinWizard: Expanding Xen with a LibVMI Intrusion Detection Tool.",
                    "An Aspect-Oriented Approach to SLA-Driven Monitoring Multi-tenant Cloud Application.",
                    "Mixed-Tenancy in the Wild - Applicability of Mixed-Tenancy for Real-World Enterprise SaaS-Applications.",
                    "Data Farming on Heterogeneous Clouds.",
                    "Progger: An Efficient, Tamper-Evident Kernel-Space Logger for Cloud Data Provenance Tracking.",
                    "User-Friendly Visualization of Cloud Quality.",
                    "Deploying Medical Sensor Networks in the Cloud - Accountability Obligations from a European Perspective.",
                    "Emulation-as-a-Service - The Past in the Cloud.",
                    "Platform-as-a-Service Architecture for Performance Isolated Multi-tenant Applications.",
                    "Towards an Open Data Set for Trace-Oriented Monitoring.",
                    "On-Demand Data Integration on the Cloud.",
                    "Hierarchical Agent-Based Architecture for Resource Management in Cloud Data Centers.",
                    "Diagnosing Cloud Performance Anomalies Using Large Time Series Dataset Analysis.",
                    "SLA-Guided Data Integration on Cloud Environments.",
                    "Reliability and Utilization Evaluation of a Cloud Computing System Allowing Partial Failures.",
                    "A Cost-Effective and Reliable Cloud Storage.",
                    "Evaluation of Highly Reliable Cloud Computing Systems Using Non-sequential Monte Carlo Simulation.",
                    "A Note on Verifiable Privacy-Preserving Tries.",
                    "A Privacy Maturity Model for Cloud Storage Services.",
                    "Federating Web-Based Applications on a Hierarchical Cloud.",
                    "A Context Based Scheduling Approach for Adaptive Business Process in the Cloud.",
                    "MSSF: A Step towards User-Friendly Multi-cloud Data Dispersal.",
                    "Methodology for Semi-automatic Development of Cloud-Based Business Applications.",
                    "Enhanced Backfill Computing.",
                    "Traceability for Adaptive Information Security in the Cloud.",
                    "A Security PaaS Container with a Customized JVM.",
                    "Keeping Your API Keys in a Safe.",
                    "Towards a Flexible Fine-Grained Access Control System for Modern Cloud Applications.",
                    "A Model Driven Framework for Secure Outsourcing of Computation to the Cloud.",
                    "A Comparative Study on I/O Performance between Compute and Storage Optimized Instances of Amazon EC2.",
                    "Virtual Numbers for Virtual Machines?",
                    "Virtual Machine Placement in Predictable Computing Clouds.",
                    "CryptVMI: Encrypted Virtual Machine Introspection in the Cloud.",
                    "Provisioning Security and Performance Optimization for Dynamic Cloud Environments.",
                    "Inter-cloud Media Storage and Media Cloud Architecture for Inter-cloud Communication.",
                    "C-Cloud: A Cost-Efficient Reliable Cloud of Surplus Computing Resources."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "6th IEEE CLOUD 2013",
        "info": "Santa Clara, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/IEEEcloud/2013",
                "sub_name": "2013 IEEE Sixth International Conference on Cloud Computing, Santa Clara, CA, USA, June 28 - July 3, 2013.",
                "count": 137,
                "papers": [
                    "Using a Tunable Knob for Reducing Makespan of MapReduce Jobs in a Hadoop Cluster.",
                    "Improving Multi-job MapReduce Scheduling in an Opportunistic Environment.",
                    "MC2: Map Concurrency Characterization for MapReduce on the Cloud.",
                    "Impact of Instance Seeking Strategies on Resource Allocation in Cloud Data Centers.",
                    "Redundancy Aware Virtual Disk Mobility for Cloud Computing.",
                    "Improving Availability of Cloud-Based Applications through Deployment Choices.",
                    "Efficient Privacy-Preserving Range Queries over Encrypted Data in Cloud Computing.",
                    "An Application-Level Approach for Privacy-Preserving Virtual Machine Checkpointing.",
                    "Configuration Policy Extraction for Parameter Settings in Cloud Infrastructure Using UML/OCL Verification.",
                    "MuSIC: Mobility-Aware Optimal Service Allocation in Mobile Cloud Computing.",
                    "A Framework for Implementing Mobile Cloud Services in VANETs.",
                    "Improving the Efficiency of Cloud Infrastructures with Elastic Tandem Machines.",
                    "Minimizing the Operational Cost of Data Centers via Geographical Electricity Price Diversity.",
                    "Exploiting Performance and Cost Diversity in the Cloud.",
                    "Optimal Pricing and Service Provisioning Strategies in Cloud Systems: A Stackelberg Game Approach.",
                    "Using Time Discretization to Schedule Scientific Workflows in Multiple Cloud Providers.",
                    "TimeCap: Methodology for Comparing IT Infrastructures Based on Time and Capacity Metrics.",
                    "Join the Best Queue: Reducing Performance Variability in Heterogeneous Systems.",
                    "BigSecret: A Secure Data Management Framework for Key-Value Stores.",
                    "Secure Computation of Top-K Eigenvectors for Shared Matrices in the Cloud.",
                    "A Server-Side Solution to Cache-Based Side-Channel Attacks in the Cloud.",
                    "An Experimental Study of Rapidly Alternating Bottlenecks in n-Tier Applications.",
                    "M-Lock: Accelerating Distributed Transactions on Key-Value Stores through Dynamic Lock Localization.",
                    "A Family of Truthful Greedy Mechanisms for Dynamic Virtual Machine Provisioning and Allocation in Clouds.",
                    "Hierarchical Virtual Machine Consolidation in a Cloud Computing System.",
                    "Residency Aware Inter-VM Communication in Virtualized Cloud: Performance Measurement and Analysis.",
                    "VScaler: Autonomic Virtual Machine Scaling.",
                    "Self-Adaptive Resource Allocation for Elastic Process Execution.",
                    "CAP3: A Cloud Auto-Provisioning Framework for Parallel Processing Using On-Demand and Spot Instances.",
                    "A Generic Framework for Application Configuration Discovery with Pluggable Knowledge.",
                    "Data On-Boarding in Federated Storage Clouds.",
                    "Elephant, Do Not Forget Everything! Efficient Processing of Growing Datasets.",
                    "Multi-query Unification for Generating Efficient Big Data Processing Components from a DFD.",
                    "Dragonfly: Cloud Assisted Peer-to-Peer Architecture for Multipoint Media Streaming Applications.",
                    "CA-DAG: Communication-Aware Directed Acyclic Graphs for Modeling Cloud Computing Applications.",
                    "A Declarative Environment for Automatic Performance Evaluation in IaaS Clouds.",
                    "Cloud Capability Estimation and Recommendation in Black-Box Environments Using Benchmark-Based Approximation.",
                    "Actively Measuring Personal Cloud Storage.",
                    "Scrutinizing the State of Cloud Storage with Cloud-RAID: A Secure and Reliable Storage Above the Clouds.",
                    "Data Replication for Distributed Graph Processing.",
                    "Efficient and Customizable Data Partitioning Framework for Distributed Big RDF Data Processing in the Cloud.",
                    "Toward an Ecosystem for Precision Sharing of Segmented Big Data.",
                    "Workload Classification Model for Specializing Virtual Machine Operating System.",
                    "Geographical Load Balancing for Online Service Applications in Distributed Datacenters.",
                    "Moving Target with Load Balancing in P2P Cloud.",
                    "Secure Enterprise Data Deduplication in the Cloud.",
                    "ID Based Cryptography for Cloud Data Storage.",
                    "Security Threats in Cloud Computing Models: Domains and Proposals.",
                    "A Practical and Secure Multi-keyword Search Method over Encrypted Cloud Data.",
                    "Access Protocols in Data Partitioning Based Cloud Storage.",
                    "Privacy-Preserving Collaborative Filtering on the Cloud and Practical Implementation Experiences.",
                    "Smart CloudBench - Automated Performance Benchmarking of the Cloud.",
                    "Improving Wide-Area Replication Performance through Informed Leader Election and Overlay Construction.",
                    "Elastic Resources Framework in IaaS, Preserving Performance SLAs.",
                    "Design and Implementation of Effective Checkpointing for Multithreaded Applications on Future Clouds.",
                    "Fault Tolerance as a Service.",
                    "Incorporating Uncertainty into In-Cloud Application Deployment Decisions for Availability.",
                    "Capturing Customers' Requirements towards Mixed-Tenancy Deployments of SaaS-Applications.",
                    "TREXCLOUD: Java EE IaaS Cloud Deployment Made Easy.",
                    "Enabling Dynamic Deployment of Cloud Applications Using a Modular and Extensible PaaS Environment.",
                    "Building Communicating Web Applications Leveraging Endpoints and Cloud Resource Service.",
                    "An Evaluation of Cassandra for Hadoop.",
                    "Towards Payment-Bound Analysis in Cloud Systems with Task-Prediction Errors.",
                    "A Lightweight Model for Estimating Energy Cost of Live Migration of Virtual Machines.",
                    "Cost and Utilization Optimization of Amazon EC2 Instances.",
                    "Optimization of Electricity and Server Maintenance Costs in Hybrid Cooling Data Centers.",
                    "Labor Cost Reduction with Cloud: An End-to-End View.",
                    "Tape Cloud: Scalable and Cost Efficient Big Data Infrastructure for Cloud Computing.",
                    "Addressing Data and User Mobility Challenges in the Cloud.",
                    "Implementing Scalable, Network-Aware Virtual Machine Migration for Cloud Data Centers.",
                    "Supporting the Migration of Applications to the Cloud through a Decision Support System.",
                    "Assisting Cloud Service Migration Using Software Adaptation Techniques.",
                    "Path Consolidation for Dynamic Right-Sizing of Data Center Networks.",
                    "DR2: Dynamic Request Routing for Tolerating Latency Variability in Online Cloud Applications.",
                    "Towards Network Virtualization Management for Federated Cloud Systems.",
                    "Evaluation Criteria for Cloud Services.",
                    "Cloud Maturity Model.",
                    "Deriving a Distributed Cloud Proxy Architecture for Managed Cloud Service Consumption.",
                    "Cloud-as-a-Gift: Effectively Exploiting Personal Cloud Free Accounts via REST APIs.",
                    "Architecture and Key Issues of IMS-Based Cloud Computing.",
                    "Cloud-Based Application Whitelisting.",
                    "DartCSim+: Enhanced CloudSim with the Power and Network Models Integrated.",
                    "Chisel: A Resource Savvy Approach for Handling Skew in MapReduce Applications.",
                    "QoS-Aware VM Placement in Multi-domain Service Level Agreements Scenarios.",
                    "Broker Emergence in Social Clouds.",
                    "Scale-Space Filtering for Workload Analysis and Forecast.",
                    "Scaling Archived Social Media Data Analysis Using a Hadoop Cloud.",
                    "PaaS-Independent Provisioning and Management of Applications in the Cloud.",
                    "A Proactive Cloud Management Architecture for Private Clouds.",
                    "Concurrency Optimized Task Scheduling for Workflows in Cloud.",
                    "An Architectural Framework for Enforcing Energy Management Policies in Cloud.",
                    "Understanding Tradeoffs between Power Usage and Performance in a Virtualized Environment.",
                    "User-Based CPU Verification Scheme for Public Cloud Computing.",
                    "Efficient and Scalable IoT Service Delivery on Cloud.",
                    "Dynamic Scalability of a Consolidation Service.",
                    "A Queueing Model to Achieve Proper Elasticity for Cloud Cluster Jobs.",
                    "Energy Efficient Fault Tolerance for High Performance Computing (HPC) in the Cloud.",
                    "Experiences with a Private Enterprise Cloud: Providing Fault Tolerance and High Availability for Interactive EDA Applications.",
                    "Achieving High Availability at the Application Level in the Cloud.",
                    "Advanced Quality Measurement for Cloud Services.",
                    "MAT: A Migration Assessment Toolkit for PaaS Clouds.",
                    "Provenance Monitoring in the Cloud.",
                    "Workload Predicting-Based Automatic Scaling in Service Clouds.",
                    "Workload Monitoring in Hybrid Clouds.",
                    "Residency-Aware Virtual Machine Communication Optimization: Design Choices and Techniques.",
                    "Provisioning Legacy Simulation Applications in Product Lifecycle Management via a Cloud Platform.",
                    "Performance Modeling of MapReduce Jobs in Heterogeneous Cloud Environments.",
                    "Result Integrity Check for MapReduce Computation on Hybrid Clouds.",
                    "Evaluation of a Server-Grade Software-Only ARM Hypervisor.",
                    "Machine Learning in Virtualization: Estimate a Virtual Machine's Working Set Size.",
                    "Analytics for Product Planning: In-Depth Interview Study with SaaS Product Managers.",
                    "Models and Guidelines for Dimensioning Private Clouds.",
                    "Towards Model-Driven Provisioning, Deployment, Monitoring, and Adaptation of Multi-cloud Systems.",
                    "Cloud Atlas: A Software Defined Networking Abstraction for Cloud to WAN Virtual Networking.",
                    "Complex Queries in a Shared Multi User Relational Cloud Database.",
                    "HGrid: A Data Model for Large Geospatial Data Sets in HBase.",
                    "Secure Outsourcing of Matrix Operations as a Service.",
                    "Incident Notification Process as a Service for Electricity Supply Systems.",
                    "Digital Library Engine: Adapting Digital Library for Cloud Computing.",
                    "A Theoretical Approach to the Data-Oriented Scheduling Strategies across Multiple Clouds.",
                    "A Dynamic Virtual Resource Renting Method for Maximizing the Profit of Cloud Service Provider under SLA Constraint.",
                    "QoS-Aware, Cost-Efficient Selection of Cloud Data Centers.",
                    "Optimal Resource Allocation to Host Web Services in Cloud.",
                    "iVMp: An Interactive VM Placement Algorithm for Agile Capital Allocation.",
                    "Privacy-Preserved Mobile Sensing through Hybrid Cloud Trust Framework.",
                    "Vulnerability Detection of Android System in Fuzzing Cloud.",
                    "Framework for Assessing Cloud Trustworthiness.",
                    "Towards a Stakeholder-Oriented Taxonomical Approach for Secure Cloud Computing.",
                    "On the Accuracy of Time Measurements in Virtual Machines.",
                    "Monitoring and Controlling Research Experiments in Cloud Testbeds.",
                    "Dynamic Rule Based SLA Management in Clouds.",
                    "SLA Approach for \"Cloud as a Service\".",
                    "An Auto Window Filter Algorithm for Resource Monitoring in Cloud.",
                    "Avoiding Lock-In: Timely Reconfiguration of a Virtual Cloud Platform on Top of Multiple PaaS and IaaS Providers.",
                    "Refundable Service through Cloud Brokerage.",
                    "Towards the Automatic Detection of Efficient Computing Assets in a Heterogeneous Cloud Environment.",
                    "Interactive Exploitation of Nonuniform Cloud Resources for LHC Computing at CERN."
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "5th IEEE CLOUD 2012",
        "info": "Honolulu, HI, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/IEEEcloud/2012",
                "sub_name": "2012 IEEE Fifth International Conference on Cloud Computing, Honolulu, HI, USA, June 24-29, 2012.",
                "count": 139,
                "papers": [
                    "MROrchestrator: A Fine-Grained Resource Orchestration Framework for MapReduce Clusters.",
                    "A General and Practical Datacenter Selection Framework for Cloud Services.",
                    "A Profit-Aware Virtual Machine Deployment Optimization Framework for Cloud Platform Providers.",
                    "Biting Off Safely More Than You Can Chew: Predictive Analytics for Resource Over-Commit in IaaS Cloud.",
                    "WIQ: Work-Intensive Query Scheduling for In-Memory Database Systems.",
                    "Admission Control for Elastic Cloud Services.",
                    "Center-of-Gravity Reduce Task Scheduling to Lower MapReduce Network Traffic.",
                    "Efficient Map/Reduce-Based DBSCAN Algorithm with Optimized Data Partition.",
                    "Evaluating Hadoop for Data-Intensive Scientific Operations.",
                    "Optimal Bids for Spot VMs in a Cloud for Deadline Constrained Jobs.",
                    "Maximizing Cloud Provider Profit from Equilibrium Price Auctions.",
                    "Towards Optimal Bidding Strategy for Amazon EC2 Cloud Spot Instance.",
                    "Attribution of Fraudulent Resource Consumption in the Cloud.",
                    "GARDEN: Generic Addressing and Routing for Data Center Networks.",
                    "Expertus: A Generator Approach to Automate Performance Testing in IaaS Clouds.",
                    "F2Box: Cloudifying F2F Storage Systems with High Availability Correlation.",
                    "FriendBox: A Hybrid F2F Personal Storage Application.",
                    "Scan-Sharing for Optimizing RDF Graph Pattern Matching on MapReduce.",
                    "Towards Quality Aware Collaborative Video Analytic Cloud.",
                    "De Novo Assembly of High-Throughput Sequencing Data with Cloud Computing and New Operations on String Graphs.",
                    "Challenges and Opportunities in Consolidation at High Resource Utilization: Non-monotonic Response Time Variations in n-Tier Applications.",
                    "A Performance Interference Model for Managing Consolidated Workloads in QoS-Aware Clouds.",
                    "Scheduling Parallel Tasks onto Opportunistically Available Cloud Resources.",
                    "Energy Efficient Geographical Load Balancing via Dynamic Deferral of Workload.",
                    "Survivable Virtual Infrastructure Mapping in Virtualized Data Centers.",
                    "Energy Management in IaaS Clouds: A Holistic Approach.",
                    "Cost-Efficient and Application SLA-Aware Client Side Request Scheduling in an Infrastructure-as-a-Service Cloud.",
                    "SmartScale: Automatic Application Scaling in Enterprise Clouds.",
                    "Risk-Aware Workload Distribution in Hybrid Clouds.",
                    "Opportunistic Service Provisioning in the Cloud.",
                    "Performance of Cloud Computing Centers with Multiple Priority Classes.",
                    "An Online Mechanism for Dynamic VM Provisioning and Allocation in Clouds.",
                    "Impact of Live Migration on Multi-tier Application Performance in Clouds.",
                    "Minimizing Latency in Serving Requests through Differential Template Caching in a Cloud.",
                    "Semantically-Rich Composition of Virtual Images.",
                    "Keeping Data Private while Computing in the Cloud.",
                    "Oruta: Privacy-Preserving Public Auditing for Shared Data in the Cloud.",
                    "CloudProtect: Managing Data Privacy in Cloud Applications.",
                    "Efficient Deployment of Main-Memory DBMS in Virtualized Data Centers.",
                    "Topology-Aware Deployment of Scientific Applications in Cloud Computing.",
                    "Placement in Clouds for Application-Level Latency Requirements.",
                    "Data Centers in the Cloud: A Large Scale Performance Study.",
                    "Towards a Taxonomy of Performance Evaluation of Commercial Cloud Services.",
                    "Lessons Learnt from the Development of GIS Application on Azure Cloud Platform.",
                    "SLA-Based and Consumer-centric Dynamic Provisioning for Cloud Databases.",
                    "Self-Adaptive and Resource-Efficient SLA Enactment for Cloud Computing Infrastructures.",
                    "An Integrated Approach for Specifying and Enforcing SLAs for Cloud Services.",
                    "A Semantic Scheduler Architecture for Federated Hybrid Clouds.",
                    "A Federated Multi-cloud PaaS Infrastructure.",
                    "Resource Allocation for Cloud-Assisted Mobile Applications.",
                    "Sharing-Aware Cloud-Based Mobile Outsourcing.",
                    "Service Image Placement for Thin Client in Mobile Cloud Computing.",
                    "A Performance Study on the VM Startup Time in the Cloud.",
                    "Sensor Data Storage Performance: SQL or NoSQL, Physical or Virtual.",
                    "Application-Level CPU Consumption Estimation: Towards Performance Isolation of Multi-tenancy Web Applications.",
                    "Accelerating MapReduce Analytics Using CometCloud.",
                    "Distributed Graph Database for Large-Scale Social Computing.",
                    "Abstract Image Management and Universal Image Registration for Cloud and HPC Infrastructures.",
                    "Maitland: Lighter-Weight VM Introspection to Support Cyber-security in the Cloud.",
                    "Defining and Implementing Connection Anonymity for SaaS Web Services.",
                    "MANTICORE: Masking All Network Traffic via IP Concealment with OpenVPN Relaying to EC2.",
                    "Hatman: Intra-cloud Trust Management for Hadoop.",
                    "Programmable Order-Preserving Secure Index for Encrypted Database Query.",
                    "Cryptonite: A Secure and Performant Data Repository on Public Clouds.",
                    "Combining Query Performance with Data Integrity in the Cloud: A Hybrid Cloud Storage Framework to Enhance Data Access on the Windows Azure Platform.",
                    "Cost-Based Data Consistency in a Data-as-a-Service Cloud Environment.",
                    "IncMR: Incremental Data Processing Based on MapReduce.",
                    "Scalable Transaction Management with Snapshot Isolation on Cloud Data Management Systems.",
                    "Multi-level Selective Deduplication for VM Snapshots in Cloud Storage.",
                    "A Brokerage-Based Approach for Cloud Service Selection.",
                    "QoS-Driven Service Selection for Multi-tenant SaaS.",
                    "Improving Resource Utilisation in the Cloud Environment Using Multivariate Probabilistic Models.",
                    "Portfolio Theory-Based Resource Assignment in a Cloud Computing System.",
                    "Composite SaaS Placement and Resource Optimization in Cloud Computing Using Evolutionary Algorithms.",
                    "Risk Aware Provisioning and Resource Aggregation Based Consolidation of Virtual Machines.",
                    "MiyakoDori: A Memory Reusing Mechanism for Dynamic VM Consolidation.",
                    "Autonomous Resource Consolidation Management in Clouds Using IMPROMPTU Extensions.",
                    "Toward Realization of Deployment Variability for Software-as-a-Service Applications.",
                    "A Latency-Aware Co-deployment Mechanism for Cloud-Based Services.",
                    "Bi-criteria Workflow Tasks Allocation and Scheduling in Cloud Computing Environments.",
                    "Impact of Storage Acquisition Intervals on the Cost-Efficiency of the Private vs. Public Storage.",
                    "DICB: Dynamic Intelligent Customizable Benign Pricing Strategy for Cloud Computing.",
                    "Software Renting in the Era of Cloud Computing.",
                    "A Remote I/O Solution for the Cloud.",
                    "XenPump: A New Method to Mitigate Timing Channel in Cloud Computing.",
                    "Peregrine: An All-Layer-2 Container Computer Network.",
                    "Cloud Guided Stream Classification Using Class-Based Ensemble.",
                    "Prototyping Efficient Desktop-as-a-Service for FPGA Based Cloud Computing Architecture.",
                    "Pragmatic Integration of Cloud and Grid Computing Infrastructures.",
                    "Scalability Patterns for Platform-as-a-Service.",
                    "Capturing Cloud Computing Knowledge and Experience in Patterns.",
                    "Comparison of Multiple Cloud Frameworks.",
                    "Formalizing the Cloud through Enterprise Topology Graphs.",
                    "Energy-Efficient Virtual Machine Replication and Placement in a Cloud Computing System.",
                    "Carbon Metering and Effective Tax Cost Modeling for Virtual Machines.",
                    "Energy-as-a-Service (EaaS): On the Efficacy of Multimedia Cloud Computing to Save Smartphone Energy.",
                    "Analysis of the Power and Hardware Resource Consumption of Servers under Different Load Balancing Policies.",
                    "Analysis of the Power Consumption of a Multimedia Server under Different DVFS Policies.",
                    "Experimental Analysis of Application Specific Energy Efficiency of Data Centers with Heterogeneous Servers.",
                    "A Framework for Partitioning and Execution of Data Stream Applications in Mobile Cloud Computing.",
                    "Evaluating High Performance Computing on the Windows Azure Platform.",
                    "Synchronous Parallel Processing of Big-Data Analytics Services to Optimize Performance in Federated Clouds.",
                    "Optimizing Sequence Alignment in Cloud Using Hadoop and MPP Database.",
                    "Optimizing JMS Performance for Cloud-Based Application Servers.",
                    "Supporting Virtualization-Aware Security Solutions Using a Systematic Approach to Overcome the Semantic Gap.",
                    "Preemption-Aware Energy Management in Virtualized Data Centers.",
                    "VM Placement Strategies for Cloud Scenarios.",
                    "Remediating Overload in Over-Subscribed Computing Environments.",
                    "Analysis of SaaS Business Platform Workloads for Sizing and Collocation.",
                    "Minimum Cost Maximum Flow Algorithm for Dynamic Resource Allocation in Clouds.",
                    "A Systematic Framework Enabling Automatic Conflict Detection and Explanation in Cloud Service Selection for Enterprises.",
                    "Introducing STRATOS: A Cloud Broker Service.",
                    "MedBook: A Cloud-Based Healthcare Billing and Record Management System.",
                    "ReLoC: A Resilient Loosely Coupled Application Architecture for State Management in the Cloud.",
                    "Configuring a MapReduce Framework for Dynamic and Efficient Energy Adaptation.",
                    "Application-Managed Replication Controller for Cloud-Hosted Databases.",
                    "An Availability-Aware Approach to Resource Placement of Dynamic Scaling in Clouds.",
                    "How Do Cloud Capabilities Impact Various Aspects of IT Effectiveness?",
                    "Automatic Resource Scaling Based on Application Service Requirements.",
                    "HSQL: A Highly Scalable Cloud Database for Multi-user Query Processing.",
                    "A Tiered Strategy for Auditing in the Cloud.",
                    "CloudMonitor: Profiling Power Usage.",
                    "Facilitating Business-Oriented Cloud Transformation Decision with Cloud Transformation Advisor.",
                    "Reliable State Monitoring in Cloud Datacenters.",
                    "Increasing Spot Instances Reliability Using Dynamic Scalability.",
                    "Service Provisioning for the WSN Cloud.",
                    "A Multi-tenant Web Application Framework for SaaS.",
                    "A Framework for Classification of Resource Consolidation Management Problems.",
                    "Energy-Price-Driven Request Dispatching for Cloud Data Centers.",
                    "Content Based SLAs in Cloud Computing Environments.",
                    "Enterprise Architectures for Cloud Computing.",
                    "TOSSMA: A Tenant-Oriented SaaS Security Management Architecture.",
                    "A Holistic View of Information Management in Cloud Environments.",
                    "Video Surveillance Based on Cloud Storage.",
                    "Quantifying Manageability of Cloud Platforms.",
                    "Managing a Cloud for Multi-agent Systems on Ad-Hoc Networks.",
                    "COSBench: A Benchmark Tool for Cloud Object Storage Services.",
                    "Portable Data Management Cloud for Field Science.",
                    "Space Reduction for Extreme Aggregation of Data Stream over Time-Based Sliding Window."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "4th IEEE CLOUD 2011",
        "info": "Washington, DC, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/IEEEcloud/2011",
                "sub_name": "IEEE International Conference on Cloud Computing, CLOUD 2011, Washington, DC, USA, 4-9 July, 2011.",
                "count": 109,
                "papers": [
                    "Cost-Wait Trade-Offs in Client-Side Resource Provisioning with Elastic Clouds.",
                    "Analysis of Virtualization Technologies for High Performance Computing Environments.",
                    "Evaluation of Network Topology Inference in Opaque Compute Clouds through End-to-End Measurements.",
                    "Strict SLAs for Operational Business Intelligence.",
                    "Exploiting Cloud Utility Models for Profit and Ruin.",
                    "Efficient Bidding for Virtual Machine Instances in Clouds.",
                    "Performance Modeling of Concurrent Live Migration Operations in Cloud Computing Systems Using PRISM Probabilistic Model Checker.",
                    "VirtPerf: A Performance Profiling Tool for Virtualized Environments.",
                    "PCube: Improving Power Efficiency in Data Center Networks.",
                    "Variations in Performance and Scalability When Migrating n-Tier Applications to Different Clouds.",
                    "Flexible Process-Based Applications in Hybrid Clouds.",
                    "Elastically Ruling the Cloud: Specifying Application's Behavior in Federated Clouds.",
                    "Angels in the Cloud: A Peer-Assisted Bulk-Synchronous Content Distribution Service.",
                    "Distributed Semantic Web Data Management in HBase and MySQL Cluster.",
                    "Promoting Distributed Accountability in the Cloud.",
                    "Certicloud: A Novel TPM-based Approach to Ensure Cloud IaaS Security.",
                    "Secure Locking for Untrusted Clouds.",
                    "Affinity-Aware Modeling of CPU Usage for Provisioning Virtualized Applications.",
                    "Markovian Workload Characterization for QoS Prediction in the Cloud.",
                    "Towards Optimal Resource Provisioning for Running MapReduce Programs in Public Clouds.",
                    "Flexible Distributed Capacity Allocation and Load Redirect Algorithms for Cloud Systems.",
                    "Deadline Queries: Leveraging the Cloud to Produce On-Time Results.",
                    "A Local-Optimisation Based Strategy for Cost-Effective Datasets Storage of Scientific Applications in the Cloud.",
                    "Scalable Complex Query Processing over Large Semantic Web Data Using Cloud.",
                    "Elastic Stream Computing with Clouds.",
                    "Cost-Effective Partial Migration of VoD Services to Content Clouds.",
                    "A Scalable Communication Runtime for Clouds.",
                    "DACAR Platform for eHealth Services Cloud.",
                    "A User Experience-Based Cloud Service Redeployment Mechanism.",
                    "Leveraging Service Clouds for Power and QoS Management for Mobile Devices.",
                    "Energy-Efficient Management of Virtual Machines in Eucalyptus.",
                    "Exploiting Spatio-temporal Tradeoffs for Energy-Aware MapReduce in the Cloud.",
                    "Low Carbon Virtual Private Clouds.",
                    "Live Migration of Multiple Virtual Machines with Resource Reservation in Cloud Computing Environments.",
                    "On Theory of VM Placement: Anomalies in Existing Methodologies and Their Mitigation Using a Novel Vector Based Approach.",
                    "Identification and Evaluation of Sharing Memory Covert Timing Channel in Xen Virtual Machines.",
                    "Space-Efficient Bloom Filters for Enforcing Integrity of Outsourced Data in Cloud Environments.",
                    "VIAF: Verification-Based Integrity Assurance Framework for MapReduce.",
                    "DIaaS: Data Integrity as a Service in the Cloud.",
                    "MADMAC: Multiple Attribute Decision Methodology for Adoption of Clouds.",
                    "Multi-dimensional SLA-Based Resource Allocation for Multi-tier Cloud Computing Systems.",
                    "Modelling Contract Management for Cloud Services.",
                    "Videoconference Capacity Leasing on Hybrid Clouds.",
                    "Esc: Towards an Elastic Stream Computing Platform for the Cloud.",
                    "Testing a Cloud Provider Network for Hybrid P2P and Cloud Streaming Architectures.",
                    "Collaboration-Based Cloud Computing Security Management Framework.",
                    "Governance Life Cycle Framework for Managing Security in Public Cloud: From User Perspective.",
                    "Design and Deployment of a Trusted Eucalyptus Cloud.",
                    "A Pattern-Based Approach to Cloud Transformation.",
                    "A SaaSify Tool for Converting Traditional Web-Based Applications to SaaS Application.",
                    "Migrating Service-Oriented System to Cloud Computing: An Experience Report.",
                    "Multi-objective Scheduling of BPEL Workflows in Geographically Distributed Clouds.",
                    "Optimal Algorithms for Cross-Rack Communication Optimization in MapReduce Framework.",
                    "Reserved or On-Demand Instances? A Revenue Maximization Model for Cloud Providers.",
                    "iCostale: Adaptive Cost Optimization for Storage Clouds.",
                    "BFTCloud: A Byzantine Fault Tolerance Framework for Voluntary-Resource Cloud Computing.",
                    "MetaStorage: A Federated Cloud Storage System to Manage Consistency-Latency Tradeoffs.",
                    "Toward Optimal Deployment of Communication-Intensive Cloud Applications.",
                    "Scaling Non-elastic Applications Using Virtual Machines.",
                    "STRATUS: Assembling Virtual Platforms from Device Clouds.",
                    "What Are You Paying For? Performance Benchmarking for Infrastructure-as-a-Service Offerings.",
                    "Performance Modeling of Virtual Machine Live Migration.",
                    "Efficient Autoscaling in the Cloud Using Predictive Models for Workload Forecasting.",
                    "Private Cloud Configuration with MetaConfig.",
                    "Large-Scale Distributed Storage System for Business Provenance.",
                    "Usage Management in Cloud Computing.",
                    "Cloud#: A Specification Language for Modeling Cloud.",
                    "Decision Support Tools for Cloud Migration in the Enterprise.",
                    "A Home Healthcare System in the Cloud-Addressing Security and Privacy Challenges.",
                    "Content Server System Architecture for Providing Differentiated Levels of Service in a Digital Preservation Cloud.",
                    "Security Prospects through Cloud Computing by Adopting Multiple Clouds.",
                    "Tackling the Loss of Control: Standards-Based Conjoint Management of Security Requirements for Cloud Services.",
                    "An Analysis of Security and Privacy Issues in Smart Grid Software Architectures on Clouds.",
                    "A Commodity-Focused Multi-cloud Marketplace Exemplar Application.",
                    "Implementation of a Scalable Next Generation Sequencing Business Cloud Platform-An Experience Report.",
                    "Open911: Experiences with the Mobile Plus Cloud Paradigm.",
                    "Mechanism Design for Stochastic Virtual Resource Allocation in Non-cooperative Cloud Systems.",
                    "Real Time Elastic Cloud Management for Limited Resources.",
                    "SLA Based Dynamic Virtualized Resources Provisioning for Shared Cloud Data Centers.",
                    "Automotive Cloud Service Systems Based on Service-Oriented Architecture and Its Evaluation.",
                    "A Cloud-Based Accessible Architecture for Large-Scale ADL Analysis Services.",
                    "Optimal Multitenant Designs for Cloud Apps.",
                    "Profiling Applications for Virtual Machine Placement in Clouds.",
                    "Self-Configuration of Distributed Applications in the Cloud.",
                    "Delivering High Resilience in Designing Platform-as-a-Service Clouds.",
                    "Phoenix: A Relational Storage Component for the Cloud.",
                    "Database-Agnostic Transaction Support for Cloud Infrastructures.",
                    "IO Tetris: Deep Storage Consolidation for the Cloud via Fine-Grained Workload Analysis.",
                    "A Performance Evaluation of X-Ray Crystallography Scientific Workflow Using SciCumulus.",
                    "Exploring Alternative Approaches to Implement an Elasticity Policy.",
                    "An Efficient Sensitivity Analysis Method for Large Cloud Simulations.",
                    "Tuning Adaptive Computations for Performance Improvement of Autonomic Middleware in PaaS Cloud.",
                    "MN-GEMS: A Timing-Aware Simulator for a Cloud Node with Manycore, DRAM, and Non-volatile Memories.",
                    "Energy-Aware Virtual Machine Dynamic Provision and Scheduling for Cloud Computing.",
                    "Real Time Collaborative Video Annotation Using Google App Engine and XMPP Protocol.",
                    "Soft-Union: An Overlay Based Efficient Software P2P Distribution Scheme.",
                    "Performance Issues in Cloud Computing for Cyber-physical Applications.",
                    "The KOALA Cloud Manager: Cloud Service Management the Easy Way.",
                    "Scheduling Scientific Workflows Elastically for Cloud Computing.",
                    "Defining Customizable Business Processes without Compromising the Maintainability in Multi-tenant SaaS Applications.",
                    "Legacy Application Migration to Cloud.",
                    "My Private Cloud Overview: A Trust, Privacy and Security Infrastructure for the Cloud.",
                    "Multi-Level Autonomic Architecture for the Management of Virtualized Application Environments in Cloud Platforms.",
                    "Secure Sharing of Item-Level Data in the Cloud.",
                    "Towards Multi-user Private Keyword Search for Cloud Computing.",
                    "Flexible Authorization by Generating Public Re-decryption Trapdoor in Outsourced Scenarios.",
                    "Security Management Areas in the Inter-cloud.",
                    "Cloud User Roles: Establishing Standards for Describing Core Tasks of Cloud Creators, Providers, and Consumers.",
                    "Scalable Service Oriented Replication in the Cloud."
                ]
            }
        ]
    },
    {
        "year": "2010",
        "name": "3rd IEEE CLOUD 2010",
        "info": "Miami, FL, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/IEEEcloud/2010",
                "sub_name": "IEEE International Conference on Cloud Computing, CLOUD 2010, Miami, FL, USA, 5-10 July, 2010.",
                "count": 77,
                "papers": [
                    "Data Intensive Query Processing for Large RDF Graphs Using Cloud Computing Tools.",
                    "Model-Based Planning for State-Related Changes to Infrastructure and Software as a Service Instances in Large Data Centers.",
                    "Using Cloud Technologies to Optimize Data-Intensive Service Applications.",
                    "Enterprise Cloud Service Architecture.",
                    "Towards Living Landscape Models: Automated Integration of Infrastructure Cloud in Enterprise Architecture Management.",
                    "A Review of Cloud Business Models and Sustainability.",
                    "Understanding Performance Interference of I/O Workload in Virtualized Cloud Environments.",
                    "Performance Measurements and Analysis of Network I/O Applications in Virtualized Cloud.",
                    "Fault Tolerance Middleware for Cloud Computing.",
                    "Integrating Resource Consumption and Allocation for Infrastructure Resources on-Demand.",
                    "FlexPRICE: Flexible Provisioning of Resources in a Cloud Environment.",
                    "Dynamic Resource Allocation in Computing Clouds Using Distributed Multiple Criteria Decision Analysis.",
                    "Social Cloud: Cloud Computing in Social Networks.",
                    "Mining Twitter in the Cloud: A Case Study.",
                    "Cloud Computing: A Digital Libraries Perspective.",
                    "Characterizing Cloud Federation for Enhancing Providers' Profit.",
                    "Maximizing Cloud Providers' Revenues via Energy Aware Allocation Policies.",
                    "THEMIS: Towards Mutually Verifiable Billing Transactions in the Cloud Computing Environment.",
                    "Adaptive Data Migration in Multi-tiered Storage Based Cloud Environment.",
                    "Towards Self-Assisted Troubleshooting for the Deployment of Private Clouds.",
                    "Workload Migration into Clouds Challenges, Experiences, Opportunities.",
                    "Secure Virtual Machine Execution under an Untrusted Management OS.",
                    "Flexible Data Access in a Cloud Based on Freshness Requirements.",
                    "Preventing Information Leakage from Indexing in the Cloud.",
                    "Data Flow Driven Scheduling of BPEL Workflows Using Cloud Resources.",
                    "Storage Management in Virtualized Cloud Environment.",
                    "Metadata Partitioning for Large-Scale Distributed Storage Systems.",
                    "Autonomic Management of Cloud Service Centers with Availability Guarantees.",
                    "Cost-Optimal Scheduling in Hybrid IaaS Clouds for Deadline Constrained Workloads.",
                    "Reducing Costs of Spot Instances via Checkpointing in the Amazon Elastic Compute Cloud.",
                    "Compliant Cloud Computing (C3): Architecture and Language Support for User-Driven Compliance Management in Clouds.",
                    "A Framework for Optimized Distribution of Tenants in Cloud Applications.",
                    "P&P: A Combined Push-Pull Model for Resource Monitoring in Cloud Computing Environment.",
                    "Security Models and Requirements for Healthcare Application Clouds.",
                    "Attack Surfaces: A Taxonomy for Attacks on Cloud Services.",
                    "QUIRC: A Quantitative Impact and Risk Assessment Framework for Cloud Security.",
                    "Toward Ease of Discovery, Selection and Use of Clusters within a Cloud.",
                    "Service Level Checking in the Cloud Computing Context.",
                    "An Evaluation of Distributed Datastores Using the AppScale Cloud Platform.",
                    "A Runtime Model Based Monitoring Approach for Cloud.",
                    "QoS - Aware Clouds.",
                    "Performance and Power Management for Cloud Infrastructures.",
                    "How to Enhance Cloud Architectures to Enable Cross-Federation.",
                    "Scalable Support for 3D Graphics Applications in Cloud.",
                    "LH*RE: A Scalable Distributed Data Structure with Recoverable Encryption.",
                    "A Lifetime Supporting Framework for Cloud Applications.",
                    "Dynamic Provisioning Modeling for Virtualized Multi-tier Applications in Cloud Data Center.",
                    "SciCumulus: A Lightweight Cloud Middleware to Explore Many Task Computing Paradigm in Scientific Workflows.",
                    "An Architecture for a Mashup Container in Virtualized Environments.",
                    "IC Cloud: A Design Space for Composable Cloud Computing.",
                    "SaaS Integration for Software Cloud.",
                    "From Data Center Resource Allocation to Control Theory and Back.",
                    "Optimal Resource Allocation in Clouds.",
                    "HyperDealer: Reference-Pattern-Aware Instant Memory Balancing for Consolidated Virtual Machines.",
                    "Is Server Consolidation Beneficial to MMORPG? A Case Study of World of Warcraft.",
                    "Open Source Cloud Computing Tools: A Case Study with a Weather Application.",
                    "Cloud Migration: A Case Study of Migrating an Enterprise IT System to IaaS.",
                    "Multi-tenant SOA Middleware for Cloud Computing.",
                    "A Conceptual Framework for Provisioning Context-aware Mobile Cloud Services.",
                    "Bridging the Gap between Desktop and the Cloud for eScience Applications.",
                    "An Architecture for Distributed High Performance Video Processing in the Cloud.",
                    "Provisioning Web Services from Resource Constrained Mobile Devices.",
                    "An Economic Approach for Scalable and Highly-Available Distributed Applications.",
                    "A Case for Consumer - centric Resource Accounting Models.",
                    "An Architecture for Public and Open Submission Systems in the Cloud.",
                    "On-Demand Dynamic Security for Risk-Based Secure Collaboration in Clouds.",
                    "Cloud Computing Infrastructure for Biological Echo-Systems.",
                    "IRain: A Personal Storage Cloud for Integrating Web Data Services.",
                    "Organic Product Catalogs: Towards an Architecture for Cloud-Based Micro Enterprise E-commerce.",
                    "CLOUDIO: A Cloud Computing-Oriented Multi-tenant Architecture for Business Information Systems.",
                    "Business Process Centric Platform-as-a-Service Model and Technologies for Cloud Enabled Industry Solutions.",
                    "Resource Information Cache Update Control for Scalable Access Control Management Systems.",
                    "Towards an Anonymous Access Control and Accountability Scheme for Cloud Computing.",
                    "Enterprise Architecture Frameworks for Enabling Cloud Computing.",
                    "Cloud Broker: Bringing Intelligence into the Cloud.",
                    "A Remote Swap Management Framework in a Virtual Machine Cluster.",
                    "Seamless Support of Multimedia Distributed Applications Through a Cloud."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "2nd IEEE CLOUD 2009",
        "info": "Bangalore, India",
        "venues": [
            {
                "sub_name_abbr": "conf/IEEEcloud/2009",
                "sub_name": "IEEE International Conference on Cloud Computing, CLOUD 2009, Bangalore, India, 21-25 September, 2009.",
                "count": 32,
                "papers": [
                    "From Service Clouds to User-Centric Personal Clouds.",
                    "A Profile-Based Approach to Just-in-Time Scalability for Cloud Applications.",
                    "EnaCloud: An Energy-Saving Application Live Placement Approach for Cloud Computing Environments.",
                    "DSP RE-Encryption: A Flexible Mechanism for Access Control Enforcement Management in DaaS.",
                    "Deployment of Services in a Cloud Subject to Memory and License Constraints.",
                    "Application Performance Isolation in Virtualization.",
                    "Optimistic Synchronization of Parallel Simulations in Cloud Computing Environments.",
                    "Customer Centric Cloud Service Model and a Case Study on Commerce as a Service.",
                    "Intelligent Management of Remote Facilities through a Ubiquitous Cloud Middleware.",
                    "An Efficient Resource Management System for On-Line Virtual Cluster Provision.",
                    "SOA's Last Mile-Connecting Smartphones to the Service Cloud.",
                    "Cloud Computing for Satellite Data Processing on High End Compute Clusters.",
                    "The Method and Tool of Cost Analysis for Cloud Computing.",
                    "An End-to-End Methodology and Toolkit for Fine Granularity SaaS-ization.",
                    "On Technical Security Issues in Cloud Computing.",
                    "A Method to Support Variability of Enterprise Services on the Cloud.",
                    "Architecture-Driven Variation Analysis for Designing Cloud Applications.",
                    "Policy-Based Event-Driven Services-Oriented Architecture for Cloud Services Operation & Management.",
                    "A RESTful Approach to the Management of Cloud Infrastructure.",
                    "Improving Scalability of Software Cloud for Composite Web Services.",
                    "Service Oriented Architecture for Cloud Based Travel Reservation Software as a Service.",
                    "Cloud Computing Resource Management through a Grid Middleware: A Case Study with DIET and Eucalyptus.",
                    "An Approach for Selecting Software-as-a-Service (SaaS) Product.",
                    "SVLC: Service Value Life Cycle Model.",
                    "A Framework of Co-creating Business Values for IT Services.",
                    "Taking IT Management Services to a Cloud.",
                    "Dynamic SLA Template Adjustments Based on Service Property Monitoring.",
                    "Leveraging Robust Service Evaluation by Introducing the Web of Trust.",
                    "Ranking Mortgage Origination Applications Using Customer, Product, Environment and Workflow Attributes.",
                    "Understand Collaborative Authorization Policies: Models and Specifications.",
                    "MONGOOSE: MONitoring Global Online Opinions via Semantic Extraction.",
                    "Rule-Based Problem Classification in IT Service Management."
                ]
            }
        ]
    }
]