[
    {
        "year": "2021",
        "name": "17th ISBRA 2021",
        "info": "Shenzhen, China",
        "venues": [
            {
                "sub_name_abbr": "conf/isbra/2021",
                "sub_name": "Bioinformatics Research and Applications - 17th International Symposium, ISBRA 2021, Shenzhen, China, November 26-28, 2021, Proceedings.",
                "count": 51,
                "papers": [
                    "MKL-LP: Predicting Disease-Associated Microbes with Multiple-Similarity Kernel Learning-Based Label Propagation.",
                    "Immune-Microbiota Crosstalk Underlying Inflammatory Bowel Disease.",
                    "Epidemic Vulnerability Index for Effective Vaccine Distribution Against Pandemic.",
                    "Exploiting Multi-granular Features for the Enhanced Predictive Modeling of COPD Based on Chinese EMRs.",
                    "Task-Oriented Feature Representation for Spontaneous Speech of AD Patients.",
                    "Identification of Protein Markers Predictive of Drug-Specific Survival Outcome in Cancers.",
                    "Diabetic Retinopathy Grading Base on Contrastive Learning and Semi-supervised Learning.",
                    "Reinforcement Learning for Diabetes Blood Glucose Control with Meal Information.",
                    "Predicting Microbe-Disease Association via Tripartite Network and Relation Graph Convolutional Network.",
                    "Combining Model-Based and Model-Free Reinforcement Learning Policies for More Efficient Sepsis Treatment.",
                    "An Efficient Two-Stage Fusion Network for Computer-Aided Diagnosis of Diabetic Foot.",
                    "A Heterogeneous Graph Convolutional Network-Based Deep Learning Model to Identify miRNA-Disease Association.",
                    "Identification of Gastric Cancer Immune Microenvironment Related Genes with Poor Prognosis and Tumor Immune Infiltration.",
                    "A k-mer Based Approach for SARS-CoV-2 Variant Identification.",
                    "A Novel Network Representation of SARS-CoV-2 Sequencing Data.",
                    "A Sequence-Based Antibody Paratope Prediction Model Through Combing Local-Global Information and Partner Features.",
                    "SuccSPred: Succinylation Sites Prediction Using Fused Feature Representation and Ranking Method.",
                    "BindTransNet: A Transferable Transformer-Based Architecture for Cross-Cell Type DNA-Protein Binding Sites Prediction.",
                    "Overlapping Protein Complexes Detection Based on Multi-level Topological Similarities.",
                    "LPI-FKLGCN: Predicting LncRNA-Protein Interactions Through Fast Kernel Learning and Graph Convolutional Network.",
                    "Prediction of Protein Subcellular Localization from Microscopic Images via Few-Shot Learning.",
                    "A Novel Pseudo-Labeling Approach for Cell Detection Based on Adaptive Threshold.",
                    "Parameter Transfer Learning Measured by Image Similarity to Detect CT of COVID-19.",
                    "A Novel Prediction Framework for Two-Year Stroke Recurrence Using Retinal Images.",
                    "The Classification System and Biomarkers for Autism Spectrum Disorder: A Machine Learning Approach.",
                    "LiteTrans: Reconstruct Transformer with Convolution for Medical Image Segmentation.",
                    "CFCN: A Multi-scale Fully Convolutional Network with Dilated Convolution for Nuclei Classification and Localization.",
                    "Image to Image Transfer Makes Malpositioned Teeth Orderly.",
                    "MIFS: A Peer-to-Peer Medical Images Storage and Sharing System Based on Consortium Blockchain.",
                    "StarLace: Nested Visualization of Temporal Brain Connectivity Data.",
                    "Batch Weighted Nuclear-Norm Minimization for Medical Image Sequence Segmentation.",
                    "Predicting Drug Drug Interactions by Signed Graph Filtering-Based Convolutional Networks.",
                    "Drug-Target Interaction Prediction Based on Gaussian Interaction Profile and Information Entropy.",
                    "A Deep Learning Approach Based on Feature Reconstruction and Multi-dimensional Attention Mechanism for Drug-Drug Interaction Prediction.",
                    "OrgaNet: A Deep Learning Approach for Automated Evaluation of Organoids Viability in Drug Screening.",
                    "HGDD: A Drug-Disease High-Order Association Information Extraction Method for Drug Repurposing via Hypergraph.",
                    "IDOS: Improved D3DOCK on Spark.",
                    "A New Deep Learning Training Scheme: Application to Biomedical Data.",
                    "EEG-Based Emotion Recognition Fusing Spacial-Frequency Domain Features and Data-Driven Spectrogram-Like Features.",
                    "ECG Arrhythmia Detection Based on Hidden Attention Residual Neural Network.",
                    "EEG-Based Depression Detection with a Synthesis-Based Data Augmentation Strategy.",
                    "Joint CC and Bimax: A Biclustering Method for Single-Cell RNA-Seq Data Analysis.",
                    "Improving Protein-protein Interaction Prediction by Incorporating 3D Genome Information.",
                    "Boosting Metagenomic Classification with Reads Overlap Graphs.",
                    "ScDA: A Denoising AutoEncoder Based Dimensionality Reduction for Single-cell RNA-seq Data.",
                    "PickerOptimizer: A Deep Learning-Based Particle Optimizer for Cryo-Electron Microscopy Particle-Picking Algorithms.",
                    "SkeIn: Sketchy-Intensive Reading Comprehension Model for Multi-choice Biomedical Questions.",
                    "DNA Image Storage Using a Scheme Based on Fuzzy Matching on Natural Genome.",
                    "Prediction of Virus-Receptor Interactions Based on Similarity and Matrix Completion.",
                    "An Efficient Greedy Incremental Sequence Clustering Algorithm.",
                    "Correlated Evolution in the Small Parsimony Framework."
                ]
            }
        ]
    },
    {
        "year": "2020",
        "name": "16th ISBRA 2020",
        "info": "Moscow, Russia",
        "venues": [
            {
                "sub_name_abbr": "conf/isbra/2020",
                "sub_name": "Bioinformatics Research and Applications - 16th International Symposium, ISBRA 2020, Moscow, Russia, December 1-4, 2020, Proceedings.",
                "count": 40,
                "papers": [
                    "Mitochondrial Haplogroup Assignment for High-Throughput Sequencing Data from Single Individual and Mixed DNA Samples.",
                    "Signet Ring Cell Detection with Classification Reinforcement Detection Network.",
                    "SPOC: Identification of Drug Targets in Biological Networks via Set Preference Output Control.",
                    "Identification of a Novel Compound Heterozygous Variant in NBAS Causing Bone Fragility by the Type of Osteogenesis Imperfecta.",
                    "Isoform-Disease Association Prediction by Data Fusion.",
                    "EpIntMC: Detecting Epistatic Interactions Using Multiple Clusterings.",
                    "Improving Metagenomic Classification Using Discriminative k-mers from Sequencing Data.",
                    "Dilated-DenseNet for Macromolecule Classification in Cryo-electron Tomography.",
                    "Ess-NEXG: Predict Essential Proteins by Constructing a Weighted Protein Interaction Network Based on Node Embedding and XGBoost.",
                    "mapAlign: An Efficient Approach for Mapping and Aligning Long Reads to Reference Genomes.",
                    "Functional Evolutionary Modeling Exposes Overlooked Protein-Coding Genes Involved in Cancer.",
                    "Testing the Agreement of Trees with Internal Labels.",
                    "SVLR: Genome Structure Variant Detection Using Long Read Sequencing Data.",
                    "De novo Prediction of Drug-Target Interaction via Laplacian Regularized Schatten-p Norm Minimization.",
                    "Diagnosis of ASD from rs-fMRI Images Based on Brain Dynamic Networks.",
                    "MiRNA-Disease Associations Prediction Based on Negative Sample Selection and Multi-layer Perceptron.",
                    "Checking Phylogenetic Decisiveness in Theory and in Practice.",
                    "TNet: Phylogeny-Based Inference of Disease Transmission Networks Using Within-Host Strain Diversity.",
                    "Cancer Breakpoint Hotspots Versus Individual Breakpoints Prediction by Machine Learning Models.",
                    "Integer Linear Programming Formulation for the Unified Duplication-Loss-Coalescence Model.",
                    "In Silico-Guided Discovery of Potential HIV-1 Entry Inhibitors Mimicking bNAb N6: Virtual Screening, Docking, Molecular Dynamics, and Post-Molecular Modeling Analysis.",
                    "Learning Structural Genetic Information via Graph Neural Embedding.",
                    "The Cross-Interpretation of QSAR Toxicological Models.",
                    "A New Network-Based Tool to Analyse Competing Endogenous RNAs.",
                    "Deep Ensemble Models for 16S Ribosomal Gene Classification.",
                    "Search for Tandem Repeats in the First Chromosome from the Rice Genome.",
                    "Deep Learning Approach with Rotate-Shift Invariant Input to Predict Protein Homodimer Structure.",
                    "Development of a Neural Network-Based Approach for Prediction of Potential HIV-1 Entry Inhibitors Using Deep Learning and Molecular Modeling Methods.",
                    "In Silico Design and Evaluation of Novel Triazole-Based Compounds as Promising Drug Candidates Against Breast Cancer.",
                    "Identification of Essential Genes with NemoProfile and Various Machine Learning Models.",
                    "NemoLib: Network Motif Libraries for Network Motif Detection and Analysis.",
                    "Estimating Enzyme Participation in Metabolic Pathways for Microbial Communities from RNA-seq Data.",
                    "Identification of Virus-Receptor Interactions Based on Network Enhancement and Similarity.",
                    "Enhanced Functional Pathway Annotations for Differentially Expressed Gene Clusters.",
                    "Automated Detection of Sleep Apnea from Abdominal Respiratory Signal Using Hilbert-Huang Transform.",
                    "Na/K-ATPase Glutathionylation: in silico Modeling of Reaction Mechanisms.",
                    "HiChew: a Tool for TAD Clustering in Embryogenesis.",
                    "SC1: A Tool for Interactive Web-Based Single Cell RNA-Seq Data Analysis.",
                    "Quantitative Analysis of the Dynamics of Maternal Gradients in the Early Drosophila Embryo.",
                    "Atom Tracking Using Cayley Graphs."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "15th ISBRA 2019",
        "info": "Barcelona, Spain",
        "venues": [
            {
                "sub_name_abbr": "conf/isbra/2019",
                "sub_name": "Bioinformatics Research and Applications - 15th International Symposium, ISBRA 2019, Barcelona, Spain, June 3-6, 2019, Proceedings.",
                "count": 22,
                "papers": [
                    "Computing a Consensus Phylogeny via Leaf Removal.",
                    "The Review of Bioinformatics Tool for 3D Plant Genomics Research.",
                    "Sorting by Reversals, Transpositions, and Indels on Both Gene Order and Intergenic Sizes.",
                    "Unifying Gene Duplication, Loss, and Coalescence on Phylogenetic Networks.",
                    "The Cluster Affinity Distance for Phylogenies.",
                    "Modeling SNP-Trait Associations and Realizing Privacy-Utility Tradeoff in Genomic Data Publishing.",
                    "Simultaneous Multi-Domain-Multi-Gene Reconciliation Under the Domain-Gene-Species Reconciliation Model.",
                    "IDNDDI: An Integrated Drug Similarity Network Method for Predicting Drug-Drug Interactions.",
                    "Model Revision of Boolean Regulatory Networks at Stable State.",
                    "Gene- and Pathway-Based Deep Neural Network for Multi-omics Data Integration to Predict Cancer Survival Outcomes.",
                    "Identifying Human Essential Genes by Network Embedding Protein-Protein Interaction Network.",
                    "Automated Hub-Protein Detection via a New Fused Similarity Measure-Based Multi-objective Clustering Framework.",
                    "Improving Identification of Essential Proteins by a Novel Ensemble Method.",
                    "Deep Learning and Random Forest-Based Augmentation of sRNA Expression Profiles.",
                    "Detecting Illicit Drug Ads in Google+ Using Machine Learning.",
                    "A Robustness Analysis of Dynamic Boolean Models of Cellular Circuits.",
                    "Graph Transformations, Semigroups, and Isotopic Labeling.",
                    "Iterative Spaced Seed Hashing: Closing the Gap Between Spaced Seed Hashing and k-mer Hashing.",
                    "DM-SIRT: A Distributed Method for Multi-tilt Reconstruction in Electron Tomography.",
                    "PeakPass: Automating ChIP-Seq Blacklist Creation.",
                    "Maximum Stacking Base Pairs: Hardness and Approximation by Nonlinear LP-Rounding.",
                    "Greedy Partition Distance Under Stochastic Models - Analytic Results."
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "14th ISBRA 2018",
        "info": "Beijing, China",
        "venues": [
            {
                "sub_name_abbr": "conf/isbra/2018",
                "sub_name": "Bioinformatics Research and Applications - 14th International Symposium, ISBRA 2018, Beijing, China, June 8-11, 2018, Proceedings.",
                "count": 33,
                "papers": [
                    "Prediction of Drug Response with a Topology Based Dual-Layer Network Model.",
                    "GRTR: Drug-Disease Association Prediction Based on Graph Regularized Transductive Regression on Heterogeneous Network.",
                    "An Improved Particle Swarm Optimization with Dynamic Scale-Free Network for Detecting Multi-omics Features.",
                    "PBMarsNet: A Multivariate Adaptive Regression Splines Based Method to Reconstruct Gene Regulatory Networks.",
                    "Bounds on Identification of Genome Evolution Pacemakers.",
                    "REXTAL: Regional Extension of Assemblies Using Linked-Reads.",
                    "A Scalable Reference-Free Metagenomic Binning Pipeline.",
                    "The Review of the Major Entropy Methods and Applications in Biomedical Signal Research.",
                    "Inferring Dysregulated Pathways of Driving Cancer Subtypes Through Multi-omics Integration.",
                    "An Extension of Deep Pathway Analysis: A Pathway Route Analysis Framework Incorporating Multi-dimensional Cancer Genomics Data.",
                    "Hierarchical Similarity Network Fusion for Discovering Cancer Subtypes.",
                    "Sprites2: Detection of Deletions Based on an Accurate Alignment Strategy.",
                    "KSIBW: Predicting Kinase-Substrate Interactions Based on Bi-random Walk.",
                    "XPredRBR: Accurate and Fast Prediction of RNA-Binding Residues in Proteins Using eXtreme Gradient Boosting.",
                    "A Biologically Meaningful Extension of the Efficient Method for Deleterious Mutations Prediction in RNAs: Insertions and Deletions in Addition to Substitution Mutations.",
                    "Screening of Sonic Hedgehog (Shh) Inhibitors in the Hedgehog Signaling Pathway from Traditional Chinese Medicine (TCM) Database Through Structure-Based Pharmacophore Design.",
                    "Novel Inhibitors of T315I Mutant BCR-ABL1 Tyrosine Kinase for Chronic Myeloid Leukemia Disease Through Fragment-Based Drug Design.",
                    "On k-Mismatch Shortest Unique Substring Queries Using GPU.",
                    "Memory-Efficient and Stabilizing Management System and Parallel Methods for RELION Using CUDA and MPI.",
                    "GPU Accelerated Ray Tracing for the Beta-Barrel Detection from Three-Dimensional Cryo-EM Maps.",
                    "A Fast Genome Sequence Aligner Based on Minimal Perfect Hash Algorithm Realized with FPGA Based Heterogeneous Computing Platform.",
                    "A Pattern Recognition Tool for Medium-Resolution Cryo-EM Density Maps and Low-Resolution Cryo-ET Density Maps.",
                    "Combining Sequence and Epigenomic Data to Predict Transcription Factor Binding Sites Using Deep Learning.",
                    "A Deep Learning Method for Prediction of Benign Epilepsy with Centrotemporal Spikes.",
                    "LSTM Recurrent Neural Networks for Influenza Trends Prediction.",
                    "Predicting Gene-Disease Associations with Manifold Learning.",
                    "On Approaching the One-Sided Exemplar Adjacency Number Problem.",
                    "Prediction of Type III Secreted Effectors Based on Word Embeddings for Protein Sequences.",
                    "Extending the Evolvability Model to the Prokaryotic World: Simulations and Results on Real Data.",
                    "Predicting Opioid Epidemic by Using Twitter Data.",
                    "Cluster Matching Distance for Rooted Phylogenetic Trees.",
                    "Truncated Robust Principal Component Analysis and Noise Reduction for Single Cell RNA-seq Data.",
                    "Locality Sensitive Imputation for Single-Cell RNA-Seq Data."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "13th ISBRA 2017",
        "info": "Honolulu, HI, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/isbra/2017",
                "sub_name": "Bioinformatics Research and Applications - 13th International Symposium, ISBRA 2017, Honolulu, HI, USA, May 29 - June 2, 2017, Proceedings.",
                "count": 46,
                "papers": [
                    "Prediction of Time to Tumor Recurrence in Ovarian Cancer: Comparison of Three Sparse Regression Methods.",
                    "Histopathological Diagnosis for Viable and Non-viable Tumor Prediction for Osteosarcoma Using Convolutional Neural Network.",
                    "Relating Diseases Based on Disease Module Theory.",
                    "Reconstructing One-Articulated Networks with Distance Matrices.",
                    "Computational Methods for the Prediction of Drug-Target Interactions from Drug Fingerprints and Protein Sequences by Stacked Auto-Encoder Deep Neural Network.",
                    "Analysis of Paired miRNA-mRNA Microarray Expression Data Using a Stepwise Multiple Linear Regression Model.",
                    "IsoTree: De Novo Transcriptome Assembly from RNA-Seq Reads - (Extended Abstract).",
                    "Unfolding the Protein Surface for Pattern Matching.",
                    "Estimation of Rates of Reactions Triggered by Electron Transfer in Top-Down Mass Spectrometry.",
                    "Construction of Protein Backbone Fragments Libraries on Large Protein Sets Using a Randomized Spectral Clustering Algorithm.",
                    "Mapping Paratope and Epitope Residues of Antibody Pembrolizumab via Molecular Dynamics Simulation.",
                    "A New 2-Approximation Algorithm for rSPR Distance.",
                    "An SIMD Algorithm for Wraparound Tandem Alignment.",
                    "PhAT-QTL: A Phase-Aware Test for QTL Detection.",
                    "Unbiased Taxonomic Annotation of Metagenomic Samples.",
                    "Genetic Algorithm Based Beta-Barrel Detection for Medium Resolution Cryo-EM Density Maps.",
                    "Mining K-mers of Various Lengths in Biological Sequences.",
                    "Coestimation of Gene Trees and Reconciliations Under a Duplication-Loss-Coalescence Model.",
                    "A Median Solver and Phylogenetic Inference Based on DCJ Sorting.",
                    "Addressing the Threats of Inference Attacks on Traits and Genotypes from Individual Genomic Data.",
                    "Phylogenetic Tree Reconciliation: Mean Values for Fixed Gene Trees.",
                    "Computer Assisted Segmentation Tool: A Machine Learning Based Image Segmenting Tool for TrakEM2.",
                    "Accelerating Electron Tomography Reconstruction Algorithm ICON Using the Intel Xeon Phi Coprocessor on Tianhe-2 Supercomputer.",
                    "Modeling the Molecular Distance Geometry Problem Using Dihedral Angles.",
                    "What's Hot and What's Not? - Exploring Trends in Bioinformatics Literature Using Topic Modeling and Keyword Analysis.",
                    "Structure Modeling and Molecular Docking Studies of Schizophrenia Candidate Genes, Synapsins 2 (SYN2) and Trace Amino Acid Receptor (TAAR6).",
                    "Accurate Prediction of Haplotype Inference Errors by Feature Extraction.",
                    "Detecting Change Points in fMRI Data via Bayesian Inference and Genetic Algorithm Model.",
                    "Extracting Depression Symptoms from Social Networks and Web Blogs via Text Mining.",
                    "A Probabilistic Approach to Multiple-Instance Learning.",
                    "Net2Image: A Network Representation Method for Identifying Cancer-Related Genes.",
                    "Computational Prediction of Influenza Neuraminidase Inhibitors Using Machine Learning Algorithms and Recursive Feature Elimination Method.",
                    "Differential Privacy Preserving Genomic Data Releasing via Factor Graph.",
                    "In Silico Simulation of Signal Cascades in Biomedical Networks Based on the Production Rule System.",
                    "Using the Precision Medicine Analytical Method to Investigate the Impact of the Aerobic Exercise on the Hypertension for the Middle-Aged Women.",
                    "Understanding Protein-Protein Interface Formation Mechanism in a New Probability Way at Amino Acid Level.",
                    "Detecting Potential Adverse Drug Reactions Using Association Rules and Embedding Models.",
                    "Genome-Wide Analysis of Response Regulator Genes in Solanum lycopersicum.",
                    "A Fully Automatic Geometric Parameters Determining Method for Electron Tomography.",
                    "Evaluating the Impact of Encoding Schemes on Deep Auto-Encoders for DNA Annotation.",
                    "Metabolic Analysis of Metatranscriptomic Data from Planktonic Communities.",
                    "NemoLib: A Java Library for Efficient Network Motif Detection.",
                    "A Genetic Algorithm for Finding Discriminative Functional Motifs in Long Non-coding RNAs.",
                    "Heterogeneous Cancer Cell Line Data Fusion for Identifying Novel Response Determinants in Precision Medicine.",
                    "Agent-Based in Silico Evolution of HCV Quasispecies.",
                    "Modeling the Spread of HIV and HCV Infections Based on Identification and Characterization of High-Risk Communities Using Social Media."
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "12th ISBRA 2016",
        "info": "Minsk, Belarus",
        "venues": [
            {
                "sub_name_abbr": "conf/isbra/2016",
                "sub_name": "Bioinformatics Research and Applications - 12th International Symposium, ISBRA 2016, Minsk, Belarus, June 5-8, 2016, Proceedings.",
                "count": 24,
                "papers": [
                    "An Efficient Algorithm for Finding All Pairs k-Mismatch Maximal Common Substrings.",
                    "Poisson-Markov Mixture Model and Parallel Algorithm for Binning Massive and Heterogenous DNA Sequencing Reads.",
                    "FSG: Fast String Graph Construction for De Novo Assembly of Reads Data.",
                    "OVarCall: Bayesian Mutation Calling Method Utilizing Overlapping Paired-End Reads.",
                    "High-Performance Sensing of DNA Hybridization on Surface of Self-organized MWCNT-Arrays Decorated by Organometallic Complexes.",
                    "Towards a More Accurate Error Model for BioNano Optical Maps.",
                    "HapIso: An Accurate Method for the Haplotype-Specific Isoforms Reconstruction from Long Single-Molecule Reads.",
                    "Genome-Wide Structural Modeling of Protein-Protein Interactions.",
                    "Identifying Essential Proteins by Purifying Protein Interaction Networks.",
                    "Differential Functional Analysis and Change Motifs in Gene Networks to Explore the Role of Anti-sense Transcription.",
                    "Predicting MicroRNA-Disease Associations by Random Walking on Multiple Networks.",
                    "Progression Reconstruction from Unsynchronized Biological Data using Cluster Spanning Trees.",
                    "Consistent Visualization of Multiple Rigid Domain Decompositions of Proteins.",
                    "A Multiagent Ab Initio Protein Structure Prediction Tool for Novices and Experts.",
                    "Filling a Protein Scaffold with a Reference.",
                    "Mean Values of Gene Duplication and Loss Cost Functions.",
                    "The SCJ Small Parsimony Problem for Weighted Gene Adjacencies.",
                    "Path-Difference Median Trees.",
                    "NEMo: An Evolutionary Model with Modularity for PPI Networks.",
                    "Multi-genome Scaffold Co-assembly Based on the Analysis of Gene Orders and Genomic Repeats.",
                    "Selectoscope: A Modern Web-App for Positive Selection Analysis of Genomic Data.",
                    "Methods for Genome-Wide Analysis of MDR and XDR Tuberculosis from Belarus.",
                    "Haplotype Inference for Pedigrees with Few Recombinations.",
                    "Improved Detection of 2D Gel Electrophoresis Spots by Using Gaussian Mixture Model."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "11th ISBRA 2015",
        "info": "Norfolk, VA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/isbra/2015",
                "sub_name": "Bioinformatics Research and Applications - 11th International Symposium, ISBRA 2015, Norfolk, VA, USA, June 7-10, 2015 Proceedings.",
                "count": 34,
                "papers": [
                    "Deriving Protein Backbone Using Traces Extracted from Density Maps at Medium Resolutions.",
                    "Binary Contingency Table Method for Analyzing Gene Mutation in Cancer Genome.",
                    "A Filter-Based Approach for Approximate Circular Pattern Matching.",
                    "Fast Algorithms for Inferring Gene-Species Associations.",
                    "Couplet Supertree Based Species Tree Estimation.",
                    "A Novel Computational Method for Deriving Protein Secondary Structure Topologies Using Cryo-EM Density Maps and Multiple Secondary Structure Predictions.",
                    "Managing Reproducible Computational Experiments with Curated Proteins in KINARI-2.",
                    "Protein Crystallization Screening Using Associative Experimental Design.",
                    "DAM: A Bayesian Method for Detecting Genome-wide Associations on Multiple Diseases.",
                    "MINED: An Efficient Mutual Information Based Epistasis Detection Method to Improve Quantitative Genetic Trait Prediction.",
                    "Domain Adaptation with Logistic Regression for the Task of Splice Site Prediction.",
                    "A Stacking-Based Approach to Identify Translated Upstream Open Reading Frames in Arabidopsis Thaliana.",
                    "PRESS-PLOT: An Online Server for Protein Structural Analysis and Evaluation with Residue-level Virtual Angle Correlation Plots.",
                    "Calcium Ion Fluctuations Alter Channel Gating in a Stochastic Luminal Calcium Release Site Model.",
                    "Interleaving Global and Local Search for Protein Motion Computation.",
                    "On the Complexity of Duplication-Transfer-Loss Reconciliation with Non-binary Gene Trees.",
                    "On the Near-Linear Correlation of the Eigenvalues Across BLOSUM Matrices.",
                    "Predicting RNA Secondary Structures: One-grammar-fits-all Solution.",
                    "An Approach for Matching Mixture MS/MS Spectra with a Pair of Peptide Sequences in a Protein Database.",
                    "Diploid Alignments and Haplotyping.",
                    "Structural Comparative Analysis of Ecto- NTPDase Models from S. Mansoni and H. Sapiens.",
                    "Assessing the Robustness of Parsimonious Predictions for Gene Neighborhoods from Reconciled Phylogenies: Supplementary Material.",
                    "Sorting Signed Circular Permutations by Super Short Reversals.",
                    "Multiple Alignment of Structures Using Center Of ProTeins.",
                    "NRRC: A Non-referential Reads Compression Algorithm.",
                    "New Heuristics for Clustering Large Biological Networks.",
                    "A Novel Algorithm for Glycan de novo Sequencing Using Tandem Mass Spectrometry.",
                    "Community Detection-Based Feature Construction for Protein Sequence Classification.",
                    "Curvilinear Triangular Discretization of Biomedical Images.",
                    "The Role of miRNAs in Cisplatin-Resistant HeLa Cells.",
                    "DNA AS X: An Information-Coding-Based Model to Improve the Sensitivity in Comparative Gene Analysis.",
                    "A Distance-Based Method for Inferring Phylogenetic Networks in the Presence of Incomplete Lineage Sorting.",
                    "Predicting Protein Functions Based on Dynamic Protein Interaction Networks.",
                    "An Iterative Approach for Phylogenetic Analysis of Tumor Progression Using FISH Copy Number."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "10th ISBRA 2014",
        "info": "Zhangjiajie, China",
        "venues": [
            {
                "sub_name_abbr": "conf/isbra/2014",
                "sub_name": "Bioinformatics Research and Applications - 10th International Symposium, ISBRA 2014, Zhangjiajie, China, June 28-30, 2014. Proceedings.",
                "count": 32,
                "papers": [
                    "Predicting Disease Risks Using Feature Selection Based on Random Forest and Support Vector Machine.",
                    "Phylogenetic Bias in the Likelihood Method Caused by Missing Data Coupled with Among-Site Rate Variation: An Analytical Approach.",
                    "An Eigendecomposition Method for Protein Structure Alignment.",
                    "Functional Interplay between Hemagglutinin and Neuraminidase of Pandemic 2009 H1N1 from the Perspective of Virus Evolution.",
                    "Predicting Protein Submitochondrial Locations Using a K-Nearest Neighbors Method Based on the Bit-Score Weighted Euclidean Distance.",
                    "Algorithms Implemented for Cancer Gene Searching and Classifications.",
                    "Dysregulated microRNA Profile in HeLa Cell Lines Induced by Lupeol.",
                    "A Simulation for Proportional Biological Operational Mu-Circuit.",
                    "Computational Prediction of Human Saliva-Secreted Proteins.",
                    "A Parallel Scheme for Three-Dimensional Reconstruction in Large-Field Electron Tomography.",
                    "An Improved Correlation Method Based on Rotation Invariant Feature for Automatic Particle Selection.",
                    "An Effective Algorithm for Peptide de novo Sequencing from Mixture MS/MS Spectra.",
                    "Identifying Spurious Interactions in the Protein-Protein Interaction Networks Using Local Similarity Preserving Embedding.",
                    "Multiple RNA Interaction with Sub-optimal Solutions.",
                    "Application of Consensus String Matching in the Diagnosis of Allelic Heterogeneity - (Extended Abstract).",
                    "Continuous Time Bayesian Networks for Gene Network Reconstruction: A Comparative Study on Time Course Data.",
                    "Drug Target Identification Based on Structural Output Controllability of Complex Networks.",
                    "NovoGMET: De Novo Peptide Sequencing Using Graphs with Multiple Edge Types (GMET) for ETD/ECD Spectra.",
                    "Duplication Cost Diameters.",
                    "Computational Identification of De-Centric Genetic Regulatory Relationships from Functional Genomic Data.",
                    "Classification of Mutations by Functional Impact Type: Gain of Function, Loss of Function, and Switch of Function.",
                    "Network Analysis of Human Disease Comorbidity Patterns Based on Large-Scale Data Mining.",
                    "Identification of Essential Proteins by Using Complexes and Interaction Network.",
                    "GenoScan: Genomic Scanner for Putative miRNA Precursors.",
                    "Searching SNP Combinations Related to Evolutionary Information of Human Populations on HapMap Data.",
                    "2D Pharmacophore Query Generation.",
                    "Structure-Based Analysis of Protein Binding Pockets Using Von Neumann Entropy.",
                    "A New Mathematical Model for Inbreeding Depression in Large Populations.",
                    "dSpliceType: A Multivariate Model for Detecting Various Types of Differential Splicing Events Using RNA-Seq.",
                    "Conformational Transitions and Principal Geodesic Analysis on the Positive Semidefinite Matrix Manifold.",
                    "Joint Analysis of Functional and Phylogenetic Composition for Human Microbiome Data.",
                    "schematikon: Detailed Sequence-Structure Relationships from Mining a Non-redundant Protein Structure Database - (Extended Abstract)."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "9th ISBRA 2013",
        "info": "Charlotte, NC, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/isbra/2013",
                "sub_name": "Bioinformatics Research and Applications, 9th International Symposium, ISBRA 2013, Charlotte, NC, USA, May 20-22, 2013. Proceedings.",
                "count": 29,
                "papers": [
                    "Peptide Identification from Mass Spectrometry.",
                    "Identifying Critical Transitions of Biological Processes by Dynamical Network Biomarkers.",
                    "Computational Behavioral Ecology.",
                    "Unusual RNA Structures: Information Content in RNAs from the \"Prebiotic Ribosome\" to Modern Viruses.",
                    "The Radiation Hybrid Map Construction Problem Is FPT.",
                    "Reconstructing Ancestral Genomic Orders Using Binary Encoding and Probabilistic Models.",
                    "Computational Methods for the Parallel 3D Simulation of Biochemical Kinetics at the Microscopic Scale.",
                    "A Tool for Non-binary Tree Reconciliation.",
                    "Patterns of Chromatin-Modifications Discriminate Different Genomic Features in Arabidopsis.",
                    "Inferring Time-Delayed Gene Regulatory Networks Using Cross-Correlation and Sparse Regression.",
                    "A Simulation of Synthetic agr System in E.coli.",
                    "Gene Regulatory Networks from Gene Ontology.",
                    "Partitioning Biological Networks into Highly Connected Clusters with Maximum Edge Coverage.",
                    "Reconstructing k-Reticulated Phylogenetic Network from a Set of Gene Trees.",
                    "LCR_Finder: A de Novo Low Copy Repeat Finder for Human Genome.",
                    "Heuristic Algorithms for the Protein Model Assignment Problem.",
                    "Alignment of DNA Mass-Spectral Profiles Using Network Flows.",
                    "A Context-Driven Gene Prioritization Method for Web-Based Functional Genomics.",
                    "Exploiting Dependencies of Patterns in Gene Expression Analysis Using Pairwise Comparisons.",
                    "Cloud Computing for De Novo Metagenomic Sequence Assembly.",
                    "Protein Closed Loop Prediction from Contact Probabilities.",
                    "A Graph Approach to Bridge the Gaps in Volumetric Electron Cryo-microscopy Skeletons.",
                    "Measure the Semantic Similarity of GO Terms Using Aggregate Information Content.",
                    "Scalable and Versatile k-mer Indexing for High-Throughput Sequencing Data.",
                    "POMAGO: Multiple Genome-Wide Alignment Tool for Bacteria.",
                    "Effect of Incomplete Lineage Sorting on Tree-Reconciliation-Based Inference of Gene Duplication.",
                    "Ellipsoid-Weighted Protein Conformation Alignment.",
                    "Construction of Uncertain Protein-Protein Interaction Networks and Its Applications.",
                    "Does Accurate Scoring of Ligands against Protein Targets Mean Accurate Ranking?"
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "8th ISBRA 2012",
        "info": "Dallas, TX, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/isbra/2012",
                "sub_name": "Bioinformatics Research and Applications - 8th International Symposium, ISBRA 2012, Dallas, TX, USA, May 21-23, 2012. Proceedings.",
                "count": 31,
                "papers": [
                    "Trie-based Apriori Motif Discovery Approach.",
                    "Inapproximability of (1, 2)-Exemplar Distance.",
                    "A Mixed Integer Programming Model for the Parsimonious Loss of Heterozygosity Problem.",
                    "Reconstruction of Transcription Regulatory Networks by Stability-Based Network Component Analysis.",
                    "A Transcript Perspective on Evolution.",
                    "A Fast Algorithm for Computing the Quartet Distance for Large Sets of Evolutionary Trees.",
                    "Error Propagation in Sparse Linear Systems with Peptide-Protein Incidence Matrices.",
                    "Models and Algorithmic Tools for Computational Processes in Cellular Biology: Recent Developments and Future Directions - (Invited Keynote Talk).",
                    "Identifying Rogue Taxa through Reduced Consensus: NP-Hardness and Exact Algorithms.",
                    "Analytics Approaches for the Era of 10, 000* Genomes *and Counting.",
                    "GTP Supertrees from Unrooted Gene Trees: Linear Time Algorithms for NNI Based Local Searches.",
                    "A Robinson-Foulds Measure to Compare Unrooted Trees with Rooted Trees.",
                    "P-Binder: A System for the Protein-Protein Binding Sites Identification.",
                    "Non-identifiable Pedigrees and a Bayesian Solution.",
                    "Iterative Piecewise Linear Regression to Accurately Assess Statistical Significance in Batch Confounded Differential Expression Analysis.",
                    "Reconstruction of Network Evolutionary History from Extant Network Topology and Duplication History.",
                    "POPE: Pipeline of Parentally-Biased Expression.",
                    "On Optimizing the Non-metric Similarity Search in Tandem Mass Spectra by Clustering.",
                    "On the Comparison of Sets of Alternative Transcripts.",
                    "MURPAR: A Fast Heuristic for Inferring Parsimonious Phylogenetic Networks from Multiple Gene Trees.",
                    "Large Scale Ranking and Repositioning of Drugs with Respect to DrugBank Therapeutic Categories.",
                    "Score Based Aggregation of microRNA Target Orderings.",
                    "Modeling Complex Diseases Using Discriminative Network Fragments - (Invited Keynote Talk).",
                    "Novel Multi-sample Scheme for Inferring Phylogenetic Markers from Whole Genome Tumor Profiles.",
                    "Algorithms for Knowledge-Enhanced Supertrees.",
                    "Improvement of BLASTp on the FPGA-Based High-Performance Computer RIVYERA.",
                    "A Polynomial Time Solution for Protein Chain Pair Simplification under the Discrete Fréchet Distance.",
                    "Designing RNA Secondary Structures in Coding Regions.",
                    "Phylogenetic Tree Reconstruction with Protein Linkage.",
                    "Protein Structure Prediction and Clustering Using MUFOLD.",
                    "Computational Modeling of Mammalian Promoters - (Invited Keynote Talk)."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "7th ISBRA 2011",
        "info": "Changsha, China",
        "venues": [
            {
                "sub_name_abbr": "conf/isbra/2011",
                "sub_name": "Bioinformatics Research and Applications - 7th International Symposium, ISBRA 2011, Changsha, China, May 27-29, 2011. Proceedings.",
                "count": 41,
                "papers": [
                    "Phylogenetics of Heterogeneous Samples - (Keynote Talk).",
                    "OMG! Orthologs for Multiple Genomes - Competing Formulations - (Keynote Talk).",
                    "Phylogenetic Analysis of Whole Genomes - (Keynote Talk).",
                    "Genetic and Pharmacogenetic Studies of Neuropsychiatric Disorders: Increasingly Critical Roles of Bioinformatics Research and Applications - (Keynote Talk).",
                    "Genome-Phenome Association Analysis of Complex Diseases a Structured Sparse Regression Approach - (Keynote Talk).",
                    "Prediction of Essential Proteins by Integration of PPI Network Topology and Protein Complexes Information.",
                    "Computing the Protein Binding Sites.",
                    "SETTER - RNA SEcondary sTructure-based TERtiary Structure Similarity Algorithm.",
                    "Prediction of Essential Genes by Mining Gene Ontology Semantics.",
                    "High-Performance Blob-Based Iterative Reconstruction of Electron Tomography on Multi-GPUs.",
                    "Component-Based Matching for Multiple Interacting RNA Sequences.",
                    "A New Method for Identifying Essential Proteins Based on Edge Clustering Coefficient.",
                    "Gene Order in Rosid Phylogeny, Inferred from Pairwise Syntenies among Extant Genomes.",
                    "Algorithms to Detect Multiprotein Modularity Conserved during Evolution.",
                    "The Kernel of Maximum Agreement Subtrees.",
                    "A Consensus Approach to Predicting Protein Contact Map via Logistic Regression.",
                    "A Linear Time Algorithm for Error-Corrected Reconciliation of Unrooted Gene Trees.",
                    "Comprehensive Pharmacogenomic Pathway Screening by Data Assimilation.",
                    "The Deep Coalescence Consensus Tree Problem is Pareto on Clusters.",
                    "Fast Local Search for Unrooted Robinson-Foulds Supertrees.",
                    "A Metric for Phylogenetic Trees Based on Matching.",
                    "Describing the Orthology Signal in a PPI Network at a Functional, Complex Level.",
                    "Algorithms for Rapid Error Correction for the Gene Duplication Problem.",
                    "TransDomain: A Transitive Domain-Based Method in Protein-Protein Interaction Prediction.",
                    "Rapid and Accurate Generation of Peptide Sequence Tags with a Graph Search Approach.",
                    "In Silico Evolution of Multi-scale Microbial Systems in the Presence of Mobile Genetic Elements and Horizontal Gene Transfer.",
                    "Comparative Evaluation of Set-Level Techniques in Microarray Classification.",
                    "Gene Network Modules-Based Liner Discriminant Analysis of Microarray Gene Expression Data.",
                    "A Polynomial Algebra Method for Computing Exemplar Breakpoint Distance.",
                    "The Maximum Clique Enumeration Problem: Algorithms, Applications and Implementations.",
                    "Query-Adaptive Ranking with Support Vector Machines for Protein Homology Prediction.",
                    "A Novel Core-Attachment Based Greedy Search Method for Mining Functional Modules in Protein Interaction Networks.",
                    "ProPhyC: A Probabilistic Phylogenetic Model for Refining Regulatory Networks.",
                    "Prediction of DNA-Binding Propensity of Proteins by the Ball-Histogram Method.",
                    "Multi-label Correlated Semi-supervised Learning for Protein Function Prediction.",
                    "Regene: Automatic Construction of a Multiple Component Dirichlet Mixture Priors Covariance Model to Identify Non-coding RNA.",
                    "Accurate Estimation of Gene Expression Levels from DGE Sequencing Data.",
                    "An Integrative Approach for Genomic Island Prediction in Prokaryotic Genomes.",
                    "A Systematic Comparison of Genome Scale Clustering Algorithms - (Extended Abstract).",
                    "Mining Biological Interaction Networks Using Weighted Quasi-Bicliques.",
                    "Towards a Characterisation of the Generalised Cladistic Character Compatibility Problem for Non-branching Character Trees."
                ]
            }
        ]
    },
    {
        "year": "2010",
        "name": "6th ISBRA 2010",
        "info": "Storrs, CT, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/isbra/2010",
                "sub_name": "Bioinformatics Research and Applications, 6th International Symposium, ISBRA 2010, Storrs, CT, USA, May 23-26, 2010. Proceedings.",
                "count": 26,
                "papers": [
                    "Tracing the Early Cell Divisions of Mouse Embryos by Single Cell RNA-Seq.",
                    "Successes and Failures of Elegant Algorithms in Computational Biology.",
                    "Modeling without Borders: Creating and Annotating VCell Models Using the Web.",
                    "Touring Protein Space with Matt.",
                    "Fixed-Parameter Algorithm for General Pedigrees with a Single Pair of Sites.",
                    "Analysis of Temporal-spatial Co-variation within Gene Expression Microarray Data in an Organogenesis Model.",
                    "Human Genome Annotation.",
                    "Extensions and Improvements to the Chordal Graph Approach to the Multi-state Perfect Phylogeny Problem.",
                    "Analysis of Gene Interactions Using Restricted Boolean Networks and Time-Series Data.",
                    "Residue Contexts: Non-sequential Protein Structure Alignment Using Structural and Biochemical Features.",
                    "Essential Proteins Discovery from Weighted Protein Interaction Networks.",
                    "Identifying Differentially Abundant Metabolic Pathways in Metagenomic Datasets.",
                    "A Novel Approach for Compressing Phylogenetic Trees.",
                    "Structure of Proximal and Distant Regulatory Elements in the Human Genome.",
                    "Combinatorics in Recombinational Population Genomics.",
                    "Uncovering Hidden Phylogenetic Consensus.",
                    "An Agglomerate Algorithm for Mining Overlapping and Hierarchical Functional Modules in Protein Interaction Networks.",
                    "Fast Protein Structure Alignment.",
                    "Predicting and Analyzing Cellular Networks.",
                    "A Consensus Tree Approach for Reconstructing Human Evolutionary History and Detecting Population Substructure.",
                    "Inferring Evolutionary Scenarios for Protein Domain Compositions.",
                    "Local Structural Alignment of RNA with Affine Gap Model.",
                    "Fast Computation of the Exact Hybridization Number of Two Phylogenetic Trees.",
                    "\"Master-Slave\" Biological Network Alignment.",
                    "Deciphering Transcription Factor Binding Patterns from Genome-Wide High Density ChIP-chip Tiling Array Data.",
                    "The Expected Fitness Cost of a Mutation Fixation under the One-Dimensional Fisher Model."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "5th ISBRA 2009",
        "info": "Fort Lauderdale, FL, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/isbra/2009",
                "sub_name": "Bioinformatics Research and Applications, 5th International Symposium, ISBRA 2009, Fort Lauderdale, FL, USA, May 13-16, 2009, Proceedings.",
                "count": 31,
                "papers": [
                    "Evolution of Regulatory Systems in Bacteria (Invited Keynote Talk).",
                    "Integrating Multiple-Platform Expression Data through Gene Set Features.",
                    "Practical Quality Assessment of Microarray Data by Simulation of Differential Gene Expression.",
                    "Mean Square Residue Biclustering with Missing Data and Row Inversions.",
                    "Using Gene Expression Modeling to Determine Biological Relevance of Putative Regulatory Networks.",
                    "Querying Protein-Protein Interaction Networks.",
                    "Integrative Approach for Combining TNFa-NFkB Mathematical Model to a Protein Interaction Connectivity Map.",
                    "Hierarchical Organization of Functional Modules in Weighted Protein Interaction Networks Using Clustering Coefficient.",
                    "Bioinformatics Challenges in Translational Research.",
                    "Untangling Tanglegrams: Comparing Trees by Their Drawings.",
                    "An Experimental Analysis of Consensus Tree Algorithms for Large-Scale Tree Collections.",
                    "Counting Faces in Split Networks.",
                    "Relationship between Amino Acids Sequences and Protein Structures: Folding Patterns and Sequence Patterns.",
                    "Improved Algorithms for Parsing ESLTAGs: A Grammatical Model Suitable for RNA Pseudoknots.",
                    "Efficient Algorithms for Self Assembling Triangular and Other Nano Structures.",
                    "Motif Construction from High-Throughput SELEX Data.",
                    "Rearrangement Phylogeny of Genomes in Contig Form.",
                    "Prediction of Contiguous Regions in the Amniote Ancestral Genome.",
                    "Pure Parsimony Xor Haplotyping.",
                    "A Decomposition of the Pure Parsimony Haplotyping Problem.",
                    "Exact Computation of Coalescent Likelihood under the Infinite Sites Model.",
                    "Imputation-Based Local Ancestry Inference in Admixed Populations.",
                    "Interpreting Population Sequencing Data.",
                    "Modeling and Visualizing Heterogeneity of Spatial Patterns of Protein-DNA Interaction from High-Density Chromatin Precipitation Mapping Data.",
                    "A Linear-Time Algorithm for Analyzing Array CGH Data Using Log Ratio Triangulation.",
                    "Mining of cis-Regulatory Motifs Associated with Tissue-Specific Alternative Splicing.",
                    "Analysis of Cis-Regulatory Motifs in Cassette Exons by Incorporating Exon Skipping Rates.",
                    "A Class of Evolution-Based Kernels for Protein Homology Analysis: A Generalization of the PAM Model.",
                    "Irreplaceable Amino Acids and Reduced Alphabets in Short-Term and Directed Protein Evolution.",
                    "A One-Class Classification Approach for Protein Sequences and Structures.",
                    "Prediction and Classification of Real and Pseudo MicroRNA Precursors via Data Fuzzification and Fuzzy Decision Trees."
                ]
            }
        ]
    },
    {
        "year": "2008",
        "name": "4th ISBRA 2008",
        "info": "Atlanta, GA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/isbra/2008",
                "sub_name": "Bioinformatics Research and Applications, Fourth International Symposium, ISBRA 2008, Atlanta, GA, USA, May 6-9, 2008. Proceedings.",
                "count": 47,
                "papers": [
                    "Invited Keynote Talk: Set-Level Analyses for Genome-Wide Association Data.",
                    "Hierarchical Clustering Using Constraints.",
                    "The Gene-Duplication Problem: Near-Linear Time Algorithms for NNI Based Local Searches.",
                    "A Distance-Based Method for Detecting Horizontal Gene Transfer in Whole Genomes.",
                    "An Approach for Determining Evolutionary Distance in Network-Based Phylogenetic Analysis.",
                    "Pairwise Statistical Significance Versus Database Statistical Significance for Local Alignment of Protein Sequences.",
                    "Estimating Pairwise Statistical Significance of Protein Local Alignments Using a Clustering-Classification Approach Based on Amino Acid Composition.",
                    "Gapped Extension for Local Multiple Alignment of Interspersed DNA Repeats.",
                    "Improved Alignment of Protein Sequences Based on Common Parts.",
                    "Invited Keynote Talk: Computing P-Values for Peptide Identifications in Mass Spectrometry.",
                    "PFP: A Computational Framework for Phylogenetic Footprinting in Prokaryotic Genomes.",
                    "Accelerating the Neighbor-Joining Algorithm Using the Adaptive Bucket Data Structure.",
                    "Generalized Gene Adjacencies, Graph Bandwidth and Clusters in Yeast Evolution.",
                    "Physicochemical Correlation between Amino Acid Sites in Short Sequences under Selective Pressure.",
                    "HCV Quasispecies Assembly Using Network Flows.",
                    "A Dynamic Programming Algorithm for De Novo Peptide Sequencing with Variable Scoring.",
                    "Invited Keynote Talk: Haplotype Sharing for Genome-Wide Case-Control Association Studies.",
                    "Incorporating Literature Knowledge in Bayesian Network for Inferring Gene Networks with Gene Expression Data.",
                    "Integrative Network Component Analysis for Regulatory Network Reconstruction.",
                    "A Graph-Theoretic Method for Mining Overlapping Functional Modules in Protein Interaction Networks.",
                    "Identification of Transcription Factor Binding Sites in Promoter Regions by Modularity Analysis of the Motif Co-occurrence Graph.",
                    "Mean Squared Residue Based Biclustering Algorithms.",
                    "Sparse Decomposition of Gene Expression Data to Infer Transcriptional Modules Guided by Motif Information.",
                    "A Novel Metric for Redundant Gene Elimination Based on Discriminative Contribution.",
                    "Network-Based Inference of Cancer Progression from Microarray Data.",
                    "Invited Keynote Talk: Quiet Revolution: Connectivity in the Cancer Research Community.",
                    "Wavelet-Based 3-D Multifractal Spectrum with Applications in Breast MRI Images.",
                    "Accurate Inverse Consistent Non-rigid Image Registration and Its Application on Automatic Re-contouring.",
                    "GlycoBrowser: A Tool for Contextual Visualization of Biological Data and Pathways Using Ontologies.",
                    "Pattern Matching in RNA Structures.",
                    "The Use of a Conformational Alphabet for Fast Alignment of Protein Structures.",
                    "On-the-Fly Rotamer Pair Energy Evaluation in Protein Design.",
                    "Invited Keynote Talk: Integrative Viral Molecular Epidemiology: Hepatitis C Virus Modeling.",
                    "Multiple Kernel Support Vector Regression for siRNA Efficacy Prediction.",
                    "Hierarchical Clustering Support Vector Machines for Classifying Type-2 Diabetes Patients.",
                    "Computational Mutagenesis of E. coliLacRepressor: Insight into Structure-Function Relationships and Accurate Prediction of Mutant Activity.",
                    "Evaluating Genetic Algorithms in Protein-Ligand Docking.",
                    "A Hidden Markov Model Approach for Prediction of Genomic Alterations from Gene Expression Profiling.",
                    "Evolutionary Algorithm for Feature Subset Selection in Predicting Tumor Outcomes Using Microarray Data.",
                    "Incorporating Knowledge of Topology Improves Reconstruction of Interaction Networks from Microarray Data.",
                    "Invited Keynote Talk: Data Mining and Statistical Methods for Analyzing Microarray Experiments.",
                    "Seven Variations of an Alignment Workflow - An Illustration of Agile Process Design and Management in Bio-jETI.",
                    "Supporting Computational Systems Science: Genomic Analysis Tool Federations Using Aspects and AOP.",
                    "BioDQ: Data Quality Estimation and Management for Genomics Databases.",
                    "Stepped Linear Regression to Accurately Assess Statistical Significance in Batch Confounded Differential Expression Analysis.",
                    "Bagging Multiple Comparisons from Microarray Data.",
                    "Human Blood-Brain Differential Gene-Expression Correlates with Dipeptide Frequency of Gene Products."
                ]
            }
        ]
    },
    {
        "year": "2007",
        "name": "3rd ISBRA 2007",
        "info": "Atlanta, GA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/isbra/2007",
                "sub_name": "Bioinformatics Research and Applications, Third International Symposium, ISBRA 2007, Atlanta, GA, USA, May 7-10, 2007, Proceedings.",
                "count": 58,
                "papers": [
                    "GFBA: A Biclustering Algorithm for Discovering Value-Coherent Biclusters.",
                    "Significance Analysis of Time-Course Gene Expression Profiles.",
                    "Data-Driven Smoothness Enhanced Variance Ratio Test to Unearth Responsive Genes in 0-Time Normalized Time-Course Microarray Data.",
                    "Efficiently Finding the Most Parsimonious Phylogenetic Tree Via Linear Programming.",
                    "A Multi-Stack Based Phylogenetic Tree Building Method.",
                    "A New Linear-Time Heuristic Algorithm for Computing the Parsimony Score of Phylogenetic Networks: Theoretical Bounds and Empirical Performance.",
                    "A Bootstrap Correspondence Analysis for Factorial Microarray Experiments with Replications.",
                    "Clustering Algorithms Optimizer: A Framework for Large Datasets.",
                    "Ranking Function Based on Higher Order Statistics (RF-HOS) for Two-Sample Microarray Experiments.",
                    "Searching for Recombinant Donors in a Phylogenetic Network of Serial Samples.",
                    "Algorithm for Haplotype Inferring Via Galled-Tree Networks with Simple Galls.",
                    "Estimating Bacterial Diversity from Environmental DNA: A Maximum Likelihood Approach.",
                    "Invited Talk: Modern Homology Search.",
                    "Statistical Absolute Evaluation of Gene Ontology Terms with Gene Expression Data.",
                    "Discovering Relations Among GO-Annotated Clusters by Graph Kernel Methods.",
                    "An Empirical Comparison of Dimensionality Reduction Methods for Classifying Gene and Protein Expression Datasets.",
                    "NEURONgrid: A Toolkit for Generating Parameter-Space Maps Using NEURON in a Grid Environment.",
                    "An Adaptive Resolution Tree Visualization of Large Influenza Virus Sequence Datasets.",
                    "Wavelet Image Interpolation (WII): A Wavelet-Based Approach to Enhancement of Digital Mammography Images.",
                    "High Level Programming Environment System for Protein Structure Data.",
                    "Finding Minimal Sets of Informative Genes in Microarray Data.",
                    "Noise-Based Feature Perturbation as a Selection Method for Microarray Data.",
                    "Efficient Generation of Biologically Relevant Enriched Gene Sets.",
                    "Space and Time Efficient Algorithms to Discover Endogenous RNAi Patterns in Complete Genome Data.",
                    "A Fast Approximate Covariance-Model-Based Database Search Method for Non-coding RNA.",
                    "Extensions of Naive Bayes and Their Applications to Bioinformatics.",
                    "The Solution Space of Sorting by Reversals.",
                    "A Fast and Exact Algorithm for the Perfect Reversal Median Problem.",
                    "Genomic Signatures from DNA Word Graphs.",
                    "Enhancing Motif Refinement by Incorporating Comparative Genomics Data.",
                    "Mining Discriminative Distance Context of Transcription Factor Binding Sites on ChIP Enriched Regions.",
                    "Enhanced Prediction of Cleavage in Bovine Precursor Sequences.",
                    "Invited Talk: A Computational Study of Bidirectional Promoters in the Human Genome.",
                    "The Identification of Antisense Gene Pairs Through Available Software.",
                    "Inferring Weak Adaptations and Selection Biases in Proteins from Composition and Substitution Matrices.",
                    "Markov Model Variants for Appraisal of Coding Potential in Plant DNA.",
                    "Predicting Palmitoylation Sites Using a Regularised Bio-basis Function Neural Network.",
                    "A Novel Kernel-Based Approach for Predicting Binding Peptides for HLA Class II Molecules.",
                    "A Database for Prediction of Unique Peptide Motifs as Linear Epitopes.",
                    "A Novel Greedy Algorithm for the Minimum Common String Partition Problem.",
                    "An Efficient Algorithm for Finding Gene-Specific Probes for DNA Microarrays.",
                    "Multiple Sequence Local Alignment Using Monte Carlo EM Algorithm.",
                    "Cancer Class Discovery Using Non-negative Matrix Factorization Based on Alternating Non-negativity-Constrained Least Squares.",
                    "A Support Vector Machine Ensemble for Cancer Classification Using Gene Expression Data.",
                    "Combining SVM Classifiers Using Genetic Fuzzy Systems Based on AUC for Gene Expression Data Analysis.",
                    "A BP-SCFG Based Approach for RNA Secondary Structure Prediction with Consecutive Bases Dependency and Their Relative Positions Information.",
                    "Delta: A Toolset for the Structural Analysis of Biological Sequences on a 3D Triangular Lattice.",
                    "Statistical Estimate for the Size of the Protein Structural Vocabulary.",
                    "Coclustering Based Parcellation of Human Brain Cortex Using Diffusion Tensor MRI.",
                    "An Algorithm for Hierarchical Classification of Genes of Prokaryotic Genomes.",
                    "Using Multi Level Nearest Neighbor Classifiers for G-Protein Coupled Receptor Sub-families Prediction.",
                    "Invited Talk: Ab Initio Gene Finding Engines: What Is Under the Hood.",
                    "Reconstruction of 3D Structures from Protein Contact Maps.",
                    "A Feature Selection Algorithm Based on Graph Theory and Random Forests for Protein Secondary Structure Prediction.",
                    "DNA Sites Buried in Nucleosome Become Accessible at Room Temperature: A Discrete-Event-Simulation Based Modeling Approach.",
                    "Comparative Analysis of Gene-Coexpression Networks Across Species.",
                    "Comparative Pathway Prediction Via Unified Graph Modeling of Genomic Structure Information.",
                    "Extending the Calculus of Looping Sequences to Model Protein Interaction at the Domain Level."
                ]
            }
        ]
    }
]