[
    {
        "name": "JCST",
        "year": "2022",
        "info": "Volume 37: 2022",
        "count": 14,
        "papers": [
            "Preface.",
            "Event-Based Semantics of UML 2.X Concurrent Sequence Diagrams for Formal Verification.",
            "DeltaFuzz: Historical Version Information Guided Fuzz Testing.",
            "TOAST: Automated Testing of Object Transformers in Dynamic Software Updates.",
            "Characterizing and Detecting Gas-Inefficient Patterns in Smart Contracts.",
            "Simulation Might Change Your Results: A Comparison of Context-Aware System Input Validation in Simulated and Physical Environments.",
            "Meaningful Update and Repair of Markov Decision Processes for Self-Adaptive Systems.",
            "Checking Causal Consistency of MongoDB.",
            "GridDroid - An Effective and Efficient Approach for Android Repackaging Detection Based on Runtime Graphical User Interface.",
            "Community Smell Occurrence Prediction on Multi-Granularity by Developer-Oriented Features and Process Metrics.",
            "MacroTrend: A Write-Efficient Cache Algorithm for NVM-Based Read Cache.",
            "Correlated Differential Privacy of Multiparty Data Release in Machine Learning.",
            "On the Discrete-Time Dynamics of Cross-Coupled Hebbian Algorithm.",
            "A Blockchain-Based Protocol for Malicious Price Discrimination."
        ]
    },
    {
        "name": "JCST",
        "year": "2021",
        "info": "Volume 36: 2021",
        "count": 95,
        "papers": [
            "Preface.",
            "A Survey of Non-Volatile Main Memory Technologies: State-of-the-Arts, Practices, and Future Directions.",
            "Performance Evaluation of Memory-Centric ARMv8 Many-Core Architectures: A Case Study with Phytium 2000+.",
            "A GPU-Accelerated In-Memory Metadata Management Scheme for Large-Scale Parallel File Systems.",
            "PIM-Align: A Processing-in-Memory Architecture for FM-Index Search Algorithm.",
            "A Study on Modeling and Optimization of Memory Systems.",
            "Unimem: Runtime Data Management on Non-Volatile Memory-Based Heterogeneous Main Memory for High Performance Computing.",
            "Usage Scenarios for Byte-Addressable Persistent Memory in High-Performance and Data Intensive Computing.",
            "Towards Efficient Short-Range Pair Interaction on Sunway Many-Core Architecture.",
            "Revisiting Persistent Indexing Structures on Intel Optane DC Persistent Memory.",
            "Unraveling Iterative Control Structures from Business Processes.",
            "Detecting Duplicate Contributions in Pull-Based Model Combining Textual and Change Similarities.",
            "Language Adaptation for Entity Relation Classification via Adversarial Neural Networks.",
            "Universal and General Quantum Simultaneous Secret Distribution with Dense Coding by Using One-Dimensional High-Level Cluster States.",
            "Preface.",
            "DeepHBSP: A Deep Learning Framework for Predicting Human Blood-Secretory Proteins Using Transfer Learning.",
            "Effective Identification and Annotation of Fungal Genomes.",
            "Synthetic Lethal Interactions Prediction Based on Multiple Similarity Measures Fusion.",
            "Logistic Weighted Profile-Based Bi-Random Walk for Exploring MiRNA-Disease Associations.",
            "Predicting CircRNA-Disease Associations Based on Improved Weighted Biased Meta-Structure.",
            "GAEBic: A Novel Biclustering Analysis Method for miRNA-Targeted Gene Data Based on Graph Autoencoder.",
            "Collaborative Matrix Factorization with Soft Regularization for Drug-Target Interaction Prediction.",
            "Seg-CapNet: A Capsule-Based Neural Network for the Segmentation of Left Ventricle from Cardiac Magnetic Resonance Imaging.",
            "Robust Needle Localization and Enhancement Algorithm for Ultrasound by Deep Learning and Beam Steering Methods.",
            "CytoBrain: Cervical Cancer Screening System Based on Deep Learning Technology.",
            "An Efficient WRF Framework for Discovering Risk Genes and Abnormal Brain Regions in Parkinson's Disease Based on Imaging Genetics Data.",
            "Serendipity in Recommender Systems: A Systematic Literature Review.",
            "SymPas: Symbolic Program Slicing.",
            "A Secure IoT Firmware Update Scheme Against SCPA and DoS Attacks.",
            "A Real-Time Multi-Stage Architecture for Pose Estimation of Zebrafish Head with Convolutional Neural Networks.",
            "An Effective Discrete Artificial Bee Colony Based SPARQL Query Path Optimization by Reordering Triples.",
            "Preface.",
            "A Character Flow Framework for Multi-Oriented Scene Text Detection.",
            "Multi-Feature Super-Resolution Network for Cloth Wrinkle Synthesis.",
            "ReLoc: Indoor Visual Localization with Hierarchical Sitemap and View Synthesis.",
            "Is It Easy to Recognize Baby's Age and Gender?",
            "A Revisit of Shape Editing Techniques: From the Geometric to the Neural Viewpoint.",
            "3D Object Tracking with Adaptively Weighted Local Bundles.",
            "CNLPA-MVS: Coarse-Hypotheses Guided Non-Local PatchMatch Multi-View Stereo.",
            "Preface.",
            "Partial Label Learning via Conditional-Label-Aware Disambiguation.",
            "Source-Free Unsupervised Domain Adaptation with Sample Transport Learning.",
            "Multi-Scale Deep Cascade Bi-Forest for Electrocardiogram Biometric Recognition.",
            "A Survey of Text Summarization Approaches Based on Deep Learning.",
            "Personal Information Self-Management: A Survey of Technologies Supporting Administrative Services.",
            "SE-Chain: A Scalable Storage and Efficient Retrieval Model for Blockchain.",
            "Inverse Markov Process Based Constrained Dynamic Graph Layout.",
            "Preface.",
            "COLIN: A Cache-Conscious Dynamic Learned Index with High Read/Write Performance.",
            "WATuning: A Workload-Aware Tuning System with Attention-Based Deep Reinforcement Learning.",
            "Cardinality Estimator: Processing SQL with a Vertical Scanning Convolutional Neural Network.",
            "TransGPerf: Exploiting Transfer Learning for Modeling Distributed Graph Computation Performance.",
            "Efficient Model Store and Reuse in an OLML Database System.",
            "Impacts of Dirty Data on Classification and Clustering Models: An Experimental Evaluation.",
            "Mixed Hierarchical Networks for Deep Entity Matching.",
            "Using Markov Chain Based Estimation of Distribution Algorithm for Model-Based Safety Analysis of Graph Transformation.",
            "An Empirical Comparison Between Tutorials and Crowd Documentation of Application Programming Interface.",
            "Order-Revealing Encryption: File-Injection Attack and Forward Security.",
            "A Heuristic Sampling Method for Maintaining the Probability Distribution.",
            "Method for Processing Graph Degeneracy in Dynamic Geometry Based on Domain Design.",
            "Discovering API Directives from API Specifications with Text Classification.",
            "Multi-Attribute Preferences Mining Method for Group Users with the Process of Noise Reduction.",
            "Preface.",
            "Improving Ocean Data Services with Semantics and Quick Index.",
            "SOOP: Efficient Distributed Graph Computation Supporting Second-Order Random Walks.",
            "Robustness Assessment of Asynchronous Advantage Actor-Critic Based on Dynamic Skewness and Sparseness Computation: A Parallel Computing View.",
            "A Novel Probabilistic Saturating Counter Design for Secure Branch Predictor.",
            "Write-Optimized B+ Tree Index Technology for Persistent Memory.",
            "FDGLib: A Communication Library for Efficient Large-Scale Graph Processing in FPGA-Accelerated Data Centers.",
            "Harmonia: Explicit Congestion Notification and Credit-Reservation Transport Converged Congestion Control in Datacenters.",
            "Preface.",
            "Partial-TMR: A New Method for Protecting Register Files Against Soft Error Based on Lifetime Analysis.",
            "Machine Learning Aided Key-Guessing Attack Paradigm Against Logic Block Encryption.",
            "Defect-Tolerant Mapping of CMOL Circuit Targeting Delay Optimization.",
            "Temperature-Aware Electromigration Analysis with Current-Tracking in Power Grid Networks.",
            "Inversion Optimization Strategy Based on Primitives with Complement Attributes.",
            "Area Efficient Pattern Representation of Binary Neural Networks on RRAM.",
            "Exploiting the Community Structure of Fraudulent Keywords for Fraud Detection in Web Search.",
            "Apollo: Rapidly Picking the Optimal Cloud Configurations for Big Data Analytics Using a Data-Driven Approach.",
            "Constructing an Educational Knowledge Graph with Concepts Linked to Wikipedia.",
            "Vulnerable Region-Aware Greybox Fuzzing.",
            "Preface.",
            "A Multi-Agent Spatial Logic for Scenario-Based Decision Modeling and Verification in Platoon Systems.",
            "MEBS: Uncovering Memory Life-Cycle Bugs in Operating System Kernels.",
            "Trace Semantics and Algebraic Laws for Total Store Order Memory Model.",
            "Symbolic Reasoning About Quantum Circuits in Coq.",
            "HRPDF: A Software-Based Heterogeneous Redundant Proactive Defense Framework for Programmable Logic Controller.",
            "AMCheX: Accurate Analysis of Missing-Check Bugs for Linux Kernel.",
            "Verifying Contextual Refinement with Ownership Transfer.",
            "Verification of Real Time Operating System Exception Management Based on SPARCv8.",
            "Activity Diagram Synthesis Using Labelled Graphs and the Genetic Algorithm.",
            "A Unified Shared-Private Network with Denoising for Dialogue State Tracking.",
            "Pre-Train and Learn: Preserving Global Information for Graph Neural Networks.",
            "CDM: Content Diffusion Model for Information-Centric Networks.",
            "JOURNAL OF COMPUTER SCIENCE AND TECHNOLOGY."
        ]
    },
    {
        "name": "JCST",
        "year": "2020",
        "info": "Volume 35: 2020",
        "count": 96,
        "papers": [
            "Preface.",
            "Ad Hoc File Systems for High-Performance Computing.",
            "Design and Implementation of the Tianhe-2 Data Storage and Management System.",
            "Lessons Learned from Optimizing the Sunway Storage System for Higher Application I/O Performance.",
            "Gfarm/BB - Gfarm File System for Node-Local Burst Buffer.",
            "GekkoFS - A Temporary Burst Buffer File System for HPC Applications.",
            "I/O Acceleration via Multi-Tiered Data Buffering and Prefetching.",
            "Mochi: Composing Data Services for High-Performance Computing Environments.",
            "ExaHDF5: Delivering Efficient Parallel I/O on Exascale Computing Systems.",
            "SmartPipe: Towards Interoperability of Industrial Applications via Computational Reflection.",
            "Labeled Network Stack: A High-Concurrency and Low-Tail Latency Cloud Server Framework for Massive IoT Devices.",
            "CirroData: Yet Another SQL-on-Hadoop Data Analytics Engine with High Performance.",
            "A Case for Adaptive Resource Management in Alibaba Datacenter Using Neural Networks.",
            "AquaSee: Predict Load and Cooling System Faults of Supercomputers Using Chilled Water Data.",
            "Preface.",
            "Incremental Multi-Label Learning with Active Queries.",
            "Joint Label-Specific Features and Correlation Information for Multi-Label Learning.",
            "Discrimination-Aware Domain Adversarial Neural Network.",
            "Efficient Multiagent Policy Optimization Based on Weighted Estimators in Stochastic Cooperative Environments.",
            "Exploiting Structural and Temporal Influence for Dynamic Social-Aware Recommendation.",
            "Semi-Supervised Classification of Data Streams by BIRCH Ensemble and Local Structure Mapping.",
            "Sequential Recommendation via Cross-Domain Novelty Seeking Trait Mining.",
            "Finding Communities by Decomposing and Embedding Heterogeneous Information Network.",
            "Exploiting Multiple Correlations Among Urban Regions for Crowd Flow Prediction.",
            "You Are How You Behave - Spatiotemporal Representation Learning for College Student Academic Achievement.",
            "PetroKG: Construction and Application of Knowledge Graph in Upstream Area of PetroChina.",
            "Preface.",
            "Optimistic Transaction Processing in Deterministic Database.",
            "MPI-RCDD: A Framework for MPI Runtime Communication Deadlock Detection.",
            "Interference Analysis of Co-Located Container Workloads: A Perspective from Hardware Performance Counters.",
            "IMPULP: A Hardware Approach for In-Process Memory Protection via User-Level Partitioning.",
            "Huge Page Friendly Virtualized Memory Management.",
            "Bigflow: A General Optimization Layer for Distributed Computing Frameworks.",
            "A Machine Learning Framework with Feature Selection for Floorplan Acceleration in IC Physical Design.",
            "SIES: A Novel Implementation of Spiking Convolutional Neural Network Inference Engine on Field-Programmable Gate Array.",
            "Erratum to: A Framework for Supporting Tree-Like Indexes on the Chord Overlay.",
            "Preface.",
            "Lane Detection: A Survey with New Results.",
            "Denoising Stochastic Progressive Photon Mapping Renderings Using a Multi-Residual Network.",
            "A Comprehensive Pipeline for Complex Text-to-Image Synthesis.",
            "Two-Stream Temporal Convolutional Networks for Skeleton-Based Human Action Recognition.",
            "Reference Image Guided Super-Resolution via Progressive Channel Attention Networks.",
            "Automatic Video Segmentation Based on Information Centroid and Optimized SaliencyCut.",
            "EmotionMap: Visual Analysis of Video Emotional Content on a Map.",
            "Distinguishing Computer-Generated Images from Natural Images Using Channel and Pixel Correlation.",
            "Next POI Recommendation Based on Location Interest Mining with Recurrent Neural Networks.",
            "Word-Pair Relevance Modeling with Multi-View Neural Attention Mechanism for Sentence Alignment.",
            "Cloaking Region Based Passenger Privacy Protection in Ride-Hailing Systems.",
            "Deploy Efficiency Driven k-Barrier Construction Scheme Based on Target Circle in Directional Sensor Network.",
            "Data-Driven Approaches for Spatio-Temporal Analysis: A Survey of the State-of-the-Arts.",
            "A Survey on Performance Optimization of High-Level Synthesis Tools.",
            "Preface.",
            "Enriching Context Information for Entity Linking with Web Data.",
            "DEM: Deep Entity Matching Across Heterogeneous Information Networks.",
            "User Account Linkage Across Multiple Platforms with Location Data.",
            "A Survey on Blocking Technology of Entity Resolution.",
            "ATLRec: An Attentional Adversarial Transfer Learning Network for Cross-Domain Recommendation.",
            "Towards Accurate Bit Error Simulation in Wireless Sensor Networks Including Environmental Influences.",
            "A Multi-Point Distance-Bounding Protocol for Securing Automatic Dependent Surveillance-Broadcast in Unmanned Aerial Vehicle Applications.",
            "Data Security and Privacy in Bitcoin System: A Survey.",
            "Preserving Privacy of Software-Defined Networking Policies by Secure Multi-Party Computation.",
            "Cognition-Driven Traffic Simulation for Unstructured Road Networks.",
            "Color Image Super-Resolution and Enhancement with Inter-Channel Details at Trivial Cost.",
            "Window Detection in Facades Using Heatmap Fusion.",
            "Active Learning Query Strategies for Classification, Regression, and Clustering: A Survey.",
            "Feature Selection for Malware Detection on the Android Platform Based on Differences of IDF Values.",
            "Mining Design Pattern Use Scenarios and Related Design Pattern Pairs: A Case Study on Online Posts.",
            "FATOC: Bug Isolation Based Multi-Fault Localization by Using OPTICS Clustering.",
            "Predicted Robustness as QoS for Deep Neural Network Models.",
            "EasyModel: A Refinement-Based Modeling and Verification Approach for Self-Adaptive Software.",
            "Detecting Anomalous Bus-Driving Behaviors from Trajectories.",
            "Fault-Tolerant Hamiltonicity and Hamiltonian Connectivity of BCube with Various Faulty Elements.",
            "A Spatiotemporal Causality Based Governance Framework for Noisy Urban Sensory Data.",
            "Minimum Time Extrema Estimation for Large-Scale Radio-Frequency Identification Systems.",
            "Chinese Word Segmentation via BiLSTM+Semi-CRF with Relay Node.",
            "Comparison Between Deep Learning Models and Traditional Machine Learning Approaches for Facial Expression Recognition in Ageing Adults.",
            "Machine Learning Techniques for Software Maintainability Prediction: Accuracy Analysis.",
            "Evaluating and Improving Linear Regression Based Profiling: On the Selection of Its Regularization.",
            "Evaluating and Constraining Hardware Assertions with Absent Scenarios.",
            "Item Cold-Start Recommendation with Personalized Feature Selection.",
            "Preface.",
            "ProSy: API-Based Synthesis with Probabilistic Model.",
            "Learning Human-Written Commit Messages to Document Code Changes.",
            "Automatically Identifying Calling-Prone Higher-Order Functions of Scala Programs to Assist Testers.",
            "Reachability of Patterned Conditional Pushdown Systems.",
            "Specification and Verification of the Zab Protocol with TLA+.",
            "Modelling and Verification of Real-Time Publish and Subscribe Protocol Using Uppaal and Simulink/Stateflow.",
            "Jupiter Made Abstract, and Then Refined.",
            "Verifying ReLU Neural Networks from a Model Checking Perspective.",
            "Modular Verification of SPARCv8 Code.",
            "Automatic Buffer Overflow Warning Validation.",
            "Predicting Code Smells and Analysis of Predictions: Using Machine Learning Techniques and Software Metrics.",
            "Neural Explainable Recommender Model Based on Attributes and Reviews.",
            "Topic Modeling Based Warning Prioritization from Change Sets of Software Repository.",
            "JOURNAL OF COMPUTER SCIENCE AND TECHNOLOGY.",
            "Retraction Note: Edge-Oriented Spatial Interpolation for Error Concealment of Consecutive Blocks."
        ]
    },
    {
        "name": "JCST",
        "year": "2019",
        "info": "Volume 34: 2019",
        "count": 89,
        "papers": [
            "Preface.",
            "Decoding the Structural Keywords in Protein Structure Universe.",
            "Controllability and Its Applications to Biological Networks.",
            "Texture Feature Extraction from Thyroid MR Imaging Using High-Order Derived Mean CLBP.",
            "Privacy-Protective-GAN for Privacy Preserving Face De-Identification.",
            "ROCO: Using a Solid State Drive Cache to Improve the Performance of a Host-Aware Shingled Magnetic Recording Drive.",
            "Enabling Highly Efficient k-Means Computations on the SW26010 Many-Core Processor of Sunway TaihuLight.",
            "Scaling out NUMA-Aware Applications with RDMA-Based Distributed Shared Memory.",
            "Extending SSD Lifespan with Comprehensive Non-Volatile Memory-Based Write Buffers.",
            "Secure Inverted Index Based Search over Encrypted Cloud Data with User Access Rights Management.",
            "Learning to Generate Posters of Scientific Papers by Probabilistic Graphical Models.",
            "Who Should Be Invited to My Party: A Size-Constrained k-Core Problem in Social Networks.",
            "On Maximum Elastic Scheduling in Cloud-Based Data Center Networks for Virtual Machines with the Hose Model.",
            "A Survey on the Moving Target Defense Strategies: An Architectural Perspective.",
            "A Cost-Efficient Approach to Storing Users' Data for Online Social Networks.",
            "Preface.",
            "Real-Time Avatar Pose Transfer and Motion Generation Using Locally Encoded Laplacian Offsets.",
            "Improving Data Utility Through Game Theory in Personalized Differential Privacy.",
            "CATIRI: An Efficient Method for Content-and-Text Based Image Retrieval.",
            "Space Efficient Quantization for Deep Convolutional Neural Networks.",
            "A 2-Stage Strategy for Non-Stationary Signal Prediction and Recovery Using Iterative Filtering and Neural Network.",
            "A Survey on Graph Processing Accelerators: Challenges and Opportunities.",
            "Optimally Embedding 3-Ary n-Cubes into Grids.",
            "A New Approach to Multivariate Network Traffic Analysis.",
            "MicroBTC: Efficient, Flexible and Fair Micropayment for Bitcoin Using Hash Chains.",
            "Decomposing Composite Changes for Code Review and Regression Test Selection in Evolving Software.",
            "On Identifying and Explaining Similarities in Android Apps.",
            "Revisiting the Parallel Strategy for DOACROSS Loops.",
            "Plug-and-Play Based Optimization Algorithm for New Crime Density Estimation.",
            "Lossless Compression of Random Forests.",
            "Preface.",
            "A Large Chinese Text Dataset in the Wild.",
            "Bidirectional Optimization Coupled Lightweight Networks for Efficient and Robust Multi-Person 2D Pose Estimation.",
            "Single Image Super-Resolution via Dynamic Lightweight Database with Local-Feature Based Interpolation.",
            "Fast and Error-Bounded Space-Variant Bilateral Filtering.",
            "Defocus Hyperspectral Image Deblurring with Adaptive Reference Image and Scale Map.",
            "Geometry-Aware ICP for Scene Reconstruction from RGB-D Camera.",
            "A Survey of 3D Indoor Scene Synthesis.",
            "Blind Image Deblurring via Adaptive Optimization with Flexible Sparse Structure Control.",
            "Cloud Detection Using Super Pixel Classification and Semantic Segmentation.",
            "PVSS: A Progressive Vehicle Search System for Video Surveillance Networks.",
            "Competitive Cloud Pricing for Long-Term Revenue Maximization.",
            "BHONEM: Binary High-Order Network Embedding Methods for Networked-Guarantee Loans.",
            "Unit Test Data Generation for C Using Rule-Directed Symbolic Execution.",
            "Cacheap: Portable and Collaborative I/O Optimization for Graph Processing.",
            "Preface.",
            "Moving Objects with Transportation Modes: A Survey.",
            "Location and Trajectory Identification from Microblogs.",
            "Scalable and Adaptive Joins for Trajectory Data in Distributed Stream System.",
            "A United Framework for Large-Scale Resource Description Framework Stream Processing.",
            "Searching Activity Trajectories with Semantics.",
            "On the Expressive Power of Logics on Constraint Databases with Complex Objects.",
            "Diversifying Top-k Routes with Spatial Constraints.",
            "Improved Task and Resource Partitioning Under the Resource-Oriented Partitioned Scheduling.",
            "RAID 4SMR: RAID Array with Shingled Magnetic Recording Disk for Mass Storage Systems.",
            "Edge Computing Based Applications in Vehicular Environments: Comparative Study and Main Issues.",
            "Algorithms for Handoff Minimization in Wireless Networks.",
            "A Lightweight Dynamic Enforcement of Privacy Protection for Android.",
            "SRNET: A Shallow Skip Connection Based Convolutional Neural Network Design for Resolving Singularities.",
            "Preface.",
            "Bug Triaging Based on Tossing Sequence Modeling.",
            "Semi-Supervised Learning Based Tag Recommendation for Docker Repositories.",
            "Automatic Detection and Repair Recommendation for Missing Checks.",
            "Graph Embedding Based API Graph Search and Recommendation.",
            "CBSC: A Crowdsensing System for Automatic Calibrating of Barometers.",
            "DP-Share: Privacy-Preserving Software Defect Prediction Model Sharing Through Differential Privacy.",
            "Cross Project Defect Prediction via Balanced Distribution Adaptation Based Transfer Learning.",
            "Threshold Extraction Framework for Software Metrics.",
            "Side-Channel Analysis for the Authentication Protocols of CDMA Cellular Networks.",
            "Degree-of-Node Task Scheduling of Fine-Grained Parallel Programs on Heterogeneous Systems.",
            "CR-Morph: Controllable Rigid Morphing for 2D Animation.",
            "DEMC: A Deep Dual-Encoder Network for Denoising Monte Carlo Rendering.",
            "A Locating Method for Reliability-Critical Gates with a Parallel-Structured Genetic Algorithm.",
            "CK-Modes Clustering Algorithm Based on Node Cohesion in Labeled Property Graph.",
            "HybridTune: Spatio-Temporal Performance Data Correlation for Performance Diagnosis of Big Data Systems.",
            "An Efficient Framework for Multiple Subgraph Pattern Matching Models.",
            "Interval Estimation for Aggregate Queries on Incomplete Data.",
            "Adversarial Heterogeneous Network Embedding with Metapath Attention Mechanism.",
            "Modeling Temporal Dynamics of Users' Purchase Behaviors for Next Basket Prediction.",
            "Large-Scale Estimation of Distribution Algorithms with Adaptive Heavy Tailed Random Projection Ensembles.",
            "Progressive Furniture Model Decimation with Texture Preservation.",
            "Weakly- and Semi-Supervised Fast Region-Based CNN for Object Detection.",
            "A Geometric Strategy Algorithm for Orthogonal Projection onto a Parametric Surface.",
            "Artistic Augmentation of Photographs with Droplets.",
            "Automatic Diabetic Retinopathy Screening via Cascaded Framework Based on Image- and Lesion-Level Features Fusion.",
            "Security Attacks in Named Data Networking: A Review and Research Directions.",
            "An Efficient Approach for Mitigating Covert Storage Channel Attacks in Virtual Machines by the Anti-Detection Criterion.",
            "Tightly Secure Public-Key Cryptographic Schemes from One-More Assumptions.",
            "JOURNAL OF COMPUTER SCIENCE AND TECHNOLOGY."
        ]
    },
    {
        "name": "JCST",
        "year": "2018",
        "info": "Volume 33: 2018",
        "count": 91,
        "papers": [
            "BenchIP: Benchmarking Intelligence Processors.",
            "A Large-Scale Study of Failures on Petascale Supercomputers.",
            "Spear and Shield: Evolution of Integrated Circuit Camouflaging.",
            "Endurable SSD-Based Read Cache for Improving the Performance of Selective Restore from Deduplication Systems.",
            "Hot Data Identification with Multiple Bloom Filters: Block-Level Decision vs I/O Request-Level Decision.",
            "SplitPass: A Mutually Distrusting Two-Party Password Manager.",
            "A Pipelining Loop Optimization Method for Dataflow Architecture.",
            "CPicker: Leveraging Performance-Equivalent Configurations to Improve Data Center Energy Efficiency.",
            "A Non-Stop Double Buffering Mechanism for Dataflow Architecture.",
            "A Dataflow-Oriented Programming Interface for Named Data Networking.",
            "Indexing Techniques of Distributed Ordered Tables: A Survey and Analysis.",
            "Where Do Local Experts Go? Evaluating User Geo-Topical Similarity for Top-N Place Recommendation.",
            "3D Face Similarity Measure by Fréchet Distances of Geodesics.",
            "Robust Visual Tracking Based on Convolutional Features with Illumination and Occlusion Handing.",
            "Erratum to: Automatic Fall Detection Using Membership Based Histogram Descriptors.",
            "CoC: A Unified Distributed Ledger Based Supply Chain Management System.",
            "An Intelligent Transportation System Application for Smartphones Based on Vehicle Position Advertising and Route Sharing in Vehicular Ad-Hoc Networks.",
            "A Flocking-Based on Demand Routing Protocol for Unmanned Aerial Vehicles.",
            "LLMP: Exploiting LLDP for Latency Measurement in Software-Defined Data Center Networks.",
            "An Efficient Two-Phase Model for Computing Influential Nodes in Social Networks Using Social Actions.",
            "A Binary Particle Swarm Optimization for the Minimum Weight Dominating Set Problem.",
            "Modeling the Correlations of Relations for Knowledge Graph Embedding.",
            "A Novel Fine-Grained Method for Vehicle Type Recognition Based on the Locally Enhanced PCANet Neural Network.",
            "Collusion-Proof Result Inference in Crowdsourcing.",
            "CrowdOLA: Online Aggregation on Duplicate Data Powered by Crowdsourcing.",
            "A New Revocable and Re-Delegable Proxy Signature and Its Application.",
            "BCDC: A High-Performance, Server-Centric Data Center Network.",
            "GPU-Driven Scalable Parser for OBJ Models.",
            "Preface.",
            "Visual Simulation of Multiple Fluids in Computer Graphics: A State-of-the-Art Report.",
            "Augmented Flow Simulation Based on Tight Coupling Between Video Reconstruction and Eulerian Models.",
            "Modeling Garment Seam from a Single Image.",
            "Geometry of Motion for Video Shakiness Detection.",
            "Multi-Exposure Motion Estimation Based on Deep Convolutional Networks.",
            "Image Smoothing Based on Image Decomposition and Sparse High Frequency Gradient.",
            "Facial Image Attributes Transformation via Conditional Recycle Generative Adversarial Networks.",
            "How to Wear Beautifully? Clothing Pair Recommendation.",
            "Preface.",
            "Practical Constant-Size Ring Signature.",
            "ShadowEth: Private Smart Contract on Public Blockchain.",
            "Scalable and Privacy-Preserving Data Sharing Based on Blockchain.",
            "Lightweight and Manageable Digital Evidence Preservation System on Bitcoin.",
            "Untrusted Hardware Causes Double-Fetch Problems in the I/O Memory.",
            "A Unified Measurement Solution of Software Trustworthiness Based on Social-to-Software Framework.",
            "Preface.",
            "A Survey on Expert Recommendation in Community Question Answering.",
            "Jointly Recommending Library Books and Predicting Academic Performance: A Mutual Reinforcement Perspective.",
            "Multiple Auxiliary Information Based Deep Model for Collaborative Filtering.",
            "Exploiting Pre-Trained Network Embeddings for Recommendations in Social Networks.",
            "Discovering Functional Organized Point of Interest Groups for Spatial Keyword Recommendation.",
            "Hashtag Recommendation Based on Multi-Features of Microblogs.",
            "A Generative Model Approach for Geo-Social Group Recommendation.",
            "Illuminating Recommendation by Understanding the Explicit Item Relations.",
            "PTM: A Topic Model for the Inferring of the Penalty.",
            "A Survey on Task and Participant Matching in Mobile Crowd Sensing.",
            "Complete Your Mobility: Linking Trajectories Across Heterogeneous Mobility Data Sources.",
            "Hierarchical Clustering of Complex Symbolic Data and Application for Emitter Identification.",
            "A Two-Player Coalition Cooperative Scheme for the Bodyguard Allocation Problem.",
            "3D Filtering by Block Matching and Convolutional Neural Network for Image Denoising.",
            "Mining Semantic Trajectory Patterns from Geo-Tagged Data.",
            "A Gradient-Domain Based Geometry Processing Framework for Point Clouds.",
            "Preface.",
            "Empirical Research in Software Engineering - A Literature Survey.",
            "AocML: A Domain-Specific Language for Model-Driven Development of Activity-Oriented Context-Aware Applications.",
            "DUSM: A Method for Requirements Specification and Refinement Based on Disciplined Use Cases and Screen Mockups.",
            "Yet Another Intelligent Code-Generating System: A Flexible and Low-Cost Solution.",
            "Power Supply Noise Aware Task Scheduling on Homogeneous 3D MPSoCs Considering the Thermal Constraint.",
            "DimRouter: A Multi-Mode Router Architecture for Higher Energy-Proportionality of On-Chip Networks.",
            "An Efficient Technique to Reverse Engineer Minterm Protection Based Camouflaged Circuit.",
            "Stochastic Variational Inference-Based Parallel and Online Supervised Topic Model for Large-Scale Text Processing.",
            "O2iJoin: An Efficient Index-Based Algorithm for Overlap Interval Join.",
            "GRIP: A Group Recommender Based on Interactive Preference Model.",
            "Optimizing Multi-Dimensional Packet Classification for Multi-Core Systems.",
            "Multi-Sensor Estimation for Unreliable Wireless Networks with Contention-Based Protocols.",
            "Understanding and Generating Ultrasound Image Description.",
            "An Efficient Message Dissemination Scheme for Minimizing Delivery Delay in Delay Tolerant Networks.",
            "A Task Allocation Method for Stream Processing with Recovery Latency Constraint.",
            "CRL: Efficient Concurrent Regeneration Codes with Local Reconstruction in Geo-Distributed Storage Systems.",
            "More Requests, Less Cost: Uncertain Inter-Datacenter Traffic Transmission with Multi-Tier Pricing.",
            "A Geometry-Based Point Cloud Reduction Method for Mobile Augmented Reality System.",
            "Isometric 3D Shape Partial Matching Using GD-DNA.",
            "Back-to-Front Ordering of Triangles in Digital Terrain Models over Regular Grids.",
            "Modeling Topic-Based Human Expertise for Crowd Entity Resolution.",
            "Time and Location Aware Points of Interest Recommendation in Location-Based Social Networks.",
            "Privacy-Preserving Algorithms for Multiple Sensitive Attributes Satisfying t-Closeness.",
            "Updatable Identity-Based Hash Proof System Based on Lattices and Its Application to Leakage-Resilient Public-Key Encryption Schemes.",
            "Generalized Tweakable Even-Mansour Cipher and Its Applications.",
            "Mining Patterns from Change Logs to Support Reuse-Driven Evolution of Software Architectures.",
            "A New Method for Sentiment Analysis Using Contextual Auto-Encoders.",
            "Search-Based Cost-Effective Software Remodularization.",
            "JOURNAL OF COMPUTER SCIENCE AND TECHNOLOGY."
        ]
    },
    {
        "name": "JCST",
        "year": "2017",
        "info": "Volume 32: 2017",
        "count": 101,
        "papers": [
            "Preface.",
            "Principles to Support Modular Software Construction.",
            "An Efficient Network-on-Chip Router for Dataflow Architecture.",
            "A Lookahead Read Cache: Improving Read Performance for Deduplication Backup Storage.",
            "dCompaction: Speeding up Compaction of the LSM-Tree via Delayed Compaction.",
            "MemSC: A Scan-Resistant and Compact Cache Replacement Framework for Memory-Based Key-Value Cache Systems.",
            "Sparse Support Vector Machine with L p Penalty for Feature Selection.",
            "Efficient Processing of Distributed Twig Queries Based on Node Distribution.",
            "Approximate Continuous Top-k Query over Sliding Window.",
            "Intelligent Visual Media Processing: When Graphics Meets Vision.",
            "A Survey on Pre-Processing in Image Matting.",
            "On Participation Constrained Team Formation.",
            "Reverse Furthest Neighbors Query in Road Networks.",
            "A Light-Weight Opportunistic Forwarding Protocol with Optimized Preamble Length for Low-Duty-Cycle Wireless Sensor Networks.",
            "High-Impact Bug Report Identification with Imbalanced Learning Strategies.",
            "Automated Testing of Web Applications Using Combinatorial Strategies.",
            "Providing Virtual Cloud for Special Purposes on Demand in JointCloud Computing Environment.",
            "Labeled von Neumann Architecture for Software-Defined Cloud.",
            "Evolution of Cloud Operating System: From Technology to Ecosystem.",
            "Intelligent Development Environment and Software Knowledge Graph.",
            "Experience Availability: Tail-Latency Oriented Availability in Software-Defined Cloud Computing.",
            "Architectural Design of a Cloud Robotic System for Upper-Limb Rehabilitation with Multimodal Interaction.",
            "Parallel Turing Machine, a Proposal.",
            "DLPlib: A Library for Deep Learning Processor.",
            "A Power and Area Optimization Approach of Mixed Polarity Reed-Muller Expression for Incompletely Specified Boolean Functions.",
            "A Hint Frequency Based Approach to Enhancing the I/O Performance of Multilevel Cache Storage Systems.",
            "Enhancing Security of FPGA-Based Embedded Systems with Combinational Logic Binding.",
            "A Novel Hardware/Software Partitioning Method Based on Position Disturbed Particle Swarm Optimization with Invasive Weed Optimization.",
            "Automatic Fall Detection Using Membership Based Histogram Descriptors.",
            "Parallel Incremental Frequent Itemset Mining for Large Data.",
            "A New Feistel-Type White-Box Encryption Scheme.",
            "Developer Role Evolution in Open Source Software Ecosystem: An Explanatory Study on GNOME.",
            "Preface.",
            "Photographic Appearance Enhancement via Detail-Based Dictionary Learning.",
            "Static Scene Illumination Estimation from Videos with Applications.",
            "Temporally Consistent Depth Map Prediction Using Deep Convolutional Neural Network and Spatial-Temporal Conditional Random Field.",
            "Medical Sign Recognition of Lung Nodules Based on Image Retrieval with Semantic Features and Supervised Hashing.",
            "Collective Representation for Abnormal Event Detection.",
            "Captioning Videos Using Large-Scale Image Corpus.",
            "Automatic Colorization with Improved Spatial Coherence and Boundary Localization.",
            "Discriminative Histogram Intersection Metric Learning and Its Applications.",
            "Prior-Free Dependent Motion Segmentation Using Helmholtz-Hodge Decomposition Based Object-Motion Oriented Map.",
            "A Survey on Human Performance Capture and Animation.",
            "Minimizing Resource Cost for Camera Stream Scheduling in Video Data Center.",
            "Two-Type Information Fusion Based IP-to-AS Mapping Table Refining.",
            "Protecting User Privacy in a Multi-Path Information-Centric Network Using Multiple Random-Caches.",
            "Private Keyword-Search for Database Systems Against Insider Attacks.",
            "Optimal Path Embedding in the Exchanged Crossed Cube.",
            "Length-Changeable Incremental Extreme Learning Machine.",
            "EntityManager: Managing Dirty Data Based on Entity Resolution.",
            "Preface.",
            "Balanced Quantization: An Effective and Efficient Approach to Quantized Neural Networks.",
            "Objectness Region Enhancement Networks for Scene Parsing.",
            "Directional Edge Boxes: Exploiting Inner Normal Direction Cues for Effective Object Proposal Generation.",
            "Weighted Co-Training for Cross-Domain Image Sentiment Classification.",
            "Retrieving Aerial Scene Images with Learned Deep Image-Sketch Features.",
            "Deep Multimodal Reinforcement Network with Contextually Guided Recurrent Attention for Image Question Answering.",
            "Neural Parse Combination.",
            "Exploiting Unlabeled Data for Neural Grammatical Error Detection.",
            "Recent Advances on Neural Headline Generation.",
            "Emphasizing Essential Words for Sentiment Classification Based on Recurrent Neural Networks.",
            "Optimizing Non-Decomposable Evaluation Metrics for Neural Machine Translation.",
            "Type-Aware Question Answering over Knowledge Base with Attention-Based Tree-Structured Neural Networks.",
            "Relation Enhanced Neural Model for Type Classification of Entity Mentions with a Fine-Grained Taxonomy.",
            "An Experimental Study of Text Representation Methods for Cross-Site Purchase Preference Prediction Using the Social Text Data.",
            "Preface.",
            "COSSET+: Crowdsourced Missing Value Imputation Optimized by Knowledge Base.",
            "Crowd-Guided Entity Matching with Consolidated Textual Data.",
            "Improving the Quality of Crowdsourced Image Labeling via Label Similarity.",
            "Budget-Aware Dynamic Incentive Mechanism in Spatial Crowdsourcing.",
            "Privacy-Preserving Task Assignment in Spatial Crowdsourcing.",
            "FIMI: A Constant Frugal Incentive Mechanism for Time Window Coverage in Mobile Crowdsensing.",
            "An Approach to Automatic Performance Prediction for Cloud-Enhanced Mobile Applications with Sparse Data.",
            "Evaluation of Remote-I/O Support for a DSM-Based Computation Offloading Scheme.",
            "Flexible CP-ABE Based Access Control on Encrypted Data for Mobile Users in Hybrid Cloud System.",
            "MimiBS: Mimicking Base-Station to Provide Location Privacy Protection in Wireless Sensor Networks.",
            "Differentially Private Event Histogram Publication on Sequences over Graphs.",
            "Visual Specification and Analysis of Contract-Based Software Architectures.",
            "Three-Layer Joint Modeling of Chinese Trigger Extraction with Constraints on Trigger and Argument Semantics.",
            "Preface.",
            "What Are They Talking About? Analyzing Code Reviews in Pull-Based Development Model.",
            "CSLabel: An Approach for Labelling Mobile App Reviews.",
            "A Cluster Based Feature Selection Method for Cross-Project Software Defect Prediction.",
            "On Locating Malicious Code in Piggybacked Android Apps.",
            "Automated String Constraints Solving for Programs Containing String Manipulation Functions.",
            "Preface.",
            "ExquiMo: An Exquisite Corpse Tool for Collaborative 3D Shape Design.",
            "Estimation of Vehicle Pose and Position with Monocular Camera at Urban Road Intersections.",
            "Mechanical Assembly Packing Problem Using Joint Constraints.",
            "Non-Frontal Facial Expression Recognition Using a Depth-Patch Based Deep Neural Network.",
            "Surface Tension Model Based on Implicit Incompressible Smoothed Particle Hydrodynamics for Fluid Simulation.",
            "Stable Real-Time Surgical Cutting Simulation of Deformable Objects Embedded with Arbitrary Triangular Meshes.",
            "Automatic Anterior Lamina Cribrosa Surface Depth Measurement Based on Active Contour and Energy Constraint.",
            "Supervised Vessels Classification Based on Feature Selection.",
            "Effective Query Grouping Strategy in Clouds.",
            "A Reverse Auction Framework for Hybrid Access in Femtocell Network.",
            "LTSS: Load-Adaptive Traffic Steering and Forwarding for Security Services in Multi-Tenant Cloud Datacenters.",
            "Intermittent Fault Diagnosability of Interconnection Networks.",
            "CHAUS: Scalable VM-Based Channels for Unbounded Streaming.",
            "A Configurable Circuit for Cross-Correlation in Real-Time Image Matching.",
            "Greedy Randomized Adaptive Search Procedure with Path-Relinking for the Vertex p-Center Problem."
        ]
    },
    {
        "name": "JCST",
        "year": "2016",
        "info": "Volume 31: 2016",
        "count": 88,
        "papers": [
            "Preface.",
            "Technological Exploration of RRAM Crossbar Array for Matrix-Vector Multiplication.",
            "BACH: A Bandwidth-Aware Hybrid Cache Hierarchy Design with Nonvolatile Memories.",
            "Performance-Centric Optimization for Racetrack Memory Based Register File on GPUs.",
            "Modelling Spiking Neural Network from the Architecture Evaluation Perspective.",
            "Optimization Strategies Oriented to Loop Characteristics in Software Thread Level Speculation Systems.",
            "Modular Timing Constraints for Delay-Insensitive Systems.",
            "Optimizations for High Performance Network Virtualization.",
            "Metcalfe's Law and Network Quality: An Extension of Zhang et al.",
            "Techniques for Design and Implementation of an FPGA-Specific Physical Unclonable Function.",
            "A Unified Buffering Management with Set Divisible Cache for PCM Main Memory.",
            "AS-Index: A Structure for String Search Using n-Grams and Algebraic Signatures.",
            "Context-Based Moving Object Trajectory Uncertainty Reduction and Ranking in Road Network.",
            "RiMOM-IM: A Novel Iterative Framework for Instance Matching.",
            "A Game-Based Approach for PCTL* Stochastic Model Checking with Evidence.",
            "Adaptive Photon Mapping Based on Gradient.",
            "A Novel Spatial Pooling Strategy for Image Quality Assessment.",
            "Pragma Directed Shared Memory Centric Optimizations on GPUs.",
            "Wide Operational Range Processor Power Delivery Design for Both Super-Threshold Voltage and Near-Threshold Voltage Computing.",
            "Worst-Case Finish Time Analysis for DAG-Based Applications in the Presence of Transient Faults.",
            "A Synthesis of Multi-Precision Multiplication and Squaring Techniques for 8-Bit Sensor Nodes: State-of-the-Art Research and Future Challenges.",
            "Complete Proof Systems for Amortised Probabilistic Bisimulations.",
            "Utilizing Probabilistic Linear Equations in Cube Attacks.",
            "Survey on Simulation for Mobile Ad-Hoc Communication for Disaster Scenarios.",
            "Identify Congested Links Based on Enlarged State Space.",
            "Content-Based Publish/Subscribe System for Web Syndication.",
            "Answering Reachability Queries on Incrementally Updated Graphs by Hierarchical Labeling Schema.",
            "A Parallel Markov Cerebrovascular Segmentation Algorithm Based on Statistical Model.",
            "A Parallel Genetic Algorithm Based on Spark for Pairwise Test Suite Generation.",
            "Tuning the Learning Rate for Stochastic Variational Inference.",
            "Preface.",
            "Skeleton-Sectional Structural Analysis for 3D Printing.",
            "Improving Shape from Shading with Interactive Tabu Search.",
            "View-Aware Image Object Compositing and Synthesis from Multiple Sources.",
            "A Linear Approach for Depth and Colour Camera Calibration Using Hybrid Parameters.",
            "Multi-Task Learning for Food Identification and Analysis with Deep Convolutional Neural Networks.",
            "A Modified Fuzzy C-Means Algorithm for Brain MR Image Segmentation and Bias Field Correction.",
            "Nonlinear Dimensionality Reduction by Local Orthogonality Preserving Alignment.",
            "Texture Repairing by Unified Low Rank Optimization.",
            "Variance Analysis and Adaptive Sampling for Indirect Light Path Reuse.",
            "Subgroup Discovery Algorithms: A Survey and Empirical Evaluation.",
            "Trinity: Walking on a User-Object-Tag Heterogeneous Network for Personalised Recommendations.",
            "A Hybrid Method of Domain Lexicon Construction for Opinion Targets Extraction Using Syntax and Semantics.",
            "Metadata Feedback and Utilization for Data Deduplication Across WAN.",
            "Learning Better Word Embedding by Asymmetric Low-Rank Projection of Knowledge Graph.",
            "Preface.",
            "Dynamic Shortest Path Monitoring in Spatial Networks.",
            "Mining Object Similarity for Predicting Next Locations.",
            "Web News Extraction via Tag Path Feature Fusion Using DS Theory.",
            "Online Feature Selection of Class Imbalance via PA Algorithm.",
            "Efficient Set-Correlation Operator Inside Databases.",
            "Keyword Query over Error-Tolerant Knowledge Bases.",
            "Determining the Real Data Completeness of a Relational Dataset.",
            "Content-Related Repairing of Inconsistencies in Distributed Data.",
            "Budget Allocation for Maximizing Viral Advertising in Social Networks.",
            "HUITWU: An Efficient Algorithm for High-Utility Itemset Mining in Transaction Databases.",
            "A Survey of Visual Analytic Pipelines.",
            "Improving Metadata Caching Efficiency for Data Deduplication via In-RAM Metadata Utilization.",
            "A Data Deduplication Framework of Disk Images with Adaptive Block Skipping.",
            "Reducing Synchronization Cost for Single-Level Store in Mobile Systems.",
            "Preface.",
            "Roundtable: Research Opportunities and Challenges for Large-Scale Software Systems.",
            "Debugging Concurrent Software: Advances and Challenges.",
            "Prioritizing Test Cases for Memory Leaks in Android Applications.",
            "Summarizing Software Artifacts: A Literature Review.",
            "What Security Questions Do Developers Ask? A Large-Scale Study of Stack Overflow Posts.",
            "Critical Success Factors to Improve the Game Development Process from a Developer's Perspective.",
            "A Feature Model Based Framework for Refactoring Software Product Line Architecture.",
            "An Efficient Approach for Solving Optimization over Linear Arithmetic Constraints.",
            "Secure Channel Free ID-Based Searchable Encryption for Peer-to-Peer Group.",
            "Tolerating Permanent State Transition Faults in Asynchronous Sequential Machines.",
            "UiLog: Improving Log-Based Fault Diagnosis by Log Analysis.",
            "Topological Features Based Entity Disambiguation.",
            "Preface.",
            "Edge Video CDN: A Wi-Fi Content Hotspot Solution.",
            "CPA-VoD: Cloud and Peer-Assisted Video on Demand System for Mobile Devices.",
            "Interference-Limited Device-to-Device Multi-User Cooperation Scheme for Optimization of Edge Networking.",
            "Combined Cloud: A Mixture of Voluntary Cloud and Reserved Instance Marketplace.",
            "Semi-Homogenous Generalization: Improving Homogenous Generalization for Privacy Preservation in Cloud Computing.",
            "Using Computational Intelligence Algorithms to Solve the Coalition Structure Generation Problem in Coalitional Skill Games.",
            "A Tensor Neural Network with Layerwise Pretraining: Towards Effective Answer Retrieval.",
            "Enhanced Userspace and In-Kernel Trace Filtering for Production Systems.",
            "Reducing the Upper Bound Delay by Optimizing Bank-to-Core Mapping.",
            "Efficient Metric All-k-Nearest-Neighbor Search on Datasets Without Any Index.",
            "An Efficient Approach of Processing Multiple Continuous Queries.",
            "A Buffer Scheduling Method Based on Message Priority in Delay Tolerant Networks.",
            "A Script-Based Prototyping Framework to Boost Agile-UX Developments.",
            "Highly Optimized Code Generation for Stencil Codes with Computation Reuse for GPUs."
        ]
    },
    {
        "name": "JCST",
        "year": "2015",
        "info": "Volume 30: 2015",
        "count": 107,
        "papers": [
            "Preface.",
            "CUDA-NP: Realizing Nested Thread-Level Parallelism in GPGPU Applications.",
            "Bipartite-Oriented Distributed Graph Partitioning for Big Learning.",
            "Using Memory in the Right Way to Accelerate Big Data Processing.",
            "An Efficient and Flexible Deterministic Framework for Multithreaded Programs.",
            "System-Enforced Deterministic Streaming for Efficient Pipeline Parallelism.",
            "Exploring Heterogeneous NoC Design Space in Heterogeneous GPU-CPU Architectures.",
            "CRAIS: A Crossbar-Based Interconnection Scheme on FPGA for Big Data.",
            "Adapting Memory Hierarchies for Emerging Datacenter Interconnects.",
            "Improving the Performance and Energy Efficiency of Phase Change Memory Systems.",
            "A Survey of Phase Change Memory Systems.",
            "Cooperative Computing Techniques for a Deeply Fused and Heterogeneous Many-Core Processor Architecture.",
            "Survey of Large-Scale Data Management Systems for Big Data Applications.",
            "Social Influence Study in Online Networks: A Three-Level Review.",
            "Review Authorship Attribution in a Similarity Space.",
            "A Clustering Algorithm for Planning the Integration Process of a Large Number of Conceptual Schemas.",
            "Preface.",
            "Reevaluating Data Stall Time with the Consideration of Data Access Concurrency.",
            "Tencent and Facebook Data Validate Metcalfe's Law.",
            "Software-Defined Cluster.",
            "High Performance Interconnect Network for Tianhe System.",
            "Fatman: Building Reliable Archival Storage Based on Low-Cost Volunteer Resources.",
            "Accelerating Iterative Big Data Computing Through MPI.",
            "Global Optimization for Advertisement Selection in Sponsored Search.",
            "A New ETL Approach Based on Data Virtualization.",
            "Preface.",
            "VFM: Visual Feedback Model for Robust Object Recognition.",
            "RGB-D Hand-Held Object Recognition Based on Heterogeneous Feature Fusion.",
            "Robust Video Text Detection with Morphological Filtering Enhanced MSER.",
            "Raw Trajectory Rectification via Scene-Free Splitting and Stitching.",
            "SRAM-Based FPGA Systems for Safety-Critical Applications: A Survey on Design Standards and Proposed Methodologies.",
            "Register Clustering Methodology for Low Power Clock Tree Synthesis.",
            "Provisioning of Inter-Domain QoS-Aware Services.",
            "Service-Oriented Resource Allocation in Clouds: Pursuing Flexibility and Efficiency.",
            "Preface.",
            "A Survey of Blue-Noise Sampling and Its Applications.",
            "PhotoPrev: Unifying Context and Content Cues to Enhance Personal Photo Revisitation.",
            "Efficient Video Cutout by Paint Selection.",
            "Structure-Aware Nonlocal Optimization Framework for Image Colorization.",
            "Enlarging Image by Constrained Least Square Approach with Shape Preserving.",
            "Facial Similarity Learning with Humans in the Loop.",
            "GPU Accelerated Real-Time Collision Handling in Virtual Disassembly.",
            "Coherent Photon Mapping on the Intel MIC Architecture.",
            "Monocular Video Guided Garment Simulation.",
            "Spectral Animation Compression.",
            "Stretch-Minimizing Volumetric Parameterization.",
            "3D Ear Shape Matching Using Joint α-Entropy.",
            "A Privacy-Preserving Attribute-Based Reputation System in Online Social Networks.",
            "Survey on Discrete Surface Ricci Flow.",
            "Design-Rule-Aware Congestion Model with Explicit Modeling of Vias and Local Pin Access Paths.",
            "Fast Level-Set-Based Inverse Lithography Algorithm for Process Robustness Improvement and Its Application.",
            "An Early Evaluation and Comparison of Three Private Cloud Computing Software Platforms.",
            "Preface.",
            "Hetero-DB: Next Generation High-Performance Database Systems by Best Utilizing Heterogeneous Computing and Storage Resources.",
            "HAG: An Energy-Proportional Data Storage Scheme for Disk Array Systems.",
            "Mining Frequent Itemsets in Correlated Uncertain Databases.",
            "A Structure Learning Algorithm for Bayesian Network Using Prior Knowledge.",
            "VID Join: Mapping Trajectories to Points of Interest to Support Location-Based Services.",
            "Trip Oriented Search on Activity Trajectory.",
            "Threshold-Based Shortest Path Query over Large Correlated Uncertain Graphs.",
            "On Efficient Aggregate Nearest Neighbor Query Processing in Road Networks.",
            "Zip: An Algorithm Based on Loser Tree for Common Contacts Searching in Large Graphs.",
            "The Best Answers? Think Twice: Identifying Commercial Campagins in the CQA Forums.",
            "Learning to Predict Links by Integrating Structure and Interaction Information in Microblogs.",
            "Research on Trust Prediction from a Sociological Perspective.",
            "Enhancing Time Series Clustering by Incorporating Multiple Distance Measures with Semi-Supervised Learning.",
            "Classifying Uncertain and Evolving Data Streams with Distributed Extreme Learning Machine.",
            "Search Result Diversification Based on Query Facets.",
            "Preface.",
            "Leveraging Large Data with Weak Supervision for Joint Feature and Opinion Word Extraction.",
            "When Factorization Meets Heterogeneous Latent Topics: An Interpretable Cross-Site Recommendation Framework.",
            "Preface.",
            "Roundtable: Research Opportunities and Challenges for Emerging Software Systems.",
            "Detecting Android Malware Using Clone Detection.",
            "Balancing Frequencies and Fault Detection in the In-Parameter-Order Algorithm.",
            "A Hybrid Instance Selection Using Nearest-Neighbor for Cross-Project Defect Prediction.",
            "Multi-Factor Duplicate Question Detection in Stack Overflow.",
            "CoreDevRec: Automatic Core Member Recommendation for Contribution Evaluation.",
            "TagCombine: Recommending Tags to Contents in Software Information Sites.",
            "Preface.",
            "Social Trust Aware Item Recommendation for Implicit Feedback.",
            "Mining Intention-Related Products on Online Q&A Community.",
            "Tag Correspondence Model for User Tag Suggestion.",
            "iBole: A Hybrid Multi-Layer Architecture for Doctor Recommendation in Medical Social Networks.",
            "Detecting Marionette Microblog Users for Improved Information Credibility.",
            "Anomaly Detection in Microblogging via Co-Clustering.",
            "Clustering Context-Dependent Opinion Target Words in Chinese Product Reviews.",
            "Microblog Sentiment Analysis with Emoticon Space Model.",
            "Towards Better Understanding of App Functions.",
            "Discovering Family Groups in Passenger Social Networks.",
            "Constructing Edge-Colored Graph for Heterogeneous Networks.",
            "Preface.",
            "Towards Cost-Effective Cloud Downloading with Tencent Big Data.",
            "Quantifying the Influence of Websites Based on Online Collective Attention Flow.",
            "From Interest to Location: Neighbor-Based Friend Recommendation in Social Media.",
            "Enhancing Telco Service Quality with Big Data Enabled Churn Analysis: Infrastructure, Model, and Deployment.",
            "SEIP: System for Efficient Image Processing on Distributed Platform.",
            "An Efficient Algorithm for Distributed Outlier Detection in Large Multi-Dimensional Datasets.",
            "Infrastructure-Free Floor Localization Through Crowdsourcing.",
            "A Family of Stable Multipath Dual Congestion Control Algorithms.",
            "Throughput Optimization in Cognitive Radio Networks Ensembling Physical Layer Measurement.",
            "Cognitive Power Management in Wireless Sensor Networks.",
            "Privacy Petri Net and Privacy Leak Software.",
            "Understanding Sybil Groups in the Wild.",
            "Zero-Correlation Linear Cryptanalysis of Reduced-Round SIMON.",
            "Solving Closest Vector Instances Using an Approximate Shortest Independent Vectors Oracle.",
            "CONTENTS."
        ]
    },
    {
        "name": "JCST",
        "year": "2014",
        "info": "Volume 29: 2014",
        "count": 92,
        "papers": [
            "Editorial: Moving Forward to Respond to Rapid Changes of Computer Science and Technology.",
            "Introduction to the Six Leading Editors.",
            "Effective Object Identification and Association by Varying Coverage Through RFID Power Control.",
            "Dynamic I/O-Aware Scheduling for Batch-Mode Applications on Chip Multiprocessor Systems of Cluster Platforms.",
            "Improving Scalability of Cloud Monitoring Through PCA-Based Clustering of Virtual Machines.",
            "TuLP: A Family of Lightweight Message Authentication Codes for Body Sensor Networks.",
            "Trust-Based Personalized Service Recommendation: A Network Perspective.",
            "Effective Error-Tolerant Keyword Search for Secure Cloud Computing.",
            "On Unsupervised Training of Multi-Class Regularized Least-Squares Classifiers.",
            "Minimizing the Discrepancy Between Source and Target Domains by Learning Adapting Components.",
            "On Density-Based Data Streams Clustering Algorithms: A Survey.",
            "Accurate Approximation of the Earth Mover's Distance in Linear Time.",
            "Movie Scene Recognition Using Panoramic Frame and Representative Feature Patches.",
            "Related-Key Impossible Differential Attack on Reduced-Round LBlock.",
            "Cloud-Sea Computing Systems: Towards Thousand-Fold Improvement in Performance per Watt for the Coming Zettabyte Era.",
            "A Functional Sensing Model and a Case Study in Household Electricity Usage Sensing.",
            "EasiSMP: A Resource-Oriented Programming Framework Supporting Runtime Propagation of RESTful Resources.",
            "SeaHttp: A Resource-Oriented Protocol to Extend REST Style for Web of Things.",
            "A Task Execution Framework for Cloud-Assisted Sensor Networks.",
            "An Elastic Architecture Adaptable to Various Application Scenarios.",
            "A General-Purpose Many-Accelerator Architecture Based on Dataflow Graph Clustering of Applications.",
            "Prevention from Soft Errors via Architecture Elasticity.",
            "MIMS: Towards a Message Interface Based Memory System.",
            "Reinventing Memory System Design for Many-Accelerator Architecture.",
            "A High-Performance and Cost-Efficient Interconnection Network for High-Density Servers.",
            "SAC: Exploiting Stable Set Model to Enhance CacheFiles.",
            "A Non-Forced-Write Atomic Commit Protocol for Cluster File Systems.",
            "OpenMDSP: Extending OpenMP to Program Multi-Core DSPs.",
            "Continuous Probabilistic Subspace Skyline Query Processing Using Grid Projections.",
            "Online Induction of Probabilistic Real-Time Automata.",
            "Inductive Model Generation for Text Classification Using a Bipartite Heterogeneous Network.",
            "Higher-Order Smoothing: A Novel Semantic Smoothing Method for Text Classification.",
            "ConfDTree: A Statistical Method for Improving Decision Trees.",
            "Harnessing the Power of GPUs to Speed Up Feature Selection for Outlier Detection.",
            "Optimal Set Cover Formulation for Exclusive Row Biclustering of Gene Expression.",
            "Continuous Outlier Monitoring on Uncertain Data Streams.",
            "Efficient Data Access for Location-Dependent Spatial Queries.",
            "A Survey on Data Dissemination in Wireless Sensor Networks.",
            "Channel Aware Opportunistic Routing in Multi-Radio Multi-Channel Wireless Mesh Networks.",
            "Exploring the Interactions of Storylines from Informative News Events.",
            "Discovering High-Quality Threaded Discussions in Online Forums.",
            "OpenMC: Towards Simplifying Programming for TianHe Supercomputers.",
            "Preface.",
            "Collaborative Mobile Charging and Coverage.",
            "Emerging Applications for Cyber Transportation Systems.",
            "Multipath Routing of Multiple Description Coded Images in Wireless Networks.",
            "Communicating Is Crowdsourcing: Wi-Fi Indoor Localization with CSI-Based Speed Estimation.",
            "SA-MAC: Self-Stabilizing Adaptive MAC Protocol for Wireless Sensor Networks.",
            "Towards Automated Provisioning and Emergency Handling in Renewable Energy Powered Datacenters.",
            "Autonomic Performance and Power Control on Virtualized Servers: Survey, Practices, and Trends.",
            "Scan-Based Attack on Stream Ciphers: A Case Study on eSTREAM Finalists.",
            "Better-Than-Worst-Case Design: Progress and Opportunities.",
            "A Survey on Silicon PUFs and Recent Advances in Ring Oscillator PUFs.",
            "DEAM: Decoupled, Expressive, Area-Efficient Metadata Cache.",
            "Performance Metrics and Models for Shared Cache.",
            "Cooperative Software Testing and Analysis: Advances and Challenges.",
            "Interactive Inconsistency Fixing in Feature Modeling.",
            "Preface.",
            "Pattern Matching with Flexible Wildcards.",
            "Grading the Severity of Mispronunciations in CAPT Based on Statistical Analysis and Computational Speech Perception.",
            "Protect You More Than Blank: Anti-Learning Sensitive User Information in the Social Networks.",
            "Seeing Human Weight from a Single RGB-D Image.",
            "Name-Face Association in Web Videos: A Large-Scale Dataset, Baselines, and Open Issues.",
            "Crowd Simulation and Its Applications: Recent Advances.",
            "Designing Motion Gesture Interfaces in Mobile Phones for Blind People.",
            "Assisting Visually Impaired People to Acquire Targets on a Large Wall-Mounted Display.",
            "Encoding Spatial Context for Large-Scale Partial-Duplicate Web Image Retrieval.",
            "Querying Big Data: Bridging Theory and Practice.",
            "On Unknown Small Subsets and Implicit Measures: New Techniques for Parameterized Algorithms.",
            "On Some Proximity Problems of Colored Sets.",
            "Assessing Diagnosis Approaches for Wireless Sensor Networks: Concepts and Analysis.",
            "Maximizing Networking Capacity in Multi-Channel Multi-Radio Wireless Networks.",
            "Allocating Bandwidth in Datacenter Networks: A Survey.",
            "Trusted Integrated Circuits: The Problem and Challenges.",
            "A General Low-Cost Indirect Branch Prediction Using Target Address Pointers.",
            "Retention Benefit Based Intelligent Cache Replacement.",
            "A Static Greedy and Dynamic Adaptive Thread Spawning Approach for Loop-Level Parallelism.",
            "An Intra-Server Interconnect Fabric for Heterogeneous Computing.",
            "Memory Efficient Two-Pass 3D FFT Algorithm for Intel® Xeon PhiTM Coprocessor.",
            "Improved Blocking Time Analysis and Evaluation for the Multiprocessor Priority Ceiling Protocol.",
            "Feature-Adaptive Rendering of Loop Subdivision Surfaces on Modern GPUs.",
            "A Two-Step Regularization Framework for Non-Local Means.",
            "A Holistic Approach for Efficient Contour Detection.",
            "Mammogram Enhancement Using Lifting Dyadic Wavelet Transform and Normalized Tsallis Entropy.",
            "Semisupervised Sparse Multilinear Discriminant Analysis.",
            "Merge-Weighted Dynamic Time Warping for Speech Recognition.",
            "CPL: Detecting Protein Complexes by Propagating Labels on Protein-Protein Interaction Network.",
            "Complete Bipartite Anonymity for Location Privacy.",
            "Automated Power Control for Virtualized Infrastructures.",
            "Improved Linear Attacks on the Chinese Block Cipher Standard.",
            "Improved Linear Cryptanalysis of CAST-256.",
            "Contents."
        ]
    },
    {
        "name": "JCST",
        "year": "2013",
        "info": "Volume 28: 2013",
        "count": 97,
        "papers": [
            "Preface.",
            "Pinned OS/Services: A Case Study of XML Parsing on Intel SCC.",
            "Reorder Write Sequence by Hetero-Buffer to Extend SSD's Lifespan.",
            "CSWL: Cross-SSD Wear-Leveling Method in SSD-Based RAID Systems for System Endurance and Performance.",
            "Power Adjusting Algorithm: A New Cross-Layer Power Saving Mechanism for Mobile Ad-Hoc Networks.",
            "Energy Efficient Run-Time Incremental Mapping for 3-D Networks-on-Chip.",
            "Design and Implementation of an Extended Collectives Library for Unified Parallel C.",
            "MPFFT: An Auto-Tuning FFT Library for OpenCL GPUs.",
            "Resources Snapshot Model for Concurrent Transactions in Multi-Core Processors.",
            "TSV Minimization for Circuit - Partitioned 3D SoC Test Wrapper Design.",
            "Collision Attack on the Full Extended MD4 and Pseudo-Preimage Attack on RIPEMD.",
            "A New Batch Verifying Scheme for Identifying Illegal Signatures.",
            "A Secure Scalar Product Protocol Against Malicious Adversaries.",
            "Cryptanalysis of Reduced-Round DASH.",
            "Fuzzy Self-Adaptation of Mission-Critical Software Under Uncertainty.",
            "Towards a Formal Semantics for UML/MARTE State Machines Based on Hierarchical Timed Automata.",
            "Nondeterministic Probabilistic Petri Net - A New Method to Study Qualitative and Quantitative Behaviors of System.",
            "Formal Reasoning About Finite-State Discrete-Time Markov Chains in HOL.",
            "A Taxonomy of Exact Methods for Partial Max-SAT.",
            "Complete Boolean Satisfiability Solving Algorithms Based on Local Search.",
            "Exact Computation of the Topology and Geometric Invariants of the Voronoi Diagram of Spheres in 3D.",
            "On 2-Site Voronoi Diagrams Under Geometric Distance Functions.",
            "On the Toggling-Branching Recurrence of Computability Logic.",
            "Arabic Bank Check Processing: State of the Art.",
            "Parameter-Free Search of Time-Series Discord.",
            "Possibilistic Exponential Fuzzy Clustering.",
            "Optimal Feature Extraction Using Greedy Approach for Random Image Components and Subspace Approach in Face Recognition.",
            "SR-MAC: A Low Latency MAC Protocol for Multi-Packet Transmissions in Wireless Sensor Networks.",
            "Optimal Relay Assignment and Power Allocation for Cooperative Communications.",
            "Fuzzy-Based Dynamic Distributed Queue Scheduling for Packet Switched Networks.",
            "Fast Smallest Lowest Common Ancestor Computation Based on Stable Match.",
            "Query Intent Disambiguation of Keyword-Based Semantic Entity Search in Dataspaces.",
            "An Efficient and Spam-Robust Proximity Measure Between Communication Entities.",
            "Preface.",
            "Outage Analysis of Opportunistic Cooperative Ad Hoc Networks with Randomly Located Nodes.",
            "Investigation on Key Technologies in Large-Scale MIMO.",
            "GPP-Based Soft Base Station Designing and Optimization.",
            "Efficient Time Synchronization Approach for Wireless Communication Systems on GPP-Based Software-Defined Radio Platform.",
            "A Novel Dynamic Adjusting Algorithm for Load Balancing and Handover Co-Optimization in LTE SON.",
            "Simplified MMSE Detectors for Turbo Receiver in BICM MIMO Systems.",
            "Lighting Estimation of a Convex Lambertian Object Using Redundant Spherical Harmonic Frames.",
            "An Algorithm for Connected-Component Labeling, Hole Labeling and Euler Number Computing.",
            "Manifold Constrained Transfer of Facial Geometric Knowledge for 3D Caricature Reconstruction.",
            "Interactive Depth-of-Field Rendering with Secondary Rays.",
            "Gallbladder Removal Simulation for Laparoscopic Surgery Training: A Hybrid Modeling Method.",
            "Affinity-Based Network Interfaces for Efficient Communication on Multicore Architectures.",
            "Delay-Constrained Optimized Packet Aggregation in High-Speed Wireless Networks.",
            "PROSE: Proactive, Selective CDN Participation for P2P Streaming.",
            "A Monte Carlo Enhanced PSO Algorithm for Optimal QoM in Multi-Channel Wireless Networks.",
            "An Energy Efficient Clustering Scheme for Data Aggregation in Wireless Sensor Networks.",
            "Impact of Strangers on Opportunistic Routing Performance.",
            "Preface.",
            "k-Nearest Neighbor Query Processing Algorithms for a Query Region in Road Networks.",
            "Online Approach for Spatio-Temporal Trajectory Data Reduction for Portable Devices.",
            "Mining Botnets and Their Evolution Patterns.",
            "Securing Recommender Systems Against Shilling Attacks Using Social-Based Clustering.",
            "Dominant Skyline Query Processing over Multiple Time Series.",
            "SUBic: A Scalable Unsupervised Framework for Discovering High Quality Biclusters.",
            "CORE: Common Region Extension Based Multiple Protein Structure Alignment for Producing Multiple Solution.",
            "Optimizing Parallel S n Sweeps on Unstructured Grids for Multi-Core Clusters.",
            "Thermal-Aware Post Layout Voltage-Island Generation for 3D ICs.",
            "A Robust and Power-Efficient SoC Implementation in 65 nm.",
            "A Survey of Commonsense Knowledge Acquisition.",
            "Parameter Control of Genetic Algorithms by Learning and Simulation of Bayesian Networks - A Case Study for the Optimal Ordering of Tables.",
            "A Generic Framework for Anonymous Authentication in Mobile Networks.",
            "Forgeability of Wang-Zhu-Feng-Yau's Attribute-Based Signature with Policy-and-Endorsement Mechanism.",
            "Preface.",
            "Class-Driven Non-Negative Matrix Factorization for Image Representation.",
            "Stroke Style Analysis for Painterly Rendering.",
            "A Novel Approach Based on Multi-View Content Analysis and Semi-Supervised Enrichment for Movie Recommendation.",
            "A Novel Web Video Event Mining Framework with the Integration of Correlation and Co-Occurrence Information.",
            "A Visual Analysis Approach for Community Detection of Multi-Context Mobile Social Networks.",
            "Collaborative Interaction for Videos on Mobile Devices Based on Sketch Gestures.",
            "Learning Structure Models with Context Information for Visual Tracking.",
            "Orientation Field Guided Texture Synthesis.",
            "A Survey on Partial Retrieval of 3D Shapes.",
            "A Survey of Visual Analytics Techniques and Applications: State-of-the-Art Research and Future Challenges.",
            "Comparative Analysis of Different Evaluation Functions for Protein Structure Prediction Under the HP Model.",
            "Who Blocks Who: Simultaneous Segmentation of Occluded Objects.",
            "A Substitution-Translation-Restoration Framework for Handling Unknown Words in Statistical Machine Translation.",
            "Automatic 3D Shape Co-Segmentation Using Spectral Graph Method.",
            "Preface.",
            "Non-Intrusive Elastic Query Processing in the Cloud.",
            "An Energy-Aware Heuristic Scheduling for Data-Intensive Workflows in Virtualized Datacenters.",
            "A Framework for Supporting Tree-Like Indexes on the Chord Overlay.",
            "HEDC++: An Extended Histogram Estimator for Data in the Cloud.",
            "Partition-Based Online Aggregation with Shared Sampling in the Cloud.",
            "Application-Aware Client-Side Data Reduction and Encryption of Personal Data in Cloud Backup Services.",
            "A Temporal Locality-Aware Page-Mapped Flash Translation Layer.",
            "RevivePath: Resilient Network-on-Chip Design Through Data Path Salvaging of Router.",
            "Low Power State Assignment Algorithm for FSMs Considering Peak Current Optimization.",
            "A Shape Graph Logic and A Shape System.",
            "Clausal Presentation of Theories in Deduction Modulo.",
            "The Infinite Evolution Mechanism of ϵ-Bisimilarity.",
            "Improving Syntactic Parsing of Chinese with Empty Element Recovery.",
            "Semantic Role Labeling of Chinese Nominal Predicates with Dependency-Driven Constituent Parse Tree Structure.",
            "CONTENTS."
        ]
    },
    {
        "name": "JCST",
        "year": "2012",
        "info": "Volume 27: 2012",
        "count": 105,
        "papers": [
            "Dynamic Uncertain Causality Graph for Knowledge Representation and Reasoning: Discrete DAG Cases.",
            "Publishing Set-Valued Data Against Realistic Adversaries.",
            "Integrating Standard Dependency Schemes in QCSP Solvers.",
            "Providing Source Code Level Portability Between CPU and GPU with MapCG.",
            "A Hybrid Circular Queue Method for Iterative Stencil Computations on GPUs.",
            "Effcient Handling of Lock Hand-off in DSM Multiprocessors with Buffering Coherence Controllers.",
            "Mercury: Combining Performance with Dependability Using Self-Virtualization.",
            "Optimal Checkpoint Placement on Real-Time Tasks with Harmonic Periods.",
            "Cell Mapping for Nanohybrid Circuit Architecture Using Genetic Algorithm.",
            "Fast Multi-Operator Image Resizing and Evaluation.",
            "Real-Time Simulation of Aeolian Sand Movement and Sand Ripple Evolution: A Method Based on the Physics of Blown Sand.",
            "HBIR: Hypercube-Based Image Retrieval.",
            "Feature-Preserving Mesh Denoising via Anisotropic Surface Fitting.",
            "New Explorations on Cannon's Contributions and Generalized Solutions for Uniform Linear Motion Blur Identification.",
            "Extended Approach to Water Flow Algorithm for Text Line Segmentation.",
            "Related Axis: The Extension to XPath Towards Effective XML Search.",
            "A Reprocessing Model for Complete Execution of RFID Access Operations on Tag Memory.",
            "Computational Challenges in Characterization of Bacteria and Bacteria-Host Interactions Based on Genomic Data.",
            "PartialRC: A Partial Recomputing Method for Efficient Fault Recovery on GPGPUs.",
            "Modeling a Dynamic Data Replication Strategy to Increase System Availability in Cloud Computing Environments.",
            "Checkpoint Management with Double Modular Redundancy Based on the Probability of Task Completion.",
            "A Novel Intermediary Framework for Dynamic Edge Service Composition.",
            "Fault Tolerance and Recovery for Group Communication Services in Distributed Networks.",
            "Diagnosing Traffic Anomalies Using a Two-Phase Model.",
            "Delay and Capacity Trade-offs in Mobile Wireless Networks with Infrastructure Support.",
            "A Dimensionality Reduction Framework for Detection of Multiscale Structure in Heterogeneous Networks.",
            "Term-Dependent Confidence Normalisation for Out-of-Vocabulary Spoken Term Detection.",
            "Fuzzy Distance-Based Range Queries over Uncertain Moving Objects.",
            "Bug Prioritization to Facilitate Bug Report Triage.",
            "HilAnchor: Location Privacy Protection in the Presence of Users' Preferences.",
            "Convex Decomposition Based Cluster Labeling Method for Support Vector Clustering.",
            "A Novel Similarity Measure to Induce Semantic Classes and Its Application for Language Model Adaptation in a Dialogue System.",
            "Preface.",
            "Community Detection in Dynamic Social Networks Based on Multiobjective Immune Algorithm.",
            "Balanced Multi-Label Propagation for Overlapping Community Detection in Social Networks.",
            "Discovering Typed Communities in Mobile Social Networks.",
            "Mining Trust Relationships from Online Social Networks.",
            "Spam Short Messages Detection via Mining Social Networks.",
            "Summarizing Large-Scale Database Schema Using Community Detection.",
            "Personalized Tag Recommendation Using Social Influence.",
            "Effective and Efficient Multi-Facet Web Image Annotation.",
            "Improving Web Document Clustering through Employing User-Related Tag Expansion Techniques.",
            "Exponential Fuzzy C-Means for Collaborative Filtering.",
            "An Effective Framework for Fast Expert Mining in Collaboration Networks: A Group-Oriented and Cost-Based Method.",
            "Personalized Semantic Based Blog Retrieval.",
            "Community-Aware Resource Profiling for Personalized Search in Folksonomy.",
            "Performance Characterization of Game Recommendation Algorithms on Online Social Network Sites.",
            "Topology-Based Recommendation of Users in Micro-Blogging Communities.",
            "Exploiting Consumer Reviews for Product Feature Ranking.",
            "Phrase-Level Sentiment Polarity Classification Using Rule-Based Typed Dependencies and Additional Complex Phrases Consideration.",
            "Preface.",
            "Satisfiability with Index Dependency.",
            "A Quadratic Lower Bound for Three-Query Linear Locally Decodable Codes over Any Field.",
            "On Isomorphism Testing of Groups with Normal Hall Subgroups.",
            "Envy-Free Pricing with General Supply Constraints for Unit Demand Consumers.",
            "Worst-Case Nash Equilibria in Restricted Routing.",
            "Pricing Loss Leaders Can be Hard.",
            "Improving Application Launch Performance on Solid State Drives.",
            "A Parallel Interval Computation Model for Global Optimization with Automatic Load Balancing.",
            "SWIP Prediction: Complexity-Effective Indirect-Branch Prediction Using Pointers.",
            "Active Store Window: Enabling Far Store-Load Forwarding with Scalability and Complexity-Efficiency.",
            "Effectiveness Analysis of DVFS and DPM in Mobile Devices.",
            "Multidimensional Projections for Visual Analysis of Social Networks.",
            "TangiWheel: A Widget for Manipulating Collections on Tabletop Displays Supporting Hybrid Input Modality.",
            "Edit Propagation via Edge-Aware Filtering.",
            "A Geometric Approach for Multi-Degree Spline.",
            "Hyperspectral Imagery Denoising Using a Spatial-Spectral Domain Mixing Prior.",
            "2D-Manifold Boundary Surfaces Extraction from Heterogeneous Object on GPU.",
            "Lazy Slicing for State-Space Exploration.",
            "An Optimized Divide-and-Conquer Algorithm for the Closest-Pair Problem in the Planar Case.",
            "Some Indices of Alphabet Overlap Graph.",
            "Preface.",
            "Evolutionary Optimization: Pitfalls and Booby Traps.",
            "A Puzzle-Based Genetic Algorithm with Block Mining and Recombination Heuristic for the Traveling Salesman Problem.",
            "Scheduling Multi-Mode Projects under Uncertainty to Optimize Cash Flows: A Monte Carlo Ant Colony System Approach.",
            "An Improved Evolvable Oscillator and Basis Function Set for Control of an Insect-Scale Flapping-Wing Micro Air Vehicle.",
            "Coverage Optimization for Defect-Tolerance Logic Mapping on Nanoelectronic Crossbar Architectures.",
            "Particle Swarm Optimization Based Support Vector Regression for Blind Image Restoration.",
            "Effect of Look-Ahead Depth in Evolutionary Checkers.",
            "Effect of Noisy Fitness in Real-Time Strategy Games Player Behaviour Optimisation Using Evolutionary Algorithms.",
            "Classification- and Regression-Assisted Differential Evolution for Computationally Expensive Problems.",
            "Differential Evolution with Adaptive Mutation and Parameter Control Using Lévy Probability Distribution.",
            "Compact Differential Evolution Light: High Performance Despite Limited Memory Requirement and Modest Computational Overhead.",
            "Exploiting Bivariate Dependencies to Speedup Structure Learning in Bayesian Optimization Algorithm.",
            "Preface.",
            "Multi-Scale Salient Features for Analyzing 3D Shapes.",
            "A Multi-Channel Salience Based Detail Exaggeration Technique for 3D Relief Surfaces.",
            "Connectivity-Based Segmentation for GPU-Accelerated Mesh Decompression.",
            "Affective Image Colorization.",
            "A Customized Framework to Recompress Massive Internet Images.",
            "A Novel Approach Towards Large Scale Cross-Media Retrieval.",
            "Synthesizing Distributed Protocol Specifications from a UML State Machine Modeled Service Specification.",
            "Hierarchical Structures on Multigranulation Spaces.",
            "Automatic Prosodic Break Detection and Feature Analysis.",
            "Data Structures in Multi-Objective Evolutionary Algorithms.",
            "Social Network-Aware Interfaces as Facilitators of Innovation.",
            "KnoE: A Web Mining Tool to Validate Previously Discovered Semantic Correspondences.",
            "A Multi-Threaded Semantic Focused Crawler.",
            "Heart Rate Extraction from Vowel Speech Signals.",
            "JacUOD: A New Similarity Measurement for Collaborative Filtering.",
            "Local Community Detection Using Link Similarity.",
            "Hybrid Parallel Bundle Adjustment for 3D Scene Reconstruction with Massive Points.",
            "Fast Image Correspondence with Global Structure Projection.",
            "A Kernel Approach to Multi-Task Learning with Task-Specific Kernels.",
            "A Unified Active Learning Framework for Biomedical Relation Extraction."
        ]
    },
    {
        "name": "JCST",
        "year": "2011",
        "info": "Volume 26: 2011",
        "count": 96,
        "papers": [
            "Preface.",
            "A New Multiword Expression Metric and Its Applications.",
            "Chinese New Word Identification: A Latent Discriminative Model with Global Features.",
            "Multi-Domain Sentiment Classification with Classifier Combination.",
            "Learning Noun Phrase Anaphoricity in Coreference Resolution via Label Propagation.",
            "Kernel-based semantic relation detection and classification via enriched parse tree structure.",
            "Improvement of Machine Translation Evaluation by Simple Linguistically Motivated Features.",
            "Using Syntactic-Based Kernels for Classifying Temporal Relations.",
            "Transfer Learning via Multi-View Principal Component Analysis.",
            "On/Off-Line Prediction Applied to Job Scheduling on Non-Dedicated NOWs.",
            "Theoretical Treatment of Target Coverage in Wireless Sensor Networks.",
            "Security of the SMS4 Block Cipher Against Differential Cryptanalysis.",
            "NuMDG: A New Tool for Multiway Decision Graphs Construction.",
            "Incremental Alignment Manifold Learning.",
            "MCGIM-Based Model Streaming for Realtime Progressive Rendering.",
            "Light Space Cascaded Shadow Maps Algorithm for Real Time Rendering.",
            "Effectively Discriminating Fighting Shots in Action Movies.",
            "Saliency-Based Fidelity Adaptation Preprocessing for Video Coding.",
            "Fuzzy Diffusion Distance Learning for Cartoon Similarity Estimation.",
            "Visibility-Aware Direct Volume Rendering.",
            "Multi-Level Partition of Unity Algebraic Point Set Surfaces.",
            "Activity Recognition Based on RFID Object Usage for Smart Mobile Devices.",
            "Software Agent with Reinforcement Learning Approach for Medical Image Segmentation.",
            "A Combinational Perspective in Stimulating Cooperation in Mobile Ad Hoc Networks.",
            "Construction of 1-Resilient Boolean Functions with Optimal Algebraic Immunity and Good Nonlinearity.",
            "Pseudo-Randomness of Certain Sequences of k Symbols with Length pq.",
            "Energy Efficient Backoff Hierarchical Clustering Algorithms for Multi-Hop Wireless Sensor Networks.",
            "A Fine-Grained Runtime Power/Performance Optimization Method for Processors with Adaptive Pipeline Depth.",
            "Design for Testability Features of Godson-3 Multicore Microprocessor.",
            "Source Code Prioritization Using Forward Slicing for Exposing Critical Elements in a Program.",
            "Software Defect Detection with Rocus.",
            "Preface.",
            "The TianHe-1A Supercomputer: Its Hardware and Software.",
            "Dawning Nebulae: A PetaFLOPS Supercomputer with a Heterogeneous Structure.",
            "The Godson Processors: Its Research, Development, and Contributions.",
            "Preface.",
            "Unified UDispatch: A User Dispatching Tool for Multicore Systems.",
            "Data Transmission with the Battery Utilization Maximization.",
            "Leakage-Aware Modulo Scheduling for Embedded VLIW Processors.",
            "Energy Efficient Block-Partitioned Multicore Processors for Parallel Applications.",
            "A Resource-Efficient Communication Architecture for Chip Multiprocessors on FPGAs.",
            "VERTAF/Multi-Core: A SysML-Based Application Framework for Multi-Core Embedded Software Development.",
            "Configuration Reusing in On-Line Task Scheduling for Reconfigurable Computing Systems.",
            "Partitioning the Conventional DBT System for Multiprocessors.",
            "Energy Efficiency of a Multi-Core Processor by Tag Reduction.",
            "Accurate and Simplified Prediction of AVF for Delay and Energy Efficient Cache Design.",
            "Physical Implementation of the Eight-Core Godson-3B Microprocessor.",
            "Automatic Narrow-Deep Feature Recognition for Mould Manufacturing.",
            "Automatic Cage Building with Quadric Error Metrics.",
            "As-Rigid-As-Possible Surface Morphing.",
            "PM-DFT: A New Local Invariant Descriptor Towards Image Copy Detection.",
            "Understanding Science Through the Computational Lens.",
            "New Methodologies for Parallel Architecture.",
            "Internetware: An Emerging Software Paradigm for Internet Computing.",
            "A Programming Language Approach to Internet-Based Virtual Computing Environment.",
            "Three New Concepts of Future Computer Science.",
            "Possibilities for Healthcare Computing.",
            "Overview of Center for Domain-Specific Computing.",
            "The Challenges of Multidisciplinary Education in Computer Science.",
            "DHC: Distributed, Hierarchical Clustering in Sensor Networks.",
            "Bootstrapping Object Coreferencing on the Semantic Web.",
            "Guided Structure-Aware Review Summarization.",
            "Aggressive Complex Event Processing with Confidence over Out-of-Order Streams.",
            "Provably Secure Role-Based Encryption with Revocation Mechanism.",
            "Improvement on the Multihop Shareholder Discovery for Threshold Secret Sharing in MANETs.",
            "Differential Attack on Five Rounds of the SC2000 Block Cipher*.",
            "A New Protocol for the Detection of Node Replication Attacks in Mobile Wireless Sensor Networks.",
            "Impossible Differential Attacks on 13-Round CLEFIA-128.",
            "Preface.",
            "Personalized News Recommendation: A Review and an Experimental Investigation.",
            "Tag-Aware Recommender Systems: A State-of-the-Art Survey.",
            "Detecting Communities in K-Partite K-Uniform (Hyper)Networks.",
            "A Posteriori Approach for Community Detection.",
            "Modeling Consensus Semantics in Social Tagging Systems.",
            "From Popularity to Personality - A Heuristic Music Recommendation Method for Niche Market.",
            "Preventing Recommendation Attack in Trust-Based Recommender Systems.",
            "Understanding and Exploiting Information Spreading and Integrating Technologies.",
            "QoS-Aware Automatic Service Composition: A Graph View.",
            "Optimizing Linpack Benchmark on GPU-Accelerated Petascale Supercomputer.",
            "Revisiting Multiple Pattern Matching Algorithms for Multi-Core Architecture.",
            "An FFT Performance Model for Optimizing General-Purpose Processor Architecture.",
            "Managing Software Requirements Changes Based on Negotiation-Style Revision.",
            "Linearly and Quadratically Separable Classifiers Using Adaptive Approach.",
            "Internet of Things: Objectives and Scientific Challenges.",
            "A Semantic Searching Scheme in Heterogeneous Unstructured P2P Networks.",
            "An Efficient Method for Cleaning Dirty-Events over Uncertain Data in WSNs.",
            "A Heuristic Algorithm for Core Selection in Multicast Routing.",
            "Minimum-Time Aggregation Scheduling in Duty-Cycled Wireless Sensor Networks.",
            "Domino Tiling: A New Method of Real-Time Conforming Mesh Construction for Rendering Changeable Height Fields.",
            "An Enhanced Drawing Reproduction Graphical Password Strategy.",
            "Multiview Visibility Estimation for Image-Based Modeling.",
            "Free Appearance-Editing with Improved Poisson Image Cloning.",
            "Formal Verification of Temporal Properties for Reduced Overhead in Grid Scientific Workflows.",
            "Structure-Based Deadlock Checking of Asynchronous Circuits.",
            "Harmonizing Melody with Meta-Structure of Piano Accompaniment Figure.",
            "Mining Effective Temporal Specifications from Heterogeneous API Data."
        ]
    },
    {
        "name": "JCST",
        "year": "2010",
        "info": "Volume 25: 2010",
        "count": 109,
        "papers": [
            "Preface.",
            "New Generations: Sequencing Machines and Their Computational Challenges.",
            "Issues in the Reconstruction of Gene Order Evolution.",
            "Challenges in Understanding Genome-Wide DNA Methylation.",
            "Genome-Wide Analysis of Epigenetic Modifications.",
            "Some Algorithmic Challenges in Genome-Wide Ortholog Assignment.",
            "Computational Challenges in Deciphering Genomic Structures of Bacteria.",
            "Metagenomics: Facts and Artifacts, and Computational Challenges.",
            "Understanding the \"Horizontal Dimension\" of Molecular Evolution to Annotate, Classify, and Discover Proteins with Functional Domains.",
            "Can We Determine a Protein Structure Quickly?",
            "Challenges in Computational Analysis of Mass Spectrometry Data for Proteomics.",
            "Protein Interactome Analysis for Countering Pathogen Drug Resistance.",
            "Network-Based Predictions and Simulations by Biological State Space Models: Search for Drug Mode of Action.",
            "Computational Cellular Dynamics Based on the Chemical Master Equation: A Challenge for Understanding Complexity.",
            "New Challenges for Biological Text-Mining in the Next Decade.",
            "System Architecture of Godson-3 Multi-Core Processors.",
            "Physical Implementation of the 1GHz Godson-3 Quad-Core Microprocessor.",
            "Research Progress of UniCore CPUs and PKUnity SoCs.",
            "YHFT-QDSP: High-Performance Heterogeneous Multi-Core DSP.",
            "Physical Design Methodology for Godson-2G Microprocessor.",
            "Managing Data-Objects in Dynamically Reconfigurable Caches.",
            "Hierarchical Cache Directory for CMP.",
            "CCNoC: Cache-Coherent Network on Chip for Chip Multiprocessors.",
            "Design and Application of Instruction Set Simulator on Multi-Core Verification.",
            "Location, Localization, and Localizability.",
            "ROAD+: Route Optimization with Additional Destination-Information and Its Mobility Management in Mobile Networks.",
            "Tree-Based Index Overlay in Hybrid Peer-to-Peer Systems.",
            "Location-Based Data Dissemination for Spatial Queries in Wireless Broadcast Environments.",
            "An Effective Semantic Cache for Exploiting XPath Query/View Answerability.",
            "A Multi-Key Pirate Decoder Against Traitor Tracing Schemes.",
            "Towards Risk Evaluation of Denial-of-Service Vulnerabilities in Security Protocols.",
            "Preface.",
            "Outlier Detection over Sliding Windows for Probabilistic Data Streams.",
            "Privacy-Preserving Data Sharing in Cloud Computing.",
            "Efficient Location Updates for Continuous Queries over Moving Objects.",
            "Towards Progressive and Load Balancing Distributed Computation: A Case Study on Skyline Analysis.",
            "Context-Sensitive Document Ranking.",
            "The Inverse Classification Problem.",
            "Annotation Based Query Answer over Inconsistent Database.",
            "HAPS: Supporting Effective and Efficient Full-Text P2P Search with Peer Dynamics.",
            "A Solution of Data Inconsistencies in Data Integration - Designed for Pervasive Computing Environment.",
            "Flash-Optimized B+-Tree.",
            "Efficient Distributed Skyline Queries for Mobile Applications.",
            "A Query Interface Matching Approach Based on Extended Evidence Theory for Deep Web.",
            "Dynamic Damage Recovery for Web Databases.",
            "Harmonic Field Based Volume Model Construction from Triangle Soup.",
            "Making Slide Shows with Zoomquilts.",
            "Model Transduction for Triangle Meshes.",
            "Feature Preserving Mesh Simplification Using Feature Sensitive Metric.",
            "Geometry Texture Synthesis Based on Laplacian Texture Image.",
            "Geometric Bone Modeling: From Macro to Micro Structures.",
            "Nonlocal-Means Image Denoising Technique Using Robust M-Estimator.",
            "Multilevel Threshold Based Image Denoising in Curvelet Domain.",
            "A New Classifier for Facial Expression Recognition: Fuzzy Buried Markov Model.",
            "Preface.",
            "Dirichlet Process Gaussian Mixture Models: Choice of the Base Distribution.",
            "Model Failure and Context Switching Using Logic-Based Stochastic Models.",
            "Combining Committee-Based Semi-Supervised Learning and Active Learning.",
            "Ordinal-Class Core Vector Machine.",
            "Learning with Uncertain Kernel Matrix Set.",
            "Learning Query Ambiguity Models by Using Search Logs.",
            "A New Approach for Multi-Document Update Summarization.",
            "Multiple Hypergraph Clustering of Web Images by MiningWord2Image Correlations.",
            "2D Correlative-Chain Conditional Random Fields for Semantic Annotation of Web Objects.",
            "Multimodal Biometric Score Fusion Using Gaussian Mixture Model and Monte Carlo Method.",
            "Robust Feature Extraction for Speaker Recognition Based on Constrained Nonnegative Tensor Factorization.",
            "New Constructions for Identity-Based Unidirectional Proxy Re-Encryption.",
            "Generic Certificateless Encryption Secure Against Malicious-but-Passive KGC Attacks in the Standard Model.",
            "Certification of Thread Context Switching.",
            "Formal Reasoning About Lazy-STM Programs.",
            "Sorting Unsigned Permutations by Weighted Reversals, Transpositions, and Transreversals.",
            "Queue Waiting Time Aware Dynamic Workflow Scheduling in Multicluster Environments.",
            "A Unified Co-Processor Architecture for Matrix Decomposition.",
            "Landing Stencil Code on Godson-T.",
            "Novel Geometrical Voxelization Approach with Application to Streamlines.",
            "Level-of-Detail Rendering of Large-Scale Irregular Volume Datasets Using Particles.",
            "Degeneracy from Twisted Cubic Under Two Views.",
            "Volumetric Vector-Based Representation for Indirect Illumination Caching.",
            "DICE: An Effective Query Result Cache for Distributed Storage Systems.",
            "Self-Adaptive Resource Management for Large-Scale Shared Clusters.",
            "ERFC: An Enhanced Recursive Flow Classification Algorithm.",
            "QoS-TEOS: QoS Guaranteed Throughput-Efficiency Optimal Distributed Scheduling in WiMAX Mesh Networks.",
            "Uncertain Distance-Based Range Queries over Uncertain Moving Objects.",
            "Building Reusable Remote Labs with Adaptable Client User-Interfaces.",
            "A Survey of Dynamic Software Metrics.",
            "Unsupervised WSD by Finding the Predominant Sense Using Context as a Dynamic Thesaurus.",
            "A Generalization of Haussler's Convolution Kernel - Mapping Kernel and Its Application to Tree Kernels.",
            "Explanation Knowledge Graph Construction Through Causality Extraction from Texts.",
            "Hierarchical Polytope ARTMAP for Supervised Learning.",
            "Multilevel Optimization for Large-Scale Hierarchical FPGA Placement.",
            "Quasi Delay-Insensitive High Speed Two-Phase Protocol Asynchronous Wrapper for Network on Chips.",
            "Preface.",
            "Semantic Interoperability Aggregation in Service Requirements Refinement.",
            "Goal-Based Automated Code Generation in Self-Adaptive System.",
            "A Cloud-Based Trust Model for Evaluating Quality of Web Services.",
            "Web Service Composition Based on QoS Rules.",
            "A Cloud-Based BPM Architecture with User-End Distribution of Non-Compute-Intensive Activities and Sensitive Data.",
            "Modeling and Verifying Concurrent Programs with Finite Chu Spaces.",
            "A Hybrid Set of Complexity Metrics for Large-Scale Object-Oriented Software Systems.",
            "Measuring Structural Quality of Object-Oriented Softwares via Bug Propagation Analysis on Weighted Software Networks.",
            "Covering-Based Routing Algorithms for Cyclic Content-Based P/S Overlays.",
            "An Uncertainty Enhanced Trust Evolution Strategy for e-Science.",
            "Efficient Relational Techniques for Processing Graph Queries.",
            "Negative Selection of Written Language Using Character Multiset Statistics.",
            "Eventual Leader Election with Weak Assumptions on Initial Knowledge, Communication Reliability, and Synchrony.",
            "Frontal and Semi-Frontal Facial Caricature Synthesis Using Non-Negative Matrix Factorization.",
            "Attribute-Based Signature with Policy-and-Endorsement Mechanism.",
            "Formally Analyzing Expected Time Complexity of Algorithms Using Theorem Proving.",
            "NP-Logic Systems and Model-Equivalence Reductions."
        ]
    },
    {
        "name": "JCST",
        "year": "2009",
        "info": "Volume 24: 2009",
        "count": 98,
        "papers": [
            "Space Deformations, Surface Deformations and the Opportunities In-Between.",
            "Gradient Domain Mesh Deformation - A Survey.",
            "Fixing Geometric Errors on Polygonal Models: A Survey.",
            "Spherical Parameterization of Marching Cubes IsoSurfaces Based upon Nearest Neighbor Coordinates.",
            "Loop Subdivision Surface Based Progressive Interpolation.",
            "Rigidity Constraints for Large Mesh Deformation.",
            "An Algorithm for Constructing 3D Struts.",
            "Evaluation for Small Visual Difference Between Conforming Meshes on Strain Field.",
            "An Abstract Reachability Approach by Combining HOL Induction and Multiway Decision Graphs.",
            "Improved Bounded Model Checking for the Universal Fragment of CTL.",
            "Certifying Concurrent Programs Using Transactional Memory.",
            "Expressing First-Order pi-Calculus in Higher-Order Calculus of Communicating Systems.",
            "n PAKE+: A Tree-Based Group Password-Authenticated Key Exchange Protocol Using Different Passwords.",
            "SRF Coloring: Stream Register File Allocation via Graph Coloring.",
            "Summarizing Vocabularies in the Global Semantic Web.",
            "Multistage Off-Line Permutation Packet Routing on a Mesh: An Approach with Elementary Mathematics.",
            "A Rigorous Architectural Approach to Adaptive Software Engineering.",
            "Software, Software Engineering and Software Engineering Research: Some Unconventional Thoughts.",
            "Formalisms to Support the Definition of Processes.",
            "Architecting Fault Tolerance with Exception Handling: Verification and Validation.",
            "Global-to-Local Approach to Rigorously Developing Distributed System with Exception Handling.",
            "QoS-Driven Self-Healing Web Service Composition Based on Performance Prediction.",
            "Do Rules and Patterns Affect Design Maintainability?",
            "Package Coupling Measurement in Object-Oriented Software.",
            "Test-Data Generation Guided by Static Defect Detection.",
            "Runtime Monitoring CompositeWeb Services Through Stateful Aspect Extension.",
            "A Secure Elliptic Curve-Based RFID Protocol.",
            "Feature-Oriented Nonfunctional Requirement Analysis for Software Product Line.",
            "Availability Analysis of Application Servers Using Software Rejuvenation and Virtualization.",
            "Demand-Driven Memory Leak Detection Based on Flow- and Context-Sensitive Pointer Analysis.",
            "QoS Requirement Generation and Algorithm Selection for Composite Service Based on Reference Vector.",
            "A Trust-Based Approach to Estimating the Confidence of the Software System in Open Environments.",
            "A Scalable Testing Framework for Location-Based Services.",
            "Taxonomy of Data Prefetching for Multicore Processors.",
            "Conditions for Set Agreement with an Application to Synchronous Systems.",
            "Multi-Dimensional Scheduling for Real-Time Tasks on Heterogeneous Clusters.",
            "Building a Distributed Infrastructure for Scalable Triple Stores.",
            "Neural Network Algorithm for Designing FIR Filters Utilizing Frequency-Response Masking Technique.",
            "A Distributed Mechanism for Handling of Adaptive/Intelligent Selfish Misbehaviour at MAC Layer in Mobile Ad Hoc Networks.",
            "Towards Next Generation Internet Management: CNGI-CERNET2 Experiences.",
            "An Improved Markov Model for IEEE 802.15.4 Slotted CSMA/CA Mechanism.",
            "Searching a Polygonal Region by a Boundary Searcher.",
            "A New Approach to Graph Recognition and Applications to Distance-Hereditary Graphs.",
            "Symbolic Algorithmic Analysis of Rectangular Hybrid Systems.",
            "A New Line Symmetry Distance and Its Application to Data Clustering.",
            "Pores-Preserving Face Cleaning Based on Improved Empirical Mode Decomposition.",
            "Boolean Operations on Conic Polygons.",
            "Lumiproxy: A Hybrid Representation of Image-Based Models.",
            "Self Localization Method Using Parallel Projection Model for Mobile Sensor in Navigation Applications.",
            "Efficient Simplification Methods for Generating High Quality LODs of 3D Meshes.",
            "Self-Switching Classification Framework for Titled Documents.",
            "Combining Local Scoring and Global Aggregation to Rank Entities for Deep Web Queries.",
            "Constraints-Aware Scheduling for Transactional Services Composition.",
            "System Pi: A Native RDF Repository Based on the Hypergraph Representation for RDF Data Model.",
            "Improved Integrity Constraints Checking in Distributed Databases by Exploiting Local Checking.",
            "Cooperative Answering of Fuzzy Queries.",
            "Prefetching J+-Tree: A Cache-Optimized Main Memory Database Index Structure.",
            "Cache-Conscious Data Cube Computation on a Modern Processor.",
            "Optimization Techniques for RFID Complex Event Processing.",
            "Edge-Aware Level Set Diffusion and Bilateral Filtering Reconstruction for Image Magnification.",
            "Facial Expression Recognition of Various Internal States via Manifold Learning.",
            "A Logic-Program-Based Negotiation Mechanism.",
            "Survivability Evaluation in Large-Scale Mobile Ad-Hoc Networks.",
            "Cost-Sensitive and Load-Balancing Gateway Placement in Wireless Mesh Networks with QoS Constraints.",
            "Combination of Qualitative Information with 2-Tuple Linguistic Representation in DSmT.",
            "A New Fuzzy Set Theory Satisfying All Classical Set Formulas.",
            "On the Modeling of Honest Players in Reputation Systems.",
            "On Desideratum for B2C E-Commerce Reputation Systems.",
            "H-Trust: A Group Trust Management System for Peer-to-Peer Desktop Grid.",
            "WTR: A Reputation Metric for Distributed Hash Tables Based on a Risk and Credibility Factor.",
            "Dishonest Behaviors in Online Rating Systems: Cyber Competition, Attack Models, and Attack Generator.",
            "A Comprehensive and Adaptive Trust Model for Large-Scale P2P Networks.",
            "RCCtrust: A Combined Trust Model for Electronic Community.",
            "A Review-Based Reputation Evaluation Approach for Web Services.",
            "ArchSim: A System-Level Parallel Simulation Platform for the Architecture Design of High Performance Computer.",
            "Parallel LDPC Decoding on GPUs Using a Stream-Based Computing Approach.",
            "Adaptive Execution of Jobs in Computational Grid Environment.",
            "Scan Cell Positioning for Boosting the Compression of Fan-Out Networks.",
            "Aspect-Oriented Modeling and Verification with Finite State Machines.",
            "Interactive Fault Localization Using Test Information.",
            "Leapfrog: Optimal Opportunistic Routing in Probabilistically Contacted Delay Tolerant Networks.",
            "Estimation of a Population Size in Large-Scale Wireless Sensor Networks.",
            "Preface.",
            "Customer Activity Sequence Classification for Debt Prevention in Social Security.",
            "Performance Evaluation of Machine Learning Methods in Cultural Modeling.",
            "Ubiquitous Mining with Interactive Data Mining Agents.",
            "Exploring Social Annotations with the Application to Web Page Recommendation.",
            "Innovative Batik Design with an Interactive Evolutionary Art System.",
            "SimK: A Large-Scale Parallel Simulation Engine.",
            "Godson-T: An Efficient Many-Core Architecture for Parallel Program Executions.",
            "Selected Crosstalk Avoidance Code for Reliable Network-on-Chip.",
            "PARBLO: Page-Allocation-Based DRAM Row Buffer Locality Optimization.",
            "A Comparison Study of Moving Object Index Structures.",
            "Approximating Geographical Queries.",
            "Logic Programs, Compatibility and Forward Chaining Construction.",
            "Distributed Coordinator Election Scheme for QoS Support and Seamless Connectivity in WPANs.",
            "Integrated Framework for Vehicle Interior Design Using Digital Human Model.",
            "A New Gradient Fidelity Term for Avoiding Staircasing Effect."
        ]
    },
    {
        "name": "JCST",
        "year": "2008",
        "info": "Volume 23: 2008",
        "count": 88,
        "papers": [
            "Preface.",
            "Orthogonal Methods Based Ant Colony Search for Solving Continuous Optimization Problems.",
            "Analyzing the Simple Ranking and Selection Process for Constrained Evolutionary Optimization.",
            "Histogram-Based Estimation of Distribution Algorithm: A Competent Method for Continuous Optimization.",
            "Interleaving Guidance in Evolutionary Multi-Objective Optimization.",
            "Spatially-Structured Sharing Technique for Multimodal Problems.",
            "Mining Frequent Generalized Itemsets and Generalized Association Rules Without Redundancy.",
            "Efficient Optimization of Multiple Subspace Skyline Queries.",
            "Clustering Text Data Streams.",
            "Characterizing Economic and Social Properties of Trust and Reputation Systems in P2P Environment.",
            "CASA: A New IFU Architecture for Power-Efficient Instruction Cache and TLB Designs.",
            "Double Barrier Coverage in Dense Sensor Networks.",
            "Preface.",
            "Algebraic Construction for Zero-Knowledge Sets.",
            "WWW Business Applications Based on the Cellular Model.",
            "An Efficient Clustering Algorithm for k -Anonymisation.",
            "Competitive Analysis of Two Special Online Device Replacement Problems.",
            "Cryptanalysis of a Type of CRT-Based RSA Algorithms.",
            "WNN-Based Network Security Situation Quantitative Prediction Method and Its Optimization.",
            "Constructing Maximum Entropy Language Models for Movie Review Subjectivity Analysis.",
            "Generic Transformation from Weakly to Strongly Unforgeable Signatures.",
            "New Sealed-Bid Electronic Auction with Fairness, Security and Efficiency.",
            "Forgeability of Wang-Tang-Li's ID-Based Restrictive Partially Blind Signature Scheme.",
            "A Robust and Fast Non-Local Means Algorithm for Image Denoising.",
            "Transition Texture Synthesis.",
            "Proper Reparametrization of Rational Ruled Surface.",
            "Chip Multithreaded Consistency Model.",
            "Middleware for Wireless Sensor Networks: A Survey.",
            "SmallWorld Model-Based Polylogarithmic Routing Using Mobile Nodes.",
            "Random and Periodic Sleep Schedules for Target Detection in Sensor Networks.",
            "Coordinated Workload Scheduling in Hierarchical Sensor Networks for Data Fusion Applications.",
            "Understanding Performance for Two 802.11 Competing Flows.",
            "Performance of IEEE 802.15.4 Clusters with Power Management and Key Exchange.",
            "Malware-Propagative Mobile Ad Hoc Networks: Asymptotic Behavior Analysis.",
            "Sensor Deployment and Relocation: A Unified Scheme.",
            "ROPAS: Cross-Layer Cognitive Architecture for Mobile UWB Networks.",
            "NBgossip: An Energy-Efficient Gossip Algorithm for Wireless Sensor Networks.",
            "Beacon-Less Geographic Routing in Real Wireless Sensor Networks.",
            "Maximizing the Delivery of MPR Broadcasting Under Realistic Physical Layer Assumptions.",
            "GBP-WAHSN: A Group-Based Protocol for Large Wireless Ad Hoc and Sensor Networks.",
            "Clustering by Pattern Similarity.",
            "PGG: An Online Pattern Based Approach for Stream Variation Management.",
            "Updating Recursive XML Views of Relations.",
            "Continually Answering Constraint k - NN Queries in Unstructured P2P Systems.",
            "New Information Distance Measure and Its Application in Question Answering System.",
            "Cluster-Based Nearest-Neighbour Classifier and Its Application on the Lightning Classification.",
            "Predicting RNA Secondary Structure Using Profile Stochastic Context-Free Grammars and Phylogenic Analysis.",
            "Query Performance Prediction for Information Retrieval Based on Covering Topic Score.",
            "Predicting Chinese Abbreviations from Definitions: An Empirical Learning Approach Using Support Vector Regression.",
            "Scaling Conditional Random Fields by One-Against-the-Other Decomposition.",
            "Making Effective Decisions in Computer Architects' Real-World: Lessons and Experiences with Godson-2 Processor Designs.",
            "Runtime Engine for Dynamic Profile Guided Stride Prefetching.",
            "New Model and Algorithm for Hardware/Software Partitioning.",
            "A General Approach to L ( h, k )-Label Interconnection Networks.",
            "Survey on Anonymity in Unstructured Peer-to-Peer Systems.",
            "Community Detection in Complex Networks.",
            "Research on Next-Generation Scalable Routers Implemented with H-Torus Topology.",
            "t-Private and t-Secure Auctions.",
            "Design and Performance Evaluation of Sequence Partition Algorithms.",
            "Some Aspects of Synchronization of DFA.",
            "Searching a Polygonal Region by Two Guards.",
            "On Constrained Facility Location Problems.",
            "Approximation Algorithms for 3D Orthogonal Knapsack.",
            "Approximation Algorithm Based on Chain Implication for Constrained Minimum Vertex Covers in Bipartite Graphs.",
            "Analysis and Implementation of an Open Programmable Router Based on Forwarding and Control Element Separation.",
            "Scalable Base-Station Model-Based Multicast in Wireless Sensor Networks.",
            "Parallel Algorithm Core: A Novel IPSec Algorithm Engine for Both Exploiting Parallelism and Improving Scalability.",
            "Uplink Scheduling for Supporting Real Time Voice Traffic in IEEE 802.16 Backhaul Networks.",
            "Flood Avoidance Mechanisms for Bridged Resilient Packet Rings.",
            "A Class of Key Predistribution Schemes Based on Orthogonal Arrays.",
            "A Provable Secure ID-Based Explicit Authenticated Key Agreement Protocol Without Random Oracles.",
            "Some Notes on Generalized Cyclotomic Sequences of Length pq.",
            "Palmprint Recognition by Applying Wavelet-Based Kernel PCA.",
            "Free-Form Deformation with Rational DMS-Spline Volumes.",
            "Guiding Attention by Cooperative Cues.",
            "Synthesizing Service Composition Models on the Basis of Temporal Business Rules.",
            "An Access Control Framework for Reflective Middleware.",
            "Cache-Based Aggregate Query Shipping: An Efficient Scheme of Distributed OLAP Query Processing.",
            "Probabilistic Adaptive Anonymous Authentication in Vehicular Networks.",
            "URECA: Efficient Resource Location Middleware for Ubiquitous Environment.",
            "Scoped Bellman-Ford Geographic Routing for Large Dynamic Wireless Sensor Networks.",
            "PEJA: Progressive Energy-Efficient Join Processing for Sensor Networks.",
            "Improved Approximate Detection of Duplicates for Data Streams Over Sliding Windows.",
            "A Semantic Cache Framework for Secure XML Queries.",
            "Adaptive Indexing of Moving Objects with Highly Variable Update Frequencies.",
            "An Effective Error Resilient Packetization Scheme for Progressive Mesh Transmission over Unreliable Networks.",
            "Higher-Order Level-Set Method and Its Application in Biomolecular Surfaces Construction.",
            "Design-for-Testability Features and Test Implementation of a Giga Hertz General Purpose Microprocessor."
        ]
    },
    {
        "name": "JCST",
        "year": "2007",
        "info": "Volume 22: 2007",
        "count": 103,
        "papers": [
            "Implementing a 1GHz Four-Issue Out-of-Order Execution Microprocessor in a Standard Cell ASIC Methodology.",
            "An Energy-Efficient Instruction Scheduler Design with Two-Level Shelving and Adaptive Banking.",
            "A 485ps 64-Bit Parallel Adder in 0.18mum CMOS.",
            "Unified Parallel Systolic Multiplier Over GF(2m).",
            "Bounded Model Checking of CTL.",
            "CSchema: A Downgrading Policy Language for XML Access Control.",
            "Two-Factor Cancelable Biometrics Authenticator.",
            "Higher-Level Hardware Synthesis of the KASUMI Algorithm.",
            "Breaking and Repairing Trapdoor-Free Group Signature Schemes from Asiacrypt'2004.",
            "Relationship Between a Non-Malleable Commitment Scheme and a Modified Selective Decommitment Scheme.",
            "Improved Collision Attack on Hash Function MD5.",
            "Secure Two-Party Point-Circle Inclusion Problem.",
            "Attack on Digital Multi-Signature Scheme Based on Elliptic Curve Cryptosystem.",
            "A New Public-Key Encryption Scheme.",
            "Efficient ID-Based Multi-Decrypter Encryption with Short Ciphertexts.",
            "Chameleon Hashes Without Key Exposure Based on Factoring.",
            "An Efficient Handoff Decision Algorithm for Vertical Handoff Between WWAN and WLAN.",
            "FloodNet: Coupling Adaptive Sampling with Energy Aware Routing in a Flood Warning System.",
            "An Efficient Data Dissemination Scheme for Spatial Query Processing.",
            "End-to-End Utilization Control for Aperiodic Tasks in Distributed Real-Time Systems.",
            "3D Morphing Using Strain Field Interpolation.",
            "Visual Simulation of Multiple Unmixable Fluids.",
            "A Markov Random Field Model-Based Approach to Natural Image Matting.",
            "Structural Join and Staircase Join Algorithms of Sibling Relationship.",
            "Load Shedding for Window Joins over Streams.",
            "MRST - An Efficient Monitoring Technology of Summarization on Stream Data.",
            "CLASCN: Candidate Network Selection for Efficient Top- k Keyword Queries over Databases.",
            "Composite Distance Transformation for Indexing and k -Nearest-Neighbor Searching in High-Dimensional Spaces.",
            "An Ontology-Based Approach for Semantic Conflict Resolution in Database Integration.",
            "A Novel Approach to Clustering Merchandise Records.",
            "Efficient k -Nearest-Neighbor Search Algorithms for Historical Moving Object Trajectories.",
            "Indexing Future Trajectories of Moving Objects in a Constrained Network.",
            "An Adaptive Approach to Schema Classification for Data Warehouse Modeling.",
            "A Novel Approach to Revealing Positive and Negative Co-Regulated Genes.",
            "Efficient Execution of Multiple Queries on Deep Memory Hierarchy.",
            "AbIx: An Approach to Content-Based Approximate Query Processing in Peer-to-Peer Data Systems.",
            "Analyzing Sequential Patterns in Retail Databases.",
            "Tree Expressions for Information Systems.",
            "Computational Mechanisms for Metaphor in Languages: A Survey.",
            "A Heuristic Clustering Algorithm for Mining Communities in Signed Networks.",
            "A Coarse-to-Fine Method for Shape Recognition.",
            "Text Classification Using Sentential Frequent Itemsets.",
            "An Empirical Study on the Impact of Automation on the Requirements Analysis Process.",
            "Developing Project Duration Models in Software Engineering.",
            "On the Estimation of the Functional Size of Software from Requirements Specifications.",
            "Software Project Effort Estimation Based on Multiple Parametric Models Generated Through Data Clustering.",
            "Component Dependency in Object-Oriented Software.",
            "Improving Software Quality Prediction by Noise Filtering Techniques.",
            "Improving Fault Detection in Modified Code - A Study from the Telecommunication Industry.",
            "A Three-Layer Model for Business Processes - Process Logic, Case Semantics and Workflow Management.",
            "Garbage Collector Verification for Proof-Carrying Code.",
            "An Anti-Counterfeiting RFID Privacy Protection Protocol.",
            "Impossible Differential Cryptanalysis of Reduced-Round ARIA and Camellia.",
            "Targeted Local Immunization in Scale-Free Peer-to-Peer Networks.",
            "Cryptanalysis of Achterbahn-Version 1 and -Version 2.",
            "Smart Proactive Caching Scheme for Fast Authenticated Handoff in Wireless LAN.",
            "Some Notes on Prime-Square Sequences.",
            "ID-Based Fair Off-Line Electronic Cash System with Multiple Banks.",
            "Simultaneous Minimization of Capacity and Conflict Misses.",
            "A Model of Grid Service Capacity.",
            "Next High Performance and Low Power Flash Memory Package Structure.",
            "Distributed Storage Cluster Design for Remote Mirroring Based on Storage Area Network.",
            "Adaptive Call Admission Control Based on Reward-Penalty Model in Wireless/Mobile Network.",
            "Engineering the Divide-and-Conquer Closest Pair Algorithm.",
            "An Improvement of Herbrand's Theorem and Its Application to Model Generation Theorem Proving.",
            "Consistency Property of Finite FC-Normal Logic Programs.",
            "Comparison of Semantics of Disjunctive Logic Programs Based on Model-Equivalent Reduction.",
            "Quasi-Physical Algorithm of an Off-Lattice Model for Protein Folding Problem.",
            "Barbed Congruence of Asymmetry and Mismatch.",
            "Spatially Adaptive Image Restoration Using Fuzzy Punctual Kriging.",
            "Real-Time Texture Synthesis Using s-Tile Set.",
            "AHT Bézier Curves and NUAH B-Spline Curves.",
            "Linguistic Theory Based Contextual Evidence Mining for Statistical Chinese Co-Reference Resolution.",
            "Secure and Incidental Distortion Tolerant Digital Signature for Image Authentication.",
            "Facial Feature Extraction Method Based on Coefficients of Variances.",
            "Hierarchical Approximate Matching for Retrieval of Chinese Historical Calligraphy Character.",
            "Server-Based Data Push Architecture for Multi-Processor Environments.",
            "A Yield-Driven Gridless Router.",
            "A Novel VLSI Architecture for Real-Time Line-Based Wavelet Transform Using Lifting Scheme.",
            "Leakage Current Optimization Techniques During Test Based on Don't Care Bits Assignment.",
            "Low Cost Scan Test by Test Correlation Utilization.",
            "Cooperating CoScheduling: A Coscheduling Proposal Aimed at Non-Dedicated Heterogeneous NOWs.",
            "A Semi-Random Multiple Decision-Tree Algorithm for Mining Data Streams.",
            "Efficient Mining of Frequent Closed XML Query Pattern.",
            "HCH for Checking Containment of XPath Fragment.",
            "Differentials-Based Segmentation and Parameterization for Point-Sampled Surfaces.",
            "Accelerated Parallel Texture Optimization.",
            "Fast Adaptive Wavelet for Remote Sensing Image Compression.",
            "A New FIR Filter for State Estimation and Its Application.",
            "Revocable Ring Signature.",
            "Wavelet Based Image Authentication and Recovery.",
            "Short Group Signatures Without Random Oracles.",
            "A Protocol for a Private Set-Operation.",
            "Autocorrelation Values of New Generalized Cyclotomic Sequences of Order Two and Length pq.",
            "Simulation and Visualisation of Functional Landscapes: Effects of the Water Resource Competition Between Plants.",
            "Simple Reconstruction of Tree Branches from a Single Range Image.",
            "A Fast Ambient Occlusion Method for Real-Time Plant Rendering.",
            "Human Gait Recognition Based on Kernel PCA Using Projections.",
            "Mining Causality for Explanation Knowledge from Text.",
            "Fiducial Marker Based on Projective Invariant for Augmented Reality.",
            "An Improved HEAPSORT Algorithm with n log n - 0.788928 n Comparisons in the Worst Case.",
            "A Differential Evolution Approach for Protein Folding Using a Lattice Model.",
            "Generating Combinations by Three Basic Operations."
        ]
    },
    {
        "name": "JCST",
        "year": "2006",
        "info": "Volume 21: 2006",
        "count": 121,
        "papers": [
            "Recent Advances in Evolutionary Computation.",
            "P-Tree Structures and Event Horizon: Efficient Event-Set Implementations.",
            "An Improved Algorithm for Finding the Closest Pair of Points.",
            "Revisiting the Meaning of Requirements.",
            "Remove Irrelevant Atomic Formulas for Timed Automaton Model Checking.",
            "Efficient Incremental Maintenance for Distributive and Non-Distributive Aggregate Functions.",
            "A Workflow Process Mining Algorithm Based on Synchro-Net.",
            "TCP Issues in Mobile Ad Hoc Networks: Challenges and Solutions.",
            "Pseudorandomness of Camellia-Like Scheme.",
            "A Near-Optimal Optimization Algorithm for Link Assignment in Wireless Ad-Hoc Networks.",
            "Communication Between Speech Production and Perception Within the Brain-Observation and Simulation.",
            "A Dialectal Chinese Speech Recognition Framework.",
            "Image Region Selection and Ensemble for Face Recognition.",
            "Quaternion Diffusion for Color Image Filtering.",
            "Novel Cluster Validity Index for FCM Algorithm.",
            "A Test Approach for Look-Up Table Based FPGAs.",
            "ACO-Steiner: Ant Colony Optimization Based Rectilinear Steiner Minimal Tree Algorithm.",
            "Inflatable Models.",
            "Real-Time Watercolor for Animation.",
            "Reflection and Refraction on Implicit Surfaces.",
            "Texture Pattern Generation Using Clonal Mosaic.",
            "View Dependent Sequential Point Trees.",
            "Real-Time Optimal Reach-Posture Prediction in a New Interactive Virtual Environment.",
            "Bernoulli Embedding Model and Its Application in Texture Mapping.",
            "Representation of Urban Buildings Using Modified Relief Mapping.",
            "The Number of Independent Kruppa Constraints from N Images.",
            "A New Method of Manifold Mosaic for Large Displacement Images.",
            "A Novel Variational Image Model: Towards a Unified Approach to Image Editing.",
            "Automatic Shape Control of Triangular B-Splines of Arbitrary Topology.",
            "Radial Supershapes for Solid Modeling.",
            "DBSC-Based Grayscale Line Image Vectorization.",
            "Specification of Initial Shapes for Dynamic Implicit Curve/Surface Reconstruction.",
            "Connolly Surface on an Atomic Structure via Voronoi Diagram of Atoms.",
            "Determining Knots by Minimizing Energy.",
            "Generation of Discrete Bicubic G1 B-Spline Ship Hullform Surfaces from a Given Curve Network Using Virtual Iso-Parametric Curves.",
            "Modeling in Multi-Resolution and Its Applications.",
            "Geometric Properties of Ribs and Fans of a Bézier Curve.",
            "Efficient Computation of k-Medians over Data Streams Under Memory Constraints.",
            "PMC: Select Materialized Cells in Data Cubes.",
            "Preface.",
            "AVS Intellectual Property Rights (IPR) Policy.",
            "Performance Comparison of AVS and H.264/AVC Video Coding Standards.",
            "Context-Based 2D-VLC Entropy Coder in AVS Video Coding Standard.",
            "A Novel MBAFF Scheme of AVS.",
            "AVS-M: From Standards to Applications.",
            "Low-Complexity Tools in AVS Part 7.",
            "Low Complexity Integer Transform and Adaptive Quantization Optimization.",
            "Introduction to AVS Audio.",
            "Basic Considerations on AVS DRM Architecture.",
            "An Efficient VLSI Architecture for Motion Compensation of AVS HDTV Decoder.",
            "Improved FFSBM Algorithm and Its VLSI Architecture for AVS Video Standard.",
            "Second Attribute Algorithm Based on Tree Expression.",
            "Force-Based Incremental Algorithm for Mining Community Structure in Dynamic Network.",
            "Constraint-Based Fuzzy Models for an Environment with Heterogeneous Information-Granules.",
            "Agent-Oriented Probabilistic Logic Programming.",
            "Checking Content Consistency of Integrated Web Documents.",
            "GDM: A New Graph Based Data Model Using Functional Abstractionx.",
            "A Supervised Learning Approach to Search of Definitions.",
            "A Component-Based Debugging Approach for Detecting Structural Inconsistencies in Declarative Equation Based Models.",
            "Visual Similarity Based Document Layout Analysis.",
            "Scalable and Practical Nonblocking Switching Networks.",
            "Optimal Routing in a Small-World Network.",
            "An SPN-Based Integrated Model for Web Prefetching and Caching.",
            "Coverage and Exposure Paths in Wireless Sensor Networks.",
            "Random Walk Routing in WSNs with Regular Topologies.",
            "2DCMA: An Effective Maintenance Algorithm of Materialized Views in Peer Data Management Systems.",
            "Globus Toolkit Version 4: Software for Service-Oriented Systems.",
            "Design and Implementation of NAREGI SuperScheduler Based on the OGSA Architecture.",
            "Automatic Transaction Compensation for Reliable Grid Applications.",
            "Client-Centric Adaptive Scheduling of Service-Oriented Applications.",
            "QoS-Aware Composite Services Retrieval.",
            "A Heuristic Algorithm for Task Scheduling Based on Mean Load on Grid.",
            "Performance Aware Service Pool in Dependable Service Oriented Architecture.",
            "A Semantic Matchmaker for Ranking Web Services.",
            "Facilitating Service Discovery with Semantic Overlay.",
            "Using DragPushing to Refine Concept Index for Text Categorization.",
            "Dynamic Query Optimization Approach for Semantic Database Grid.",
            "BEAP: An End-User Agile Programming Paradigm for Business Applications.",
            "Extending Interactive Web Services for Improving Presentation Level Integration in Web Portals.",
            "High Performance General-Purpose Microprocessors: Past and Future.",
            "Usability Issues of Grid System Software.",
            "Massive Storage Systems.",
            "Study on Parallel Computing.",
            "Progress and Challenges in High Performance Computer Technology.",
            "Development of Software Engineering: A Research Perspective.",
            "Software Reliability Experimentation and Control.",
            "Some Issues on Computer Networks: Architecture and Key Technologies.",
            "Research on Next-Generation Internet Architecture.",
            "Research on Network Architecture with Trustworthiness and Controllability.",
            "Progress and Prospect of Some Fundamental Research on Information Security in China.",
            "Automated Reasoning and Equation Solving with the Characteristic Set Method.",
            "Model Checking Data Consistency for Cache Coherence Protocols.",
            "Some Issues in Quantum Information Theory.",
            "Beyond Knowledge Engineering.",
            "Multi-Instance Learning from Supervised View.",
            "Progress and Challenge of Artificial Intelligence.",
            "Database Research: Achievements and Challenges.",
            "Chinese Information Processing and Its Prospects.",
            "Digital Differential Geometry Processing.",
            "Fingerprint-Based Identity Authentication and Digital Media Protection in Network Environment.",
            "Hybrid Nanoelectronics: Future of Computer Technology.",
            "Low-Complexity Bit-Parallel Multiplier over GF(2m) Using Dual Basis Representation.",
            "Toward the Optimal Configuration of Dynamic Voltage Scaling Points in Real-Time Applications.",
            "Parallel Error Detection for Leading Zero Anticipation.",
            "Test Time Minimization for Hybrid BIST of Core-Based Systems.",
            "Priority-Based Routing Resource Assignment Considering Crosstalk.",
            "General Floorplans with L/T-Shaped Blocks Using Corner Block List.",
            "Influences of Gate Operation Errors in the Quantum Counting Algorithm.",
            "Verification of Authentication Protocols for Epistemic Goals via SAT Compilation.",
            "Direct Model Checking Matrix Algorithm.",
            "A Note on the Stopping Redundancy of Linear Codes.",
            "EAFoC: Enterprise Architecture Framework Based on Commonality.",
            "Code Based Analysis for Object-Oriented Systems.",
            "Improvement of Performance of MegaBlast Algorithm for DNA Sequence Alignment.",
            "A Note on Non-Closure Property of Sublogarithmic Space-Bounded 1-Inkdot Alternating Pushdown Automata with Only Existential (Universal) States.",
            "Semi-Online Algorithms for Scheduling with Machine Cost.",
            "Effective I/O Scheme Based on RTP for Multimedia Communication Systems.",
            "Inter-Cluster Routing Authentication for Ad Hoc Networks by a Hierarchical Key Scheme.",
            "Parallel Switch System with QoS Guarantee for Real-Time Traffic.",
            "Design and Analysis of a Multiscale Active Queue Management Scheme.",
            "Bandwidth Reservation Using Velocity and Handoff Statistics for Cellular Networks."
        ]
    },
    {
        "name": "JCST",
        "year": "2005",
        "info": "Volume 20: 2005",
        "count": 106,
        "papers": [
            "Preface.",
            "Penalty Formulations and Trap-Avoidance Strategies for Solving Hard Satisfiability Problems.",
            "Parameterized Computation and Complexity: A New Approach Dealing with NP-Hardness.",
            "Formal Verification Techniques Based on Boolean Satisfiability Problem.",
            "Adapt Bagging to Nearest Neighbor Classifiers.",
            "Searching Databases with Keywords.",
            "Effect of Count Estimation in Finding Frequent Itemsets over Online Transactional Data Streams.",
            "Online Palmprint Identification System for Civil Applications.",
            "Polygonal Shape Blending with Topological Evolutions.",
            "A Quotient Space Approximation Model of Multiresolution Signal Analysis.",
            "Predicate µ-Calculus for Mobile Ambients.",
            "BLOSSOMS: Building Lightweight Optimized Sensor Systems on a Massive Scale.",
            "CORBA-Based Analysis of Multi Agent Behavior.",
            "Integrating Parallelizing Compilation Technologies for SMP Clusters.",
            "Urban Traffic Information Service Application Grid.",
            "Viewpoints on Grid Standards.",
            "Book Review on \"Out of Their Minds: The Lives and Discoveries of 15 Great Computer Scientists\".",
            "Perface.",
            "Design and Verification of High-Speed VLSI Physical Design.",
            "Efficient RT-Level Fault Diagnosis.",
            "VFSim: Concurrent Fault Simulation at Register Transfer Level.",
            "Fault Diagnosis of Physical Defects Using Unknown Behavior Model.",
            "Delay Testing Viability of Gate Oxide Short Defects.",
            "Test Resource Partitioning Based on Efficient Response Compaction for Test Time and Tester Channels Reduction.",
            "On Test Data Compression Using Selective Don't-Care Identification.",
            "A Wiring-Aware Approach to Minimizing Built-In Self-Test Overhead.",
            "Modeling and Analysis of Mesh Tree Hybrid Power/Ground Networks with Multiple Voltage Supply in Time Domain.",
            "Crosstalk-Aware Routing Resource Assignment.",
            "A Novel Multiple-Valued CMOS Flip-Flop Employing Multiple-Valued Clock.",
            "Microarchitecture of the Godson-2 Processor.",
            "Analysis of Software Test Item Generation - Comparison Between High Skilled and Low Skilled Engineers.",
            "Secure Two-Party Computational Geometry.",
            "Implementation of Cryptosystems Based on Tate Pairing.",
            "Extended Methodology of RS Design and Instances Based on GIP.",
            "RWBO(pdw): A Novel Backoff Algorithm for IEEE 802.11 DCF.",
            "RSAD: A Robust Distributed Contention-Based Adaptive Mechanism for IEEE 802.11 Wireless LANs.",
            "Knowledge Map: Mathematical Model and Dynamic Behaviors.",
            "Bridging Real World Semantics to Model World Semantics for Taxonomy Based Knowledge Representation System.",
            "Multi-Scaling Sampling: An Adaptive Sampling Method for Discovering Approximate Association Rules.",
            "Fuzzy Constraint-Based Agent Negotiation.",
            "Computation on Sentence Semantic Distance for Novelty Detection.",
            "Logical Sentences as the Intent of Concepts.",
            "Parallel Data Cube Storage Structure for Range Sum Queries and Dynamic Updates.",
            "Accomplishing Deterministic XML Query Optimization.",
            "Semi-Closed Cube: An Effective Approach to Trading Off Data Cube Size and Query Response Time.",
            "Declarative XML Update Language Based on a Higher Data Model.",
            "Illumination Invariant Recognition of Three-Dimensional Texture in Color Images.",
            "Blending Canal Surfaces Based on PH Curves.",
            "Effects of Local-Lag Mechanism on Task Performance in a Desktop CVE System.",
            "Arabic Word Recognition by Classifiers and Context.",
            "Wavelet Energy Feature Extraction and Matching for Palmprint Recognition.",
            "Phase Correlation Based Iris Image Registration Model.",
            "Complete Multiple Description Mesh-Based Video Coding Scheme and Its Performance.",
            "Preface.",
            "Integrating mRNA Decay Information into Co-Regulation Study.",
            "Transcriptional Regulatory Networks Activated by PI3K and ERK Transduced Growth Signals in Human Glioblastoma Cells.",
            "Test Data Sets and Evaluation of Gene Prediction Programs on the Rice Genome.",
            "RNA Structural Homology Search with a Succinct Stochastic Grammar Model.",
            "Intrinsic Terminator Prediction and Its Application in Synechococcus sp. WH8102.",
            "PRIME: A Mass Spectrum Data Mining Tool for De Nova Sequencing and PTMs Identification.",
            "Robustness Analysis of the IFN-y Induced JAK-STAT Signaling Pathway.",
            "Mechanizing Weakly Ground Termination Proving of Term Rewriting Systems by Structural and Cover-Set Inductions.",
            "Action Refinement for Real-Time Concurrent Processes with Urgency.",
            "LFTOP: An LF-Based Approach to Domain-Specific Reasoning.",
            "Some Representation Theorems for Recovering Contraction Relations.",
            "StarBus+: Distributed Object Middleware Practice for Internet Computing.",
            "A New Retrieval Model Based on TextTiling for Document Similarity Search.",
            "Evolutionary Pseudo-Relaxation Learning Algorithm for Bidirectional Associative Memory.",
            "Ganglion-Based Balance Design of Multi-Layer Model and Its Watchfulness-Keeping.",
            "The Knowledge Grid.",
            "Forword.",
            "Single-Cycle Bit Permutations with MOMR Execution.",
            "The Value of a Small Microkernel for Dreamy Memory and the RAMpage Memory Hierarchy.",
            "A Novel Memory Structure for Embedded Systems: Flexible Sequential and Random Access Memory.",
            "A Power-Aware Branch Predictor by Accessing the BTB Selectively.",
            "Performance Evaluation of Data Value Prediction Schemes.",
            "Micro-Task Processing in Heterogeneous Reconfigurable Systems.",
            "Multiple-Morphs Adaptive Stream Architecture.",
            "Power Efficient Sub-Array in Reconfigurable VLSI Meshes.",
            "User-Level Device Drivers: Achieved Performance.",
            "Hardware-Software Collaborative Techniques for Runtime Profiling and Phase Transition Detection.",
            "Secure Application-Aware Service Differentiation in Public Area Wireless Networks.",
            "Techniques for Determining the Geographic Location of IP Addresses in ISP Topology Measurement.",
            "RMAC: A Reliable MAC Protocol Supporting Multicast for Wireless Ad Hoc Networks.",
            "Approximation Algorithms for Steiner Connected Dominating Set.",
            "Dynamic Fuzzy Controlled RWA Algorithm for IP/GMPLS over WDM Networks.",
            "Clonal Strategy Algorithm Based on the Immune Memory.",
            "Progress in Computational Complexity Theory.",
            "Towards a Mathematical Theory of Knowledge.",
            "Complexities of Homomorphism and Isomorphism for Definite Logic Programs.",
            "L-Tree Match: A New Data Extraction Model and Algorithm for Huge Text Stream with Noises.",
            "A Generalized Real-Time Obstacle Avoidance Method Without the Cspace Calculation.",
            "An Ontology-Based Framework for Semi-Automatic Schema Integration.",
            "QoS Support in TDMA-Based Mobile Ad Hoc Networks.",
            "Broadcast-Based Spatial Queries.",
            "Fault-Tolerant Wormhole Routing with 2 Virtual Channels in Meshes.",
            "Quantitative QoS Management Implement Mechanism in IP-DiffServ.",
            "A General Sufficient Condition of Four Positive Solutions of the P3P Problem.",
            "A New Technique for Digital Image Watermarking.",
            "Robust Non-Frontal Face Alignment with Edge Based Texture.",
            "Visual Ontology Construction for Digitized Art Image Retrieval.",
            "Generating Symbolic Interpolants for Scattered Data with Normal Vectors.",
            "An Efficient Evaluation and Vector Generation Method for Observability-Enhanced Statement Coverage.",
            "An Error Recoverable Structure Based on Complementary Logic and Alternating-Retry.",
            "Novel Synthesis and Optimization of Multi-Level Mixed Polarity Reed-Muller Functions.",
            "Shielding Area Optimization Under the Solution of Interconnect Crosstalk."
        ]
    },
    {
        "name": "JCST",
        "year": "2004",
        "info": "Volume 19: 2004",
        "count": 107,
        "papers": [
            "Foreword - Special Issue on Bioinformatics.",
            "An Algorithm for Finding Conserved Secondary Structure Motifs in Unaligned RNA Sequences.",
            "Outleir Analysis for Gene Expression Data.",
            "Verbumculus and the Discovery of Unusual Words.",
            "The Complexity of Checking Consistency of Pedigree Information and Related Problems.",
            "Integer Programming Models for Computational Biology Problems.",
            "Encoding of Primary Structures of Biological Macromolecules Within a Data Mining Perspective.",
            "Membrane Automata with Priorities.",
            "Trends in Computing with DNA.",
            "Web Caching: A Way to Improve Web QoS.",
            "Provisioning QoS Guarantee by Multipath Routing and Reservation in Ad Hoc Networks.",
            "A Conceptual Model of Service Customization and Its Implementation.",
            "Performance Enhancement and Bandwidth Guarantee in IEEE 802.11 Wireless LANs.",
            "An Analytical Framework for Performance of Different Fault Restoration Policies with QoS Constraints in MPLS Networks.",
            "Authenticating Tripartite Key Agreement Protocol with Pairings.",
            "A General Probability Formula of the Number of Location Areas' Boundaries Crossed by a Mobile Between Two Successive Call Arrivals.",
            "On Fault Tolerance of 3-Dimensional Mesh Networks.",
            "Fault-Tolerant Scheduling for Real-Time Embedded Control Systems .",
            "Verifying Functions in Online Stock Trading Systems.",
            "QoS Routing Optimization Strategy Using Genetic Algorithm in Optical Fiber Communication Networks.",
            "A New Family of Interconnection Networks of Fixed Degree Three.",
            "RPE Query Processing and Optimization Techniques for XML Databases.",
            "Domain-Specific Ontology of Botany.",
            "Rule Extraction: Using Neural Networks or for Neural Networks?",
            "A Note on the Single Genotype Resolution Problem.",
            "From Sequential Pattern Mining to Structured Pattern Mining: A Pattern-Growth Approach.",
            "Representing Topological Relationships Among Heterogeneous Geometry-Collection Features.",
            "Domain-Specific Formal Ontology of Archaeology and Its Application in Knowledge Acquisition and Analysis.",
            "Incremental Maintenance of Quotient Cube Based on Galois Lattice..",
            "Chopper: Efficient Algorithm for Tree Mining.",
            "Discovering User Profiles for Web Personalized Recommendation.",
            "Regular Disjunction-Free Default Theories.",
            "A Framed Temporal Logic Programming Language.",
            "Towards a Theory of Bisimulation for the Higher-Order Process Calculi.",
            "Process Algebra Approach to Reasoning About Concurrent Actions.",
            "Single View Based Measurement on Space Planes.",
            "Unified Probabilistic Models for Face Recognition from a Single Example Image per Person.",
            "Droplet: A Virtual Brush Model to Simulate Chinese Calligraphy and Painting.",
            "Super-Resolution Reconstruction of Image Sequence Using Multiple Motion Estimation Fusion.",
            "Improving Retrieval Performance by Region Constraints and Relevance Feedback.",
            "An Orientation Update Message Filtering Algorithm in Collaborative Virtual Environments.",
            "Reduct and Attribute Order.",
            "Time Complexity Analysis of an Evolutionary Algorithm for Finding Nearly Maximum Cardinality Matching.",
            "Model Checking Real-Time Value-Passing Systems.",
            "Binary-Coding-Based Ant Colony Optimization and Its Convergence.",
            "Chinese Question-Answering System.",
            "Learning-Based Tracking of Complex Non-Rigid Motion.",
            "New Algorithm for 3D Facial Model Reconstruction and Its Application in Virtual Reality.",
            "Efficient Fingerprint Matching Algorithm for Integrated Circuit Cards.",
            "Robust Mesh Smoothing.",
            "Realistic Modeling and Animation of Human Body Based on Scanned Data.",
            "Printed Arabic Character Recognition Using HMM.",
            "New Multipole Method for 3-D Capacitance Extraction.",
            "Oblivious Polynomial Evaluation.",
            "New Semantic Model for Authentication Protocols in ASMs.",
            "Practical Secret Sharing Scheme Realizing Generalized Adversary Structure.",
            "Digital Multi-Signature Scheme Based on the Elliptic Curve Cryptosystem.",
            "Automatic Modeling of Virtual Humans and Body Clothing.",
            "MuscleBuilder: A Modeling Tool for Human Anatomy.",
            "Geometric Signal Compression.",
            "Multiresolution Free Form Object Modeling with Point Sampled Geometry.",
            "Surface Detail Capturing for Realistic Facial Animation.",
            "Anti-Aliased Rendering of Water Surface.",
            "Layered Textures for Image-Based Rendering.",
            "Method of Direct Texture Synthesis on Arbitrary Surfaces.",
            "PDE Surface Generation with Combined Closed and Non-Closed Form Solutions.",
            "Estimating Subdivision Depth of Catmull-Clark Surfaces.",
            "Algebraic Conditions for Classifying the Positional Relationships Between Two Conics and Their Applications.",
            "Parametric Tracking of Legs by Exploiting Intelligent Edge.",
            "Unified Model in Identity Subspace for Face Recognition.",
            "Gradient-Based Approach for Fine Registration of Panorama Images.",
            "Image Magnification Method Using Joint Diffusion.",
            "Leakage Current Estimation of CMOS Circuit with Stack Effect.",
            "Automatic Circuit Extractor for HDL Description Using Program Slicing.",
            "HSM2: A New Heuristic State Minimization Algorithm for Finite State Machine.",
            "Preemptive Semi-Online Scheduling with Tightly-Grouped Processing Times.",
            "New Meta-Heuristic for Combinatorial Optimization Problems: Intersection Based Scaling.",
            "Image Authentication Based on Digital Signature and Semi-Fragile Watermarking.",
            "Optimal Parallel Algorithm for the Knapsack Problem Without Memory Conflicts.",
            "Fault Tolerant Algorithm Based on Dynamic and Active Load Balancing for Redundant Services.",
            "Algorithm Based on Taboo Search and Shifting Bottleneck for Job Shop Scheduling.",
            "Approximation Algorithm for Weighted Weak Vertex Cover.",
            "Max-Flow Problem in Undirected Planar Networks with Node Capacities Being in NC.",
            "Approximation Algorithm for Bottleneck Steiner Tree Problem in the Euclidean Plane.",
            "Verifying Mutual Exclusion and Liveness Properties with Split Preconditions.",
            "Symmetric Structure in Logic Programming.",
            "Automatic Generation of Symbolic Model for Parameterized Synchronous Systems.",
            "Geometry Theorem Proving by Decomposing Polynomial Systems into Strong Regular Sets.",
            "Operational Semantics and a Consistency Result for Real-Time Concurrent Processes with Action Refinement.",
            "Practical Type Checking of Functions Defined on Context-Free Languages.",
            "Model for Slicing JAVA Programs Hierarchically.",
            "Measuring Class Cohesion Based on Dependence Analysis.",
            "Extracting Frequent Connected Subgraphs from Large Graph Sets.",
            "Efficient Incremental Maintenance of Frequent Patterns with FP-Tree.",
            "Striping and Scheduling for Large Scale Multimedia Servers.",
            "Integrated Differentiated Survivability in IP over WDM Networks.",
            "DRMR: Dynamic-Ring-Based Multicast Routing Protocol for Ad Hoc Networks.",
            "New Approach to WLAN Security with Synchronized Pseudo Random.",
            "Semantic and Structural Analysis of TV Diving Programs.",
            "Memorizable Interactive Proof and Zero-Knowledge Proof Systems.",
            "Distributed Oblivious Function Evaluation and Its Applications.",
            "A Novel Framework for IP DiffServ over Optical Burst Switching Networks.",
            "A New Classification of Path-Delay Fault Testability in Terms of Stuck-at Faults.",
            "I/O Performance of an RAID-10 Style Parallel File System.",
            "Fast Evaluation of Bounded Slice-Line Grid.",
            "Some Results on the Minimal Coverings of Precomplete Classes in Partial k-Valued Logic Functions.",
            "Erratum to A framed temporal logic programming language."
        ]
    },
    {
        "name": "JCST",
        "year": "2003",
        "info": "Volume 18: 2003",
        "count": 100,
        "papers": [
            "A Simple Fault-Tolerant Adaptive and Minimal Routing Approach in 3-D Meshes.",
            "A Fast Block-Matching Algorithm Using Smooth Motion Vector Field Adaptive Search Technique.",
            "Image-Based Synthesis of Chinese Landscape Painting.",
            "Automatic Target Detection by Optimal Morphological Filters.",
            "3DIVE: An Immersive Environment for Interactive Volume Data Exploration.",
            "Accelerated Backward Warping.",
            "Fuzzy Functional Dependencies and Bayesian Networks.",
            "Clustering in Very Large Databases Based on Distance and Density.",
            "A Hybrid Distributed Optimistic Concurrency Control Method for High-Performance Real-Time Transaction Processing.",
            "Secure Web Transaction with Anonymous Mobile Agent over Internet.",
            "Unified Parallel Lattice Structures for Block Time-Recursive Real-Valued Discrete Gabor Transforms.",
            "Approach to the Correlation Discovery of Chinese Linguistic Parameters Based on Bayesian Method.",
            "A Programmable Approach to Maintenance of a Finite Knowledge Base.",
            "Further Improvement on Dynamic Programming for Optimal Bit Allocation.",
            "CALA: A Web Analysis Algorithm Combined with Content Correlation Analysis Method.",
            "Fixed-Parameter Tractability of Disjunction-Free Default Reasoning.",
            "A New Approximation Algorithm for Sorting of Signed Permutations.",
            "Incorporating Linguistic Structure into Maximum Entropy Language Models.",
            "Problems in the Information Dissemination of the Internet Routing.",
            "Verification of Duration Systems Using an Approximation Approach.",
            "Construction of Feature-Matching Perception in Virtual Assembly.",
            "Specification and Verification of Multimedia Synchronization in Duration Calculus.",
            "I-Satchmore: An Improvement of A-SATCHMORE.",
            "Fault-Tolerant Systems with Concurrent Error-Locating Capability.",
            "DCF+: An Enhancement for Reliable Transport Protocol over WLAN.",
            "An Efficient Key Assignment Scheme Based on One-Way Hash Function in a User Hierarchy.",
            "A Motion Compensated Lifting Wavelet Codec for 3D Video Coding.",
            "Quantitative Adaptive RED in Differentiated Service Networks.",
            "A Cost Effective Fault-Tolerant Scheme for RAIDs.",
            "Improved Method to Generate Path-Wise Test Data.",
            "Multi-Cue-Based Face and Facial Feature Detection on Video Segments.",
            "Allocating Network Resources by Weight Between TCP Traffics.",
            "A Constraint Satisfaction Neural Network and Heuristic Combined Approach for Concurrent Activities Scheduling.",
            "A Site-Based Proxy Cache.",
            "An Admission Control Scheme for End-to-End Statistical QoS Provision in IP Networks.",
            "Stability Analysis of Buffer Priority Scheduling Policies Using Petri Nets.",
            "Outline of Initial Design of the Structured Hypertext Transfer Protocol.",
            "IDDT: Fundamentals and Test Generation.",
            "A Novel RT-Level Behavioral Description Based ATPG Method.",
            "FaSa: A Fast and Stable Quadratic Placement Algorithm.",
            "Power Minimization of FPRM Functions Based on Polarity Conversion.",
            "Inferring Solids Composed of Linear and Quadratic Surfaces from Incomplete Three Views.",
            "A Context-Aware Infrastructure for Supporting Applications with Pen-Based Interaction.",
            "Decomposing a Kind of Weakly Invertible Finite Automata with Delay 2.",
            "A New Dynamical Evolutionary Algorithm Based on Statistical Mechanics.",
            "Dynamic Retransmission Control for Reliable Mobile Multicast.",
            "Mapping PUNITY to UniNet.",
            "Fast Algorithms for Revision of Some Special Propositional Knowledge Bases.",
            "Characterization of an Auto-Compatible Default Theory.",
            "Nonrepudiable Proxy Multi-Signature Scheme.",
            "Managing Very Large Document Collections Using Semantics.",
            "PHC: A Fast Partition and Hierarchy-Based Clustering Algorithm.",
            "Preface.",
            "VEGA Infrastructure for Resource Discovery in Grids.",
            "Fault-Tolerant Grid Architecture and Practice.",
            "Self-Adaptive Clock Synchronization for Computational Grid.",
            "QoS Guided Min-Min Heuristic for Grid Task Scheduling.",
            "Data Management in Peer-to-Peer Environment: A Perspective of BestPeer.",
            "Knowledge Base Grid: A Generic Grid Architecture for Semantic Web.",
            "DSI: Distributed Service Integration for Service Grid.",
            "CAFISE: An Approach to Enabling Adaptive Configuration of Service Grid Applications.",
            "Towards a Uniform Cooperative Platform: Cova Approach and Experience.",
            "A Grid Middleware for Distributed Java Computing with MPI Binding and Process Migration Supports.",
            "A Theorem on Grid Access Control.",
            "SDPG: Spatial Data Processing Grid.",
            "Future Trends in Computer Graphics: How Much is Enough?",
            "Recent Progress on Selected Topics in Database Research - A Report by Nine Young Chinese Researchers Working in the United States.",
            "Study on Strand Space Model Theory.",
            "Probabilistic Belief Logic and Its Probabilistic Aumann Semantics.",
            "Eliminating Redundant Search Space on Backtracking for Forward Chaining Theorem Proving.",
            "Approaches for Constrained Parametric Curve Interpolation.",
            "PCBA: A Priority-Based Competitive Broadcasting Algorithm in Mobile Ad Hoc Networks.",
            "IEEE 802.11 Distributed Coordination Function: Enhancement and Analysis.",
            "A Distributed Fair Scheduling Scheme in Wireless LAN.",
            "A Commit Strategy for Distributed Real-Time Transaction.",
            "SSTT: Efficient Local Search for GSI Global Routing.",
            "A Fuzzy Approach to Classification of Text Documents.",
            "Maintaining Discovered Frequent Itemsets: Cases for Changeable Database and Support.",
            "A Novel Multiresolution Fuzzy Segmentation Method on MR Image.",
            "Concept Framework for Audio Information Retrieval: ARF.",
            "The Haplotyping Problem: An Overview of Computational Models and Solutions.",
            "Space-Time Coding and Signal Processing for MIMO Communications.",
            "Research on Scheduling Algorithms in Web Cluster Servers.",
            "Pseudo-Cycle-Based Multicast Routing in Wormhole-Routed Networks.",
            "Minimizing ADMs on WDM Directed Fiber Trees.",
            "CNB: A Critical-Network-Based Timing Optimization Method for Standard Cell Global Routing.",
            "Deterministic VLSI Block Placement Algorithm Using Less Flexibility First Principle.",
            "A Method to Build a Super Small but Practically Accurate Language Model for Handheld Devices.",
            "Towards Robustness to Speech Rate in Mandarin All-Syllable Recognition.",
            "Combining Static Analysis and Case-Based Search Space Partitioning for Reducing Peak Memory in Model Checking.",
            "Analyzing and Mining Ordered Information Tables.",
            "Fast Construction of Plant Architectural Models Based on Substructure Decomposition.",
            "Kernel-Based Nonlinear Discriminant Analysis for Face Recognition.",
            "An Efficient Optimization Procedure for Tetrahedral Meshes by Chaos Search Algorithm.",
            "Real-Time Ray Casting Rendering of Volume Clipping in Medical Visualization.",
            "Scheduling Algorithms Based on Weakly Hard Real-Time Constraints.",
            "A Super-Resolution Method with EWA - Elliptical Weighted Average.",
            "Evaluation and Choice of Various Branch Predictors for Low-Power Embedded Processor.",
            "Integrating Scene Parallelism in Camera Auto-Calibration.",
            "Semantic Language and Multi-Language MT Approach Based on SL."
        ]
    },
    {
        "name": "JCST",
        "year": "2002",
        "info": "Volume 17: 2002",
        "count": 101,
        "papers": [
            "Interleaving Radiosity.",
            "Innovating Web Page Classification Through Reducing Noise.",
            "A New Classification Method to Overcome.",
            "A New Synchronization Algorithm for VHDL-AMS Simulation.",
            "An Effective Randomized QoS Routing Algorithm on Networks with Inaccurate Parameters.",
            "Checking MSC Specifications for Timing Inconsistency.",
            "Requirements Specifications Checking of Embedded Real-Time Software.",
            "Constraint-Based Partial Evaluation for Imperative Languages.",
            "Testing Congruence for Mobile Processes.",
            "Speech Detection in Non-Stationary Noise Based on the 1/f Process.",
            "OpenMP on Networks of Workstations for Software DSMs.",
            "Solving Inheritance Anomaly with OMNets.",
            "The Impact of Non-Gaussian Distribution Traffic on Network Performance.",
            "Why RTL ATPG?",
            "Sequential Combination Methods for Data Clustering Analysis.",
            "Digital Image Watermarking Based on Discrete Wavelet Transform.",
            "Performance Evaluation of a Parallel Cascade Semijoin Algorithm for Computing Path Expressions in Object Database Systems.",
            "A Fast Scalable Classifier Tightly Integrated with RDBMS.",
            "Interactive and Symbolic Data Dependence Analysis Based on Ranges of Expressions.",
            "IPULOC - Exploring Dynamic Program Locality with the Instruction Processing Unit for Filling Memory Gap.",
            "Practical Fast Computation of Zernike Moments.",
            "Automatic Segmentation of News Items Based on Video and Audio Features.",
            "A Rejection Model Based on Multi-Layer Perceptrons for Mandarin Digit Recognition.",
            "A Mixed-Mode BIST Scheme Based on Folding Compression.",
            "Deep Performance Analysis of Refined Harmonic Bin Packing Algorithm.",
            "A Non-Collision Hash Trie-Tree Based Fast IP Classification Algorithm.",
            "A Rate-Based Flow Control Mechanism for Avoiding Congestion.",
            "Greylevel Difference Classification Algorithm in Fractal Image Compression.",
            "A Novel Computer Architecture to Prevent Destruction by Viruses.",
            "Mandarin Pronunciation Modeling Based on CASS Corpus.",
            "From Active to Passive - Progress in Testing Internet Routing Protocols.",
            "An Algebraic Hardware/Software Partitioning Algorithm.",
            "Extracting and Sharing Knowledge from Medical Texts.",
            "Effective Discovery of Exception Class Association Rules.",
            "Singularity Analysis of Geometric Constraint Systems.",
            "A New Algorithm for Generalized Optimal Discriminant Vectors.",
            "Agent Cooperation Based Control Integration by Activity-Sharing and Joint Intention.",
            "An Algorithm Based on Tabu Search for Satisfiability Problem.",
            "Automatic Image-Based Pencil Sketch Rendering.",
            "Study of General Incomplete Star Interconnection Networks.",
            "Two Accelerating Techniques for 3D Reconstruction.",
            "Structure of Weakly Invertible Semi-Input-Memory Finite Automata with Delay 1.",
            "Data Extraction from the Web Based on Pre-Defined Schema.",
            "A Transactional Asynchronous Replication Scheme for Mobile Database Systems.",
            "Hybrid Broadcast for the Video-on-Demand Service.",
            "Optimal Bandwidth Utilization of All-Optical Ring with a Converter of Degree 4.",
            "An Effective Feedback Control Mechanism for DiffServ Architecture.",
            "A Component-Based Software Configuration Management Model and Its Supporting System.",
            "Run-Time Data-Flow Analysis.",
            "An Attack-Finding Algorithm for Security Protocols.",
            "An Interlingua-Based Chinese-English MT System.",
            "Four-Point Wavelets and Their Applications.",
            "A New Algebraic Modelling Approach to Distributed Problem-Solving in MAS.",
            "Word Spotting Based on a posterior Measure of Keyword Confidence.",
            "Blending Parametric Patches with Subdivision Surfaces.",
            "The Contiguity in R/M.",
            "A Hybrid Model for Smoke Simulation.",
            "The Existence Condition of r-Acyclic Database Schemes with MVDs Constraints.",
            "Progress in the Development of National Knowledge Infrastructure.",
            "Formal Ontology: Foundation of Domain Knowledge Sharing and Reusing.",
            "Relationship Between Support Vector Set and Kernel Functions in SVM.",
            "Kernel Projection Algorithm for Large-Scale SVM Problems.",
            "Toward Effective Knowledge Acquisition with First-Order Logic Induction.",
            "A Reduction Algorithm Meeting Users' Requirements.",
            "ARMiner: A Data Mining Tool Based on Association Rules.",
            "A Semi-Structured Document Model for Text Mining.",
            "Squeezer: An Efficient Algorithm for Clustering Categorical Data.",
            "Compressed Data Cube for Approximate OLAP Query Processing.",
            "Designing a Top-Level Ontology of Human Beings: A Multi-Perspective Approach.",
            "Ontology-Based Semantic Cache in AOKB.",
            "A Graphical mu-Calculus and Local Model Checking.",
            "Aqueous Computing: A Survey with an Invitation to Participate.",
            "Structure of Weakly Invertible Semi-Input-Memory Finite Automata with Delay 2.",
            "Checking Temporal Duration Properties of Timed Automata.",
            "An Optimum Placement Search Algorithm Based on Extended Corner Block List.",
            "Automatic Generation of Interprocedural Data-Flow Analyzers and Optimizers.",
            "Lower Bound Estimation of Hardware Resources for Scheduling in High-Level Synthesis.",
            "BIST Design for Detecting Multiple Stuck-Open Faults in CMOS Circuits Using Transition Count.",
            "SPMH: A Solution to the Problem of Malicious Hosts.",
            "Multiparty Authentication Services and Key Agreement Protocols with Semi-Trusted Third Party.",
            "A Model-Based Approach to Object-Oriented Software Metrics.",
            "Behavior Relativity of Petri Nets.",
            "Semi-Online Scheduling with Machine Cost.",
            "Distributing and Scheduling Divisible Task on Parallel Communicating Processors.",
            "Variables Bounding Based Retiming Algorithm.",
            "Clustering DTDs: An Interactive Two-Level Approach.",
            "Efficient Non-Repudiation Multicast Source Authentication Schemes.",
            "Fair Electronic Cash Based on Double Signatur.",
            "Selection of Secure Hyperelliptic Curves of g_2 Based on a Subfield.",
            "A Tracing Algorithm for Surface-Surface Intersections on Surface Boundaries.",
            "Physics-Based Loop Surface Modeling.",
            "Head Tracking Using Shapes and Adaptive Color Histograms.",
            "An Image Retrieval Method Using DCT Features.",
            "Optimistic Voting for Managing Replicated Data.",
            "Automatic Mesh Generation on a Regular Background Grid.",
            "Coordinating Mobile Agents by the XML-Based Tuple Space.",
            "A Personalized Information Dissemination System Based on How-Net.",
            "Internet Network Resource Information Model.",
            "Combining Trigram and Automatic Weight Distribution in Chinese Spelling Error Correction.",
            "Spontaneous Speech Parsing in Travel Information Inquiring and Booking Systems.",
            "Semantic Computation in a Chinese Question-Answering System."
        ]
    },
    {
        "name": "JCST",
        "year": "2001",
        "info": "Volume 16: 2001",
        "count": 63,
        "papers": [
            "Investigation on AQ11, ID3 and the Principle of Discernibility Matrix.",
            "Semantics of Constructions (I) - The Traditional Approach.",
            "A Non-Blocking Locking Method and Performance Evaluation on Network of Workstations.",
            "Verifying Time Petri Nets by Linear Programming.",
            "Guidelines for Creating a Rule-Based Knowledge Learning System and Their Application to a Chinese Business Card Layout Analysis.",
            "A New Mesh Simplification Algorithm Based on Triangle Collapses.",
            "Towards a Denotational Semantics of Timed RSL Using Duration Calculus.",
            "Extending the Cooper Minimal Pair Theorem.",
            "Fuzzy Association Degree with Delayed Time in Temporal Data Model.",
            "An Improved Error Handling Method in SNMPv2 Protocol Operations.",
            "Robot Self-Location by Line Correspondences.",
            "AHBP: An Efficient Broadcast Protocol for Mobile Ad Hoc Networks.",
            "Optimal Selection of Reference Set for the Nearest Neighbor Classification by Tabu Search.",
            "Semantics of Constructions (II) - The Initial Algebraic Approach.",
            "An Intuitive Formal Proof for Deadline Driven Scheduler.",
            "Pattern Matching Compilation of Functions Defined in Context-Free Languages.",
            "Evolving Information Filtering for Personalized Information Service.",
            "Two Online Algorithms for the Ambulance Systems.",
            "Efficient Mining of Association Rules by Reducing the Number of Passes over the Database.",
            "Leaf Movement Simulation.",
            "New Algorithms for the Perspective-Three-Point Problem.",
            "From Concepts to Consistent Object Specifications: Translation of a Domain-Oriented Feature Framework into Practice.",
            "Dynamic Data Prefetching in Home-Based Software DSMs.",
            "A New Approach to Pointer Analysis for Assignments.",
            "A Formal Software Development Approach Using Refinement Calculus.",
            "CWA Formalizations in Multi-Valued Logics.",
            "Relaxation Algorithm of Piecing-Error for Sub-Images.",
            "A Loop-Based Apparatus for At-Speed Self-Testing.",
            "Type System in Programming Languages.",
            "A Study on Wavelet Data Compression of a Real-Time Monitoring System for Large Hydraulic Machines.",
            "Some Contributions to Nonmonotonic Consequence.",
            "Approximate Sorting of Packet-Scheduling in High-Speed Networks.",
            "Constraints on Extensions of a Default Theory.",
            "Hair Image Generation Using Connected Texels.",
            "The Application of the Comparable Corpora in Chinese-English Cross-Lingual Information Retrieval.",
            "A Fast Algorithm for Mining Sequential Patterns from Large Databases.",
            "A Fault-Tolerant Routing Scheme in Dynamic Networks.",
            "Closed World Assumption for Disjunctive Reasoning.",
            "Hardness and Methods to Solve CLIQUE.",
            "Fault-Tolerant Tree-Based Multicasting in Mesh Multicomputers.",
            "Improved Relevance Ranking in WebGather.",
            "A Pragmatic Behavior Subtyping Relation Based on Both States and Actions.",
            "Notes on Liveness and Boundedness of Extended Strong Asymmetric Choice Nets II.",
            "Hyper-Distributed Hyper-Parallel Self-Organizing Dynamic Scheduling Based on Solitary Wave.",
            "Geometric Deformations Based on 3D Volume Morphing.",
            "An Algorithm for LOD by Merging Near Coplanar Faces Based on Gauss Sphere.",
            "Robust Speech Recognition Method Based on Discriminative Environment Feature Extraction.",
            "Study on Distributed Knowledge Information System for Product Design.",
            "Node Grouping in System-Level Fault Diagnosis.",
            "Efficient Indirect All-to-All Personalized Communication on Rings and 2-D Tori.",
            "Comparative Study of Two Flow Control Mechanisms in High Speed Networks.",
            "Reduction Algorithms Based on Discernibility Matrix: The Ordered Attributes Method.",
            "Domains via Graphs.",
            "BCL-3: A High Performance Basic Communication Protocol for Commodity Superserver DAWNING-3000.",
            "oodOPT: A Semantics-Based Concurrency Control Framework for Fully-Replicated Architecture.",
            "Active Network Supports for Mobile IP.",
            "CIM Algorithm for Approximating Three-Dimensional Polygonal Curves.",
            "Extracting Local Schema from Semistructured Data Based on Graph-Oriented Semantic Model.",
            "New Color Constancy Model for Machine Vision.",
            "Extracting Objects from Ada83 Programs: A Case Study.",
            "Comparison of Different Implementations of MFCC.",
            "Constraint-Preserving Architecture Transformations: A Graph Rewriting Approach.",
            "A Sufficient Condition for a Wire-Frame Representing a Solid Modeling Uniquely."
        ]
    },
    {
        "name": "JCST",
        "year": "2000",
        "info": "Volume 15: 2000",
        "count": 73,
        "papers": [
            "Computing Bisimulations for Finite-Control pi-Calculus.",
            "Constructing Finite Automata with Invertibility by Transformation Method.",
            "Multi-Volume CAD Modeling for Heterogeneous Object Design and Fabrication.",
            "Volumetric Virtual Environments.",
            "An Accelerated Incremental Radiosity Algorithm.",
            "Constraint-Based Virtual Solid Modeling.",
            "Extraction of Spatial-Temporal Features for Vision-Based Gesture Recognition.",
            "Using Confidence Interval to Summarize the Evaluating Results of DSM Systems.",
            "Timing-Sequence Testing of Parallel Programs.",
            "A Practical Algorithm for the Minimum Rectilinear Steiner Tree.",
            "Direct 3D Painting with a Metaball-Based Paintbrush.",
            "A Formal Framework of Multi-Agent Systems with Requirement/Service Cooperative Style.",
            "Efficient Minimum Spanning Tree Algorithms on the Reconfigurable Mesh.",
            "The Faster Higher-Order Cellular Automaton for Hyper-Parallel Undistorted Data Compression.",
            "An Architectural Model for Intelligent Network Management.",
            "Fuzzy Neural Network Based Traffic Prediction and Congestion Control in High-Speed Networks.",
            "Information Service Model with Mobile Agent Supported.",
            "Multicast Protocol for Uni-Directional Networks.",
            "SFT: A Consistent Checkpointing Algorithm with Short Freezing Time.",
            "A Semantics-Based Approach for Achieving Self Fault-Tolerance of Protocols.",
            "A New Speaker Verification Method with Global Speaker Model and Likelihood Score Normalization.",
            "A Note on Closeness between NP-Hard Sets and C=P.",
            "An Action Analysis for Combining Partial Evaluation.",
            "Operational and Complete Approaches to Belief Revision.",
            "Efficient Aggregation Algorithms on Very Large Compressed Data Warehouses.",
            "Extending the Relational Model to Deal with Probabilistic Data.",
            "Incremental Mining of the Schema of Semistructured Data.",
            "Design and Implementation of an Interoperable Object Platform for Multi-Databases.",
            "Fast Algorithms of Mining Probability Functional Dependency Rules in Relational Database.",
            "Linear Strategy for Boolean Ring Based Theorem Proving.",
            "A New Indexing Method Based on Word Proximity for Chinese Text Retrieval.",
            "A Causal Model for Diagnostic Reasoning.",
            "An Optimal Online Algorithm for Halfplane Intersection.",
            "Infomarker - A New Internet Information Service System.",
            "Input-Trees of Finite Automata and Application to Cryptanalysis.",
            "Forecasting the Efficiency of Test Generation Algorithms for Combinational Circuits.",
            "High Level Synthesis for Loop-Based BIST.",
            "Word Segmentation Based on Database Semantics in NChiql.",
            "Optimum Tactics of Parallel Multi-Grid Algorithm with Virtual BoundaryForecast Method Running on a Local Network with the PVM Platform.",
            "Reduction of Artifacts in Images from MR Truncated Data Using Singularity Spectrum Analysis.",
            "Dynamic Organization and Methodology for Agile Virtual Enterprises.",
            "The Distributed Workflow Management System - FlowAgent.",
            "Cycle-Based Algorithm Used to Accelerate VHDL Simulation.",
            "Generalized Multidimensional Association Rules.",
            "SCR Algorithm: Saving/Restoring States of File Systems.",
            "Average-Case Analysis of Algorithms Using Kolmogorov Complexity.",
            "Renaming a Set of Non-Horn Clauses.",
            "Decision Tree Complexity of Graph Properties with Dimension at Most 5.",
            "Checking Timed Automata for Linear Duration Properties.",
            "Default Reasoning and Belief Revision: A Syntax-Independent Approach.",
            "Some Structural Properties of SAT.",
            "Supporting Flexible Data Distribution in Software DSMs.",
            "Limited Multiple-Writer: An Approach to Dealing with False Sharing in Software DSMs.",
            "Improving the Syllable-Synchronous Network Search Algorithm for Word Decoding in Continuous Chinese Speech Recognition.",
            "Exploiting Deterministic TPG for Path Delay Testing.",
            "Implementation of a Prototype VoIP System.",
            "Study on Translating Chinese into Chinese Sign Language.",
            "An Aided Tool for Enterprise Network Design.",
            "An End-to-End QoS Control Model for Enhanced Internet.",
            "Approaches for Scaling DBSCAN Algorithm to Large Spatial Databases.",
            "POTENTIAL: A Highly Adaptive Core of Parallel Database System.",
            "Dynamic Interval Index Structure in Constraint Database Systems.",
            "Partial Completion of Equational Theories.",
            "LinuxDirector: A Connection Director for Scalable Internet Services.",
            "An Optimal Multicast Algorithm for Cube-Connected Cycles.",
            "Design and Implementation of Java Just-in-Time Compiler.",
            "Implementation of Java Card Virtual Machine.",
            "A New Linguistic Decoding Method for Online Handwritten Chinese Character Recognition.",
            "The Differential Equation Algorithm for General Deformed Swept Volumes.",
            "Distributed and Cooperative Information Retrieval on the World Wide Web.",
            "A Fast Algorithm for Mining Association Rules.",
            "DPAL: Deductive Language for Embroidery Pattern Assembling.",
            "A Logic Filter for Tumor Detection on Mammograms."
        ]
    },
    {
        "name": "JCST",
        "year": "1999",
        "info": "Volume 14: 1999",
        "count": 73,
        "papers": [
            "On optimizing the satisfiability (SAT) problem.",
            "HarkMan - A vocabulary-independent keyword spotter for spontaneous Chinese speech.",
            "Chinese TrueType font support in X window.",
            "The \"bottleneck\" behaviours in linear feedforward neural network classifiers and their breakthrough.",
            "An inherent probabilistic aspect of the Hough transform.",
            "Exploiting the capabilities of the interconnection network on Dawning-1000.",
            "Computing the SKT reliability of acyclic directed networks using factoring method.",
            "Multicast address management and connection control based on hierarchical autonomous structure.",
            "Geometric primitive extraction by the combination of tabu search and subpixel accuracy.",
            "A formal approach to protocol performance testing.",
            "An analytical delay model.",
            "On dependability of computing systems.",
            "A syntactic proof of the conservativity of λω over λ2.",
            "Phase semantics for a pure noncommutative linear propositional logic.",
            "Characterizations and algorithms of extensions for CADL and QDL.",
            "Deciding quasi-reducibility using witnessed test sets.",
            "An efficient parallel graph edge matching algorithm and its applications.",
            "A general scheme for formalizing defaults using the predicate ab(I, S).",
            "Universal abstract consistency class and universal refutation.",
            "Decidability of mean value calculus.",
            "The twisted-cube connected networks.",
            "Multimedia data modeling based on temporal logic and XYZ System.",
            "Where does the time go in software DSMs? - Experiences with JIAJIA.",
            "Reference implementation of scalable I/O low-level API on Intel Paragon.",
            "Hierarchical bulk synchronous parallel model and performance optimization.",
            "Asynchronous heterogeneous mechanism for hyper-distributed hyper-parallel AI processing.",
            "Garbage collection in uncoordinated checkpointing algorithms.",
            "Fast multicast on multistage interconnection networks using multi-head worms.",
            "An assignment method for IPUs in distributed systems.",
            "A model for dynamic adaptive coscheduling.",
            "A multimedia synchronization model based on timed Petri net.",
            "Video key frame extraction by unsupervised clustering and feedback adjustment.",
            "Approximation for knapsack problems with multiple constraints.",
            "On the arc consistency problem.",
            "On k -positive satisfiability problem.",
            "An incremental approach to automatic algorithm design.",
            "Relative properties of frame language.",
            "Topology in process calculus (I): Limit behaviour of agents.",
            "The sequence modeling method based on ECC in developing program specifications.",
            "View creation for queries in object oriented databases.",
            "A theory of hybrid diagnosis.",
            "An approach to active learning for classifier systems.",
            "Fault tolerance of reconfigurable bi-directional double-loop LANs.",
            "Isomorphic transformations of uncertainties for incorporating EMYCIN-style and PROSPECTOR-style systems into a distributed expert system.",
            "RAO logic for multiagent framework.",
            "Automated analysis of the SCR-style requirements specifications.",
            "Dynamic checking framework for Java Beans semantic constraints.",
            "Function Definition Language FDL and its implementation.",
            "Reasoning about concurrent actions in multi-agent systems.",
            "Genetic Programming with simple loops.",
            "Preface.",
            "Recent advances in automated theorem proving on inequalities.",
            "Orthogonal drawings of graphs for the automation of VLSI circuit design.",
            "Automated generation of Kempe linkage and its complexity.",
            "Solving SAT by algorithm transform of Wu's method.",
            "Fast theorem-proving and Wu's Method.",
            "Object-oriented analysis of ELIMINO.",
            "The intelligent CAI system for chemistry based on automated reasoning.",
            "The multiplicity of zeros of algebraic system in eigenvalue method.",
            "Hyperfinite interpolation, Wu's Method and blending of implicit algebraic surfaces.",
            "An approach to support IP multicasting in networks with mobile hosts.",
            "A neural paradigm for time-varying motion segmentation.",
            "Bounded algebra and current-mode digital circuits.",
            "A distributed algorithm for multi-region problem in BEM.",
            "Technical decisions on several key problems in VHDL high level synthesis system.",
            "A new parallel-by-cell approach to undistorted data compression based on cellular automaton and genetic algorithm.",
            "Computing the K -terminal reliability for SONET self-healing rings.",
            "The impact of self-similar traffic on network delay.",
            "A framework of auto-adapting distributed object for mobile computing.",
            "Demand Priority Protocol simulation and evaluation.",
            "Studies on algorithms for self-stabilizing communication protocols.",
            "An approach to concurrent TTCN test generation.",
            "An improvement of GNY logic for the reflection attacks."
        ]
    },
    {
        "name": "JCST",
        "year": "1998",
        "info": "Volume 13: 1998",
        "count": 71,
        "papers": [
            "An interactive learning algorithm for acquisition of concepts represented as CFL.",
            "A hopeful CNF-SAT algorithm - Its high efficiency, industrial application and limitation.",
            "Intuitionistic logic as the implement of incremental model construction for natural language.",
            "Reduction of cycle unification of type Cpg+r.",
            "Completeness of the accumulation calculus.",
            "Document analysis by crosscount approach.",
            "Multiplicative inhibitory velocity detector and multi-velocity motion detection neural network model.",
            "Segmentation of stick text based on sub connected area analysis.",
            "A type of triangular ball surface and its properties.",
            "Line-art and its mathematical models.",
            "A formal approach to protocol interoperability testing.",
            "A topology designing system for a computer network.",
            "A lock-based cache coherence protocol for scope consistency.",
            "A framework of memory consistency models.",
            "Out-of-order execution in sequentially consistent shared-memory systems: Theory and experiments.",
            "Parallel implementation of linear algebra problems on Dawning-1000.",
            "Functional-level Fault Simulation with concurrent and parallel mechanisms using object-oriented VLSI model.",
            "The processing and improvement of multi-statement queries in Chiql.",
            "Tableau systems for paraconsistency and minimal inconsistency.",
            "Analysis on attribute reduction strategies of rough set.",
            "The least fixpoint transformation for disjunctive logic programs.",
            "Symmetric π-calculus.",
            "Intuitive minimal abduction in sequent calculi.",
            "A surface rendering approach in 3D rectilinear datafield.",
            "A knowledge representation model for video-based animation.",
            "C 2-( C 3-) continuous interpolation spline curve and surface.",
            "Deformable registration of digital images.",
            "A traffic partition algorithm for switched LANs and its performance analysis.",
            "An efficient multiple predicate learner.",
            "Extract rules by using rough set and knowledge-based NN.",
            "Acoustic simulation with dynamic mechanisms in virtual reality.",
            "Extracting schema from an OEM database.",
            "Graph traversal and top-down evaluation of logic queries.",
            "Extending STL with efficient data structures.",
            "Concurrent manipulation of expanded AVL trees.",
            "On model, memory management and interface in EDBMS/3.",
            "An overview of data mining and knowledge discovery.",
            "FCV1: A new fast greedy covering algorithm.",
            "Normalized exponential neural networks.",
            "Report from CSCWID'97.",
            "A new definition of the Hough transform.",
            "Hardware assisted fast volume rendering with boundary enhancement.",
            "A multiscale approach to automatic medical image segmentation using self-organizing map.",
            "A new algorithm for two-dimensional line clipping via geometric transformation.",
            "Element-partition-based methods for visualization of 3D unstructured grid data.",
            "Center-distance continuous probability models and the distance measure.",
            "Range information propagation transform.",
            "Modeling distributed multimedia synchronization with DSPN.",
            "Research on the optimal parallel algorithms of broadcast-class problems.",
            "A neural network model based on logical operations.",
            "The supervised learning Gaussian mixture model.",
            "An image-based virtual reality prototype system.",
            "Preface.",
            "Playing games and proving properties of concurrent systems.",
            "Some notes on graph automata, tiling systems and partition logic.",
            "Process Calculi for describing distributed systems.",
            "Simply-typed underdeterminism.",
            "Calculi for concurrent processes.",
            "Reaction graph.",
            "An invitation to friendly testing.",
            "A crash course in λ-calculus.",
            "Another definition of order-sorted algebra.",
            "An overview of Duration Calculus.",
            "Formal derivation of graph algorithmic programs using partition-and-recur.",
            "Explicit substitutions: A short survey.",
            "Dependent type system with subtyping (I) type level transitivity elimination.",
            "Structures definable in polymorphism.",
            "Verifying automata specification of distributed probabilistic real-time systems.",
            "Program construction by verifying specification.",
            "Experimental study on strategy of combining SAT algorithms.",
            "ρ Graph: Rendezvous ordering graph for Ada concurrent programs."
        ]
    },
    {
        "name": "JCST",
        "year": "1997",
        "info": "Volume 12: 1997",
        "count": 58,
        "papers": [
            "Optimal algorithm for algebraic factoring.",
            "Mechanical geometry theorem proving based on groebner bases.",
            "R-calculus for ELP: An operational approach to knowledge base maintenance.",
            "Implementation of GAMMA on a massively parallel computer.",
            "R aRb transformation of compound finite automata over commutative rings.",
            "Performance prediction of the hough transform.",
            "Existence and uniqueness in shape from shading.",
            "An approach to user interface specification with attribute grammars.",
            "Neural network methods for NURBS curve and surface interpolation.",
            "Parsing with dynamic rule selection.",
            "Parallel algorithm design on some distributed systems.",
            "Exploiting loop parallelism with redundant execution.",
            "Strategy and simulation of adaptive RID for distributed dynamic load balancing in parallel systems.",
            "A multiagent dynamic interaction testbed: Theoretic framework, system architecture and experimentation.",
            "Determination of horizontal motion through optical flow computations.",
            "The minimum feature subset selection problem.",
            "A practical propositional knowledge base revision algorithm.",
            "Dawning-1000 PROOS distributed operating system.",
            "Scheduling PVM tasks.",
            "A log-index weighted cepstral distance measure for speech recognition.",
            "An approach to intelligent speech production system.",
            "A switched capacitor harmonic compensation part for switching supplies.",
            "Hierarchical geometric constraint model for parametric feature based modeling.",
            "Dynamic fractal transform with applications to image data compression.",
            "Representing quadric surfaces using NURBS surfaces.",
            "Three-dimensional volume datafield reconstruction from physical model.",
            "A higher-order unification algorithm for inductive types and dependent types.",
            "Nondeterministic temporal relations in multimedia data.",
            "A logical design method for relational databases based on generalization and aggregation semantics.",
            "Fuzzy logic control ASIC chip.",
            "Path sensitization.",
            "Hanzix and Chinese open system platform.",
            "FAPKC3: A new finite automaton public key cryptosystem.",
            "MNP: A class of NP optimization problems.",
            "A unified approach for developing efficient algorithmic programs.",
            "Asynchronous superimposition mechanisms of concurrent competitve waves for hyper-distributed hyper-parallel heuristic problem solving.",
            "A reasoning mechanism for deductive object-oriented databases.",
            "Magic sets revisited.",
            "Short-time scaling of variable ordering of OBDDs.",
            "System architectural design for delivering video mail over the World-Wide-Web.",
            "A stochastic approach for blurred image restoration and optical flow computation on field image sequence.",
            "A multi-view face recognition system.",
            "Simulation of waters.",
            "A radiosity solution for curved surface environments.",
            "Constructive sets in computable sets.",
            "A partial evaluator for a parallel lambda language.",
            "NUAPC: A parallelizing compiler for C++.",
            "Mapping between 2-d meshes of the same size.",
            "CIMS network protocol and its net models.",
            "Knowledge representation in KDD based on linguistic atoms.",
            "Counting and topological order.",
            "On the expressive power of F-logic language.",
            "Techniques of integrating Datalog with PROLOG.",
            "Hyper-distributed hyper-parallel implementation of heuristic search of implicit AND/OR graph.",
            "Concurrent competitive wave approach to hyper-distributed hyper-parallel AI processing.",
            "The expansion postponement in Pure Type Systems.",
            "Contour matching using wavelet transform and multigrid methods.",
            "Minimum QOS parameter set in transport layer."
        ]
    },
    {
        "name": "JCST",
        "year": "1996",
        "info": "Volume 11: 1996",
        "count": 62,
        "papers": [
            "Advanced geometric modeler with hybrid representation.",
            "A subdivision scheme for rational triangular Bézier surfaces.",
            "Fast ray tracing NURBS surfaces.",
            "A skeleton-based approach of automatically generating some Chinese typefaces.",
            "On-line predicting behaviors of jobs in dynamic load balancing.",
            "SDL-TRAN - An interactive generator for formal description language SDL.",
            "Towards a declarative semantics of inheritance with exceptions.",
            "Processing of uncertainty temporal relations.",
            "Reasoning in H -net: A unified approach to intelligent hypermedia systems.",
            "Hybridity in embedded computing systems.",
            "An operational approach to belief revision.",
            "Belief revision by sets of sentences.",
            "Some undecidable problems on approximability of NP optimization problems.",
            "NNF and NNPrF - Fuzzy Petri Nets based on neural network for knowledge representation, reasoning and learning.",
            "Synchronization-Oriented placement and retrieval strategies for delay-sensitive media streams.",
            "Class based contextual logic for DOOD.",
            "Necessary conditions of two-level Uncertainty Reasoning Model (URM) and the improvement on it.",
            "Design technique of I2L circuits based on multi-valued logic.",
            "A new method for reasoning about action.",
            "Guest editors' introduction.",
            "A dynamic load balancing mechanism for distributed systems.",
            "Reliable communication on cube-based multicomputers.",
            "Global register allocation for SIMD multiprocessors.",
            "A direct approach for finding loop transformation matrices.",
            "Parallel solutions for large-scale general sparse nonlinear systems of equations.",
            "An efficient computational method for solving nonlinear matrix equation and its application in queuing analysis.",
            "Hand interface in traditional modeling and animation tasks.",
            "Reconfigurable optical bus and performance optimization.",
            "A comparative analysis of different arbitration protocols for multiple-bus multiprocessors.",
            "Embedding binary tree in VLSI/WSI processor array.",
            "Design and implementation of a concurrency control mechanism in an object-oriented database system.",
            "An algorithm for determining minimal reduced-coverings of acyclic database schemes.",
            "Normalization of class hierarchy in databases.",
            "The Temporal mechanisms in HBase.",
            "Diagnostic problem solving using first principles and heuristics.",
            "Fuzzy logic based behavior fusion for navigation of an intelligent mobile robot.",
            "A kind of Multistage Interconnection Networks with multiple paths.",
            "NONH: A new cache-based coherence protocol for linked list structure DSM system and its performance evaluation.",
            "A redundant binary algorithm for RSA.",
            "Using multivalued logic in relational database containing null value.",
            "Combining gprof and event-driven monitoring for analyzing distributed programs: a rough view of NCSA mosaic.",
            "Composed scattering model for direct volume rendering.",
            "OOADS: An object-oriented design model for advertising CAD system.",
            "Three-dimensional vector field visualization based on tensor decomposition.",
            "A simplified model for generating 3D realistic sound in the multimedia and virtual reality systems.",
            "Surface reconstruction for cross sectional data.",
            "Displaying of details in subvoxel accuracy.",
            "A prototypical 3D graphical visualizer for object-oriented systems.",
            "A boundary element method for simulation of deformable objects.",
            "Applying virtual reality to molecular graphics system.",
            "Integration model of eye-gaze, voice and manual response in multimodal user interface.",
            "Theory and practice of the stereo-view on the CRT screen.",
            "The methodology of testability prediction for sequential circuits.",
            "A neural network approach to fault diagnosis in analog circuits.",
            "Accelerated techniques in stem fault simulation.",
            "The RTL binding and mapping approach of VHDL High-level synthesis system HLS/BIT.",
            "Neural networks for omni-view road image understanding.",
            "Speed up training of the recurrent neural network based on constrained optimization techniques.",
            "DYNAMEM - A microarchitecture for improving memory disambiguation at run-time.",
            "Research on protocol migration.",
            "Compact DC-DC converter for pocket micro-controller systems.",
            "The global properties of valid formulas in modal logic K."
        ]
    },
    {
        "name": "JCST",
        "year": "1995",
        "info": "Volume 10: 1995",
        "count": 58,
        "papers": [
            "From the Editor-in-Chief.",
            "A line extraction algorithm for hand drawings.",
            "CX11: A Chinese language supporting interface for X window environment.",
            "A form-correcting system of Chinese characters using a model of correcting procedures of calligraphists.",
            "A form evaluation system and its data structure for brush-written Chinese characters.",
            "The automatic generation of Chinese outline font based on stroke extraction.",
            "Weak precedence story parsing grammar.",
            "Towards restructuring and normalization of types in databases.",
            "The structure and semantics of an object-oriented logic programming language: SCKE.",
            "A constructor-based EI-model semantics of EI-CTRS.",
            "A maximum time difference pipelined arithmetic unit based on CMOS gate array.",
            "The generation of a sort of fractal graphs.",
            "Research and design of a fuzzy neural expert system.",
            "High-order two-dimension cluster competitive activation mechanisms used for performing symbolic logic algorithms of problem solving.",
            "Query optimization for Deductive Databases.",
            "Optimization of multi-join queries in shared-nothing systems.",
            "The modelling of temporal data in the relational database environment.",
            "Translational semantics for a conceptual level query language.",
            "Rendezvous facilities in a distributed computer system.",
            "A logical framework for knowledge base maintenance.",
            "Automatic construction of finite algebras.",
            "Denotational semantics of a simple model of Eiffel.",
            "A formal semantics for DAI language NUML.",
            "S- and T-invariants in cyber net systems.",
            "Nonuniform lowness and strong nonuniform lowness.",
            "Putting consistent theories together in institutions.",
            "Institutions of variable truth values: An approach in the ordered style.",
            "A three-stage knowledge acquisition method.",
            "Head boundedness of nonterminating rewritings.",
            "An algebraic characterization of inductive soundness in proof by consistency.",
            "Using virtual ATE model to migrate test programs.",
            "Efficient realization of frequently used bijections on cube-connected cycles.",
            "Simulation of ATPG neural network and its experimental results.",
            "Expansion nets and expansion processes of elementary net systems.",
            "Intention maintenance as conflict resolution upon a means-network.",
            "Experimental studies of artificial conscious systems.",
            "New heuristic distributed parallel algorithms for searching and planning.",
            "Situated learning of a behavior-based mobile robot path planner.",
            "Object identity in database systems.",
            "A parallel voting scheme for aspect recovery.",
            "Interprocedural constant range propagation and alias analysis by multiple version method.",
            "K-Dimensional Optimal Parallel Algorithm for the solution of a general class of recurrence equations.",
            "Logical object as a basis of knowledge based systems.",
            "Minimal model semantics for sorted constraint representation.",
            "ICTSSE: An object-oriented IC test software supporting environment.",
            "Transformation list for SGML application.",
            "A general architecture model of CPDL Interpreter.",
            "A unifiedO(logN) and optimal sorting vector algorithm.",
            "Shared variable oriented parallel precompiler for SPMD model.",
            "Trace software pipelining.",
            "A new approach to fully automatic mesh generation.",
            "Net operations (II) - The iterated addition operation of Petri nets.",
            "General algorithms for Barnett's structure in evidential reasoning.",
            "A fault-tolerant and heuristic routing algorithm for faulty hypercubes.",
            "A necessary condition about the optimum partition on a finite set of samples and its application to clustering analysis.",
            "Simulation and improvement of the processing subsystem of the Manchester dataflow computer.",
            "Design of multivalued circuits based on an algebra for current-mode CMOS multivalued circuits.",
            "A new method of solving kernels in algebraic decomposition for the synthesis of logic cell array."
        ]
    },
    {
        "name": "JCST",
        "year": "1994",
        "info": "Volume 9: 1994",
        "count": 37,
        "papers": [
            "On the problem of optimizing parallel programs for complex memory hierarchies.",
            "On GID-testable two-dimensional iterative arrays.",
            "Real-time collision-free path planning for robots in configuration space.",
            "Automated theorem proving in temporal logic: T-resolution.",
            "An improved bottom-up method for implementing equational programming language.",
            "Extrapolating acceleration algorithms for finding B-Spline intersections using recursive subdivision techniques.",
            "An O(k 2n2) algorithm to find a k -partition in a k -connected graph.",
            "A method for minimization design of two-level logic networks using multiplexer universal logic modules.",
            "DGLa: A distributed graphics language.",
            "A unified algorithm for finding the intersection curve of surfaces.",
            "Constructing isosurfaces from 3D data sets taking account of depth sorting of polyhedra.",
            "Using timed Petri net to model instruction-level loop scheduling with resource constraints.",
            "Granularity analysis for exploiting adaptive parallelism of declarative programs on multiprocessors.",
            "Madet - A machine-description table based instruction scheduler in TH-RISC for exploiting instruction level parallelism.",
            "Generalized resolution and NC-resolution.",
            "Preparing mathematical equations in a document preparation environment.",
            "Prefix code translation by mapping.",
            "GLOBAL: A design for random testability algorithm.",
            "The catalog management strategy of distributed data base systems.",
            "A distributed algorithm for determining minimal covers of acyclic database schemes.",
            "Story Parsing Grammar.",
            "Bottom-up evaluation of datalog with negation.",
            "On the relationship between TMS and logic programs.",
            "Sequential back-propagation.",
            "The least basic operations on heap and improved heapsort.",
            "Some results on default logic.",
            "An object-oriented model of user interface generation tool.",
            "TSP: A heterogeneous multiprocessor supercomputing system based on i860XP.",
            "Generating conformance tests for nondeterministic protocol machines.",
            "Compiling CIL rewriting language for multiprocessors.",
            "Research on decompiling technology.",
            "The learning convergence of CMAC in cyclic learning.",
            "Building case-based preliminary design systems: A Hopfield network approach.",
            "GUIDS: A graphical user interface development system in UniECAD.",
            "An automatic hierarchical delay analysis tool.",
            "Adaptive memory coherence algorithms in DSVM.",
            "Full or-parallemism and restricted And-parallelism in BTM."
        ]
    },
    {
        "name": "JCST",
        "year": "1993",
        "info": "Volume 8: 1993",
        "count": 44,
        "papers": [
            "A topological implementation for motion planning of a robotic arm.",
            "Segment based camera calibration.",
            "3D Motion estimation and motion fusion by affine region matching.",
            "An introduction to INCAPS system.",
            "SCKE: Combining logic- with object-oriented paradigm.",
            "Loop staggering, loop compacting: Restructuring techniques for thrashing problem.",
            "A new integrated system of logic programming and relational database.",
            "A VLSI algorithm for calculating the tree to tree distance.",
            "Analyzing the reliability of degradable networks.",
            "DLJ: A dynamic line-justification algorithm for test generation.",
            "A survey of the rule language RL/1.",
            "On local stratifiability of logic programs and databases.",
            "A fixpoint semantics for stratified databases.",
            "Inductive learning.",
            "Validating inductive hypotheses by mode inference.",
            "Design rationale for a wide spectrum specification language FGSPEC.",
            "Two new strategies for developing loop invariants and their applications.",
            "A standard model-theoretic approach to operational semantics of recursive programs.",
            "Nonterminating rewritings with head boundedness.",
            "OOMMS: A module management system based on an object-oriented model.",
            "Deductive fault simulation algorithm based on fault collapsing.",
            "A knowledge-based specification technique for protocol development.",
            "A comparative study of default reasoning and epistemic processes.",
            "Bounded recursively enumerable sets and degrees.",
            "Optimizing FORTRAN programs for hierarchical memory parallel processing systems.",
            "A methodology for mapping and partitioning arbitrary n -dimensional nested loops into 2-dimensional VLSI arrays.",
            "Optimized parallel execution of declarative programs on distributed memory multiprocessors.",
            "An implementation of pure Horn clause logic programming in a reduction system.",
            "On memory capacity of the Probabilistic Logic Neuron network.",
            "Cooperative hypermedia editing with CoMEdiA.",
            "Modelling enterprises with object-oriented paradigm.",
            "A new local control spline with shape parameters for CAD/CAM.",
            "An object-oriented transaction model.",
            "A data manager for engineering applications.",
            "The complexity of recognition in the single-layered PLN network with feedback connections.",
            "CCD: An integrated C coding and debugging tool.",
            "Parallel execution of prolog on shared-memory multiprocessors.",
            "BSD/I18N - Internationalization of the 4.3BSD UNIX system.",
            "An adaptive strategy integrating locking with optimistic concurrency control.",
            "The mapping synthesis of ternary functions under fixed polarities.",
            "Efficient parallel algorithms for some graph theory problems.",
            "An optimal algorithm for solving collision distance between convex polygons in plane.",
            "Performance of multicast communication on hypercubes.",
            "DKBLM - Deep knowledge based learning methodology."
        ]
    }
]