[
    {
        "name": "Medical Image Analysis",
        "year": "2022",
        "info": "2022: Volumes\n75,\n76,\n77,",
        "count": 109,
        "papers": [
            "Uncertainty-guided graph attention network for parapneumonic effusion diagnosis.",
            "Automatic quality control of brain T1-weighted magnetic resonance images for a clinical data warehouse.",
            "Quantitative characterization of the human retinotopic map based on quasiconformal mapping.",
            "M3Net: A multi-scale multi-view framework for multi-phase pancreas segmentation based on cross-phase non-local attention.",
            "Diagnosis of obsessive-compulsive disorder via spatial similarity-aware learning and fused deep polynomial network.",
            "Multi-label, multi-domain learning identifies compounding effects of HIV and cognitive impairment.",
            "Automated anatomical labeling of a topologically variant abdominal arterial system via probabilistic hypergraph matching.",
            "High resolution histopathology image generation and segmentation through adversarial training.",
            "Cross-covariance isolate detect: A new change-point method for estimating dynamic functional connectivity.",
            "Melanoma classification using light-Fields with morlet scattering transform and CNN: Surface depth as a valuable tool to increase detection rate.",
            "Self-supervised driven consistency training for annotation efficient histopathology image analysis.",
            "Degenerative adversarial neuroimage nets for brain scan simulations: Application in ageing and dementia.",
            "Spine-transformers: Vertebra labeling and segmentation in arbitrary field-of-view spine CTs via 3D transformers.",
            "Relax and focus on brain tumor segmentation.",
            "Population-based 3D respiratory motion modelling from convolutional autoencoders for 2D ultrasound-guided radiotherapy.",
            "DGMSNet: Spine segmentation for MR image by a detection-guided mixed-supervised segmentation network.",
            "Fully automated lumen and vessel contour segmentation in intravascular ultrasound datasets.",
            "Vessel-CAPTCHA: An efficient learning framework for vessel annotation and segmentation.",
            "Hierarchical graph representations in digital pathology.",
            "Robust joint registration of multiple stains and MRI for multimodal 3D histology reconstruction: Application to the Allen human brain atlas.",
            "Assessing clinical progression from subjective cognitive decline to mild cognitive impairment with incomplete multi-modal neuroimages.",
            "Bayesian logistic shape model inference: Application to cochlear image segmentation.",
            "Measurement of local orientation of cardiomyocyte aggregates in human left ventricle free wall samples using X-ray phase-contrast microtomography.",
            "Deep learning for bone marrow cell detection and classification on whole-slide images.",
            "RA-GCN: Graph convolutional network for disease prediction problems with imbalanced data.",
            "Curriculum learning for improved femur fracture classification: Scheduling data with prior knowledge and uncertainty.",
            "Does your dermatology classifier know what it doesn't know? Detecting the long-tail of unseen conditions.",
            "Automatic 3-D segmentation and volumetric light fluence correction for photoacoustic tomography based on optimal 3-D graph search.",
            "A probabilistic deep motion model for unsupervised cardiac shape anomaly assessment.",
            "MPF-net: An effective framework for automated cobb angle estimation.",
            "Characterizing interactions between cardiac shape and deformation by non-linear manifold learning.",
            "Multi-site clustering and nested feature extraction for identifying autism spectrum disorder with resting-state fMRI.",
            "SCPM-Net: An anchor-free 3D lung nodule detection network using sphere representation and center points matching.",
            "Selective identification and localization of indolent and aggressive prostate cancers via CorrSigNIA: an MRI-pathology correlation and deep learning framework.",
            "DuDoDR-Net: Dual-domain data consistent recurrent network for simultaneous sparse view and metal artifact reduction in computed tomography.",
            "Real-time landmark detection for precise endoscopic submucosal dissection via shape-aware relation network.",
            "Deformable MR-CT image registration using an unsupervised, dual-channel network for neurosurgical guidance.",
            "Ms RED: A novel multi-scale residual encoding and decoding network for skin lesion segmentation.",
            "Multi-Class ASD Classification via Label Distribution Learning with Class-Shared and Class-Specific Decomposition.",
            "Diagnosing glaucoma on imbalanced data with self-ensemble dual-curriculum learning.",
            "Unsupervised feature disentanglement for video retrieval in minimally invasive surgery.",
            "Multi-task vision transformer using low-level chest X-ray feature corpus for COVID-19 diagnosis and severity quantification.",
            "A new baseline for retinal vessel segmentation: Numerical identification and correction of methodological inconsistencies affecting 100+ papers.",
            "Multi-scale semi-supervised clustering of brain images: Deriving disease subtypes.",
            "Analysis of the ISIC image datasets: Usage, benchmarks and recommendations.",
            "Dynamic topology analysis for spatial patterns of multifocal lesions on MRI.",
            "Benchmarking off-the-shelf statistical shape modeling tools in clinical applications.",
            "Multi-task learning based structured sparse canonical correlation analysis for brain imaging genetics.",
            "Federated learning for computational pathology on gigapixel whole slide images.",
            "SERV-CT: A disparity dataset from cone-beam CT for validation of endoscopic 3D reconstruction.",
            "AtrialJSQnet: A New framework for joint segmentation and quantification of left atrium and scars incorporating spatial and shape information.",
            "Surgical data science - from concepts toward clinical translation.",
            "FusionM4Net: A multi-stage multi-modal learning algorithm for multi-label skin lesion classification.",
            "Encoding histopathology whole slide images with location-aware graphs for diagnostically relevant regions retrieval.",
            "Embracing the disharmony in medical imaging: A Simple and effective framework for domain adaptation.",
            "SurgiNet: Pyramid Attention Aggregation and Class-wise Self-Distillation for Surgical Instrument Segmentation.",
            "An end-to-end approach to segmentation in medical images with CNN and posterior-CRF.",
            "DeepLesionBrain: Towards a broader deep-learning generalization for multiple sclerosis lesion segmentation.",
            "ResGANet: Residual group attention network for medical image classification and segmentation.",
            "Physics-aware learning and domain-specific loss design in ophthalmology.",
            "Deep weakly-supervised breast tumor segmentation in ultrasound images with explicit anatomical constraints.",
            "Parcellation-Free prediction of task fMRI activations from dMRI tractography.",
            "W-Net: Dense and diagnostic semantic segmentation of subcutaneous and breast tissue in ultrasound images by incorporating ultrasound RF waveform data.",
            "FAT-Net: Feature adaptive transformers for automated skin lesion segmentation.",
            "CyCMIS: Cycle-consistent Cross-domain Medical Image Segmentation via diverse image augmentation.",
            "Hyper-fusion network for semi-automatic segmentation of skin lesions.",
            "Dermoscopic image retrieval based on rotation-invariance deep hashing.",
            "NAS-optimized topology-preserving transfer learning for differentiating cortical folding patterns.",
            "Connecting macroscopic diffusion metrics of cardiac diffusion tensor imaging and microscopic myocardial structures based on simulation.",
            "Skin3D: Detection and longitudinal tracking of pigmented skin lesions in 3D total-body textured meshes.",
            "Detection and analysis of cerebral aneurysms based on X-ray rotational angiography - the CADA 2020 challenge.",
            "Adaptive rectification based adversarial network with spectrum constraint for high-quality PET image synthesis.",
            "Head and neck tumor segmentation in PET/CT: The HECKTOR challenge.",
            "SAFRON: Stitching Across the Frontier Network for Generating Colorectal Cancer Histology Images.",
            "Self-Supervised monocular depth and ego-Motion estimation in endoscopy: Appearance flow to the rescue.",
            "Multi-constraint generative adversarial network for dose prediction in radiotherapy.",
            "TW-GAN: Topology and width aware GAN for retinal artery/vein classification.",
            "A Novel Task-Based reconstruction approach for digital breast tomosynthesis.",
            "DADP: Dynamic abnormality detection and progression for longitudinal knee magnetic resonance images from the Osteoarthritis Initiative.",
            "Artifact- and content-specific quality assessment for MRI with image rulers.",
            "Global-Local attention network with multi-task uncertainty loss for abnormal lymph node detection in MR images.",
            "2D probabilistic undersampling pattern optimization for MR image reconstruction.",
            "ProstAttention-Net: A deep attention model for prostate cancer segmentation by aggressiveness in MRI scans.",
            "Learning to complete incomplete hearts for population analysis of cardiac MR images.",
            "Distortion and instability compensation with deep learning for rotational scanning endoscopic optical coherence tomography.",
            "Moment-based representation of the diffusion inside the brain from reduced DMRI acquisitions: Generalized AMURA.",
            "Fully transformer network for skin lesion analysis.",
            "ACME: Automatic feature extraction for cell migration examination through intravital microscopy imaging.",
            "Medical image analysis on left atrial LGE MRI for atrial fibrillation studies: A review.",
            "Utility of optical see-through head mounted displays in augmented reality-assisted surgery: A systematic review.",
            "AWSnet: An auto-weighted supervision attention network for myocardial scar and edema segmentation in multi-sequence cardiac magnetic resonance images.",
            "Semi-automatic segmentation of skin lesions based on superpixels and hybrid texture information.",
            "Clinical validation of saliency maps for understanding deep neural networks in ophthalmology.",
            "Marker-free surgical navigation of rod bending using a stereo neural network and augmented reality in spinal fusion.",
            "Multi-dynamic modelling reveals strongly time-varying resting fMRI correlations.",
            "Automated identification of pulmonary arteries and veins depicted in non-contrast chest CT scans.",
            "Clever Hans effect found in a widely used brain tumour MRI dataset.",
            "GAN-based disentanglement learning for chest X-ray rib suppression.",
            "Spatio-temporal directed acyclic graph learning with attention mechanisms on brain functional time series and connectivity.",
            "Contour proposal networks for biomedical instance segmentation.",
            "Novel-view X-ray projection synthesis through geometry-integrated deep learning.",
            "Suggestive annotation of brain MR images with gradient-guided sampling.",
            "Weakly supervised segmentation with cross-modality equivariant constraints.",
            "Disease prediction with edge-variational graph convolutional networks.",
            "Spatio-temporal deep learning for automatic detection of intracranial vessel perforation in digital subtraction angiography during endovascular thrombectomy.",
            "Enhanced neuroimaging genetics using multi-view non-negative matrix factorization with sparsity and prior knowledge.",
            "StaSiS-Net: A stacked and siamese disparity estimation network for depth reconstruction in modern 3D laparoscopy.",
            "Learning residual motion correction for fast and robust 3D multiparametric MRI.",
            "Surface spherical encoding and contrastive learning for virtual bone shape aging."
        ]
    },
    {
        "name": "Medical Image Analysis",
        "year": "2021",
        "info": "2021: Volumes\n67,\n68,\n69,\n70,\n71,\n72,\n73,\n74",
        "count": 358,
        "papers": [
            "Recovering from missing data in population imaging - Cardiac MR image imputation via conditional generative adversarial nets.",
            "Deep neural network models for computational histopathology: A survey.",
            "Weakly supervised instance learning for thyroid malignancy prediction from whole slide cytopathology images.",
            "A novel approach to 2D/3D registration of X-ray images using Grangeat's relation.",
            "Selective synthetic augmentation with HistoGAN for improved histopathology image classification.",
            "Difficulty-aware hierarchical convolutional neural networks for deformable registration of brain MR images.",
            "Subvoxel vessel wall thickness measurements of the intracranial arteries using a convolutional neural network.",
            "Computer aided diagnosis of thyroid nodules based on the devised small-datasets multi-view ensemble learning.",
            "Surgical planning assistance in keyhole and percutaneous surgery: A systematic review.",
            "The state of the art in kidney and kidney tumor segmentation in contrast-enhanced CT imaging: Results of the KiTS19 challenge.",
            "Weakly-supervised learning of multi-modal features for regularised iterative descent in 3D image registration.",
            "Re-Identification and growth detection of pulmonary nodules without image registration using 3D siamese neural networks.",
            "Joint prediction and time estimation of COVID-19 developing severe symptoms using chest CT scan.",
            "Long range early diagnosis of Alzheimer's disease using longitudinal MR imaging data.",
            "Automatic vertebrae recognition from arbitrary spine MRI images by a category-Consistent self-calibration detection framework.",
            "Diffusion-regularized susceptibility tensor imaging (DRSTI) of tissue microstructures in the human brain.",
            "Statistical deformation reconstruction using multi-organ shape features for pancreatic cancer localization.",
            "A novel CERNNE approach for predicting Parkinson's Disease-associated genes and brain regions based on multimodal imaging genetics data.",
            "FocusNetv2: Imbalanced large and small organ segmentation with adversarial shape constraint for head and neck CT images.",
            "A global benchmark of algorithms for segmenting the left atrium from late gadolinium-enhanced cardiac magnetic resonance imaging.",
            "Theoretical analysis and experimental validation of volume bias of soft Dice optimized segmentation maps in the context of inherent uncertainty.",
            "Eigenrank by committee: Von-Neumann entropy based data subset selection and failure prediction for deep learning based medical image segmentation.",
            "Dual-branch combination network (DCN): Towards accurate diagnosis and lesion segmentation of COVID-19 using CT images.",
            "ST-MTL: Spatio-Temporal multitask learning model to predict scanpath while tracking instruments in robotic surgery.",
            "ELNet: Automatic classification and segmentation for esophageal lesions using convolutional neural network.",
            "A disentangled generative model for disease decomposition in chest X-rays via normal image synthesis.",
            "Models Genesis.",
            "Segmentation of cellular patterns in confocal images of melanocytic lesions in vivo via a multiscale encoder-decoder network (MED-Net).",
            "Efficient and Robust Instrument Segmentation in 3D Ultrasound Using Patch-of-Interest-FuseNet with Hybrid Loss.",
            "Adversarial brain multiplex prediction from a single brain network with application to gender fingerprinting.",
            "Integrative analysis for COVID-19 patient outcome prediction.",
            "Biomechanically constrained non-rigid MR-TRUS prostate registration using deep learning based 3D point cloud matching.",
            "Triple attention learning for classification of 14 thoracic diseases using chest radiography.",
            "Predicting the progression of mild cognitive impairment using machine learning: A systematic, quantitative and critical review.",
            "Multi-scale graph-based grading for Alzheimer's disease prediction.",
            "Boundary loss for highly unbalanced segmentation.",
            "Discriminative and generative models for anatomical shape analysis on point clouds with deep neural networks.",
            "PAIP 2019: Liver cancer segmentation challenge.",
            "Machine-learning-based multiple abnormality prediction with large-scale chest computed tomography volumes.",
            "Convolutional neural networks for the automatic diagnosis of melanoma: An extensive experimental study.",
            "Reducing annotation effort in digital pathology: A Co-Representation learning framework for classification tasks.",
            "AI-driven quantification, staging and outcome prediction of COVID-19 pneumonia.",
            "Sequential conditional reinforcement learning for simultaneous vertebral body detection and segmentation with modeling the spine anatomy.",
            "Learning joint segmentation of tissues and brain lesions from task-specific hetero-modal domain-shifted datasets.",
            "Unifying neural learning and symbolic reasoning for spinal medical report generation.",
            "Deep pyramid local attention neural network for cardiac structure segmentation in two-dimensional echocardiography.",
            "CS2-Net: Deep learning segmentation of curvilinear structures in medical imaging.",
            "Frequency-dependent attenuation reconstruction with an acoustic reflector.",
            "Pairwise learning for medical image segmentation.",
            "Developing univariate neurodegeneration biomarkers with low-rank and sparse subspace decomposition.",
            "Detect and correct bias in multi-site neuroimaging datasets.",
            "Modeling dynamic radial contrast enhanced MRI with linear time invariant systems for motion correction in quantitative assessment of kidney function.",
            "Rigid and non-rigid motion artifact reduction in X-ray CT using attention module.",
            "Super-Resolved q-Space deep learning with uncertainty quantification.",
            "Incorporating historical sub-optimal deep neural networks for dose prediction in radiotherapy.",
            "Bone and joint enhancement filtering: Application to proximal femur segmentation from uncalibrated computed tomography datasets.",
            "Gaussianization of Diffusion MRI Data Using Spatially Adaptive Filtering.",
            "A deep community based approach for large scale content based X-ray image retrieval.",
            "Roto-translation equivariant convolutional networks: Application to histopathology image analysis.",
            "Multi-Regression based supervised sample selection for predicting baby connectome evolution trajectory from neonatal timepoint.",
            "Quantifying and leveraging predictive uncertainty for medical image assessment.",
            "Structured layer surface segmentation for retina OCT using fully convolutional regression networks.",
            "Accurate brain age prediction with lightweight deep neural networks.",
            "End-to-end multimodal image registration via reinforcement learning.",
            "A deep learning framework for pancreas segmentation with multi-atlas registration and 3D level-set.",
            "Capsules for biomedical image segmentation.",
            "HookNet: Multi-resolution convolutional neural networks for semantic segmentation in histopathology whole-slide images.",
            "Automated left ventricular segmentation from cardiac magnetic resonance images via adversarial learning with multi-stage pose estimation network and co-discriminator.",
            "Deeply-supervised density regression for automatic cell counting in microscopy images.",
            "An integrated time adaptive geographic atrophy prediction model for SD-OCT images.",
            "Unsupervised quality control of segmentations based on a smoothness and intensity probabilistic model.",
            "Semi-automatic sigmoid colon segmentation in CT for radiation therapy treatment planning via an iterative 2.5-D deep learning approach.",
            "Toward real-time polyp detection using fully CNNs for 2D Gaussian shapes prediction.",
            "Automated size-specific dose estimates using deep learning image processing.",
            "Identifying brain areas correlated with ADOS raw scores by studying altered dynamic functional connectivity patterns.",
            "A deep learning framework for quality assessment and restoration in video endoscopy.",
            "Dynamic MRI reconstruction with end-to-end motion-guided network.",
            "Brain graph synthesis by dual adversarial domain alignment and target graph prediction from a source graph.",
            "Feature-driven local cell graph (FLocK): New computational pathology-based descriptors for prognosis of lung cancer and HPV status of oropharyngeal cancers.",
            "Cascaded convolutional networks for automatic cephalometric landmark detection.",
            "A review of machine learning methods for retinal blood vessel segmentation and artery/vein classification.",
            "Improving statistical power of glaucoma clinical trials using an ensemble of cyclical generative adversarial networks.",
            "Test-time adaptable neural networks for robust medical image segmentation.",
            "An interpretable classifier for high-resolution breast cancer screening images utilizing weakly supervised localization.",
            "DeepTarget: Gross tumor and clinical target volume segmentation in esophageal cancer radiotherapy.",
            "Hypergraph learning for identification of COVID-19 with CT imaging.",
            "Discriminative ensemble learning for few-shot chest x-ray diagnosis.",
            "Learning to segment images with classification labels.",
            "COVID-AL: The diagnosis of COVID-19 with deep active learning.",
            "A hybrid network for automatic hepatocellular carcinoma segmentation in H&E-stained whole slide images.",
            "Interpretable deep learning systems for multi-class segmentation and classification of non-melanoma skin cancer.",
            "Fully automated left atrium segmentation from anatomical cine long-axis MRI sequences using deep convolutional neural network with unscented Kalman filter.",
            "Fracture reduction planning and guidance in orthopaedic trauma surgery via multi-body image registration.",
            "ProsRegNet: A deep learning framework for registration of MRI and histopathology images of the prostate.",
            "Rethinking medical image reconstruction via shape prior, going deeper and faster: Deep joint indirect registration and reconstruction.",
            "Estimating cardiomyofiber strain in vivo by solving a computational model.",
            "Compressed sensing plus motion (CS + M): A new perspective for improving undersampled MR image reconstruction.",
            "Semi-supervised task-driven data augmentation for medical image segmentation.",
            "Single image super-resolution for whole slide image using convolutional neural networks and self-supervised color normalization.",
            "Variational multi-task MRI reconstruction: Joint reconstruction, registration and super-resolution.",
            "Non-invasive estimation of relative pressure for intracardiac flows using virtual work-energy.",
            "Combining unsupervised and supervised learning for predicting the final stroke lesion.",
            "High-resolution 3D abdominal segmentation with random patch network fusion.",
            "Multi-stage learning for segmentation of aortic dissections using a prior aortic anatomy simplification.",
            "Image registration: Maximum likelihood, minimum entropy and deep learning.",
            "Model-informed machine learning for multi-component T2 relaxometry.",
            "Automated interpretation of congenital heart disease from multi-view echocardiograms.",
            "A novel chromosome cluster types identification method using ResNeXt WSL model.",
            "Compressive MRI quantification using convex spatiotemporal priors and deep encoder-decoder networks.",
            "Evaluation of a novel navigation platform for laparoscopic liver surgery with organ deformation compensation using injected fiducials.",
            "Graph convolution network with similarity awareness and adaptive calibration for disease-induced deterioration prediction.",
            "TSegNet: An efficient and accurate tooth segmentation network on 3D dental model.",
            "CHAOS Challenge - combined (CT-MR) healthy abdominal organ segmentation.",
            "Automated ultrasound assessment of amniotic fluid index using deep learning.",
            "Autoencoders for unsupervised anomaly segmentation in brain MR images: A comparative study.",
            "Incomplete multi-modal representation learning for Alzheimer's disease diagnosis.",
            "Surgical planning of pelvic tumor using multi-view CNN with relation-context representation learning.",
            "Dual-path network with synergistic grouping loss and evidence driven risk stratification for whole slide cervical image analysis.",
            "Angle-closure assessment in anterior segment OCT images via deep learning.",
            "3D Registration of pre-surgical prostate MRI and histopathology images via super-resolution volume reconstruction.",
            "Pancreas segmentation using a dual-input v-mesh network.",
            "Comparison of non-parametric T2 relaxometry methods for myelin water quantification.",
            "Recent advances in medical image processing for the evaluation of chronic kidney disease.",
            "Deep learning-based solvability of underdetermined inverse problems in medical imaging.",
            "Applications of deep learning in fundus images: A review.",
            "Knowledge representation and learning of operator clinical workflow from full-length routine fetal ultrasound scan videos.",
            "Differentiable neural architecture search for optimal spatial/temporal brain function network decomposition.",
            "Modality alignment contrastive learning for severity assessment of COVID-19 from lung ultrasound and clinical information.",
            "Synthesis of gadolinium-enhanced liver tumors on nonenhanced liver MR images using pixel-level graph reinforcement learning.",
            "Towards evaluating the robustness of deep diagnostic models by adversarial attack.",
            "A novel multiple instance learning framework for COVID-19 severity assessment via data augmentation and self-supervised learning.",
            "Segmentation evaluation with sparse ground truth data: Simulating true segmentations as perfect/imperfect as those generated by humans.",
            "Deep triplet hashing network for case-based medical image retrieval.",
            "A hybrid, image-based and biomechanics-based registration approach to markerless intraoperative nodule localization during video-assisted thoracoscopic surgery.",
            "A survey on incorporating domain knowledge into deep learning for medical image analysis.",
            "Combining anatomical and functional networks for neuropathology identification: A case study on autism spectrum disorder.",
            "A guaranteed convergence analysis for the projected fast iterative soft-thresholding algorithm in parallel MRI.",
            "Computerized spermatogenesis staging (CSS) of mouse testis sections via quantitative histomorphological analysis.",
            "Multi-task learning for segmentation and classification of tumors in 3D automated breast ultrasound images.",
            "Comparative validation of multi-instance instrument segmentation in endoscopy: Results of the ROBUST-MIS 2019 challenge.",
            "mustGAN: multi-stream Generative Adversarial Networks for MR Image Synthesis.",
            "Neuropsychiatric disease classification using functional connectomics - results of the connectomics in neuroimaging transfer learning challenge.",
            "Marginal loss and exclusion loss for partially supervised multi-organ segmentation.",
            "OF-UMRN: Uncertainty-guided multitask regression network aided by optical flow for fully automated comprehensive analysis of carotid artery.",
            "EIS-Net: Segmenting early infarct and scoring ASPECTS simultaneously on non-contrast CT of patients with acute ischemic stroke.",
            "Magic DIAMOND: Multi-fascicle diffusion compartment imaging with tensor distribution modeling and tensor-valued diffusion encoding.",
            "Global guidance network for breast lesion segmentation in ultrasound images.",
            "VR-Caps: A Virtual Environment for Capsule Endoscopy.",
            "ACEnet: Anatomical context-encoding network for neuroanatomy segmentation.",
            "Federated semi-supervised learning for COVID region segmentation in chest CT using multi-national data from China, Italy, Japan.",
            "Deep metric learning-based image retrieval system for chest radiograph and its clinical applications in COVID-19.",
            "Detection, segmentation, and 3D pose estimation of surgical tools using convolutional neural networks and algebraic geometry.",
            "DeepHCS++: Bright-field to fluorescence microscopy image conversion using multi-task learning with adversarial losses for label-free high-content screening.",
            "Multi-scale fully convolutional neural networks for histopathology image segmentation: From nuclear aberrations to the global tissue architecture.",
            "Learning to map 2D ultrasound images into 3D space with minimal human annotation.",
            "Simultaneous multi-slice image reconstruction using regularized image domain split slice-GRAPPA for diffusion MRI.",
            "Estimating dual-energy CT imaging from single-energy CT data with material decomposition convolutional neural network.",
            "Deep learning for detection and segmentation of artefact and disease instances in gastrointestinal endoscopy.",
            "Identifying associations among genomic, proteomic and imaging biomarkers via adaptive sparse multi-view canonical correlation analysis.",
            "Residual cyclegan for robust domain transformation of histopathological tissue slides.",
            "Weakly-Supervised teacher-Student network for liver tumor segmentation from non-enhanced images.",
            "GRAND: A large-scale dataset and benchmark for cervical intraepithelial Neoplasia grading with fine-grained lesion description.",
            "A comprehensive analysis of classification methods in gastrointestinal endoscopy imaging.",
            "A shape-constraint adversarial framework with instance-normalized spatio-temporal features for inter-fetal membrane segmentation.",
            "Predicting future cognitive decline with hyperbolic stochastic coding.",
            "Deep virtual adversarial self-training with consistency regularization for semi-supervised medical image classification.",
            "Deep model-based magnetic resonance parameter mapping network (DOPAMINE) for fast T1 mapping using variable flip angle method.",
            "Ultrasound image reconstruction from plane wave radio-frequency data by self-supervised deep neural network.",
            "Deep Consensus Network: Aggregating predictions to improve object detection in microscopy images.",
            "Fitting unbranching skeletal structures to objects.",
            "SCS-Net: A Scale and Context Sensitive Network for Retinal Vessel Segmentation.",
            "LNDb challenge on automatic lung cancer patient management.",
            "Cephalogram synthesis and landmark detection in dental cone-beam CT systems.",
            "Directional-TV algorithm for image reconstruction from limited-angular-range data.",
            "Fine-Tuning and training of densenet for histopathology image representation using TCGA diagnostic slides.",
            "Special issue on MICCAI 2019.",
            "Active, continual fine tuning of convolutional neural networks for reducing annotation efforts.",
            "Compare and contrast: Detecting mammographic soft-tissue lesions with C2-Net.",
            "A structural enriched functional network: An application to predict brain cognitive performance.",
            "Deep neural network ensemble for on-the-fly quality control-driven segmentation of cardiac MRI T1 mapping.",
            "Cross-attention multi-branch network for fundus diseases classification using SLO images.",
            "Deep metric learning for otitis media classification.",
            "Loss odyssey in medical image segmentation.",
            "CycleMorph: Cycle consistent unsupervised deformable image registration.",
            "Super-Resolution of Cardiac MR Cine Imaging using Conditional GANs and Unsupervised Transfer Learning.",
            "SoftSeg: Advantages of soft versus binary training for image segmentation.",
            "MetricUNet: Synergistic image- and voxel-level learning for precise prostate segmentation via online sampling.",
            "APRIL: Anatomical prior-guided reinforcement learning for accurate carotid lumen diameter and intima-media thickness measurement.",
            "Anatomy-guided multimodal registration by learning segmentation without ground truth: Application to intraprocedural CBCT/MR liver segmentation and registration.",
            "Dual attention enhancement feature fusion network for segmentation and quantitative analysis of paediatric echocardiography.",
            "RICE: A method for quantitative mammographic image enhancement.",
            "Volumetric parcellation of the cardiac right ventricle for regional geometric and functional assessment.",
            "Data-Driven multi-Contrast spectral microstructure imaging with InSpect: INtegrated SPECTral component estimation and mapping.",
            "BS-Net: Learning COVID-19 pneumonia severity on a large chest X-ray dataset.",
            "Two-stage deep learning for accelerated 3D time-of-flight MRA without matched training data.",
            "Faster Mean-shift: GPU-accelerated clustering for cosine embedding-based cell segmentation and tracking.",
            "Applying deep learning in digital breast tomosynthesis for automatic breast cancer detection: A review.",
            "Phenotype discovery from population brain imaging.",
            "Longitudinal self-supervised learning.",
            "Consolidated domain adaptive detection and localization framework for cross-device colonoscopic images.",
            "CaDIS: Cataract dataset for surgical RGB-image segmentation.",
            "CT-Based COVID-19 triage: Deep multitask learning improves joint identification and severity quantification.",
            "Meta grayscale adaptive network for 3D integrated renal structures segmentation.",
            "Brain functional connectivity analysis based on multi-graph fusion.",
            "EndoSLAM dataset and an unsupervised monocular visual odometry and depth estimation approach for endoscopic videos.",
            "MGN-Net: A multi-view graph normalizer for integrating heterogeneous biological network populations.",
            "Diverse data augmentation for learning image segmentation with cross-modality annotations.",
            "Deep learning reconstruction of digital breast tomosynthesis images for accurate breast density and patient-specific radiation dose estimation.",
            "A survey on active learning and human-in-the-loop deep learning for medical image analysis.",
            "Modeling dynamic characteristics of brain functional connectivity networks using resting-state functional MRI.",
            "A 3D personalized cardiac myocyte aggregate orientation model using MRI data-driven low-rank basis functions.",
            "Weakly-supervised progressive denoising with unpaired CT images.",
            "Personalising left-ventricular biophysical models of the heart using parametric physics-informed neural networks.",
            "Non-linear fitting with joint spatial regularization in arterial spin labeling.",
            "Multi-site MRI harmonization via attention-guided deep domain adaptation for brain disorder identification.",
            "Disentangle domain features for cross-modality cardiac image segmentation.",
            "Imitation learning for improved 3D PET/MR attenuation correction.",
            "A Framework for the generation of digital twins of cardiac electrophysiology from clinical 12-leads ECGs.",
            "Towards improved breast mass detection using dual-view mammogram matching.",
            "Brain graph super-resolution using adversarial graph neural network with application to functional brain connectivity.",
            "Multimodal super-resolved q-space deep learning.",
            "Ultrasound deep beamforming using a multiconstrained hybrid generative adversarial network.",
            "A novel method to correct repolarization time estimation from unipolar electrograms distorted by standard filtering.",
            "Corrigendum to Identifying associations among genomic, proteomic and imaging biomarkers via adaptive sparse multi-view canonical correlation analysis [Medical Image Analysis 70 (2021) 1-12/102003].",
            "Deep Fusion of Brain Structure-Function in Mild Cognitive Impairment.",
            "Robust classification from noisy labels: Integrating additional knowledge for chest radiography abnormality assessment.",
            "OFx: A method of 4D image construction from free-breathing non-gated MRI slice acquisitions of the thorax via optical flux.",
            "Biophysics-based statistical learning: Application to heart and brain interactions.",
            "Brain multigraph prediction using topology-aware adversarial graph neural network.",
            "Multi-channel attention-fusion neural network for brain age estimation: Accuracy, generality, and interpretation with 16, 705 healthy MRIs across lifespan.",
            "Early neoplasia identification in Barrett's esophagus via attentive hierarchical aggregation and self-distillation.",
            "Track-to-Learn: A general framework for tractography with deep reinforcement learning.",
            "Volumetric white matter tract segmentation with nested self-supervised learning using sequential pretext tasks.",
            "A novel incremental simulation of facial changes following orthognathic surgery using FEM with realistic lip sliding effect.",
            "Deep learning for predicting COVID-19 malignant progression.",
            "Soft and self constrained clustering for group-based labeling.",
            "Adaptive convolutional neural networks for accelerating magnetic resonance imaging via k-space data interpolation.",
            "A CNN-based unified framework utilizing projection loss in unison with label noise handling for multiple Myeloma cancer diagnosis.",
            "RNNSLAM: Reconstructing the 3D colon to visualize missing regions during a colonoscopy.",
            "A deep learning-based framework for segmenting invisible clinical target volumes with estimated uncertainties for post-operative prostate cancer radiotherapy.",
            "MIDeepSeg: Minimally interactive segmentation of unseen objects from medical images using deep learning.",
            "Corrigendum to Dual-modality endoscopic probe for tissue surface shape reconstruction and hyperspectral imaging enabled by deep neural networks [Medical Image Analysis 48 (2018) 162-176/2018.06.004].",
            "Spatially Constrained Context-Aware Hierarchical Deep Correlation Filters for Nucleus Detection in Histology Images.",
            "Dual attention multiple instance learning with unsupervised complementary loss for COVID-19 screening.",
            "Conditional generation of medical images via disentangled adversarial inference.",
            "Ultra-short echo-time magnetic resonance imaging lung segmentation with under-Annotations and domain shift.",
            "Evaluation and comparison of accurate automated spinal curvature estimation algorithms with spinal anterior-posterior X-Ray images: The AASCE2019 challenge.",
            "Asymmetric multi-task attention network for prostate bed segmentation in computed tomography images.",
            "SSMD: Semi-Supervised medical image detection with adaptive consistency and heterogeneous perturbation.",
            "ExplAIn: Explanatory artificial intelligence for diabetic retinopathy diagnosis.",
            "Searching collaborative agents for multi-plane localization in 3D ultrasound.",
            "Complex fracture reduction by exact identification of the fracture zone.",
            "Mitotic nuclei analysis in breast cancer histopathology images using deep ensemble classifier.",
            "Tetrahedral spectral feature-Based bayesian manifold learning for grey matter morphometry: Findings from the Alzheimer's disease neuroimaging initiative.",
            "Recursive Deep Prior Video: A super resolution algorithm for time-lapse microscopy of organ-on-chip experiments.",
            "Deep learning for chest X-ray analysis: A survey.",
            "Filtering in tractography using autoencoders (FINTA).",
            "Exploring partial intrinsic and extrinsic symmetry in 3D medical imaging.",
            "Deep probabilistic tracking of particles in fluorescence microscopy images.",
            "A machine learning-based method for estimating the number and orientations of major fascicles in diffusion-weighted magnetic resonance imaging.",
            "A column-based deep learning method for the detection and quantification of atrophy associated with AMD in OCT scans.",
            "A deep joint sparse non-negative matrix factorization framework for identifying the common and subject-specific functional units of tongue motion during speech.",
            "A Generalized Linear modeling approach to bootstrapping multi-frame PET image data.",
            "ABCnet: Adversarial bias correction network for infant brain MR images.",
            "Automated cardiac segmentation of cross-modal medical images using unsupervised multi-domain adaptation and spatial neural attention structure.",
            "Autoencoder based self-supervised test-time adaptation for medical image analysis.",
            "AW3M: An auto-weighting and recovery framework for breast cancer diagnosis using multi-modal ultrasound.",
            "CNN-based lung CT registration with multiple anatomical constraints.",
            "Geodesic density regression for correcting 4DCT pulmonary respiratory motion artifacts.",
            "SRPN: similarity-based region proposal networks for nuclei and cells detection in histology images.",
            "APPLAUSE: Automatic Prediction of PLAcental health via U-net Segmentation and statistical Evaluation.",
            "Contrastive rendering with semi-supervised learning for ovary and follicle segmentation from 3D ultrasound.",
            "Deep-LIBRA: An artificial-intelligence method for robust quantification of breast density with independent validation in breast cancer risk assessment.",
            "Adversarial attack vulnerability of medical image analysis systems: Unexplored factors.",
            "Inference of ventricular activation properties from non-invasive electrocardiography.",
            "Bayesian inference using hierarchical and spatial priors for intravoxel incoherent motion MR imaging in the brain: Analysis of cancer and acute stroke.",
            "Self-paced and self-consistent co-training for semi-supervised image segmentation.",
            "Deep adversarial domain adaptation for breast cancer screening from mammograms.",
            "Semi-supervised classification of radiology images with NoTeacher: A teacher that is not mean.",
            "Model-based multi-parameter mapping.",
            "DeepPrognosis: Preoperative prediction of pancreatic cancer survival and surgical margin via comprehensive understanding of dynamic contrast-enhanced CT imaging and tumor-vascular contact parsing.",
            "Special issue on computational pathology: An overview.",
            "Multi-slice low-rank tensor decomposition based multi-atlas segmentation: Application to automatic pathological liver CT segmentation.",
            "Computer-aided diagnosis of prostate cancer using multiparametric MRI and clinical features: A patient-level classification framework.",
            "United adversarial learning for liver tumor segmentation and detection of multi-modality non-contrast MRI.",
            "End-to-end prostate cancer detection in bpMRI via 3D CNNs: Effects of attention mechanisms, clinical priori and decoupled false positive reduction.",
            "Incorporating the hybrid deformable model for improving the performance of abdominal CT segmentation via multi-scale feature fusion network.",
            "Leveraging unsupervised image registration for discovery of landmark shape descriptor.",
            "Semi-supervised learning with progressive unlabeled data excavation for label-efficient surgical workflow recognition.",
            "Weakly unsupervised conditional generative adversarial network for image-based prognostic prediction for COVID-19 patients based on chest CT.",
            "Deep cross-view co-regularized representation learning for glioma subtype identification.",
            "The predictive value of segmentation metrics on dosimetry in organs at risk of the brain.",
            "Joint hub identification for brain networks by multivariate graph inference.",
            "Widespread plasticity of cognition-related brain networks in single-sided deafness revealed by randomized window-based dynamic functional connectivity.",
            "Visually Navigated Bronchoscopy using three cycle-Consistent generative adversarial network for depth estimation.",
            "Semi-supervised training of deep convolutional neural networks with heterogeneous data and few local annotations: An experiment on prostate histopathology image classification.",
            "VerSe: A Vertebrae labelling and segmentation benchmark for multi-detector CT images.",
            "Computer-aided diagnosis tool for cervical cancer screening with weakly supervised localization and detection of abnormalities using adaptable and explainable classifier.",
            "Data fusion and smoothing for probabilistic tracking of viral structures in fluorescence microscopy images.",
            "Learning to synthesise the ageing brain without longitudinal data.",
            "Multi-level semantic adaptation for few-shot segmentation on cardiac image sequences.",
            "Automatic skull defect restoration and cranial implant generation for cranioplasty.",
            "Rigid motion invariant statistical shape modeling based on discrete fundamental forms: Data from the osteoarthritis initiative and the Alzheimer's disease neuroimaging initiative.",
            "Quantifying Parkinson's disease motor severity under uncertainty using MDS-UPDRS videos.",
            "Motion-based camera localization system in colonoscopy videos.",
            "Deformation analysis of surface and bronchial structures in intraoperative pneumothorax using deformable mesh registration.",
            "Weakly supervised cell instance segmentation under various conditions.",
            "Joint fully convolutional and graph convolutional networks for weakly-supervised segmentation of pathology images.",
            "Triplanar ensemble U-Net model for white matter hyperintensities segmentation on MR images.",
            "A positive/unlabeled approach for the segmentation of medical sequences using point-wise supervision.",
            "An in silico validation framework for quantitative DCE-MRI techniques based on a dynamic digital phantom.",
            "Towards lower-dose PET using physics-based uncertainty-aware multimodal learning with robustness to out-of-distribution data.",
            "A Review On digital image processing techniques for in-Vivo confocal images of the cornea.",
            "Deep-gated recurrent unit and diet network-based genome-wide association analysis for detecting the biomarkers of Alzheimer's disease.",
            "Deep low-Rank plus sparse network for dynamic MR imaging.",
            "Deep reinforcement learning in medical imaging: A literature review.",
            "Dynamic-weighting hierarchical segmentation network for medical images.",
            "A novel attention-guided convolutional network for the detection of abnormal cervical cells in cervical cancer screening.",
            "Fat-saturated image generation from multi-contrast MRIs using generative adversarial networks with Bloch equation-based autoencoder regularization.",
            "Optimisation of the event-based TOF filtered back-projection for online imaging in total-body J-PET.",
            "MedQ: Lossless ultra-low-bit neural network quantization for medical image segmentation.",
            "MommiNet-v2: Mammographic multi-view mass identification networks.",
            "Joint categorical and ordinal learning for cancer grading in pathology images.",
            "Realistic image normalization for multi-Domain segmentation.",
            "Validation of 4D Flow based relative pressure maps in aortic flows.",
            "Automatic multi-plaque tracking and segmentation in ultrasonic videos.",
            "Automated eloquent cortex localization in brain tumor patients using multi-task graph neural networks.",
            "COVID-19 lung infection segmentation with a novel two-stage cross-domain transfer learning framework.",
            "Spatio-temporal multi-task network cascade for accurate assessment of cardiac CT perfusion.",
            "Normative ascent with local gaussians for unsupervised lesion detection.",
            "CycleGAN denoising of extreme low-dose cardiac CT using wavelet-assisted noise disentanglement.",
            "A bi-atrial statistical shape model for large-scale in silico studies of human atria: Model development and application to ECG simulations.",
            "AIFNet: Automatic vascular function estimation for perfusion analysis using deep learning.",
            "Magnetic Resonance Elastography Reconstruction for Anisotropic Tissues.",
            "Medical image segmentation automatic quality control: A multi-dimensional approach.",
            "S-CUDA: Self-cleansing unsupervised domain adaptation for medical image segmentation.",
            "Comparison of domain adaptation techniques for white matter hyperintensity segmentation in brain MR images.",
            "AIforCOVID: Predicting the clinical outcomes in patients with COVID-19 applying AI to chest-X-rays. An Italian multicentre study.",
            "Automatic annotation of cervical vertebrae in videofluoroscopy images via deep learning.",
            "Recurrent inference machines as inverse problem solvers for MR relaxometry.",
            "A CNN-based method to reconstruct 3-D spine surfaces from US images in vivo.",
            "A deep-learning approach for direct whole-heart mesh reconstruction.",
            "Using synthetic data generation to train a cardiac motion tag tracking neural network.",
            "Real-time medical phase recognition using long-term video understanding and progress gate method.",
            "Public Covid-19 X-ray datasets and their impact on model bias - A systematic review of a significant problem.",
            "Anatomical-guided attention enhances unsupervised PET image denoising performance.",
            "Decomposing normal and abnormal features of medical images for content-based image retrieval of glioma imaging.",
            "Shape registration with learned deformations for 3D shape reconstruction from sparse and incomplete point clouds.",
            "Full cardiac cycle asynchronous temporal compounding of 3D echocardiography images.",
            "Real-time multimodal image registration with partial intraoperative point-set data.",
            "BrainGNN: Interpretable Brain Graph Neural Network for fMRI Analysis.",
            "Anchor-guided online meta adaptation for fast one-Shot instrument segmentation from robotic surgical videos.",
            "A multiparametric volumetric quantitative ultrasound imaging technique for soft tissue characterization.",
            "Cobiveco: Consistent biventricular coordinates for precise and intuitive description of position in the heart - with MATLAB implementation.",
            "Auto-weighted centralised multi-task learning via integrating functional and structural connectivity for subjective cognitive decline diagnosis.",
            "Probabilistic 4D predictive model from in-room surrogates using conditional generative networks for image-guided radiotherapy.",
            "NENet: Nested EfficientNet and adversarial learning for joint optic disc and cup segmentation.",
            "dStripe: Slice artefact correction in diffusion MRI via constrained neural network."
        ]
    },
    {
        "name": "Medical Image Analysis",
        "year": "2020",
        "info": "2020: Volumes\n59,\n60,\n61,\n62,\n63,\n64,\n65,\n66",
        "count": 161,
        "papers": [
            "Hubless keypoint-based 3D deformable groupwise registration.",
            "Mitigating gyral bias in cortical tractography via asymmetric fiber orientation distributions.",
            "Estimation of connectional brain templates using selective multi-view network normalization.",
            "Segmentation and quantification of infarction without contrast agents via spatiotemporal generative adversarial learning.",
            "'Squeeze & excite' guided few-shot segmentation of volumetric images.",
            "Model-Based High-Definition Dynamic Contrast Enhanced MRI for Concurrent Estimation of Perfusion and Microvascular Permeability.",
            "Multi-task recurrent convolutional network with correlation loss for surgical video analysis.",
            "Semi-supervised mp-MRI data synthesis with StitchLayer and auxiliary distance maximization.",
            "REFUGE Challenge: A unified framework for evaluating automated methods for glaucoma assessment from fundus photographs.",
            "IDRiD: Diabetic Retinopathy - Segmentation and Grading Challenge.",
            "Prediction of final infarct volume from native CT perfusion and treatment parameters using deep learning.",
            "Exploring uncertainty measures in deep networks for Multiple sclerosis lesion detection and segmentation.",
            "Simulation of hyperelastic materials in real-time using deep learning.",
            "Commensal correlation network between segmentation and direct area estimation for bi-ventricle quantification.",
            "Multi-indices quantification of optic nerve head in fundus image via multitask collaborative learning.",
            "An automatic genetic algorithm framework for the optimization of three-dimensional surgical plans of forearm corrective osteotomies.",
            "Joint functional brain network atlas estimation and feature selection for neurological disorder diagnosis with application to autism.",
            "Major depressive disorder identification by referenced multiset canonical correlation analysis with clinical scores.",
            "A partial augmented reality system with live ultrasound and registered preoperative MRI for guiding robot-assisted radical prostatectomy.",
            "Multi-resolution convolutional neural networks for fully automated segmentation of acutely injured lungs in multiple species.",
            "Deformable mapping using biomechanical models to relate corresponding lesions in digital breast tomosynthesis and automated breast ultrasound images.",
            "Automatic kidney segmentation in ultrasound images using subsequent boundary distance regression and pixelwise classification networks.",
            "Hierarchical Bayesian myocardial perfusion quantification.",
            "Analysis of nonstandardized stress echocardiography sequences using multiview dimensionality reduction.",
            "Uncertainty and interpretability in convolutional neural networks for semantic segmentation of colorectal polyps.",
            "A robust deep neural network for denoising task-based fMRI data: An application to working memory and episodic memory.",
            "Atrial scar quantification via multi-scale CNN in the graph-cuts framework.",
            "LinSEM: Linearizing segmentation evaluation metrics for medical images.",
            "A computational Framework for generating rotation invariant features and its application in diffusion MRI.",
            "Context-guided fully convolutional networks for joint craniomaxillofacial bone segmentation and landmark digitization.",
            "Multi-modal neuroimaging feature selection with consistent metric constraint for diagnosis of Alzheimer's disease.",
            "Graph temporal ensembling based semi-supervised convolutional neural network with noisy labels for histopathology image analysis.",
            "Tracing in 2D to reduce the annotation effort for 3D deep delineation of linear structures.",
            "Regularized siamese neural network for unsupervised outlier detection on brain multiparametric magnetic resonance imaging: Application to epilepsy lesion screening.",
            "Shape and margin-aware lung nodule classification in low-dose CT images via soft activation mapping.",
            "Non-invasive estimation of relative pressure in turbulent flow using virtual work-energy.",
            "Conflict management in the fusion of complementary segmentations of deformed kidneys and nephroblastoma.",
            "Tensor-cut: A tensor-based graph-cut blood vessel segmentation method and its application to renal artery segmentation.",
            "Siam-U-Net: encoder-decoder siamese network for knee cartilage tracking in ultrasound images.",
            "Multi-modal latent space inducing ensemble SVM classifier for early dementia diagnosis with neuroimaging data.",
            "Quantifying atrial anatomy uncertainty from clinical data and its impact on electro-physiology simulation predictions.",
            "Adaptive sparse learning using multi-template for neurodegenerative disease diagnosis.",
            "Dynamic coronary roadmapping via catheter tip tracking in X-ray fluoroscopy with deep learning based Bayesian filtering.",
            "Temporal non-local means filtering for studies of intrinsic brain connectivity from individual resting fMRI.",
            "Improving cardiac MRI convolutional neural network segmentation on small training datasets and dataset shift: A continuous kernel cut approach.",
            "On the identification of the blood vessel confounding effect in intravoxel incoherent motion (IVIM) Diffusion-Weighted (DW)-MRI in liver: An efficient sparsity based algorithm.",
            "Deep Atlas Network for Efficient 3D Left Ventricle Segmentation on Echocardiography.",
            "Learning a cortical parcellation of the brain robust to the MRI segmentation with convolutional neural networks.",
            "An improved deep network for tissue microstructure estimation with uncertainty quantification.",
            "Self-calibrated brain network estimation and joint non-convex multi-task learning for identification of early Alzheimer's disease.",
            "Domain-invariant interpretable fundus image quality assessment.",
            "Learning metal artifact reduction in cardiac CT images with moving pacemakers.",
            "Detecting genetic associations with brain imaging phenotypes in Alzheimer's disease via a novel structured SCCA approach.",
            "Segmentation of breast ultrasound image with semantic classification of superpixels.",
            "HeadLocNet: Deep convolutional neural networks for accurate classification and multi-landmark localization of head CTs.",
            "Automatic detection of rare pathologies in fundus photographs using few-shot learning.",
            "SDCT-AuxNetθ: DCT augmented stain deconvolutional CNN with auxiliary classifier for cancer diagnosis.",
            "Automatic diagnosis for thyroid nodules in ultrasound images by deep neural networks.",
            "Multi-task learning for the segmentation of organs at risk with label dependence.",
            "Trophectoderm segmentation in human embryo images via inceptioned U-Net.",
            "Image computing for fibre-bundle endomicroscopy: A review.",
            "SDAE-GAN: Enable high-dimensional pathological images in liver cancer survival prediction with a policy gradient based data augmentation method.",
            "Automatic labeling of cortical sulci using patch- or CNN-based segmentation techniques combined with bottom-up geometric constraints.",
            "Deep learning uncertainty and confidence calibration for the five-class polyp classification from colonoscopy.",
            "Synthesized 7T MRI from 3T MRI via deep learning in spatial and wavelet domains.",
            "Unsupervised X-ray image segmentation with task driven generative adversarial networks.",
            "Contrast agent-free synthesis and segmentation of ischemic heart disease images using progressive sequential causal GANs.",
            "Joint PET-MRI image reconstruction using a patch-based joint-dictionary prior.",
            "Embedding high-dimensional Bayesian optimization via generative modeling: Parameter personalization of cardiac electrophysiological models.",
            "An integrated deep learning framework for joint segmentation of blood pool and myocardium.",
            "CEREBRUM: a fast and fully-volumetric Convolutional Encoder-decodeR for weakly-supervised sEgmentation of BRain strUctures from out-of-the-scanner MRI.",
            "Stochastic Gradient Langevin dynamics for joint parameterization of tracer kinetic models, input functions, and T1 relaxation-times from undersampled k-space DCE-MRI.",
            "Self-weighted adaptive structure learning for ASD diagnosis via multi-template multi-center representation.",
            "Tripartite-GAN: Synthesizing liver contrast-enhanced MRI to improve tumor detection.",
            "Asymmetric fiber trajectory distribution estimation using streamline differential equation.",
            "Image reconstruction with low-rankness and self-consistency of k-space data in parallel MRI.",
            "Accelerating Cartesian MRI by domain-transform manifold learning in phase-encoding direction.",
            "Generative-based airway and vessel morphology quantification on chest CT images.",
            "Fully automatic brain tumor segmentation with deep learning-based selective attention using overlapping patches and multi-class weighted cross-entropy.",
            "Embracing imperfect datasets: A review of deep learning solutions for medical image segmentation.",
            "Convolutional neural networks for classification of Alzheimer's disease: Overview and reproducible evaluation.",
            "Towards multi-center glaucoma OCT image screening with semi-supervised joint structure and function multi-task learning.",
            "Cellular community detection for tissue phenotyping in colorectal cancer histology images.",
            "A scalable approach to T2-MRI colon segmentation.",
            "Multi-atlas image registration of clinical data with automated quality assessment using ventricle segmentation.",
            "Surgical spectral imaging.",
            "Identifying Cross-individual Correspondences of 3-hinge Gyri.",
            "Designing weighted correlation kernels in convolutional neural networks for functional connectivity based brain disease diagnosis.",
            "Artificial neural networks for magnetic resonance elastography stiffness estimation in inhomogeneous materials.",
            "Automatic spatial estimation of white matter hyperintensities evolution in brain MRI using disease evolution predictor deep neural networks.",
            "DR|GRADUATE: Uncertainty-aware deep learning-based diabetic retinopathy grading in eye fundus images.",
            "DeepDistance: A multi-task deep regression model for cell detection in inverted microscopy images.",
            "Dense biased networks with deep priori anatomy and hard region adaptation: Semi-supervised learning for fine renal artery segmentation.",
            "Groupwise registration with global-local graph shrinkage in atlas construction.",
            "Unsupervised lesion detection via image restoration with a normative prior.",
            "Skin lesion segmentation via generative adversarial networks with dual discriminators.",
            "High-dimensional embedding network derived prior for compressive sensing MRI reconstruction.",
            "Deep learning-guided estimation of attenuation correction factors from time-of-flight PET emission data.",
            "Pseudo-healthy synthesis with pathology disentanglement and adversarial learning.",
            "MB-FSGAN: Joint segmentation and quantification of kidney tumor on CT by the multi-branch feature sharing generative adversarial network.",
            "Dynamically constructed network with error correction for accurate ventricle volume estimation.",
            "Expert-validated estimation of diagnostic uncertainty for deep neural networks in diabetic retinopathy detection.",
            "Texture preservation and speckle reduction in poor optical coherence tomography using the convolutional neural network.",
            "Prediction of inter-fractional radiotherapy dose plans with domain translation in spatiotemporal embeddings.",
            "Automatic detection of landmarks for the analysis of a reduction of supracondylar fractures of the humerus.",
            "Deep learning with 4D spatio-temporal data representations for OCT-based force estimation.",
            "Unified generative adversarial networks for multimodal segmentation from unpaired 3D medical images.",
            "Uncertainty-aware domain alignment for anatomical structure segmentation.",
            "Semi-supervised WCE image classification with adaptive aggregated attention.",
            "Spatially regularized parametric map reconstruction for fast magnetic resonance fingerprinting.",
            "A survey on medical image analysis in diabetic retinopathy.",
            "Mimicking the radiologists' workflow: Estimating pediatric hand bone age with stacked deep neural networks.",
            "Rubik's Cube+: A self-supervised feature learning framework for 3D medical image analysis.",
            "A novel approach to multiple anatomical shape analysis: Application to fetal ventriculomegaly.",
            "Graph refinement based airway extraction using mean-field networks and graph neural networks.",
            "Self-co-attention neural network for anatomy segmentation in whole breast ultrasound.",
            "Prediction of in-plane organ deformation during free-breathing radiotherapy via discriminative spatial transformer networks.",
            "Subsampled brain MRI reconstruction by generative adversarial neural networks.",
            "Automatic estimation of aortic and mitral valve displacements in dynamic CTA with 4D graph-cuts.",
            "R-fMRI reconstruction from k-t undersampled data using a subject-invariant dictionary model and VB-EM with nested minorization.",
            "A novel node-level structure embedding and alignment representation of structural networks for brain disease analysis.",
            "Local rotation invariance in 3D CNNs.",
            "Yottixel - An Image Search Engine for Large Archives of Histopathology Whole Slide Images.",
            "Automated characterization of noise distributions in diffusion MRI data.",
            "Deep learning with noisy labels: Exploring techniques and remedies in medical image analysis.",
            "Analytical and fast Fiber Orientation Distribution reconstruction in 3D-Polarized Light Imaging.",
            "Deep white matter analysis (DeepWMA): Fast and consistent tractography segmentation.",
            "Spatio-temporal visual attention modelling of standard biometry plane-finding navigation.",
            "SLIR: Synthesis, localization, inpainting, and registration for image-guided thermal ablation of liver tumors.",
            "Deep learning based HEp-2 image classification: A comprehensive review.",
            "Multi-site fMRI analysis using privacy-preserving federated learning and domain adaptation: ABIDE results.",
            "Uncertainty-aware multi-view co-training for semi-supervised medical image segmentation and domain adaptation.",
            "Weakly supervised object detection with 2D and 3D regression neural networks.",
            "Brain graph super-resolution for boosting neurological disorder diagnosis using unsupervised multi-topology connectional brain template learning.",
            "The state-of-the-art in ultrasound-guided spine interventions.",
            "Supervised learning with cyclegan for low-dose FDG PET image denoising.",
            "NuClick: A deep learning framework for interactive segmentation of microscopic images.",
            "MSCS-DeepLN: Evaluating lung nodule malignancy using multi-scale cost-sensitive neural networks.",
            "Detection, segmentation, simulation and visualization of aortic dissections: A review.",
            "Holistic multitask regression network for multiapplication shape regression segmentation.",
            "Automated diagnosis of bone metastasis based on multi-view bone scans using attention-augmented deep neural networks.",
            "Time-distanced gates in long short-term memory networks.",
            "Triple U-net: Hematoxylin-aware nuclei segmentation with progressive dense feature aggregation.",
            "Automatic ischemic stroke lesion segmentation from computed tomography perfusion images by image synthesis and attention-based deep neural networks.",
            "GCTI-SN: Geometry-inspired chemical and tissue invariant stain normalization of microscopic medical images.",
            "Whole slide images based cancer survival prediction using attention guided deep multiple instance learning networks.",
            "Integrating uncertainty in deep neural networks for MRI based stroke analysis.",
            "Attention convolutional neural network for accurate segmentation and quantification of lesions in ischemic stroke disease.",
            "Handling confounding variables in statistical shape analysis - application to cardiac remodelling.",
            "Cascaded one-shot deformable convolutional neural networks: Developing a deep learning model for respiratory motion estimation in ultrasound sequences.",
            "Deep-COVID: Predicting COVID-19 from chest X-ray images using deep transfer learning.",
            "Multi-task multi-modal learning for joint diagnosis and prognosis of human cancers.",
            "The reliability of a deep learning model in clinical out-of-distribution MRI data: A multicohort study.",
            "Group-level cortical surface parcellation with sulcal pits labeling.",
            "BIAS: Transparent reporting of biomedical image analysis challenges.",
            "PadChest: A large chest x-ray image dataset with multi-label annotated reports.",
            "AGE challenge: Angle Closure Glaucoma Evaluation in Anterior Segment Optical Coherence Tomography.",
            "A unified framework for multimodal structure-function mapping based on eigenmodes.",
            "Position paper on COVID-19 imaging and AI: From the clinical needs and technological challenges to initial AI solutions at the lab and national level towards a new era for AI in healthcare.",
            "Image-level detection of arterial occlusions in 4D-CTA of acute stroke patients using deep learning.",
            "Deep hiearchical multi-label classification applied to chest X-ray abnormality taxonomies."
        ]
    },
    {
        "name": "Medical Image Analysis",
        "year": "2019",
        "info": "2019: Volumes\n51,\n52,\n53,\n54,\n55,\n56,\n57,\n58",
        "count": 149,
        "papers": [
            "Mind the gap: Quantification of incomplete ablation patterns after pulmonary vein isolation using minimum path search.",
            "Improvement of fully automated airway segmentation on volumetric computed tomographic images using a 2.5 dimensional convolutional neural net.",
            "Fully convolutional multi-scale residual DenseNets for cardiac segmentation and automated cardiac diagnosis using ensemble of classifiers.",
            "Coronary artery centerline extraction in cardiac CT angiography using a CNN-based orientation classifier.",
            "Segmentation and classification in MRI and US fetal imaging: Recent trends and future prospects.",
            "3D regression neural network for the quantification of enlarged perivascular spaces in brain MRI.",
            "A collaborative computer aided diagnosis (C-CAD) system with eye-tracking, sparse attentional model, and deep learning.",
            "A graph-based lesion characterization and deep embedding approach for improved computer-aided diagnosis of nonmass breast MRI lesions.",
            "Hierarchical segmentation using equivalence test (HiSET): Application to DCE image sequences.",
            "Recovery of 3D rib motion from dynamic chest radiography and CT data using local contrast normalization and articular motion model.",
            "Automatic brain labeling via multi-atlas guided fully convolutional networks.",
            "Disease quantification on PET/CT images without explicit object delineation.",
            "Automatic graph-based method for localization of cochlear implant electrode arrays in clinical CT with sub-voxel accuracy.",
            "Quality-based UnwRap of SUbdivided Large Arrays (URSULA) for high-resolution MRI data.",
            "CATARACTS: Challenge on automatic tool annotation for cataRACT surgery.",
            "Supervised learning for bone shape and cortical thickness estimation from CT images for finite element analysis.",
            "Reproducibility and intercorrelation of graph theoretical measures in structural brain connectivity networks.",
            "Motion artifact recognition and quantification in coronary CT angiography using convolutional neural networks.",
            "Multimodal hyper-connectivity of functional networks using functionally-weighted LASSO for MCI classification.",
            "GAS: A genetic atlas selection strategy in multi-atlas segmentation framework.",
            "Automated segmentation of knee bone and cartilage combining statistical shape knowledge and convolutional neural networks: Data from the Osteoarthritis Initiative.",
            "The effect of motion correction interpolation on quantitative T1 mapping with MRI.",
            "A deep learning framework for unsupervised affine and deformable image registration.",
            "A graph-cut approach for pulmonary artery-vein segmentation in noncontrast CT images.",
            "Micro-Net: A unified model for segmentation of various objects in microscopy images.",
            "Towards cross-modal organ translation and segmentation: A cycle- and shape-consistent generative adversarial network.",
            "Automated diagnosis of breast ultrasonography images using deep neural networks.",
            "MILD-Net: Minimal information loss dilated network for gland instance segmentation in colon histology images.",
            "Robust motion correction for cardiac T1 and ECV mapping using a T1 relaxation model approach.",
            "Repetitive motion compensation for real time intraoperative video processing.",
            "Nonrigid reconstruction of 3D breast surfaces with a low-cost RGBD camera for surgical planning and aesthetic evaluation.",
            "Learning to detect chest radiographs containing pulmonary lesions using visual attention networks.",
            "Training recurrent neural networks robust to incomplete data: Application to Alzheimer's disease progression modeling.",
            "Generalised coherent point drift for group-wise multi-dimensional analysis of diffusion brain MRI data.",
            "Recurrent inference machines for reconstructing heterogeneous MRI data.",
            "Noise reduction in diffusion MRI using non-local self-similar information in joint x-q space.",
            "Novel and facile criterion to assess the accuracy of WSS estimation by 4D flow MRI.",
            "Automatic needle detection and real-time Bi-planar needle visualization during 3D ultrasound scanning of the liver.",
            "Multi-task exclusive relationship learning for alzheimer's disease progression prediction with longitudinal data.",
            "Adversarial training with cycle consistency for unsupervised super-resolution in endomicroscopy.",
            "Multiple-correlation similarity for block-matching based fast CT to ultrasound registration in liver interventions.",
            "Iterative fully convolutional neural networks for automatic vertebra segmentation and identification.",
            "Evaluating reinforcement learning agents for anatomical landmark detection.",
            "Weakly supervised mitosis detection in breast histopathology images using concentric loss.",
            "Frequency-splitting dynamic MRI reconstruction using multi-scale 3D convolutional sparse coding and automatic parameter selection.",
            "Attention gated networks: Learning to leverage salient regions in medical images.",
            "OBELISK-Net: Fewer layers to solve 3D multi-organ segmentation with sparse deformable convolutions.",
            "Medical image classification using synergic deep learning.",
            "An image interpolation approach for acquisition time reduction in navigator-based 4D MRI.",
            "f-AnoGAN: Fast unsupervised anomaly detection with generative adversarial networks.",
            "AAR-RT - A system for auto-contouring organs at risk on CT images for radiation therapy planning: Principles, design, and large-scale evaluation on head-and-neck and thoracic cancer cases.",
            "Optimal surface segmentation with convex priors in irregularly sampled space.",
            "Breast MRI and X-ray mammography registration using gradient values.",
            "Constrained-CNN losses for weakly supervised segmentation.",
            "Deep-learning based multiclass retinal fluid segmentation and detection in optical coherence tomography images using a fully convolutional neural network.",
            "Predicting breast tumor proliferation from whole-slide images: The TUPAC16 challenge.",
            "Exploiting structural redundancy in q-space for improved EAP reconstruction from highly undersampled (k, q)-space in DMRI.",
            "Population shrinkage of covariance (PoSCE) for better individual brain functional-connectivity estimation.",
            "Ultrasound guidance in minimally invasive robotic procedures.",
            "CT male pelvic organ segmentation using fully convolutional networks with boundary sensitive representation.",
            "Patient-attentive sequential strategy for perimetry-based visual field acquisition.",
            "BIRNet: Brain image registration using dual-supervised fully convolutional networks.",
            "Integrating spatial configuration into heatmap regression based CNNs for landmark localization.",
            "A modality-adaptive method for segmenting brain tumors and organs-at-risk in radiation therapy planning.",
            "Discovering hierarchical common brain networks via multimodal deep belief network.",
            "DeepPET: A deep encoder-decoder network for directly solving the PET image reconstruction inverse problem.",
            "Fully automatic 3D reconstruction of the placenta and its peripheral vasculature in intrauterine fetal MRI.",
            "Not-so-supervised: A survey of semi-supervised, multi-instance, and transfer learning in medical image analysis.",
            "Graph Convolutions on Spectral Embeddings for Cortical Surface Parcellation.",
            "Deep Evolutionary Networks with Expedited Genetic Algorithms for Medical Image Denoising.",
            "Fast and accurate tumor segmentation of histology images using persistent homology and deep convolutional features.",
            "Pulmonary nodule detection in CT scans with equivariant CNNs.",
            "Unsupervised tumor detection in Dynamic PET/CT imaging of the prostate.",
            "A kernel-based image denoising method for improving parametric image generation.",
            "A deep network for tissue microstructure estimation using modified LSTM units.",
            "Universal atrial coordinates applied to visualisation, registration and construction of patient specific meshes.",
            "Super-resolution reconstruction of neonatal brain magnetic resonance images via residual structured sparse representation.",
            "Abdominal multi-organ segmentation with organ-attention networks and statistical fusion.",
            "Direct automated quantitative measurement of spine by cascade amplifier regression network with manifold regularization.",
            "Flow network tracking for spatiotemporal and periodic point matching: Applied to cardiac motion analysis.",
            "Automatic CNN-based detection of cardiac MR motion artefacts using k-space data augmentation and curriculum learning.",
            "The deformable most-likely-point paradigm.",
            "Denoising of 3D magnetic resonance images using a residual encoder-decoder Wasserstein generative adversarial network.",
            "Estimating uncertainty in MRF-based image segmentation: A perfect-MCMC approach.",
            "An algorithm for learning shape and appearance models without annotations.",
            "Automated segmentation of macular edema in OCT using deep neural networks.",
            "Attentive neural cell instance segmentation.",
            "Level set distribution model of nested structures using logarithmic transformation.",
            "Multivariate graph learning for detecting aberrant connectivity of dynamic brain networks in autism.",
            "Quantitative CMR population imaging on 20, 000 subjects of the UK Biobank imaging study: LV/RV quantification pipeline and its evaluation.",
            "Corrigendum to \"Predicting breast tumor proliferation from whole-slide images: The TUPAC16 challenge\" [Medical Image Analysis, 54 (2019) 111-121].",
            "Computational anatomy for multi-organ analysis in medical imaging: A review.",
            "GRUU-Net: Integrated convolutional and gated recurrent neural network for cell segmentation.",
            "Explainable cardiac pathology classification on cine MRI with motion characterization by semi-supervised learning of apparent flow.",
            "Tensor decomposition of hyperspectral images to study autofluorescence in age-related macular degeneration.",
            "Quantitative error prediction of medical image registration using regression forests.",
            "BACH: Grand challenge on breast cancer histology images.",
            "Convolutional sparse kernel network for unsupervised medical image analysis.",
            "Suite of meshless algorithms for accurate computation of soft tissue deformation for surgical simulation.",
            "Fusing learned representations from Riesz Filters and Deep CNN for lung tissue classification.",
            "A methodology for generating four-dimensional arterial spin labeling MR angiography virtual phantoms.",
            "Fast predictive simple geodesic regression.",
            "Breast pectoral muscle segmentation in mammograms using a modified holistically-nested edge detection network.",
            "Bayesian bacterial detection using irregularly sampled optical endomicroscopy images.",
            "Cell mitosis event analysis in phase contrast microscopy images using deep learning.",
            "XQ-SR: Joint x-q space super-resolution with application to infant diffusion MRI.",
            "Influence of coupled hemodynamics-arterial wall interaction on compliance in a realistic pulmonary artery with variable intravascular wall properties.",
            "Hierarchical spherical deformation for cortical surface registration.",
            "A geometric framework for ensemble average propagator reconstruction from diffusion MRI.",
            "Segmenting and tracking cell instances with cosine embeddings and recurrent hourglass networks.",
            "Patch-based adaptive weighting with segmentation and scale (PAWSS) for visual tracking in surgical video.",
            "A gradient-based optical-flow cardiac motion estimation method for cine and tagged MR images.",
            "Holistic decomposition convolution for effective semantic segmentation of medical volume images.",
            "Automatic detection and diagnosis of sacroiliitis in CT scans as incidental findings.",
            "TOP-GAN: Stain-free cancer cell classification using deep learning with a small training set.",
            "Accurate and robust deep learning-based segmentation of the prostate clinical target volume in ultrasound images.",
            "A rule-based method for predicting the electrical activation of the heart with cardiac resynchronization therapy from non-invasive clinical data.",
            "Towards quantitative imaging biomarkers of tumor dissemination: A multi-scale parametric modeling of multiple myeloma.",
            "Unsupervised learning of probabilistic diffeomorphic registration for images and surfaces.",
            "Semi-supervised adversarial model for benign-malignant lung nodule classification on chest CT.",
            "Discovering common change-point patterns in functional connectivity across subjects.",
            "Learning the implicit strain reconstruction in ultrasound elastography using privileged information.",
            "Automatic spondylolisthesis grading from MRIs across modalities using faster adversarial recognition network.",
            "Globally optimal segmentation of cell nuclei in fluorescence microscopy images using shape and intensity information.",
            "Self-supervised learning for medical image analysis using image context restoration.",
            "Automated age estimation from MRI volumes of the hand.",
            "Surface-constrained volumetric registration for the early developing brain.",
            "Computer-aided detection and visualization of pulmonary embolism using a novel, compact, and discriminative image representation.",
            "Evaluation of algorithms for Multi-Modality Whole Heart Segmentation: An open-access grand challenge.",
            "Learning to detect lymphocytes in immunohistochemistry with deep learning.",
            "Quantifying the effects of data augmentation and stain color normalization in convolutional neural networks for computational pathology.",
            "Accurate automated Cobb angles estimation using multi-view extrapolation net.",
            "RMDL: Recalibrated multi-instance deep learning for whole slide gastric image classification.",
            "Generative adversarial network in medical imaging: A review.",
            "Automated detection and classification of thyroid nodules in ultrasound images using clinical-knowledge-guided convolutional neural networks.",
            "Metal artifact reduction for the segmentation of the intra cochlear anatomy in CT images of the ear with 3D-conditional GANs.",
            "Multi-task learning for quality assessment of fetal head ultrasound images.",
            "Deep vessel segmentation by learning graphical connectivity.",
            "Automatic segmentation of prostate MRI using convolutional neural networks: Investigating the impact of network architecture on the accuracy of volume measurement and MRI-ultrasound registration.",
            "PV-LVNet: Direct left ventricle multitype indices estimation from 2D echocardiograms of paired apical views with deep neural networks.",
            "How many models/atlases are needed as priors for capturing anatomic population variations?",
            "Hover-Net: Simultaneous segmentation and classification of nuclei in multi-tissue histology images.",
            "Pre and post-hoc diagnosis and interpretation of malignancy from breast DCE-MRI.",
            "Disentangled representation learning in cardiac image analysis.",
            "Special issue on MICCAI 2018.",
            "Adversarial learning for mono- or multi-modal registration.",
            "Predicting PET-derived demyelination from multimodal MRI using sketcher-refiner adversarial training for multiple sclerosis.",
            "Removing segmentation inconsistencies with semi-supervised non-adjacency constraint.",
            "Combined tract segmentation and orientation mapping for bundle-specific tractography."
        ]
    },
    {
        "name": "Medical Image Analysis",
        "year": "2018",
        "info": "2018: Volumes\n43,\n44,\n45,\n46,\n47,\n48,\n49,\n50",
        "count": 118,
        "papers": [
            "An efficient Riemannian statistical shape model using differential coordinates: With application to the classification of data from the Osteoarthritis Initiative.",
            "Segmenting hippocampal subfields from 3T MRI with multi-modality images.",
            "Integrating geometric configuration and appearance information into a unified framework for anatomical landmark localization.",
            "Non-parametric graphnet-regularized representation of dMRI in space and time.",
            "Full left ventricle quantification via deep multitask relationships learning.",
            "Large-scale retrieval for medical image analytics: A comprehensive review.",
            "Intensity inhomogeneity correction of SD-OCT data using macular flatspace.",
            "A deep learning model integrating FCNNs and CRFs for brain tumor segmentation.",
            "Director Field Analysis (DFA): Exploring Local White Matter Geometric Structure in Diffusion MRI.",
            "Automatic initialization and quality control of large-scale cardiac MRI segmentations.",
            "A scale-space curvature matching algorithm for the reconstruction of complex proximal humeral fractures.",
            "Landmark-based deep multi-instance learning for brain disease diagnosis.",
            "Myocardial strain computed at multiple spatial scales from tagged magnetic resonance imaging: Estimating cardiac biomarkers for CRT patients.",
            "A conduction velocity adapted eikonal model for electrophysiology problems with re-excitability evaluation.",
            "Robust brain ROI segmentation by deformation regression and deformable shape model.",
            "Segmentation of the hippocampus by transferring algorithmic knowledge for large cohort processing.",
            "Learning normalized inputs for iterative estimation in medical image segmentation.",
            "An efficient algorithm for dynamic MRI using low-rank and total variation regularizations.",
            "Measurement of the bone endocortical region using clinical CT.",
            "Dictionary-based fiber orientation estimation with improved spatial consistency.",
            "The semiotics of medical image Segmentation.",
            "Deep learning analysis of the myocardium in coronary CT angiography for identification of patients with functionally significant coronary artery stenosis.",
            "A real-time and registration-free framework for dynamic shape instantiation.",
            "Multi-hypothesis tracking of the tongue surface in ultrasound video recordings of normal and impaired speech.",
            "Autocalibration method for non-stationary CT bias correction.",
            "Robust MR elastography stiffness quantification using a localized divergence free finite element reconstruction.",
            "Learning non-linear patch embeddings with neural networks for label fusion.",
            "Group-wise similarity registration of point sets using Student's t-mixture model for statistical shape models.",
            "The first MICCAI challenge on PET tumor segmentation.",
            "Gaze gesture based human robot interaction for laparoscopic surgery.",
            "Automatic spinal cord localization, robust to MRI contrasts using global curve optimization.",
            "Enhancing interpretability of automatically extracted machine learning features: application to a RBM-Random Forest system on brain lesion segmentation.",
            "Efficient and robust cell detection: A structured regression approach.",
            "Low-dimensional representation of cardiac motion using Barycentric Subspaces: A new group-wise paradigm for estimation, analysis, and reconstruction.",
            "Long Term Safety Area Tracking (LT-SAT) with online failure detection and recovery for robotic minimally invasive surgery.",
            "Fast elastic registration of soft tissues under large deformations.",
            "3D multi-scale FCN with random modality voxel dropout learning for Intervertebral Disc Localization and Segmentation from Multi-modality MR Images.",
            "How does the femoral cortex depend on bone shape? A methodology for the joint analysis of surface texture and shape.",
            "Conversion and time-to-conversion predictions of mild cognitive impairment using low-rank affinity pursuit denoising and matrix completion.",
            "Universal ventricular coordinates: A generic framework for describing position within the heart and transferring data.",
            "Spatial aggregation of holistically-nested convolutional neural networks for automated pancreas localization and segmentation.",
            "A novel multi-atlas strategy with dense deformation field reconstruction for abdominal and thoracic multi-organ segmentation from computed tomography.",
            "DeepMitosis: Mitosis detection via deep detection, verification and segmentation networks.",
            "Fully-automated alignment of 3D fetal brain ultrasound to a canonical reference space using multi-task learning.",
            "Intrasubject multimodal groupwise registration with the conditional template entropy.",
            "Multiscale deep neural network based analysis of FDG-PET images for the early diagnosis of Alzheimer's disease.",
            "The decomposition of deformation: New metrics to enhance shape analysis in medical imaging.",
            "Estimating fiber orientation distribution from diffusion MRI with spherical needlets.",
            "A Survey of Methods for 3D Histology Reconstruction.",
            "Multi-channel multi-scale fully convolutional network for 3D perivascular spaces segmentation in 7T MR images.",
            "Cerebrovascular network registration via an efficient attributed graph matching technique.",
            "Neighborhood resolved fiber orientation distributions (NRFOD) in automatic labeling of white matter fiber pathways.",
            "Rapid fully automatic segmentation of subcortical brain structures by shape-constrained surface adaptation.",
            "A deep learning approach for pose estimation from volumetric OCT data.",
            "Heterogeneous Multifrequency Direct Inversion (HMDI) for magnetic resonance elastography with application to a clinical brain exam.",
            "Riemannian metric optimization on surfaces (RMOS) for intrinsic brain mapping in the Laplace-Beltrami embedding space.",
            "Fully automatic detection and segmentation of abdominal aortic thrombus in post-operative CTA images using Deep Convolutional Neural Networks.",
            "SiSSR: Simultaneous subdivision surface registration for the quantification of cardiac function from computed tomography in canines.",
            "Joint solution for PET image segmentation, denoising, and partial volume correction.",
            "Instrument detection and pose estimation with rigid part mixtures model in video-assisted surgeries.",
            "Probabilistic guidance for catheter tip motion in cardiac ablation procedures.",
            "Statistical testing and power analysis for brain-wide association study.",
            "Deep embedding convolutional neural network for synthesizing CT image from T1-Weighted MR image.",
            "Deep learning in mammography and breast histology, an overview and future trends.",
            "A deep Boltzmann machine-driven level set method for heart motion tracking using cine MRI images.",
            "Integration of temporal and spatial properties of dynamic connectivity networks for automatic diagnosis of brain disease.",
            "Robust variational segmentation of 3D bone CT data with thin cartilage interfaces.",
            "Automatic recognition of holistic functional brain networks using iteratively optimized convolutional neural networks (IO-CNN) with weak label initialization.",
            "VP-Nets : Efficient automatic localization of key brain structures in 3D fetal neurosonography.",
            "A probabilistic approach to joint cell tracking and segmentation in high-throughput microscopy videos.",
            "A work flow to build and validate patient specific left atrium electrophysiology models from catheter measurements.",
            "Weighted regularized statistical shape space projection for breast 3D model reconstruction.",
            "Personalized computational modeling of left atrial geometry and transmural myofiber architecture.",
            "Vortical features for myocardial rotation assessment in hypertrophic cardiomyopathy using cardiac tagged magnetic resonance.",
            "Monitoring tool usage in surgery videos using boosted convolutional and recurrent neural networks.",
            "Automated comprehensive Adolescent Idiopathic Scoliosis assessment using MVC-Net.",
            "Complex networks reveal early MRI markers of Parkinson's disease.",
            "Joint spatial-angular sparse coding for dMRI with separable dictionaries.",
            "Quantifying the uncertainty in model parameters using Gaussian process-based Markov chain Monte Carlo in cardiac electrophysiology.",
            "Superpixel and multi-atlas based fusion entropic model for the segmentation of X-ray images.",
            "The challenge of cerebral magnetic resonance imaging in neonates: A new method using mathematical morphology for the segmentation of structures including diffuse excessive high signal intensities.",
            "Ω-Net (Omega-Net): Fully automatic, multi-view cardiac MR detection, orientation, and segmentation with deep neural networks.",
            "A deep learning approach for real time prostate segmentation in freehand ultrasound guided biopsy.",
            "Disease prediction using graph convolutional networks: Application to Autism Spectrum Disorder and Alzheimer's disease.",
            "Temporal and volumetric denoising via quantile sparse image prior.",
            "Tracing cell lineages in videos of lens-free microscopy.",
            "Dual-modality endoscopic probe for tissue surface shape reconstruction and hyperspectral imaging enabled by deep neural networks.",
            "Automated sub-cortical brain structure segmentation combining spatial and deep convolutional features.",
            "3D freehand ultrasound without external tracking using deep learning.",
            "Towards intelligent robust detection of anatomical structures in incomplete volumetric data.",
            "Slice-level diffusion encoding for motion and distortion correction.",
            "Deep learning and conditional random fields-based depth estimation and topographical reconstruction from conventional endoscopy.",
            "A cortical shape-adaptive approach to local gyrification index.",
            "Special Issue on MICCAI 2017.",
            "Weakly-supervised convolutional neural networks for multimodal image registration.",
            "Synthesizing retinal and neuronal images with generative adversarial nets.",
            "Measuring rib cortical bone thickness and cross section from CT.",
            "Segmentation of glandular epithelium in colorectal tumours to automatically compartmentalise IHC biomarker quantification: A deep learning approach.",
            "A computational method for longitudinal mapping of orientation-specific expansion of cortical surface in infants.",
            "Neural multi-atlas label fusion: Application to cardiac MR images.",
            "Deep convolutional neural network-based segmentation and classification of difficult to define metastatic spinal lesions in 3D CT data.",
            "Quantification of the detailed cardiac left ventricular trabecular morphogenesis in the mouse embryo.",
            "Building medical image classifiers with very limited data using segmentation networks.",
            "Unmixing dynamic PET images with variable specific binding kinetics.",
            "Automated multi-atlas segmentation of cardiac 4D flow MRI.",
            "Fast iteratively reweighted least squares algorithms for analysis-based sparse reconstruction.",
            "Equilibrated warping: Finite element image registration with finite strain equilibrium gap regularization.",
            "Spine-GAN: Semantic segmentation of multiple spinal structures.",
            "Algorithms for left atrial wall segmentation and thickness - Evaluation on an open-source CT and MRI image database.",
            "Automatic segmentation variability estimation with segmentation priors.",
            "Iterative multi-path tracking for video and volume segmentation with sparse point supervision.",
            "Direct delineation of myocardial infarction without contrast agents using a joint motion feature learning architecture.",
            "Quantitative 3D Analysis of Coronary Wall Morphology in Heart Transplant Patients: OCT-Assessed Cardiac Allograft Vasculopathy Progression.",
            "A pilot study using kernelled support tensor machine for distant failure prediction in lung SBRT.",
            "Local spatio-temporal encoding of raw perfusion MRI for the prediction of final lesion in stroke.",
            "Joint registration and synthesis using a probabilistic model for alignment of MRI and histological sections.",
            "A hybrid camera- and ultrasound-based approach for needle localization and tracking using a 3D motorized curvilinear ultrasound probe.",
            "Automatic grading of prostate cancer in digitized histopathology images: Learning from multiple experts."
        ]
    },
    {
        "name": "Medical Image Analysis",
        "year": "2017",
        "info": "2017: Volumes\n35,\n36,\n37,\n38,\n39,\n40,\n41,\n42",
        "count": 148,
        "papers": [
            "Vascular image registration techniques: A living review.",
            "Brain tumor segmentation with Deep Neural Networks.",
            "Structural graph-based morphometry: A multiscale searchlight framework based on sulcal pits.",
            "A graph theoretic approach for computing 3D+time biventricular cardiac strain from tagged MRI data.",
            "Computing group cardinality constraint solutions for logistic regression problems.",
            "Characterization of myocardial motion patterns by unsupervised multiple kernel learning.",
            "Autoadaptive motion modelling for MR-based respiratory motion estimation.",
            "A tree-matching algorithm: Application to airways in CT images of subjects with the acute respiratory distress syndrome.",
            "Federated optimisation of kinetic analysis problems.",
            "Nonlinear multiscale regularisation in MR elastography: Towards fine feature mapping.",
            "Stochastic optimization with randomized smoothing for image registration.",
            "Combining deep learning and level set for the automated segmentation of the left ventricle of the heart from cardiac cine magnetic resonance.",
            "Phase-aware echocardiogram stabilization using keyframes.",
            "Automatic segmentation approach to extracting neonatal cerebral ventricles from 3D ultrasound images.",
            "Automatic detection of over 100 anatomical landmarks in medical CT images: A framework with independent detectors and combinatorial optimization.",
            "Articulated clinician detection using 3D pictorial structures on RGB-D data.",
            "Interactive training system for interventional electrocardiology procedures.",
            "Personalized mitral valve closure computation and uncertainty analysis from 3D echocardiography.",
            "ISLES 2015 - A public evaluation benchmark for ischemic stroke lesion segmentation from multispectral MRI.",
            "Patient independent representation of the detailed cardiac ventricular anatomy.",
            "Feature-based multi-resolution registration of immunostained serial sections.",
            "Large scale deep learning for computer aided detection of mammographic lesions.",
            "A discriminative feature selection approach for shape analysis: Application to fetal brain cortical folding.",
            "Evaluation and comparison of 3D intervertebral disc localization and segmentation methods for 3D T2 MR data: A grand challenge.",
            "Retrospective 4D MR image construction from free-breathing slice Acquisitions: A novel graph-based approach.",
            "Parameter estimation of perfusion models in dynamic contrast-enhanced imaging: a unified framework for model comparison.",
            "Identifying differences in brain activities and an accurate detection of autism spectrum disorder using resting state functional-magnetic resonance imaging : A spatial filtering approach.",
            "Anatomical medial surfaces with efficient resolution of branches singularities.",
            "Brain shift in neuronavigation of brain tumors: A review.",
            "Cascade of multi-scale convolutional neural networks for bone suppression of chest radiographs in gradient domain.",
            "Optimal slice timing correction and its interaction with fMRI parameters and artifacts.",
            "Automated tissue segmentation of MR brain images in the presence of white matter lesions.",
            "A Bayesian framework for joint morphometry of surface and curve meshes in multi-object complexes.",
            "Random forest regression for magnetic resonance image synthesis.",
            "Gland segmentation in colon histology images: The glas challenge contest.",
            "Novel and powerful 3D adaptive crisp active contour method applied in the segmentation of CT lung images.",
            "Conformal invariants for multiply connected surfaces: Application to landmark curve-based brain morphometry analysis.",
            "When machine vision meets histology: A comparative evaluation of model architecture for classification of histology sections.",
            "Probabilistic tractography using Lasso bootstrap.",
            "Deformable regions of interest with multiple points for tissue tracking in echocardiography.",
            "Atlas-based shape analysis and classification of retinal optical coherence tomography images using the functional shape (fshape) framework.",
            "Real-time target tracking of soft tissues in 3D ultrasound images based on robust visual information and mechanical simulation.",
            "Towards patient-specific modeling of mitral valve repair: 3D transesophageal echocardiography-derived parameter estimation.",
            "Ultrasound-contrast-agent dispersion and velocity imaging for prostate cancer localization.",
            "A laparoscopy-based method for BRDF estimation from in vivo human liver.",
            "Vision-based and marker-less surgical tool detection and tracking: a review of the literature.",
            "Assisting the examination of large histopathological slides with adaptive forests.",
            "A framework for combining a motion atlas with non-motion information to learn clinically useful biomarkers: Application to cardiac resynchronisation therapy response prediction.",
            "Blood vessel modeling for interactive simulation of interventional neuroradiology procedures.",
            "Erratum to \"Predicting Infant Cortical Surface Development Using a 4D Varifold-based Learning Framework and Local Topography-based Shape Morphing\" [Med. Image Anal. 28 (2016)1-12].",
            "Cross contrast multi-channel image registration using image synthesis for MR brain images.",
            "Automatic apical view classification of echocardiograms using a discriminative learning dictionary.",
            "Unsupervised boundary delineation of spinal neural foramina using a multi-feature and adaptive spectral segmentation.",
            "Deep learning for automated skeletal bone age assessment in X-ray images.",
            "Improving airway segmentation in computed tomography using leak detection with convolutional networks.",
            "Efficient multi-scale 3D CNN with fully connected CRF for accurate brain lesion segmentation.",
            "Sparse Bayesian registration of medical images for self-tuning of parameters and spatially adaptive parametrization of displacements.",
            "Comparison of atlas-based techniques for whole-body bone segmentation.",
            "Multiresolution eXtended Free-Form Deformations (XFFD) for non-rigid registration with discontinuous transforms.",
            "View-aligned hypergraph learning for Alzheimer's disease diagnosis with incomplete multi-modality data.",
            "DCAN: Deep contour-aware networks for object instance segmentation from histology images.",
            "Automated annotation and quantitative description of ultrasound videos of the fetal heart.",
            "Progressive multi-atlas label fusion by dictionary evolution.",
            "Migration and interaction tracking for quantitative analysis of phagocyte-pathogen confrontation assays.",
            "Direct and simultaneous estimation of cardiac four chamber volumes by multioutput sparse regression.",
            "Perfusion deconvolution in DSC-MRI with dispersion-compliant bases.",
            "Robust cranial cavity segmentation in CT and CT perfusion images of trauma and suspected stroke patients.",
            "Robust estimation of carotid artery wall motion using the elasticity-based state-space approach.",
            "A framework for analysis of linear ultrasound videos to detect fetal presentation and heartbeat.",
            "Accurate and interpretable classification of microspectroscopy pixels using artificial neural networks.",
            "Adaptive local window for level set segmentation of CT and MRI liver lesions.",
            "Subject-specific abnormal region detection in traumatic brain injury using sparse model selection on high dimensional diffusion data.",
            "The status of augmented reality in laparoscopic surgery as of 2016.",
            "Multi-resolution cell orientation congruence descriptors for epithelium segmentation in endometrial histology images.",
            "Deep ensemble learning of sparse regression models for brain disease diagnosis.",
            "A deep learning approach for the analysis of masses in mammograms with minimal user intervention.",
            "Involuntary eye motion correction in retinal optical coherence tomography: Hardware or software solution?",
            "Statistical appearance models based on probabilistic correspondences.",
            "Task fMRI data analysis based on supervised stochastic coordinate coding.",
            "Multi-resolution multi-object statistical shape models based on the locality assumption.",
            "Low-rank and sparse decomposition based shape model and probabilistic atlas for automatic pathological organ segmentation.",
            "Longitudinal segmentation of age-related white matter hyperintensities.",
            "Dual discriminative local coding for tissue aging analysis.",
            "Shape-aware surface reconstruction from sparse 3D point-clouds.",
            "Robust detection and segmentation of cell nuclei in biomedical images based on a computational topology framework.",
            "Integrated local binary pattern texture features for classification of breast tissue imaged by optical coherence microscopy.",
            "Extraction of the 3D local orientation of myocytes in human cardiac tissue using X-ray phase-contrast micro-tomography and multi-scale analysis.",
            "Population model of bladder motion and deformation based on dominant eigenmodes and mixed-effects models in prostate cancer radiotherapy.",
            "Robust guidewire tracking under large deformations combining segment-like features (SEGlets).",
            "Semi-local tractography strategies using neighborhood information.",
            "Transformation diffusion reconstruction of three-dimensional histology volumes from two-dimensional image stacks.",
            "A novel relational regularization feature selection method for joint regression and classification in AD diagnosis.",
            "On characterizing population commonalities and subject variations in brain networks.",
            "Geodesic shape regression with multiple geometries and sparse parameters.",
            "Multi-atlas pancreas segmentation: Atlas selection based on vessel structure.",
            "Learning Non-rigid Deformations for Robust, Constrained Point-based Registration in Image-Guided MR-TRUS Prostate Intervention.",
            "Fully-automatic left ventricular segmentation from long-axis cardiac cine MR scans.",
            "Maximum likelihood estimation of cardiac fiber bundle orientation from arbitrarily spaced diffusion weighted images.",
            "Convolutional neural network regression for short-axis left ventricle segmentation in cardiac cine MR sequences.",
            "A hybrid patient-specific biomechanical model based image registration method for the motion estimation of lungs.",
            "Slice-to-volume medical image registration: A survey.",
            "Motion-robust parameter estimation in abdominal diffusion-weighted MRI by simultaneous image registration and model estimation.",
            "The AGES-Reykjavik study atlases: Non-linear multi-spectral template and atlases for studies of the ageing brain.",
            "Automatic online layer separation for vessel enhancement in X-ray angiograms for percutaneous coronary interventions.",
            "Quantifying the brain's sheet structure with normalized convolution.",
            "Deep image mining for diabetic retinopathy screening.",
            "A structured latent model for ovarian carcinoma subtyping from histopathology slides.",
            "A machine-learning graph-based approach for 3D segmentation of Bruch's membrane opening from glaucomatous SD-OCT volumes.",
            "Multi-modal classification of neurodegenerative disease by progressive graph-based transductive learning.",
            "Segmentation of lumen and outer wall of abdominal aortic aneurysms from 3D black-blood MRI with a registration based geodesic active contour model.",
            "ShapeCut: Bayesian surface estimation using shape-driven graph.",
            "Detection and characterisation of bone destruction in murine rheumatoid arthritis using statistical shape models.",
            "Statistical characterization of noise for spatial standardization of CT scans: Enabling comparison with multiple kernels and doses.",
            "Automatic segmentation of the lumen region in intravascular images of the coronary artery.",
            "Stereo vision-based tracking of soft tissue motion with application to online ablation control in laser microsurgery.",
            "A multimodal spatiotemporal cardiac motion atlas from MR and ultrasound data.",
            "Segmentation of medical images using mean value guided contour.",
            "Brain-shift compensation using intraoperative ultrasound and constraint-based biomechanical simulation.",
            "A new algebraic method for quantitative proton density mapping using multi-channel coil data.",
            "Central focused convolutional neural networks: Developing a data-driven model for lung nodule segmentation.",
            "Modelling and extraction of pulsatile radial distension and compression motion for automatic vessel segmentation from video.",
            "The 19th International Conference on Medical Image Computing and Computer-Assisted Intervention (MICCAI 2016).",
            "Guiding multimodal registration with learned optimization updates.",
            "Dual-core steered non-rigid registration for multi-modal images via bi-directional image synthesis.",
            "Continuous representations of brain connectivity using spatial point processes.",
            "3D deeply supervised network for automated segmentation of volumetric medical images.",
            "Probabilistic modeling of anatomical variability using a low dimensional parameterization of diffeomorphisms.",
            "SpineNet: Automated classification and evidence visualization in spinal MRIs.",
            "Validation, comparison, and combination of algorithms for automatic detection of pulmonary nodules in computed tomography images: The LUNA16 challenge.",
            "Gyral net: A new representation of cortical folding organization.",
            "Estimation of individual axon bundle properties by a Multi-Resolution Discrete-Search method.",
            "Designing image segmentation studies: Statistical power, sample size and reference standard quality.",
            "A survey on deep learning in medical image analysis.",
            "New methods for the geometrical analysis of tubular organs.",
            "A competitive strategy for atrial and aortic tract segmentation based on deformable models.",
            "Supervised graph hashing for histopathology image retrieval and classification.",
            "MR-based respiratory and cardiac motion correction for PET imaging.",
            "Ensemble of expert deep neural networks for spatio-temporal denoising of contrast-enhanced MRI sequences.",
            "3D/2D Registration with superabundant vessel reconstruction for cardiac resynchronization therapy.",
            "Accurate model-based segmentation of gynecologic brachytherapy catheter collections in MRI-images.",
            "Learning and combining image neighborhoods using random forests for neonatal brain disease classification.",
            "Constructing fine-granularity functional brain network atlases via deep convolutional autoencoder.",
            "Co-trained convolutional neural networks for automated detection of prostate cancer in multi-parametric MRI.",
            "Multivariate brain network graph identification in functional MRI.",
            "Registration and fusion quantification of augmented reality based nasal endoscopic surgery.",
            "CorteXpert: A model-based method for automatic renal cortex segmentation.",
            "Discriminative confidence estimation for probabilistic multi-atlas label fusion.",
            "Tissue microstructure estimation using a deep network inspired by a dictionary-based framework."
        ]
    },
    {
        "name": "Medical Image Analysis",
        "year": "2016",
        "info": "2016: Volumes\n27,\n28,\n29,\n30,\n31,\n32,\n33,\n34",
        "count": 104,
        "papers": [
            "Note Special Issue on Discrete Graphical Models in Biomedical Image Analysis.",
            "Detecting overlapping instances in microscopy images using extremal region trees.",
            "Adaptive multi-level conditional random fields for detection and segmentation of small enhanced pathology in medical images.",
            "An efficient conditional random field approach for automatic and interactive neuron segmentation.",
            "Hierarchical max-flow segmentation framework for multi-atlas segmentation with Kohonen self-organizing map based Gaussian mixture modeling.",
            "Deformable image registration by combining uncertainty estimates from supervoxel belief propagation.",
            "Associating approximate paths and temporal sequences of noisy detections: Application to the recovery of spatio-temporal cancer cell trajectories.",
            "Skin lesion tracking using structured graphical models.",
            "Image reconstruction of compressed sensing MRI using graph-based redundant wavelet transform.",
            "Statistically-driven 3D fiber reconstruction and denoising from multi-slice cardiac DTI using a Markov random field model.",
            "Predicting infant cortical surface development using a 4D varifold-based learning framework and local topography-based shape morphing.",
            "Registration of dynamic multiview 2D ultrasound and late gadolinium enhanced images of the heart: Application to hypertrophic cardiomyopathy characterization.",
            "Automatic detection of pleural effusion in chest radiographs.",
            "A flexible patch based approach for combined denoising and contrast enhancement of digital X-ray images.",
            "Joint optimization of segmentation and shape prior from level-set-based statistical shape model, and its application to the automated segmentation of abdominal organs.",
            "Multi-oriented windowed harmonic phase reconstruction for robust cardiac strain imaging.",
            "Shape analysis of hypertrophic and hypertensive heart disease using MRI-based 3D surface models of left ventricular geometry.",
            "A self-calibrating approach for the segmentation of retinal vessels by template matching and contour reconstruction.",
            "Automatic detection of referral patients due to retinal pathologies through data mining.",
            "PCA-based groupwise image registration for quantitative MRI.",
            "Tomoelastography by multifrequency wave number recovery from time-harmonic propagating shear waves.",
            "Groupwise connectivity-based parcellation of the whole human cortical surface using watershed-driven dimension reduction.",
            "Computer assisted preoperative planning of bone fracture reduction: Simulation techniques and new trends.",
            "The application of a new sampling theorem for non-bandlimited signals on the sphere: Improving the recovery of crossing fibers for low b-value acquisitions.",
            "Automated classification of brain tumor type in whole-slide digital pathology images using local representative tiles.",
            "Statistical shape analysis using 3D Poisson equation - A quantitatively validated approach.",
            "Geometrical deployment for braided stent.",
            "Evaluation of state-of-the-art segmentation algorithms for left ventricle infarct from late Gadolinium enhancement MR images.",
            "A combined deep-learning and deformable-model approach to fully automatic segmentation of the left ventricle in cardiac MRI.",
            "Multi-scale deep networks and regression forests for direct bi-ventricular volume estimation.",
            "Automatic localization of endoscope in intraoperative CT image: A simple approach to augmented reality guidance in laparoscopic surgery.",
            "Online tracking and retargeting with applications to optical biopsy in gastrointestinal endoscopic examinations.",
            "Magnetic resonance imaging-guided attenuation correction in whole-body PET/MRI using a sorted atlas approach.",
            "Directional wavelet based features for colonic polyp classification.",
            "Non-Euclidean classification of medically imaged objects via s-reps.",
            "Tailor-made heart simulation predicts the effect of cardiac resynchronization therapy in a canine model of heart failure.",
            "A benchmark for comparison of dental radiography analysis algorithms.",
            "Multi-scale patch and multi-modality atlases for whole heart segmentation of MRI.",
            "Regression forest-based automatic estimation of the articular margin plane for shoulder prosthesis planning.",
            "X-ray and magnetic resonance imaging fusion for cardiac resynchronization therapy.",
            "Supervised domain adaptation of decision forests: Transfer of models trained in vitro for in vivo intravascular ultrasound tissue characterization.",
            "A spherical harmonics intensity model for 3D segmentation and 3D shape analysis of heterochromatin foci.",
            "Group-wise consistent cortical parcellation based on connectional profiles.",
            "Reconstruction of coronary arteries from X-ray angiography: A review.",
            "Pieces-of-parts for supervoxel segmentation with global context: Application to DCE-MRI tumour delineation.",
            "Hyper-connectivity of functional networks for brain disease diagnosis.",
            "Active appearance pyramids for object parametrisation and fitting.",
            "Non Local Spatial and Angular Matching: Enabling higher spatial resolution diffusion MRI datasets through adaptive denoising.",
            "Integration of electro-anatomical and imaging data of the left ventricle: An evaluation framework.",
            "What lies beneath? Diffusion EAP-based study of brain tissue microstructure.",
            "Automatic optimal filament segmentation with sub-pixel accuracy using generalized linear models and B-spline level-sets.",
            "Spatially-constrained probability distribution model of incoherent motion (SPIM) for abdominal diffusion-weighted MRI.",
            "Influence of ultrasound speckle tracking strategies for motion and strain estimation.",
            "Simultaneous segmentation and anatomical labeling of the cerebral vasculature.",
            "A fully automated tortuosity quantification system with application to corneal nerve fibres in confocal microscopy images.",
            "A framework for the automatic detection and characterization of brain malformations: Validation on the corpus callosum.",
            "Estimation of fiber orientations using neighborhood information.",
            "Selecting radiomic features from FDG-PET images for cancer treatment outcome prediction.",
            "Renal compartment segmentation in DCE-MRI images.",
            "Identification of lesion images from gastrointestinal endoscope based on feature extraction of combinational methods with and without learning process.",
            "Medical Image Analysis - past, present, and future.",
            "Oncological image analysis.",
            "Learning clinically useful information from images: Past, present and future.",
            "Shaping the future through innovations: From medical imaging to precision medicine.",
            "Precision Imaging: more descriptive, predictive and integrative imaging.",
            "Reflections on ultrasound image analysis.",
            "Cardiac image modelling: Breadth and depth in heart disease.",
            "Four challenges in medical image analysis from an industrial perspective.",
            "From clinical imaging and computational models to personalised medicine and image guided interventions.",
            "Image-guided interventions and computer-integrated therapy: Quo vadis?",
            "Personalized, relevance-based Multimodal Robotic Imaging and augmented reality for Computer Assisted Interventions.",
            "From computer-assisted intervention research to clinical impact: The need for a holistic approach.",
            "Image guidance in orthopaedics and traumatology: A historical perspective.",
            "Computer Aided Orthopaedic Surgery: Incremental shift or paradigm change?",
            "Machine learning for medical images analysis.",
            "Machine learning approaches in medical image analysis: From detection to diagnosis.",
            "Large-Scale medical image analytics: Recent methodologies, applications and Future directions.",
            "(Hyper)-graphical models in biomedical image analysis.",
            "MR brain image analysis in dementia: From quantitative imaging biomarkers to ageing brain models and imaging genetics.",
            "Longitudinal modeling of appearance and shape and its potential for clinical use.",
            "Computational brain connectivity mapping: A core health and scientific challenge.",
            "Spatial normalization of brain images and beyond.",
            "Imaging biomarkers in multiple Sclerosis: From image analysis to population imaging.",
            "A survey of medical image registration - under review.",
            "Advances and challenges in deformable image registration: From image fusion to complex motion modelling.",
            "Computational neuroanatomy using brain deformations: From brain parcellation to multivariate pattern analysis and machine learning.",
            "Statistical shape analysis: From landmarks to diffeomorphisms.",
            "From macro-scale to micro-scale computational anatomy: a perspective on the next 20 years.",
            "Quantitative analysis of retinal OCT.",
            "Image analysis and machine learning in digital pathology: Challenges and opportunities.",
            "Increasing the impact of medical image computing using community-based open-access hackathons: The NA-MIC and 3D Slicer experience.",
            "Open-source platforms for navigated image-guided interventions.",
            "Editorial for the Special Issue on MICCAI 2015.",
            "Scalable histopathological image analysis via supervised hashing with multiple features.",
            "Metric hashing forests.",
            "Learning in data-limited multimodal scenarios: Scandent decision forests and tree-based features.",
            "Sampling image segmentations for uncertainty quantification.",
            "A self-taught artificial agent for multi-physics computational model personalization.",
            "Seeing the invisible in differential interference contrast microscopy images.",
            "Real-time localization of articulated surgical instruments in retinal microsurgery.",
            "Real-time pose estimation of devices from x-ray images: Application to x-ray/echo registration for cardiac interventions.",
            "Automated integer programming based separation of arteries and veins from thoracic CT images.",
            "Automatic coronary artery calcium scoring in cardiac CT angiography using paired convolutional neural networks.",
            "Slic-Seg: A minimally interactive segmentation of the placenta from sparse and motion-corrupted fetal MRI in multiple views."
        ]
    },
    {
        "name": "Medical Image Analysis",
        "year": "2015",
        "info": "2015: Volumes\n19,\n20,\n21,\n22,\n23,\n24,\n25,\n26",
        "count": 123,
        "papers": [
            "Non-rigid multi-frame registration of cell nuclei in live cell fluorescence microscopy image data.",
            "Computer-aided detection of exophytic renal lesions on non-contrast CT images.",
            "Persistent and automatic intraoperative 3D digitization of surfaces under dynamic magnifications of an operating microscope.",
            "Trainable COSFIRE filters for vessel delineation with application to retinal images.",
            "How big is this neoplasia? Live colonoscopic size measurement using the Infocus-Breakpoint.",
            "Denoising of 3D magnetic resonance images by using higher-order singular value decomposition.",
            "Automated analysis of spine dynamics on live CA1 pyramidal cells.",
            "Multi-atlas segmentation with augmented features for cardiac MR images.",
            "Self-gated MRI motion modeling for respiratory motion compensation in integrated PET/MRI.",
            "Methodology for implementing patient-specific spatial boundary condition during a cardiac cycle from phase-contrast MRI for hemodynamic assessment.",
            "Interventional digital tomosynthesis from a standard fluoroscopy system using 2D-3D registration.",
            "Context aware spatio-temporal cell tracking in densely packed multilayer tissues.",
            "Sequential Monte Carlo tracking of the marginal artery by multiple cue fusion and random forest regression.",
            "A homotopy-based sparse representation for fast and accurate shape prior modeling in liver surgical planning.",
            "Right ventricle segmentation from cardiac MRI: A collation study.",
            "Quantification of local changes in myocardial motion by diffeomorphic registration via currents: Application to paced hypertrophic obstructive cardiomyopathy in 2D echocardiographic sequences.",
            "Joint 3-D vessel segmentation and centerline extraction using oblique Hough forests with steerable filters.",
            "Medical image segmentation on GPUs - A comprehensive review.",
            "PDM-ENLOR for segmentation of mouse brain gene expression images.",
            "Automated segmentation and tracking of non-rigid objects in time-lapse microscopy videos of polymorphonuclear neutrophils.",
            "Manifold learning on brain functional networks in aging.",
            "Predict brain MR image registration via sparse learning of appearance and transformation.",
            "Local estimation of the noise level in MRI using structural adaptation.",
            "On facilitating the use of HARDI in population studies by creating rotation-invariant markers.",
            "Characterization of the nonlinear elastic properties of soft tissues using the supersonic shear imaging (SSI) technique: Inverse method, ex vivo and in vivo experiments.",
            "Sparse representation of whole-brain fMRI signals for identification of functional networks.",
            "Evaluation of automatic neonatal brain segmentation algorithms: The NeoBrainS12 challenge.",
            "Automated anatomical labeling of abdominal arteries and hepatic portal system extracted from abdominal CT volumes.",
            "Subject-specific finite-element modeling of normal aortic valve biomechanics from 3D+t TEE images.",
            "Fast and robust 3D ultrasound registration - Block and game theoretic matching.",
            "Spatially variant noise estimation in MRI: A homomorphic approach.",
            "Segmentation of tongue muscles from super-resolution magnetic resonance images.",
            "A novel method for identifying a graph-based representation of 3-D microvascular networks from fluorescence microscopy image stacks.",
            "Non-invasive evaluation of breast cancer response to chemotherapy using quantitative ultrasonic backscatter parameters.",
            "Assessment of algorithms for mitosis detection in breast cancer histopathology images.",
            "Independent measurement of femoral cortical thickness and cortical bone density using clinical CT.",
            "Automated localization of breast cancer in DCE-MRI.",
            "Bridging the gap in connectomic studies: A particle filtering framework for estimating structural connectivity at network scale.",
            "A 4D hyperspherical interpretation of q-space.",
            "Data-driven shape parameterization for segmentation of the right ventricle from 3D+t echocardiography.",
            "Robust whole-brain segmentation: Application to traumatic brain injury.",
            "Quantification of ultrasonic texture intra-heterogeneity via volumetric stochastic modeling for tissue characterization.",
            "Learning-based prediction of gestational age from ultrasound images of the fetal brain.",
            "Elastic registration of prostate MR images based on estimation of deformation states.",
            "A novel cortical thickness estimation method based on volumetric Laplace-Beltrami operator and heat kernel.",
            "Corrigendum to \"Contour tracking in echocardiographic sequences via sparse representation and dictionary learning\" [Med. Image Anal.18(2) (2014) 253-271].",
            "Patient-specific biomechanical model as whole-body CT image registration tool.",
            "MRI noise estimation and denoising using non-local PCA.",
            "Segmentation of pulmonary nodules in computed tomography using a regression neural network approach and its application to the Lung Image Database Consortium and Image Database Resource Initiative dataset.",
            "Unified heat kernel regression for diffusion, kernel smoothing and wavelets on manifolds and its application to mandible growth modeling in CT images.",
            "Large-scale automatic reconstruction of neuronal processes from electron microscopy images.",
            "4D hyperspherical harmonic (HyperSPHARM) representation of surface anatomy: A holistic treatment of multiple disconnected anatomical structures.",
            "Locality-constrained Subcluster Representation Ensemble for lung image classification.",
            "Diffusion MRI abnormalities detection with orientation distribution functions: A multiple sclerosis longitudinal study.",
            "Super-resolved enhancing and edge deghosting (SEED) for spatiotemporally encoded single-shot MRI.",
            "Skuller: A volumetric shape registration algorithm for modeling skull deformities.",
            "Multiscale properties of weighted total variation flow with applications to denoising and registration.",
            "Globally optimal co-segmentation of three-dimensional pulmonary 1H and hyperpolarized 3He MRI with spatial consistence prior.",
            "Robust inverse-consistent affine CT-MR registration in MRI-assisted and MRI-alone prostate radiation therapy.",
            "Multi-organ localization with cascaded global-to-local regression and shape prior.",
            "Joint tumor growth prediction and tumor segmentation on therapeutic follow-up PET images.",
            "Discriminative dictionary learning for abdominal multi-organ segmentation.",
            "A hybrid method for airway segmentation and automated measurement of bronchial wall thickness on CT.",
            "Efficient multi-atlas abdominal segmentation on clinically acquired CT with SIMPLE context learning.",
            "Automated extraction and labelling of the arterial tree from whole-body MRA data.",
            "Echocardiogram enhancement using supervised manifold denoising.",
            "Estimation of Purkinje trees from electro-anatomical mapping of the left ventricle using minimal cost geodesics.",
            "MR image synthesis by contrast learning on neighborhood ensembles.",
            "Myocardial perfusion analysis in cardiac computed tomography angiographic images at rest.",
            "A maximum likelihood approach to diffeomorphic speckle tracking for 3D strain estimation in echocardiography.",
            "A Markov random field approach to group-wise registration/mosaicing with application to ultrasound.",
            "Generation of 3D shape, density, cortical thickness and finite element mesh of proximal femur from a DXA image.",
            "A transversal approach for patch-based label fusion via matrix completion.",
            "Analytic signal phase-based myocardial motion estimation in tagged MRI sequences by a bilinear model and motion compensation.",
            "Quantitative comparison of multiframe data association techniques for particle tracking in time-lapse fluorescence microscopy.",
            "Interpreting support vector machine models for multivariate group wise analysis in neuroimaging.",
            "Multi-atlas segmentation of biomedical images: A survey.",
            "Multi-sensor super-resolution for hybrid range imaging with application to 3-D endoscopy and open surgery.",
            "Finite element analysis for normal pressure hydrocephalus: The effects of the integration of sulci.",
            "Weighting training images by maximizing distribution similarity for supervised segmentation across scanners.",
            "Segmentation of embryonic and fetal 3D ultrasound images based on pixel intensity distributions and shape priors.",
            "Informed constrained spherical deconvolution (iCSD).",
            "Observation-driven adaptive differential evolution and its application to accurate and smooth bronchoscope three-dimensional motion tracking.",
            "Structured patch model for a unified automatic and interactive segmentation framework.",
            "MEDIA special issue on MICCAI 2014.",
            "Shape analysis based on depth-ordering.",
            "Automatic multi-resolution shape modeling of multi-organ structures.",
            "Construction of 4D high-definition cortical surface atlases of infants: Methods and applications.",
            "Bayesian principal geodesic analysis for estimating intrinsic diffeomorphic image variability.",
            "Landmark constrained genus-one surface Teichmüller map applied to surface registration in medical imaging.",
            "Splines for diffeomorphisms.",
            "Tumor growth prediction with reaction-diffusion and hyperelastic biomechanical model by physiological data fusion.",
            "Reconstructing cerebrovascular networks under local physiological constraints by integer programming.",
            "Pico Lantern: Surface reconstruction and augmented reality in laparoscopic surgery using a pick-up laser projector.",
            "Automatic segmentation of occluded vasculature via pulsatile motion analysis in endoscopic robot-assisted partial nephrectomy video.",
            "Cell-sensitive phase contrast microscopy imaging by multiple exposures.",
            "Abdominal multi-organ segmentation from CT images using conditional shape-location and unsupervised intensity priors.",
            "Gradient-based enhancement of tubular structures in medical images.",
            "Feature-based fuzzy connectedness segmentation of ultrasound images with an object completion step.",
            "A simulation system for biomarker evolution in neurodegenerative disease.",
            "Discriminating dysplasia: Optical tomographic texture analysis of colorectal polyps.",
            "3D harmonic phase tracking with anatomical regularization.",
            "Multi-atlas learner fusion: An efficient segmentation approach for large-scale data.",
            "Local fractal dimension based approaches for colonic polyp classification.",
            "Fully automated 2D-3D registration and verification.",
            "Joint segmentation of lumen and outer wall from femoral artery MR images: Towards 3D imaging measurements of peripheral arterial disease.",
            "A bi-ventricular cardiac atlas built from 1000+ high resolution MR images of healthy subjects and an analysis of shape and motion.",
            "Loosely coupled level sets for simultaneous 3D retinal layer segmentation in optical coherence tomography.",
            "Non-invasive pressure difference estimation from PC-MRI using the work-energy equation.",
            "MASCG: Multi-Atlas Segmentation Constrained Graph method for accurate segmentation of hip CT images.",
            "Voxelwise atlas rating for computer assisted diagnosis: Application to congenital heart diseases of the great arteries.",
            "Automatic classification of pulmonary peri-fissural nodules in computed tomography using an ensemble of 2D views and a convolutional neural network out-of-the-box.",
            "Probabilistic non-linear registration with spatially adaptive regularisation.",
            "Medially constrained deformable modeling for segmentation of branching medial structures: Application to aortic valve segmentation and morphometry.",
            "Vessel extraction from non-fluorescein fundus images using orientation-aware detector.",
            "Sparse and Adaptive Diffusion Dictionary (SADD) for recovering intra-voxel white matter structure.",
            "Building dynamic population graph for accurate correspondence detection.",
            "Improved fidelity of brain microstructure mapping from single-shell diffusion MRI.",
            "Strengths and weaknesses of state of the art fiber tractography pipelines - A comprehensive in-vivo and phantom evaluation study using Tractometer.",
            "High-throughput histopathological image analysis via robust cell segmentation and hashing.",
            "Sparse Reconstruction Challenge for diffusion MRI: Validation on a physical phantom to determine which acquisition scheme and analysis method to use?",
            "Population-based prediction of subject-specific prostate deformation for MR-to-ultrasound image registration.",
            "Locally-constrained boundary regression for segmentation of prostate and rectum in the planning CT images."
        ]
    },
    {
        "name": "Medical Image Analysis",
        "year": "2014",
        "info": "Volume 18: 2014",
        "count": 106,
        "papers": [
            "Segmentation of the thrombus of giant intracranial aneurysms from CT angiography scans with lattice Boltzmann method.",
            "A spatio-temporal latent atlas for semi-supervised learning of fetal brain segmentations and morphological age estimation.",
            "Organ-focused mutual information for nonrigid multimodal registration of liver CT and Gd-EOB-DTPA-enhanced MRI.",
            "Denoising and fast diffusion imaging with physically constrained sparse dictionary learning.",
            "A collaborative resource to build consensus for automated left ventricular segmentation of cardiac MR images.",
            "Group-wise construction of reduced models for understanding and characterization of pulmonary blood flows from medical images.",
            "Semi-automatic segmentation and detection of aorta dissection wall in MDCT angiography.",
            "Joint learning of ultrasonic backscattering statistical physics and signal confidence primal for characterizing atherosclerotic plaques using intravascular ultrasound.",
            "Fully automatic segmentation of the mitral leaflets in 3D transesophageal echocardiographic images using multi-atlas joint label fusion and deformable medial modeling.",
            "A conditional statistical shape model with integrated error estimation of the conditions; Application to liver segmentation in non-contrast CT images.",
            "A 3-D spatio-temporal deconvolution approach for MR perfusion in the brain.",
            "Improved segmentation of white matter tracts with adaptive Riemannian metrics.",
            "Three-dimensional solid texture analysis in biomedical imaging: Review and opportunities.",
            "The effects of noise over the complete space of diffusion tensor shape.",
            "A Bayesian filtering approach to incorporate 2D/3D time-lapse confocal images for tracking angiogenic sprouting cells interacting with the gel matrix.",
            "Computational methods to reduce uncertainty in the estimation of cardiac conduction properties from electroanatomical recordings.",
            "Learning from unbalanced data: A cascade-based approach for detecting clustered microcalcifications.",
            "Contour tracking in echocardiographic sequences via sparse representation and dictionary learning.",
            "3D actin network centerline extraction with multiple active contours.",
            "A Method for handling intensity inhomogenieties in fMRI sequences of moving anatomy of the early developing brain.",
            "Respiratory motion correction in dynamic MRI using robust data decomposition registration - Application to DCE-MRI.",
            "Ultrasound elastography using multiple images.",
            "A graph-based approach for the retrieval of multi-modality medical images.",
            "Self-similarity weighted mutual information: A new nonrigid image registration metric.",
            "Evaluation of prostate segmentation algorithms for MRI: The PROMISE12 challenge.",
            "Automatic detection of subsolid pulmonary nodules in thoracic computed tomography images.",
            "Systematic misregistration and the statistical analysis of surface data.",
            "Real-time simulation of contact and cutting of heterogeneous soft-tissues.",
            "A Novel Framework for Segmentation of Secretory Granules in Electron Micrographs.",
            "Diffusion methods for aligning medical datasets: Location prediction in CT scan images.",
            "Corrigendum to \"Group-wise construction of reduced models for understanding and characterization of pulmonary blood flows from medical images\" [Med. Image Anal. 18(2014) 63-82].",
            "Erratum to \"Automated landmarking and labeling of fully and partially scanned spinal columns in CT images\" [Med. Image Anal. 17(2013) 1151-1163].",
            "Discovering brain regions relevant to obsessive-compulsive disorder identification through bagging and transduction.",
            "DIRBoost-An algorithm for boosting deformable image registration: Application to lung CT intra-subject registration.",
            "Groupwise multi-atlas segmentation of the spinal cord's internal structure.",
            "Compressed sensing MRI exploiting complementary dual decomposition.",
            "Automatic X-ray landmark detection and shape segmentation via data-driven joint estimation of image displacements.",
            "Whole myocardium tracking in 2D-echocardiography in multiple orientations using a motion constrained level-set.",
            "A flocking based method for brain tractography.",
            "Optimal surface segmentation using flow lines to quantify airway abnormalities in chronic obstructive pulmonary disease.",
            "Individualized statistical learning from medical image databases: Application to identification of brain lesions.",
            "Patient specific tumor growth prediction using multimodal images.",
            "Focused shape models for hip joint segmentation in 3D magnetic resonance images.",
            "Real-time recognition of surgical tasks in eye surgery videos.",
            "Weakly supervised histopathology cancer image segmentation and classification.",
            "Automatic segmentation of intra-cochlear anatomy in post-implantation CT of unilateral cochlear implant recipients.",
            "Quantifying anatomical shape variations in neurological disorders.",
            "Personalized assessment of craniosynostosis via statistical shape modeling.",
            "Concurrent tumor segmentation and registration with uncertainty-based sparse non-uniform graphs.",
            "Dual optimization based prostate zonal segmentation in 3D MR images.",
            "MRI to X-ray mammography intensity-based registration with simultaneous optimisation of pose and biomechanical transformation parameters.",
            "Statistical atlas construction via weighted functional boxplots.",
            "Digital facial dysmorphology for genetic screening: Hierarchical constrained local model using ICA.",
            "Joint maximum likelihood estimation of activation and Hemodynamic Response Function for fMRI.",
            "Tumor sensitive matching flow: A variational method to detecting and segmenting perihepatic and perisplenic ovarian cancer metastases on contrast-enhanced abdominal CT.",
            "Model-guided respiratory organ motion prediction of the liver from 2D ultrasound.",
            "Body-wide hierarchical fuzzy modeling, recognition, and delineation of anatomy in medical images.",
            "Accurate diagnosis of thyroid follicular lesions from nuclear morphology using supervised learning.",
            "Probabilistic intra-retinal layer segmentation in 3-D OCT images using global shape regularization.",
            "Characterization of U-shape streamline fibers: Methods and applications.",
            "Multiple instance learning for classification of dementia in brain MRI.",
            "Preface.",
            "Sparse regularization for fiber ODF reconstruction: From the suboptimality of l2 and l1 priors to l0.",
            "The benefit of tree sparsity in accelerated MRI.",
            "Magnetic resonance image reconstruction from undersampled measurements using a patch-based nonlocal operator.",
            "A computationally efficient method for reconstructing sequences of MR images from undersampled k-space data.",
            "Improving low-dose blood-brain barrier permeability quantification using sparse high-dose induced prior for Patlak model.",
            "A generative probability model of joint label fusion for multi-atlas based brain segmentation.",
            "Correspondence between fMRI and SNP data by group sparse canonical correlation analysis.",
            "Landmark matching based retinal image alignment by enforcing sparsity in correspondence matrix.",
            "Multi-modal registration for correlative microscopy using image analogies.",
            "Deformable models with sparsity constraints for cardiac motion analysis.",
            "High-resolution dynamic MR imaging of the thorax for respiratory motion correction of PET using groupwise manifold alignment.",
            "Automated correction of improperly rotated diffusion gradient orientations in diffusion weighted MRI.",
            "Computer assisted detection of abnormal airway variation in CT scans related to paediatric tuberculosis.",
            "Temporal models for mitotic phase labelling.",
            "Direct parametric reconstruction from undersampled (k, t)-space data in dynamic contrast enhanced MRI.",
            "Diffeomorphic metric mapping and probabilistic atlas generation of hybrid diffusion imaging based on BFOR signal basis.",
            "Personalising population-based respiratory motion models of the heart using neighbourhood approximation based on learnt anatomical features.",
            "Exudate detection in color retinal images for mass screening of diabetic retinopathy.",
            "A framework for the merging of pre-existing and correspondenceless 3D statistical shape models.",
            "Automated detection of brain abnormalities in neonatal hypoxia ischemic injury from MR images.",
            "Hierarchical performance estimation in the statistical label fusion framework.",
            "On combining image-based and ontological semantic dissimilarities for medical image retrieval applications.",
            "Pose-independent surface matching for intra-operative soft-tissue marker-less registration.",
            "Fast automatic myocardial segmentation in 4D cine CMR datasets.",
            "Susceptibility artefact correction using dynamic graph cuts: Application to neurosurgery.",
            "Multi-shell diffusion signal recovery from sparse measurements.",
            "In-vivo segmentation and quantification of coronary lesions by optical coherence tomography images for a lesion type definition and stenosis grading.",
            "Cortical surface shift estimation using stereovision and optical flow motion tracking via projection image registration.",
            "Segmentation of B-mode cardiac ultrasound data by Bayesian Probability Maps.",
            "A spatially-distributed computational model to quantify behaviour of contrast agents in MR perfusion imaging.",
            "Comparing algorithms for automated vessel segmentation in computed tomography scans of the lung: the VESSEL12 study.",
            "Automatic atlas-based three-label cartilage segmentation from MR knee images.",
            "Fusion of multi-tracer PET images for dose painting.",
            "Editorial for the MEDIA special issue on MICCAI 2013.",
            "Encoding atlases by randomized classification forests for efficient multi-atlas label propagation.",
            "Simultaneous and consistent labeling of longitudinal dynamic developing cortical surfaces in infants.",
            "Large deformation diffeomorphic registration of diffusion-weighted imaging data.",
            "An implicit sliding-motion preserving regularisation via bilateral filtering for deformable image registration.",
            "Automatic ultrasound-MRI registration for neurosurgery using the 2D and 3D LC2 Metric.",
            "Real-time ultrasound transducer localization in fluoroscopy images by transfer learning from synthetic training data.",
            "Mini gamma cameras for intra-operative nuclear tomographic reconstruction.",
            "Identifying group discriminative and age regressive sub-networks from DTI-based connectivity via a unified framework of non-negative matrix factorization and graph embedding.",
            "Fusion of white and gray matter geometry: A framework for investigating brain development.",
            "Data-driven estimation of cardiac electrical diffusivity from 12-lead ECG signals."
        ]
    },
    {
        "name": "Medical Image Analysis",
        "year": "2013",
        "info": "Volume 17: 2013",
        "count": 93,
        "papers": [
            "Review of automatic segmentation methods of multiple sclerosis white matter lesions on conventional magnetic resonance imaging.",
            "Respiratory motion models: A review.",
            "Intervertebral disc segmentation in MR images using anisotropic oriented flux.",
            "Multi-shape graph cuts with neighbor prior constraints and its application to lung segmentation from a chest CT volume.",
            "Computer-aided colorectal tumor classification in NBI endoscopy using local features.",
            "Segmentation with area constraints.",
            "Single-image super-resolution of brain MR images using overcomplete dictionaries.",
            "The estimation of patient-specific cardiac diastolic functions from clinical measurements.",
            "Filtering and segmentation of 3D angiographic data: Advances based on mathematical morphology.",
            "Bi-planar image segmentation based on variational geometrical active contours with shape priors.",
            "Piecewise-diffeomorphic image registration: Application to the motion estimation between 3D CT lung images with sliding conditions.",
            "Non-local statistical label fusion for multi-atlas segmentation.",
            "Automatic multimodal 2D/3D breast image registration using biomechanical FEM models and intensity-based optimization.",
            "Multi-kernel graph embedding for detection, Gleason grading of prostate cancer via MRI/MRS.",
            "Segmentation by retrieval with guided random walks: Application to left ventricle segmentation in MRI.",
            "Lymph node detection and segmentation in chest CT data using discriminative learning and a spatial prior.",
            "Efficient and robust model-to-image alignment using 3D scale-invariant features.",
            "Computerized identification of airway wall in CT examinations using a 3D active surface evolution approach.",
            "Probabilistic tractography using Q-ball imaging and particle filtering: Application to adult and in-utero fetal brain studies.",
            "Regional heart motion abnormality detection: An information theoretic approach.",
            "Reliable estimation of incoherent motion parametric maps from diffusion-weighted MRI using fusion bootstrap moves.",
            "A linear programming approach to reconstructing subcellular structures from confocal images for automated generation of representative 3D cellular models.",
            "Multiview diffeomorphic registration: Application to motion and strain estimation from 3D echocardiography.",
            "A blind deconvolution approach to recover effective connectivity brain networks from resting state fMRI data.",
            "Longitudinal change detection: Inference on the diffusion tensor along white matter pathways.",
            "Joint CT/CBCT deformable registration and CBCT enhancement for cancer radiotherapy.",
            "A method of 2D/3D registration of a statistical mouse atlas with a planar X-ray projection and an optical photo.",
            "Towards robust deconvolution of low-dose perfusion CT: Sparse perfusion deconvolution using online dictionary learning.",
            "Omnidirectional displacements for deformable surfaces.",
            "Structure-adaptive sparse denoising for diffusion-tensor MRI.",
            "Scale invariant texture descriptors for classifying celiac disease.",
            "3D reconstruction of the lumbar vertebrae from anteroposterior and lateral dual-energy X-ray absorptiometry.",
            "A novel Bayesian respiratory motion model to estimate and resolve uncertainty in image-guided cardiac interventions.",
            "A polynomial approach for extracting the extrema of a spherical function and its application in diffusion MRI.",
            "Automatic carotid artery distensibility measurements from CTA using nonrigid registration.",
            "A three-dimensional finite element model of human atrial anatomy: New methods for cubic Hermite meshes with extraordinary vertices.",
            "Bayesian characterization of uncertainty in intra-subject non-rigid registration.",
            "Continuous diffusion signal, EAP and ODF estimation via Compressive Sensing in diffusion MRI.",
            "Evaluation of a Kalman-based block matching method to assess the bi-dimensional motion of the carotid artery wall in B-mode ultrasound sequences.",
            "A supervised learning framework of statistical shape and probability priors for automatic prostate segmentation in ultrasound images.",
            "Predicting cortical ROIs via joint modeling of anatomical and connectional profiles.",
            "A sensitivity analysis on 3D velocity reconstruction from multiple registered echo Doppler views.",
            "Benchmarking framework for myocardial tracking and deformation algorithms: An open access database.",
            "Segmentation of the luminal border in intravascular ultrasound B-mode images using a probabilistic approach.",
            "STEPS: Similarity and Truth Estimation for Propagated Segmentations and its application to hippocampal segmentation and brain parcelation.",
            "Three-dimensional segmentation of the left ventricle in late gadolinium enhanced MR images of chronic infarction combining long- and short-axis information.",
            "Statistical coronary motion models for 2D + t/3D registration of X-ray coronary angiography and CTA.",
            "Editorial for the MEDIA special issue on MICCAI 2012.",
            "Localizing target structures in ultrasound video - A phantom study.",
            "Trajectory optimization for intra-operative nuclear tomographic imaging.",
            "Surgical gesture classification from video and kinematic data.",
            "Cell segmentation in phase contrast microscopy images via semi-supervised classification over optics-related features.",
            "Improved inference in Bayesian segmentation using Monte Carlo sampling: Application to hippocampal subfield volumetry.",
            "Temporal sparse free-form deformations.",
            "Neighbourhood approximation using randomized forests.",
            "The impact of registration accuracy on imaging validation study design: A novel statistical power calculation.",
            "Personalization of a cardiac electromechanical model using reduced order unscented Kalman filtering from regional volumes.",
            "A computational diffusion MRI and parametric dictionary learning framework for modeling the diffusion signal and its features.",
            "Tractometer: Towards validation of tractography pipelines.",
            "Standardized evaluation framework for evaluating coronary artery stenosis detection, stenosis quantification and lumen segmentation algorithms in computed tomography angiography.",
            "Denoising of PET images by combining wavelets and curvelets for improved preservation of resolution and quantitation.",
            "Dynamic programming in parallel boundary detection with application to ultrasound intima-media segmentation.",
            "Intra-retinal layer segmentation of 3D optical coherence tomography using coarse grained diffusion map.",
            "Joint segmentation of anatomical and functional images: Applications in quantification of lesions from PET, PET-CT, MRI-PET, and MRI-PET-CT images.",
            "Endoluminal surface registration for CT colonography using haustral fold matching.",
            "Posterior shape models.",
            "Optical techniques for 3D surface reconstruction in computer-assisted laparoscopic surgery.",
            "Explicit shape descriptors: Novel morphologic features for histopathology classification.",
            "Left ventricle segmentation in MRI via convex relaxed distribution matching.",
            "A theoretical framework for quantifying blood volume flow rate from dynamic angiographic data and application to vessel-encoded arterial spin labeling MRI.",
            "Towards laparoscopic tissue aspiration.",
            "Joint graph cut and relative fuzzy connectedness image segmentation algorithm.",
            "Automated drusen segmentation and quantification in SD-OCT images.",
            "Medical image processing on the GPU - Past, present and future.",
            "Individual nodule tracking in micro-CT images of a longitudinal lung cancer mouse model.",
            "Characterization of task-free and task-performance brain states via functional connectome patterns.",
            "Delineating anatomical boundaries using the boundary fragment model.",
            "Registration of 3D fetal neurosonography and MRI.",
            "Automated landmarking and labeling of fully and partially scanned spinal columns in CT images.",
            "Accurate estimation of retinal vessel width using bagged decision trees and an extended multiresolution Hermite model.",
            "A unified framework for cross-modality multi-atlas segmentation of brain MRI.",
            "A unified EM approach to bladder wall segmentation with coupled level-set constraints.",
            "Charisma: An integrated approach to automatic H&E-stained skeletal muscle cell segmentation using supervised learning and novel robust clump splitting.",
            "Segmentation of brain magnetic resonance angiography images based on MAP-MRF with multi-pattern neighborhood system and approximation of regularization coefficient.",
            "Robotic tissue tracking for beating heart mitral valve surgery.",
            "In vivo human cardiac fibre architecture estimation using shape-based diffusion tensor processing.",
            "Breast lesion co-localisation between X-ray and MR images using finite element modelling.",
            "Improved location features for linkage of regions across ipsilateral mammograms.",
            "Chest wall segmentation in automated 3D breast ultrasound scans.",
            "Whole-body anatomy localization via classification and regression forests.",
            "Spine detection in CT and MR using iterated marginal space learning.",
            "Regression forests for efficient anatomy detection and localization in computed tomography scans.",
            "Global localization of 3D anatomical structures by pre-filtered Hough Forests and discrete optimization."
        ]
    },
    {
        "name": "Medical Image Analysis",
        "year": "2012",
        "info": "Volume 16: 2012",
        "count": 118,
        "papers": [
            "Entropy and Laplacian images: Structural representations for multi-modal registration.",
            "New methods for MRI denoising based on sparseness and self-similarity.",
            "Reconstruction of scattered data in fetal diffusion MRI.",
            "Registration of 3D trans-esophageal echocardiography to X-ray fluoroscopy using image-based probe tracking.",
            "Contextual computer-aided detection: Improving bright lesion detection in retinal images and coronary calcification identification in CT scans.",
            "Mediastinal atlas creation from 3-D chest computed tomography images: Application to automated detection and station mapping of lymph nodes.",
            "Color treatment in endoscopic image classification using multi-scale local color vector patterns.",
            "Max-flow segmentation of the left ventricle by recovering subject-specific distributions via a bound of the Bhattacharyya measure.",
            "Coupled parametric model for estimation of visual field tests based on OCT macular thickness maps, and vice versa, in glaucoma care.",
            "Differential MRI analysis for quantification of low grade glioma growth.",
            "Automatic segmentation of the wire frame of stent grafts from CT data.",
            "Semi-automatic liver tumor segmentation with hidden Markov measure field model and non-parametric distribution estimation.",
            "Estimation of slipping organ motion by registration with direction-dependent regularization.",
            "Hysteroscopy video summarization and browsing by estimating the physician's attention on video segments.",
            "Automatic segmentation, internal classification, and follow-up of optic pathway gliomas in MRI.",
            "An image space approach to Cartesian based parallel MR imaging with total variation regularization.",
            "Patient-specific electromechanical models of the heart for the prediction of pacing acute effects in CRT: A preliminary clinical validation.",
            "Exudate-based diabetic macular edema detection in fundus images using publicly available datasets.",
            "A novel approach for improved tractography and quantitative analysis of probabilistic fibre tracking curves.",
            "A constrained independent component analysis technique for artery-vein separation of two-photon laser scanning microscopy images of the cerebral microvasculature.",
            "Thoracic respiratory motion estimation from MRI using a statistical model and a 2-D image navigator.",
            "Towards robust and effective shape modeling: Sparse shape composition.",
            "Regularising limited view tomography using anatomical reference images and information theoretic similarity metrics.",
            "Reversible jump MCMC methods for fully automatic motion analysis in tagged MRI.",
            "Generalized likelihood ratio tests for change detection in diffusion tensor images: Application to multiple sclerosis.",
            "Cardiac motion estimation by joint alignment of tagged MRI sequences.",
            "Segmentation of 3D radio frequency echocardiography using a spatio-temporal predictor.",
            "Tumor invasion margin on the Riemannian space of brain fibers.",
            "Multiscale 3D shape representation and segmentation with applications to hippocampal/caudate extraction from brain MRI.",
            "Detection of the whole myocardium in 2D-echocardiography for multiple orientations using a geometrically constrained level-set.",
            "Real-time image-based rigid registration of three-dimensional ultrasound.",
            "Automated preoperative planning of femoral stem in total hip arthroplasty from 3D CT data: Atlas-based approach and comparative study.",
            "Temporal diffeomorphic free-form deformation: Application to motion and strain estimation from 3D echocardiography.",
            "Analysis of fMRI time series with mutual information.",
            "Feature-based interpolation of diffusion tensor fields and application to human cardiac DT-MRI.",
            "Re-localisation of a biopsy site in endoscopic images and characterisation of its uncertainty.",
            "Mitral annulus segmentation from four-dimensional ultrasound using a valve state predictor and constrained optical flow.",
            "Construction of 3D MR image-based computer models of pathologic hearts, augmented with histology and optical fluorescence imaging to characterize action potential propagation.",
            "Consistent segmentation using a Rician classifier.",
            "Spatially variable Rician noise in magnetic resonance imaging.",
            "Context specific descriptors for tracking deforming tissue.",
            "Prostate biopsy tracking with deformation estimation.",
            "Development and comparison of new hybrid motion tracking for bronchoscopic navigation.",
            "Reconstruction of a 3D surface from video that is robust to missing data and outliers: Application to minimally invasive surgery using stereo and mono endoscopes.",
            "Gaze-Contingent Motor Channelling, haptic constraints and associated cognitive demand for robotic MIS.",
            "Statistical modeling and recognition of surgical workflow.",
            "A review of 3D/2D registration methods for image-guided interventions.",
            "Biomechanically constrained groupwise ultrasound to CT registration of the lumbar spine.",
            "Multi-modal registration of speckle-tracked freehand 3D ultrasound to CT in the lumbar spine.",
            "MR to ultrasound registration for image-guided prostate interventions.",
            "Computer assisted reconstruction of complex proximal humerus fractures for preoperative planning.",
            "Fast virtual deployment of self-expandable stents: Method and in vitro evaluation for intracranial aneurysmal stenting.",
            "Intra-operative 3D guidance and edema detection in prostate brachytherapy using a non-isocentric C-arm.",
            "CranialVault and its CRAVE tools: A clinical computer assistance system for deep brain stimulation (DBS) therapy.",
            "An integrated diagnosis and therapeutic system using intra-operative 5-aminolevulinic-acid-induced fluorescence guided robotic laser ablation for precision neurosurgery.",
            "Cardiac MR perfusion image processing techniques: A survey.",
            "Mass preserving image registration for lung CT.",
            "3D segmentation of SBFSEM images of neuropil by a graphical model over supervoxel boundaries.",
            "Manifold learning for image-based breathing gating in ultrasound and MRI.",
            "Nonlinear dimensionality reduction combining MR imaging with non-imaging information.",
            "A fast analysis method for non-invasive imaging of blood flow in individual cerebral arteries using vessel-encoded arterial spin labelling angiography.",
            "Brain tissue segmentation in MR images based on a hybrid of MRF and social algorithms.",
            "A CANDLE for a deeper in vivo insight.",
            "A probabilistic framework for image information fusion with an application to mammographic analysis.",
            "Nonparametric Bayesian inference of the fiber orientation distribution from diffusion-weighted MR images.",
            "Automated landmarking and geometric characterization of the carotid siphon.",
            "Statistical 4D graphs for multi-organ abdominal segmentation from multiphase CT.",
            "Image-based characterization of thrombus formation in time-lapse DIC microscopy.",
            "Machine learning and radiology.",
            "Imaging the femoral cortex: Thickness, density and mass from clinical CT.",
            "MRI to X-ray mammography registration using a volume-preserving affine transformation.",
            "Structural analysis of fMRI data: A surface-based framework for multi-subject studies.",
            "Generalized pixel profiling and comparative segmentation with application to arteriovenous malformation segmentation.",
            "Complete valvular heart apparatus model from 4D cardiac CT.",
            "Automatic motion compensation of free breathing acquired myocardial perfusion data by using independent component analysis.",
            "A finite-element approach to the direct computation of relative cardiovascular pressure from time-resolved MR velocity data.",
            "A novel deformation method for fast simulation of biological tissue formed by fibers and fluid.",
            "Understanding the phase contrast optics to restore artifact-free microscopy images for segmentation.",
            "An endoscopic 3D scanner based on structured light.",
            "The 2D analytic signal for envelope detection and feature extraction on ultrasound images.",
            "HoliMAb: A holistic approach for Media-Adventitia border detection in intravascular ultrasound.",
            "Ultrasound confidence maps using random walks.",
            "Diffusion MRI signal reconstruction with continuity constraint and optimal regularization.",
            "Symmetric positive semi-definite Cartesian Tensor fiber orientation distributions (CT-FOD).",
            "An atlas-based geometry pipeline for cardiac Hermite model construction and diffusion tensor reorientation.",
            "Position-orientation adaptive smoothing of diffusion weighted magnetic resonance data (POAS).",
            "Statistical model based shape prediction from a combination of direct observations and various surrogates: Application to orthopaedic research.",
            "Mammography segmentation with maximum likelihood active contours.",
            "Segmentation and quantification of the aortic arch using joint 3D model-based segmentation and elastic image registration.",
            "Semiautomatic carotid lumen segmentation for quantification of lumen geometry in multispectral MRI.",
            "A 3D interactive multi-object segmentation tool using local robust statistics driven active contours.",
            "A multiple-instance learning framework for diabetic retinopathy screening.",
            "Vectorization of optically sectioned brain microvasculature: Learning aids completion of vascular graphs by connecting gaps and deleting open-ended segments.",
            "A spline-based non-linear diffeomorphism for multimodal prostate registration.",
            "Strategies for improved interpretation of computer-aided detections for CT colonography utilizing distributed human intelligence.",
            "Robust 3-D reconstruction of surfaces from image focus by local cross-sectional multivariate statistical analyses: Application to human ex vivo corneal endotheliums.",
            "4D CT image reconstruction with diffeomorphic motion model.",
            "Refraction-compensated motion tracking of unrestrained small animals in positron emission tomography.",
            "Editorial for the MEDIA Special Issue on MICCAI 2011.",
            "An integrated framework for finite-element modeling of mitral valve biomechanics from medical images: Application to MitralClip intervention planning.",
            "Ultrasound-fluoroscopy registration for prostate brachytherapy dosimetry.",
            "Detecting outliers in high-dimensional neuroimaging datasets with robust covariance estimators.",
            "Capturing the multiscale anatomical shape variability with polyaffine transformation trees.",
            "Deformable segmentation via sparse representation and dictionary learning.",
            "Tissue metabolism driven arterial tree generation.",
            "Endoscopic image analysis in semantic space.",
            "MIND: Modality independent neighbourhood descriptor for multi-modal deformable registration.",
            "Efficient globally optimal segmentation of cells in fluorescence microscopy images using level sets and convex energy functionals.",
            "Surface-based multi-template automated hippocampal segmentation: Application to temporal lobe epilepsy.",
            "Concurrent bias correction in hemodynamic data assimilation.",
            "Super-resolution reconstruction to increase the spatial resolution of diffusion weighted images from orthogonal anisotropic acquisitions.",
            "Class-specific weighting for Markov random field estimation: Application to medical image segmentation.",
            "Clavicle segmentation in chest radiographs.",
            "Tongue contour tracking in dynamic ultrasound via higher-order MRFs and efficient fusion moves.",
            "Supervised quality assessment of medical image registration: Application to intra-patient CT lung registration.",
            "Constrained manifold learning for the characterization of pathological deviations from normality.",
            "Reconstruction of fetal brain MRI with intensity matching and complete outlier removal.",
            "Morphology-driven automatic segmentation of MR images of the neonatal brain."
        ]
    },
    {
        "name": "Medical Image Analysis",
        "year": "2011",
        "info": "Volume 15: 2011",
        "count": 67,
        "papers": [
            "Segmenting the prostate and rectum in CT imagery using anatomical constraints.",
            "Learning deformation and structure simultaneously: In situ endograft deformation analysis.",
            "Segmentation and reconstruction of vascular structures for 3D real-time simulation.",
            "Independent component analysis using prior information for signal detection in a functional imaging system of the retina.",
            "Characterization of frequency-dependent material properties of human liver and its pathologies using an impact hammer.",
            "Task-based performance analysis of FBP, SART and ML for digital breast tomosynthesis using signal CNR and Channelised Hotelling Observers.",
            "Semi-automatic construction of reference standards for evaluation of image registration.",
            "Geometrical analysis of registration errors in point-based rigid-body registration using invariants.",
            "A non-rigid registration method for serial lower extremity hybrid SPECT/CT imaging.",
            "A strain energy filter for 3D vessel enhancement with application to pulmonary CT images.",
            "A curvelet-based patient-specific prior for accurate multi-modal brain image rigid registration.",
            "Segmentation of pulmonary nodules of various densities with morphological approaches and convexity models.",
            "Robust statistical shape models for MRI bone segmentation in presence of small field of view.",
            "A review of segmentation methods in short axis cardiac MR images.",
            "A wavelet-based regularized reconstruction algorithm for SENSE parallel MRI with applications to neuroimaging.",
            "Learning to estimate out-of-plane motion in ultrasound imagery of real tissue.",
            "A magnetic resonance spectroscopy driven initialization scheme for active shape model based prostate segmentation.",
            "Semi-automatic segmentation for prostate interventions.",
            "Nonrigid registration of dynamic medical imaging data using nD + t B-splines and a groupwise optimization approach.",
            "Assessment and stenting of tracheal stenosis using deformable shape models.",
            "Evaluating intensity normalization on MRIs of human brain with multiple sclerosis.",
            "Unsupervised 4D myocardium segmentation with a Markov Random Field based deformable model.",
            "Towards robust 3D visual tracking for motion compensation in beating heart surgery.",
            "A spatiotemporal statistical atlas of motion for the quantification of abnormal myocardial tissue velocities.",
            "An MRI digital brain phantom for validation of segmentation methods.",
            "Extracting skeletal muscle fiber fields from noisy diffusion tensor data.",
            "Automated kymograph analysis for profiling axonal transport of secretory granules.",
            "Recent advances in diffusion MRI modeling: Angular and radial reconstruction.",
            "Rigid-body point-based registration: The distribution of the target registration error when the fiducial registration errors are given.",
            "A Hough transform global probabilistic approach to multiple-subject diffusion MRI tractography.",
            "Automatic inference of articulated spine models in CT images using high-order Markov Random Fields.",
            "Automatic graph-cut based segmentation of bones from knee magnetic resonance images for osteoarthritis research.",
            "Pseudo ground truth based nonrigid registration of myocardial perfusion MRI.",
            "A smart atlas for endomicroscopy using automated video retrieval.",
            "Evaluation framework for carotid bifurcation lumen segmentation and stenosis grading.",
            "Nonlinear registration of longitudinal images and measurement of change in regions of interest.",
            "Kernel regression based feature extraction for 3D MR image denoising.",
            "The evaluation of single-view and multi-view fusion 3D echocardiography using image-driven segmentation and tracking.",
            "Cortical sulci recognition and spatial normalization.",
            "Hierarchical adaptive local affine registration for fast and robust respiratory motion estimation.",
            "A comprehensive study of stent visualization enhancement in X-ray images by image processing means.",
            "Unsupervised dealiasing and denoising of color-Doppler data.",
            "Evaluation of visualization of the prostate gland in vibro-elastography images.",
            "Editorial.",
            "Multiple q-shell diffusion propagator imaging.",
            "DRAMMS: Deformable registration via attribute matching and mutual-saliency weighting.",
            "Quantifying variability in radiation dose due to respiratory-induced tumor motion.",
            "Coupled minimum-cost flow cell tracking for high-throughput quantitative analysis.",
            "Editorial.",
            "Efficient MR image reconstruction for compressed MR imaging.",
            "Anisotropic path searching for automatic neuron reconstruction.",
            "Pop out many small structures from a very large microscopic image.",
            "Self-encoded marker for optical prospective head motion correction in MRI.",
            "Probabilistic 4D blood flow tracking and uncertainty estimation.",
            "Spatial regularization of SVM for the detection of diffusion alterations associated with stroke outcome.",
            "Automatic analysis of diabetic peripheral neuropathy using multi-scale quantitative morphology of nerve fibres in corneal confocal microscopy imaging.",
            "Automated macular pathology diagnosis in retinal OCT images using multi-scale spatial pyramid and local binary patterns in texture and shape encoding.",
            "Brachytherapy seed reconstruction with joint-encoded C-arm single-axis rotation and motion compensation.",
            "An integrated approach to segmentation and nonrigid registration for application in image-guided pelvic radiotherapy.",
            "Active deformation fields: Dense deformation field estimation for atlas-based segmentation using the active contour framework.",
            "An accurate, fast and robust method to generate patient-specific cubic Hermite meshes.",
            "Morphological appearance manifolds for group-wise morphometric analysis.",
            "On the convergence of EM-like algorithms for image segmentation using Markov random fields.",
            "2D-3D shape reconstruction of the distal femur from stereo X-ray imaging using statistical shape models.",
            "A high-throughput active contour scheme for segmentation of histopathological imagery.",
            "Segmentation of the heart and great vessels in CT images using a model-based adaptation framework.",
            "An atlas-navigated optimal medial axis and deformable model algorithm (NOMAD) for the segmentation of the optic nerves and chiasm in MR and CT images."
        ]
    },
    {
        "name": "Medical Image Analysis",
        "year": "2010",
        "info": "Volume 14: 2010",
        "count": 63,
        "papers": [
            "Automatic segmentation of colon glands using object-graphs.",
            "Semi-automatic level set segmentation of liver tumors combining a spiral-scanning technique with supervised fuzzy pixel classification.",
            "Respiratory motion correction for image-guided cardiac interventions using 3-D echocardiography.",
            "A nonlinear identification method to study effective connectivity in functional MRI.",
            "Adaptive local multi-atlas segmentation: Application to the heart and the caudate nucleus.",
            "CPOL: Complex phase order likelihood as a similarity measure for MR-CT registration.",
            "A filtered approach to neural tractography using the Watson directional function.",
            "Optimizing boundary detection via Simulated Search with applications to multi-modal heart segmentation.",
            "Corrigendum to \"Constrained non-rigid registration for use in image-guided adaptive radiotherapy\" [Medical Image Analysis 13 (2009) 809-817].",
            "A review of automatic mass detection and segmentation in mammographic images.",
            "Extrapolating glioma invasion margin in brain magnetic resonance images: Suggesting new irradiation margins.",
            "Estimating zero-strain states of very soft tissue under gravity loading using digital image correlation.",
            "Measurement and characterization of soft tissue behavior with surface deformation and force response under large deformations.",
            "Automated detection of intracranial aneurysms based on parent vessel 3D analysis.",
            "Multiple hypothesis template tracking of small 3D vessel structures.",
            "Segmentation of interwoven 3d tubular tree structures utilizing shape priors and graph cuts.",
            "A classifying registration technique for the estimation of enhancement curves of DCE-CT scan sequences.",
            "An automatic geometrical and statistical method to detect acoustic shadows in intraoperative ultrasound brain images.",
            "DWI filtering using joint information for DTI and HARDI.",
            "Combining atlas based segmentation and intensity classification with nearest neighbor transform and accuracy weighted vote.",
            "Wavelet optimization for content-based image retrieval in medical databases.",
            "Optimal embedding for shape indexing in medical image databases.",
            "A framework for optimizing measurement weight maps to minimize the required sample size.",
            "Optimisation of orthopaedic implant design using statistical shape space analysis based on level sets.",
            "High resolution cortical bone thickness measurement from clinical CT data.",
            "Musculoskeletal MRI segmentation using multi-resolution simplex meshes with medial representations.",
            "A fast and robust patient specific Finite Element mesh registration technique: Application to 60 clinical cases.",
            "Combining spatial priors and anatomical information for fMRI detection.",
            "Spherical wavelet transform for ODF sharpening.",
            "An automated pipeline for cortical sulcal fundi extraction.",
            "Automatic cerebral and cerebellar hemisphere segmentation in 3D MRI: Adaptive disconnection algorithm.",
            "Evaluation of brain atrophy estimation algorithms using simulated ground-truth data.",
            "A new computationally efficient CAD system for pulmonary nodule detection in CT imagery.",
            "Location registration and recognition (LRR) for serial analysis of nodules in lung CT scans.",
            "A coupled deformable model for tracking myocardial borders from real-time echocardiography using an incompressibility constraint.",
            "Automatic detection of informative frames from wireless capsule endoscopy images.",
            "Glaucoma risk index:  Automated glaucoma detection from color fundus images.",
            "Robust Rician noise estimation for MR images.",
            "The segmentation of colorectal MRI images.",
            "3D early embryogenesis image filtering by nonlinear partial differential equations.",
            "Vessel-guided airway tree segmentation: A voxel classification approach.",
            "Objective and expert-independent validation of retinal image registration algorithms by a projective imaging distortion model.",
            "Linear intensity-based image registration by Markov random fields and discrete optimization.",
            "Shape regression machine and efficient segmentation of left ventricle endocardium from 2D B-mode echocardiogram.",
            "Model driven quantification of left ventricular function from sparse single-beat 3D echocardiography.",
            "A non-local approach for image super-resolution using intermodality priors.",
            "Wavelet-based estimation of the hemodynamic responses in diffuse optical imaging.",
            "High-throughput detection of prostate cancer in histological sections using probabilistic pairwise Markov models.",
            "Editorial.",
            "GRAM: A framework for geodesic registration on anatomical manifolds.",
            "Manifold modeling for brain population analysis.",
            "Segmentation of image ensembles via latent atlases.",
            "A tract-specific framework for white matter morphometry combining macroscopic and microscopic tract features.",
            "Parallax-free intra-operative X-ray image stitching.",
            "Interventional 4D motion estimation and reconstruction of cardiac vasculature without motion periodicity assumption.",
            "Respiratory motion compensation by model-based catheter tracking during EP procedures.",
            "Comparing and combining algorithms for computer-aided detection of pulmonary nodules in computed tomography scans: The ANODE09 study.",
            "Atlas-based whole-body segmentation of mice from low-contrast Micro-CT data.",
            "A dynamic elastic model for segmentation and tracking of the heart in MR image sequences.",
            "Probabilistic framework for tracking in artifact-prone 3D echocardiograms.",
            "Robust CTA lumen segmentation of the atherosclerotic carotid artery bifurcation in a large patient population.",
            "Detection of neuron membranes in electron microscopy images using a serial neural network architecture.",
            "Non-local MRI upsampling."
        ]
    },
    {
        "name": "Medical Image Analysis",
        "year": "2009",
        "info": "Volume 13: 2009",
        "count": 77,
        "papers": [
            "Probabilistic white matter fiber tracking using particle filtering and von Mises-Fisher sampling.",
            "Sequential anisotropic multichannel Wiener filtering with Rician bias correction applied to 3D regularization of DWI data.",
            "Restoration of MRI data for intensity non-uniformities using local high order intensity statistics.",
            "A non-parametric vessel detection method for complex vascular structures.",
            "Quantitative evaluation of local myocardial blood volume in contrast echocardiography.",
            "Deconvolution for DCE-MRI using an exponential approximation basis.",
            "Modelling of image-catheter motion for 3-D IVUS.",
            "Motion-guided segmentation for cine DENSE MRI.",
            "3D estimation of soft biological tissue deformation from radio-frequency ultrasound volume acquisitions.",
            "Editorial.",
            "A simulation and estimation framework for intracellular dynamics and trafficking in video-microscopy and fluorescence imagery.",
            "Spatio-temporal cell cycle phase analysis using level sets and fast marching methods.",
            "Tensor classification of N-point correlation function features for histology tissue segmentation.",
            "Robust 3D reconstruction and identification of dendritic spines from optical microscopy imaging.",
            "Axon tracking in serial block-face scanning electron microscopy.",
            "A modified fuzzy C-means classification method using a multiscale diffusion filtering scheme.",
            "Depth potential function for folding pattern representation, registration and analysis.",
            "Calculation of the confidence intervals for transformation parameters in the registration of medical images.",
            "On modelling of anisotropic viscoelasticity for soft tissue simulation: Numerical solution and GPU execution.",
            "VS: A surface-based system for topological analysis, quantization and visualization of voxel data.",
            "Phase unwrapping of MR images using ΦUN - A fast and robust region growing algorithm.",
            "A fast, model-independent method for cerebral cortical thickness estimation using MRI.",
            "A quality-guided displacement tracking algorithm for ultrasonic elasticity imaging.",
            "Simulation of brain tumors in MR images for evaluation of segmentation efficacy.",
            "A model of deformable rings for interpretation of wireless capsule endoscopic videos.",
            "Deterministic and probabilistic approaches for tracking virus particles in time-lapse fluorescence microscopy image sequences.",
            "Special issue: Functional imaging and modelling of the heart.",
            "Computational analysis of the myocardial structure: Adaptation of cardiac myofiber orientations through deformation.",
            "Strain measurement in the left ventricle during systole with deformable image registration.",
            "Effects of biventricular pacing and scar size in a computational model of the failing heart with left bundle branch block.",
            "Fusion of optical imaging and MRI for the evaluation and adjustment of macroscopic models of cardiac electrophysiology: A feasibility study.",
            "Detection and measurement of coverage loss in interleaved multi-acquisition brain MRIs due to motion-induced inter-slice misalignment.",
            "Automated classification of fMRI data employing trial-based imagery tasks.",
            "Comparison of regularization methods for human cardiac diffusion tensor MRI.",
            "A subject-specific technique for respiratory motion correction in image-guided cardiac catheterisation procedures.",
            "Directional functions for orientation distribution estimation.",
            "Towards a teleoperated needle driver robot with haptic feedback for RFA of breast tumors under continuous MRI.",
            "Atlas-based segmentation of 3D cerebral structures with competitive level sets and fuzzy control.",
            "Automated model-based vertebra detection, identification, and segmentation in CT images.",
            "Congenital aortic disease: 4D magnetic resonance segmentation and quantitative analysis.",
            "An augmented reality system for liver thermal ablation: Design and evaluation on clinical cases.",
            "Unsupervised decomposition of low-intensity low-dimensional multi-spectral fluorescent images for tumour demarcation.",
            "Vessel target location estimation during the TIPS procedure.",
            "Sampling sphere orientation distribution: An efficient method to quantify trabecular bone fabric on grayscale images.",
            "Erratum to \"3D Gabor wavelets for evaluating SPM normalization algorithm\".",
            "Statistical shape models for 3D medical image segmentation: A review.",
            "Optimal real-time Q-ball imaging using regularized Kalman filtering with incremental orientation sets.",
            "Using Perturbation theory to reduce noise in diffusion tensor fields.",
            "SNR enhancement of highly-accelerated real-time cardiac MRI acquisitions based on non-local means algorithm.",
            "Sampling the spatial patterns of cancer: Optimized biopsy procedures for estimating prostate cancer volume and Gleason Score.",
            "Selective image similarity measure for bronchoscope tracking based on image registration.",
            "Fractal and multifractal analysis: A review.",
            "Retinal image analysis based on mixture models to detect hard exudates.",
            "Brain-skull contact boundary conditions in an inverse computational deformation model.",
            "In vivo measurement of human brain elasticity using a light aspiration device.",
            "Comparing registration methods for mapping brain change using tensor-based morphometry.",
            "Standardized evaluation methodology and reference database for evaluating coronary artery centerline extraction algorithms.",
            "Efficient and robust computation of PDF features from diffusion MR signal.",
            "Automated voxel-based 3D cortical thickness measurement in a combined Lagrangian-Eulerian PDE approach using partial volume maps.",
            "Data assimilation using a gradient descent method for estimation of intraoperative brain deformation.",
            "A large-scale evaluation of automatic pulmonary nodule detection in chest CT using local image features and k-nearest-neighbour classification.",
            "Editorial.",
            "Modelling passive diastolic mechanics with quantitative MRI of cardiac structure and function.",
            "Projection-based motion compensation and reconstruction of coronary segments and cardiac implantable devices using rotational X-ray angiography.",
            "Statistical models of sets of curves and surfaces based on currents.",
            "Constrained non-rigid registration for use in image-guided adaptive radiotherapy.",
            "A review of 3D vessel lumen segmentation techniques: Models, features and extraction schemes.",
            "Automatic generation of 3D coronary artery centerlines using rotational X-ray angiography.",
            "Fast detection of the optic disc and fovea in color fundus photographs.",
            "Automatic segmentation of the liver from multi- and single-phase contrast-enhanced CT images.",
            "A 2D/3D correspondence building method for reconstruction of a patient-specific 3D bone surface model using point distribution models and calibrated X-ray images.",
            "Image intensity normalisation by maximising the Siddon line integral in the joint intensity distribution space.",
            "Addendum to \"Sequential anisotropic multichannel Wiener filtering with Rician bias correction applied to 3D regularization of DWI data\" [Medical Image Analysis 13 (2009) 19-35].",
            "Editorial.",
            "Suite of finite element algorithms for accurate computation of soft tissue deformation for surgical simulation.",
            "Biomechanisms for modelling cerebral cortical folding.",
            "3D nonrigid registration via optimal mass transport on the GPU."
        ]
    },
    {
        "name": "Medical Image Analysis",
        "year": "2008",
        "info": "Volume 12: 2008",
        "count": 61,
        "papers": [
            "The Third International Workshop on Biomedical Image Registration - WBIR 2006.",
            "Non-rigid registration of multi-modal images using both mutual information and cross-correlation.",
            "Geometrical regularization of displacement fields for histological image registration.",
            "Symmetric diffeomorphic image registration with cross-correlation: Evaluating automated labeling of elderly and neurodegenerative brain.",
            "A protocol for evaluation of similarity measures for non-rigid registration.",
            "Hierarchical statistical shape analysis and prediction of sub-cortical brain structures.",
            "Myocardial deformation recovery from cine MRI using a nearly incompressible biventricular model.",
            "Image filtering via generalized scale.",
            "Colon polyp detection using smoothed shape operators: Preliminary results.",
            "Inter-subject comparison of MRI knee cartilage thickness.",
            "Automatic shape model building based on principal geodesic analysis bootstrapping.",
            "Validation of a new surgical procedure for percutaneous scaphoid fixation using intra-operative ultrasound.",
            "A methodology to study the morphologic changes in lesions during in vitro angioplasty using MRI and image processing.",
            "2-D registration and 3-D shape inference of the retinal fundus from fluorescein images.",
            "A unified framework for clustering and quantitative analysis of white matter fiber tracts.",
            "In vivo mechanical characterization of human liver.",
            "Spherical harmonics-based parametric deconvolution of 3D surface images using bending energy minimization.",
            "Preventing facial recognition when rendering MR images of the head in three dimensions.",
            "Performance analysis of a new computer aided detection system for identifying lung nodules on chest radiographs.",
            "A method for vector displacement estimation with ultrasound imaging and its application for thyroid nodular disease.",
            "Performance evaluation of a medical robotic 3D-ultrasound imaging system.",
            "Robust parametrization of brain surface meshes.",
            "Calibration of laryngeal endoscopic high-speed image sequences by an automated detection of parallel laser line projections.",
            "Registration of PE segment contour deformations in digital high-speed videos.",
            "Efficient and generalizable statistical models of shape and appearance for analysis of cardiac MRI.",
            "Instantiation and registration of statistical shape models of the femur and pelvis using 3D ultrasound imaging.",
            "3D Gabor wavelets for evaluating SPM normalization algorithm.",
            "Multimodal image registration using floating regressors in the joint intensity scatter plot.",
            "Fast block flow tracking of atrial septal defects in 4D echocardiography.",
            "Adaptive correction of the pseudo-enhancement of CT attenuation for fecal-tagging CT colonography.",
            "An efficient locally affine framework for the smooth registration of anatomical structures.",
            "Automatic segmentation of human brain sulci.",
            "Maximum distance-gradient for robust image registration.",
            "Automatic initialization of an active shape model of the prostate.",
            "Regions, systems, and the brain: Hierarchical measures of functional integration in fMRI.",
            "A geometric flow for segmenting vasculature in proton-density weighted MRI.",
            "MRI denoising using Non-Local Means.",
            "Editorial.",
            "Real-time MR diffusion tensor and Q-ball imaging using Kalman filtering.",
            "Robotic assistance for ultrasound-guided prostate brachytherapy.",
            "Cell population tracking and lineage construction with spatiotemporal context.",
            "Modeling intravasation of liquid distension media in surgical simulators.",
            "Automatic CT-ultrasound registration for diagnostic imaging and image-guided intervention.",
            "Model-based blood flow quantification from rotational angiography.",
            "Effects of registration regularization and atlas sharpness on segmentation accuracy.",
            "Homeomorphic brain image segmentation with topological and statistical atlases.",
            "Inferring brain variability from diffeomorphic deformations of currents: An integrative approach.",
            "Unifying framework for multimodal brain MRI segmentation based on Hidden Markov Chains.",
            "Automatic recognition of the common carotid artery in longitudinal ultrasound B-mode scans.",
            "Using nonlinear diffusion and mean shift to detect and connect cross-sections of axons in 3D optical microscopy images.",
            "Area-preserving flattening maps of 3D ultrasound carotid arteries images.",
            "Motion tracking of the outer tips of microtubules.",
            "An automated image analysis methodology for classifying megakaryocytes in chronic myeloproliferative disorders.",
            "Towards a validation of atlas warping techniques.",
            "Information Processing in Medical Imaging 2007.",
            "Dense image registration through MRFs and efficient linear programming.",
            "Dense feature deformation morphometry: Incorporating DTI data into conventional MRI morphometry.",
            "Registration-based estimates of local lung tissue expansion compared to xenon CT measures of specific ventilation.",
            "Multiple object tracking in molecular bioimaging by Rao-Blackwellized marginal particle filtering.",
            "Direct three-dimensional myocardial strain tensor quantification and tracking using zHARP.",
            "Groupwise surface correspondence by optimization: Representation and regularization."
        ]
    },
    {
        "name": "Medical Image Analysis",
        "year": "2007",
        "info": "Volume 11: 2007",
        "count": 51,
        "papers": [
            "Hidden Markov multiple event sequence models: A paradigm for the spatio-temporal analysis of fMRI data.",
            "Semi-automatic level-set based segmentation and stenosis quantification of the internal carotid artery in 3D CTA data sets.",
            "Automatic rib segmentation and labeling in computed tomography scans using a general framework for detection, recognition and segmentation of objects in volumetric data.",
            "Segmentation of blood vessels from red-free and fluorescein retinal images.",
            "A biplanar fluoroscopic approach for the measurement, modeling, and simulation of needle and soft-tissue interaction.",
            "Kernel Fisher discriminant for shape-based classification in epilepsy.",
            "Estimation of the 3D self-similarity parameter of trabecular bone from its 2D projection.",
            "Statistical deformable bone models for robust 3D surface extrapolation from sparse data.",
            "Informative frame classification for endoscopy video.",
            "An atlas-based method to compensate for brain shift: Preliminary results.",
            "Gray-scale and geometric registration of full-field digital and film-screen mammograms.",
            "Knowledge-based interpolation of curves: Application to femoropopliteal arterial centerline restoration.",
            "A Dirichlet process mixture model for brain MRI tissue classification.",
            "Removal of local and biased global maxima in intensity-based registration.",
            "Reslicing axially sampled 3D shapes using elliptic Fourier descriptors.",
            "Direct cortical mapping via solving partial differential equations on implicit surfaces.",
            "Non-parametric geodesic active regions: Method and evaluation for cerebral aneurysms segmentation in 3DRA and CTA.",
            "Classification of hemodynamics from dynamic-susceptibility-contrast magnetic resonance (DSC-MR) brain images using noiseless independent factor analysis.",
            "Application of independent component analysis to dynamic contrast-enhanced imaging for assessment of cerebral blood perfusion.",
            "Tunneling descent for m.a.p. active contours in ultrasound segmentation.",
            "Predicting soft tissue deformations for a maxillofacial surgery planning system: From computational strategies to a complete clinical validation.",
            "GAMEs: Growing and adaptive meshes for fully automatic shape modeling and analysis.",
            "Automated classification of lung bronchovascular anatomy in CT using AdaBoost.",
            "MR image segmentation of the knee bone using phase information.",
            "A nonparametric MRI inhomogeneity correction method.",
            "High-quality two-stage resampling for 3-D volumes in medical imaging.",
            "A robotic indenter for minimally invasive measurement and characterization of soft tissue response.",
            "Validation of vessel-based registration for correction of brain shift.",
            "Optimization of 360° projection fluorescence molecular tomography.",
            "Clinically evaluated procedure for the reconstruction of vocal fold vibrations from endoscopic digital high-speed videos.",
            "Editorial.",
            "A path algorithm for the support vector domain description and its application to medical imaging.",
            "Recovery of respiratory motion and deformation of the liver using laparoscopic freehand 3D ultrasound system.",
            "Atlas stratification.",
            "GPU based real-time instrument tracking with three-dimensional ultrasound.",
            "Using the logarithm of odds to define a vector space on probabilistic atlases.",
            "Motion-compensated MR valve imaging with COMB tag tracking and super-resolution enhancement.",
            "Delineating white matter structure in diffusion tensor MRI with anisotropy creases.",
            "Quantitative vertebral morphometry using neighbor-conditional shape models.",
            "Impact of image spatial, temporal, and velocity resolutions on cardiovascular indices derived from color-Doppler echocardiography.",
            "Robust registration procedures for endoscopic imaging.",
            "Boundary element method-based regularization for recovering of LV deformation.",
            "Automatic detection of microaneurysms in color fundus images.",
            "Probabilistic vessel axis tracing and its application to vessel segmentation with stream surfaces and minimum cost paths.",
            "Correction of susceptibility artifacts in diffusion tensor data using non-linear registration.",
            "Probe trajectory interpolation for 3D reconstruction of freehand ultrasound.",
            "Activation detection in diffuse optical imaging by means of the general linear model.",
            "Automatic segmentation of 3D micro-CT coronary vascular images.",
            "Efficient computational fluid dynamics mesh generation by image registration.",
            "The mechanical response of human liver and its relation to histology: An in vivo study.",
            "Clinical validation of vessel-based registration for correction of brain-shift."
        ]
    },
    {
        "name": "Medical Image Analysis",
        "year": "2006",
        "info": "Volume 10: 2006",
        "count": 67,
        "papers": [
            "Cerebrovascular segmentation from TOF using stochastic models.",
            "Segmentation of anatomical structures in chest radiographs using supervised methods: a comparative study on a public database.",
            "Localization of anatomical point landmarks in 3D medical images by fitting 3D parametric intensity models.",
            "Non-invasive visualization of collateral blood flow patterns of the circle of Willis by dynamic MR angiography.",
            "Towards a realistic echographic simulator.",
            "Interval change analysis to improve computer aided detection in mammography.",
            "Automatic registration of portal images and volumetric CT for patient positioning in radiation therapy.",
            "Accuracy evaluation of direct navigation with an isocentric 3D rotational X-ray system.",
            "Mechanical properties of the human uterine cervix: An in vivo study.",
            "Sensorless freehand 3D ultrasound in real tissue: Speckle decorrelation without fully developed speckle.",
            "A diffusion approach to labeling rows and columns in an irregular array.",
            "A level set framework with a shape and motion prior for segmentation and region tracking in echocardiography.",
            "Computer technology in detection and staging of prostate carcinoma: A review.",
            "Level set based cerebral vasculature segmentation and diameter quantification in CT angiography.",
            "United Snakes.",
            "Intensity non-uniformity correction in MRI: Existing methods and their validation.",
            "A computer-aided diagnosis system for detection of lung nodules in chest radiographs with an evaluation on a public database.",
            "Magnetic resonance angiography: From anatomical knowledge modeling to vessel segmentation.",
            "Generation of variable anatomical models for surgical training simulators.",
            "SPASM: A 3D-ASM for segmentation of sparse and arbitrarily oriented cardiac MRI data.",
            "Tumor growth models to generate pathologies for surgical training simulators.",
            "Segmentation of volumetric MRA images by using capillary active contour.",
            "Methods for segmenting curved needles in ultrasound images.",
            "Pulmonary nodule detection in CT images with quantized convergence index filter.",
            "Contour Area Filtering of two-dimensional electrophoresis images.",
            "Retrospective evaluation of a topology preserving non-rigid registration method.",
            "Cadaver validation of intensity-based ultrasound to CT registration.",
            "Editorial.",
            "Lagrangian frame diffeomorphic image registration: Morphometric comparison of human and chimpanzee cortex.",
            "An information theoretic approach for non-rigid image registration using voxel class probabilities.",
            "Normalized mutual information based registration using k-means clustering and shading correction.",
            "Multi-modal image set registration and atlas formation.",
            "Medical image registration with partial data.",
            "Piecewise affine registration of biological images for volume reconstruction.",
            "Symmetric image registration.",
            "Towards pointwise motion tracking in echocardiographic image sequences - Comparing the reliability of different features for speckle tracking.",
            "Laser-scan endoscope system for intraoperative geometry acquisition and surgical robot safety management.",
            "Measuring orthopedic implant wear on standard radiographs with a precision in the 10 μm-range.",
            "Pulmonary fissure segmentation on CT.",
            "Coronary vessel trees from 3D imagery: A topological approach.",
            "A hierarchical 3D segmentation method and the definition of vertebral body coordinate systems for QCT of the lumbar spine.",
            "Quantitative analysis of multi-spectral fundus images.",
            "A Monte Carlo approach to rolling leukocyte tracking in vivo.",
            "Erratum to: \"Analyzing the neocortical fine-structure\" [Medical Image Analysis 7 (2003) 251-264].",
            "Editorial.",
            "Plaque development, vessel curvature, and wall shear stress in coronary arteries assessed by X-ray angiography and intravascular ultrasound.",
            "Towards model-based analysis of cardiac MR tagging data: Relation between left ventricular shear strain and myofiber orientation.",
            "Cardiac function estimation from MRI using a heart model and data assimilation: Advances and difficulties.",
            "A comprehensive shape model of the heart.",
            "Editorial.",
            "Robust mosaicing with correction of motion distortions and tissue deformations for in vivo fibered microscopy.",
            "Schwarz meets Schwann: Design and fabrication of biomorphic and durataxic tissue engineering scaffolds.",
            "Intra-subject elastic registration of 3D ultrasound images.",
            "Adaptive Markov modeling for mutual-information-based, unsupervised MRI brain-tissue classification.",
            "Statistical representation of high-dimensional deformation fields with application to statistically constrained 3D warping.",
            "Deformable registration of brain tumor images via a statistical model of tumor-induced deformation.",
            "Deformable registration of diffusion tensor MR images with explicit orientation optimization.",
            "Fiber tract-oriented statistics for quantitative diffusion tensor MRI analysis.",
            "3D curve inference for diffusion MRI regularization and fibre tractography.",
            "Vessel enhancing diffusion: A scale space representation of vessel structures.",
            "Filter learning: Application to suppression of bony structures from chest radiographs.",
            "Shaving diffusion tensor images in discriminant analysis: A study into schizophrenia.",
            "A biologically inspired algorithm for microcalcification cluster detection.",
            "Extraction of the midsagittal plane from morphological neuroimages using the Kullback-Leibler's measure.",
            "3D prostate model formation from non-parallel 2D ultrasound biopsy images.",
            "Image structure clustering for image quality verification of color retina images in diabetic retinopathy screening.",
            "Automatic elastic image registration by interpolation of 3D rotations and translations from discrete rigid-body transformations."
        ]
    },
    {
        "name": "Medical Image Analysis",
        "year": "2005",
        "info": "Volume 9: 2005",
        "count": 47,
        "papers": [
            "An approach for contour detection of human kidneys from ultrasound images using Markov random fields and active contours.",
            "Confhusius: A robust and fully automatic calibration method for 3D freehand ultrasound.",
            "Analyzing attributes of vessel populations.",
            "Spatiotemporal clustering of fMRI time series in the spectral domain.",
            "Detection and analysis of statistical differences in anatomical shape.",
            "4D deformable models with temporal constraints: application to 4D cardiac image segmentation.",
            "Guest editorial.",
            "Modelling liver tissue properties using a non-linear visco-elastic model for surgery simulation.",
            "Removing tetrahedra from manifold tetrahedralisation: application to real-time surgical simulation.",
            "A layered model of a virtual human intestine for surgery simulation.",
            "From arteriographies to computational flow in saccular aneurisms: the INRIA experience.",
            "Capturing intraoperative deformations: research experience at Brigham and Women's hospital.",
            "Tissue deformation and shape models in image-guided interventions: a discussion paper.",
            "Luminosity and contrast normalization in retinal images.",
            "3D multi-scale vessel enhancement filtering based on curvature measurements: application to time-of-flight MRA.",
            "Flux driven automatic centerline extraction.",
            "White matter fiber tract segmentation in DT-MRI using geometric flows.",
            "Thoracic non-rigid registration combining self-organizing maps and radial basis functions.",
            "Real-time synthesis of bleeding for virtual hysteroscopy.",
            "Radiographic stereometry for non-metal-backed acetubular cups: 3D wear estimation and related uncertainty.",
            "Assimilating intraoperative data with brain shift modeling using the adjoint equations.",
            "Erratum to: \"Validation of dynamic heart models obtained using non-linear registration for virtual reality training, planning, and guidance of minimally invasive cardiac surgeries\" [Medical Image Analysis 8 (2004) 387-401].",
            "Automated segmentation of the optic nerve head for diagnosis of glaucoma.",
            "Extracting and visualizing physiological parameters using dynamic contrast-enhanced magnetic resonance imaging of the breast.",
            "Phase mutual information as a similarity measure for registration.",
            "Tumor feature visualization with unsupervised learning.",
            "Editorial.",
            "A non-rigid registration approach for quantifying myocardial contraction in tagged MRI using generalized information measures.",
            "Tagged magnetic resonance imaging of the heart: a survey.",
            "Unsupervised motion-compensation of multi-slice cardiac perfusion MRI.",
            "Editorial.",
            "Scale-invariant registration of monocular endoscopic images to CT-scans for sinus surgery.",
            "White matter tractography by anisotropic wavefront evolution and diffusion tensor imaging.",
            "Spatio-temporal free-form registration of cardiac MR image sequences.",
            "Automatic segmentation of MR images of the developing newborn brain.",
            "Simulation of cardiac pathologies using an electromechanical biventricular model and XMR interventional imaging.",
            "Dynamic measurement of soft tissue viscoelastic properties with a torsional resonator device.",
            "An EM algorithm for shape classification based on level sets.",
            "Open science - combining open data and open source software: Medical image analysis with the Insight Toolkit.",
            "Polyrigid and polyaffine transformations: A novel geometrical tool to deal with non-rigid deformations - Application to the registration of histological slices.",
            "Towards a model of lung biomechanics: pulmonary kinematics via registration of serial lung images.",
            "Efficient multi-modal dense field non-rigid registration: alignment of histological and section images.",
            "A hybrid framework for 3D medical image segmentation.",
            "Case study: an evaluation of user-assisted hierarchical watershed segmentation.",
            "Integrating segmentation methods from the Insight Toolkit into a visualization application.",
            "The Medical Imaging Interaction Toolkit.",
            "Teaching medical image analysis with the Insight Toolkit."
        ]
    },
    {
        "name": "Medical Image Analysis",
        "year": "2004",
        "info": "Volume 8: 2004",
        "count": 40,
        "papers": [
            "Editorial 2004.",
            "A deformable digital brain atlas system according to Talairach and Tournoux.",
            "Modelling of interaction between a spatula and a human brain.",
            "Interactive 3D editing tools for image segmentation.",
            "Diffusion tensor magnetic resonance image regularization.",
            "The application of serial MRI analysis techniques to the study of cerebral atrophy in late-onset dementia.",
            "Registration of freehand 3D ultrasound and magnetic resonance liver images.",
            "Erratum to: \"A fully automatic and robust brain MRI tissue classification method\" [Medical Image Analysis 7 (2003) 513-527].",
            "DT-MRI denoising and neuronal fiber tracking.",
            "Intracranial vessel segmentation from time-of-flight MRA using pre-processing of the MIP Z-buffer: accuracy of the ZBS algorithm.",
            "Interactive segmentation of abdominal aortic aneurysms in CTA images.",
            "Optimized prostate biopsy via a statistical atlas of cancer spatial distribution.",
            "Invariant surface alignment in the presence of affine and some nonlinear transformations.",
            "Editorial.",
            "Extracting branching tubular object geometry via cores.",
            "Integrating watersheds and critical point analysis for object detection in discrete 2D images.",
            "Brain morphometry using 3D moment invariants.",
            "Boundary and medial shape analysis of the hippocampus in schizophrenia.",
            "Automatic segmentation of different-sized white matter lesions by voxel probability estimation.",
            "GIST: an interactive, GPU-based level set segmentation tool for 3D medical images.",
            "Region segmentation using information divergence measures.",
            "Automated segmentation of the left ventricle in cardiac MRI.",
            "Segmentation of 4D cardiac MR images using a probabilistic atlas and the EM algorithm.",
            "A statistically based flow for image segmentation.",
            "A brain tumor segmentation framework based on outlier detection.",
            "3D image segmentation of deformable objects with joint shape-intensity prior models using level sets.",
            "Mapping techniques for aligning sulci across multiple brains.",
            "Tuning and comparing spatial normalization methods.",
            "Grid powered nonlinear image registration with locally adaptive regularization.",
            "Accurate assessment of patellar tracking using fiducial and intensity-based fluoroscopic techniques.",
            "Statistical shape modeling of low level visual area borders.",
            "Generalized image models and their application as statistical models of images.",
            "Statistical shape model of atria, ventricles and epicardium from short- and long-axis MR images.",
            "Validation of dynamic heart models obtained using non-linear registration for virtual reality training, planning, and guidance of minimally invasive cardiac surgeries.",
            "Feature characterization in fMRI data: the Information Bottleneck approach.",
            "Registration of medical images using an interpolated closest point transform: method and validation.",
            "Mutual information in coupled multi-shape model for medical image segmentation.",
            "Strategies for brain shift evaluation.",
            "Adaptive registration using local information measures.",
            "Reviewers - an acknowledgement."
        ]
    },
    {
        "name": "Medical Image Analysis",
        "year": "2003",
        "info": "Volume 7: 2003",
        "count": 39,
        "papers": [
            "Image registration via level-set motion: Applications to atlas-based segmentation.",
            "Segmentation of carpal bones from CT images using skeletally coupled deformable models.",
            "Irregularity index: A new border irregularity measure for cutaneous melanocytic lesions.",
            "Recovering the X-ray projection geometry for three-dimensional tomographic reconstruction with additional sensors: Attached camera versus external navigation system.",
            "Reconstruction and web distribution of measurable arterial models.",
            "Detection and segmentation of drusen deposits on human retina: Potential in the diagnosis of age-related macular degeneration.",
            "A unified non-rigid feature registration method for brain mapping.",
            "Patient specific finite element model of the face soft tissues for computer-assisted maxillofacial surgery.",
            "Structural and radiometric asymmetry in brain images.",
            "A variational framework for integrating segmentation and registration through active contours.",
            "A multi-scale probabilistic network model for detection, synthesis and compression in mammographic image analysis.",
            "Statistical shape analysis of neuroanatomical structures based on medial models.",
            "Numerical determination of the susceptibility caused geometric distortions in magnetic resonance imaging.",
            "Robust registration for computer-integrated orthopedic surgery: Laboratory validation and clinical experience.",
            "Analyzing the neocortical fine-structure.",
            "Landmark detection in the chest and registration of lung surfaces with an application to nodule registration.",
            "Truth cube: Establishing physical standards for soft tissue simulation.",
            "Discriminant snakes for 3D reconstruction of anatomical organs.",
            "Fusion of contrast-enhanced breast MR and mammographic imaging data.",
            "An automated method for the detection of pulmonary embolism in V/Q-scans.",
            "Towards ultrasound cardiac image segmentation based on the radiofrequency signal.",
            "Cardiac magnetic resonance imaging in small animal models of human heart failure.",
            "A 3-D model-based registration approach for the PET, MR and MCG cardiac data fusion.",
            "Electrocardiographic imaging of atrial and ventricular electrical activation.",
            "Editorial.",
            "A generic framework for the parcellation of the cortical surface into gyri using geodesic Voronoı̈ diagrams.",
            "Statistical shape analysis using non-Euclidean metrics.",
            "Growth modeling of human mandibles using non-Euclidean metrics.",
            "In vivo strain and stress estimation of the heart left and right ventricles from MRI images.",
            "Stochastic finite element framework for simultaneous estimation of cardiac kinematic functions and material parameters.",
            "Spatio-temporal directional filtering for improved inversion of MR elastography images.",
            "Deformable biomechanical models: Application to 4D cardiac image analysis.",
            "From colour to tissue histology: Physics-based interpretation of images of pigmented skin lesions.",
            "Detecting glaucomatous wedge shaped defects in polarimetric images.",
            "A fully automatic and robust brain MRI tissue classification method.",
            "Combinative multi-scale level set framework for echocardiographic image segmentation.",
            "MAP MRF joint segmentation and registration of medical images.",
            "A similarity measure for nonrigid volume registration using known joint distribution of targeted tissue: Application to dynamic CT data of the liver.",
            "A viscous fluid model for multimodal non-rigid image registration using mutual information."
        ]
    },
    {
        "name": "Medical Image Analysis",
        "year": "2002",
        "info": "Volume 6: 2002",
        "count": 28,
        "papers": [
            "Methods for modeling and predicting mechanical deformations of the breast under external perturbations.",
            "Four-dimensional processing of deformable cardiac PET data.",
            "Evaluation of image features and search strategies for segmentation of bone structures in radiographs using Active Shape Models.",
            "Estimating the effective degrees of freedom in univariate multiple regression analysis.",
            "Automatic recognition of cortical sulci of the human brain using a congregation of neural networks.",
            "Processing and visualization for diffusion tensor MRI.",
            "Fusing speed and phase information for vascular segmentation of phase contrast MR angiograms.",
            "BrainSuite: An automated cortical surface identification tool.",
            "Nonrigid registration of 3D tensor medical data.",
            "Automatic detection and segmentation of evolving processes in 3D medical images: Application to multiple sclerosis.",
            "Retrospective correction of the heel effect in hand radiographs.",
            "Distortion correction and robust tensor estimation for MR diffusion imaging.",
            "Correction of probe pressure artifacts in freehand 3D ultrasound.",
            "Diffusion-enhanced visualization and quantification of vascular anomalies in three-dimensional rotational angiography: Results of an in-vitro evaluation.",
            "A direct approach to estimating surfaces in tomographic data.",
            "Deformable organisms for automatic medical image analysis.",
            "A CAD system for the 3D location of lesions in mammograms.",
            "Inverse finite element characterization of soft tissues.",
            "Algorithmic tools for real-time microsurgery simulation.",
            "The development and evaluation of a three-dimensional ultrasound-guided breast biopsy apparatus.",
            "Augmented reality guidance for needle biopsies: An initial randomized, controlled trial in phantoms.",
            "Tracking of a bronchoscope using epipolar geometry analysis and intensity-based image registration of real and virtual endoscopic images.",
            "Serial registration of intraoperative MR images of the brain.",
            "Model-driven brain shift compensation.",
            "Coupling of fluid and elastic models for biomechanical simulations of brain deformations using FEM.",
            "Estimation of the partial volume effect in MRI.",
            "Characterization of changes in blood vessel width and tortuosity in retinopathy of prematurity using image analysis.",
            "Computerized detection of pulmonary nodules in chest radiographs based on morphological features and wavelet snake model."
        ]
    },
    {
        "name": "Medical Image Analysis",
        "year": "2001",
        "info": "Volume 5: 2001",
        "count": 24,
        "papers": [
            "Towards inference of human brain connectivity from MR diffusion tensor data.",
            "Estimation of 3D left ventricular deformation from echocardiography.",
            "Extracting parametric images from dynamic contrast-enhanced MRI studies of the brain using factor analysis.",
            "3D ultrasound measurement of large organ volume.",
            "On the number of clusters and the fuzziness index for unsupervised FCA application to BOLD fMRI time series.",
            "Building 3D sulcal models using local geometry.",
            "Non-rigid registration by geometry-constrained diffusion.",
            "Evaluation of using absolute versus relative base level when analyzing brain activation images using the scale-space primal sketch.",
            "Quantitative evaluation of convolution-based methods for medical image interpolation.",
            "Interaction in the segmentation of medical images: A survey.",
            "A global optimisation method for robust affine registration of brain images.",
            "Symbolic description of intracerebral vessels segmented from magnetic resonance angiograms and evaluation by comparison with X-ray angiograms.",
            "Acquisition, segmentation and tracking of the cerebral vascular tree on 3D magnetic resonance angiography images.",
            "Segmentation of brain 3D MR images using level sets and dense registration.",
            "CURVES: Curve evolution for vessel segmentation.",
            "Atlas-assisted localization analysis of functional images.",
            "Creating a high-resolution spatial/symbolic model of the inner organs based on the Visible Human.",
            "Measurements and modelling of the compliance of human and porcine organs.",
            "Magnetic resonance elastography: Non-invasive mapping of tissue elasticity.",
            "In vivo finite element model-based image analysis of pacemaker lead mechanics.",
            "Talairach-Tournoux brain atlas registration using a metalforming principle-based finite element method.",
            "Fast extraction of minimal paths in 3D images and applications to virtual endoscopy.",
            "Modeling the 3D coronary tree for labeling purposes.",
            "A computational model of postoperative knee kinematics."
        ]
    },
    {
        "name": "Medical Image Analysis",
        "year": "2000",
        "info": "Volume 4: 2000",
        "count": 28,
        "papers": [
            "Welcome to the first issue of the new millennium.",
            "Guest Editorial.",
            "Physical model-based non-rigid registration incorporating statistical shape information.",
            "2D+T acoustic boundary detection in echocardiography.",
            "Exploring the discrimination power of the time domain for segmentation and characterization of active lesions in serial MR data.",
            "Adaptive, template moderated, spatially varying statistical classification.",
            "Modelling of soft tissue deformation for laparoscopic surgery simulation.",
            "An Image Overlay system for medical data visualization.",
            "T-snakes: Topology adaptive snakes.",
            "Creases as local features of deformation grids.",
            "Statistical analysis of normal and abnormal dissymmetry in volumetric medical images.",
            "Volume distribution of cerebrospinal fluid using multispectral MR imaging.",
            "Image analysis for computer-assisted internal fixation of hip fractures.",
            "Affine adaptive filtering of CT data.",
            "Automatic labelling of the human cortical surface using sulcal basins.",
            "Segmentation and measurement of brain structures in MRI including confidence bounds.",
            "An algorithmic overview of surface registration techniques for medical imaging.",
            "Segmentation of the skull in MRI volumes using deformable model and taking the partial volume effect into account.",
            "Fast re-rendering of volume and surface graphics by depth, color, and opacity buffering.",
            "Two-dimensional spatial and temporal displacement and deformation field fitting from cardiac magnetic resonance tagging.",
            "Symmetry axis computation for almost-symmetrical and asymmetrical objects: Application to pigmented skin lesions.",
            "Detecting the brain surface in sparse MRI using boundary models.",
            "Phantom-based performance evaluation: Application to brain segmentation from magnetic resonance images.",
            "A procedure to average 3D anatomical structures.",
            "Three-dimensional motion reconstruction and analysis of the right ventricle using tagged MRI.",
            "Providing visual information to validate 2-D to 3-D registration.",
            "Precision of distance determination using 3D to 2D projections: The error of migration measurement using X-ray images.",
            "A 3D generalization of user-steered live-wire segmentation."
        ]
    },
    {
        "name": "Medical Image Analysis",
        "year": "1999",
        "info": "Volume 3: 1999",
        "count": 28,
        "papers": [
            "Three-dimensional computer vision for tooth restoration.",
            "Robust retrieval of three-dimensional structures from image stacks.",
            "Medical image analysis: Foreword.",
            "Model-based detection of spiculated lesions in mammograms.",
            "Evaluating a robust contour tracker on echocardiographic sequences.",
            "Knowledge-based tensor anisotropic diffusion of cardiac magnetic resonance images.",
            "Registration and difference analysis of corresponding mammogram images.",
            "Bone labelling on micro-magnetic resonance images.",
            "Stradx: real-time acquisition and visualization of freehand three-dimensional ultrasound.",
            "Fast surface and volume estimation from non-parallel cross-sections, for freehand three-dimensional ultrasound.",
            "Alignment of magnetic-resonance brain datasets with the stereotactical coordinate system.",
            "Deformable meshes with automated topology changes for coarse-to-fine three-dimensional surface extraction.",
            "Medical image analysis : Foreword.",
            "Incorporating a statistically based shape model into a system for computer-assisted anterior cruciate ligament surgery.",
            "Brachytherapy optimal planning with application to intravascular radiation therapy.",
            "CARABEAMER: a treatment planner for a robotic radiosurgical system with general kinematics.",
            "Evaluation of robot-based registration for subtraction radiography.",
            "The effects of physical constraints in laparoscopic surgery.",
            "Hippocrate: a safe robot arm for medical applications with force feedback.",
            "Computer-integrated revision total hip replacement surgery: concept and preliminary results.",
            "The development and evaluation of CADMIUM: a prototype system to assist in the interpretation of mammograms.",
            "A comparison of freehand three-dimensional ultrasound reconstruction techniques.",
            "Model tags: direct three-dimensional tracking of heart wall motion from tagged magnetic resonance images.",
            "Comparative evaluation of multiresolution optimization strategies for multimodality image registration by maximization of mutual information.",
            "Model extraction from magnetic resonance volume data using the deformable pyramid.",
            "Medical image analysis.",
            "A new variational shape-from-orientation approach to correcting intensity inhomogeneities in magnetic resonance images.",
            "Rigid point feature registration using mutual information."
        ]
    },
    {
        "name": "Medical Image Analysis",
        "year": "1998",
        "info": "Volume 2: 1998",
        "count": 24,
        "papers": [
            "A survey of medical image registration.",
            "A scheme for automatically building three-dimensional morphometric anatomical atlases: application to a skull atlas.",
            "An advanced system for the simulation and planning of orthodontic treatment.",
            "An efficient motion estimator with application to medical image registration.",
            "Fast numerical algorithms for fitting multiresolution hybrid shape models to brain MRI.",
            "Guiding systems for computer-assisted surgery: introducing synergistic devices and discussing the different approaches.",
            "Volumetric object modeling for surgical simulation.",
            "Experimentation with a transcranial magnetic stimulation system for functional brain mapping.",
            "Three-dimensional multi-scale line filter for segmentation and visualization of curvilinear structures in medical images.",
            "A three-dimensional virtual environment for modeling mechanical cardiopulmonary interactions.",
            "Definition of a four-dimensional continuous planispheric transformation for the tracking and the analysis of left-ventricle motion.",
            "A symbolic environment for visualizing activated foci in functional neuroimaging datasets.",
            "The detection and significance of subtle changes in mixed-signal brain lesions by serial MRI scan matching and spatial normalization.",
            "Image matching as a diffusion process: an analogy with Maxwell's demons.",
            "On-line analysis of echocardiographic image sequences.",
            "Motion and deformation tracking for short-axis echo-planar myocardial perfusion imaging.",
            "Automatic construction of eigenshape models by direct optimization.",
            "Semiautomatic segmentation of brain exterior in magnetic resonance images driven by empirical procedures and anatomical knowledge.",
            "Ultrasonic and elasticity imaging to model disease-induced changes in soft-tissue structure.",
            "Cardiac material markers from tagged MR images.",
            "A three-component deformation model for image-guided surgery.",
            "Statistical image reconstruction methods for randoms-precorrected PET scans.",
            "An approximate bootstrap technique for variance estimation in parametric images.",
            "A method for approximating the density of maximum-likelihood and maximum a posteriori estimates under a Gaussian noise model."
        ]
    },
    {
        "name": "Medical Image Analysis",
        "year": "1996",
        "info": "Volume 1: 1996/1997",
        "count": 24,
        "papers": [
            "From the Editors.",
            "A representation for mammographic image processing.",
            "Segmentation of 2-D and 3-D objects from MRI volume data using constrained elastic deformations of flexible Fourier contour and surface models.",
            "Multi-modal volume registration by maximization of mutual information.",
            "Analysis of left ventricular wall motion based on volumetric deformable models and MRI-SPAMM.",
            "Development and preliminary evaluation of VISLAN, a surgical planning and guidance system using intra-operative video imaging.",
            "Deformable models in medical image analysis: a survey.",
            "Segmentation of brain tissue from magnetic resonance images.",
            "Tracking and motion analysis of the left ventricle with deformable superquadrics.",
            "Comparison of edge-based and ridge-based registration of CT and MR brain images.",
            "Automated 3-D registration of MR and CT images of the head.",
            "Three-dimensional spatial compounding of ultrasound images.",
            "Demonstration of accuracy and clinical versatility of mutual information for automatic multimodality image fusion using affine and thin-plate spline warped geometric deformations.",
            "Analysis of dynamic MR breast images using a model of contrast enhancement.",
            "Landmark methods for forms without landmarks: morphometrics of group differences in outline shape.",
            "Estimation of three-dimensional cardiac velocity fields: assessment of a differential method and application to three-dimensional CT data.",
            "Segmentation of the Visible Human for high-quality volume-based visualization.",
            "Detection, visualization and animation of abnormal anatomic structure with a deformable probabilistic brain atlas based on random vector field transformations.",
            "Finding parametric representations of the cortical sulci using an active contour model.",
            "The Brain Bench: virtual tools for stereotactic frame neurosurgery.",
            "Interactive live-wire boundary extraction.",
            "Fast numerical algorithms for fitting multiresolution hybrid shape models to brain MRI.",
            "Automated lumen definition from 30 MHz intravascular ultrasound images.",
            "A robust point-matching algorithm for autoradiograph alignment."
        ]
    }
]