[
    {
        "year": "2020",
        "name": "24th RECOMB 2020",
        "info": "Padua, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/recomb/2020",
                "sub_name": "Research in Computational Molecular Biology - 24th Annual International Conference, RECOMB 2020, Padua, Italy, May 10-13, 2020, Proceedings.",
                "count": 37,
                "papers": [
                    "Computing the Rearrangement Distance of Natural Genomes.",
                    "Deep Large-Scale Multi-task Learning Network for Gene Expression Inference.",
                    "A Randomized Parallel Algorithm for Efficiently Finding Near-Optimal Universal Hitting Sets.",
                    "Multiple Competition-Based FDR Control and Its Application to Peptide Detection.",
                    "Supervised Adversarial Alignment of Single-Cell RNA-seq Data.",
                    "Bagging MSA Learning: Enhancing Low-Quality PSSM with Deep Learning for Accurate Protein Structure Property Prediction.",
                    "AStarix: Fast and Optimal Sequence-to-Graph Alignment.",
                    "Polynomial-Time Statistical Estimation of Species Trees Under Gene Duplication and Loss.",
                    "RoboCOP: Multivariate State Space Model Integrating Epigenomic Accessibility Data to Elucidate Genome-Wide Chromatin Occupancy.",
                    "Representation of k-mer Sets Using Spectrum-Preserving String Sets.",
                    "NetMix: A Network-Structured Mixture Model for Reduced-Bias Estimation of Altered Subnetworks.",
                    "Stochastic Sampling of Structural Contexts Improves the Scalability and Accuracy of RNA 3D Module Identification.",
                    "Lower Density Selection Schemes via Small Universal Hitting Sets with Short Remaining Path Length.",
                    "Strain-Aware Assembly of Genomes from Mixed Samples Using Flow Variation Graphs.",
                    "Spectral Jaccard Similarity: A New Approach to Estimating Pairwise Sequence Alignments.",
                    "MosaicFlye: Resolving Long Mosaic Repeats Using Long Reads.",
                    "Bayesian Non-parametric Clustering of Single-Cell Mutation Profiles.",
                    "PaccMannRL: Designing Anticancer Drugs From Transcriptomic Data via Reinforcement Learning.",
                    "CluStrat: A Structure Informed Clustering Strategy for Population Stratification.",
                    "PWAS: Proteome-Wide Association Study.",
                    "Estimating the Rate of Cell Type Degeneration from Epigenetic Sequencing of Cell-Free DNA.",
                    "Potpourri: An Epistasis Test Prioritization Algorithm via Diverse SNP Selection.",
                    "Privacy-Preserving Biomedical Database Queries with Optimal Privacy-Utility Trade-Offs.",
                    "Iterative Refinement of Cellular Identity from Single-Cell Data Using Online Learning.",
                    "A Guided Network Propagation Approach to Identify Disease Genes that Combines Prior and New Information.",
                    "A Scalable Method for Estimating the Regional Polygenicity of Complex Traits.",
                    "Efficient and Accurate Inference of Microbial Trajectories from Longitudinal Count Data.",
                    "Identifying Causal Variants by Fine Mapping Across Multiple Studies.",
                    "MONN: A Multi-objective Neural Network for Predicting Pairwise Non-covalent Interactions and Binding Affinities Between Compounds and Proteins.",
                    "Evolutionary Context-Integrated Deep Sequence Modeling for Protein Engineering.",
                    "Log Transformation Improves Dating of Phylogenies.",
                    "Reconstructing Genotypes in Private Genomic Databases from Genetic Risk Scores.",
                    "d-PBWT: Dynamic Positional Burrows-Wheeler Transform.",
                    "A Mixture Model for Signature Discovery from Sparse Mutation Data.",
                    "Single-Cell Tumor Phylogeny Inference with Copy-Number Constrained Mutation Losses.",
                    "Reconstruction of Gene Regulatory Networks by Integrating Biological Model and a Recommendation System.",
                    "Probing Multi-way Chromatin Interaction with Hypergraph Representation Learning."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "23rd RECOMB 2019",
        "info": "Washington, DC, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/recomb/2019",
                "sub_name": "Research in Computational Molecular Biology - 23rd Annual International Conference, RECOMB 2019, Washington, DC, USA, May 5-8, 2019, Proceedings.",
                "count": 37,
                "papers": [
                    "An Efficient, Scalable and Exact Representation of High-Dimensional Color Information Enabled via de Bruijn Graph Search.",
                    "Identifying Clinical Terms in Free-Text Notes Using Ontology-Guided Machine Learning.",
                    "ModHMM: A Modular Supra-Bayesian Genome Segmentation Method.",
                    "Learning Robust Multi-label Sample Specific Distances for Identifying HIV-1 Drug Resistance.",
                    "MethCP: Differentially Methylated Region Detection with Change Point Models.",
                    "On the Complexity of Sequence to Graph Alignment.",
                    "Minimization-Aware Recursive K^* K ∗ ( MARK^* MARK ∗ ): A Novel, Provable Algorithm that Accelerates Ensemble-Based Protein Design and Provably Approximates the Energy Landscape.",
                    "Sparse Binary Relation Representations for Genome Graph Annotation.",
                    "How Many Subpopulations Is Too Many? Exponential Lower Bounds for Inferring Population Histories.",
                    "Efficient Construction of a Complete Index for Pan-Genomics Read Alignment.",
                    "Tumor Copy Number Deconvolution Integrating Bulk and Single-Cell Sequencing Data.",
                    "OMGS: Optical Map-Based Genome Scaffolding.",
                    "Fast Approximation of Frequent k-mers and Applications to Metagenomics.",
                    "De Novo Clustering of Long-Read Transcriptome Data Using a Greedy, Quality-Value Based Algorithm.",
                    "A Sticky Multinomial Mixture Model of Strand-Coordinated Mutational Processes in Cancer.",
                    "Disentangled Representations of Cellular Identity.",
                    "RENET: A Deep Learning Approach for Extracting Gene-Disease Associations from Literature.",
                    "APPLES: Fast Distance-Based Phylogenetic Placement.",
                    "De Novo Peptide Sequencing Reveals a Vast Cyclopeptidome in Human Gut and Other Environments.",
                    "Biological Sequence Modeling with Convolutional Kernel Networks.",
                    "Dynamic Pseudo-time Warping of Complex Single-Cell Trajectories.",
                    "netNMF-sc: A Network Regularization Algorithm for Dimensionality Reduction and Imputation of Single-Cell Expression Data.",
                    "Geometric Sketching of Single-Cell Data Preserves Transcriptional Structure.",
                    "Sketching Algorithms for Genomic Data Analysis and Querying in a Secure Enclave.",
                    "Mitigating Data Scarcity in Protein Binding Prediction Using Meta-Learning.",
                    "Efficient Estimation and Applications of Cross-Validated Genetic Predictions.",
                    "Inferring Tumor Evolution from Longitudinal Samples.",
                    "Scalable Multi-component Linear Mixed Models with Application to SNP Heritability Estimation.",
                    "A Note on Computing Interval Overlap Statistics.",
                    "Distinguishing Biological from Technical Sources of Variation Using a Combination of Methylation Datasets.",
                    "GRep: Gene Set Representation via Gaussian Embedding.",
                    "Accurate Sub-population Detection and Mapping Across Single Cell Experiments with PopCorn.",
                    "Fast Estimation of Genetic Correlation for Biobank-Scale Data.",
                    "stance-Based Protein Folding Powered by Deep Learning.",
                    "Comparing 3D Genome Organization in Multiple Species Using Phylo-HMRF.",
                    "Towards a Post-clustering Test for Differential Expression.",
                    "AdaFDR: A Fast, Powerful and Covariate-Adaptive Approach to Multiple Hypothesis Testing."
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "22nd RECOMB 2018",
        "info": "Paris, France",
        "venues": [
            {
                "sub_name_abbr": "conf/recomb/2018",
                "sub_name": "Research in Computational Molecular Biology - 22nd Annual International Conference, RECOMB 2018, Paris, France, April 21-24, 2018, Proceedings.",
                "count": 38,
                "papers": [
                    "Long Reads Enable Accurate Estimates of Complexity of Metagenomes.",
                    "Chromatyping: Reconstructing Nucleosome Profiles from NOMe Sequencing Data.",
                    "GTED: Graph Traversal Edit Distance.",
                    "Statistical Inference of Peroxisome Dynamics.",
                    "Loss-Function Learning for Digital Tissue Deconvolution.",
                    "Inference of Population Structure from Ancient DNA.",
                    "Using Minimum Path Cover to Boost Dynamic Programming on DAGs: Co-linear Chaining Extended.",
                    "Modeling Dependence in Evolutionary Inference for Proteins.",
                    "Constrained De Novo Sequencing of neo-Epitope Peptides Using Tandem Mass Spectrometry.",
                    "Reverse de Bruijn: Utilizing Reverse Peptide Synthesis to Cover All Amino Acid k-mers.",
                    "Circular Networks from Distorted Metrics.",
                    "A Nested 2-Level Cross-Validation Ensemble Learning Pipeline Suggests a Negative Pressure Against Crosstalk snoRNA-mRNA Interactions in Saccharomyces Cerevisae.",
                    "Context-Specific Nested Effects Models.",
                    "Algorithmic Framework for Approximate Matching Under Bounded Edits with Applications to Sequence Analysis.",
                    "Accurate Reconstruction of Microbial Strains from Metagenomic Sequencing Using Representative Reference Genomes.",
                    "Targeted Genotyping of Variable Number Tandem Repeats with AdVNTR.",
                    "Positive-Unlabeled Convolutional Neural Networks for Particle Picking in Cryo-electron Micrographs.",
                    "Designing RNA Secondary Structures Is Hard.",
                    "Generalizable Visualization of Mega-Scale Single-Cell Data.",
                    "Probabilistic Count Matrix Factorization for Single Cell Expression Data Analysis.",
                    "Fixed-Parameter Tractable Sampling for RNA Design with Multiple Target Structures.",
                    "Contribution of Structural Variation to Genome Structure: TAD Fusion Discovery and Ranking.",
                    "Assembly of Long Error-Prone Reads Using Repeat Graphs.",
                    "A Multi-species Functional Embedding Integrating Sequence and Network Structure.",
                    "Deciphering Signaling Specificity with Deep Neural Networks.",
                    "Integrative Inference of Subclonal Tumour Evolution from Single-Cell and Bulk Sequencing Data.",
                    "Mantis: A Fast, Small, and Exact Large-Scale Sequence-Search Index.",
                    "Tensor Composition Analysis Detects Cell-Type Specific Associations in Epigenetic Studies.",
                    "Assembly-Free and Alignment-Free Sample Identification Using Genome Skims.",
                    "Efficient Algorithms to Discover Alterations with Complementary Functional Association in Cancer.",
                    "Latent Variable Model for Aligning Barcoded Short-Reads Improves Downstream Analyses.",
                    "ModulOmics: Integrating Multi-Omics Data to Identify Cancer Driver Modules.",
                    "SCIΦ: Single-Cell Mutation Identification via Phylogenetic Inference.",
                    "AptaBlocks: Accelerating the Design of RNA-Based Drug Delivery Systems.",
                    "A Unifying Framework for Summary Statistic Imputation.",
                    "Characterizing Protein-DNA Binding Event Subtypes in ChIP-Exo Data.",
                    "Continuous-Trait Probabilistic Model for Comparing Multi-species Functional Genomic Data.",
                    "Deep Learning Reveals Many More Inter-protein Residue-Residue Contacts than Direct Coupling Analysis."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "21st RECOMB 2017",
        "info": "Hong Kong",
        "venues": [
            {
                "sub_name_abbr": "conf/recomb/2017",
                "sub_name": "Research in Computational Molecular Biology - 21st Annual International Conference, RECOMB 2017, Hong Kong, China, May 3-7, 2017, Proceedings.",
                "count": 38,
                "papers": [
                    "Boosting Alignment Accuracy by Adaptive Local Realignment.",
                    "A Concurrent Subtractive Assembly Approach for Identification of Disease Associated Sub-metagenomes.",
                    "A Flow Procedure for the Linearization of Genome Sequence Graphs.",
                    "Dynamic Alignment-Free and Reference-Free Read Compression.",
                    "A Fast Approximate Algorithm for Mapping Long Reads to Large Reference Databases.",
                    "Determining the Consistency of Resolved Triplets and Fan Triplets.",
                    "Progressive Calibration and Averaging for Tandem Mass Spectrometry Statistical Confidence Estimation: Why Settle for a Single Decoy?",
                    "Resolving Multicopy Duplications de novo Using Polyploid Phasing.",
                    "A Bayesian Active Learning Experimental Design for Inferring Signaling Networks.",
                    "BBK* (Branch and Bound over K*): A Provable and Efficient Ensemble-Based Algorithm to Optimize Stability and Binding Affinity over Large Sequence Spaces.",
                    "Superbubbles, Ultrabubbles and Cacti.",
                    "EPR-Dictionaries: A Practical and Fast Data Structure for Constant Time Searches in Unidirectional and Bidirectional FM Indices.",
                    "A Bayesian Framework for Estimating Cell Type Composition from DNA Methylation Without the Need for Methylation Reference.",
                    "Towards Recovering Allele-Specific Cancer Genome Graphs.",
                    "Using Stochastic Approximation Techniques to Efficiently Construct Confidence Intervals for Heritability.",
                    "Improved Search of Large Transcriptomic Sequencing Databases Using Split Sequence Bloom Trees.",
                    "AllSome Sequence Bloom Trees.",
                    "Longitudinal Genotype-Phenotype Association Study via Temporal Structure Auto-learning Predictive Model.",
                    "Improving Imputation Accuracy by Inferring Causal Variants in Genetic Studies.",
                    "The Copy-Number Tree Mixture Deconvolution Problem and Applications to Multi-sample Bulk Sequencing Tumor Data.",
                    "Quantifying the Impact of Non-coding Variants on Transcription Factor-DNA Binding.",
                    "aBayesQR: A Bayesian Method for Reconstruction of Viral Populations Characterized by Low Diversity.",
                    "BeWith: A Between-Within Method for Module Discovery in Cancer using Integrated Analysis of Mutual Exclusivity, Co-occurrence and Functional Interactions (Extended Abstract).",
                    "K-mer Set Memory (KSM) Motif Representation Enables Accurate Prediction of the Impact of Regulatory Variants.",
                    "Network-Based Coverage of Mutational Profiles Reveals Cancer Genes.",
                    "Ultra-Accurate Complex Disorder Prediction: Case Study of Neurodevelopmental Disorders.",
                    "Inference of the Human Polyadenylation Code.",
                    "Folding Membrane Proteins by Deep Transfer Learning.",
                    "A Network Integration Approach for Drug-Target Interaction Prediction and Computational Drug Repositioning from Heterogeneous Information.",
                    "Epistasis in Genomic and Survival Data of Cancer Patients.",
                    "Ultra-Fast Identity by Descent Detection in Biobank-Scale Cohorts Using Positional Burrows-Wheeler Transform.",
                    "Joker de Bruijn: Sequence Libraries to Cover All k-mers Using Joker Characters.",
                    "GATTACA: Lightweight Metagenomic Binning Using Kmer Counting.",
                    "Species Tree Estimation Using ASTRAL: How Many Genes Are Enough?",
                    "Reconstructing Antibody Repertoires from Error-Prone Immunosequencing Datasets.",
                    "NetREX: Network Rewiring Using EXpression - Towards Context Specific Regulatory Networks.",
                    "E Pluribus Unum: United States of Single Cells.",
                    "ROSE: A Deep Learning Based Framework for Predicting Ribosome Stalling."
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "20. RECOMB 2016",
        "info": "Santa Monica, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/recomb/2016",
                "sub_name": "Research in Computational Molecular Biology - 20th Annual Conference, RECOMB 2016, Santa Monica, CA, USA, April 17-21, 2016, Proceedings.",
                "count": 36,
                "papers": [
                    "The Second Decade of the International Conference on Research in Computational Molecular Biology (RECOMB).",
                    "A MAD-Bayes Algorithm for State-Space Inference and Clustering with Application to Querying Large Collections of ChIP-Seq Data Sets.",
                    "Accurate Recovery of Ribosome Positions Reveals Slow Translation of Wobble-Pairing Codons in Yeast.",
                    "Multitask Matrix Completion for Learning Protein Interactions Across Diseases.",
                    "pathTiMEx: Joint Inference of Mutually Exclusive Cancer Pathways and Their Dependencies in Tumor Progression.",
                    "Clonality Inference from Single Tumor Samples Using Low Coverage Sequence Data.",
                    "Flexible Modelling of Genetic Effects on Function-Valued Traits.",
                    "MetaFlow: Metagenomic Profiling Based on Whole-Genome Coverage Analysis with Min-Cost Flows.",
                    "LUTE (Local Unpruned Tuple Expansion): Accurate Continuously Flexible Protein Design with General Energy Functions and Rigid-rotamer-like Efficiency.",
                    "Improving Bloom Filter Performance on Sequence Data Using k -mer Bloom Filters.",
                    "Safe and Complete Contig Assembly Via Omnitigs.",
                    "Long Single-Molecule Reads Can Resolve the Complexity of the Influenza Virus Composed of Rare, Closely Related Mutant Variants.",
                    "Structural Variation Detection with Read Pair Information - An Improved Null-Hypothesis Reduces Bias.",
                    "On Computing Breakpoint Distances for Genomes with Duplicate Genes.",
                    "New Genome Similarity Measures Based on Conserved Gene Adjacencies.",
                    "Fast Phylogenetic Biodiversity Computations Under a Non-uniform Random Distribution.",
                    "SLICER: Inferring Branched, Nonlinear Cellular Trajectories from Single Cell RNA-seq Data.",
                    "Multi-track Modeling for Genome-Scale Reconstruction of 3D Chromatin Structure from Hi-C Data.",
                    "Revealing the Genetic Basis of Immune Traits in the Absence of Experimental Immunophenotyping.",
                    "Shall We Dense? Comparing Design Strategies for Time Series Expression Experiments.",
                    "Enabling Privacy Preserving GWAS in Heterogeneous Human Populations.",
                    "Efficient Privacy-Preserving Read Mapping Using Locality Sensitive Hashing and Secure Kmer Voting.",
                    "Finding Mutated Subnetworks Associated with Survival in Cancer.",
                    "Multi-state Perfect Phylogeny Mixture Deconvolution and Applications to Cancer Sequencing.",
                    "Tree Inference for Single-Cell Data.",
                    "mLDM: A New Hierarchical Bayesian Statistical Model for Sparse Microbial Association Discovery.",
                    "Low-Density Locality-Sensitive Hashing Boosts Metagenomic Binning.",
                    "metaSPAdes: A New Versatile de novo Metagenomics Assembler.",
                    "Distributed Gradient Descent in Bacterial Food Search.",
                    "AptaTRACE: Elucidating Sequence-Structure Binding Motifs by Uncovering Selection Trends in HT-SELEX Experiments.",
                    "Fast Bayesian Inference of Copy Number Variants Using Hidden Markov Models with Wavelet Compression.",
                    "Allele-Specific Quantification of Structural Variations in Cancer Genomes.",
                    "Assembly of Long Error-Prone Reads Using de Bruijn Graphs.",
                    "Locating a Tree in a Reticulation-Visible Network in Cubic Time.",
                    "Joint Alignment of Multiple Protein-Protein Interaction Networks via Convex Optimization.",
                    "Complexes Detection in Biological Networks via Diversified Dense Subgraphs Mining."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "19. RECOMB 2015",
        "info": "Warsaw, Poland",
        "venues": [
            {
                "sub_name_abbr": "conf/recomb/2015",
                "sub_name": "Research in Computational Molecular Biology - 19th Annual International Conference, RECOMB 2015, Warsaw, Poland, April 12-15, 2015, Proceedings.",
                "count": 36,
                "papers": [
                    "Efficient Alignment Free Sequence Comparison with Bounded Mismatches.",
                    "DockStar: A Novel ILP Based Integrative Method for Structural Modelling of Multimolecular Protein Complexes (Extended Abstract).",
                    "CRISPR Detection from Short Reads Using Partial Overlap Graphs.",
                    "HapTree-X: An Integrative Bayesian Framework for Haplotype Reconstruction from Transcriptome and Genome Sequencing Data.",
                    "Read Clouds Uncover Variation in Complex Regions of the Human Genome.",
                    "Learning Microbial Interaction Networks from Metagenomic Count Data.",
                    "Immunoglobulin Classification Using the Colored Antibody Graph.",
                    "CIDANE: Comprehensive Isoform Discovery and Abundance Estimation.",
                    "Diffusion Component Analysis: Unraveling Functional Topology in Biological Networks.",
                    "Fragmentation Trees Reloaded.",
                    "KGSrna: Efficient 3D Kinematics-Based Sampling for Nucleic Acids.",
                    "Locating a Tree in a Phylogenetic Network in Quadratic Time.",
                    "Constructing Structure Ensembles of Intrinsically Disordered Proteins from Chemical Shift Data.",
                    "Comets (Constrained Optimization of Multistate Energies by Tree Search): A Provable and Efficient Algorithm to Optimize Binding Affinity and Specificity with Respect to Sequence.",
                    "Efficient and Accurate Multiple-Phenotypes Regression Method for High Dimensional Data Considering Population Structure.",
                    "BWM*: A Novel, Provable, Ensemble-Based Dynamic Programming Algorithm for Sparse Approximations of Computational Protein Design.",
                    "An Efficient Nonlinear Regression Approach for Genome-Wide Detection of Marginal and Interacting Genetic Variations.",
                    "Exploration of Designability of Proteins Using Graph Features of Contact Maps: Beyond Lattice Models.",
                    "CoMEt: A Statistical Approach to Identify Combinations of Mutually Exclusive Alterations in Cancer.",
                    "Deep Feature Selection: Theory and Application to Identify Enhancers and Promoters.",
                    "Protein Contact Prediction by Integrating Joint Evolutionary Coupling Analysis and Supervised Learning.",
                    "ScaffMatch: Scaffolding Algorithm Based on Maximum Weight Matching.",
                    "A Symmetric Length-Aware Enrichment Test.",
                    "Functional Alignment of Metabolic Networks.",
                    "Joint Inference of Genome Structure and Content in Heterogeneous Tumor Samples.",
                    "Ultra-Large Alignments Using Ensembles of Hidden Markov Models.",
                    "Topological Signatures for Population Admixture.",
                    "Haplotype Allele Frequency (HAF) Score: Predicting Carriers of Ongoing Selective Sweeps Without Knowledge of the Adaptive Allele.",
                    "Gap Filling as Exact Path Length Problem.",
                    "Deconvolution of Ensemble Chromatin Interaction Data Reveals the Latent Mixing Structures in Cell Subpopulations.",
                    "A Fast and Exact Algorithm for the Exemplar Breakpoint Distance.",
                    "Deciding When to Stop: Efficient Experimentation to Learn to Predict Drug-Target Interactions (Extended Abstract).",
                    "On the Sample Complexity of Cancer Pathways Identification.",
                    "A Novel Probabilistic Methodology for eQTL Analysis of Signaling Networks.",
                    "Rapidly Registering Identity-by-Descent Across Ancestral Recombination Graphs.",
                    "Computational Protein Design Using AND/OR Branch-and-Bound Search."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "18. RECOMB 2014",
        "info": "Pittsburgh, PA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/recomb/2014",
                "sub_name": "Research in Computational Molecular Biology - 18th Annual International Conference, RECOMB 2014, Pittsburgh, PA, USA, April 2-5, 2014, Proceedings.",
                "count": 35,
                "papers": [
                    "Tractatus: An Exact and Subquadratic Algorithm for Inferring Identical-by-Descent Multi-shared Haplotype Tracts.",
                    "HapTree: A Novel Bayesian Framework for Single Individual Polyplotyping Using NGS Data.",
                    "Changepoint Analysis for Efficient Variant Calling.",
                    "On the Representation of de Bruijn Graphs.",
                    "Exact Learning of RNA Energy Parameters from Structure.",
                    "An Alignment-Free Regression Approach for Estimating Allele-Specific Expression Using RNA-Seq Data.",
                    "The Generating Function Approach for Peptide Identification in Spectral Networks.",
                    "Decoding Coalescent Hidden Markov Models in Linear Time.",
                    "AptaCluster - A Method to Cluster HT-SELEX Aptamer Pools and Lessons from Its Application.",
                    "Learning Sequence Determinants of Protein: Protein Interaction Specificity with Sparse Graphical Models.",
                    "On Sufficient Statistics of Least-Squares Superposition of Vector Sets.",
                    "IDBA-MTP: A Hybrid MetaTranscriptomic Assembler Based on Protein Information.",
                    "MRFalign: Protein Homology Detection through Alignment of Markov Random Fields.",
                    "An Integrated Model of Multiple-Condition ChIP-Seq Data Reveals Predeterminants of Cdx2 Binding.",
                    "PASTA: Ultra-Large Multiple Sequence Alignment.",
                    "Fast Flux Module Detection Using Matroid Theory.",
                    "Building a Pangenome Reference for a Population.",
                    "CSAX: Characterizing Systematic Anomalies in eXpression Data.",
                    "WhatsHap: Haplotype Assembly for Future-Generation Sequencing Reads.",
                    "Simultaneous Inference of Cancer Pathways and Tumor Progression from Cross-Sectional Mutation Data.",
                    "dipSPAdes: Assembler for Highly Polymorphic Diploid Genomes.",
                    "An Exact Algorithm to Compute the DCJ Distance for Genomes with Duplicate Genes.",
                    "HIT'nDRIVE: Multi-driver Gene Prioritization Based on Hitting Time.",
                    "Modeling Mutual Exclusivity of Cancer Mutations.",
                    "Viral Quasispecies Assembly via Maximal Clique Enumeration.",
                    "Correlated Protein Function Prediction via Maximization of Data-Knowledge Consistency.",
                    "Bayesian Multiple Protein Structure Alignment.",
                    "Gene-Gene Interactions Detection Using a Two-Stage Model.",
                    "A Geometric Clustering Algorithm and Its Applications to Structural Data.",
                    "A Spatial-Aware Haplotype Copying Model with Applications to Genotype Imputation.",
                    "Traversing the k-mer Landscape of NGS Read Datasets for Quality Score Sparsification.",
                    "Reconstructing Breakage Fusion Bridge Architectures Using Noisy Copy Numbers.",
                    "Reconciliation with Non-binary Gene Trees Revisited.",
                    "Learning Protein-DNA Interaction Landscapes by Integrating Experimental Data through Computational Models.",
                    "Imputation of Quantitative Genetic Interactions in Epistatic MAPs by Interaction Propagation Matrix Completion."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "17. RECOMB 2013",
        "info": "Beijing, China",
        "venues": [
            {
                "sub_name_abbr": "conf/recomb/2013",
                "sub_name": "Research in Computational Molecular Biology - 17th Annual International Conference, RECOMB 2013, Beijing, China, April 7-10, 2013. Proceedings.",
                "count": 32,
                "papers": [
                    "Reconciliation Revisited: Handling Multiple Optima When Reconciling with Duplication, Transfer, and Loss.",
                    "SEME: A Fast Mapper of Illumina Sequencing Reads with Statistical Evaluation.",
                    "Dissecting Cancer Heterogeneity with a Probabilistic Genotype-Phenotype Model.",
                    "eALPS: Estimating Abundance Levels in Pooled Sequencing Using Available Genotyping Data.",
                    "Analysis of Metabolic Evolution in Bacteria Using Whole-Genome Metabolic Models.",
                    "Detecting Protein Conformational Changes in Interactions via Scaling Known Structures.",
                    "IPED: Inheritance Path Based Pedigree Reconstruction Algorithm Using Genotype Data.",
                    "An Optimal Algorithm for Building the Majority Rule Consensus Tree.",
                    "UniNovo: A Universal Tool for de Novo Peptide Sequencing.",
                    "Efficiently Identifying Significant Associations in Genome-Wide Association Studies.",
                    "Identification of Ultramodified Proteins Using Top-Down Spectra.",
                    "Distinguishing between Genomic Regions Bound by Paralogous Transcription Factors.",
                    "Assembling Genomes and Mini-metagenomes from Highly Chimeric Reads.",
                    "Inferring Intra-tumor Heterogeneity from High-Throughput DNA Sequencing Data.",
                    "NP-MuScL: Unsupervised Global Prediction of Interaction Networks from Multiple Data Sources.",
                    "High Resolution Modeling of Chromatin Interactions.",
                    "A Linear Inside-Outside Algorithm for Correcting Sequencing Errors in Structured RNAs.",
                    "An Accurate Method for Inferring Relatedness in Large Datasets of Unphased Genotypes via an Embedded Likelihood-Ratio Test.",
                    "Learning Natural Selection from the Site Frequency Spectrum.",
                    "Considering Unknown Unknowns - Reconstruction of Non-confoundable Causal Relations in Biological Networks.",
                    "Inference of Tumor Phylogenies with Improved Somatic Mutation Discovery.",
                    "Abstract: Using the Fast Fourier Transform to Accelerate the Computational Search for RNA Conformational Switches.",
                    "MethylCRF, an Algorithm for Estimating Absolute Methylation Levels at Single CpG Resolution from Methylation Enrichment and Restriction Enzyme Sequencing Methods.",
                    "Counting Motifs in the Entire Biological Network from Noisy and Incomplete Data - (Extended Abstract).",
                    "Extracting Structural Information from Residual Chemical Shift Anisotropy: Analytic Solutions for Peptide Plane Orientations and Applications to Determine Protein Structure.",
                    "Genome-Wide Survival Analysis of Somatic Mutations in Cancer.",
                    "Spectral Library Generating Function for Assessing Spectrum-Spectrum Match Significance.",
                    "SPARSE: Quadratic Time Simultaneous Alignment and Folding of RNAs without Sequence-Based Heuristics.",
                    "An Algorithm for Constructing Parsimonious Hybridization Networks with Multiple Phylogenetic Trees.",
                    "Fast and Accurate Calculation of Protein Depth by Euclidean Distance Transform.",
                    "Inference of Spatial Organizations of Chromosomes Using Semi-definite Embedding Approach and Hi-C Data.",
                    "Boosting Prediction Performance of Protein-Protein Interaction Hot Spots by Using Structural Neighborhood Properties - (Extended Abstract)."
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "16. RECOMB 2012",
        "info": "Barcelona, Spain",
        "venues": [
            {
                "sub_name_abbr": "conf/recomb/2012",
                "sub_name": "Research in Computational Molecular Biology - 16th Annual International Conference, RECOMB 2012, Barcelona, Spain, April 21-24, 2012. Proceedings.",
                "count": 37,
                "papers": [
                    "Protein Structure by Semidefinite Facial Reduction.",
                    "Ancestry Inference in Complex Admixtures via Variable-Length Markov Chain Linkage Models.",
                    "Charge Group Partitioning in Biomolecular Simulation.",
                    "Increased Methylation Variation in Epigenetic Domains across Cancer Types.",
                    "Estimating the Accuracy of Multiple Alignments and its Use in Parameter Advising.",
                    "Quantifying the Dynamics of Coupled Networks of Switches and Oscillators.",
                    "lobSTR: A Short Tandem Repeat Profiler for Personal Genomes.",
                    "Hap-seq: An Optimal Algorithm for Haplotype Phasing with Imputation Using Sequencing Data.",
                    "Ballast: A Ball-Based Algorithm for Structural Motifs.",
                    "Evolution of Genome Organization by Duplication and Loss: An Alignment Approach.",
                    "LoopWeaver - Loop Modeling by the Weighted Scaling of Verified Proteins.",
                    "A Robust Method for Transcript Quantification with RNA-seq Data.",
                    "Modeling the Breakage-Fusion-Bridge Mechanism: Combinatorics and Cancer Genomics.",
                    "TrueSight: Self-training Algorithm for Splice Junction Detection Using RNA-seq.",
                    "Synthetic Sequence Design for Signal Location Search.",
                    "The Three-Dimensional Architecture of a Bacterial Genome and Its Alteration by Genetic Perturbation.",
                    "Discovery of Complex Genomic Rearrangements in Cancer Using High-Throughput Sequencing.",
                    "Network-Based Prediction and Analysis of HIV Dependency Factors.",
                    "Structure-Guided Deimmunization of Therapeutic Proteins.",
                    "Evidence for Widespread Association of Mammalian Splicing and Conserved Long-Range RNA Structures.",
                    "Pathset Graphs: A Novel Approach for Comprehensive Utilization of Paired Reads in Genome Assembly.",
                    "Finding Maximum Colorful Subtrees in Practice.",
                    "Recovering the Tree-Like Trend of Evolution Despite Extensive Lateral Genetic Transfer: A Probabilistic Analysis.",
                    "RESQUE: Network Reduction Using Semi-Markov Random Walk Scores for Efficient Querying of Biological Networks (Extended Abstract).",
                    "Detecting SNP-Induced Structural Changes in RNA: Application to Disease Studies.",
                    "A Model for Biased Fractionation after Whole Genome Duplication.",
                    "Exact Pattern Matching for RNA Structure Ensembles.",
                    "Reconstructing Boolean Models of Signaling.",
                    "Alignment-Free Sequence Comparison Based on Next Generation Sequencing Reads: Extended Abstract.",
                    "Differential Oestrogen Receptor Binding is Associated with Clinical Outcome in Breast Cancer.",
                    "Simultaneous Reconstruction of Multiple Signaling Pathways via the Prize-Collecting Steiner Forest Problem.",
                    "Function-Function Correlated Multi-Label Protein Function Prediction over Interaction Networks.",
                    "Predicting Protein-Protein Interactions from Multimodal Biological Data Sources via Nonnegative Matrix Tri-Factorization.",
                    "CNVeM: Copy Number Variation Detection Using Uncertainty of Read Mapping.",
                    "Structure-Based Whole Genome Realignment Reveals Many Novel Non-coding RNAs.",
                    "Probabilistic Inference of Viral Quasispecies Subject to Recombination.",
                    "Simultaneously Learning DNA Motif along with Its Position and Sequence Rank Preferences through EM Algorithm."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "15. RECOMB 2011",
        "info": "Vancouver, BC, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/recomb/2011",
                "sub_name": "Research in Computational Molecular Biology - 15th Annual International Conference, RECOMB 2011, Vancouver, BC, Canada, March 28-31, 2011. Proceedings.",
                "count": 49,
                "papers": [
                    "Bacterial Community Reconstruction Using Compressed Sensing.",
                    "Constrained De Novo Sequencing of Peptides with Application to Conotoxins.",
                    "Metabolic Network Analysis Demystified.",
                    "Causal Reasoning on Biological Networks: Interpreting Transcriptional Changes - (Extended Abstract).",
                    "Hapsembler: An Assembler for Highly Polymorphic Genomes.",
                    "Discovery and Characterization of Chromatin States for Systematic Annotation of the Human Genome.",
                    "Disease Gene Prioritization Based on Topological Similarity in Protein-Protein Interaction Networks.",
                    "Understanding Gene Sequence Variation in the Context of Transcription Regulation in Yeast.",
                    "Identifying Branched Metabolic Pathways by Merging Linear Metabolic Pathways.",
                    "A Probabilistic Model for Sequence Alignment with Context-Sensitive Indels.",
                    "Simultaneous Structural Variation Discovery in Multiple Paired-End Sequenced Genomes.",
                    "Variable Selection through Correlation Sifting.",
                    "Weighted Genomic Distance Can Hardly Impose a Bound on the Proportion of Transpositions.",
                    "PSAR: Measuring Multiple Sequence Alignment Reliability by Probabilistic Sampling - (Extended Abstract).",
                    "Pedigree Reconstruction Using Identity by Descent.",
                    "A Quantitative Model of Glucose Signaling in Yeast Reveals an Incoherent Feed Forward Loop Leading to a Specific, Transient Pulse of Transcription.",
                    "Inferring Mechanisms of Compensation from E-MAP and SGA Data Using Local Search Algorithms for Max Cut.",
                    "IsoLasso: A LASSO Regression Approach to RNA-Seq Based Transcriptome Assembly - (Extended Abstract).",
                    "Haplotype Reconstruction in Large Pedigrees with Many Untyped Individuals.",
                    "Learning Cellular Sorting Pathways Using Protein Interactions and Sequence Motifs.",
                    "A Geometric Arrangement Algorithm for Structure Determination of Symmetric Protein Homo-oligomers from NOEs and RDCs.",
                    "Paired de Bruijn Graphs: A Novel Approach for Incorporating Mate Pair Information into Genome Assemblers.",
                    "An Optimization-Based Sampling Scheme for Phylogenetic Trees.",
                    "Multiplex De Novo Sequencing of Peptide Antibiotics.",
                    "Fractal and Transgenerational Genetic Effects on Phenotypic Variation and Disease Risk.",
                    "AREM: Aligning Short Reads from ChIP-Sequencing by Expectation Maximization.",
                    "Blocked Pattern Matching Problem and Its Applications in Proteomics.",
                    "A Three-Dimensional Model of the Yeast Genome.",
                    "Optimization of Combinatorial Mutagenesis.",
                    "Seeing More Is Knowing More: V3D Enables Real-Time 3D Visualization and Quantitative Analysis of Large-Scale Biological Image Data Sets.",
                    "T-IDBA: A de novo Iterative de Bruijn Graph Assembler for Transcriptome - (Extended Abstract).",
                    "Experiment Specific Expression Patterns.",
                    "Geometric Interpretation of Gene Expression by Sparse Reconstruction of Transcript Profiles.",
                    "A Ribosome Flow Model for Analyzing Translation Elongation - (Extended Abstract).",
                    "Design of Protein-Protein Interactions with a Novel Ensemble-Based Scoring Algorithm.",
                    "Computing Fragmentation Trees from Metabolite Multiple Mass Spectrometry Data.",
                    "Metric Labeling and Semi-metric Embedding for Protein Annotation Prediction.",
                    "Efficient Traversal of Beta-Sheet Protein Folding Pathways Using Ensemble Models.",
                    "Optimally Orienting Physical Networks.",
                    "Opera: Reconstructing Optimal Genomic Scaffolds with High-Throughput Paired-End Sequences.",
                    "Increasing Power of Groupwise Association Test with Likelihood Ratio Test.",
                    "Conservative Extensions of Linkage Disequilibrium Measures from Pairwise to Multi-loci and Algorithms for Optimal Tagging SNP Selection.",
                    "Protein Loop Closure Using Orientational Restraints from NMR Data.",
                    "De Novo Discovery of Mutated Driver Pathways in Cancer.",
                    "An Unbiased Adaptive Sampling Algorithm for the Exploration of RNA Mutational Landscapes under Evolutionary Pressure.",
                    "Nonparametric Combinatorial Sequence Models.",
                    "Algorithms for MDC-Based Multi-locus Phylogeny Inference.",
                    "Rich Parameterization Improves RNA Structure Prediction.",
                    "A Bayesian Approach for Determining Protein Side-Chain Rotamer Conformations Using Unassigned NOE Data."
                ]
            }
        ]
    },
    {
        "year": "2010",
        "name": "14. RECOMB 2010",
        "info": "Lisbon, Portugal",
        "venues": [
            {
                "sub_name_abbr": "conf/recomb/2010",
                "sub_name": "Research in Computational Molecular Biology, 14th Annual International Conference, RECOMB 2010, Lisbon, Portugal, April 25-28, 2010. Proceedings.",
                "count": 42,
                "papers": [
                    "An Algorithmic Framework for Predicting Side-Effects of Drugs.",
                    "SubMAP: Aligning Metabolic Pathways with Subnetwork Mappings.",
                    "Admixture Aberration Analysis: Application to Mapping in Admixed Population Using Pooled DNA.",
                    "Pathway-Based Functional Analysis of Metagenomes.",
                    "Hierarchical Generative Biclustering for MicroRNA Expression Analysis.",
                    "Subnetwork State Functions Define Dysregulated Subnetworks in Cancer.",
                    "Proteome Coverage Prediction for Integrated Proteomics Datasets.",
                    "Discovering Regulatory Overlapping RNA Transcripts.",
                    "Alignment-Free Phylogenetic Reconstruction.",
                    "Inference of Isoforms from Short Sequence Reads.",
                    "The Clark Phase-able Sample Size Problem: Long-Range Phasing and Loss of Heterozygosity in GWAS.",
                    "A New Algorithm for Improving the Resolution of Cryo-EM Density Maps.",
                    "Towards Automated Structure-Based NMR Resonance Assignment.",
                    "Gapped Spectral Dictionaries and Their Applications for Database Searches of Tandem Mass Spectra.",
                    "naiveBayesCall: An Efficient Model-Based Base-Calling Algorithm for High-Throughput Sequencing.",
                    "Extracting Between-Pathway Models from E-MAP Interactions Using Expected Graph Compression.",
                    "Simultaneous Identification of Causal Genes and Dys-Regulated Pathways in Complex Diseases.",
                    "Incremental Signaling Pathway Modeling by Data Integration.",
                    "The Poisson Margin Test for Normalisation Free Significance Analysis of NGS Data.",
                    "Compressing Genomic Sequence Fragments Using SlimGene.",
                    "On the Genealogy of Asexual Diploids.",
                    "Genovo: De Novo Assembly for Metagenomes.",
                    "MoGUL: Detecting Common Insertions and Deletions in a Population.",
                    "Generalized Buneman Pruning for Inferring the Most Parsimonious Multi-state Phylogeny.",
                    "Seed Design Framework for Mapping SOLiD Reads.",
                    "Accurate Estimation of Expression Levels of Homologous Genes in RNA-seq Experiments.",
                    "Cactus Graphs for Genome Comparisons.",
                    "IDBA - A Practical Iterative de Bruijn Graph De Novo Assembler.",
                    "Predicting Nucleosome Positioning Using Multiple Evidence Tracks.",
                    "Dense Subgraphs with Restrictions and Applications to Gene Annotation Graphs.",
                    "Time and Space Efficient RNA-RNA Interaction Prediction via Sparse Folding.",
                    "HLA Type Inference via Haplotypes Identical by Descent.",
                    "Algorithms for Detecting Significantly Mutated Pathways in Cancer.",
                    "Leveraging Sequence Classification by Taxonomy-Based Multitask Learning.",
                    "A Novel Abundance-Based Algorithm for Binning Metagenomic Sequences Using l-Tuples.",
                    "A Markov Random Field Framework for Protein Side-Chain Resonance Assignment.",
                    "Genomic DNA k-mer Spectra: Models and Modalities.",
                    "Deciphering the Swine-Flu Pandemics of 1918 and 2009.",
                    "Distinguishing Direct versus Indirect Transcription Factor-DNA Interactions.",
                    "A Self-regulatory System of Interlinked Signaling Feedback Loops Controls Mouse Limb Patterning.",
                    "Automated High-Dimensional Flow Cytometric Data Analysis.",
                    "Discovering Transcriptional Modules by Combined Analysis of Expression Profiles and Regulatory Sequences."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "13. RECOMB 2009",
        "info": "Tucson, AZ, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/recomb/2009",
                "sub_name": "Research in Computational Molecular Biology, 13th Annual International Conference, RECOMB 2009, Tucson, AZ, USA, May 18-21, 2009. Proceedings.",
                "count": 36,
                "papers": [
                    "Searching Protein 3-D Structures in Linear Time.",
                    "Optimization-Based Peptide Mass Fingerprinting for Protein Mixture Identification.",
                    "Boosting Protein Threading Accuracy.",
                    "New Perspectives on Gene Family Evolution: Losses in Reconciliation and a Link with Supertrees.",
                    "A Probabilistic Graphical Model for Ab Initio Folding.",
                    "Topology-Free Querying of Protein Interaction Networks.",
                    "Cross Species Expression Analysis of Innate Immune Response.",
                    "Haplotype Inference in Complex Pedigrees.",
                    "Storage and Retrieval of Individual Genomes.",
                    "An Online Approach for Mining Collective Behaviors from Molecular Dynamics Simulations.",
                    "Parameter Synthesis in Nonlinear Dynamical Systems: Application to Systems Biology.",
                    "Spatial Clustering of Multivariate Genomic and Epigenomic Information.",
                    "How Many Bootstrap Replicates Are Necessary?",
                    "A Robust Bayesian Two-Sample Test for Detecting Intervals of Differential Gene Expression in Microarray Time Series.",
                    "Incorporating Nucleosomes into Thermodynamic Models of Transcription Regulation.",
                    "Combinatorial Algorithms for Structural Variation Detection in High Throughput Sequenced Genomes.",
                    "Optimizing PCR Assays for DNA Based Cancer Diagnostics.",
                    "The Multi-State Perfect Phylogeny Problem with Missing and Removable Data: Solutions via Integer-Programming and Chordal Graph Theory.",
                    "COE: A General Approach for Efficient Genome-Wide Two-Locus Epistasis Test in Disease Association Study.",
                    "Overlapping Pools for High Throughput Targeted Resequencing.",
                    "Deep Sequencing of a Genetically Heterogeneous Sample: Local Haplotype Reconstruction and Read Error Correction.",
                    "Lifting Prediction to Alignment of RNA Pseudoknots.",
                    "Detection of Locally Over-Represented GO Terms in Protein-Protein Interaction Networks.",
                    "Protein Fragment Swapping: A Method for Asymmetric, Selective Site-Directed Recombination.",
                    "Simultaneous Alignment and Folding of Protein Sequences.",
                    "Shared Peptides in Mass Spectrometry Based Protein Quantification.",
                    "Evaluating Between-Pathway Models with Expression Data.",
                    "Sorting Signed Permutations by Inversions in O(nlogn) Time.",
                    "Finding Biologically Accurate Clusterings in Hierarchical Tree Decompositions Using the Variation of Information.",
                    "Identification and Frequency Estimation of Inversion Polymorphisms from Haplotype Data.",
                    "On the Relationship between DNA Periodicity and Local Chromatin Structure.",
                    "Phylogenies without Branch Bounds: Contracting the Short, Pruning the Deep.",
                    "Detecting the Presence and Absence of Causal Relationships between Expression of Yeast Genes with Very Few Samples.",
                    "An Adaptive and Memory Efficient Algorithm for Genotype Imputation.",
                    "A Statistical Framework for the Functional Analysis of Metagenomes.",
                    "Learning Models for Aligning Protein Sequences with Predicted Secondary Structure."
                ]
            }
        ]
    },
    {
        "year": "2008",
        "name": "12. RECOMB 2008",
        "info": "Singapore",
        "venues": [
            {
                "sub_name_abbr": "conf/recomb/2008",
                "sub_name": "Research in Computational Molecular Biology, 12th Annual International Conference, RECOMB 2008, Singapore, March 30 - April 2, 2008. Proceedings.",
                "count": 41,
                "papers": [
                    "Computational Biology: Its Challenges Past, Present, and Future.",
                    "Bootstrapping the Interactome: Unsupervised Identification of Protein Complexes in Yeast.",
                    "CompostBin: A DNA Composition-Based Algorithm for Binning Environmental Shotgun Reads.",
                    "Reconstructing the Evolutionary History of Complex Human Gene Clusters.",
                    "Ab Initio Whole Genome Shotgun Assembly with Mated Short Reads.",
                    "Orchestration of DNA Methylation.",
                    "BayCis: A Bayesian Hierarchical HMM for Cis-Regulatory Module Decoding in Metazoan Genomes.",
                    "A Combined Expression-Interaction Model for Inferring the Temporal Activity of Transcription Factors.",
                    "A Fast, Alignment-Free, Conservation-Based Method for Transcription Factor Binding Site Discovery.",
                    "The Statistical Power of Phylogenetic Motif Models.",
                    "Transcriptional Regulation and Cancer Genomics.",
                    "Automatic Recognition of Cells (ARC) for 3D Images of C. elegans.",
                    "Spectrum Fusion: Using Multiple Mass Spectra for De Novo Peptide Sequencing.",
                    "A Fragmentation Event Model for Peptide Identification by Mass Spectrometry.",
                    "A Bayesian Approach to Protein Inference Problem in Shotgun Proteomics.",
                    "De Novo Sequencing of Nonribosomal Peptides.",
                    "Systems Metabolic Engineering.",
                    "Protein Function Prediction Based on Patterns in Biological Networks.",
                    "Automatic Parameter Learning for Multiple Network Alignment.",
                    "An Integrative Network Approach to Map the Transcriptome to the Phenome.",
                    "Fast and Accurate Alignment of Multiple Protein Networks.",
                    "High-Resolution Modeling of Cellular Signaling Networks.",
                    "At the Origin of Life: How Did Folded Proteins Evolve?",
                    "Locating Multiple Gene Duplications through Reconciled Trees.",
                    "Rapid and Accurate Protein Side Chain Prediction with Local Backbone Information.",
                    "Algorithms for Joint Optimization of Stability and Diversity in Planning Combinatorial Libraries of Chimeric Proteins.",
                    "DLIGHT - Lateral Gene Transfer Detection Using Pairwise Evolutionary Distances in a Statistical Framework.",
                    "Computation of Median Gene Clusters.",
                    "BCL-2: From Translocation to Therapy.",
                    "Detecting Disease-Specific Dysregulated Pathways Via Analysis of Clinical Expression Profiles.",
                    "Constructing Treatment Portfolios Using Affinity Propagation.",
                    "Bubbles: Alternative Splicing Events of Arbitrary Dimension in Splicing Graphs.",
                    "More Efficient Algorithms for Closest String and Substring Problems.",
                    "Disruption of a Transcriptional Regulatory Pathway Contributes to Phenotypes in Carriers of Ataxia Telangiectasia.",
                    "Accounting for Non-genetic Factors Improves the Power of eQTL Studies.",
                    "Effects of Genetic Divergence in Identifying Ancestral Origin Using HAPAA.",
                    "On the Inference of Ancestries in Admixed Populations.",
                    "Increasing Power in Association Studies by Using Linkage Disequilibrium Structure and Molecular Function as Prior Information.",
                    "Panel Construction for Mapping in Admixed Populations Via Expected Mutual Information.",
                    "Constructing Level-2 Phylogenetic Networks from Triplets.",
                    "Accurate Computation of Likelihoods in the Coalescent with Recombination Via Parsimony."
                ]
            }
        ]
    },
    {
        "year": "2007",
        "name": "11. RECOMB 2007",
        "info": "Oakland, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/recomb/2007",
                "sub_name": "Research in Computational Molecular Biology, 11th Annual International Conference, RECOMB 2007, Oakland, CA, USA, April 21-25, 2007, Proceedings.",
                "count": 37,
                "papers": [
                    "QNet: A Tool for Querying Protein Interaction Networks.",
                    "Pairwise Global Alignment of Protein Interaction Networks by Matching Neighborhood Topology.",
                    "Reconstructing the Topology of Protein Complexes.",
                    "Network Legos: Building Blocks of Cellular Wiring Diagrams.",
                    "An Efficient Method for Dynamic Analysis of Gene Regulatory Networks and in silico Gene Perturbation Experiments.",
                    "A Feature-Based Approach to Modeling Protein-DNA Interactions.",
                    "Network Motif Discovery Using Subgraph Enumeration and Symmetry-Breaking.",
                    "Nucleosome Occupancy Information Improves de novo Motif Discovery.",
                    "Framework for Identifying Common Aberrations in DNA Copy Number Data.",
                    "Estimating Genome-Wide Copy Number Using Allele Specific Mixture Models.",
                    "GIMscan: A New Statistical Method for Analyzing Whole-Genome Array CGH Data.",
                    "Production-Passage-Time Approximation: A New Approximation Method to Accelerate the Simulation Process of Enzymatic Reactions.",
                    "Shift-Invariant Adaptive Double Threading: Learning MHC II - Peptide Binding.",
                    "Reconstructing the Phylogeny of Mobile Elements.",
                    "Beyond Galled Trees - Decomposition and Computation of Galled Networks.",
                    "Variational Upper Bounds for Probabilistic Phylogenetic Models.",
                    "Heuristics for the Gene-Duplication Problem: A Theta ( n ) Speed-Up for the Local Search.",
                    "Support Vector Training of Protein Alignment Models.",
                    "Tools for Simulating and Analyzing RNA Folding Kinetics.",
                    "Multiple Sequence Alignment Based on Profile Alignment of Intermediate Sequences.",
                    "Connectedness Profiles in Protein Networks for the Analysis of Gene Expression Data.",
                    "Multivariate Segmentation in the Analysis of Transcription Tiling Array Data.",
                    "A Bayesian Model That Links Microarray mRNA Measurements to Mass Spectrometry Protein Measurements.",
                    "Rearrangements in Genomes with Centromeres Part I: Translocations.",
                    "Identification of Deletion Polymorphisms from Haplotypes.",
                    "Free Energy Estimates of All-Atom Protein Structures Using Generalized Belief Propagation.",
                    "Minimizing and Learning Energy Functions for Side-Chain Prediction.",
                    "Protein Conformational Flexibility Analysis with Noisy Data.",
                    "Deterministic Pharmacophore Detection Via Multiple Flexible Alignment of Drug-Like Molecules.",
                    "Design of Compact, Universal DNA Microarrays for Protein Binding Microarray Experiments.",
                    "Improved Ranking Functions for Protein and Modification-Site Identifications.",
                    "Peptide Retention Time Prediction Yields Improved Tandem Mass Spectrum Identification for Diverse Chromatography Conditions.",
                    "A Fast and Accurate Algorithm for the Quantification of Peptides from Mass Spectrometry Data.",
                    "Association Mapping of Complex Diseases with Ancestral Recombination Graphs: Models and Efficient Algorithms.",
                    "An Efficient and Accurate Graph-Based Approach to Detect Population Substructure.",
                    "RB-Finder: An Improved Distance-Based Sliding Window Method to Detect Recombination Breakpoints.",
                    "Comparative Analysis of Spatial Patterns of Gene Expression in Drosophila melanogaster Imaginal Discs."
                ]
            }
        ]
    },
    {
        "year": "2006",
        "name": "10. RECOMB 2006",
        "info": "Venice, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/recomb/2006",
                "sub_name": "Research in Computational Molecular Biology, 10th Annual International Conference, RECOMB 2006, Venice, Italy, April 2-5, 2006, Proceedings.",
                "count": 48,
                "papers": [
                    "Integrated Protein Interaction Networks for 11 Microbes.",
                    "Hypergraph Model of Multi-residue Interactions in Proteins: Sequentially-Constrained Partitioning Algorithms for Optimization of Site-Directed Protein Recombination.",
                    "Biological Networks: Comparison, Conservation, and Evolutionary Trees.",
                    "Assessing Significance of Connectivity and Conservation in Protein Interaction Networks.",
                    "Clustering Short Gene Expression Profiles.",
                    "A Patient-Gene Model for Temporal Expression Profiles in Clinical Studies.",
                    "Global Interaction Networks Probed by Mass Spectrometry.",
                    "Statistical Evaluation of Genome Rearrangement.",
                    "An Improved Statistic for Detecting Over-Represented Gene Ontology Annotations in Gene Sets.",
                    "Protein Function Annotation Based on Ortholog Clusters Extracted from Incomplete Genomes Using Combinatorial Optimization.",
                    "Detecting MicroRNA Targets by Linking Sequence, MicroRNA and Gene Expression Data.",
                    "RNA Secondary Structure Prediction Via Energy Density Minimization.",
                    "Structural Alignment of Pseudoknotted RNA.",
                    "Stan Ulam and Computational Biology.",
                    "CONTRAlign: Discriminative Training for Protein Sequence Alignment.",
                    "Clustering Near-Identical Sequences for Fast Homology Search.",
                    "New Methods for Detecting Lineage-Specific Selection.",
                    "A Probabilistic Model for Gene Content Evolution with Duplication, Loss, and Horizontal Transfer.",
                    "A Sublinear-Time Randomized Approximation Scheme for the Robinson-Foulds Metric.",
                    "Algorithms to Distinguish the Role of Gene-Conversion from Single-Crossover Recombination in the Derivation of SNP Sequences in Populations.",
                    "Inferring Common Origins from mtDNA.",
                    "Efficient Enumeration of Phylogenetically Informative Substrings.",
                    "Phylogenetic Profiling of Insertions and Deletions in Vertebrate Genomes.",
                    "Maximal Accurate Forests from Distance Matrices.",
                    "Leveraging Information Across HLA Alleles/Supertypes Improves Epitope Prediction.",
                    "Improving Prediction of Zinc Binding Sites by Modeling the Linkage Between Residues Close in Sequence.",
                    "An Important Connection Between Network Motifs and Parsimony Models.",
                    "Ultraconserved Elements, Living Fossil Transposons, and Rapid Bursts of Change: Reconstructing the Uneven Evolutionary History of the Human Genome.",
                    "Permutation Filtering: A Novel Concept for Significance Analysis of Large-Scale Genomic Data.",
                    "Genome-Wide Discovery of Modulators of Transcriptional Interactions in Human B Lymphocytes.",
                    "A New Approach to Protein Identification.",
                    "Markov Methods for Hierarchical Coarse-Graining of Large Protein Dynamics.",
                    "Simulating Protein Motions with Rigidity Analysis.",
                    "Predicting Experimental Quantities in Protein Folding Kinetics Using Stochastic Roadmap Simulation.",
                    "An Outsider's View of the Genome.",
                    "Alignment Statistics for Long-Range Correlated Genomic Sequences.",
                    "Simple and Fast Inverse Alignment.",
                    "Revealing the Proteome Complexity by Mass Spectrometry.",
                    "Motif Yggdrasil: Sampling from a Tree Mixture Model.",
                    "A Study of Accessible Motifs and RNA Folding Complexity.",
                    "A Parameterized Algorithm for Protein Structure Alignment.",
                    "Geometric Sieving: Automated Distributed Optimization of 3D Motifs for Protein Function Prediction.",
                    "A Branch-and-Reduce Algorithm for the Contact Map Overlap Problem.",
                    "A Novel Minimized Dead-End Elimination Criterion and Its Application to Protein Redesign in a Hybrid Scoring and Search Algorithm for Computing Partition Functions over Molecular Ensembles.",
                    "10 Years of the International Conference on Research in Computational Molecular Biology (RECOMB).",
                    "Sorting by Weighted Reversals, Transpositions, and Inverted Transpositions.",
                    "A Parsimony Approach to Genome-Wide Ortholog Assignment.",
                    "Detecting the Dependent Evolution of Biosequences."
                ]
            },
            {
                "sub_name_abbr": "conf/recomb/2006sbcp",
                "sub_name": "Systems Biology and Computational Proteomics, Joint RECOMB 2006 Satellite Workshops on Systems Biology and on Computational Proteomics, San Diego, CA, USA, December 1-3, 2006, Revised Selected Papers.",
                "count": 9,
                "papers": [
                    "Not All Scale Free Networks Are Born Equal: The Role of the Seed Graph in PPI Network Emulation.",
                    "Probabilistic Paths for Protein Complex Inference.",
                    "Markov Additive Chains and Applications to Fragment Statistics for Peptide Mass Fingerprinting.",
                    "A Context-Specific Network of Protein-DNA and Protein-Protein Interactions Reveals New Regulatory Motifs in Human B Cells.",
                    "Identification and Evaluation of Functional Modules in Gene Co-expression Networks.",
                    "A Linear Discrete Dynamic System Model for Temporal Gene Interaction and Regulatory Network Influence in Response to Bioethanol Conversion Inhibitor HMF for Ethanologenic Yeast.",
                    "A Computational Approach for the Identification of Site-Specific Protein Glycosylations Through Ion-Trap Mass Spectrometry.",
                    "De Novo Signaling Pathway Predictions Based on Protein-Protein Interaction, Targeted Therapy and Protein Microarray Analysis.",
                    "Alignment of Mass Spectrometry Data by Clique Finding and Optimization."
                ]
            }
        ]
    },
    {
        "year": "2005",
        "name": "9. RECOMB 2005",
        "info": "Cambridge, MA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/recomb/2005",
                "sub_name": "Research in Computational Molecular Biology, 9th Annual International Conference, RECOMB 2005, Cambridge, MA, USA, May 14-18, 2005, Proceedings.",
                "count": 47,
                "papers": [
                    "Efficient Algorithms for Detecting Signaling Pathways in Protein Interaction Networks.",
                    "Towards an Integrated Protein-Protein Interaction Network.",
                    "The Factor Graph Network Model for Biological Systems.",
                    "Pairwise Local Alignment of Protein Interaction Networks Guided by Models of Evolution.",
                    "Finding Novel Transcripts in High-Resolution Genome-Wide Microarray Data Using the GenRate Model.",
                    "Efficient Calculation of Interval Scores for DNA Copy Number Data Analysis.",
                    "A Regulatory Network Controlling Drosophila Development.",
                    "Yeast Cells as a Discovery Platform for Neurodegenerative Disease.",
                    "RIBRA-An Error-Tolerant Algorithm for the NMR Backbone Assignment Problem.",
                    "Avoiding Local Optima in Single Particle Reconstruction.",
                    "A High-Throughput Approach for Associating microRNAs with Their Activity Conditions.",
                    "RNA-RNA Interaction Prediction and Antisense RNA Target Search.",
                    "Consensus Folding of Unaligned RNA Sequences Revisited.",
                    "Discovery and Annotation of Genetic Modules.",
                    "Efficient q-Gram Filters for Finding All epsilon-Matches over a Given Length.",
                    "A Polynomial Time Solvable Formulation of Multiple Sequence Alignment.",
                    "A Fundamental Decomposition Theory for Phylogenetic Networks and Incompatible Characters.",
                    "Reconstruction of Reticulate Networks from Gene Trees.",
                    "A Hybrid Micro-Macroevolutionary Approach to Gene Tree Reconstruction.",
                    "Constructing a Smallest Refining Galled Phylogenetic Network.",
                    "Mapping Molecular Landscapes Inside Cells.",
                    "Information Theoretic Approaches to Whole Genome Phylogenies.",
                    "Maximum Likelihood of Evolutionary Trees Is Hard.",
                    "Graph Theoretical Insights into Evolution of Multidomain Proteins.",
                    "Peptide Sequence Tags for Fast Database Search in Mass-Spectrometry.",
                    "A Hidden Markov Model Based Scoring Function for Mass Spectrometry Database Search.",
                    "EigenMS: De Novo Analysis of Peptide Tandem Mass Spectra by Spectral Graph Partitioning.",
                    "Biology as Information.",
                    "Using Multiple Alignments to Improve Gene Prediction.",
                    "Learning Interpretable SVMs for Biological Sequence Classification.",
                    "Segmentation Conditional Random Fields (SCRFs): A New Approach for Protein Fold Recognition.",
                    "Rapid Protein Side-Chain Packing via Tree Decomposition.",
                    "Recognition of Binding Patterns Common to a Set of Protein Structures.",
                    "Predicting Protein-Peptide Binding Affinity by Learning Peptide-Peptide Distance Functions.",
                    "Amino Acid Sequence Control of the Folding of the Parallel beta-Helix, the Simplest beta-Sheet Fold.",
                    "A Practical Approach to Significance Assessment in Alignment with Gaps.",
                    "Alignment of Optical Maps.",
                    "Engineering Gene Regulatory Networks: A Reductionist Approach to Systems Biology.",
                    "Modeling the Combinatorial Functions of Multiple Transcription Factors.",
                    "Predicting Transcription Factor Binding Sites Using Structural Knowledge.",
                    "Motif Discovery Through Predictive Modeling of Gene Regulation.",
                    "HAPLOFREQ - Estimating Haplotype Frequencies E.ciently.",
                    "Improved Recombination Lower Bounds for Haplotype Data.",
                    "A Linear-Time Algorithm for the Perfect Phylogeny Haplotyping (PPH) Problem.",
                    "Human Genome Sequence Variation and the Inherited Basis of Common Disease.",
                    "Stability of Rearrangement Measures in the Comparison of Genome Sequences.",
                    "On Sorting by Translocations."
                ]
            },
            {
                "sub_name_abbr": "conf/recomb/2005sbrg",
                "sub_name": "Systems Biology and Regulatory Genomics, Joint Annual RECOMB 2005 Satellite Workshops on Systems Biology and on Regulatory Genomics, San Diego, CA, USA; December 2-4, 2005, Revised Selected Papers.",
                "count": 21,
                "papers": [
                    "An Interactive Map of Regulatory Networks of Pseudomonas aeruginosa Genome.",
                    "The Pathalyzer: A Tool for Analysis of Signal Transduction Pathways.",
                    "Decomposition of Overlapping Protein Complexes: A Graph Theoretical Method for Analyzing Static and Dynamic Protein Associations.",
                    "Comparison of Protein-Protein Interaction Confidence Assignment Schemes.",
                    "Characterization of the Effects of TF Binding Site Variations on Gene Expression Towards Predicting the Functional Outcomes of Regulatory SNPs.",
                    "Comparative Systems Biology of the Sporulation Initiation Network in Prokaryotes.",
                    "Improvement of Computing Times in Boolean Networks Using Chi-square Tests.",
                    "Build a Dictionary, Learn a Grammar, Decipher Stegoscripts, and Discover Genomic Regulatory Elements.",
                    "Causal Inference of Regulator-Target Pairs by Gene Mapping of Expression Phenotypes.",
                    "Examination of the tRNA Adaptation Index as a Predictor of Protein Expression Levels.",
                    "Improved Duplication Models for Proteome Network Evolution.",
                    "Application of Expectation Maximization Clustering to Transcription Factor Binding Positions for cDNA Microarray Analysis.",
                    "Combinatorial Genetic Regulatory Network Analysis Tools for High Throughput Transcriptomic Data.",
                    "Topological Robustness of the Protein-Protein Interaction Networks.",
                    "A Bayesian Approach for Integrating Transcription Regulation and Gene Expression: Application to Saccharomyces Cerevisiae Cell Cycle Data.",
                    "Probabilistic in Silico Prediction of Protein-Peptide Interactions.",
                    "Improved Pattern-Driven Algorithms for Motif Finding in DNA Sequences.",
                    "Annotation of Promoter Regions in Microbial Genomes Based on DNA Structural and Sequence Properties.",
                    "An Interaction-Dependent Model for Transcription Factor Binding.",
                    "Computational Characterization and Identification of Core Promoters of MicroRNA Genes in C. elegans , H. sapiens and A. thaliana.",
                    "A Comprehensive Kinetic Model of the Exocytotic Process: Evaluation of the Reaction Mechanism."
                ]
            }
        ]
    },
    {
        "year": "2004",
        "name": "8. RECOMB 2004",
        "info": "San Diego, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/recomb/2004",
                "sub_name": "Proceedings of the Eighth Annual International Conference on Computational Molecular Biology, 2004, San Diego, California, USA, March 27-31, 2004.",
                "count": 47,
                "papers": [
                    "SNPing in the human genome.",
                    "Maximum likelihood resolution of multi-block genotypes.",
                    "Perfect phylogeny and haplotype assignment.",
                    "An exact solution for finding minimum recombinant haplotype configurations on pedigrees with missing data by integer linear programming.",
                    "Chromosomal breakpoint re-use in the inference of genome sequence rearrangement.",
                    "Learning multiple evolutionary pathways from cross-sectional data.",
                    "Algorithms for inferring cis-regulatory structures and protein interaction networks.",
                    "A novel ensemble-based scoring and search algorithm for protein redesign, and its application to modify the substrate specificity of the gramicidin synthetase a phenylalanine adenylation enzyme.",
                    "A random graph approach to NMR sequential assignment.",
                    "Finding short DNA motifs using permuted markov models.",
                    "Designing multiple simultaneous seeds for DNA similarity search.",
                    "Aligning alignments exactly.",
                    "Systems biology and malaria.",
                    "Stochastic models inspired by hybridization theory for short oligonucleotide arrays.",
                    "Checking homogeneity of motifs' distribution in heterogenous sequences.",
                    "From profiles to patterns and back again: a branch and bound algorithm for finding near optimal motif profiles.",
                    "Finding motifs for insufficient number of sequences with strong binding to transcription facto.",
                    "Structured motifs search.",
                    "Evolutionary change in developmental genetic networks.",
                    "A discriminative model for identifying spatial cis-regulatory modules.",
                    "Discovering temporal relations in molecular pathways using protein-protein interactions.",
                    "Comparing in situ mRNA expression patterns of drosophila embryos.",
                    "Probabilistic discovery of overlapping cellular processes and their regulation.",
                    "Computational identification of evolutionarily conserved exons.",
                    "Multiple organism gene finding by collapsed gibbs sampling.",
                    "Somatic evolution of cancer.",
                    "Protein similarity from knot theory and geometric convolution.",
                    "Interface surfaces for protein-protein complexes.",
                    "De novo repeat classification and fragment assembly.",
                    "Finding approximate tandem repeats in genomic sequences.",
                    "Finding anchors for genomic sequence comparison.",
                    "RNAi, genome ultrastructure, and other unexpected tales from the analysis of genetic silencing.",
                    "Faster genome annotation of non-coding RNA families without loss of accuracy.",
                    "Using motion planning to study RNA folding kinetics.",
                    "A class of edit kernels for SVMs to predict translation initiation sites in eukaryotic mRNAs.",
                    "Identifying conserved gene clusters in the presence of orthologous groups.",
                    "Fifty years of sequence analysis: what have we learned?",
                    "Identification of protein complexes by comparative analysis of yeast and bacterial protein interaction data.",
                    "The evolutionary capacity of protein structures.",
                    "Wrap-and-pack: a new paradigm for beta structural motif recognition with application to recognizing beta trefoils.",
                    "Mining protein family specific residue packing patterns from protein structure graphs.",
                    "Reconciliation problems for duplication, loss and horizontal gene transfer.",
                    "Gene tree reconstruction and orthology analysis based on an integrated model for duplications and sequence evolution.",
                    "A structural perspective on genome evolution.",
                    "Reconstructing reticulate evolution in species: theory and practice.",
                    "Simultaneous identification of duplications and lateral transfers.",
                    "Recent advances on the manipulation of single biomolecules."
                ]
            },
            {
                "sub_name_abbr": "conf/recomb/2004rrg",
                "sub_name": "Regulatory Genomics, RECOMB 2004 International Workshop, RRG 2004, San Diego, CA, USA, March 26-27, 2004, Revised Selected Papers.",
                "count": 10,
                "papers": [
                    "Predicting Genetic Regulatory Response Using Classification: Yeast Stress Response.",
                    "Detecting Functional Modules of Transcription Factor Binding Sites in the Human Genome.",
                    "Fishing for Proteins in the Pacific Northwest.",
                    "PhyloGibbs: A Gibbs Sampler Incorporating Phylogenetic Information.",
                    "Application of Kernel Method to Reveal Subtypes of TF Binding Motifs.",
                    "Learning Regulatory Network Models that Represent Regulator States and Roles.",
                    "Using Expression Data to Discover RNA and DNA Regulatory Sequence Motifs.",
                    "Parameter Landscape Analysis for Common Motif Discovery Programs.",
                    "Inferring Cis-region Hierarchies from Patterns in Time-Course Gene Expression Data.",
                    "Modeling and Analysis of Heterogeneous Regulation in Biological Networks."
                ]
            }
        ]
    },
    {
        "year": "2003",
        "name": "7. RECOMB 2003",
        "info": "Berlin, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/recomb/2003",
                "sub_name": "Proceedings of the Sventh Annual International Conference on Computational Biology, RECOMB 2003, Berlin, Germany, April 10-13, 2003.",
                "count": 44,
                "papers": [
                    "Efficient extraction of mapping rules of atoms from enzymatic reaction data.",
                    "On de novo interpretation of tandem mass spectra for peptide identification.",
                    "Haplotypes and informative SNP selection algorithms: don't block out information.",
                    "Modeling dependencies in protein-DNA binding sites.",
                    "Efficient exact value computation and applications to biosequence analysis.",
                    "Towards optimally multiplexed applications of universal DNA tag systems.",
                    "A comparative analysis method for detecting binding sites in coding regions.",
                    "Designing seeds for similarity search in genomic DNA.",
                    "Maximum likelihood on four taxa phylogenetic trees: analytic solutions.",
                    "Phylogenetically and spatially conserved word pairs associated with gene expression changes in yeasts.",
                    "Haplotype phase inference.",
                    "An integrated probabilistic model for functional prediction of proteins.",
                    "Large scale reconstruction of haplotypes from genotype data.",
                    "Optimizing exact genetic linkage computations.",
                    "Combinatorial synthesis on macroscopic solid support units.",
                    "Finding recurrent sources in sequences.",
                    "Model-based inference of haplotype block variation.",
                    "Computational analysis of the human and other mammalian genomes.",
                    "Accurate detection of very sparse sequence motifs.",
                    "Engineering a scalable placement heuristic for DNA probe arrays.",
                    "Whole-genome comparative annotation and regulatory motif discovery in multiple yeast species.",
                    "Joint classifier and feature optimization for cancer diagnosis using gene expression data.",
                    "Large a polynomial-time nuclear vector replacement algorithm for automated NMR resonance assignments.",
                    "A complete and effective move set for simplified protein folding.",
                    "Invited: Prediction of protein function.",
                    "Efficient rule-based haplotyping algorithms for pedigree data.",
                    "Haplotype reconstruction from SNP alignment.",
                    "Gene selection criterion for discriminant microarray data analysis based on extreme value distributions.",
                    "A multi-expert system for the automatic detection of protein domains from sequence information.",
                    "Invited.",
                    "Biology and bioinformatics of halophilism.",
                    "Resolution of haplotypes and haplotype frequencies from SNP genotypes of pooled samples.",
                    "Transforming men into mice: the Nadeau-Taylor chromosomal breakage model revisited.",
                    "Scoring two-species local alignments to try to statistically separate neutrally evolving from selected DNA segments.",
                    "Approximation of protein structure for fast similarity measures.",
                    "Combining phylogenetic and hidden Markov models in biosequence analysis.",
                    "Low-level analyses of microarray data.",
                    "Invited.",
                    "Using a mixture of probabilistic decision trees for direct prediction of protein function.",
                    "Modeling transcription programs: inferring binding site activity and dose-response model optimization.",
                    "Poetry and prose of the sequences.",
                    "Physical network models and multi-source data integration.",
                    "Maximum entropy modeling of short sequence motifs with applications to RNA splicing signals.",
                    "Dynamic programming algorithms for haplotype block partitioning: applications to human chromosome 21 haplotype data."
                ]
            }
        ]
    },
    {
        "year": "2002",
        "name": "6. RECOMB 2002",
        "info": "Washington, DC, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/recomb/2002",
                "sub_name": "Proceedings of the Sixth Annual International Conference on Computational Biology, RECOMB 2002, Washington, DC, USA, April 18-21, 2002.",
                "count": 43,
                "papers": [
                    "Computational structural proteomics and virtual ligand screening.",
                    "Using motion planning to map protein folding landscapes and analyze folding kinetics of known native structures.",
                    "Stochastic roadmap simulation: an efficient representation and algorithm for analyzing molecular motion.",
                    "Monotony of surprise and large-scale quest for unusual words.",
                    "DNA sequence evolution with neighbor-dependent mutation.",
                    "A new approach to analyzing gene expression time series data.",
                    "Discovering local structure in gene expression data: the order-preserving submatrix problem.",
                    "The restriction scaffold problem.",
                    "Comparison of minisatellites.",
                    "Trilogy: discovery of sequence-structure patterns across diverse proteins.",
                    "Microarray analysis of vertebrate embryonic neural induction.",
                    "Provably sensitive Indexing strategies for biosequence similarity search.",
                    "Structural alignment of large-size proteins via lagrangian relaxation.",
                    "Designing RNA structures: natural and artificial selection.",
                    "Inferring domain-domain interactions from protein-protein interactions.",
                    "Analysis of gene expression profiles: class discovery and leaf ordering.",
                    "A bayesian approach to transcript estimation from gene array data: the BEAM technique.",
                    "Tests for gene clustering.",
                    "Recent duplication, evolution and assembly of the human genome.",
                    "Approximate matching of secondary structures.",
                    "Applied computational genomics: polymorphism prediction, data mining and genomic analysis.",
                    "Haplotyping as perfect phylogeny: conceptual framework and efficient solutions.",
                    "Handling long targets and errors in sequencing by hybridization.",
                    "Sequencing by hybridization using direct and reverse cooperating spectra.",
                    "Lymphocyte turnover in HIV-1 infection and the role of the thymus in SIV infection.",
                    "Finding motifs in the twilight zone.",
                    "Phase-independent rhythmic analysis of genome-wide expression patterns.",
                    "Significance Of inter-species matches when evolutionary rate varies.",
                    "Combining pairwise sequence similarity and support vector machines for remote protein homology detection.",
                    "Revealing protein structures: a new method for mapping antibody epitopes.",
                    "Set association analysis of SNP case-control and microarray data.",
                    "Picking alignments from (steiner) trees.",
                    "String barcoding: uncovering optimal virus signatures.",
                    "Biological and computational annotation of the Drosophila Genome Sequence.",
                    "From promoter sequence to expression: a probabilistic framework.",
                    "Probabilistic hierarchical clustering for biological data.",
                    "An algorithm to enumerate all sorting reversals.",
                    "Discriminative motifs.",
                    "A dimensionality reduction approach to modeling protein flexibility.",
                    "Sequencing the human genome.",
                    "Toward a proteome atlas for C. Elegans.",
                    "Deconvolving sequence variation in mixed DNA populations.",
                    "Microarrays: how many do you need?"
                ]
            },
            {
                "sub_name_abbr": "conf/recomb/2002snp",
                "sub_name": "Computational Methods for SNPs and Haplotype Inference, DIMACS/RECOMB Satellite Workshop, Piscataway, NJ, USA, November 21-22, 2002, Revised Papers.",
                "count": 10,
                "papers": [
                    "Trisomic Phase Inference.",
                    "An Overview of Combinatorial Methods for Haplotype Inference.",
                    "A Survey of Computational Methods for Determining Haplotypes.",
                    "Haplotype Inference and Its Application in Linkage Disequilibrium Mapping.",
                    "Inferring Piecewise Ancestral History from Haploid Sequences.",
                    "Haplotype Blocks in Small Populations.",
                    "Simulating a Coalescent Process with Recombination and Ascertainment.",
                    "Dynamic Programming Algorithms for Haplotype Block Partitioning and Tag SNP Selection Using Haplotype Data or Genotype Data.",
                    "Parametric Bootstrap for Assessment of Goodness of Fit of Models for Block Haplotype Structure.",
                    "A Coalescent-Based Approach for Complex Disease Mapping."
                ]
            }
        ]
    },
    {
        "year": "2001",
        "name": "5. RECOMB 2001",
        "info": "Montréal, Québec, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/recomb/2001",
                "sub_name": "Proceedings of the Fifth Annual International Conference on Computational Biology, RECOMB 2001, Montréal, Québec, Canada, April 22-25, 2001.",
                "count": 44,
                "papers": [
                    "The sequence of the human genome (abstract only).",
                    "A new approach to sequence comparison: normalized sequence alignment.",
                    "Context-specific Bayesian clustering for gene expression data.",
                    "An optimal procedure for gap closing in whole genome shotgun sequencing.",
                    "Class discovery in gene expression data.",
                    "On the predictive power of sequence similarity in yeast.",
                    "Algorithms for phylogenetic footprinting.",
                    "Predicting the beta-helix fold from protein sequence data.",
                    "Information processing by cells and biologists (abstract only).",
                    "Finding motifs using random projections.",
                    "Rapid significance estimation in local sequence alignment with gaps.",
                    "Regulatory element detection using correlation with expression (abstract only).",
                    "Gene-finding via tandem mass spectrometry.",
                    "Algorithms for identifying protein cross-links via tandem mass spectrometry.",
                    "Hunger for new technologies, metrics, and spatiotemporal models in functional genomic (abstract only).",
                    "Fast recovery of evolutionary trees with thousands of nodes.",
                    "Geometric algorithms for the analysis of 2D-electrophoresis gels.",
                    "Analysis techniques for microarray time-series data.",
                    "A structural EM algorithm for phylogenetic inference.",
                    "Optimal sequencing by hybridization in rounds.",
                    "Efficient algorithms for lateral gene transfer problems.",
                    "The greedy path-merging algorithm for sequence assembly.",
                    "Extracting structural information using time-frequency analysis of protein NMR data.",
                    "Separtating repeats in DNA sequence assembly.",
                    "A NMR-spectra-based scoring function for protein docking.",
                    "101 optimal PDB structure alignments: a branch-and-cut algorithm for the maximum contact map overlap problem.",
                    "Comparative analysis of organelle genomes, a biologist's view of computational challenges (abstract only).",
                    "DNA segmentation as a model selection process.",
                    "Edit distance between two RNA structures.",
                    "Genetics and genemoics: impact on drug discovery and development.",
                    "The role of computational chemistry in translating genomic information into bioactive small molecules (abstract only).",
                    "Comparing sequence scaffolds.",
                    "Fast and simple character classes and bounded gaps pattern matching, with application to protein searching.",
                    "Applications of generalized pair hidden Markov models to alignment and gene finding problems.",
                    "Gene functional classification from heterogeneous data.",
                    "A new approach to fragment assembly in DNA sequencing.",
                    "Imposing specificity by regulated localization (abstract only).",
                    "Large scale sequencing by hybridization.",
                    "RNA biology and the genome (abstract only).",
                    "Towards predicting coiled-coil protein interactions.",
                    "Using motion planning to study protein folding pathways.",
                    "Zinc finger gene clusters and tandem gene duplication.",
                    "A Gibbs sampling method to detect over-represented motifs in the upstream regions of co-expressed genes.",
                    "Creating the backbone for the virtual cell: cell mapping projects on the run (abstract only)."
                ]
            }
        ]
    },
    {
        "year": "2000",
        "name": "4. RECOMB 2000",
        "info": "Tokyo, Japan",
        "venues": [
            {
                "sub_name_abbr": "conf/recomb/2000",
                "sub_name": "Proceedings of the Fourth Annual International Conference on Computational Molecular Biology, RECOMB 2000, Tokyo, Japan, April 8-11, 2000.",
                "count": 44,
                "papers": [
                    "On approximation algorithms for local multiple alignment.",
                    "Algorithms for identifying Boolean networks and related biological networks based on matrix multiplication and fingerprint function.",
                    "A combinatorial approach to protein docking with flexible side-chains.",
                    "Optimal amnesic probabilistic automata or how to learn and classify proteins in linear time and space.",
                    "The NOESY jigsaw: automated protein secondary structure and main-chain assignment from sparse, unassigned NMR data.",
                    "Sequencing a genome by walking with clone-end sequences: a mathematical analysis (abstract).",
                    "Human and mouse gene structure: comparative analysis and application to exon prediction.",
                    "Tissue classification with gene expression profiles.",
                    "Universal DNA tag systems: a combinatorial design scheme.",
                    "Comprehensive statistical method for protein fold recognition.",
                    "An analytic approach to significance assessment in local sequence alignment with gaps.",
                    "Notung: dating gene duplications using gene family trees.",
                    "A compression algorithm for DNA sequences and its applications in genome comparison.",
                    "Multiple maxima of likelihood in phylogenetic trees: an analytic approach.",
                    "Tree fitting: an algebraic approach using profile distances.",
                    "Using Bayesian networks to analyze expression data.",
                    "Invited presentation: introns and modules in ancient conserved genes (abstract only).",
                    "Evolutionary features of genomes as disclosed by comparative analysis of complete genome sequences (abstract only).",
                    "New algorithms for the duplication-loss model.",
                    "Systematic and automated discovery of patterns in PROSITE families.",
                    "Contig selection in physical mapping.",
                    "A data-analysis pipeline for large-scale gene expression analysis.",
                    "Computing life and global technologies (abstract only).",
                    "DNA sequence variation among humans and apes (abstract only).",
                    "Sequence comparison to graph comparison--a new generation of algorithms for network analysis of interacting molecules (abstract only).",
                    "Optimizing for success: a new score function for distantly related protein sequence comparison.",
                    "Reconstructing distances in physical maps of chromosomes with nonoverlapping probes.",
                    "UNRES: a united-residue force field for energy-based prediction of protein structure - orgin and significance of multibody terms.",
                    "Pseudoknots in RNA secondary structures.",
                    "Extracting structured motifs using a suffix tree - algorithms and application to promoter consensus identification.",
                    "Molecular diversity: strategies and concerns (abstract only).",
                    "Human genome analysis and medicine in the 21st century (abstract only).",
                    "Determining contact energy function for continuous state models of globular protein conformations.",
                    "Mutation-tolerant protein identification by mass-spectrometry.",
                    "Probabilities for having a new fold on the basis of a map of all protein sequences.",
                    "Sequencing-by-hybridization at the information-theory bound: an optimal algorithm.",
                    "Early eukaryote evolution based on mitochondrial gene order breakpoints.",
                    "Class prediction and discovery using gene expression data.",
                    "Matching simulation and experiment (extended abstract): a new simplified model for simulating protein folding.",
                    "PDB_ISL: an intermediate sequence library for protein structure assignment.",
                    "The E-CELL project: towards integrative simulation of cellular processes.",
                    "Protein structure determination using protein threading and sparse NMR data (extended abstract).",
                    "A unified sequence-structure classification of protein sequences: combining sequence and structure in a map of the protein space.",
                    "A simple iterative approach to parameter optimization."
                ]
            }
        ]
    },
    {
        "year": "1999",
        "name": "3. RECOMB 1999",
        "info": "Lyon, France",
        "venues": [
            {
                "sub_name_abbr": "conf/recomb/1999",
                "sub_name": "Proceedings of the Third Annual International Conference on Research in Computational Molecular Biology, RECOMB 1999, Lyon, France, April 11-14, 1999.",
                "count": 43,
                "papers": [
                    "Algorithms for whole genome shotgun sequencing.",
                    "Classifying proteins by family using the product of correlated p-values.",
                    "Modeling protein families using probabilistic suffix trees.",
                    "A method for optimal design of a threading scoring function.",
                    "Clustering gene expression patterns.",
                    "Searching gene transfers on Bacillus subtilis using hidden Markov models.",
                    "Winnowing sequences from a database search.",
                    "Faster reliable phylogenetic analysis.",
                    "Comparing genes and genomes (abstract): from polymorphism to phylogeny.",
                    "q-gram based database searching using a suffix array (QUASAR).",
                    "Formulations and hardness of multiple sorting by reversals.",
                    "Identifying gene regulatory networks from experimental data.",
                    "Fast detection of common geometric substructure in proteins.",
                    "Genome sequences and protein structures.",
                    "Computing physical maps of chromosomes with nonoverlapping probes by branch-and-cut.",
                    "Optimizing combinatorial library construction via split synthesis.",
                    "Whole genome association studies in humans (abstract).",
                    "De Novo peptide sequencing via tandem mass spectrometry: a graph-theoretical approach.",
                    "A solvation potential with improved contact definitions and optimized by extensive threading.",
                    "Reconstructing the pre-doubling genome.",
                    "Sequence homology detection through large scale pattern discovery.",
                    "Evolution of metabolisms: a new method for the comparison of metabolic pathways.",
                    "Significance testing for genomic mismatch scanning.",
                    "An algorithm for clustering cDNAs for gene expression analysis.",
                    "Obtaining highly accurate topology estimates of evolutionary trees from very short sequences.",
                    "Algorithms for choosing differential gene expression experiments.",
                    "Recognition of remote protein homologies using three-dimensional information to generate a position specific scoring matrix in the program 3D-PSSM.",
                    "Efficient algorithms for protein sequence design and the analysis of certain evolutionary fitness landscapes.",
                    "An anytime algorithm for gapped block protein threading with pair interactions.",
                    "Efficient database screening for rational drug design using pharmacophore-constrained conformational search.",
                    "Internal loops in RNA secondary structure prediction.",
                    "Construction of physical maps from oligonucleotide fingerprints data.",
                    "The past, present and future of protein structure prediction (abstract).",
                    "Progress toward the whole-genome shotgun sequencing of Drosophila.",
                    "Coupled optimization in protein docking.",
                    "A dictionary based approach for gene annotation.",
                    "On the power of universal bases in sequencing by hybridization.",
                    "Probability models for genome rearrangement and linear invariants for phylogenetic inference.",
                    "Comparison of complete genomes: Organization and evolution (abstract).",
                    "DNA microarrays - the how and the why.",
                    "Derivation of sensitive discrimination potential for virtual ligand screening.",
                    "Computational analysis of molecular diversity for drug discovery.",
                    "Trends in computational biology."
                ]
            }
        ]
    },
    {
        "year": "1998",
        "name": "2. RECOMB 1998",
        "info": "New York, NY, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/recomb/1998",
                "sub_name": "Proceedings of the Second Annual International Conference on Research in Computational Molecular Biology, RECOMB 1998, New York, NY, USA, March 22-25, 1998.",
                "count": 45,
                "papers": [
                    "Challenges of biomolecular structure prediction (abstract).",
                    "Detecting non-adjoining correlations with signals in DNA.",
                    "From four-taxon trees to phylogenies (preliminary report): the case of mammalian evolution.",
                    "An algorithm for finding tandem repeats of unspecified pattern size.",
                    "Protein folding in the hydrophobic-hydrophilic (HP) is NP-complete.",
                    "Better methods for solving parsimony and compatibility.",
                    "Enhancements in sequence analysis with DNA arrays (abstract).",
                    "The hierarchical organization of molecular structure computations.",
                    "The human genetic variation (abstract): oligonucleotide chips and human disease.",
                    "On the complexity of protein folding (abstract).",
                    "Constructing maps using the span and inclusion relations.",
                    "How fast a protein chain can fold to its most stable structure?",
                    "A formally exact method to numerically analyze local denaturation in superhelical DNA.",
                    "Algorithmic determination of core positions in the VL and VH domains of immunoglobulin molecules.",
                    "Family-based homology detection via pairwise sequence comparison.",
                    "Evolutionary drug discovery (abstract).",
                    "Dynamic programming alignment accuracy.",
                    "Optimal detection of sequence similarity by local alignment.",
                    "Algorithms for optical mapping.",
                    "The ordinal quartet method.",
                    "Genome analysis using clusters of orthologous groups (COGs).",
                    "Beyond mutation matrices: physical-chemistry based evolutionary models.",
                    "Estimation for restriction sites observed by optical mapping using reversible-jump Markov chain Monte Carlo.",
                    "A polyhedral approach to RNA sequence structure alignment.",
                    "Assessment of ab initio protein structure prediction.",
                    "Bridging the gap between sequence and structure (abstract).",
                    "A structure based similarity measure for nucleic acid sequence comparison.",
                    "On reconstructing species trees from gene trees in term of duplications and losses.",
                    "Partitioning K clones: hardness results and practical algorithms for the K-populations problem.",
                    "Estimation of allele frequencies from color-multiplexed electropherograms.",
                    "A unified approach to word statistics.",
                    "A self-consistent field optimization approach to build energetically and geometrically correct lattice models of proteins.",
                    "Motif discovery without alignment or enumeration (extended abstract).",
                    "An algorithm for finding novel gapped motifs in DNA sequences.",
                    "Identifying satellites in nucleic acid sequences.",
                    "Multiple genome rearrangements.",
                    "New approaches to genomic analysis using single molecules.",
                    "Modeling DNA shuffling.",
                    "Analysis of the position dependent amino acid probabilities and its application to the search for remote homologues.",
                    "Maxwell demon and topology simplification by type II topoisomerases.",
                    "The theoretical limits of DNA sequence discrimination of polyamides.",
                    "Regression analysis of multiple protein structures.",
                    "A new method for modeling and solving the protein fold recognition problem (extended abstract).",
                    "Mass spectrometry and the proteome (abstract).",
                    "Alignments without low-scoring regions."
                ]
            }
        ]
    },
    {
        "year": "1997",
        "name": "1. RECOMB 1997",
        "info": "Santa Fe, NM, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/recomb/1997",
                "sub_name": "Proceedings of the First Annual International Conference on Research in Computational Molecular Biology, RECOMB 1997, Santa Fe, NM, USA, January 20-23, 1997.",
                "count": 48,
                "papers": [
                    "Local rules for protein folding on a triangular lattice and generalized hydrophobicity in the HP model.",
                    "On the approximation of protein threading.",
                    "ReAligner: a program for refining DNA sequence multi-alignments.",
                    "On constructing radiation hybrid maps (extended abstract).",
                    "Sequence alignment with tandem duplication.",
                    "An iterative method for improved protein structural motif recognition.",
                    "Chain growth algorithms for HP-type lattice proteins.",
                    "Fabricating arrays of strings.",
                    "The power of surface-based DNA computation (extended abstract).",
                    "Sorting by reversals is difficult.",
                    "A branch-and-cut approach to physical mapping with end-probes.",
                    "Monte Carlo sequence alignment.",
                    "Numerical taxonomy on data (abstract): experimental results.",
                    "On the complexity and approximation of syntenic distance.",
                    "Protein structure prediction and potential energy landscape analysis using continuous global minimization.",
                    "An algorithmic approach to multiple complete digest mapping.",
                    "On the computational complexity of sequence design problems.",
                    "Lattice and off-lattice side chain models of protein folding (extended abstract): linear time structure prediction better than 86% of optimal.",
                    "The application of Markov chain Monte Carlo methods to radiation hybrid mapping.",
                    "Algorithms for computing and integrating physical maps using unique probes.",
                    "Mapping clones with a given ordering or interleaving (abstract).",
                    "Faster and simpler algorithm for sorting signed permutations by reversals.",
                    "Assessing inhomogeneities in bacterial long genomic sequences.",
                    "Problems in understanding the structure and assembly of viruses (abstract).",
                    "Chimeric alignment by dynamic programming: algorithm and biological uses.",
                    "New contact measures for the protein docking problem.",
                    "An algorithm for haplotype analysis.",
                    "DNA probe arrays - accessing the genome (abstract).",
                    "Supervised learning of hidden Markov models for sequence discrimination.",
                    "Towards constructing physical maps by optical mapping (extended abstract): an effective, simple, combinatorial approach.",
                    "Progressive multiple alignment with constraints.",
                    "Simulating Boolean circuits on a DNA computer.",
                    "Improved splice site detection in Genie.",
                    "A branch-and-cut algorithm for multiple sequence alignment.",
                    "Hunting for new restriction enzymes in GenBank (abstract).",
                    "Conserved segment identification.",
                    "The deferred path heuristic for the generalized tree alignment problem.",
                    "New flexible approaches for multiple sequence alignment.",
                    "Building human genome maps with radiation hybrids.",
                    "The threading approach to the inverse protein folding problem.",
                    "Variations on a theme of Lander and Waterman (abstract).",
                    "Pooling strategies for establishing physical genome maps using FISH.",
                    "Las Vegas algorithms for gene recognition: suboptimal and error-tolerant spliced alignment.",
                    "A more efficient approximation scheme for tree alignment.",
                    "Beyond islands (extended abstract): runs in clone-probe matrices.",
                    "Reference-based gene model prediction on DNA contigs (extended abstract).",
                    "Aligning a DNA sequence with a protein sequence.",
                    "Fast and numerically stable parametric alignment of biosequences."
                ]
            }
        ]
    }
]