[
    {
        "name": "TASAE",
        "year": "2022",
        "info": "Volume 19: 2022",
        "count": 42,
        "papers": [
            "Guest Editorial Special Section on Advances in Automation and Optimization for Sustainable Transportation and Energy Systems.",
            "Routing Optimization of Electric Vehicles for Charging With Event-Driven Pricing Strategy.",
            "Innovative Approaches for Electric Vehicles Relocation in Sharing Systems.",
            "Low Emission Road Transport Scenarios: An Integrated Assessment of Energy Demand, Air Quality, GHG Emissions, and Costs.",
            "Optimal Planning of Charging Stations in Coupled Transportation and Power Networks Based on User Equilibrium Conditions.",
            "Continuous-Domain Real-Time Distributed ADMM Algorithm for Aggregator Scheduling and Voltage Stability in Distribution Network.",
            "Q-Learning-Based Model Predictive Control for Energy Management in Residential Aggregator.",
            "Efficient and Sustainable Reconfiguration of Distribution Networks via Metaheuristic Optimization.",
            "An MPC-Based Rescheduling Algorithm for Disruptions and Disturbances in Large-Scale Railway Networks.",
            "A Novel Iterative Learning Approach for Tracking Control of High-Speed Trains Subject to Unknown Time-Varying Delay.",
            "Optimizing Fuel Consumption in Thrust Allocation for Marine Dynamic Positioning Systems.",
            "Where Am I Parking: Incentive Online Parking-Space Sharing Mechanism With Privacy Protection.",
            "Interval-Valued Intuitionistic Uncertain Linguistic Cloud Petri Net and Its Application to Risk Assessment for Subway Fire Accident.",
            "Sequencing Daily Patient Workload for an Ancillary Service Provider.",
            "Manipulator Motion Planning for Part Pickup and Transport Operations From a Moving Base.",
            "Upper Limbs Kinematics Estimation Using Affordable Visual-Inertial Sensors.",
            "Fuzzy Logic-Driven Variable Time-Scale Prediction-Based Reinforcement Learning for Robotic Multiple Peg-in-Hole Assembly.",
            "Process Monitoring and Fault Prediction in Multivariate Time Series Using Bag-of-Words.",
            "Scheduling Robotic Cellular Manufacturing Systems With Timed Petri Net, A* Search, and Admissible Heuristic Function.",
            "Heuristic Scheduling of Batch Production Processes Based on Petri Nets and Iterated Greedy Algorithms.",
            "Dual-Loop Optimal Control of a Robot Manipulator and Its Application in Warehouse Automation.",
            "Residual-Based Surface Segmentation for Monitoring Topographic Variations.",
            "Double Auction-Based Manufacturing Cloud Service Allocation in an Industrial Park.",
            "A Generic Framework for Degradation Modeling Based on Fusion of Spectrum Amplitudes.",
            "Eco-Driving of Autonomous Vehicles for Nonstop Crossing of Signalized Intersections.",
            "Dual Probability Learning Based Local Search for the Task Assignment Problem.",
            "6-DoF Full Robotic Calibration Based on 1-D Interferometric Measurements for Microscale and Nanoscale Applications.",
            "A Shared Control Strategy for Reach and Grasp of Multiple Objects Using Robot Vision and Noninvasive Brain-Computer Interface.",
            "A Continuous Teleoperation Subspace With Empirical and Algorithmic Mapping Algorithms for Nonanthropomorphic Hands.",
            "Chiller Fault Diagnosis Based on VAE-Enabled Generative Adversarial Networks.",
            "Estimation of CoM and CoP Trajectories During Human Walking Based on a Wearable Visual Odometry Device.",
            "Mobile Robotic Radiation Surveying With Recursive Bayesian Estimation and Attenuation Modeling.",
            "Toward Dependable Model-Driven Design of Low-Level Industrial Automation Control Systems.",
            "A Data-Driven Method for Online Monitoring Tube Wall Thinning Process in Dynamic Noisy Environment.",
            "Flow-Achieving Online Planning and Dispatching for Continuous Transportation With Autonomous Vehicles.",
            "Semianalytical Solutions to the Lighthill-Whitham-Richards Equation With Time-Switched Triangular Diagrams: Application to Variable Speed Limit Traffic Control.",
            "Secure Recovery Procedure for Manufacturing Systems Using Synchronizing Automata and Supervisory Control Theory.",
            "Physiological Tremor Filtering Without Phase Distortion for Robotic Microsurgery.",
            "A Learning Framework for Personalized Random Utility Maximization (RUM) Modeling of User Behavior.",
            "Formulation and Solution Methodology for Reducing Energy Consumption in Two-Machine Bernoulli Serial Lines.",
            "Prize Collecting Multiagent Orienteering: Price of Anarchy Bounds and Solution Methods.",
            "Using Logical Time to Ensure Liveness in Material Handling Systems With Decentralized Control."
        ]
    },
    {
        "name": "TASAE",
        "year": "2021",
        "info": "Volume 18: 2021",
        "count": 178,
        "papers": [
            "Knowledge-Based Automation for Smart Manufacturing Systems.",
            "Meta-Reinforcement Learning of Machining Parameters for Energy-Efficient Process Control of Flexible Turning Operations.",
            "Optimal Integration of Supervised Tensor Decomposition and Ensemble Learning for In Situ Quality Evaluation in Friction Stir Blind Riveting.",
            "Active Learning for Gaussian Process Considering Uncertainties With Application to Shape Control of Composite Fuselage.",
            "Idle Duration Prediction for Manufacturing System Using a Gaussian Mixture Model Integrated Neural Network for Energy Efficiency Improvement.",
            "A Knowledge-Based Cuckoo Search Algorithm to Schedule a Flexible Job Shop With Sequencing Flexibility.",
            "Optimal Scheduling of Human-Robot Collaborative Assembly Operations With Time Petri Nets.",
            "A Method Integrating Q-Learning With Approximate Dynamic Programming for Gantry Work Cell Scheduling.",
            "A Genetic Programming-Based Scheduling Approach for Hybrid Flow Shop With a Batch Processor and Waiting Time Constraint.",
            "Adaptive Preventive Maintenance for Flow Shop Scheduling With Resumable Processing.",
            "An Improved Aggregation Method for Performance Analysis of Bernoulli Serial Production Lines.",
            "Transient and Steady-State Analysis of Multistage Production Lines With Residence Time Limits.",
            "Transient Analysis of Multiproduct Bernoulli Serial Lines With Setups.",
            "Analysis and Optimization of Energy Consumption in Two-Machine Bernoulli Lines With General Bounds on Machine Efficiency.",
            "A General Methodology for Adapting Industrial HMIs to Human Operators.",
            "Recent Industrial Roadmaps to Enable Smart Manufacturing of Biopharmaceuticals.",
            "Decision-Level Data Fusion in Quality Control and Predictive Maintenance.",
            "Needs-Based Product Configurator Design for Mass Customization Using Hierarchical Attention Network.",
            "Ontology-Based Holonic Event-Driven Architecture for Autonomous Networked Manufacturing Systems.",
            "Guest Editorial Special Section on 2019 IEEE International Conference on Automation Science and Engineering.",
            "Using CP/SMT Solvers for Scheduling and Routing of AGVs.",
            "Leveraging Iterative Plan Refinement for Reactive Smart Manufacturing Systems.",
            "Print Surface Thermal Modeling and Layer Time Control for Large-Scale Additive Manufacturing.",
            "Workload Balancing for Production Planning With Lot Streaming and Multilevel BOM.",
            "An Online AM Quality Estimation Architecture From Pool to Layer.",
            "A Matheuristic Approach for the Home Care Scheduling Problem With Chargeable Overtime and Preference Matching.",
            "A Mosquito Pick-and-Place System for PfSPZ-Based Malaria Vaccine Production.",
            "Modeling and Analysis of E-Consults in Primary-Specialty Care Referrals.",
            "Development of Inverse Greybox Model-Based Virtual Meters for Air Handling Units.",
            "Influence of Measurement Uncertainty on Parameter Estimation and Fault Location for Transmission Lines.",
            "Machine Learning-Based Prognostics for Central Heating and Cooling Plant Equipment Health Monitoring.",
            "A New Approach to Solve Uncertain Multidisciplinary Design Optimization Based on Conditional Value at Risk.",
            "On the Use of Equivalence Classes for Optimal and Suboptimal Bin Packing and Bin Covering.",
            "Tool-Center-Point Control of a Concrete Pump Using Constrained Quadratic Optimization.",
            "Sim2Real in Robotics and Automation: Applications and Challenges.",
            "Guest Editorial Special Issue on Artificial Intelligence in Automation for Healthcare Applications.",
            "Slope Gradient Adaptive Gait Planning for Walking Assistance Lower Limb Exoskeletons.",
            "Online Gait Planning of Lower-Limb Exoskeleton Robot for Paraplegic Rehabilitation Considering Weight Transfer Process.",
            "Effect of Hip Assistance Modes on Metabolic Cost of Walking With a Soft Exoskeleton.",
            "Maximum Dorsiflexion Detection Based on an On-Board Adaptive Algorithm for Transtibial Amputees With Robotic Prostheses.",
            "A Gait Simulation and Evaluation System for Hip Disarticulation Prostheses.",
            "Environmental Context Prediction for Lower Limb Prostheses With Uncertainty Quantification.",
            "Feature-Guided Nonrigid 3-D Point Set Registration Framework for Image-Guided Liver Surgery: From Isotropic Positional Noise to Anisotropic Positional Noise.",
            "Toward Teaching by Demonstration for Robot-Assisted Minimally Invasive Surgery.",
            "Attention-Based Gated Recurrent Unit for Gesture Recognition.",
            "A Novel Illumination-Robust Hand Gesture Recognition System With Event-Based Neuromorphic Vision Sensor.",
            "Toward Image-to-Tactile Cross-Modal Perception for Visually Impaired People.",
            "EEG-Based Volitional Control of Prosthetic Legs for Walking in Different Terrains.",
            "EEG Motor Imagery Classification With Sparse Spectrotemporal Decomposition and Deep Learning.",
            "Transferring Subject-Specific Knowledge Across Stimulus Frequencies in SSVEP-Based BCIs.",
            "Ankle Joint Torque Estimation Using an EMG-Driven Neuromusculoskeletal Model and an Artificial Neural Network Model.",
            "Diabetic Retinopathy Diagnosis Using Multichannel Generative Adversarial Network With Semisupervision.",
            "Automatic Detection of Negative Symptoms in Schizophrenia via Acoustically Measured Features Associated With Affective Flattening.",
            "Anatomically Constrained Deep Learning for Automating Dental CBCT Segmentation and Lesion Detection.",
            "Special Issue on Intelligent Energy Solutions to Sustainable Production and Service Automation.",
            "Robust Optimal Energy Management of a Residential Microgrid Under Uncertainties on Demand and Renewable Power Generation.",
            "Energy Optimization of Large-Scale AGV Systems.",
            "Robust Energy Management for a Corporate Energy System With Shift-Working V2G.",
            "Aggregation of V2H Systems to Participate in Regulation Market.",
            "A Computing Budget Allocation Method for Minimizing EV Charging Cost Using Uncertain Wind Power.",
            "Multistep Prediction-Based Adaptive Dynamic Programming Sensor Scheduling Approach for Collaborative Target Tracking in Energy Harvesting Wireless Sensor Networks.",
            "An Online Policy for Energy-Efficient State Control of Manufacturing Equipment.",
            "Energy Efficiency Modeling for Configuration-Dependent Machining via Machine Learning: A Comparative Study.",
            "Biobjective Task Scheduling for Distributed Green Data Centers.",
            "An Approximation Algorithm for Unrelated Parallel Machine Scheduling Under TOU Electricity Tariffs.",
            "Multiobjective Differential Evolution Algorithm for Solving Robotic Cell Scheduling Problem With Batch-Processing Machines.",
            "Problem Formulation and Solution Methodology for Energy Consumption Optimization in Bernoulli Serial Lines.",
            "A Multiobjective Disassembly Planning for Value Recovery and Energy Conservation From End-of-Life Products.",
            "Multiresource-Constrained Selective Disassembly With Maximal Profit and Minimal Energy Consumption.",
            "Revenue and Energy Cost-Optimized Biobjective Task Scheduling for Green Cloud Data Centers.",
            "Iterating Tensor Voting: A Perceptual Grouping Approach for Crack Detection on EL Images.",
            "An Improved Bouc-Wen Model Based on Equitorque Discretization for a Load-Dependent Nonlinear Stiffness Actuator.",
            "Automated Robotic Microinjection of the Nematode Worm Caenorhabditis elegans.",
            "Guest Editorial Special Issue on the 2018 Workshop on the Algorithmic Foundations of Robotics (WAFR).",
            "Algorithmic Design for Embodied Intelligence in Synthetic Cells.",
            "On the Design of Minimal Robots That Can Solve Planning Problems.",
            "Fast, High-Quality Two-Arm Rearrangement in Synchronous, Monotone Tabletop Setups.",
            "Interlocking Block Assembly With Robots.",
            "An Ergodic Measure for Active Learning From Equilibrium.",
            "Online Partial Conditional Plan Synthesis for POMDPs With Safe-Reachability Objectives: Methods and Experiments.",
            "Path-Based Sensors: Paths as Sensors, Bayesian Updates, and Shannon Information Gathering.",
            "RMPflow: A Geometric Framework for Generation of Multitask Motion Policies.",
            "Decomposition and Aggregation-Based Real-Time Analysis of Assembly Systems With Geometric Machines and Small Batch-Based Production Tasks.",
            "FuseSeg: Semantic Segmentation of Urban Scenes Based on RGB and Thermal Data Fusion.",
            "Reliability-Aware and Deadline-Constrained Mobile Service Composition Over Opportunistic Networks.",
            "Identifying the Influential Inputs for Network Output Variance Using Sparse Polynomial Chaos Expansion.",
            "Privacy-Preserving Behavioral Correctness Verification of Cross-Organizational Workflow With Task Synchronization Patterns.",
            "A Fast and Flexible Projector-Camera Calibration System.",
            "Data Recovery of Magnetic Flux Leakage Data Gaps Using Multifeature Conditional Risk.",
            "Theoretical and Experimental Investigations on Spectral Lp/Lq Norm Ratio and Spectral Gini Index for Rotating Machine Health Monitoring.",
            "Enhanced Odd-Harmonic Repetitive Control of Nanopositioning Stages Using Spectrum-Selection Filtering Scheme for High-Speed Raster Scanning.",
            "Optimal Feedback Control of Pedestrian Flow in Heterogeneous Corridors.",
            "An Optimal Primary Frequency Control Based on Adaptive Dynamic Programming for Islanded Modernized Microgrids.",
            "A Branch and Price Algorithm for Crane Assignment and Scheduling in Slab Yard.",
            "Soft Robotic Gripper Driven by Flexible Shafts for Simultaneous Grasping and In-Hand Cap Manipulation.",
            "An Online Robot Collision Detection and Identification Scheme by Supervised Learning and Bayesian Decision Theory.",
            "Design and Experimental Validation of a Distributed Cooperative Transportation Scheme.",
            "Weighted Double-Low-Rank Decomposition With Application to Fabric Defect Detection.",
            "Distributed and Asynchronous Coordination of a Mixed-Integer Linear System via Surrogate Lagrangian Relaxation.",
            "Data Augmentation Classifier for Imbalanced Fault Classification.",
            "Tracking Control of Nanopositioning Stages Using Parallel Resonant Controllers for High-Speed Nonraster Sequential Scanning.",
            "Clinical Screening Interview Using a Social Robot for Geriatric Care.",
            "Connectivity-Maintenance Teleoperation of a UAV Fleet With Wearable Haptic Feedback.",
            "Real-Time Fault-Tolerant Formation Control of Multiple WMRs Based on Hybrid GA-PSO Algorithm.",
            "Profit-Maximized Collaborative Computation Offloading and Resource Allocation in Distributed Cloud and Edge Computing Systems.",
            "Robust Trajectory Tracking Control for Underactuated Autonomous Underwater Vehicles in Uncertain Environments.",
            "SkinSim: A Design and Simulation Tool for Robot Skin With Closed-Loop pHRI Controllers.",
            "Detectability of Discrete-Event Systems Under Nondeterministic Observations.",
            "Fast Generation of High-Fidelity RGB-D Images by Deep Learning With Adaptive Convolution.",
            "Joint Feature and Label Adversarial Network for Wafer Map Defect Recognition.",
            "Dynamic Multilevel Workflow Management Concept for Industrial IoT Systems.",
            "A Direct-Decoupling Closed-Loop Control Method for Roll-to-Roll Web Printing Systems.",
            "3-D Autonomous Manipulation System of Helical Microswimmers With Online Compensation Update.",
            "RCTL: New Temporal Logic for Improved Formal Verification of Reconfigurable Discrete-Event Systems.",
            "An RFID-Based Mobile Robot Localization Method Combining Phase Difference and Readability.",
            "ArduCode: Predictive Framework for Automation Engineering.",
            "Fixed-Time Actuator Fault Accommodation Applied to Hypersonic Gliding Vehicles.",
            "Reachability Tree-Based Optimization Algorithm for Cyclic Scheduling of Timed Petri Nets.",
            "Near-Optimal Area-Coverage Path Planning of Energy-Constrained Aerial Robots With Application in Autonomous Environmental Monitoring.",
            "The (α, β)-Precise Estimates of MTBF and MTTR: Definition, Calculation, and Observation Time.",
            "An Estimation of Distribution Algorithm With Filtering and Learning.",
            "On Parametrizing Feasible Reconfigurable Systems Under Real-Time, Energy, and Resource Sharing Constraints.",
            "Early Stage Variation Simulation and Visualization of Compliant Part Based on Parametric Space Envelope.",
            "Wafer Delay Analysis and Workload Balancing of Parallel Chambers for Dual-Armed Cluster Tools With Multiple Wafer Types.",
            "A Standalone RFID-Based Mobile Robot Navigation Method Using Single Passive Tag.",
            "Discovery and Quality Evaluation of Software Component Behavioral Models.",
            "S-VIT: Stereo Visual-Inertial Tracking of Lower Limb for Physiotherapy Rehabilitation in Context of Comprehensive Evaluation of SLAM Systems.",
            "Condition-Driven Data Analytics and Monitoring for Wide-Range Nonstationary and Transient Continuous Processes.",
            "Trajectory Planning and Tracking Strategy Applied to an Unmanned Ground Vehicle in the Presence of Obstacles.",
            "Color-Coating Scheduling With a Multiobjective Evolutionary Algorithm Based on Decomposition and Dynamic Local Search.",
            "Low-Error Data Recovery Based on Collaborative Filtering With Nonlinear Inequality Constraints for Manufacturing Processes.",
            "Modeling and Path Planning for Persistent Surveillance by Unmanned Ground Vehicle.",
            "Detection and Differentiation of Replay Attack and Equipment Faults in SCADA Systems.",
            "A Novel System for Closed-Loop Simultaneous Magnetic Actuation and Localization of WCE Based on External Sensors and Rotating Actuation.",
            "Reducing Wafer Delay Time by Robot Idle Time Regulation for Single-Arm Cluster Tools.",
            "In-Line Predictive Monitoring Framework.",
            "Generalized 3-D Point Set Registration With Hybrid Mixture Models for Computer-Assisted Orthopedic Surgery: From Isotropic to Anisotropic Positional Error.",
            "Visibility-Based Persistent Monitoring of Piecewise Linear Features on a Terrain Using Multiple Aerial and Ground Robots.",
            "Prediction, Planning, and Coordination of Thousand-Warehousing-Robot Networks With Motion and Communication Uncertainties.",
            "An Adaptive Gaussian Process-Based Search for Stochastically Constrained Optimization via Simulation.",
            "Robotic Grasping of Unknown Objects Using Novel Multilevel Convolutional Neural Networks: From Parallel Gripper to Dexterous Hand.",
            "Partially Observable Markov Decision Process for Monitoring Multilayer Wafer Fabrication.",
            "Generalizing Transfer Bayesian Optimization to Source-Target Heterogeneity.",
            "Discrete Component Prognosis for Hybrid Systems Under Intermittent Faults.",
            "Time-Varying Formation Tracking With Prescribed Performance for Uncertain Nonaffine Nonlinear Multiagent Systems.",
            "Robust Deadlock Detection and Control of Automated Manufacturing Systems With Multiple Unreliable Resources Using Petri Nets.",
            "Visual-Based Contact Detection for Automated Zebrafish Larva Heart Microinjection.",
            "Object Pose Estimation via Pruned Hough Forest With Combined Split Schemes for Robotic Grasp.",
            "Real-Time Bottleneck in Serial Production Lines With Bernoulli Machines: Theory and Case Study.",
            "Tactile Surface Roughness Categorization With Multineuron Spike Train Distance.",
            "A New Double Exponentially Weighted Moving Average Run-to-Run Control Using a Disturbance-Accumulating Strategy for Mixed-Product Mode.",
            "Automated Vision Systems for Condition Assessment of Sewer and Water Pipelines.",
            "A Methodology for the Detection of Nitrogen Deficiency in Corn Fields Using High-Resolution RGB Imagery.",
            "Complex System Monitoring Based on Distributed Least Squares Method.",
            "Robot Packing With Known Items and Nondeterministic Arrival Order.",
            "Wafer Defect Inspection Optimization With Partial Coverage - A Numerical Approach.",
            "Novel Double Compensation for Impedance-Frequency Characteristics of Rotary Ultrasonic Machining via Multiobjective Genetic Algorithm.",
            "Robust and Accurate Nonrigid Point Set Registration Algorithm to Accommodate Anisotropic Positional Localization Error Based on Coherent Point Drift.",
            "Joint Ordering and Markdown Policy for Short Lifetime Products With Competitive Price- and Freshness-Based Demand.",
            "The INCLUSIVE System: A General Framework for Adaptive Industrial Automation.",
            "Condition-Based Monitoring in Variable Machine Running Conditions Using Low-Level Knowledge Transfer With DNN.",
            "Clustered Discriminant Regression for High-Dimensional Data Feature Extraction and Its Applications in Healthcare and Additive Manufacturing.",
            "AB&B: An Anytime Branch and Bound Algorithm for Scheduling of Deadlock-Prone Flexible Manufacturing Systems.",
            "Optimization of Web Service-Based Data-Collection System With Smart Sensor Nodes for Balance Between Network Traffic and Sensing Accuracy.",
            "Cost-Effective Hot-Standby Redundancy With Synchronization Using EtherCAT and Real-Time Ethernet Protocols.",
            "A Virtual Mechanism Approach for Exploiting Functional Redundancy in Finishing Operations.",
            "Plane-Edge-SLAM: Seamless Fusion of Planes and Edges for SLAM in Indoor Environments.",
            "Automated 3-D Deformation of a Soft Object Using a Continuum Robot.",
            "Data-Driven Structural Health Monitoring Using Feature Fusion and Hybrid Deep Learning.",
            "A Nonlinear Control Approach for Aerial Transportation Systems With Improved Antiswing and Positioning Performance.",
            "Parameter Identification for Bernoulli Serial Production Line Model.",
            "A Random Forest-Based Automatic Inspection System for Aerospace Welds in X-Ray Images.",
            "Adjusting Learning Depth in Nonnegative Latent Factorization of Tensors for Accurately Modeling Temporal Patterns in Dynamic QoS Data.",
            "Algebraic General Trajectory Formula for Semitrailer Truck Vehicles.",
            "Chatter Detection With Beat Effect Based on Beat Frequency Estimation.",
            "Consensus-Based Cooperative Formation Guidance Strategy for Multiparafoil Airdrop Systems.",
            "Development of a Robotic System for Automatic Organic Chemistry Synthesis.",
            "List of Reviewers for 2020/2021."
        ]
    },
    {
        "name": "TASAE",
        "year": "2020",
        "info": "Volume 17: 2020",
        "count": 175,
        "papers": [
            "Cutting Depth Monitoring Based on Milling Force for Robot-Assisted Laminectomy.",
            "Curvature-Bounded Lengthening and Shortening for Restricted Vehicle Path Planning.",
            "Context-Sensitive Modeling and Analysis of Cyber-Physical Manufacturing Systems for Anomaly Detection and Diagnosis.",
            "Solving the Tree-Structured Task Allocation Problem via Group Multirole Assignment.",
            "Optimization of Component Sequencing and Feeder Assignment for a Chip Shooter Machine Using Shuffled Frog-Leaping Algorithm.",
            "A Double Hybrid State-Space Model for Real-Time Sensor-Driven Monitoring of Deteriorating Systems.",
            "ARM: Toward Adaptive and Robust Model for Reputation Aggregation.",
            "Multiagent UAV Routing: A Game Theory Analysis With Tight Price of Anarchy Bounds.",
            "Supervisory Model Predictive Control for Optimal Energy Management of Networked Smart Greenhouses Integrated Microgrid.",
            "RFID-Driven Energy-Efficient Control Approach of CNC Machine Tools Using Deep Belief Networks.",
            "Living Cell Manipulation and In Situ Nanoinjection Based on Frequency Shift Feedback Using Cantilevered Micropipette Probes.",
            "Statistical Model of Total Target Registration Error in Image-Guided Surgery.",
            "MOELS: Multiobjective Evolutionary List Scheduling for Cloud Workflows.",
            "Stochastic Filtering Approach for Condition-Based Maintenance Considering Sensor Degradation.",
            "An Automatic Site Survey Approach for Indoor Localization Using a Smartphone.",
            "Robust Generalized Point Cloud Registration With Orientational Data Based on Expectation Maximization.",
            "Timing Analysis of Precedence Constraint Messages Scheduled With Slot Multiplexing Over Dynamic Segment of FlexRay.",
            "Fault Diagnosis With Dual Cointegration Analysis of Common and Specific Nonstationary Fault Variations.",
            "Efficient Routing for Precedence-Constrained Package Delivery for Heterogeneous Vehicles.",
            "Hierarchical Anomaly Detection Using a Multioutput Gaussian Process.",
            "Performance Evaluation of Production Systems Using Real-Time Machine Degradation Signals.",
            "An Industrial Internet Application for Real-Time Fault Diagnosis in Industrial Motors.",
            "Multi-Timescale Decision and Optimization for HVAC Control Systems With Consistency Goals.",
            "Sensing and Control for Simultaneous Precision Peg-in-Hole Assembly of Multiple Objects.",
            "Image-Based Visual Servoing of Helical Microswimmers for Planar Path Following.",
            "Joint Rigid Registration of Multiple Generalized Point Sets With Hybrid Mixture Models.",
            "Stability and Control of a Rider-Bicycle System: Analysis and Experiments.",
            "Control of Black-Box Embedded Systems by Integrating Automaton Learning and Supervisory Control Theory of Discrete-Event Systems.",
            "Adaptive Scheduling of Cluster Tools With Wafer Delay Constraints and Process Time Variation.",
            "A Survey on Robust Deadlock Control Policies for Automated Manufacturing Systems With Unreliable Resources.",
            "Receding Horizon Control for Station Inventory Management in a Bike-Sharing System.",
            "Induced Start Dynamic Sampling for Wafer Metrology Optimization.",
            "Person Finding: An Autonomous Robot Search Method for Finding Multiple Dynamic Users in Human-Centered Environments.",
            "Online Decentralized and Cooperative Dispatch for Multi-Microgrids.",
            "A Multi-Level Simultaneous Minimization Scheme Applied to Jerk-Bounded Redundant Robot Manipulators.",
            "Qualification Management in Wafer Fabs: Optimization Approach and Simulation-Based Performance Assessment.",
            "Automated Control of Magnetic Spore-Based Microrobot Using Fluorescence Imaging for Targeted Delivery With Cellular Resolution.",
            "Dynamic Support Vector Regression Control System for Overlay Error Compensation With Stochastic Metrology Delay.",
            "A Machine Learning Framework for Real-Time Identification of Successful Snap-Fit Assemblies.",
            "Confidence-Based Hybrid Tracking to Overcome Visual Tracking Failures in Calibration-Less Vision-Guided Micromanipulation.",
            "Cooperative Routing for an Air-Ground Vehicle Team - Exact Algorithm, Transformation Method, and Heuristics.",
            "Comments and Corrections to \"Process Mining to Discover Shoppers' Pathways at a Fashion Retail Store Using a WiFi-Base Indoor Positioning System\".",
            "A Stacked Autoencoder With Sparse Bayesian Regression for End-Point Prediction Problems in Steelmaking Process.",
            "Robust Translational Force Control of Multi-Rotor UAV for Precise Acceleration Tracking.",
            "Densely Connected Neural Network With Unbalanced Discriminant and Category Sensitive Constraints for Polyp Recognition.",
            "Automated Geometric Shape Deviation Modeling for Additive Manufacturing Systems via Bayesian Neural Networks.",
            "General Support-Effective Decomposition for Multi-Directional 3-D Printing.",
            "Semiautomatic Labeling for Deep Learning in Robotics.",
            "Variance Minimization Hedging Analysis Based on a Time-Varying Markovian DCC-GARCH Model.",
            "Data-Driven Predictive Probability Density Function Control of Fiber Length Stochastic Distribution Shaping in Refining Process.",
            "Spatiotemporal Thermal Field Modeling Using Partial Differential Equations With Time-Varying Parameters.",
            "Robust Visual Localization in Dynamic Environments Based on Sparse Motion Removal.",
            "Motion Planning for an Elastic Rod Using Contacts.",
            "Process Modeling and Prediction With Large Number of High-Dimensional Variables Using Functional Regression.",
            "Cross-Modal Material Perception for Novel Objects: A Deep Adversarial Learning Method.",
            "Spatiotemporal Multitask Learning for 3-D Dynamic Field Modeling.",
            "Toward Automatic Subsurface Pipeline Mapping by Fusing a Ground-Penetrating Radar and a Camera.",
            "OctreeNet: A Novel Sparse 3-D Convolutional Neural Network for Real-Time 3-D Outdoor Scene Analysis.",
            "Road-Constrained Geometric Pose Estimation for Ground Vehicles.",
            "Fast Symbolic 3-D Registration Solution.",
            "A Fast and Low-Cost Repetitive Movement Pattern Indicator for Massive Dementia Screening.",
            "An Optimization-Based Approach to Discover the Unobservable Behavior of a Discrete-Event System Through Interpreted Petri Nets.",
            "Virtual Reality Robot-Assisted Welding Based on Human Intention Recognition.",
            "Incorporation of Contingency Tasks in Task Allocation for Multirobot Teams.",
            "3-D Path Following of Helical Microswimmers With an Adaptive Orientation Compensation Model.",
            "Handling Incomplete Sensor Measurements in Fault Detection and Diagnosis for Building HVAC Systems.",
            "Adversarial Feature Sampling Learning for Efficient Visual Tracking.",
            "A Learning Approach for Suture Thread Detection With Feature Enhancement and Segmentation for 3-D Shape Reconstruction.",
            "Bayesian Nonlinear Gaussian Mixture Regression and its Application to Virtual Sensing for Multimode Industrial Processes.",
            "Physician Recommendation on Healthcare Appointment Platforms Considering Patient Choice.",
            "A Machine Learning Approach for Structural Health Monitoring Using Noisy Data Sets.",
            "Multiobjective Bike Repositioning in Bike-Sharing Systems via a Modified Artificial Bee Colony Algorithm.",
            "Synchronous Diagnosis of Discrete-Event Systems.",
            "Calibration-Free Image-Based Trajectory Tracking Control of Mobile Robots With an Overhead Camera.",
            "A Minimum-Cost Modeling Method for Nonlinear Industrial Process Based on Multimodel Migration and Bayesian Model Averaging Method.",
            "Drone-Based Material Transfer System in a Robotic Mobile Fulfillment Center.",
            "Cell-Based Local Search Heuristics for Guide Path Design of Automated Guided Vehicle Systems With Dynamic Multicommodity Flow.",
            "Operation Planning and Closed-Loop Control of a Soft Robotic Table for Simultaneous Multiple-Object Manipulation.",
            "Impedance-Controlled Variable Stiffness Actuator for Lower Limb Robot Applications.",
            "Automated Classification for Visual-Only Postmortem Inspection of Porcine Pathology.",
            "Nonlinear Motion Control of Complicated Dual Rotary Crane Systems Without Velocity Feedback: Design, Analysis, and Hardware Experiments.",
            "A Recursive Watermark Method for Hard Real-Time Industrial Control System Cyber-Resilience Enhancement.",
            "The Responsibility Quantification Model of Human Interaction With Automation.",
            "Reduction Rules for Diagnosability Analysis of Complex Systems Modeled by Labeled Petri Nets.",
            "Alarm Event Prediction From Historical Alarm Flood Sequences Based on Bayesian Estimators.",
            "Trajectory Planning With Shortest Path for Modified Uncalibrated Visual Servoing Based on Projective Homography.",
            "Automated Parallel Electrical Characterization of Cells Using Optically-Induced Dielectrophoresis.",
            "Guest Editorial Special Section on the 2017 International Conference on Automation Science and Engineering.",
            "Profit-Sensitive Spatial Scheduling of Multi-Application Tasks in Distributed Green Clouds.",
            "Energy-Efficient Elevating Transfer Vehicle Routing for Automated Multi-Level Material Handling Systems.",
            "Public Hospital Inpatient Room Allocation and Patient Scheduling Considering Equity.",
            "A Dynamic Programming Approach for the Decentralized Control of Energy Retrofit in Large-Scale Street Lighting Systems.",
            "An Integrated Solution to Minimize the Energy Consumption of a Resource-Constrained Machining System.",
            "Dispersed Automation for Industrial Internet of Things.",
            "Guest Editorial Special Section on the 2018 Conference on Automation Science and Engineering (CASE).",
            "Multirobot Routing Algorithms for Robots Operating in Vineyards.",
            "Fluctuation Reduction of Wind Power and Sizing of Battery Energy Storage Systems in Microgrids.",
            "A Control Approach Based on Colored Hybrid Petri Nets and (Max, +) Algebra: Application to Multimodal Transportation Systems.",
            "Design of Modern Supply Chain Networks Using Fuzzy Bargaining Game and Data Envelopment Analysis.",
            "A System Architecture for CAD-Based Robotic Assembly With Sensor-Based Skills.",
            "Orthogonal Uncertainty Modeling in the Engineering of Cyber-Physical Systems.",
            "Ontology Building for Cyber-Physical Systems: Application in the Manufacturing Domain.",
            "Design, Application, and Evaluation of a Multiagent System in the Logistics Domain.",
            "A Structure Data-Driven Framework for Virtual Metrology Modeling.",
            "Model and Heuristic Solutions for the Multiple Double-Load Crane Scheduling Problem in Slab Yards.",
            "Parking Assignment: Minimizing Parking Expenses and Balancing Parking Demand Among Multiple Parking Lots.",
            "Parallel Optimal Tracking Control Schemes for Mode-Dependent Control of Coupled Markov Jump Systems via Integral RL Method.",
            "Encoding-Decoding Mechanism-Based Finite-Level Quantized Iterative Learning Control With Random Data Dropouts.",
            "Energy-Efficient Target Tracking With UASNs: A Consensus-Based Bayesian Approach.",
            "Decomposition Method for New Single-Machine Scheduling Problems From Steel Production Systems.",
            "Modeling and Analysis of Pneumatic Cushioning Systems Under Energy-Saving Measures.",
            "Construction-Based Optimization Approaches to Airline Crew Rostering Problem.",
            "Deep Discriminative Representation Learning for Nonlinear Process Fault Detection.",
            "A Reinforcement Learning Approach to Robust Scheduling of Semiconductor Manufacturing Facilities.",
            "A Fine-Grained Adversarial Network Method for Cross-Domain Industrial Fault Diagnosis.",
            "Grasping Marine Products With Hybrid-Driven Underwater Vehicle-Manipulator System.",
            "Unfastening of Hexagonal Headed Screws by a Collaborative Robot.",
            "Variation Source Identification in Manufacturing Processes Using Bayesian Approach With Sparse Variance Components Prior.",
            "Shape Deviation Generator - A Convolution Framework for Learning and Predicting 3-D Printing Shape Accuracy.",
            "Dynamic Resource Allocation in a Hierarchical Appointment System: Optimal Structure and Heuristics.",
            "Multimode Process Mode Identification With Coexistence of Quantitative Information and Qualitative Information.",
            "An MPC Scheme for Traffic Coordination in Open and Irreversible, Zone-Controlled, Guidepath-Based Transport Systems.",
            "The Large-Scale Periodic Home Health Care Server Assignment Problem: A Region-Partition-Based Algorithm.",
            "Faster R-CNN With Classifier Fusion for Automatic Detection of Small Fruits.",
            "Automatic Polyp Recognition in Colonoscopy Images Using Deep Learning and Two-Stage Pyramidal Feature Prediction.",
            "Improving Visual Localization Accuracy in Dynamic Environments Based on Dynamic Region Removal.",
            "Improving Human-Robot Interaction Utilizing Learning and Intelligence: A Human Factors-Based Approach.",
            "Defect Image Sample Generation With GAN for Improving Defect Recognition.",
            "Decomposition-Based Stability Analysis for Isolated Power Systems With Reduced Conservativeness.",
            "Single-Objective/Multiobjective Cat Swarm Optimization Clustering Analysis for Data Partition.",
            "Optimal Model Reference Sliding Mode Control of Perishable Inventory Systems.",
            "Granular-Causality-Based Byproduct Energy Scheduling for Energy-Intensive Enterprise.",
            "Sequential Online Dispatch in Design of Experiments for Single- and Multiple-Response Surrogate Modeling.",
            "An Artificially Weighted Spanning Tree Coverage Algorithm for Decentralized Flying Robots.",
            "An Operational Adjustment Framework for a Complex Industrial Process Based on Hybrid Bayesian Network.",
            "Planning Jerk-Optimized Trajectory With Discrete Time Constraints for Redundant Robots.",
            "An Intelligent Optimization Method for Optimal Virtual Machine Allocation in Cloud Data Centers.",
            "Differential Evolution With Opposition and Redirection for Source Localization Using RSS Measurements in Wireless Sensor Networks.",
            "Neural RRT*: Learning-Based Optimal Path Planning.",
            "Development of a Novel Robust Control Method for Formation of Heterogeneous Multiple Mobile Robots With Autonomous Docking Capability.",
            "MARG Attitude Estimation Using Gradient-Descent Linear Kalman Filter.",
            "Depth Estimation of Hard Inclusions in Soft Tissue by Autonomous Robotic Palpation Using Deep Recurrent Neural Network.",
            "Human-in-the-Loop Robotic Manipulation Planning for Collaborative Assembly.",
            "Hybrid Scatter Search Algorithm for Optimal and Energy-Efficient Steelmaking-Continuous Casting.",
            "A Study on the Block Relocation Problem: Lower Bound Derivations and Strong Formulations.",
            "Item Assignment Problem in a Robotic Mobile Fulfillment System.",
            "Joint Ordering, Pricing, and Freshness-Keeping Policy for Perishable Products: Single-Period Deterministic Case.",
            "Incremental Learning of Object Models From Natural Human-Robot Interactions.",
            "Customer-Specific Robotic Attendant for VR Simulators.",
            "Real-Time Acceleration-Continuous Path-Constrained Trajectory Planning With Built-In Tradeoff Between Cruise and Time-Optimal Motions.",
            "Data-Driven Approach for Fault Detection and Diagnostic in Semiconductor Manufacturing.",
            "Admittance-Based Controller Design for Physical Human-Robot Interaction in the Constrained Task Space.",
            "HVAC Energy Cost Optimization for a Multizone Building via a Decentralized Approach.",
            "Robust Deadlock Avoidance and Control of Automated Manufacturing Systems With Assembly Operations Using Petri Nets.",
            "Mobile Charging as a Service: A Reservation-Based Approach.",
            "Structure Dictionary Learning-Based Multimode Process Monitoring and its Application to Aluminum Electrolysis Process.",
            "Dual Rotating Microsphere Using Robotic Feedforward Compensation Control of Cooperative Flexible Micropipettes.",
            "Decentralized Hierarchical Planning of PEVs Based on Mean-Field Reverse Stackelberg Game.",
            "Robust Assignment Using Redundant Robots on Transport Networks With Uncertain Travel Time.",
            "Configuration-Based Smart Customization Service: A Multitask Learning Approach.",
            "A Novel Dual-Probe-Based Micrograsping System Allowing Dexterous 3-D Orientation Adjustment.",
            "EB-RRT: Optimal Motion Planning for Mobile Robots.",
            "Prior Knowledge-Based Optimization Method for the Reconstruction Model of Multicamera Optical Tracking System.",
            "Human Activity Discovery and Recognition Using Probabilistic Finite-State Automata.",
            "Robotic Batch Somatic Cell Nuclear Transfer Based on Microfluidic Groove.",
            "A Metadata Inference Method for Building Automation Systems With Limited Semantic Information.",
            "Zonally Robust Decentralized Optimization for Global Energy Interconnection: Case Study on Northeast Asian Countries.",
            "Active Stereo 3-D Surface Reconstruction Using Multistep Matching.",
            "Fault Prognosis of Key Components in HVAC Air-Handling Systems at Component and System Levels.",
            "Camera-Robot Calibration for the Da Vinci Robotic Surgery System.",
            "Synchronous Position and Compliance Regulation on a Bi-Joint Gait Exoskeleton Driven by Pneumatic Muscles.",
            "Analysis of Backward Sequence for Single-Armed Cluster Tools With Processing Time Variations.",
            "A Gaussian Feature Analytics-Based DISSIM Method for Fine-Grained Non-Gaussian Process Monitoring.",
            "Disturbance-Compensation-Based Continuous Sliding Mode Control for Overhead Cranes With Disturbances.",
            "List of Reviewers for 2019/2020."
        ]
    },
    {
        "name": "TASAE",
        "year": "2019",
        "info": "Volume 16: 2019",
        "count": 159,
        "papers": [
            "Guest Editorial Special Issue on Automation Science and Engineering for Smart and Interconnected Healthcare Delivery Systems.",
            "A Queueing Network Model for Analysis of Patient Transitions Within Hospitals.",
            "Modeling and Analysis of Postdischarge Intervention Process to Reduce COPD Readmissions.",
            "A History Embedded Accelerated Failure Time Model to Estimate Nursing Home Length of Stay.",
            "Threshold Control Policy Optimization for Real-Time Reverse Referral Decision of Chinese Comprehensive Hospitals.",
            "Bottleneck Analysis to Reduce Primary Care to Specialty Care Referral Delay.",
            "Surgery Scheduling Under Case Cancellation and Surgery Duration Uncertainty.",
            "Dynamic Insertion of Emergency Surgeries With Different Waiting Time Targets.",
            "Optimal Appointment Rule Design in an Outpatient Department.",
            "Dynamic Recommendation of Physician Assortment With Patient Preference Learning.",
            "A Column Generation-Based Gossip Algorithm for Home Healthcare Routing and Scheduling Problems.",
            "Ambulance Deployment With Relocation Through Robust Optimization.",
            "Optimal ICU Admission Control With Premature Discharge.",
            "The Optimization of Combination Chemotherapy Schedules in the Presence of Drug Resistance.",
            "A Novel Positive Transfer Learning Approach for Telemonitoring of Parkinson's Disease.",
            "Structural Degradation Modeling Framework for Sparse Data Sets With an Application on Alzheimer's Disease.",
            "On-Chip Hardware Accelerator for Automated Diagnosis Through Human-Machine Interactions in Healthcare Delivery.",
            "Scheduling Dual-Armed Cluster Tools With Chamber Cleaning Operations.",
            "Theory and Experiment on Formation-Containment Control of Multiple Multirotor Unmanned Aerial Vehicle Systems.",
            "DNSS: Dual-Normal-Space Sampling for 3-D ICP Registration.",
            "Ultrasound-Assisted Guidance With Force Cues for Intravascular Interventions.",
            "Automatic Sweep Scan Path Planning for Five-Axis Free-Form Surface Inspection Based on Hybrid Swept Area Potential Field.",
            "Precise Watch-Hand Alignment Under Disturbance Condition by Microrobotic System.",
            "Development of Self-Learning Kernel Regression Models for Virtual Sensors on Nonlinear Processes.",
            "A Survey of Automated Threaded Fastening.",
            "Flexible Process Planning and End-of-Life Decision-Making for Product Recovery Optimization Based on Hybrid Disassembly.",
            "Energy-Optimal Collision-Free Motion Planning for Multiaxis Motion Systems: An Alternating Quadratic Programming Approach.",
            "A Sensor Fusion Approach to Indoor Human Localization Based on Environmental and Wearable Sensors.",
            "Mobile Phone Data Analysis: A Spatial Exploration Toward Hotspot Detection.",
            "Optimized Multiagent Routing for a Class of Guidepath-Based Transport Systems.",
            "Advancing Constrained Ranking and Selection With Regression in Partitioned Domains.",
            "A New Class of Sequences Without Interferences for Cluster Tools With Tight Wafer Delay Constraints.",
            "Robust Precision Manipulation With Simple Process Models Using Visual Servoing Techniques With Disturbance Rejection.",
            "Model Predictive Control for Energy-Efficient, Quality-Aware, and Secure Virtual Machine Placement.",
            "A Three-Stage Approach to a Multirow Parallel Machine Layout Problem.",
            "Heading Reference-Assisted Pose Estimation for Ground Vehicles.",
            "Advisory Temporal Logic Inference and Controller Design for Semiautonomous Robots.",
            "How Good are Distributed Allocation Algorithms for Solving Urban Search and Rescue Problems? A Comparative Study With Centralized Algorithms.",
            "Charging Automation for Electric Vehicles: Is a Smaller Battery Good for the Wireless Charging Electric Vehicles?",
            "Predictability of Failure Event Occurrences in Decentralized Discrete-Event Systems and Polynomial-Time Verification.",
            "QuicaBot: Quality Inspection and Assessment Robot.",
            "A Microforce-Sensing Mobile Microrobot for Automated Micromanipulation Tasks.",
            "A Scalable Solution Methodology for Mixed-Integer Linear Programming Problems Arising in Automation.",
            "Vision-Based Surgical Suture Looping Through Trajectory Planning for Wound Suturing.",
            "A Grid Cumulative Probability Localization-Based Industrial Risk Monitoring System.",
            "Pose Characterization and Analysis of Soft Continuum Robots With Modeling Uncertainties Based on Interval Arithmetic.",
            "Integration of Robotic Vision and Tactile Sensing for Wire-Terminal Insertion Tasks.",
            "Twofold Variation Propagation Modeling and Analysis for Roll-to-Roll Manufacturing Systems.",
            "Multiple-Change-Point Modeling and Exact Bayesian Inference of Degradation Signal for Prognostic Improvement.",
            "Surgical Instrument Tracking By Multiple Monocular Modules and a Sensor Fusion Approach.",
            "Facilitating Human-Robot Collaborative Tasks by Teaching-Learning-Collaboration From Human Demonstrations.",
            "Unsupervised Anomaly Detection Based on Minimum Spanning Tree Approximated Distance Measures and its Application to Hydropower Turbines.",
            "Soft-Acting, Noncontact Gripping Method for Ultrathin Wafers Using Distributed Bernoulli Principle.",
            "Nonparametric Activity Recognition System in Smart Homes Based on Heterogeneous Sensor Data.",
            "Modified Dynamic Programming Algorithm for Optimization of Total Energy Consumption in Flexible Manufacturing Systems.",
            "Efficient Insertion of Partially Flexible Objects in Precision Assembly.",
            "Vehicle Routing for Resource Management in Time-Phased Deployment of Sensor Networks.",
            "Spatial Task Scheduling for Cost Minimization in Distributed Green Cloud Data Centers.",
            "Estimation of Nonstationary Process Variance in Multistage Manufacturing Processes Using a Model-Based Observer.",
            "Clustering-Based Heuristic to Optimize Nozzle and Feeder Assignments for Collect-and-Place Assembly.",
            "Using the Soar Cognitive Architecture to Remove Screws From Different Laptop Models.",
            "Surface Material Retrieval Using Weakly Paired Cross-Modal Learning.",
            "Throughput Maximization of Capacitated Re-Entrant Lines Through Fluid Relaxation.",
            "Coarse Alignment for Model Fitting of Point Clouds Using a Curvature-Based Descriptor.",
            "Scheduling Semiconductor Testing Facility by Using Cuckoo Search Algorithm With Reinforcement Learning and Surrogate Modeling.",
            "Support-Free Layered Process Planning Toward 3 + 2-Axis Additive Manufacturing.",
            "Surface Deformation Control of a Ferrofluid-Based Robotic Sheet for Object Handling.",
            "Multi-UAV Oxyrrhis Marina-Inspired Search and Dynamic Formation Control for Forest Firefighting.",
            "TL-GDBN: Growing Deep Belief Network With Transfer Learning.",
            "Causation-Based Monitoring and Diagnosis for Multivariate Categorical Processes With Ordinal Information.",
            "Closed-Form Expressions on Lot Completion Time for Dual-Armed Cluster Tools With Parallel Processing Modules.",
            "Design, Fabrication, and Testing of a New Compact Piezo-Driven Flexure Stage for Vertical Micro/Nanopositioning.",
            "Postcapture Attitude Takeover Control of a Partially Failed Spacecraft With Parametric Uncertainties.",
            "A Survey of Force-Assisted Robotic Cell Microinjection Technologies.",
            "Automatic Composition and Optimization of Multicomponent Predictive Systems With an Extended Auto-WEKA.",
            "A Distributed Cluster-Based Approach for Pick-Up Services.",
            "Model Predictive Control for Real-Time Point-to-Point Trajectory Generation.",
            "Synthesis of Supervisory Control With Partial Observation on Normal State-Tree Structures.",
            "Decentralized EV-Based Charging Optimization With Building Integrated Wind Energy.",
            "Real-Time Detection of Fall From Bed Using a Single Depth Camera.",
            "Concurrent Fault Detection and Anomaly Location in Closed-Loop Dynamic Systems With Measured Disturbances.",
            "Multitasking Multiobjective Evolutionary Operational Indices Optimization of Beneficiation Processes.",
            "Scheduling Dual-Armed Cluster Tools for Concurrent Processing of Multiple Wafer Types With Identical Job Flows.",
            "An Echo State Gaussian Process-Based Nonlinear Model Predictive Control for Pneumatic Muscle Actuators.",
            "Active Target Tracking With Self-Triggered Communications in Multi-Robot Teams.",
            "A Dynamic Analytics Method Based on Multistage Modeling for a BOF Steelmaking Process.",
            "Designing Efficient Reconfigurable Control Systems Using IEC61499 and Symbolic Model Checking.",
            "Switching Logic-Based Nonlinear Feedback Control of Offshore Ship-Mounted Tower Cranes: A Disturbance Observer-Based Approach.",
            "Optimizing Hospital Emergency Department Layout via Multiobjective Tabu Search.",
            "An Analytical Framework for Modeling, Analysis, and Improvement of Team Communication and Collaboration Process in Primary Care Clinics.",
            "RSS-Based Indoor Localization Using Belief Function Theory.",
            "Variance-Minimization Iterative Matching Method for Free-Form Surfaces - Part I: Theory and Method.",
            "Variance-Minimization Iterative Matching Method for Free-Form Surfaces - Part II: Experiment and Analysis.",
            "RTRobMultiAxisControl: A Framework for Real-Time Multiaxis and Multirobot Control.",
            "Inventory-Constrained Throughput Optimization for Stochastic Customer Orders.",
            "Dynamic Inspection of Latent Variables in State-Space Systems.",
            "Multilevel Humanlike Motion Planning for Mobile Robots in Complex Indoor Environments.",
            "Joint Asymmetric Tolerance Design and Manufacturing Decision-Making for Additive Manufacturing Processes.",
            "Risk-DTRRT-Based Optimal Motion Planning Algorithm for Mobile Robots.",
            "A Physics-Specific Change Point Detection Method Using Torque Signals in Pipe Tightening Processes.",
            "Reconfiguration of Virtual Cellular Manufacturing Systems via Improved Imperialist Competitive Approach.",
            "Freeform Assembly Planning.",
            "Generalized Linear Quaternion Complementary Filter for Attitude Estimation From Multisensor Observations: An Optimization Approach.",
            "A Pareto-Based Estimation of Distribution Algorithm for Solving Multiobjective Distributed No-Wait Flow-Shop Scheduling Problem With Sequence-Dependent Setup Time.",
            "Combining Analytical Modeling and Learning to Simplify Dexterous Manipulation With Adaptive Robot Hands.",
            "A Cyclic Scheduling Approach to Single-Arm Cluster Tools With Multiple Wafer Types and Residency Time Constraints.",
            "Antiswing Cargo Transportation of Underactuated Tower Crane Systems by a Nonlinear Controller Embedded With an Integral Term.",
            "Inertial Sensor-Based Slip Detection in Human Walking.",
            "Identifying Unseen Faults for Smart Buildings by Incorporating Expert Knowledge With Data.",
            "A Generic Health Index Approach for Multisensor Degradation Modeling and Sensor Selection.",
            "Modeling and Register Control of the Speed-Up Phase in Roll-to-Roll Printing Systems.",
            "Multiscale Feature-Clustering-Based Fully Convolutional Autoencoder for Fast Accurate Visual Inspection of Texture Surface Defects.",
            "Dynamic Precise Positioning Method of Shearer Based on Closing Path Optimal Estimation Model.",
            "Joint Smoothing and Tracking Based on Continuous-Time Target Trajectory Function Fitting.",
            "A Stable Autoregressive Moving Average Hysteresis Model in Flexure Fast Tool Servo Control.",
            "Guest Editorial Special Issue on Active Perception for Industrial Intelligence.",
            "Finite-Time PLOS-Based Integral Sliding-Mode Adaptive Neural Path Following for Unmanned Surface Vessels With Unknown Dynamics and Disturbances.",
            "Haptics Electromyogrphy Perception and Learning Enhanced Intelligence for Teleoperated Robot.",
            "Coarse-to-Fine UAV Target Tracking With Deep Reinforcement Learning.",
            "Autonomous Indoor Exploration Via Polygon Map Construction and Graph-Based SLAM Using Directional Endpoint Features.",
            "Adaptive Control and Optimization of Mobile Manipulation Subject to Input Saturation and Switching Constraints.",
            "Electrotactile Feedback in a Virtual Hand Rehabilitation Platform: Evaluation and Implementation.",
            "Learning Physical Human-Robot Interaction With Coupled Cooperative Primitives for a Lower Exoskeleton.",
            "Metric Learning for Patch-Based 3-D Image Registration.",
            "Reinforced Nonlinear Model With Update-Driven for Gas Component Perception.",
            "Active Perception for Foreground Segmentation: An RGB-D Data-Based Background Modeling Method.",
            "Active Learning-Based Grasp for Accurate Industrial Manipulation.",
            "SalientDSO: Bringing Attention to Direct Sparse Odometry.",
            "Contact Force/Torque Control Based on Viscoelastic Model for Stable Bipedal Walking on Indefinite Uneven Terrain.",
            "A Bionic Robot Navigation Algorithm Based on Cognitive Mechanism of Hippocampus.",
            "Unsupervised Machine Learning Based Scalable Fusion for Active Perception.",
            "Development of a Human-Robot Hybrid Intelligent System Based on Brain Teleoperation and Deep Learning SLAM.",
            "A Fast and Robust Nonparametric Monitoring Scheme for Free-Form Surface Scanning Data.",
            "Spatiotemporal Task Scheduling for Heterogeneous Delay-Tolerant Applications in Distributed Green Data Centers.",
            "A Fast UHF RFID Localization Method Using Unwrapped Phase-Position Model.",
            "Multirate Dynamic Process Monitoring Based on Multirate Linear Gaussian State-Space Model.",
            "Autonomous Robotic Exploration by Incremental Road Map Construction.",
            "Improving Discharge Process at the University of Wisconsin Hospital: A System-Theoretic Method.",
            "Condition-Based Maintenance for Queues With Degrading Servers.",
            "Temporal Prediction of Multiapplication Consolidated Workloads in Distributed Clouds.",
            "Sensor Fusion via Statistical Hypothesis Testing for Prognosis and Degradation Analysis.",
            "Compensating Misalignment Using Dynamic Random-Effect Control System: A Case of High-Mixed Wafer Fabrication.",
            "Interactive-Control-Model for Human-Computer Interactive System Based on Petri Nets.",
            "Multimode Process Monitoring Using Variational Bayesian Inference and Canonical Correlation Analysis.",
            "An Automated System for Projection of Interior Construction Layouts.",
            "Automatic Detection and Classification of Sewer Defects via Hierarchical Deep Learning.",
            "Optimizing Energy Consumption for Lighting Control System via Multivariate Extremum Seeking Control With Diminishing Dither Signal.",
            "A Hybrid MIP-CP Approach to Multistage Scheduling Problem in Continuous Casting and Hot-Rolling Processes.",
            "Congestion Games With Player-Specific Utility Functions and Its Application to NFV Networks.",
            "A Sequential Bayesian Partitioning Approach for Online Steady-State Detection of Multivariate Systems.",
            "Database-Driven Iterative Learning for Building Temperature Control.",
            "Automatic Design of Intercell Scheduling Heuristics.",
            "Online Fault Diagnosis for Industrial Processes With Bayesian Network-Based Probabilistic Ensemble Learning Strategy.",
            "Effective Hot Rolling Batch Scheduling Algorithms in Compact Strip Production.",
            "Structural Liveness Analysis of Automated Manufacturing Systems Modeled by S4PRs.",
            "Optimal Information Release for Mixed Opacity in Discrete-Event Systems.",
            "SCALAR: Simultaneous Calibration of 2-D Laser and Robot Kinematic Parameters Using Planarity and Distance Constraints.",
            "Planar Orientation Control and Torque Maximization Using a Swarm With Global Inputs.",
            "Comments on \"Predictability of Failure Event Occurrences in Decentralized Discrete-Event Systems and Polynomial-Time Verification\"."
        ]
    },
    {
        "name": "TASAE",
        "year": "2018",
        "info": "Volume 15: 2018",
        "count": 163,
        "papers": [
            "Integration of Learning-Based Testing and Supervisory Control for Requirements Conformance of Black-Box Reactive Systems.",
            "Asymptotic Tracking and Robustness of MAS Transitions Under a New Communication Topology.",
            "Optimal Sensor Placement for Monitoring of Spatial Networks.",
            "Image-Guided Nanopositioning Scheme for SEM.",
            "Continuous Tracking Control for a Compliant Actuator With Two-Stage Stiffness.",
            "A Methodological Approach to Model-Driven Design and Development of Automation Systems.",
            "Simultaneous Multiple-Nanowire Motion Control, Planning, and Manipulation Under Electric Fields in Fluid Suspension.",
            "Event-Based Supervisory Control for Energy Efficient Manufacturing Systems.",
            "Design of Vector Field for Different Subphases of Gait and Regeneration of Gait Pattern.",
            "Curved Reflection Symmetric Axes on Free-Form Surfaces and Their Extraction.",
            "A Spectral Graph Theoretic Approach for Monitoring Multivariate Time Series Data From Complex Dynamical Processes.",
            "Multifeature, Sparse-Based Approach for Defects Detection and Classification in Semiconductor Units.",
            "Set-Membership-Based Fault Detection and Isolation for Robotic Assembly of Electrical Connectors.",
            "Analysis and Observations From the First Amazon Picking Challenge.",
            "Planning and Control for Collision-Free Cooperative Aerial Transportation.",
            "Machining-Based Coverage Path Planning for Automated Structural Inspection.",
            "Using Degradation Messages to Predict Hydraulic System Failures in a Commercial Aircraft.",
            "Data-Defect Inspection With Kernel-Neighbor-Density-Change Outlier Factor.",
            "Collision Detection and Signal Recovery for UHF RFID Systems.",
            "A Noise-Tolerant Algorithm for Robot-Sensor Calibration Using a Planar Disk of Arbitrary 3-D Orientation.",
            "Census Signal Temporal Logic Inference for Multiagent Group Behavior Analysis.",
            "Efficient Planar Caging Test Using Space Mapping.",
            "Steering and Control of Miniaturized Untethered Soft Magnetic Grippers With Haptic Assistance.",
            "Fast Linear Quaternion Attitude Estimator Using Vector Observations.",
            "Strategies for Improving and Evaluating Robot Registration Performance.",
            "Interface Design of a Physical Human-Robot Interaction System for Human Impedance Adaptive Skill Transfer.",
            "Chiller Plant Operation Optimization: Energy-Efficient Primary-Only and Primary-Secondary Systems.",
            "A Motion Planning Strategy for the Active Vision-Based Mapping of Ground-Level Structures.",
            "CrowdGIS: Updating Digital Maps via Mobile Crowdsensing.",
            "Analysis With Histogram of Connectivity: For Automated Evaluation of Piping Layout.",
            "Functional Quantitative and Qualitative Models for Quality Modeling in a Fused Deposition Modeling Process.",
            "Revised Test for Stochastic Diagnosability of Discrete-Event Systems.",
            "Localization of Indoor Mobile Robot Using Minimum Variance Unbiased FIR Filter.",
            "Indirect Temperature Measurement and Control Method for Cell Culture Devices.",
            "Toward Good Practices for Fine-Grained Maize Cultivar Identification With Filter-Specific Convolutional Activations.",
            "Occupancy Detection via Environmental Sensing.",
            "Post-Contact, In-Hand Object Motion Compensation With Adaptive Hands.",
            "Web Service Recommendation With Reconstructed Profile From Mashup Descriptions.",
            "An Automated Methodology for Worker Path Generation and Safety Assessment in Construction Projects.",
            "Leader-Follower Consensus of Multivehicle Wirelessly Networked Uncertain Systems Subject to Nonlinear Dynamics and Actuator Fault.",
            "A Novel Semiparametric Hidden Markov Model for Process Failure Mode Identification.",
            "Opportunistic Planning in Autonomous Underwater Missions.",
            "A System-Theoretic Method for Modeling, Analysis, and Improvement of Lung Cancer Diagnosis-to-Surgery Process.",
            "Automatic Segmentation of Stabilometric Signals Using Hidden Markov Model Regression.",
            "Probabilistic Planning and Risk Evaluation Based on Ensemble Weather Forecasting.",
            "Homotopy Path Planning for Terrestrial Robots Using Spherical Algorithm.",
            "Scheduling Cluster Tools in Semiconductor Manufacturing: Recent Advances and Challenges.",
            "Safety-Level Aware Bin-Packing Heuristic for Automatic Assignment of Power Plants Control Functions.",
            "State-of-the-Art Intelligent Flight Control Systems in Unmanned Aerial Vehicles.",
            "Adaptive Neural-Network-Based Active Control of Regenerative Chatter in Micromilling.",
            "Automatic Adjustable Spraying Device for Site-Specific Agricultural Application.",
            "Indoor Relocalization in Challenging Environments With Dual-Stream Convolutional Neural Networks.",
            "Automating High-Precision X-Ray and Neutron Imaging Applications With Robotics.",
            "Online Trajectory Planning and Force Control for Automation of Surgical Tasks.",
            "A Fixture Design Retrieving Method Based on Constrained Maximum Common Subgraph.",
            "Scheduling Single-Armed Cluster Tools With Chamber Cleaning Operations.",
            "Optimizing Container Loading With Autonomous Robots.",
            "Reliable, Distributed Scheduling and Rescheduling for Time-Critical, Multiagent Systems.",
            "Disassembly Sequence Planning Considering Fuzzy Component Quality and Varying Operational Cost.",
            "Quality of Traffic Observability on Highways With Lagrangian Sensors.",
            "Dynamic Cloud Task Scheduling Based on a Two-Stage Strategy.",
            "Weakly Paired Multimodal Fusion for Object Recognition.",
            "VCG Auction-Based Dynamic Pricing for Multigranularity Service Composition.",
            "An Uncalibrated Visual Servo Method Based on Projective Homography.",
            "Overapproximative Human Arm Occupancy Prediction for Collision Avoidance.",
            "Automated Partitioning of Concurrent Discrete-Event Systems for Distributed Behavioral Identification.",
            "Intersection-Free Geometrical Partitioning of Multirobot Stations for Cycle Time Optimization.",
            "Combinatorial Problems in Multirobot Battery Exchange Systems.",
            "Mixed Active/Passive Robust Fault Detection and Isolation Using Set-Theoretic Unknown Input Observers.",
            "Imperfect Maintenance Policy Considering Positive and Negative Effects for Deteriorating Systems With Variation of Operating Conditions.",
            "Motor-Current-Based Estimation of Cartesian Contact Forces and Torques for Robotic Manipulators and Its Application to Force Control.",
            "A System Combining Force and Vision Sensing for Automated Screw Removal on Laptops.",
            "An Improved Model for Parallel Machine Scheduling Under Time-of-Use Electricity Price.",
            "Corrections to \"Energy Efficient Control Strategies for Machine Tools with Stochastic Arrivals\".",
            "Corrections to \"Analysis on Energy Efficient Switching of Machine Tool with Stochastic Arrivals and Buffer Information\".",
            "Guest Editorial Special Issue on the 2016 Workshop on the Algorithmic Foundations of Robotics (WAFR).",
            "Synthesis of Energy-Bounded Planar Caging Grasps Using Persistent Homology.",
            "Equilateral Three-Finger Caging of Polygonal Objects Using Contact Space Search.",
            "Global Redundancy Resolution via Continuous Pseudoinversion of the Forward Kinematic Map.",
            "Assembling and Disassembling Planar Structures With Divisible and Atomic Components.",
            "Passive Reaction Analysis for Grasp Stability.",
            "Estimating Model Utility for Deformable Object Manipulation Using Multiarmed Bandit Methods.",
            "Fast and Bounded Probabilistic Collision Detection for High-DOF Trajectory Planning in Dynamic Environments.",
            "Discovering Petri Net Models of Discrete-Event Processes by Computing T-Invariants.",
            "Finite-Control-Set Model Predictive Control for DFIG Wind Turbines.",
            "Automatic Fabric Defect Detection Using Learning-Based Local Textural Distributions in the Contourlet Domain.",
            "Analytical Approach to Estimate Efficiency of Series Machines in Production Lines.",
            "Automatic and Robust Estimation of Heart Rate in Zebrafish Larvae.",
            "Multiscale Neighborhood Normalization-Based Multiple Dynamic PCA Monitoring Method for Batch Processes With Frequent Operations.",
            "Multiple Quality Characteristics of Nanofluid/Ultrasonic Atomization Minimum Quality Lubrication for Grinding Hardened Mold Steel.",
            "Real-Time Visual Tracking of Dynamic Surgical Suture Threads.",
            "Dual-Objective Program and Scatter Search for the Optimization of Disassembly Sequences Subject to Multiresource Constraints.",
            "A Variable Stiffness Robotic Gripper Based on Structure-Controlled Principle.",
            "Design and Testing of a Flexure-Based Constant-Force Stage for Biological Cell Micromanipulation.",
            "End-to-End Data Delivery Reliability Model for Estimating and Optimizing the Link Quality of Industrial WSNs.",
            "Time-Aware Multi-Application Task Scheduling With Guaranteed Delay Constraints in Green Data Center.",
            "Optimization of Web Service-Based Control System for Balance Between Network Traffic and Delay.",
            "Optimal Expert Knowledge Elicitation for Bayesian Network Structure Identification.",
            "Collaborative Assembly in Hybrid Manufacturing Cells: An Integrated Framework for Human-Robot Interaction.",
            "Delta DLP 3-D Printing of Large Models.",
            "Efficient Task and Path Planning for Maintenance Automation Using a Robot System.",
            "Correctness Guarantees for the Composition of Lane Keeping and Adaptive Cruise Control.",
            "Modeling and Performance Diagnostics of Composite Work Cells With Gantries.",
            "Computational Deep Intelligence Vision Sensing for Nutrient Content Estimation in Agricultural Automation.",
            "A Wavelet-Based Penalized Mixed-Effects Decomposition for Multichannel Profile Detection of In-Line Raman Spectroscopy.",
            "On-Line Initialization and Extrinsic Calibration of an Inertial Navigation System With a Relative Preintegration Method on Manifold.",
            "Interference-Aware Wireless Networks for Home Monitoring and Performance Evaluation.",
            "A Near-Optimal Algorithm for Constraint Test Ordering in Automated Stowage Planning.",
            "Optimal Process Mining for Large and Complex Event Logs.",
            "A Hybrid Dynamical Approach for Allocating Materials in a Dry Bulk Terminal.",
            "Computed-Torque Control for Robotic-Assisted Tele-Echography Based on Perceived Stiffness Estimation.",
            "A Certified-Complete Bimanual Manipulation Planner.",
            "An Optimal Robotic Assembly Sequence Planning by Assembly Subsets Detection Method Using Teaching Learning-Based Optimization Algorithm.",
            "A Novel Geometric Tolerance Modeling Inspired by Parametric Space Envelope.",
            "The Quay Crane Scheduling Problem With Stability Constraints.",
            "Nonlinear Antiswing Control for Crane Systems With Double-Pendulum Swing Effects and Uncertain Parameters: Design and Experiments.",
            "A Heuristic for Inserting Randomly Arriving Jobs Into an Existing Hoist Schedule.",
            "Exploiting Distinguishers in Local Modular Control of Discrete-Event Systems.",
            "Guest Editorial Open Discussion of Robot Grasping Benchmarks, Protocols, and Metrics.",
            "Guest Editorial Special Issue on Advancing Intelligent Automation in Sharing Economy.",
            "Generalized Haar Filter-Based Object Detection for Car Sharing Services.",
            "Individualized Gait Pattern Generation for Sharing Lower Limb Exoskeleton Robot.",
            "Matrix Factorization for Collaborative Budget Allocation.",
            "Production as a Service: A Digital Manufacturing Framework for Optimizing Utilization.",
            "Quick Answer for Big Data in Sharing Economy: Innovative Computer Architecture Design Facilitating Optimal Service-Demand Matching.",
            "Shared Subway Shuttle Bus Route Planning Based on Transport Data Analytics.",
            "Connectivity-Based Accessibility for Public Bicycle Sharing Systems.",
            "Self-Adaptive Collective Motion of Swarm Robots.",
            "Lattice Structure Design and Optimization With Additive Manufacturing Constraints.",
            "A Wavelet-Based Statistical Approach for Monitoring and Diagnosis of Compound Faults With Application to Rolling Bearings.",
            "Robust Sparse Representation-Based Classification Using Online Sensor Data for Monitoring Manual Material Handling Tasks.",
            "Structural Fault Detection and Isolation in Hybrid Systems.",
            "An Accurate Force Regulation Mechanism for High-Speed Handling of Fragile Objects Using Pneumatic Grippers.",
            "Automatic Vision-Guided Micromanipulation for Versatile Deployment and Portable Setup.",
            "Model-Driven Feedforward Prediction for Manipulation of Deformable Objects.",
            "Multivariable Compensation of Hysteresis, Creep, Badly Damped Vibration, and Cross Couplings in Multiaxes Piezoelectric Actuators.",
            "IoT-Enabled Parking Space Sharing and Allocation Mechanisms.",
            "An Online Tool Temperature Monitoring Method Based on Physics-Guided Infrared Image Features and Artificial Neural Network for Dry Cutting.",
            "An Efficient Deadlock Prevention Policy for Noncyclic Scheduling of Multicluster Tools.",
            "A Methodology for Efficient Dynamic Spatial Sampling and Reconstruction of Wafer Profiles.",
            "An Accurate Mura Defect Vision Inspection Method Using Outlier-Prejudging-Based Image Background Construction and Region-Gradient-Based Level Set.",
            "MASD: A Multimodal Assembly Skill Decoding System for Robot Programming by Demonstration.",
            "Real-Time Manufacturing Machine and System Performance Monitoring Using Internet of Things.",
            "Coupling Degree Clustering-Based Distributed Model Predictive Control Network Design.",
            "Human-Centric Automation and Optimization for Smart Homes.",
            "Optimizing Makespan and Ergonomics in Integrating Collaborative Robots Into Manufacturing Processes.",
            "Set-Based Control for Autonomous Spray Painting.",
            "Minimizing Expected Cycle Time of Stochastic Customer Orders Through Bounded Multi-Fidelity Simulations.",
            "Active Vision via Extremum Seeking for Robots in Unstructured Environments: Applications in Object Recognition and Manipulation.",
            "Planning for Manipulation of Interlinked Deformable Linear Objects With Applications to Aircraft Assembly.",
            "Industrially Applicable System Regression Test Prioritization in Production Automation.",
            "A Novel Task Coordinate Frame Reduced- Dimension 3-D Contouring Control.",
            "Toward a New Methodology for an Efficient Test of Reconfigurable Hardware Systems.",
            "Toward the Advancement of Decision Support Tools for Industrial Facilities: Addressing Operation Metrics, Visualization Plots, and Alarm Floods.",
            "Automatic Discovery of Behavioral Models From Software Execution Data.",
            "Event-Based HVAC Control - A Complexity-Based Approach.",
            "A Group-Oriented DTLS Handshake for Secure IoT Applications.",
            "Event-Based Modeling and Analysis of Sensor Enabled Networked Manufacturing Systems.",
            "Distributed Estimation and Control for Leader-Following Formations of Nonholonomic Mobile Robots.",
            "Unrelated Parallel Machine Selection and Job Scheduling With the Objective of Minimizing Total Workload and Machine Fixed Costs.",
            "Stability Analysis of Discrete Event Systems Modeled by Petri Nets Using Unfoldings.",
            "Robust Chatter Mitigation Control for Low Radial Immersion Machining Processes.",
            "List of Reviewers for 2017/2018."
        ]
    },
    {
        "name": "TASAE",
        "year": "2017",
        "info": "Volume 14: 2017",
        "count": 156,
        "papers": [
            "Guest Editorial Special Section on the Thirteenth IEEE International Symposium on Safety, Security, and Rescue Robotics.",
            "Classification of Outdoor 3D Lidar Data Based on Unsupervised Gaussian Mixture Models.",
            "Coordinated Path Planning for Fixed-Wing UAS Conducting Persistent Surveillance Missions.",
            "Environment Exploration in Sensing Automation for Habitat Monitoring.",
            "Monocular Visual-Inertial State Estimation With Online Initialization and Camera-IMU Extrinsic Calibration.",
            "Parallel Interacting Multiple Model-Based Human Motion Prediction for Motion Planning of Companion Robots.",
            "Postdisaster Electric Power Recovery Using Autonomous Vehicles.",
            "Prescriptive Modeling and Compensation of In-Plane Shape Deformation for 3-D Printed Freeform Products.",
            "Automatic Generation of Five-Axis Continuous Inspection Paths for Free-Form Surfaces.",
            "Extended-State-Observer-Based Funnel Control for Nonlinear Servomechanisms With Prescribed Tracking Performance.",
            "RWiN: New Methodology for the Development of Reconfigurable WSN.",
            "Locally Weighted Prediction Methods for Latent Factor Analysis With Supervised and Semisupervised Process Data.",
            "Operation Process Rebuilding (OPR)-Oriented Maintenance Policy for Changeable System Structures.",
            "WCE Abnormality Detection Based on Saliency and Adaptive Locality-Constrained Linear Coding.",
            "Layman Analytics System: A Cloud-Enabled System for Data Analytics Workflow Recommendation.",
            "Selective Assembly System With Unreliable Bernoulli Machines and Finite Buffers.",
            "Quantification of Secrecy in Partially Observed Stochastic Discrete Event Systems.",
            "Generalized Wavelet Shrinkage of Inline Raman Spectroscopy for Quality Monitoring of Continuous Manufacturing of Carbon Nanotube Buckypaper.",
            "Dirichlet Process Gaussian Mixture Models for Real-Time Monitoring and Their Application to Chemical Mechanical Planarization.",
            "Matching Misaligned Two-Resolution Metrology Data.",
            "Precision Motion Control of Piezoelectric Nanopositioning Stage With Chattering-Free Adaptive Sliding Mode Control.",
            "Online Learning Control of Hydraulic Excavators Based on Echo-State Networks.",
            "Visual-Inertial Navigation Systems for Aerial Robotics: Sensor Fusion and Technology.",
            "A Dynamic-Bayesian-Network-Based Fault Diagnosis Methodology Considering Transient and Intermittent Faults.",
            "Optimized Train-Set Rostering Plan for Taiwan High-Speed Rail.",
            "Adaptive Fault-Tolerant Tracking Control for MIMO Discrete-Time Systems via Reinforcement Learning Algorithm With Less Learning Parameters.",
            "Finding the Kinematic Base Frame of a Robot by Hand-Eye Calibration Using 3D Position Data.",
            "A Novel Control Approach for High-Precision Positioning of a Piezoelectric Tube Scanner.",
            "Temporal Task Scheduling With Constrained Service Delay for Profit Maximization in Hybrid Clouds.",
            "Comparing Theoretical and Experimental Results in Gen2 RFID Throughput.",
            "Learning Bayesian Network Structures to Augment Aircraft Diagnostic Reference Models.",
            "A Method for Optimizing the Base Position of Mobile Painting Manipulators.",
            "Stochastic Point-to-Point Iterative Learning Tracking Without Prior Information on System Matrices.",
            "Discretization-Based and Look-Ahead Algorithms for the Dubins Traveling Salesperson Problem.",
            "Dynamic Task Execution Using Active Parameter Identification With the Baxter Research Robot.",
            "Performance Analysis of LDPC-Based RFID Group Coding.",
            "Guest Editorial A Remarkable Resurgence of Artificial Intelligence and Its Impact on Automation and Autonomy.",
            "Guest Editorial Special Issue on Automation and Optimization for Energy Systems.",
            "Distributed Optimal Coordination for Distributed Energy Resources in Power Systems.",
            "Optimal Day-Ahead Operation Considering Power Quality for Active Distribution Networks.",
            "Online Reconfiguration of Active Distribution Networks for Maximum Integration of Distributed Generation.",
            "Command Governor Strategies for the Online Management of Reactive Power in Smart Grids With Distributed Generation.",
            "Full Stochastic Scheduling for Low-Carbon Electricity Systems.",
            "Overgrid: A Fully Distributed Demand Response Architecture Based on Overlay Networks.",
            "A Bilevel Approach for the Stochastic Optimal Operation of Interconnected Microgrids.",
            "Distributed Optimal Control of Smart Electricity Grids With Congestion Management.",
            "A Hierarchical Decision-Making Strategy for the Energy Management of Smart Cities.",
            "Nonlinear Control of a DC MicroGrid for the Integration of Photovoltaic Panels.",
            "Hierarchical Predictive Control of Microgrids in Islanded Operation.",
            "Model Predictive Control-Based Optimal Operations of District Heating System With Thermal Energy Storage and Flexible Loads.",
            "Asynchronous Distributed Control of Biogas Supply and Multienergy Demand.",
            "Operation and Design Optimization of Microgrids With Renewables.",
            "Energy Management Improvement of Hybrid Electric Vehicles via Combined GPS/Rule-Based Methodology.",
            "Smart Procurement of Naturally Generated Energy (SPONGE) for Plug-In Hybrid Electric Buses.",
            "Power Management for Hybrid Energy Storage System of Electric Vehicles Considering Inaccurate Terrain Information.",
            "Energy Management of a Building Cooling System With Thermal Storage: An Approximate Dynamic Programming Solution.",
            "Automated Performance Tracking for Heat Exchangers in HVAC.",
            "Energy and Peak Power Optimization of Time-Bounded Robot Trajectories.",
            "Conflict Between Energy, Stability, and Robustness in Production Schedules.",
            "Integrated Methodology for Production Optimization from Multiple Offshore Reservoirs in the Santos Basin.",
            "Rotational Speed Optimization in Oscillating Water Column Wave Power Plants Based on Maximum Power Point Tracking.",
            "Guest Editorial Special Section on the 2015 International Conference on Automation Science and Engineering.",
            "A Multi-Timescale and Bilevel Coordination Approach for Matching Uncertain Wind Supply With EV Charging Demand.",
            "Fault Diagnosis of HVAC Air-Handling Systems Considering Fault Propagation Impacts Among Components.",
            "Optimal Planning of Plant Flexibility: Problem Formulation and Performance Analysis.",
            "A Decision Support System for Cooperative Logistics.",
            "Throughputs Maximization of Stochastic Customer Orders Under Two Production Schemes.",
            "A Real-Time Access Control of Patient Service in the Outpatient Clinic.",
            "Time Optimal Synthesis Based Upon Sequential Abstraction and Its Application to Cluster Tools.",
            "Decentralized Optimal Control of Distributed Interdependent Automata With Priority Structure.",
            "Task and Motion Coordination for Heterogeneous Multiagent Systems With Loosely Coupled Local Tasks.",
            "Real-Time Grasping Planning for Robotic Bin-Picking and Kitting Applications.",
            "Automated System for Semantic Object Labeling With Soft-Object Recognition and Dynamic Programming Segmentation.",
            "Microscale Compression and Shear Testing of Soft Materials Using an MEMS Microgripper With Two-Axis Actuators and Force Sensors.",
            "Design and Analysis of Electrical Resistance Feedback for Automated Patch Clamp on Adherent Cells.",
            "Human Intention Inference Using Expectation-Maximization Algorithm With Online Model Learning.",
            "Experimental Evaluation of Nearest Neighbor Exploration Approach in Field Environments.",
            "Solving Feeder Assignment and Component Sequencing Problems for Printed Circuit Board Assembly Using Particle Swarm Optimization.",
            "Translation-Invariant Multiscale Energy-Based PCA for Monitoring Batch Processes in Semiconductor Manufacturing.",
            "Sensitivity Analysis for Building Energy Simulation Model Calibration via Algorithmic Differentiation.",
            "Classification of EMG Signals by BFA-Optimized GSVCM for Diagnosis of Fatigue Status.",
            "Tensor Voting Guided Mesh Denoising.",
            "Relative Entropy-Based Density Selection in Particle Filtering for Load Demand Forecast.",
            "Mobile RFID System in the Presence of Denial-of-Service Attacking Signals.",
            "In-Plane Shape-Deviation Modeling and Compensation for Fused Deposition Modeling Processes.",
            "Supply Chain Network Design Considering RFID Adoption.",
            "Parallel Multiagent Coordination Optimization Algorithm: Implementation, Evaluation, and Applications.",
            "Visual-Tactile Fusion for Object Recognition.",
            "Improvement of Drug Delivery Routes Through the Adoption of Multi-Operator Evolutionary Algorithms and Intelligent Vans Capable of Reporting Real-Time Incidents.",
            "Programming a Robot for Conformance Grinding of Complex Shapes by Capturing the Tacit Knowledge of a Skilled Operator.",
            "Monitoring Spatial Uniformity of Particle Distributions in Manufacturing Processes Using the K Function.",
            "Controlling the Residual Life Distribution of Parallel Unit Systems Through Workload Adjustment.",
            "Sensor Multifault Diagnosis With Improved Support Vector Machines.",
            "Optimal Multi-Degree Cyclic Solution of Multi-Hoist Scheduling Without Overlapping.",
            "On the Polygon Containment Problem on an Isometric Grid.",
            "Optimization of Deterministic Timed Weighted Marked Graphs.",
            "Boosting Active Contours for Weld Pool Visual Tracking in Automatic Arc Welding.",
            "Orienting Parts With Shape Variation.",
            "A System for Automated Detection of Ampoule Injection Impurities.",
            "A Novel Decentralized Process Monitoring Scheme Using a Modified Multiblock PCA Algorithm.",
            "Modeling Interaction in Nanowire Growth Process Toward Improved Yield.",
            "Increasing Throughput for a Class of Two-Machine Robotic Cells Served by a Multifunction Robot.",
            "State-Based General Gamma CUSUM for Modeling Heart Rate Variability Using Electrocardiography Signals.",
            "Application-Aware Dynamic Fine-Grained Resource Provisioning in a Virtualized Cloud Data Center.",
            "A Sequential Budget Allocation Framework for Simulation Optimization.",
            "Elastic Resource Provisioning for Cloud Workflow Applications.",
            "Residual Life Prediction of Multistage Manufacturing Processes With Interaction Between Tool Wear and Product Quality Degradation.",
            "Automatic Control of Cycling Induced by Functional Electrical Stimulation With Electric Motor Assistance.",
            "Time-Optimal Path Planning With Power Schedules for a Solar-Powered Ground Robot.",
            "Lightweight Mashup Middleware for Coal Mine Safety Monitoring and Control Automation.",
            "Deformable Patterned Fabric Defect Detection With Fisher Criterion-Based Deep Learning.",
            "Improvement in the Imaging Performance of Atomic Force Microscopy: A Survey.",
            "Multistep Forecasting Models of the Liquid Level in a Blast Furnace Hearth.",
            "Nonlinear Energy-Based Regulation Control of Three-Dimensional Overhead Cranes.",
            "Non-Gaussian Industrial Process Monitoring With Probabilistic Independent Component Analysis.",
            "A Black-Box Identification Method for Automated Discrete-Event Systems.",
            "A Hybrid Multi-Objective Scheme Applied to Redundant Robot Manipulators.",
            "An ANN-GA Semantic Rule-Based System to Reduce the Gap Between Predicted and Actual Energy Consumption in Buildings.",
            "Automated Planning for Robotic Cleaning Using Multiple Setups and Oscillatory Tool Motions.",
            "Automatic Detection of Defects in Tire Radiographic Images.",
            "Closed-Loop Control of a Magnetic Particle at the Air-Liquid Interface.",
            "Context-Aware Energy Saving System With Multiple Comfort-Constrained Optimization in M2M-Based Home Environment.",
            "Design and Development of a Novel Compliant Gripper With Integrated Position and Grasping/Interaction Force Sensing.",
            "Design of a Gait Phase Recognition System That Can Cope With EMG Electrode Location Variation.",
            "Distributed Consensus of Multiple Euler-Lagrange Systems Networked by Sampled-Data Information With Transmission Delays and Data Packet Dropouts.",
            "Electronic Visits in Primary Care: Modeling, Analysis, and Scheduling Policies.",
            "High-Speed Tracking of a Nanopositioning Stage Using Modified Repetitive Control.",
            "Mobile Service Selection for Composition: An Energy Consumption Perspective.",
            "Modeling and Analysis of the Reliability of Digital Networked Control Systems Considering Networked Degradations.",
            "Optimize the Signal Quality of the Composite Health Index via Data Fusion for Degradation Modeling and Prognostic Analysis.",
            "Position Control of Asymmetric Nonlinearities for a Cable-Conduit Mechanism.",
            "RISE-Based Adaptive Control of Hydraulic Systems With Asymptotic Tracking.",
            "Supervised Learning of Human Welder Behaviors for Intelligent Robotic Welding.",
            "The Impacts of Carbon Tariff on Green Supply Chain Design.",
            "Minimizing Completion Time for Order Scheduling: Formulation and Heuristic Algorithm.",
            "Control Design for Disturbance Rejection in the Presence of Uncertain Delays.",
            "Phase Partition and Online Monitoring for Batch Process Based on Multiway BEAM.",
            "The Optimization for Hyperbolic Positioning of UHF Passive RFID Tags.",
            "Low-Cost Adaptive Lebesgue Sampling Particle Filtering Approach for Real-Time Li-Ion Battery Diagnosis and Prognosis.",
            "Functional Graphical Models for Manufacturing Process Modeling.",
            "Completion Time Analysis of Wafer Lots in Single-Armed Cluster Tools With Parallel Processing Modules.",
            "Job Scheduling at Cascading Machines.",
            "Stochastic Approach for Feature-Based Tip Localization and Planning in Nanomanipulations.",
            "Simulation Optimization for Medical Staff Configuration at Emergency Department in Hong Kong.",
            "Concise Planning and Filtering: Hardness and Algorithms.",
            "Modeling and Offset-Free Model Predictive Control of a Hydraulic Mini Excavator.",
            "Robust Deadlock Avoidance for Sequential Resource Allocation Systems With Resource Outages.",
            "Automated Transportation of Biological Cells for Multiple Processing Steps in Cell Surgery.",
            "Probabilistic Automata Model of a Soft Robot for the Planning of Manipulation Tasks.",
            "Weight-Balanced Timed Event Graphs to Model Periodic Phenomena in Manufacturing Systems.",
            "Toward Socially Aware Robot Navigation in Dynamic and Crowded Environments: A Proactive Social Motion Model.",
            "Data-Based Predictive Optimization for Byproduct Gas System in Steel Industry.",
            "A Wafer Prealignment Algorithm Based on Fourier Transform and Least Square Regression.",
            "Dynamic Positioning of Vessels Using a UKF-Based Observer and an NMPC-Based Controller.",
            "Process Mining to Discover Shoppers' Pathways at a Fashion Retail Store Using a WiFi-Base Indoor Positioning System.",
            "List of Reviewers for 2016/2017."
        ]
    },
    {
        "name": "TASAE",
        "year": "2016",
        "info": "Volume 13: 2016",
        "count": 139,
        "papers": [
            "Editorial Fine-Tuning T-ASE.",
            "Guest Editorial Special Section on Human-Centered Automation.",
            "Synthesis of Shared Autonomy Policies With Temporal Logic Specifications.",
            "Attempting to Automate Compliance to Aircraft Collision Avoidance Advisories.",
            "Predictive Haptic Feedback for Obstacle Avoidance Based on Model Predictive Control.",
            "A Learning-Based Framework for Velocity Control in Autonomous Driving.",
            "Design of Driver-Assist Systems Under Probabilistic Safety Specifications Near Stop Signs.",
            "Parameter Estimation in Softmax Decision-Making Models With Linear Objective Functions.",
            "A Framework for Multilateral Manipulation in Surgical Tasks.",
            "Observability of User-Interfaces for Hybrid LTI Systems Under Collaborative Control: Application to Aircraft Flight Management Systems.",
            "Event-Aware Framework for Dynamic Services Discovery and Selection in the Context of Ambient Intelligence and Internet of Things.",
            "Guest Editorial Special Section on the 2014 International Conference on Automation Science and Engineering.",
            "Efficient Algorithms for Analysis and Improvement of Flexible Manufacturing Systems.",
            "Fault Diagnosis Method of Joint Fisher Discriminant Analysis Based on the Local and Global Manifold Learning and Its Kernel Version.",
            "Finite Production Run-Based Serial Lines With Bernoulli Machines: Performance Analysis, Bottleneck, and Case Study.",
            "Integrating Optimal Simulation Budget Allocation and Genetic Algorithm to Find the Approximate Pareto Patient Flow Distribution.",
            "Integration of Modified Inverse Observation Model and Multiple Hypothesis Tracking for Detecting and Tracking Humans.",
            "Sensory Cues Guided Rehabilitation Robotic Walker Realized by Depth Image-Based Gait Analysis.",
            "A Faster Branch-and-Bound Algorithm for the Block Relocation Problem.",
            "Modeling and Optimization of Hybrid Systems for the Tweeting Factory.",
            "Optimal Integration of Alternative Energy Sources in Production Systems With Customer Demand Forecast.",
            "Sparse Modeling and Recursive Prediction of Space-Time Dynamics in Stochastic Sensor Networks.",
            "Development and Validation of an Automated Steering Control System for Bus Revenue Service.",
            "Analysis on Energy Efficient Switching of Machine Tool With Stochastic Arrivals and Buffer Information.",
            "Robust Scheduling of Smart Appliances in Active Apartments With User Behavior Uncertainty.",
            "Adaptive Iterative Learning Control for High-Speed Trains With Unknown Speed Delays and Input Saturations.",
            "An Optimized Feedforward Decoupling PD Register Control Method of Roll-to-Roll Web Printing Systems.",
            "Output Feedback Guaranteed Cost Control for Networked Control Systems With Random Packet Dropouts and Time Delays in Forward and Feedback Communication Links.",
            "Scheduling Internal Operations in Post-Distribution Cross Docking Systems.",
            "Modeling and Control of Piezo-Actuated Nanopositioning Stages: A Survey.",
            "An Incremental-and-Static-Combined Scheme for Matrix-Factorization-Based Collaborative Filtering.",
            "Integration of Data Fusion Methodology and Degradation Modeling Process to Improve Prognostics.",
            "Robust Total Energy Optimization of Flexible Manufacturing Systems Based on Renyi Mean-Entropy Criterion.",
            "Finite-Time Tracking Control of Rigid Spacecraft Under Actuator Saturations and Faults.",
            "High Precision Automatic Assembly Based on Microscopic Vision and Force Information.",
            "Immersion and Invariance-Based Output Feedback Control of Air-Breathing Hypersonic Vehicles.",
            "Reducing Occupational Neck Pain With a Passive Neck Orthosis.",
            "Guest Editorial Industry 4.0-Prerequisites and Visions.",
            "Guest Editorial Special Section on the 11th Workshop on the Algorithmic Foundations of Robotics (WAFR 2014).",
            "Optimal Path Planning in Complex Cost Spaces With Sampling-Based Algorithms.",
            "Online Coverage of Planar Environments by a Battery Powered Autonomous Mobile Robot.",
            "Stochastic Extended LQR for Optimization-Based Motion Planning Under Uncertainty.",
            "Guest Editorial Special Section on Control and Automation From the 2015 International Conference on Cyber-Physical Systems (ICCPS).",
            "Synthesis of Human-in-the-Loop Control Protocols for Autonomous Systems.",
            "Taxi Dispatch With Real-Time Sensing Data in Metropolitan Areas: A Receding Horizon Control Approach.",
            "Computationally Aware Switching Criteria for Hybrid Model Predictive Control of Cyber-Physical Systems.",
            "Controller Integrity Monitoring in Adaptive Learning Systems Towards Trusted Autonomy.",
            "Multicontact Locomotion on Transfemoral Prostheses via Hybrid System Models and Optimization-Based Control.",
            "Modeling and Analysis of Ward Patient Rescue Process on the Hospital Floor.",
            "Improved Bag of Feature for Automatic Polyp Detection in Wireless Capsule Endoscopy Images.",
            "An Efficient and Robust Method for Automatically Identifying the Left Ventricular Boundary in Cine Magnetic Resonance Images.",
            "Automated Translational and Rotational Control of Biological Cells With a Robot-Aided Optical Tweezers Manipulation System.",
            "Needle Grasp and Entry Port Selection for Automatic Execution of Suturing Tasks in Robotic Minimally Invasive Surgery.",
            "Performance Guarantee of an Approximate Dynamic Programming Policy for Robotic Surveillance.",
            "NCSR: Negative-Connection-Aware Service Recommendation for Large Sparse Service Network.",
            "Automated Crack Detection on Concrete Bridges.",
            "A Hybrid Physics-Based and Data Driven Approach to Optimal Control of Building Cooling/Heating Systems.",
            "Vision-Based Coordinated Localization for Mobile Sensor Networks.",
            "A Task-Oriented Framework for Networked Wearable Computing.",
            "Development of a Pneumatic Sucker for Gripping Workpieces With Rough Surface.",
            "Modeling and Verification of Online Shopping Business Processes by Considering Malicious Behavior Patterns.",
            "Production Lead Time in Serial Lines: Evaluation, Analysis, and Control.",
            "Sustainable Manufacturing Performance Indicators for a Serial Production Line.",
            "Online Steady-State Detection for Process Control Using Multiple Change-Point Models and Particle Filters.",
            "Quantile-Based Simulation Optimization With Inequality Constraints: Methodology and Applications.",
            "Multidomain Model Integration for Online Collaborative System Design and Detailed Design of Complex Mechatronic Systems.",
            "Kinematic Control With Singularity Avoidance for Teaching-Playback Robot Manipulator System.",
            "Parameterized Distortion-Invariant Feature for Robust Tracking in Omnidirectional Vision.",
            "Stereo Vision Based Automated Solder Ball Height and Substrate Coplanarity Inspection.",
            "Adaptive Fuzzy Control of a Class of MIMO Nonlinear System With Actuator Saturation for Greenhouse Climate Control Problem.",
            "An Automated Force-Controlled Robotic Micromanipulation System for Mechanotransduction Studies of Drosophila Larvae.",
            "Learning to Detect Visual Grasp Affordance.",
            "Exploiting Moving Objects: Multi-Robot Simultaneous Localization and Tracking.",
            "Combining Dynamic Machining Feature With Function Blocks for Adaptive Machining.",
            "A Timed Petri Nets Model for Performance Evaluation of Intermodal Freight Transport Terminals.",
            "Optimal, Efficient Sequential Control of a Soft-Bodied, Peristaltic Sorting Table.",
            "Disturbance Observer-Based Adaptive Tracking Control With Actuator Saturation and Its Application.",
            "Early Frame Break Policy for ALOHA-Based RFID Systems.",
            "Safety in Human-Robot Collaborative Manufacturing Environments: Metrics and Control.",
            "A Biologically Inspired Automatic System for Media Quality Assessment.",
            "A Spatial Calibration Model for Nanotube Film Quality Prediction.",
            "Optimal Inventory Control and Pricing of Perishable Items Without Shortages.",
            "A Hybrid Fruit Fly Optimization Algorithm for the Realistic Hybrid Flowshop Rescheduling Problem in Steelmaking Systems.",
            "An Iterative Approach for Collision Free Routing and Scheduling in Multirobot Stations.",
            "Optimal Sensor Deployment for Manufacturing Process Monitoring Based on Quantitative Cause-Effect Graph.",
            "CAWSAC: Cost-Aware Workload Scheduling and Admission Control for Distributed Cloud Data Centers.",
            "Performance Evaluation of Modularized Global Equalization System for Lithium-Ion Battery Packs.",
            "Adaptive Learning in Time-Variant Processes With Application to Wind Power Systems.",
            "Incorporation of Optimal Computing Budget Allocation for Ordinal Optimization Into Learning Automata.",
            "Performance Analysis of Assembly Systems With Bernoulli Machines and Finite Buffers During Transients.",
            "Heterogeneous Sensor Data Fusion Approach for Real-time Monitoring in Ultraprecision Machining (UPM) Process Using Non-Parametric Bayesian Clustering and Evidence Theory.",
            "An Overview of Industrial Alarm Systems: Main Causes for Alarm Overloading, Research Status, and Open Problems.",
            "Contouring Control of Multi-Axis Motion Systems for NURBS Paths.",
            "A Hybrid Evolutionary Hyper-Heuristic Approach for Intercell Scheduling Considering Transportation Capacity.",
            "Model-Based Location Tracking of an a priori Unknown Number of Inhabitants in Smart Homes.",
            "An Automatic Process Monitoring Method Using Recurrence Plot in Progressive Stamping Processes.",
            "An Integrated System for Production Scheduling in Steelmaking and Casting Plants.",
            "Comprehensive Monitoring of Nonlinear Processes Based on Concurrent Kernel Projection to Latent Structures.",
            "Parallel Machine Scheduling Under Time-of-Use Electricity Prices: New Models and Optimization Approaches.",
            "Learning Time Delay Mealy Machines From Programmable Logic Controllers.",
            "Optimal Scheduling of Transient Cycles for Single-Armed Cluster Tools With Parallel Chambers.",
            "Modeling, Analysis, and Scheduling of Cluster Tools With Two Independent Arms.",
            "Feedback Control of Cluster Tools for Regulating Wafer Delays.",
            "Queue Time Approximations for a Cluster Tool With Job Cascading.",
            "Kinematic Analysis and Motion Control of Wheeled Mobile Robots in Cylindrical Workspaces.",
            "Approaching Minimal Time Control Sequences for Timed Petri Nets.",
            "Guest Editorial Special Section on Advances and Applications of Internet of Things for Smart Automated Systems.",
            "Efficient Distributed Query Processing.",
            "Smart Configuration of Smart Environments.",
            "Energy-Centered and QoS-Aware Services Selection for Internet of Things.",
            "S3K: Scalable Security With Symmetric Keys - DTLS Key Establishment for the Internet of Things.",
            "On Secure Wireless Communications for IoT Under Eavesdropper Collusion.",
            "Enhanced Fingerprinting and Trajectory Prediction for IoT Localization in Smart Buildings.",
            "Point-n-Press: An Intelligent Universal Remote Control System for Home Appliances.",
            "IoT-Enabled Real-Time Production Performance Analysis and Exception Diagnosis Model.",
            "An Active RFID Tag-Enabled Locating Approach With Multipath Effect Elimination in AGV.",
            "Nonlinear Process Monitoring Using Regression and Reconstruction Method.",
            "Bayesian Hierarchical Linear Modeling of Profile Data With Applications to Quality Control of Nanomanufacturing.",
            "Polygon-Invariant Generalized Hough Transform for High-Speed Vision-Based Positioning.",
            "Real-Time Dynamic-Mode Scheduling Using Single-Integration Hybrid Optimization.",
            "Observer-Based Robust Control of 6-DOF Parallel Electrical Manipulator With Fast Friction Estimation.",
            "Schedulability Analysis for Noncyclic Operation of Time-Constrained Cluster Tools With Time Variation.",
            "Editorial: \"One Robot is Robotics, Ten Robots is Automation\".",
            "Guest Editorial Special Section on Emerging Advances in Logistics Systems: Integrating Remote Sensing, IT, and Autonomy.",
            "Improving Transferability Between Different Engineering Stages in the Development of Automated Material Flow Modules.",
            "Decentralized Control of Multi-AGV Systems in Autonomous Warehousing Applications.",
            "Optimal Planning of Door-to-Door Multiple Materials Separated Waste Collection.",
            "A Decision Support Approach for Postal Delivery and Waste Collection Services.",
            "Achieving Economic and Environmental Sustainabilities in Urban Consolidation Center With Bicriteria Auction.",
            "A Simulation-Based Multiobjective Optimization Approach for Health Care Service Management.",
            "An MILP Optimization Problem for Sizing Port Rail Networks and Planning Shunting Operations in Container Terminals.",
            "A Generalized Stochastic Petri Net Approach for Modeling Activities of Human Operators in Intermodal Container Terminals.",
            "On Physical Internet Logistics: Modeling the Impact of Consolidation on Transportation and Inventory Costs.",
            "Robust Networked Control of Discrete Event Systems.",
            "A Novel Model Repair Approach of Timed Discrete-Event Systems With Anomalies.",
            "QoS-Driven Power Management of Data Centers via Model Predictive Control.",
            "A Novel Route Selection and Resource Allocation Approach to Improve the Efficiency of Manual Material Handling System in 200-mm Wafer Fabs for Industry 3.5.",
            "Learnability of the Moving Surface Profiles of a Soft Robotic Sorting Table.",
            "An Experimental Design for Processing Parameter Optimization for Cathode Arc Plasma Deposition of ZnO Films."
        ]
    },
    {
        "name": "TASAE",
        "year": "2015",
        "info": "Volume 12: 2015",
        "count": 140,
        "papers": [
            "Guest Editorial Special Section on the 2013 International Conference on Automation Science and Engineering.",
            "A Sensor-Based Dual-Arm Tele-Robotic System.",
            "Low-Dimensional Learning for Complex Robots.",
            "Trajectory Optimization for Well-Conditioned Parameter Estimation.",
            "Motion Control, Planning and Manipulation of Nanowires Under Electric-Fields in Fluid Suspension.",
            "Energy-Efficient Control Strategies for Machine Tools With Stochastic Arrivals.",
            "On Equilibrium Probabilities for the Delays in Deterministic Flow Lines With Random Arrivals.",
            "A Sampling Decision System for Virtual Metrology in Semiconductor Manufacturing.",
            "Efficient Proximity Probing Algorithms for Metrology.",
            "Mathematical Programming Models for Annual and Weekly Bloodmobile Collection Planning.",
            "An Automatic Screening Approach for Obstructive Sleep Apnea Diagnosis Based on Single-Lead Electrocardiogram.",
            "Treatment Planning for Volumetric-Modulated Arc Therapy: Model and Heuristic Algorithms.",
            "Bottleneck Analysis to Reduce Surgical Flow Disruptions: Theory and Application.",
            "Structured Linearization of Discrete Mechanical Systems for Analysis and Optimal Control.",
            "A Toolkit for Modeling and Simulation of Real-Time Virtual Machine Allocation in a Cloud Data Center.",
            "Stochastic Modeling and Quality Evaluation of Infrastructure-as-a-Service Clouds.",
            "Asymptotically Optimal Motion Planning for Learned Tasks Using Time-Dependent Cost Maps.",
            "High Precision Conservative Surface Mesh Generation for Swept Volumes.",
            "A Run-to-Run Profile Control Algorithm for Improving the Flatness of Nano-Scale Products.",
            "Simultaneous Vision-Based Shape and Motion Analysis of Cells Fast-Flowing in a Microchannel.",
            "Image-Based Process Monitoring Using Low-Rank Tensor Decomposition.",
            "Energy Efficient Ethernet for Real-Time Industrial Networks.",
            "Energy-Efficient Models of Sustainable Location for a Vehicle Inspection Station With Emission Constraints.",
            "Customer Order Scheduling on Unrelated Parallel Machines to Minimize Total Completion Time.",
            "Dynamic Low-Power Reconfiguration of Real-Time Systems With Periodic and Probabilistic Tasks.",
            "Multiple-Mode Observer Design for a Class of Switched Linear Systems.",
            "Petri Net Decomposition Approach to Deadlock-Free and Non-Cyclic Scheduling of Dual-Armed Cluster Tools.",
            "A Polynomial Algorithm to Performance Analysis of Concurrent Systems Via Petri Nets and Ordinary Differential Equations.",
            "A Branch and Bound Algorithm for Cyclic Scheduling of Timed Petri Nets.",
            "Dynamic Neuro-Fuzzy-Based Human Intelligence Modeling and Control in GTAW.",
            "Multiobjective Flexible Job Shop Scheduling Using Memetic Algorithms.",
            "Self-Diagnosis Technique for Virtual Private Networks Combining Bayesian Networks and Case-Based Reasoning.",
            "Intensity-Based Visual Servoing for Instrument and Tissue Tracking in 3D Ultrasound Volumes.",
            "An Improved Algorithm for the Automated Design of Large-Scaled Robot Skin.",
            "Automatic Control System for Thermal Comfort Based on Predicted Mean Vote and Energy Saving.",
            "A Novel Backtracking Scheme for Attitude Determination-Based Initial Alignment.",
            "Editorial Multiplicity Has More Potential Than Singularity.",
            "Guest Editorial Special Issue on Cloud Robotics and Automation.",
            "A Survey of Research on Cloud Robotics and Automation.",
            "Computation Sharing in Distributed Robotic Systems: A Case Study on SLAM.",
            "Cloud-Based Collaborative 3D Mapping in Real-Time With Low-Cost Robots.",
            "RoboEarth Semantic Mapping: A Cloud Enabled Knowledge-Based Approach.",
            "A Tradeoff Analysis of a Cloud-Based Robot Navigation Assistant Using Stereo Image Processing.",
            "Cloud-Based Grasp Analysis and Planning for Toleranced Parts Using Parallelized Monte Carlo Sampling.",
            "Dynamic Collaboration Between Networked Robots and Clouds in Resource-Constrained Environments.",
            "Rapyuta: A Cloud Robotics Platform.",
            "Inside the Virtual Robotics Challenge: Simulating Real-Time Robotic Disaster Response.",
            "Real-Time Multisensor Data Retrieval for Cloud Robotic Systems.",
            "On Distributed Knowledge Bases for Robotized Small-Batch Assembly.",
            "On the Power of Manifold Samples in Exploring Configuration Spaces and the Dimensionality of Narrow Passages.",
            "Estimating Clearing Functions for Production Resources Using Simulation Optimization.",
            "Automatic Bird Species Filtering Using a Multimodel Approach.",
            "Model Predictive Control of Central Chiller Plant With Thermal Energy Storage Via Dynamic Programming and Mixed-Integer Linear Programming.",
            "Stochastic Cost-Profit Tradeoff Model for Locating an Automotive Service Enterprise.",
            "Towards Occlusion-Free Surgical Instrument Tracking: A Modular Monocular Approach and an Agile Calibration Method.",
            "Automatic Color Inspection for Colored Wires in Electric Cables.",
            "Using Manipulation Primitives for Object Sorting in Cluttered Environments.",
            "The Influence of Motion Paths and Assembly Sequences on the Stability of Assemblies.",
            "A Dynamic Algorithm for Distributed Feedback Control for Manufacturing Production, Capacity, and Maintenance.",
            "Controlled Wafer Release in Clustered Photolithography Tools: Flexible Flow Line Job Release Scheduling and an LMOLP Heuristic.",
            "Supply Demand Coordination for Building Energy Saving: Explore the Soft Comfort.",
            "Simultaneous Identification of Bidirectional Path Models Based on Process Data.",
            "Automatic Composition of Semantic Web Services Based on Fuzzy Predicate Petri Nets.",
            "Noncyclic Scheduling of Cluster Tools With a Branch and Bound Algorithm.",
            "Real-Time Production Scheduler for Digital-Print-Service Providers Based on a Dynamic Incremental Evolutionary Algorithm.",
            "Approximate Life Cycle Assessment via Case-Based Reasoning for Eco-Design.",
            "Topological Indoor Localization and Navigation for Autonomous Mobile Robot.",
            "Robot Guided Crowd Evacuation.",
            "Backstepping Control for Gear Transmission Servo Systems With Backlash Nonlinearity.",
            "A Minimal POE-Based Model for Robotic Kinematic Calibration With Only Position Measurements.",
            "Cellular Production Lines With Asymptotically Reliable Bernoulli Machines: Lead Time Analysis and Control.",
            "Toward Welding Robot With Human Knowledge: A Remotely-Controlled Approach.",
            "Robotic Handling of Surgical Instruments in a Cluttered Tray.",
            "Guest Editorial: Special Issue on Networked Cooperative Autonomous Systems.",
            "Probabilistic Cooperative Target Localization.",
            "Distributed Leader-Assistive Localization Method for a Heterogeneous Multirobotic System.",
            "Collective Motions of Heterogeneous Swarms.",
            "Formation Control of Nonholonomic Vehicles Under Time Delayed Communications.",
            "Cooperative Control of Multi-Agent Systems With Unknown State-Dependent Controlling Effects.",
            "Prioritized Planning Algorithms for Trajectory Coordination of Multiple Mobile Robots.",
            "Autonomous Localization of an Unknown Number of Targets Without Data Association Using Teams of Mobile Sensors.",
            "Particle Swarm Optimization-Based Source Seeking.",
            "Distributed Algorithms for Multirobot Task Assignment With Task Deadline Constraints.",
            "Assignment Algorithms for Modeling Resource Contention in Multirobot Task Allocation.",
            "Gaussian Process Decentralized Data Fusion and Active Sensing for Spatiotemporal Traffic Modeling and Prediction in Mobility-on-Demand Systems.",
            "Ensemble Coordination Approach in Multi-AGV Systems Applied to Industrial Warehouses.",
            "Robust UAV Relative Navigation With DGPS, INS, and Peer-to-Peer Radio Ranging.",
            "Cooperative Path Following of Multiple Multirotors Over Time-Varying Networks.",
            "Automated Self-Assembly of Large Maritime Structures by a Team of Robotic Boats.",
            "Reactive Motion Planning for Unmanned Aerial Surveillance of Risk-Sensitive Areas.",
            "Experiments on Human-in-the-Loop Coordination for Multirobot System With Task Abstraction.",
            "A BDD-Based Approach for Designing Maximally Permissive Deadlock Avoidance Policies for Complex Resource Allocation Systems.",
            "Time-Feasible Reachability Tree for Noncyclic Scheduling of Timed Petri Nets.",
            "A Bilevel Analytical Model for Dynamic Storage Pricing in a Supply Hub in Industrial Park (SHIP).",
            "Vision-Based Caging Grasps of Polyhedron-Like Workpieces With a Binary Industrial Gripper.",
            "Multiregion Segmentation Based on Compact Shape Prior.",
            "Robust Stability and Tracking for Operator-Based Nonlinear Uncertain Systems.",
            "Maximum Information Release While Ensuring Opacity in Discrete Event Systems.",
            "Sensor Placement for Fault Isolability Using Low Complexity Dynamic Programming.",
            "Modeling and Predicting Surface Roughness in Hard Turning Using a Bayesian Inference-Based HMM-SVM Model.",
            "Adaptive Video Transmission Control System Based on Reinforcement Learning Approach Over Heterogeneous Networks.",
            "Recommending Nearby Strangers Instantly Based on Similar Check-In Behaviors.",
            "Response Policies to Process Module Failure in Single-Arm Cluster Tools Subject to Wafer Residency Time Constraints.",
            "An Effective Subgradient Method for Scheduling a Steelmaking-Continuous Casting Process.",
            "Guest Editorial Special Section on Home Automation.",
            "Regularized Deconvolution-Based Approaches for Estimating Room Occupancies.",
            "6-DOF Pose Estimation of a Robotic Navigation Aid by Tracking Visual and Geometric Features.",
            "Wearable Ego-Motion Tracking for Blind Navigation in Indoor Environments.",
            "Speaker Identification With Whispered Speech for the Access Control System.",
            "Home Automation Oriented Gesture Classification From Inertial Measurements.",
            "Activity Discovery and Detection of Behavioral Deviations of an Inhabitant From Binary Sensors.",
            "Wearable Sensor-Based Behavioral Anomaly Detection in Smart Assisted Living Systems.",
            "Robust Environmental Sound Recognition With Fast Noise Suppression for Home Automation.",
            "Persim 3D: Context-Driven Simulation and Modeling of Human Activities in Smart Spaces.",
            "Control of Upper-Limb Power-Assist Exoskeleton Using a Human-Robot Interface Based on Motion Intention Recognition.",
            "A District Energy Management Based on Thermal Comfort Satisfaction and Real-Time Power Balancing.",
            "Collaborative Energy and Thermal Comfort Management Through Distributed Consensus Algorithms.",
            "Guest Editorial Special Section on the 2014 Workshop on the Algorithmic Foundations of Robotics.",
            "Planning Paths for Package Delivery in Heterogeneous Multirobot Teams.",
            "Efficient Multi-Robot Motion Planning for Unlabeled Discs in Simple Polygons.",
            "Towards Arranging and Tightening Knots and Unknots With Fixtures.",
            "Planning Curvature and Torsion Constrained Ribbons in 3D With Application to Intracavitary Brachytherapy.",
            "LOC-Based High-Throughput Cell Morphology Analysis System.",
            "High-Bandwidth Control of Nanopositioning Stages via an Inner-Loop Delayed Position Feedback.",
            "Fault Detection of Discrete-Time Stochastic Systems Subject to Temporal Logic Correctness Requirements.",
            "Stochastic Petri Net Modeling, Simulation and Analysis of Public Bicycle Sharing Systems.",
            "Event-Based Optimization Within the Lagrangian Relaxation Framework for Energy Savings in HVAC Systems.",
            "LTL-Based Planning in Environments With Probabilistic Observations.",
            "Designing a Failure-Tolerant Workspace for Kinematically Redundant Robots.",
            "Three-Stage Design Analysis and Multicriteria Optimization of a Parallel Ankle Rehabilitation Robot Using Genetic Algorithm.",
            "Impacted-Region Optimization for Distributed Model Predictive Control Systems With Constraints.",
            "Model-Free Optimal Control for Affine Nonlinear Systems With Convergence Analysis.",
            "A Resource-Oriented, Decentralized Auction Algorithm for Multirobot Task Allocation.",
            "A Decentralized Stay-Time Based Occupant Distribution Estimation Method for Buildings.",
            "Caterpillar-Like Climbing Method Incorporating a Dual-Mode Optimal Controller.",
            "Robotic Cell Rotation Based on the Minimum Rotation Force.",
            "State-Space Predictive-P Control for Liquid Level in an Industrial Coke Fractionation Tower.",
            "Detection of Causal Relationships Based on Residual Analysis.",
            "Online Optimization of Fuzzy Controller for Coke-Oven Combustion Process Based on Dynamic Just-in-Time Learning.",
            "Data-Driven Analysis of Downtime Impacts in Parallel Production Systems."
        ]
    },
    {
        "name": "TASAE",
        "year": "2014",
        "info": "Volume 11: 2014",
        "count": 121,
        "papers": [
            "Guest Editorial Special Section on Advances in Discrete-Event Systems for Automation.",
            "Symbolic Representation and Computation of Timed Discrete-Event Systems.",
            "Application of Supervisory Control Synthesis to a Patient Support Table of a Magnetic Resonance Imaging Scanner.",
            "Supervisory Control for State-Vector Transition Models - A Unified Approach.",
            "Bridging the Gap Between Design and Implementation of Discrete-Event Controllers.",
            "Supervisor Simplification for AMS Based on Petri Nets and Inequality Analysis.",
            "Fault-Tolerant Control for Safety of Discrete-Event Systems.",
            "Freeway Traffic Modeling and Control in a First-Order Hybrid Petri Net Framework.",
            "State Estimation of Timed Labeled Petri Nets With Unobservable Transitions.",
            "Efficient Enumeration of Minimal Unsafe States in Complex Resource Allocation Systems.",
            "Testing Experiments on Synchronized Petri Nets.",
            "A Study on Sinus-Lifting Motion of a Snake Robot With Sequential Optimization of a Hybrid System.",
            "Diagnosability of Discrete-Event Systems Using Labeled Petri Nets.",
            "A Propagative Model of Simultaneous Impact: Existence, Uniqueness, and Design Consequences.",
            "Planar Compliances of Symmetric Notch Flexure Hinges: The Right Circularly Corner-Filleted Parabolic Design.",
            "An Optimal Sample Allocation Strategy for Partition-Based Random Search.",
            "Path Generation Using ${\\mbi \\eta}^4$-Splines for a Truck and Trailer Vehicle.",
            "A Multiagent Q-Learning-Based Optimal Allocation Approach for Urban Water Resource Management System.",
            "Building Energy Doctors: An SPC and Kalman Filter-Based Method for System-Level Fault Detection in HVAC Systems.",
            "A Quality Flow Model in Battery Manufacturing Systems for Electric Vehicles.",
            "Robotic Explosive Charging in Mining and Construction Applications.",
            "Cigarette Production Scheduling by Combining Workflow Model and Immune Algorithm.",
            "Degree of Redundancy of Linear Systems Using Implicit Set Covering.",
            "Extended Interference Matrices for Exploded View of Assembly Planning.",
            "Algorithms for Routing an Unmanned Aerial Vehicle in the Presence of Refueling Depots.",
            "An Improved Mixed Integer Programming Approach for Multi-Hoist Cyclic Scheduling Problem.",
            "Robust Electromagnetic Control of Microrobots Under Force and Localization Uncertainties.",
            "Emulating Nuclear Emissions With a Pulsed Laser.",
            "Corrections to \"Cross-Domain Model Building and Validation (CDMV): A New Modeling Strategy to Reinforce Understanding of Nanomanufacturing Processes\".",
            "A Lipschitz Regularity-Based Statistical Model With Applications in Coordinate Metrology.",
            "Automated Manipulation of Biological Cells Using Gripper Formations Controlled By Optical Tweezers.",
            "Automatic Bird Species Detection From Crowd Sourced Videos.",
            "Surface-Type Classification Using RGB-D.",
            "A Robotic Crack Inspection and Mapping System for Bridge Deck Maintenance.",
            "Modeling and Analysis of Care Delivery Services Within Patient Rooms: A System-Theoretic Approach.",
            "Training Initialization of Hidden Markov Models in Human Action Recognition.",
            "Shape Deformation Using Skeleton Correspondences for Realistic Posed Fashion Flat Creation.",
            "On the Optimal Deployment of Direction Finders.",
            "GridStore: A Puzzle-Based Storage System With Decentralized Control.",
            "Blocking Effects in Warehouse Systems With Autonomous Vehicles.",
            "Adaptive Sensor Allocation Strategy for Process Monitoring and Diagnosis in a Bayesian Network.",
            "Variable Dwell Time Task Scheduling for Multifunction Radar.",
            "Overlay Error Compensation Using Advanced Process Control With Dynamically Adjusted Proportional-Integral R2R Controller.",
            "A Feasible and Easy-to-Implement Anticollision Algorithm for the EPCglobal UHF Class-1 Generation-2 RFID Protocol.",
            "Object-Oriented Templates for Automated Assembly Planning of Complex Products.",
            "Flexible Specification of Operation Behavior Using Multiple Projections.",
            "Optimal Computing Budget Allocation for Complete Ranking.",
            "Scheduling Cluster Tools for Concurrent Processing of Two Wafer Types.",
            "Computation of the Precise Worst-Case Response Time of FlexRay Dynamic Messages.",
            "Optimal Supervisory Control of Flexible Manufacturing Systems by Petri Nets: A Set Classification Approach.",
            "Self-Adaptive Learning PSO-Based Deadline Constrained Task Scheduling for Hybrid IaaS Cloud.",
            "Optimization Algorithms for Kinematically Optimal Design of Parallel Manipulators.",
            "Bond Graph Approach for Plant Fault Detection and Isolation: Application to Intelligent Autonomous Vehicle.",
            "Timed Compatibility Analysis of Web Service Composition: A Modular Approach Based on Petri Nets.",
            "Gabor-Based Nonuniform Scale-Frequency Map for Environmental Sound Classification in Home Automation.",
            "Compensation of Hysteresis Nonlinearity in Magnetostrictive Actuators With Inverse Multiplicative Structure for Preisach Model.",
            "Feature-Based Human Model for Digital Apparel Design.",
            "Policy Iteration Algorithm for Online Design of Robust Control for a Class of Continuous-Time Nonlinear Systems.",
            "A Generalized Result for Degradation Model-Based Reliability Estimation.",
            "Parameterized ACD Modeling of Flexible Manufacturing Systems.",
            "Guest Editorial Can Drones Deliver?",
            "Rapidly Exploring Random Tree Algorithm-Based Path Planning for Robot-Aided Optical Manipulation of Biological Cells.",
            "Estimating Part Pose Statistics With Application to Industrial Parts Feeding and Shape Design: New Metrics, Algorithms, Simulation Experiments and Datasets.",
            "An Assembly Automation Approach to Alignment of Noncircular Projections in Electron Microscopy.",
            "Dynamic Surgery Assignment of Multiple Operating Rooms With Planned Surgeon Arrival Times.",
            "A Multiobjective Hybrid Genetic Algorithm for TFT-LCD Module Assembly Scheduling.",
            "Integral Reinforcement Learning for Linear Continuous-Time Zero-Sum Games With Completely Unknown Dynamics.",
            "Energy-Responsive Aggregate Context for Energy Saving in a Multi-Resident Environment.",
            "Real-Time Planner in the Operational Space for the Automatic Handling of Kinematic Constraints.",
            "Guaranteed Cost Control for Uncertain Networked Control Systems With Predictive Scheme.",
            "An Adaptable Robot Vision System Performing Manipulation Actions With Flexible Objects.",
            "Spatial Density Patterns for Efficient Change Detection in 3D Environment for Autonomous Surveillance Robots.",
            "A Robust Surface Coding Method for Optically Challenging Objects Using Structured Light.",
            "Energy Efficiency Management of an Integrated Serial Production Line and HVAC System.",
            "Energy Efficient Use of Multirobot Production Lines in the Automotive Industry: Detailed System Modeling and Optimization.",
            "Reaching Law Approach to the Sliding Mode Control of Periodic Review Inventory Systems.",
            "Navigation of Magnetic Microrobots With Different User Interaction Levels.",
            "Analysis of Multiproduct Manufacturing Systems With Homogeneous Exponential Machines.",
            "Neural-Network-Based Constrained Optimal Control Scheme for Discrete-Time Switched Nonlinear System Using Dual Heuristic Programming.",
            "Multifurnace Optimization in Electric Smelting Plants by Load Scheduling and Control.",
            "Dynamic Capacity Planning and Location of Hierarchical Service Networks Under Service Level Constraints.",
            "Multitarget Hierarchical Negotiation for Distributed Design in Collaborative Product Development.",
            "Top-k Automatic Service Composition: A Parallel Method for Large-Scale Service Sets.",
            "Recommendation in an Evolving Service Ecosystem Based on Network Prediction.",
            "Marker-Based Surgical Instrument Tracking Using Dual Kinect Sensors.",
            "Delayed Genz-Keister Sequences-Based Sparse-Grid Quadrature Nonlinear Filter With Application to Target Tracking.",
            "Recoverability of Discrete-Event Systems With Faults.",
            "Automatic Identification of Large Fragments in a Pile of Broken Rock Using a Time-of-Flight Camera.",
            "Patterned Fabric Inspection and Visualization by the Method of Image Decomposition.",
            "Optimal Shipment Policies for Distribution Systems With a Limited Fleet of Capacitated Vehicles.",
            "Similarity Searching for Defective Wafer Bin Maps in Semiconductor Manufacturing.",
            "Guest Editorial Integrated Optimization of Industrial Automation.",
            "Integrated Optimization for the Automation Systems of Mineral Processing.",
            "A Quality-Relevant Sequential Phase Partition Approach for Regression Modeling and Quality Prediction Analysis in Manufacturing Processes.",
            "Data-Driven Soft-Sensor Modeling for Product Quality Estimation Using Case-Based Reasoning and Fuzzy-Similarity Rough Sets.",
            "Modeling and Simulation of Whole Ball Mill Grinding Plant for Integrated Control.",
            "Adaptive Dynamic Programming for Optimal Tracking Control of Unknown Nonlinear Systems With Application to Coal Gasification.",
            "Adaptive Observer Based Data-Driven Control for Nonlinear Discrete-Time Processes.",
            "Nonlinear Model Predictive Control for DFIG-Based Wind Power Generation.",
            "Robust Model Predictive Control Under Saturations and Packet Dropouts With Application to Networked Flotation Processes.",
            "Optimal Subtask Allocation for Human and Robot Collaboration Within Hybrid Assembly System.",
            "Optimization of Advertising Budget Allocation Over Time Based on LS-SVMR and DE.",
            "Optimization of Total Energy Consumption in Flexible Manufacturing Systems Using Weighted P-Timed Petri Nets and Dynamic Programming.",
            "Beam Search Combined With MAX-MIN Ant Systems and Benchmarking Data Tests for Weighted Vehicle Routing Problem.",
            "Using Lagrangian Relaxation Decomposition With Heuristic to Integrate the Decisions of Cell Formation and Parts Scheduling Considering Intercell Moves.",
            "Solving an Extended Double Row Layout Problem Using Multiobjective Tabu Search and Linear Programming.",
            "Monitoring for Nonlinear Multiple Modes Process Based on LL-SVDD-MRDA.",
            "A Bayesian Networks Structure Learning and Reasoning-Based Byproduct Gas Scheduling in Steel Industry.",
            "A Bayesian Approach to Automated Optical Inspection for Solder Jet Ball Joint Defects in the Head Gimbal Assembly Process.",
            "Energy-Aware Scheduling of Distributed Systems.",
            "A Novel Iterative $\\theta $-Adaptive Dynamic Programming for Discrete-Time Nonlinear Systems.",
            "Constrained Optimal Test Signal Design for Improved Prediction Error.",
            "Simulation and Experimental Verification of Weighted Velocity and Acceleration Minimization for Robotic Redundancy Resolution.",
            "Command and Control of Discrete-Event Systems: Towards Online Hierarchical Control Based on Feasible System Decomposition.",
            "Recursive Modeling of Stateflow as Input/Output-Extended Automaton.",
            "Improving Response-Time Performance in Acute Care Delivery: A Systems Approach.",
            "Performance Analysis of RFID Protocols: CDMA Versus the Standard EPC Gen-2.",
            "Non-Cyclic Scheduling of a Wet Station.",
            "Brain Machine Interface System Automation Considering User Preferences and Error Perception Feedback.",
            "Direct Motion Planning for Vision-Based Control.",
            "Dynamic Optimization of Industrial Processes With Nonuniform Discretization-Based Control Vector Parameterization."
        ]
    },
    {
        "name": "TASAE",
        "year": "2013",
        "info": "Volume 10: 2013",
        "count": 114,
        "papers": [
            "Editorial: Automation in green manufacturing.",
            "Virtual Battery: A Battery Simulation Framework for Electric Vehicles.",
            "Designing a Sustainable and Distributed Generation System for Semiconductor Wafer Fabs.",
            "Energy-Efficient Production Systems Through Schedule-Based Operations.",
            "Opportunity Estimation for Real-Time Energy Control of Sustainable Manufacturing Systems.",
            "Energy Reduction in a Pallet-Constrained Flow Shop Through On-Off Control of Idle Machines.",
            "High-Level Scheduling of Energy Optimal Trajectories.",
            "A Network Flow Model for the Performance Evaluation and Design of Material Separation Systems For Recycling.",
            "Assembly Strategies for Remanufacturing Systems With Variable Quality Returns.",
            "A Modeling Approach to Analyze Variability of Remanufacturing Process Routing.",
            "Carbon Footprint and the Management of Supply Chains: Insights From Simple Models.",
            "A Simulation-Based Tool for Energy Efficient Building Design for a Class of Manufacturing Plants.",
            "Fault Diagnosis Using an Enhanced Relevance Vector Machine (RVM) for Partially Diagnosable Multistation Assembly Processes.",
            "Correct-by-Construction and Optimal Synthesis of Beacon-Enabled ZigBee Network.",
            "Scheduling Cluster Tools With Ready Time Constraints for Consecutive Small Lots.",
            "Finite Bisimulation of Reactive Untimed Infinite State Systems Modeled as Automata With Variables.",
            "Calibration of Stochastic Computer Models Using Stochastic Approximation Methods.",
            "I-Detectability of Discrete-Event Systems.",
            "A Petri Net and Extended Genetic Algorithm Combined Scheduling Method for Wafer Fabrication.",
            "An Approximate Solution for Semi-Open Queueing Network Model of an Autonomous Vehicle Storage and Retrieval System.",
            "Visual Control of an Automatic Manipulation System by Microscope and Pneumatic Actuator.",
            "Requirement-Based Bidding Language for Agent-Based Scheduling.",
            "Guest Editorial Exciting Trends for Automation in Manufacturing.",
            "Polyhedral Assembly Partitioning With Infinite Translations or The Importance of Being Exact.",
            "Mobile Phones as Seismologic Sensors: Automating Data Extraction for the iShake System.",
            "Design, Simulation, and Fabrication of Microneedles and a Blood Filter for Use in a Hemofiltration System.",
            "Experimental Analysis of Laser Interferometry-Based Robust Motion Tracking Control of a Flexure-Based Mechanism.",
            "AFAM: An Articulated Four Axes Microrobot for Nanoscale Applications.",
            "AFM-Based Robotic Nano-Hand for Stable Manipulation at Nanoscale.",
            "A Geometric Distribution Reader Anti-Collision Protocol for RFID Dense Reader Environments.",
            "An Effective Artificial Bee Colony Algorithm for a Real-World Hybrid Flowshop Problem in Steelmaking Process.",
            "Coordinated Iterative Learning Control Schemes for Train Trajectory Tracking With Overspeed Protection.",
            "Energy Saving Opportunity Analysis of Automotive Serial Production Systems (March 2012).",
            "Swarm Intelligence Approaches to Optimal Power Flow Problem With Distributed Generator Failures in Power Networks.",
            "Adaptive Dispatching Rule for Semiconductor Wafer Fabrication Facility.",
            "Development and Evaluation of Object-Based Visual Attention for Automatic Perception of Robots.",
            "An Integrated Two-Level Self-Calibration Method for a Cable-Driven Humanoid Arm.",
            "Fault Detection by Labeled Petri Nets in Centralized and Distributed Approaches.",
            "Performance Metrics of Speed and Separation Monitoring in Shared Workspaces.",
            "Hybrid Analysis in the Latent Nestling Method Applied to Fault Diagnosis.",
            "Functional and Behavior Models for the Supervision of an Intelligent and Autonomous System.",
            "Optimal Alarm Signal Processing: Filter Design and Performance Analysis.",
            "Similarity Analysis of Industrial Alarm Flood Data.",
            "Online Sensor Activation for Detectability of Discrete Event Systems.",
            "A Semi-Automated Positioning System for Contact-Mode Atomic Force Microscopy (AFM).",
            "An Assembly-Skill-Transferring Method for Cellular Manufacturing System - Part I: Verification of the Proposed Method for Motor Skill.",
            "Self-Configuration of Waypoints for Docking Maneuvers of Flexible Automated Guided Vehicles.",
            "Thin Layer SOI-FETs Used for Stress-Sensing and Its Application in Accelerometers.",
            "Guest Editorial Microassembly for Manufacturing at Small Scales.",
            "Research in Automated Planning and Control for Micromanipulation.",
            "A Review of Haptic Feedback Teleoperation Systems for Micromanipulation and Microassembly.",
            "Precision Position/Force Interaction Control of a Piezoelectric Multimorph Microgripper for Microassembly.",
            "Automated Guiding Task of a Flexible Micropart Using a Two-Sensing-Finger Microgripper.",
            "Interval Analysis of Kinematic Errors in Serial Manipulators Using Product of Exponentials Formula.",
            "Magnetic Self-Assembly of Ultra-Thin Chips to Polymer Foils.",
            "Analysis and Motion Control of a Centrifugal-Force Microrobotic Platform.",
            "Automated Pick-Place of Silicon Nanowires.",
            "Analysis and Specificities of Adhesive Forces Between Microscale and Nanoscale.",
            "Cross-Domain Model Building and Validation (CDMV): A New Modeling Strategy to Reinforce Understanding of Nanomanufacturing Processes.",
            "EM Estimation of Nanostructure Interactions With Incomplete Feature Measurement and Its Tailored Space Filling Designs.",
            "Building Energy Management: Integrated Control of Active and Passive Heating, Cooling, Lighting, Shading, and Ventilation Systems.",
            "Smart Management of Multiple Energy Systems in Automotive Painting Shop.",
            "Instrumented Knee Prosthesis for Force and Kinematics Measurements.",
            "Open-Loop Precision Grasping With Underactuated Hands Inspired by a Human Manipulation Strategy.",
            "A Novel Method for Calculating Service Reputation.",
            "Representation and Exchange of Knowledge About Actions, Objects, and Environments in the RoboEarth Framework.",
            "A Data-Level Fusion Model for Developing Composite Health Indices for Degradation Modeling and Prognostic Analysis.",
            "Coordination Motion Control in the Task Space for Parallel Manipulators With Actuation Redundancy.",
            "Type Synthesis, Kinematic Analysis, and Optimal Design of a Novel Class of Schönflies-Motion Parallel Manipulators.",
            "Decentralized Fault Diagnosis of Continuous Annealing Processes Based on Multilevel PCA.",
            "Noncyclic Scheduling for Timed Discrete-Event Systems With Application to Single-Armed Cluster Tools Using Pareto-Optimal Optimization.",
            "Multiobjective Optimization for Autonomous Straddle Carrier Scheduling at Automated Container Terminals.",
            "Modeling Load Parameters of Ball Mill in Grinding Process Based on Selective Ensemble Multisensor Information.",
            "A High Performing Memetic Algorithm for the Flowshop Scheduling Problem With Blocking.",
            "Solving Assembly Scheduling Problems With Tree-Structure Precedence Constraints: A Lagrangian Relaxation Approach.",
            "An Optimization Approach to Improved Petri Net Controller Design for Automated Manufacturing Systems.",
            "User-Adaptive Sketch-Based 3-D CAD Model Retrieval.",
            "Automated Identification of Plywood Using Embedded Inkjet-Printed Passive UHF RFID Tags.",
            "UHF RFID Localization Based on Synthetic Apertures.",
            "RFID Reader Scheduling for Reliable Identification of Moving Tags.",
            "An Unsupervised Approach for Automatic Activity Recognition Based on Hidden Markov Model Regression.",
            "In Memoriam Richard A. (Dick) Volz.",
            "Guest Editorial Special Section on 2012 Workshop on the Algorithmic Foundations of Robotics (WAFR).",
            "Learning to Segment and Track in RGBD.",
            "Counting Moving Bodies Using Sparse Sensor Beams.",
            "Ray-Shooting Algorithms for Robotics.",
            "Robust Free Space Computation for Curved Planar Bodies.",
            "Large-Scale Estimation in Cyberphysical Systems Using Streaming Data: A Case Study With Arterial Traffic Estimation.",
            "Guest Editorial Special Section on 2012 Conference on Automation Science and Engineering (CASE).",
            "Automated Formal Verification of Routing in Material Handling Systems.",
            "Sustainable and Robust Control of Cyclic Pallet Systems.",
            "Litho Machine Scheduling With Convex Hull Analyses.",
            "Spatiotemporal Differentiation of Myocardial Infarctions.",
            "Robot-Guided Open-Loop Insertion of Skew-Line Needle Arrangements for High Dose Rate Brachytherapy.",
            "Feature Localization Using Kinematics and Impulsive Hybrid Optimization.",
            "Polynomial Test for Stochastic Diagnosability of Discrete-Event Systems.",
            "Automated Cell Transport in Optical Tweezers-Assisted Microfluidic Chambers.",
            "On the Implementation of Industrial Automation Systems Based on PLC.",
            "A Chance Constrained Programming Approach to Determine the Optimal Disassembly Sequence.",
            "Detection of Correlated Alarms Based on Similarity Coefficients of Binary Data.",
            "Predicting Stay Time of Mobile Users With Contextual Information.",
            "Two-Level Hierarchical Hybrid Control for Smart Power System.",
            "Two-Level Production Plan Decomposition Based on a Hybrid MOEA for Mineral Processing.",
            "A State-Space-Based Prognostic Model for Hidden and Age-Dependent Nonlinear Degradation Process.",
            "On the Problem of the Automated Design of Large-Scale Robot Skin.",
            "Modular Modeling for the Diagnostic of Complex Discrete-Event Systems.",
            "Cost Analysis of an Engineering System Involving Subsystems in Series Configuration.",
            "Data Providing Services Clustering and Management for Facilitating Service Discovery and Replacement.",
            "Optimal Motion Planning of All Position Autonomous Mobile Welding Robot System for Fillet Seams.",
            "Hybridization of Bound-and-Decompose and Mixed Integer Feasibility Checking to Measure Redundancy in Structured Linear Systems.",
            "On Deciding the Existence of a Liveness Enforcing Supervisory Policy in a Class of Partially Controlled General Free-Choice Petri Nets.",
            "A Differential Evolution-Based Algorithm to Schedule Flexible Assembly Lines.",
            "A Unified Distance Function Framework for Workpiece Fixturing Modeling and Analysis.",
            "LMI-Based Gain Synthesis for Simple Robust Quadrotor Control."
        ]
    },
    {
        "name": "TASAE",
        "year": "2012",
        "info": "Volume 9: 2012",
        "count": 77,
        "papers": [
            "What Is Automation?",
            "Input Order Robustness: Definition, Verification Procedure, and Examples.",
            "A Bayesian Hierarchical Framework for Multitarget Labeling and Correspondence With Ghost Suppression Over Multicamera Surveillance System.",
            "Application of the Assembly Skill Transfer System in an Actual Cellular Manufacturing System.",
            "A Polynomial Dynamic Programming Algorithm for Crude Oil Transportation Planning.",
            "A Comparative Study on Two Types of Automated Container Terminal Systems.",
            "Discrete-Event Coordination Design for Distributed Agents.",
            "Solution Workflows for Model-Based Analysis of Complex Systems.",
            "From Hardware-in-the-Loop to Hybrid Process Simulation: An Ontology for the Implementation Phase of a Manufacturing System.",
            "A Semantic Product Modeling Framework and Its Application to Behavior Evaluation.",
            "Functional Morphing in Multistage Manufacturing and Its Applications in High-Definition Metrology-Based Process Control.",
            "Improvement of Lagrangian Relaxation Convergence for Production Scheduling.",
            "A Production-Inventory System With Both Patient and Impatient Demand Classes.",
            "A Multiscale Assembly and Packaging System for Manufacturing of Complex Micro-Nano Devices.",
            "Building a Communication Bridge With Mobile Hubs.",
            "$M$ -Ary RFID Tags Splitting With Small Idle Slots.",
            "Developing an Automatic Virtual Metrology System.",
            "An Effective Meta-Heuristic for No-Wait Job Shops to Minimize Makespan.",
            "Workflow Nets for Multiagent Cooperation.",
            "Schedulability Analysis and Optimal Scheduling of Dual-Arm Cluster Tools With Residency Time Constraint and Activity Time Variation.",
            "Modified Two-Stage Degradation Model for Dynamic Maintenance Threshold Calculation Considering Uncertainty.",
            "Editorial Tracking T-ASE Inventory by Methodology and Application.",
            "Modeling and Analysis of Rapid Response Process to Improve Patient Safety in Acute Care.",
            "A Generalized Tip-Membrane Contact Detection Algorithm for Automated Single Cell Electroporation Using Statistical Process Control.",
            "Real-Time Adaptive Control of a Flexible Manipulator Using Reinforcement Learning.",
            "A Solution to the Optimal Lot-Sizing Problem as a Stochastic Resource Contention Game.",
            "An Analytical Performance Modeling Approach for Supply Chain Networks.",
            "An Intelligent Quick Prediction Algorithm With Applications in Industrial Control and Loading Problems.",
            "Probability Evaluation Models of Product Disassembly Cost Subject to Random Removal Time and Different Removal Labor Cost.",
            "Performance Assessment and Design for Univariate Alarm Systems Based on FAR, MAR, and AAD.",
            "Sequence Planning Using Multiple and Coordinated Sequences of Operations.",
            "Parameter Optimization Design for Touch Panel Laser Cutting Process.",
            "An Information-Based Approach to Compute Similarity Between Engineering Changes.",
            "Efficient Computing Budget Allocation for Simulation-Based Policy Improvement.",
            "Modular Supervisory Control and Hierarchical Supervisory Control of Fuzzy Discrete-Event Systems.",
            "Dynamic Control of Data Streaming and Processing in a Virtualized Environment.",
            "Control Loop Performance Assessment With a Dynamic Neuro-Fuzzy Model (dFasArt).",
            "Redesign Distributed PLC Control Systems Using IEC 61499 Function Blocks.",
            "Evaluation of Telerobotic Shared Control Strategy for Efficient Single-Cell Manipulation.",
            "Seam Following for Automated Industrial Fiber Mat Stitching.",
            "Conjunctive and Disjunctive Architectures for Decentralized Prognosis of Failures in Discrete-Event Systems.",
            "Sliding Mode Dead-Beat Control of Perishable Inventory Systems With Multiple Suppliers.",
            "Modeling and Optimization of Energy Consumption in Cooperative Multi-Robot Systems.",
            "A Petri Net Approach to Mediation-Aided Composition of Web Services.",
            "Feedback Matching Framework for Semantic Interoperability of Product Data.",
            "Modeling, Analysis and Control of Dual-Arm Cluster Tools With Residency Time Constraint and Activity Time Variation Based on Petri Nets.",
            "Corrections to \"Design of a Maximally Permissive Liveness-Enforcing Petri Net Supervisor for Flexible Manufacturing Systems\".",
            "Theory and Performance Evaluation of Group Coding of RFID Tags.",
            "Open Software Platform for Robotic Services.",
            "A Concurrent Approach to Reducing Environmental Impact of Product Development at the System Design Stage.",
            "Energy Savings in Metropolitan Railway Substations Through Regenerative Energy Recovery and Optimal Design of ATO Speed Profiles.",
            "Feasibility of Intelligent Monitoring of Construction Workers for Carbon Monoxide Poisoning.",
            "Coalition-Based Approach to Task Allocation of Multiple Robots With Resource Constraints.",
            "Cyclic Task Scheduling for Multifunction Radar.",
            "A Compliant Parallel XY Micromotion Stage With Complete Kinematic Decoupling.",
            "Design and Development of a Flexure-Based Dual-Stage Nanopositioning System With Minimum Interference Behavior.",
            "Real-Time Scheduling of Single-Arm Cluster Tools Subject to Residency Time Constraints and Bounded Activity Time Variation.",
            "Adaptive Hybrid Algorithms for the Sequence-Dependent Setup Time Permutation Flow Shop Scheduling Problem.",
            "Efficient Selection of a Set of Good Enough Designs With Complexity Preference.",
            "Energy Modeling of Machine Tools for Optimization of Machine Setups.",
            "Recognition of Curved Surfaces From \"One-Dimensional\" Tactile Data.",
            "Kalman Filter-Based Coarse-to-Fine Control for Display Visual Alignment Systems.",
            "Neural-Network-Based Optimal Control for a Class of Unknown Discrete-Time Nonlinear Systems Using Globalized Dual Heuristic Programming.",
            "Editorial [intro. to Guest Editorial by Prof. Raff D'Andrea].",
            "Guest editorial: A revolution in the warehouse: a retrospective on Kiva Systems and the grand challenges ahead.",
            "A Hybrid Model of Complex Automated Warehouse Systems - Part I: Modeling and Simulation.",
            "A Hybrid Model of Complex Automated Warehouse Systems - Part II: Analysis and Experimental Results.",
            "Real-Time Path Planning for Coordinated Transport of Multiple Particles Using Optical Tweezers.",
            "Nanorobotic Assembly and Focused Ion Beam Processing of Nanotube-Enhanced AFM Probes.",
            "Modeling and Optimization of Building Emergency Evacuation Considering Blocking Effects on Crowd Movement.",
            "An Efficient Outpatient Scheduling Approach.",
            "Iterative Deepening A* Algorithms for the Container Relocation Problem.",
            "Automated Detection of Influential Patents Using Singular Values.",
            "Vision-Based Tactile Sensing and Shape Estimation Using a Fluid-Type Touchpad.",
            "Modeling the Interactions Among Neighboring Nanostructures for Local Feature Characterization and Defect Detection.",
            "Drift Compensation in AFM-Based Nanomanipulation by Strategic Local Scan.",
            "Constructing Multiple Kernel Learning Framework for Blast Furnace Automation."
        ]
    },
    {
        "name": "TASAE",
        "year": "2011",
        "info": "Volume 8: 2011",
        "count": 83,
        "papers": [
            "Guest Editorial Equipment and Operations Automation in the Semiconductor Industry.",
            "Optimal Scheduling of Multicluster Tools With Constant Robot Moving Times, Part I: Two-Cluster Analysis.",
            "Optimal Scheduling of Multicluster Tools With Constant Robot Moving Times, Part II: Tree-Like Topology Configurations.",
            "Productivity Improvement From Using Machine Buffers in Dual-Gripper Cluster Tools.",
            "Petri Net-Based Scheduling of Single-Arm Cluster Tools With Reentrant Atomic Layer Deposition Processes.",
            "Spatial Variance Spectrum Analysis and Its Application to Unsupervised Detection of Systematic Wafer Spatial Variations.",
            "Automated Detection and Classification of Non-Wet Solder Joints.",
            "Multiclass Flow Line Models of Semiconductor Manufacturing Equipment for Fab-Level Simulation.",
            "Approximating the Performance of a Batch Service Queue Using the M/Mk/1 Model.",
            "Manufacturing Intelligence to Exploit the Value of Production and Tool Data to Reduce Cycle Time.",
            "Excursion Yield Loss and Cycle Time Reduction in Semiconductor Manufacturing.",
            "Module Selection and Supply Chain Optimization for Customized Product Families Using Redundancy and Standardization.",
            "A Shapley Value-Based Approach to Discover Influential Nodes in Social Networks.",
            "Artificial Cognition in Production Systems.",
            "Multiresource Shop Scheduling With Resource Flexibility and Blocking.",
            "Schedulability Analysis of Short-Term Scheduling for Crude Oil Operations in Refinery With Oil Residency Time and Charging-Tank-Switch-Overlap Constraints.",
            "WireWarping++: Robust and Flexible Surface Flattening With Length Control.",
            "Optimal Scheduling of Biochemical Analyses on Digital Microfluidic Systems.",
            "Decision Fusion from Heterogeneous Sensors in Surveillance Sensor Systems.",
            "Distributed Optimization for Model Predictive Control of Linear Dynamic Networks With Control-Input and Output Constraints.",
            "The Base Stock/Base Backlog Control Policy for a Make-to-Stock System With Impatient Customers.",
            "Automating Knowledge Discovery Workflow Composition Through Ontology-Based Planning.",
            "A Totally Decoupled Piezo-Driven XYZ Flexure Parallel Micropositioning Stage for Micro/Nanomanipulation.",
            "A Car-Seat Example of Automated Anthropomorphic Testing of Fabrics Using Force-Controlled Robot Motions.",
            "Rapid Color Grading for Fruit Quality Evaluation Using Direct Color Mapping.",
            "Statistical Weight Kinetics Modeling and Estimation for Silica Nanowire Growth Catalyzed by Pd Thin Film.",
            "Selection Schemes of Dual Virtual-Metrology Outputs for Enhancing Prediction Accuracy.",
            "A Three Degree-of-Freedom Optical Orientation Measurement Method for Spherical Actuator Applications.",
            "Adaptive Measurement for Automated Field Reconstruction and Calibration of Magnetic Systems.",
            "In-Process Truing for ELID (Electrolytic In-Process Dressing) Grinding by Pulsewidth Control.",
            "Fast Intersection-Free Offset Surface Generation From Freeform Models With Triangular Meshes.",
            "Dynamic Pricing and Inventory Control in a Make-to-Stock Queue With Information on the Production Status.",
            "Design of a Maximally Permissive Liveness- Enforcing Petri Net Supervisor for Flexible Manufacturing Systems.",
            "Least-Cost Transition Firing Sequence Estimation in Labeled Petri Nets With Unobservable Transitions.",
            "Improvement of Suboptimal Siphon- and FBM-Based Control Model of a Well-Known S3PR.",
            "An Enhanced Nested Partitions Algorithm Using Solution Value Prediction.",
            "Automated Multi-Agent Search Using Centroidal Voronoi Configuration.",
            "A SNCCDBAGG-Based NN Ensemble Approach for Quality Prediction in Injection Molding Process.",
            "Bouc-Wen Modeling and Inverse Multiplicative Structure to Compensate Hysteresis Nonlinearity in Piezoelectric Actuators.",
            "KnitSketch: A Sketch Pad for Conceptual Design of 2D Garment Patterns.",
            "Optimal Paint Gun Orientation in Spray Paint Applications - Experimental Results.",
            "A Framework to Model the Topological Structure of Supply Networks.",
            "An Integer Programming Approach for Analyzing the Measurement Redundancy in Structured Linear Systems.",
            "A Metamodeling Approach to the Management of Intermodal Transportation Networks.",
            "Capacity Reservation and Cancellation of Critical Resources.",
            "Building Association Link Network for Semantic Link on Web Resources.",
            "Output-Sensitive Computation of Force-Closure Grasps of a Semi-Algebraic Object.",
            "Robust Feedforward-Feedback Control of a Nonlinear and Oscillating 2-DOF Piezocantilever.",
            "A Convex Optimization Framework for Almost Budget Balanced Allocation of a Divisible Good.",
            "Game-Theoretic Design for Robust Hinfty Filtering and Deconvolution With Consideration of Known Input.",
            "Client-Server Networked Automation Systems Reactivity: Deterministic and Probabilistic Analysis.",
            "Verification of K-Step Opacity and Analysis of Its Complexity.",
            "Nonblocking and Safe Control of Discrete-Event Systems Modeled as Extended Finite Automata.",
            "Hybrid Modeling for Performance Evaluation of Multisource Renewable Energy Systems.",
            "Efficient Framed Slotted Aloha Protocol for RFID Tag Anticollision.",
            "IP-Based Real-Time Dispatching for Two-Machine Batching Problem With Time Window Constraints.",
            "Automated Assembly for Mesoscale Parts.",
            "Design and Control of Paired Mobile Robots Working Across a Thin Plate With Application to Aircraft Manufacturing.",
            "Batch Transfer of Zebrafish Embryos Into Multiwell Plates.",
            "Automatic Detection of Bridge Deck Condition From Ground Penetrating Radar Images.",
            "Projection and Geodesic-Based Pipe Routing Algorithm.",
            "Operations Sequencing in Flexible Production Lines With Bernoulli Machines.",
            "Some Complexity Results for Metric View Planning Problem With Traveling Cost and Visibility Range.",
            "Probabilistic Analysis and Correction of Chen's Tag Estimate Method.",
            "A Case Study in System-Level Physics-Based Simulation of a Biomimetic Robot.",
            "An Integrated Pricing and Deteriorating Model and a Hybrid Algorithm for a VMI (Vendor-Managed-Inventory) Supply Chain.",
            "Optimization Based Method for Supply Location Selection and Routing in Large-Scale Emergency Material Delivery.",
            "The Linehaul-Feeder Vehicle Routing Problem With Virtual Depots.",
            "Self Assessment-Based Decision Making for Multiagent Cooperative Search.",
            "An Adaptive Sampling Algorithm for Simulation-Based Optimization With Descriptive Complexity Preference.",
            "Allocating Resources in Multiagent Flowshops With Adaptive Auctions.",
            "Nonparametric and Semi-Parametric Sensor Recovery in Multichannel Condition Monitoring Systems.",
            "Symbolic Computation of Reduced Guards in Supervisory Control.",
            "A Practical Approach for Maximally Permissive Liveness-Enforcing Supervision of Complex Resource Allocation Systems.",
            "Stochastic Algorithms for Discrete Parameter Simulation Optimization.",
            "Supervisor Optimization for Deadlock Resolution in Automated Manufacturing Systems With Petri Nets.",
            "Bending-Invariant Correspondence Matching on 3-D Human Bodies for Feature Point Extraction.",
            "Optimal Image-Based Euclidean Calibration of Structured Light Systems in General Scenes.",
            "Development and Force/Position Control of a New Hybrid Thermo-Piezoelectric MicroGripper Dedicated to Micromanipulation Tasks.",
            "Model-Assisted Stochastic Learning for Robotic Applications.",
            "Linear Programming SVM-ARMA 2K With Application in Engine System Identification.",
            "Optimization of Train Regulation and Energy Usage of Metro Lines Using an Adaptive-Optimal-Control Algorithm.",
            "On the Flexible Demand Assignment Problems: Case of Unmanned Aerial Vehicles."
        ]
    },
    {
        "name": "TASAE",
        "year": "2010",
        "info": "Volume 7: 2010",
        "count": 97,
        "papers": [
            "ASP: An Adaptive Setup Planning Approach for Dynamic Machine Assignments.",
            "K Constrained Shortest Path Problem.",
            "Managing Supply Uncertainties Through Bayesian Information Update.",
            "Prognostics-Based Identification of the Top-k Units in a Fleet.",
            "Prototyping of Beam Shaping Diffraction Gratings by AFM Nanoscale Patterning.",
            "Performance Evaluation for Motif-Based Patterned Texture Defect Detection.",
            "An Ensemble ELM Based on Modified AdaBoost.RT Algorithm for Predicting the Temperature of Molten Steel in Ladle Furnace.",
            "Robust Calibration for Localization in Clustered Wireless Sensor Networks.",
            "Modeling the Relationship Between EDI Implementation and Firm Performance Improvement With Neural Networks.",
            "Coverage of a Planar Point Set With Multiple Robots Subject to Geometric Constraints.",
            "Lateral Optical Sensor With Slip Detection for Locating Live Products on Moving Conveyor.",
            "Skill Evaluation of Human Operators in Partly Automated Mobile Working Machines.",
            "Process Parameters Optimization: A Design Study for TiO 2 Thin Film of Vacuum Sputtering Process.",
            "Monitoring of Timed Discrete Events Systems With Interrupts.",
            "Time Windows Based Dynamic Routing in Multi-AGV Systems.",
            "Geo-Referencing of Video Flow From Small Low-Cost Civilian UAV.",
            "Planning Smooth and Obstacle-Avoiding B-Spline Paths for Autonomous Mining Vehicles.",
            "Physical Modeling of a Bag Knot in a Robot Learning System.",
            "Swept Volume Approximation of Polygon Soups.",
            "Neural Network Models to Anticipate Failures of Airport Ground Transportation Vehicle Doors.",
            "Clear and Precise Specification of Ecological Data Management Processes and Dataset Provenance.",
            "Supply Chain With Inventory Review and Dependent Demand Distributions: Dynamic Inventory Outsourcing.",
            "Bottlenecks in Bernoulli Serial Lines With Rework.",
            "Developing a Stochastic Dynamic Programming Framework for Optical Tweezer-Based Automated Particle Transport Operations.",
            "Deterministic Flow Lines With Applications.",
            "Correctness Verification of Generalized Algebraic Deadlock Avoidance Policies Through Mathematical Programming.",
            "Generation of Paths With Minimum Curvature Derivative With mmbeta 3 -Splines.",
            "Cost-Effective Updated Sequential Predictive Maintenance Policy for Continuously Monitored Degrading Systems.",
            "Design of DOE-Based Automatic Process Controller With Consideration of Model and Observation Uncertainties.",
            "State Space Modeling for 3-D Variation Propagation in Rigid-Body Multistage Assembly Processes.",
            "Reliability of Coordinate Sensor Systems Under the Risk of Sensor Precision Degradations.",
            "A Closed-Form Solution for Schedulability and Optimal Scheduling of Dual-Arm Cluster Tools With Wafer Residency Time Constraint Based on Steady Schedule Analysis.",
            "Branch-and-Price Decomposition to Design a Surveillance System for Port and Waterway Security.",
            "Hierarchical Production Planning for Semiconductor Wafer Fabrication Based on Linear Programming and Discrete-Event Simulation.",
            "Intelligent Component-Based Automation of Baggage Handling Systems With IEC 61499.",
            "Optimization of Group Elevator Scheduling With Advance Information.",
            "Bi-Criteria Scheduling of Scientific Grid Workflows.",
            "Quick Wafer Alignment Using Feedforward Neural Networks.",
            "Application of Genetic Algorithms to Solve the Multidepot Vehicle Routing Problem.",
            "Multiobjective Optimization of a Port-of-Entry Inspection Policy.",
            "Surface Patch Reconstruction From \"One-Dimensional\" Tactile Data.",
            "Orchestration of Grid-Enabled Geospatial Web Services in Geoscientific Workflows.",
            "Automated 3-D Micrograsping Tasks Performed by Vision-Based Control.",
            "Fairness, Stability and Optimality of Adaptive Multiagent Systems: Interaction Through Resource Sharing.",
            "Complete Open Loop Control of Hysteretic, Creeped, and Oscillating Piezoelectric Cantilevers.",
            "Manipulation of Thin Objects Using Levitation Techniques, Tilt Control, and Haptics.",
            "A Dynamic Region-of-Interest Vision Tracking System Applied to the Real-Time Wing Kinematic Analysis of Tethered Drosophila.",
            "Periodic Resource Reallocation in Two-Echelon Repairable Item Inventory Systems.",
            "Restarting Manufacturing Systems; Restart States and Restartability.",
            "An HNP-MP Approach for the Capacitated Multi-Item Lot Sizing Problem With Setup Times.",
            "Decentralized Control of Discrete-Event Systems With Multiple Local Specifications.",
            "Petri Net Decomposition Approach to Optimization of Route Planning Problems for AGV Systems.",
            "Formal Specification and Verification of Industrial Control Logic Components.",
            "Algebraic Synthesis of Timed Supervisor for Automated Manufacturing Systems Using Petri Nets.",
            "Quantitative Hybrid Bond Graph-Based Fault Detection and Isolation.",
            "Causality Assignment and Model Approximation for Hybrid Bond Graph: Fault Diagnosis Perspectives.",
            "Health-State Estimation and Prognostics in Machining Processes.",
            "Automated Selection and Placement of Single Cells Using Vision-Based Feedback Control.",
            "A Collaborative Multiagent Taxi-Dispatch System.",
            "Collaborative Fixture Design and Analysis Using Service Oriented Architecture.",
            "Autonomous Distributed Control of Simultaneous Multiple Spacecraft Proximity Maneuvers.",
            "A New ANFIS for Parameter Prediction With Numeric and Categorical Inputs.",
            "A Hybrid Nested Partitions Algorithm for Banking Facility Location Problems.",
            "A Semantic Feature Model in Concurrent Engineering.",
            "Dynamics of WIP Regulation in Large Production Networks of Autonomous Work Systems.",
            "Quality Analysis in Flexible Manufacturing Systems With Batch Productions: Performance Evaluation and Nonmonotonic Properties.",
            "A Structural Property of Optimal Policies for Multi-Component Maintenance Problems.",
            "Sensor Placement for Triangulation-Based Localization.",
            "Data-Driven Service Composition in Enterprise SOA Solutions: A Petri Net Approach.",
            "Embedded System for Hygiene Compliance Monitoring.",
            "Constrained Motion Tracking Control of Piezo-Actuated Flexure-Based Four-Bar Mechanisms for Micro/Nano Manipulation.",
            "LaneRuler: Automated Lane Tracking for DNA Electrophoresis Gel Images.",
            "Approximate Analysis of Reentrant Lines With Bernoulli Reliability Model.",
            "Guest Editorial Automation in Automotive Manufacturing.",
            "Predictive Control Considering Model Uncertainty for Variation Reduction in Multistage Assembly Processes.",
            "Process Capability Sensitivity Analysis for Design Evaluation of Multistage Assembly Processes.",
            "Variation Analysis of Tooth Engagement and Loads in Involute Splines.",
            "Quality/Quantity Improvement in an Automotive Paint Shop: A Case Study.",
            "Efficient Simulation Method for General Assembly Systems With Material Handling Based on Aggregated Event-Scheduling.",
            "Product Sequencing With Respect to Quality in Flexible Manufacturing Systems With Batch Operations.",
            "Sequence Planning for Integrated Product, Process and Automation Design.",
            "A Real-Time Algorithm for Determining the Optimal Paint Gun Orientation in Spray Paint Applications.",
            "A Safety Measure for Control Mode Switching of Skill-Assist for Effective Automotive Manufacturing.",
            "Interval Model Control of Consumable Double-Electrode Gas Metal Arc Welding Process.",
            "Efficient Estimation and Collision-Group-Based Anticollision Algorithms for Dynamic Frame-Slotted ALOHA in RFID Networks.",
            "Local Capacity Hinfty Control for Production Networks of Autonomous Work Systems With Time-Varying Delays.",
            "Analytic Calculus of Response Time in Networked Automation Systems.",
            "Diagnosis of Dense-Time Systems Under Event and Timing Masks.",
            "Behavior Analysis for Assisted Living.",
            "Multirobot Coordination for Flexible Batch Manufacturing Systems Experiencing Bottlenecks.",
            "Formulation and a Simulation-Based Algorithm for Line-Side Buffer Assignment Problem in Systems of General Assembly Line With Material Handling.",
            "Verification of a Timed Multitask System With Uppaal.",
            "Low-Cost and High-Performance Supervision in Ratio-Enforced Automated Manufacturing Systems Using Timed Petri Nets.",
            "Two Simple Deadlock Prevention Policies for S3PR Based on Key-Resource/Operation-Place Pairs.",
            "Minimize Production Loss in Device Testing via Condition-Based Equipment Maintenance.",
            "Bayesian Tag Estimate and Optimal Frame Length for Anti-Collision Aloha RFID System.",
            "Long-Term Scheduling for Cascaded Hydro Energy Systems With Annual Water Consumption and Release Constraints."
        ]
    },
    {
        "name": "TASAE",
        "year": "2009",
        "info": "Volume 6: 2009",
        "count": 76,
        "papers": [
            "Guest Editorial Special Section on RFID.",
            "The In-Situ Technique for Measuring Input Impedance and Connection Effects of RFID Tag Antenna.",
            "An Accurate Tag Estimate Method for Improving the Performance of an RFID Anticollision Algorithm Based on Dynamic Frame Length ALOHA.",
            "An Optimal Q-Algorithm for the ISO 18000-6C RFID Protocol.",
            "Active RFID System With Spread-Spectrum Transmission.",
            "RFIDSim - A Physical and Logical Layer Simulation Engine for Passive RFID.",
            "Direction Sensing RFID Reader for Mobile Robot Navigation.",
            "3-D Tag-Based RFID System for Recognition of Object.",
            "Passive UHF RFID in Paper Industry: Challenges, Benefits and the Application Environment.",
            "Analysis of Rigid Body Interactions for Compliant Motion Tasks Using the Grassmann-Cayley Algebra.",
            "A Petri Net-Based Method for Compatibility Analysis and Composition of Web Services in Business Process Execution Language.",
            "Hierarchical Segmentation of Piecewise Pseudoextruded Surfaces for Uniform Coverage.",
            "Efficient Determination of Four-Point Form-Closure Optimal Constraints of Polygonal Objects.",
            "Regularity Analysis for Patterned Texture Inspection.",
            "Contrast Enhancement and Intensity Preservation for Gray-Level Images Using Multiobjective Particle Swarm Optimization.",
            "Automatic Reconfiguration of Petri Net Controllers for Reconfigurable Manufacturing Systems With an Improved Net Rewriting System-Based Approach.",
            "Closed Bernoulli Production Lines: Analysis, Continuous Improvement, and Leanness.",
            "Brightness-Based Selection and Edge Detection-Based Enhancement Separation Algorithm for Low-Resolution Metal Transfer Images.",
            "An Efficient Approach for Dynamic Calibration of Multiple Cameras.",
            "Robust Supervisory Control for Product Routings With Multiple Unreliable Resources.",
            "Guest Editorial Special Section on Drug Delivery Automation.",
            "High-Throughput Automated Injection of Individual Biological Cells.",
            "Dynamics Modeling and Analysis of a Swimming Microrobot for Controlled Drug Delivery.",
            "Dynamics Modeling and Control of Electroporation-Mediated Gene Delivery.",
            "Weighting Restriction for Intravenous Insulin Delivery on T1DM Patient via Hinfty Control.",
            "Activation of Immune Response in Disease Dynamics via Controlled Drug Scheduling.",
            "Control of Drug Administration During Monitored Anesthesia Care.",
            "Port-of-Entry Inspection: Sensor Deployment Policy Optimization.",
            "Designing Distributed Diagnosers for Complex Continuous Systems.",
            "Microsurface Reverse Engineering and Compensation for Laser Micromachining.",
            "An Open CNC System Based on Component Technology.",
            "Web Service Configuration Under Multiple Quality-of-Service Attributes.",
            "Experimental Case Study of a BACnet-Based Lighting Control System.",
            "Bounds on the Number of Markings Consistent With Label Observations in Petri Nets.",
            "M3-Deterministic, Multiscale, Multirobot Platform for Microsystems Packaging: Design and Quasi-Static Precision Evaluation.",
            "Decentralized Diagnosis of Event-Driven Systems for Safely Reacting to Failures.",
            "Internal Model Control Based on a Neurofuzzy System for Network Applications. A Case Study on the High-Performance Drilling Process.",
            "Application of Multiobjective Genetic Programming to the Design of Robot Failure Recognition Systems.",
            "Flow Diversion Strategies for Routing in Integrated Automatic Shipment Handling Systems.",
            "Passive Self-Replication of Millimeter-Scale Parts.",
            "Errata to \"A Petri Net-Based Method for Compatibility Analysis and Composition of Web Services in Business Process Execution Language\" [Jan 09 94-106].",
            "Guest Editorial Solid and Physical Modeling.",
            "An Exact, Complete and Efficient Computation of Arrangements of Bézier Curves.",
            "Meshless Harmonic Volumetric Mapping Using Fundamental Solution Methods.",
            "Molds for Meshes: Computing Smooth Parting Lines and Undercut Removal.",
            "An Algorithm for Direct Multiplication of B-Splines.",
            "Reconstruction Algorithms as a Suitable Basis for Mesh Connectivity Compression.",
            "Chain-Based Representations for Solid and Physical Modeling.",
            "Reachability Graph of Finite and Deterministic DEVS Networks.",
            "Inference-Based Ambiguity Management in Decentralized Decision-Making: Decentralized Diagnosis of Discrete-Event Systems.",
            "Calibrating an Automatic Zoom Camera With Moving Least Squares.",
            "An Active Zooming Strategy for Variable Field of View and Depth of Field in Vision-Based Microassembly.",
            "Automated Refinement of Automated Visual Inspection Algorithms.",
            "Automation of Challenging Spatial-Temporal Biomedical Observations With the Adaptive Scanning Optical Microscope (ASOM).",
            "Cell Contour Tracking and Data Synchronization for Real-Time, High-Accuracy Micropipette Aspiration.",
            "Lift-Gas Allocation Under Precedence Constraints: MILP Formulation and Computational Analysis.",
            "Optimal Design of Gear Ratios and Offset for Energy Conservation of an Articulated Manipulator.",
            "Clarification on the Computation of Liveness-Enforcing Supervisor for Resource Allocation Systems With Uncontrollable Behavior.",
            "A Scale Stretch Method Based on ICP for 3D Data Registration.",
            "Visual-Based Impedance Control of Out-of-Plane Cell Injection Systems.",
            "Guest Editorial Introducing Automation and Engineering for Ambient Intelligence.",
            "Active Tuning of Intrinsic Camera Parameters.",
            "Detecting Human Behavior Models From Multimodal Observation in a Smart Home.",
            "Robust Location-Aware Activity Recognition Using Wireless Sensor Network in an Attentive Home.",
            "Game-Theoretic Modeling of Joint Topology Control and Power Scheduling for Wireless Heterogeneous Sensor Networks.",
            "Environmental-Adaptive RSSI-Based Indoor Localization.",
            "Design and Implementation of a Ubiquitous Robotic Space.",
            "An Optimal Mechanism for Sponsored Search Auctions on the Web and Comparison With Other Mechanisms.",
            "Optimality Criteria for Fixture Layout Design: A Comparative Study.",
            "An Efficient Approach to Interpreting Rigorous Tolerance Semantics for Complicated Tolerance Specification.",
            "Friction-Induced Lines of Attraction and Repulsion for Parts Sliding on an Oscillated Plate.",
            "Stripification of Free-Form Surfaces With Global Error Bounds for Developable Approximation.",
            "Design, Fabrication, and Visual Servo Control of an XY Parallel Micromanipulator With Piezo-Actuation.",
            "A Synchronization Approach for the Minimization of Contouring Errors of CNC Machine Tools.",
            "Intelligent Optimal-Setting Control for Grinding Circuits of Mineral Processing Process.",
            "A First-Order Hybrid Petri Net Model for Supply Chain Management."
        ]
    },
    {
        "name": "TASAE",
        "year": "2008",
        "info": "Volume 5: 2008",
        "count": 64,
        "papers": [
            "Editorial Home Automation as a Means of Independent Living.",
            "Inhabitants Tracking System in a Cluttered Home Environment Via Floor Load Sensors.",
            "A Steward Robot for Human-Friendly Human-Machine Interaction in a Smart House Environment.",
            "Robust Environmental Sound Recognition for Home Automation.",
            "A New Approach for Measuring Single-Cell Oxygen Consumption Rates.",
            "A New Methodology for Modeling, Analysis, Synthesis, and Simulation of Time-Optimal Train Traffic in Large Networks.",
            "Integrated Supervisory and Operational Control of a Warehouse With a Matrix-Based Approach.",
            "Adaptive Neuro-Fuzzy Inference System Modeling of MRR and WIWNU in CMP Process With Sparse Experimental Data.",
            "Control Reconfiguration of Discrete Event Systems With Dynamic Control Specifications.",
            "Prioritized Synchronization Under Mask for Control and Interaction of Partially Observed Event-Driven Systems.",
            "Generation of STEP AP214 Models From Discrete Event Systems for Process Planning and Control.",
            "An Intelligent Online Monitoring and Diagnostic System for Manufacturing Automation.",
            "Vision-Based Online Process Control in Manufacturing Applications.",
            "A Neural Network Degradation Model for Computing and Updating Residual Life Distributions.",
            "Characteristic Equation-Based Dynamics Analysis of Vibratory Bowl Feeders With Three Spatial Compliant Legs.",
            "Automatic Scratching Pattern Detection for Laboratory Mice Using High-Speed Video Images.",
            "A Maximally Permissive Deadlock Prevention Policy for FMS Based on Petri Net Siphon Control and the Theory of Regions.",
            "Coordinated Logistics Scheduling for In-House Production and Outsourcing.",
            "Compensation of Scanner Creep and Hysteresis for AFM Nanomanipulation.",
            "Fiber Assembly of MEMS Optical Switches With U-Groove Channels.",
            "A Novel Multipin Positioning System for the Generation of High-Resolution 3-D Profiles by Pin-Arrays.",
            "Randomized Optimal Design of Parallel Manipulators.",
            "A Dynamic Multiagent System Based on a Negotiation Mechanism for Product Family Design.",
            "Group Elevator Scheduling With Advance Information for Normal and Emergency Modes.",
            "An Augmented Lagrangian Approach for Distributed Supply Chain Planning for Multiple Companies.",
            "Analysis of Admission and Inventory Control Policies for Production Networks.",
            "Effective Neighborhood Operators for Solving the Flexible Demand Assignment Problem.",
            "Lean Buffering in Serial Production Lines With Nonidentical Exponential Machines.",
            "Steady-State Control Reference and Token Conservation Laws in Continuous Petri Net Systems.",
            "Steady-State Throughput and Scheduling Analysis of Multicluster Tools: A Decomposition Approach.",
            "New Hybrid Optimization Algorithms for Machine Scheduling Problems.",
            "New Solution Approaches to the General Single- Machine Earliness-Tardiness Problem.",
            "Automatic Inspection of Transmission Devices Using Acoustic Data.",
            "Navigating a Miniature Crawler Robot for Engineered Structure Inspection.",
            "Mechanism Design for Single Leader Stackelberg Problems and Application to Procurement Auction Design.",
            "An Optimization-Based Approach for Design Project Scheduling.",
            "On Clamping Planning in Workpiece-Fixture Systems.",
            "Control Mechanism Analysis of Small-Agent Networks Using a Distinguished Node Model for Urban Traffic Controls.",
            "Modeling and Supervisory Control of Railway Networks Using Petri Nets.",
            "Microassembly Fabrication of Tissue Engineering Scaffolds With Customized Design.",
            "Octree-Based Production of Near Net Shape Components.",
            "A Kinematic Model of Finger Gaits by Multifingered Hand as Hybrid Automaton.",
            "Fault Detection, Isolation, and Accommodation Control in Robotic Systems.",
            "Schedulability Analysis of Time-Constrained Cluster Tools With Bounded Time Variation by an Extended Petri Net.",
            "Stochastic Modeling of an Automated Guided Vehicle System With One Vehicle and a Closed-Loop Path.",
            "A Structure Property of Optimal Policies for Maintenance Problems WithSafety-Critical Components.",
            "On Observability and Design of Observers inTimed Continuous Petri Net Systems.",
            "Optimal Vibratory Stick-Slip Transport.",
            "Color-Coating Production Scheduling for Coils in Inventory in Steel Industry.",
            "Anti-Swinging Input Shaping Control of an Automatic Construction Crane.",
            "Identification of Influential Functional Process Variables for Surface Quality Control in Hot Rolling Processes.",
            "Toward Autonomous Excavation of Fragmented Rock: Full-Scale Experiments.",
            "Hybrid Nested Partitions and Mathematical Programming Approach and Its Applications.",
            "A Tax Integrated Approach for Global Supply Chain Network Planning.",
            "Design of Stochastic Distribution Networks Using Lagrangian Relaxation.",
            "Optimization of Joint Replacement Policies for Multipart Systems by a Rollout Framework.",
            "Directed Control of Discrete Event Systems for Safety and Nonblocking.",
            "Market-Based Model Predictive Control for Large-Scale Information Networks: Completion Time and Value of Solution.",
            "An Assessment of PLC Software Structure Suitability for the Support of Flexible Manufacturing Processes.",
            "Sensor Selection in Arbitrary Dimensions.",
            "A Petri Net-Based Heuristic Algorithm for Realizability of Target Refining Schedule for Oil Refinery.",
            "Automated Planning and Optimization of Lumber Production Using Machine Vision and Computed Tomography.",
            "Local Dynamic Stability Assessment of Motion Impaired Elderly Using Electronic Textile Pants.",
            "Supply Chain Management by H-Infinity Control."
        ]
    },
    {
        "name": "TASAE",
        "year": "2007",
        "info": "Volume 4: 2007",
        "count": 57,
        "papers": [
            "The Development of Direct Metallic Rapid Tooling System.",
            "Volume Parameterization for Design Automation of Customized Free-Form Products.",
            "Diagnosis of Sheet Metal Stamping Processes Based on 3-D Thermal Energy Distribution.",
            "Online Fault Diagnosis of Discrete Event Systems. A Petri Net-Based Approach.",
            "Effects of Classification Methods on Color-Based Feature Detection With Food Processing Applications.",
            "Grasping Optimization Using a Required External Force Set.",
            "Design of Multiunit Electronic Exchanges Through Decomposition.",
            "Manufacturing System Design to Improve Quality Buy Rate: An Automotive Paint Shop Application Study.",
            "Social Foraging Theory for Robust Multiagent System Design.",
            "A Case Study on Integrated Production Planning and Scheduling in a Three-Stage Manufacturing System.",
            "A Small Model Theorem for Bisimilarity Control Under Partial Observation.",
            "A Resource Allocation Algorithm for Multivehicle Systems With Nonholonomic Constraints.",
            "On the Use of UML for Modeling Mechatronic Systems.",
            "Diagnosis of DES With Petri Net Models.",
            "Automated Pipe Defect Detection and Categorization Using Camera/Laser-Based Profiler and Artificial Neural Network.",
            "High-Throughput Automated System for Crystallizing Membrane Proteins in Lipidic Mesophases.",
            "Kinematic Analysis of Dimensional Variation Propagation for Multistage Machining Processes With General Fixture Layouts.",
            "Exploiting Phase Fluctuations to Improve Machine Performance Monitoring.",
            "Event-Condition-Action Systems for Reconfigurable Logic Control.",
            "A Multiresolution Analysis-Assisted Reinforcement Learning Approach to Run-by-Run Control.",
            "Automatic Control Sequence Generation for a Hybrid Disassembly System.",
            "Distributed Diagnosis of Place-Bordered Petri Nets.",
            "Penalty Function-Based Two-Level Hybrid Shop Floor Control System.",
            "Polynomial Algorithms for Single-Item Lot-Sizing Models With Bounded Inventory and Backlogging or Outsourcing.",
            "Algebraic Structure and Geometric Interpretation of Rigid Complex Fixture Systems.",
            "Analytical Framework for the Management of Risk in Supply Chains.",
            "Fast Nesting of 2-D Sheet Parts With Arbitrary Shapes Using a Greedy Method and Semi-Discrete Representations.",
            "Slip Control System for a Deep-Sea Mining Machine.",
            "An Efficient Approach for the Calibration of Multiple PTZ Cameras.",
            "Auction-Based Mechanisms for Electronic Procurement.",
            "Evaluating the Effect of Force Feedback in Cell Injection.",
            "Band Selection of Hyperspectral Images for Automatic Detection of Poultry Skin Tumors.",
            "Control of Nondeterministic Discrete Event Systems for Simulation Equivalence.",
            "Design for Cost: Module-Based Mass Customization.",
            "Hybrid Design Methodology and Cost-Effectiveness Evaluation of AGV Transportation Systems.",
            "Cooling an Array of High-Powered Miniature Robots Using Forced Air Convection.",
            "A Vision-Based Intelligent System for Packing 2-D Irregular Shapes.",
            "A Production-Inventory Problem for an Energy Buy-Back Program.",
            "Reactive Scheduling of a Distributed Network for the Supply of Perishable Products.",
            "An Incremental Petri Net-Based Approach to the Modeling of Production Sequences in Manufacturing Systems.",
            "Multihoist Cyclic Scheduling With Fixed Processing and Transfer Times.",
            "Integrating Temporal Logic as a State-Based Specification Language for Discrete-Event Control Design in Finite Automata.",
            "Feature Selection for Troubleshooting in Complex Assembly Lines.",
            "Data-Driven Modeling, Fault Diagnosis and Optimal Sensor Selection for HVAC Chillers.",
            "Deadlock Resolution in Automated Manufacturing Systems With Robots.",
            "Editorial e-Manufacturing in the Semiconductor Industry.",
            "A Biochip Microarray Fabrication System Using Inkjet Technology.",
            "Economic Efficiency Analysis of Wafer Fabrication.",
            "Queueing Theory for Semiconductor Manufacturing Systems: A Survey and Open Problems.",
            "Practical Extensions to Cycle Time Approximations for the G/G/m-Queue With Applications.",
            "Expected Response Times for Closed-Loop Multivehicle AMHS.",
            "Hierarchical Capacity Planning With Reconfigurable Kits in Global Semiconductor Assembly and Test Manufacturing.",
            "Efficient Simulation-Based Composition of Scheduling Policies by Integrating Ordinal Optimization With Design of Experiment.",
            "Bottleneck Station Scheduling in Semiconductor Assembly and Test Manufacturing Using Ant Colony Optimization.",
            "A Lot Dispatching Strategy Integrating WIP Management and Wafer Start Control.",
            "A Petri-Net Approach to Modular Supervision With Conflict Resolution for Semiconductor Manufacturing Systems.",
            "Reticle Design for Minimizing Multiproject Wafer Production Cost."
        ]
    },
    {
        "name": "TASAE",
        "year": "2006",
        "info": "Volume 3: 2006",
        "count": 45,
        "papers": [
            "Optimizing picking operations on dual-head placement machines.",
            "Exact algorithms for single frame selection on multiaxis Satellites.",
            "Modeling, analysis, synthesis, and performance evaluation of multioperational production systems with hybrid timed Petri nets.",
            "Diagnosis of repeated failures for discrete event systems with linear-time temporal-logic specifications.",
            "An SPC monitoring system for cycle-based waveform signals using haar transform.",
            "An approach to minimize build errors in direct metal laser sintering.",
            "A scheme for mapping tolerance specifications to generalized deviation space for use in tolerance synthesis and analysis.",
            "Generating variational geometry of a hole with composite tolerances.",
            "Computational thermal fluid models for design of a modern fiber draw process.",
            "Modeling by numerical reduction of modes for multivariable control of an optical-fiber draw process.",
            "Editorial Special Issue on Life Science Automation.",
            "A real-time PCR analyzer compatible with high-throughput automated processing of 2-μL reactions in glass capillaries.",
            "In situ DNA synthesis on glass substrate for microarray fabrication using self-focusing acoustic transducer.",
            "Dynamics modeling and analysis of inkjet technology-based oligo DNA microarray spotting.",
            "Automated multiparametric platform for high-content and high-Throughput Analytical screening on living cells.",
            "Lab automation in cultivation of adherent cells.",
            "Automated liquid dispensing pin for DNA microarray applications.",
            "Editorial Recent Development in Nanoscale Manipulation and Assembly.",
            "Drift compensation for automatic nanomanipulation with scanning probe microscopes.",
            "CAD-guided automated nanoassembly using atomic force microscopy-based nonrobotics.",
            "Development of an automated microspotting system for rapid dielectrophoretic fabrication of bundled carbon nanotube sensors.",
            "Towards nanotube linear servomotors.",
            "Automated CAD/CAM-based nanolithography using a custom atomic force microscope.",
            "Task-based and stable telenanomanipulation in a nanoscale virtual environment.",
            "A novel design and analysis of a 2-DOF compliant parallel micromanipulator for nanomanipulation.",
            "Understanding and harnessing biomimetic molecular machines for NEMS actuation materials.",
            "Microscale hybrid devices powered by biological flagellar motors.",
            "Control of a particular micro-macro positioning system applied to cell micromanipulation.",
            "Constructing minimum deflection fixture arrangements using frame invariant norms.",
            "Real-time operating environmentfor networked control systems.",
            "STEP-NC and function blocks for interoperable manufacturing.",
            "Robust supervisory control for Production Systems with multiple resource failures.",
            "A systematic approach to design and operation of disassembly lines.",
            "Modeling, scheduling, and performance evaluation for wafer fabrication: a queueing colored Petri-net and GA-based approach.",
            "Editorial Special Section on Distributed Sensing for Quality and Productivity Improvement.",
            "Distributed Sensing for Quality and Productivity Improvements.",
            "Semidefinite Programming Approaches for Sensor Network Localization With Noisy Distance Measurements.",
            "The Sensor Selection Problem for Bounded Uncertainty Sensing Modelus.",
            "Sensory-Updated Residual Life Distributions for Components With Exponential Degradation Patterns.",
            "An Automated Feature Selection Method for Visual Inspection Systems.",
            "Stream-of-Variation (SoV)-Based Measurement Scheme Analysis in Multistation Machining Systems.",
            "Fault Region Localization: Product and Process Improvement Based on Field Performance and Manufacturing Measurements.",
            "Integration of Process-Oriented Tolerancing and Maintenance Planning in Design of Multistation Manufacturing Processes.",
            "A Minimum-Jerk Speed-Planning Algorithm for Coordinated Planning and Control of Automated Assembly Manufacturing.",
            "A Necessary and Sufficient Condition for the Liveness and Reversibility of Process-Resource Nets With Acyclic, Quasi-live, Serializable, and Reversible Process Subnets."
        ]
    },
    {
        "name": "TASAE",
        "year": "2005",
        "info": "Volume 2: 2005",
        "count": 40,
        "papers": [
            "A flexible automatic test system for rotating-turbine machinery.",
            "Computation of three-dimensional rigid-body dynamics with multiple unilateral contacts using time-stepping and Gauss-Seidel methods.",
            "Automated generation of assembly system-design solutions.",
            "Overlapping decomposition: a system-theoretic method for modeling and analysis of complex manufacturing systems.",
            "Strategic sourcing and collaborative planning in Internet-enabled supply chain networks producing multigeneration products.",
            "Artificial-intelligence approach for biomedical sample characterization using Raman spectroscopy.",
            "An efficient search method for job-shop scheduling problems.",
            "A tight flow control for job-shop fabrication lines with finite buffers.",
            "Throughput gain with parallel flow in automated flow lines.",
            "On computation of state avoidance control for infinite state systems in assignment program framework.",
            "Comments on \"Timed Petri Nets in Modeling and Analysis of Cluster Tools\".",
            "A characterization of diagnosability conditions for variance components analysis in assembly operations.",
            "A robotic mechanism for grasping sacks.",
            "Improving the performance of globalized dual heuristic programming for fault tolerant control through an online learning supervisor.",
            "Modeling and performance evaluation of supply chains using batch deterministic and stochastic Petri nets.",
            "A Lagrangian relaxation based approach to schedule asset overhaul and repair services.",
            "Dynamically optimal policies for stochastic scheduling subject to preemptive-repeat machine breakdowns.",
            "Multi-degree cyclic scheduling of two robots in a no-wait flowshop.",
            "The path method for analyzing mobility and constraint of mechanisms and assemblies.",
            "Development of a new variable remote center compliance (VRCC) with modified elastomer shear pad (ESP) for robot assembly.",
            "Effective approaches for low temperature polysilicon TFT LCD post-mapping yield control problem.",
            "Ontology-based exchange of product data semantics.",
            "Analysis and design of a novel hydraulic power source for mobile robots.",
            "A frequency-domain approach to determining the path separation for spray coating.",
            "Tool path planning for compound surfaces in spray forming processes.",
            "Integrated synthesis of assembly and fixture scheme for properly constrained assembly.",
            "Machine learning approach for determining feasible plans of a remanufacturing system.",
            "Minimizing staircase errors in the orthogonal layered manufacturing system.",
            "Relative value function approximation for the capacitated re-entrant line scheduling problem.",
            "Repositioning of a rigid body with a flexible sheet and its application to an automated rehabilitation bed.",
            "Complex-valued token Petri nets.",
            "An extended event graph with negative places and tokens for time window constraints.",
            "Control of Markov chains with safety bounds.",
            "Dual constrained single machine sequencing to minimize total weighted completion time.",
            "A generic deviation-based approach for synthesis of tolerances.",
            "How to reach the dynamic limits of parallel robots? An autonomous control approach.",
            "Paint deposition modeling for trajectory planning on automotive surfaces.",
            "Development of an automatic mold polishing system.",
            "Multi-depot vehicle routing problem: a one-stage approach.",
            "T-ASE Reviewers for 2004/2005."
        ]
    },
    {
        "name": "TASAE",
        "year": "2004",
        "info": "Volume 1: 2004",
        "count": 17,
        "papers": [
            "Editorial.",
            "The development of an intelligent Web-based rapid prototyping manufacturing system.",
            "Development of an intelligent energy management network for building automation.",
            "Port yard storage optimization.",
            "Design of six sigma supply chains.",
            "Development of holonic information coordination systems with failure-recovery considerations.",
            "Statistical estimation and testing for variation root-cause identification of multistage manufacturing Processes.",
            "Increasing throughput for robotic cells with parallel Machines and multiple robots.",
            "Throughput analysis in automotive paint shops: a case study.",
            "Productivity of parallel production lines with unreliable Machines and material handling.",
            "Guest Editorial.",
            "Unilateral fixtures for sheet-metal parts with holes.",
            "Modeling, analysis, and verification of optimal fixturing design.",
            "Optimal design of fixture layout in multistation assembly processes.",
            "On quality functions for grasp synthesis, fixture planning, and coordinated manipulation.",
            "Stable transport of assemblies: pushing stacked parts.",
            "T-ASE Reviewers for 2003/2004."
        ]
    }
]