[
    {
        "name": "TBD",
        "year": "2022",
        "info": "Volume 8, 2022",
        "count": 43,
        "papers": [
            "Revocable Identity-Based Access Control for Big Data with Verifiable Outsourced Computing.",
            "NPP: A New Privacy-Aware Public Auditing Scheme for Cloud Data Sharing with Group Users.",
            "PPHOPCM: Privacy-Preserving High-Order Possibilistic c-Means Algorithm for Big Data Clustering with Cloud Computing.",
            "Toward Architectural and Protocol-Level Foundation for End-to-End Trustworthiness in Cloud/Fog Computing.",
            "Trustworthiness Evaluation-Based Routing Protocol for Incompletely Predictable Vehicular Ad Hoc Networks.",
            "Time Series Anomaly Detection for Trustworthy Services in Cloud Computing Systems.",
            "Achieving Efficient and Privacy-Preserving Cross-Domain Big Data Deduplication in Cloud.",
            "WukaStore: Scalable, Configurable and Reliable Data Storage on Hybrid Volunteered Cloud and Desktop Systems.",
            "Efficient Trustworthiness Management for Malicious User Detection in Big Data Collection.",
            "Trust Based Incentive Scheme to Allocate Big Data Tasks with Mobile Social Cloud.",
            "MRMondrian: Scalable Multidimensional Anonymisation for Big Data Privacy Preservation.",
            "A Comprehensive Trustworthy Data Collection Approach in Sensor-Cloud Systems.",
            "Survey and Analysis of Current End-User Data Analytics Tool Support.",
            "Towards the Inference of Travel Purpose with Heterogeneous Urban Data.",
            "Finding and Tracking Multi-Density Clusters in Online Dynamic Data Streams.",
            "Fast Compressive Spectral Clustering for Large-Scale Sparse Graph.",
            "BiLSTM-SSVM: Training the BiLSTM with a Structured Hinge Loss for Named-Entity Recognition.",
            "Enabling Fast Exploratory Analyses Over Voluminous Spatiotemporal Data Using Analytical Engines.",
            "Forecasting People's Needs in Hurricane Events from Social Network.",
            "Identification of Encrypted Traffic Through Attention Mechanism Based Long Short Term Memory.",
            "Shadow: Exploiting the Power of Choice for Efficient Shuffling in MapReduce.",
            "Fuzzy Deep Neural Learning Based on Goodman and Kruskal's Gamma for Search Engine Optimization.",
            "LSTM Based Phishing Detection for Big Email Data.",
            "Improving Bank-Level Parallelism for In-Memory Checkpointing in Hybrid Memory Systems.",
            "A Shared-Memory Algorithm for Updating Tree-Based Properties of Large Dynamic Networks.",
            "A Stack-Centric Processing Model for Iterative Processing.",
            "I/O Workload Management for All-Flash Datacenter Storage Systems Based on Total Cost of Ownership.",
            "Parallel Secure Outsourcing of Large-Scale Nonlinearly Constrained Nonlinear Programming Problems.",
            "Efficient Big-Data Access: Taxonomy and a Comprehensive Survey.",
            "Visual Analytics of Anomalous User Behaviors: A Survey.",
            "Big Data and Emergency Management: Concepts, Methodologies, and Applications.",
            "Large-Scale and Scalable Latent Factor Analysis via Distributed Alternative Stochastic Gradient Descent for Recommender Systems.",
            "Uncovering Local Hierarchical Overlapping Communities at Scale.",
            "Least Squares Approximation via Sparse Subsampled Randomized Hadamard Transform.",
            "$d$d-Simplexed: Adaptive Delaunay Triangulation for Performance Modeling and Prediction on Big Data Analytics.",
            "PES: Priority Edge Sampling in Streaming Triangle Estimation.",
            "Discrete Double-Bit Hashing.",
            "GradientFlow: Optimizing Network Performance for Large-Scale Distributed DNN Training.",
            "Event Detection on Twitter by Mapping Unexpected Changes in Streaming Data into a Spatiotemporal Lattice.",
            "An Algorithm of Inductively Identifying Clusters From Attributed Graphs.",
            "Understanding the Users and Videos by Mining a Novel Danmu Dataset.",
            "Weakly Supervised Cross-Modal Hashing.",
            "Predicting Urban Water Quality With Ubiquitous Data - A Data-Driven Approach."
        ]
    },
    {
        "name": "TBD",
        "year": "2021",
        "info": "Volume 7, 2021",
        "count": 80,
        "papers": [
            "Guest Editorial: AI for COVID-19.",
            "COVID-19-CT-CXR: A Freely Accessible and Weakly Labeled Chest X-Ray and CT Image Collection on COVID-19 From Biomedical Literature.",
            "COVID-19 Chest CT Image Segmentation Network by Multi-Scale Fusion and Enhancement Operations.",
            "Leveraging Structured Biological Knowledge for Counterfactual Inference: A Case Study of Viral Pathogenesis.",
            "Relational Learning Improves Prediction of Mortality in COVID-19 in the Intensive Care Unit.",
            "An Epidemiological Neural Network Exploiting Dynamic Graph Structured Data Applied to the COVID-19 Outbreak.",
            "Measuring Human and Economic Activity From Satellite Imagery to Support City-Scale Decision-Making During COVID-19 Pandemic.",
            "Misinformation During the COVID-19 Outbreak in China: Cultural, Social and Political Entanglements.",
            "Country Image in COVID-19 Pandemic: A Case Study of China.",
            "Automated Labeling for Robotic Autonomous Navigation Through Multi-Sensory Semi-Supervised Learning on Big Data.",
            "Hierarchical Density-Based Clustering Using MapReduce.",
            "Deadline-Aware Cost Optimization for Spark.",
            "AMIC: An Adaptive Information Theoretic Method to Identify Multi-Scale Temporal Correlations in Big Time Series Data.",
            "K-Nearest Neighbor Search by Random Projection Forests.",
            "Fast Communication-Efficient Spectral Clustering over Distributed Data.",
            "Incorporating Data Context to Cost-Effectively Automate End-to-End Data Wrangling.",
            "Effective and Efficient Content Redundancy Detection of Web Videos.",
            "Research on Escaping the Big-Data Traps in O2O Service Recommendation Strategy.",
            "RoD: Evaluating the Risk of Data Disclosure Using Noise Estimation for Differential Privacy.",
            "Algorithms of Unconstrained Non-Negative Latent Factor Analysis for Recommender Systems.",
            "A Novel Hilbert Curve for Cache-Locality Preserving Loops.",
            "A Large-Scale Study of Android Malware Development Phenomenon on Public Malware Submission and Scanning Platform.",
            "A Deep Learning-Based Data Minimization Algorithm for Fast and Secure Transfer of Big Genomic Datasets.",
            "Managing Big Interval Data with CINTIA: The Checkpoint INTerval Array.",
            "ScaleJoin: A Deterministic, Disjoint-Parallel and Skew-Resilient Stream Join.",
            "Data-Driven Digital Advertising with Uncertain Demand Model in Metro Networks.",
            "A User-Oriented Taxi Ridesharing System with Large-Scale Urban GPS Sensor Data.",
            "An Incremental Tensor-Train Decomposition for Cyber-Physical-Social Big Data.",
            "Fusing Location Data for Depression Prediction.",
            "BusBeat: Early Event Detection with Real-Time Bus GPS Trajectories.",
            "Opportunistic Discovery of Personal Places Using Multi-Source Sensor Data.",
            "Altrumetrics: Inferring Altruism Propensity Based on Mobile Phone Use Patterns.",
            "Cost-Efficient Heterogeneous Worker Recruitment under Coverage Requirement in Spatial Crowdsourcing.",
            "Towards Dynamic Verifiable Pattern Matching.",
            "Semantic-Based and Entity-Resolution Fusion to Enhance Quality of Big RDF Data.",
            "A Machine Learning Based Framework for Verification and Validation of Massive Scale Image Data.",
            "A New Methodology for Storing Consistent Fuzzy Geospatial Data in Big Data Environment.",
            "Integrating Data and Model Space in Ensemble Learning by Visual Analytics.",
            "Visual Analysis of Spatio-Temporal Event Predictions: Investigating the Spread Dynamics of Invasive Species.",
            "Modeling and Visualizing Student Flow.",
            "Visualization of Big Spatial Data Using Coresets for Kernel Density Estimates.",
            "Billion-Scale Similarity Search with GPUs.",
            "A New Approach of Exploiting Self-Adjoint Matrix Polynomials of Large Random Matrices for Anomaly Detection and Fault Location.",
            "Multiple Distance-Based Coding: Toward Scalable Feature Matching for Large-Scale Web Image Search.",
            "To Your Surprise: Identifying Serendipitous Collaborators.",
            "Efficient Graph Processing with Invalid Update Filtration.",
            "Fast and Positive Definite Estimation of Large Covariance Matrix for High-Dimensional Data Analysis.",
            "Dynamics of Public Opinions in an Online and Offline Social Network.",
            "Velocity-Aware Parallel Encryption Algorithm with Low Energy Consumption for Streams.",
            "Security-Aware Resource Allocation for Mobile Social Big Data: A Matching-Coalitional Game Solution.",
            "Game Theory Based Correlated Privacy Preserving Analysis in Big Data.",
            "A Pre-Authentication Approach to Proxy Re-Encryption in Big Data Context.",
            "Secure Authentication in Cloud Big Data with Hierarchical Attribute Authorization Structure.",
            "Privacy-Preserving Data Encryption Strategy for Big Data in Mobile Cloud Computing.",
            "Secure $k$k-NN Query on Encrypted Cloud Data with Multiple Keys.",
            "Optimizing Share Size in Efficient and Robust Secret Sharing Scheme for Big Data.",
            "Computation Outsourcing Meets Lossy Channel: Secure Sparse Robustness Decoding Service in Multi-Clouds.",
            "Survey on Improving Data Utility in Differentially Private Sequential Data Publishing.",
            "Deep Feature Learning for Medical Image Analysis with Convolutional Autoencoder Neural Network.",
            "Enhanced Locality-Sensitive Hashing for Fingerprint Forensics Over Large Multi-Sensor Databases.",
            "Privacy-Accuracy Trade-Off in Differentially-Private Distributed Classification: A Game Theoretical Approach.",
            "Correlated Differential Privacy Protection for Mobile Crowdsensing.",
            "SecFact: Secure Large-scale QR and LU Factorizations.",
            "An Improved Secure High-Order-Lanczos Based Orthogonal Tensor SVD for Outsourced Cyber-Physical-Social Big Data Reduction.",
            "An Adaptive Pattern Learning Framework to Personalize Online Seizure Prediction.",
            "Distributed Sparse Class-Imbalance Learning and Its Applications.",
            "Leakage Resilient Leveled $\\mathsf {FHE}$FHE on Multiple Bits Message.",
            "Sparse User Check-in Venue Prediction By Exploring Latent Decision Contexts From Location-Based Social Networks.",
            "Discovering and Understanding Geographical Video Viewing Patterns in Urban Neighborhoods.",
            "Grasping Inter-Attribute and Temporal Variability in Multivariate Time Series.",
            "Privacy-Preserving Public Release of Datasets for Support Vector Machine Classification.",
            "Citywide Traffic Volume Inference with Surveillance Camera Records.",
            "Identity-Based Dynamic Data Auditing for Big Data Storage.",
            "Heterogeneous Daily Living Activity Learning Through Domain Invariant Feature Subspace.",
            "DIGDUG: Scalable Separable Dense Graph Pruning and Join Operations in MapReduce.",
            "Sense and Sensibility: Characterizing Social Media Users Regarding the Use of Controversial Terms for COVID-19.",
            "Linear Time Community Detection by a Novel Modularity Gain Acceleration in Label Propagation.",
            "Regularized Spectral Clustering With Entropy Perturbation.",
            "Comment on \"Efficient Secure Outsourcing of Large-Scale Sparse Linear Systems of Equations\".",
            "On Security of an Identity-Based Dynamic Data Auditing Protocol for Big Data Storage."
        ]
    },
    {
        "name": "TBD",
        "year": "2020",
        "info": "Volume 6, 2020",
        "count": 67,
        "papers": [
            "Message From the Outgoing Editor-in-Chief.",
            "Message from the Incoming Editor-in-Chief.",
            "Network Representation Learning: A Survey.",
            "Closed Walk Sampler: An Efficient Method for Estimating Eigenvalues of Large Graphs.",
            "From Megabits to CPU Ticks: Enriching a Demand Trace in the Age of MEC.",
            "E-Optimal Sensor Selection for Compressive Sensing-Based Purposes.",
            "Efficient Path Query Processing Over Massive Trajectories on the Cloud.",
            "Cornac: Tackling Huge Graph Visualization with Big Data Infrastructure.",
            "Short-Term Rainfall Forecasting Using Multi-Layer Perceptron.",
            "Parallel Grid-Based Colocation Mining Algorithms on GPUs for Big Spatial Event Data.",
            "Matrix Completion via Sparse Factorization Solved by Accelerated Proximal Alternating Linearized Minimization.",
            "Big Data Processing Workflows Oriented Real-Time Scheduling Algorithm using Task-Duplication in Geo-Distributed Clouds.",
            "Optimizing Taxi Driver Profit Efficiency: A Spatial Network-Based Markov Decision Process Approach.",
            "Geospatial Event Detection by Grouping Emotion Contagion in Social Media.",
            "On the Opportunistic Topology of Taxi Networks in Urban Mobility Environment.",
            "Overlapping Community Change-Point Detection in an Evolving Network.",
            "Fast Tensor Factorization for Large-Scale Context-Aware Recommendation from Implicit Feedback.",
            "Special Issue on Wireless Big Data.",
            "A Big Data Enabled Channel Model for 5G Wireless Communication Systems.",
            "Clustering Analysis in the Wireless Propagation Channel with a Variational Gaussian Mixture Model.",
            "MWBS: An Efficient Many-to-Many Wireless Big Data Delivery Scheme.",
            "Incremental Deep Computation Model for Wireless Big Data Feature Learning.",
            "Sleepy: Wireless Channel Data Driven Sleep Monitoring via Commodity WiFi Devices.",
            "WiFind: Driver Fatigue Detection with Fine-Grained Wi-Fi Signal Features.",
            "Differential Privacy Preserving of Training Model in Wireless Big Data with Edge Computing.",
            "Extracting Medical Knowledge from Crowdsourced Question Answering Website.",
            "Deep Model Based Transfer and Multi-Task Learning for Biological Image Analysis.",
            "Comparison of Different Machine Learning Approaches to Predict Small for Gestational Age Infants.",
            "CloudFinder: A System for Processing Big Data Workloads on Volunteered Federated Clouds.",
            "Comorbidity Patterns and Its Impact on Health Outcomes: Two-Way Clustering Analysis.",
            "Kira: Processing Astronomy Imagery Using Big Data Technology.",
            "Benchmarking Blocking Algorithms for Web Entities.",
            "Large-Scale Data Pollution with Apache Spark.",
            "On Power-Peak-Aware Scheduling for Large-Scale Shared Clusters.",
            "Special Issue on Big Data From Space.",
            "Optical Compressive Imaging Technologies for Space Big Data.",
            "Multiple Testing for Outlier Detection in Space Telemetries.",
            "Innovative Approach for PMM Data Processing and Analytics.",
            "Convolutional Neural Networks for Spectroscopic Redshift Estimation on Euclid Data.",
            "ASTROIDE: A Unified Astronomical Big Data Processing Engine over Spark.",
            "Beyond the Patchwise Classification: Spectral-Spatial Fully Convolutional Networks for Hyperspectral Image Classification.",
            "Exploiting Deep Features for Remote Sensing Image Retrieval: A Systematic Investigation.",
            "Mining Deep Semantic Representations for Scene Classification of High-Resolution Remote Sensing Imagery.",
            "A Time Series Mining Approach for Agricultural Area Detection.",
            "Mosaicking Copernicus Sentinel-1 Data at Global Scale.",
            "National Scale Surface Deformation Time Series Generation through Advanced DInSAR Processing of Sentinel-1 Data within a Cloud Computing Environment.",
            "Cloud Approach to Automated Crop Classification Using Sentinel-1 Imagery.",
            "Exploring Spring Onset at Continental Scales: Mapping Phenoregions and Correlating Temperature and Satellite-Based Phenometrics.",
            "Deep Neural Network-Based Impacts Analysis of Multimodal Factors on Heat Demand Prediction.",
            "Big Data for Cyber-Physical Systems.",
            "BioCyBig: A Cyberphysical System for Integrative Microfluidics-Driven Analysis of Genomic Association Studies.",
            "A Spatiotemporal Data Summarization Approach for Real-Time Operation of Smart Grid.",
            "A Mathematical Programming Formulation for Optimal Load Shifting of Electricity Demand for the Smart Grid.",
            "Event Detection Through Differential Pattern Mining in Cyber-Physical Systems.",
            "A Multi-Order Distributed HOSVD with Its Incremental Computing for Big Services in Cyber-Physical-Social Systems.",
            "On Physical-Social-Aware Localness Inference by Exploring Big Data from Location-Based Services.",
            "Control of Large-Scale Cyber-Physical Systems with Agents Having Various Dynamics.",
            "Scalable Uncertainty-Aware Truth Discovery in Big Data Social Sensing Applications for Cyber-Physical Systems.",
            "Towards Matching User Mobility Traces in Large-Scale Datasets.",
            "A Data-Driven Unified Framework for Predicting Citation Dynamics.",
            "Product Supply Optimization for Crowdfunding Campaigns.",
            "Scalable Triangle Discovery Algorithm for Large Scale-Free Network with Limited Internal Memory.",
            "Transfer to Rank for Top-N Recommendation.",
            "Learning a Unified Blind Image Quality Metric via On-Line and Off-Line Big Training Instances.",
            "Efficient Provenance Management via Clustering and Hybrid Storage in Big Data Environments.",
            "P-MOD: Secure Privilege-Based Multilevel Organizational Data-Sharing in Cloud Computing.",
            "GraphMP: I/O-Efficient Big Graph Analytics on a Single Commodity Machine."
        ]
    },
    {
        "name": "TBD",
        "year": "2019",
        "info": "Volume 5, 2019",
        "count": 48,
        "papers": [
            "State of the Journal.",
            "Guest Editors' Introduction: Special Issue on Big Data Systems on Emerging Architectures.",
            "MemepiC: Towards a Unified In-Memory Big Data Management System.",
            "Heterogeneous Architectures for Big Data Batch Processing in MapReduce Paradigm.",
            "Robust Big Data Analytics for Electricity Price Forecasting in the Smart Grid.",
            "Performance-Oriented Deployment of Streaming Applications on Cloud.",
            "A Survey on Geographically Distributed Big-Data Processing Using MapReduce.",
            "Understanding Processors Design Decisions for Data Analytics in Homogeneous Data Centers.",
            "Data-Pattern Enabled Self-Recovery Low-Power Storage System for Big Video Data.",
            "A Distributed Computing Platform for fMRI Big Data Analytics.",
            "Deep Geo-Constrained Auto-Encoder for Non-Landmark GPS Estimation.",
            "Handling Big Data Using a Data-Aware HDFS and Evolutionary Clustering Technique.",
            "Kernel-Induced Label Propagation by Mapping for Semi-Supervised Classification.",
            "Nonparametric Distributed Learning Architecture for Big Data: Algorithm and Applications.",
            "Scalable User-Substation Assignment with Big Data from Power Grids.",
            "SIMiner: A Stigmergy-Based Model for Mining Influential Nodes in Dynamic Social Networks.",
            "Towards Green Cloud Computing: Demand Allocation and Pricing Policies for Cloud Service Brokerage.",
            "Trident: Distributed Storage, Analysis, and Exploration of Multidimensional Phenomena.",
            "Understanding Urban Dynamics From Massive Mobile Traffic Data.",
            "Non-Stationary Model for Crime Rate Inference Using Modern Urban Data.",
            "On Scalable and Robust Truth Discovery in Big Data Social Media Sensing Applications.",
            "Special Issue on Big Data Applications in Cyber Security and Threat Intelligence - Part 1.",
            "Iterative Classifier Fusion System for the Detection of Android Malware.",
            "Spamdoop: A Privacy-Preserving Big Data Platform for Collaborative Spam Detection.",
            "Detecting Anomalous Behavior in Cloud Servers by Nested-Arc Hidden SEMI-Markov Model with State Summarization.",
            "Big Data for Cybersecurity: Vulnerability Disclosure Trends and Dependencies.",
            "Attribute-Based Storage Supporting Secure Deduplication of Encrypted Data in Cloud.",
            "Efficient Recommendation of De-Identification Policies Using MapReduce.",
            "A Secure High-Order Lanczos-Based Orthogonal Tensor SVD for Big Data Reduction in Cloud Environment.",
            "Efficient Secure Outsourcing of Large-Scale Convex Separable Programming for Big Data.",
            "SEEN: A Selective Encryption Method to Ensure Confidentiality for Big Sensing Data Streams.",
            "Heterogeneous Data Storage Management with Deduplication in Cloud Computing.",
            "Context-Driven Granular Disclosure Control for Internet of Things Applications.",
            "Special Issue on Big Data Applications in Cyber Security and Threat Intelligence - Part 2.",
            "A Novel Methodology to Acquire Live Big Data Evidence from the Cloud.",
            "Big Data Sanitization and Cyber Situational Awareness: A Network Telescope Perspective.",
            "Noise-Resistant Statistical Traffic Classification.",
            "Pattern Discovery in Internet Background Radiation.",
            "Novel Geometric Area Analysis Technique for Anomaly Detection Using Trapezoidal Area Estimation on Large-Scale Networks.",
            "3D Terrain Multiobjective Deployment Optimization of Heterogeneous Directional Sensor Networks in Security Monitoring.",
            "Ring: Real-Time Emerging Anomaly Monitoring System Over Text Streams.",
            "A Situational Analytic Method for User Behavior Pattern in Multimedia Social Networks.",
            "Multi-Modal Description of Public Safety Events Using Surveillance and Social Media.",
            "AnswerNet: Learning to Answer Questions.",
            "Sampling Big Trajectory Data for Traversal Trajectory Aggregate Query.",
            "QuantCloud: Enabling Big Data Complex Event Processing for Quantitative Finance Through a Data-Driven Execution.",
            "CityLines: Designing Hybrid Hub-and-Spoke Transit System with Urban Big Data.",
            "A Bilinear Ranking SVM for Knowledge Based Relation Prediction and Classification."
        ]
    },
    {
        "name": "TBD",
        "year": "2018",
        "info": "Volume 4, 2018",
        "count": 49,
        "papers": [
            "State of the Journal Editorial.",
            "A Generative Model for Sparse Hyperparameter Determination.",
            "Big Data Based Security Analytics for Protecting Virtualized Infrastructures in Cloud Computing.",
            "Efficient Secure Outsourcing of Large-Scale Sparse Linear Systems of Equations.",
            "In-Memory Stream Indexing of Massive and Fast Incoming Multimedia Content.",
            "Massive Streaming PMU Data Modelling and Analytics in Smart Grid State Evaluation based on Multiple High-Dimensional Covariance Test.",
            "Memory Vectors for Similarity Search in High-Dimensional Spaces.",
            "Online Similarity Learning for Big Data with Overfitting.",
            "QMSampler: Joint Sampling of Multiple Networks with Quality Guarantee.",
            "Smart Monitoring Cameras Driven Intelligent Processing to Big Surveillance Video Data.",
            "Viziometrics: Analyzing Visual Information in the Scientific Literature.",
            "Towards Max-Min Fair Resource Allocation for Stream Big Data Analytics in Shared Clouds.",
            "Guest Editorial: Big Data Infrastructure I.",
            "HDM: A Composable Framework for Big Data Processing.",
            "Distributed Feature Selection for Efficient Economic Big Data Analysis.",
            "Thermal-Aware and DVFS-Enabled Big Data Task Scheduling for Data Centers.",
            "GPU-Accelerated High-Throughput Online Stream Data Processing.",
            "MetaFlow: A Scalable Metadata Lookup Service for Distributed File Systems in Data Centers.",
            "Complex Queries Optimization and Evaluation over Relational and NoSQL Data Stores in Cloud Environments.",
            "Speed Up Big Data Analytics by Unveiling the Storage Distribution of Sub-Datasets.",
            "From Latency, Through Outbreak, to Decline: Detecting Different States of Emergency Events Using Web Resources.",
            "JouleMR: Towards Cost-Effective and Green-Aware Data Processing Frameworks.",
            "CaL: Extending Data Locality to Consider Concurrency for Performance Optimization.",
            "An Enhanced Visualization Method to Aid Behavioral Trajectory Pattern Recognition Infrastructure for Big Longitudinal Data.",
            "Guest Editorial: Big Data Infrastructure II.",
            "Structural Balance Theory-Based E-Commerce Recommendation over Big Rating Data.",
            "Cloud Infrastructure Resource Allocation for Big Data Applications.",
            "A Big Data-as-a-Service Framework: State-of-the-Art and Perspectives.",
            "A Secure and Verifiable Access Control Scheme for Big Data Storage in Clouds.",
            "SDN-Based Big Data Caching in ISP Networks.",
            "QuantCloud: Big Data Infrastructure for Quantitative Finance on the Cloud.",
            "NGD: Filtering Graphs for Visual Analysis.",
            "Accelerating MapReduce on Commodity Clusters: An SSD-Empowered Approach.",
            "Big Data Analysis-Based Security Situational Awareness for Smart Grid.",
            "MtMR: Ensuring MapReduce Computation Integrity with Merkle Tree-Based Verifications.",
            "Analysis of Knowledge Sharing Activities on a Social Network Incorporated Discussion Forum: A Case Study of DISboards.",
            "Characterizing User Connections in Social Media through User-Shared Images.",
            "Content-Aware Partial Compression for Textual Big Data Analysis in Hadoop.",
            "Effective Prediction of Missing Data on Apache Spark over Multivariable Time Series.",
            "Effective Promotional Strategies Selection in Social Media: A Data-Driven Approach.",
            "Euler Clustering on Large-Scale Dataset.",
            "HashTag Erasure Codes: From Theory to Practice.",
            "Human Activity Recognition with Posture Tendency Descriptors on Action Snippets.",
            "LS-Decomposition for Robust Recovery of Sensory Big Data.",
            "Mining the Most Influential k-Location Set from Massive Trajectories.",
            "pg-Causality: Identifying Spatiotemporal Causal Pathways for Air Pollutants with Urban Big Data.",
            "Secure k Nearest Neighbors Query for High-Dimensional Vectors in Outsourced Environments.",
            "SmartQ: A Question and Answer System for Supplying High-Quality and Trustworthy Answers.",
            "Assembling and Using a Cellular Dataset for Mobile Network Analysis and Planning."
        ]
    },
    {
        "name": "TBD",
        "year": "2017",
        "info": "Volume 3, 2017",
        "count": 39,
        "papers": [
            "State of the Journal Editorial.",
            "Guest Editorial: Big Scholar Data Discovery and Collaboration.",
            "The Habits of Highly Effective Researchers: An Empirical Study.",
            "Big Scholarly Data: A Survey.",
            "Guest Editorial: Big Media Data: Understanding, Search, and Mining.",
            "Learning to Classify Fine-Grained Categories with Privileged Visual-Semantic Misalignment.",
            "Retrieving Objects by Partitioning.",
            "Tales of Two Cities: Using Social Media to Understand Idiosyncratic Lifestyles in Distinctive Metropolitan Areas.",
            "Service Rating Prediction by Exploring Social Mobile Users' Geographical Locations.",
            "DiP-SVM : Distribution Preserving Kernel Support Vector Machine for Big Data.",
            "SocialQ&A: An Online Social Network Based Question and Answer System.",
            "Toward Efficient and Flexible Metadata Indexing of Big Data Systems.",
            "Guest Editorial: Urban Computing.",
            "Detecting and Analyzing Urban Regions with High Impact of Weather Change on Transport.",
            "Significant Linear Hotspot Discovery.",
            "Optimal Pick up Point Selection for Effective Ride Sharing.",
            "Discovering Congestion Propagation Patterns in Spatio-Temporal Traffic Data.",
            "Effective Urban Structure Inference from Traffic Flow Dynamics.",
            "Local Gaussian Processes for Efficient Fine-Grained Traffic Speed Prediction.",
            "Activity-Based Human Mobility Patterns Inferred from Mobile Phone Data: A Case Study of Singapore.",
            "Modeling Urban Behavior by Mining Geotagged Social Data.",
            "Visual Analysis of Multiple Route Choices Based on General GPS Trajectories.",
            "Adaptable SLA-Aware Consistency Tuning for Quorum-Replicated Datastores.",
            "A Distributed Stream Library for Java 8.",
            "A Framework for Community Detection in Large Networks Using Game-Theoretic Modeling.",
            "An Empirical Comparison of Algorithms to Find Communities in Directed Graphs and Their Application in Web Data Analytics.",
            "An Extended Spatio-Temporal Granger Causality Model for Air Quality Estimation with Heterogeneous Urban Big Data.",
            "DiNoDB: An Interactive-Speed Query Engine for Ad-Hoc Queries on Temporary Data.",
            "Exploiting Efficient Densest Subgraph Discovering Methods for Big Data.",
            "STaRS: Simulating Taxi Ride Sharing at Scale.",
            "Taxi-Passenger-Demand Modeling Based on Big Data from a Roving Sensor Network.",
            "Special Issue on Biomedical Big Data: Understanding, Learning and Applications.",
            "Graph Regularized EEG Source Imaging with In-Class Consistency and Out-Class Discrimination.",
            "Optimized Deep Learning for EEG Big Data and Seizure Prediction BCI via Internet of Things.",
            "Low-Rank Graph-Regularized Structured Sparse Regression for Identifying Genetic Biomarkers.",
            "Resting-State fMRI Functional Connectivity: Big Data Preprocessing Pipelines and Topological Data Analysis.",
            "Debugging Object Tracking by a Recommender System with Correction Propagation.",
            "Mitosis Detection in Phase Contrast Microscopy Image Sequences of Stem Cell Populations: A Critical Review.",
            "Modeling Temporal Information of Mitotic for Mitotic Event Detection."
        ]
    },
    {
        "name": "TBD",
        "year": "2016",
        "info": "Volume 2, 2016",
        "count": 31,
        "papers": [
            "Guest Editorial: Big Scholar Data Discovery and Collaboration.",
            "AlgorithmSeer: A System for Extracting and Searching for Algorithms in Scholarly Big Data.",
            "Can Scientific Impact Be Predicted?",
            "Guest Editorial: Big Media Data: Understanding, Search, and Mining.",
            "Partial Copy Detection in Videos: A Benchmark and an Evaluation of Popular Methods.",
            "Personalized Travel Sequence Recommendation on Multi-Source Big Social Media.",
            "GPU-Accelerated Large-Scale Distributed Sorting Coping with Device Memory Capacity.",
            "USTF: A Unified System of Team Formation.",
            "Visual Exploration of Changes in Passenger Flows and Tweets on Mega-City Metro Network.",
            "Guest Editorial: Special Issue on Big Scholar Data Discovery and Collaboration (Continued).",
            "Scientific Article Recommendation: Exploiting Common Author Relations and Historical Preferences.",
            "A Recommendation System Based on Hierarchical Clustering of an Article-Level Citation Network.",
            "How Long Will This Live? Discovering the Lifespans of Software Engineering Ideas.",
            "Deduplication on Encrypted Big Data in Cloud.",
            "Sparse Computation for Large-Scale Data Mining.",
            "Universal Nonlinear Regression on High Dimensional Data Using Adaptive Hierarchical Trees.",
            "Guest Editorial: Big Data Analytics and the Web.",
            "Clustering Big Spatiotemporal-Interval Data.",
            "A Distributed Graph-Parallel Computing System with Lightweight Communication Overhead.",
            "Kvasir: Scalable Provision of Semantically Relevant Web Content on Big Data Framework.",
            "Agile Big Data Analytics for Web-Based Systems: An Architecture-Centric Approach.",
            "Analyzing Big Smart Metering Data Towards Differentiated User Services: A Sublinear Approach.",
            "Towards Real-Time Detection and Tracking of Spatio-Temporal Features: Blob-Filaments in Fusion Plasma.",
            "Visual Analytics in Urban Computing: An Overview.",
            "A Hierarchical Distributed Processing Framework for Big Image Data.",
            "Architecting Time-Critical Big-Data Systems.",
            "Efficient Image Geotagging Using Large Databases.",
            "Fuzzy Based Scalable Clustering Algorithms for Handling Big Data Using Apache Spark.",
            "Performance Modeling and Predictive Scheduling for Distributed Stream Data Processing.",
            "Scalable Nearest Neighbor Sparse Graph Approximation by Exploiting Graph Structure.",
            "The Memory Challenge in Reduce Phase of MapReduce Applications."
        ]
    },
    {
        "name": "TBD",
        "year": "2015",
        "info": "Volume 1, 2015",
        "count": 16,
        "papers": [
            "Welcome to the IEEE Transactions on Big Data.",
            "Introduction to the IEEE Transactions on Big Data.",
            "Methodologies for Cross-Domain Data Fusion: An Overview.",
            "Embracing Information Explosion without Choking: Clustering and Labeling in Microblogging.",
            "Petuum: A New Platform for Distributed Machine Learning on Big Data.",
            "SMC: A Practical Schema for Privacy-Preserved Data Sharing over Distributed Data Streams.",
            "Guest Editorial: Big Media Data: Understanding, Search, and Mining.",
            "Code Consistent Hashing Based on Information-Theoretic Criterion.",
            "Exploration of Image Search Results Quality Assessment.",
            "Weakly Semi-Supervised Deep Learning for Multi-Label Image Annotation.",
            "Guest Editorial: Big Data Analytics and the Web.",
            "LS-AMS: An Adaptive Indexing Structure for Realtime Search on Microblogs.",
            "Scale-Out Processing of Large RDF Datasets.",
            "Guest Editorial: Big Media Data: Understanding, Search, and Mining (Part 2).",
            "Learning Visual Semantic Relationships for Efficient Visual Retrieval.",
            "Robust Discrete Spectral Hashing for Large-Scale Image Semantic Indexing."
        ]
    }
]