[
    {
        "name": "TCBB",
        "year": "2022",
        "info": "Volume 19: 2022",
        "count": 63,
        "papers": [
            "Editorial.",
            "Resting State Functional Connectivity Analysis During General Anesthesia: A High-Density EEG Study.",
            "Shaking the β-Bulges.",
            "A New Family of Similarity Measures for Scoring Confidence of Protein Interactions Using Gene Ontology.",
            "A Clinical Dataset and Various Baselines for Chromosome Instance Segmentation.",
            "SPP-CPI: Predicting Compound-Protein Interactions Based On Neural Networks.",
            "MultiTrans: An Algorithm for Path Extraction Through Mixed Integer Linear Programming for Transcriptome Assembly.",
            "GraphPlas: Refined Classification of Plasmid Sequences Using Assembly Graphs.",
            "Leveraging Sequential and Spatial Neighbors Information by Using CNNs Linked With GCNs for Paratope Prediction.",
            "An Aggregation Method to Identify the RNA Meta-Stable Secondary Structure and its Functionally Interpretable Structure Ensemble.",
            "An Extensive Examination of Discovering 5-Methylcytosine Sites in Genome-Wide DNA Promoters Using Machine Learning Based Approaches.",
            "Guest Editorial: Deep Learning For Genomics.",
            "Novel Transformer Networks for Improved Sequence Labeling in genomics.",
            "Effective Cancer Subtype and Stage Prediction via Dropfeature-DNNs.",
            "Investigating Deep Learning Based Breast Cancer Subtyping Using Pan-Cancer and Multi-Omic Data.",
            "Representation Learning for the Clustering of Multi-Omics Data.",
            "Graph Convolutional Networks for Drug Response Prediction.",
            "Deep Neural Network and Extreme Gradient Boosting Based Hybrid Classifier for Improved Prediction of Protein-Protein Interaction.",
            "Guest Editors' Introduction to the Special Section on Bioinformatics Research and Applications.",
            "Predicting Drug-Drug Interactions Based on Integrated Similarity and Semi-Supervised Learning.",
            "Computational Approaches to Detect Illicit Drug Ads and Find Vendor Communities Within Social Media Platforms.",
            "A Refined 3-in-1 Fused Protein Similarity Measure: Application in Threshold-Free Hub Detection.",
            "Guest Editors' Introduction to the Special Section on Bioinformatics Research and Applications.",
            "Macromolecules Structural Classification With a 3D Dilated Dense Network in Cryo-Electron Tomography.",
            "K2Mem: Discovering Discriminative K-mers From Sequencing Data for Metagenomic Reads Classification.",
            "TNet: Transmission Network Inference Using Within-Host Strain Diversity and its Application to Geographical Tracking of COVID-19 Spread.",
            "EpiMC: Detecting Epistatic Interactions Using Multiple Clusterings.",
            "A Heterogeneous Information Network Model for Long Non-Coding RNA Function Prediction.",
            "A Novel Encoding and Decoding Calibration Guiding Pathway for Pathological Image Analysis.",
            "AMP0: Species-Specific Prediction of Anti-microbial Peptides Using Zero and Few Shot Learning.",
            "An Efficient Multiresolution Clustering for Motif Discovery in Complex Networks.",
            "An Improved Topology Prediction of Alpha-Helical Transmembrane Protein Based on Deep Multi-Scale Convolutional Neural Network.",
            "An Integrative Framework of Heterogeneous Genomic Data for Cancer Dynamic Modules Based on Matrix Decomposition.",
            "Analysis of Pattern Formation by Colored Petri Nets With Quantitative Regulation of Gene Expression Level.",
            "Boltzmann Machine Learning and Regularization Methods for Inferring Evolutionary Fields and Couplings From a Multiple Sequence Alignment.",
            "Clustering Based Parameter Estimation of Thyroid Hormone Pathway.",
            "Compressed Sparse FM-Index: Fast Sequence Alignment Using Large K-Steps.",
            "Convolutional Embedded Networks for Population Scale Clustering and Bio-Ancestry Inferencing.",
            "Correlated Motions and Dynamics in Different Domains of Epidermal Growth Factor Receptor With L858R and T790M Mutations.",
            "De novo Protein Structure Prediction by Coupling Contact With Distance Profile.",
            "Deep Learning in Drug Design: Protein-Ligand Binding Affinity Prediction.",
            "DeepOlf: Deep Neural Network Based Architecture for Predicting Odorants and Their Interacting Olfactory Receptors.",
            "Generic Context-Aware Group Contributions.",
            "GenSeg and MR-GenSeg: A Novel Segmentation Algorithm and its Parallel MapReduce Based Approach for Identifying Genomic Regions With Copy Number Variations.",
            "Graph Convolutional Autoencoder and Generative Adversarial Network-Based Method for Predicting Drug-Target Interactions.",
            "GraPhyC: Using Consensus to Infer Tumor Evolution.",
            "Group Sparse Joint Non-Negative Matrix Factorization on Orthogonal Subspace for Multi-Modal Imaging Genetics Data Analysis.",
            "GuiltyTargets: Prioritization of Novel Therapeutic Targets With Network Representation Learning.",
            "Higher-Order Proximity-Based MiRNA-Disease Associations Prediction.",
            "Identifying Gene Network Rewiring Based on Partial Correlation.",
            "Integrative Biological Network Analysis to Identify Shared Genes in Metabolic Disorders.",
            "JUPPI: A Multi-Level Feature Based Method for PPI Prediction and a Refined Strategy for Performance Assessment.",
            "META-BASE: A Novel Architecture for Large-Scale Genomic Metadata Integration.",
            "Network Classification Based on Reducibility With Respect to the Stability of Canalizing Power of Genes in a Gene Regulatory Network - A Boolean Network Modeling Perspective.",
            "On Monomeric and Multimeric Structures-Based Protein-Ligand Interactions.",
            "PDGNet: Predicting Disease Genes Using a Deep Neural Network With Multi-View Features.",
            "Pr[m]: An Algorithm for Protein Motif Discovery.",
            "Predicting Local Protein 3D Structures Using Clustering Deep Recurrent Neural Network.",
            "Relating Translation Efficiency to Protein Networks Provides Evolutionary Insights in Shewanella and Its Implications for Extracellular Electron Transfer.",
            "SACall: A Neural Network Basecaller for Oxford Nanopore Sequencing Data Based on Self-Attention Mechanism.",
            "SelfE: Gene Selection via Self-Expression for Single-Cell Data.",
            "Significance-Based Essential Protein Discovery.",
            "SSKM_Succ: A Novel Succinylation Sites Prediction Method Incorporating K-Means Clustering With a New Semi-Supervised Learning Algorithm."
        ]
    },
    {
        "name": "TCBB",
        "year": "2021",
        "info": "Volume 18: 2021",
        "count": 287,
        "papers": [
            "Algorithms for Computational Biology: Sixth Edition.",
            "Using Constrained-INC for Large-Scale Gene Tree and Species Tree Estimation.",
            "Common Neighbors Extension of the Sticky Model for PPI Networks Evaluated by Global and Local Graphlet Similarity.",
            "EMS3: An Improved Algorithm for Finding Edit-Distance Based Motifs.",
            "Guest Editorial: Transfer Learning Methods Used in Medical Imaging and Health Informatics.",
            "A Novel Negative-Transfer-Resistant Fuzzy Clustering Model With a Shared Cross-Domain Transfer Latent Space and its Application to Brain CT Image Segmentation.",
            "Cross-Domain Classification Model With Knowledge Utilization Maximization for Recognition of Epileptic EEG Signals.",
            "A Deep Segmentation Network of Multi-Scale Feature Fusion Based on Attention Mechanism for IVOCT Lumen Contour.",
            "Transforming UTE-mDixon MR Abdomen-Pelvis Images Into CT by Jointly Leveraging Prior Knowledge and Partial Supervision.",
            "Imbalanced Breast Cancer Classification Using Transfer Learning.",
            "ResNet-SCDA-50 for Breast Abnormality Classification.",
            "A Transfer Learning Based Super-Resolution Microscopy for Biopsy Slice Images: The Joint Methods Perspective.",
            "Learning Transferable Driven and Drone Assisted Sustainable and Robust Regional Disease Surveillance for Smart Healthcare.",
            "A New Weighted Imputed Neighborhood-Regularized Tri-Factorization One-Class Collaborative Filtering Algorithm: Application to Target Gene Prediction of Transcription Factors.",
            "An Ultra-Fast and Parallelizable Algorithm for Finding $k$k-Mismatch Shortest Unique Substrings.",
            "Consensus of All Solutions for Intractable Phylogenetic Tree Inference.",
            "Profile Hidden Markov Models Are Not Identifiable.",
            "A Method for Generating Synthetic Electronic Medical Record Text.",
            "An Ontology-Independent Representation Learning for Similar Disease Detection Based on Multi-Layer Similarity Network.",
            "FlyIT: Drosophila Embryogenesis Image Annotation based on Image Tiling and Convolutional Neural Networks.",
            "GrantExtractor: Accurate Grant Support Information Extraction from Biomedical Fulltext Based on Bi-LSTM-CRF.",
            "Integrating Multi-Omic Data With Deep Subspace Fusion Clustering for Cancer Subtype Prediction.",
            "Multi-Task Sparse Canonical Correlation Analysis with Application to Multi-Modal Brain Imaging Genetics.",
            "Protein2Vec: Aligning Multiple PPI Networks with Representation Learning.",
            "Composable Rate-Independent Computation in Continuous Chemical Reaction Networks.",
            "Formal Analysis of Network Motifs Links Structure to Function in Biological Programs.",
            "MicroRNA Based Feedforward Control of Intrinsic Gene Expression Noise.",
            "Programming Substrate-Independent Kinetic Barriers With Thermodynamic Binding Networks.",
            "A Deep Learning Framework for Identifying Essential Proteins by Integrating Multiple Types of Biological Information.",
            "CNAPE: A Machine Learning Method for Copy Number Alteration Prediction from Gene Expression.",
            "Cross-species Data Classification by Domain Adaptation via Discriminative Heterogeneous Maximum Mean Discrepancy.",
            "CrystalM: A Multi-View Fusion Approach for Protein Crystallization Prediction.",
            "Prioritizing Type 2 Diabetes Genes by Weighted PageRank on Bilayer Heterogeneous Networks.",
            "An Ensemble Method to Reconstruct Gene Regulatory Networks Based on Multivariate Adaptive Regression Splines.",
            "An Integrative Framework for Combining Sequence and Epigenomic Data to Predict Transcription Factor Binding Sites Using Deep Learning.",
            "Analysis of Subtelomeric REXTAL Assemblies Using QUAST.",
            "Deep Pathway Analysis V2.0: A Pathway Analysis Framework Incorporating Multi-Dimensional Omics Data.",
            "Parallel Methods for Finding $k$k-Mismatch Shortest Unique Substrings Using GPU.",
            "A Cascade of 2.5D CNN and Bidirectional CLSTM Network for Mitotic Cell Detection in 4D Microscopy Image.",
            "A Fast Linear Neighborhood Similarity-Based Network Link Inference Method to Predict MicroRNA-Disease Associations.",
            "A Faster Algorithm for Computing the Kernel of Maximum Agreement Subtrees.",
            "A Gene Rank Based Approach for Single Cell Similarity Assessment and Clustering.",
            "A Hybrid Supervised Approach to Human Population Identification Using Genomics Data.",
            "A Novel Branch-and-Bound Algorithm for the Protein Folding Problem in the 3D HP Model.",
            "A Novel Drug Repositioning Approach Based on Collaborative Metric Learning.",
            "An Analytical Review of Computational Drug Repurposing.",
            "An Evolutionary Profile Guided Greedy Parallel Replica-Exchange Monte Carlo Search Algorithm for Rapid Convergence in Protein Design.",
            "An Improved Muti-Task Learning Algorithm for Analyzing Cancer Survival Data.",
            "ANCA: Alignment-Based Network Construction Algorithm.",
            "Bayesian Inference in Y-Linked Two-Sex Branching Processes with Mutations: ABC Approach.",
            "CNV_IFTV: An Isolation Forest and Total Variation-Based Detection of CNVs from Short-Read Sequencing Data.",
            "Colored Network Motif Analysis by Dynamic Programming Approach: An Application in Host Pathogen Interaction Network.",
            "Deep Convolutional and Recurrent Neural Networks for Cell Motility Discrimination and Prediction.",
            "DeepDSC: A Deep Learning Method to Predict Drug Sensitivity of Cancer Cell Lines.",
            "Improve the Resolution and Parallel Performance of the Three-Dimensional Refine Algorithm in RELION Using CUDA and MPI.",
            "iPhosH-PseAAC: Identify Phosphohistidine Sites in Proteins by Blending Statistical Moments and Position Relative Features According to the Chou's 5-Step Rule and General Pseudo Amino Acid Composition.",
            "MCHMDA: Predicting Microbe-Disease Associations Based on Similarities and Low-Rank Matrix Completion.",
            "MGRFE: Multilayer Recursive Feature Elimination Based on an Embedded Genetic Algorithm for Cancer Classification.",
            "Object Weighting: A New Clustering Approach to Deal with Outliers and Cluster Overlap in Computational Biology.",
            "Optimal Bayesian Transfer Learning for Count Data.",
            "Physically-Inspired Gaussian Process Models for Post-Transcriptional Regulation in Drosophila.",
            "Predicting in-vitro Transcription Factor Binding Sites Using DNA Sequence + Shape.",
            "Predicting the Antigenic Relationship of Foot-and-Mouth Disease Virus for Vaccine Selection Through a Computational Model.",
            "Probing the Relation Between Community Evolution in Dynamic Residue Interaction Networks and Xylanase Thermostability.",
            "Protein Structure Prediction Using Population-Based Algorithm Guided by Information Entropy.",
            "Relation Prediction of Co-Morbid Diseases Using Knowledge Graph Completion.",
            "Sampled-Data State Estimation of Reaction Diffusion Genetic Regulatory Networks via Space-Dividing Approaches.",
            "Scalable De Novo Genome Assembly Using a Pregel-Like Graph-Parallel System.",
            "Use of Electronic Health Data for Disease Prediction: A Comprehensive Literature Review.",
            "A New ECG Denoising Framework Using Generative Adversarial Network.",
            "Data Convexity and Parameter Independent Clustering for Biomedical Datasets.",
            "Definition and Usage of Texture Feature for Biological Sequence.",
            "Foretelling the Phenotype of a Genomic Sequence.",
            "ncRFP: A Novel end-to-end Method for Non-Coding RNAs Family Prediction Based on Deep Learning.",
            "On Axon Interaction and Its Role in Neurological Networks.",
            "Protein Complexes Detection Based on Semi-Supervised Network Embedding Model.",
            "RSwitch: A Novel Bioinformatics Database on Riboswitches as Antibacterial Drug Targets.",
            "Guest Editorial for Selected Papers From BIOKDD 2019.",
            "A Pipeline for Integrated Theory and Data-Driven Modeling of Biomedical Data.",
            "Biomedical Knowledge Graphs Construction From Conditional Statements.",
            "Revisiting Parameter Estimation in Biological Networks: Influence of Symmetries.",
            "Guest Editorial: Machine Learning for AI-Enhanced Healthcare and Medical Services: New Development and Promising Solution.",
            "A Global and Local Enhanced Residual U-Net for Accurate Retinal Vessel Segmentation.",
            "A Hybrid Ensemble Algorithm Combining AdaBoost and Genetic Algorithm for Cancer Classification with Gene Expression Data.",
            "A Method of Information Protection for Collaborative Deep Learning under GAN Model Attack.",
            "A Unified Smart Chinese Medicine Framework for Healthcare and Medical Services.",
            "Knowledge-Powered Deep Breast Tumor Classification With Multiple Medical Reports.",
            "CCFS: A Confidence-Based Cost-Effective Feature Selection Scheme for Healthcare Data Classification.",
            "CNN-RNN Based Intelligent Recommendation for Online Medical Pre-Diagnosis Support.",
            "Data-Enabled Digestive Medicine: A New Big Data Analytics Platform.",
            "Detecting Clustered Independent Rare Variant Associations Using Genetic Algorithms.",
            "D-UNet: A Dimension-Fusion U Shape Network for Chronic Stroke Lesion Segmentation.",
            "Enhanced Diagnosis of Pneumothorax with an Improved Real-Time Augmentation for Imbalanced Chest X-rays Data Based on DCNN.",
            "Human Gait Recognition Based on Self-Adaptive Hidden Markov Model.",
            "Identifying Drug Resistant miRNAs Using Entropy Based Ranking.",
            "Imbalance Data Processing Strategy for Protein Interaction Sites Prediction.",
            "MRI Based Radiomics Approach With Deep Learning for Prediction of Vessel Invasion in Early-Stage Cervical Cancer.",
            "Multi-View Mammographic Density Classification by Dilated and Attention-Guided Residual Learning.",
            "Personalized Metabolic Analysis of Diseases.",
            "Potential Pathogenic Genes Prioritization Based on Protein Domain Interaction Network Analysis.",
            "Pregnancy Associated Breast Cancer Gene Expressions : New Insights on Their Regulation Based on Rare Correlated Patterns.",
            "A Novel Approach for Potential Human LncRNA-Disease Association Prediction Based on Local Random Walk.",
            "DeepSeed Local Graph Matching for Densely Packed Cells Tracking.",
            "Deletion Detection Method Using the Distribution of Insert Size and a Precise Alignment Strategy.",
            "Dissipativity-Based Filtering for Switched Genetic Regulatory Networks with Stochastic Disturbances and Time-Varying Delays.",
            "High-Risk Prediction of Cardiovascular Diseases via Attention-Based Deep Neural Networks.",
            "ILDMSF: Inferring Associations Between Long Non-Coding RNA and Disease Based on Multi-Similarity Fusion.",
            "Improved Adverse Drug Event Prediction Through Information Component Guided Pharmacological Network Model (IC-PNM).",
            "LWPCMF: Logistic Weighted Profile-Based Collaborative Matrix Factorization for Predicting MiRNA-Disease Associations.",
            "Machine Learning to Support the Presentation of Complex Pathway Graphs.",
            "MILAMP: Multiple Instance Prediction of Amyloid Proteins.",
            "Modeling Cell Communication with Time-Dependent Signaling Hypergraphs.",
            "Predicting the Prognosis of MCI Patients Using Longitudinal MRI Data.",
            "Ranked k-Spectrum Kernel for Comparative and Evolutionary Comparison of Exons, Introns, and CpG Islands.",
            "Resolving Colliding Larvae by Fitting ASM to Random Walker-Based Pre-Segmentations.",
            "RNA Secondary Structure Prediction with Pseudoknots Using Chemical Reaction Optimization Algorithm.",
            "SPADIS: An Algorithm for Selecting Predictive and Diverse SNPs in GWAS.",
            "Synthesis of the Dynamical Properties of Feedback Loops in Bio-Pathways.",
            "Editorial: Computational Genomics and Molecular Medicine for Emerging COVID-19.",
            "AGTR2, One Possible Novel Key Gene for the Entry of SARS-CoV-2 Into Human Cells.",
            "Deep Bidirectional Classification Model for COVID-19 Disease Infected Patients.",
            "Detection of Phenotype-Related Mutations of COVID-19 via the Whole Genomic Data.",
            "2019nCoVAS: Developing the Web Service for Epidemic Transmission Prediction, Genome Analysis, and Psychological Stress Assessment for 2019-nCoV.",
            "High-Throughput Screening and Quantum Mechanics for Identifying Potent Inhibitors Against Mac1 Domain of SARS-CoV-2 Nsp3.",
            "Network-Based Analysis of Fatal Comorbidities of COVID-19 and Potential Therapeutics.",
            "Detection of Binding Sites on SARS-CoV-2 Spike Protein Receptor-Binding Domain by Molecular Dynamics Simulations in Mixed Solvents.",
            "LUNAR : Drug Screening for Novel Coronavirus Based on Representation Learning Graph Convolutional Network.",
            "CoronaPep: An Anti-Coronavirus Peptide Generation Tool.",
            "KenDTI: An Ensemble Model for Predicting Drug-Target Interaction by Integrating Multi-Source Information.",
            "A Convolutional Neural Network System to Discriminate Drug-Target Interactions.",
            "A Fast and Furious Bayesian Network and Its Application of Identifying Colon Cancer to Liver Metastasis Gene Regulatory Networks.",
            "A Graphic Encoding Method for Quantitative Classification of Protein Structure and Representation of Conformational Changes.",
            "A Latent Gaussian Copula Model for Mixed Data Analysis in Brain Imaging Genetics.",
            "A Novel Way of Comparing Protein 3D Structure Using Graph Partitioning Approach.",
            "AFSBN: A Method of Artificial Fish Swarm Optimizing Bayesian Network for Epistasis Detection.",
            "CDPath: Cooperative Driver Pathways Discovery Using Integer Linear Programming and Markov Clustering.",
            "Celiac Disease Detection From Videocapsule Endoscopy Images Using Strip Principal Component Analysis.",
            "Cell Mechanics Based Computational Classification of Red Blood Cells Via Machine Intelligence Applied to Morpho-Rheological Markers.",
            "ChimST: An Efficient Spectral Library Search Tool for Peptide Identification from Chimeric Spectra in Data-Dependent Acquisition.",
            "CORAL: Verification-Aware OpenCL Based Read Mapper for Heterogeneous Systems.",
            "Cross-Species Protein Function Prediction with Asynchronous-Random Walk.",
            "DeepDRBP-2L: A New Genome Annotation Predictor for Identifying DNA-Binding Proteins and RNA-Binding Proteins Using Convolutional Neural Network and Long Short-Term Memory.",
            "Discriminant Projection Shared Dictionary Learning for Classification of Tumors Using Gene Expression Data.",
            "DORMAN: Database of Reconstructed MetAbolic Networks.",
            "DSTPCA: Double-Sparse Constrained Tensor Principal Component Analysis Method for Feature Selection.",
            "EPGA-SC : A Framework for de novo Assembly of Single-Cell Sequencing Reads.",
            "Finite-Set Model Predictive Control of Melanoma Cancer Treatment Using Signaling Pathway Inhibitor of Cancer Stem Cell.",
            "GenSeq+: A Scalable High-Performance Accelerator for Genome Sequencing.",
            "Hybrid Machine Learning Models for Predicting Types of Human T-cell Lymphotropic Virus.",
            "Hyppo-X: A Scalable Exploratory Framework for Analyzing Complex Phenomics Data.",
            "Identify Consistent Cross-Modality Imaging Genetic Patterns via Discriminant Sparse Canonical Correlation Analysis.",
            "Inferring Synergistic Drug Combinations Based on Symmetric Meta-Path in a Novel Heterogeneous Network.",
            "LDAH2V: Exploring Meta-Paths Across Multiple Networks for lncRNA-Disease Association Prediction.",
            "oComm: Overlapping Community Detection in Multi-View Brain Network.",
            "Predicting Drug-Target Interactions With Multi-Label Classification and Label Partitioning.",
            "Rapid Reconstruction of Time-varying Gene Regulatory Networks with Limited Main Memory.",
            "Semi-Supervised Topological Analysis for Elucidating Hidden Structures in High-Dimensional Transcriptome Datasets.",
            "Time-Varying Differential Network Analysis for Revealing Network Rewiring over Cancer Progression.",
            "Guest Editorial: Advanced Machine-Learning Methods for Brain-Machine Interfacing or Brain-Computer Interfacing.",
            "EEG-Based Brain-Computer Interfaces (BCIs): A Survey of Recent Studies on Signal Sensing Technologies and Computational Intelligence Approaches and Their Applications.",
            "Epilepsy Signal Recognition Using Online Transfer TSK Fuzzy Classifier Underlying Classification Error and Joint Distribution Consensus Regularization.",
            "A Hierarchical Discriminative Sparse Representation Classifier for EEG Signal Detection.",
            "Advanced Machine-Learning Methods for Brain-Computer Interfacing.",
            "A Multi-Scale Activity Transition Network for Data Translation in EEG Signals Decoding.",
            "Subject-Independent Emotion Recognition of EEG Signals Based on Dynamic Empirical Convolutional Neural Network.",
            "Predicting Human Intention-Behavior Through EEG Signal Analysis Using Multi-Scale CNN.",
            "Guest Editorial for Special Section on the 15th International Conference on Intelligent Computing (ICIC).",
            "MISSIM: An Incremental Learning-Based Model With Applications to the Prediction of miRNA-Disease Association.",
            "Predicting TF-DNA Binding Motifs from ChIP-seq Datasets Using the Bag-Based Classifier Combined With a Multi-Fold Learning Scheme.",
            "Empirical Potential Energy Function Toward ab Initio Folding G Protein-Coupled Receptors.",
            "DMFMDA: Prediction of Microbe-Disease Associations Based on Deep Matrix Factorization Using Bayesian Personalized Ranking.",
            "frDriver: A Functional Region Driver Identification for Protein Sequence.",
            "Prediction of Essential Genes in Comparison States Using Machine Learning.",
            "Multi-Scale Capsule Network for Predicting DNA-Protein Binding Sites.",
            "A Deep Learning-Based Method for Identification of Bacteriophage-Host Interaction.",
            "A Local Outlier Factor-Based Detection of Copy Number Variations From NGS Data.",
            "A Novel Cox Proportional Hazards Model for High-Dimensional Genomic Data in Cancer Prognosis.",
            "AIEpred: An Ensemble Predictive Model of Classifier Chain to Identify Anti-Inflammatory Peptides.",
            "Alignment-Free Sequence Comparison With Multiple k Values.",
            "An Automated Cell Tracking Approach With Multi-Bernoulli Filtering and Ant Colony Labor Division.",
            "APT: An Automated Probe Tracker From Gene Expression Data.",
            "Branching Out to Speciation in a Model of Fractionation: The Malvaceae.",
            "Designing a New Multi-Epitope Pertussis Vaccine with Highly Population Coverage Based on a Novel Sequence and Structural Filtration Algorithm.",
            "ERINS: Novel Sequence Insertion Detection by Constructing an Extended Reference.",
            "Exploring Molecular Descriptors and Fingerprints to Predict mTOR Kinase Inhibitors using Machine Learning Techniques.",
            "Few-Shot Breast Cancer Metastases Classification via Unsupervised Cell Ranking.",
            "FLR: A Revolutionary Alignment-Free Similarity Analysis Methodology for DNA-Sequences.",
            "Formator: Predicting Lysine Formylation Sites Based on the Most Distant Undersampling and Safe-Level Synthetic Minority Oversampling.",
            "iLncRNAdis-FB: Identify lncRNA-Disease Associations by Fusing Biological Feature Blocks Through Deep Neural Network.",
            "Lossy Compression of Quality Values in Sequencing Data.",
            "Orienting Conflicted Graph Edges Using Genetic Algorithms to Discover Pathways in Protein-Protein Interaction Networks.",
            "Protein Crystallization Identification via Fuzzy Model on Linear Neighborhood Representation.",
            "Protein Family Classification from Scratch: A CNN Based Deep Learning Approach.",
            "Protein Fold Recognition by Combining Support Vector Machines and Pairwise Sequence Similarity Scores.",
            "RNA Flexibility Prediction With Sequence Profile and Predicted Solvent Accessibility.",
            "RNASeqR: An R Package for Automated Two-Group RNA-Seq Analysis Workflow.",
            "Supervised Dimension Reduction for Large-Scale \"Omics\" Data With Censored Survival Outcomes Under Possible Non-Proportional Hazards.",
            "Using CHOU'S 5-Steps Rule to Predict O-Linked Serine Glycosylation Sites by Blending Position Relative Features and Statistical Moment.",
            "EIC Farewell and New EIC Introduction.",
            "Editorial: From the New Editor-in-Chief.",
            "Algorithms for Computational Biology: Seventh Edition.",
            "Fast Optimal Circular Clustering and Applications on Round Genomes.",
            "Stratified Test Accurately Identifies Differentially Expressed Genes Under Batch Effects in Single-Cell Data.",
            "Sorting Permutations by Intergenic Operations.",
            "Heuristics for Genome Rearrangement Distance With Replicated Genes.",
            "Computational Modeling of Gene-Specific Transcriptional Repression, Activation and Chromatin Interactions in Leukemogenesis by LASSO-Regularized Logistic Regression.",
            "Guest Editorial for the 17th Asia Pacific Bioinformatics Conference.",
            "The Unconstrained Diameters of the Duplication-Loss Cost and the Loss Cost.",
            "Reconciliation Reconsidered: In Search of a Most Representative Reconciliation in the Duplication-Transfer-Loss Model.",
            "Multiple Optimal Reconciliations Under the Duplication-Loss-Coalescence Model.",
            "deGSM: Memory Scalable Construction Of Large Scale de Bruijn Graph.",
            "Towards Optimal Decomposition of Boolean Networks.",
            "Sorting Signed Permutations by Inverse Tandem Duplication Random Losses.",
            "Prediction of FMN Binding Sites in Electron Transport Chains Based on 2-D CNN and PSSM Profiles.",
            "A Convolutional Deep Clustering Framework for Gene Expression Time Series.",
            "A Deep Learning Framework for Gene Ontology Annotations With Sequence- and Network-Based Information.",
            "A Memristive Circuit Implementation of Eyes State Detection in Fatigue Driving Based on Biological Long Short-Term Memory Rule.",
            "A Novel Feature Selection Method for Uncertain Features: An Application to the Prediction of Pro-/Anti-Longevity Genes.",
            "Active Module Identification From Multilayer Weighted Gene Co-Expression Networks: A Continuous Optimization Approach.",
            "An Effective Biclustering-Based Framework for Identifying Cell Subpopulations From scRNA-seq Data.",
            "Categorical Matrix Completion With Active Learning for High-Throughput Screening.",
            "Characterizing Intra-Tumor Heterogeneity From Somatic Mutations Without Copy-Neutral Assumption.",
            "Classification of Mild Cognitive Impairment With Multimodal Data Using Both Labeled and Unlabeled Samples.",
            "Comparing Phylogenetic Approaches to Reconstructing Cell Lineage From Microsatellites With Missing Data.",
            "Computational Approach to the Systematic Prediction of Glycolytic Abilities: Looking Into Human Microbiota.",
            "Computing the Inversion-Indel Distance.",
            "Convolutional Neural Network With Graphical Lasso to Extract Sparse Topological Features for Brain Disease Classification.",
            "Discovering Essential Multiple Gene Effects Through Large Scale Optimization: An Application to Human Cancer Metabolism.",
            "DMFLDA: A Deep Learning Framework for Predicting lncRNA-Disease Associations.",
            "Drug-Target Interaction Prediction: End-to-End Deep Learning Approach.",
            "Dual Hyper-Graph Regularized Supervised NMF for Selecting Differentially Expressed Genes and Tumor Classification.",
            "EBST: An Evolutionary Multi-Objective Optimization Based Tool for Discovering Potential Biomarkers in Ovarian Cancer.",
            "Efficient Compression and Indexing for Highly Repetitive DNA Sequence Collections.",
            "Enhanced Protein Structural Class Prediction Using Effective Feature Modeling and Ensemble of Classifiers.",
            "Estimating Functional Connectivity by Integration of Inherent Brain Function Activity Pattern Priors.",
            "Evolving Multiobjective Cancer Subtype Diagnosis From Cancer Gene Expression Data.",
            "Evolving Transcriptomic Profiles From Single-Cell RNA-Seq Data Using Nature-Inspired Multiobjective Optimization.",
            "Finding Possible Promoter Binding Sites in DNA Sequences by Sequential Patterns Mining With Specific Numbers of Gaps.",
            "Floating Search Methodology for Combining Classification Models for Site Recognition in DNA Sequences.",
            "FUNMarker: Fusion Network-Based Method to Identify Prognostic and Heterogeneous Breast Cancer Biomarkers.",
            "Genome-Scale Identification, in Silico Characterization and Interaction Study Between Wheat SNARE and NPSN Gene Families Involved in Vesicular Transport.",
            "Identifying Microbe-Disease Association Based on a Novel Back-Propagation Neural Network Model.",
            "Identifying Molecular Biomarkers for Diseases With Machine Learning Based on Integrative Omics.",
            "Improved Predicting of The Sequence Specificities of RNA Binding Proteins by Deep Learning.",
            "Incorporating Clinical, Chemical and Biological Information for Predicting Small Molecule-microRNA Associations Based on Non-Negative Matrix Factorization.",
            "Learning Representation of Molecules in Association Network for Predicting Intermolecular Associations.",
            "Lesion Segmentation in Ultrasound Using Semi-Pixel-Wise Cycle Generative Adversarial Nets.",
            "Manipulating Extracellular Matrix Organizations and Parameters to Control Local Cancer Invasion.",
            "MHRWR: Prediction of lncRNA-Disease Associations Based on Multiple Heterogeneous Networks.",
            "Multi-Label Classification Scheme Based on Local Regression for Retinal Vessel Segmentation.",
            "Multi-Neighborhood Learning for Global Alignment in Biological Networks.",
            "Multi-objective Simulated Annealing Variants to Infer Gene Regulatory Network: A Comparative Study.",
            "NegStacking: Drug-Target Interaction Prediction Based on Ensemble Learning and Logistic Regression.",
            "Netboost: Boosting-Supported Network Analysis Improves High-Dimensional Omics Prediction in Acute Myeloid Leukemia and Huntington's Disease.",
            "Optimising Boolean Synthetic Regulatory Networks to Control Cell States.",
            "POPBic: Pathway-Based Order Preserving Biclustering Algorithm Towards the Analysis of Gene Expression Data.",
            "Prediction of Drug-Target Interactions Based on Network Representation Learning and Ensemble Learning.",
            "Protein Fold Recognition Based on Auto-Weighted Multi-View Graph Embedding Learning Model.",
            "STIC: Predicting Single Nucleotide Variants and Tumor Purity in Cancer Genome.",
            "The Impact of Self-Loops on Boolean Networks Attractor Landscape and Implications for Cell Differentiation Modelling.",
            "Unsupervised Learning Framework With Multidimensional Scaling in Predicting Epithelial-Mesenchymal Transitions.",
            "Using Convolutional Neural Networks to Measure the Physiological Age of Caenorhabditis elegans.",
            "WMMDCA: Prediction of Drug Responses by Weight-Based Modular Mapping in Cancer Cell Lines.",
            "A Bridging Centrality Plugin for GEPHI and a Case Study for Mycobacterium Tuberculosis H37Rv.",
            "A Graph-Based Approach for the DNA Word Design Problem.",
            "Adaptive Tracking Control for Uncertain Cancer-Tumor-Immune Systems.",
            "An Enhanced Random Forests Approach to Predict Heart Failure From Small Imbalanced Gene Expression Data.",
            "Barapost: Binning of Nucleotide Sequences According to Taxonomic Annotation.",
            "CEPZ: A Novel Predictor for Identification of DNase I Hypersensitive Sites.",
            "Deep Learning Enables Accurate Diagnosis of Novel Coronavirus (COVID-19) With CT Images.",
            "EnTSSR: A Weighted Ensemble Learning Method to Impute Single-Cell RNA Sequencing Data.",
            "Essential Protein Recognition via Community Significance.",
            "FexRNA: Exploratory Data Analysis and Feature Selection of Non-Coding RNA.",
            "GapPredict - A Language Model for Resolving Gaps in Draft Genome Assemblies.",
            "iEnhancer-KL: A Novel Two-Layer Predictor for Identifying Enhancers by Position Specific of Nucleotide Composition.",
            "In Silico Laboratory Experiments Using Statistical Model Checking: A New Model of the Palytoxin-Induced Pump Channel as Case Study.",
            "Maximum Covering Subtrees for Phylogenetic Networks.",
            "Mitotic Index Determination on Live Cells From Label-Free Acquired Quantitative Phase Images Using a Supervised Autoencoder.",
            "Molecular Simulations and Markov State Modeling Reveal Inactive Form of Quorum Sensing Regulator SdiA of Escherichia Coli.",
            "PAN: Personalized Annotation-Based Networks for the Prediction of Breast Cancer Relapse.",
            "Protein Fold Recognition From Sequences Using Convolutional and Recurrent Neural Networks.",
            "SAQ: Semi-Algebraic Quartet Reconstruction.",
            "SNP Data Science for Classification of Bipolar Disorder I and Bipolar Disorder II.",
            "Sorting Signed Permutations by Intergenic Reversals.",
            "Spatial Distribution of Antibiotic-Producing Bacteria in Urban Areas. A Case Study in València (Spain).",
            "Understanding the Limit of Open Search in the Identification of Peptides With Post-translational Modifications - A Simulation-Based Study.",
            "WMLRR: A Weighted Multi-View Low Rank Representation to Identify Cancer Subtypes From Multiple Types of Omics Data."
        ]
    },
    {
        "name": "TCBB",
        "year": "2020",
        "info": "Volume 17: 2020",
        "count": 212,
        "papers": [
            "Algorithms for Computational Biology: Fifth Edition.",
            "Heuristics for the Reversal and Transposition Distance Problem.",
            "Polynomial-Time Algorithms for Phylogenetic Inference Problems Involving Duplication and Reticulation.",
            "A Promising Method for Calculating True Steady-State Metabolite Concentrations in Large-Scale Metabolic Reaction Network Models.",
            "A Supervised Ensemble Approach for Sensitive microRNA Target Prediction.",
            "An Application of the Bayesian Periodicity Test to Identify Diurnal Rhythm Genes in the Brain.",
            "Assessing the Effectiveness of Causality Inference Methods for Gene Regulatory Networks.",
            "Class Balanced Multifactor Dimensionality Reduction to Detect Gene-Gene Interactions.",
            "Deep Learning for Plant Species Classification Using Leaf Vein Morphometric.",
            "Deep Manifold Preserving Autoencoder for Classifying Breast Cancer Histopathological Images.",
            "Disruption of Protein Complexes from Weighted Complex Networks.",
            "Drug Selection via Joint Push and Learning to Rank.",
            "EL_LSTM: Prediction of DNA-Binding Residue from Protein Sequence by Combining Long Short-Term Memory and Ensemble Learning.",
            "Fast de Bruijn Graph Compaction in Distributed Memory Environments.",
            "GaMRed - Adaptive Filtering of High-Throughput Biological Data.",
            "Generation of Level-kk LGT Networks.",
            "Identifying \"Many-to-Many\" Relationships between Gene-Expression Data and Drug-Response Data via Sparse Binary Matching.",
            "Improving de novo Assembly Based on Read Classification.",
            "LPGNMF: Predicting Long Non-Coding RNA and Protein Interaction Using Graph Regularized Nonnegative Matrix Factorization.",
            "Microarray-Based Quality Assessment as a Supporting Criterion for de novo Transcriptome Assembly Selection.",
            "Multi-Factored Gene-Gene Proximity Measures Exploiting Biological Knowledge Extracted from Gene Ontology: Application in Gene Clustering.",
            "MultiMotifMaker: A Multi-Thread Tool for Identifying DNA Methylation Motifs from Pacbio Reads.",
            "Nature-Inspired Multiobjective Epistasis Elucidation from Genome-Wide Association Studies.",
            "NMFGO: Gene Function Prediction via Nonnegative Matrix Factorization with Gene Ontology.",
            "Optimal Bayesian Filtering for Biomarker Discovery: Performance and Robustness.",
            "PolyCluster: Minimum Fragment Disagreement Clustering for Polyploid Phasing.",
            "Rapid Reconstruction of Time-Varying Gene Regulatory Networks.",
            "Stepwise Tikhonov Regularisation: Application to the Prediction of HIV-1 Drug Resistance.",
            "Using Emulation to Engineer and Understand Simulations of Biological Systems.",
            "A Note on GRegNetSim: A Tool for the Discrete Simulation and Analysis of Genetic Regulatory Networks.",
            "BiModule: Biclique Modularity Strategy for Identifying Transcription Factor and microRNA Co-Regulatory Modules.",
            "Deleterious Non-Synonymous Single Nucleotide Polymorphism Predictions on Human Transcription Factors.",
            "Fast Short Read De-Novo Assembly Using Overlap-Layout-Consensus Approach.",
            "Gene Regulatory Relationship Mining Using Improved Three-Phase Dependency Analysis Approach.",
            "Heterogeneous Domain Adaptation for IHC Classification of Breast Cancer Subtypes.",
            "Softepigen: Primers Design Web-Based Tool for MS-HRM Technique.",
            "Using Unlabeled Data to Discover Bivariate Causality with Deep Restricted Boltzmann Machines.",
            "Correction to \"Identification of Novel Scaffolds with Dual Role as Antiepileptic and Anti-Breast Cancer\".",
            "A Branch Point on Differentiation Trajectory is the Bifurcating Event Revealed by Dynamical Network Biomarker Analysis of Single-Cell Data.",
            "Comparison of Computational Methods for Imputing Single-Cell RNA-Sequencing Data.",
            "Detection of Driver Modules with Rarely Mutated Genes in Cancers.",
            "Drug Side-Effect Profiles Prediction: From Empirical to Structural Risk Minimization.",
            "ELF: Extract Landmark Features By Optimizing Topology Maintenance, Redundancy, and Specificity.",
            "HetRCNA: A Novel Method to Identify Recurrent Copy Number Alternations from Heterogeneous Tumor Samples Based on Matrix Decomposition Framework.",
            "Multi-Domain Networks Association for Biological Data Using Block Signed Graph Clustering.",
            "Quantifying Direct Dependencies in Biological Networks by Multiscale Association Analysis.",
            "A Gaussian Mixture-Model Exploiting Pathway Knowledge for Dissecting Cancer Heterogeneity.",
            "A Reaction-Based Model of the State Space of Chemical Reaction Systems Enables Efficient Simulations.",
            "Approximate Graph Edit Distance in Quadratic Time.",
            "Artificial Fish Swarm Optimization Based Method to Identify Essential Proteins.",
            "ASAPP: Architectural Similarity-Based Automated Pathway Prediction System and Its Application in Host-Pathogen Interactions.",
            "Bayesian Data Fusion of Gene Expression and Histone Modification Profiles for Inference of Gene Regulatory Network.",
            "Bounded Fuzzy Possibilistic Method Reveals Information about Lung Cancer through Analysis of Metabolomics.",
            "Deep Neural Networks for In Situ Hybridization Grid Completion and Clustering.",
            "Detection of Colorectal Carcinoma Based on Microbiota Analysis Using Generalized Regression Neural Networks and Nonlinear Feature Selection.",
            "DFseq: Distribution-Free Method to Detect Differential Gene Expression for RNA-Sequencing Data.",
            "Differential Expression Analysis of RNA-seq Reads: Overview, Taxonomy, and Tools.",
            "Dual-Layer Strengthened Collaborative Topic Regression Modeling for Predicting Drug Sensitivity.",
            "Extracting Biomedical Events with Parallel Multi-Pooling Convolutional Neural Networks.",
            "Gene Expressions, Hippocampal Volume Loss, and MMSE Scores in Computation of Progression and Pharmacologic Therapy Effects for Alzheimer's Disease.",
            "Identifying lncRNA and mRNA Co-Expression Modules from Matched Expression Data in Ovarian Cancer.",
            "Incorporating Prior Knowledge about Genetic Variants into the Analysis of Genetic Association Data: An Empirical Bayes Approach.",
            "Inferring Spatial Organization of Individual Topologically Associated Domains via Piecewise Helical Model.",
            "Probe Efficient Feature Representation of Gapped K-mer Frequency Vectors from Sequences Using Deep Neural Networks.",
            "Utilizing Deep Learning and Genome Wide Association Studies for Epistatic-Driven Preterm Birth Classification in African-American Women.",
            "Weakly-Supervised Convolutional Neural Network Architecture for Predicting Protein-DNA Binding.",
            "WeCoMXP: Weighted Connectivity Measure Integrating Co-Methylation, Co-Expression and Protein-Protein Interactions for Gene-Module Detection.",
            "Classification of Patients with Coronary Microvascular Dysfunction.",
            "Identifying Gene Network Rewiring Using Robust Differential Graphical Model with Multivariate $t$t-Distribution.",
            "Predicting Carbon Spectrum in Heteronuclear Single Quantum Coherence Spectroscopy for Online Feedback During Surgery.",
            "Guest Editorial for the 29th International Conference on Genome Informatics (GIW 2018).",
            "An Efficient Trimming Algorithm based on Multi-Feature Fusion Scoring Model for NGS Data.",
            "G-DipC: An Improved Feature Representation Method for Short Sequences to Predict the Type of Cargo in Cell-Penetrating Peptides.",
            "SL2MF: Predicting Synthetic Lethality in Human Cancers via Logistic Matrix Factorization.",
            "An Entropy-Based Method for Identifying Mutual Exclusive Driver Genes in Cancer.",
            "Mining Relationships among Multiple Entities in Biological Networks.",
            "Accurately Detecting Protein Complexes by Graph Embedding and Combining Functions with Interactions.",
            "Clustering and Integrating of Heterogeneous Microbiome Data by Joint Symmetric Nonnegative Matrix Factorization with Laplacian Regularization.",
            "ERDS-Exome: A Hybrid Approach for Copy Number Variant Detection from Whole-Exome Sequencing Data.",
            "High-Scalable Collaborated Parallel Framework for Large-Scale Molecular Dynamic Simulation on Tianhe-2 Supercomputer.",
            "Identification of Protein Complexes by Using a Spatial and Temporal Active Protein Interaction Network.",
            "Phenotype Prediction from Metagenomic Data Using Clustering and Assembly with Multiple Instance Learning (CAMIL).",
            "Integrating Language Model and Reading Control Gate in BLSTM-CRF for Biomedical Named Entity Recognition.",
            "MEC: Misassembly Error Correction in Contigs based on Distribution of Paired-End Reads and Statistics of GC-contents.",
            "Improving the Inference of Co-Occurrence Networks in the Bovine Rumen Microbiome.",
            "Preprocessing Sequence Coverage Data for More Precise Detection of Copy Number Variations.",
            "GapReduce: A Gap Filling Algorithm Based on Partitioned Read Sets.",
            "Detection and Recognition for Life State of Cell Cancer Using Two-Stage Cascade CNNs.",
            "Bi-Level Error Correction for PacBio Long Reads.",
            "Constructing Disease Similarity Networks Based on Disease Module Theory.",
            "Faster Exact Computation of rSPR Distance via Better Approximation.",
            "Inference Attacks and Controls on Genotypes and Phenotypes for Individual Genomic Data.",
            "IsoTree: A New Framework for de novo Transcriptome Assembly from RNA-seq Reads.",
            "Efficient Mining Multi-Mers in a Variety of Biological Sequences.",
            "Automated Cell Tracking Using Motion Prediction-Based Matching and Event Handling.",
            "Combining High Speed ELM Learning with a Deep Convolutional Neural Network Feature Encoding for Predicting Protein-RNA Interactions.",
            "CURatio: Genome-Wide Phylogenomic Analysis Method Using Ratios of Total Branch Lengths.",
            "Enhancing of Particle Swarm Optimization Based Method for Multiple Motifs Detection in DNA Sequences Collections.",
            "Identification of Minimum Set of Master Regulatory Genes in Gene Regulatory Networks.",
            "In Silico Design and Experimental Validation of Combination Therapy for Pancreatic Cancer.",
            "Inferring Disease-Associated microRNAs in Heterogeneous Networks with Node Attributes.",
            "miRTRS: A Recommendation Algorithm for Predicting miRNA Targets.",
            "Plant Species Identification from Occluded Leaf Images.",
            "Robust Recurrent CNV Detection in the Presence of Inter-Subject Variability.",
            "Secondary Structure and Contact Guided Differential Evolution for Protein Structure Prediction.",
            "SVSR: A Program to Simulate Structural Variations and Generate Sequencing Reads for Multiple Platforms.",
            "Correction to \"A Reaction-Based Model of the State Space of Chemical Reaction Systems Enables Efficient Simulations\".",
            "Accelerating Sequence Alignments Based on FM-Index Using the Intel KNL Processor.",
            "Adaptive Particle Filtering for Fault Detection in Partially-Observed Boolean Dynamical Systems.",
            "Basins of Attraction, Commitment Sets, and Phenotypes of Boolean Networks.",
            "Cache Friendly Optimisation of de Bruijn Graph Based Local Re-Assembly in Variant Calling.",
            "Classification of Antibacterial Peptides Using Long Short-Term Memory Recurrent Neural Networks.",
            "CONDEL: Detecting Copy Number Variation and Genotyping Deletion Zygosity from Single Tumor Samples Using Sequence Data.",
            "(Differential) Co-Expression Analysis of Gene Expression: A Survey of Best Practices.",
            "Feed-Forward and Feedback Control in Astrocytes for Ca$^{2+}$2+-Based Molecular Communications Nanonetworks.",
            "Gene Expression Classification of Lung Adenocarcinoma into Molecular Subtypes.",
            "Hardware-Software Codesign Based Accelerated and Reconfigurable Methodology for String Matching in Computational Bioinformatics Applications.",
            "Identifying TF Binding Motifs from a Partial Set of Target Genes and its Application to Regulatory Network Inference.",
            "imPhy: Imputing Phylogenetic Trees with Missing Information Using Mathematical Programming.",
            "Inference of Model Parameters Using Particle Filter Algorithm and Copula Distributions.",
            "Intra-Cluster Distance Minimization in DNA Methylation Analysis Using an Advanced Tabu-Based Iterative $k$k-Medoids Clustering Algorithm (T-CLUST).",
            "Introducing Heuristic Information Into Ant Colony Optimization Algorithm for Identifying Epistasis.",
            "Inverse Projection Representation and Category Contribution Rate for Robust Tumor Recognition.",
            "Local Similarity Matrix for Cysteine Disulfide Connectivity Prediction from Protein Sequences.",
            "Low-Rank Joint Subspace Construction for Cancer Subtype Discovery.",
            "Modified Half-System Based Method for Reverse Engineering of Gene Regulatory Networks.",
            "nAPOLI: A Graph-Based Strategy to Detect and Visualize Conserved Protein-Ligand Interactions in Large-Scale.",
            "Novel Regularization Method for Biomarker Selection and Cancer Classification.",
            "NTSHMDA: Prediction of Human Microbe-Disease Association Based on Random Walk by Integrating Network Topological Similarity.",
            "On the Unreported-Profile-is-Negative Assumption for Predictive Cheminformatics.",
            "Potential Effect of Tobacco Consumption through Smoking and Chewing Tobacco on IL1beta Protein Expression in Chronic Periodontitis Patients: In Silico Molecular Docking Study.",
            "Prediction of DNA-Binding Residues in Local Segments of Protein Sequences with Fuzzy Cognitive Maps.",
            "Prediction of TF-Binding Site by Inclusion of Higher Order Position Dependencies.",
            "Querying Representative and Informative Super-Pixels for Filament Segmentation in Bioimages.",
            "Stability Analysis of Biological Networks' Diffusion State.",
            "TargetDBP: Accurate DNA-Binding Protein Prediction Via Sequence-Based Multi-View Feature Learning.",
            "Two New Heuristic Methods for Protein Model Quality Assessment.",
            "Understanding Protein Networks Using Vester's Sensitivity Model.",
            "United Neighborhood Closeness Centrality and Orthology for Predicting Essential Proteins.",
            "Visual Life Sciences Workflow Design Using Distributed and Heterogeneous Resources.",
            "Guest Editorial for Special Section on the 14th International Conference on Intelligent Computing (ICIC).",
            "Constructive Prediction of Potential RNA Aptamers for a Protein Target.",
            "Capsule Network for Predicting RNA-Protein Binding Preferences Using Hybrid Feature.",
            "PASA: Identifying More Credible Structural Variants of Hedou12.",
            "Jointly Integrating VCF-Based Variants and OWL-Based Biomedical Ontologies in MongoDB.",
            "Learning Multimodal Networks From Heterogeneous Data for Prediction of lncRNA-miRNA Interactions.",
            "Efficient Classification of Hot Spots and Hub Protein Interfaces by Recursive Feature Elimination and Gradient Boosting.",
            "A Novel Approach to Detecting Epistasis using Random Sampling Regularisation.",
            "Using Weighted Extreme Learning Machine Combined With Scale-Invariant Feature Transform to Predict Protein-Protein Interactions From Protein Evolutionary Information.",
            "A Network-Based Comparison Between Molecular Apocrine Breast Cancer Tumor and Basal and Luminal Tumors by Joint Graphical Lasso.",
            "A Novel Edge Effect Detection Method for Real-Time Cellular Analyzer Using Functional Principal Component Analysis.",
            "An Effective Solution for Large Scale Single Machine Total Weighted Tardiness Problem using Lunar Cycle Inspired Artificial Bee Colony Algorithm.",
            "An Efficient Algorithm for Identifying Mutated Subnetworks Associated with Survival in Cancer.",
            "BRWMDA: Predicting Microbe-Disease Associations Based on Similarities and Bi-Random Walk on Disease and Microbe Networks.",
            "Capsule Network Based Modeling of Multi-omics Data for Discovery of Breast Cancer-Related Genes.",
            "Causal Disturbance Analysis: A Novel Graph Centrality Based Method for Pathway Enrichment Analysis.",
            "CaverDock: A Novel Method for the Fast Analysis of Ligand Transport.",
            "Deep Collaborative Filtering for Prediction of Disease Genes.",
            "Deep Robust Framework for Protein Function Prediction Using Variable-Length Protein Sequences.",
            "Identification of Short Exons Disunited by a Short Intron in Eukaryotic DNA Regions.",
            "Integration of Imaging (epi)Genomics Data for the Study of Schizophrenia Using Group Sparse Joint Nonnegative Matrix Factorization.",
            "MCNF: A Novel Method for Cancer Subtyping by Integrating Multi-Omics and Clinical Data.",
            "Modeling Variability in Populations of Cells Using Approximated Multivariate Distributions.",
            "Oscillatory Dynamics of p53-Mdm2 Circuit in Response to DNA Damage Caused by Ionizing Radiation.",
            "PredictFP2: A New Computational Model to Predict Fusion Peptide Domain in All Retroviruses.",
            "Predicting DNA Methylation States with Hybrid Information Based Deep-Learning Model.",
            "RFCM3: Computational Method for Identification of miRNA-mRNA Regulatory Modules in Cervical Cancer.",
            "RNA-Protein Binding Sites Prediction via Multi Scale Convolutional Gated Recurrent Unit Networks.",
            "Screening Pipeline for Flavivirus Based Inhibitors for Zika Virus NS1.",
            "Seq2seq Fingerprint with Byte-Pair Encoding for Predicting Changes in Protein Stability upon Single Point Mutation.",
            "Single-Cell RNA Sequencing Data Interpretation by Evolutionary Multiobjective Clustering.",
            "SNeCT: Scalable Network Constrained Tucker Decomposition for Multi-Platform Data Profiling.",
            "Sparse Reconstruction of Glucose Fluxes Using Continuous Glucose Monitors.",
            "The Use of Informed Priors in Biclustering of Gene Expression with the Hierarchical Dirichlet Process.",
            "Variable Neighborhood Search for Partitioning Sparse Biological Networks into the Maximum Edge-Weighted $k$k-Plexes.",
            "Guest Editorial for Selected Papers from BIOKDD 2018 and DMBIH 2018.",
            "Deep Learning for Automated Feature Discovery and Classification of Sleep Stages.",
            "Deep Learning Benchmarks on L1000 Gene Expression Data.",
            "A Data-Driven Approach to Predict and Classify Epileptic Seizures from Brain-Wide Calcium Imaging Video Data.",
            "Computerized Classification of Prostate Cancer Gleason Scores from Whole Slide Images.",
            "Post-Structuring Radiology Reports of Breast Cancer Patients for Clinical Quality Assurance.",
            "Extracting Inter-Sentence Relations for Associating Biological Context with Events in Biomedical Texts.",
            "Active Vision and Surface Reconstruction for 3D Plant Shoot Modelling.",
            "Amino Acid Encoding Methods for Protein Sequences: A Comprehensive Review and Assessment.",
            "An Efficient Approach Towards the Source-Target Control of Boolean Networks.",
            "Approaching the One-Sided Exemplar Adjacency Number Problem.",
            "BiClusO: A Novel Biclustering Approach and Its Application to Species-VOC Relational Data.",
            "Bioimage-Based Prediction of Protein Subcellular Location in Human Tissue with Ensemble Features and Deep Networks.",
            "Data-Driven Robust Control for a Closed-Loop Artificial Pancreas.",
            "Enabling Massive XML-Based Biological Data Management in HBase.",
            "Ensembling of Gene Clusters Utilizing Deep Learning and Protein-Protein Interaction Information.",
            "Incorporating the Coevolving Information of Substrates in Predicting HIV-1 Protease Cleavage Sites.",
            "LSTM-Based End-to-End Framework for Biomedical Event Extraction.",
            "MPGM: Scalable and Accurate Multiple Network Alignment.",
            "Predicting Essential Proteins by Integrating Network Topology, Subcellular Localization Information, Gene Expression Profile and GO Annotation Data.",
            "Protein Complexes Identification with Family-Wise Error Rate Control.",
            "Schema Matching and Data Integration with Consistent Naming on Protein Crystallization Screens.",
            "Semiglobal Sequence Alignment with Gaps Using GPU.",
            "Structural Bistability Analysis of Flower-Shaped and Chain-Shaped Boolean Networks.",
            "Topological Metrizations of Trees, and New Quartet Methods of Tree Inference.",
            "Two-Stage Distance Feature-based Optimization Algorithm for De novo Protein Structure Prediction.",
            "XGBoost Model for Chronic Kidney Disease Diagnosis.",
            "FPGA Accelerated Analysis of Boolean Gene Regulatory Networks.",
            "CGIDLA: Developing the Web Server for CpG Island Related Density and LAUPs (Lineage-Associated Underrepresented Permutations) Study.",
            "Connectivity Significance for Disease Gene Prioritization in an Expanding Universe.",
            "Differential Network Analysis via Weighted Fused Conditional Gaussian Graphical Model.",
            "EPMDA: Edge Perturbation Based Method for miRNA-Disease Association Prediction.",
            "Oligo Design with Single Primer Binding Site for High Capacity DNA-Based Data Storage.",
            "Predicting MicroRNA Sequence Using CNN and LSTM Stacked in Seq2Seq Architecture.",
            "SICOR: Subgraph Isomorphism Comparison of RNA Secondary Structures.",
            "Corrections to \"Comorbidity Scoring With Causal Disease Networks\".",
            "Corrections to \"IsoTree: A New Framework for de novo Transcriptome Assembly from RNA-seq Reads\"."
        ]
    },
    {
        "name": "TCBB",
        "year": "2019",
        "info": "Volume 16: 2019",
        "count": 181,
        "papers": [
            "Guest Editorial for the 16th Asia Pacific Bioinformatics Conference.",
            "Parallel Computation of the Burrows-Wheeler Transform of Short Reads Using Prefix Parallelism.",
            "Computing the Diameter of the Space of Maximum Parsimony Reconciliations in the Duplication-Transfer-Loss Model.",
            "Hardness of Covering Alignment: Phase Transition in Post-Sequence Genomics.",
            "Taming Asynchrony for Attractor Detection in Large Boolean Networks.",
            "Adjacent Y-Ion Ratio Distributions and Its Application in Peptide Sequencing.",
            "An Exact Algorithm for Sorting by Weighted Preserving Genome Rearrangements.",
            "An Integrated Reconciliation Framework for Domain, Gene, and Species Level Evolution.",
            "Resource Cut, a New Bounding Procedure to Algorithms for Enumerating Tree-Like Chemical Graphs.",
            "Modeling and Simulation Studies of Complex Biological Systems for Precision Medicine and Healthcare.",
            "SAFETY: Secure gwAs in Federated Environment through a hYbrid Solution.",
            "Are My EHRs Private Enough? Event-Level Privacy Protection.",
            "SecureLR: Secure Logistic Regression Model via a Hybrid Cryptographic Protocol.",
            "An Efficient Mixed-Model for Screening Differentially Expressed Genes of Breast Cancer Based on LR-RF.",
            "Arrhythmia Recognition and Classification Using ECG Morphology and Segment Feature Analysis.",
            "Natural Language Processing for EHR-Based Computational Phenotyping.",
            "DrPOCS: Drug Repositioning Based on Projection Onto Convex Sets.",
            "A Comparative Study of Network Motifs in the Integrated Transcriptional Regulation and Protein Interaction Networks of Shewanella.",
            "A Mixed-Norm Laplacian Regularized Low-Rank Representation Method for Tumor Samples Clustering.",
            "An Integrated Approach for Identification of Functionally Similar MicroRNAs in Colorectal Cancer.",
            "Classification of Single-Cell Gene Expression Trajectories from Incomplete and Noisy Data.",
            "Clustering-Based Compression for Population DNA Sequences.",
            "Disease Gene Prediction by Integrating PPI Networks, Clinical RNA-Seq Data and OMIM Data.",
            "DNRLMF-MDA: Predicting microRNA-Disease Associations Based on Similarities of microRNAs and Diseases.",
            "Early Diagnosis of Alzheimer's Disease Based on Resting-State Brain Networks and Deep Learning.",
            "Efficient Detection of Communities in Biological Bipartite Networks.",
            "Elucidating Genome-Wide Protein-RNA Interactions Using Differential Evolution.",
            "Meta-Path Methods for Prioritizing Candidate Disease miRNAs.",
            "Protein Remote Homology Detection and Fold Recognition Based on Sequence-Order Frequency Matrix.",
            "Quasi-Newton Stochastic Optimization Algorithm for Parameter Estimation of a Stochastic Model of the Budding Yeast Cell Cycle.",
            "Structured Penalized Logistic Regression for Gene Selection in Gene Expression Data Analysis.",
            "Switched Latent Force Models for Reverse-Engineering Transcriptional Regulation in Gene Expression Data.",
            "ToBio: Global Pathway Similarity Search Based on Topological and Biological Features.",
            "Editorial.",
            "Subspace Weighting Co-Clustering of Gene Expression Data.",
            "Reinforce: An Ensemble Approach for Inferring PPI Network from AP-MS Data.",
            "Essential Protein Detection by Random Walk on Weighted Protein-Protein Interaction Networks.",
            "An Improved Approach for N-Linked Glycan Structure Identification from HCD MS/MS Spectra.",
            "Integrating Multiple Heterogeneous Networks for Novel LncRNA-Disease Association Inference.",
            "KATZLGO: Large-Scale Prediction of LncRNA Functions by Using the KATZ Measure Based on Multiple Networks.",
            "MGT-SM: A Method for Constructing Cellular Signal Transduction Networks.",
            "A CPU/MIC Collaborated Parallel Framework for GROMACS on Tianhe-2 Supercomputer.",
            "A Feature Sampling Strategy for Analysis of High Dimensional Genomic Data.",
            "A Unified Model for Joint Normalization and Differential Gene Expression Detection in RNA-Seq Data.",
            "An Integrated Framework for Identifying Mutated Driver Pathway and Cancer Progression.",
            "An RJMCMC-Based Method for Tracking and Resolving Collisions of Drosophila Larvae.",
            "Bayesian Network Construction and Genotype-Phenotype Inference Using GWAS Statistics.",
            "Biomarker Identification for Cancer Disease Using Biclustering Approach: An Empirical Study.",
            "Chemical Transformation Motifs - Modelling Pathways as Integer Hyperflows.",
            "Constructing Pathway-Based Priors within a Gaussian Mixture Model for Bayesian Regression and Classification.",
            "Detecting Population-Differentiation Copy Number Variants in Human Population Tree by Sparse Group Selection.",
            "Estimation of the Spatial Chromatin Structure Based on a Multiresolution Bead-Chain Model.",
            "Estrogenic Active Stilbene Derivatives as Anti-Cancer Agents: A DFT and QSAR Study.",
            "Fast Algorithms for Computing Path-Difference Distances.",
            "Modelling and Control of Gene Regulatory Networks for Perturbation Mitigation.",
            "New Deep Learning Methods for Protein Loop Modeling.",
            "Protein-Protein Interaction Identification Using a Similarity-Constrained Graph Model.",
            "Safely Filling Gaps with Partial Solutions Common to All Solutions.",
            "Stable IL-$1\\beta$1β-Activation in an Inflammasome Signalling Model Depends on Positive and Negative Feedbacks and Tight Regulation of Protein Production.",
            "Statistical Association Mapping of Population-Structured Genetic Data.",
            "The Robust Classification Model Based on Combinatorial Features.",
            "Theory and A Heuristic for the Minimum Path Flow Decomposition Problem.",
            "Unsupervised Discovery of Geometrically Common Structural Motifs and Long-Range Contacts in Protein 3D Structures.",
            "A Novel Cluster-Based Computational Method to Identify miRNA Regulatory Modules.",
            "A Novel Method for LncRNA-Disease Association Prediction Based on an lncRNA-Disease Association Network.",
            "Phylogenetic Reconstruction for Copy-Number Evolution Problems.",
            "Corrections to \"A Novel Computational Approach for Global Alignment for Multiple Biological Networks\".",
            "Algorithms for Computational Biology: Third Edition.",
            "Gibbs/MCMC Sampling for Multiple RNA Interaction with Sub-Optimal Solutions.",
            "Credibility of Evolutionary Events in Gene Trees.",
            "Models for Similarity Distributions of Syntenic Homologs and Applications to Phylogenomics.",
            "Exploring the Robustness of the Parsimonious Reconciliation Method in Host-Symbiont Cophylogeny.",
            "Guest Editorial for Special Section on the 13th International Conference on Intelligent Computing (ICIC).",
            "A Comprehensive Study on Predicting Functional Role of Metagenomes Using Machine Learning Methods.",
            "A Novel Scaffolding Algorithm Based on Contig Error Correction and Path Extension.",
            "Efficiently Predicting Hot Spots in PPIs by Combining Random Forest and Synthetic Minority Over-Sampling Technique.",
            "Integration of Multi-Omics Data for Gene Regulatory Network Inference and Application to Breast Cancer.",
            "Identifying Key Genes of Liver Cancer by Networking of Multiple Data Sets.",
            "Classification of a DNA Microarray for Diagnosing Cancer Using a Complex Network Based Method.",
            "An Efficient Ensemble Learning Approach for Predicting Protein-Protein Interactions by Integrating Protein Primary Sequence and Evolutionary Information.",
            "A Fast Exact Functional Test for Directional Association and Cancer Biology Applications.",
            "A Model for Distributed Processing and Analyses of NGS Data under Map-Reduce Paradigm.",
            "A Multimodal Deep Neural Network for Human Breast Cancer Prognosis Prediction by Integrating Multi-Dimensional Data.",
            "A Robust Simulator for Physiologically Structured Population Models.",
            "An Adaptive Robust Control Strategy in a Cancer Tumor-Immune System Under Uncertainties.",
            "Bioimage Classification with Handcrafted and Learned Features.",
            "BitMapper2: A GPU-Accelerated All-Mapper Based on the Sparse q-Gram Index.",
            "Calculating the Unrooted Subtree Prune-and-Regraft Distance.",
            "Controllability Analysis of a Gene Network for Arabidopsis thaliana Reveals Characteristics of Functional Gene Families.",
            "Designing Optimal Experiments to Discriminate Interaction Graph Models.",
            "Differentiating Prostate Cancer from Benign Prostatic Hyperplasia Using PSAD Based on Machine Learning: Single-Center Retrospective Study in China.",
            "EBWS: Essential Bioinformatics Web Services for Sequence Analyses.",
            "Learning to Refine Expansion Terms for Biomedical Information Retrieval Using Semantic Resources.",
            "Measuring Boundedness for Protein Complex Identification in PPI Networks.",
            "Microarray Missing Value Imputation: A Regularized Local Learning Method.",
            "ParaCells: A GPU Architecture for Cell-Centered Models in Computational Biology.",
            "Parallel Stochastic Discrete Event Simulation of Calcium Dynamics in Neuron.",
            "Prediction of Protein Backbone Torsion Angles Using Deep Residual Inception Neural Networks.",
            "Deep Learning for Drug Discovery and Cancer Research: Automated Analysis of Vascularization Images.",
            "Extension of Partial Gene Transcripts by Iterative Mapping of RNA-Seq Raw Reads.",
            "Inferring Gene Network Rewiring by Combining Gene Expression and Gene Mutation Data.",
            "A New Algorithm for Counting Independent Motifs in Probabilistic Networks.",
            "Computing Manhattan Path-Difference Median Trees: A Practical Local Search Approach.",
            "Exact Algorithms for Duplication-Transfer-Loss Reconciliation with Non-Binary Gene Trees.",
            "FastEtch: A Fast Sketch-Based Assembler for Genomes.",
            "Highly Accurate and Efficient Data-Driven Methods for Genotype Imputation.",
            "Kmerind: A Flexible Parallel Library for K-mer Indexing of Biological Sequences on Distributed Memory Systems.",
            "Linear Time Algorithms to Construct Populations Fitting Multiple Constraint Distributions at Genomic Scales.",
            "Pareto Optimization of Combinatorial Mutagenesis Libraries.",
            "Statistical Framework for Uncertainty Quantification in Computational Molecular Modeling.",
            "Submodular Generalized Matching for Peptide Identification in Tandem Mass Spectrometry.",
            "Advanced Machine Learning Techniques for Bioinformatics.",
            "High-Order Convolutional Neural Network Architecture for Predicting DNA-Protein Binding Sites.",
            "Automated ICD-9 Coding via A Deep Learning Approach.",
            "ProtDet-CCH: Protein Remote Homology Detection by Combining Long Short-Term Memory and Ranking Methods.",
            "Computational Prediction of Sigma-54 Promoters in Bacterial Genomes by Integrating Motif Finding and Machine Learning Strategies.",
            "Term-Based Personalization for Feature Selection in Clinical Handover Form Auto-Filling.",
            "Developing a Multi-Dose Computational Model for Drug-Induced Hepatotoxicity Prediction Based on Toxicogenomics Data.",
            "Human Pathway-Based Disease Network.",
            "Control of Gene Regulatory Networks Using Bayesian Inverse Reinforcement Learning.",
            "Guest Editorial for Special Section on the 7th National Conference on Bioinformatics and Systems Biology of China.",
            "Fast Prediction of Protein Methylation Sites Using a Sequence-Based Feature Selection Technique.",
            "Identifying Bacterial Essential Genes Based on a Feature-Integrated Method.",
            "Coupling Effect of Double Lungs on a VCV Ventilator with Automatic Secretion Clearance Function.",
            "Identification and Functional Inference for Tumor-Associated Long Non-Coding RNA.",
            "Characteristics of Myosin V Processivity.",
            "Predicting Antimicrobial Peptides by Using Increment of Diversity with Quadratic Discriminant Analysis Method.",
            "HMMCAS: A Web Tool for the Identification and Domain Annotations of CAS Proteins.",
            "Identifying Sigma70 Promoters with Novel Pseudo Nucleotide Composition.",
            "GenoPri'17: International Workshop on Genome Privacy and Security.",
            "End-to-End Security for Local and Remote Human Genetic Data Applications at the EGA.",
            "MedCo: Enabling Secure and Privacy-Preserving Exploration of Distributed Clinical and Genomic Data.",
            "Privacy-Preserving Linkage of Genomic and Clinical Data Sets.",
            "On Sharing Intentions, and Personal and Interdependent Privacy Considerations for Genetic Data: A Vignette Study.",
            "Guest Editors' Introduction to the Special Section on Bioinformatics Research and Applications.",
            "The SCJ Small Parsimony Problem for Weighted Gene Adjacencies.",
            "Efficient Local Search for Euclidean Path-Difference Median Trees.",
            "Construction of Refined Protein Interaction Network for Predicting Essential Proteins.",
            "Genome-Wide Analysis of MDR and XDR Tuberculosis from Belarus: Machine-Learning Approach.",
            "Guest Editorial for the ACM International Conference on Bioinformatics, Computational Biology, and Health Informatics.",
            "Does Relaxing the Infinite Sites Assumption Give Better Tumor Phylogenies? An ILP-Based Comparative Approach.",
            "Exploring Frequented Regions in Pan-Genomic Graphs.",
            "End-to-End Representation Learning for Chemical-Chemical Interaction Prediction.",
            "Rich Chromatin Structure Prediction from Hi-C Data.",
            "Cophenetic Median Trees.",
            "Tissue-Specific Subcellular Localization Prediction Using Multi-Label Markov Random Fields.",
            "A Fast PC Algorithm for High Dimensional Causal Discovery with Multi-Core PCs.",
            "Mining the Enriched Subgraphs for Specific Vertices in a Biological Graph.",
            "Multi-Site Meta-Analysis of Morphometry.",
            "Purely Structural Protein Scoring Functions Using Support Vector Machine and Ensemble Learning.",
            "Transfer String Kernel for Cross-Context DNA-Protein Binding Prediction.",
            "Discovery of Functional Motifs from the Interface Region of Oligomeric Proteins Using Frequent Subgraph Mining.",
            "Multitask Protein Function Prediction through Task Dissimilarity.",
            "Editorial.",
            "Bio-Curation for Cellular Signalling: The KAMI Project.",
            "Causal Reasoning on Boolean Control Networks Based on Abduction: Theory and Application to Cancer Drug Discovery.",
            "Quantitative Regular Expressions for Arrhythmia Detection.",
            "Hidden Markov Modelling Reveals Neighborhood Dependence of Dnmt3a and 3b Activity.",
            "Algorithms for the Sequential Reprogramming of Boolean Networks.",
            "Chromatin 3D Reconstruction from Chromosomal Contacts Using a Genetic Algorithm.",
            "Comorbidity Scoring with Causal Disease Networks.",
            "Comparison of INDEL Calling Tools with Simulation Data and Real Short-Read Data.",
            "Estimating Energy Parameters for RNA Secondary Structure Predictions Using Both Experimental and Computational Data.",
            "Identification of Local Clusters of Mutation Hotspots in Cancer-Related Genes and Their Biological Relevance.",
            "Identification of Novel Scaffolds with Dual Role as Antiepileptic and Anti-Breast Cancer.",
            "Secure Wavelet Matrix: Alphabet-Friendly Privacy-Preserving String Search for Bioinformatics.",
            "Stage-Dependent Gene Expression Profiling in Colorectal Cancer.",
            "Systematic Inspection of the Clinical Relevance of TP53 Missense Mutations in Gastric Cancer.",
            "A 2-Approximation Scheme for Sorting Signed Permutations by Reversals, Transpositions, Transreversals, and Block-Interchanges.",
            "Drug Target Prediction by Multi-View Low Rank Embedding.",
            "EmDL: Extracting miRNA-Drug Interactions from Literature.",
            "Learning a Structural and Functional Representation for Gene Expressions: To Systematically Dissect Complex Cancer Phenotypes.",
            "Network Clustering Analysis Using Mixture Exponential-Family Random Graph Models and Its Application in Genetic Interaction Data.",
            "Protein-Protein Interaction Interface Residue Pair Prediction Based on Deep Learning Architecture.",
            "Recovering Hidden Diagonal Structures via Non-Negative Matrix Factorization with Multiple Constraints.",
            "3gClust: Human Protein Cluster Analysis.",
            "A Distributed Feature Selection Algorithm Based on Distance Correlation with an Application to Microarrays.",
            "A Multi-Laplacian Prior and Augmented Lagrangian Approach to the Exploratory Analysis of Time-Varying Gene and Transcriptional Regulatory Networks for Gene Microarray Data.",
            "Enhancement of Protein β-Sheet Topology Prediction Using Maximum Weight Disjoint Path Cover.",
            "Machine Vision System for 3D Plant Phenotyping.",
            "Robust Inductive Matrix Completion Strategy to Explore Associations Between LincRNAs and Human Disease Phenotypes."
        ]
    },
    {
        "name": "TCBB",
        "year": "2018",
        "info": "Volume 15: 2018",
        "count": 197,
        "papers": [
            "A Graphical Model of Smoking-Induced Global Instability in Lung Cancer.",
            "Algorithms for the Majority Rule (+) Consensus Tree and the Frequency Difference Consensus Tree.",
            "Attention Recognition in EEG-Based Affective Learning Research Using CFS+KNN Algorithm.",
            "Bi-level and Bi-objective p-Median Type Problems for Integrative Clustering: Application to Analysis of Cancer Gene-Expression and Drug-Response Data.",
            "Calculating the Expected Time to Eradicate HIV-1 Using a Markov Chain.",
            "Combinatorics of Tandem Duplication Random Loss Mutations on Circular Genomes.",
            "Complexity and Algorithms for Finding a Perfect Phylogeny from Mixed Tumor Samples.",
            "Detecting Essential Proteins Based on Network Topology, Gene Expression Data, and Gene Ontology Information.",
            "Efficient Algorithms for Sequence Analysis with Entropic Profiles.",
            "GSEH: A Novel Approach to Select Prostate Cancer-Associated Genes Using Gene Expression Heterogeneity.",
            "HEMEsPred: Structure-Based Ligand-Specific Heme Binding Residues Prediction by Using Fast-Adaptive Ensemble Learning Scheme.",
            "Inferring the Functions of Proteins from the Interrelationships between Functional Categories.",
            "Introducing a Stable Bootstrap Validation Framework for Reliable Genomic Signature Extraction.",
            "Nonbinary Tree-Based Phylogenetic Networks.",
            "Optimal Objective-Based Experimental Design for Uncertain Dynamical Gene Networks with Experimental Error.",
            "Index-Based Network Aligner of Protein-Protein Interaction Networks.",
            "Species Tree Inference from Gene Splits by Unrooted STAR Methods.",
            "Selected Papers of the First International Conference on Algorithms for Computational Biology (AlCoB 2014).",
            "A GRASP-Based Heuristic for the Sorting by Length-Weighted Inversions Problem.",
            "Optimal Block-Based Trimming for Next Generation Sequencing.",
            "Modeling the Geometry and Dynamics of the Endoplasmic Reticulum Network.",
            "SparseNCA: Sparse Network Component Analysis for Recovering Transcription Factor Activities with Incomplete Prior Information.",
            "Guest Editorial for the 14th Asia Pacific Bioinformatics Conference.",
            "Autumn Algorithm - Computation of Hybridization Networks for Realistic Phylogenetic Trees.",
            "DTL-RnB: Algorithms and Tools for Summarizing the Space of DTL Reconciliations.",
            "Algorithms for Pedigree Comparison.",
            "Predicting the Absorption Potential of Chemical Compounds Through a Deep Learning Approach.",
            "hc-OTU: A Fast and Accurate Method for Clustering Operational Taxonomic Units Based on Homopolymer Compaction.",
            "Codon Context Optimization in Synthetic Gene Design.",
            "3D Genome Reconstruction with ShRec3D+ and Hi-C Data.",
            "Algorithmic Mapping and Characterization of the Drug-Induced Phenotypic-Response Space of Parasites Causing Schistosomiasis.",
            "Deep Sequencing Data Analysis.",
            "Detecting Multivariate Gene Interactions in RNA-Seq Data Using Optimal Bayesian Classification.",
            "Examining De Novo Transcriptome Assemblies via a Quality Assessment Pipeline.",
            "Computational Prediction of Pathogenic Network Modules in Fusarium verticillioides.",
            "Optimal Fault Detection and Diagnosis in Transcriptional Circuits Using Next-Generation Sequencing.",
            "MeTDiff: A Novel Differential RNA Methylation Analysis for MeRIP-Seq Data.",
            "Probabilistic Methods in Computational Neuroscience.",
            "Bayesian Multiresolution Variable Selection for Ultra-High Dimensional Neuroimaging Data.",
            "Gender Identification of Human Brain Image with A Novel 3D Descriptor.",
            "A Copula-Based Granger Causality Measure for the Analysis of Neural Spike Train Data.",
            "Cortical Thinning and Cognitive Impairment in Parkinson's Disease without Dementia.",
            "Complex Network Measures in Autism Spectrum Disorders.",
            "A New Efficient Algorithm for the Frequent Gene Team Problem.",
            "A Review on Methods for Detecting SNP Interactions in High-Dimensional Genomic Data.",
            "Application of Fractal Theory on Motifs Counting in Biological Networks.",
            "Classification of Alzheimer's Disease Using Whole Brain Hierarchical Network.",
            "Enumerating Substituted Benzene Isomers of Tree-Like Chemical Graphs.",
            "Extracting Stage-Specific and Dynamic Modules Through Analyzing Multiple Networks Associated with Cancer Progression.",
            "Fuzzy-Rough Entropy Measure and Histogram Based Patient Selection for miRNA Ranking in Cancer.",
            "Integrating Multiple Data Sources for Combinatorial Marker Discovery: A Study in Tumorigenesis.",
            "Advances in the Application and Development of Non-Linear Global Optimization Techniques in Computational Structural Biology.",
            "A Memetic Algorithm for 3D Protein Structure Prediction Problem.",
            "A Global Network Alignment Method Using Discrete Particle Swarm Optimization.",
            "From Optimization to Mapping: An Evolutionary Algorithm for Protein Energy Landscapes.",
            "Conformational Sampling of a Biomolecular Rugged Energy Landscape.",
            "GPU-Based Point Cloud Superpositioning for Structural Comparisons of Protein Binding Sites.",
            "A Bipartite Network and Resource Transfer-Based Approach to Infer lncRNA-Environmental Factor Associations.",
            "A Combined PLS and Negative Binomial Regression Model for Inferring Association Networks from Next-Generation Sequencing Count Data.",
            "A Comparative Study for Identifying the Chromosome-Wide Spatial Clusters from High-Throughput Chromatin Conformation Capture Data.",
            "A Just-in-Time Learning Based Monitoring and Classification Method for Hyper/Hypocalcemia Diagnosis.",
            "A Spatial-Temporal Method to Detect Global Influenza Epidemics Using Heterogeneous Data Collected from the Internet.",
            "Aggregation for Computing Multi-Modal Stationary Distributions in 1-D Gene Regulatory Networks.",
            "An Organelle Correlation-Guided Feature Selection Approach for Classifying Multi-Label Subcellular Bio-Images.",
            "Assessment of Semantic Similarity between Proteins Using Information Content and Topological Properties of the Gene Ontology Graph.",
            "BRANE Clust: Cluster-Assisted Gene Regulatory Network Inference Refinement.",
            "Comparison of Machine Learning Approaches for Prediction of Advanced Liver Fibrosis in Chronic Hepatitis C Patients.",
            "Discovering Perturbation of Modular Structure in HIV Progression by Integrating Multiple Data Sources Through Non-Negative Matrix Factorization.",
            "Dynamics in Epistasis Analysis.",
            "Evolutionary Graph Clustering for Protein Complex Identification.",
            "Investigating Correlation between Protein Sequence Similarity and Semantic Similarity Using Gene Ontology Annotations.",
            "LMMO: A Large Margin Approach for Refining Regulatory Motifs.",
            "Multiple-Swarm Ensembles: Improving the Predictive Power and Robustness of Predictive Models and Its Use in Computational Biology.",
            "NAHAL-Flex: A Numerical and Alphabetical Hinge Detection Algorithm for Flexible Protein Structure Alignment.",
            "Network-Regularized Sparse Logistic Regression Models for Clinical Risk Prediction and Biomarker Discovery.",
            "Novelty Indicator for Enhanced Prioritization of Predicted Gene Ontology Annotations.",
            "Prediction of HIV Drug Resistance by Combining Sequence and Structural Properties.",
            "Regularized Non-Negative Matrix Factorization for Identifying Differentially Expressed Genes and Clustering Samples: A Survey.",
            "The Discovery of Mutated Driver Pathways in Cancer: Models and Algorithms.",
            "Constructing DNA Barcode Sets Based on Particle Swarm Optimization.",
            "DNA Assembly with De Bruijn Graphs Using an FPGA Platform.",
            "Efficient Quartet Representations of Trees and Applications to Supertree and Summary Methods.",
            "Optimization of Gene Set Annotations Using Robust Trace-Norm Multitask Learning.",
            "PerPAS: Topology-Based Single Sample Pathway Analysis Method.",
            "Sparse Pathway-Induced Dynamic Network Biomarker Discovery for Early Warning Signal Detection in Complex Diseases.",
            "Correction to \"Detecting Essential Proteins Based on Network Topology, Gene Expression Data, and Gene Ontology Information\".",
            "Guest Editorial.",
            "A Distributed Classifier for MicroRNA Target Prediction with Validation Through TCGA Expression Data.",
            "Querying of Disparate Association and Interaction Data in Biomedical Applications.",
            "A Sparse Regression Method for Group-Wise Feature Selection with False Discovery Rate Control.",
            "Construction of Signaling Pathways with RNAi Data and Multiple Reference Networks.",
            "Guest Editorial for Special Section on the Sixth National Conference on Bioinformatics and System Biology of China.",
            "Gene Regulatory Network Inference from Perturbed Time-Series Expression Data via Ordered Dynamical Expansion of Non-Steady State Actors.",
            "PyMut: A Web Tool for Overlapping Gene Loss-of-Function Mutation Design.",
            "Nucleosome Positioning of Intronless Genes in the Human Genome.",
            "Guest Editors' Introduction to the Special Section on the 14th International Conference on Computational Methods in Systems Biology (CMSB 2016).",
            "Local Traces: An Over-Approximation of the Behavior of the Proteins in Rule-Based Models.",
            "Influence Networks Compared with Reaction Networks: Semantics, Expressivity and Attractors.",
            "Organisation-Oriented Coarse Graining and Refinement of Stochastic Reaction Networks.",
            "Reduction of Qualitative Models of Biological Networks for Transient Dynamics Analysis.",
            "Moment-Based Parameter Estimation for Stochastic Reaction Networks in Equilibrium.",
            "PREMER: A Tool to Infer Biological Networks.",
            "ASSA-PBN: A Toolbox for Probabilistic Boolean Networks.",
            "Structural Target Controllability of Linear Networks.",
            "Great Lakes Bioinformatics Conference (GLBIO) 2015 Special Section Editorial.",
            "Encoding Data Using Biological Principles: The Multisample Variant Format for Phylogenomics and Population Genomics.",
            "Towards Extracting Supporting Information About Predicted Protein-Protein Interactions.",
            "IAS: Interaction Specific GO Term Associations for Predicting Protein-Protein Interaction Networks.",
            "A Framework for Identifying Genotypic Information from Clinical Records: Exploiting Integrated Ontology Structures to Transfer Annotations between ICD Codes and Gene Ontologies.",
            "REPA: Applying Pathway Analysis to Genome-Wide Transcription Factor Binding Data.",
            "Proteomic Evidence for In-Frame and Out-of-Frame Alternatively Spliced Isoforms in Human and Mouse.",
            "Discovering Gene Regulatory Elements Using Coverage-Based Heuristics.",
            "A Model-Based Tool for the Analysis and Design of Gene Regulatory Networks.",
            "A Self-Training Subspace Clustering Algorithm under Low-Rank Representation for Cancer Classification on Gene Expression Data.",
            "A Two-Stage Biomedical Event Trigger Detection Method Integrating Feature Selection and Word Embeddings.",
            "An Inference Attack on Genomic Data Using Kinship, Complex Correlations, and Phenotype Information.",
            "Analysis of the Genome Sequence and Prediction of B-Cell Epitopes of the Envelope Protein of Middle East Respiratory Syndrome-Coronavirus.",
            "Controllability Analysis and Control Synthesis for the Ribosome Flow Model.",
            "Incorporation of Solvent Effect into Multi-Objective Evolutionary Algorithm for Improved Protein Structure Prediction.",
            "Modeling Methylation Patterns with Long Read Sequencing Data.",
            "NewGOA: Predicting New GO Annotations of Proteins by Bi-Random Walks on a Hybrid Graph.",
            "GenoPri'16: International Workshop on Genome Privacy and Security.",
            "Simulating the Large-Scale Erosion of Genomic Privacy Over Time.",
            "Protecting Privacy and Security of Genomic Data in i2b2 with Homomorphic Encryption and Differential Privacy.",
            "Implementation and Evaluation of an Algorithm for Cryptographically Private Principal Component Analysis on Genomic Data.",
            "Guest Editorial for Special Section on the 12th International Conference on Intelligent Computing (ICIC).",
            "Identification and Analysis of Key Residues in Protein-RNA Complexes.",
            "Unified Deep Learning Architecture for Modeling Biology Sequence.",
            "Mutli-Features Prediction of Protein Translational Modification Sites.",
            "Sequence-Based Prediction of Putative Transcription Factor Binding Sites in DNA Sequences of Any Length.",
            "Prediction of Hot Regions in PPIs Based on Improved Local Community Structure Detecting.",
            "Integrating Imaging Genomic Data in the Quest for Biomarkers of Schizophrenia Disease.",
            "Continuous Petri Nets and microRNA Analysis in Melanoma.",
            "Low Rank Subspace Clustering via Discrete Constraint and Hypergraph Regularization for Tumor Molecular Pattern Discovery.",
            "Guest Editorial for the 15th Asia Pacific Bioinformatics Conference.",
            "Efficient Algorithms for Genomic Duplication Models.",
            "Reviving the Two-State Markov Chain Approach.",
            "Local-Nearest-Neighbors-Based Feature Weighting for Gene Selection.",
            "Biological Event Trigger Identification with Noise Contrastive Estimation.",
            "Gene Tree Construction and Correction Using SuperTree and Reconciliation.",
            "Inferring Gene-Species Assignments in the Presence of Horizontal Gene Transfer.",
            "Evolutionary Model for the Statistical Divergence of Paralogous and Orthologous Gene Pairs Generated by Whole Genome Duplication and Speciation.",
            "Genome Rearrangement with ILP.",
            "Combining Supervised and Unsupervised Learning for Improved miRNA Target Prediction.",
            "DNA Watermarking Using Codon Postfix Technique.",
            "Hardware Accelerator for the Multifractal Analysis of DNA Sequences.",
            "Heavy-Tailed Noise Suppression and Derivative Wavelet Scalogram for Detecting DNA Copy Number Aberrations.",
            "Identifying Condition-Specific Modules by Clustering Multiple Networks.",
            "Improving Alzheimer's Disease Classification by Combining Multiple Measures.",
            "Influence of Airway Secretion on Airflow Dynamics of Mechanical Ventilated Respiratory System.",
            "Multiple Network Alignment via MultiMAGNA++.",
            "NGS-FC: A Next-Generation Sequencing Data Format Converter.",
            "Optimizing Phylogenetic Queries for Performance.",
            "Cell Population Tracking in a Honeycomb Structure Using an IMM Filter Based 3D Local Graph Matching Model.",
            "A Study of Cell-Free DNA Fragmentation Pattern and Its Application in DNA Sample Type Classification.",
            "Bijective Diameters of Gene Tree Parsimony Costs.",
            "fmpRPMF: A Web Implementation for Protein Identification by Robust Peptide Mass Fingerprinting.",
            "MPIGeneNet: Parallel Calculation of Gene Co-Expression Networks on Multicore Clusters.",
            "Species Tree Estimation Using ASTRAL: How Many Genes Are Enough?",
            "Guest Editorial for Special Section on BIBM 2015.",
            "Analyzing Differential Regulatory Networks Modulated by Continuous-State Genomic Features in Glioblastoma Multiforme.",
            "Feature Selection for Optimized High-Dimensional Biomedical Data Using an Improved Shuffled Frog Leaping Algorithm.",
            "Predicting MicroRNA-Disease Associations Based on Improved MicroRNA and Disease Similarities.",
            "Structure-Guided Protein Transition Modeling with a Probabilistic Roadmap Algorithm.",
            "Improve Biomedical Information Retrieval Using Modified Learning to Rank Methods.",
            "DiscMLA: An Efficient Discriminative Motif Learning Algorithm over High-Throughput Datasets.",
            "Editorial for Selected Papers of a Joint Conferences, Genome Informatics Workshop/International Conference on Bioinformatics (GIW/InCoB) 2015.",
            "SPF-CellTracker: Tracking Multiple Cells with Strongly-Correlated Moves Using a Spatial Particle Filter.",
            "Effectively Identifying Compound-Protein Interactions by Learning from Positive and Unlabeled Examples.",
            "RF-NR: Random Forest Based Approach for Improved Classification of Nuclear Receptors.",
            "Computing Minimum Reaction Modifications in a Boolean Metabolic Network.",
            "Special Section on Swarm-Based Algorithms and Applications in Computational Biology and Bioinformatics.",
            "Coevolutionary Structure-Redesigned-Based Bacterial Foraging Optimization.",
            "Environment Sensitivity-Based Cooperative Co-Evolutionary Algorithms for Dynamic Multi-Objective Optimization.",
            "Robust Dynamic Multi-Objective Vehicle Routing Optimization Method.",
            "A Grouping Particle Swarm Optimizer with Personal-Best-Position Guidance for Large Scale Optimization.",
            "Network Community Detection Based on the Physarum-Inspired Computational Framework.",
            "Immunological Approach for Full NURBS Reconstruction of Outline Curves from Noisy Data Points in Medical Imaging.",
            "Swarm Robots Search for Multiple Targets Based on an Improved Grouping Strategy.",
            "Multiscale and Multimodal Analysis for Computational Biology.",
            "Using Machine Learning to Improve the Prediction of Functional Outcome in Ischemic Stroke Patients.",
            "ANTENNA, a Multi-Rank, Multi-Layered Recommender System for Inferring Reliable Drug-Gene-Disease Associations: Repurposing Diazoxide as a Targeted Anti-Cancer Therapy.",
            "Predicting Hospital Readmission via Cost-Sensitive Deep Learning.",
            "Bioinformatic Workflow Extraction from Scientific Texts based on Word Sense Disambiguation.",
            "\"Super Gene Set\" Causal Relationship Discovery from Functional Genomics Data.",
            "A Slice-based 13C-detected NMR Spin System Forming and Resonance Assignment Method.",
            "Co-Expression Network Approach to Studying the Effects of Botulinum Neurotoxin-A.",
            "Computational Models for Trapping Ebola Virus Using Engineered Bacteria.",
            "Grouped Gene Selection of Cancer via Adaptive Sparse Group Lasso Based on Conditional Mutual Information.",
            "Novel Consensus Gene Selection Criteria for Distributed GPU Partial Least Squares-Based Gene Microarray Analysis in Diffused Large B Cell Lymphoma (DLBCL) and Related Findings.",
            "A Bi-Objective RNN Model to Reconstruct Gene Regulatory Network: A Modified Multi-Objective Simulated Annealing Approach.",
            "A Novel Computational Approach for Global Alignment for Multiple Biological Networks.",
            "A Simplified Description of Child Tables for Sequence Similarity Search.",
            "Altering Indispensable Proteins in Controlling Directed Human Protein Interaction Network.",
            "Identifying Gene Network Rewiring by Integrating Gene Expression and Gene Network Data.",
            "Robust Gene Circuit Control Design for Time-Delayed Genetic Regulatory Networks Without SUM Regulatory Logic.",
            "Scaffolding of Ancient Contigs and Ancestral Reconstruction in a Phylogenetic Framework."
        ]
    },
    {
        "name": "TCBB",
        "year": "2017",
        "info": "Volume 14: 2017",
        "count": 144,
        "papers": [
            "Editorial: Special Section on Bio-Inspired Swarm Computing and Engineering.",
            "Symbiosis-Based Alternative Learning Multi-Swarm Particle Swarm Optimization.",
            "A New Magnetotactic Bacteria Optimization Algorithm Based on Moment Migration.",
            "A Cooperative Framework for Fireworks Algorithm.",
            "Fireworks Algorithm with Enhanced Fireworks Interaction.",
            "An Effective Application of Bacteria Quorum Sensing and Circular Elimination in MOPSO.",
            "Multi-Objective Particle Swarm Optimization Approach for Cost-Based Feature Selection in Classification.",
            "A Novel Cluster Head Selection Algorithm Based on Fuzzy Clustering and Particle Swarm Optimization.",
            "A Gene Selection Method for Microarray Data Based on Binary PSO Encoding Gene-to-Class Sensitivity Information.",
            "Three-Dimensional Path Planning for Uninhabited Combat Aerial Vehicle Based on Predator-Prey Pigeon-Inspired Optimization in Dynamic Environment.",
            "Solving NP-Hard Problems with Physarum-Based Ant Colony System.",
            "A Graph-Theoretical Approach for Motif Discovery in Protein Sequences.",
            "A Visual Interface for Querying Heterogeneous Phylogenetic Databases.",
            "Cancer Progression Prediction Using Gene Interaction Regularized Elastic Net.",
            "Extracting Coevolutionary Features from Protein Sequences for Predicting Protein-Protein Interactions.",
            "Fast and Scalable Feature Selection for Gene Expression Data Using Hilbert-Schmidt Independence Criterion.",
            "Graphical Representation and Similarity Analysis of Protein Sequences Based on Fractal Interpolation.",
            "On the Variable Ordering in Subgraph Isomorphism Algorithms.",
            "Putative Drug and Vaccine Target Identification in Leishmania donovani Membrane Proteins Using Naïve Bayes Probabilistic Classifier.",
            "Transductive Learning for Multi-Label Protein Subchloroplast Localization Prediction.",
            "An Application of Invertibility of Boolean Control Networks to the Control of the Mammalian Cell Cycle.",
            "Editorial from the New Editor-in-Chief.",
            "Guest Editorial for Special Section on BIBM 2014.",
            "Discovering Protein-DNA Binding Cores by Aligned Pattern Clustering.",
            "Multi-View Clustering of Microbiome Samples by Robust Similarity Network Fusion and Spectral Clustering.",
            "Optimizing Analytical Depth and Cost Efficiency of IEF-LC/MS Proteomics.",
            "Analysis of Organization of the Interactome Using Dominating Sets: A Case Study on Cell Cycle Interaction Networks.",
            "Muscle Tissue Labeling of Human Lower Limb in Multi-Channel mDixon MR Imaging: Concepts and Applications.",
            "Improving Recognition of Antimicrobial Peptides and Target Selectivity through Machine Learning and Genetic Programming.",
            "Guest Editors Introduction to the Special Section on ISBRA 2014.",
            "A Two-Phase Improved Correlation Method for Automatic Particle Selection in Cryo-EM.",
            "An Approach for Peptide Identification by De Novo Sequencing of Mixture Spectra.",
            "NovoExD: De novo Peptide Sequencing for ETD/ECD Spectra.",
            "Identifying Spurious Interactions in the Protein-Protein Interaction Networks Using Local Similarity Preserving Embedding.",
            "Microbiome Data Representation by Joint Nonnegative Matrix Factorization with Laplacian Regularization.",
            "Predicting Protein Functions by Using Unbalanced Random Walk Algorithm on Three Biological Networks.",
            "United Complex Centrality for Identification of Essential Proteins from PPI Networks.",
            "A Flexible Computational Framework Using R and Map-Reduce for Permutation Tests of Massive Genetic Analysis of Complex Traits.",
            "A New Scheme to Characterize and Identify Protein Ubiquitination Sites.",
            "A Resolution of the Static Formulation Question for the Problem of Computing the History Bound.",
            "Algorithms and Complexity Results for Genome Mapping Problems.",
            "Extending and Applying Spartan to Perform Temporal Sensitivity Analyses for Predicting Changes in Influential Biological Pathways in Computational Models.",
            "Genome-Wide Semi-Automated Annotation of Transporter Systems.",
            "Optimal Landmark Selection for Registration of 4D Confocal Image Stacks in Arabidopsis.",
            "A Characterization of Minimum Spanning Tree-Like Metric Spaces.",
            "A Linear Bound on the Number of States in Optimal Convex Characters for Maximum Parsimony Distance.",
            "Building Ancestral Recombination Graphs for Whole Genomes.",
            "D-Map: Random Walking on Gene Network Inference Maps Towards differential Avenue Discovery.",
            "Metabolic Flux Analysis in Isotope Labeling Experiments Using the Adjoint Approach.",
            "Pubcast and Genecast: Browsing and Exploring Publications and Associated Curated Content in Biology Through Mobile Devices.",
            "Guest Editorial: Special Section on Biological Data Mining and Its Applications in Healthcare.",
            "From Protein Sequence to Protein Function via Multi-Label Linear Discriminant Analysis.",
            "Towards Unsupervised Gene Selection: A Matrix Factorization Framework.",
            "Efficient Approach to Correct Read Alignment for Pseudogene Abundance Estimates.",
            "Applications of Transductive Spectral Clustering Methods in a Military Medical Concussion Database.",
            "Modeling Healthcare Quality via Compact Representations of Electronic Health Records.",
            "Prognosis of Clinical Outcomes with Temporal Patterns and Experiences with One Class Feature Selection.",
            "Bi-convex Optimization to Learn Classifiers from Multiple Biomedical Annotations.",
            "Guest Editors' Introduction to the Special Section on Bioinformatics Research and Applications.",
            "An Effective Computational Method Incorporating Multiple Secondary Structure Predictions in Topology Determination for Cryo-EM Images.",
            "On the Complexity of Duplication-Transfer-Loss Reconciliation with Non-Binary Gene Trees.",
            "Searching Genome-Wide Multi-Locus Associations for Multiple Diseases Based on Bayesian Inference.",
            "Calcium Ion Fluctuations Alter Channel Gating in a Stochastic Luminal Calcium Release Site Model.",
            "Sorting Circular Permutations by Super Short Reversals.",
            "A Modified Multiple Alignment Fast Fourier Transform with Higher Efficiency.",
            "Drug-Target Interaction Prediction with Graph Regularized Matrix Factorization.",
            "Efficient Constant-Time Complexity Algorithm for Stochastic Simulation of Large Reaction Networks.",
            "Leveraging FPGAs for Accelerating Short Read Alignment.",
            "PCID: A Novel Approach for Predicting Disease Comorbidity by Integrating Multi-Scale Data.",
            "Prediction and Validation of Disease Genes Using HeteSim Scores.",
            "RNA Visualization: Relevance and the Current State-of-the-Art Focusing on Pseudoknots.",
            "A Heterogeneous Network Based Method for Identifying GBM-Related Genes by Integrating Multi-Dimensional Data.",
            "Classical Mechanics Approach Applied to Analysis of Genetic Oscillators.",
            "Genomic Distance with High Indel Costs.",
            "Protein Complex Detection via Effective Integration of Base Clustering Solutions and Co-Complex Affinity Scores.",
            "Robust Reachability of Boolean Control Networks.",
            "txCoords: A Novel Web Application for Transcriptomic Peak Re-Mapping.",
            "A Generalized Lattice Based Probabilistic Approach for Metagenomic Clustering.",
            "A New Feature Vector Based on Gene Ontology Terms for Protein-Protein Interaction Prediction.",
            "A Novel Adaptive Penalized Logistic Regression for Uncovering Biomarker Associated with Anti-Cancer Drug Sensitivity.",
            "SuperMIC: Analyzing Large Biological Datasets in Bioinformatics with Maximal Information Coefficient.",
            "An IR-Based Approach Utilizing Query Expansion for Plagiarism Detection in MEDLINE.",
            "Brain Modulyzer: Interactive Visual Analysis of Functional Brain Connectivity.",
            "Circular Order Aggregation and Its Application to Cell-Cycle Genes Expressions.",
            "cuBLASTP: Fine-Grained Parallelization of Protein Sequence Search on CPU+GPU.",
            "Derivative-Free Optimization of Rate Parameters of Capsid Assembly Models from Bulk in Vitro Data.",
            "Detection Copy Number Variants from NGS with Sparse and Smooth Constraints.",
            "Finite-Time Stability Analysis of Reaction-Diffusion Genetic Regulatory Networks with Time-Varying Delays.",
            "Identifying Cell Populations in Flow Cytometry Data Using Phenotypic Signatures.",
            "Impact of Synaptic Localization and Subunit Composition of Ionotropic Glutamate Receptors on Synaptic Function: Modeling and Simulation Studies.",
            "Inferring MicroRNA-Disease Associations by Random Walk on a Heterogeneous Network with Multiple Data Sources.",
            "ISEA: Iterative Seed-Extension Algorithm for De Novo Assembly Using Paired-End Information and Insert Size Distribution.",
            "Omics Informatics: From Scattered Individual Software Tools to Integrated Workflow Management Systems.",
            "Pattern Classification of Instantaneous Cognitive Task-load Through GMM Clustering, Laplacian Eigenmap, and Ensemble SVMs.",
            "Prediction of Novel Drugs for Hepatocellular Carcinoma Based on Multi-Source Random Walk.",
            "Search for a Minimal Set of Parameters by Assessing the Total Optimization Potential for a Dynamic Model of a Biochemical Network.",
            "Super-Thresholding: Supervised Thresholding of Protein Crystal Images.",
            "Guest Editor's Introduction: Selected Papers from ACM-BCB 2014.",
            "Unconstrained Diameters for Deep Coalescence.",
            "A Sparse Learning Framework for Joint Effect Analysis of Copy Number Variants.",
            "Learning Parameter-Advising Sets for Multiple Sequence Alignment.",
            "Pathway Analysis with Signaling Hypergraphs.",
            "Improving Identification of Key Players in Aging via Network De-Noising and Core Inference.",
            "An Annotation Agnostic Algorithm for Detecting Nascent RNA Transcripts in GRO-Seq.",
            "Predicting nsSNPs that Disrupt Protein-Protein Interactions Using Docking.",
            "IPED2: Inheritance Path Based Pedigree Reconstruction Algorithm for Complicated Pedigrees.",
            "Guest Editorial for Special Section on the 11th International Conference on Intelligent Computing (ICIC).",
            "Deep Conditional Random Field Approach to Transmembrane Topology Prediction and Application to GPCR Three-Dimensional Structure Modeling.",
            "Cancer Subtype Discovery Based on Integrative Model of Multigenomic Data.",
            "Classification of Protein Structure Classes on Flexible Neutral Tree.",
            "Exploring Consensus RNA Substructural Patterns Using Subgraph Mining.",
            "Identifying Stages of Kidney Renal Cell Carcinoma by Combining Gene Expression and DNA Methylation Data.",
            "Nonconvex Penalty Based Low-Rank Representation and Sparse Regression for eQTL Mapping.",
            "PSPEL: In Silico Prediction of Self-Interacting Proteins from Amino Acids Sequences Using Ensemble Learning.",
            "hMuLab: A Biomedical Hybrid MUlti-LABel Classifier Based on Multiple Linear Regression.",
            "An Algorithm for Motif-Based Network Design.",
            "An Eigen-Binding Site Based Method for the Analysis of Anti-EGFR Drug Resistance in Lung Cancer Treatment.",
            "IsAProteinDB: An Indexed Database of Trypsinized Proteins for Fast Peptide Mass Fingerprinting.",
            "A Survey of Software and Hardware Approaches to Performing Read Alignment in Next Generation Sequencing.",
            "Batch Mode TD(λ) for Controlling Partially Observable Gene Regulatory Networks.",
            "Benchmark Dataset for Whole Genome Sequence Compression.",
            "Copy Number Variations Detection: Unravelling the Problem in Tangible Aspects.",
            "Data Management for Heterogeneous Genomic Datasets.",
            "Detecting Pairwise Interactive Effects of Continuous Random Variables for Biomarker Identification with Small Sample Size.",
            "Effect of Aggregation Operators on Network-Based Disease Gene Prioritization: A Case Study on Blood Disorders.",
            "Enhancing Protein Conformational Space Sampling Using Distance Profile-Guided Differential Evolution.",
            "Extending the Applicability of Graphlets to Directed Networks.",
            "High Class-Imbalance in pre-miRNA Prediction: A Novel Approach Based on deepSOM.",
            "Improving Biochemical Named Entity Recognition Using PSO Classifier Selection and Bayesian Combination Methods.",
            "ML-Space: Hybrid Spatial Gillespie and Particle Simulation of Multi-Level Rule-Based Models in Cell Biology.",
            "Multi-Block Bipartite Graph for Integrative Genomic Analysis.",
            "Normalizing Kernels in the Billera-Holmes-Vogtmann Treespace.",
            "Novel Methods for Microglia Segmentation, Feature Extraction, and Classification.",
            "Pluribus - Exploring the Limits of Error Correction Using a Suffix Tree.",
            "Predicting Protein-DNA Binding Residues by Weightedly Combining Sequence-Based Features and Boosting Multiple SVMs.",
            "Protein Inference from the Integration of Tandem MS Data and Interactome Networks.",
            "Reframed Genome-Scale Metabolic Model to Facilitate Genetic Design and Integration with Expression Data.",
            "Significance and Functional Similarity for Identification of Disease Genes.",
            "Strategies for Comparing Metabolic Profiles: Implications for the Inference of Biochemical Mechanisms from Metabolomics Data.",
            "Triangular Alignment (TAME): A Tensor-Based Approach for Higher-Order Network Alignment.",
            "Unsupervised Binning of Metagenomic Assembled Contigs Using Improved Fuzzy C-Means Method.",
            "Collective Prediction of Disease-Associated miRNAs Based on Transduction Learning.",
            "Modeling and Identification of Amnioserosa Cell Mechanical Behavior by Using Mass-Spring Lattices.",
            "Soft Ngram Representation and Modeling for Protein Remote Homology Detection."
        ]
    },
    {
        "name": "TCBB",
        "year": "2016",
        "info": "Volume 13: 2016",
        "count": 109,
        "papers": [
            "Guest Editorial for Special Section on the 10th International Conference on Intelligent Computing (ICIC).",
            "GeneNetFinder2: Improved Inference of Dynamic Gene Regulatory Relations with Multiple Regulators.",
            "Hybrid Framework Using Multiple-Filters and an Embedded Approach for an Efficient Selection and Classification of Microarray Data.",
            "Predicting Hub Genes Associated with Cervical Cancer through Gene Co-Expression Networks.",
            "Predicting the Subcellular Localization of Proteins with Multiple Sites Based on Multiple Features Fusion.",
            "A Faster cDNA Microarray Gene Expression Data Classifier for Diagnosing Diseases.",
            "ChIP-PIT: Enhancing the Analysis of ChIP-Seq Data Using Convex-Relaxed Pair-Wise Interaction Tensor Decomposition.",
            "Practical Guidelines for Incorporating Knowledge-Based and Data-Driven Strategies into the Inference of Gene Regulatory Networks.",
            "The Intrinsic Geometric Structure of Protein-Protein Interaction Networks for Protein Interaction Prediction.",
            "A Novel Teaching-Learning-Based Optimization for Improved Mutagenic Primer Design in Mismatch PCR-RFLP SNP Genotyping.",
            "Discovering Motifs in Biological Sequences Using the Micron Automata Processor.",
            "Fractal Behavior of the Pancreatic β-Cell Near the Percolation Threshold: Effect of the KATP Channel On the Electrical Response.",
            "gEFM: An Algorithm for Computing Elementary Flux Modes Using Graph Traversal.",
            "Globally Asymptotic Stability Analysis for Genetic Regulatory Networks with Mixed Delays: An M-Matrix-Based Approach.",
            "Identification of Glucose-Binding Pockets in Human Serum Albumin Using Support Vector Machine and Molecular Dynamics Simulations.",
            "Relational Agreement Measures for Similarity Searching of Cheminformatic Data Sets.",
            "Guest Editorial for Special Section on Semantic-Based Approaches for Analysis of Biological Data.",
            "Extracting Cross-Ontology Weighted Association Rules from Gene Ontology Annotations.",
            "Integration and Querying of Genomic and Proteomic Semantic Annotations for Biomedical Knowledge Extraction.",
            "Predicting Protein Function via Semantic Integration of Multiple Networks.",
            "Ontology-Based Search of Genomic Metadata.",
            "Ontology-Based Prediction and Prioritization of Gene Functional Annotations.",
            "A Comparison Study for DNA Motif Modeling on Protein Binding Microarray.",
            "A Low Dimensional Approximation For Competence In Bacillus Subtilis.",
            "A Probabilistic Method for Estimating the Sharing of Identity by Descent for Populations with Migration.",
            "A Real-Time de novo DNA Sequencing Assembly Platform Based on an FPGA Implementation.",
            "bLARS: An Algorithm to Infer Gene Regulatory Networks.",
            "Fast Sampling-Based Whole-Genome Haplotype Block Recognition.",
            "FocusALL: Focal Stacking of Microscopic Images Using Modified Harris Corner Response Measure.",
            "Measuring Cluster Stability in a Large Scale Phylogenetic Analysis of Functional Genes in Metagenomes Using pplacer.",
            "Prediction of Growth Factor-Dependent Cleft Formation During Branching Morphogenesis Using A Dynamic Graph-Based Growth Model.",
            "Process Simulation of Complex Biological Pathways in Physical Reactive Space and Reformulated for Massively Parallel Computing Platforms.",
            "Using Formal Concept Analysis to Identify Negative Correlations in Gene Expression Data.",
            "A Class-Information-Based Sparse Component Analysis Method to Identify Differentially Expressed Genes on RNA-Seq Data.",
            "Guest Editorial: Introduction to the Special Section on Emerging Security Trends for Biomedical Computations, Devices, and Infrastructures.",
            "Emerging Security Mechanisms for Medical Cyber Physical Systems.",
            "Authentication of Medicines Using Nuclear Quadrupole Resonance Spectroscopy.",
            "Private Data Analytics on Biomedical Sensing Data via Distributed Computation.",
            "Security Assessment of Cyberphysical Digital Microfluidic Biochips.",
            "A Modeling Framework for Generation of Positional and Temporal Simulations of Transcriptional Regulation.",
            "A Multi-State Optimization Framework for Parameter Estimation in Biological Systems.",
            "An Adaptive Hybrid Algorithm for Global Network Alignment.",
            "Applying Monte Carlo Simulation to Biomedical Literature to Approximate Genetic Network.",
            "CAVER: Algorithms for Analyzing Dynamics of Tunnels in Macromolecules.",
            "Decoding Genetic Variations: Communications-Inspired Haplotype Assembly.",
            "Efficient Drug-Pathway Association Analysis via Integrative Penalized Matrix Decomposition.",
            "Residue Specific and Chirality Dependent Interactions between Carbon Nanotubes and Flagellin.",
            "A Novel Method to Detect Functional microRNA Regulatory Modules by Bicliques Merging.",
            "Exploring the Genetic Patterns of Complex Diseases via the Integrative Genome-Wide Approach.",
            "Fast Construction of Near Parsimonious Hybridization Networks for Multiple Phylogenetic Trees.",
            "Finding Robust Adaptation Gene Regulatory Networks Using Multi-Objective Genetic Algorithm.",
            "MINT: Mutual Information Based Transductive Feature Selection for Genetic Trait Prediction.",
            "Optimization of Signal Decomposition Matched Filtering (SDMF) for Improved Detection of Copy-Number Variations.",
            "Parallel and Space-Efficient Construction of Burrows-Wheeler Transform and Suffix Array for Big Genome Data.",
            "A New Efficient Algorithm for the All Sorting Reversals Problem with No Bad Components.",
            "Detecting Functional Modules Based on a Multiple-Grain Model in Large-Scale Protein-Protein Interaction Networks.",
            "AMAS: Optimizing the Partition and Filtration of Adaptive Seeds to Speed up Read Mapping.",
            "An Unsupervised Graph Based Continuous Word Representation Method for Biomedical Text Mining.",
            "Classifying the Progression of Ductal Carcinoma from Single-Cell Sampled Data via Integer Linear Programming: A Case Study.",
            "Discovering Recurrent Copy Number Aberrations in Complex Patterns via Non-Negative Sparse Singular Value Decomposition.",
            "Extracting Biomedical Event with Dual Decomposition Integrating Word Embeddings.",
            "Extraction of Blebs in Human Embryonic Stem Cell Videos.",
            "Global Alignment of Protein-Protein Interaction Networks: A Survey.",
            "Mem-mEN: Predicting Multi-Functional Types of Membrane Proteins by Interpretable Elastic Nets.",
            "Optimal ROC-Based Classification and Performance Analysis under Bayesian Uncertainty Models.",
            "Performance Analysis of Chemotaxis Controllers: Which has Better Chemotaxis Controller, Escherichia coli or Paramecium caudatum?",
            "Prediction of Protein Coding Regions Using a Wide-Range Wavelet Window Method.",
            "Probabilistic Boolean Network Modelling and Analysis Framework for mRNA Translation.",
            "Reconstruction of Gene Regulatory Networks Based on Repairing Sparse Low-Rank Matrices.",
            "Robust Multiobjective Controllability of Complex Neuronal Networks.",
            "The Max-Min High-Order Dynamic Bayesian Network for Learning Gene Regulatory Networks with Time-Delayed Regulations.",
            "ℓ2 Multiple Kernel Fuzzy SVM-Based Data Fusion for Improving Peptide Identification.",
            "Guest Editorial for Special Section on Big Data Computing and Processing in Computational Biology and Bioinformatics.",
            "Expectation Maximization of Frequent Patterns, a Specific, Local, Pattern-Based Biclustering Algorithm for Biological Datasets.",
            "Improve Glioblastoma Multiforme Prognosis Prediction by Using Feature Selection and Multiple Kernel Learning.",
            "Inferring Disease Associated Phosphorylation Sites via Random Walk on Multi-Layer Heterogeneous Network.",
            "MrBayes tgMC3++: A High Performance and Resource-Efficient GPU-Oriented Phylogenetic Analysis Method.",
            "Mining Contiguous Sequential Generators in Biological Sequences.",
            "A Guaranteed Similarity Metric Learning Framework for Biological Sequence Comparison.",
            "A Mutation Model from First Principles of the Genetic Code.",
            "A Novel Method Using Abstract Convex Underestimation in Ab-Initio Protein Structure Prediction for Guiding Search in Conformational Feature Space.",
            "A Sequence-Based Dynamic Ensemble Learning System for Protein Ligand-Binding Site Prediction.",
            "Asymptotic Properties of the Number of Matching Coalescent Histories for Caterpillar-Like Families of Species Trees.",
            "BowMapCL: Burrows-Wheeler Mapping on Multiple Heterogeneous Accelerators.",
            "Online Estimation Method for Respiratory Parameters Based on a Pneumatic Model.",
            "Prediction the Substrate Specificities of Membrane Transport Proteins Based on Support Vector Machine and Hybrid Features.",
            "Similarity Search of Flexible 3D Molecules Combining Local and Global Shape Descriptors.",
            "Supervised, Unsupervised, and Semi-Supervised Feature Selection: A Review on Gene Selection.",
            "A New Method to Predict RNA Secondary Structure Based on RNA Folding Simulation.",
            "Dynamical Robustness against Multiple Mutations in Signaling Networks.",
            "Data Mining in Systems Biology.",
            "A New Approach for Feature Selection from Microarray Data Based on Mutual Information.",
            "Enhancing the Prediction of Transmembrane β-Barrel Segments with Chain Learning and Feature Sparse Representation.",
            "Identifying Disease Associated miRNAs Based on Protein Domains.",
            "Network-Based Method for Inferring Cancer Progression at the Pathway Level from Cross-Sectional Mutation Data.",
            "An Extensive Empirical Comparison of Probabilistic Hierarchical Classifiers in Datasets of Ageing-Related Genes.",
            "Characteristic Gene Selection Based on Robust Graph Regularized Non-Negative Matrix Factorization.",
            "Computational 3D Assembling Methods for DNA: A Survey.",
            "Discovering Condition Specific Topological Pattern Changes in Coexpression Network: An Application to HIV-1 Progression.",
            "Efficient and Powerful Method for Combining P-Values in Genome-Wide Association Studies.",
            "Exact Identification of the Structure of a Probabilistic Boolean Network from Samples.",
            "Global Biological Network Alignment by Using Efficient Memetic Algorithm.",
            "Identifying Activation Centers with Spatial Cox Point Processes Using fMRI Data.",
            "Kriging-Based Parameter Estimation Algorithm for Metabolic Networks Combined with Single-Dimensional Optimization and Dynamic Coordinate Perturbation.",
            "MDTE DB: A Database for MicroRNAs Derived from Transposable Element.",
            "MiRTDL: A Deep Learning Approach for miRNA Target Prediction.",
            "Prediction of Essential Proteins Based on Local Interaction Density.",
            "Time-Dependent Gene Network Modelling by Sequential Monte Carlo.",
            "Disturbance Decoupling of Singular Boolean Control Networks."
        ]
    },
    {
        "name": "TCBB",
        "year": "2015",
        "info": "Volume 12: 2015",
        "count": 149,
        "papers": [
            "Editorial from the Editor-in-Chief.",
            "Guest Editors' Introduction: Selected Papers from ACM-BCB 2013.",
            "MRFy: Remote Homology Detection for Beta-Structural Proteins Using Markov Random Fields and Stochastic Search.",
            "RLIMS-P 2.0: A Generalizable Rule-Based Information Extraction System for Literature Mining of Protein Phosphorylation Information.",
            "Phenotype-Dependent Coexpression Gene Clusters: Application to Normal and Premature Ageing.",
            "Global Network Alignment in the Context of Aging.",
            "Reachability Analysis in Probabilistic Biological Networks.",
            "GLProbs: Aligning Multiple Sequences Adaptively.",
            "Prediction and Informative Risk Factor Selection of Bone Diseases.",
            "Capturing Uncertainty by Modeling Local Transposon Insertion Frequencies Improves Discrimination of Essential Genes.",
            "A Deep Learning Network Approach to ab initio Protein Secondary Structure Prediction.",
            "A Hierarchical Clustering Method of Selecting Kernel SNP to Unify Informative SNP and Tag SNP.",
            "A Maximum A Posteriori Probability and Time-Varying Approach for Inferring Gene Regulatory Networks from Time Course Gene Microarray Data.",
            "An Algorithm for Motif Discovery with Iteration on Lengths of Motifs.",
            "Discovering Binding Cores in Protein-DNA Binding Using Association Rule Mining with Statistical Measures.",
            "Gene Tree Diameter for Deep Coalescence.",
            "Heterogeneous Cloud Framework for Big Data Genome Sequencing.",
            "Identification of Protein Complexes Using Weighted PageRank-Nibble Algorithm and Core-Attachment Structure.",
            "Identifying Affinity Classes of Inorganic Materials Binding Sequences via a Graph-Based Model.",
            "Parallel Implementation of MAFFT on CUDA-Enabled Graphics Hardware.",
            "Predicting Protein Function Using Multiple Kernels.",
            "Tractable Cases of (*, 2)-Bounded Parsimony Haplotyping.",
            "Guest Editorial for Special Section on BIBM 2013.",
            "Predicting Microbial Interactions Using Vector Autoregressive Model with Graph Regularization.",
            "Predicting the Pro-Longevity or Anti-Longevity Effect of Model Organism Genes with New Hierarchical Feature Selection Methods.",
            "UDoNC: An Algorithm for Identifying Essential Proteins Based on Protein Domains and Protein-Protein Interaction Networks.",
            "ENISI SDE: A New Web-Based Tool for Modeling Stochastic Processes.",
            "An Integrated Approach to Sequence-Independent Local Alignment of Protein Binding Sites.",
            "P-Finder: Reconstruction of Signaling Networks from Protein-Protein Interactions and GO Annotations.",
            "A New Semantic Functional Similarity over Gene Ontology.",
            "A Comparative Assessment of Predictive Accuracies of Conventional and Machine Learning Scoring Functions for Protein-Ligand Binding Affinity Prediction.",
            "A Fractal Dimension and Wavelet Transform Based Method for Protein Sequence Similarity Analysis.",
            "A Property-Driven Methodology for Formal Analysis of Synthetic Biology Systems.",
            "A Topology Potential-Based Method for Identifying Essential Proteins from PPI Networks.",
            "An Efficient Exact Algorithm for the Motif Stem Search Problem over Large Alphabets.",
            "An Improved Integral Inequality to Stability Analysis of Genetic Regulatory Networks With Interval Time-Varying Delays.",
            "Burial Level Change Defines a High Energetic Relevance for Protein Binding Interfaces.",
            "Data Requirement for Phylogenetic Inference from Multiple Loci: A New Distance Method.",
            "Gene Selection Integrated with Biological Knowledge for Plant Stress Response Using Neighborhood System and Rough Set Theory.",
            "GPUDePiCt: A Parallel Implementation of a Clustering Algorithm for Computing Degenerate Primers on Graphics Processing Units.",
            "Identification of Protein Complexes from Tandem Affinity Purification/Mass Spectrometry Data via Biased Random Walk.",
            "Identifying Driver Nodes in the Human Signaling Network Using Structural Controllability Analysis.",
            "Improving Integration Effectiveness of ID Mapping Based Biological Record Linkage.",
            "Multiple Break-Points Detection in Array CGH Data via the Cross-Entropy Method.",
            "TCBB Special Section on the Brazilian Symposium on Bioinformatics 2013.",
            "Sorting Linear Genomes with Rearrangements and Indels.",
            "Product Grammars for Alignment and Folding.",
            "Multiple 3D RNA Structure Superposition Using Neighbor Joining.",
            "Improving Retrieval Efficacy of Homology Searches Using the False Discovery Rate.",
            "A Bayesian Framework for Combining Protein and Network Topology Information for Predicting Protein-Protein Interactions.",
            "A Machine Learning Approach for Accurate Annotation of Noncoding RNAs.",
            "A Partial Least Squares Based Procedure for Upstream Sequence Classification in Prokaryotes.",
            "An Accurate de novo Algorithm for Glycan Topology Determination from Mass Spectra.",
            "Colored Noise Induced Bistable Switch in the Genetic Toggle Switch Systems.",
            "COSPEDTree: COuplet Supertree by Equivalence Partitioning of Taxa Set and DAG Formation.",
            "DAPD: A Knowledgebase for Diabetes Associated Proteins.",
            "Disulfide Connectivity Prediction Based on Modelled Protein 3D Structural Information and Random Forest Regression.",
            "Evolutionary Model Selection and Parameter Estimation for Protein-Protein Interaction Network Based on Differential Evolution Algorithm.",
            "Extraction of Individual Filaments from 2D Confocal Microscopy Images of Flat Cells.",
            "Finding All Longest Common Segments in Protein Structures Efficiently.",
            "Finding Patterns in Protein Sequences by Using a Hybrid Multiobjective Teaching Learning Based Optimization Algorithm.",
            "Functional Impact of Autophagy-Related Genes on the Homeostasis and Dynamics of Pancreatic Cancer Cell Lines.",
            "Identification of Genomic Aberrations in Cancer Subclones from Heterogeneous Tumor Samples.",
            "Parameterized BLOSUM Matrices for Protein Alignment.",
            "Searching High-Order SNP Combinations for Complex Diseases Based on Energy Distribution Difference.",
            "Supervised Variational Relevance Learning, An Analytic Geometric Feature Selection with Applications to Omic Datasets.",
            "Systematic Biological Filter Design with a Desired I/O Filtering Response Based on Promoter-RBS Libraries.",
            "Knowledge Discovery Using Big Data in Biomedical Systems.",
            "Divide and Conquer Approach to Contact Map Overlap Problem Using 2D-Pattern Mining of Protein Contact Networks.",
            "Biclustering with Flexible Plaid Models to Unravel Interactions between Biological Processes.",
            "Unsupervised Structure Detection in Biomedical Data.",
            "Guest Editorial for the 25th International Conference on Genome Informatics (GIW/ISCB-Asia 2014).",
            "Randomized Subspace Learning for Proline Cis-Trans Isomerization Prediction.",
            "An O(m, log m)-Time Algorithm for Detecting Superbubbles.",
            "An Efficient Search Algorithm for Finding Genomic-Range Overlaps Based on the Maximum Range Length.",
            "Curatable Named-Entity Recognition Using Semantic Relations.",
            "Guest Editors Introduction to the Special Issue on Software and Databases.",
            "ResSeq: Enhancing Short-Read Sequencing Alignment By Rescuing Error-Containing Reads.",
            "MMBIRFinder: A Tool to Detect Microhomology-Mediated Break-Induced Replication.",
            "Heterogeneous Compression of Large Collections of Evolutionary Trees.",
            "ClusterViz: A Cytoscape APP for Cluster Analysis of Biological Network.",
            "Building Transcriptional Association Networks in Cytoscape with RegNetC.",
            "iPFPi: A System for Improving Protein Function Prediction through Cumulative Iterations.",
            "Software Suite for Gene and Protein Annotation Prediction and Similarity Search.",
            "Rapid Assessment of Adverse Drug Reactions by Statistical Solution of Gene Association Network.",
            "Quantitative Measurement of Split of the Second Heart Sound (S2).",
            "An Optimized LMMSE Based Method for 3D MRI Denoising.",
            "RBioCloud: A Light-Weight Framework for Bioconductor and R-based Jobs on the Cloud.",
            "A New Method for Detecting Protein Complexes based on the Three Node Cliques.",
            "Adaptive Fuzzy Consensus Clustering Framework for Clustering Analysis of Cancer Data.",
            "An Integrated Framework for Functional Annotation of Protein Structural Domains.",
            "Bayesian Normalization Model for Label-Free Quantitative Analysis by LC-MS.",
            "Integrative Data Analysis of Multi-Platform Cancer Data with a Multimodal Deep Learning Approach.",
            "Optimal Experimental Design for Gene Regulatory Networks in the Presence of Uncertainty.",
            "Statistical Detection of Intrinsically Multivariate Predictive Genes.",
            "RPCA-Based Tumor Classification Using Gene Expression Data.",
            "Accelerating Bioinformatics Applications via Emerging Parallel Computing Systems.",
            "FHAST: FPGA-Based Acceleration of Bowtie in Hardware.",
            "Parallelizing Epistasis Detection in GWAS on FPGA and GPU-Accelerated Computing Systems.",
            "Concurrent and Accurate Short Read Mapping on Multicore Processors.",
            "Parallel Mutual Information Based Construction of Genome-Scale Networks on the Intel®Xeon Phi™ Coprocessor.",
            "Large Scale Tissue Morphogenesis Simulation on Heterogenous Systems Based on a Flexible Biomechanical Cell Model.",
            "An Application Specific Instruction Set Processor (ASIP) for Adaptive Filters in Neural Prosthetics.",
            "Boosting the FM-Index on the GPU: Effective Techniques to Mitigate Random Memory Access.",
            "Efficient and Accurate OTU Clustering with GPU-Based Sequence Alignment and Dynamic Dendrogram Cutting.",
            "Guest Editorial for Special Section on ISB/TBC 2014.",
            "An Independent Filter for Gene Set Testing Based on Spectral Enrichment.",
            "Evolutionary Pressures on the Yeast Transcriptome.",
            "Inferring Sequential Order of Somatic Mutations during Tumorgenesis based on Markov Chain Model.",
            "Identify Critical Genes in Development with Consistent H3K4me2 Patterns across Multiple Tissues.",
            "Infer Metagenomic Abundance and Reveal Homologous Genomes Based on the Structure of Taxonomy Tree.",
            "CMStalker: A Combinatorial Tool for Composite Motif Discovery.",
            "Fast Prediction of DNA Melting Bubbles Using DNA Thermodynamic Stability.",
            "Functional Module Analysis for Gene Coexpression Networks with Network Integration.",
            "Identification of Gene Networks with Time Delayed Regulation Based on Temporal Expression Profiles.",
            "Inferring Time-Delayed Causal Gene Network Using Time-Series Expression Data.",
            "YamiPred: A Novel Evolutionary Method for Predicting Pre-miRNAs and Selecting Relevant Features.",
            "A Multimodal Approach for Protein Remote Homology Detection.",
            "Fuzzy Logic as a Computational Tool for Quantitative Modelling of Biological Systems with Uncertain Kinetic Data.",
            "Synthesis of Genetic Clock with Combinational Biologic Circuits.",
            "ZoomOut: Analyzing Multiple Networks as Single Nodes.",
            "Guest Editorial for the 13th Asia Pacific Bioinformatics Conference.",
            "Using Semantic Association to Extend and Infer Literature-Oriented Relativity Between Terms.",
            "Cophylogenetic Reconciliation with ILP.",
            "DPNuc: Identifying Nucleosome Positions Based on the Dirichlet Process Mixture Model.",
            "A Cooperative Co-Evolutionary Genetic Algorithm for Tree Scoring and Ancestral Genome Inference.",
            "LGH: A Fast and Accurate Algorithm for Single Individual Haplotyping Based on a Two-Locus Linkage Graph.",
            "A Machine Learning Based Approach to de novo Sequencing of Glycans from Tandem Mass Spectrometry Spectrum.",
            "CoGI: Towards Compressing Genomes as an Image.",
            "BMExpert: Mining MEDLINE for Finding Experts in Biomedical Domains Based on Language Model.",
            "A Resampling Based Clustering Algorithm for Replicated Gene Expression Data.",
            "An Optimization-Based Framework for the Transformation of Incomplete Biological Knowledge into a Probabilistic Structure and Its Application to the Utilization of Gene/Protein Signaling Pathways in Discrete Phenotype Classification.",
            "Compression of Multiple DNA Sequences Using Intra-Sequence and Inter-Sequence Similarities.",
            "Detecting Protein Complexes from Signed Protein-Protein Interaction Networks.",
            "Explaining a Weighted DAG with Few Paths for Solving Genome-Guided Multi-Assembly.",
            "In-silico Studies Show Potent Inhibition of HIV-1 Reverse Transcriptase Activity by a Herbal Drug.",
            "Mining Gene Regulatory Networks by Neural Modeling of Expression Time-Series.",
            "On Efficient Feature Ranking Methods for High-Throughput Data Analysis.",
            "PRBP: Prediction of RNA-Binding Proteins Using a Random Forest Algorithm Combined with an RNA-Binding Residue Predictor.",
            "Predicting Protein-Protein Interaction Sites with a Novel Membership Based Fuzzy SVM Classifier.",
            "PreProPath: An Uncertainty-Aware Algorithm for Identifying Predictable Profitable Pathways in Biochemical Networks.",
            "Probabilistic Inference on Multiple Normalized Signal Profiles from Next Generation Sequencing: Transcription Factor Binding Sites.",
            "Ribosome Flow Model on a Ring.",
            "Stable Gene Signature Selection for Prediction of Breast Cancer Recurrence Using Joint Mutual Information.",
            "Synchronization of Asynchronous Switched Boolean Network.",
            "A Computational Approach Using Ratio Statistics for Identifying Housekeeping Genes from cDNA Microarray Data.",
            "A Novel Scoring Based Distributed Protein Docking Application to Improve Enrichment.",
            "Growth Signatures of Rosette Plants from Time-Lapse Video.",
            "Model Order and Identifiability of Non-Linear Biological Systems in Stable Oscillation."
        ]
    },
    {
        "name": "TCBB",
        "year": "2014",
        "info": "Volume 11: 2014",
        "count": 118,
        "papers": [
            "Editorial from the Editor-in-Chief.",
            "Guest Editorial for the International Conference on Genome Informatics (GIW 2013).",
            "Coupling Graphs, Efficient Algorithmsand B-Cell Epitope Prediction.",
            "Quantifying Significance of MHC II Residues.",
            "Intelligent Consensus Modeling for ProlineCis-Trans Isomerization Prediction.",
            "Residue-Specific Side-Chain Polymorphismsvia Particle Belief Propagation.",
            "A New Unsupervised Binning Approachfor Metagenomic Sequences Based onN-grams and Automatic Feature Weighting.",
            "Gene Name Disambiguation UsingMulti-Scope Species Detection.",
            "Reliable and Fast Estimation of Recombination Rates by Convergence Diagnosis and Parallel Markov Chain Monte Carlo.",
            "Identifying Cis-Regulatory Elements and Modules Using Conditional Random Fields.",
            "Evolution and Controllability of CancerNetworks: A Boolean Perspective.",
            "A Survey and Comparative Study of Statistical Tests for Identifying Differential Expressionfrom Microarray Data.",
            "A New Path Based Hybrid Measurefor Gene Ontology Similarity.",
            "CAMS-RS: Clustering Algorithm for Large-Scale Mass Spectrometry Data Using Restricted Search Space and Intelligent Random Sampling.",
            "Constructing a Gene Team Treein Almost $O$$(n\\; {\\rm lg}\\; n)$ Time.",
            "Detecting Differentially Coexpressed Genesfrom Labeled Expression Data: A Brief Review.",
            "DNA Copy Number Selection Using Robust Structured Sparsity-Inducing Norms.",
            "HIV Haplotype Inference Using a Propagating Dirichlet Process Mixture Model.",
            "Improved and Promising Identificationof Human MicroRNAs by Incorporatinga High-Quality Negative Set.",
            "Incorporation of Biological PathwayKnowledge in the Construction of Priorsfor Optimal Bayesian Classification.",
            "Local Exact Pattern Matching for Non-FixedRNA Structures.",
            "Maximizing Deep Coalescence Cost.",
            "Multiple Sequence Alignment with HiddenMarkov Models Learned by Random DriftParticle Swarm Optimization.",
            "Approximate k-Mer Matching UsingFuzzy Hash Maps.",
            "Erratum to \"Protein Function Prediction Using Multilabel Ensemble Classification\".",
            "A Multi-Layered Screening Method to Identify Plant Regulatory Genes.",
            "An Algorithm for Constructing Principal Geodesics in Phylogenetic Treespace.",
            "An Odd Parity Checker Prototype Using DNAzyme Finite State Machine.",
            "Distance-Based Phylogenetic MethodsAround a Polytomy.",
            "Hierarchical Probabilistic Interaction Modeling for Multiple Gene Expression Replicates.",
            "Hybrid Ant Bee Algorithm for Fuzzy Expert System Based Sample Classification.",
            "Improved Exact Enumerative Algorithmsfor the Planted ($l$, $d$)-Motif Search Problem.",
            "Indexing Graphs for Path Queries with Applications in Genome Research.",
            "Merging Partially Labelled Trees: Hardness and a DeclarativeProgramming Solution.",
            "Optimizing Spaced $k$-mer Neighbors for Efficient Filtration in Protein Similarity Search.",
            "Predicting Essential Proteins Basedon Weighted Degree Centrality.",
            "Solving the Secondary Structure MatchingProblem in Cryo-EM De Novo ModelingUsing a Constrained $K$-Shortest Path Graph Algorithm.",
            "Systematic Approach to Computational Designof Gene Regulatory Networks with Information Processing Capabilities.",
            "Thermodynamic Post-Processing versusGC-Content Pre-Processing for DNA CodesSatisfying the Hamming Distance andReverse-Complement Constraints.",
            "Guest Editors Introduction to the Special Section on Bioinformatics Research and Applications.",
            "Partitioning Biological Networks into Highly Connected Clusters with Maximum Edge Coverage.",
            "Measure the Semantic Similarity of GO Terms Using Aggregate Information Content.",
            "Effect of Incomplete Lineage SortingOn Tree-Reconciliation-Based Inferenceof Gene Duplication.",
            "Detecting Protein Complexes Basedon Uncertain Graph Model.",
            "Guest Editorial: Pattern Recognition in Bioinformatics.",
            "Fast Entropic Profiler: An InformationTheoretic Approach for the Discovery ofPatterns in Genomes.",
            "A Segmentation-Based Method to Extract Structural and Evolutionary Features for Protein Fold Recognition.",
            "Outlier Analysis and Top Scoring Pairfor Integrated Data Analysisand Biomarker Discovery.",
            "Mining Gene Expression Data Focusing Cancer Therapeutics: A Digest.",
            "Aligning and Clustering Patterns to Reveal the Protein Functionality of Sequences.",
            "Improving the Robustness of Local Network Alignment: Design and Extensive Assessmentof a Markov Clustering-Based Approach.",
            "Ligand-K* Sequence Elimination: A NovelAlgorithm for Ensemble-Based Redesignof Receptor-Ligand Binding.",
            "Protein Function Prediction withIncomplete Annotations.",
            "Spatial Quantification of Cytosolic Ca2+ Accumulation in Nonexcitable Cells: An Analytical Study.",
            "Bio-Driven Cell Region Detection in Human Embryonic Stem Cell Assay.",
            "Reviewer Appreciation Editorial.",
            "Guest editorial for the 12th Asia Pacific Bioinformatics Conference.",
            "From Function to Interaction: A New Paradigm for Accurately Predicting Protein Complexes Based on Protein-to-Protein Interaction Networks.",
            "Beyond Fixed-Resolution Alignment-Free Measures for Mammalian Enhancers Sequence Comparison.",
            "A Novel Wavelet-Based Approach for Predicting Nucleosome Positions Using DNAS tructural Information.",
            "SeeSite: Characterizing Relationships between Splice Junctions and Splicing Enhancers.",
            "An Improved Ensemble Learning Methodfor Classifying High-Dimensionaland Imbalanced Biomedicine Data.",
            "Probabilistic Reconstruction of Ancestral Gene Orders with Insertions and Deletions.",
            "Maximum Likelihood Estimation ofGEVD: Applications in Bioinformatics.",
            "A Simple but Powerful Heuristic Methodfor Accelerating $k$ -Means Clusteringof Large-Scale Data in Life Science.",
            "A High-Throughput Zebrafish ScreeningMethod for Visual Mutants by Light-Induced Locomotor Response.",
            "A Novel Synthesizing Genetic Logic Circuit: Frequency Multiplier.",
            "Automatic Myonuclear Detection in IsolatedSingle Muscle Fibers Using Robust EllipseFitting and Sparse Representation.",
            "Double Selection Based Semi-Supervised Clustering Ensemble for Tumor Clustering from Gene Expression Profiles.",
            "Noise Resistant Generalized Parametric Validity Index of Clustering for Gene Expression Data.",
            "Predicting Protein Relationshipsto Human Pathways througha Relational Learning ApproachBased on Simple Sequence Features.",
            "Biomarker Signature Discovery from Mass Spectrometry Data.",
            "Guest Editorial for Special Section on BIOKDD2013.",
            "Network-Based Drug-Target Interaction Prediction with Probabilistic Soft Logic.",
            "Reliable Radiation Hybrid Maps: An Efficient Scalable Clustering-Based Approach.",
            "LateBiclustering: Efficient Heuristic Algorithm for Time-Lagged Bicluster Identification.",
            "Discovery of Spatially Cohesive Itemsets in Three-Dimensional Protein Structures.",
            "A Genomic Analysis Pipeline and Its Application to Pediatric Cancers.",
            "Accelerating the Next Generation Long Read Mapping with the FPGA-Based System.",
            "acc-Motif: Accelerated Network Motif Detection.",
            "Building Specific Signals from Frequency Chaos Game and Revealing Periodicities Using a Smoothed Fourier Analysis.",
            "Extended Graph-Based Models for Enhanced Similarity Search in Cavbase.",
            "Genome-Wide Protein Function Prediction through Multi-Instance Multi-Label Learning.",
            "iNJclust: Iterative Neighbor-Joining Tree Clustering Framework for Inferring Population Structure.",
            "Mining Conditional Phosphorylation Motifs.",
            "Perfect Phylogeny Problems with Missing Values.",
            "Similarity Measures for Comparing Biclusterings.",
            "Study of the Paired Change Points in Bacterial Genes.",
            "Synchronization of Boolean Networks with Different Update Schemes.",
            "RNA-Seq Analysis Pipeline Based on Oshell Environment.",
            "Selected Articles from the 2012 IEEE International Workshop on Genomic Signal Processing and Statistics (GENSIPS 2012).",
            "Latent Feature Decompositions for Integrative Analysis of Multi-Platform Genomic Data.",
            "An Integrated Approach to Anti-Cancer Drug Sensitivity Prediction.",
            "Integration of Network Biology and Imaging to Study Cancer Phenotypes and Responses.",
            "Logistic Principal Component Analysis for Rare Variants in Gene-Environment Interaction Analysis.",
            "Network-Based Methods to Identify Highly Discriminating Subsets of Biomarkers.",
            "BM-SNP: A Bayesian Model for SNP Calling Using High Throughput Sequencing Data.",
            "Unfold High-Dimensional Clouds for Exhaustive Gating of Flow Cytometry Data.",
            "A Basic Protein Comparative Three-Dimensional Modeling Methodological Workflow Theory and Practice.",
            "A Parameter Estimation Method for Biological Systems modelled by ODE/DDE Models Using Spline Approximation and Differential Evolution Algorithm.",
            "An Efficient and Very Accurate Method for Calculating Steady-State Sensitivities in Metabolic Reaction Systems.",
            "Classifying Protein Sequences Using Regularized Multi-Task Learning.",
            "Computing Elementary Flux Modes Involving a Set of Target Reactions.",
            "Detection of Replication Origin Sites in Herpesvirus Genomes by Clustering and Scoring of Palindromes with Quadratic Entropy Measures.",
            "Determining Semantically Related Significant Genes.",
            "GECC: Gene Expression Based Ensemble Classification of Colon Samples.",
            "Gene Selection Using Locality Sensitive Laplacian Score.",
            "Identification of Functionally Related Enzymes by Learning-to-Rank Methods.",
            "Identifying Non-Redundant Gene Markers from Microarray Data: A Multiobjective Variable Length PSO-Based Approach.",
            "Maximizing Protein Translation Rate in the Ribosome Flow Model: The Homogeneous Case.",
            "Molecular Modeling and Evaluation of Novel Dibenzopyrrole Derivatives as Telomerase Inhibitors and Potential Drug for Cancer Therapy.",
            "Nonparametric Tikhonov Regularized NMF and Its Application in Cancer Clustering.",
            "On Representing Protein Folding Patterns Using Non-Linear Parametric Curves.",
            "On the Number of Ranked Species Trees Producing Anomalous Ranked Gene Trees.",
            "Shifting-and-Scaling Correlation Based Biclustering Algorithm.",
            "ILP/SMT-Based Method for Design of Boolean Networks Based on Singleton Attractors.",
            "Improving Detection of Driver Genes: Power-Law Null Model of Copy Number Variation in Cancer.",
            "Organized Modularity in the Interactome: Evidence from the Analysis of Dynamic Organization in the Cell Cycle."
        ]
    },
    {
        "name": "TCBB",
        "year": "2013",
        "info": "Volume 10: 2013",
        "count": 138,
        "papers": [
            "Editorial from the New Editor-in-Chief.",
            "RNA Secondary Structure Prediction Using Soft Computing.",
            "A Simple Fixed Parameter Tractable Algorithm for Computing the Hybridization Number of Two (Not Necessarily Binary) Trees.",
            "DALIX: Optimal DALI Protein Structure Alignment.",
            "Growing Seed Genes from Time Series Data and Thresholded Boolean Networks with Perturbation.",
            "Inference of the Genetic Network Regulating Lateral Root Initiation in Arabidopsis thaliana.",
            "Mathematical Properties of the Deep Coalescence Cost.",
            "Mining Minimal Motif Pair Sets Maximally Covering Interactions in a Protein-Protein Interaction Network.",
            "Multiclass Gene Selection Using Pareto-Fronts.",
            "Parametric Estimation of the Local False Discovery Rate for Identifying Genetic Associations.",
            "Probabilistic Biological Network Alignment.",
            "Rearrangement-Based Phylogeny Using the Single-Cut-or-Join Operation.",
            "SP-Dock: Protein-Protein Docking Using Shape and Physicochemical Complementarity.",
            "SuperQ: Computing Supernetworks from Quartets.",
            "The Depth Problem: Identifying the Most Representative Units in a Data Group.",
            "The Receiver Operational Characteristic for Binary Classification with Multiple Indices and Its Application to the Neuroimaging Study of Alzheimer's Disease.",
            "Using the Maximum Between-Class Variance for Automatic Gridding of cDNA Microarray Images.",
            "An Algorithmic Game-Theory Approach for Coarse-Grain Prediction of RNA 3D Structure.",
            "Genomic Region Operation Kit for Flexible Processing of Deep Sequencing Data.",
            "HapBoost: A Fast Approach to Boosting Haplotype Association Analyses in Genome-Wide Association Studies.",
            "High-Throughput Compression of FASTQ Data with SeqDB.",
            "Identifying Spurious Interactions and Predicting Missing Interactions in the Protein-Protein Interaction Networks via a Generative Network Model.",
            "Improved Algorithms for Matching r-Separated Sets with Applications to Protein Structure Alignment.",
            "Multisample aCGH Data Analysis via Total Variation and Spectral Regularization.",
            "Walks on SPR Neighborhoods.",
            "Guest Editorial: Advanced Algorithms of Bioinformatics.",
            "Chain-RNA: A Comparative ncRNA Search Tool Based on the Two-Dimensional Chain Algorithm.",
            "Rough-Fuzzy Clustering for Grouping Functionally Similar Genes from Microarray Data.",
            "Computational Reconstruction of Transcriptional Relationships from ChIP-Chip Data.",
            "Guest Editors' Introduction to the Special Section on Computational Methods in Systems Biology.",
            "The Propagation Approach for Computing Biochemical Reaction Networks.",
            "Curvature Analysis of Cardiac Excitation Wavefronts.",
            "Multiscale Modeling and Analysis of Planar Cell Polarity in the Drosophila Wing.",
            "A Graph-Theoretical Approach to the Selection of the Minimum Tiling Path from a Physical Map.",
            "Evaluation of Breast Cancer Susceptibility Using Improved Genetic Algorithms to Generate Genotype SNP Barcodes.",
            "FNphasing: A Novel Fast Heuristic Algorithm for Haplotype Phasing Based on Flow Network Model.",
            "GENESHIFT: A Nonparametric Approach for Integrating Microarray Gene Expression Data Based on the Inner Product as a Distance Measure between the Distributions of Genes.",
            "Gene Regulation Networks in Early Phase of Duchenne Muscular Dystrophy.",
            "How Many Clusters: A Validation Index for Arbitrary-Shaped Clusters.",
            "Mining Featured Patterns of MiRNA Interaction Based on Sequence and Structure Similarity.",
            "Mining Quasi-Bicliques from HIV-1-Human Protein Interaction Network: A Multiobjective Biclustering Approach.",
            "Multilabel Learning via Random Label Selection for Protein Subcellular Multilocations Prediction.",
            "Nonnegative Least-Squares Methods for the Classification of High-Dimensional Biological Data.",
            "Normalized Feature Vectors: A Novel Alignment-Free Sequence Comparison Method Based on the Numbers of Adjacent Amino Acids.",
            "On the Increase in Network Robustness and Decrease in Network Response Ability during the Aging Process: A Systems Biology Approach via Microarray Data.",
            "Pareto Optimal Pairwise Sequence Alignment.",
            "Profile-Based LC-MS Data Alignment-A Bayesian Approach.",
            "RANGI: A Fast List-Colored Graph Motif Finding Algorithm.",
            "Reconstruction of Signaling Network from Protein Interactions Based on Function Annotations.",
            "Unrooted Tree Reconciliation: A Unified Approach.",
            "Parameter Estimation of Biological Phenomena: An Unscented Kalman Filter Approach.",
            "A Recent Survey on Colon Cancer Detection Techniques.",
            "Accuracy Guarantees for Phylogeny Reconstruction Algorithms Based on Balanced Minimum Evolution.",
            "Boolean Networks with Multiexpressions and Parameters.",
            "Designing Integrated Computational Biology Pipelines Visually.",
            "Gelsius: A Literature-Based Workflow for Determining Quantitative Associations between Genes and Biological Processes.",
            "Generalized Query-Based Active Learning to Identify Differentially Methylated Regions in DNA.",
            "GenomeTools: A Comprehensive Software Library for Efficient Processing of Structured Genome Annotations.",
            "Inference of Gene Regulatory Networks with Variable Time Delay from Time-Series Microarray Data.",
            "Informative SNPs Selection Based on Two-Locus and Multilocus Linkage Disequilibrium: Criteria of Max-Correlation and Min-Redundancy.",
            "Modeling Associated Protein-DNA Pattern Discovery with Unified Scores.",
            "Multiobjective Identification of Controlling Areas in Neuronal Networks.",
            "On the Neighborhoods of Trees.",
            "Protein Complex Prediction in Large Ontology Attributed Protein-Protein Interaction Networks.",
            "Reformulated Kemeny Optimal Aggregation with Application in Consensus Ranking of microRNA Targets.",
            "Sequence-Based Prediction of microRNA-Binding Residues in Proteins Using Cost-Sensitive Laplacian Support Vector Machines.",
            "Studying the Role of Lipid Rafts on Protein Receptor Bindings with Cellular Automata.",
            "Systematic Analysis of the Mechanisms of Virus-Triggered Type I IFN Signaling Pathways through Mathematical Modeling.",
            "A Genomic Distance for Assembly Comparison Based on Compressed Maximal Exact Matches.",
            "A New Approach to Implement Absorbing Boundary Condition in Biomolecular Electrostatics.",
            "Computer-Aided Biophysical Modeling: A Quantitative Approach to Complex Biological Systems.",
            "Quantitative Prediction of Peptide Binding to HLA-DP1 Protein.",
            "Guest Editorial for Special Section on BSB 2012.",
            "Extending the Algebraic Formalism for Genome Rearrangements to Include Linear Chromosomes.",
            "2D Meets 4G: G-Quadruplexes in RNA Secondary Structure Prediction.",
            "Proximity Measures for Clustering Gene Expression Microarray Data: A Validation Methodology and a Comparative Analysis.",
            "A Closed-Loop Control Scheme for Steering Steady States of Glycolysis and Glycogenolysis Pathway.",
            "A Divide and Conquer Approach for Construction of Large-Scale Signaling Networks from PPI and RNAi Data Using Linear Programming.",
            "A Knowledge-Based Multiple-Sequence Alignment Algorithm.",
            "A Two-Phase Bio-NER System Based on Integrated Classifiers and Multiagent Strategy.",
            "An Improved Approximation Algorithm for Scaffold Filling to Maximize the Common Adjacencies.",
            "An Optimization Rule for In Silico Identification of Targeted Overproduction in Metabolic Pathways.",
            "Algebraic Representation of Asynchronous Multiple-Valued Networks and Its Dynamics.",
            "Algorithms for Genome-Scale Phylogenetics Using Gene Tree Parsimony.",
            "Analytical Solution of Steady-State Equations for Chemical Reaction Networks with Bilinear Rate Laws.",
            "Characterizing the Topology of Probabilistic Biological Networks.",
            "Decomposition of Flux Distributions into Metabolic Pathways.",
            "Designing Template-Free Predictor for Targeting Protein-Ligand Binding Sites with Classifier Ensemble and Spatial Clustering.",
            "GeneOnEarth: Fitting Genetic PC Plots on the Globe.",
            "Identification of DNA-Binding and Protein-Binding Proteins Using Enhanced Graph Wavelet Features.",
            "Pareto Optimality in Organelle Energy Metabolism Analysis.",
            "Protein Function Prediction Using Multilabel Ensemble Classification.",
            "Temporal Logics for Phylogenetic Analysis via Model Checking.",
            "Application of Dempster-Schafer Method in Family-Based Association Studies.",
            "Hamiltonian Walks of Phylogenetic Treespaces.",
            "Hierarchical Clustering of High- Throughput Expression Data Based on General Dependences.",
            "Naïve Bayesian Classifiers with Multinomial Models for rRNA Taxonomic Assignment.",
            "Guest Editorial for ACM BCB.",
            "Nonoverlapping Clone Pooling for High-Throughput Sequencing.",
            "Improved Multiple Sequence Alignments Using Coupled Pattern Mining.",
            "Reverse Engineering Molecular Hypergraphs.",
            "Stochastic Model Simulation Using Kronecker Product Analysis and Zassenhaus Formula Approximation.",
            "Coalescent-Based Method for Learning Parameters of Admixture Events from Large-Scale Genetic Variation Data.",
            "Quantitative Analysis of Live-Cell Growth at the Shoot Apex of Arabidopsis thaliana: Algorithms for Feature Measurement and Temporal Alignment.",
            "Probabilistic Search and Energy Guidance for Biased Decoy Sampling in Ab Initio Protein Structure Prediction.",
            "Expanded Explorations into the Optimization of an Energy Function for Protein Design.",
            "Isolating Influential Regions of Electrostatic Focusing in Protein and DNA Structure.",
            "Biological Sequence Classification with Multivariate String Kernels.",
            "Text Categorization of Biomedical Data Sets Using Graph Kernels and a Controlled Vocabulary.",
            "Chemical Name Extraction Based on Automatic Training Data Generation and Rich Feature Set.",
            "Genome-Guided Transcriptome Assembly in the Age of Next-Generation Sequencing.",
            "An Adaptive Window Length Strategy for Eukaryotic CDS Prediction.",
            "Coalescent Histories for Caterpillar-Like Families.",
            "FRESCO: Referential Compression of Highly Similar Sequences.",
            "Intensity-Based Skeletonization of CryoEM Gray-Scale Images Using a True Segmentation-Free Algorithm.",
            "Operon Prediction Using Chaos Embedded Particle Swarm Optimization.",
            "Explicit Expression for the Steady-State Translation Rate in the Infinite-Dimensional Homogeneous Ribosome Flow Model.",
            "Strategy for Naturelike Designer Transcription Factors with Reduced Toxicity.",
            "Inapproximability of (1, 2)-Exemplar Distance.",
            "A Combinatorial Perspective of the Protein Inference Problem.",
            "Predicting Protein-Ligand Binding Site Using Support Vector Machine with Protein Properties.",
            "An Integer Programming Formulation of the Parsimonious Loss of Heterozygosity Problem.",
            "Wavelet Analysis in Current Cancer Genome Research: A Survey.",
            "A Transcript Perspective on Evolution.",
            "Network-Based Drug Ranking and Repositioning with Respect to DrugBank Therapeutic Categories.",
            "Novel Multisample Scheme for Inferring Phylogenetic Markers from Whole Genome Tumor Profiles.",
            "Probabilistic Model Checking Analysis of Palytoxin Effects on Cell Energy Reactions of the Na+/K+-ATPase.",
            "Efficient Algorithms for Knowledge-Enhanced Supertree and Supermatrix Phylogenetic Problems.",
            "Multivariate Hypergeometric Similarity Measure.",
            "Protein Structure Optimization with a \"Lamarckian\"' Ant Colony Algorithm.",
            "An Exact Algorithm for the Zero Exemplar Breakpoint Distance Problem.",
            "Reconstruction of Transcriptional Regulatory Networks by Stability-Based Network Component Analysis.",
            "Maximum Likelihood Inference of the Evolutionary History of a PPI Network from the Duplication History of Its Proteins.",
            "Protein Chain Pair Simplification under the Discrete Fréchet Distance.",
            "Designing Pooling Systems for Noisy High-Throughput Protein-Protein Interaction Experiments Using Boolean Compressed Sensing.",
            "Guest Editors' introduction to the special section on bioinformatics research and applications.",
            "A Probabilistic Latent Semantic Analysis Model for Coclustering the Mouse Brain Atlas.",
            "EEG/ERP Adaptive Noise Canceller Design with Controlled Search Space (CSS) Approach in Cuckoo and Other Optimization Algorithms."
        ]
    },
    {
        "name": "TCBB",
        "year": "2012",
        "info": "Volume 9: 2012",
        "count": 174,
        "papers": [
            "A Memory Efficient Method for Structure-Based RNA Multiple Alignment.",
            "An Efficient Algorithm for Haplotype Inference on Pedigrees with Recombinations and Mutations.",
            "An Efficient Method for Exploring the Space of Gene Tree/Species Tree Reconciliations in a Probabilistic Framework.",
            "An Efficient Method for Modeling Kinetic Behavior of Channel Proteins in Cardiomyocytes.",
            "An Information Theoretic Approach to Constructing Robust Boolean Gene Regulatory Networks.",
            "Assortative Mixing in Directed Biological Networks.",
            "Composition Vector Method Based on Maximum Entropy Principle for Sequence Comparison.",
            "Disease Liability Prediction from Large Scale Genotyping Data Using Classifiers with a Reject Option.",
            "Drosophila Gene Expression Pattern Annotation through Multi-Instance Multi-Label Learning.",
            "Inferring the Number of Contributors to Mixed DNA Profiles.",
            "Intervention in Gene Regulatory Networks via Phenotypically Constrained Control Policies Based on Long-Run Behavior.",
            "Iterative Dictionary Construction for Compression of Large DNA Data Sets.",
            "Matching Split Distance for Unrooted Binary Phylogenetic Trees.",
            "Memory Efficient Algorithms for Structural Alignment of RNAs with Pseudoknots.",
            "Multiobjective Optimization Based-Approach for Discovering Novel Cancer Therapies.",
            "Parameter Estimation Using Metaheuristics in Systems Biology: A Comprehensive Review.",
            "Predicting Metal-Binding Sites from Protein Sequence.",
            "Reassortment Networks and the Evolution of Pandemic H1N1 Swine-Origin Influenza.",
            "RENNSH: A Novel ά-Helix Identification Approach for Intermediate Resolution Electron Density Maps.",
            "Residues with Similar Hexagon Neighborhoods Share Similar Side-Chain Conformations.",
            "Smolign: A Spatial Motifs-Based Protein Multiple Structural Alignment Method.",
            "Stable Gene Selection from Microarray Data via Sample Weighting.",
            "The Complexity of Finding Multiple Solutions to Betweenness and Quartet Compatibility.",
            "Transactional Database Transformation and Its Application in Prioritizing Human Disease Genes.",
            "k-Information Gain Scaled Nearest Neighbors: A Novel Approach to Classifying Protein-Protein Interaction-Related Documents.",
            "MinePhos: A Literature Mining System for Protein Phoshphorylation Information Extraction.",
            "A Hybrid EKF and Switching PSO Algorithm for Joint State and Parameter Estimation of Lateral Flow Immunoassay Models.",
            "A New Efficient Algorithm for the Gene-Team Problem on General Sequences.",
            "A New Efficient Data Structure for Storage and Retrieval of Multiple Biosequences.",
            "A Swarm Intelligence Framework for Reconstructing Gene Networks: Searching for Biologically Plausible Architectures.",
            "Algorithms for Reticulate Networks of Multiple Phylogenetic Trees.",
            "Antilope - A Lagrangian Relaxation Approach to the de novo Peptide Sequencing Problem.",
            "Constructing and Drawing Regular Planar Split Networks.",
            "DICLENS: Divisive Clustering Ensemble with Automatic Cluster Number.",
            "Efficient Maximal Repeat Finding Using the Burrows-Wheeler Transform and Wavelet Tree.",
            "Eigen-Genomic System Dynamic-Pattern Analysis (ESDA): Modeling mRNA Degradation and Self-Regulation.",
            "GSGS: A Computational Approach to Reconstruct Signaling Pathway Structures from Gene Sets.",
            "Identification of Differentially Expressed Genes for Time-Course Microarray Data Based on Modified RM ANOVA.",
            "Identifying Bacterial Virulent Proteins by Fusing a Set of Classifiers Based on Variants of Chou's Pseudo Amino Acid Composition and on Evolutionary Information.",
            "Molecular Dynamics Trajectory Compression with a Coarse-Grained Model.",
            "Multiscale Binarization of Gene Expression Data for Reconstructing Boolean Networks.",
            "Mutation Region Detection for Closely Related Individuals without a Known Pedigree.",
            "On Complexity of Protein Structure Alignment Problem under Distance Constraint.",
            "On the Elusiveness of Clusters.",
            "Optimizing Phylogenetic Networks for Circular Split Systems.",
            "Output-Sensitive Algorithms for Finding the Nested Common Intervals of Two General Sequences.",
            "Parallelized Evolutionary Learning for Detection of Biclusters in Gene Expression Data.",
            "Quantum Gate Circuit Model of Signal Integration in Bacterial Quorum Sensing.",
            "Robust Classification Method of Tumor Subtype by Using Correlation Filters.",
            "SimBioNeT: A Simulator of Biological Network Topology.",
            "Structural SCOP Superfamily Level Classification Using Unsupervised Machine Learning.",
            "Subcellular Localization Prediction through Boosting Association Rules.",
            "The Impact of Normalization and Phylogenetic Information on Estimating the Distance for Metagenomes.",
            "The LASSO and Sparse Least Squares Regression Methods for SNP Selection in Predicting Quantitative Traits.",
            "High Performance Computational Systems Biology.",
            "Constructing Complex 3D Biological Environments from Medical Imaging Using High Performance Computing.",
            "Smoldyn on Graphics Processing Units: Massively Parallel Brownian Dynamics Simulations.",
            "Reverse Engineering and Analysis of Genome-Wide Gene Regulatory Networks from Gene Expression Profiles Using High-Performance Computing.",
            "Fast Parallel Markov Clustering in Bioinformatics Using Massively Parallel Computing on GPU with CUDA and ELLPACK-R Sparse Format.",
            "On Parameter Synthesis by Parallel Model Checking.",
            "A Biologically Inspired Validity Measure for Comparison of Clustering Methods over Metabolic Data Sets.",
            "A Coclustering Approach for Mining Large Protein-Protein Interaction Networks.",
            "A Comparative Study on Filtering Protein Secondary Structure Prediction.",
            "A Framework for Incorporating Functional Interrelationships into Protein Function Prediction Algorithms.",
            "A Top-r Feature Selection Algorithm for Microarray Gene Expression Data.",
            "Clustering 100, 000 Protein Structure Decoys in Minutes.",
            "Designing Filters for Fast-Known NcRNA Identification.",
            "Empirical Evidence of the Applicability of Functional Clustering through Gene Expression Classification.",
            "Exploiting Intrastructure Information for Secondary Structure Prediction with Multifaceted Pipelines.",
            "Faster Mass Spectrometry-Based Protein Inference: Junction Trees Are More Efficient than Sampling and Marginalization by Enumeration.",
            "Gene Classification Using Parameter-Free Semi-Supervised Manifold Learning.",
            "Markov Invariants for Phylogenetic Rate Matrices Derived from Embedded Submodels.",
            "Mutagenic Primer Design for Mismatch PCR-RFLP SNP Genotyping Using a Genetic Algorithm.",
            "On the Application of Active Learning and Gaussian Processes in Postcryopreservation Cell Membrane Integrity Experiments.",
            "Protein Complexes Discovery Based on Protein-Protein Interaction Data via a Regularized Sparse Generative Network Model.",
            "Quantifying Dynamic Stability of Genetic Memory Circuits.",
            "Quantitative Analysis of the Self-Assembly Strategies of Intermediate Filaments from Tetrameric Vimentin.",
            "The GA and the GWAS: Using Genetic Algorithms to Search for Multilocus Associations.",
            "The Relevance of Topology in Parallel Simulation of Biological Networks.",
            "Weighted Markov Chain Based Aggregation of Biomolecule Orderings.",
            "Mutual Information Optimization for Mass Spectra Data Alignment.",
            "Comment on \"SCS: Signal, Context, and Structure Features for Genome-Wide Human Promoter Recognition\".",
            "Guest Editorial: Bioinformatics and Computational Systems Biology.",
            "A Sparse Regulatory Network of Copy-Number Driven Gene Expression Reveals Putative Breast Cancer Oncogenes.",
            "Inference of Biological S-System Using the Separable Estimation Method and the Genetic Algorithm.",
            "Identifying Gene Pathways Associated with Cancer Characteristics via Sparse Statistical Methods.",
            "Stochastic Gene Expression Modeling with Hill Function for Switch-Like Gene Responses.",
            "Exploiting the Functional and Taxonomic Structure of Genomic Data by Probabilistic Topic Modeling.",
            "Predicting Ligand Binding Residues and Functional Sites Using Multipositional Correlations with Graph Theoretic Clustering and Kernel CCA.",
            "Guest Editors' Introduction to the Special Section on Bioinformatics Research and Applications.",
            "Fast Local Search for Unrooted Robinson-Foulds Supertrees.",
            "A Metric for Phylogenetic Trees Based on Matching.",
            "The Kernel of Maximum Agreement Subtrees.",
            "Refining Regulatory Networks through Phylogenetic Transfer of Information.",
            "Algorithms to Detect Multiprotein Modularity Conserved during Evolution.",
            "Predicting Protein Function by Multi-Label Correlated Semi-Supervised Learning.",
            "Identification of Essential Proteins Based on Edge Clustering Coefficient.",
            "A Computational Model for Predicting Protein Interactions Based on Multidomain Collaboration.",
            "A Hybrid Approach to Survival Model Building Using Integration of Clinical and Molecular Information in Censored Data.",
            "A Survey on Filter Techniques for Feature Selection in Gene Expression Microarray Analysis.",
            "BpMatch: An Efficient Algorithm for a Segmental Analysis of Genomic Sequences.",
            "CSD Homomorphisms between Phylogenetic Networks.",
            "De Novo Design of Potential RecA Inhibitors Using MultiObjective Optimization.",
            "Detection of Outlier Residues for Improving Interface Prediction in Protein Heterocomplexes.",
            "Efficient Approaches for Retrieving Protein Tertiary Structures.",
            "Efficient Genotype Elimination via Adaptive Allele Consolidation.",
            "Hash Subgraph Pairwise Kernel for Protein-Protein Interaction Extraction.",
            "Inferring Gene Regulatory Networks via Nonlinear State-Space Models and Exploiting Sparsity.",
            "Peptide Reranking with Protein-Peptide Correspondence and Precursor Peak Intensity Information.",
            "Scaffold Filling under the Breakpoint and Related Distances.",
            "Transient Dynamics of Reduced-Order Models of Genetic Regulatory Networks.",
            "Using GPUs for the Exact Alignment of Short-Read Genetic Sequences by Means of the Burrows-Wheeler Transform.",
            "A New Unsupervised Feature Ranking Method for Gene Expression Data Based on Consensus Affinity.",
            "Guest Editorial: Application and Development of Bioinformatics.",
            "QuickVina: Accelerating AutoDock Vina Using Gradient-Based Heuristics for Global Optimization.",
            "Improving X!Tandem on Peptide Identification from Mass Spectrometry by Self-Boosted Percolator.",
            "CEDER: Accurate Detection of Differentially Expressed Genes by Combining Significance of Exons Using RNA-Seq.",
            "How Little Do We Actually Know? On the Size of Gene Regulatory Networks.",
            "A Comparative Assessment of Ranking Accuracies of Conventional and Machine-Learning-Based Scoring Functions for Protein-Ligand Binding Affinity Prediction.",
            "Guest Editors' Introduction to the Special Section on Computational Methods in Systems Biology.",
            "Evaluation of Design Strategies for Time Course Experiments in Genetic Networks: Case Study of the XlnR Regulon in Aspergillus niger.",
            "The Phosphorylation of the Heat Shock Factor as a Modulator for the Heat Shock Response.",
            "Time Series Dependent Analysis of Unparametrized Thomas Networks.",
            "A Hybrid Factored Frontier Algorithm for Dynamic Bayesian Networks with a Biopathways Application.",
            "Multilevel Computational Modeling and Quantitative Analysis of Bone Remodeling.",
            "A New Measure of Classifier Performance for Gene Expression Data.",
            "An Evolutionary Algorithm Approach for Feature Generation from Sequence Data and Its Application to DNA Splice Site Prediction.",
            "Detecting Phenotype-Specific Interactions between Biological Processes from Microarray Data and Annotations.",
            "Finding a Periodic Attractor of a Boolean Network.",
            "Gene Selection Using Iterative Feature Elimination Random Forests for Survival Outcomes.",
            "Hierarchical Motif Vectors for Prediction of Functional Sites in Amino Acid Sequences Using Quasi-Supervised Learning.",
            "Improving the Prediction of Clinical Outcomes from Genomic Data Using Multiresolution Analysis.",
            "LNA: Fast Protein Structural Comparison Using a Laplacian Characterization of Tertiary Structure.",
            "MORE: Mixed Optimization for Reverse Engineering - An Application to Modeling Biological Networks Response via Sparse Systems of Nonlinear Differential Equations.",
            "Noniterative Convex Optimization Methods for Network Component Analysis.",
            "Qualitative Reasoning for Biological Network Inference from Systematic Perturbation Experiments.",
            "Reduced False Positives in PDZ Binding Prediction Using Sequence and Structural Descriptors.",
            "Robust Bayesian Clustering for Replicated Gene Expression Data.",
            "Simultaneous Identification of Duplications, Losses, and Lateral Gene Transfers.",
            "A Novel Method to Select Informative SNPs and Their Application in Genetic Association Studies.",
            "ClassAMP: A Prediction Tool for Classification of Antimicrobial Peptides.",
            "Multiscale Denoising of Biological Data: A Comparative Analysis.",
            "Stability Analysis of the Ribosome Flow Model.",
            "EIC Editorial.",
            "A Characterization of the Set of Species Trees that Produce Anomalous Ranked Gene Trees.",
            "A Constrained Evolutionary Computation Method for Detecting Controlling Regions of Cortical Networks.",
            "A Fast and Practical Approach to Genotype Phasing and Imputation on a Pedigree with Erroneous and Incomplete Information.",
            "A Hybrid Cellular Automaton Model of Solid Tumor Growth and Bioreductive Drug Transport.",
            "A Mathematical Model to Study the Dynamics of Epithelial Cellular Networks.",
            "A Tabu Search Approach for the NMR Protein Structure-Based Assignment Problem.",
            "An Efficient Alignment Algorithm for Searching Simple Pseudoknots over Long Genomic Sequence.",
            "Automatic Identification and Classification of Noun Argument Structures in Biomedical Literature.",
            "Biomarker Identification and Cancer Classification Based on Microarray Data Using Laplace Naive Bayes Model with Mean Shrinkage.",
            "Design and Analysis of Classifier Learning Experiments in Bioinformatics: Survey and Case Studies.",
            "Distinguishing Endogenous Retroviral LTRs from SINE Elements Using Features Extracted from Evolved Side Effect Machines.",
            "Improving Protein-Protein Interaction Pair Ranking with an Integrated Global Association Score.",
            "Large-Scale Signaling Network Reconstruction.",
            "Multiparameter Spectral Representation of Noise-Induced Competence in Bacillus Subtilis.",
            "On the Steady-State Distribution in the Homogeneous Ribosome Flow Model.",
            "Probabilistic Arithmetic Automata and Their Applications.",
            "SC³: Triple Spectral Clustering-Based Consensus Clustering Framework for Class Discovery from Cancer Gene Expression Profiles.",
            "Sequence-Based Prediction of DNA-Binding Residues in Proteins with Conservation and Correlation Information.",
            "Symmetry Compression Method for Discovering Network Motifs.",
            "Top-k Similar Graph Matching Using TraM in Biological Networks.",
            "uAnalyze: Web-Based High-Resolution DNA Melting Analysis with Comparison to Thermodynamic Predictions.",
            "A Fast Ranking Algorithm for Predicting Gene Functions in Biomolecular Networks.",
            "Fuzzy Intervention in Biological Phenomena.",
            "In Silico Search of DNA Drugs Targeting Oncogenes.",
            "Investigating Topic Models' Capabilities in Expression Microarray Data Classification.",
            "KungFQ: A Simple and Powerful Approach to Compress fastq Files.",
            "On the Hardness of Counting and Sampling Center Strings.",
            "\"Pull Moves\" for Rectangular Lattice Polymer Models Are Not Fully Reversible.",
            "A Simpler and More Accurate AUTO-HDS Framework for Clustering and Visualization of Biological Data.",
            "Erratum to \"QuickVina: Accelerating AutoDock Vina Using Gradient-Based Heuristics for Global Optimization\"."
        ]
    },
    {
        "name": "TCBB",
        "year": "2011",
        "info": "Volume 8: 2011",
        "count": 154,
        "papers": [
            "EIC Editorial.",
            "A Fast Algorithm for Computing Geodesic Distances in Tree Space.",
            "A General Framework for Analyzing Data from Two Short Time-Series Microarray Experiments.",
            "Efficient Formulations for Exact Stochastic Simulation of Chemical Systems.",
            "Estimating Haplotype Frequencies by Combining Data from Large DNA Pools with Database Information.",
            "F2Dock: Fast Fourier Protein-Protein Docking.",
            "Fast Surface-Based Travel Depth Estimation Algorithm for Macromolecule Surface Shape Description.",
            "Finding Significant Matches of Position Weight Matrices in Linear Time.",
            "Fuzzy ARTMAP Prediction of Biological Activities for Potential HIV-1 Protease Inhibitors Using a Small Molecular Data Set.",
            "Genetic Networks and Soft Computing.",
            "Identification and Modeling of Genes with Diurnal Oscillations from Microarray Time Series Data.",
            "Improving the Computational Efficiency of Recursive Cluster Elimination for Gene Selection.",
            "Influence of Prior Knowledge in Constraint-Based Learning of Gene Regulatory Networks.",
            "Information-Theoretic Model of Evolution over Protein Communication Channel.",
            "Learning Genetic Regulatory Network Connectivity from Time Series Data.",
            "Model Reduction Using Piecewise-Linear Approximations Preserves Dynamic Properties of the Carbon Starvation Response in Escherichia coli.",
            "New Methods for Inference of Local Tree Topologies with Recombinant SNP Sequences in Populations.",
            "Pairwise Statistical Significance of Local Sequence Alignment Using Sequence-Specific and Position-Specific Substitution Matrices.",
            "Predicting Metabolic Fluxes Using Gene Expression Differences As Constraints.",
            "Probabilistic Analysis of Probe Reliability in Differential Gene Expression Studies with Short Oligonucleotide Arrays.",
            "Topology Improves Phylogenetic Motif Functional Site Predictions.",
            "Twin Removal in Genetic Algorithms for Protein Structure Prediction Using Low-Resolution Model.",
            "A Weighted Principal Component Analysis and Its Application to Gene Expression Data.",
            "Disturbance Analysis of Nonlinear Differential Equation Models of Genetic SUM Regulatory Networks.",
            "Linear-Time Algorithms for the Multiple Gene Duplication Problems.",
            "Recursive Mahalanobis Separability Measure for Gene Subset Selection.",
            "Semi-Markov Models for Brownian Dynamics Permeation in Biological Ion Channels.",
            "EIC Editorial.",
            "Guest Editorial: Special Focus on Bioinformatics and Systems Biology.",
            "A Framework for Semisupervised Feature Generation and Its Applications in Biomedical Literature Mining.",
            "On Position-Specific Scoring Matrix for Protein Function Prediction.",
            "Ensemble Learning with Active Example Selection for Imbalanced Biomedical Data Classification.",
            "Using Qualitative Probability in Reverse-Engineering Gene Regulatory Networks.",
            "A Continuous-Time, Discrete-State Method for Simulating the Dynamics of Biochemical Systems.",
            "A Genetic Optimization Approach for Isolating Translational Efficiency Bias.",
            "A Markov-Blanket-Based Model for Gene Regulatory Network Inference.",
            "A Partial Set Covering Model for Protein Mixture Identification Using Mass Spectrometry Data.",
            "Accurate Construction of Consensus Genetic Maps via Integer Linear Programming.",
            "Bayesian Models and Algorithms for Protein β-Sheet Prediction.",
            "Comparison of Galled Trees.",
            "Data Mining on DNA Sequences of Hepatitis B Virus.",
            "Discriminative Motif Finding for Predicting Protein Subcellular Localization.",
            "ICGA-PSO-ELM Approach for Accurate Multiclass Cancer Classification Resulting in Reduced Gene Sets in Which Genes Encoding Secreted Proteins Are Highly Represented.",
            "Microarray Time Course Experiments: Finding Profiles.",
            "Novel Nonlinear Knowledge-Based Mean Force Potentials Based on Machine Learning.",
            "On the Characterization and Selection of Diverse Conformational Ensembles with Applications to Flexible Docking.",
            "Semantics and Ambiguity of Stochastic RNA Family Models.",
            "Simultaneous Identification of Duplications and Lateral Gene Transfers.",
            "Visual Exploration across Biomedical Databases.",
            "An Approximation Algorithm for the Noah's Ark Problem with Random Feature Loss.",
            "Encoding Molecular Motions in Voxel Maps.",
            "Graph Comparison by Log-Odds Score Matrices with Application to Protein Topology Analysis.",
            "Inferring Contagion in Regulatory Networks.",
            "A cDNA Microarray Gene Expression Data Classifier for Clinical Diagnostics Based on Graph Theory.",
            "A Comprehensive Statistical Model for Cell Signaling.",
            "A Fast Hierarchical Clustering Algorithm for Functional Modules Discovery in Protein Interaction Networks.",
            "A Max-Flow-Based Approach to the Identification of Protein Complexes Using Protein Interaction and Microarray Data.",
            "A Practical Algorithm for Reconstructing Level-1 Phylogenetic Networks.",
            "A Theoretical Analysis of the Prodrug Delivery System for Treating Antibiotic-Resistant Bacteria.",
            "Cancer Classification from Gene Expression Data by NPPC Ensemble.",
            "Component-Based Modeling and Reachability Analysis of Genetic Networks.",
            "Estimating Genome-Wide Gene Networks Using Nonparametric Bayesian Network Models on Massively Parallel Computers.",
            "FEAST: Sensitive Local Alignment with Multiple Rates of Evolution.",
            "Identifiability of Two-Tree Mixtures for Group-Based Models.",
            "Incorporating Nonlinear Relationships in Microarray Missing Value Imputation.",
            "Manipulating the Steady State of Metabolic Pathways.",
            "Multitask Learning for Protein Subcellular Location Prediction.",
            "Peakbin Selection in Mass Spectrometry Data Using a Consensus Approach with Estimation of Distribution Algorithms.",
            "Prediction of Protein Functions with Gene Ontology and Interspecies Protein Homology Data.",
            "Regular Networks Can be Uniquely Constructed from Their Trees.",
            "3D Shape Reconstruction of Loop Objects in X-Ray Protein Crystallography.",
            "TCLUST: A Fast Method for Clustering Genome-Scale Expression Data.",
            "TRIAL: A Tool for Finding Distant Structural Similarities.",
            "True Path Rule Hierarchical Ensembles for Genome-Wide Gene Function Prediction.",
            "A Note on the Fixed Parameter Tractability of the Gene-Duplication Problem.",
            "Identifying Relevant Data for a Biological Database: Handcrafted Rules versus Machine Learning.",
            "Toward Better Understanding of Protein Secondary Structure: Extracting Prediction Rules.",
            "Guest Editors' Introduction to the Special Section on Bioinformatics Research and Applications.",
            "A Spectral Approach to Protein Structure Alignment.",
            "Asymmetric Comparison and Querying of Biological Networks.",
            "The Plexus Model for the Inference of Ancestral Multidomain Proteins.",
            "Uncovering Hidden Phylogenetic Consensus in Large Data Sets.",
            "Extensions and Improvements to the Chordal Graph Approach to the Multistate Perfect Phylogeny Problem.",
            "A Consensus Tree Approach for Reconstructing Human Evolutionary History and Detecting Population Substructure.",
            "A Biologically Inspired Measure for Coexpression Analysis.",
            "A Survey on Methods for Modeling and Analyzing Integrated Biological Networks.",
            "An Improved Heuristic Algorithm for Finding Motif Signals in DNA Sequences.",
            "Determination of Glycan Structure from Tandem Mass Spectra.",
            "EvoMD: An Algorithm for Evolutionary Molecular Design.",
            "Image-Based Surface Matching Algorithm Oriented to Structural Biology.",
            "Is There an Optimal Substitution Matrix for Contact Prediction with Correlated Mutations?",
            "Metrics on Multilabeled Trees: Interrelationships and Diameter Bounds.",
            "Multiclass Kernel-Imbedded Gaussian Processes for Microarray Data Analysis.",
            "Peak Tree: A New Tool for Multiscale Hierarchical Representation and Peak Detection of Mass Spectrometry Data.",
            "Predicting MHC-II Binding Affinity Using Multiple Instance Regression.",
            "Robust Feature Selection for Microarray Data Based on Multicriterion Fusion.",
            "Searching for Coexpressed Genes in Three-Color cDNA Microarray Data Using a Probabilistic Model-Based Hough Transform.",
            "The Impact of Multiple Protein Sequence Alignment on Phylogenetic Estimation.",
            "Toward a Robust Search Method for the Protein-Drug Docking Problem.",
            "Accurate Reconstruction for DNA Sequencing by Hybridization Based on a Constructive Heuristic.",
            "Computing a Smallest Multilabeled Phylogenetic Tree from Rooted Triplets.",
            "Two-Step Cross-Entropy Feature Selection for Microarrays - Power Through Complementarity.",
            "A Generalized Multivariate Approach to Pattern Discovery from Replicated and Incomplete Genome-Wide Measurements.",
            "A Novel Knowledge-Driven Systems Biology Approach for Phenotype Prediction upon Genetic Intervention.",
            "A Preprocessing Procedure for Haplotype Inference by Pure Parsimony.",
            "An Efficient Algorithm for Approximating Geodesic Distances in Tree Space.",
            "Continuous Cotemporal Probabilistic Modeling of Systems Biology Networks from Sparse Data.",
            "Designing Logical Rules to Model the Response of Biomolecular Networks with Complex Interactions: An Application to Cancer Modeling.",
            "Efficient Localization of Hot Spots in Proteins Using a Novel S-Transform Based Filtering Approach.",
            "Fast Flexible Modeling of RNA Structure Using Internal Coordinates.",
            "Improved Algorithms for Finding Gene Teams and Constructing Gene Team Trees.",
            "Metasample-Based Sparse Representation for Tumor Classification.",
            "Multiple Sequence Assembly from Reads Alignable to a Common Reference Genome.",
            "Parameterized Algorithmics for Finding Connected Motifs in Biological Networks.",
            "Probabilistic Models for Semisupervised Discriminative Motif Discovery in DNA Sequences.",
            "SCJ: A Breakpoint-Like Distance that Simplifies Several Rearrangement Problems.",
            "SEGA: Semiglobal Graph Alignment for Structure-Based Protein Comparison.",
            "SLIDER: A Generic Metaheuristic for the Discovery of Correlated Motifs in Protein-Protein Interaction Networks.",
            "Some Mathematical Refinements Concerning Error Minimization in the Genetic Code.",
            "Using Kernel Alignment to Select Features of Molecular Descriptors in a QSAR Study.",
            "A Mathematical Model for the Validation of Gene Selection Methods.",
            "A SAT-Based Algorithm for Finding Attractors in Synchronous Boolean Networks.",
            "Fast Exact Algorithms for the Closest String and Substring Problems with Application to the Planted (L, d)-Motif Model.",
            "On the Distribution of the Number of Cycles in the Breakpoint Graph of a Random Signed Permutation.",
            "Probabilistic Mixture Regression Models for Alignment of LC-MS Data.",
            "Summarizing Probe Intensities of Affymetrix GeneChip 3' Expression Arrays Taking into Account Day-to-Day Variability.",
            "The Quality Preserving Database: A Computational Framework for Encouraging Collaboration, Enhancing Power and Controlling False Discovery.",
            "A Shape Descriptor for Fast Complementarity Matching in Molecular Docking.",
            "An Algebraic Spline Model of Molecular Surfaces for Energetic Computations.",
            "Analysis of the Free Energy in a Stochastic RNA Secondary Structure Model.",
            "Antibody-Specified B-Cell Epitope Prediction in Line with the Principle of Context-Awareness.",
            "Classification of GPCRs Using Family Specific Motifs.",
            "Contour Extraction of Drosophila Embryos.",
            "Fast Kernel Discriminant Analysis for Classification of Liver Cancer Mass Spectra.",
            "Function Annotation for Pseudoknot Using Structure Similarity.",
            "High Performance Hybrid Functional Petri Net Simulations of Biological Pathway Models on CUDA.",
            "Hilbert-Huang Transform for Analysis of Heart Rate Variability in Cardiac Health.",
            "Integrated Analysis of Gene Expression and Copy Number Data on Gene Shaving Using Independent Component Analysis.",
            "Methods for Identifying SNP Interactions: A Review on Variations of Logic Regression, Random Forest and Bayesian Logistic Regression.",
            "Molecular Pattern Discovery Based on Penalized Matrix Decomposition.",
            "Nonparametric Clustering for Studying RNA Conformations.",
            "On Lattice Protein Structure Prediction Revisited.",
            "Recipe for Uncovering Predictive Genes Using Support Vector Machines Based on Model Population Analysis.",
            "Selecting Oligonucleotide Probes for Whole-Genome Tiling Arrays with a Cross-Hybridization Potential.",
            "Superposition and Alignment of Labeled Point Clouds.",
            "Co-evolution Is Incompatible with the Markov Assumption in Phylogenetics.",
            "Combined Feature Selection and Cancer Prognosis Using Support Vector Machine Regression.",
            "CUDA-BLASTP: Accelerating BLASTP on CUDA-Enabled Graphics Hardware.",
            "From Gene Trees to Species Trees II: Species Tree Inference by Minimizing Deep Coalescence Events.",
            "Haplotype Inference Constrained by Plausible Haplotype Data.",
            "Identification of Relevant Properties for Epitopes Detection Using a Regression Model.",
            "Improving a Consensus Approach for Protein Structure Selection by Removing Redundancy.",
            "Optimizing a Widely Used Protein Structure Alignment Measure in Expected Polynomial Time.",
            "Protein Classification with Extended-Sequence Coding by Sliding Window."
        ]
    },
    {
        "name": "TCBB",
        "year": "2010",
        "info": "Volume 7: 2010",
        "count": 72,
        "papers": [
            "Automatic Detection of Large Dense-Core Vesicles in Secretory Cells and Statistical Analysis of Their Intracellular Distribution.",
            "BioExtract Server - An Integrated Workflow-Enabling System to Access and Analyze Heterogeneous, Distributed Biomolecular Data.",
            "Feature Selection for Gene Expression Using Model-Based Entropy.",
            "Heuristic Bayesian Segmentation for Discovery of Coexpressed Genes within Genomic Regions.",
            "Data-Fusion in Clustering Microarray Data: Balancing Discovery and Interpretability.",
            "Integrating Data Clustering and Visualization for the Analysis of 3D Gene Expression Data.",
            "Multidimensional Profiling of Cell Surface Proteins and Nuclear Markers.",
            "Predicting Novel Human Gene Ontology Annotations Using Semantic Analysis.",
            "Sparse Support Vector Machines with L_{p} Penalty for Biomarker Identification.",
            "A Multiple-Filter-Multiple-Wrapper Approach to Gene Selection and Microarray Data Classification.",
            "A Trade-Off between Sample Complexity and Computational Complexity in Learning Boolean Networks from Time-Series Data.",
            "Efficient Peak-Labeling Algorithms for Whole-Sample Mass Spectrometry Proteomics.",
            "Exploratory Consensus of Hierarchical Clusterings for Melanoma and Breast Cancer.",
            "Identification of Regulatory Modules in Time Series Gene Expression Data Using a Linear Time Biclustering Algorithm.",
            "Incomplete Lineage Sorting: Consistent Phylogeny Estimation from Multiple Loci.",
            "On the Importance of Comprehensible Classification Models for Protein Function Prediction.",
            "Approximate Maximum Parsimony and Ancestral Maximum Likelihood.",
            "EIC Editorial.",
            "Data Mining in Bioinformatics: Selected Papers from BIOKDD.",
            "GPD: A Graph Pattern Diffusion Kernel for Accurate Graph Classification with Applications in Cheminformatics.",
            "Molecular Function Prediction Using Neighborhood Features.",
            "A Metric on the Space of Reduced Phylogenetic Networks.",
            "Automated Hierarchical Density Shaving: A Robust Automated Clustering and Visualization Framework for Large Biological Data Sets.",
            "Automated Isolation of Translational Efficiency Bias That Resists the Confounding Effect of GC(AT)-Content.",
            "Gene Association Networks from Microarray Data Using a Regularized Estimation of Partial Correlation Based on PLS Regression.",
            "Identification of Full and Partial Class Relevant Genes.",
            "Model Composition for Macromolecular Regulatory Networks.",
            "Reassortment Networks for Investigating the Evolution of Segmented Viruses.",
            "Signal Quality Measurements for cDNA Microarray Data.",
            "Alignments of RNA Structures.",
            "Approximation Algorithms for Predicting RNA Secondary Structures with Arbitrary Pseudoknots.",
            "Fast Hinge Detection Algorithms for Flexible Protein Structures.",
            "Fixed-Parameter Tractability of the Maximum Agreement Supertree Problem.",
            "Modeling Protein Interacting Groups by Quasi-Bicliques: Complexity, Algorithm, and Application.",
            "Sorting Genomes by Reciprocal Translocations, Insertions, and Deletions.",
            "Linear Separability of Gene Expression Data Sets.",
            "An Overview of BioCreative II.5.",
            "Classification of Protein-Protein Interaction Full-Text Documents Using Text and Citation Network Features.",
            "Multistage Gene Normalization and SVM-Based Ranking for Protein Interactor Extraction in Full-Text Articles.",
            "Empirical Investigations into Full-Text Protein Interaction Article Categorization Task (ACT) in the BioCreative II.5 Challenge.",
            "BioLMiner System: Interaction Normalization Task and Interaction Pair Task in the BioCreative II.5 Challenge.",
            "Extracting Protein Interactions from Text with the Unified AkaneRE Event Extraction System.",
            "An IR-Aided Machine Learning Framework for the BioCreative II.5 Challenge.",
            "Exploring Species-Based Strategies for Gene Normalization.",
            "OntoGene in BioCreative II.5.",
            "Efficient Extraction of Protein-Protein Interactions from Full-Text Articles.",
            "Cache-Oblivious Dynamic Programming for Bioinformatics.",
            "CollHaps: A Heuristic Approach to Haplotype Inference by Parsimony.",
            "Combinatorial Analysis for Sequence and Spatial Motif Discovery in Short Sequence Fragments.",
            "Nonnegative Principal Component Analysis for Cancer Molecular Pattern Discovery.",
            "SCS: Signal, Context, and Structure Features for Genome-Wide Human Promoter Recognition.",
            "A Study of Hierarchical and Flat Classification of Proteins.",
            "On the Complexity of uSPR Distance.",
            "Guest Editors' Introduction to the Special Section on Bioinformatics Research and Applications.",
            "Rearrangement Phylogeny of Genomes in Contig Form.",
            "Untangling Tanglegrams: Comparing Trees by Their Drawings.",
            "Pure Parsimony Xor Haplotyping.",
            "Exact Computation of Coalescent Likelihood for Panmictic and Subdivided Populations under the Infinite Sites Model.",
            "Improved Algorithms for Parsing ESLTAGs: A Grammatical Model Suitable for RNA Pseudoknots.",
            "Querying Graphs in Protein-Protein Interactions Networks Using Feedback Vertex Set.",
            "A Sparse Learning Machine for High-Dimensional Data with Application to Microarray Gene Analysis.",
            "A Survey of Spatial Defects in Homo Sapiens Affymetrix GeneChips.",
            "A Cluster Refinement Algorithm for Motif Discovery.",
            "Finding the Nearest Neighbors in Biological Databases Using Less Distance Computations.",
            "Human-Readable Rule Generator for Integrating Amino Acid Sequence Information and Stability of Mutant Proteins.",
            "Quantifying the Degree of Self-Nestedness of Trees: Application to the Structural Analysis of Plants.",
            "Quartets MaxCut: A Divide and Conquer Quartets Algorithm.",
            "RDCurve: A Nonparametric Method to Evaluate the Stability of Ranking Procedures.",
            "SARNA-Predict: Accuracy Improvement of RNA Secondary Structure Prediction Using Permutation-Based Simulated Annealing.",
            "Using Gaussian Process with Test Rejection to Detect T-Cell Epitopes in Pathogen Genomes.",
            "VARUN: Discovering Extensible Motifs under Saturation Constraints.",
            "The Metropolized Partial Importance Sampling MCMC Mixes Slowly on Minimum Reversal Rearrangement Paths."
        ]
    },
    {
        "name": "TCBB",
        "year": "2009",
        "info": "Volume 6: 2009",
        "count": 66,
        "papers": [
            "Final, Five-Year End, Editorial.",
            "New EIC Editorial.",
            "Special Section: Phylogenetics.",
            "Barking Up The Wrong Treelength: The Impact of Gap Penalty on Alignment and Tree Accuracy.",
            "Budgeted Phylogenetic Diversity on Circular Split Systems.",
            "Hybridization in Nonbinary Trees.",
            "Metrics for Phylogenetic Networks I: Generalizations of the Robinson-Foulds Metric.",
            "Robustness of Topological Supertree Methods for Reconciling Dense Incompatible Data.",
            "The Identifiability of Covarion Models in Phylogenetics.",
            "Fourier Transform Inequalities for Phylogenetic Trees.",
            "Outgoing EIC Editorial for this Special Section of TCBB with the Theme of Phylogenetics.",
            "Maximum Parsimony for Tree Mixtures.",
            "Drawing Rooted Phylogenetic Networks.",
            "Consistency of Topological Moves Based on the Balanced Minimum Evolution Principle of Phylogenetic Inference.",
            "Refining Phylogenetic Trees Given Additional Data: An Algorithm Based on Parsimony.",
            "Shrinkage Effect in Ancestral Maximum Likelihood.",
            "Gene Classification Using Codon Usage and Support Vector Machines.",
            "Initializing Partition-Optimization Algorithms.",
            "Structural Properties of Gene Regulatory Networks: Definitions and Connections.",
            "EIC Editorial.",
            "Guest Editors' Introduction to the Special Section on Bioinformatics Research and Applications.",
            "A Novel Heuristic for Local Multiple Alignment of Interspersed DNA Repeats.",
            "A Framework for Multiple Kernel Support Vector Regression and Its Applications to siRNA Efficacy Prediction.",
            "Network-Based Inference of Cancer Progression from Microarray Data.",
            "Generalized Gene Adjacencies, Graph Bandwidth, and Clusters in Yeast Evolution.",
            "The Gene-Duplication Problem: Near-Linear Time Algorithms for NNI-Based Local Searches.",
            "Designing Patterns and Profiles for Faster HMM Search.",
            "Fuzzy-Adaptive-Subspace-Iteration-Based Two-Way Clustering of Microarray Data.",
            "Gene Clustering via Integrated Markov Models Combining Individual and Pairwise Features.",
            "Semantics of Multimodal Network Models.",
            "Statistical Alignment with a Sequence Evolution Model Allowing Rate Heterogeneity along the Sequence.",
            "Visual Exploration of Three-Dimensional Gene Expression Using Physical Views and Linked Abstract Views.",
            "Conditioning-Based Modeling of Contextual Genomic Regulation.",
            "Multimodal Networks: Structure and Operations.",
            "Optimal Aggregation of Binary Classifiers for Multiclass Cancer Diagnosis Using Gene Expression Profiles.",
            "Parallel Clustering Algorithm for Large Data Sets with Applications in Bioinformatics.",
            "Prediction of Cancer Class with Majority Voting Genetic Programming Classifier Using Gene Expression Data.",
            "EIC Editorial: Introducing New Associate Editors.",
            "A Monte Carlo EM Algorithm for De Novo Motif Discovery in Biomolecular Sequences.",
            "A Unified Approach for Reconstructing Ancient Gene Clusters.",
            "An Approximation Algorithm for the Minimum Breakpoint Linearization Problem.",
            "An Extended Kalman Filtering Approach to Modeling Nonlinear Dynamic Gene Regulatory Networks via Short Gene Expression Time Series.",
            "Computing the Distribution of a Tree Metric.",
            "Evolutionary Optimization of Kernel Weights Improves Protein Complex Comembership Prediction.",
            "Improved Approximation Algorithms for Reconstructing the History of Tandem Repeats.",
            "Metrics for Phylogenetic Networks II: Nodal and Triplets Metrics.",
            "Model Reduction of Multiscale Chemical Langevin Equations: A Numerical Case Study.",
            "On Subset Seeds for Protein Alignment.",
            "Parsimony Score of Phylogenetic Networks: Hardness Results and a Linear-Time Heuristic.",
            "Protein Design by Sampling an Undirected Graphical Model of Residue Constraints.",
            "RNA Search with Decision Trees and Partial Covariance Models.",
            "A Statistical Change Point Model Approach for the Detection of DNA Copy Number Variations in Array CGH Data.",
            "Assessing the Discordance of Multiple Sequence Alignments.",
            "Comparison of Tree-Child Phylogenetic Networks.",
            "Heuristic Reusable Dynamic Programming: Efficient Updates of Local Sequence Alignment.",
            "Evaluating Protein Similarity from Coarse Structures.",
            "Inferential Clustering Approach for Microarray Experiments with Replicated Measurements.",
            "Laplacian Linear Discriminant Analysis Approach to Unsupervised Feature Selection.",
            "Modeling and Visualizing Uncertainty in Gene Expression Clusters Using Dirichlet Process Mixtures.",
            "On Nakhleh's Metric for Reduced Phylogenetic Networks.",
            "Protein Structure Classification Based on Conserved Hydrophobic Residues.",
            "A Positive Detecting Code and Its Decoding Algorithm for DNA Library Screening.",
            "Constructing Level-2 Phylogenetic Networks from Triplets.",
            "On the Approximation of Optimal Structures for RNA-RNA Interaction.",
            "Evaluation of Geometric Complementarity between Molecular Surfaces Using Compactly Supported Radial Basis Functions.",
            "Machine Learning Techniques for the Automated Classification of Adhesin-Like Proteins in the Human Protozoan Parasite Trypanosoma cruzi."
        ]
    },
    {
        "name": "TCBB",
        "year": "2008",
        "info": "Volume 5: 2008",
        "count": 56,
        "papers": [
            "An Evaluation of Information Content as a Metric for the Inference of Putative Conserved Noncoding Regions in DNA Sequences Using a Genetic Algorithms Approach.",
            "An Information Theoretic Exploratory Method for Learning Patterns of Conditional Gene Coexpression from Microarray Data.",
            "RnaPredict-An Evolutionary Algorithm for RNA Secondary Structure Prediction.",
            "Statistical Characterization of Protein Ensembles.",
            "A (1.5 + epsilon)-Approximation Algorithm for Unsigned Translocation Distance.",
            "A Novel Biologically and Psychologically Inspired Fuzzy Decision Support System: Hierarchical Complementary Learning.",
            "An Automatic Translation of SBML into Beta-Binders.",
            "Combinatorial Approaches for Mass Spectra Recalibration.",
            "Computational Problems in Perfect Phylogeny Haplotyping: Typing without Calling the Allele.",
            "DNA Motif Representation with Nucleotide Dependency.",
            "Novel Algorithm for Coexpression Detection in Time-Varying Microarray Data Sets.",
            "Progressive Tree Neighborhood Applied to the Maximum Parsimony Problem.",
            "Consensus Genetic Maps as Median Orders from Inconsistent Sources.",
            "Extracting Dynamics from Static Cancer Expression Data.",
            "Graphical Models of Residue Coupling in Protein Families.",
            "Identification of Protein Coding Regions Using the Modified Gabor-Wavelet Transform.",
            "Search for Steady States of Piecewise-Linear Differential Equation Models of Genetic Regulatory Networks.",
            "Toward Verified Biological Models.",
            "Computing Phylogenetic Diversity for Split Systems.",
            "Haplotyping for Disease Association: A Combinatorial Approach.",
            "Highly Scalable Genotype Phasing by Entropy Minimization.",
            "Inferring Connectivity of Genetic Regulatory Networks Using Information-Theoretic Criteria.",
            "Nature Reserve Selection Problem: A Tight Approximation Algorithm.",
            "Optimal Algorithms for the Interval Location Problem with Range Constraints on Length and Average.",
            "Prediction of R5, X4, and R5X4 HIV-1 Coreceptor Usage with Evolved Neural Networks.",
            "Shorelines of Islands of Tractability: Algorithms for Parsimony and Minimum Perfect Phylogeny Haplotyping Problems.",
            "2SNP: Scalable Phasing Method for Trios and Unrelated Individuals.",
            "Guest Editors' Introduction to the Special Section on Bioinformatics Research and Applications.",
            "Mixed Integer Linear Programming for Maximum-Parsimony Phylogeny Inference.",
            "Solving the Preserving Reversal Median Problem.",
            "Exploring the Solution Space of Sorting by Reversals, with Experiments and an Application to Evolution.",
            "Reconstruction of 3D Structures From Protein Contact Maps.",
            "Investigating the Efficacy of Nonlinear Dimensionality Reduction Schemes in Classifying Gene and Protein Expression Studies.",
            "Coclustering of Human Cancer Microarrays Using Minimum Sum-Squared Residue Coclustering.",
            "Incorporating Gene Functions into Regression Analysis of DNA-Protein Binding Data and Gene Expression Data to Construct Transcriptional Networks.",
            "PairProSVM: Protein Subcellular Localization Based on Local Pairwise Profile Alignment and SVM.",
            "Reproducibility-Optimized Test Statistic for Ranking Genes in Microarray Studies.",
            "Solving the Problem of Trans-Genomic Query with Alignment Tables.",
            "Fine-Scale Genetic Mapping Using Independent Component Analysis.",
            "Hadamard Conjugation for the Kimura 3ST Model: Combinatorial Proof Using Path Sets.",
            "Improved Layout of Phylogenetic Networks.",
            "EIC Editorial.",
            "Guest Editors' Introduction to the Special Section on Algorithms in Bioinformatics.",
            "Improving Strand Pairing Prediction through Exploring Folding Cooperativity.",
            "SpeedHap: An Accurate Heuristic for the Single Individual SNP Haplotyping Problem with Many Gaps, High Reading Error Rate and Low Coverage.",
            "Seeded Tree Alignment.",
            "An Omega(n^2/ log n) Speed-Up of TBR Heuristics for the Gene-Duplication Problem.",
            "Defining and Computing Optimum RMSD for Gapped and Weighted Multiple-Structure Alignment.",
            "Efficient Algorithms to Explore Conformation Spaces of Flexible Protein Loops.",
            "Learning Scoring Schemes for Sequence Alignment from Partial Examples.",
            "Efficient Algorithms for the Computational Design of Optimal Tiling Arrays.",
            "Computational Approaches for Automatic Structural Analysis of Large Biomolecular Complexes.",
            "Gene Expression Data Analysis Using a Novel Approach to Biclustering Combining Discrete and Continuous Data.",
            "An Introduction to Metabolic Networks and Their Structural Analysis.",
            "The Undirected Incomplete Perfect Phylogeny Problem.",
            "Optimization of cDNA Microarray Experimental Designs Using an Evolutionary Algorithm."
        ]
    },
    {
        "name": "TCBB",
        "year": "2007",
        "info": "Volume 4: 2007",
        "count": 68,
        "papers": [
            "State of the Journal.",
            "Associate Editor Appreciation and Welcome.",
            "Guest Editor's Introduction to the Special Section on Computational Biology and Bioinformatics (WABI) - Part 2.",
            "Perfect Sorting by Reversals Is Not Always Difficult.",
            "Ortholog Clustering on a Multipartite Graph.",
            "EMatch: Discovery of High Resolution Structural Homologues of Protein Domains in Intermediate Resolution Cryo-EM Maps.",
            "Accurate Cancer Classification Using Expressions of Very Few Genes.",
            "Correcting Base-Assignment Errors in Repeat Regions of Shotgun Assembly.",
            "Multiclass Cancer Classification Using Semisupervised Ellipsoid ARTMAP and Particle Swarm Optimization with Gene Expression Data.",
            "Predicting Protein-Protein Interactions from Protein Domains Using a Set Cover Approach.",
            "Accuracy Assessment of Diploid Consensus Sequences.",
            "Colored de Bruijn Graphs and the Genome Halving Problem.",
            "Distorted Metrics on Trees and Phylogenetic Forests.",
            "DNA Deformation Energy as an Indirect Recognition Mechanism in Protein-DNA Interactions.",
            "Metabolic Flux Estimation-A Self-Adaptive Evolutionary Algorithm with Singular Value Decomposition.",
            "Quartet-Based Phylogeny Reconstruction with Answer Set Programming.",
            "On the Length of the Longest Exact Position Match in a Random Sequence.",
            "Correction to \"Attribute Clustering for Grouping, Selection, and Classification of Gene Expression Data\".",
            "Guest Editors' Introduction to the Special Section: Computational Intelligence Approaches in Computational Biology and Bioinformatics.",
            "Poisson-Based Self-Organizing Feature Maps and Hierarchical Clustering for Serial Analysis of Gene Expression Data.",
            "Relational Analysis of CpG Islands Methylation and Gene Expression in Human Lymphomas Using Possibilistic C-Means Clustering and Modified Cluster Fuzzy Density.",
            "Interactive Semisupervised Learning for Microarray Analysis.",
            "On the Classification of a Small Imbalanced Cytogenetic Image Database.",
            "Gradient-Based Optimization of Kernel-Target Alignment for Sequence Kernels Applied to Bacterial Gene Start Detection.",
            "Subcellular Localization Prediction with New Protein Encoding Schemes.",
            "Dynamical Systems for Discovering Protein Complexes and Functional Modules from Biological Networks.",
            "Data Mining and Predictive Modeling of Biomolecular Network from Biomedical Literature Databases.",
            "An Adaptive Multimeme Algorithm for Designing HIV Multidrug Therapies.",
            "Multiobjective Optimization in Bioinformatics and Computational Biology.",
            "A Blocking Strategy to Improve Gene Selection for Classification of Gene Expression Data.",
            "Evolution under Reversals: Parsimony and Conservation of Common Intervals.",
            "Multiple Graph Alignment for the Structural Analysis of Protein Active Sites.",
            "Associate Editor Appreciation and Welcome.",
            "Adjoint Systems for Models of Cell Signaling Pathways and their Application to Parameter Fitting.",
            "CISA: Combined NMR Resonance Connectivity Information Determination and Sequential Assignment.",
            "Comparing Compressed Sequences for Faster Nucleotide BLAST Searches.",
            "Development of Two-Stage SVM-RFE Gene Selection Strategy for Microarray Expression Data Analysis.",
            "Neuroinformatics for Genome-Wide 3-D Gene Expression Mapping in the Mouse Brain.",
            "Reconstructing Recombination Network from Sequence Data: The Small Parsimony Problem.",
            "Regulatory Motif Discovery Using a Population Clustering Evolutionary Algorithm.",
            "Strategies for Identifying Statistically Significant Dense Regions in Microarray Data.",
            "Bayesian Basecalling for DNA Sequence Analysis Using Hidden Markov Models.",
            "Bidirectional Long Short-Term Memory Networks for Predicting the Subcellular Localization of Eukaryotic Proteins.",
            "Compression of Annotated Nucleotide Sequences.",
            "Computing the Hybridization Number of Two Phylogenetic Trees Is Fixed-Parameter Tractable.",
            "Effective Gene Selection Method With Small Sample Sets Using Gradient-Based and Point Injection Techniques.",
            "High-Throughput Ligand Screening via Preclustering and Evolved Neural Networks.",
            "Multicategory Classification Using An Extreme Learning Machine for Microarray Gene Expression Cancer Diagnosis.",
            "Superiority of Spaced Seeds for Homology Search.",
            "Optimization Over a Class of Tree Shape Statistics.",
            "Guest Editors' Introduction to the Special Section on Bioinformatics Research and Applications.",
            "Removing Noise and Ambiguities from Comparative Maps in Rearrangement Analysis.",
            "Comparing Genomes with Duplications: A Computational Complexity Point of View.",
            "Exemplar Longest Common Subsequence.",
            "Fast and Practical Algorithms for Planted (l, d) Motif Search.",
            "SynPAM-A Distance Measure Based on Synonymous Codon Substitutions.",
            "Algorithms for Efficient Near-Perfect Phylogenetic Tree Reconstruction in Theory and Practice.",
            "Cascaded Bidirectional Recurrent Neural Networks for Protein Secondary Structure Prediction.",
            "Data-Dependent Kernel Machines for Microarray Data Classification.",
            "Finding a Common Motif of RNA Sequences Using Genetic Programming: The GeRNAMo System.",
            "High Confidence Rule Mining for Microarray Analysis.",
            "Inferring Adaptive Regulation Thresholds and Association Rules from Gene Expression Data through Combinatorial Optimization Learning.",
            "Inferring Gene Regulatory Networks using Differential Evolution with Local Search Heuristics.",
            "An Intelligent Two-Stage Evolutionary Algorithm for Dynamic Pathway Identification From Gene Expression Profiles.",
            "Phylogenetic Networks Based on the Molecular Clock Hypothesis.",
            "Simplified Partial Digest Problem: Enumerative and Dynamic Programming Algorithms.",
            "Inference of Genetic Regulatory Networks with Recurrent Neural Network Models Using Particle Swarm Optimization.",
            "Typing Staphylococcus aureus Using the spa Gene and Novel Distance Measures."
        ]
    },
    {
        "name": "TCBB",
        "year": "2006",
        "info": "Volume 3: 2006",
        "count": 39,
        "papers": [
            "State of the Journal.",
            "Jointly Analyzing Gene Expression and Copy Number Data in Breast Cancer Using Data Reduction Models.",
            "Spatio-Temporal Analysis of Constitutive Exocytosis in Epithelial Cells.",
            "Statistical Analysis of RNA Backbone.",
            "Gene Mapping and Marker Clustering Using Shannon's Mutual Information.",
            "A Hidden Markov Model for Transcriptional Regulation in Single Cells.",
            "A Hill-Climbing Approach for Automatic Gridding of cDNA Microarray Images.",
            "Unicyclic Networks: Compatibility and Enumeration.",
            "A Short Proof that Phylogenetic Tree Reconstruction by Maximum Likelihood Is Hard.",
            "Introduction of New Associate Editors.",
            "Bayesian Segmental Models with Multiple Sequence Alignment Profiles for Protein Secondary Structure and Contact Map Prediction.",
            "Functional Census of Mutation Sequence Spaces: The Example of p53 Cancer Rescue Mutants.",
            "An Efficient Algorithm for the Identification of Structured Motifs in DNA Promoter Sequences.",
            "Integer Programming Approaches to Haplotype Inference by Pure Parsimony.",
            "The JigCell Model Builder: A Spreadsheet Interface for Creating Biochemical Reaction Network Models.",
            "Minimum-Flip Supertrees: Complexity and Algorithms.",
            "TreeDT: Tree Pattern Mining for Gene Mapping.",
            "A Concise Necessary and Sufficient Condition for the Existence of a Galled-Tree.",
            "Three-Dimensional Shape-Structure Comparison Method for Protein Classification.",
            "Multiple Peak Alignment in Sequential Data Analysis: A Scale-Space-Based Approach.",
            "A Powerful Approach for Effective Finding of Significantly Differentially Expressed Genes.",
            "Correlation Statistics for cDNA Microarray Image Analysis.",
            "Counting All Possible Ancestral Configurations of Sample Sequences in Population Genetics.",
            "Finding Consistent Gene Transmission Patterns on Large and Complex Pedigrees.",
            "Fuzzy Measures on the Gene Ontology for Gene Product Similarity.",
            "Genome Rearrangement Based on Reversals that Preserve Conserved Intervals.",
            "Improved Parameterized Complexity of the Maximum Agreement Subtree and Maximum Compatible Tree Problems.",
            "Islands of Tractability for Parsimony Haplotyping.",
            "Significance of Gene Ranking for Classification of Microarray Samples.",
            "Guest Editor's Introduction to the Special Issue on Computational Biology and Bioinformatics -- Part 1.",
            "Using Max Cut to Enhance Rooted Trees Consistency.",
            "Pattern Identification in Biogeography.",
            "Efficient Detection of Network Motifs.",
            "Motif Search in Graphs: Application to Metabolic Networks.",
            "A 1.375-Approximation Algorithm for Sorting by Transpositions.",
            "New Bounds and Tractable Instances for the Transposition Distance.",
            "Comparing Tandem Repeats with Duplications and Excisions of Variable Degree.",
            "Faster Algorithms for Optimal Multiple Sequence Alignment Based on Pairwise Comparisons.",
            "Efficient Parameterized Algorithms for Biopolymer Structure-Sequence Alignment."
        ]
    },
    {
        "name": "TCBB",
        "year": "2005",
        "info": "Volume 2: 2005",
        "count": 34,
        "papers": [
            "Guest Editorial: WABI Special Section Part II.",
            "A New Distance for High Level RNA Secondary Structure Comparison.",
            "Topological Rearrangements and Local Search Method for Tandem Duplication Trees.",
            "Optimizing Multiple Seeds for Protein Homology Search.",
            "Editorial-State of the Transaction.",
            "Bases of Motifs for Generating Repeated Patterns with Wild Cards.",
            "Multiseed Lossless Filtration.",
            "Text Mining Biomedical Literature for Discovering Gene-to-Gene Relationships: A Comparative Study of Algorithms.",
            "Guest Editors' Introduction to the Special Issue: Machine Learning for Bioinformatics - Part 1.",
            "Attribute Clustering for Grouping, Selection, and Classification of Gene Expression Data.",
            "Joint Classification and Pairing of Human Chromosomes.",
            "Semisupervised Learning for Molecular Profiling.",
            "Essential Latent Knowledge for Protein-Protein Interactions: Analysis by an Unsupervised Learning Approach.",
            "Markov Encoding for Detecting Signals in Genomic Sequences.",
            "The Latent Process Decomposition of cDNA Microarray Data Sets.",
            "Fold Recognition by Predicted Alignment Accuracy.",
            "Dimension Reduction-Based Penalized Logistic Regression for Cancer Classification Using Microarray Data.",
            "Guest Editor's Introduction to the Special Issue: Machine Learning for Bioinformatics-Part 2.",
            "Analyzing Gene Expression Time-Courses.",
            "Combining Sequence and Time Series Expression Data to Learn Transcriptional Modules.",
            "Associative Clustering for Exploring Dependencies between Functional Genomics Data Sets.",
            "Predicting Molecular Formulas of Fragment Ions with Isotope Patterns in Tandem Mass Spectra.",
            "Discovering Gene Networks with a Neural-Genetic Hybrid.",
            "The Applicability of Recurrent Neural Networks for Biological Sequence Analysis.",
            "Constructing and Analyzing a Large-Scale Gene-to-Gene Regulatory Network-Lasso-Constrained Inference and Biological Validation.",
            "Learning the Topological Properties of Brain Tumors.",
            "A Framework for Three-Dimensional Simulation of Morphogenesis.",
            "A Generalized Framework for Network Component Analysis.",
            "Assignment of Orthologous Genes via Genome Rearrangement.",
            "Biclustering Models for Structured Microarray Data.",
            "Correlation between Gene Expression and GO Semantic Similarity.",
            "Discovering Coherent Biclusters from Gene Expression Data Using Zero-Suppressed Binary Decision Diagrams.",
            "Efficiently Mining Gene Expression Data via a Novel Parameterless Clustering Method.",
            "Searching Genomes for Noncoding RNA Using FastR."
        ]
    },
    {
        "name": "TCBB",
        "year": "2004",
        "info": "Volume 1: 2004",
        "count": 19,
        "papers": [
            "Introduction of New Associate Editors.",
            "Phylogenetic Networks: Modeling, Reconstructibility, and Accuracy.",
            "Biclustering Algorithms for Biological Data Analysis: A Survey.",
            "Sequencing-by-Hybridization Revisited: The Analog-Spectrum Proposal.",
            "Pure Multiple RNA Secondary Structure Alignments: A Progressive Profile Approach.",
            "Prediction of Consensus RNA Secondary Structures Including Pseudoknots.",
            "The Number of Recombination Events in a Sample History: Conflict Graph and Lower Bounds.",
            "A Uniform Projection Method for Motif Discovery in DNA Sequences.",
            "Introduction of New Associate Editors.",
            "A Stochastic Downhill Search Algorithm for Estimating the Local False Discovery Rate.",
            "Constructing Splits Graphs.",
            "Improved Gapped Alignment in BLAST.",
            "Unidentifiable Divergence Times in Rates-across-Sites Models.",
            "Guest Editorial: WABI Special Section Part 1.",
            "Maximum-Scoring Segment Sets.",
            "Phylogenetic Super-Networks from Partial Trees.",
            "An O(N2) Algorithm for Discovering Optimal Boolean Pattern Pairs.",
            "A Polynomial-Time Algorithm for the Matching of Crossing Contact-Map Patterns.",
            "Using Uncorrelated Discriminant Analysis for Tissue Classification with Gene Expression Data."
        ]
    }
]