[
    {
        "name": "World Wide Web Journal",
        "year": "1997",
        "info": "Volume 2: 1997",
        "count": 68,
        "papers": [
            "Making a test bed for the Web.",
            "Håkon Lie: Web Stylist.",
            "Lilly ungilded: PNG'ing true colors to the Web.",
            "HTML 3.2 reference specification.",
            "Cascading style sheets.",
            "What's new in HTML 3.2: formalizing enhancements to HTML 2.0.",
            "An introduction to cascading style sheets.",
            "Guidelines for multimedia on the Web.",
            "Usability engineering for the Web.",
            "People with disabilities can't access the Web!",
            "User interfaces with HTML and JavaScript.",
            "GIF animation.",
            "MNG: a multiple-image format in the PNG family.",
            "New metrics for new media: toward the development of Web measurement standards.",
            "Larry Wall and Tom Christiansen discuss the virtues of Perl.",
            "The \"real\" Web-TV: Philipp Hoschka and real-time multimedia.",
            "Collaborative authoring: Jim Whitehead and the WebDAV group.",
            "Client-side scripting and HTML.",
            "An introduction to Amaya.",
            "Toward synchronized multimedia on the Web.",
            "VBScript: active clients and servers.",
            "JavaScript: when HTML is not enough.",
            "Scripting the Web with Python.",
            "Curl: a gentle slope language for the Web.",
            "Exploring CGI with Perl.",
            "Why Win-CGI?",
            "Introduction to the LWP library for Perl.",
            "Web gateways: increasing the power of the Web.",
            "Web database connectivity with scripting languages.",
            "Christine Varney: Advancing commerce and protecting consumers.",
            "Rohit Khare: security maven.",
            "Jim Galvin: building trust from the ground up.",
            "DSig 1.0 signature labels: using PICS 1.1 labels for digital signatures.",
            "Digital signature label architecture.",
            "JEPI: joint electronic payment initiative.",
            "Weaving a Web of trust.",
            "Cryptography and the Web.",
            "Referee: trust management for Web applications.",
            "Introducing SSL and certificates using SSLeay.",
            "Security for the domain name system.",
            "Name server security features in BIND 4.9.5.",
            "Secure CGI/API programming.",
            "A guide to secure electronic business using the E2S architecture.",
            "The electronic medical record: promises and threats.",
            "Legislating market winners: digital signature laws and the electronic commerce marketplace.",
            "The risks of key recovery, key escrow, and trusted third-party encryption.",
            "Government promotion of key recovery encryption: how current government initiatives will impact Internet security.",
            "Editorial.",
            "The Road to XML: Adapting SGML to the Web.",
            "The Web Is Ruined and I Ruined It.",
            "Extensible Markup Language (XML).",
            "Extensible Markup Language (XML) Part 2: Linking.",
            "HTML-Math: Mathematical Markup Language Working Draft.",
            "Document Object Model Requirements.",
            "A Guide to XML.",
            "XML and CSS.",
            "The Evolution of Web Documents: The Ascent of XML.",
            "Embedded Markup Considered Harmful.",
            "Chemical Markup Language: A Simple Introduction to Structured Documents.",
            "Codifying Medical Records in XML: Philosophy and Engineering.",
            "XML: Can the Desperate Perl Hacker Do It?",
            "XML: From Bytes to Characters.",
            "An Introduction to XML Processing with Lark.",
            "Building XML Parsers for Microsoft's IE4.",
            "JUMBO: An Object-Based XML Browser.",
            "Capturing the State of Distributed Systems with XML.",
            "XML, Java, and the Future of the Web.",
            "WIDL, Application Integration with XML."
        ]
    },
    {
        "name": "World Wide Web Journal",
        "year": "1996",
        "info": "Volume 1: 1996",
        "count": 82,
        "papers": [
            "Welcome Statement.",
            "Editorial.",
            "Results from the Third WWW User Survey.",
            "The Open Meeting: A Web-Based System for Conferencing and Collaboration.",
            "Using Versioning to Provide Collaboration on the WWW.",
            "Group Asynchronous Browsing on the World Wide Web.",
            "Supporting Collaborative Information Sharing with the WWW: The BSCW Shared Workspace System.",
            "A Web of Distributed Objects.",
            "W30bjects: Bringing Object-Oriented Technology to the Web.",
            "Making World Wide Web Caching Servers Cooperate.",
            "Caching Proxies: Limitations and Potentials.",
            "IAFA Templates in Use as Internet Metadata.",
            "A World Wide Web Resource Discovery System.",
            "The Krakatoa Chronicle: An Interactive Personalized Newspaper on the Web.",
            "Web Map: Concept Mapping on the Web.",
            "Swoop: An Application Generator for ORACLE/WWW Systems.",
            "Multi-Engine Search and Comparison Using the MetaCrawler.",
            "DB: Browsing Object-Oriented Databases over the Web.",
            "Toward a New Educational Environment.",
            "CyberProf: An Intelligent Human-Computer Interface for Asynchronous Wide Area Training and Teaching.",
            "A Modular Training System for Education in the WWW Environment.",
            "A WWW Learning Environment for Mathematics.",
            "WWW Meets Linda: Linda for Global WWW-Based Transaction Processing Systems.",
            "Interface-Parasite Gateways.",
            "Not Just Decoration: Quality Graphics for the Web.",
            "Bringing Music to the Web.",
            "Polymap: A Versatile Client-Side Image Map for the Web.",
            "Translating ISO 12083 Mathematical Markup for Electronic Documents.",
            "Real-Time Video and Audio in the World Wide Web.",
            "Lessons for the World Wide Web from the Text Encoding Initiative.",
            "Omniware: A Universal Substrate for Web Programming.",
            "Low Level Securitv in Java.",
            "CCI-Based Web Security: A Design Using PGP.",
            "Securing the World Wide Web: Smart Tokens and Their Implementation.",
            "Introducing Candleweb and Ĺ (awe), Bringing Animation Power to the World Wide Web.",
            "Local Control over Filtered WWW Access.",
            "Multi-Head Multi-Tail Mosaic.",
            "Mobile GUI on the Web.",
            "Using Graphic History in Browsing the World Wide Web.",
            "An HTTP-Based Infrastructure for Mobile Agents.",
            "Jasper: Communicating Information Agents for WWW.",
            "Constellation: A Web-Based Design Framework for Developing Network Applications.",
            "Linking in a Global Information Architecture.",
            "Commercial Hypertext Publishing: Electronic Books Using Trails and the Author-Publisher-Reader Mode.",
            "Ingrid: A Self-Configuring Information Navigation Infrastructure.",
            "Application-Specific Proxy Servers as HTTP Stream Transducers.",
            "DynaWeb: Integrating Large SGML Repositories and the WWW.",
            "RMC: A Tool to Design WWW Applications.",
            "Programming the Web: An Application-Oriented Language for Hypermedia Service Programming.",
            "Scalable, Secure, Cash Payment for WWW Resources with the PayMeProtocol Set.",
            "The Millicent Protocol for Inexpensive Electronic Commerce.",
            "A Schema-Based Approach to HTML Authoring.",
            "Rules for Extending a WWW Client: The Symposia API.",
            "The Distributed Link Service: A Tool for Publishers, Authors, and Readers.",
            "Structured Cooperative Authoring on the World Wide Web.",
            "The Boomerang White Paper: A Page as You Like It.",
            "A World Wide Web Telerobotic Remote Environment Browser.",
            "Data Transport Within the Distributed Oceanographic Data System.",
            "Requirements for Taking Applications Beyond the Enterprise.",
            "Classifying Internet Objects.",
            "A Generic Map Interface to Query Geographic Information Using the World Wide Web.",
            "Tim Berners-Lee: On Simplicity, Standards, and \"Intercreativity\".",
            "Jim Miller: Promoting the PICS Fix.",
            "Dave Raggett: The Working Draft.",
            "Sally Khudairi: <TITLE>Webmaster</TITLE>.",
            "Inserting Objects into HTML.",
            "A Lexical Analyzer for HTML and Basic SGML.",
            "Extended Log File Format .",
            "An Introduction to the Technical Papers.",
            "Surveying the Territory.",
            "Nielsen/CommerceNet Internet Demographic Study.",
            "Will the Web Democratize or Polarize the Political Process .",
            "Complementing Surveying and Demographics with Automated Network Monitoring.",
            "WWW Site Measurement.",
            "Model-Based Inference for Complete-Data Statistics.",
            "Polls, Surveys, and Choice Processor Technology on the World Wide Web.",
            "Measuring the Web.",
            "The U.K. National Web Cache.",
            "The Harvest Object Cache in New Zealand.",
            "Performance Engineering of the World Wide Web .",
            "Real-Time Geographic Visualization of World Wide Web Traffic.",
            "Ubiquitous Advertising on the WWW."
        ]
    }
]