[
    {
        "year": "2021",
        "name": "CSCW 2021",
        "info": "Virtual Event, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/cscw/2021c",
                "sub_name": "Companion Publication of the 2021 ACM Conference on Computer Supported Cooperative Work and Social Computing, CSCW 2021, Virtual Event, USA, October 23-27, 2021.",
                "count": 87,
                "papers": [
                    "CoSpeak: Peer Feedback on Voice Stories to Inform Learning Spoken English.",
                    "Pandemic-Driven Technology During COVID-19: Experiences of Older Adults.",
                    "Navigating the \"Glimmer of Hope\": Challenges and Resilience among U.S. Older Adults in Seeking COVID-19 Vaccination.",
                    "Investigating Multimodal Interactions and Parasocial Attractiveness in YouTube ASMR Videos.",
                    "LeadBoSki: A Smart Personal Assistant for Leadership Support in Video-Meetings.",
                    "Designing Opportunistic Social Matching Systems for Women's Safety During Face-to-Face Social Encounters.",
                    "When People Vanish: A Study to Investigate How Human Presence Changes the Scenario Speculation.",
                    "To Last Long or to Fade Away: Investigating Users' Instagram Post and Story Practices.",
                    "Listening Together while Apart: Intergenerational Music Listening.",
                    "Collective Narrative: Scaffolding Community Storytelling through Context-Awareness.",
                    "Exploring the Collaboration Possibilities of Distributed Making for Storytelling Using 3D Printing Pens.",
                    "Social Interactions in Virtual Reality: What Cues Do People Use Most and How.",
                    "Rethinking Dating Apps as Sexual Consent Apps: A New Use Case for AI-Mediated Communication.",
                    "Comparing Health Forums: User Engagement, Salient Entities, Medical Detail.",
                    "Connected Self-Organized Citizens in Crises: An Interdisciplinary Resilience Concept for Neighborhoods.",
                    "'If You Care About Me, You'll Send Me a Pic' - Examining the Role of Peer Pressure in Adolescent Sexting.",
                    "Bridging from Crisis to Everyday Life - An Analysis of User Reviews of the Warning App NINA and the COVID-19 Regulation Apps CoroBuddy and DarfIchDas.",
                    "Understanding the Interpersonal Space of Online Meetings: An Exploratory Study of \"We-ness\".",
                    "Sway Together, Stay Together: Visualizing Spiritual Support Networks Through the SoulGarden Prototype.",
                    "Authoring Platform for Mobile Citizen Science Apps with Client-side ML.",
                    "Struggle to Settle down! Examining the Voices of Migrants and Refugees on Twitter Platform.",
                    "Improving Readers' Awareness of Divergent Viewpoints by Displaying Agendas of Comments in Online News Discussions.",
                    "Local Community Support for Tangible Food Aid During COVID-19.",
                    "\"It's Viral!\" - A Study of the Behaviors, Practices, and Motivations of TikTok Users and Social Activism.",
                    "3D Exoscopes in Microsurgery: How 3D Exoscopes Reconfigure the Workflow of Assistant Surgeons and Nurses in the Operating Room.",
                    "Local Perceptions and Practices of News Sharing and Fake News.",
                    "Distinguishing IM Communication Patterns with Relationship and Conversation Topics.",
                    "SYNC: A Crowdsourcing Platform for News Co-editing.",
                    "Investigating Drug Addiction Discourse on YouTube.",
                    "Distributed Letter Jam: Designing Distributed Board Game Play for Social Connection.",
                    "Helping Their Child, Helping Each Other: : Parents' Mediated Social Support in the Children's Hospital.",
                    "\"Knock Knock, Here Is an Answer from Next Door\": Designing a Knowledge Sharing Chatbot to Connect Residents: Community Chatbot Design Case Study.",
                    "\"It's not exactly prominent or direct, but it's there\": Understanding Strategies for Sensitive Disclosure Online.",
                    "Appropriate Fairness Perceptions? On the Effectiveness of Explanations in Enabling People to Assess the Fairness of Automated Decision Systems.",
                    "'A Guiding Light in a Virtual Haven': A Preliminary Analysis of Conversations Around Navigating and Repairing Self-worth in an Online Professional Community for Women.",
                    "SAGA: Collaborative Storytelling with GPT-3.",
                    "The Sounds of Togetherness.",
                    "Giving and Receiving: Reciprocal Review Exchange in Online Fanfiction Communities.",
                    "Tip of the Finger or Tip of the Tongue?: The Effects of Verbal Communication on Online Multi-Player Team Performance.",
                    "Effects of the COVID-19 Pandemic on Park Visitation Measured by Social Media.",
                    "Food Delivery Eco-System: When Platforms Get Enterprises and Gig-Workers to Implicitly Cooperate.",
                    "Understanding College Students' News Sharing Experience on Instagram.",
                    "Exploring Users' Preferences for Chatbot's Guidance Type and Timing.",
                    "Beyond Isolation: Benefits and Challenges as perceived by students throughout online collaboration during the COVID-19 pandemic.",
                    "Characterizing Speech in Life Saving Interventions to Inform Computerized Clinical Decision Support for Complex Medical Teamwork.",
                    "XRmas: Extended Reality Multi-Agency Spaces for a Magical Remote Christmas.",
                    "Making Conversational Robots Learn from Children in a Collaborative Museum Exhibition.",
                    "MINDNOTES : A Mobile Platform to enable users to break stigma around mental health and connect with therapists.",
                    "CiteAs: Better Software through Sociotechnical Change for Better Software Citation.",
                    "SurviveCovid-19++ : A collaborative healthcare game towards educating people about safety measures for Covid-19.",
                    "SleuthTalk: Identifying Historical Photos with Intelligent Shortlists, Private Collaboration, and Structured Feedback.",
                    "SIGCHI Research Ethics Committee Town Hall.",
                    "Do We Fix it or Burn it Down? Towards Practicable Critique at CSCW.",
                    "SIGCHI Across Borders: Bringing Together the Local and Global.",
                    "Understanding and Amplifying Labor among Content Creators with Disabilities.",
                    "Negotiating Open Science: The Open Science Framework as a Technology-in-Practice.",
                    "\"Being Yourself\" Online: Supporting Authenticity for LGBTQ+ Social Media Users.",
                    "Perspectives from Practice: Algorithmic Decision-Making in Public Employment Services.",
                    "Identifying, Measuring and Contesting Algorithmically Curated Misinformation.",
                    "Designing for Creative Making in the Everyday Environment.",
                    "Redesigning Digital Peer-to-Peer Payments for Social Connections.",
                    "Intersectional Approaches for Supporting Casual Language and Culture Learning in Immigrant Families.",
                    "Designing Democratic Systems for Civic Collective Action.",
                    "Extending & Facilitating Informal Care Networks for People with Epilepsy & Caregivers.",
                    "Family Resilience Technologies: Designing Collaborative Technologies for Caregiving Coordination in the Children's Hospital.",
                    "You Got Yourself A Whole New Life, and All I've Got is Half This Old One: Breaking Up and Moving On in the Social Media Age.",
                    "An Entanglement Perspective on How Older Adults Use and Design Emerging Ubiquitous Technologies.",
                    "Exploring Transformative Justice Principles to Inform Survivor-Centered Design for Muslim Women in the United States.",
                    "Coordinating Migration: Caring for Communities & Their Data.",
                    "Exploring the Effects of Applying Learning Analytics for Teaching Procedural Skills in Health Sciences Education.",
                    "Understanding and Reducing Perception Gaps with Mediated Social Cues when Building Workplace Relationships through CMC.",
                    "Support Social Connectedness through Technology-mediated Shared Activities.",
                    "arttech: Performance and Embodiment in Technology for Resilience and Mental Health.",
                    "MOSafely: Building an Open-Source HCAI Community to Make the Internet a Safer Place for Youth.",
                    "The Global Labours of AI and Data Intensive Systems.",
                    "Human-Machine Partnerships in the Future of Work: Exploring the Role of Emerging Technologies in Future Workplaces.",
                    "[email protected]: Inclusive and Collaborative Child-facing Voice Technologies.",
                    "Investigating and Mitigating Biases in Crowdsourced Data.",
                    "From Alinsky to Zoom: Understanding Relational, Constituency-Based Organizing in 2021.",
                    "The Future of Care Work: Towards a Radical Politics of Care in CSCW Research and Practice.",
                    "Activated: Decentering activism in and with academia.",
                    "Subtle CSCW Traits: Tensions Around Identity Formation and Online Activism in the Asian Diaspora.",
                    "The Future of Research on Online Health Communities: Discussing Membership, Structure, and Support.",
                    "Addressing Challenges and Opportunities in Online Extremism Research: An Interdisciplinary Perspective.",
                    "Following the Trail of Citational Justice: Critically Examining Knowledge Production in HCI.",
                    "Designing for Data Awareness: Addressing Privacy and Security Concerns About \"Smart\" Technologies.",
                    "Social Computing and Collaborative Work in Latin America and Beyond."
                ]
            }
        ]
    },
    {
        "year": "2020",
        "name": "CSCW 2020",
        "info": "Virtual Event, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/cscw/2020c",
                "sub_name": "Companion Publication of the 2020 ACM Conference on Computer Supported Cooperative Work and Social Computing, CSCW 2020, Virtual Event, USA, October, 2020.",
                "count": 85,
                "papers": [
                    "Vertext: An End-to-end AI Powered Conversation Management System for Multi-party Chat Platforms.",
                    "WireOn: Supporting Remote Collaboration for Embedded System Development.",
                    "I Share, You Care: Private Status Sharing and Sender-Controlled Notifications in Mobile Instant Messaging.",
                    "ProtoChat: Supporting the Conversation Design Process with Crowd Feedback.",
                    "Democratic Reflection: Nudging Citizens? Democratic Engagement with Political Election Debates.",
                    "FamilyStories: Asynchronous Audio Storytelling over Distance.",
                    "CommunityClick: Towards Improving Inclusivity in Town Halls.",
                    "YTCoder - Towards Turning YouTube into a Development Environment.",
                    "The Design of a Location-Based Transit Game for Digital Placemaking.",
                    "TickTalkTurk: Conversational Crowdsourcing Made Easy.",
                    "A System for Interleaving Discussion and Summarization in Collaborative Document Writing.",
                    "Mood of India During Covid-19 - An Interactive Web Portal Based on Emotion Analysis of Twitter Data.",
                    "Privacy Considerations of the Visually Impaired with Camera Based Assistive Tools.",
                    "A Social Ecological Approach to Empowering Foster Youth to be Safer Online.",
                    "A Comparative Language Study: Characterizing Collaboration Models in the EN, FR, and ES Language Editions of Wikipedia.",
                    "Ethical Sensitivity in Machine Learning Development.",
                    "Investigating the Role of Sensor-Based Technologies in Resource-Constrained Households.",
                    "Examining the Class Ceiling of Large Technology Companies.",
                    "Designing for Collaborative Content Creation for People with Vision Impairments.",
                    "Sociotechnical Design in Legal Algorithmic Decision-Making.",
                    "How to Delete the Dead: Honoring Negative Affective Experiences with Postmortem Data.",
                    "Making Data's Economic Value Transparent.",
                    "Conducting HCI Research on Stigma.",
                    "Technologies for Constituent Communication in the U.S. Congress.",
                    "Text Mining for Social Good; Context-aware Measurement of Social Impact and Effects Using Natural Language Processing.",
                    "Computational and Causal Examinations of Wellbeing in Situated Contexts by Leveraging Social Media and Multimodal Data.",
                    "Training-the-trainer in Tele-instruction on Collaborative Physical Tasks.",
                    "(Mis)Measuring People's Attitudes from Social Media.",
                    "\"Am I Overwhelmed with this Information?\": A Cross-Platform Study on Information Overload, Technostress, Well-Being, and Continued Social Media Usage Intentions.",
                    "Designing for Social Transformation with Alternative Infrastructures.",
                    "Took a Pic and Got Declined, Vexed and Perplexed: Facial Recognition in Algorithmic Management.",
                    "Leveraging Software Bots to Enhance Developers' Collaboration in Online Programming Communities.",
                    "Understanding the Dynamics of Online Social Conformity.",
                    "Research Ethics Roundtable.",
                    "No: Critical Refusal as Feminist Data Practice.",
                    "A First Look into Users' Perceptions of Digital Medicine Technology.",
                    "Engaging Offline Communities Online Amid COVID-19: A Case Study of Independent Theaters.",
                    "Dowry Patterns: Re-thinking the Collective Digital Craft-making as a Language.",
                    "Digital Patronage Platforms.",
                    "Grandtotem: Supporting International and Intergenerational Relationships.",
                    "A New Approach to Parallel Interaction through Co-located and Object-oriented Storytelling.",
                    "Not Too Much, Nor Too Less: Investigating Which Information Should Be Shared for Awareness Between Remote Workers.",
                    "Tangible Multisensory Aids for Collaborative Phonics Learning.",
                    "quoras: A Python API for Quora Data Collection to Increase Multi-Language Social Science Research.",
                    "Beyond Boundaries: Towards Symbiotic Relationship Between Ecological Arts and Computational Thinking for Sustainability.",
                    "A Preliminary Study of Emotional Contagion in Live Streaming.",
                    "Understanding Law Enforcement and Common Peoples' Perspectives on Designing Explainable Crime Mapping Algorithms.",
                    "Keeper: An Online Synchronous Conversation Environment Informed by In-Person Facilitation Practices.",
                    "Collaborative Approaches to Workplace Accessibility.",
                    "Characterizing Community Guidelines on Social Media Platforms.",
                    "Promotion of Continuous Use of a Self-guided Mental Healthcare System by a Chatbot.",
                    "Sustaining Engagement in Volunteer Activities for Older Adults.",
                    "Robots on Campus: Understanding Public Perception of Robots using Social Media.",
                    "\"Did You Just Purchase a Butt Head on Amazon\".",
                    "Self-Evolving Adaptive Learning for Personalized Education.",
                    "IPOD: A Large-scale Industrial and Professional Occupation Dataset.",
                    "Reasons for Sharing With Separate Social Media Audiences During Life Transitions.",
                    "Supporting Remote Participation when Designing with People with Dementia.",
                    "Fixing Spellings of Colloquial Words using a Crowd Based Game.",
                    "Implications of Hormonal Tracking in Team Work.",
                    "Understanding How Marginalized Hijra in Bangladesh Navigate Complex Social Media Ecosystem.",
                    "An Initial Study of Collaborative Refinement of Student-Created Questions.",
                    "Understanding the Challenges of Online Group Chat for Productive Discourse at Scale.",
                    "Cultural Norms and Interpersonal Relationships: Comparing Disclosure Behaviors on Twitter.",
                    "DREC: towards a Datasheet for Reporting Experiments in Crowdsourcing.",
                    "Conducting Participatory Design to Improve Algorithms in Public Services: Lessons and Challenges.",
                    "'Learning to code in a virtual world': A Preliminary Comparative Analysis of Discourse and Learning in Two Online Programming Communities.",
                    "Community-based Retinal Screening with Multilingual Software Support to Overcome Language Barriers of Minority Communities.",
                    "Understanding Community-Level Conflicts Through Reddit r/place.",
                    "Life Improvements: DIY in Low Socio-economic Status Communities.",
                    "How much is a \"like\" worth? Engagement and Retention in an Online Health Community.",
                    "Benefits and Challenges for Social Media Users on the Autism Spectrum.",
                    "Attitudes Toward Health and Communication in Depressed Older Adults.",
                    "Breakups on Social Media: Social Behaviors and Dilemmas.",
                    "Toward Equitable Participatory Design: Data Feminism for CSCW amidst Multiple Pandemics.",
                    "Public Scholarship and CSCW: Trials and Twitterations.",
                    "Social AR: Reimagining and Interrogating the Role of Augmented Reality in Face to Face Social Interactions.",
                    "Interrogating Data Science.",
                    "MOVE: Measuring Ontologies in Value-seeking Environments: CSCW for Human Adaptation.",
                    "CUI@CSCW: Collaborating through Conversational User Interfaces.",
                    "Reconsidering Scale and Scaling in CSCW Research.",
                    "Collective Organizing and Social Responsibility at CSCW.",
                    "Beyond Checklist Approaches to Ethics in Design.",
                    "Decolonizing Learning Spaces for Sociotechnical Research and Design.",
                    "From Needs to Strengths: Operationalizing an Assets-Based Design of Technology."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "CSCW 2019",
        "info": "Austin, TX, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/cscw/2019c",
                "sub_name": "Companion Publication of the 2019 ACM Conference on Computer Supported Cooperative Work and Social Computing, CSCW 2019, Austin, TX, USA, November 09-13, 2019.",
                "count": 106,
                "papers": [
                    "Bike Swarm.",
                    "MIDST: A System to Support Stigmergic Coordination in Data-Science Teams.",
                    "ModelLens: An Interactive System to Support the Model Improvement Practices of Data Science Teams.",
                    "Skeletonographer: Skeleton-based Digital Ethnography Tool.",
                    "Pop: Bursting News Filter Bubbles on Twitter Through Diverse Exposure.",
                    "Carebit: A Mobile App for Remote Informal Caregiving.",
                    "Investigating the Role of Moral Decision-Making in Emerging Artificial Intelligence Technologies.",
                    "Doing \"Good\" with Data? Understanding and Working Around Data Doubles in Human Services Organizations.",
                    "Collaborative Self-management of Depression.",
                    "Towards a Smart Home Usable Privacy Framework.",
                    "Algorithmic Technologies and Underrepresented Populations.",
                    "Supporting Occasional Groups in Crowdsourcing Platforms.",
                    "Fostering Immigrants' Trust in Online Local Social Exchange.",
                    "Off Limits: Virtual Schools in an Era of Connection and Inequality.",
                    "Robots for Communities - A Value Framework.",
                    "Solving Mysteries with the Wisdom of Crowds: A Modularized Pipeline and Context Slices.",
                    "Designing for Multispecies Collaboration and Cohabitation.",
                    "Designing and Operationalizing a Civic Data Infrastructure in Atlanta's Westside Neighborhoods.",
                    "Quality of Democratic Discourse in the Age of Political Hashtags and Social Media News Consumption.",
                    "Power Dynamics and Privacy Protection in the Gig Economy.",
                    "Building More Positive Online Communities through Improving Moderation and Strengthening Social Identity.",
                    "Variations in the Use of Electronic Medical Records: Role of Sociocultural Aspects.",
                    "Designing for Better Privacy Awareness in Smart Homes.",
                    "The Relationships between Data, Power, and Justice in CSCW Research.",
                    "Collection Innovation.",
                    "Patron or Poison?: Industry Funding of HCI Research.",
                    "Women's Health, Wellbeing, & Empowerment.",
                    "Human-Agent Communication: Connecting Research and Development in HCI and AI.",
                    "The Impact of Screen Size on Crowdsourced Image Classification.",
                    "A Digital Dashboard for Supporting Online Student Teamwork.",
                    "Crowd Behavior Analysis using Snap Map: A Preliminary Study on the Grand Holy Mosque in Mecca.",
                    "You, Me, and IoT: How Internet-Connected Home Devices Affect Interpersonal Relationships.",
                    "Social Matching Systems for Research Collaboration: A Profile Page Design for University Faculty.",
                    "Gobo: A System for Exploring User Control of Invisible Algorithms in Social Media.",
                    "How does Editor Interaction Help Build the Spanish Wikipedia?",
                    "Understanding the Needs and Challenges of Using Conversational Agents for Deaf Older Adults.",
                    "What are Effective Strategies of Handling Harassment on Twitch?: Users' Perspectives.",
                    "The Impact of the Content of Online Customer Reviews on Customer Satisfaction: Evidence from Yelp Reviews.",
                    "Group Activity Recognition to Support Collaboration in Creative Digital Space.",
                    "Challenges and Lessons Deploying a Physical System for Resource Exchange in Local Communities.",
                    "The Dark Side of Social Media: What Makes Some Users More Vulnerable Than Others?",
                    "Information Privacy Opinions on Twitter: A Cross-Language Study.",
                    "PYCIPEDIA: Supporting Local and Remote Collaboration between Social Workers.",
                    "Emoji Use in Twitter White Nationalism Communication.",
                    "Exploring the Impact of (Not) Changing Default Settings in Algorithmic Crime Mapping - A Case Study of Milwaukee, Wisconsin.",
                    "Hors-Texte: A Prototype to Support Scholarly Discussion Groups.",
                    "\"We Need More Than Laptops!\": Technology Assistance for Transitioning International Students.",
                    "RadioSilenced: A Semi-Serendipitous Hyper Local Talk Radio Exploration Tool.",
                    "Asthma-nauts: Apps Using Gameplay to Collect Health Metrics and Educate Kids About Asthma.",
                    "Older Adults with Dementia in an Online Forum: A Preliminary Analysis.",
                    "Engagement of Pregnant Women and Mothers over WhatsApp: Challenges and Opportunities Involved.",
                    "Understanding Undergraduate Students' Experiences of Telepresence Robots on Campus.",
                    "Who will Subscribe to My Streaming Channel?: The Case of Twitch.",
                    "How Professionals Support Amateurs' Creativity Within the Brewing Community.",
                    "Learnings from an Ongoing Deployment of an IVR-based Platform for Voter Awareness.",
                    "Investigating Users' Perceptions of Light Behaviors in Smart-Speakers.",
                    "The Appeal of Influencers to the Social Media Outreach of Indian Politicians.",
                    "Data Interoperability: Infrastructure, Historical Artifact, or Science Meme? Examples from the Geosciences.",
                    "How Consistent Is Your GUI Design?",
                    "New to the US: Understanding the Role of CMC in International Students' Adaptation to the US.",
                    "Social Learning Frameworks for Analyzing Collaboration with Marginalized Learners.",
                    "eLIFE: Social Network Based Digital Support for Individuals with ASD.",
                    "Collaboration Face-to-Face and in Virtual Reality - Empathy, Social Closeness, and Task Load.",
                    "Tweetheads: An Exploratory Analysis of Twitter Use by Heads of State Across the Democracy Index.",
                    "Can Alexa be your Therapist?: How Back-Channeling Transforms Smart-Speakers to be Active Listeners.",
                    "A Day's Work on Facebook and Other Collaborative Trends in Animal Welfare.",
                    "Visualizing Algorithmic Selection in Social Media.",
                    "Sharing Of Public Harassment Experiences on Social Media in Bangladesh.",
                    "Tracking and Reporting Asthma Data for Children.",
                    "GremoBot: Exploring Emotion Regulation in Group Chat.",
                    "Beyond iTunes for Papers: Redefining the Unit of Interaction in Literature Review Tools.",
                    "How do Moral Values Differ in Tweets on Social Movements?",
                    "MicroLapse: Measuring Workers' Leniency to Prediction Errors of Microtasks' Working Times.",
                    "What are Academic Subreddits Talking About?: A Comparative Analysis of r/academia and r/gradschool.",
                    "Health Information Technologies for Cancer Care: Characterizing Developments for Precision and Personalized Medicine.",
                    "Teledrone: Shared Outdoor Exploration Using Telepresence Drones.",
                    "Pathao Ride-sharing App Design: What Do The Users Have To Say?",
                    "Developing Age-appropriate Icons and Asthma Action Plans for Children.",
                    "'The Issue with that sort of Data?': Clinicians' Accountability Concerns Around COPD Self-Monitoring Tools.",
                    "Algorithmically-Generated Communities: A Case Study.",
                    "ProtoTeams: Supporting Small Group Interactions in Co-Located Crowds.",
                    "ewrapper: Perceived Receptivity to Engagement Strategies in mHealth.",
                    "(In)visible Choices: Articulation Work and the Rise in US Maternal Mortality.",
                    "AI + Co-Design: Developing a Novel Computer-supported Approach to Inclusive Design.",
                    "The Changing Landscape of Crowdsourcing in China: From Individual Crowdworkers to Crowdfarms.",
                    "SynchroMouse: A Game of Improvised Joint Action.",
                    "Using Cultural Probes In New Contexts: Exploring the Benefits of Probes in HCI4D/ICTD.",
                    "Reaching Hard-To-Reach Populations: An Analysis of Survey Recruitment Methods.",
                    "Understanding How Social Prompts Influence Expert's Sharing of How-to Knowledge.",
                    "\"The Togetherness that We Crave\": Experiencing Social VR in Long Distance Relationships.",
                    "Better Supporting Workers in ML Workplaces.",
                    "Social Technologies for Digital Wellbeing Among Marginalized Communities.",
                    "Qualitative Methods for CSCW: Challenges and Opportunities.",
                    "Good Systems: Ethical AI for CSCW.",
                    "Design and the Politics of Collaboration: A Grassroots Perspective.",
                    "Addressing the Accessibility of Social Media.",
                    "Life Transitions and Social Technologies: Research and Design for Times of Life Change.",
                    "The Future of Work(places): Creating a Sense of Place for On-demand Work.",
                    "Volunteer Work: Mapping the Future of Moderation Research.",
                    "Learning from Team and Group Diversity: Nurturing and Benefiting from our Heterogeneity.",
                    "Identifying Challenges and Opportunities in Human-AI Collaboration in Healthcare.",
                    "WellComm2019: Towards Tools for Groups to Build Their Own Healthful Workplace Cultures.",
                    "Fostering Historical Research in CSCW & HCI.",
                    "Contestability in Algorithmic Systems.",
                    "Mapping the \"How\" of Collaborative Action: Research Methods for Studying Contemporary Sociotechnical Processes.",
                    "Ubiquitous Privacy: Research and Design for Mobile and IoT Platforms."
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "CSCW 2018",
        "info": "Jersey City, NJ, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/cscw/2018c",
                "sub_name": "Companion of the 2018 ACM Conference on Computer Supported Cooperative Work and Social Computing, CSCW 2018, Jersey City, NJ, USA, November 03-07, 2018.",
                "count": 109,
                "papers": [
                    "Turning the Tables: The Digital Mediation of Poker.",
                    "Lasting Impact Award: Bonni A. Nardi, Steve Whittaker and Erin Bradner.",
                    "Multitouch NetLogo for Museum Interactive Game.",
                    "SearchBot: Supporting Voice Conversations with Proactive Search.",
                    "Collaborative Narrative Visions and the Manifesto Machine.",
                    "Tweety Holmes: A Browser Extension for Abusive Twitter Profile Detection.",
                    "Automated Debriefing: Interface for Large-Scale Research Ethics.",
                    "CollaboPlanner: Integrating Mobile Phones and Public Displays for Collaborative Travel Planning.",
                    "PAPERINO: Remote Wizard-Of-Oz Puppeteering For Social Robot Behaviour Design.",
                    "Wiki'ike: Making Use of Knowledge Graphs in a Classroom.",
                    "Service4Crowd: A Service Oriented Process Management Platform for Crowdsourcing.",
                    "Visualink: A Minimal & Nonintrusive System for Distributed Awareness.",
                    "Visualizing Geo-Demographic Urban Data.",
                    "Demo: Towards Non-Newtonian Organic User Interfaces Ferro-Oobleck (Patent Pending).",
                    "Vibration Cues for Action Orders Improve Efficiency of Theatrical Performance Practice.",
                    "Designing to Support Reflection on Values & Practices to Address Online Disinformation.",
                    "Building Systems to Improve Online Discussion.",
                    "Disruption, Technology, and Time: Supporting Response to the Maternal Mortality Crisis.",
                    "Like: The Informatization of Affect.",
                    "Designing for Distributed Collaboration in Wilderness Search and Rescue.",
                    "Developing Notations for Data Infrastructuring in Participatory Design.",
                    "Alternative Ways of Living and Design.",
                    "Catalyzing Youth Civic Engagement Through Innovations in Social Computing.",
                    "Design for Computer-Mediated Multilingual Communication with AI Support.",
                    "Prefigurative Design as an Alternative Approach to Civic Engagement.",
                    "Individual and Collective Determinants of Activity in Collaborative Production.",
                    "What Impact Does a Networked Communal Plant Watering System Have On A Sense of Community Cohesion?",
                    "Creating Scientific Theories with Online Communities using Gut Instinct.",
                    "Understanding The Experiences of Youth In Collaborative Technical Workplaces.",
                    "Photo Privacy Protection on Online Social Networks.",
                    "Online Fandom: Boldly Going Where Few CSCW Researchers Have Gone Before.",
                    "Research Ethics and Regulation: An Open Forum.",
                    "Without a Trace: How Studying Invisible Interactions Can Help Us Understand Social Media.",
                    "Computer-Supported Career Development in The Future of Work.",
                    "Mapping in the Wild: Toward Designing to Train Search & Rescue Planning.",
                    "Reacting to Political Videos: The Potential of Danmaku.",
                    "Medication Management Companion (MMC) for a Rural Kenyan Community.",
                    "Healthcare Opportunities: Experts' Perspectives on Integrating Technology into Prehabilitation.",
                    "Virtual Reality Performance Platform for Learning about Dementia.",
                    "Improving Communication, Prisoner Welfare and Support through Mobile Collaborative Technologies.",
                    "Designing a Tangible Interface for Manager Awareness in Wilderness Search and Rescue.",
                    "Determining Newcomers Barrier in Software Development: An IT Industry Based Investigation.",
                    "Toward Understanding the Effects of Cognitive Styles on Collaboration in Multiplayer Games.",
                    "Screen-viewing Practices in Social Virtual Reality.",
                    "Tutorial Designs and Task Types in Zooniverse.",
                    "The Impacts of Platform Quality on Gig Workers' Autonomy and Job Satisfaction.",
                    "Covert-Glass: A Wearable that Enables Surreptitious 911 Video Calling.",
                    "Multidisciplinary Care for Facial Paralysis Patients: Collaboration between Carers.",
                    "Content-based Success Prediction of Crowdfunding Campaigns: A Deep Learning Approach.",
                    "Understanding Influential Comments in Online Conversations.",
                    "Framing Hate with Hate Frames: Designing the Codebook.",
                    "FeedReflect: A Tool for Nudging Users to Assess News Credibility on Twitter.",
                    "Silenced Voices: Understanding Sexual Harassment on Anonymous Social Media Among Bangladeshi People.",
                    "Knowledge-Sharing Market: A Prediction Market-Based Knowledge-Sharing System.",
                    "Coordinating Agents: Promoting Shared Situational Awareness in Collaborative Sensemaking.",
                    "Understanding How Youth Employees Use Slack.",
                    "Persuasion by Peer or Expert for Web Search.",
                    "Understanding the Patterns of Crime Reports in a Popular Bangladeshi Newspaper.",
                    "Telepresence Robot's Salutations to Trigger Informal Conversation with Teleworkers.",
                    "Integrated & Alone: The Use of Hashtags in Twitter Social Activism.",
                    "Impacts of Perceived Behavior Control and Emotional Labor on Gig Workers.",
                    "Airbnb and the Costs of Emotional Labor in Havana, Cuba.",
                    "\"We Are Not Entirely Replacing Paper\": Understanding Paper Persistence in Emergency Medical Settings.",
                    "Ordinary Innovations of Older Adults: An Interview Study to Understand Interest Development in Aging.",
                    "Feedback Orchestration: Structuring Feedback for Facilitating Reflection and Revision in Writing.",
                    "SmartGroup: A Tool-Based Approach to Scale-free Small-group Learning Activities.",
                    "What's Going On?: A Disaster in Disaster Communication Between Medical Teams at Hospitals.",
                    "Institutional Shadow Bodies in Mental Health Care Information Seeking.",
                    "Sojourners' Information Seeking Through Interpersonal Sources for Cultural Adaptation.",
                    "Monitoring Collective Intelligence: A Survey of Lithuanian Civic Tech.",
                    "Condition Unknown: Predicting Patients' Health Conditions in an Online Health Community.",
                    "How Personification and Interactivity Influence Stress-Related Disclosures to Conversational Agents.",
                    "Fake News in the News: An Analysis of Partisan Coverage of the Fake News Phenomenon.",
                    "Personal Neighborhood Networks for Senior Citizen Support.",
                    "What Does a Crowd Routing Behavior Change Reveal?",
                    "Interaction or Segregation: Vaccination and Information Sharing on Twitter.",
                    "Collaborative Writing on GitHub: A Case Study of a Book Project.",
                    "Talking the Talk in Citizen Science.",
                    "Linguistic Features of Identifiable Victim Effect in Microlending.",
                    "DreamGigs: A \"Stepping Stone\" for Low-resource Job Seekers to Reach Their Ideal Job.",
                    "How Users Choose a Face Lens on Snapchat.",
                    "Cellphone Usage in Academia: The Problem and Solutions.",
                    "Vulnerable and Online: Fandom's Case for Stronger Privacy Norms and Tools.",
                    "Studying the Impression of Saudi People towards Current Social Changes.",
                    "PhamilyHealth: A Photo Sharing System for Intergenerational Family Collaboration on Health.",
                    "Collaborative Content Creation: Impact of Media Type on Author Behavior.",
                    "Telegram as An Immigration Management Tool.",
                    "Towards Extending Social Exergame Engagement with Agents.",
                    "Supporting Online Dating Decisions with a Prompted Discussion Interface.",
                    "Encounter Opportunity Browsing: A New Approach to Opportunistic Social Matching.",
                    "Group-Activity Organizing Through an Awareness-of-Others Interface.",
                    "Returning Citizens' Job Search and Technology Use: Preliminary Findings.",
                    "Using Physiological Responses To Capture Unique Idea Creation In Team Collaborations.",
                    "Spotility: Crowdsourced Telepresence for Social and Collaborative Experiences in Mobile Mixed Reality.",
                    "The Changing Contours of \"Participation\" in Data-driven, Algorithmic Ecosystems: Challenges, Tactics, and an Agenda.",
                    "Conducting Research with Stigmatized Populations: Practices, Challenges, and Lessons Learned.",
                    "The Industrial Internet of Things: New Perspectives on HCI and CSCW within Industry Settings.",
                    "Latin America as a Place for CSCW Research.",
                    "Navigating the Challenges of Multi-Site Research.",
                    "Power Struggles in the Digital Economy: Platforms, Workers, and Markets.",
                    "Privacy in Context: Critically Engaging with Theory to Guide Privacy Research and Design.",
                    "Data Work in Healthcare: Challenges for Patients, Clinicians and Administrators.",
                    "Accessible Voice Interfaces.",
                    "Collaborative Mixed Reality Games.",
                    "Hybrid Events: Mediating Collocated Participation.",
                    "Rural Computing: Beyond Access and Infrastructure.",
                    "Social Issues in Personal Informatics: Design, Data, and Infrastructure.",
                    "Sociotechnical Systems of Care.",
                    "Solidarity Across Borders: Navigating Intersections Towards Equity and Inclusion."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "CSCW 2017",
        "info": "Portland, OR, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/cscw/2017",
                "sub_name": "Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing, CSCW 2017, Portland, OR, USA, February 25 - March 1, 2017.",
                "count": 185,
                "papers": [
                    "Conversational Intelligence: Bots and Lessons Learned.",
                    "Trust Your Heart: Assessing Cooperation and Trust with Biosignals in Computer-Mediated Interactions.",
                    "Constructing a Desiring User: Discourse, Rurality, and Design in Location-Based Social Networks.",
                    "People-Nearby Applications: How Newcomers Move Their Relationships Offline and Develop Social and Cultural Capital.",
                    "What Happens in Happn: The Warranting Powers of Location History in Online Dating.",
                    "Parental Control vs. Teen Self-Regulation: Is there a middle ground for mobile online safety?",
                    "Demanding by Design: Supporting Effortful Communication Practices in Close Personal Relationships.",
                    "In Your Eyes: Anytime, Anywhere Video and Audio Streaming for Couples.",
                    "Flex-N-Feel: The Design and Evaluation of Emotive Gloves for Couples to Support Touch Over Distance.",
                    "Shaping Pro and Anti-Social Behavior on Twitch Through Moderation and Example-Setting.",
                    "A Parsimonious Language Model of Social Media Credibility Across Disparate Events.",
                    "Knowledge Sharing in Online Discussion Threads: What Predicts the Ratings?",
                    "A Closer Look at the Self-Correcting Crowd: Examining Corrections in Online Rumors.",
                    "WoZ Way: Enabling Real-time Remote Interaction Prototyping & Observation in On-road Vehicles.",
                    "Bots as Virtual Confederates: Design and Ethics.",
                    "Configuring the User: \"Robots have Needs Too\".",
                    "\"Do Animals Have Accents?\": Talking with Agents in Multi-Party Conversation.",
                    "Agile Research Studios: Orchestrating Communities of Practice to Advance Research Training.",
                    "Mechanical Novel: Crowdsourcing Complex Work through Reflection and Revision.",
                    "Mosaic: Designing Online Creative Communities for Sharing Works-in-Progress.",
                    "More Than Peer Production: Fanfiction Communities as Sites of Distributed Mentoring.",
                    "CEPT: Collaborative Editing Tool for Non-Native Authors.",
                    "Have your Cake and Eat it Too: Foreign Language Learning with a Crowdsourced Video Captioning System.",
                    "Why Did They Do That?: Exploring Attribution Mismatches Between Native and Non-Native Speakers Using Videoconferencing.",
                    "Task Rebalancing: Improving Multilingual Communication with Native Speakers-Generated Highlights on Automated Transcripts.",
                    "Quotes Reveal Community Structure and Interaction Dynamics.",
                    "Call for Service: Characterizing and Modeling Police Response to Serviceable Requests on Facebook.",
                    "Gender and Cross-Cultural Differences in Social Media Disclosures of Mental Illness.",
                    "Distilling the Outcomes of Personal Experiences: A Propensity-scored Analysis of Social Media.",
                    "Military Masculinity and the Travails of Transitioning: Disclosure in Social Media.",
                    "Aspirational Design and Messy Democracy: Partisanship, Policy, and Hope in an Asian City.",
                    "Quantifying Search Bias: Investigating Sources of Bias for Political Searches in Social Media.",
                    "Engaging with Political and Social Issues on Facebook in College Life.",
                    "'Connected Learning' and the Equity Agenda: A Microsociology of Minecraft Play.",
                    "Eliph: Effective Visualization of Code History for Peer Assessment in Programming Education.",
                    "Synchronous Collaborative Writing in the Classroom: Undergraduates' Collaboration Practices and their Impact on Writing Style, Quality, and Quantity.",
                    "Placing Value on Community Co-creations: A Study of a Video Game 'Modding' Community.",
                    "EduFeed: A Social Feed to Engage Preliterate Children in Educational Activities.",
                    "How Parents Engage Children in Tablet-Based Reading Experiences: An Exploration of Haptic Feedback.",
                    "Four Factors that Regulate Teen Technology Use in Everyday Life.",
                    "Parents Just Don't Understand: Why Teens Don't Talk to Parents about Their Online Risk Experiences.",
                    "Don't Bother Me. I'm Socializing!: A Breakpoint-Based Smartphone Notification System.",
                    "Viewing the Viewers: Publishers' Desires and Viewers' Privacy Concerns in Social Networks.",
                    "What (or Who) Is Public?: Privacy Settings and Social Media Content Sharing.",
                    "Susceptibility to Social Influence of Privacy Behaviors: Peer versus Authoritative Sources.",
                    "IdeaWall: Improving Creative Collaboration through Combinatorial Visual Stimuli.",
                    "Material Vision.",
                    "Fostering Cooperative Activism through Critical Design.",
                    "Design Breakdowns: Designer-Developer Gaps in Representing and Interpreting Interactive Systems.",
                    "Socially Embedded Work: A Study of Wheelchair Users Performing Online Crowd Work in China.",
                    "Going Gray, Failure to Hire, and the Ick Factor: Analyzing How Older Bloggers Talk about Ageism.",
                    "The Impact of Assistive Technology on Communication Quality Between Deaf and Hearing Individuals.",
                    "AACrobat: Using Mobile Devices to Lower Communication Barriers and Provide Autonomy with Gaze-Based AAC.",
                    "Photo Sharing in the Arab Gulf: Expressing the Collective and Autonomous Selves.",
                    "Impression Management in High Context Societies: 'Saving Face' with ICT.",
                    "Understanding Feedback Expectations on Facebook.",
                    "Platforms, People, and Perception: Using Affordances to Understand Self-Presentation on Social Media.",
                    "The Art and Science of Persuasion: Not All Crowdfunding Campaign Videos are The Same.",
                    "Video-based Evanescent, Anonymous, Asynchronous Social Interaction: Motivation and Adaption to Medium.",
                    "Challenges on the Journey to Co-Watching YouTube.",
                    "Social Watching a Civic Broadcast: Understanding the Effects of Positive Feedback and Other Users' Opinions.",
                    "Awareness Supporting Technologies used in Collaborative Systems: A Systematic Literature Review.",
                    "Bots, Seeds and People: Web Archives as Infrastructure.",
                    "Characteristics of Collaboration in the Emerging Practice of Open Data Analysis.",
                    "Competing Currencies: Designing for Politics in Units of Measurement.",
                    "Deep Structures of Collaboration: Physiological Correlates of Collective Intelligence and Group Satisfaction.",
                    "A Glimpse Far into the Future: Understanding Long-term Crowd Worker Quality.",
                    "Collaboration Trumps Homophily in Urban Mobile Crowdsourcing.",
                    "Designing for Targeted Responder Models: Exploring Barriers to Respond.",
                    "Mobile Collaboration for Human and Canine Police Explosive Detection Teams.",
                    "Constructing Common Information Spaces across Distributed Emergency Medical Teams.",
                    "Collaboration And Awareness Amongst Flight Attendants.",
                    "Detailing a Spectrum of Motivational Forces Shaping Nomadic Practices.",
                    "The Challenge of Enterprise Social Networking (Non-)Use at Work: A Case Study of How to Positively Influence Employees' Enterprise Social Networking Acceptanc.",
                    "\"They're all going out to something weird\": Workflow, Legacy and Metadata in the Music Production Process.",
                    "What Did I Ask You to Do, by When, and for Whom?: Passion and Compassion in Request Management.",
                    "Fruitful Feedback: Positive Affective Language and Source Anonymity Improve Critique Reception and Work Outcomes.",
                    "Algorithmic Mediation in Group Decisions: Fairness Perceptions of Algorithmically Mediated vs. Discussion-Based Social Division.",
                    "Using the Model of Regulation to Understand Software Development Collaboration Practices and Tool Support.",
                    "Empowering Investors with Social Annotation When Saving for Retirement.",
                    "FollowBias: Supporting Behavior Change toward Gender Equality by Networked Gatekeepers on Social Media.",
                    "Possibilities and Limitations of Online Document Tools for Design Collaboration: The Case of Google Docs.",
                    "The Crafting of DIY Fatherhood.",
                    "\"This will cause a lot of work.\": Coping with Transferring Files and Passwords as Part of a Personal Digital Legacy.",
                    "PSAllocator: Multi-Task Allocation for Participatory Sensing with Sensing Capability Constraints.",
                    "Human Library: Understanding Experience Sharing for Community Knowledge Building.",
                    "\"At times avuncular and cantankerous, with the reflexes of a mongoose\": Understanding Self-Expression through Augmentative and Alternative Communication Devices.",
                    "Automatic Alt-text: Computer-generated Image Descriptions for Blind Users on a Social Network Service.",
                    "Snitches, Trolls, and Social Norms: Unpacking Perceptions of Social Media Use for Crime Prevention.",
                    "\"They basically like destroyed the school one day\": On Newer App Features and Cyberbullying in Schools.",
                    "Anyone Can Become a Troll: Causes of Trolling Behavior in Online Discussions.",
                    "Identifying Women's Experiences With and Strategies for Mitigating Negative Effects of Online Harassment.",
                    "The Role of Information Visibility in Network Gatekeeping: Information Aggregation on Reddit during Crisis Events.",
                    "Visual Representations of Disaster.",
                    "Social Media Seamsters: Stitching Platforms & Audiences into Local Crisis Infrastructure.",
                    "Mass Participation During Emergency Response: Event-centric Crowdsourcing in Humanitarian Mapping.",
                    "A Park or A Highway: Overcoming Tensions in Designing for Socio-emotional and Informational Needs in Online Health Communities.",
                    "Assessing Behavior Stage Progression From Social Media Data.",
                    "Computational Approaches Toward Integrating Quantified Self Sensing and Social Media.",
                    "Participant Driven Photo Elicitation for Understanding Activity Tracking: Benefits and Limitations.",
                    "Girls Rule, Boys Drool: Extracting Semantic and Affective Stereotypes from Twitter.",
                    "Growing Their Own: Legitimate Peripheral Participation for Computational Learning in an Online Fandom Community.",
                    "#Indigenous: Tracking the Connective Actions of Native American Advocates on Twitter.",
                    "Black Lives Matter in Wikipedia: Collective Memory and Collaboration around Online Social Movements.",
                    "Uncovering Influence Cookbooks: Reverse Engineering the Topological Impact in Peer Ranking Services.",
                    "Classification and Detection of Micro-Level Impact of Issue-Focused Documentary Films based on Reviews.",
                    "Extracting Topics with Focused Communities for Social Content Recommendation.",
                    "Toward Better Interactions in Recommender Systems: Cycling and Serpentining Approaches for Top-N Item Lists.",
                    "Video-Mediated Peer Support in an Online Community for Recovery from Substance Use Disorders.",
                    "Design Opportunities for Mental Health Peer Support Technologies.",
                    "Sensitive Self-disclosures, Responses, and Social Support on Instagram: The Case of #Depression.",
                    "Defining Digital Self-Harm.",
                    "Notes on the Concept of Data Interoperability: Cases from an Ecology of AIDS Research Infrastructures.",
                    "When Subjects Interpret the Data: Social Media Non-use as a Case for Adapting the Delphi Method to CSCW.",
                    "Crowdsourcing as a Tool for Research: Implications of Uncertainty.",
                    "Inquire: Large-scale Early Insight Discovery for Qualitative Research.",
                    "Supporting Collaboration with Non-Literate Forest Communities in the Congo-Basin.",
                    "When the Internet Goes Down in Bangladesh.",
                    "Senior Care for Aging in Place: Balancing Assistance and Independence.",
                    "It Takes at Least Two to Tango: Understanding the Cooperative Nature of Elderly Caregiving in Latin America.",
                    "Supporting Everyday Philanthropy: Care Work In Situ and at Scale.",
                    "Ambiguous Accountability: The Challenges of Identifying and Managing Patient-Related Information Problems in Collaborative Patient-Care Teams.",
                    "Putting the Pieces Back Together Again: Contest Webs for Large-Scale Problem Solving.",
                    "Capturing Winning Ideas in Online Design Communities.",
                    "Efficiently Identifying a Well-Performing Crowd Process for a Given Problem.",
                    "Huddler: Convening Stable and Familiar Crowd Teams Despite Unpredictable Availability.",
                    "Supporting Patient-Provider Collaboration to Identify Individual Triggers using Food and Symptom Journals.",
                    "Information Work in Bone Marrow Transplant: Reducing Misalignment of Perspectives.",
                    "Design Considerations for Social Fitness Applications: Comparing Chronically Ill Patients and Healthy Adults.",
                    "\"I'm so glad I met you\": Designing Dynamic Collaborative Support for Young Adult Cancer Survivors.",
                    "Predicting Member Productivity and Withdrawal from Pre-Joining Attachments in Online Production Groups.",
                    "The Wikipedia Adventure: Field Evaluation of an Interactive Tutorial for New Users.",
                    "Privacy, Anonymity, and Perceived Risk in Open Collaboration: A Study of Tor Users and Wikipedians.",
                    "Measuring Global Disease with Wikipedia: Success, Failure, and a Research Agenda.",
                    "Kurator: Using The Crowd to Help Families With Personal Curation Tasks.",
                    "Zaturi: We Put Together the 25th Hour for You. Create a Book for Your Baby.",
                    "KidKeeper: Design for Capturing Audio Mementos of Everyday Life for Parents of Young Children.",
                    "Work Always in Progress: Analysing Maintenance Practices in Spatial Crowd-sourced Datasets.",
                    "Communicating Context to the Crowd for Complex Writing Tasks.",
                    "Crowd Guilds: Worker-led Reputation and Feedback on Crowdsourcing Platforms.",
                    "Bias in Online Freelance Marketplaces: Evidence from TaskRabbit and Fiverr.",
                    "Media, Meaning, and Context Loss in Ephemeral Communication Platforms: A Qualitative Investigation on Snapchat.",
                    "SearchMessenger: Exploring the Use of Search and Card Sharing in a Messaging Application.",
                    "Folk Models of Online Behavioral Advertising.",
                    "TypeTalker: A Speech Synthesis-Based Multi-Modal Commenting System.",
                    "Understanding Trust amid Delays in Crowdfunding.",
                    "\"Not by Money Alone\": Social Support Opportunities in Medical Crowdfunding Campaigns.",
                    "Founder Center: Enabling Access to Collective Social Capital.",
                    "Developing Makerspaces as Sites of Entrepreneurship.",
                    "On the \"How\" and \"Why\" of Emergent Role Behaviors in Wikipedia.",
                    "Problematizing and Addressing the Article-as-Concept Assumption in Wikipedia.",
                    "Who Wants to Read This?: A Method for Measuring Topical Representativeness in User Generated Content Systems.",
                    "Wikum: Bridging Discussion Forums and Wikis Using Recursive Summarization.",
                    "Vernacular Visualization Practices in a Citizen Science Project.",
                    "Soylent Diet Self-Experimentation: Design Challenges in Extreme Citizen Science Projects.",
                    "Accounting for Privacy in Citizen Science: Ethical Research in a Context of Openness.",
                    "From Crowd to Community: A Survey of Online Community Features in Citizen Science Projects.",
                    "Data Tracking in Search of Workflows.",
                    "Clinical and Non-Clinical Handovers: Designing for Critical Moments.",
                    "Beyond Health Literacy: Supporting Patient-Provider Communication during an Emergency Visit.",
                    "Send Me a Different Message: Utilizing Cognitive Space to Create Engaging Message Triggers.",
                    "More to Meetings: Challenges in Using Speech-Based Technology to Support Meetings.",
                    "Looking Away and Catching Up: Dealing with Brief Attentional Disconnection in Synchronous Groupware.",
                    "Mixed Presence Collaboration using Scalable Visualizations in Heterogeneous Display Spaces.",
                    "AlphaRead: Support Unambiguous Referencing in Remote Collaboration with Readable Object Annotation.",
                    "Caring through Data: Attending to the Social and Emotional Experiences of Health Datafication.",
                    "\"Okay, One More Episode\": An Ethnography of Parenting in the Digital Age.",
                    "WAKEY: Assisting Parent-child Communication for Better Morning Routines.",
                    "From Personal Informatics to Family Informatics: Understanding Family Practices around Health Monitoring.",
                    "What Makes a Strong Team?: Using Collective Intelligence to Predict Team Performance in League of Legends.",
                    "Team Dating Leads to Better Online Ad Hoc Collaborations.",
                    "Does Collectivism Inhibit Individual Creativity?: The Effects of Collectivism and Perceived Diversity on Individual Creativity and Satisfaction in Virtual Ideation Teams.",
                    "Online Customization Sharing Ecosystems: Components, Roles, and Motivations.",
                    "\"It's Not Yet A Gift\": Understanding Digital Gifting.",
                    "TAMIES: A Study and Model of Adoption in P2P Resource Sharing and Indirect Exchange Systems.",
                    "Self-Disclosure and Perceived Trustworthiness of Airbnb Host Profiles.",
                    "Designing Cooperative Gamification: Conceptualization and Prototypical Implementation.",
                    "Immersive Street-level Social Media in the 3D Virtual City: Anticipated User Experience and Conceptual Development.",
                    "Data Vision: Learning to See Through Algorithmic Abstraction.",
                    "\"I'd Want to Burn the Data or at Least Nobble the Numbers\": Towards Data-mediated Building Management for Comfort and Energy Use.",
                    "CollaDroid: Automatic Augmentation of Android Application with Lightweight Interactive Collaboration.",
                    "Friction in Arenas of Repair: Hacking, Security Research, and Mobile Phone Infrastructure.",
                    "Can Security Become a Routine?: A Study of Organizational Change in an Agile Software Development Group.",
                    "Exhaustive Search and Resolution of Puzzles in OT Systems Supporting String-Wise Operations.",
                    "The Science Gap."
                ]
            },
            {
                "sub_name_abbr": "conf/cscw/2017c",
                "sub_name": "Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing, CSCW 2017, Portland, OR, USA, February 25 - March 1, 2017, Companion Volume.",
                "count": 100,
                "papers": [
                    "The Daemo Crowdsourcing Marketplace.",
                    "Professional Network Analytics Platform for Enterprise Collaboration.",
                    "Zaturi: Blending Hours Spent at Work and Hours Devoted to Children.",
                    "Collaborative Software Development Through Reflection and Storytelling.",
                    "ConsesnsUs: Visualizing Points of Disagreement for Multi-Criteria Collaborative Decision Making.",
                    "WoZ Way: Enabling Real-time Remote Interaction Prototyping & Observation in On-road Vehicles.",
                    "LabintheWild: How to Design Uncompensated, Feedback-driven Online Experiments.",
                    "INQUIRE Tool: Early Insight Discovery for Qualitative Research.",
                    "Eliph: Effective Visualization of Code History for Peer Assessment in Programming Education.",
                    "Flex-N-Feel: Emotive Gloves for Physical Touch Over Distance.",
                    "Smart Crew: A Smart Watch Design for Collaboration Amongst Flight Attendants.",
                    "Agile Research Studios: Orchestrating Communities of Practice to Advance Research Training.",
                    "Augmenting Media Literacy with Automatic Characterization of News along Pragmatic Dimensions.",
                    "Manifesting the Cyborg via Techno Body Modification: From Human Computer Interaction to Integration.",
                    "Understanding and Designing around Users' Interaction with Hidden Algorithms in Sociotechnical Systems.",
                    "Casting a Feminist Eye on Public Infrastructure.",
                    "Motivations for Participating in Online Initiatives: Exploring Contributory Behaviour Across Initiative Types.",
                    "Personal Health Tracking Technologies in Practice.",
                    "Understanding New Parents' Navigation Practices in Healthcare.",
                    "Understanding Popularity of Social Media Entities: From hashtags to question topics.",
                    "No Wrong Door: Designing Systems to Foster Collaboration in Support of Child Development.",
                    "Deploying Pervasive Sensing for Evidence-Based Management, Services and Sustainable Policy.",
                    "Knowing the Audience in the Information Age: Big Data and Social Media in the US Television Industry.",
                    "Crisis Informatics in the Anthropocene: Disasters as Matters of Care and Concern.",
                    "Leveraging Location Sharing to Increase Social Capital in Local Communities.",
                    "Enhancing Visibility of Distance Learners To Promote Community.",
                    "Supporting Information Needs of Transitional Phases in Diabetes Management Through Online Health Communities.",
                    "CSCW Research Ethics Town Hall: Working Towards Community Norms.",
                    "Social Justice and Design: Power and oppression in collaborative systems.",
                    "Perspectives on Live Streaming: Apps, Users, and Research.",
                    "GBER: A Social Matching App which utilizes Time, Place, and Skills of Workers and Jobs.",
                    "Design of a Home Telepresence Robot System for Supporting Childcare.",
                    "How Developers Make Design Decisions about Users' Privacy: The Place of Professional Communities and Organizational Climate.",
                    "Understanding the Unique Online Challenges Faced by Teens in the Foster Care System.",
                    "Getting Traction When Overwhelmed: Implications for Supporting Patient-Provider Communication.",
                    "Possible Confounds in Word-based Semantic Similarity Test Data.",
                    "Supporting Environmental Stewards' Needs with Technology.",
                    "Standing on the Shoulders of Peers: Tournament-Style Remixing in Project Courses.",
                    "H-Slate: A Hybrid Braille Slate Soft Keyboard for Touchscreen Devices.",
                    "Gravity Spy: Humans, Machines and The Future of Citizen Science.",
                    "Unobtrusive Note Taking: Enriching Digital Interpersonal Interactions Using Gestures.",
                    "Attitudes About 'Fair Use' and Content Sharing in Social Media Applications.",
                    "Eliminate Misunderstandings: Measuring Virtual Team Members as Organizational Citizens.",
                    "Examining Parents' Technical Mediation of Teens' Mobile Devices.",
                    "Scalable Crowd Ideation Support through Data Visualization, Mining, and Structured Workflows.",
                    "Beyond Knowledge Acquisition: Medical Device Training as a Cooperative Process.",
                    "Negative Electronic Word-of-mouth can Support Product Recommendation: Experimental Investigation.",
                    "Can AI become Reliable Source to Support Human Decision Making in a Court Scene?",
                    "Conceptualization of Computer-Supported Collaborative Sensemaking.",
                    "Automatic Extraction of Discussion based on Sentence Type Estimation.",
                    "Attribution Apprehension, Automated Attribution, and Creative Integration.",
                    "A Collaborative Visualization Tool to Support Doctors' Shared Decision-Making on Antibiotic Prescription.",
                    "Personas and Scenarios to Design Technologies for North Korean Defectors with Depression.",
                    "HotPi: Open-Source Collaborative Patient Documentation.",
                    "The Rise and Fall of Moral Labor in an Online Game Community.",
                    "Recruiting Messages Matter: Message Strategies to Attract Citizen Scientists.",
                    "Wait, Did You Say No Internet?: An Exploratory Study of the Perceived Impact of Internet Outage.",
                    "Socio-Ethnic Ingredients of Social Network Communities.",
                    "Turnover and the Model of Coordinated Action (MoCA).",
                    "Detection of Sockpuppets in Social Media.",
                    "Testing Ageing Theory among Later Middle-aged and Older Users Using Social Media.",
                    "Personal Tasks at Work: An Exploration.",
                    "The Relevance of Theories and Models of Collaboration to Child Development Support Activities.",
                    "Toward an Open Platform for Organized, Gamified Volunteerism.",
                    "Alternative Narratives of Crisis Events: Communities and Social Botnets Engaged on Social Media.",
                    "Development of a Test and Practice Platform for a Time Perception Research.",
                    "Puzzle Space: A Distributed Tangible Puzzle for Long Distance Couples.",
                    "Connecting Affinity Spaces to Places and Back: A Look at Pokemon Go.",
                    "Action ADE: Enabling Cross-setting Communication to Prevent Adverse Drug Events.",
                    "Designing the Interplay between Anonymity and Publicity for Online Social Support.",
                    "Comparing Formal and Informal NPOs' Use of Facebook and Twitter.",
                    "Open Secrets and Wrong Rights: Automatic Satire Detection in English Text.",
                    "Beyond Questioning and Answering: Teens' Learning Experiences and Benefits of Social Q&A Services.",
                    "I Know What You Coded Last Summer: Mining Candidate Expertise from GitHub Repositories.",
                    "Learning in the Open: A Research Agenda for MOOCs.",
                    "BeWithMe: An Immersive Telepresence System for Distance Separated Couples.",
                    "Worker-Owned Cooperative Models for Training Artificial Intelligence.",
                    "Connection Enablers in Online Learning Community: From Informative Online Personae to Meaningful Social Space.",
                    "Is Danmaku an Effective Way for Promoting Event based Social Network?",
                    "Density Dependence Without Resource Partitioning: Population Ecology on Change.org.",
                    "Chasing Lovely Monsters in the Wild, Exploring Players' Motivation and Play Patterns of Pokémon Go: Go, Gone or Go Away?",
                    "Supporting Out-of-class Interaction among Learners with InCircle.",
                    "We Can Query More than We Can Tell: Facilitating Collaboration Through Query-Driven Knowledge-Sharing.",
                    "Understanding Work in Public Transport Management Control Rooms.",
                    "Personalized Feedback Versus Money: The Effect on Reliability of Subjective Data in Online Experimental Platforms.",
                    "Gotta Hatch 'em All!: Robot-Supported Cooperation in Interactive Playgrounds.",
                    "The Fifteenth International Workshop on Collaborative Editing Systems.",
                    "Crowdsourcing Law and Policy: A Design-Thinking Approach to Crowd-Civic Systems.",
                    "Hacking and Making at Time-Bounded Events: Current Trends and Next Steps in Research and Event Design.",
                    "Theory Transfers?: Social Theory & CSCW Research.",
                    "In Whose Best Interest?: Exploring the Real, Potential, and Imagined Ethical Concerns in Privacy-Focused Agenda.",
                    "CSCW in China and Beyond.",
                    "Imagining Intersectional Futures: Feminist approaches in CSCW.",
                    "The Science of Citizen Science: Theories, Methodologies and Platforms.",
                    "Robots in Groups and Teams.",
                    "Reflections on Design Methods for Underserved Communities.",
                    "E-Infrastructures for Research Collaboration: The Case of the Social Sciences and Humanities.",
                    "Advancing the OCDX: Building Social Computing Infrastructure.",
                    "Conceptualizing, Creating, & Controlling Constructive and Controversial Comments: A CSCW Research-athon.",
                    "Talking with Conversational Agents in Collaborative Action."
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "CSCW 2016",
        "info": "San Francisco, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/cscw/2016",
                "sub_name": "Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing, CSCW 2016, San Francisco, CA, USA, February 27 - March 2, 2016.",
                "count": 142,
                "papers": [
                    "Supporting Group Coherence in a Museum Visit.",
                    "Articulating Co-Design in Museums: Reflections on Two Participatory Processes.",
                    "Effects of the Display Angle on Social Behaviors of the People around the Display: A Field Study at a Museum.",
                    "Jokebox: Coordinating Shared Encounters in Public Spaces.",
                    "#Bieber + #Blast = #BieberBlast: Early Prediction of Popular Hashtag Compounds.",
                    "Style in the Age of Instagram: Predicting Success within the Fashion Industry using Social Media.",
                    "Modeling Self-Disclosure in Social Networking Sites.",
                    "Finding Weather Photos: Community-Supervised Methods for Editorial Curation of Online Sources.",
                    "Standing Out from the Crowd: Emotional Labor, Body Labor, and Temporal Labor in Ridesharing.",
                    "Analysing Volunteer Engagement in Humanitarian Mapping: Building Contributor Communities at Large Scale.",
                    "PlanSourcing: Generating Behavior Change Plans with Friends and Crowds.",
                    "The Crowd is a Collaborative Network.",
                    "Steps, Choices and Moral Accounting: Observations from a Step-Counting Campaign in the Workplace.",
                    "Confidence & Control: Examining Adolescent Preferences for Technologies that Promote Wellness.",
                    "One LED is Enough: Catalyzing Face-to-face Interactions at Conferences with a Gentle Nudge.",
                    "Persistent Sharing of Fitness App Status on Twitter.",
                    "RichReview++: Deployment of a Collaborative Multi-modal Annotation System for Instructor Feedback and Peer Discussion.",
                    "Ask the Instructors: Motivations and Challenges of Teaching Massive Open Online Courses.",
                    "Impoverished Visions of Sustainability: Encouraging Disruption in Digital Learning Environments.",
                    "Do Massive Open Online Course Platforms Support Employability?",
                    "Monitoring and Trust in Virtual Teams.",
                    "Personality Matters: Balancing for Personality Types Leads to Better Outcomes for Crowd Teams.",
                    "Embracing Cultural Diversity: Online Social Ties in Distributed Workgroups.",
                    "Effects of Sensemaking Translucence on Distributed Collaborative Analysis.",
                    "The Diffusion of Trust and Cooperation in Teams with Individuals¿ Variations on Baseline Trust.",
                    "Vendors¿ Perspectives of Coordination in the Information Technology Offshore Outsourcing Industry: An Exploratory Study from the Philippines.",
                    "When Distance Doesn¿t Really Matter: Effects of Geographic Dispersion on Participation in Online Enterprise Communities.",
                    "Work and Play: An Experiment in Enterprise Gamification.",
                    "Strangers on Your Phone: Why People Use Anonymous Communication Applications.",
                    "The Role of Digital Technologies During Relationship Breakdowns.",
                    "On the bias: Self-esteem biases across communication channels during romantic couple conflict.",
                    "Mobile Media Matters: Media Use and Relationship Satisfaction among Geographically Close Dating Couples.",
                    "MarathOn Multiscreen: Group Television Watching and Interaction in a Viewing Ecology.",
                    "To Beam or Not to Beam: A Study of Remote Telepresence Attendance at an Academic Conference.",
                    "Distributed Liveness: Understanding How New Technologies Transform Performance Experiences.",
                    "On the Wisdom of Experts vs. Crowds: Discovering Trustworthy Topical News in Microblogs.",
                    "Keeping Up with the Tweet-dashians: The Impact of 'Official' Accounts on Online Rumoring.",
                    "How Information Snowballs: Exploring the Role of Exposure in Online Rumor Propagation.",
                    "Data Narratives: uncovering tensions in personal data management.",
                    "\"This has to be the cats\" - Personal Data Legibility in Networked Sensing Systems.",
                    "Networked Privacy Management in Facebook: A Mixed-Methods and Multinational Study.",
                    "SunForum: Understanding Depression in a Chinese Online Community.",
                    "Surveillance & Modesty on Social Media: How Qataris Navigate Modernity and Maintain Tradition.",
                    "Examining American and Chinese Internet Users¿ Contextual Privacy Preferences of Behavioral Advertising.",
                    "Capturing Turn-by-Turn Lexical Similarity in Text-Based Communication.",
                    "To Reply or To Reply All: Understanding Replying Behavior in Group Email Communication.",
                    "It¿s (Not) Simply a Matter of Time: The Relationship Between CMC Cues and Interpersonal Affinity.",
                    "Toward Automatic Bootstrapping of Online Communities Using Decision-theoretic Optimization.",
                    "Early Activity Diversity: Assessing Newcomer Retention from First-Session Activity.",
                    "One and Done: Factors affecting one-time contributors to ad-hoc online communities.",
                    "Which Way Did They Go? Newcomer Movement through the Zooniverse.",
                    "Crystallize: An Immersive, Collaborative Game for Second Language Learning.",
                    "Uses of Multiple Characters in Online Games and Their Implications for Social Network Methods.",
                    "Can Visualization of Contributions Support Fairness in Collaboration? Findings from Meters in an Online Game.",
                    "Virtual Team Networks: How Group Social Capital Affects Team Success in a Massively Multiplayer Online Game.",
                    "Thousands of Positive Reviews: Distributed Mentoring in Online Fan Communities.",
                    "The Effects and Antecedents of Conflict in Free and Open Source Software Development.",
                    "Effectiveness of Conflict Management Strategies in Peer Review Process of Online Collaboration Projects.",
                    "A Contingency View of Transferring and Adapting Best Practices within Online Communities.",
                    "Crafting the Image in Surgical Telemedicine.",
                    "Partners in Care: Design Considerations for Caregivers and Patients During a Hospital Stay.",
                    "Boundary Negotiating Artifacts in Personal Informatics: Patient-Provider Collaboration with Patient-Generated Data.",
                    "Designing for Those who are Overlooked ¿ Insider Perspectives on Care Practices and Cooperative Work of Elderly Informal Caregivers.",
                    "Campus-Scale Mobile Crowd-Tasking: Deployment & Behavioral Insights.",
                    "Botivist: Calling Volunteers to Action using Online Bots.",
                    "You Get Who You Pay for: The Impact of Incentives on Participation Bias.",
                    "Assignment Techniques for Crowdsourcing Sensitive Tasks.",
                    "Identity Work on Social Media Sites: Disadvantaged College Students' First Year College Transition.",
                    "Modeling Collaboration Patterns on an Interactive Tabletop in a Classroom Setting.",
                    "Avalanche Beacon Parks: Skill Development and Team Coordination in a Technological Training Ground.",
                    "First-Generation Students and College: The Role of Facebook Networks as Information Sources.",
                    "The Effect of Exposure to Social Annotation on Online Informed Consent Beliefs and Behavior.",
                    "Opportunities and Challenges Around a Tool for Social and Public Web Activity Tracking.",
                    "Policy as Embedded Generativity: A Case Study of the Emergence and Evolution of HathiTrust.",
                    "Beyond the Belmont Principles: Ethical Challenges, Practices, and Beliefs in the Online Data Research Community.",
                    "Time to reflect: Supporting health services over time by focusing on collaborative reflection.",
                    "The Collaborative work of Hospital Porters: Accountability, Visibility and Configurations of Work.",
                    "Accounting for the Invisible Work of Hospital Orderlies: Designing for Local and Global Coordination.",
                    "Complex Decision-Making in Clinical Practice.",
                    "Almost an Expert: The Effects of Rubrics and Expertise on Perceived Value of Crowdsourced Design Critiques.",
                    "Storia: Summarizing Social Media Content based on Narrative Theory using Crowdsourcing.",
                    "BudgetMap: Engaging Taxpayers in the Issue-Driven Classification of a Government Budget.",
                    "Crowdsourcing Queue Estimations in Situ.",
                    "Embeddedness and sequentiality in social media.",
                    "Analyzing Organizational Routines in Online Knowledge Collaborations: A Case for Sequence Analysis in CSCW.",
                    "When the Crowd is Not Enough: Improving User Experience with Social Media through Automatic Quality Analysis.",
                    "Distinguishing between Personal Preferences and Social Influence in Online Activity Feeds.",
                    "Hacking as Transgressive Infrastructuring: Mobile Phone Networks and the German Chaos Computer Club.",
                    "How to Hackathon: Socio-technical Tradeoffs in Brief, Intensive Collocation.",
                    "Out of Time, Out of Place: Reflections on Design Workshops as a Research Method.",
                    "'A Farmer, a Place and at least 20 Members': The Development of Artifact Ecologies in Volunteer-based Communities.",
                    "Characterizing Dietary Choices, Nutrition, and Language in Food Deserts via Social Media.",
                    "Quantifying and Predicting Mental Illness Severity in Online Pro-Eating Disorder Communities.",
                    "\"Hunger Hurts but Starving Works: \" Characterizing the Presentation of Eating Disorders Online.",
                    "#thyghgapp: Instagram Content Moderation and Lexical Variation in Pro-Eating Disorder Communities.",
                    "Encouraging \"Outside- the- box\" Thinking in Crowd Innovation Through Identifying Domains of Expertise.",
                    "Improving Crowd Innovation with Expert Facilitation.",
                    "Distributed Analogical Idea Generation with Multiple Constraints.",
                    "Social Ties in Organizational Crowdfunding: Benefits of Team-Authored Proposals.",
                    "Repurposing FM: Radio Nowhere to OSNs Everywhere.",
                    "Storytelling with Data: Examining the Use of Data by Non-Profit Organizations.",
                    "Collaborative Analytics and Brokering in Digital Humanitarian Response.",
                    "Early Adopters of the Internet and Social Media in Cuba.",
                    "Embedding Intentions in Drawings: How Architects Craft and Curate Drawings to Achieve Their Goals.",
                    "Infrastructuring and the Challenge of Dynamic Seams in Mobile Knowledge Work.",
                    "Understanding Energy Consumption at Work: Learning from Arrow Hill.",
                    "A Fundamentally Confused Document: Situation Reports and the Work of Producing Humanitarian Information.",
                    "\"Thanks for your interest in our Facebook group, but it's only for dads: \" Social Roles of Stay-at-Home Dads.",
                    "Not at the Dinner Table: Parents¿ and Children¿s Perspectives on Family Technology Rules.",
                    "Managing Expectations: Technology Tensions among Parents and Teens.",
                    "Mom, I Do Have a Family!: Attitudes, Agreements, and Expectations on the Interaction with Chilean Older Adults.",
                    "TryFilm: Situated Support for Interactive Media Productions.",
                    "YouthTube: Youth Video Authorship on YouTube and Vine.",
                    "Remixing as a Pathway to Computational Thinking.",
                    "Reality and Perception of Copyright Terms of Service for Online Content Creation.",
                    "Once More with Feeling: Supportive Responses to Social Sharing on Facebook.",
                    "Playful Backstalking and Serious Impression Management: How Young Adults Reflect on their Past Identities on Facebook.",
                    "\"Just Cast the Net, and Hopefully the Right Fish Swim into It\": Audience Management on Social Network Sites.",
                    "What¿s in a Like? Attitudes and behaviors around receiving Likes on Facebook.",
                    "Convivial Decay: Entangled Lifetimes in a Geriatric Infrastructure.",
                    "Citation and Attribution in Open Science: A Case Study.",
                    "Considering Time in Designing Large-Scale Systems for Scientific Computing.",
                    "Community-based Data Validation Practices in Citizen Science.",
                    "Promoting Joint Attention with Computer Supported Collaboration in Children with Autism.",
                    "Vulnerability, Sharing, and Privacy: Analyzing Art Therapy for Older Adults with Dementia.",
                    "How Blind People Interact with Visual Content on Social Networking Services.",
                    "\"Helping Others Makes Me Happy\": Social Interaction and Integration of People with Disabilities.",
                    "ReLauncher: Crowdsourcing Micro-Tasks Runtime Controller.",
                    "Precision CrowdSourcing: Closing the Loop to Turn Information Consumers into Information Contributors.",
                    "Learnersourcing Personalized Hints.",
                    "Parting Crowds: Characterizing Divergent Interpretations in Crowdsourced Annotation Tasks.",
                    "Using Mobile Phones in Pub Talk.",
                    "Automatic Archiving versus Default Deletion: What Snapchat Tells Us About Ephemerality in Design.",
                    "Privacy Nudges for Mobile Applications: Effects on the Creepiness Emotion and Privacy Attitudes.",
                    "Increasing Collocated People¿s Awareness of the Mobile User¿s Activities: a Field Trial of Social Displays.",
                    "Beyond Talking Heads: Multimedia Artifact Creation, Use, and Sharing in Distributed Meetings.",
                    "Room2Room: Enabling Life-Size Telepresence in a Projected Augmented Reality Environment.",
                    "Taking Notes or Playing Games? Understanding Multitasking in Video Communication.",
                    "A Day in the Life of Things in the Home.",
                    "Scaffolding the scaffolding: Supporting children¿s social-emotional learning at home.",
                    "Moving Western Neighborliness to East? A study on Local Exchange in Bangladesh.",
                    "Social Organization of Household Finance: Understanding Artful Financial Systems in the Home."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "CSCW 2015",
        "info": "Vancouver, BC, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/cscw/2016c",
                "sub_name": "Proceedings of the 19th ACM Conference on Computer Supported Cooperative Work and Social Computing, CSCW 2015, San Francisco, CA, USA, February 27 - March 2, 2016, Companion Volume.",
                "count": 125,
                "papers": [
                    "First Life, the Neighborhood Social Network: a Collaborative Environment for Citizens.",
                    "SEeS@W: Internet of Persons meets Internet of Things for Safety at Work.",
                    "MixMeetWear: Live Meetings at a Glance.",
                    "IdeaGens: Enabling Expert Facilitation of Crowd Brainstorming.",
                    "PostScholar: Surfacing Social Signals in Google Scholar Search.",
                    "AutoStyle: Toward Coding Style Feedback At Scale.",
                    "I Understand Your Frustration.",
                    "DiscoverySpace: Crowdsourced Suggestions Onboard Novices in Complex Software.",
                    "Exploring Controversy in Twitter.",
                    "Leveraging Learners for Teaching Programming and Hardware Design at Scale.",
                    "CATS: Collection and Analysis of Tweets Made Simple.",
                    "Spatial and Social Connectedness in Web-based Work Collaboration.",
                    "A Speech Speed Awareness System for Non-Native Speakers.",
                    "Social Display...We Can See What You Are Doing On Your Mobile Device.",
                    "Facilitating Collaborative Problem-Solving with Computer-Supported Causal Mapping.",
                    "Webstrates: demonstrating the potential of Shareable Dynamic Media.",
                    "CIRCLE ROUND; Flexible Communication using Multiple Access at Face-to-Face Meeting.",
                    "Stitched Groupies: A Playful Self-Photo Co-creation Activity.",
                    "Oppia: A Community of Peer Learners to Make Conversational Learning Experiences.",
                    "Green2.0: Enabling Complex Interactions Between Buildings and People.",
                    "cLuster: Applications for Smart Clustering of Free-Hand Sketches.",
                    "Gaming for Science: A Demo of Online Experiments on VolunteerScience.com.",
                    "Well-Connected: Promoting Collaboration by Effective Networking.",
                    "CityCompass: A Collaborative Online Language Learning Application.",
                    "IdeaHound: Self-sustainable Idea Generation in Creative Online Communities.",
                    "Oh, I Love Trash: Personality of a Robotic Trash Barrel.",
                    "Movement: A Secure Community Awareness Application and Display.",
                    "GroupLink: Group Event Recommendations Using Personal Digital Traces.",
                    "Coding Varied Behavior Types Using the Crowd.",
                    "Confer: A Conference Recommendation and Meetup Tool.",
                    "Eyebrowse: Selective and Public Web Activity Sharing.",
                    "A Study of Cyberbullying Detection and Mitigation on Instagram.",
                    "Connecting Older Adults through Voice-Based Interfaces.",
                    "Theory Driven Community Analytics and Influence on Community Success.",
                    "Large-scale Volunteer Engagement in Humanitarian Mapping.",
                    "Collective Creativity through a Micro-Tasks Crowdsourcing Approach.",
                    "Understand the Design and Implementation of Civic Technologies in Public Organizations.",
                    "Social Sharing at Scale.",
                    "Design for User Autonomy in the System-Driven Personalization of Social Media.",
                    "Measuring and Managing Information Diets of Social Media Users : Research Overview.",
                    "Global Software Development: Exploring Multiplicity and Asymmetric Dynamics in Collaborative Work.",
                    "Safety through Collaboration: A New Challenge for Automotive Design.",
                    "Designing Computer Supported Collaborative Applications for UnderServed Indian Children.",
                    "How People Write Together Now: Exploring and Supporting Today's Computer-Supported Collaborative Writing.",
                    "Supporting Information Sharing and Presentation across Distributed Emergency Medical Settings.",
                    "Visibility in Digital Space: Controlling Personal Information Online.",
                    "Robots As Cooperative Partners... We Hope...",
                    "Innovations in autonomous systems: Challenges and opportunities for human-agent collaboration.",
                    "Does the Sharing Economy do any Good?",
                    "What did we get right and wrong about CSCW during the past 30 years?",
                    "Constantly connected: At what price and with what rewards?",
                    "Practice-based CSCW Research: ECSCW bridging across the Atlantic.",
                    "Designing Paralinguistic Digital Affordances for Social Support.",
                    "MET: An Enterprise Market for Tasks.",
                    "Film Ties: Crowd-sourced Teaching of Cinematography Using Intelligent Example Galleries.",
                    "Sharing, Human Values, and Computer Activity Tracking.",
                    "Motivational Impact of Facebook Posts on Environmental Communities.",
                    "Time Management Application: Insights on French and Chinese Collaboration.",
                    "Social Incentives in Pervasive Fitness Apps for Obese and Diabetic patients.",
                    "Beyond Official: Government Information Work through Personal Accounts.",
                    "Using Gamification to Tackle the Cold-Start Problem in Recommender Systems.",
                    "LeadWise: Using Online Bots to Recruite and Guide Expert Volunteers.",
                    "When did my childhood become an art exhibit?!",
                    "Making Games as Collaborative Social Experiences: Exploring An Online Gaming Community.",
                    "@Stake: A Game to Facilitate the Process of Deliberative Democracy.",
                    "TeleTourist: Immersive Telepresence Tourism for Mobility-Restricted Participants.",
                    "Quantifying Toxicity and Verbal Violence on Twitter.",
                    "Collab-ChiQat: A Collaborative Remaking of a Computer Science Intelligent Tutoring System.",
                    "Analyzing Lexical Expressions in an Human-Agent Online Explanation Task: Influence of Affect and Characteristics.",
                    "A Journey of Citizen Science Data in an Online Environment.",
                    "What a Surprise: Initial Connection with Coworkers on Facebook and Expectancy Violations.",
                    "Encouraging Work in Citizen Science: Experiments in Goal Setting and Anchoring.",
                    "Why Do Teammates Hate Me? Cross-Cultural Tensions and Social Dynamics in Online Games.",
                    "CODer Entrepreneurs: How Entrepreneurs can benefit from a Dynamic Social Semantic Tagging System.",
                    "TickTockRun: Towards Enhancing Communication in Runner Families.",
                    "Hands-Free Collaboration Using Telepresence Robots for All Ages.",
                    "Mining Shapes of Expertise in Online Social Q&A Communities.",
                    "Designing a New System for Sharing Computer Science Teaching Resources.",
                    "Designing Shared Gaze Awareness for Remote Collaboration.",
                    "Tactile Teacher: Enhancing Traditional Piano Lessons with Tactile Instructions.",
                    "Why Developers Are Slacking Off: Understanding How Software Teams Use Slack.",
                    "Exploring Computational Composite: An Approach To Sensorial Interaction.",
                    "WASSUP? LOL : Characterizing Out-of-Vocabulary Words in Twitter.",
                    "Mining Twitter Conversations around E-commerce Promotional Events.",
                    "Encount'r: Exploring Passive Context-Awareness for Opportunistic Social Matching.",
                    "Product X: An Output-Agreement Game for Product Perceptual Mapping.",
                    "An Architecture for Social Sharing and Collaboration around Open Data Visualisations.",
                    "Feeling Distance: An Investigation of Mediated Social Touch Prototypes.",
                    "Game-theoretic models identify useful principles for peer collaboration in online learning platforms.",
                    "Sustaining Reciprocity: Generating Social Capital within Peer-Support Communities.",
                    "Enticing Casual Nature Preserve Visitors into Citizen Science via Photos.",
                    "Testing Higher-Order Network Structures in an Online Experiment.",
                    "Asian American Chicago Network: A Case Study of Facebook Group Use By Immigrant Groups.",
                    "Crowdfunding: Applying Collective Indexing of Emotions to Campaign Videos.",
                    "Thinking in 4D: Preserving and Sharing Mental Context Across Time.",
                    "Towards a Framework for Collaborative Video Surveillance System Using Crowdsourcing.",
                    "GreenDesigners: Gamified Ubiquitous Learning for Sustainable Engineering Design.",
                    "Webizing Mixed Reality for Cooperative Augmentation of Life Experience.",
                    "Identifying and Characterizing Sleeping Beauties on YouTube.",
                    "Situation-aware communication method based on contextual info.",
                    "Human Process Design: Mediate between People and Help Them to Look into the Future.",
                    "Exploring Engagement in a 'Social Crowd' on Twitter.",
                    "BotViz: Data Visualizations for Collaborations With Bots and Volunteers.",
                    "The role of outsiders in consensus formation: A case study of Yelp.",
                    "How Social Annotation Affects Second Language Reading.",
                    "Optil.io: Cloud Based Platform For Solving Optimization Problems Using Crowdsourcing Approach.",
                    "LBSNShield: Malicious Account Detection in Location-Based Social Networks.",
                    "Today's Life Style and Yesterday's Life Experience: A Study of Financial Practices of Retirees In China.",
                    "Group Finder: Finding the \"Right\": Online Support Groups for People in Recovery.",
                    "Curiosity vs. Control: Impacts of Training on Performance of Teams Working with Robots.",
                    "Design Illustrations to Make Adoption of Ola Technology More Beneficial for Indian Auto-Rickshaw Drivers.",
                    "Where did my Office go? Is it in the Cloud!? Workshop on Spatial and Social Connectedness in Virtual and Mediated Work Environments.",
                    "Collocated Interaction: New Challenges in 'Same Time, Same Place' Research.",
                    "Collaborative Appropriation: How Couples, Teams, Groups and Communities Adapt and Adopt Technologies.",
                    "Deceptive/Honest/Unreliable/Reliable? Unpacking Social Signaling Theory for Social Computing Systems Analysis and Design.",
                    "Breaking into new Data-Spaces: Infrastructure for Open Community Science.",
                    "CSCW and theSharing Economy\": The Future of Platforms as Sites of Work Collaboration and Trust \".",
                    "Designing online experiments: Citizen science approaches to research.",
                    "Collaboration and Decision Making in Crisis Situations.",
                    "Data-work in Healthcare: The New Work Ecologies of Healthcare Infrastructures.",
                    "Toward a Typology of Participation in Crowdwork.",
                    "Let's Talk About the Quantified Workplace.",
                    "Developing a Research Agenda for Human-Centered Data Science.",
                    "Algorithms at Work: Empirical Diversity, Analytic Vocabularies, Design Implications.",
                    "Large-scale Collaborative Projects to Affect Societal Change."
                ]
            },
            {
                "sub_name_abbr": "conf/cscw/2015",
                "sub_name": "Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing, CSCW 2015, Vancouver, BC, Canada, March 14 - 18, 2015.",
                "count": 163,
                "papers": [
                    "The Facebook Study: A Personal Account of Data Science, Ethics and Change.",
                    "Understanding the Effects of Crowdfunding on Entrepreneurial Self-Efficacy.",
                    "Crowds on Wall Street: Extracting Value from Collaborative Investing Platforms.",
                    "Crowdfunding Science: Sharing Research with an Extended Audience.",
                    "Reliving the Past & Making a Harmonious Society Today: A Study of Elderly Electronic Hackers in China.",
                    "Hacking Culture, Not Devices: Access and Recognition in Feminist Hackerspaces.",
                    "Worship, Faith, and Evangelism: Religion as an Ideological Lens for Engineering Worlds.",
                    "Authenticity, Relatability and Collaborative Approaches to Sharing Knowledge about Assistive Living Technology.",
                    "To Risk or Not to Risk?: Improving Financial Risk Taking of Older Adults by Online Social Information.",
                    "Wireless Visions: Infrastructure, Imagination, and US Spectrum Policy.",
                    "Understanding Copyright Law in Online Creative Communities.",
                    "Emotion Map: A Location-based Mobile Social System for Improving Emotion Awareness and Regulation.",
                    "MoodLight: Exploring Personal and Social Implications of Ambient Display of Biosensor Data.",
                    "Social Sharing of Emotions on Facebook: Channel Differences, Satisfaction, and Replies.",
                    "Coordination-Artifacts Suiting: When Plans are in the Midst of Ordering Systems.",
                    "From The Matrix to a Model of Coordinated Action (MoCA): A Conceptual Framework of and for CSCW.",
                    "The Effects of View Portals on Performance and Awareness in Co-Located Tabletop Groupware.",
                    "The Perverse Effects of Social Transparency on Online Advice Taking.",
                    "An Agent for Deception Detection in Discussion Based Environments.",
                    "Characterizing Online Rumoring Behavior Using Multi-Dimensional Signatures.",
                    "Capture the Moment: \"In the Wild\" Longitudinal Case Study of Situated Snapshots Captured Through an Urban Screen in a Community Setting.",
                    "Measuring Urban Deprivation from User Generated Content.",
                    "Avoiding the South Side and the Suburbs: The Geography of Mobile Crowdsourcing Markets.",
                    "Connecting in the Kitchen: An Empirical Study of Physical Interactions while Cooking Together at Home.",
                    "Taking our Time: Chronic Illness and Time-Based Objects in Families.",
                    "\"Preventative\" vs. \"Reactive\": How Parental Mediation Influences Teens' Social Media Privacy Behaviors.",
                    "\"This is a Throwaway Account\": Temporary Technical Identities and Perceptions of Anonymity in a Massive Online Community.",
                    "Models and Patterns of Trust.",
                    "Privacy as Articulation Work in HIV Health Services.",
                    "Designing for Discomfort: Supporting Critical Reflection through Interactive Tools.",
                    "Collective Smile: Measuring Societal Happiness from Geolocated Images.",
                    "Engagement and Well-being on Social Network Sites.",
                    "PaperChains: Dynamic Sketch+Voice Annotations.",
                    "Piloting TrACE: Exploring Spatiotemporal Anchored Collaboration in Asynchronous Learning.",
                    "Learnersourcing Subgoal Labels for How-to Videos.",
                    "From Personal Tool to Community Resource: What's the Extra Work and Who Will Do It?",
                    "(Re)defining Land Change Science through Synthetic Research Practices.",
                    "Anticipation Work: Cultivating Vision in Collective Practice.",
                    "Social Eye Tracking: Gaze Recall with Online Crowds.",
                    "Strategic Voting Behavior in Doodle Polls.",
                    "Structuring, Aggregating, and Evaluating Crowdsourced Design Critique.",
                    "Back in Sight, Back in Mind: Picture-Centric Support for Mobile Counseling Sessions.",
                    "Designing Mobile Experiences for Collocated Interaction.",
                    "Searchable Objects: Search in Everyday Conversation.",
                    "Supporting Developers' Coordination in the IDE.",
                    "'Is' to 'Was': Coordination and Commemoration in Posthumous Activity on Wikipedia Biographies.",
                    "Don't Wait!: How Timing Affects Coordination of Crowdfunding Donations.",
                    "Manifestation of Depression and Loneliness on Social Networks: A Case Study of Young Adults on Facebook.",
                    "Coming of Age (Digitally): An Ecological View of Social Media Use among College Students.",
                    "Risk-taking as a Learning Process for Shaping Teen's Online Information Privacy Behaviors.",
                    "Flock: Hybrid Crowd-Machine Learning Classifiers.",
                    "Bridge the Gap!: What Can Work Design in Crowdwork Learn from Work Design Theories?",
                    "And Now for Something Completely Different: Improving Crowdsourcing Workflows with Micro-Diversions.",
                    "CURIOS: Connecting Community Heritage through Linked Data.",
                    "Restructuring Human Infrastructure: The Impact of EHR Deployment in a Volunteer-Dependent Clinic.",
                    "Expertise in the Wired Wild West.",
                    "Exiting the Design Studio: Leveraging Online Participants for Early-Stage Design Feedback.",
                    "Procid: Bridging Consensus Building Theory with the Practice of Distributed Design Discussions.",
                    "Content and Network Dynamics Behind Egyptian Political Polarization on Twitter.",
                    "Exploring the Ownership and Persistent Value of Facebook Content.",
                    "Participatory Militias: An Analysis of an Armed Movement's Online Audience.",
                    "MoodBar: Increasing New User Retention in Wikipedia through Lightweight Socialization.",
                    "The Success and Failure of Quality Improvement Projects in Peer Production Communities.",
                    "The Effects of Visualizing Activity History on Attitudes and Behaviors in a Peer Production Context.",
                    "\"You Never Call, You Never Write\": Call and SMS Logs Do Not Always Indicate Tie Strength.",
                    "Dwelling Places in KakaoTalk: Understanding the Roles and Meanings of Chatrooms in Mobile Instant Messengers.",
                    "Collaborative Affordances of Hybrid Patient Record Technologies in Medical Work.",
                    "Visible but Unseen?: A Workplace Study of Blood-Test Icons on Electronic Emergency-Department Whiteboards.",
                    "Comparing Health Information Sharing Preferences of Cancer Patients, Doctors, and Navigators.",
                    "They Said What?: Exploring the Relationship Between Language Use and Member Satisfaction in Communities.",
                    "Turkers, Scholars, \"Arafat\" and \"Peace\": Cultural Communities and Algorithmic Gold Standards.",
                    "Dissecting a Social Botnet: Growth, Content and Influence in Twitter.",
                    "Two is Better Than One: Improving Multilingual Collaboration by Giving Two Machine Translation Outputs.",
                    "In the Flow, Being Heard, and Having Opportunities: Sources of Power and Power Dynamics in Global Teams.",
                    "Why Replacing Legacy Systems Is So Hard in Global Software Development: An Information Infrastructure Perspective.",
                    "Mood Squeezer: Lightening up the Workplace through Playful and Lightweight Interactions.",
                    "Focused, Aroused, but so Distractible: Temporal Perspectives on Multitasking and Communications.",
                    "The Importance of Publicly Available Social Networking Sites (SNSs) to Entrepreneurs.",
                    "Toward Collaborative Ideation at Scale: Leveraging Ideas from Others to Generate More Creative and Diverse Ideas.",
                    "Towards an Appropriable CSCW Tool Ecology: Lessons from the Greatest International Scavenger Hunt the World Has Ever Seen.",
                    "Digital Entanglements: Craft, Computation and Collaboration in Fine Art Furniture Production.",
                    "Connected Through Crisis: Emotional Proximity and the Spread of Misinformation Online.",
                    "Think Local, Retweet Global: Retweeting by the Geographically-Vulnerable during Hurricane Sandy.",
                    "What to Expect When the Unexpected Happens: Social Media Communications Across Crises.",
                    "Do Birds of a Feather Watch Each Other?: Homophily and Social Surveillance in Location Based Social Networks.",
                    "There's No Such Thing as the Perfect Map: Quantifying Bias in Spatial Crowd-sourcing Datasets.",
                    "Monetizing Network Hospitality: Hospitality and Sociability in the Context of Airbnb.",
                    "Snack Buddy: Supporting Healthy Snacking in Low Socioeconomic Status Families.",
                    "I Would Like To..., I Shouldn't..., I Wish I...: Exploring Behavior-Change Goals for Social Networking Sites.",
                    "Understanding the Roles and Influences of Mediators from Multiple Social Channels for Health Behavior Change.",
                    "Is It Good to Be Like Wikipedia?: Exploring the Trade-offs of Introducing Collaborative Editing Model to Q&A Sites.",
                    "Functional Roles and Career Paths in Wikipedia.",
                    "The Virtuous Circle of Wikipedia: Recursive Measures of Collaboration Structures.",
                    "Talkabout: Making Distance Matter with Small Groups in Massive Classes.",
                    "Massive Open Online Proctor: Protecting the Credibility of MOOCs certificates.",
                    "Structuring Interactions for Large-Scale Synchronous Peer Learning.",
                    "The Editor's Eye: Curation and Comment Relevance on the New York Times.",
                    "Navigating Imagined Audiences: Motivations for Participating in the Online Public Sphere.",
                    "Content, Context, and Critique: Commenting on a Data Visualization Blog.",
                    "Disclosure, Stress, and Support During Gender Transition on Facebook.",
                    "Simulating Marriage: Gender Roles and Emerging Intimacy in an Online Game.",
                    "Outnumbered but Well-Spoken: Female Commenters in the New York Times.",
                    "Predicting a Community's Flu Dynamics with Mobile Phone Data.",
                    "Spending Time with Money: From Shared Values to Social Connectivity.",
                    "NUGU: A Group-based Intervention App for Improving Self-Regulation of Limiting Smartphone Use.",
                    "Studying and Modeling the Connection between People's Preferences and Content Sharing.",
                    "Using Groups of Items to Bootstrap New Users in Recommender Systems.",
                    "Understanding Online Reviews: Funny, Cool or Useful?",
                    "Shared Calendars for Home Health Management.",
                    "Collaboration in-between: The Care Hotel and Designing for Flexible Use.",
                    "The Modern Day Baby Book: Enacting Good Mothering and Stewarding Privacy on Facebook.",
                    "Computer Support for Financial Advisors and Their Clients: Co-creating an Investment Plan.",
                    "Coercing into Completeness in Financial Advisory Service Encounters.",
                    "On Becoming a Counsellor: Challenges and Opportunities to Support Interpersonal Skills Training.",
                    "Strangers at the Gate: Gaining Access, Building Rapport, and Co-Constructing Community-Based Research.",
                    "Increasing the Reach of Snowball Sampling: The Impact of Fixed versus Lottery Incentives.",
                    "LabintheWild: Conducting Large-Scale Online Experiments With Uncompensated Samples.",
                    "Social Barriers Faced by Newcomers Placing Their First Contribution in Open Source Software Projects.",
                    "Mudslinging and Manners: Unpacking Conflict in Free and Open Source Software.",
                    "Towards Understanding Relational Orientation: Attachment Theory and Facebook Activities.",
                    "The Role of Social Influence in Security Feature Adoption.",
                    "Give Social Network Users the Privacy They Want.",
                    "Making Time.",
                    "Circumscribed Time and Porous Time: Logics as a Way of Studying Temporality.",
                    "Designing for Temporal Awareness: The Role of Temporality in Time-Critical Medical Teamwork.",
                    "Friendship Maintenance in the Digital Age: Applying a Relational Lens to Online Social Interaction.",
                    "Clinical Questions in Online Health Communities: The Case of \"See your doctor\" Threads.",
                    "Creating Value Together: The Emerging Design Space of Peer-to-Peer Currency and Exchange.",
                    "Forum77: An Analysis of an Online Health Forum Dedicated to Addiction Recovery.",
                    "\"I'm Not Like My Friends\": Understanding How Children with a Chronic Illness Use Technology to Maintain Normalcy.",
                    "Individual and Social Recognition: Challenges and Opportunities in Migraine Management.",
                    "A Framework for Understanding and Designing Telepresence.",
                    "Not Really There: Understanding Embodied Communication Affordances in Team Perception and Participation.",
                    "Making Decisions From a Distance: The Impact of Technological Mediation on Riskiness and Dehumanization.",
                    "Engaging Around Neighborhood Issues: How Online Communication Affects Offline Behavior.",
                    "The Group Context Framework: An Extensible Toolkit for Opportunistic Grouping and Collaboration.",
                    "Using Multiple Contexts to Detect and Form Opportunistic Groups.",
                    "From \"nobody cares\" to \"way to go!\": A Design Framework for Social Sharing in Personal Informatics.",
                    "A Classroom Study of Using Crowd Feedback in the Iterative Design Process.",
                    "From Awareness to Empowerment: Using Design Fiction to Explore Paths towards a Sustainable Energy Future.",
                    "Paper-Digital Workflows in Global Development Organizations.",
                    "KrishiPustak: A Social Networking System for Low-Literate Farmers.",
                    "Accessible Crowdwork?: Understanding the Value in and Challenge of Microtask Employment for People with Disabilities.",
                    "Illegitimate Civic Participation: Supporting Community Activists on the Ground.",
                    "(Infra)structures of Volunteering.",
                    "Planning with Crowdsourced Data: Rhetoric and Representation in Transportation Planning.",
                    "\"I LOVE THIS SITE!\" vs. \"It's a little girly\": Perceptions of and Initial User Experience with Pinterest.",
                    "The Diffusion of Support in an Online Social Movement: Evidence from the Adoption of Equal-Sign Profile Pictures.",
                    "Do I Need To Follow You?: Examining the Utility of The Pinterest Follow Mechanism.",
                    "Transition and Reflection in the Use of Health Information: The Case of Pediatric Bone Marrow Transplant Caregivers.",
                    "Spaceship Launch: Designing a Collaborative Exergame for Families.",
                    "Making \"Safe\": Community-Centered Practices in a Virtual World Dedicated to Children with Autism.",
                    "The Effects of Pay-to-Quit Incentives on Crowdworker Task Quality.",
                    "Motivating Multi-Generational Crowd Workers in Social-Purpose Work.",
                    "Handheld or Handsfree?: Remote Collaboration via Lightweight Head-Mounted Displays and Handheld Devices.",
                    "A User-Powered American Sign Language Dictionary.",
                    "Enhancing Evaluation of Potential Dates Online Through Paired Collaborative Activities.",
                    "Games for Crowds: A Crowdsourcing Game Platform for the Enterprise.",
                    "Collective Intelligence or Group Think?: Engaging Participation Patterns in World without Oil.",
                    "Understanding Student Motivation, Behaviors and Perceptions in MOOCs.",
                    "Open Education in the Wild: The Dynamics of Course Production in the Peer 2 Peer University.",
                    "The Emergence of GitHub as a Collaborative Platform for Education.",
                    "Algorithms in our Midst: Information, Power and Choice when Software is Everywhere."
                ]
            },
            {
                "sub_name_abbr": "conf/cscw/2015c",
                "sub_name": "18th ACM Conference on Computer Supported Cooperative Work & Social Computing, CSCW 2015, Vancouver, BC, Canada, March 14-18, 2015, Companion Volume.",
                "count": 77,
                "papers": [
                    "Terminal Group Formation with Detection of Relative Position Using Camera Image Recognition.",
                    "coDNA: Visualizing Peer Production Processes.",
                    "Harnessing Twitter and Crowdsourcing to Augment Aurora Forecasting.",
                    "Dual Sided Tablet Supporting Doctor-Patient Interaction.",
                    "Freaky: Collaborative Enactments of Emotion.",
                    "Moodsource: Enabling Perceptual and Emotional Feedback from Crowds.",
                    "Experiment on Emotional Exchange Method through Phone Stack Game.",
                    "I Don't Think We've Met: Encouraging Collaboration via Topic-Based Search.",
                    "DADS System: Distributed Approach to Digital Affinity Diagram Collaboration.",
                    "Alone Together: A Multiplayer Augmented Reality Online Ball Passing Game.",
                    "Collaboration Map: Visualizing Temporal Dynamics of Small Group Collaboration.",
                    "KrishiPustak: A Social Networking System for Low-Literate Farmers.",
                    "Getting Things Started in Cooperative Photography.",
                    "Scalable Mixed-Focus Collaborative Difficulty Resolution: A Demonstration.",
                    "Thesis Writer: A System for Supporting Academic Writing.",
                    "Method of Generating a Drawing by Crowdsourced Microtasks.",
                    "FeedVis: A Path for Exploring News Feed Curation Algorithms.",
                    "Using TwitterTrails.com to Investigate Rumor Propagation.",
                    "Designing a Micro-Volunteering Platform for Situated Crowdsourcing.",
                    "Doctoral Colloquium - Open-Source Culture: The Production & Politics of Distributed Creative Peer Production.",
                    "Enacting Care Through Collaboration in Communities of Makers.",
                    "Enhancing Community Heritage Empowerment through Wiki Software.",
                    "Parsing a Network: Unpacking Counter Normative Actors from Multi-Network Systems.",
                    "Adoption and Adaptation of Data Science in Oceanography.",
                    "The App in Everyday Life: Research Overview for Doctoral Colloquium.",
                    "Culture-aware Q&A Environments.",
                    "Modeling Clinical Workflow in Daily ICU Rounds to Support Task-based Patient Monitoring and Care.",
                    "Investigating the Different Characteristics of Group Mirrors.",
                    "CRA-E Panel on Undergraduate Research.",
                    "Studying the \"Sharing Economy\": Perspectives to Peer-to-Peer Exchange.",
                    "Facebooking in \"Face\": Complex Identities Meet Simple Databases.",
                    "Sociomateriality and Design.",
                    "Online Dating as Pandora's Box: Methodological Issues for the CSCW Community.",
                    "Collective Problem Solving: Features and affordances of creative online communities.",
                    "Socio-technical Computation.",
                    "Pro-Active Detection of Content Quality in TurboTax AnswerXchange.",
                    "Live-Feedback Supported Collaborative Environment for Emergency Scenarios.",
                    "Shuriken: User Grouping and Data Transfer for Collaborative Shopping and Offline Meetings Based on Inter-Device Relative Positioning.",
                    "\"It's Raining Dispersants\": Collective Sensemaking of Complex Information in Crisis Contexts.",
                    "Strictly by the Facebook: Unobtrusive Method for Differentiating Users.",
                    "When to Break the Ice: Self-disclosure Strategies for Newcomers in Online Communities.",
                    "Being Thrifty on a $100K Wage: Austerity in Family Finances.",
                    "Can Gamification Motivate Voluntary Contributions?: The Case of StackOverflow Q&A Community.",
                    "CommunityConnect: An Interactive Display for Educational Residential Settings.",
                    "Askalot: Community Question Answering as a Means for Knowledge Sharing in an Educational Organization.",
                    "Evaluating Groupware Prototypes with Discount Methods.",
                    "Alone Together: Multiplayer Online Ball Passing using Kinect - An Experimental Study.",
                    "Is 'Additional' Effort Always Negative?: Understanding Discretionary Work in Interpersonal Communications.",
                    "The Solicitation Situation: Examining the Language of Team Science in Federally-Funded Research.",
                    "Undergraduates' Team Work Strategies in Writing Research Proposals.",
                    "Technology Stewardship, Text Messaging, and Collaboration in Agricultural Work: Preliminary Results from an Action Research Study in Sri Lanka.",
                    "The Family Board: An Information Sharing System for Family Members.",
                    "Improving Coordination of Care Centers for the Elderly through IT Support.",
                    "Understanding Data Providers in a Global Scientific Data Hub.",
                    "An Analysis of Social Features Associated with Room Sales of Airbnb.",
                    "neonion: Combining Human and Machine Intelligence.",
                    "Computer-Supported Preference Awareness in Negotiation Teams for Fostering Accurate Joint Priorities.",
                    "Depression-related Imagery on Instagram.",
                    "Motivating Crowds to Volunteer Neighborhood Data.",
                    "From Community Networks to Hyper-local Social Media.",
                    "Pinteresce: Exploring Reminiscence as an Incentive to Digital Reciprocity for Older Adults.",
                    "The Team Multiple Errands Test: A Platform to Evaluate Distributed Teams.",
                    "The Coaching Companion: Computer-Mediated Instructional Coaching.",
                    "tApp: A Tumblr Analytics System.",
                    "Participatory Stoves: Designing Renewable Energy Technologies for the Rural Sector.",
                    "Effects of a Wikipedia Orientation Game on New User Edits.",
                    "The Future of Networked Privacy: Challenges and Opportunities.",
                    "Moving Beyond e-Health and the Quantified Self: The Role of CSCW in Collaboration, Community and Practice for Technologically-Supported Proactive Health and Wellbeing.",
                    "Supporting Cities, Neighborhoods, and Local Communities with Information and Communication Technologies.",
                    "Let's Talk About Sex (Apps), CSCW.",
                    "Ethics for Studying Online Sociotechnical Systems in a Big Data World.",
                    "Advancing an Industry/Academic Partnership Model for Open Collaboration Research.",
                    "Doing CSCW Research in Latin America: Differences, Opportunities, Challenges, and Lessons Learned.",
                    "Feminism and Feminist Approaches in Social Computing.",
                    "Collaboration and Social Computing in Emerging Financial Services.",
                    "Connecting Collaborative & Crowd Work with Online Education.",
                    "\"Local Remote\" Collaboration: Applying Remote Group AwarenessTechniques to Co-located Settings."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "CSCW 2014",
        "info": "Baltimore, MD, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/cscw/2014",
                "sub_name": "Computer Supported Cooperative Work, CSCW '14, Baltimore, MD, USA, February 15-19, 2014.",
                "count": 136,
                "papers": [
                    "Making a difference in and through playful design.",
                    "Help is on the way: patterns of responses to resource requests on facebook.",
                    "To search or to ask: the routing of information needs between traditional search engines and social networks.",
                    "What do teens ask their online social networks?: social search practices among high school students.",
                    "Coordinating donors on crowdfunding websites.",
                    "The language that gets people to give: phrases that predict success on kickstarter.",
                    "Understanding the role of community in crowdfunding work.",
                    "Smart Face: enhancing creativity during video conferences using real-time facial deformation.",
                    "Towards a questionnaire for measuring affective benefits and costs of communication technologies.",
                    "How social cues shape task coordination and communication.",
                    "Planet hunters and seafloor explorers: legitimate peripheral participation through practice proxies in online citizen science.",
                    "Study of electronic lab notebook design and practices that emerged in a collaborative scientific environment.",
                    "Reconciling rhythms: plans and temporal alignment in collaborative scientific work.",
                    "Building loyalty to online communities through bond and identity-based attachment to sub-groups.",
                    "Ethnography of scaling, or, how to a fit a national research infrastructure in the room.",
                    "Enabling relationship building in tabletop-supported advisory settings.",
                    "Can you hear me now?: mitigating the echo chamber effect by source position indicators.",
                    "Deep Twitter diving: exploring topical groups in microblogs at scale.",
                    "Characterizing the life cycle of online news stories using social media reactions.",
                    "Being a turker.",
                    "The motivations and experiences of the on-demand mobile workforce.",
                    "Information extraction and manipulation threats in crowd-powered systems.",
                    "How physicians 'achieve overview': a case-based study in a hospital ward.",
                    "Privacy practices in collaborative environments: a study of emergency department staff.",
                    "Institutional logics of the EMR and the problem of 'perfect' but inaccurate accounts.",
                    "\"it's in your spinal cord, it's in your fingertips\": practices of tools and craft in building software.",
                    "Cultivating practice & shepherding technology use: supporting appropriation among unanticipated users.",
                    "Designing for repair?: infrastructures and materialities of breakdown.",
                    "Fast, functional, and fitting: expert response dynamics and response quality in an online newcomer help forum.",
                    "How social Q&A sites are changing knowledge sharing in open source software communities.",
                    "Collaborative problem solving: a study of MathOverflow.",
                    "Creepy but inevitable?: the evolution of social networking.",
                    "Understanding employee social media chatter with enterprise social pulse.",
                    "Most liked, fewest friends: patterns of enterprise social media use.",
                    "Understanding individuals' personal values from social media word use.",
                    "Cursing in English on twitter.",
                    "How to see values in social computing: methods for studying values dimensions.",
                    "De-virtualizing social events: understanding the gap between online and offline participation for event invitations.",
                    "Awkward encounters of an \"other\" kind: collective self-presentation and face threat on facebook.",
                    "\"You can't block people offline\": examining how facebook's affordances shape the disclosure process.",
                    "Family matters: control and conflict in online family history production.",
                    "\"Our life is the farm and farming is our life\": home-work coordination in organic farm families.",
                    "Account sharing in the context of networked hospitality exchange.",
                    "Achieving convergence in operational transformation: conditions, mechanisms and systems.",
                    "Exhaustive search of puzzles in operational transformation.",
                    "A partial replication approach for anywhere anytime mobile commenting.",
                    "Monitoring email to indicate project team performance and mutual attraction.",
                    "Editing beyond articles: diversity & dynamics of teamwork in open collaborations.",
                    "Playing well with virtual classmates: relating avatar design to group satisfaction.",
                    "The kernel of a research infrastructure.",
                    "The policy knot: re-integrating policy, practice and design in cscw studies of social computing.",
                    "Can plans and situated actions be replicated?",
                    "Social structure and depression in TrevorSpace.",
                    "Characterizing and predicting postpartum depression from shared facebook data.",
                    "Books as a social technology.",
                    "Framing the conversation: the role of facebook conversations in shopping for eyeglasses.",
                    "Remote shopping advice: enhancing in-store shopping with social technologies.",
                    "Specialization, homophily, and gender in a social curation site: findings from pinterest.",
                    "Making it \"pay a bit better\": design challenges for micro rural enterprise.",
                    "The role of data in aligning the 'unique identity' infrastructure in India.",
                    "Enriching the distressing reality: social media use by chinese migrant workers.",
                    "The role of founders in building online groups.",
                    "The communication patterns of technical leaders: impact on product development team performance.",
                    "Ensemble: exploring complementary strengths of leaders and crowds in creative collaboration.",
                    "The perception of others: inferring reputation from social media in the enterprise.",
                    "Supporting task resumption using visual feedback.",
                    "Geographical and organizational distances in enterprise crowdfunding.",
                    "Teammate inaccuracy blindness: when information sharing tools hinder collaborative analysis.",
                    "Collaborative web search in context: a study of tool use in everyday tasks.",
                    "Modeling search processes using hidden states in collaborative exploratory web search.",
                    "Romantic partnerships and the dispersion of social ties: a network analysis of relationship status on facebook.",
                    "Facebook makes the heart grow fonder: relationship maintenance strategies among geographically dispersed and communication-restricted connections.",
                    "\"Real, but Glossy\": technology and the practical pursuit of magic in modern weddings.",
                    "Digital mobilization in disaster response: the work & self-organization of on-line pet advocates in response to hurricane sandy.",
                    "Collaboration surrounding beacon use during companion avalanche rescue.",
                    "Designing for the deluge: understanding & supporting the distributed, collaborative work of crisis volunteers.",
                    "Beyond end user content to collaborative knowledge mapping: interrelations among community social tools.",
                    "Think globally, act locally: a case study of a free food sharing community and social networking.",
                    "From rookie to all-star: professional development in a graphic design social networking site.",
                    "Mind the map: the impact of culture and economic affluence on crowd-mapping behaviours.",
                    "Aesthetic capital: what makes london look beautiful, quiet, and happy?",
                    "Leveraging the contributory potential of user feedback.",
                    "A comparison of social, learning, and financial strategies on crowd engagement and output quality.",
                    "Motivating contribution in a participatory sensing system via quid-pro-quo.",
                    "Crowd synthesis: extracting categories and clusters from complex data.",
                    "Standing on the schemas of giants: socially augmented information foraging.",
                    "The antecedents of remix.",
                    "Remixers' understandings of fair use online.",
                    "Unsupervised classification and visualization of unstructured text for the support of interdisciplinary collaboration.",
                    "Pair research: matching people for collaboration, learning, and productivity.",
                    "Supporting group interactions in museum visiting.",
                    "Trustworthy by design.",
                    "Tracking serendipitous interactions: how individual cultures shape the office.",
                    "Capturing the mood: facebook and face-to-face encounters in the workplace.",
                    "Social influences on secure development tool adoption: why security tools spread.",
                    "\"Figure out how to code with the hands of others\": recognizing cultural blind spots in global software development.",
                    "Articulation spaces: bridging the gap between formal and informal coordination.",
                    "Everyday dwelling with WhatsApp.",
                    "Enhancing community awareness of and participation in local heritage with a mobile application.",
                    "GEMS: the design and evaluation of a location-based storytelling game.",
                    "VidWiki: enabling the crowd to improve the legibility of online educational videos.",
                    "Should your MOOC forum use a reputation system?",
                    "Integrating on-demand fact-checking with public dialogue.",
                    "Tweet acts: how constituents lobby congress via Twitter.",
                    "Catalyst: triggering collective action with thresholds.",
                    "Competing or aiming to be average?: normification as a means of engaging digital volunteers.",
                    "Capturing quality: retaining provenance for curated volunteer monitoring data.",
                    "Understanding factors of successful engagement around energy consumption between and among households.",
                    "Adolescent online safety: the \"moral\" of the story.",
                    "Social networking site use by mothers of young children.",
                    "TalkBetter: family-driven mobile intervention care for children with language delay.",
                    "Giving is caring: understanding donation behavior through email.",
                    "Civic action brokering platforms: facilitating local engagement with ACTion Alexandria.",
                    "MyPosition: sparking civic discourse by a public interactive poll visualization.",
                    "How players value their characters in world of warcraft.",
                    "The effects of consistency maintenance methods on player experience and performance in networked games.",
                    "The identification of deviance and its impact on retention in a multiplayer game.",
                    "Quick and dirty: streamlined 3D scanning in archaeology.",
                    "Support for deictic pointing in CVEs: still fragmented after all these years'.",
                    "Photoportals: shared references in space and time.",
                    "Managing political differences in social media.",
                    "Social media supporting political deliberation across multiple public spheres: towards depolarization.",
                    "Hybrid media consumption: how tweeting during a televised political debate influences the vote decision.",
                    "Voyant: generating structured feedback on visual designs using a crowd of non-experts.",
                    "Reviewing versus doing: learning and performance in crowd assessment.",
                    "AskSheet: efficient human computation for decision making with spreadsheets.",
                    "Cancer navigation: opportunities and challenges for facilitating the breast cancer journey.",
                    "Craving, creating, and constructing comfort: insights and opportunities for technology in hospice.",
                    "Life transitions and online health communities: reflecting on adoption, use, and disengagement.",
                    "City, self, network: transnational migrants and online identity work.",
                    "Twitter ain't without frontiers: economic, social, and cultural boundaries in international communication.",
                    "Inferring the origin locations of tweets with quantitative confidence.",
                    "Exploring the social-technological gap in telesurgery: collaboration within distributed or teams.",
                    "How beliefs about the presence of machine translation impact multilingual collaborations.",
                    "Sounds of silence: exploring contributions to conversations, non-responses and the impact of mediating technologies in triple space.",
                    "Next generation humanitarian computing."
                ]
            },
            {
                "sub_name_abbr": "conf/cscw/2014c",
                "sub_name": "Computer Supported Cooperative Work, CSCW '14, Baltimore, MD, USA, February 15-19, 2014, Companion Volume.",
                "count": 88,
                "papers": [
                    "CommonTies: a context-aware nudge towards social interaction.",
                    "A collaborative game to study the perception of presence during virtual co-location.",
                    "kARbon: a collaborative MR web application for communicationsupport in construction scenarios.",
                    "FAST: forecast and analytics of social media and traffic.",
                    "USGS iCoast - did the coast change?: designing a crisis crowdsourcing App to validate coastal change models.",
                    "CrowdCrit: crowdsourcing and aggregating visual design critique.",
                    "Research strategy generation: avoiding academic 'animal farm'.",
                    "Visiting the 'lie-brary' exploring data engagement as participant incentive.",
                    "TweetDrops: a visualization to foster awareness and collective learning of sustainability.",
                    "A system for receiving crowd feedback on visual designs.",
                    "SoBot: facilitating conversation using social media data and a social agent.",
                    "Values and negotiation in classification work.",
                    "Copyright and social norms in communities of content creation.",
                    "Cultural trails in social media.",
                    "Emerging innovation: the global expansion of seed accelerators.",
                    "Studying the application of mobile technology to local communities.",
                    "Specializing social networking services for young adults with autism.",
                    "Display design to support awareness during emergency medical teamwork.",
                    "Is there a place for serendipitous introductions?",
                    "Rethinking the peer review process.",
                    "Supporting collaborative care in an emergency department (ED) through patient awareness.",
                    "Designing effective strategies for human-robot collaboration.",
                    "Where the paddle meets the stream: bridging systems design theory and community-based monitoring practice.",
                    "Connecting students and families for support during the college transition.",
                    "Software developers are humans, too!",
                    "Understanding & advancing collaborative scientific knowledge creation.",
                    "Computational social science: CSCW in the social media era.",
                    "The ethos and pragmatics of data sharing.",
                    "Making cultures: building things & building communities.",
                    "Lifestyle teleworkers speak out!",
                    "Facebook in the developing world: the myths and realities underlying a socially networked world.",
                    "A visual interactive environment for enhancing collaboration between engineers for the safety analysis mechanisms in embedded systems.",
                    "From implicit to explicit knowledge: a tool for preserving and sharing mental links in science.",
                    "Selfies for science: collaborative configurations around ScienceKit.",
                    "Gamifying citizen science: a study of two user groups.",
                    "Conceptual distance matters when building on others' ideas in crowd-collaborative innovation platforms.",
                    "CSCW in the healthcare enterprise: a knowledge domain visualization.",
                    "What motivates members to contribute to enterprise online communities?",
                    "Differences in technology use to support community crime prevention.",
                    "GeoTagger: a collaborative and participatory environmental inquiry system.",
                    "My friends are here!: why talk to \"strangers\"?",
                    "The effects of individualized feedback on college students' contributions to citizen science.",
                    "Open collaboration becomes art: innovative pro-bono participation over social media.",
                    "Defining the price of hospitality: networked hospitality exchange via Airbnb.",
                    "Understanding in-situ social media use at music festivals.",
                    "Collaborative online research platform for scholars in humanities.",
                    "Email inbox management by information overloaded users.",
                    "Values levers and the unintended consequences of design.",
                    "A study on the implementation of large-scale home telemonitoring service.",
                    "Now here or nowhere: conflict resolution strategies for intimate relationship in diverse geographical contexts.",
                    "NatureNet: a model for crowdsourcing the design of citizen science systems.",
                    "The economics of contribution in a large enterprise-scale wiki.",
                    "Crowdsourcing for grammatical error correction.",
                    "Information, sharing and support in pregnancy: addressing needs for mHealth design.",
                    "Investigating OSN users' privacy strategies with in-situ observation.",
                    "Achieve: evaluating the impact of progress logging and social feedback on goal achievement.",
                    "Sensing stress network for social coping.",
                    "Does motivation in citizen science change with time and culture?",
                    "The properties of Twitter network communications among teenagers.",
                    "Do recommendations matter?: news recommendation in real life.",
                    "DrumGenius: bridging learning-gap with interactive musical instruments.",
                    "Using physical signaling to support collaborative mobile search.",
                    "Designing the default privacy settings for facebook applications.",
                    "How groups of people interact with each other on Twitter during academic conferences.",
                    "Documents and distributed scientific collaboration.",
                    "Crystallization: how social media facilitates social construction of reality.",
                    "Exploring the ecosystem of software developers on GitHub and other platforms.",
                    "Collaborative interpretation in land change science meta-studies.",
                    "Can you marry me?: conceptualizing in-game marriage as intimacy-mediated collaboration.",
                    "Impression management through communication in online dating.",
                    "The development and real-world application of FROG, the fun robotic outdoor guide.",
                    "Tumblr fandoms, community & culture.",
                    "The family room: a multi-camera, multi-display family media space.",
                    "Shared geocaching over distance with mobile video streaming.",
                    "Serefind: a crowd-powered search engine.",
                    "Global software development in a CSCW perspective.",
                    "Co-creating & identity-making in CSCW: revisiting ethics in design research.",
                    "Structures for knowledge co-creation between organisations and the public: (cop2014).",
                    "Back to the future of organizational work: crowdsourcing and digital work marketplaces.",
                    "OCData Hackathon @ CSCW 2014: online communities data hackathon.",
                    "Feminism and social media research.",
                    "Advancing methodologies for cross- cultural studies of collaborative systems.",
                    "Designing futures for peer-to-peer learning @ CSCW.",
                    "The fourteenth international workshop on collaborative editing systems.",
                    "Designing with users for domestic environments: methods - challenges - lessons learned.",
                    "Collaboration and coordination in the context of informal care (CCCiC 2014).",
                    "Quick and dirty: lightweight methods for heavyweight research.",
                    "Sharing, re-use and circulation of resources in cooperative scientific work."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "CSCW 2013",
        "info": "San Antonio, TX, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/cscw/2013",
                "sub_name": "Computer Supported Cooperative Work, CSCW 2013, San Antonio, TX, USA, February 23-27, 2013.",
                "count": 141,
                "papers": [
                    "Path dependent network advantage.",
                    "Digital democracy: how the internet re-elected a president.",
                    "Closure vs. structural holes: how social network information and culture affect choice of collaborators.",
                    "Effect of message content on communication processes in intercultural and same-culture instant messaging conversations.",
                    "\"Facebook is a luxury\": an exploratory study of social media use in rural Kenya.",
                    "Doodle around the world: online scheduling behavior reflects cultural differences in time perception and group decision-making.",
                    "Local-universality: designing EMR to support localized informal documentation practices.",
                    "Re-coordinating activities: an investigation of articulation work in patient transfers.",
                    "Shared decision making needs a communication record.",
                    "Caring for caregivers: designing for integrality.",
                    "Mutual assessment in the social programmer ecosystem: an empirical investigation of developer profile aggregators.",
                    "Impression formation in online peer production: activity traces and personal profiles in github.",
                    "Shared prolepsis and intersubjectivity in open source development: expansive grounding in distributed work.",
                    "Activity traces and signals in software developer recruitment and hiring.",
                    "KinectArms: a toolkit for capturing and displaying arm embodiments in distributed tabletop groupware.",
                    "The mocking gaze: the social organization of kinect use.",
                    "\"almost touching\": parent-child remote communication using the sharetable system.",
                    "Sometimes when we touch: how arm embodiments change reaching and collaboration on digital tables.",
                    "Recalibrating the ratio: enacting accountability in intimate relationships using shared calendars.",
                    "Audio-enhanced paper photos: encouraging social interaction at age 105.",
                    "Electric agents: fostering sibling joint media engagement through interactive television and augmented reality.",
                    "\"Back and forth, back and forth\": channel switching in romantic couple conflict.",
                    "Radiator: context propagation based on delayed aggregation.",
                    "An online experiment of privacy authorization dialogues for social applications.",
                    "What a tangled web we weave: lying backfires in location-sharing social media.",
                    "Mining smartphone data to classify life-facets of social relationships.",
                    "Mining social relationship types in an organization using communication patterns.",
                    "Understanding affect in the workplace via social media.",
                    "Statistical affect detection in collaborative chat.",
                    "Voluntary turnover in a distributed work setting: an examination of the role of spatial propinquity and role similarity in project affiliation networks.",
                    "Analyzing the flow of knowledge in computer mediated teams.",
                    "Representation and communication: challenges in interpreting large social media datasets.",
                    "A multi-level analysis of the impact of shared leadership in diverse virtual teams.",
                    "Friends FTW! friendship and competition in halo: reach.",
                    "Media technologies and learning in the starcraft esport community.",
                    "Functional or social?: exploring teams in online games.",
                    "ExerSync: facilitating interpersonal synchrony in social exergames.",
                    "Meanings and boundaries of scientific software sharing.",
                    "Beyond trust and reliability: reusing data in collaborative cancer epidemiology research.",
                    "Explaining field differences in openness and sharing in scientific communities.",
                    "Incentives and integration in scientific software production.",
                    "Designing for reflection and collaboration to support a transition from welfare to work.",
                    "Hollaback!: the role of storytelling online in a social movement organization.",
                    "Working and sustaining the virtual \"Disaster Desk\".",
                    "Community-oriented spoken web browser for low iiterate users.",
                    "ACES: a cross-discipline platform and method for communication and language research.",
                    "Understanding visual attention of teams in dynamic medical settings through vital signs monitor use.",
                    "Privacy management in dynamic groups: understanding information privacy in medical practices.",
                    "Non-static nature of patient consent: shifting privacy perspectives in health information sharing.",
                    "Globally distributed system developers: their trust expectations and processes.",
                    "Microblog credibility perceptions: comparing the USA and China.",
                    "She gets a sports car from our donation: rumor transmission in a Chinese microblogging community.",
                    "Trust in online news: comparing social media and official media use by chinese citizens.",
                    "Putting ubiquitous crowd-sourcing into context.",
                    "Pay by the bit: an information-theoretic metric for collective human judgment.",
                    "Enhancing reliability using peer consistency evaluation in human computation.",
                    "Quality control mechanisms for crowdsourcing: peer review, arbitration, & expertise at familysearch indexing.",
                    "Indebtedness, reciprocity, and fairness in local online exchange.",
                    "Consequences of content diversity for online public spaces for local communities.",
                    "Finger on the pulse: identifying deprivation using transit flow analysis.",
                    "Digital neighborhood watch: investigating the sharing of camera data amongst neighbors.",
                    "Complementarity of input devices to achieve knowledge sharing in meetings.",
                    "Dependency-conflict detection in real-time collaborative 3D design systems.",
                    "Xpointer: an x-ray telepointer for relaxed-space-time wysiwis and unconstrained collaborative 3d design systems.",
                    "Drawing practices in image-enabled collaboration.",
                    "Understanding how the projection of availability state impacts the reception incoming communication.",
                    "How and why teenagers use video chat.",
                    "Butler lies from both sides: actions and perceptions of unavailability management in texting.",
                    "Virtually dining together in time-shifted environment: KIZUNA design.",
                    "The post that wasn't: exploring self-censorship on facebook.",
                    "Widespread underprovision on Reddit.",
                    "Users and nonusers: interactions between levels of adoption and social capital.",
                    "Uses & gratifications of a facebook media sharing group.",
                    "\"Welcome!\": social and psychological predictors of volunteer socializers in online communities.",
                    "Tea and sympathy: crafting positive new user experiences on wikipedia.",
                    "Making peripheral participation legitimate: reader engagement experiments in wikipedia.",
                    "Using edit sessions to measure participation in wikipedia.",
                    "Structures of broken ties: exploring unfollow behavior on twitter.",
                    "What's congress doing on twitter?",
                    "Is news sharing on Twitter ideologically biased?",
                    "Tweets are forever: a large-scale quantitative analysis of deleted tweets.",
                    "Understanding informal communication in multilingual contexts.",
                    "Lost in transmittance: how transmission lag enhances and deteriorates multilingual collaboration.",
                    "Machine translation vs. common language: effects on idea exchange in cross-lingual groups.",
                    "\"Could someone please translate this?\": activity analysis of wikipedia article translation by non-experts.",
                    "Social navigation for loosely-coupled information seeking in tightly-knit groups using webwear.",
                    "Analyzing the quality of information solicited from targeted strangers on social media.",
                    "Personality-targeted design: theory, experimental procedure, and preliminary results.",
                    "Photographer paths: sequence alignment of geotagged photos for exploration-based route planning.",
                    "Supporting creative collaboration in globally distributed companies.",
                    "Redistributing leadership in online creative collaboration.",
                    "From organizational to community creativity: paragon leadership & creativity stories at etsy.",
                    "The cost of collaboration for code and art: evidence from a remixing community.",
                    "The promise and peril of real-time corrections to political misperceptions.",
                    "Your process is showing: controversy management and perceived quality in wikipedia.",
                    "Arguments about deletion: how experience improves the acceptability of arguments in ad-hoc online task groups.",
                    "Keeping eyes on the prize: officially sanctioned rule breaking in mass collaboration systems.",
                    "Designing collaboration: comparing cases exploring cultural probes as boundary-negotiating objects.",
                    "Medication management in the making: on ethnography-design relations.",
                    "Why CSCW needs science policy (and vice versa).",
                    "What is a file?",
                    "Supporting a sense of connectedness: meaningful things in the lives of new university students.",
                    "An exploration on long-distance communications between left-behind children and their parents in China.",
                    "Revisiting the relationship between reunion and technology-mediated separation in periodically transitioning families.",
                    "Exploring remembrance and social support behavior in an online bereavement support group.",
                    "Collaborative search revisited.",
                    "Online silk road: nurturing social search through knowledge bartering.",
                    "Real-time crowd labeling for deployable activity recognition.",
                    "Who wants to know?: question-asking and answering practices among facebook users.",
                    "Investigating the appropriateness of social network question asking as a resource for blind users.",
                    "Contributor profiles, their dynamics, and their importance in five q&a sites.",
                    "To answer or not: what non-qa social activities can tell.",
                    "Factors influencing the response rate in social question and answering behavior.",
                    "Crowd vs. crowd: large-scale cooperative design through open team competition.",
                    "Co-worker transparency in a microtask marketplace.",
                    "EmailValet: managing email overload through private, accountable crowdsourcing.",
                    "The future of crowd work.",
                    "Going digital: understanding paper and photo documentation practices in early childhood education.",
                    "Experiences2Go: sharing kids' activities outside the home with remote family members.",
                    "Opportunities via extended networks for teens' informal learning.",
                    "I want to be Sachin Tendulkar!: a spoken english cricket game for rural students.",
                    "Trend makers and trend spotters in a mobile application.",
                    "I need someone to help!: a taxonomy of helper-finding activities in the enterprise.",
                    "Combining social information for academic networking.",
                    "User-centric evaluation of a K-furthest neighbor collaborative filtering recommender algorithm.",
                    "'On the ground' in Sidi Bouzid: investigating social media use during the tunisian revolution.",
                    "Using facebook after losing a job: differential benefits of strong and weak ties.",
                    "Major life changes and behavioral markers in social media: case of childbirth.",
                    "The new war correspondents: he rise of civic media curation in urban warfare.",
                    "Sensr: evaluating a flexible framework for authoring mobile data-collection tools for citizen science.",
                    "Comparing the use of social networking and traditional media channels for promoting citizen science.",
                    "Free as in puppies: compensating for ict constraints in citizen science.",
                    "Form factor matters.",
                    "Managing mobile multitasking: the culture of iPhones on stanford campus.",
                    "Designing an effective vibration-based notification interface for mobile phones.",
                    "Emergent roles in decision-making tasks using group chat.",
                    "Appropriation by unanticipated users: looking beyond design intent and expected use.",
                    "The work of developing cyberinfrastructure middleware projects.",
                    "Come drive with me: an ethnographic study of driver-passenger pairs to inform future in-car assistance.",
                    "Exploring pet video chat: the remote awareness and interaction needs of families with dogs and cats.",
                    "Engaging robots: easing complex human-robot teamwork using backchanneling."
                ]
            },
            {
                "sub_name_abbr": "conf/cscw/2013c",
                "sub_name": "Computer Supported Cooperative Work, CSCW 2013, San Antonio, TX, USA, February 23-27, 2013, Companion Volume.",
                "count": 74,
                "papers": [
                    "ResearchBroker: connecting researchers to real-world research opportunities.",
                    "Next step: an online community to support parents in their transition to work.",
                    "InterLACE: interactive learning and collaboration environment.",
                    "Leveraging partner's insights for distributed collaborative sensemaking.",
                    "Attire: conveying information exposure through avatar apparel.",
                    "Truthy: enabling the study of online social networks.",
                    "ExerSync: interpersonal synchrony in social exergames.",
                    "PopCore: a system for network-centric recommendation.",
                    "Overview for doctoral colloquium.",
                    "The afterlife of identity.",
                    "ICT practices by voluntary groups: a multi-setting study.",
                    "Modeling teamwork of multi-human multi-agent teams.",
                    "Are computers merely \"supporting\" cooperative work: towards an ethnography of bot development.",
                    "Combating homophily through design.",
                    "Understanding the role of technology in parent-child reunion.",
                    "Fairness in the division and completion of collaborative work.",
                    "Impression formation in social work-sharing sites.",
                    "Designing a collective-intelligence system for evaluating complex, crowd-generated intellectual artifacts.",
                    "Uncovering motives for social networking site use among practitioners at non-profit organizations.",
                    "The role of communication channel and self-esteem in romantic couple conflict.",
                    "Micro-volunteering: helping the helpers in development.",
                    "Community, impact and credit: where should i submit my papers?",
                    "Bursting your (filter) bubble: strategies for promoting diverse exposure.",
                    "Facilitating students' collaboration and learning in a question and answer system.",
                    "Using mature children living apart to improve parents' medication compliance.",
                    "A voice-based input system for embedded applications with constrained operating conditions.",
                    "A serious game supporting collaboration.",
                    "Tools for predicting drop-off in large online classes.",
                    "\"Third eye\": designing eye gaze visualizations for online shopping social recommendations.",
                    "Herding in open source software development: an exploratory study.",
                    "Photos for documentation and communication in early childhood.",
                    "Indicoder: an extensible system for online annotation.",
                    "Coordination in highly-specialized care networks.",
                    "Motivating crowds using social facilitation and social transparency.",
                    "HandsinAir: a wearable system for remote collaboration on physical tasks.",
                    "Understanding the potential of social questions in the web search.",
                    "Public spheres: ideas taking shape.",
                    "Collaboration on a large-scale, multi-touch display: asynchronous interaction and multiple-input use.",
                    "Preliminary user study for gratitude and reciprocity in a q&a system.",
                    "The effect of interaction modality for facial-constrained robots in domestic environment.",
                    "Explorations of geocaching in the virtual world of second life.",
                    "An input-process-output model of shared understanding in partially distributed conceptual design teams.",
                    "Catching fish in the stream: real time analysis of audience behavior in social media.",
                    "YPhone: applying generation y interactions into an office context.",
                    "Video chat with multiple cameras.",
                    "#TwitterPlay: a case study of fan roleplaying online.",
                    "The half sky effect: competitive Chinese females.",
                    "How to support coordination through annotations?: a longitudinal case study of nurses' work in an oncology hospital.",
                    "Geowiki + route analysis = improved transportation planning.",
                    "Augmented virtual identities: facilitating rehabilitation and societal reconnect.",
                    "Network effects and valuing social network services.",
                    "A content analysis of wikiproject discussions: toward a typology of coordination language used by virtual teams.",
                    "Mosaic-type work support system using touchscreen computers for senior people.",
                    "Limber: exploring motivation in a workplace exergame.",
                    "Bridging the digital divide through facebook friendships: a cross-cultural study.",
                    "The militarization of teamwork in alternate reality gaming.",
                    "\"I'd have to vote against you\": issue campaigning via twitter.",
                    "A 3D approach to recommender system evaluation.",
                    "A social crowd-controlled orchestra.",
                    "Gracoli: a graphical command line user interface.",
                    "Head-mounted and multi-surface displays support emergency medical teams.",
                    "Sonoba: on-the-spot information sharing.",
                    "Ding-dong: a marriage partner-finding system with social support.",
                    "Peek: context sharing on request with notifications.",
                    "HomeProxy: a physical proxy for video messaging in the home.",
                    "Social media question asking workshop.",
                    "The thirteenth international workshop on collaborative editing systems.",
                    "Trust in virtual teams: theory and tools.",
                    "Beyond formality: informal communication in health practices.",
                    "CrowdCamp 2013: rapidly iterating crowd ideas.",
                    "Measuring networked social privacy.",
                    "Collaborative information seeking: consolidating the past, creating the future.",
                    "Better safe than sorry: collaboration in safety-critical environments.",
                    "CSCW and education: viewing education as a site of work practice."
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "CSCW 2012",
        "info": "Seattle, WA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/cscw/2012c",
                "sub_name": "CSCW '12 Computer Supported Cooperative Work, Seattle, WA, USA, February 11-15, 2012.",
                "count": 167,
                "papers": [
                    "The penguin and the leviathan: towards cooperative human systems design.",
                    "Broader impacts: research you can use.",
                    "Science, technology and society revisited: what is happening to anthropology and ethnography?",
                    "(How) will the revolution be retweeted?: information diffusion and the 2011 Egyptian uprising.",
                    "The Egyptian blogosphere: a counter-narrative of the revolution.",
                    "'facebooking' towards crisis recovery and beyond: disruption as an opportunity.",
                    "Blogs as a collective war diary.",
                    "\"Beacons of hope\" in decentralized coordination: learning from on-the-ground medical twitterers during the 2010 Haiti earthquake.",
                    "Relief work after the 2010 Haiti earthquake: leadership in an online resource coordination network.",
                    "How and to whom people share: the role of culture in self-disclosure in online communities.",
                    "Cultural appropriation: information technologies as sites of transnational imagination.",
                    "\"This is how we do it in my country\": a study of computer-mediated family communication among kenyan migrants in the united states.",
                    "Adapting collaborative radiological practice to low-resource environments.",
                    "Repair worlds: maintenance, repair, and ICT for development in rural Namibia.",
                    "How did you feel during our conversation?: retrospective analysis of intercultural and same-culture instant messaging conversations.",
                    "Supporting traditional music-making: designing for situated discretion.",
                    "A gift from the city: mobile phones in rural China.",
                    "The joy of cheques: trust, paper and eighty somethings.",
                    "Practices of information and secrecy in a punk rock subculture.",
                    "One piece at a time: why video-based communication is better for negotiation and conflict resolution.",
                    "Hospital robot at work: something alien or an intelligent colleague?",
                    "Psychology of user experience in a collaborative video-conference system.",
                    "Recognizing team context during simulated missions.",
                    "Participation in an online mathematics community: differentiating motivations to add.",
                    "Dynamic changes in motivation in collaborative citizen-science projects.",
                    "Engaging new digital locals with interactive urban screens to collaboratively improve the city.",
                    "Between us and them: building connectedness within civic networks.",
                    "Unfolding the event landscape on twitter: classification and exploration of user categories.",
                    "Fresh faces in the crowd: turnover, identity, and commitment in online groups.",
                    "We don't need no stinkin' badges: examining the social role of badges in the huffington post.",
                    "Lurking as personal trait or situational disposition: lurking and contributing in enterprise social media.",
                    "Question temporality: identification and uses.",
                    "Bootstrapping wikis: developing critical mass in a fledgling community by seeding content.",
                    "Supporting reflective public thought with ConsiderIt.",
                    "Barter: mechanism design for a market incented wisdom exchange.",
                    "Puget sound off: fostering youth civic engagement through citizen journalism.",
                    "What do you think?: a case study of benefit, expectation, and interaction in a large online critique community.",
                    "Learning the lingo?: gender, prestige and linguistic adaptation in review communities.",
                    "Your space or mine?: community management and user participation in a chinese corporate blogging community.",
                    "Socializing volunteers in an online community: a field experiment.",
                    "Diagnostic work in cloud computing: discussion forums, community and troubleshooting.",
                    "In case you missed it: benefits of attendee-shared annotations for non-attendees of remote meetings.",
                    "Markup as you talk: establishing effective memory cues while still contributing to a meeting.",
                    "SketchComm: a tool to support rich and flexible asynchronous communication of early design ideas.",
                    "Contents and contexts: disclosure perceptions on facebook.",
                    "Technology-mediated contributions: editing behaviors among new wikipedians.",
                    "Conflict, criticism, or confidence: an empirical examination of the gender gap in wikipedia contributions.",
                    "What do you think?: the structuring of an online community as a collective-sensemaking process.",
                    "Classroom Wikipedia participation effects on future intentions to contribute.",
                    "Effectiveness of shared leadership in online communities.",
                    "Coordination and beyond: social functions of groups in open content production.",
                    "Do editors or articles drive collaboration?: multilevel statistical network analysis of wikipedia coauthorship.",
                    "Learning from history: predicting reverted work at the word level in wikipedia.",
                    "Tweeting is believing?: understanding microblog credibility perceptions.",
                    "Social transparency in networked information exchange: a theoretical framework.",
                    "Friends, romans, countrymen: lend me your URLs. using social chatter to personalize web search.",
                    "Who gives a tweet?: evaluating microblog content value.",
                    "Prescriptive persuasion and open-ended social awareness: expanding the design space of mobile health.",
                    "Briefing news reporting with mobile assignments: perceptions, needs and challenges.",
                    "Mixing metaphors in mobile remote presence.",
                    "HappyGo: a field trial of local group buying.",
                    "Culturally based design: embodying trans-surface interaction in rummy.",
                    "Evaluating the effectiveness of height visualizations for improving gestural communication at distributed tabletops.",
                    "A comparison of competitive and cooperative task performance using spherical and flat displays.",
                    "A model for the design of interactive systems based on activity theory.",
                    "\"I'm just here to play games\": social dynamics and sociality in an online game site.",
                    "Remix and play: lessons from rule variants in texas hold'em and halo 2.",
                    "Communication channels and awareness cues in collocated collaborative time-critical gaming.",
                    "Verbal coordination in first person shooter games.",
                    "Infrastructural experiences: an empirical study of an online arcade game platform in China.",
                    "Metaphors for social relationships in 3d virtual worlds.",
                    "Come meet me at Ulduar: progression raiding in world of warcraft.",
                    "Designing online games for real-life relationships: examining QQ farm in intergenerational play.",
                    "Integrating local and remote worlds through channel blending.",
                    "Designing a social network to support the independence of young adults with autism.",
                    "Building for social translucence: a domain analysis and prototype system.",
                    "Ubiquitous collaborative activity virtual environments.",
                    "Amateur vision and recreational orientation: : creating live video together.",
                    "Investigating effects of visual and tactile feedback on spatial coordination in collaborative handheld systems.",
                    "PicoTales: collaborative authoring of animated stories using handheld projectors.",
                    "Collaborative museums: an approach to co-design.",
                    "People in books: using a FlashCam to become part of an interactive book for connected reading.",
                    "A study of multilingual social tagging of art images: cultural bridges and diversity.",
                    "Bodies in critique: a technological intervention in the dance production process.",
                    "SynTag: a web-based platform for labeling real-time video.",
                    "Finding a new normal: the role of technology in life disruptions.",
                    "An examination of how households share and coordinate the completion of errands.",
                    "Brothers and sisters at play: exploring game play with siblings.",
                    "I love you, let's share calendars: calendar sharing as relationship work.",
                    "Interacting with infrastructure: a case for breaching experiments in home computing research.",
                    "Boundary regulation in social media.",
                    "A case study of non-adoption: the values of location tracking in the family.",
                    "Going to college and staying connected: communication between college freshmen and their parents.",
                    "Impression management work: how seniors with chronic pain address disruptions in their interactions.",
                    "Tracking changes in collaborative writing: edits, visibility and group maintenance.",
                    "Bon voyage: social travel planning in the enterprise.",
                    "A need-driven design approach: addressing latent needs in collaboration rooted in early childhood.",
                    "To stay or leave?: the relationship of emotional and informational support to commitment in online health support groups.",
                    "This is not a one-horse race: understanding player types in multiplayer pervasive health games for youth.",
                    "Collaborative help in chronic disease management: supporting individualized problems.",
                    "Transforming solitary exercises into social exergames.",
                    "Loosely formed patient care teams: communication challenges and technology design.",
                    "Electronic medication management: a socio - technical change process in clinical practice.",
                    "Fragmentation and choreography: caring for a patient and a chart during childbirth.",
                    "The work of play: supporting a pervasive health behavior change intervention for us middle school students.",
                    "Sustaining the development of cyberinfrastructure: an organization adapting to change.",
                    "Cooperative documentation: the patient problem list as a nexus in electronic health records.",
                    "Medical secretaries' care of records: the cooperative work of a non-clinical group.",
                    "Social scientists and cyberinfrastructure: insights from a document perspective.",
                    "Organizing without formal organization: group identification, goal setting and social modeling in directing online production.",
                    "All-for-one and one-for-all?: a multi-level analysis of communication patterns and individual performance in geographically distributed software development.",
                    "The personality of popular facebook users.",
                    "Tracking \"gross community happiness\" from tweets.",
                    "What makes users rate (share, tag, edit...)?: predicting patterns of participation in online communities.",
                    "Recommending routes in the context of bicycling: algorithms, evaluation, and the value of personalization.",
                    "Searching for the goldilocks zone: trade-offs in managing online volunteer groups.",
                    "Asking questions of targeted strangers on social networks.",
                    "Collaboratively crowdsourcing workflows with turkomatic.",
                    "Shepherding the crowd yields better work.",
                    "Community-based web security: complementary roles of the serious and casual contributors.",
                    "CrowdWeaver: visually managing complex crowd work.",
                    "Phrases that signal workplace hierarchy.",
                    "Predicting tie strength in a new medium.",
                    "Tie strength in question & answer on social network sites.",
                    "Removing gamification from an enterprise SNS.",
                    "Setting the stage for interaction: a tablet application to augment group discussion in a seminar class.",
                    "Social visualization and negotiation: effects of feedback configuration and status.",
                    "Taking as an act of sharing.",
                    "Video threads: asynchronous video sharing for temporally distributed teams.",
                    "Patterns of team processes and breakdowns in information analysis tasks.",
                    "Using low cost game controllers to capture data for 6th grade science labs.",
                    "Effects of sharing text selections on gaze cross-recurrence and interaction quality in a pair programming task.",
                    "Micro-coordination: because we did not already learn everything we need to know about working with others in kindergarten.",
                    "See friendship, sort of: how conversation and digital traces might support reflection on friendships.",
                    "The material practices of collaboration.",
                    "Beyond data sharing: artifact ecology of a collaborative nanophotonics research centre.",
                    "Collaboration in open-source hardware: third-party variations on the arduino duemilanove.",
                    "Computer support for collaborative data analysis: augmenting paper affinity diagrams.",
                    "A reference-based scoring model for increasing the findability of promising ideas in innovation pipelines.",
                    "The power of the ask in social media.",
                    "Collaborative workflow for crowdsourcing translation.",
                    "Collaborative design of an oceanographic event logger.",
                    "Inflo: collaborative reasoning via open calculation graphs.",
                    "Predicting creativity in the wild: experience sample and sociometric modeling of teams.",
                    "ConvoCons: a tool for building affinity among distributed team members.",
                    "Facilitating the reuse process in distributed collaboration: a distributed cognition approach.",
                    "Analyzing the structure of the emergent division of labor in multiparty collaboration.",
                    "Awareness as an antidote to distance: making distributed groups cooperative and consistent.",
                    "Distributed scientific group collaboration across biocontainment barriers.",
                    "Remote and alone: coping with being the remote member on the team.",
                    "As if being there: mediated reality for crime scene investigation.",
                    "Social coding in GitHub: transparency and collaboration in an open software repository.",
                    "DiscoTech: a plug-in toolkit to improve handling of disconnection and reconnection in real-time groupware.",
                    "Towards multi-domain collaborative toolkits.",
                    "CoRED: browser-based Collaborative Real-time Editor for Java web applications.",
                    "To talk or not to talk: factors that influence communication around changesets.",
                    "Conflict detection and resolution for product line design in a collaborative decision making environment.",
                    "On the perceived interdependence and information sharing inhibitions of enterprise software engineers.",
                    "A sociotechnical exploration of infrastructural middleware development.",
                    "Proximity: a measure to quantify the need for developers' coordination.",
                    "Software reuse through methodical component reuse and amethodical snippet remixing.",
                    "Information needs for integration decisions in the release process of large-scale parallel development.",
                    "Interactional identity: designers and developers making joint work meaningful and effective.",
                    "Operational transformation for orthogonal conflict resolution in real-time collaborative 2d editing systems.",
                    "Operational transformation for dependency conflict resolution in real-time collaborative 3D design systems.",
                    "Creative conflict resolution in realtime collaborative editing systems.",
                    "Towards self-optimizing collaborative systems."
                ]
            },
            {
                "sub_name_abbr": "conf/cscw/2012",
                "sub_name": "CSCW '12 Computer Supported Cooperative Work, Seattle, WA, USA, February 11-15, 2012 - Companion Volume.",
                "count": 102,
                "papers": [
                    "Personal information management in a socially networked world.",
                    "Data-intensive collaboration in science and engineering.",
                    "Collective intelligence as community discourse and action.",
                    "Mixed reality games.",
                    "Design, influence, and social technologies: techniques, impacts, and ethics.",
                    "Brainstorming design for health: helping patients utilize patient-generated information on the web.",
                    "Workshop summary: collaboration & crisis informatics (CCI'2012).",
                    "Exploring collaboration in challenging environments: from the car to the factory and beyond.",
                    "The future of collaborative software development.",
                    "Reconciling privacy with social media.",
                    "Mastering data-intensive collaboration through the synergy of human and machine reasoning.",
                    "Duet 2012: dual eye tracking in CSCW.",
                    "The twelfth international workshop on collaborative editing systems.",
                    "Learning from marginalized users: reciprocity in HCI4D.",
                    "Domain crossing: how much expertise is enough?",
                    "Some of all human knowledge: gender and participation in peer production.",
                    "Social telepresence bakeoff: Skype group video calling, google+ hangouts, and microsoft avatar kinect.",
                    "SocialMirror: motivating young adults with autism to practice life skills in a social world.",
                    "MoCoMapps: mobile collaborative map-based applications.",
                    "A tool for distributed software design collaboration.",
                    "Innovation cockpit: a dashboard for facilitators in idea management.",
                    "Cohere and XIP: human annotation harnessing machine annotation power.",
                    "A monkey and a stick figure: stories of remixing and social creativity.",
                    "Incentives for emotional multimedia tagging.",
                    "Local experts and online review sites.",
                    "Designing a facilitator's cockpit for an idea management system.",
                    "Ad-itudes: twitter users & advertising.",
                    "From heavyweight framework to lightweight patchwork.",
                    "Hey doc, is that your stethoscope?: increasing engagement in medical education and training with iPads.",
                    "Normative communication processes and associated emotion in mobile health groups.",
                    "Social overlays: augmenting existing UIs with social cues.",
                    "Normative multi-agent approach to support collaborative work in distributed tangible environments.",
                    "I need help!: exploring collaboration in the car.",
                    "Modeling problem difficulty and expertise in stackoverflow.",
                    "Time as a trigger of interaction and collaboration in research teams: a diary study.",
                    "Social networking technologies and organizational knowledge sharing as a sociotechnical ecology.",
                    "Connecting artefacts of R&D teams to their routines: how boundary objects are created and used.",
                    "Using design patterns in collaborative interaction design processes.",
                    "Variations in surgical patient trajectories: challenges for coordination.",
                    "Diversity within the crowd.",
                    "Collaboration and multimedia: identifying equilibrium in the MDT information ecosystem.",
                    "Do collaborators' annotations help or hurt asynchronous analysis.",
                    "From high connectivity to social isolation: communication practices of older adults in the digital age.",
                    "How research funding affects data sharing.",
                    "Framing creative uses for describing cases of appropriation.",
                    "Of joy and gender: emotional expression in online social networks.",
                    "Repair now: collaboration between maintainers, operators and equipment in a cleanroom.",
                    "The effect to quality of creativity with sampling partial data from a large number of idea cards.",
                    "A conceptual model for collaborative scientific writing.",
                    "Effects of context-sensitive delays on group dynamics in 3D virtual worlds.",
                    "Highly sought after: second life continued use.",
                    "Designing interventions to reduce psychological distance in globally distributed teams.",
                    "Glitter: a mixed-methods study of twitter use during glee broadcasts.",
                    "Bribecaster: documenting bribes through community participation.",
                    "Use trend analysis of twitter after the great east japan earthquake.",
                    "Minority voices of crowdsourcing: why we should pay attention to every member of the crowd.",
                    "Dazzle: supporting framing in co-located design teams through remote collaboration tool.",
                    "\"Who should i talk to?\": fostering a spontaneous F2F interaction in a conference.",
                    "Are you exposed?: conveying information exposure.",
                    "Measuring distributed affect in collaborative games.",
                    "Expression of emotion in IM.",
                    "Tweeting for class: using social media to enable student co-construction of lectures.",
                    "Predicting length of membership in online community \"everything2\" using feedback.",
                    "SWAicons: spoken web audio icons - design, implications and evaluation.",
                    "Newcomer integration and learning in OSS technical support communities.",
                    "Let me draw you a picture: coordination in image-enabled conversation.",
                    "Social media and success in open source projects.",
                    "Twitter communications in mass emergency: contributions to situational awareness.",
                    "Exploring automation in digital tabletop board game.",
                    "See it: a scalable location-based game for promoting physical activity.",
                    "A collaborative sketch animation creation system on mobile devices.",
                    "A blog considered from the perspectives of social practice theory.",
                    "Evaluating PresenceScape: a 3D virtual world application to support social awareness and informal communication in distributed teams.",
                    "Mobility in online communities: a case study of mobile BBS in use in China.",
                    "Rationale flower: a visualization tool for identifying hidden profiles in instant messaging.",
                    "Duckling: towards cloud service for scientific collaboration system.",
                    "Dotastic: achieving goals by socializing tasks.",
                    "Improving remote collaboration through side-by-side telepresence.",
                    "LACOME: a multi-user collaboration system for shared large displays.",
                    "A pen-based toolkit for authoring collaborative language activities.",
                    "Photoshop with friends: a synchronous learning community for graphic design.",
                    "PixIO: sharing any surface.",
                    "SaNDVis: visual social network analytics for the enterprise.",
                    "Public curation of a historic collection: a means for speaking safely in public.",
                    "Dig-event: let's socialize around events.",
                    "Socially immature organizations: a typology of social networking systems [SNS] with organizations as users [OAU].",
                    "Hot or not: a qualitative study on ecological impact of social media & fashion consumption.",
                    "Supporting parent-young child activities with interactive tabletops: a conceptual analysis.",
                    "Information & social networks: engineering attitudes & behaviors.",
                    "Breaking news on wikipedia: dynamics, structures, and roles in high-tempo collaboration.",
                    "Craft, computing & culture.",
                    "Gone fishin': information technology in the icelandic fishery.",
                    "Planning in an Italian airport.",
                    "Using teamwork and taskwork to study mixed-focus collaboration.",
                    "Building a standpoints web to support decision-making in wikipedia.",
                    "Crowd computation: organizing information during mass disruption events.",
                    "The use of awareness displays for role clarity in distributed workgroups.",
                    "Social networking technologies and knowledge sharing in organizations.",
                    "Social media at work: structures of collaboration.",
                    "Collective capabilities: building a theory of coordinated collective action in a networked improvement community.",
                    "Creative self-expression in socio-technical systems.",
                    "Multilingual use of twitter: social networks and language choice."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "CSCW 2011",
        "info": "Hangzhou, China",
        "venues": [
            {
                "sub_name_abbr": "conf/cscw/2011",
                "sub_name": "Proceedings of the 2011 ACM Conference on Computer Supported Cooperative Work, CSCW 2011, Hangzhou, China, March 19-23, 2011.",
                "count": 112,
                "papers": [
                    "Urban informatics.",
                    "Technology for emerging markets at MSR india.",
                    "Mixed reality lab Singapore: a genealogy of lab projects employing the blue sky innovation research methodology.",
                    "Microblogging after a major disaster in China: a case study of the 2010 Yushu earthquake.",
                    "Enterprise blogging in a global context: comparing Chinese and American practices.",
                    "Virtual gifts and guanxi: supporting social exchange in a chinese online community.",
                    "Understanding technology choices and values through social class.",
                    "CoupleVIBE: mobile implicit communication to improve awareness for (long-distance) couples.",
                    "(Whose) value-sensitive design: a study of long- distance relationships in an Arabic cultural context.",
                    "Chalk sounds: the effects of dynamic synthesized audio on workspace awareness in distributed groupware.",
                    "Improving visibility of remote gestures in distributed tabletop collaboration.",
                    "A GPU based, projective multi-texturing approach to reconstructing the 3D human form for application in tele-presence.",
                    "The politics of comments: predicting political orientation of news stories with commenters' sentiment patterns.",
                    "\"We will never forget you [online]\": an empirical investigation of post-mortem myspace comments.",
                    "Towards quality discourse in online news comments.",
                    "Empirical software engineering at Microsoft Research.",
                    "Ubiquitous awareness and intelligent solutions lab: Lanzhou University.",
                    "Smarter social collaboration at IBM research.",
                    "Real-time groupware in the browser: testing the performance of web-based networking.",
                    "It's about time: confronting latency in the development of groupware systems.",
                    "Back to the future: a hybrid approach to transparent sharing of video games over the internet in real time.",
                    "Sociable killers: understanding social relationships in an online first-person shooter game.",
                    "\"I'll press play, but I won't listen\": profile work in a music-focused social network service.",
                    "Blog tells what kind of personality you have: egogram estimation from Japanese weblog.",
                    "Contact stratification and deception: blackberry messenger versus SMS use among students.",
                    "From ethnographic study to mixed reality: a remote collaborative troubleshooting system.",
                    "Your time zone or mine?: a study of globally time zone-shifted collaboration.",
                    "Collaborative rhythm: temporal dissonance and alignment in collaborative scientific work.",
                    "Creating a context of trust with ICTs: restoring a sense of normalcy in the environment.",
                    "From diversity to creativity: stimulating group brainstorming with cultural differences and conversationally-retrieved pictures.",
                    "Designing incentives for inexpert human raters.",
                    "Do you want to know?: recommending strangers in the enterprise.",
                    "Browse and discover: social file sharing in the enterprise.",
                    "Look ma, no email!: blogs and IRC as primary and preferred communication tools in a distributed firm.",
                    "Working around official applications: experiences from a large engineering project.",
                    "Organizational acculturation and social networking.",
                    "Photo sharing in diverse distributed teams.",
                    "Increasing commitment to online communities by designing for social presence.",
                    "Thanks and tweets: comparing two public displays.",
                    "It's not that i don't have problems, i'm just not putting them on facebook: challenges and opportunities in using online social networks for health.",
                    "Forget online communities?: revisit cooperative work!",
                    "Peaks and persistence: modeling the shape of microblog conversations.",
                    "Faceted identity, faceted lives: social and technical issues with being yourself online.",
                    "SELECT * FROM USER: infrastructure and socio-technical representation.",
                    "Network properties and social sharing of emotions in social awareness streams.",
                    "Me and my avatar: exploring users' comfort with avatars for workplace communication.",
                    "A tale of two languages: strategic self-disclosure via language selection on facebook.",
                    "With a little help from my friends: can social navigation inform interpersonal privacy preferences?",
                    "\"Not my bug!\" and other reasons for software bug report reassignments.",
                    "Peer interaction effectively, yet infrequently, enables programmers to discover new tools.",
                    "Three sequential positions of query repair in interactions with internet search engines.",
                    "Supporting air traffic control collaboration with a TableTop system.",
                    "See what i'm saying?: using Dyadic Mobile Eye tracking to study collaborative reference.",
                    "Using F-formations to analyse spatial patterns of interaction in physical environments.",
                    "Activity analysis: applying activity theory to analyze complex work in hospitals.",
                    "Coordinating time-critical work with role-tagging.",
                    "Improving communication and social support for caregivers of high-risk infants through mobile technologies.",
                    "Health information use in chronic care cycles.",
                    "The global interaction research initiative at the IT university of Copenhagen, Denmark.",
                    "The multidisciplinary design group in Vienna.",
                    "Engaging with practices: design case studies as a research framework in CSCW.",
                    "Scientific software production: incentives and collaboration.",
                    "Research team integration: what it is and why it matters.",
                    "The value of data: considering the context of production in data economies.",
                    "Scheduling in variable-core collaborative systems.",
                    "ReConMUC: adaptable consistency requirements for efficient large-scale multi-user chat.",
                    "An operational transformation based synchronization protocol for web 2.0 applications.",
                    "Privacy and sharing information on spherical and large flat displays.",
                    "SISO: simple service orchestration (video showcase).",
                    "Communico: overhearing conversations in a virtual office.",
                    "Intercultural collaboration with the language grid toolbox.",
                    "Cambiera: collaborative tabletop visual analytics.",
                    "The video of Xland: two core use cases of 3D blog.",
                    "SPARSH: touch the cloud.",
                    "A real-time tweet diffusion advisor for #Twitter.",
                    "DIADEM: a system for collaborative environmental monitoring.",
                    "MagicMirror: towards enhancing collaborative rehabilitation practices.",
                    "Bidirectional gaze in remote computer mediated collaboration: setup and initial results from pair-programming.",
                    "Towards support for collaborative navigation in complex indoor environments.",
                    "Analyzing patterns in composing teaching materials from the web.",
                    "Web-based multipointer interaction on shared displays.",
                    "Designing for context-aware health self-monitoring, feedback, and engagement.",
                    "Working with 'mission control' in scientific fieldwork: supporting interactions between in situ and distanced collaborators.",
                    "Kinected conference: augmenting video imaging with calibrated depth and audio.",
                    "Surprise Grabber: a co-located tangible social game using phone hand gesture.",
                    "PRIMIExperience: experience sampling via instant messaging.",
                    "Clinical journal: a collaborative shared medical workspace.",
                    "Using multiple scores for transcribing the distributed activities of a family.",
                    "Social Infobox: collaborative knowledge construction by social property tagging.",
                    "i-sensor inference model for assessing trustworthiness in computer-mediated communications.",
                    "Environmental jolts: impact of exogenous factors on online community participation.",
                    "Your and my little sprout.",
                    "Defining ontology by using users collaboration on social media.",
                    "A menu-planning support system to facilitate communication among neighbors.",
                    "The Tree of Knowledge: a localized collective intelligence tool.",
                    "Supporting generation Y interactions: challenges for office work.",
                    "Evaluating a smart working environment with a digital card game prototype.",
                    "Towards requirements engineering for a tumour removing robot: work-practice observation of surgical teams performing brain tumour surgery.",
                    "Eliciting risk perceptions with an online game: preliminary results.",
                    "Are artificial team-mates scapegoats in computer games.",
                    "SPARSH: passing data using the body as a medium.",
                    "Automatic adjustment of a virtual teacher's model in a learning support system.",
                    "Interactions with real and digital elements for collaborative document creation.",
                    "Different time management behaviors of Germans, Chinese and Japanese.",
                    "Intellectual property policy and attractiveness: a longitudinal study of free and open source software projects.",
                    "Temporal patterns of cohesiveness in virtual groups.",
                    "A production monitoring and data processing system for the textile enterprise based on multi-Agent.",
                    "Types of newcomers in an online developer community.",
                    "Study of user interruptibility estimation based on focused application switching.",
                    "A dive into online community properties.",
                    "Express location: supporting coordination of mobile delivery work.",
                    "Integrating Twitter into Wiki to support informal awareness."
                ]
            }
        ]
    },
    {
        "year": "2010",
        "name": "CSCW 2010",
        "info": "Savannah, GA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/cscw/2010",
                "sub_name": "Proceedings of the 2010 ACM Conference on Computer Supported Cooperative Work, CSCW 2010, Savannah, Georgia, USA, February 6-10, 2010.",
                "count": 58,
                "papers": [
                    "\"on my way\": deceptive texting and interpersonal awareness narratives.",
                    "Reading between the lines: linguistic cues to deception in online dating profiles.",
                    "Warrants and deception in computer mediated communication.",
                    "Perceptions of trustworthiness online: the role of visual and textual information.",
                    "Social language network analysis.",
                    "Notifications and awareness: a field study of alert usage and preferences.",
                    "Receptionist or information kiosk: how do people talk with a robot?",
                    "Same places, same things, same people?: mining user similarity on social media.",
                    "Interorganizational coordination and awareness in a nonprofit ecosystem.",
                    "Eliciting and focusing geographic volunteer work.",
                    "An empirical study of critical mass and online community survival.",
                    "Lessons from thoughtswap-ing: increasing participants' coordinative agency in facilitated discussions.",
                    "Throwing voices: the psychological impact of the spatial height of projected voices.",
                    "Exploring spatialized audio & video for distributed conversations.",
                    "Catchup: a useful application of time-travel in meetings.",
                    "Idea expander: supporting group brainstorming with conversationally triggered visual thinking stimuli.",
                    "Socialization tactics in wikipedia and their effects.",
                    "The work of sustaining order in wikipedia: the banning of a vandal.",
                    "Readers are not free-riders: reading as a form of participation on wikipedia.",
                    "Egalitarians at the gate: one-sided gatekeeping practices in social media.",
                    "Home video communication: mediating 'closeness'.",
                    "Making love in the network closet: the benefits and work of family videochat.",
                    "Understanding family communication across time zones.",
                    "A sequence transformation algorithm for supporting cooperative work on mobile devices.",
                    "Multiple mouse text entry for single-display groupware.",
                    "Gone but not forgotten: designing for disconnection in synchronous groupware.",
                    "Is it really about me?: message content in social awareness streams.",
                    "Student athletes on facebook.",
                    "Sending mixed signals: multilevel reputation effects in peer-to-peer lending markets.",
                    "API peer reviews: a method for evaluating usability of application programming interfaces.",
                    "Are you having difficulty?",
                    "Beyond Wikipedia: coordination and conflict in online production groups.",
                    "Understanding deja reviewers.",
                    "On the \"localness\" of user-generated content.",
                    "Determinants of wikipedia quality: the roles of global and local contribution inequality.",
                    "Inspired by the audience: a topic suggestion system for blog writers and readers.",
                    "Chatter on the red: what hazards threat reveals about the social life of microblogged information.",
                    "Telling the whole story: anticipation, inspiration and reputation in a field deployment of TellTable.",
                    "Opening up the family archive.",
                    "Three's company: understanding communication channels in three-way distributed collaboration.",
                    "Sources of errors in distributed development projects: implications for collaborative tools.",
                    "Communication, collaboration, and bugs: the social nature of issue tracking in small, collocated teams.",
                    "Information needs in bug reports: improving cooperation between developers and users.",
                    "Invisible emotion: information and interaction in an emergency room.",
                    "Understanding together: sensemaking in collaborative information seeking.",
                    "Why the plan doesn't hold: a study of situated planning, articulation and coordination work in a surgical ward.",
                    "What's it worth to you?: the costs and affordances of CMC tools to asian and american users.",
                    "Groups in groups: conversational similarity in online multicultural multiparty brainstorming.",
                    "Street fighter IV: braggadocio off and on-line.",
                    "The individual and the group in console gaming.",
                    "The roles that make the domestic work.",
                    "Sonic souvenirs: exploring the paradoxes of recorded sound for family remembering.",
                    "WeSearch: supporting collaborative search and sensemaking on a tabletop display.",
                    "Pitfalls of information access with visualizations in remote collaborative analysis.",
                    "Pictionaire: supporting collaborative design work by integrating physical and digital artifacts.",
                    "Social use of computer-mediated communication by adults on the autism spectrum.",
                    "Characteristics of shared health reflections in a local community.",
                    "Survival needs and social inclusion: technology use among the homeless."
                ]
            }
        ]
    },
    {
        "year": "2008",
        "name": "CSCW 2008",
        "info": "San Diego, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/cscw/2008",
                "sub_name": "Proceedings of the 2008 ACM Conference on Computer Supported Cooperative Work, CSCW 2008, San Diego, CA, USA, November 8-12, 2008.",
                "count": 86,
                "papers": [
                    "Pushing relevant artifact annotations in collaborative software development.",
                    "CoMaya: incorporating advanced collaboration capabilities into 3d digital media design tools.",
                    "Social summarization: does social feedback improve access to speech data?",
                    "Imprint, a community visualization of printer data: designing for open-ended engagement on sustainability.",
                    "Range: exploring implicit interaction through electronic whiteboard design.",
                    "Mopping up: modeling wikipedia promotion decisions.",
                    "Harnessing the wisdom of crowds in wikipedia: quality through coordination.",
                    "Articulations of wikiwork: uncovering valued work in wikipedia through barnstars.",
                    "Hunting for fun: solitude and attentiveness in collaboration.",
                    "Understanding collective play in an urban screen game.",
                    "Flashlight jigsaw: an exploratory study of an ad-hoc multi-player game on public displays.",
                    "EatWell: sharing nutrition-related memories in a low-income community.",
                    "The context, content & community collage: sharing personal digital media in the physical workplace.",
                    "Representing community: knowing users in the face of changing constituencies.",
                    "The emergence of online widescale interaction in unexpected events: assistance, alliance & retreat.",
                    "Finding community through information and communication technology in disaster response.",
                    "Resilience in collaboration: technology as a resource for new patterns of action.",
                    "Supporting medical conversations between deaf and hearing individuals with tabletop displays.",
                    "Comparing content and input redirection in MDEs.",
                    "Collaboration and interference: awareness with mice or touch input.",
                    "Impact of seating positions on group video communication.",
                    "Situated practices of looking: visual practice in an online world.",
                    "Eye-tracking for avatar eye-gaze and interactional analysis in immersive collaborative virtual environments.",
                    "Effect of restarts and pauses on achieving a state of mutual orientation between a human and a robot.",
                    "Evaluating the deployment of a mobile technology in a hospital ward.",
                    "Transactive memory in trauma resuscitation.",
                    "Moving patients around: a field study of coordination between clinical and non-clinical staff in hospitals.",
                    "The microstructures of social tagging: a rational model.",
                    "Influences on tag choices in del.icio.us.",
                    "Game design principles in everyday fitness applications.",
                    "Small details: using one device to navigate together.",
                    "\"Are you watching this film or what?\": interruption and the juggling of cohorts.",
                    "The computational geowiki: what, why, and how.",
                    "Linguistic mimicry and trust in text-based CMC.",
                    "Mind your Ps and Qs: the impact of politeness and rudeness in online communities.",
                    "IM waiting: timing and responsiveness in semi-synchronous communication.",
                    "I'm sad you're sad: emotional contagion in CMC.",
                    "The language of emotion in short blog texts.",
                    "Minimum movement matters: impact of robot-mounted cameras on social telepresence.",
                    "Asymmetry in media spaces.",
                    "Empirical evidence of information overload constraining chat channel community interactions.",
                    "Being online, living offline: the influence of social ties over the appropriation of social network sites.",
                    "Leadership in online creative collaboration.",
                    "Jumpstarting relationships with online games: evidence from a laboratory investigation.",
                    "Blissfully productive: grouping and cooperation in world of warcraft instance runs.",
                    "Context-linked virtual assistants for distributed teams: an astrophysics case study.",
                    "A hybrid cultural ecology: world of warcraft in China.",
                    "Where did we turn wrong?: unpacking the effect of culture and technology on attributions of team performance.",
                    "Public vs. private: comparing public social network information with email.",
                    "Social networks and context-aware spam.",
                    "I know something you don't: the use of asymmetric personal information for interpersonal advantage.",
                    "Coordinating high-interdependency tasks in asymmetric distributed teams.",
                    "Cutting into collaboration: understanding coordination in distributed and interdisciplinary medical research.",
                    "Who collaborates successfully?: prior experience reduces collaboration barriers in distributed interdisciplinary research.",
                    "The effects of local lag on tightly-coupled interaction in distributed groupware.",
                    "Meeting mediator: enhancing group collaborationusing sociometric feedback.",
                    "Effects of communication media on the interpretation of critical feedback.",
                    "Can you ever trust a wiki?: impacting perceived trustworthiness in wikipedia.",
                    "Enhancing collaborative web search with personalization: groupization, smart splitting, and group hit-highlighting.",
                    "Towards a model of understanding social search.",
                    "A wiki instance in the enterprise: opportunities, concerns and reality.",
                    "Operationalization of technology use and cooperation in CSCW.",
                    "Steps toward a typology for health informatics.",
                    "\"Garbage in, garbage out\": extracting disease surveillance data from epr systems in primary care.",
                    "Can markets help?: applying market mechanisms to improve synchronous communication.",
                    "Network structure, position, ties and ICT use in distributed knowledge-intensive work.",
                    "Investigating the effect of discussion forum interface affordances on patterns of conversational interactions.",
                    "The logic of practices of stigmergy: representational artifacts in architectural design.",
                    "From individual to collaborative: the evolution of prism, a hybrid laboratory notebook.",
                    "Communication networks in geographically distributed software development.",
                    "The view from the trenches: organization, power, and technology at two nonprofit homeless outreach centers.",
                    "Colour management is a socio-technical problem.",
                    "Assistance: the work practices of human administrative assistants and their implications for it and organizations.",
                    "Are you sleeping?: sharing portrayed sleeping status within a social network.",
                    "SPARCS: exploring sharing suggestions to enhance family connectedness.",
                    "Deploying research technology in the home.",
                    "Understanding the implications of social translucence for systems supporting communication at work.",
                    "Providing awareness in multi-synchronous collaboration without compromising privacy.",
                    "Family accounts: a new paradigm for user accounts within the home environment.",
                    "An examination of daily information needs and sharing opportunities.",
                    "Charitable technologies: opportunities for collaborative computing in nonprofit fundraising.",
                    "The confusion of crowds: non-dyadic help interactions.",
                    "It's all 'about you': diversity in online profiles.",
                    "Network patterns: designing effective user interfaces for connections management at work.",
                    "Motivations for social networking at work.",
                    "Changes in use and perception of facebook."
                ]
            }
        ]
    },
    {
        "year": "2006",
        "name": "CSCW 2006",
        "info": "Banff, Alberta, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/cscw/2006",
                "sub_name": "Proceedings of the 2006 ACM Conference on Computer Supported Cooperative Work, CSCW 2006, Banff, Alberta, Canada, November 4-8, 2006.",
                "count": 62,
                "papers": [
                    "SIDES: a cooperative tabletop computer game for social skills development.",
                    "Exploring the effects of group size and display configuration on visual search.",
                    "Enlightening a co-located community with a semi-public notification system.",
                    "Not all sharing is equal: the impact of a large display on small group collaborative work.",
                    "Interruptions on software teams: a comparison of paired and solo programmers.",
                    "Designing task visualizations to support the coordination of work in software development.",
                    "CVS integration with notification and chat: lightweight software team collaboration.",
                    "Formalizing work: reallocating redundancy.",
                    "Representations at work: a national standard for electronic health records.",
                    "Of pill boxes and piano benches: \"home-made\" methods for managing medication.",
                    "FeedMe: a collaborative alert filtering system.",
                    "Providing artifact awareness to a distributed group through screen sharing.",
                    "AwareMedia: a shared interactive display supporting social, temporal, and spatial awareness in surgery.",
                    "Improving network efficiency in real-time groupware with general message compression.",
                    "Response times in N-user replicated, centralized, and proximity-based hybrid collaboration architectures.",
                    "A lightweight approach to transparent sharing of familiar single-user editors.",
                    "Strangers and friends: collaborative play in world of warcraft.",
                    "Sounds good to me: effects of photo and voice profiles on gaming partner choice.",
                    "Sandboxes: supporting social play through collaborative multimedia composition on mobile phones.",
                    "A face(book) in the crowd: social Searching vs. social browsing.",
                    "Don't look stupid: avoiding pitfalls when recommending research papers.",
                    "tagging, communities, vocabulary, evolution.",
                    "What goes around comes around: an analysis of del.icio.us as social space.",
                    "Shared waypoints and social tagging to support collaboration in software development.",
                    "Technology in spiritual formation: an exploratory study of computer mediated religious communications.",
                    "From the war room to the living room: decision support for home-based therapy teams.",
                    "The practical indispensability of articulation work to immediate and remote help-giving.",
                    "Making things work: dimensions of configurability as appropriation work.",
                    "The wheel of collaboration tools: a typology for analysis within a holistic framework.",
                    "The uses of paper in commercial airline flight operations.",
                    "Data consistency for P2P collaborative editing.",
                    "Draw-together: graphical editor for collaborative drawing.",
                    "Operation context and context-based operational transformation.",
                    "The chasms of CSCW: a citation graph analysis of the CSCW conference.",
                    "Re-space-ing place: \"place\" and \"space\" ten years on.",
                    "Revisiting Whittaker & Sidner's \"email overload\" ten years later.",
                    "Moving office: inhabiting a dynamic building.",
                    "A comparison of chat and audio in media rich environments.",
                    "Improving audio conferencing: are two ears better than one?",
                    "Structures that work: social structure, work structure and coordination ease in geographically distributed teams.",
                    "Identification of coordination requirements: implications for the Design of collaboration and awareness tools.",
                    "Actor centrality correlates to project based coordination.",
                    "The mystery of the missing referent: objects, procedures, and the problem of the instruction follower.",
                    "HomeNote: supporting situated messaging in the home.",
                    "Where's the \"party\" in \"multi-party\"?: analyzing the structure of small-group sociable talk.",
                    "An exploratory analysis of partner action and camera control in a video-mediated collaborative task.",
                    "Spatiality in videoconferencing: trade-offs between efficiency and social presence.",
                    "Pêle-Mêle, a video communication system supporting a variable degree of engagement.",
                    "Challenges in the analysis of multimodal messaging.",
                    "Email overload at work: an analysis of factors associated with email strain.",
                    "Going with the flow: email awareness and task management.",
                    "Leveraging digital backchannels to enhance user experience in electronically mediated communication.",
                    "Structuring and supporting persistent chat conversations.",
                    "A grounded theory of information sharing behavior in a personal learning space.",
                    "Context-aware telephony: privacy preferences and sharing patterns.",
                    "Unobtrusive but invasive: using screen recording to collect field data on computer-mediated interaction.",
                    "The human infrastructure of cyberinfrastructure.",
                    "Conceptualizing common information spaces across heterogeneous contexts: mutable mobiles and side-effects of integration.",
                    "Forms of collaboration in high performance computing: exploring implications for learning.",
                    "Communication characteristics of instant messaging: effects and predictions of interpersonal relationships.",
                    "Effects of machine translation on collaborative work.",
                    "Cultural differences in the use of instant messaging in Asia and North America."
                ]
            }
        ]
    },
    {
        "year": "2004",
        "name": "CSCW 2004",
        "info": "Chicago, Illinois, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/cscw/2004",
                "sub_name": "Proceedings of the 2004 ACM Conference on Computer Supported Cooperative Work, CSCW 2004, Chicago, Illinois, USA, November 6-10, 2004.",
                "count": 80,
                "papers": [
                    "Towards dynamic collaboration architectures.",
                    "Separating data and control: support for adaptable consistency protocols in collaborative systems.",
                    "Introducing collaboration into an application development environment.",
                    "Retrofitting collaboration into UIs with aspects.",
                    "Collaborative knowledge management supporting mars mission scientists.",
                    "Augmenting the social space of an academic conference.",
                    "The introduction of a shared interactive surface into a communal space.",
                    "Online political organizing: lessons from the field.",
                    "Sometimes you need to see through walls: a field study of application programming interfaces.",
                    "Group awareness in distributed software development.",
                    "Learning from project history: a case study for software development.",
                    "Situating evaluation in scenarios of use.",
                    "Physiological indicators for the evaluation of co-located collaborative play.",
                    "Evaluating computer-supported cooperative work: models and frameworks.",
                    "Does CSCW need organization theory?",
                    "Accountability in an alarming environment.",
                    "Maintaining redundancy in the coordination of medical emergencies.",
                    "Supporting informality: team working and integrated care records.",
                    "Lessons from the reMail prototypes.",
                    "Leveraging single-user applications for multi-user collaboration: the coword approach.",
                    "High-performance telepointers.",
                    "Controlling interruptions: awareness displays and social motivation for coordination.",
                    "The AWARE architecture: supporting context-mediated social awareness in mobile cooperation.",
                    "Putting systems into place: a qualitative study of design requirements for location-aware community systems.",
                    "Using social psychology to motivate contributions to online communities.",
                    "Blogging as social activity, or, would you let 900 million people read your diary?",
                    "Flash forums and forumReader: navigating a new kind of large-scale online discussion.",
                    "Individual audio channels with single display groupware: effects on communication and task strategy.",
                    "Avoiding interference: how people use spatial separation and partitioning in SDG workspaces.",
                    "Beyond \"social protocols\": multi-user coordination policies for co-located groupware.",
                    "Toward universal mobile interaction for shared displays.",
                    "Lumisight table: a face-to-face collaboration support system that optimizes direction of projected information to each stakeholder.",
                    "Exploring the effects of group size and table size on interactions with tabletop shared-display groupware.",
                    "Territoriality in collaborative tabletop workspaces.",
                    "Behind the help desk: evolution of a knowledge management system in a large organization.",
                    "The diffusion of reachOut: analysis and framework for the successful diffusion of collaboration technologies.",
                    "Return on investment and organizational adoption.",
                    "Leveraging social networks for information sharing.",
                    "Assembling the senses: towards the design of cooperative interfaces for visually impaired users.",
                    "I know my network: collaboration and expertise in intrusion detection.",
                    "Cutting to the chase: improving meeting effectiveness by focusing on the agenda.",
                    "CSCW at play: 'there' as a collaborative virtual environment.",
                    "The social side of gaming: a study of interaction patterns in a massively multiplayer online game.",
                    "Hiding and revealing in online poker games.",
                    "FishPong: encouraging human-to-human interaction in informal social environments.",
                    "Where am I and who am I?: issues in collaborative technical help.",
                    "Field studies of computer system administrators: analysis of system management tools and practices.",
                    "Collaborating around collections: informing the continued development of photoware.",
                    "Communities and technologies: an approach to foster social capital?",
                    "CSCW and cyberinfrastructure: opportunities and challenges.",
                    "Capturing and supporting contexts for scientific data sharing via the biological sciences collaboratory.",
                    "Meeting central: making distributed meetings more effective.",
                    "In-group/out-group effects in distributed teams: an experimental simulation.",
                    "Operational transformation for collaborative word processing.",
                    "Grouping in collaborative graphical editors.",
                    "Preserving operation effects relation in group editors.",
                    "Shadow communication: system for embodied interaction with remote partners.",
                    "Mediating dual ecologies.",
                    "Action as language in a shared visual space.",
                    "Predictors of availability in home life context-mediated communication.",
                    "BusyBody: creating and fielding personalized models of the cost of interruption.",
                    "Lilsys: Sensing Unavailability.",
                    "QnA: augmenting an instant messaging client to balance user responsiveness and performance.",
                    "Instant messages: a framework for reading between the lines.",
                    "Only touching the surface: creating affinities between digital content and paper.",
                    "Where the wild things work: capturing shared physical design workspaces.",
                    "List making in the home.",
                    "Concepts that support collocated collaborative work inspired by the specific context of industrial designers.",
                    "Digital backchannels in shared physical spaces: attention, intention and contention.",
                    "End-user controlled group formation and access rights management in a shared workspace system.",
                    "The multiple views of inter-organizational authoring.",
                    "Collaborative modeling: hiding UML and promoting data examples in NEMo.",
                    "Asynchronous collaborative writing through annotations.",
                    "Six degrees of jonathan grudin: a social network analysis of the evolution and impact of CSCW research.",
                    "Emergent networks, locus of control, and the pursuit of social capital.",
                    "Student social graphs: visualizing a student's online social network.",
                    "A framework for real-world software system evaluations.",
                    "Taking it out of context: collaborating within and across cultures in face-to-face settings and via instant messaging.",
                    "Influencing group participation with a shared display.",
                    "Remote meetings between farmers and researchers: a case study on asymmetry."
                ]
            }
        ]
    },
    {
        "year": "2002",
        "name": "CSCW 2002",
        "info": "New Orleans, Louisiana, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/cscw/2002",
                "sub_name": "CSCW 2002, Proceeding on the ACM 2002 Conference on Computer Supported Cooperative Work, New Orleans, Louisiana, USA, November 16-20, 2002.",
                "count": 39,
                "papers": [
                    "What is chat doing in the workplace?",
                    "The character, functions, and styles of instant messaging in the workplace.",
                    "Instant messaging in teen life.",
                    "The use of visual information in shared visual spaces: informing the development of virtual co-presence.",
                    "Explaining effects of eye gaze on mediated group conversations: : amount or synchronization?",
                    "Improving interpretation of remote gestures with telepointer traces.",
                    "Generalizing operational transformation to the standard general markup language.",
                    "Achieving undo in bitmap-based collaborative graphics editing systems.",
                    "Flexible notification for collaborative systems.",
                    "Voice-mail diary studies for naturalistic data capture under mobile conditions.",
                    "Empirical development of a heuristic evaluation methodology for shared workspace groupware.",
                    "Developing CSCW tools for idea finding -: empirical results and implications for design.",
                    "On the recommending of citations for research papers.",
                    "\"Ask before you search\": peer support and community building with reachout.",
                    "Making web sites be places for social interaction.",
                    "Revisiting the visit: : understanding how technology can shape the museum visit.",
                    "Creating assemblies: : aboard the Ghost Ship.",
                    "Requirements for photoware.",
                    "The parameters of common information spaces: : the heterogeneity of cooperative work at a hospital ward.",
                    "Remote concept design from an activity theory perspective.",
                    "A new dimension in access control: studying maintenance engineering across organizational boundaries.",
                    "Markets for attention: will postage for email help?",
                    "Contact management: identifying contacts to support long-term communication.",
                    "Why distance matters: effects on cooperation, persuasion and deception.",
                    "Clover architecture for groupware.",
                    "Transparent sharing and interoperation of heterogeneous single-user applications.",
                    "Using speakeasy for ad hoc peer-to-peer collaboration.",
                    "Achieving safety: a field study of boundary objects in aircraft technical support.",
                    "The electronic claim file: a case study of impacts of information technology in knowledge work.",
                    "Ambiguities, awareness and economy: a study of emergency service work.",
                    "Who can claim complete abstinence from peeking at print jobs?",
                    "Stimulating social engagement in a community network.",
                    "Designing and deploying an information awareness interface.",
                    "Sharing and building digital group histories.",
                    "Work rhythms: analyzing visualizations of awareness histories of distributed groups.",
                    "A finger on the pulse: temporal rhythms and information seeking in medical work.",
                    "First steps towards mutually-immersive mobile telepresence.",
                    "3-D live: real time interaction for mixed reality.",
                    "Extreme work teams: using SWAT teams as a model for coordinating distributed robots."
                ]
            },
            {
                "sub_name_abbr": "conf/cscw/2002video",
                "sub_name": "Proceedings of the 2002 ACM on Computer supported cooperative work video program, CSCW '02, New Orleans, Louisiana, USA, November 16-20, 2002.",
                "count": 8,
                "papers": [
                    "First steps towards mutually-immersive mobile telepresence.",
                    "Supporting paper mediated video conference with Agora system.",
                    "Building and sharing digital group histories.",
                    "A system for supporting group learning in face-to-face and networked environments.",
                    "HyperMirror-III sensing the movements of partners with vibration.",
                    "IMVis: instant messenger visualization.",
                    "ContactMap: using personal social networks to organize communication in a social desktop.",
                    "3-D Live: real time interaction for mixed reality."
                ]
            }
        ]
    },
    {
        "year": "2000",
        "name": "CSCW 2000",
        "info": "Philadelphia, Pennsylvania, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/cscw/2000",
                "sub_name": "CSCW 2000, Proceeding on the ACM 2000 Conference on Computer Supported Cooperative Work, Philadelphia, PA, USA, December 2-6, 2000.",
                "count": 52,
                "papers": [
                    "The effects of filtered video on awareness and privacy.",
                    "Impact of video frame rate on communicative behaviour in two and four party groups.",
                    "Coordination of communication: effects of shared visual context on collaborative work.",
                    "Designing to support adversarial collaboration.",
                    "Evolution of Contact Point: a case study of a help desk and its users.",
                    "Machinery in the new factories: interaction and technology in a bank's telephone call centre.",
                    "Ensuring privacy in presence awareness: an automated verification approach.",
                    "Data management support for asynchronous groupware.",
                    "Interaction and outeraction: instant messaging in action.",
                    "Providing presence cues to telephone users.",
                    "Conversation trees and threaded chats.",
                    "Developing adaptive groupware applications using a mobile component framework.",
                    "Composable collaboration infrastructures based on programming patterns.",
                    "Designing presentations for on-demand viewing.",
                    "Distance learning through distributed collaborative video viewing.",
                    "Algebra jam: supporting teamwork and managing roles in a collaborative learning environment.",
                    "GestureMan: a mobile robot that embodies a remote instructor's actions.",
                    "Shared walk environment using locomotion interfaces.",
                    "Copies convergence in a distributed real-time collaborative environment.",
                    "Consistency in replicated continuous interactive media.",
                    "Undo any operation at any time in group editors.",
                    "Going wireless: behavior & practice of new mobile phone users.",
                    "FieldWise: a mobile knowledge management architecture.",
                    "WebSplitter: a unified XML framework for multi-device collaborative Web browsing.",
                    "Expertise recommender: a flexible recommendation system and architecture.",
                    "Explaining collaborative filtering recommendations.",
                    "Interpersonal trust and common ground in electronically mediated communication.",
                    "Recognizing and supporting roles in CSCW.",
                    "Coping with errors: the importance of process data in robust sociotechnical systems.",
                    "How can cooperative work tools support dynamic group process? bridging the specificity frontier.",
                    "Supporting collaborative interpretation in distributed Groupware.",
                    "Structured online interactions: improving the decision-making of small discussion groups.",
                    "Using Web annotations for asynchronous collaboration around documents.",
                    "Distance, dependencies, and delay in a global collaboration.",
                    "Collaboration with Lean Media: how open-source software succeeds.",
                    "How does radical collocation help a team succeed?",
                    "CSCW 2000 video program.",
                    "MUSICFX: an arbiter of group preferences for computer supported collaborative workouts.",
                    "Talking in circles: a spatially-grounded social environment.",
                    "StickyChats: remote conversations over digital documents.",
                    "Sun SharedShell tool.",
                    "User experience of CLIVE/mbanx solution.",
                    "Enabling distributed collaborative science.",
                    "GestureMan: a mobile robot that embodies a remote instructor's actions.",
                    "Supporting real-time collaboration over wide area networks.",
                    "Bowling alone: the collapse and revival of American community.",
                    "IT2: an information technology initiative for the twenty-first century - NSF plans for implementation.",
                    "Got a minute? How technology affects the economy of attention.",
                    "Instant messaging: products meet workplace users.",
                    "Research at internet speed: is it necessary?",
                    "The children's challenge: new technologies to support co-located and distributed collaboration.",
                    "Beyond bowling together."
                ]
            }
        ]
    },
    {
        "year": "1998",
        "name": "CSCW 1998",
        "info": "Seattle, WA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/cscw/1998",
                "sub_name": "CSCW '98, Proceedings of the ACM 1998 Conference on Computer Supported Cooperative Work, Seattle, WA, USA, November 14-18, 1998.",
                "count": 48,
                "papers": [
                    "OfficeWalker: A Virtual Visiting System Based on Proxemics.",
                    "Evaluating Image Filtering Based Techniques in Media Space Applications.",
                    "Interlocus: Workspace Configuration Mechanisms for Activity Awareness.",
                    "The Long and Winding Road: Collaborative IT and Organisational Change.",
                    "Considering an Organization's Memory.",
                    "Diaries at Work.",
                    "Operational Transformation in Real-Time Group Editors: Issues, Algorithms, and Achievements.",
                    "Operation Transforms for a Distributed Shared Spreadsheet.",
                    "Designing for the Dynamics of Cooperative Work Activities.",
                    "Collaborative Customer Services Using Synchronous Web Browser Sharing.",
                    "Talking to Customers on the Web: A Comparison of Three Voice Alternatives.",
                    "Out of this World: An Extensible Session Architecture for Heterogeneous Electronic Landscapes.",
                    "Ubiquitous Collaboration via Surface Representations.",
                    "Rapidly Building Synchronous Collaborative Applications by Direct Manipulation.",
                    "HyperMirror: Toward Pleasant-to-Use Video Mediated Communication System.",
                    "Meme Tags and Community Mirrors: Moving from Conferences to Collaboration.",
                    "Tangible Interfaces for Remote Collaboration and Communication.",
                    "COCA: Collaborative Objects Coordination Architecture.",
                    "Artefact: A Framework for Low-Overhead Web-Based Collaborative Systems.",
                    "Supporting Flexible Roles in a Shared Space.",
                    "Design for Individuals, Design for Groups: Tradeoffs between Power and Workspace Awareness.",
                    "Fragmented Interaction: Establishing Mutual Orientation in Virtual Environments.",
                    "Exploring the Design Space for Notification Servers.",
                    "Re-coupling Tailored User Interfaces.",
                    "Flexible Meta Access-Control for Collaborative Applications.",
                    "The Dynamics of Mass Interaction.",
                    "Envisioning Communication: Task-Tailorable Representations of Communication in Asynchronous Work.",
                    "Coordination, Overload and Team Performance: Effects of Team Communication Strategies.",
                    "Collaboration Using Multiple PDAs Connected to a PC.",
                    "Tailorable Domain Objects as Meeting Tools for an Electronic Whiteboard.",
                    "Mobility in Collaboration.",
                    "Just Talk to Me: A Field Study of Expertise Location.",
                    "Sustaining Mentoring Relationships On-Line.",
                    "Cooperative Knowledge Work and Practices of Trust: Sharing Environmental Planning Data Sets.",
                    "Using Filtering Agents to Improve Prediction Quality in the GroupLens Research Collaborative Filtering System.",
                    "Evaluating Emergent Collaboration on the Web.",
                    "MusicFX: An Arbiter of Group Preferences for Computer Aupported Collaborative Workouts.",
                    "Designing Groupware for Congruency in Use.",
                    "Representing Fieldwork and Articulating Requirements Through VR.",
                    "Recomposition: Putting It All Back Together Again.",
                    "An Internet Paradox: A Social Medium That May Undermine Sociability (Panel).",
                    "Everyone is Talking About Knowledge Management (Panel).",
                    "Six Readings of a Single Text: A Videoanalytic Session (Panel).",
                    "Cooperative Buildings - Integrating Information, Organization and Architecture.",
                    "CSCW '98 Workshop Program.",
                    "CSCW '98 Doctoral Colloquium (Summary).",
                    "CSCW '98 Video Program (Summary).",
                    "Tutorials (Summary)."
                ]
            }
        ]
    },
    {
        "year": "1996",
        "name": "CSCW 1996",
        "info": "Boston, MA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/cscw/1996",
                "sub_name": "CSCW '96, Proceedings of the ACM 1996 Conference on Computer Supported Cooperative Work, Boston, MA, USA, November 16-20, 1996.",
                "count": 96,
                "papers": [
                    "Extending CSCW into Domestic Environments (workshop).",
                    "Approaches for Distributed Learning Through Computer Supported Collaborative Learning (workshop).",
                    "CSCW and Organizational Learning (workshop).",
                    "CSCW and the Internet (workshop).",
                    "Commercial Use of Meetingware (workshop).",
                    "Introducing Groupware into Organizations: What Leads to Successes and Failures? (workshop).",
                    "Integrating Personal and Community Recommendations in Collaborative Filtering (workshop).",
                    "Tacit Knowledge: Icebergs in Collaborative Design (workshop).",
                    "Strategies for Collaborative Modeling and Simulation (workshop).",
                    "Design and Use of MUDs for Serious Purposes (workshop).",
                    "Widening the Net: The Theory and Practice of Physical and Electronic Communities (workshop).",
                    "An Introduction to the Internet and How it can be Used for Collaboration for K-12 Teachers (Tutorial).",
                    "CSCW Overview (Tutorial).",
                    "CSCW, Groupware and Workflow: Experiences, State of Art and Future Trends (Tutorial).",
                    "Using the Java Programming Environment to Build Collaborative Applications (Tutorial).",
                    "Designing and Implementing Collaborative Applications (Tutorial).",
                    "Developing Collaborative Applications Using the World Wide Web Shell (Tutorial).",
                    "An Introduction to Distributed Cognition: Analyzing the Organizational, the Social and the Cognitive for Designing and Implementing CSCW Applications (Tutorial).",
                    "Working Through Meetings: A Framework for Designing Meeting Support (Tutorial).",
                    "Asynchronous Learning Networks: The Theory and Practice of Collaborative Learning Online (Tutorial).",
                    "Ethnography and Systems Development: Bounding the Intersection (Tutorial).",
                    "A Hands-On Introduction to Collaborative Filtering (Tutorial).",
                    "Cooperative Information Systems: A Research Agenda (Tutorial).",
                    "Behavioral Evaluation of CSCW Technologies (Tutorial).",
                    "Community Networks (Tutorial).",
                    "Networking for Collaboration: Video Telephony and Media Conferencing (Tutorial).",
                    "Law in Cyberspace (Tutorial).",
                    "Business Process Reengineering and its Role in Developing CSCW Applications (Tutorial).",
                    "GroupWeb: A Groupware Web Browser (Video Program).",
                    "ARGUS: An Active Awareness System Using Computer-Controlled Multiple Cameras (Video Program).",
                    "InterSpace Project - CyberCampus (Video Program).",
                    "Prairie: A Conceptual Framework for a Virtual Organization (Video Program).",
                    "Supporting Workspace Awareness in Groupware (Video Program).",
                    "Applying Distortion-Oriented Displays to Groupware (Video Program).",
                    "GestureCam: A Video Communication System to Support Spatial Workspace Collaboration (Video Program).",
                    "MAJIC and DesktopMAJIC Conferencing System (Video Program).",
                    "Collaborative Wearable Systems Research and Evaluation (Video Program).",
                    "The MIT Design Studio of the Future: Virtual Design Review (Video Program).",
                    "From Electronic Whiteboards to Distributed Meetings: Extending the Scope of DOLPHIN (Video Program).",
                    "Policies and Roles in Collaborative Applications.",
                    "DCWPL: A Programming Language for Describing Collaborative Work.",
                    "Designing Object-Oriented Synchronous Groupware with COAST.",
                    "Identifying and Analyzing Multiple Threads in Computer-Mediated and Face-to-Face Conversations.",
                    "Voice Loops as Cooperative Aids in Space Shuttle Mission Control.",
                    "Collaboration in Performance of Physical Tasks: Effects on Outcomes and Communication.",
                    "Re-place-ing Space: The Roles of Place and Space in Collaborative Systems.",
                    "Shared Spaces: Transportation, Artificiality, and Spatiality.",
                    "Populating the Application: A Model of Awareness for Cooperative Applications.",
                    "Answer Garden 2: Merging Organizational Memory with Collaborative Help.",
                    "Using Frequency-of-Mention in Public Conversations for Social Filtering.",
                    "CLUES: Dynamic Personalized Message Filtering.",
                    "Notification Servers for Synchronous Groupware.",
                    "A Protocol for User Awareness on the World Wide Web.",
                    "Corona: A Communication Service for Scalable, Reliable Group Collaboration Systems.",
                    "Evolutionary Engagement in an Ongoing Collaborative Work Process: A Case Study.",
                    "The Social-Technical Design Circle.",
                    "Hypermedia Structures and the Division of Labor in Meeting Room Collaboration.",
                    "Generalized Process Structure Grammars GPSG for Flexible Representations of Work.",
                    "Freeflow: Mediating Between Representation and Action in Workflow Systems.",
                    "Support for Workflows in a Ministerial Environment.",
                    "Walking away from the Desktop Computer: Distributed Collaboration and Mobility in a Product Design Team.",
                    "Getting Others to get it Right: an Ethnography of Design Work in the Fashion Industry.",
                    "Back to Labor: Returning to Labor Process Discussions in the Study of Work.",
                    "Thunderwire: A Field Study of an Audio-Only Media Space.",
                    "Techniques for Addressing Fundamental Privacy and Disruption Tradeoffs in Awareness Support Systems.",
                    "A Usability Study of Awareness Widgets in a Shared Workspace Groupware System.",
                    "Consistency Guarantees: Exploiting Application Semantics for Consistency Management in a Collaboration Toolkit.",
                    "A Concurrency Control Framework for Collaborative Systems.",
                    "An Integrating, Transformation-Oriented Approach to Concurrency Control and Undo in Group Editors.",
                    "Supporting Social Awareness @ Work Design and Experience.",
                    "FreeWalk: Supporting Casual Meetings in a Network.",
                    "Piazza: A Desktop Environment Supporting Impromptu and Planned Interactions.",
                    "TeamRooms: Network Places for Collaboration.",
                    "Physical Spaces, Virtual Places and Social Worlds: a Study of Work in the Virtual.",
                    "Supporting Multi-User, Multi-Applet Workspaces in CBE.",
                    "Documents and Professional Practice: \"bad\" Organisational Reasons for \"good\" Clinical Records.",
                    "Computer Support for Clinical Practice: Embedding and Evolving Protocols of Care.",
                    "Paperwork at 78kph.",
                    "Practically Accomplishing Immersion: Cooperation in and for Virtual Environments.",
                    "Cooperative Virtual Environments: Lessons from 2D Multi User Interfaces.",
                    "My Partner is a Real Dog: Cooperation with Social Agents.",
                    "Talking to Strangers: An Evaluation of the Factors Affecting Electronic Collaboration.",
                    "Groupware in the Wild: Lessons Learned from a Year of Virtual Collocation.",
                    "Groupware Implementation: Reinvention in the Sociotechnical Frame.",
                    "Groupware at Work: It's Here Now, But Do We Know What It Is Yet?",
                    "Peopled Online Virtual Worlds: A New Home for Cooperating Communities, a New Frontier for Interaction Design (Panel).",
                    "Conflict and Cooperation in the Courts: Case Study of how CSCW Alters Work (doctoral colloquium).",
                    "Group Memories: A Knowledge Medium for Communities of Practice (doctoral colloquium).",
                    "Metonymy as an Organising Principle of IT Communities (doctoral colloquium).",
                    "How Organizational Structure and Culture shape CSCW (doctoral colloquium).",
                    "Providing Awareness Information in Remote Computer-Mediated Collaboration (doctoral colloquium).",
                    "Computer Supported Cooperative Work in Clinical Practice (doctoral colloquium).",
                    "The Language of Coordination: A Method for the Distributed Design of Complex Organizations (doctoral colloquium).",
                    "Temporal Interface Issues and Software Architecture for Remote Cooperative Work (doctoral colloquium).",
                    "Groupware Support for Workspace Awareness (doctoral colloquium).",
                    "Research in Communication Services for Collaborative Systems (doctoral colloquium)."
                ]
            }
        ]
    },
    {
        "year": "1994",
        "name": "CSCW 1994",
        "info": "Chapel Hill, NC, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/cscw/1994",
                "sub_name": "CSCW '94, Proceedings of the Conference on Computer Supported Cooperative Work, Chapel Hill, NC, USA, October 22-26, 1994.",
                "count": 39,
                "papers": [
                    "Life and Death of New Technology: Task, Utility and Social Influences on the Use of a Communication Medium.",
                    "Supporting Distributed Groups with a Montage of Lightweight Interactions.",
                    "GestureCam: A Video Communication System for Sympathetic Remote Collaboration.",
                    "From Implementation to Design: Tailoring and the Emergence of Systematization in CSCW.",
                    "Helping CSCW Applications Succeed: The Role of Mediators in the Context of Use.",
                    "Exploring Obstacles: Integrating CSCW in Evolving Organisations.",
                    "A Conceptual Model of Groupware.",
                    "Situating Conversations Within the Language/Action Perspective: The Milan Conversation Model.",
                    "The Organization of Cooperative Work: Beyond the \"Leviathan\" Conception of the Organization of Cooperative Work.",
                    "Experiences with Workflow Management: Issues for the Next Generation.",
                    "Interpreted Collaboration Protocols and Their Use in Groupware Prototyping.",
                    "Experience with the Virtual Notebook System: Abstraction in Hypertext.",
                    "Computer Support for Distributed Collaborative Writing: Defining Parameters of Interaction.",
                    "DistView: Support for Building Efficient Collaborative Applications Using Replicated Objects.",
                    "Duplex: A Distributed Collaborative Editing Environment in Large Scale.",
                    "GroupLens: An Open Architecture for Collaborative Filtering of Netnews.",
                    "Computer Supported Collaborative Learning Using CLARE: The Approach and Experimental Findings.",
                    "Meaning-Making in the Creation of Useful Summary Reports.",
                    "Real Time Groupware as a Distributed System: Concurrency Control and Its Effect on the Interface.",
                    "The Use of Adapters to Support Cooperative Sharing.",
                    "A Flexible Object Merging Framework.",
                    "Augmenting the Organizational Memory: A Field Study of Answer Garden.",
                    "Steps Towards an Ecology of Infrastructure: Complex Problems in Design and Access for Large-Scale Collaborative Systems.",
                    "The Role of \"Help Networks\" in Facilitating Use of CSCW Tools.",
                    "Working with \"Constant Interruption\": CSCW and the Small Office.",
                    "The Work to Make a Network Work: Studying CSCW in Action.",
                    "The Effects of Interactive Graphics and Text on Social Influence in Computer-Mediated Small Groups.",
                    "Communication Control in Computer Supported Cooperative Work Systems.",
                    "Session Management for Collaborative Applications.",
                    "Integrating Communication, Cooperation, and Awareness: The DIVA Virtual Office Environment.",
                    "DOLPHIN: Integrated Meeting Support Across Local and Remote Desktop Environments and LiveBoards.",
                    "Meet your Destiny: A Non-Manipulable Meeting Scheduler.",
                    "Automated Assistance for the Telemeeting Lifecycle.",
                    "Multiparty Videoconferencing at Virtual Social Distance: MAJIC Design.",
                    "High Performance Infrastructure for Visually-Intensive CSCW Applications.",
                    "A Forum for Supporting Interactive Presentations to Distributed Audiences.",
                    "The Limits of Ethnography: Combining Social Sciences for CSCW.",
                    "Moving Out from the Control Room: Ethnography in System Design.",
                    "Situated Evaluation for Cooperative Systems."
                ]
            }
        ]
    },
    {
        "year": "1992",
        "name": "CSCW 1992",
        "info": "Toronto, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/cscw/1992",
                "sub_name": "CSCW '92, Proceedings of the Conference on Computer Supported Cooperative Work, Toronto, Canada, October 31 - November 4, 1992.",
                "count": 47,
                "papers": [
                    "Iterative Design of Video Communication Systems.",
                    "Integration of Inter-Personal Space and Shared Workspace: ClearBoard Design and Experiments.",
                    "GROUPKIT: A Groupware Toolkit for Building Real-Time Conferencing Applications.",
                    "Access Control for Collaborative Environments.",
                    "Rational Views as a Model for Automatic Distributed Implementation of Multi-User Applications.",
                    "Computational Mail as Network Infrastructure for Computer-Supported Cooperative Work.",
                    "Active Mail - A Framework for Implementing Groupware.",
                    "Supporting Informal Communication via Ephemeral Interest Groups.",
                    "How a Group-Editor Changes the Character of a Design Meeting as well as Its Outcome.",
                    "Unblocking Brainstorming Through the Use of a Simple Group Editor.",
                    "Awareness and Coordination in Shared Workspaces.",
                    "Faltering from Ethnography to Design.",
                    "Ethnographically-Informed Systems Design for Air Traffic Control.",
                    "Consultants and Apprentices: Observations about Learning and Collaborative Problem Solving.",
                    "Supporting Collaborative Writing of Hyperdocuments in SEPIA.",
                    "Flexible Diff-ing in a Collaborative Writing System.",
                    "Computer-Mediated Communication and Collaborative Writing: Media Influence and Adaptation to Communication Constraints.",
                    "Tasks-in-Interaction: Paper and Screen Based Documentation in Collaborative Activity.",
                    "A Collaborative Medium for the Support of Conversational Props.",
                    "Groupware Experiences in Three-Dimensional Computer-Aided Design.",
                    "An Architecture for Tailoring Cooperative Multi-User Displays.",
                    "Architecture of the Artifact-Based Collaboration System Matrix.",
                    "System Support for Computer Mediated Multimedia Collaborations.",
                    "Ubiquitous Audio: Capturing Spontaneous Collaboration.",
                    "HyperVoice: A Phone-Based CSCW Platform.",
                    "Cooperative Work Environment Using Virtual Workspace.",
                    "Identifying Potential CSCW Applications by Means of Activity Theory Concepts: A Case Example.",
                    "Collaboration and Constraint: Middle School Teaching Teams.",
                    "Time-Management: A Case for CSCW.",
                    "\"Lazy\" Consistency: A Basis for Cooperative Software Development.",
                    "Implicit Locking in the Ensemble Concurrent Object-Oriented Graphics Editor.",
                    "Undoing Actions in Collaborative Work.",
                    "The Action Workflow Approach to Workflow Management Technology.",
                    "Experiments with Oval: A Radically Tailorable Tool for Cooperative Work.",
                    "Supporting Exploratory CSCW with the EGRET Framework.",
                    "Sharing Perspectives in Distributed Decision Making.",
                    "Distributed Facilitation: A Concept Whose Time Has Come?",
                    "Communication and Information Retrieval with a Pen-Based Meeting Support Tool.",
                    "Looking at Ourselves: An Examination of the Social Organisation of Two Research Laboratories.",
                    "CSCW Challenges in Large-Scale Technical Projects - A Case Study.",
                    "Ghosts in the Network: Distributed Troubleshooting in a Shared Working Environment.",
                    "Hardwiring Weak Ties: Individual and Institutional Issues in Computer Mediated Communication.",
                    "Learning from Notes: Organizational Issues in Groupware Implementation.",
                    "The CSCW Implementation Process: An Interpretative Model and Case Study of the Implementation of a Videoconference System.",
                    "Flexible, Active Support for Collaborative Work with ConversationBuilder.",
                    "BIBDB: A Bibliographic Database for Collaboration.",
                    "Supporting Communication Between Designers with Artifact-Centered Evolving Information Spaces."
                ]
            }
        ]
    },
    {
        "year": "1990",
        "name": "CSCW 1990",
        "info": "Los Angeles, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/cscw/1990",
                "sub_name": "CSCW '90, Proceedings of the Conference on Computer Supported Cooperative Work, Los Angeles, CA, USA, October 7-10, 1990.",
                "count": 30,
                "papers": [
                    "The VideoWindow System in Informal Communication.",
                    "TeamWorkStation: Towards a Seamless Shared Workspace.",
                    "Distributed Multiparty Desktop Conferencing System: MERMAID.",
                    "Determinants and Patterns of Control over Technology in a Computerized Meeting Room.",
                    "Collaborative Technology and Group Process Feedback: Their Impact on Interactive Sequences in Meetings.",
                    "Computer-Mediated Communication for Intellectual Teamwork: A Field Experiment in Group Writing.",
                    "SIBYL: A Tool for Managing Group Design Rationale.",
                    "Strudel - An Extensible Electronic Conversation Toolkit.",
                    "Report on a Development Project Use of an Issue-Based Information System.",
                    "Some Social and Economic Consequences of Groupware for Flight Crew.",
                    "Computer Integration: a Co-Requirement for Effective Inter-Organization Computer Network Implementation.",
                    "Knowledge-Domain Interoperability and an Open Hyperdocument System.",
                    "Coordinating Concurrent Development.",
                    "ICICLE: Groupware for Code Inspection.",
                    "Issues in the Design of Computer Support for Co-Authoring and Commenting.",
                    "An Ethnographic Study of Distributed Problem Solving in Spreadsheet Development.",
                    "Patterns of Sharing Customizable Software.",
                    "Cooperative Support for Computer Work: A Social Perspective on the Empowering of End Users.",
                    "Animating Interfaces.",
                    "User Support: Illustrating Computer Use in Collaborative Work Contexts.",
                    "Interface.",
                    "A Visual Calendar for Scheduling Group Meetings.",
                    "Learning from User Experience with Groupware.",
                    "The Temporal Structure of Cooperative Activity.",
                    "Rendezvous: An Architecture for Synchronous Multi-User Applications.",
                    "MMConf: An Infrastructure for Building Shared Multimedia Applications.",
                    "DistEdit: A Distributed Toolkit for Supporting Multiple Group Editors.",
                    "What is Coordination Theory and How Can It Help Design Cooperative Work Systems?",
                    "Why CSCW Applications Fail: Problems in the Adoption of Interdependent Work Tools.",
                    "The Workaday World as a Paradigm for CSCW Design."
                ]
            }
        ]
    },
    {
        "year": "1988",
        "name": "CSCW 1988",
        "info": "Portland, OR, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/cscw/1988",
                "sub_name": "CSCW '88, Proceedings of the Conference on Computer-Supported Cooperative Work, Portland, OR, USA, September 26-28, 1988.",
                "count": 30,
                "papers": [
                    "Patterns of Contact and Communication in Scientific Research Collaboration.",
                    "Video Conferencing as a Technology to Support Group Work: A Review of its Failures.",
                    "Design of a Multi-Media Vehicle for Social Browsing.",
                    "Computer Support for Biomedical Work Groups.",
                    "Who's in Charge here? Cooperative Work and Authority Negotiation in Police Helicopter Missions.",
                    "Computerized Medical Records, Production Pressure and Compartmentalization in the Work Activity of Health Center Physicians.",
                    "Why CSCW Applications Fail: Problems in the Design and Evaluation of Organization of Organizational Interfaces.",
                    "Encountering Electronic Work Groups: A Transaction Costs Perspective.",
                    "In Search of Cooperation: An Historical Analysis of Work Organization and Management Strategies.",
                    "Object Lens: A \"Spreadsheet\" for Cooperative Work.",
                    "Local and Global Structuring of Computer Mediated Communication: Developing Linguistic Perspectives on CSCW in Cosmos.",
                    "gIBIS: A Hypertext Tool for Exploratory Policy Discussion.",
                    "Can Networks Make an Organization?",
                    "The Memoirs of two Survivors: or the Evaluation of a Computer System for Cooperative Work.",
                    "Designing for a Dollar a Day.",
                    "Collaborative Document Production Using Quilt.",
                    "Guided Tours and Tabletops: Tools for Communicating in a Hypertext Environment.",
                    "Conflict Management and Group Decision Support Systems.",
                    "A Framework for Understanding the Workspace Activity of Design Teams.",
                    "A Use of Drawing Surfaces in Different Collaborative Settings.",
                    "Capturing the Capture Concepts: A Case Study in the Design of Computer-Supported Meeting Environments.",
                    "Children's Collaborative Use of a Computer Microworld.",
                    "Collaborative Learning in a Virtual Classroom: Highlights of Findings.",
                    "Sixth Graders and Shared Data: Designing a LAN Environment to Support Collaborative Work.",
                    "Cooperative Work in the Andrew Message System.",
                    "Work Group Structures and Computer Support: A Field Experiment.",
                    "More than just a Communication System: Diversity in the Use of Electronic Mail.",
                    "The Communicative Economy of the Workgroup: Multi-Channel Genres of Communication.",
                    "Contextualism as a World View for the Reformation of Meetings.",
                    "Computer Support for Cooperative Design (invited paper)."
                ]
            }
        ]
    },
    {
        "year": "1986",
        "name": "CSCW 1986",
        "info": "Austin, TX, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/cscw/1986",
                "sub_name": "CSCW '86, Proceedings of the 1986 ACM conference on Computer-supported cooperative work, Austin, Texas, USA, December 3-5, 1986.",
                "count": 35,
                "papers": [
                    "Project Nick: meetings augmentation and analysis.",
                    "Cognoter: theory and practice of a colab-orative tool.",
                    "A group decision support system for idea generation and issue analysis in organization planning.",
                    "The variable impact of computer technologies on the organization of work activities.",
                    "Cognitive science and organizational design: a case study of computer conferencing.",
                    "Narratives at work: story telling as cooperative diagnostic activity.",
                    "Constraints on communication and electronic mail.",
                    "Evolving electronic communication networks: an empirical assessment.",
                    "Semi-structured messages are surprisingly useful for computer-supported coordination.",
                    "The AMIGO Project: advanced group communication model for computer-based communications environment.",
                    "Panel on alternative views of cooperative work in the office.",
                    "Panel session on collaborative design: technology futures.",
                    "Contexts: a partitioning concept for hypertext.",
                    "Supporting collaboration in notecards.",
                    "Intermedia: issues, strategies, and tactics in the design of a hypermedia document system.",
                    "Data sharing in group work.",
                    "Network-based systems for asynchronous group communication.",
                    "Tools help people co-operate only to the extent that they help them share goals and terminology.",
                    "A language/action perspective on the design of cooperative work.",
                    "A framework for studying research collaboration.",
                    "Relationships and tasks in scientific research collaborations.",
                    "Collaboration research in SCL.",
                    "From theories to systems.",
                    "Computer-supported groups: trends & markets.",
                    "A performing medium for working group graphics.",
                    "An experiment in integrated multimedia conferencing.",
                    "WYSIWIS revised: early experiences with multi-user interfaces.",
                    "Computer teleconferencing: experience at Hewlett-Packard.",
                    "Achieving sustainable complexity through information technology: theory and practice.",
                    "Computer-supported cooperative work: examples and issues in one federal agency.",
                    "Chaos as coordination technology.",
                    "Using a computer-based tool to support collaboration: a field experiment.",
                    "Computer-based systems for cooperative work and group decisionmaking: status of use and problems in development.",
                    "Synview: the design of a system for cooperative structuring of information.",
                    "Enhancing creativity with collaborative tools."
                ]
            }
        ]
    }
]