[
    {
        "year": "2020",
        "name": "AVI 2020",
        "info": "Island of Ischia, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/avi/2020",
                "sub_name": "AVI '20: International Conference on Advanced Visual Interfaces, Island of Ischia, Italy, September 28 - October 2, 2020.",
                "count": 109,
                "papers": [
                    "Doing Inclusive Design: From GenderMag in the Trenches to Inclusive Mag in the Research Lab.",
                    "Ten Objectives and Ten Rules for Designing Automations in Interaction Techniques, User Interfaces and Interactive Systems.",
                    "Interactive Human Centered Artificial Intelligence: A Definition and Research Challenges.",
                    "Activity River: Visualizing Planned and Logged Personal Activities for Reflection.",
                    "Bring2Me: Bringing Virtual Widgets Back to the User's Field of View in Mixed Reality.",
                    "Caarvida: Visual Analytics for Test Drive Videos.",
                    "Categories and Completeness of Visual Programming and Direct Manipulation.",
                    "Children's Beliefs and Understanding of Smart Objects: An Exploratory Study.",
                    "ClaVis: An Interactive Visual Comparison System for Classifiers.",
                    "Comparing and Exploring High-Dimensional Data with Dimensionality Reduction Algorithms and Matrix Visualizations.",
                    "Corsican Twin: Authoring In Situ Augmented Reality Visualisations in Virtual Reality.",
                    "CrossWidgets: Enhancing Complex Data Selections through Modular Multi Attribute Selectors.",
                    "CyberVR: An Interactive Learning Experience in Virtual Reality for Cybersecurity Related Issues.",
                    "DELEX: a DEep Learning Emotive eXperience: Investigating empathic HCI.",
                    "Design and evaluation of an educational virtual reality application for learning how to perform on a stage.",
                    "Designing usable interfaces for the Industry 4.0.",
                    "Drawing Graphs on the Sphere.",
                    "Emotions on the Go: Mobile Emotion Assessment in Real-Time using Facial Expressions.",
                    "Evaluating the Scalability of Non-Preferred Hand Mode Switching in Augmented Reality.",
                    "Evaluating User Preferences for Augmented Reality Interactions with the Internet of Things.",
                    "Exploring the Potential of Speech-based Virtual Assistants in Mixed Reality Applications for People with Cognitive Disabilities.",
                    "Externalizing Mental Images by Harnessing Size-Describing Gestures: Design Implications for a Visualization System.",
                    "HeyTAP: Bridging the Gaps Between Users' Needs and Technology in IF-THEN Rules via Conversation.",
                    "Immersion in Desktop-Based Web Browsing: A Framework.",
                    "Incidental Visualizations: Pre-Attentive Primitive Visual Tasks.",
                    "Interactive Time-Series of Measures for Exploring Dynamic Networks.",
                    "miniJava: Automatic Miniaturization of Java Applications.",
                    "Preserving Contextual Awareness during Selection of Moving Targets in Animated Stream Visualizations.",
                    "Recognition and Recall of Geographic Data In Cartograms.",
                    "RegLine: Assisting Novices in Refining Linear Regression Models.",
                    "Taking the Long View: Structured Expert Evaluation for Extended Interaction.",
                    "Target Expansion in Context: the Case of Menu in Handheld Augmented Reality.",
                    "TieLent: A Casual Neck-Mounted Mouth Capturing Device for Silent Speech Interaction.",
                    "TuVe: A Shape-changeable Display using Fluids in a Tube.",
                    "Using Virtual Reality and Music in Cognitive Disability Therapy.",
                    "Virtual bowling: launch as you all were there!",
                    "Visual Encodings for Networks with Multiple Edge Types.",
                    "Visual Exploration of Time-Series Forecasts Through Structured Navigation.",
                    "When High Fidelity Matters: AR and VR Improve the Learning of a 3D Object.",
                    "3D Tabletop AR: A Comparison of Mid-Air, Touch and Touch+Mid-Air Interaction.",
                    "A Chrome extension to help people with dyslexia.",
                    "A Language-based Interface for Analysis of Digital Storytelling.",
                    "A Question-Oriented Visualization Recommendation Approach for Data Exploration.",
                    "A Visual Environment for End-User Creation of IoT Customization Rules with Recommendation Support.",
                    "A Visual Tool for Supporting Decision-Making in Privacy Oriented Software Development.",
                    "AR Based User Adaptive Compensation of Metamorphopsia.",
                    "Are Thermal Attacks Ubiquitous?: When Non-Expert Attackers Use Off the shelf Thermal Cameras.",
                    "Augmented Situated Visualization for Spatial and Context-Aware Decision-Making.",
                    "BreastScreening: On the Use of Multi-Modality in Medical Imaging Diagnosis.",
                    "Circles of Affordance: Proposal for a diagnostic tool to support usability studies.",
                    "Conversational Interfaces for a Smart Campus: A Case Study.",
                    "Counterterrorism for Cyber-Physical Spaces: A Computer Vision Approach.",
                    "Designing a Self-help Mobile App to Cope with Avoidance Behavior in Panic Disorder.",
                    "Don't Use Fingerprint, it's Raining!: How People Use and Perceive Context-Aware Selection of Mobile Authentication.",
                    "Empirical Study of Focus-Plus-Context and Aggregation Techniques for the Visualization of Streaming Data.",
                    "Examining Fitts' and FFitts' Law Models for Children's Pointing Tasks on Touchscreens.",
                    "Examining the Presentation of Information in Augmented Reality Headsets for Situational Awareness.",
                    "Hand Gesture Interaction with a Low-Resolution Infrared Image Sensor on an Inner Wrist.",
                    "MirAIProjection: Real-time Projection onto High-speed Objects by Predicting Their 3D Position and Pose using DNNs.",
                    "Modelling Data Visualization Interactions: from Semiotics to Pragmatics and Back to Humans.",
                    "Neural Data-Driven Captioning of Time-Series Line Charts.",
                    "ParVis: A visual tool for exploring parser execution traces.",
                    "Polka: A Water-jet Printer for Painting on the Grounds.",
                    "Pose Estimation for Facilitating Movement Learning from Online Videos.",
                    "iBall to Swim: a Serious Game for Children with Autism Spectrum Disorder.",
                    "Towards a cognitive-inspired automatic unitizing technique: a feasibility study.",
                    "Understanding and Supporting Academic Literature Review Workflows with LitSense.",
                    "Vibrotactile Feedback for Vertical 2D Space Exploration.",
                    "Visualizing Program Genres' Temporal-Based Similarity in Linear TV Recommendations.",
                    "A color map to compare reactions tools in interactive systems.",
                    "A Design Space for Advanced Visual Interfaces for Teleoperated Autonomous Vehicles.",
                    "A Framework for Biometric Recognition in Online Content Delivery Platforms.",
                    "A New Notation for Interactive Systems.",
                    "A Playful Citizen Science Tool for Casual Users.",
                    "A Voice User Interface for football event tagging applications.",
                    "A Web App for Teaching Piano to Students with Autism.",
                    "An Haptic Interface for Industrial High-Precision Manufacturing Tasks.",
                    "ARCA. Semantic exploration of a bookstore.",
                    "cASpER: A Plug-in for Automated Code Smell Detection and Refactoring.",
                    "Designing different features of an interactive tabletop application to support collaborative problem-solving.",
                    "Designing Visual Tools to Facilitate Human-Centered Design.",
                    "Domus: a multi-user TUI game for multi-touch tables.",
                    "FeedBucket: Simplified Haptic Feedback for VR and MR.",
                    "Gaze-Based Moving Target Acquisition using Pseudo Stopping for the Time predicted via Fitts' Law.",
                    "Giving Motivation for Using Secure Credentials through User Authentication by Game.",
                    "Information Visualization Interface on Home Router Traffic Data for Laypersons.",
                    "Integrated Visual Analytics Approach against Multivariate Cybersecurity Attack.",
                    "Interaction in Volumetric Film: An Overview.",
                    "Introducing Artificial Commensal Companions.",
                    "Modified AttrakDiff in UX Evaluation of a Mobile Prototype.",
                    "Personalized Multifaceted Visualization of Scholars Profiles.",
                    "PowerShare 2.0: A Gamified P2P Energy Trading Platform.",
                    "SelfLens: A Portable Tool to Facilitate All People in Getting Information on Food Items.",
                    "Space-free Gesture Interaction with Humanoid Robot.",
                    "SuppleView: Rotation-Based Browsing Method by Changing Observation Angle of View for an Actor in Existing Videos.",
                    "TeMoCo-Doc: A visualization for supporting temporal and contextual analysis of dialogues and associated documents.",
                    "The CrazySquare solution: a gamified ICT tool to support the musical learning in pre-adolescents.",
                    "The Therapeutic Use of Humanoid Robots for Behavioral Disorders.",
                    "V-DOOR: A Real-Time Virtual Dressing Room Application Using Oculus Rift.",
                    "Visual analysis of interactive document clustering streams.",
                    "VITRuM: A Plug-In for the Visualization of Test-Related Metrics.",
                    "Wearable Interfaces and Advanced Sensors to Enhance Firefighters Safety in Forest Fires.",
                    "Visual user interfaces for human motion.",
                    "VIDEM 2020: Workshop on Visual Interface Design Methods.",
                    "Data4Good: Designing for Diversity and Development.",
                    "AVI2CH 2020: Workshop on Advanced Visual Interfaces and Interactions in Cultural Heritage.",
                    "EMPATHY: Empowering People in Dealing with Internet of Things Ecosystems (Workshop).",
                    "ITAVIS: 2nd Italian Visualization & Visual Analytics Workshop.",
                    "Big Data Analysis, AI, and Visualization Workshop: Road Mapping Infrastructures for Artificial Intelligence Supporting Advanced Visual Big Data Analysis."
                ]
            },
            {
                "sub_name_abbr": "conf/avi/2020bda",
                "sub_name": "Advanced Visual Interfaces. Supporting Artificial Intelligence and Big Data Applications - AVI 2020 Workshops, AVI-BDA and ITAVIS, Ischia, Italy, June 9, 2020 and September 29, 2020, Revised Selected Papers.",
                "count": 14,
                "papers": [
                    "AI2VIS4BigData: A Reference Model for AI-Based Big Data Analysis and Visualization.",
                    "A Visual Analytics Technique to Compare the Performance of Predictive Models.",
                    "Affective Analytics and Visualization for Ensemble Event-Driven Stock Market Forecasting.",
                    "Understanding the Role of (Advanced) Machine Learning in Metagenomic Workflows.",
                    "Intelligent Advanced User Interfaces for Monitoring Mental Health Wellbeing.",
                    "Towards Explainable Artificial Intelligence and Explanation User Interfaces to Open the 'Black Box' of Automated ECG Interpretation.",
                    "Recognition and Visualization of Facial Expression and Emotion in Healthcare.",
                    "Machine Learning in Healthcare: Breast Cancer and Diabetes Cases.",
                    "AI2VIS4BigData: Qualitative Evaluation of an AI-Based Big Data Analysis and Visualization Reference Model.",
                    "Progressive Visualization of Epidemiological Models for COVID-19 Visual Analysis.",
                    "An Experience on Cooperative Development of Interactive Visualizations for the Analysis of Urban Data.",
                    "Explaining AI Through Critical Reflection Artifacts - On the Role of Communication Design Within XAI.",
                    "Information Visualization and Visual Analytics at IVU Lab.",
                    "Visual Analytics for Financial Crime Detection at the University of Perugia."
                ]
            },
            {
                "sub_name_abbr": "conf/avi/2020empathy",
                "sub_name": "Proceedings of the 1st International Workshop on Empowering People in Dealing with Internet of Things Ecosystems co-located with International Conference on Advanced Visual Interfaces (AVI 2020), Online / Island of Ischia, Italy, September 29, 2020.",
                "count": 11,
                "papers": [
                    "ARSPO revisited: how to design adaptive recommender smart objects in EUD context.",
                    "If when is better than if (and while might help): on the importance of influencing mental models in EUD (a pilot study).",
                    "Social Assistive Robots in Elderly Care: Exploring the role of Empathy.",
                    "A Card-based Toolkit for Co-Designing Smart Interactive Experiences with Subjects with Neurodevelopmental Disorders.",
                    "Conceptual Modeling of Multisensory Smart Spaces.",
                    "Empowering caregivers in multisensory smart spaces for education and therapy.",
                    "Personalizing IoT Ecosystems via Voice.",
                    "Recommendations for Personalization Rules in Block Composer.",
                    "Integrating the Node-RED server in an IoT platform for ECA rules management.",
                    "Simplify Node-Red For End UserDevelopment in SeismoCloud.",
                    "Empowering End-Users in the Specification of Security Rules."
                ]
            },
            {
                "sub_name_abbr": "conf/avi/2020avi2ch",
                "sub_name": "Proceedings of the AVI²CH Workshop on Advanced Visual Interfaces and Interactions in Cultural Heritage co-located with 2020 International Conference on Advanced Visual Interfaces (AVI 2020), Island of Ischia, Italy, September 29, 2020.",
                "count": 11,
                "papers": [
                    "\"Take me Home\": AR to Connect Exhibits to Excavation Sites.",
                    "Cultural Heritage and Social Experiences in the Times of COVID 19.",
                    "Bringing Digital Curation to Archaeological Projects: Evidence from the BeArchaeo Project.",
                    "From Pixels to Notes: A Computational Implementation of Synaesthesia for Cultural Artefacts.",
                    "Using Mobile Devices as Activity Aids in a History Museum.",
                    "Using Eye Tracking Data to Understand Visitors' Behaviour.",
                    "Towards Advanced Interfaces for Citizen Curation.",
                    "Public Participation in Museums and Cultural Heritage Sites: iCommunity Mobile Application.",
                    "Pepper4Museum: Towards a Human-like Museum Guide.",
                    "Assessment of Digital Environments for Cultural Heritage Communication.",
                    "ICT Driven Platform for High-Quality Virtual Contents Creation and Sharing with e-Tourism Purposes. The Interreg IT-HR REMEMBER Project."
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "AVI 2018",
        "info": "Castiglione della Pescaia, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/avi/2018",
                "sub_name": "Proceedings of the 2018 International Conference on Advanced Visual Interfaces, AVI 2018, Castiglione della Pescaia, Italy, May 29 - June 01, 2018.",
                "count": 89,
                "papers": [
                    "Envisioning conversation: toward understanding and augmenting common ground.",
                    "Visual analytics for high dimensional data.",
                    "Using technology for health and wellbeing.",
                    "Digital interaction: where are we going?",
                    "The future of computing and food: extended abstract.",
                    "AVI-CH 2018: Advanced Visual Interfaces for Cultural Heritage.",
                    "Cultures of participation in the digital age: design trade-offs for an inclusive society.",
                    "GHItaly18: 2nd International Workshop on Games-Human Interaction.",
                    "HCI and the educational technology revolution #HCIEd2018: a workshop on video-making for teaching and learning human-computer interaction.",
                    "ITA.WA.: 1st Italian Visualization & Visual Analytics Workshop.",
                    "Multimodal interaction for data visualization.",
                    "VisBIA 2018: workshop on Visual Interfaces for Big Data Environments in Industrial Applications.",
                    "Designing prosthetic memory: audio or transcript, that is the question.",
                    "Impact of semantic aids on command memorization for on-body interaction and directional gestures.",
                    "Custom-made tangible interfaces with touchtokens.",
                    "Simulating an extendable tangible slider for eyes-free one-handed interaction on mobile devices.",
                    "A virtual reality shopping experience using the apartment metaphor.",
                    "VRpursuits: interaction in virtual reality using smooth pursuit eye movements.",
                    "Mobile devices for interaction in immersive virtual environments.",
                    "Visual complexity of graphical user interfaces.",
                    "Hooked on data videos: assessing the effect of animation and pictographs on viewer engagement.",
                    "Identifying and exploring design trade-offs in human-centered design.",
                    "ABBOT: a smart toy motivating children to become outdoor explorers.",
                    "Exploring the world through small green steps: improving sustainable school transportation with a game-based learning interface.",
                    "Effect of temporality, physical activity and cognitive load on spatiotemporal vibrotactile pattern recognition.",
                    "Squachu: a training game to improve oral function via a non-contact tongue-mouth-motion detection system.",
                    "Choreomorphy: a whole-body interaction experience for dance improvisation and visual experimentation.",
                    "Movespace: on-body athletic interaction for running and cycling.",
                    "Inside looking out or outside looking in?: an evaluation of visualisation modalities to support the creation of a substitutional virtual environment.",
                    "Improving revisitation in long documents with two-level artificial-landmark scrollbars.",
                    "GRAM: global research activity map.",
                    "Behind-the-mask: a face-through head-mounted display.",
                    "Does image grid visualization affect password strength and creation time in graphical authentication?",
                    "A real-time image processing framework with an aerial overhead camera for sports.",
                    "Investigating augmented reality support for novice users in circuit prototyping.",
                    "Building a qualified annotation dataset for skin lesion analysis trough gamification.",
                    "The importance of empowerment goals in elderly-centered interaction design.",
                    "Map-based visualization of 2D/3D spatial data via stylization and tuning of information emphasis.",
                    "The invisible gorilla revisited: using eye tracking to investigate inattentional blindness in interface design.",
                    "Visualizing software hierarchy and metrics over releases.",
                    "Size matters: the effects of interactive display size on interaction zone expectations.",
                    "COMFRE: a visualization for comparing word frequencies in linguistic tasks.",
                    "Tangraphe: interactive exploration of network visualizations using single hand, multi-touch gestures.",
                    "Tiltstacks: composing shape-changing interfaces using tilting and stacking of modules.",
                    "Crossing spaces: towards cross-media personal information management user interfaces.",
                    "Snap-changes: a dynamic editing strategy for directing viewer's attention in streaming virtual reality videos.",
                    "A study on gaze guidance using artificial color shifts.",
                    "From robot to virtual doppelganger: impact of avatar visual fidelity and self-esteem on perceived attractiveness.",
                    "Investigating class conversations with classtalk: a study with tangible object prototypes in a primary school.",
                    "Simple shape-based touch behavioral biometrics authentication for smart mobiles.",
                    "A gesture recognition framework for exploring museum exhibitions.",
                    "A system to support non-IT researchers in the automated analysis of human movement.",
                    "Creating maps of artificial spaces to explore trajectories.",
                    "Exploring pressure in football.",
                    "Visual exploration and analysis of the italian cybersecurity framework.",
                    "Transparency-based information filtering on 2D/3D geographical maps.",
                    "Towards an IoT model for the assessment of smart devices.",
                    "Trigger-action programming for context-aware elderly support in practice.",
                    "A tangible-programming technology supporting end-user development of smart-environments.",
                    "Interaction modularity in multi-device systems: a conceptual approach.",
                    "A wearable immersive web-virtual reality approach to remote neurodevelopmental disorder therapy.",
                    "VERTO: a visual notation for declarative process models.",
                    "Towards intelligible graph data visualization using circular layout.",
                    "Facilitating exploration on exhibitions with augmented reality.",
                    "BiD-chord: an extended chord diagram for showing relations between bi-categorical dimensional data.",
                    "Big data landscapes: improving the visualization of machine learning-based clustering algorithms.",
                    "VISKOMMP: graph visualization meets meeting documentation.",
                    "Towards a construction kit for visual search interfaces.",
                    "Demonstrating vistiles: visual data exploration using mobile devices.",
                    "Visual insight of spatiotemporal IoT-generated contents.",
                    "A framework for creative embodied interfaces.",
                    "Estimating finger postures by attaching an omnidirectional camera to the center of a user's palm.",
                    "EpisoDAS: DAS-based password generation using episodic memories.",
                    "Mojirage: average handwritten note.",
                    "PhoToDo: image-based task management system by visual trigger.",
                    "Towards understanding the usability of vibrotactile support for indoor orientation.",
                    "Towards a fully personalized food recommendation tool.",
                    "Keyboard with tactile feedback on smartphone touch screen.",
                    "BUSt: distributed user interface for an IoT framework.",
                    "A virtual cocktail party: supporting informal social interactions in a virtual conference.",
                    "Spatial statistics for analyzing data in cinematic virtual reality.",
                    "Improving urban environment awareness through pervasive AR games.",
                    "A virtual reality map interface for geographical information systems.",
                    "Integrating body scanning solutions into virtual dressing rooms.",
                    "Two-level artificial-landmark scrollbars to improve revisitation in long documents.",
                    "Emoji-nized log browser: visualization of server-logs by emoji for system administrators.",
                    "Video coursework: opportunity and challenge for HCI education.",
                    "Equal-height treemaps for multivariate data.",
                    "A multimodal interface system to support drawing diagrams in talking."
                ]
            },
            {
                "sub_name_abbr": "conf/avi/2018ch",
                "sub_name": "Proceedings of the AVI-CH 2018 Workshop on Advanced Visual Interfaces for Cultural Heritage co-located with 2018 International Conference on Advanced Visual Interfaces (AVI 2018), Castiglione della Pescaia, Italy, May 29, 2018.",
                "count": 9,
                "papers": [
                    "BrainArt: a BCI-based Assessment of User's Interests in a Museum Visit.",
                    "Towards Enabling Cultural-Heritage Experts to Create Customizable Visit Experiences.",
                    "\"Ora sì ch'io son contenta: sembra fatto inver per me\" Identifying User Requirements for Wearable Augmented Reality at Opera.",
                    "Culturaturismo.piemonte: Coordinating Cultural and Touristic Operators via the Georeferenced Civic Social Network FirstLife.",
                    "Advanced Visual Interfaces to Represent Cultural and Historical Facts and Associations in the CrossCult EU project.",
                    "Swiping in the Wild: An Evaluation in the Wild of a StorytellingApp for Children.",
                    "Semantically Annotated 3D Material Supporting the Design of Natural User Interfaces for Architectural Heritage.",
                    "An Audiovisual Corpus of Guided Tours in Cultural Sites: Data Collection protocols in the CHROME Project.",
                    "Visualization of Cultural-Heritage Content based on Individual Cognitive Differences."
                ]
            },
            {
                "sub_name_abbr": "conf/avi/2018visbia",
                "sub_name": "Proceedings of VisBIA 2018 - Workshop on Visual Interfaces for Big Data Environments in Industrial Applications Co-located with AVI 2018 - International Conference on Advanced Visual Interfaces, Resort Riva del Sole, Castiglione della Pescaia, - Grosseto (Italy), 29 May, 2018.",
                "count": 7,
                "papers": [
                    "Ceci n'est pas la data: Towards a Notion of Interaction Literacy for Data Visualization.",
                    "Using Parallel Sets for Visualizing Results of Machine Learning Based Plausibility Checks in Product Costing.",
                    "The Data in Your Hands: Exploring Novel Interaction Techniques and Data Visualization Approaches for Immersive Data Analytics.",
                    "Exploring Visualization Challenges for Interactive Recommender Systems.",
                    "Lessons Learned from a Knowledge-driven Search Application on-top of Large Linked Data Sets.",
                    "Conversation Trainings - Towards a Multidimensional Visualization of Learning Flows.",
                    "Big Data Landscapes in Virtual Reality using Glyph-Based Visualizations."
                ]
            },
            {
                "sub_name_abbr": "conf/avi/2018copda",
                "sub_name": "Proceedings of the Fifth International Workshop on Cultures of Participation in the Digital Age: Design Trade-offs for an Inclusive Society co-located with the International Conference on Advanced Visual Interfaces (AVI 2018), Castiglione della Pescaia (GR), Italy, May 29, 2018.",
                "count": 11,
                "papers": [
                    "Design Trade-Offs for an Inclusive Society: Frameworks, Examples, and Challenges.",
                    "HeartMan: (Self-)Managing Chronic Heart Failure.",
                    "Trade-offs in the Design of Multimodal Interaction for Older Adults.",
                    "Prototyping for Investigating Affective Objects with and for Children.",
                    "Reflections on using Story-Dialogue Method in a workshop with interaction design students.",
                    "Tradeoffs in Combining Domain-Specific and Generic Skills' Practice in Minecraft in Social Studies in Teacher Education.",
                    "Feelings Detection System - A Proposal.",
                    "Chatbots and Conversational Interfaces: Three Domains of Use.",
                    "Mammy - A Technological Tool to Exchange Information.",
                    "An IoT Model for Coping with Trade-offs in Designing Smart Environments.",
                    "'Design for All' versus 'One-Size-Fits-All': The Case of Cultural Heritage."
                ]
            },
            {
                "sub_name_abbr": "conf/avi/2018ghitaly",
                "sub_name": "Proceedings of 2nd Workshop on Games-Human Interaction (GHItaly 2018) co-located with AVI 2018 - International Working Conference on Advanced Visual Interfaces, Castiglione della Pescaia, Grosseto (Italy), May 29th, 2018.",
                "count": 9,
                "papers": [
                    "GHItaly18: Game-Computer Interaction in research.",
                    "Evaluation of Virtual Reality Games: Simulator Sickness and Human Factors.",
                    "Semiotic Framework for Virtual Reality Usability and UX Evaluation: a Pilot Study.",
                    "The impact of user interfaces for the enhancement of narrative elements of a video game.",
                    "Things from Another World. VR, UI and UX through Run of Mydan.",
                    "G.E.M.I.X.: Game Engine Movie Interaction eXperience.",
                    "EmoBrain: Playing with Emotions in the Target.",
                    "Creation of Physiatric Exercises for Remote Use in Rehabilitation Exergames.",
                    "The Impact of Gamification on Socio-technical Communities: A Case for Network Analysis."
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "AVI 2016",
        "info": "Bari, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/avi/2016",
                "sub_name": "Proceedings of the International Working Conference on Advanced Visual Interfaces, AVI 2016, Bari, Italy, June 7-10, 2016.",
                "count": 87,
                "papers": [
                    "Personal Fabrication in HCI: Trends and Challenges.",
                    "The Affective Body Argument in Technology Design.",
                    "Simple is Good: Observations of Visualization Use Amongst the Big Data Digerati.",
                    "Smart Lighting for Fashion Store Windows.",
                    "Mid-Air Browsing and Selection in Image Collections.",
                    "Visual Guidance with Unnoticed Blur Effect.",
                    "Exploring Two-handed Indirect Multi-touch Input for a Docking Task.",
                    "Touchless Interfaces For Public Displays: Can We Deliver Interface Designers From Introducing Artificial Push Button Gestures?",
                    "Interver: Drilling into Categorical-Numerical Relationships.",
                    "Target Expansion Lens: It is Not the More Visual Feedback the Better!",
                    "Identifying Best Practices for Visualizing Photo Statistics and Galleries using Treemaps.",
                    "Treemaps and the Visual Comparison of Hierarchical Multi-Attribute Data.",
                    "Go With the Flow: Effects of Transparency and User Control on Targeted Advertising Using Flow Charts.",
                    "A Better Grasp on Pictures Under Glass: Comparing Touch and Tangible Object Manipulation using Physical Proxies.",
                    "Flexible Trees: Sketching Tree Layouts.",
                    "Timelines for Mobile Web Usability Evaluation.",
                    "NetFork: Mapping Time to Space in Network Visualization.",
                    "Assessing Topic Representations for Gist-Forming.",
                    "Network Explorer: Design, Implementation, and Real World Deployment of a Large Network Visualization Tool.",
                    "Go and Grow: Mapping Personal Data to a Living Plant.",
                    "What-I-See: A Tangible Visualization of Energy.",
                    "Watchpoint: Freehand Pointing with a Smartwatch in a Ubiquitous Display Environment.",
                    "Analysis of Intrapersonal Synchronization in Full-Body Movements Displaying Different Expressive Qualities.",
                    "YouTouch! Low-Cost User Identification at an Interactive Display Wall.",
                    "Designing 3D Gesture Guidance: Visual Feedback and Feedforward Design Options.",
                    "Magic Mirror Interface for Augmented Reality Maintenance: An Automotive Case Study.",
                    "Three-Point Interaction: Combining Bi-manual Direct Touch with Gaze.",
                    "PimVis: Exploring and Re-finding Documents in Cross-Media Information Spaces.",
                    "LifeBook: A Mobile Personal Information Management System on the Cloud.",
                    "Spreadsheets as User Interfaces.",
                    "Wearable Immersive Storytelling for Disabled Children.",
                    "Natural User Interfaces to Support and Enhance Real-Time Music Performance.",
                    "Fitmersive Games: Fitness Gamification through Immersive VR.",
                    "Interface for Augmenting Spatial Orientation of Pilots via Low Cognitive Load, Peripheral Vision.",
                    "Gestural Text Input Using a Smartwatch.",
                    "Monitoring and Adaptation in Smart Spaces for Disabled Children.",
                    "Novel Indirect Touch Input Techniques Applied to Finger-Forming 3D Models.",
                    "HyNote: Integrated Concept Mapping and Notetaking.",
                    "Towards the Right Assistance at the Right Time for Using Complex Interfaces.",
                    "Applying Guidelines for the Design of Distortions on Focus+Context Interfaces.",
                    "Influence of Error Rate on Frustration of BCI Users.",
                    "AM-DCT: A Visual Attention Modeling Data Capturing Tool for Investigating Users' Interface Monitoring Behavior.",
                    "Multitouch Radial Menu Integrating Command Selection and Control of Arguments with up to 4 Degrees of Freedom.",
                    "Static vs. Dynamic Time Mapping in Radial Composite Indicator Visualization.",
                    "VISAGE: Interactive Visual Graph Querying.",
                    "Animations 25 Years Later: New Roles and Opportunities.",
                    "Visualizing Software Structures through Enhanced Interactive Sunburst Layout.",
                    "Exploiting Visual Notations for Data Exploration: The EFESTO Platform.",
                    "End-User Development for Lifelogging and eWellness.",
                    "TAB Sharing: A Gamified Tool for e-Participation.",
                    "Annotating Live Video with Tablet Computers: A Preliminary User Study.",
                    "Visualizing Integration Uncertainty Enhances User's Choice in Multi-Providers Integrated Maps.",
                    "Your Friends Mention It. What About Visiting It?: A Mobile Social-Based Sightseeing Application.",
                    "Visual Synchronization of Music Notation in Ancient Choir-Books.",
                    "Gaze-based Interaction with a Shop Window.",
                    "Step by Step: Investigating Foot Gesture Interaction.",
                    "AmI@Home: A Game-Based Collaborative System for Smart Home Configuration.",
                    "Interacting with Industrial Robots: A Motion-based Interface.",
                    "A Petri-Net Based Approach to Measure the Learnability of Interactive Systems.",
                    "Social-Circles Exploration through Interactive Multi-Layered Chord Layout.",
                    "Low-Cost Latency Compensation in Motion Tracking for Smartphone-Based Head Mounted Display.",
                    "Mobiles and Wearables: Owner Biometrics and Authentication.",
                    "A Study on Developing the Interface of Mobile E-learning Application for Children's Foreign Language Education.",
                    "Usability Engineering Practices in Software Development Organizations: The Greek and the Italian Case Study.",
                    "Catching Relevance in One Glimpse: Food or Not Food?",
                    "Time-load: Visualization of Energy Consumption Loads Over Time.",
                    "Supporting Singers with Tangible and Visual Feedback.",
                    "Using Eye-Tracking for Enhancing the Museum Visit Experience.",
                    "Tiles: An Inventor Toolkit for Interactive Objects.",
                    "The EmoQuest Project: Emotions in Q&A Sites.",
                    "The SeismoCloud App: Your Smartphone as a Seismometer.",
                    "PlayVR: a VR Experience for the World of Theater.",
                    "Authoring Augmented Digital Experiences in Museums.",
                    "PanoramaGrid: A Graph Paper Tracing Framework for Sketching 360-degree Immersed Experiences.",
                    "Instigating Imagination: Teaching Interface and Typography as Metaphor.",
                    "Inmersive End User Development for Virtual Reality.",
                    "A Circular Visualization Technique for Collaboration and Quantifying Self.",
                    "VR 3D Visualization Interface.",
                    "Dolphin Sam: A Smart Pet for Children with Intellectual Disability.",
                    "Rapid Development of Web Applications that use Tilting Interactions in Single and Multi-Device Scenarios.",
                    "Bridging Physical Space and Digital Landscape to Drive Retail Innovation.",
                    "5-Step Approach to Designing Controlled Experiments.",
                    "Advanced Visual Interfaces for Cultural Heritage.",
                    "Road Mapping Infrastructures for Advanced Visual Interfaces Supporting Big Data Applications in Virtual Research Environments.",
                    "HCI and the Educational Technology Revolution.",
                    "SERVE: Smart Ecosystems cReation by Visual dEsign Authoring Internet of Things and Smart Objects Applications.",
                    "Valuable Visualization of Healthcare Information: From the Quantified Self Data to Conversations."
                ]
            },
            {
                "sub_name_abbr": "conf/avi/2016serve",
                "sub_name": "Proceedings of the First International Workshop on Smart Ecosystems cReation by Visual dEsign co-located with the International Working Conference on Advanced Visual Interfaces (AVI 2016), Bari, Italy, June 07, 2016.",
                "count": 9,
                "papers": [
                    "A Visual Paradigm for Defining Task Automation.",
                    "Remotino: Supporting End-User Developers in Prototyping Embedded Devices.",
                    "IoT for Smart City Learning: Towards Requirements for an Authoring Tool.",
                    "Tiles Cards: a Card-based Design Game for Smart Objects Ecosystems.",
                    "An Authoring Environment for Smart Objects in Museums: the meSch Approach.",
                    "Internet of T(eachi)ngs: Assessing Children's Learning in the IoT Era.",
                    "A Multi-layered Context Modelling Approach for End Users, Expert Users and Programmers.",
                    "End-User Development for Lifelogging and eWellness.",
                    "Designing Multimodal Interactive Systems using EyesWeb XMI."
                ]
            },
            {
                "sub_name_abbr": "conf/avi/2016vvh",
                "sub_name": "Proceedings of the Workshop on Valuable Visualization of Healthcare Information: from the quantified self data to conversations, VVH 2016, co-located with the 2016 International Working Conference on Advanced Visual Interfaces (AVI 2016), Bari, Italy, June 7th, 2016.",
                "count": 6,
                "papers": [
                    "A brief Survey of Recent Clinical Dashboards.",
                    "A Dynamic Approach to Medical Data Visualization and Interaction.",
                    "Circulation of Opinions in Visualization Reading.",
                    "Using Visual Analytics of Heart Rate Variation to Aid in Diagnostics.",
                    "Lightweight Visual Data Analysis on Mobile Devices - Providing Self-Monitoring Feedback.",
                    "Probing Interactivity in Open Data for General Practice. An Evidence-Based Approach."
                ]
            },
            {
                "sub_name_abbr": "conf/avi/2016ch",
                "sub_name": "Proceedings of the 1st Workshop on Advanced Visual Interfaces for Cultural Heritage co-located with the International Working Conference on Advanced Visual Interfaces (AVI 2016), Bari, Italy, June 7-10, 2016.",
                "count": 11,
                "papers": [
                    "Advanced Visual Interface for Cultural Heritage.",
                    "Adaptation and Content Personalization in the Context of Multi User Museum Exhibits.",
                    "A Field Evaluation of an Intelligent Interaction Between People and a Territory and its Cultural Heritage.",
                    "Multimedia Responses in Natural Language Dialogues.",
                    "Cultural Heritage Presentations with a Humanoid Robot Using Implicit Feedback.",
                    "Exploring the Potential Contribution of Mobile Eye-tracking Technology in Enhancing the Museum Visit Experience.",
                    "Gestural Interaction and Navigation Techniques for Virtual Museum Experiences.",
                    "Navigating Wall-sized Displays with the Gaze: a Proposal for Cultural Heritage.",
                    "Visualizing Museum Visitors' Behavior.",
                    "Padova Soundscape: a Crowdsourcing Approach to Describe the Sound of a City (position paper).",
                    "CHEST: Cultural Heritage Experience Scrapbook Tool."
                ]
            },
            {
                "sub_name_abbr": "conf/avi/2016bda",
                "sub_name": "Advanced Visual Interfaces. Supporting Big Data Applications - AVI 2016 Workshop, AVI-BDA 2016, Bari, Italy, June 7-10, 2016, Revised Selected Papers.",
                "count": 10,
                "papers": [
                    "IVIS4BigData: A Reference Model for Advanced Visual Interfaces Supporting Big Data Analysis in Virtual Research Environments.",
                    "Engineering Study of Tidal Stream Renewable Energy Generation and Visualization: Issues of Process Modelling and Implementation.",
                    "Cost Effective Visualization of Research Data for Cognitive Development Using Mobile Augmented Reality.",
                    "Visualizing Next-Generation Sequencing Cancer Data Sets with Cloud Computing.",
                    "SenseCare: Towards an Experimental Platform for Home-Based, Visualisation of Emotional States of People with Dementia.",
                    "Toward Interactive Visualization of Results from Domain-Specific Text Analytics.",
                    "Towards Synchronizing Data Sources and Information Visualization in Virtual Research Environments.",
                    "Visual Analytics and Mining over Big Data. Discussing Some Issues and Challenges, and Presenting a Few Experiences.",
                    "A Meta-design Approach to Support Information Access and Manipulation in Virtual Research Environments.",
                    "IVIS4BigData: Qualitative Evaluation of an Information Visualization Reference Model Supporting Big Data Analysis in Virtual Research Environments."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "AVI 2014",
        "info": "Como, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/avi/2014",
                "sub_name": "International Working Conference on Advanced Visual Interfaces, AVI 2014, Como, Italy, May 27-29, 2014.",
                "count": 88,
                "papers": [
                    "User-defined gestures for elastic, deformable displays.",
                    "AwToolkit: attention-aware user interface widgets.",
                    "Reflections on how designers design with data.",
                    "A natural interface for multi-focal plane head mounted displays using 3D gaze.",
                    "Touchless circular menus: toward an intuitive UI for touchless interactions with large displays.",
                    "Static Voronoi-based target expansion technique for distant pointing.",
                    "GlideCursor: pointing with an inertial cursor.",
                    "Back to tangibility: a post-WIMP perspective on control room design.",
                    "ArtVis: combining advanced visualisation and tangible interaction for the exploration, analysis and browsing of digital artwork collections.",
                    "PuppetX: a framework for gestural interactions with user constructed playthings.",
                    "T4 - transparent and translucent tangibles on tabletops.",
                    "Paper vs. tablets: the effect of document media in co-located collaborative work.",
                    "Sandboxed interaction for casual users in shared spaces.",
                    "EyeGaze: enabling eye contact over video.",
                    "Designing accessible ICT products and services: the VERITAS accessibility testing platform.",
                    "Motion-based touchless interaction for ASD children: a case study.",
                    "BeatBox: end-user interactive definition and training of recognizers for percussive vocalizations.",
                    "RouteLens: easy route following for map applications.",
                    "Pupil-canthi-ratio: a calibration-free method for tracking horizontal gaze direction.",
                    "Visualizing food ingredients for children by utilizing glyph-based characters.",
                    "Visual and tactile engagement: designing projected touch-surfaces for community use in a rural context.",
                    "New materials = new expressive powers: smart material interfaces and arts, an interactive experience made possible thanks to smart materials.",
                    "Analyzing intended use effects in target acquisition.",
                    "Quantification of interface visual complexity.",
                    "Readability of a background map layer under a semi-transparent foreground layer.",
                    "An evaluation of Dasher with a high-performance language model as a gaze communication method.",
                    "Multi-touch gestures for discrete and continuous control.",
                    "BezelCopy: an efficient cross-application copy-paste technique for touchscreen smartphones.",
                    "Tracing and sketching performance using blunt-tipped styli on direct-touch tablets.",
                    "Match-up & conquer: a two-step technique for recognizing unconstrained bimanual and multi-finger touch input.",
                    "SpaceFold and PhysicLenses: simultaneous multifocus navigation on touch surfaces.",
                    "Two-finger 3D rotations for novice users: surjective and integral interactions.",
                    "Inconvenient interactions: an alternative interaction design approach to enrich our daily activities.",
                    "Digitally augmented narratives for physical artifacts.",
                    "A multimodal tablet-based interface for designing and reviewing 3D engineering models.",
                    "Advanced visual analytics interfaces for adverse drug event detection.",
                    "Mimic: visual analytics of online micro-interactions.",
                    "CoDICE: balancing software engineering and creativity in the co-design of digital encounters with cultural heritage.",
                    "Visual composition of data sources by end users.",
                    "From desktop to touchless interfaces: a model based approach.",
                    "Designing and implementing an interactive scatterplot visualization for a tablet computer.",
                    "Qualizon graphs: space-efficient time-series visualization with qualitative abstractions.",
                    "Touching transport - a case study on visualizing metropolitan public transit on interactive tabletops.",
                    "Effect of lateral chromatic aberration for chart reading in information visualization on display devices.",
                    "A graph based abstraction of textual concordances and two renderings for their interactive visualisation.",
                    "A study on human-generated tag structures to inform tag cloud layout.",
                    "Visual SPARQL querying based on extended filter/flow graphs.",
                    "Engineering information management tools by example.",
                    "Novel interaction techniques for object manipulation on tabletops: scoop net and pinch helper.",
                    "Gesturemote: interacting with remote displays through touch gestures.",
                    "sense.me: a EUD environment for social products.",
                    "NUICursorTools: cursor behaviors for indirect-pointing.",
                    "Evaluating accuracy of perception in an adaptive stereo vision interface.",
                    "Design and evaluation of a platform to support co-design with children.",
                    "City sensing: visualising mobile and social data about a city scale event.",
                    "ECCE toolkit: prototyping UbiComp device ecologies.",
                    "Integrating human-robot and motion-based touchless interaction for children with intellectual disability.",
                    "Visualizing collaborative traces in distributed teams.",
                    "Collaborative multimedia content creation and sharing by older adults.",
                    "Designing emotion awareness interface for group recommender systems.",
                    "Augmented reality for TLC network operation and maintenance support.",
                    "A low cost tracking system for position-dependent 3D visual interaction.",
                    "Personalized interaction on large displays: the StreetSmart project approach.",
                    "Polarized review summarization as decision making tool.",
                    "TagStar: a glyph-based interface for indexing and visual analysis.",
                    "Visually integrating databases at conceptual level.",
                    "Exploratory computing: a challenge for visual interaction.",
                    "Guidelines for using color blending in data visualization.",
                    "Multi-level visualization of interrelated data entities.",
                    "Web3D representation and cultural heritage: from annotations to narrations.",
                    "Filter dials: combine filter criteria, see how much data is available.",
                    "ImgWordle: image and text visualization for events in microblogging services.",
                    "How collective intelligence emerges: knowledge creation process in Wikipedia from microscopic viewpoint.",
                    "Multidimensional sort of lists in mobile devices.",
                    "An end-user interface for behaviour change intervention development.",
                    "Static hand poses for gestural interaction: a study.",
                    "PODD: a portable diary data collection system.",
                    "Automatic street view system synchronized with TV program using geographical metadata from closed captions.",
                    "Semantize: visualizing the sentiment of individual document.",
                    "Culture of participation in the digital age: social computing for learning, working, and living.",
                    "Knowledge artifacts within knowing communities to foster collective knowledge.",
                    "Understanding citizen participation in crisis and disasters: the point of view of governmental agencies.",
                    "First International Workshop on User Interfaces for Crowdsourcing and Human Computation.",
                    "Toward effective tasks navigation in crowdsourcing.",
                    "User interface design for crowdsourcing systems.",
                    "Fostering smart energy applications through advanced visual interfaces.",
                    "Smart energy interfaces for electric vehicles.",
                    "Interactive visual tools for the planning and monitoring of power grids."
                ]
            },
            {
                "sub_name_abbr": "conf/avi/2014copda",
                "sub_name": "Proceedings of the Second International Workshop on Cultures of Participation in the Digital Age: Social computing for Working, Learning, and Living co-located with the 2014 International Working Conference on Advanced Visual Interfaces (AVI 2014), Como, Italy, May 27, 2014.",
                "count": 7,
                "papers": [
                    "Cultivating a Culture of Participation for the Co-Evolution of Users and Systems.",
                    "COProduction as Last Resort to Make IT Projects Less Doomed to Fail.",
                    "Cultures of Participation in Healthcare: A Healthy Idea?",
                    "Is a Culture of Participation Possible for Serious Games in the Health Domain?",
                    "ParkPal: Towards Ad-Hoc Route Planning for Runners.",
                    "Reflections Over a Socio-technical Infrastructuring Effort.",
                    "Should the Culture of Participation inform a new Ethics of Design?"
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "AVI 2012",
        "info": "Capri Island, Naples, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/avi/2012",
                "sub_name": "International Working Conference on Advanced Visual Interfaces, AVI 2012, Capri Island, Naples, Italy, May 22-25, 2012, Proceedings.",
                "count": 157,
                "papers": [
                    "Usable advanced visual interfaces in aviation.",
                    "Advanced interface productization: lessons learned.",
                    "Gesture-based interaction: a new dimension for mobile user interfaces.",
                    "Make it so: learning from sci-fi interfaces.",
                    "Push and pull of web user interfaces in multi-device environments.",
                    "UISKEI: a sketch-based prototyping tool for defining and evaluating user interface behavior.",
                    "Asynchronous active values for client-side interactive service coordination.",
                    "Foundations for the design of visualizations that support trust in distributed teams.",
                    "CADo: a supporting system for flower arrangement.",
                    "Designing visual interactive systems in the e-government domain.",
                    "Interface affordances and social practices in online communication systems.",
                    "Designing large high-resolution display workspaces.",
                    "Towards the establishment of a framework for intuitive multi-touch interaction design.",
                    "Termite: visualization techniques for assessing textual topic models.",
                    "Metaphor modelling for tangible interfaces evaluation.",
                    "Does (multi-)touch aid users' spatial memory and navigation in 'panning' and in 'zooming & panning' UIs?",
                    "How spatial layout, interactivity, and persistent visibility affect learning with large displays.",
                    "The cost of display switching: a comparison of mobile, large display and hybrid UI configurations.",
                    "CinemaGazer: a system for watching videos at very high speed.",
                    "Wiimote and Kinect: gestural user interfaces add a natural third dimension to HCI.",
                    "Looking behind bezels: french windows for wall displays.",
                    "Comparison of video-based pointing and selection techniques for hands-free text entry.",
                    "SNOUT: one-handed use of capacitive touch devices.",
                    "A gestural approach to presentation exploiting motion capture metaphors.",
                    "SpeeG: a multimodal speech- and gesture-based text input solution.",
                    "Image correction techniques for 3D interactive surface using a transparent elastic gels.",
                    "Squama: modular visibility control of walls and windows for programmable physical architectures.",
                    "Tap, swipe, or move: attentional demands for distracted smartphone input.",
                    "PalmSpace: continuous around-device gestures vs. multitouch for 3D rotation tasks on mobile devices.",
                    "Spatial data and mobile applications: general solutions for interface design.",
                    "Multimodal framework for mobile interaction.",
                    "User experience of photorealistic urban pedestrian navigation.",
                    "A line-based palm-top detector for mobile augmented reality.",
                    "Indoor navigation with mixed reality world-in-miniature views and sparse localization on mobile devices.",
                    "GravNav: using a gravity model for multi-scale navigation.",
                    "Strip'TIC: exploring augmented paper strips for air traffic controllers.",
                    "Fluid Views: a zoomable search environment.",
                    "Stackables: combining tangibles for faceted browsing.",
                    "Content-aware navigation for large displays in context of traffic control rooms.",
                    "An augmented interface to audio-video components.",
                    "ARMob - Augmented Reality for urban Mobility in RMob.",
                    "Face-to-avatar: augmented face-to-face communication with aerotop telepresence system.",
                    "Evaluating depth perception of volumetric data in semi-immersive VR.",
                    "SpeechToast: augmenting notifications with speech input focus.",
                    "Virtual training of surgery staff for hand washing procedure.",
                    "Towards building pervasive UIs for the intelligent classroom: the PUPIL approach.",
                    "Context-aware systems: the 'right' information, at the 'right' time, in the 'right' place, in the 'right' way, to the 'right' person.",
                    "Software-based adjustment of mobile autostereoscopic graphics using static parallax barriers.",
                    "SmartWig: wig-based wearable computing device for communication and entertainment.",
                    "Comparative social visualization for personalized e-learning.",
                    "Nondirective information presentation for on-site safety training in chemistry experiments.",
                    "Embodied cooperation using mobile devices: presenting and evaluating the Sync4All application.",
                    "WithYou - a communication system to provide out together feeling.",
                    "Creation and visualization of context aware augmented reality interfaces.",
                    "I feel lucky: an automated personal assistant for smartphones.",
                    "Magnetic augmented reality: virtual objects in your space.",
                    "Distributed interaction: a multi-device, multi-user music experience.",
                    "Animated transitions between user interface views.",
                    "Search intent estimation from user's eye movements for supporting information seeking.",
                    "Continuous edgewrite: dictionary-based disambiguation instead of explicit segmentation by the user.",
                    "AutoComPaste: auto-completing text as an alternative to copy-paste.",
                    "Using the power of associations: BrainDump - a revised nature inspired visual interface for sensemaking.",
                    "A visual interface for querying ontologically and socially annotated 3D worlds for the web.",
                    "Statistics from an HCI perspective: Illmo - interactive log likelihood modeling.",
                    "Information design in interactive applications for unfamiliar cultural domains.",
                    "SWift: a SignWriting improved fast transcriber.",
                    "LiveMask: a telepresence surrogate system with a face-shaped screen for supporting nonverbal communication.",
                    "Co-activity manager: integrating activity-based collaboration into the desktop interface.",
                    "Improving blog exploration through interactive visualization.",
                    "FatFonts: combining the symbolic and visual aspects of numbers.",
                    "Interactive exploration of music listening histories.",
                    "The product explorer: decision making with ease.",
                    "TimeSlice: interactive faceted browsing of timeline data.",
                    "Vertigo zoom: combining relational and temporal perspectives on dynamic networks.",
                    "Balloon selection revisited: multi-touch selection techniques for stereoscopic data.",
                    "Visualiz'em: \"show me more about him!\".",
                    "MetricAttitude: a visualization tool for the reverse engineering of object oriented software.",
                    "Proportions in categorical and geographic data: visualizing the results of political elections.",
                    "AppInsight: what have I been doing?",
                    "User-centered design of a visual data mapping tool.",
                    "Who have I been talking to?",
                    "Perspective+detail: a visualization technique for vertically curved displays.",
                    "Visualizing uncertainty in multi-resolution volumetric data using marching cubes.",
                    "GraphPrism: compact visualization of network structure.",
                    "Exploring the design space of interactive link curvature in network diagrams.",
                    "Hierarchically animated transitions in visualizations of tree structures.",
                    "Interactive graph matching and visual comparison of graphs and clustered graphs.",
                    "Interactive visualization of emerging topics in multiple social media streams.",
                    "Metabrain: web information extraction and visualization.",
                    "Investigative analysis across documents and drawings: visual analytics for archaeologists.",
                    "Profiler: integrated statistical analysis and visualization for data quality assessment.",
                    "The semantics of clustering: analysis of user-generated spatializations of text documents.",
                    "EgoNav: exploring networks through egocentric spatializations.",
                    "Evaluation of a multimodal video annotator for contemporary dance.",
                    "A field study of a multi-touch display at a conference.",
                    "Two user studies on creation and evaluation of use scenarios for mixed reality communication.",
                    "A model-based approach to ongoing product evaluation.",
                    "Usability issues for an aerospace digital library.",
                    "A guide to reporting scientific evaluation in visualization.",
                    "Supporting active reading on pen and touch-operated tabletops.",
                    "An empirical study on the impact of edge bundling on user comprehension of graphs.",
                    "An approach to tuning distributed virtual environment performance by modifying terrain.",
                    "Visualizing set-valued attributes in parallel with equal-height histograms.",
                    "Motivations for accessing social networking services on mobile devices.",
                    "Generating applications directly on the mobile device: an empirical evaluation.",
                    "Comparing cognitive effort in spatial learning of text entry keyboards and ShapeWriters.",
                    "Aesthetic visualisation of information: optimization of graph representations.",
                    "Automatic natural expression recognition using head movement and skin color features.",
                    "Study of information clouding methods to prevent spoilers of sports match.",
                    "Interaction atmosphere: blending design style.",
                    "Supporting user of information retrieval systems by visualizing the information dialog context.",
                    "JewelryStudio: system for capturing/browsing pictures of jewelry from multiple viewpoints.",
                    "Automatic properties adjusting method using user operations for local search smartphone applications.",
                    "ArchMatrix: a visual interactive system for graph-based knowledge exploration in archaeology.",
                    "Interactive curating of user tags for audiovisual archives.",
                    "Spalendar: visualizing a group's calendar events over a geographic space on a public display.",
                    "An interface for visual inspection based on image segmentation.",
                    "Envisioning grid vulnerabilities: multi-dimensional visualization for electrical grid planning.",
                    "Studies of vection field II: a method for generating smooth motion pattern.",
                    "Stacked trees: a new hybrid visualization method.",
                    "Semantic road networks for recommender systems.",
                    "User profiling vs. accuracy in recommender system user experience.",
                    "\"Don't touch the oven\": motion-based touchless interaction with household appliances.",
                    "Seamless mixed reality tracking in tabletop reservoir engineering interaction.",
                    "Representing and visualizing folksonomies as graphs: a reference model.",
                    "S-Notebook: augmenting mobile devices with interactive paper for data management.",
                    "BroAuth: evaluating different levels of visual feedback for 3D gesture-based authentication.",
                    "Redeeming pedigree data with an interactive error cleaning visualisation.",
                    "Designing mobile access to DSpace-based digital libraries.",
                    "Formal specification of usability measures in model-driven development of context-sensitive user interfaces.",
                    "Visual analysis of microblog content using time-varying co-occurrence highlighting in tag clouds.",
                    "ViDaX: an interactive semantic data visualisation and exploration tool.",
                    "Design guidelines for correlated quantitative data visualizations.",
                    "Bridging the gap: advances in interaction design for enterprise applications in production scenarios.",
                    "DepthTouch: an elastic surface for tangible computing.",
                    "Meal - a menu evaluation system with symbolic icons in mobile devices.",
                    "Supporting interaction and collaboration on large displays using tablet devices.",
                    "RMob - a mobile app for real time information in urban transportation.",
                    "Navigation in past museum exhibitions using multimedia archives.",
                    "Experimenting dele: a deaf-centered e-learning visual environment.",
                    "iPhone interface for wireless control of a robot.",
                    "Prototyping a gestural interface for selecting and buying goods in a public environment.",
                    "SocialStory: a social storyboard system for sharing experiences in emergencies.",
                    "A webGL talking head for mobile devices.",
                    "BrainDump: taking fluid interaction literally.",
                    "SHIRI: buttocks humanoid that represents emotions with visual and tactual transformation of the muscles.",
                    "An integrated ecosystem of interfaces for annotating, querying and browsing networks of Web3D worlds.",
                    "Interactive surface that have dynamic softness control.",
                    "Personal photo browser that can classify photos by participants and situations.",
                    "ISIDIS: an intelligent videosurveillance system.",
                    "Ambient educational mini-games.",
                    "Interactive exploration of events and presence of people in space and time through KD-photomap.",
                    "Challenges in end user development for services.",
                    "Supporting asynchronous collaboration in visual analytics systems.",
                    "First International Workshop on Visual Interfaces for Ground Truth Collection in Computer Vision Applications.",
                    "Workshop on Infrastructure and Design Challenges of Coupled Display Visual Interfaces: in conjunction with Advanced Visual Interfaces 2012 (AVI'12).",
                    "Designing collaborative interactive spaces."
                ]
            },
            {
                "sub_name_abbr": "conf/vigta/2012",
                "sub_name": "Proceedings of the 1st International Workshop on Visual Interfaces for Ground Truth Collection in Computer Vision Applications, VIGTA@AVI 2012, Capri, Italy, May 21, 2012.",
                "count": 13,
                "papers": [
                    "Multiscale annotation of still images with GAT.",
                    "Efficient annotation of image data sets for computer vision applications.",
                    "A multi-view annotation tool for people detection evaluation.",
                    "A multi-tool for ground-truth stereo correspondence, object outlining and points-of-interest selection.",
                    "An annotation tool for dermoscopic image segmentation.",
                    "A semi-automatic tool for detection and tracking ground truth generation in videos.",
                    "Efficient annotation of traffic video data.",
                    "Manual labeling strategy for ground truth estimation in MRI glial tumor segmentation.",
                    "Robust interactive segmentation via coloring.",
                    "CoVidA: pen-based collaborative video annotation.",
                    "Synthetic ground truth dataset to detect shadows cast by static objects in outdoors.",
                    "Combinatorial enlargement of ground-truth datasets and efficient evaluation of segmentation algorithms.",
                    "An interactive tool for extremely dense landmarking of faces."
                ]
            }
        ]
    },
    {
        "year": "2010",
        "name": "AVI 2010",
        "info": "Roma, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/avi/2010",
                "sub_name": "Proceedings of the International Conference on Advanced Visual Interfaces, AVI 2010, Roma, Italy, May 26-28, 2010.",
                "count": 98,
                "papers": [
                    "Advanced visual analytics interfaces.",
                    "Aesthetics and trust: visual decisions about web pages.",
                    "Architecting next-generation user interfaces.",
                    "A new weaving technique for handling overlapping regions.",
                    "Wakame: sense making of multi-dimensional spatial-temporal data.",
                    "Finding business information by visualizing enterprise document activity.",
                    "Visual quality metrics and human perception: an initial study on 2D projections of large multidimensional data.",
                    "iChase: supporting exploration and awareness of editing activities on Wikipedia.",
                    "A visual tool for using design patterns as pattern languages.",
                    "Gameplay on a multitouch screen to foster learning about historical sites.",
                    "Exploring the design space of multiscale 3D orientation.",
                    "Task-driven service discovery and selection.",
                    "Towards an environment for designing and evaluating multimedia art guides.",
                    "3-D interaction with a large wall display using transparent markers.",
                    "Designing a cross-channel information management tool for workers in enterprise task forces.",
                    "CompUTE: a runtime infrastructure for device composition.",
                    "Design TeamMate: a platform to support design activities of small teams.",
                    "Complete fashion coordinator: a support system for capturing and selecting daily clothes with social networks.",
                    "User requirements for a web based spreadsheet-mediated collaboration.",
                    "Lift-and-drop: crossing boundaries in a multi-display environment by Airlift.",
                    "Knotty gestures: subtle traces to support interactive use of paper.",
                    "Supporting menu design with radial layouts.",
                    "Structured laser pointer: enabling wrist-rolling movements as a new interactive dimension.",
                    "The effect of stereoscopy and motion cues on 3D interpretation task performance.",
                    "Wavelet menus on handheld devices: stacking metaphor for novice mode and eyes-free selection for expert mode.",
                    "Text entry for mobile devices using ad-hoc abbreviation.",
                    "Bimanual handheld mixed reality interfaces for urban planning.",
                    "An heuristic set for evaluation in information visualization.",
                    "GPS and road map navigation: the case for a spatial framework for semantic information.",
                    "Implied dynamics in information visualization.",
                    "MIAOW: a 3D image browser applying a location- and time-based hierarchical data visualization technique.",
                    "An automatic generation of schematic maps to display flight routes for air traffic controllers: structure and color optimization.",
                    "Tracing genealogical data with TimeNets.",
                    "Video abstraction and detection of anomalies by tracking movements.",
                    "Setting the bar for set-valued attributes.",
                    "Multi-con: exploring graphs by fast switching among multiple contexts.",
                    "Pac-pac: pinching gesture recognition for tabletop entertainment system.",
                    "Social robots and ECAs for accessing smart environments services.",
                    "Comic Engine: interactive system for creating and browsing comic books with attention cuing.",
                    "Jelly: a multi-device design environment for managing consistency across devices.",
                    "A reflex in eye-hand coordination for calibrating coordinates of a tabletop display.",
                    "Visual, in-place data flow modeling.",
                    "A design pattern language for accessible web sites.",
                    "An architecture and a visual interface for tagging the 3D web.",
                    "MetroNG: multimodal interactive scheduling interface.",
                    "Adjustable context adaptations for user interfaces at runtime.",
                    "Power and energy visualization for the micro-management of household electricity consumption.",
                    "An infrastructure for creating graphical indicators of the learner profile by mashing up different sources.",
                    "Synchronous cooperation and visualization for social bookmarking systems.",
                    "Creating a virtual archery experience.",
                    "A multi-layered aesthetical web-portal interface for governmental integration issues.",
                    "3D attentional maps: aggregated gaze visualizations in three-dimensional virtual environments.",
                    "Enhanced navigation and focus on TileBars with barycenter heuristic-based reordering.",
                    "Doughnut crumbs: visual navigation for data hierarchies.",
                    "Gestures as a \"creation\" mechanism for tabletop interfaces.",
                    "Deep Diffs: visually exploring the history of a document.",
                    "\"Wheels of web\" visual user interface.",
                    "Improving the performance and usability for visual menu interface on mobile computers.",
                    "EVEREVIS: event recognizer in video scenes.",
                    "Showtime: increasing viewer understanding of dynamic network visualisations.",
                    "Virtual-ICSI: a visual-haptic interface for virtual training in intra cytoplasmic sperm injection.",
                    "BrainyHand: a wearable computing device without HMD and it's interaction techniques.",
                    "Interacting annotations in MADCOW 2.0.",
                    "Don't touch me: multi-user annotations on a map in large display environments.",
                    "Visual analysis of financial crimes: [system paper].",
                    "Experience with interactive multimedia art guides.",
                    "EnforManga: interactive comic creation with deformation.",
                    "Advanced brain computer interface for communication and control.",
                    "End-user development of software services and applications.",
                    "Visual workflow composition through semantic orchestration of web services.",
                    "Seeing the self in the washing machine: the deep affordance of 2.0 philosophy in the household appliance domain.",
                    "About composing our own smart home.",
                    "Metadesigning e-government services: a case study in a local agency.",
                    "Future development environments for computational scientists.",
                    "A community based metaphor supporting EUD within communities.",
                    "Wizard-based process modeling for business users.",
                    "User task-based development of multi-device service-oriented applications.",
                    "A comparison of three service composition approaches for end users.",
                    "Workshop on coupled display visual interfaces.",
                    "Experiences with mouse control in multi-display environments.",
                    "Primitive interaction tasks for multi-display environments (PrIME): a hands-on approach.",
                    "Investigating distributed user interfaces across interactive large displays and mobile devices.",
                    "Partial web interface migration.",
                    "Fridge fridge on the wall: what can I cook for us all?: an HMI study for an intelligent fridge.",
                    "WallShare: a multi-pointer system for portable devices.",
                    "Labeling large displays for interaction with mobile devices: recognition of symbols for pairing techniques.",
                    "Delegating the visual interface between a tablet and a TV.",
                    "Exploring gesture-based interaction techniques in multi-display environments with mobile phones and a multi-touch table.",
                    "Digital hospitality: expressing hospitality towards guests in smart homes using private and domestic displays.",
                    "Interactive data exploration and knowledge discovery.",
                    "Exploring concepts collaboratively: considering how Wii interact.",
                    "Generation of roadside panoramic images without obstacles.",
                    "Human-information interaction in epistemic activities.",
                    "Role of externalization and composite interactions in the exploration of complex visualization spaces: a usability study.",
                    "Evaluating the utilization of clustering methods connected with multivariate visualizations.",
                    "Virtual environment for the navigation of ideas and concepts in education (V.E.N.I.C.E).",
                    "Seeing more than the graph: evaluation of multivariate graph visualization methods.",
                    "An interactive exploration environment for complex process design."
                ]
            }
        ]
    },
    {
        "year": "2008",
        "name": "AVI 2008",
        "info": "Napoli, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/avi/2008",
                "sub_name": "Proceedings of the working conference on Advanced Visual Interfaces, AVI 2008, Napoli, Italy, May 28-30, 2008.",
                "count": 89,
                "papers": [
                    "Ambient mobility: human environment interface and interaction challenges.",
                    "Computational photography and video: interacting and creating with videos and images.",
                    "Principles of entertainment in inhabited television.",
                    "Flower menus: a new type of marking menu with large menu breadth, within groups and efficient expert mode memorization.",
                    "Efficient web browsing on small screens.",
                    "Bridging the gap between real printouts and digital whiteboard.",
                    "Exploring blog archives with interactive visualization.",
                    "Using subjective and physiological measures to evaluate audience-participating movie experience.",
                    "Content aware video presentation on high-resolution displays.",
                    "SparTag.us: a low cost tagging system for foraging of web content.",
                    "Timeline trees: visualizing sequences of transactions in information hierarchies.",
                    "Visualizing antenna design spaces.",
                    "The in-context slider: a fluid interface component for visualization and adjustment of values while authoring.",
                    "Exploring the feasibility of video mail for illiterate users.",
                    "The inspection of very large images by eye-gaze control.",
                    "Evaluation of pointing performance on screen edges.",
                    "Starburst: a target expansion algorithm for non-uniform target distributions.",
                    "Physical handles at the interactive surface: exploring tangibility and its benefits.",
                    "TapTap and MagStick: improving one-handed target acquisition on small touch-screens.",
                    "Combining and measuring the benefits of bimanual pen and direct-touch interaction on horizontal interfaces.",
                    "Semiotic engineering in practice: redesigning the CoScripter interface.",
                    "Affective geographies: toward a richer cartographic semantics for the geospatial web.",
                    "Recognition and processing of hand-drawn diagrams using syntactic and semantic analysis.",
                    "Exploring video streams using slit-tear visualizations.",
                    "Exploring the role of individual differences in information visualization.",
                    "An empirical evaluation of interactive visualizations for preferential choice.",
                    "Model-based layout generation.",
                    "A mixed-fidelity prototyping tool for mobile devices.",
                    "Gummy for multi-platform user interface designs: shape me, multiply me, fix me, use me.",
                    "KMVQL: a visual query interface based on Karnaugh map.",
                    "Query-through-drilldown: data-oriented extensional queries.",
                    "Automatically adapting web sites for mobile access through logical descriptions and dynamic analysis of interaction resources.",
                    "A physics-based approach for interactive manipulation of graph visualizations.",
                    "Agent warp engine: formula based shape warping for networked applications.",
                    "Image geo-mashups: the example of an augmented reality weather camera.",
                    "How coherent environments support remote gestures.",
                    "SLMeeting: supporting collaborative work in Second Life.",
                    "Balancing physical and digital properties in mixed objects.",
                    "A flexible, declarative presentation framework for domain-specific modeling.",
                    "Advanced visual systems supporting unwitting EUD.",
                    "VCode and VData: illustrating a new framework for supporting the video annotation workflow.",
                    "An investigation of dynamic landmarking functions.",
                    "Eulr: a novel resource tagging facility integrated with Flickr.",
                    "Ambiguity detection in multimodal systems.",
                    "Fostering conversation after the museum visit: a WOZ study for a shared interface.",
                    "Exploring emotions and multimodality in digitally augmented puppeteering.",
                    "Face bubble: photo browsing by faces.",
                    "Browsing a website with topographic hints.",
                    "Visual tag authoring: picture extraction via localized, collaborative tagging.",
                    "Time2Hide: spatial searches and clutter alleviation for the desktop.",
                    "Users' quest for an optimized representation of a multi-device space.",
                    "Multiview user interfaces with an automultiscopic display.",
                    "Adapting a single-user, single-display molecular visualization application for use in a multi-user, multi-display environment.",
                    "As time goes by: integrated visualization and analysis of dynamic networks.",
                    "Revealing uncertainty for information visualization.",
                    "Perceptual usability: predicting changes in visual interfaces & designs due to visual acuity differences.",
                    "Illustrative halos in information visualization.",
                    "Shadow tracking on multi-touch tables.",
                    "LocaweRoute: an advanced route history visualization for mobile devices.",
                    "The effect of animated transitions in zooming interfaces.",
                    "Visual design of service deployment in complex physical environments.",
                    "Visualizing program similarity in the Ac plagiarism detection system.",
                    "Visual representation of web design patterns for end-users.",
                    "Memoria mobile: sharing pictures of a point of interest.",
                    "An eye tracking approach to image search activities using RSVP display techniques.",
                    "Advanced interfaces for music enjoyment.",
                    "Funky wall: presenting mood boards using gesture, speech and visuals.",
                    "Toward a natural interface to virtual medical imaging environments.",
                    "Music selection using the PartyVote democratic jukebox.",
                    "A haptic rendering engine of web pages for blind users.",
                    "Realizing the hidden: interactive visualization and analysis of large volumes of structured data.",
                    "A wearable Malossi alphabet interface for deafblind people.",
                    "SyncDecor: communication appliances for virtual cohabitation.",
                    "Toward haptic mathematics: why and how.",
                    "The need for an interaction cost model in adaptive interfaces.",
                    "Theia: open environment for multispectral image analysis.",
                    "The multi-touch SoundScape renderer.",
                    "Interactive visual interfaces for evacuation planning.",
                    "Supporting visual exploration of massive movement data.",
                    "Scenique: a multimodal image retrieval interface.",
                    "Multimodal user interfaces for smart environments: the multi-access service platform.",
                    "Interactive shape specification for pattern search in time series.",
                    "A system for dynamic 3D visualisation of speech recognition paths.",
                    "Perspective change: a system for switching between on-screen views by closing one eye.",
                    "Improving citizens' interactions in an e-deliberation environment.",
                    "\"Isn't this archaeological site exciting!\": a mobile system enhancing school trips.",
                    "MedioVis: visual information seeking in digital libraries.",
                    "End-user visualizations.",
                    "Agrafo: a visual interface for grouping and browsing digital photos."
                ]
            }
        ]
    },
    {
        "year": "2006",
        "name": "AVI 2006",
        "info": "Venezia, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/avi/2006",
                "sub_name": "Proceedings of the working conference on Advanced visual interfaces, AVI 2006, Venezia, Italy, May 23-26, 2006.",
                "count": 90,
                "papers": [
                    "AVI and the art system: interactive works at the Venice Biennale.",
                    "Distributed intelligence: extending the power of the unaided, individual human mind.",
                    "From mainframes to picture frames: charting the rapid evolution of visual interfaces.",
                    "Bubble radar: efficient pen-based interaction.",
                    "Evaluating the effects of fluid interface components on tabletop collaboration.",
                    "Improving interfaces for managing applications in multiple-device environments.",
                    "Mixed reality: a model of mixed interaction.",
                    "Programming rich interactions using the hierarchical state machine toolkit.",
                    "Splitting rules for graceful degradation of user interfaces.",
                    "A taxonomy of ambient information systems: four patterns of design.",
                    "An approach to remote direct pointing using gray-code.",
                    "Catenaccio: interactive information retrieval system through drawing.",
                    "Flow selection: a time-based selection and operation technique for sketching tools.",
                    "iLayer: MLD in an operating system interface.",
                    "Improving scalability and awareness in iconic interfaces for multiple-device environments.",
                    "Laser pointer interaction techniques using peripheral areas of screens.",
                    "On the visualization of large-sized ontologies.",
                    "Table-centric interactive spaces for real-time collaboration.",
                    "Video editing based on object movement and camera motion.",
                    "Fluid DTMouse: better mouse support for touch-based interactions.",
                    "Appropriating and assessing heuristics for mobile computing.",
                    "Mobility agents: guiding and tracking public transportation users.",
                    "Supporting end-user debugging: what do users want to know?",
                    "Supporting interaction and co-evolution of users and systems.",
                    "Annotation as a support to user interaction for content enhancement in digital libraries.",
                    "iFlip: a metaphor for in-vehicle information systems.",
                    "Interacting with piles of artifacts on digital tables.",
                    "Stylus based text input using expanding CIRRIN.",
                    "Syntax analysis for diagram editors: a constraint satisfaction problem.",
                    "VLMigrator: a tool for migrating legacy video lectures to multimedia learning objects.",
                    "Design and evaluation of a shoulder-surfing resistant graphical password scheme.",
                    "Evaluating the semantic memory of web interactions in the xMem project.",
                    "An evaluation of depth perception on volumetric displays.",
                    "Exploring the design space for adaptive graphical user interfaces.",
                    "Exploring visual feedback of change conflict in a distributed 3D environment.",
                    "An integrated task-based framework for the design and evaluation of visualizations to support preferential choice.",
                    "Investigating user tolerance for errors in vision-enabled gesture-based interactions.",
                    "Usability of overview-supported zooming on small screens with regard to individual differences in spatial ability.",
                    "Allowing camera tilts for document navigation in the standard GUI: a discussion and an experiment.",
                    "Can spatial mnemonics accelerate the learning of text input chords?",
                    "Globalisation vs. localisation in e-commerce: cultural-aware interaction design.",
                    "Hypothesis oriented cluster analysis in data mining by visualization.",
                    "Implicit brushing and target snapping: data exploration and sense-making on large displays.",
                    "Navigation by zooming in boxes: preliminary evaluation.",
                    "The plot, the clutter, the sampling and its lens: occlusion measures for automatic clutter reduction.",
                    "Preserving the mental map in interactive graph interfaces.",
                    "Understanding the whethers, hows, and whys of divisible interfaces.",
                    "A tool to support usability inspection.",
                    "CHAMBRE: integrating multimedia and virtual tools.",
                    "CHEF: a user centered perspective for Cultural Heritage Enterprise Frameworks.",
                    "History Unwired: mobile narrative in historic cities.",
                    "A semantic approach to build personalized interfaces in the cultural heritage domain.",
                    "Visual comparison and exploration of natural history collections.",
                    "MADCOW: a visual interface for annotating web pages.",
                    "DentroTrento: a virtual walk across history.",
                    "Playing music: an installation based on Xenakis' musical games.",
                    "Authoring interfaces with combined use of graphics and voice for both stationary and mobile devices.",
                    "Enabling interaction with single user applications through speech and gestures on a multi-user tabletop.",
                    "MAge-AniM: a system for visual modeling of embodied agent animations and their replay on mobile devices.",
                    "The prospects for unrestricted speech input for TV content search.",
                    "The ASPICE project: inclusive design for the motor disabled.",
                    "Improving access of elderly people to real environments: a semantic based approach.",
                    "Oral messages improve visual search.",
                    "Ubiquitous graphics: combining hand-held and wall-size displays to interact with large images.",
                    "A comparison of static and moving presentation modes for image collections.",
                    "Contrasting portraits of email practices: visual approaches to reflection and analysis.",
                    "Improving list revisitation with ListMaps.",
                    "Line graph explorer: scalable display of line graphs using Focus+Context.",
                    "Querying spatio-temporal databases using a visual environment.",
                    "Task-at-hand interface for change detection in stock market data.",
                    "Tumble! Splat! helping users access and manipulate occluded content in 2D drawings.",
                    "Animated visualization of time-varying 2D flows using error diffusion.",
                    "Browsing large collections of images through unconventional visualization techniques.",
                    "Browsing through 3D representations of unstructured picture collections: an empirical study.",
                    "Euclidean representation of 3D electronic institutions: automatic generation.",
                    "Exploring augmented reality visualizations.",
                    "Navigation in degree of interest trees.",
                    "Putting pictures in context.",
                    "TAPRAV: a tool for exploring workload aligned to models of task execution.",
                    "View projection animation for occlusion reduction.",
                    "Visual editing of animated algorithms: the Leonardo Web builder.",
                    "Visualization of hand gestures for pervasive computing environments.",
                    "Visualization of patient data at different temporal granularities on mobile devices.",
                    "Visualizing a temporally-enhanced ontology.",
                    "A wearable interface for visualizing coauthor networks toward building a sustainable research community.",
                    "Coordinating views in the InfoVis toolkit.",
                    "Mavigator: a flexible graphical user interface to data sources.",
                    "NAVRNA: visualization - exploration - editing of RNA.",
                    "System for enhanced exploration and querying.",
                    "A visual tool to support technical analysis of stock market data."
                ]
            },
            {
                "sub_name_abbr": "conf/avi/2006beliv",
                "sub_name": "Proceedings of the 2006 AVI Workshop on BEyond time and errors: novel evaluation methods for information visualization, BELIV 2006, Venice, Italy, May 23, 2006.",
                "count": 15,
                "papers": [
                    "Evaluating information visualisations.",
                    "An explorative analysis of user evaluation studies in information visualisation.",
                    "Methods for the evaluation of an interactive InfoVis tool supporting exploratory reasoning processes.",
                    "Evaluating information visualization applications with focus groups: the CourseVis experience.",
                    "Evaluating visual table data understanding.",
                    "Visual quality metrics.",
                    "Metrics for analyzing rich session histories.",
                    "Strategies for evaluating information visualization tools: multi-dimensional in-depth long-term case studies.",
                    "Systematic inspection of information visualization systems.",
                    "Heuristics for information visualization evaluation.",
                    "Just how dense are dense graphs in the real world?: a methodological note.",
                    "Task taxonomy for graph visualization.",
                    "Shakespeare's complete works as a benchmark for evaluating multiscale document navigation techniques.",
                    "Threat stream data generator: creating the known unknowns for test and evaluation of visual analytics tools.",
                    "A taxonomy of tasks for guiding the evaluation of multidimensional visualizations."
                ]
            },
            {
                "sub_name_abbr": "conf/avi/2006cai",
                "sub_name": "Proceedings of the 2006 AVI Workshop on Context in advanced interfaces, CAI 2006, Venice, Italy, May 23, 2006.",
                "count": 11,
                "papers": [
                    "Collaborating in context: immersive visualisation environments.",
                    "In context of business.",
                    "Input interactions and context component based modelisations: differences and similarities.",
                    "Intelligent context-sensitive interactions on desktop and the web.",
                    "LCARS: the next generation programming context.",
                    "Learning and managing user context in personalized communications services.",
                    "Model of primary and secondary context.",
                    "Modelling \"user understanding\" in simple communication tasks.",
                    "Privacy-aware user interfaces within collaborative environments.",
                    "Sticky, smelly, smoky context: experience design in the kitchen.",
                    "Towards a general purpose user interface for service-oriented context-aware applications."
                ]
            }
        ]
    },
    {
        "year": "2004",
        "name": "AVI 2004",
        "info": "Gallipoli (Lecce), Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/avi/2004",
                "sub_name": "Proceedings of the working conference on Advanced visual interfaces, AVI 2004, Gallipoli, Italy, May 25-28, 2004.",
                "count": 79,
                "papers": [
                    "Designing interaction, not interfaces.",
                    "Stitching: pen gestures that span multiple displays.",
                    "Display space usage and window management operation comparisons between single monitor and multiple monitor users.",
                    "A visual tool for tracing users' behavior in Virtual Environments.",
                    "More than the sum of its members: challenges for group recommender systems.",
                    "MADCOW: a multimedia digital annotation system.",
                    "Integrating expanding annotations with a 3D explosion probe.",
                    "Using games to investigate movement for graph comprehension.",
                    "Usability of E-learning tools.",
                    "Scalable Fabric: flexible task management.",
                    "Scaffolding visually cluttered web pages to facilitate accessibility.",
                    "Scene-Driver: reusing broadcast animation content for engaging, narratively coherent games.",
                    "On electronic annotation and its implementation.",
                    "Visualization of music performance as an aid to listener's comprehension.",
                    "The challenge of information visualization evaluation.",
                    "View size and pointing difficulty in multi-scale navigation.",
                    "Usability studies on a visualisation for parallel display and control of alternative scenarios.",
                    "Fishnet, a fisheye web browser with search term popouts: a comparative evaluation with overview and linear view.",
                    "Image presentation in space and time: errors, preferences and eye-gaze activity.",
                    "ValueCharts: analyzing linear models expressing preferences and evaluations.",
                    "Exploring and examining assessment data via a matrix visualisation.",
                    "A graph-based interface to complex hypermedia structure visualization.",
                    "Focus dependent multi-level graph clustering.",
                    "KNAVE II: the definition and implementation of an intelligent tool for visualization and exploration of time-oriented clinical data.",
                    "Temporal Thumbnails: rapid visualization of time-based viewing data.",
                    "CircleView: a new approach for visualizing time-related multidimensional data sets.",
                    "Interactive data summarization: an example application.",
                    "Exploratory visualization using bracketing.",
                    "SWAPit: a multiple views paradigm for exploring associations of texts and structured data.",
                    "Quantum web fields and molecular meanderings: visualising web visitations.",
                    "Ambient intelligence: visualizing the future.",
                    "Multi-projectors and implicit interaction in persuasive public displays.",
                    "Task-sensitive user interfaces: grounding information provision within the context of the user's activity.",
                    "Aligning information browsing and exploration methods with a spatial navigation aid for mobile city visitors.",
                    "ZoneZoom: map navigation for smartphones with recursive view segmentation.",
                    "DeepDocument: use of a multi-layered display to provide context awareness in text editing.",
                    "Interacting with embodied agents in public environments.",
                    "The Input Configurator toolkit: towards high input adaptability in interactive applications.",
                    "Robust object-identification from inaccurate recognition-based inputs.",
                    "Modelling internet based applications for designing multi-device adaptive interfaces.",
                    "Augmented multi-user communication system.",
                    "Tangible interfaces in virtual environments for industrial design.",
                    "3D location-pointing as a navigation aid in Virtual Environments.",
                    "Observing and adapting user behavior in navigational 3D interfaces.",
                    "Towards the next generation of 3D content creation.",
                    "Designing affordances for the navigation of detail-on-demand hypervideo.",
                    "Interactive interfaces of Treecube for browsing 3D multimedia data.",
                    "3Book: a 3D electronic smart book.",
                    "Identification and validation of cognitive design principles for automated generation of assembly instructions.",
                    "How users interact with biodiversity information using TaxonTree.",
                    "Smooth Morphing of Handwritten Text.",
                    "Dealing with geographic continuous fields: the way to a visual GIS environment.",
                    "Painting pictures to augment advice.",
                    "Shrinking window operations for expanding display space.",
                    "Sim-U-Sketch: a sketch-based interface for SimuLink.",
                    "Example-based programming: a pertinent visual approach for learning to program.",
                    "An intelligent and adaptive virtual environment and its application in distance learning.",
                    "A visual adaptive interface to file systems.",
                    "Visualizing programs with Jeliot 3.",
                    "Sorting out sorting through concretization with robotics.",
                    "Combining visual techniques for Association Rules exploration.",
                    "MVT: a system for visual testing of software.",
                    "Task oriented visual interface for debugging timing problems in hardware design.",
                    "A domain model-driven approach for producing user interfaces to multi-platform information systems.",
                    "Xface: MPEG-4 based open source toolkit for 3D Facial Animation.",
                    "Generative Programming of graphical user interfaces.",
                    "A visual interface for a multimodal interactivity annotation tool: design issues and implementation solutions.",
                    "A collaborative annotation system for data visualization.",
                    "Interactive visual tools to explore spatio-temporal variation.",
                    "DOITrees revisited: scalable, space-constrained visualization of hierarchical data.",
                    "Tuning a CBIR system for vector images: the interface support.",
                    "Sketch-based retrieval of ClipArt drawings.",
                    "MediaBrowser: reclaiming the shoebox.",
                    "X-Presenter: a tool for video-based hypermedia applications.",
                    "Perceiving awareness information through 3D representations.",
                    "Two methods for enhancing mutual awareness in a group recommender system.",
                    "Extensible interfaces for mobile devices in an advanced platform for infomobility services.",
                    "A mobile system for non-linear access to time-based data.",
                    "First prototype of conversational H.C. Andersen."
                ]
            }
        ]
    },
    {
        "year": "2002",
        "name": "AVI 2002",
        "info": "Trento, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/avi/2002",
                "sub_name": "Proceedings of the Working Conference on Advanced Visual Interfaces, AVI 2002, Trento, Italy, May 22-24, 2002.",
                "count": 54,
                "papers": [
                    "User-interface design, culture, and the future.",
                    "Reflections on symmetry.",
                    "Supporting the end users' views.",
                    "Artistically conveying peripheral information with the InfoCanvas.",
                    "A framework for designing fisheye views to support multiple semantic contexts.",
                    "Zooming, multiple windows, and visual working memory.",
                    "What's happening?: promoting community awareness through opportunistic, peripheral interfaces.",
                    "A user-tracing architecture for modeling interaction with the world wide web.",
                    "A visual interface to a music database.",
                    "Managing layout constraints in a platform for customized multimedia content packaging.",
                    "What did they do? understanding clickstreams with the WebQuilt visualization system.",
                    "Op-Glyph: a tool for exploring op art representation of height and vector field data.",
                    "Matrix: concept animation and algorithm simulation system.",
                    "Direct manipulation of pictorial items within web sites: a drag & drop approach to on-line interaction.",
                    "An environment for user interface softbots.",
                    "A web-based annotation tool supporting e-learning.",
                    "Interactive visual tools for spatial multicriteria decision making.",
                    "Multimodal interface within a simulator of service robotic applications.",
                    "OZONE: a zoomable interface for navigating ontology information.",
                    "Extending the metaphor GIS query language and environment to 3D domains.",
                    "A method for the perceptual optimization of complex visualizations.",
                    "Drawing graphs with non-uniform vertices.",
                    "by chance enhancing interaction with large data sets through statistical sampling.",
                    "Supporting co-evolution of users and systems by the recognition of interaction patterns.",
                    "Group-based interface for content-based image retrieval.",
                    "Real-time human motion analysis for human-machine interface.",
                    "Which interaction technique works when?: floating palettes, marking menus and toolglasses support different task strategies.",
                    "Patterns of eye gaze during rapid serial visual presentation.",
                    "Two-handed drawing on augmented desk system.",
                    "Using 3D to visualise medical data.",
                    "Virtual locomotion system for human-scale virtual environments.",
                    "Degree-of-interest trees: a component of an attention-reactive user interface.",
                    "A visual data mining environment: metaqueries and association rules.",
                    "SQLi: towards an interface description language for relational databases.",
                    "Visualization techniques for circular tabletop interfaces.",
                    "Scope: providing awareness of multiple notifications at a glance.",
                    "Mixing icons, geometric shapes and temporal axis to propose a visual tool for querying spatio-temporal databases.",
                    "Navigating Giga-Graphs.",
                    "Knowledge-supported graphical illustration of texts.",
                    "New directions for the design of virtual reality interfaces to e-commerce sites.",
                    "VIP: a visual approach to user authentication.",
                    "The HuGS platform: a toolkit for interactive optimization.",
                    "Biological storytelling: a software tool for biological information organization based upon narrative structure.",
                    "Elucidate: employing information visualisation to aid pedagogy for students.",
                    "Modeling biological reactivity: statecharts vs. Boolean logic.",
                    "Assessment of cost/benefit of interfaces evaluation techniques.",
                    "Making agents gaze naturally - does it work?",
                    "A visual query language for large spatial databases.",
                    "Working together - a VR based approach for cooperative digital design review.",
                    "A visual interface for multi-person exploration of personal databases.",
                    "An integrated approach to database visualization.",
                    "Visual interaction design for tools to think with: interactive systems for designing linear information.",
                    "On evaluating information visualization techniques.",
                    "Expressiveness of the data flow and data state models in visualization systems."
                ]
            }
        ]
    },
    {
        "year": "2000",
        "name": "AVI 2000",
        "info": "Palermo, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/avi/2000",
                "sub_name": "Proceedings of the working conference on Advanced visual interfaces, AVI 2000, Palermo, Italy, May 23-26, 2000.",
                "count": 52,
                "papers": [
                    "From Hierarchies to Polyarchies - Visualizing Multiple Relationships.",
                    "The Virtual Human as a Multimodal Interface.",
                    "Instructions and Descriptions: some cognitive aspects of programming and similar activities.",
                    "An Algorithm for Blob Hierarchy Layout.",
                    "A Comparision of Set-Based and Graph-Based Visualisations of Overlapping Classification Hierarchies.",
                    "Architectures to make Simple Visualisations using Simple Systems.",
                    "Diagrams Based on Structural Object Perception.",
                    "An Architecture for Pen-based Interaction on Electronic Whiteboards.",
                    "Device Independant Text Input: A Rationale and an Example.",
                    "Automatic animation of discussions in USENET.",
                    "Smart Graphics in Adaptive Way Descriptions.",
                    "An Intuitive VR User Interface For Design Review.",
                    "Reification, Polymorphism and Reuse: Three Principles for Designing Visual Interfaces.",
                    "Guidelines for Using Multiple Views in Information Visualization.",
                    "Using Information in Task Models to Support Design of Interactive Safety-Critical Applications.",
                    "Snap-Together Visualization: A User Interface for Coodinating Visualizations via Relational Schemata.",
                    "User Interface Patterns for Hypermedia Application.",
                    "Validating the SUE Inspection Technique.",
                    "Teallach's Presentation Model.",
                    "Generating User Interface Code in a Model Based User Interface Development Environment.",
                    "The Effect of Information Scent on Searching - Information Visualization of Large Tree Structures.",
                    "Multidimensional Information Visualization through Sliding Rods.",
                    "A Web-Based Approach to Interactive Visualization in Context.",
                    "Rapid Serial Visual Presentation: A space-timed trade-off in information presentation.",
                    "Automated Generation of Agent Behaviour from Formal Models of Interaction.",
                    "Adaptive User Interface for Process Control based on Multi Agent Approach.",
                    "An Architecture for Automatic Gesture Analysis.",
                    "A Visual Tool for Querying Geographic Databases.",
                    "Supporting Visual Exploration of Object Movement.",
                    "Interactive Visualisation of a Travel Itinerary.",
                    "Context and Interaction in Zooable User Interfaces.",
                    "Hierarchical Flip Zooming: Enabling Parallel Exploration of Hierarchical Visualization.",
                    "Dynamic Label Sampling on Fisheye Maps for Information Exploration.",
                    "CBM: A Visual Query Interface Model based on Annotated Cartoon Diagrams.",
                    "Conversation Space: Visualising Multi-threaded Conversation.",
                    "Getting the Mobile Users in: Three Systems that Support Collaboration in an Environment with Heterogeneous Communication Devices.",
                    "KVispatch: A Visual Language that Rewrites Kinematic Objects in Animation.",
                    "Graphical Information Models as Interfaces for Web Document Repository.",
                    "Towards Mutual Comprehension through Interaction.",
                    "Button Selection for General GUIs Using Eye and Hand Together.",
                    "Using Dialog and Context in a Speech-Based interface for an Information Visualization Environment.",
                    "User Interfaces for Digital Television: a Navigator Case Study.",
                    "Mail-By-Example: a visual Query Interface for Email Management.",
                    "A Fast Multi-Scale Method for Drawing Large Graphs.",
                    "A Meta Heuristic for Graph Drawing.",
                    "Relevance on Graph-Drawing Algorithms to Graph-Based Interfaces.",
                    "On Better Understanding UML Diagrams through Three-Dimensional Visualization and Animation.",
                    "Formalising Interactive Behaviour in 3D-Spatio-temporal Worlds.",
                    "A Modular Approach for Exploring the Semantic Structure of Technical Document Collections.",
                    "Specifying Interface Properties in Object Oriented Conceptual Models.",
                    "Augmenting Virtual Prototyping with Physical Objects.",
                    "VISPS, a Visual System for Plan Specification."
                ]
            }
        ]
    },
    {
        "year": "1998",
        "name": "AVI 1998",
        "info": "L'Aquila, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/avi/1998",
                "sub_name": "Proceedings of the working conference on Advanced visual interfaces 1998, L'Aquila, Italy, May 24 - 27, 1998.",
                "count": 37,
                "papers": [
                    "Augmented reality: linking real and virtual worlds: a new paradigm for interacting with computers.",
                    "Remote evaluation for post-deployment usability improvement.",
                    "Selected ingredients in end-user programming.",
                    "Panel natural, cultural & cybercultural interfaces: points of view.",
                    "Design method of interaction techniques for large information spaces.",
                    "Automatic graphical abstraction in intent-based 3D-illustrations.",
                    "Constant information density in zoomable interfaces.",
                    "Intelligent visualization and dynamic manipulation: two complementary instruments to support data exploration with GIS.",
                    "Rapid-fire image previews for information navigation.",
                    "Information foraging models of browsers for very large document spaces.",
                    "Re-engineering a distributed IR system through a disciplined, task-centered approach based on evaluation and metrics.",
                    "Linking surface error characteristics to root problems in user-based evaluation studies.",
                    "Engineering the usability of visual formalisms: a case study in real time logics.",
                    "Starting simple: adding value to static visualisation through simple interaction.",
                    "Model-based heuristic evaluation of hypermedia usability.",
                    "Visual representation of hypermedia links according to their types.",
                    "Multimodal communication between synthetic agents.",
                    "Visual display, pointing, and natural language: the power of multimodal interaction.",
                    "The craft of movement in interaction design.",
                    "Dynamic key frame presentation techniques for augmenting video browsing.",
                    "Comparing MMVIS to a timeline for temporal trend analysis of video data.",
                    "Design of multimedia semantic presentation templates: options, problems and criteria of use.",
                    "A system for supporting and managing same-time/different-place group interactions.",
                    "Manipulating concept maps with constrained regions.",
                    "Figure captions in visual interfaces.",
                    "Kaleidoquery: a visual query language for object databases.",
                    "VisTool: a visual tool for querying relational databases.",
                    "A completely visual environment for agent-based computing.",
                    "Towards a distributed 3D virtual museum.",
                    "A distributed web-based virtual reality interface to database systems.",
                    "\"Thin\" vs. \"fat\" visualization clients.",
                    "Designing GUIs by sketch drawing and visual programming.",
                    "Visual interfaces for high level hardware synthesis.",
                    "Interfacing with C.H.A.A.T. (Cultural Heritage Assisted Analysis Tools).",
                    "A user-centered WWW application for macroseismic data dissemination and rapid re-use.",
                    "An epistemological display query interface.",
                    "SIAMOA: a system for visual programming, program visualisation and debugging."
                ]
            }
        ]
    },
    {
        "year": "1996",
        "name": "AVI 1996",
        "info": "Gubbio, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/avi/1996",
                "sub_name": "Proceedings of the workshop on Advanced visual interfaces 1996, Gubbio, Italy, May 27-29, 1996.",
                "count": 37,
                "papers": [
                    "Information visualization and information foraging.",
                    "Visualizing the World Wide Web.",
                    "Closing the loop: modelling action, perception and information.",
                    "Elastic windows: improved spatial layout and rapid multiple window operations.",
                    "Multimedia user interfaces.",
                    "Zoom navigation exploring large information and application spaces.",
                    "VINETA: navigation through virtual information spaces.",
                    "Modal navigation for hypermedia applications.",
                    "Table lens as a tool for making sense of data.",
                    "A framework for user-interfaces to databases.",
                    "A semantics-based approach to designing presentations for multimedia database query results.",
                    "Visualization of large answers in text databases.",
                    "Flexible, dynamic user interfaces for Web-delivered training.",
                    "Looking for convenient alternatives to forms for querying remote databases on the Web: a new iconic interface for progressive queries.",
                    "Interacting with a visual editor.",
                    "Distributed architectures for pen-based input and diagram recognition.",
                    "Dynamic interpretations in translucent patches: representation-based applications.",
                    "Expanding the utility of spreadsheets through the integration of visual programming and user interface objects.",
                    "A visual interface for synchronous collaboration and negotiated transactions.",
                    "Exploring virtual ecosystems.",
                    "Cocktailmaps: a space-filling visualization method for complex communicating systems.",
                    "User-oriented visual layout at multiple granularities.",
                    "A seamless integration of algorithm animation into a visual programming language.",
                    "Algorithm animation over the World Wide Web.",
                    "Image query by semantical color content.",
                    "Assisted browsing in a diagnostic image database.",
                    "A pictorial query language for geographical databases.",
                    "The PPP persona: a multipurpose animated presentation agent.",
                    "The Mocha algorithm animation system.",
                    "Model-oriented visual interface design.",
                    "Automatic construction of user interfaces for pen-based computers.",
                    "VICKI: the VIsualisation Construction KIt.",
                    "Hyperlog: a system for database querying and browsing.",
                    "Virgilio: a VR-based system for database visualization.",
                    "Interactive and visual environment supporting conceptual modeling of complex OODB applications.",
                    "Simulation of face-to-face interaction.",
                    "HyperPro: an intelligent hypermedia system for learning logic programming."
                ]
            }
        ]
    },
    {
        "year": "1994",
        "name": "AVI 1994",
        "info": "Bari, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/avi/1994",
                "sub_name": "Proceedings of the Workshop on Advanced Visual Interfaces, AVI 1994, Bari, Italy, June 1-4, 1994.",
                "count": 36,
                "papers": [
                    "Data Structures for Dynamic Queries: An Analytical and Experimental Evaluation.",
                    "Managing Metaphors for Advanced User Interfaces.",
                    "Randomized Graph Drawing with Heavy-Duty Preprocessing.",
                    "Integrating Computer Technology, People Technology and Application Technology: Strategies and Case Studies from Georgia Tech's Graphics, Visualization and Usability Center.",
                    "Automatic Generation of Textual, Audio, and Animated Help in UIDE: The User Interface Design.",
                    "BETTY: Planning and Generating Animations for the Visualization of Movements and Spatial Relations.",
                    "AWI: A Workbench for Semi-Automated Illustration Design.",
                    "Automatic Chunk Detection in Human-Computer Interaction.",
                    "Towards a Dynamic Strategy for Computer-Aided Visual Placement.",
                    "Recognizing and Interpreting Diagrams in Design.",
                    "Visual Techniques for Traditional and Multimedia Layouts.",
                    "Style-Based Cut-and-Paste in Graphical Editors.",
                    "Gql, a Declarative Graphical Query Language Based on the Functional Data Model.",
                    "Database schema Evolution Using EVER Diagrams.",
                    "Designing and Integrating User Interfaces of Geographic Database Applications.",
                    "Unifying Views of Interactors.",
                    "Using Visual Programming to Extend the Power of Spreadsheet.",
                    "Towards Efficient Parsing of Diagrammatic Languages.",
                    "Interactive Training of Virtual Agents.",
                    "Programming as Problem Solving: A Participatory Theater Approach.",
                    "Adaptive Interaction with Knowledge-Based Systems.",
                    "The Interface of the Future.",
                    "European Research in Visual Interfaces: Experiences and Perspectives (Panel).",
                    "A Visual Environment for Multimedia Object Retrieval.",
                    "CSCW as a Basis for Interactive Design Semantics.",
                    "Clarifying the Structure of Complex Venn Diagrams.",
                    "Semantics of Visual Languages.",
                    "Sychronizing Video and Event Logs for Usability Studies.",
                    "Dynamic WAIS Book: An Electronic Book to Publish and Consult Information Distributed Across a Wide-Area Network.",
                    "Bags and Viewers: A Metaphor for Structuring a Database Browser.",
                    "Automatic Layout Based on Formal Semantics.",
                    "Towards a User Environment Integrating Hypermedia Browsers, Scientific Visualization Programs and Numerical Simulation Programs.",
                    "On the Development of User Interface Systems for Object-Oriented Database.",
                    "QBI: An Iconic Query System for Inexpert Users.",
                    "VIPERS: A Data Flow Visual Programming Environment Based on the Tcl Language.",
                    "An Information Manipulation Environment for Monitoring Parallel Programs."
                ]
            }
        ]
    },
    {
        "year": "1992",
        "name": "AVI 1992",
        "info": "Rome, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/avi/1992",
                "sub_name": "Advanced Visual Interfaces - Proceedings of the International Workshop, AVI 1992, Rome, Italy, May 27-29, 1992.",
                "count": 31,
                "papers": [
                    "Virtual Worlds for Visualizing Information.",
                    "A 3D Visual Environment for Querying Image Databases.",
                    "Functional Decomposition of Facial Expressions for an Animation System.",
                    "Management of Color Usage in Dynamic Mapping Environments: Balancing Semantics, Visual Ordering and Discernability.",
                    "Graphics, Hyperqueries, and Natural Language: An Integrated Approach to User-Computer Interfaces.",
                    "Encoding Information through Spatial Relations.",
                    "What can Users Tell us about User Interface?",
                    "An Approach to Integrate Multimedi Data in a Knowledge Representation System.",
                    "Plan-Based Graphical Help in Object-Oriented User Interfaces.",
                    "Knowledge Based Control of Visual Dialogues in Information Systems.",
                    "Database Visual Environments Based on Advanced Data Models.",
                    "The Information Visualizer: A 3D User Interface for Information Retrieval.",
                    "An Application of Three-Dimensional Visualization to Object-Oriented Programming.",
                    "Incorporating Graphics Design and Realization into the Multimodal Presentation System WIP.",
                    "Simulation of Communications Protocols throght Graphical Transformation Rules.",
                    "Programming Aspects of Views, an Open-Architecture Application Environment.",
                    "Automatic Design of Multimodal Resentations.",
                    "User Modeling for Adaptive Presentation of Information.",
                    "Visual Interface Design based on User's Models.",
                    "A Visual Optimization Specification Language.",
                    "Graphs and Visual Languages for Visual Interfaces.",
                    "Parsing 2D Languages by a Pictorial GLR Parser.",
                    "Generalizing Event Detection and Response in Visual Programming Languages.",
                    "Visual Message Flow Language MFL and its Interaface.",
                    "Constraint-Based Graphical Layout of Multimodal Presentations.",
                    "Minimum Size h-v Drawings.",
                    "Algorithmic and Complexity Results for Drawing Euclidian Trees.",
                    "The KIWIS System: Navigation and Querying.",
                    "Gestural Interfaces for Diagram Editors.",
                    "Diagram Server.",
                    "LOTECH: An Interactive Problem Solver for Location."
                ]
            }
        ]
    }
]