[
    {
        "name": "BIT",
        "year": "2021",
        "info": "Volume 40: 2021",
        "count": 110,
        "papers": [
            "Digital nudging and privacy: improving decisions about self-disclosure in social networks.",
            "Committing to change: a persuasive systems design analysis of user commitments for a behaviour change support system.",
            "Letters to medical devices: a case study on the medical device user requirements of adolescents with type 1 diabetes.",
            "A systematic meta-Review and analysis of learning analytics research.",
            "Motivated to lose? Evaluating challenge and player motivations in games.",
            "Duration of daily smartphone usage as an antecedent of nomophobia: exploring multiple mediation of loneliness and anxiety.",
            "Consumers' purchase intention and decision-making process through social networking sites: a social commerce construct.",
            "Leveraging ECG signals and social media for stress detection.",
            "HospiAvontuur: development of a serious game to help young children and their parents during the preparation for an admission at the hospital for elective surgery.",
            "Understanding the motivators affecting doctors' contributions in online healthcare communities: professional status as a moderator.",
            "Effects of learner interaction with learning dashboards on academic performance in an e-learning environment.",
            "'Age Matters': A panel study investigating the influence of communicative and passive smartphone use on well-being.",
            "Classifying computer-mediated communication (CMC) interruptions at work using control as a key delineator.",
            "Does meaningful work reduce cyberloafing? Important roles of affective commitment and leader-member exchange.",
            "How does participation and browsing affect continuance intention in virtual communities? An integration of curiosity theory and subjective well-being.",
            "Talking to a pedagogical agent in a smart TV: modality matching effect in human-TV interaction.",
            "The effects of reading on pixel vs. paper: a comparative study.",
            "The effect of precisely defined associative distance and stimulus acquisition mode in individual creativity support systems.",
            "The expression of the true self in the online world: a literature review.",
            "Using smartwatches for fitness and health monitoring: the UTAUT2 combined with threat appraisal as moderators.",
            "Antecedents of social media activism: an analytical study of a controversial topic.",
            "Altruistic and selfish communication on social media: the moderating effects of tie strength and interpersonal trust.",
            "Carer's perception on social assistive technology acceptance and adoption: moderating effects of perceived risks.",
            "Evaluating graphical manipulations in automatically laid out LineSets.",
            "Family wearables - what makes them persuasive?",
            "An evaluation of three designs to engage users when providing their consent on smartphones.",
            "The relationship among the social norms of college students, and their interpersonal relationships, smartphone use, and smartphone addiction.",
            "The mediating role of social presence in the relationship between shadow IT usage and individual performance: a social presence theory perspective.",
            "BIT Special Issue ECCE2021 Editorial.",
            "Human beings and robots: are there any differences in the attribution of punishments for the same crimes?",
            "Experience spaces for critical co-reflection on artefact use.",
            "User research and design creativity: three insights for future studies.",
            "Analyzing individuals' grip force over short intervals in a joystick-controlled task with and without a stress manipulation.",
            "Understanding youths' needs for digital societal participation: towards an inclusive Virtual Council.",
            "Enabling inner creativity to surface: the design of an inclusive handweaving loom to promote self-reliance, autonomy and wellbeing.",
            "Software developers need help too! Developing a methodology to analyse cognitive dimension-based feedback on usability.",
            "Explanatory and predictive model of the adoption of P2P payment systems.",
            "Understanding influential factors behind lurking behaviour in online cancer communities.",
            "Foreseeing the endgame: who are the students who take the final exam at the beginning of a MOOC?",
            "A serious game to improve engagement with web accessibility guidelines.",
            "Mining Facebook data for Quality of Life assessment.",
            "How does a team's virtuality impact knowledge transfer effectiveness among its members?: A multi-mediator-moderator model.",
            "Smartphone proficiency and use, loneliness, and ego integrity: an examination of older adult smartphone users in South Korea.",
            "Information acquisition, emotion experience and behaviour intention during online shopping: an eye-tracking study.",
            "MapRecorder: analysing real-world usage of mobile map applications.",
            "Exploring an adverse impact of smartphone overuse on academic performance via health issues: a stimulus-organism-response perspective.",
            "Predicting webpage aesthetics with heatmap entropy.",
            "The impact of exercise motives on adolescents' sustained use of wearable technology.",
            "Personality traits, psychological well-being, Facebook addiction, health and performance: testing their relationships.",
            "The similarity-attraction paradigm in persuasive technology: effects of system and user personality on evaluations and persuasiveness of an interactive system.",
            "Workplace digitalisation and work-nonwork satisfaction: the role of spillover social media.",
            "The Influence of privacy control options on the evaluation and user acceptance of mobile applications for volunteers in crisis situations.",
            "Investigating problematic social media and game use in a nationally representative sample of adolescents and younger adults.",
            "Student agency analytics: learning analytics as a tool for analysing student agency in higher education.",
            "Analysis of the correlation between spatial cognitive abilities and wayfinding decisions in 3D digital environments.",
            "Understanding the relationship between the Proteus effect, immersion, and gender among World of Warcraft players: An empirical survey study.",
            "Using gamification elements for competitive crowdsourcing: exploring the underlying mechanism.",
            "Employee use of public social media: theories, constructs and conceptual frameworks.",
            "Using biometric data in software engineering: a systematic mapping study.",
            "Understanding negotiated anti-malware interruption effects on user decision quality in endpoint security.",
            "Winning heads and hearts? How websites encourage prosocial behaviour.",
            "Statement of Retraction.",
            "Statement of Retraction.",
            "Statement of Retraction.",
            "Retraction.",
            "Statement of Retraction.",
            "Statement of Retraction.",
            "Statement of Retraction.",
            "Statement of Retraction.",
            "Statement of Retraction.",
            "Statement of Retraction.",
            "Statement of Retraction.",
            "End-user development for smart environments (EUD4SE).",
            "End-user development of smart home rules using block-based programming: a comparative usability evaluation with programmers and non-programmers.",
            "Low-cost physical computing platforms for end-user prototyping of smart home systems.",
            "Visual design of dialogue flows for conversational interfaces.",
            "Recommendations for creating trigger-action rules in a block-based environment.",
            "Guidelines for braindraw conduction: looking at braindraw under the lens of abduction and semiotics.",
            "Smartphone-based social networking sites and intention to quit: self-regulatory perspective.",
            "Automatic voice emotion recognition of child-parent conversations in natural settings.",
            "Asymmetrical third-person effects on the perceptions of online risk and harm among adolescents and adults.",
            "Designing accessible MOOCs to expand educational opportunities for persons with cognitive impairments.",
            "Investigating the elicitation of employees' support towards digital workplace transformation.",
            "Influence of mobile devices' scalability on individual perceived learning.",
            "Comparing attitudes towards adoption of e-government between urban users and rural users: an empirical study in Chongqing municipality, China.",
            "Prevalence of computer-gaming in the general population of adolescents: results from a Czech population-based survey.",
            "Trust me, if you can: a study on the factors that influence consumers' purchase intention triggered by chatbots based on brain image evidence and self-reported assessments.",
            "Evaluating an information system to provide creative guidance about health-and-safety in manufacturing.",
            "Feeling excited and fluent: how consumers respond to the visual appeals of products in an online shopping environment.",
            "XR in the era of COVID-19.",
            "The sense of being there during online classes: analysis of usability and presence in web-conferencing systems and virtual reality social platforms.",
            "Comparison of the usability and flow experience of an exercise promotion virtual reality programme for different age groups.",
            "The effects of pretraining intervention in immersive embodied virtual reality cardiopulmonary resuscitation training.",
            "An on-site and remote study during the COVID-19 pandemic on virtual hand appearance and tactile feedback.",
            "GaitWear: a smartwatch application for in-the-wild gait normalisation based on a virtual field study assessing the effects of visual and haptic cueing.",
            "A systematic review of immersive virtual reality for industrial skills training.",
            "Social comparison and continuance intention of smart fitness wearables: an extended expectation confirmation theory perspective.",
            "Design guide and usability questionnaire to develop and assess VIRTRAEL, a web-based cognitive training tool for the elderly.",
            "From Internet access to problematic use: multigroup analysis of push and pull factors.",
            "In favour of or against multi-lingual Q&A sites? Exploring the evidence from user and knowledge perspectives.",
            "Exploring students' digital informal learning: the roles of digital competence and DTPB factors.",
            "Assessing presence in virtual environments: adaptation of the psychometric properties of the Presence Questionnaire to the Portuguese populations.",
            "ArmMenu: command input on distant displays with proprioception based lateral arm movements.",
            "Do online reviews truly matter? A study of the characteristics of consumers involved in different online review scenarios.",
            "How millennials' life concerns shape social media behaviour.",
            "Factors influencing viewing behaviour on search engine results pages: a review of eye-tracking research.",
            "How rude is rude: an exploratory study among Australian Millennials, Generation 'X' and Baby Boomers mobile phone users.",
            "A prideful posting a day keeps admiring readers awake: voluntary bloggers in a self-construal framework.",
            "How do conversational case-based reasoning systems interact with their users: a literature review.",
            "Eye-tracking study of the celebrity effect on microblogging browsing: an example from Sina microblog."
        ]
    },
    {
        "name": "BIT",
        "year": "2020",
        "info": "Volume 39: 2020",
        "count": 80,
        "papers": [
            "Design trade-offs in cultures of participation: empowering end users to improve their quality of life.",
            "Trading off between control and autonomy: a narrative review around de-design.",
            "Exploring design trade-offs for achieving social inclusion in multi-tiered design problems.",
            "Analysing trade-offs in frameworks for the design of smart environments.",
            "Design trade-offs in self-management technology: the HeartMan case.",
            "From TurnTalk to ClassTalk: the emergence of tangibles for class conversations in primary school classrooms.",
            "Communicability of traditional interfaces VS chatbots in healthcare and smart home domains.",
            "Internet of Things and social platforms: an empirical analysis from Indian consumer behavioural perspective.",
            "Constructing a hybrid hierarchical value map to understand young people's perceptions of social networking sites.",
            "Computer-supported reflective learning: how apps can foster reflection at work.",
            "Safe use of hospital information systems: an evaluation model based on a sociotechnical perspective.",
            "The predictors of users' satisfaction in an anonymous environment: the role of the negative true self.",
            "The application of netnography to the online dating service experiences of female users.",
            "Social media in conflicts and crises.",
            "'Breaking' news: uncovering sense-breaking patterns in social media crisis communication during the 2017 Manchester bombing.",
            "Use of Twitter in the Cameroon Anglophone crisis.",
            "Descriptive and visual summaries of disaster events using artificial intelligence techniques: case studies of Hurricanes Harvey, Irma, and Maria.",
            "Mitigating information overload in social media during conflicts and crises: design and evaluation of a cross-platform alerting system.",
            "Repertoires of collaboration: incorporation of social media help requests into the common operating picture.",
            "A conceptual framework for developing solutions that organise social media information for emergency response teams.",
            "Individual characteristics influencing the sharing of knowledge on social networking services: online identity, self-efficacy, and knowledge sharing intentions.",
            "Story-telling maps generated from semantic representations of events.",
            "The impact of in-depth online recommendation agents on consumer disorientation and cognitive absorption perceptions.",
            "Effects of feedback type and modality on motor skill learning and retention.",
            "On the search behaviour of users in the context of interactive social book search.",
            "From behaviour to design: implications for artifact ecologies as shared spaces for design activities.",
            "Online and physical appropriation: evidence from a vignette experiment on copyright infringement.",
            "The influence of visual complexity on initial user impressions: testing the persuasive model of web design.",
            "Responsive bystander behaviour in cyberbullying: a path through self-efficacy.",
            "Understanding users' continuous content contribution behaviours on microblogs: an integrated perspective of uses and gratification theory and social influence theory.",
            "Human uncertainty in explicit user feedback and its impact on the comparative evaluations of accurate prediction and personalisation.",
            "Is smartphone addiction different from Internet addiction? comparison of addiction-risk factors among adolescents.",
            "Proteus vs. social identity effects on virtual brainstorming.",
            "Smart Cities at Play: Technology and Emerging forms of playfulness.",
            "Factors that determine residents' acceptance of smart city technologies.",
            "The role of a location-based city exploration game in digital placemaking.",
            "Seeing new in the familiar: intensifying aesthetic engagement with the city through new location-based technologies.",
            "Play in the smart city context: exploring interactional, bodily, social and spatial aspects of situated media interfaces.",
            "Smart data at play: improving accessibility in the urban transport system.",
            "Serious gaming as a means of facilitating truly smart cities: a narrative review.",
            "Mapping Twitter hate speech towards social and sexual minorities: a lexicon-based approach to semantic content analysis.",
            "Technology-assisted reconstruction: a new alternative to the experience sampling method.",
            "The effect of communication and social motives on E-government services through social media groups.",
            "Culture and social media: the relationship between cultural values and hashtagging styles.",
            "A study on the role of trust factor in adopting personalised medicine.",
            "Towards insight-driven sampling for big data visualisation.",
            "Learning analytics techniques and visualisation with textual data for determining causes of academic failure.",
            "Does techno-stress justify cyberslacking? An empirical study based on the neutralisation theory.",
            "Older adults' use of mobile device: usability challenges while navigating various interfaces.",
            "Factors influencing the information security behaviour of IT employees.",
            "Motivation factors and barriers to the continuous use of blended learning approach using Moodle: students' perceptions and individual differences.",
            "Understanding the performance impact of the epidemic prevention cloud: an integrative model of the task-technology fit and status quo bias.",
            "Making friends in online games: gender differences and designing for greater social connectedness.",
            "Cortical processing of human and emoji faces: an ERP analysis.",
            "Specific smartphone uses and how they relate to anxiety and depression in university students: a cross-cultural perspective.",
            "Relating video game exposure, sensation seeking, aggression and socioeconomic factors to school performance.",
            "Gamification inducing creative ideation: a parallel mediation model.",
            "Digital inclusion of people with disabilities: a qualitative study of intra-disability diversity in the digital realm.",
            "Exploring influencing factors of technology use for active and healthy ageing support in older adults.",
            "Evaluating an automated mediator for joint narratives in a conflict situation.",
            "Merging social computing with content: a proposal of a new film platform, Avids.",
            "Reality-based interaction affecting mental workload in virtual reality mental arithmetic training.",
            "Mitigating the harmful effects of technostress: inducing chaos theory in an experimental setting.",
            "User-friendly search interface for older adults: supporting search goal refreshing in working memory to improve information search strategies.",
            "All my online-friends are better than me - three studies about ability-based comparative social media use, self-esteem, and depressive tendencies.",
            "Online dispute resolution in mediating EHR disputes: a case study on the impact of emotional intelligence.",
            "Identifying organisational learning needs: an approach to the semi-automatic creation of course structures for software companies.",
            "Deterrent effects of punishment and training on insider security threats: a field experiment on phishing attacks.",
            "Understanding the formation mechanism of mobile social networking site addiction: evidence from WeChat users.",
            "Gamifying a BCSS: rehearsal and reflection in reinforcing a health message response.",
            "Phishing: message appraisal and the exploration of fear and self-confidence.",
            "Comparative evaluation of augmented reality-based assistance for procedural tasks: a simulated control room study.",
            "Segmentation and recognition of continuous gesture based on chaotic theory.",
            "Discovering MOOC learner motivation and its moderating role.",
            "How nostalgic feelings impact Pokémon Go players - integrating childhood brand nostalgia into the technology acceptance theory.",
            "Losing information is like losing an arm: employee reactions to data loss.",
            "How drivers respond to visual vs. auditory information in advisory traffic information systems.",
            "User misrepresentation in online social networks: how competition and altruism impact online disclosure behaviours.",
            "Propensity for technological adoption: an analysis of effects size in the banking sector.",
            "Generating actionable predictions regarding MOOC learners' engagement in peer reviews."
        ]
    },
    {
        "name": "BIT",
        "year": "2019",
        "info": "Volume 38: 2019",
        "count": 96,
        "papers": [
            "Impact of digital content on young children's reading interest and concentration for books.",
            "An experimental study on the role of augmented reality content type in an outdoor site exploration.",
            "Building presence in an online shopping website: the role of website quality.",
            "Understanding continuance usage of mobile shopping applications in India: the role of espoused cultural values and perceived risk.",
            "The final year project supervision in online distance learning: assessing students and faculty perceptions about communication tools.",
            "Interactive data visualisation for accounting information: a three-fit perspective.",
            "'The bot predicted rain, grab an umbrella': few perceived differences in communication quality of a weather Twitterbot versus professional and amateur meteorologists.",
            "Identifying commonalities and differences in personality characteristics of Internet and social media addiction profiles: traits, self-esteem, and self-construal.",
            "Factors affecting reposting behaviour using a mobile phone-based user-generated-content online community application among Chinese young adults.",
            "RAMES - Framework supporting user centred evaluation in research and practice.",
            "Helping older pedestrians navigate in the city: comparisons of visual, auditory and haptic guidance instructions in a virtual environment.",
            "Cultural differences in social comparison on Facebook.",
            "How persuasive is phishing email? The role of authentic design, influence and current events in email judgements.",
            "Sense-making strategies in explorative intelligence analysis of network evolutions.",
            "Correction.",
            "How perceptions of incivility and social endorsement in online comments (Dis) encourage engagements.",
            "Making Mii: studying the effects of methodological approaches and gaming contexts on avatar customization.",
            "Design fictions for behaviour change: exploring the long-term impacts of technology through the creation of fictional future prototypes.",
            "Habit formation in social media consumption: a case of political engagement.",
            "Determinants of emoticon usage in mobile instant messaging: a construal level theory perspective.",
            "Dynamic model of online information quality perceptions and impacts: a literature review.",
            "Deconstructing persuasiveness of strategies in behaviour change systems using the ARCS model of motivation.",
            "Examining the relationship between the Big Five, Grit and avoidance of automated communication scales in adults 40-65.",
            "The impact of psychological climate on employees' innovative use of information systems: The moderating role of goal orientation.",
            "Pictures tell a story: antecedents of rich-media curation in social network sites.",
            "A comparison of three think-aloud protocols used to evaluate a voice intelligent agent that expresses emotions.",
            "Antecedents of continued use and extended use of enterprise systems.",
            "Bracelet: arms-down selection for Kinect mid-air gesture.",
            "Advanced machine learning approaches to personalise learning: learning analytics and decision making.",
            "Would you feel happier if you have more protection behaviour? A panel survey of university students in Japan.",
            "Keeping secure to the end: a long-term perspective to understand employees' consequence-delayed information security violation.",
            "Understanding commitment and apathy in is security extra-role behavior from a person-organization fit perspective.",
            "Assessing the performance of short multi-item questionnaires in aesthetic evaluation of websites.",
            "On the road - listening to data subjects' personal mobility data privacy concerns.",
            "Trust trumps concern: findings from a seven-country study on consumer consent to 'digital native' vs. 'digital immigrant' service providers.",
            "Shaking the usability tree: why usability is not a dead end, and a constructive way forward.",
            "Understanding adolescent students' use of Facebook and their subjective wellbeing: a gender-based comparison.",
            "How compulsive use of social media affects performance: insights from the UK by purpose of use.",
            "Fairy tale directed game-based training system for children with ADHD using BCI and motion sensing technologies.",
            "The relation between use intensity of private and professional SNS, social comparison, self-esteem, and depressive tendencies in the light of self-regulation.",
            "Perspectives on the evolution of online communities.",
            "The roles of media capabilities of smartphone-based SNS in developing social capital.",
            "Effects of social-interactive engagement on the dropout ratio in online learning: insights from MOOC.",
            "Smartphones or laptops in the collaborative classroom? A study of video-based learning in higher education.",
            "Effects of macroergonomic compatibility of information and communication technologies on the performance of manufacturing systems.",
            "Identification of usability problems and requirements of elderly Chinese users for smart TV interactions.",
            "Web users with autism: eye tracking evidence for differences.",
            "Keeping the user in the cloud: a cognitive social capital antecedent to use continuance and trust-commitment in personal cloud storage services.",
            "User-defined gesture interaction for immersive VR shopping applications.",
            "Revealing the relationship between rational fatalism and the online privacy paradox.",
            "The effects of helping, self-expression, and enjoyment on social capital in social media: the moderating effect of avoidance attachment in the tourism context.",
            "Analysing observer preferences when presenting a product in a rendered scene: 2D vs. autostereoscopic 3D displays.",
            "Emotions in Wikipedia: the role of intended negative events in the expression of sadness and anger in online peer production.",
            "Understanding adolescents' unfriending on Facebook by applying an extended theory of planned behaviour.",
            "Understanding forced adoption of self-service technology: the impacts of users' psychological reactance.",
            "Smartphone addiction and associated consequences: role of loneliness and self-regulation.",
            "The influence of organisational facilitating conditions and technology acceptance factors on the effectiveness of virtual communities of practice.",
            "Identification and characterisation of Facebook user profiles considering interaction aspects.",
            "Rethinking key issues for understanding the new challenges of disruption and digital transformation in companies and economies.",
            "The influence of ICT-driven innovation: a comparative study on national innovation efficiency between developed and emerging countries.",
            "Analysis of tweets about football: 2013 and 2018 leagues in Turkey.",
            "Opera-oriented character relations extraction for role interaction and behaviour Understanding: a deep learning approach.",
            "Examination of the effects of computer-based mathematics instruction methods in children with mathematical learning difficulties: a meta-analysis.",
            "The 'who' and the 'what' in international migration research: data-driven analysis of Scopus-indexed scientific literature.",
            "Big data and IoT solution for patient behaviour monitoring.",
            "Applying big data and stream processing to the real estate domain.",
            "An adaptive doctor-recommender system.",
            "Integrating TTF and IDT to evaluate user intention of big data analytics in mobile cloud healthcare system.",
            "Sentiment mining in a collaborative learning environment: capitalising on big data.",
            "Editorial.",
            "Design, development and evaluation of a human-computer trust scale.",
            "Exploring temporal behaviour of app users completing ecological momentary assessments using mental health scales and mood logs.",
            "Musical sonification supports visual discrimination of color intensity.",
            "Cognitive ergonomics for data analysis. Experimental study of cognitive limitations in a data-based judgement task.",
            "Compliant activity rather than difficulty accelerates thought probe responsiveness and inhibits deliberate mind wandering.",
            "Effects on cognition of the burn after reading principle in ephemeral media applications.",
            "On the perceptions and acceptance of artificially intelligent robotics and the psychology of the future elderly.",
            "Behavioural threshold analysis: methodological and practical considerations for applications in information security.",
            "Creating collaborative groups in a MOOC: a homogeneous engagement grouping approach.",
            "Exploring e-mentoring: co-designing & un-platforming.",
            "The effects of design, size, and uniqueness of smartwatches: perspectives from current versus potential users.",
            "Identifying behavioural changes for health monitoring applications using the advanced metering infrastructure.",
            "A systematic mapping study of gamification models oriented to motivational characteristics.",
            "Clicking for change: the role of empathy and negative affect on engagement with a charitable social media campaign.",
            "Recognise misinformation and verify before sharing: a reasoned action and information literacy perspective.",
            "Cyberloafing and personality traits: an investigation among knowledge-workers across the Iranian knowledge-intensive sectors.",
            "What happens when decision support systems fail? - the importance of usability on performance in erroneous systems.",
            "Investigating factors affecting learner's perception toward online learning: evidence from ClassStart application in Thailand.",
            "System- vs. consumer-generated recommendations: affective and social-psychological effects on purchase intention.",
            "Does opportunity make the thief? Abilities and moral disengagement in illegal downloading.",
            "The impact of time pressure on cybersecurity behaviour: a systematic literature review.",
            "Handling of online information by users: evidence from TED talks.",
            "Factors affecting smart community service adoption intention: affective community commitment and motivation theory.",
            "A double-edged sword? Exploring the impact of students' academic usage of mobile devices on technostress and academic performance.",
            "Exploring the variability of media multitasking choice behaviour using a network approach.",
            "Exposure to a pleasant odour may increase the sense of reality, but not the sense of presence or realism."
        ]
    },
    {
        "name": "BIT",
        "year": "2018",
        "info": "Volume 37: 2018",
        "count": 85,
        "papers": [
            "Exploring the influence of a human-like dancing virtual character on the evocation of human emotion.",
            "Saving face on Facebook: privacy concerns, social benefits, and impression management.",
            "Outdoor ubiquitous learning or indoor CAL? Achievement and different cognitive loads of college students.",
            "How senior management and workplace norms influence information security attitudes and self-efficacy.",
            "Awareness and handoffs in home care: coordination among informal caregivers.",
            "Time effect of disconfirmation on online shopping.",
            "Internet of Things-based student performance evaluation framework.",
            "UK public's intention to engage with academia via online technologies.",
            "Student teachers' satisfaction for blended learning via Edmodo learning management system.",
            "Exploring the motivational factors on continuous usage intention of smartwatches among actual users.",
            "Flow on the Internet: a longitudinal study of Internet addiction symptoms during adolescence.",
            "Development of an adoption model to assess user acceptance of e-service technology: E-Service Technology Acceptance Model.",
            "Corroborating students' self-reports of source evaluation.",
            "Pre-Implementation evaluation of a nationwide information system for university hospitals: lessons learned from a study in Brazil.",
            "Coming of old age: understanding older adults' engagement and needs in coproduction activities for healthy ageing.",
            "Perceptions of overuse, underuse, and change of use of a social media site: definition, measurement instrument, and their managerial impacts.",
            "From risk factors to detection and intervention: a practical proposal for future work on cyberbullying.",
            "Does family life cycle stage influence e-shopping acceptance by Indian women? An examination using the technology acceptance model.",
            "Exploring users' experiences of using personal cloud storage services: a phenomenological study.",
            "The impact of organisational support, technical support, and self-efficacy on faculty perceived benefits of using learning management system.",
            "An empirical study examining the perceptions and behaviours of security-conscious users of mobile authentication.",
            "Designing a personal informatics system for users without experience in self-tracking: a case study.",
            "Digital inclusion and online behaviour: five typologies of Australian internet users.",
            "Determinants of students' continuance intention to use blogs to learn: an empirical investigation.",
            "Understanding novelty: how task structure and tool familiarity moderate performance.",
            "Student interactions in online discussion forums: their perception on learning with business simulation games.",
            "Self-efficacy about information retrieval on the web across all domains: a short measure in French and English.",
            "Effects of an online team project-based learning environment with group awareness and peer evaluation on socially shared regulation of learning and self-regulated learning.",
            "Relationship among Facebook jealousy, aggression, and personal and relationship variables.",
            "Understanding online consumers' purchase intentions: a contribution from social network theory.",
            "Processing privacy information and decision-making for smartphone apps among young German smartphone users.",
            "'You talking to me?' The influence of peer communication on adolescents' persuasion knowledge and attitude towards social advertisements.",
            "Insights from surgeons' eye-movement data in a virtual simulation surgical training environment: effect of experience level and hand conditions.",
            "Acceptability of a custom-designed game, CityQuest, aimed at improving balance confidence and spatial cognition in fall-prone and healthy older adults.",
            "Internet Gaming Disorder: the interplay between physical activity and user-avatar relationship.",
            "Unfolding the privacy paradox among mobile social commerce users: a multi-mediation approach.",
            "Designing an electronic performance support system for technology-rich environments.",
            "A framework for informing consumers on the ecological impact of products at point of sale.",
            "Interplay between trust, information privacy concerns and behavioural intention of users on online social networks.",
            "Caregivers as a proxy for responses of dementia clients in a GPS technology acceptance study.",
            "Towards learner-constructed e-learning environments for effective personal learning experiences.",
            "Identity and performance in technical Q&A.",
            "Customer benefits and value co-creation activities in corporate social networking services.",
            "Tablet game-supported speech therapy embedded in children's popular practices.",
            "Tutoring executives online: what drives perceived quality?",
            "How do entrepreneurs learn and engage in an online community-of-practice? A case study approach.",
            "Context-aware services based on spatio-temporal zoning and crowdsourcing.",
            "Sixth graders' evaluation strategies when reading Internet search results: an eye-tracking study.",
            "Analysis of critical factors for social games based on extended technology acceptance model: a DEMATEL approach.",
            "How does presence influence purchase intention in online shopping markets? An explanation based on self-determination theory.",
            "Unwind: a musical biofeedback for relaxation assistance.",
            "Recreational athletes' running motivations as predictors of their use of online fitness community features.",
            "The effect of Facebook use on office workers' job performance and the moderating effects of task equivocality and interdependence.",
            "Games for active ageing, well-being and quality of life: a pilot study.",
            "Towards EEG-based BCI driven by emotions for addressing BCI-Illiteracy: a meta-analytic review.",
            "Editorial.",
            "Enhancing the quality of service of mobile video technology by increasing multimodal synergy.",
            "How to evaluate emotional experiences in television drama series: improving viewer evaluations using a combination of psychophysiological measurements and self-reports.",
            "The Konect value - a quantitative method for estimating perception time and accuracy for HMI designs.",
            "Cognitive work analysis in the conceptual design of first-of-a-kind systems - designing urban air traffic management.",
            "Profiling ethics orientation through play.",
            "Advanced decision-making in higher education: learning analytics research and key performance indicators.",
            "A bibliometric perspective of learning analytics research landscape.",
            "Competence-based recommender systems: a systematic literature review.",
            "Predicting students' learning style using learning analytics: a case study of business management students from India.",
            "Learning Analytics to identify dropout factors of Computer Science studies through Bayesian networks.",
            "Tracking precursors of learning analytics over serious game team performance ranking.",
            "Analysing the predictive power for anticipating assignment grades in a massive open online course.",
            "A mixed method analysis of the online information course withdrawal system.",
            "Promoting collaborative skills in online university: comparing effects of games, mixed reality, social media, and other tools for ICT-supported pedagogical practices.",
            "Barriers to the adoption of social networking sites in Saudi Arabia's higher education.",
            "Normalised fuzzy index for research ranking.",
            "System of Information Systems to support learners (a case study at the University of Technology of Compiègne).",
            "Big data and sentiment analysis to highlight decision behaviours: a case study for student population.",
            "Towards an integrated learning analytics framework for quality perceptions in higher education: a 3-tier content, process, engagement model for key performance indicators.",
            "Mapping the study of learning analytics in higher education.",
            "Correction.",
            "Perceived potential for value creation from cloud computing: a study of the Australian regional government sector.",
            "Assessing enterprise wiki success from the perspective of end-users: an empirical approach.",
            "Attention to eSports advertisement: effects of ad animation and in-game dynamics on viewers' visual attention.",
            "Evaluation of the electronic long cane: improving mobility in urban environments.",
            "Exploring player experience in ranked League of Legends.",
            "Using e-portfolio for learning goal setting to facilitate self-regulated learning of high school students.",
            "Some insights into the impact of affective information when delivering feedback to students.",
            "Using multidimensional scaling and PLS-SEM to assess the relationships between personality traits, problematic internet use, and fear of missing out."
        ]
    },
    {
        "name": "BIT",
        "year": "2017",
        "info": "Volume 36: 2017",
        "count": 96,
        "papers": [
            "A message from the new editor.",
            "Perceived quality factors of location-based apps on trust, perceived privacy risk, and continuous usage intention.",
            "Focused, not lost: the mediating role of Temporal Dissociation and Focused Immersion on Problematic Internet Use.",
            "Physicians' motivations to use mobile health monitoring: a cross-country comparison.",
            "Does power posing affect gerontechnology adoption among older adults?",
            "Effect of design-based learning on improving computational thinking.",
            "Playing 'catch up' with blended learning: performance impacts of augmenting classroom instruction with online learning.",
            "Perceived benefits of and barriers to the adoption of teleworking: peculiarities of Spanish family firms.",
            "Visual perception of multi-column-layout text: insight from repeated and non-repeated reading.",
            "How does justice matter in online retailers' reputation and purchase intentions: an empirical study of China.",
            "Music learning in preschool with mobile devices.",
            "Interactivity, engagement, and technology dependence: understanding users' technology utilisation behaviour.",
            "Understanding trust and perceived usefulness in the consumer acceptance of an e-service: a longitudinal investigation.",
            "How do post-usage factors and espoused cultural values impact mobile payment continuation?",
            "The effect of individual and task characteristics on decision aid reliance.",
            "Exploring the relative impact of biological sex and masculinity-femininity values on information technology use.",
            "Charismatic leadership and tacit knowledge sharing in the context of enterprise systems learning: the mediating effect of psychological safety climate and intrinsic motivation.",
            "Learning results and terminal values from the players of SimCity and The Sims.",
            "Exploring sustained participation in firm-hosted communities in China: the effects of social capital and active degree.",
            "Attitudes towards the use of information and communication technology in management education.",
            "Reducing techno-anxiety in high school teachers by improving their ICT problem-solving skills.",
            "The social influence of online collaborative community: the moderating effect of achievement.",
            "Adapting technology: effect of high-involvement HRM and organisational trust.",
            "Identify predictors of university students' continuance intention to use online carbon footprint calculator.",
            "Evaluating peer learning and assessment in online collaborative learning environments.",
            "Exploring the predictors and the role of trust and concern in the context of data disclosure to governmental institutions.",
            "Converging coolness and investigating its relation to user experience.",
            "Towards cultural translation of websites: a large-scale study of Australian, Chinese, and Saudi Arabian design preferences.",
            "SECOL: a semantic environment based on social media to support organisational learning.",
            "Do security and privacy policies in B2B and B2C e-commerce differ? A comparative study using content analysis.",
            "User bias in online trust systems: aligning the system designers' intentions with the users' expectations.",
            "Defining and classifying IT interaction disability.",
            "Texting and walking: a controlled field study of crossing behaviours and inattentional blindness in Taiwan.",
            "Understanding and supporting histopathology slide sorting.",
            "Self-reflection on privacy research in social networking sites.",
            "Influence of traits and emotions on boosting status sharing through microblogging.",
            "Effects of social support and personality on emotional disclosure on Facebook and in real life.",
            "Trading off usability and security in user interface design through mental models.",
            "Use of social network sites among depressed adolescents.",
            "A multilevel longitudinal study of experiencing virtual presence in adolescence: the role of anxiety and openness to experience in the classroom.",
            "Effects of using a force feedback haptic augmented simulation on the attitudes of the gifted students towards studying chemical bonds in virtual reality environment.",
            "How virtual reality affects perceived learning effectiveness: a task-technology fit perspective.",
            "Older people's production and appropriation of digital videos: an ethnographic study.",
            "Pre-service teachers' skills and perceptions about the use of virtual learning environments to improve teaching and learning.",
            "Information sharing as strategic behaviour: the role of information display, social motivation and time pressure.",
            "How colour similarity can make banner advertising effective: insights from Gestalt theory.",
            "The impact of security and its antecedents in behaviour intention of using e-government services.",
            "Exploring user behaviour of emoticon use among Chinese youth.",
            "Do pirates play fair? Testing copyright awareness of sports viewers.",
            "Innovative virtual and collaborative teaching methodologies.",
            "Enhancing the impact of online hotel reviews through the use of emoticons.",
            "Design and deployment challenges in immersive and wearable technologies.",
            "Effects of avatar character performances in virtual reality dramas used for teachers' education.",
            "Exploring extraneous cognitive load in an instructional process via the web conferencing system.",
            "Sext and gender: examining gender effects on sexting based on the theory of planned behaviour.",
            "Neuroergonomic analysis of perihand space: effects of hand proximity on eye-tracking measures and performance in a visual search task.",
            "Understanding community health workers' intentions to participate in mHealth studies within developing countries.",
            "From PhotoWork to PhotoUse: exploring personal digital photo activities.",
            "An investigation of the impact of cognitive absorption on continued usage of social media in Taiwan: the perspectives of fit.",
            "An empirical analysis of a maturity model to assess information system success: a firm-level perspective.",
            "Development of application-based mobile-service trust and online trust transfer: an elaboration likelihood model perspective.",
            "Practitioner pre-adoption perceptions of Electronic Medical Record systems.",
            "Automatic personality identification using writing behaviours: an exploratory study.",
            "A taxonomy of griefer type by motivation in massively multiplayer online role-playing games.",
            "An empirical study on the integrative pre-implementation model of technology acceptance in a mandatory environment.",
            "Applying Channel Expansion and Self-Determination Theory in predicting use behaviour of cloud-based VLE.",
            "The effect of different types of navigation assistance on indoor scene memorability.",
            "Mild stress stimuli built into a non-immersive virtual environment can elicit actual stress responses.",
            "Performance of smartphone users with half-pie and linear menus.",
            "Factors affecting adoption of smart meters in the post-Fukushima era in Taiwan: an extended protection motivation theory perspective.",
            "Consumers' post-adoption behaviour towards Internet banking: empirical evidence from Australia.",
            "How scales influence user rating behaviour in recommender systems.",
            "Objective measures of eating behaviour in a Swedish high school.",
            "Evaluation of automobile navigation systems with multisensory information channels.",
            "Understanding customer relationship management (CRM) adoption in an Arab Middle Eastern context.",
            "Shall we play again? The effects of repetitive gameplay and self-efficacy on behavioural intentions to take earthquake precautions.",
            "Relationships among smartphone addiction, anxiety, and family relations.",
            "Structural equation model (SEM)-neural network (NN) model for predicting quality determinants of e-learning management systems.",
            "Social capital expectation and usage of social media: the moderating role of social capital susceptibility.",
            "Student's perceptions towards using e-learning via Facebook.",
            "The effect of temporal psychological distance on reliance on word-of-mouth for information about destination image attributes.",
            "Old risks, new challenges: exploring differences in security between home computer and mobile device use.",
            "Exploring perceptions of data analytics in the internal audit function.",
            "Understanding user experience of news applications by Taxonomy of Experience (ToE).",
            "Parental perspectives on children's use of portable digital devices.",
            "Assessing the determinants of flow experience in the adoption of learning management systems: the moderating role of perceived institutional support.",
            "Altered video task: a non-verbal measure of what-who-where recall in young children.",
            "An ethnographic study of packaging-free purchasing: designing an interactive system to support sustainable social practices.",
            "Design for experience innovation: understanding user experience in new product development.",
            "Impact of using social network services on workplace ostracism, job satisfaction, and innovative behaviour.",
            "Intelligent explanation generation system for phishing webpages by employing an inference system.",
            "Factors affecting e-training adoption: an examination of perceived cost, computer self-efficacy and the technology acceptance model.",
            "Who tends to answer open-ended questions in an e-service survey? The contribution of closed-ended answers.",
            "Ranking versus reputation: perception and effects of search result credibility.",
            "Moderating effect of motivation for MIM use on the association between MIM bullying opportunities and MIM bullying behaviours.",
            "Designing social commerce platforms based on consumers' intentions."
        ]
    },
    {
        "name": "BIT",
        "year": "2016",
        "info": "Volume 35: 2016",
        "count": 99,
        "papers": [
            "Editorial.",
            "Aesthetics on the web: effects on approach and avoidance behaviour.",
            "Design-inclusive UX research: design as a part of doing user experience research.",
            "Evoking online consumer impulse buying through virtual layout schemes.",
            "The relationship between online game playing motivation and selection of online game characters - the case of Taiwan.",
            "The effect of smartphone use on trends in European adolescents' excessive Internet use.",
            "Helpful-stressful cycle? Psychological links between type of mobile phone user and stress.",
            "Editorial.",
            "Exploring consumer preferences in cloud archiving - a student's perspective.",
            "On the pitfalls of bibliographic database searching: comparing successful and less successful users.",
            "How to unite the power of the masses? Exploring collective stickiness intention in social network sites from the perspective of knowledge sharing.",
            "Understanding flow experience from users' requirements.",
            "Understanding collaborative resilience from continuous disruption: an actor-network perspective.",
            "Editorial.",
            "Integrating functional, social, and psychological determinants to explain online social networking usage.",
            "Using game mechanics for field evaluation of prototype social applications: a novel methodology.",
            "A model of e-commerce adoption (MOCA): consumer's perceptions and behaviours.",
            "Cyber neutralisation and flaming.",
            "Users' psychological perception and perceived readability of wearable devices for elderly people.",
            "Measuring the coolness of interactive products: the COOL questionnaire.",
            "Editorial.",
            "Perceptions of information quality dimensions from the perspective of commodity theory.",
            "Controlling information behaviour: the case for access control.",
            "The influence of affordances on user preferences for multimedia language learning applications.",
            "Educational recommender systems and their application in lifelong learning.",
            "An approach for preventing the indexing of hijacked journal articles in scientific databases.",
            "Needs identification methodology for inclusive design.",
            "Improving PDF readability of scientific papers on computer screens.",
            "Usability and accessibility of portable document format.",
            "Editorial.",
            "The role of perceived information practices on consumers' intention to authorise secondary use of personal data.",
            "E-commerce use in urbanising China: the role of normative social influence.",
            "Guarding against online threats: why entrepreneurs take protective measures.",
            "Investigating the influence of age, social capital affinity, and flow on positive outcomes reported by e-commerce site users.",
            "Development and validation of a technology acceptance model for safety-enhancing, wearable locating systems.",
            "The dynamics of film-induced affect and its effect on the interaction with tablet PCs.",
            "Human factors of a global society - a system of systems perspective.",
            "Editorial.",
            "Investigating the effects of experience on human performance in an object-tracking task: a case study of manual rendezvous and docking.",
            "Effect of typeface, letter case and position on recognition of short words presented on-screen.",
            "Linking card sorting to browsing performance - are congruent municipal websites more efficient to use?",
            "Using keywords to construct wuzzle-picture-puzzles for the purpose of mastering management and organisational behaviour terminology.",
            "Perceived social support moderates the relationships between variables in the social cognition model.",
            "On leaders' presence: interactions and influences within online communities.",
            "Expectations of privacy and trust: examining the views of IT professionals.",
            "Cyber-humans - our future with machines.",
            "Editorial.",
            "Smartphone addiction and its relationship with social anxiety and loneliness.",
            "A dual-risk model of user adoption of mobile-based smoking cessation support services.",
            "Applying psychology to understand relationships with technology: from ELIZA to interactive healthcare.",
            "The role of goal awareness and information technology self-efficacy on job satisfaction of healthcare system users.",
            "Exploring demographic and motivational factors associated with hypertext reading by English as a foreign language (EFL) students.",
            "Active learning through collaborative knowledge building using an automatic free-text scoring system in a b-learning environment.",
            "Automating and informating: roles to examine technology's impact on performance.",
            "Editorial.",
            "Making HCI theory work: an analysis of the use of activity theory in HCI research.",
            "Retrospective protocols in usability testing: a comparison of Post-session RTA versus Post-task RTA reports.",
            "Predicting user preferences of environment design: a perceptual mechanism of user interface customisation.",
            "Distraction effects of contextual advertising on online news processing: an eye-tracking study.",
            "Gaze-mouse coordinated movements and dependency with coordination demands in tracing.",
            "Age and domain specific usability analysis of opinion visualisation techniques.",
            "Editorial.",
            "Understanding undergraduates' problems from determinants of Facebook continuance intention.",
            "An open book on Facebook? Examining the interdependence of adolescents' privacy regulation strategies.",
            "Understanding the determinants of users' subjective well-being in social networking sites: an integration of social capital theory and social presence theory.",
            "Examining online citizenship behaviours in social network sites: a social capital perspective.",
            "Applying eco-visualisations of different interface formats to evoke sustainable behaviours towards household water saving.",
            "Communicating content: development and evaluation of icons for academic document triage through visualisation and perception.",
            "Editorial.",
            "Making knowledge machine-processable: some implications of general semantic search.",
            "Dynamic changes in the use of online advice in response to task success or failure.",
            "Crowdsourcing good landmarks for in-vehicle navigation systems.",
            "ICT-driven financial inclusion initiatives for urban poor in a developing economy: implications for public policy.",
            "'I want to know where my child is at all times' - field study of a location-aware safety service for schoolchildren.",
            "The determinants of helpfulness of online reviews.",
            "Demystifying 'selfie': a rampant social media activity.",
            "Digital fonts and reading.",
            "Virtual reality in learning, collaboration and behaviour: content, systems, strategies, context designs.",
            "Semiotics of virtual reality as a communication process.",
            "Using virtual reality for industrial design learning: a methodological proposal.",
            "Exploring educational immersive videogames: an empirical study with a 3D multimodal interaction prototype.",
            "Virtual reality systems enhance students' achievements in engineering education.",
            "A picture is worth a thousand words: an empirical study on the influence of content visibility on diffusion processes within a virtual world.",
            "Investigating the interrelation between attitudes, learning readiness, and learning styles under virtual learning environment: a study among Indian students.",
            "Short-term and long-term memory analysis of learning using 2D and 3D educational contents.",
            "Enhancing augmented reality with cognitive and knowledge perspectives: a case study in museum exhibitions.",
            "Designing an MOOC as an agent-platform aggregating heterogeneous virtual learning environments.",
            "Evaluation of quality and personalisation of VR/AR/MR learning systems.",
            "Presence in personalised e-learning - the impact of cognitive and emotional factors and the moderating role of gender.",
            "Editorial.",
            "Modelling touch-interaction time on smartphones.",
            "Effects of auditory, haptic and visual feedback on performing gestures by gaze or by hand.",
            "Evidence from the surgeons: gesture control of image data displayed during surgery.",
            "How to reduce the UX bottleneck - train your software developers.",
            "The influence of goal clarity, curiosity, and enjoyment on intention to code.",
            "Designing a persuasive physical activity application for older workers: understanding end-user perceptions.",
            "Website design: place for luxury brands in cyberspace?",
            "What is the role of IT in innovation? A bibliometric analysis of research development in IT innovation.",
            "A farewell to pens and keyboards."
        ]
    },
    {
        "name": "BIT",
        "year": "2015",
        "info": "Volume 34: 2015",
        "count": 105,
        "papers": [
            "Editorial.",
            "Police message diffusion on Twitter: analysing the reach of social media communications.",
            "User satisfaction evaluation of microblogging services in China: using the tetra-class model.",
            "Trust in product review blogs: the influence of self-disclosure and popularity.",
            "Compensation paradox: the influence of monetary rewards on user behaviour.",
            "How purchase intention consummates purchase behaviour: the stochastic nature of product valuation in electronic commerce.",
            "Analysing complaint intentions in online shopping: the antecedents of justice and technology use and the mediator of customer satisfaction.",
            "Eliciting positive user experiences with self-service kiosks: pursuing possibilities.",
            "Effect of change management capability in real-time environment: an information orientation perspective in supply chain management.",
            "Editorial.",
            "Determinants of employees' intention to exert pressure on firms to engage in web accessibility.",
            "Exploring perceptions of web accessibility: a survey approach.",
            "Improving accessibility of mobile devices with EasyWrite.",
            "Understanding the intentions of users to 'stick' to social networking sites: a case study in Taiwan.",
            "Understanding civic engagement behaviour on Facebook from a social capital theory perspective.",
            "Explaining and predicting perceived effectiveness and use continuance intention of a behaviour change support system for weight loss.",
            "Should I stay or should I go? The moderating effect of self-image congruity and trust on social networking continued use.",
            "Understanding the continuance use of social network sites: a computer self-efficacy perspective.",
            "Editorial.",
            "Beyond cognition and affect: sensing the unconscious.",
            "Behavioural responses to risk on remote outcomes.",
            "Information systems and performance: the role of technology, the task and the individual.",
            "Information systems satisfaction, loyalty and attachment: conceptual and empirical differentiation.",
            "Exploring managers' intention to use business intelligence: the role of motivations.",
            "How individual characteristics influence people's evaluation towards information technology in different contexts.",
            "Does computing anger have social elements? A comparison with driving anger.",
            "A neural network-based approach for user experience assessment.",
            "The impact of personal innovativeness on product aesthetics and self-connection with brand: a case study of mobile phone users.",
            "Editorial.",
            "How access gaps interact and shape digital divide: a cognitive investigation.",
            "Gender-related consequences of Internet use perceived by parents in a representative quota sample of adolescents.",
            "Preventing problematic Internet use through video-based interventions: a theoretical model and empirical test.",
            "Trust and online information-sharing in close relationships: a cross-cultural perspective.",
            "Supporting children's online identity in international communities.",
            "The influence of familiarity, trust and norms of reciprocity on an experienced sense of community: an empirical analysis based on social online services.",
            "Specifying the dynamics of social technologies as social microworlds.",
            "'Can I afford to help?' How affordances of communication modalities guide bystanders' helping intentions towards harassment on social network sites.",
            "The Laws of the Knowledge Workplace edited by Dariusz Jemielniak, Gower, 2014.",
            "Living and working on the Web.",
            "Teachers' personal web use at work.",
            "Employees' use of social media technologies: a methodological and thematic review.",
            "Cultivating travellers' revisit intention to e-tourism service: the moderating effect of website interactivity.",
            "Understanding user motivation for evaluating online content: a self-determination theory perspective.",
            "The influence of national culture on the performance expectancy of e-parliament adoption.",
            "User value design for cloud courseware system.",
            "Advertising value and credibility transfer: attitude towards web advertising and online information acquisition.",
            "Assessing the relationship between autistic traits and cyberdeviancy in a sample of college students.",
            "Medical teamwork, collaboration and patient-centred care.",
            "Disease surveillance and patient care in remote regions: an exploratory study of collaboration among health-care professionals in Amazonia.",
            "Issues and opportunities in transitions from speciality care: a field study of bone marrow transplant.",
            "Non-clinical work counts: facilitating patient outflow in an emergency department.",
            "On a QUESt for a web-based tool promoting knowledge-sharing in medical communities.",
            "Using mobile devices and apps to support reflective learning about older people with dementia.",
            "An augmentative and alternative communication tool for children and adolescents with cerebral palsy.",
            "Hypnosis therapy using augmented reality technology: treatment for psychological stress and anxiety.",
            "Editorial.",
            "Group identification as a mediator of the effect of players' anonymity on cheating in online games.",
            "Meeting ex-partners on Facebook: users' anxiety and severity of depression.",
            "College students and risk-taking behaviour on Twitter versus Facebook.",
            "Use of Facebook, Tuenti, Twitter and Myspace among young Spanish people.",
            "The lesbian, gay, bisexual and transgender community online: discussions of bullying and self-disclosure in YouTube videos.",
            "3-D route-planning support for navigation in a complex indoor environment.",
            "Exploring older women's confidence during route planning.",
            "Understanding driver adoption of car navigation systems using the extended technology acceptance model.",
            "Handbook of virtual environments: design, implementation, and applications, second edition, edited by Kelly S. Hale and Kay M. Stanney, CRC Press, 2014.",
            "Mental load and usability.",
            "A defeasible reasoning framework for human mental workload representation and assessment.",
            "Predicting numerical data entry errors by classifying EEG signals with linear discriminant analysis.",
            "A usability study of iPhone built-in applications.",
            "A typology of human computation games: an analysis and a review of current games.",
            "A comparative analysis of different gender pair combinations in pair programming.",
            "Longitudinal test of ePortfolio continuous use: an empirical study on the change of students' beliefs.",
            "Social interaction online.",
            "The relationship between motivation and information sharing about products and services on Facebook.",
            "The effects of generational differences on use continuance of Twitter: an investigation of digital natives and digital immigrants.",
            "Predicting Asian undergraduates' intention to continue using social network services from negative perspectives.",
            "The effects of reading and writing habits on blog adoption.",
            "Adoption of travel information in user-generated content on social media: the moderating effect of social presence.",
            "Sound information seeking in Web 2.0 virtual communities: the moderating effect of mindfulness.",
            "DOBNet: exploiting the discourse of deception behaviour to uncover online deception strategies.",
            "User experience.",
            "Study of using a multi-touch tabletop technology to facilitate collaboration, interaction, and awareness in co-located environment.",
            "Affective forecasting of value creation: professional nurses' ability to predict and remember the experienced value of a telemedicine diagnostics ICT service.",
            "Defining user experience goals to guide the design of industrial systems.",
            "Usability, expectation, confirmation, and continuance intentions to use electronic textbooks.",
            "Impact of virtual atmospherics and functional qualities on the online gambler's experience.",
            "Determinants of online safety behaviour: towards an intervention strategy for college students.",
            "Editorial.",
            "Elderly user experience to improve a Kinect-based game playability.",
            "The use and acceptance of new media entertainment technology by elderly users: development of an expanded technology acceptance model.",
            "Comparison of engagement and emotional responses of older and younger adults interacting with 3D cultural heritage artefacts on personal devices.",
            "Multiple voices in ICT design with children - a nexus analytical enquiry.",
            "StencilMaps and EphemeralMaps: spatially stable interfaces that highlight command subsets.",
            "The effect of communicational signals on drivers' subjective appraisal and visual attention during interactive driving scenarios.",
            "Looks familiar, appears more valid? The moderating role of computer-supported warnings between information repetition and decision outcome.",
            "Cyberconnecting: the three lenses of diversity, by Priya E. Abraham, Gower, 2015.",
            "Editorial.",
            "Understanding consumers' mobile channel continuance: an empirical investigation of two fitness mechanisms.",
            "Emotional attachment and multidimensional self-efficacy: extension of innovation diffusion theory in the context of eBook reader.",
            "The moderation effect of user-type (educators vs. students) in learning management system continuance.",
            "Effect of external factors on intention-behaviour gap.",
            "Coalition formation during technology adoption.",
            "A hybrid decision-making model for factors influencing the purchase intentions of technology products: the moderating effect of lifestyle.",
            "The handbook of the psychology of communication technology, edited by S. Shyam Sundar, Chichester, John Wiley & Sons, 2015.",
            "A tribute to our reviewers."
        ]
    },
    {
        "name": "BIT",
        "year": "2014",
        "info": "Volume 33: 2014",
        "count": 112,
        "papers": [
            "Adaptive training interfaces for less-experienced, elderly users of electronic devices.",
            "The impact of self-efficacy and perceived system efficacy on effectiveness of virtual training systems.",
            "Blog learning: effects of users' usefulness and efficiency towards continuance intention.",
            "Effects of individuals' locus of control and computer self-efficacy on their e-learning acceptance in high-tech companies.",
            "The nature and components of perceived behavioural control as an element of theory of planned behaviour.",
            "Under pressure to sext? Applying the theory of planned behaviour to adolescent sexting.",
            "A life in error - fromlittle slips to big disasters.",
            "Editorial.",
            "Usability of affective interfaces for a digital arts tutoring system.",
            "The influence of the search complexity and the familiarity with the website on the subjective appraisal of aesthetics, mental effort and usability.",
            "The development of a panorama manifestation virtual reality system for navigation and a usability comparison with a desktop system.",
            "What you get is what you see: revisiting the evaluator effect in usability tests.",
            "The impact of two different think-aloud instructions in a usability test: a case of just following orders?",
            "Exploring the Critical Factors Influencing the Quality of Blog Interfaces Using the Decision-Making Trial and Evaluation Laboratory (DEMATEL) Method.",
            "Must evaluation methods be about usability? Devising and assessing the utility inspection method.",
            "Editorial.",
            "Attitudes towards software piracy in South Africa: Knowledge of Intellectual Property Laws as a moderator.",
            "The study of perceived adverse effects of digital piracy and involvement: insights from adult computer users.",
            "User preference of cyber security awareness delivery methods.",
            "Collective activities in a technology-mediated medical team. An analysis of epidemiological alert management.",
            "Technology-mediated information sharing between patients and clinicians in primary care encounters.",
            "Observing the use of an input device for rehabilitation purposes.",
            "Exploring the potential of virtual worlds in engaging older people and supporting healthy aging.",
            "Promoting healthy computer use: timing-informed computer health animations for prolonged sitting computer users.",
            "Editorial.",
            "Measuring and evaluating IS expectations and benefit success from B2B electronic trading: a new survey approach.",
            "Realising M-Payments: modelling consumers' willingness to M-pay using Smart Phones.",
            "Attitudes towards mobile banking: are there any differences between users and non-users?",
            "Facebook and socio-economic benefits in the developing world.",
            "A comparative study of two wayfinding aids for simulated driving tasks - single-scale and dual-scale GPS aids.",
            "Experiments on user experiences with recommender interfaces.",
            "Factors influencing behavioural intention to patronise restaurants using iPad as a menu card.",
            "A comparative study of scores on computer-based tests and paper-based tests.",
            "Editorial.",
            "Using OWL-VisMod through a decision-making process for reusing OWL ontologies.",
            "Ontology engineering step in design science research methodology: a technique to gather and reuse knowledge.",
            "Adoption of the Internet for knowledge acquisition in R&D processes.",
            "An application framework for developing collaborative handheld decision-making tools.",
            "Knowledge processes in virtual teams: consolidating the evidence.",
            "Examining the role of perceived value in virtual communities continuance: its antecedents and the influence of experience.",
            "Determinants of knowledge seeking in professional virtual communities.",
            "Social virtual world continuance among teens: uncovering the moderating role of perceived aggregate network exposure.",
            "Editorial.",
            "Older adults' use of smart phones: an investigation of the factors influencing the acceptance of new functions.",
            "Redesigning websites for older adults: a case study.",
            "Can ICT improve the quality of life of elderly adults living in residential home care units? From actual impacts to hidden artefacts.",
            "Effects of perceptual complexity on older and younger adults' target acquisition performance.",
            "Promoting in-depth reading experience and acceptance: design and assessment of Tablet reading interfaces.",
            "Facilitating shared understanding of work situations using a tangible tabletop interface.",
            "The importance of interface complexity and entropy for online information sharing.",
            "A comparative study using an autostereoscopic display with augmented and virtual reality.",
            "Testing Einstein's faux formula: fast computers+slow humans=creative brilliance.",
            "Editorial.",
            "Continual use of microblogs.",
            "Continuance use intention of enterprise instant messaging: a knowledge management perspective.",
            "Mobile phone purchase and usage behaviours of early adopter groups in Korea.",
            "Testing the moderating role of need for cognition in smartphone adoption.",
            "Predicting the use of online information services based on a modified UTAUT model.",
            "Understanding consumers' continuance intention towards mobile advertising: a theoretical framework and empirical study.",
            "Gender, culture and determinants of behavioural intents to adopt mobile commerce among the Y Generation in transition economies: evidence from Kazakhstan.",
            "Prevalence of internet addiction in the general population: results from a German population-based survey.",
            "Do broadband adoption rates impact a community's health?",
            "Thinking beyond the box: designing interactive TV across different devices.",
            "User interface guidelines for the control of interactive television systems via smart phone applications.",
            "Extending the field of view: a human-centred design perspective on 360° TV.",
            "Impacts of new technologies on media usage and social behaviour in domestic environments.",
            "PalmRC: leveraging the palm surface as an imaginary eyes-free television remote control.",
            "Composition and role of convergent technological repertoires in audiovisual media consumption.",
            "New interaction modes for rich panoramic live video experiences.",
            "Experiments and studies.",
            "The effects of a computer malfunction on subsequent task performance.",
            "Maintaining intimacy at a distance: an exploration of human-computer interaction's approach to mediating intimacy.",
            "Personalised and dynamic image precompensation for computer users with ocular aberrations.",
            "A comparison of image inspection modes for a visual search and rescue task.",
            "Investigating the effects of sound masking on the use of audio CAPTCHAs.",
            "Effect of driving experience on collision avoidance braking: an experimental investigation and computational modelling.",
            "Attitudes towards robots suitability for various jobs as affected robot appearance.",
            "Traces and activity: a case study of a joint writing process mediated by a digital environment.",
            "Design requirements for persuasive technologies to motivate physical activity in adolescents: a field study.",
            "Identifying emotion by keystroke dynamics and text pattern analysis.",
            "Editorial.",
            "Evaluation of the interactivity of students in virtual learning environments using a multicriteria approach and data mining.",
            "Computers and types of control in relation to work stress and learning.",
            "Empirical study on continuance intentions towards E-Learning 2.0 systems.",
            "The effect of levels of processing with navigation design types on recall and retention in e-learning environments.",
            "Exploring determinants of adoption intentions towards Enterprise 2.0 applications: an empirical study.",
            "Factors affecting the performance of Enterprise Resource Planning (ERP) systems in the post-implementation stage.",
            "Distinguishing the adoption of business intelligence systems from their implementation: the role of managers' personality profiles.",
            "CRUDi framework proposal: financial industry application.",
            "Human Factors in Lighting.",
            "Editorial.",
            "Informal feedback rather than performance measurements - user-centred evaluation in Scrum projects.",
            "Towards a contingency approach with whitelist- and blacklist-based anti-phishing applications: what do usability tests indicate?",
            "Barefoot usability evaluations.",
            "Studying the effect of perceived hedonic mobile device quality on user experience evaluations of mobile applications.",
            "Expressive and classical aesthetics: two distinct concepts with highly similar effect patterns in user-artefact interaction.",
            "Revisiting the two-stage choice model: an empirical study of consumer choice on brand website visits.",
            "See you on Facebook: exploring influences on Facebook continuous usage.",
            "Does confirmation always matter? Extending confirmation-based theories.",
            "The acceptance of information technology innovations in hospitals: differences between early and late adopters.",
            "Editorial.",
            "The significance of attitudes towards evidence-based practice in information technology use in the health sector: an empirical investigation.",
            "Night optimised care technology for users needing assisted lifestyles.",
            "Formal verification of collaboration patterns in healthcare.",
            "Are mobile phone conversations always so annoying? The 'need-to-listen' effect re-visited.",
            "The drivers of consumers' intention to redeem a push mobile coupon.",
            "Tactful calling: investigating asymmetric social dilemmas in mobile communications.",
            "A framework for mobile SNS advertising effectiveness: user perceptions and behaviour perspective.",
            "Always connected, but are smart mobile users getting more security savvy? A survey of smart mobile device users.",
            "The influence of cognitive conflict on the result of collaborative editing in Wikipedia.",
            "The reasons why people continue editing Wikipedia content - task value confirmation perspective.",
            "Crowdsourcing contests: understanding the effect of competitors' participation history on their performance."
        ]
    },
    {
        "name": "BIT",
        "year": "2013",
        "info": "Volume 32: 2013",
        "count": 104,
        "papers": [
            "New year, new iPad.",
            "Bridging the digital divide - an Australian story.",
            "Public Internet access points (PIAPs) and their social impact: a case study from Turkey.",
            "Social capital: the benefit of Facebook 'friends'.",
            "The effects of a Creative Commons approach on collaborative learning.",
            "User experience in social commerce: in friends we trust.",
            "Exploring the use of design pattern maps for aligning new technical support to new clinical team meeting routines.",
            "Implementing telemedicine technologies through an unlearning context in a homecare setting.",
            "Satisfaction with health status among cyber patients: testing a mediation model of electronic coping support.",
            "Editorial.",
            "Investigating memory constraints on recall of options in interactive voice response system messages.",
            "Subjective responses to synthesised speech with lexical emotional content: the effect of the naturalness of the synthetic voice.",
            "Psychological costs of support seeking and choice of communication channel.",
            "The role of information and communication technologies in the relationship between group potency and group maintenance outcomes: a longitudinal study.",
            "Smart TV: are they really smart in interacting with people? Understanding the interactivity of Korean Smart TV.",
            "An investigation of employees' use of e-learning systems: applying the technology acceptance model.",
            "A development of learning widget on m-learning and e-learning environments.",
            "Exploring the user experience of three-dimensional virtual learning environments.",
            "Editorial.",
            "Exploring perceptions toward biometric technology in service encounters: a comparison of current users and potential adopters.",
            "Adoption of free and open source software within high-velocity firms.",
            "Systems approach for analysing problems in IT system adoption at work.",
            "The effect of flow experience on user adoption of mobile TV.",
            "Towards a more accessible e-government in Jordan: an evaluation study of visually impaired users and Web developers.",
            "An empirical study of cultural dimensions and e-government development: implications of the findings and strategies.",
            "Identification of new added value services on intelligent transportation systems.",
            "Editorial.",
            "Personality and technology acceptance: the influence of personality factors on the core constructs of the Technology Acceptance Model.",
            "User satisfaction affecting the acceptance of an e-learning platform as a mean for the development of the human capital.",
            "The importance of identification for the acceptance of consumer electronics on the example of the Wii.",
            "Antecedents of information systems user behaviour - extended expectation-confirmation model.",
            "Why do we blog? From the perspectives of technology acceptance and media choice factors.",
            "Counterfactual thinking and anticipated emotions enhance performance in computer skills training.",
            "An empirical investigation of the consumer demand for digital television application services.",
            "An investigation of the intention to share media files over peer-to-peer networks.",
            "Netlife: Living and Working with the Internet.",
            "Navigating a car in an unfamiliar country using an internet map: effects of street language formats, map orientation consistency, and gender on driver performance, workload and multitasking strategy.",
            "The new neighbourhood in the internet era: network communities serving local communities.",
            "Controllable accountabilities: the Internet of Things and its challenges for organisations.",
            "Why don't consumers go internet shopping in Korea? Segmentation of consumer lifestyle approach.",
            "The equivalence of Internet versus paper-based surveys in IT/IS adoption research in collectivistic cultures: the impact of satisficing.",
            "Analysing the visual complexity of web pages using document structure.",
            "Interaction of textual and graphical information in locating web page widgets.",
            "Editorial: Web based cooperation and collaboration.",
            "Collaboration processes, outcomes, challenges and enablers of distributed clinical communities of practice.",
            "A text categorisation tool for open source communities based on semantic analysis.",
            "Pre-release member participation as potential predictors of post-release community members' adoption behaviour: evidence from the motion picture industry.",
            "Verbal irony use in personal blogs.",
            "Continuance intention of blog users: the impact of perceived enjoyment, habit, user involvement and blogging time.",
            "Phishing for phishing awareness.",
            "Using Facebook out of habit.",
            "The influence of equivocality in purchasing tasks on the selection of transaction channels in online auctions.",
            "Uploaders' definition of the networked public on YouTube and their feedback preferences: a multi-method approach.",
            "Computer access for people with disabilities: a human factors approach.",
            "Editorial.",
            "The effects of the number of alternative products and the way they are presented on the consumers' subjective statuses in online travel sites.",
            "Cultural differences in online beer marketing: findings from automated attention analysis.",
            "Online and mobile customer behaviour: a critical evaluation of Grounded Theory studies.",
            "Acceptance of online banking information systems: an empirical case in a developing economy.",
            "E-banking in Jordan.",
            "Showering behavioural response to alarming visual display monitors: longitudinal mixed method study.",
            "An effective online teaching method: the combination of collaborative learning with initiation and self-regulation learning with feedback.",
            "Challenges of designing for sociability to enhance player experience in Massively Multi-player Online Role-playing Games.",
            "Mechanisms underlying aggravation and relaxation of virtual aggression: a Second Life survey study.",
            "Corrigendum to the paper 'Effects of search interface and Internet-specific epistemic beliefs on source evaluations during Web search for medical information: an eye-tracking study'.",
            "Ergonomics, usability and accessibilty.",
            "Focus groups as a requirements gathering method with adults with severe speech and physical impairments.",
            "Highlighting items as means of adaptive assistance.",
            "Post-error expression of speed and force while performing a simple, monotonous task with a haptic pen.",
            "Towards a full emotional system.",
            "Perceptions of electronic navigation displays.",
            "Exploring the cognitive costs and benefits of using multiple-view visualisations.",
            "Gaze-augmented interaction improves problem-solving: new evidence from verbal protocols.",
            "Evaluating 2D and 3D geovisualisations for basic spatial assessment.",
            "Editorial.",
            "The moderating role of sensation seeking tendency in robotic haptic interfaces.",
            "Designing touchpad user-interfaces for right-hand drive vehicles: an investigation into where the touchpad should be located.",
            "Effects of display modality on critical battlefield e-map search performance.",
            "A comparative study of information input devices for aging computer users.",
            "User requirements of social media for the elderly: a case study in Taiwan.",
            "Exploring how children use their hands to think: an embodied interactional analysis.",
            "An exploratory study on how children interact with pedagogic conversational agents.",
            "Technology and social behaviour.",
            "Measuring social behaviour as an indicator of experience.",
            "Effects of technical and social design on virtual community identification: a comparison approach.",
            "Social construction of information systems in the banking sector.",
            "Dissecting social engineering.",
            "Knowledge sharing in information system development teams: examining the impact of shared mental model from a social capital theory perspective.",
            "Trust, empathy, social identity, and contribution of knowledge within patient online communities.",
            "My mom's on Facebook: an evaluation of information sharing depth in social networking.",
            "An investigation of the impact of media capabilities and extraversion on social presence and user satisfaction.",
            "Editorial.",
            "Decisions in software development projects management. An exploratory study.",
            "Kilowhat? A multidisciplinary approach on the development of a home energy management system.",
            "The contingent effect of personal IT innovativeness and IT self-efficacy on innovative use of complex IT.",
            "Exploring the determinants of IS developers' behavioural intention to learn business skills.",
            "Web-enabled wireless technology: an exploratory study of adoption and continued use intentions.",
            "The role of attributional judgments when adopted computing technology fails: a comparison of Microsoft Windows PC user perceptions of Windows and Macs.",
            "An empirical investigation linking learners' adoption of blended learning to their intention of full e-learning.",
            "Strategic demand forecasts for the tablet PC market using the Bayesian mixed logit model and market share simulations.",
            "User experience in social commerce: in friends we trust.",
            "Exploring the user experience of 3D virtual learning environments.",
            "Smart TV: Are they really smart in interacting with people? Understanding the interactivity of Korean smart TV.",
            "Editorial."
        ]
    },
    {
        "name": "BIT",
        "year": "2012",
        "info": "Volume 31: 2012",
        "count": 92,
        "papers": [
            "Cognitive modelling of web navigation.",
            "Information scent determines attention allocation and link selection among multiple information patches on a webpage.",
            "CoLiDeS+ Pic: a cognitive model of web-navigation based on semantic information from pictures.",
            "Evaluating CoLiDeS + Pic: the role of relevance of pictures in user navigation behaviour.",
            "Simulating navigation behaviour based on the architecture model Model Human Processor with Real-Time Constraints (MHP/RT).",
            "Seeking information online: the influence of menu type, navigation path complexity and spatial ability on information gathering tasks.",
            "Incidental learning of links during navigation: the role of visuo-spatial capacity.",
            "Effects of search interface and Internet-specific epistemic beliefs on source evaluations during Web search for medical information: an eye-tracking study.",
            "Editorial.",
            "Identifying mutual engagement.",
            "Development of an assistance environment for tutors based on a co-adaptive design approach.",
            "How information organisation affects users' representation of hypertext structure and content.",
            "Integrating complex information with object displays: psychophysical evaluation of outlines.",
            "Selective attention in web forms: an exploratory case study with older people.",
            "Increasingly emotional design for growingly pragmatic users? A report from Finland.",
            "New opportunities for services and human-computer interaction.",
            "Affective and social determinants of mobile data services adoption.",
            "Storytelling Group - a co-design method for service design.",
            "The role of HCI models in service front-end development.",
            "Lowering the line of visibility: incidental users in service encounters.",
            "The tension between user-centred design and e-government services.",
            "Design of a patient-centric, service-oriented health care navigation system for a local health integration network.",
            "Adding user experience into the interactive service design loop: a persona-based approach.",
            "User-centred design and evaluation of EnergyCoach - an interactive energy service for households.",
            "Computers are everywhere.",
            "Marketing implications of traditional and ICT-mediated leisure activities.",
            "Cyberloafing at the workplace: gain or drain on work?",
            "Privacy in instant messaging: an impression management model.",
            "Informing the development of a fraud prevention toolset through a situated analysis of fraud investigation expertise.",
            "User-based assessment of website creativity: a review and appraisal.",
            "The effect of experience and socio-economic status on web searching performance: a South African perspective.",
            "Connecting generations: developing co-design methods for older adults and children.",
            "Training software developers and designers to conduct usability evaluations.",
            "Editorial.",
            "Attitude, aptitude, ability and autonomy: the emergence of 'offroaders', a special class of nomadic worker.",
            "Age as a moderator of attitude towards technology in the workplace: work motivation and overall job satisfaction.",
            "Reconsidering the boundaries of the cyberloafing activity: the case of a university.",
            "The dilemma of renqing in ISD processes: interpretations from the perspectives of face, renqing and guanxi of Chinese cultural society.",
            "An agent-based debiasing framework for investment decision-support systems.",
            "Adoption of information and communication technologies and dominant management orientation in organisations.",
            "Extended conceptualisation of perceived usefulness: empirical test in the context of information system use continuance.",
            "Human performance on the flight deck.",
            "Editorial.",
            "Exploring software piracy as a factor of video game console adoption.",
            "Digital piracy intention: a comparison of theoretical models.",
            "The frequency of the dyadic influence tactics according to communication media.",
            "Using insights from email users to inform organisational email management policy.",
            "The impact of verbal interaction on driver lateral control: an experimental assessment.",
            "Developing expertise in military communications planning: do verbal reports change with experience?",
            "An experimental investigation into the effects of information revelation in multi-attribute reverse auctions.",
            "Websites - Quality and Usability.",
            "Measuring website quality: asymmetric effect of user satisfaction.",
            "Accessibility levels of Portuguese enterprise websites: equal opportunities for all?",
            "Predicting user attention in complex web pages.",
            "Public websites and human-computer interaction: an empirical study of measurement of website quality and user satisfaction.",
            "A comparison of usability evaluation methods for evaluating e-commerce websites.",
            "What should a corporate website look like? The influence of Gestalt principles and visualisation in website design on the degree of acceptance and recommendation.",
            "Informal learning in work environments: training with the Social Web in the workplace.",
            "Informal learning through expertise mining in the social web.",
            "Wiki as a corporate learning tool: case study for software development company.",
            "Web-based knowledge exchange through social links in the workplace.",
            "Evaluation of fostering students' creativity in preparing aided recalls for revision courses using electronic revision and recapitulation tools 2.0.",
            "Challenges of knowledge management and creation in communities of practice organisations of Deaf and non-Deaf members: requirements for a Web platform.",
            "Editorial.",
            "Role of trialability in B2B e-business adoption: theoretical insights from two case studies.",
            "The role of Internet buyer's product familiarity and confidence in anchoring effect.",
            "Development and validation of a formative and a reflective measure for the assessment of online store usability.",
            "The antecedents of online financial service adoption: the impact of physical banking services on Internet banking acceptance.",
            "Perceptual differences of enterprise resource planning systems between management and operational end-users.",
            "Impact of top management team on firm performance in small and medium-sized enterprises adopting commercial open-source enterprise resource planning.",
            "Dual strategy for managing user resistance with business integration systems.",
            "Modelling dynamics in decision support systems.",
            "Editorial.",
            "The perceived rudeness of public cell phone behaviour.",
            "Understanding what determines consumers' expanded use of mobile videophones.",
            "The relation between usability and product success in cell phones.",
            "Providing customisation guidelines of mobile phones for manufacturers.",
            "An empirical analysis of smartphone personalisation: measurement and user variability.",
            "Digital games as creativity enablers for children.",
            "Impact of intangibility on perceived risk associated with online games.",
            "Playability: analysing user experience in video games.",
            "Knowledge sharing.",
            "Towards sharing life-log information with society.",
            "Understanding knowledge sharing between IT professionals - an integration of social cognitive and social exchange theory.",
            "Experience differences and continuance intention of blog sharing.",
            "A unified model of knowledge sharing behaviours: theoretical development and empirical test.",
            "Effects of information technologies, department characteristics and individual roles on improving knowledge sharing visibility: a qualitative case study.",
            "Knowledge-sharing in virtual communities: familiarity, anonymity and self-determination theory.",
            "Editorial.",
            "Assessing roles of people, technology and structure in emergency management systems: a public sector perspective.",
            "An elaboration likelihood model based longitudinal analysis of attitude change during the process of IT acceptance via education program.",
            "Location does not have to be destiny: student evaluation and integrity controls in a management accounting class."
        ]
    },
    {
        "name": "BIT",
        "year": "2011",
        "info": "Volume 30: 2011",
        "count": 70,
        "papers": [
            "Sidestepping Implementation Traps When Implementing Knowledge Management: Lessons Learned From Siemens.",
            "Preface.",
            "A problem-solving approach to management of instructional systems design.",
            "Collaborative systems engineering and social-networking approach to design and modelling of smarter products.",
            "Design concerns in the engineering of virtual worlds for learning.",
            "Regional knowledge management: the perspective of management theory.",
            "Identity crisis: user perspectives on multiplicity and control in federated identity management.",
            "Understanding e-learning continuance intention: a negative critical incidents perspective.",
            "Predicting the continued use of Internet-based learning technologies: the role of habit.",
            "Statistical model for predicting roles and effects in learning community.",
            "Knowledge management system adoption: exploring the effects of empowering leadership, task-technology fit and compatibility.",
            "Understanding knowledge-sharing behaviour in Wikipedia.",
            "How Internet Surfers Become Online Buyers? an Integrative Model of E-Commerce Acceptance.",
            "Editorial.",
            "Textbook websites: user technology acceptance behaviour.",
            "Integrating website usability with the electronic commerce acceptance model.",
            "Do I have to learn something new? Mental models and the acceptance of replacement technologies.",
            "Knowledge-sharing motivations affecting R&D employees' acceptance of electronic knowledge repository.",
            "Cloud computing adoption and usage in community colleges.",
            "An empirical examination of users' post-adoption behaviour of mobile services.",
            "Drivers and effects of enterprise resource planning post-implementation learning.",
            "Developing an appropriate design of blended learning with web-enabled self-regulated learning to enhance students' learning and thoughts regarding online learning.",
            "Effects of different metaphor usage on hypertext learning.",
            "Smart clothing - technology and applications.",
            "Editorial.",
            "Object-oriented modelling with unified modelling language 2.0 for simple software application based on agile methodology.",
            "Participatory design in OSS development: interpretive case studies in company and community OSS development contexts.",
            "Understanding OSS development in communities: the perspectives of ideology and knowledge sharing.",
            "Crisis IT design implications for high risk systems: systems, control and information propositions.",
            "Do developers matter in system review?",
            "Impact of restrictive composition policy on user password choices.",
            "Management of system development knowledge: a cognitive approach.",
            "Designing touchpad user-interfaces for vehicles: which tasks are most suitable?",
            "Effects of sensorimotor transformations with graphical input devices.",
            "A study on how usability flaws in GUI design increase mouse movements and consequently may affect users' health.",
            "Physical space and information space: studies of collaboration in distributed multi-disciplinary medical team meetings.",
            "References to personal experiences and scientific evidence during medical multi-disciplinary team meetings.",
            "Waiting times for cancer treatment: the impact of multi-disciplinary team meetings.",
            "Real-time multidisciplinary team meeting management systems. A comparison with paper records for staging completeness and waiting times.",
            "'Sound of silence' - changing from an oral to a computer-mediated handover.",
            "The ConStratO model of handover: a tool to support technology design and evaluation.",
            "Safe use of symbols in handover documentation for medical teams.",
            "Collaboration and learning in medical teams by using video conference.",
            "Meeting community needs through leadership and innovation: a case of virtual psychiatric emergency department (ED).",
            "Morality and expert systems: problem solving in medical team meetings.",
            "A case study analysis of a constructionist knowledge building community with activity theory.",
            "Ontology-based empirical knowledge verification for professional virtual community.",
            "Exploring the antecedents of trust in virtual communities.",
            "How virtual community participation influences consumer loyalty intentions in online shopping contexts: an investigation of mediating factors.",
            "A comparison of empathic communication pattern for teenagers and older people in online support communities.",
            "Age-related differences in the initial usability of mobile device icons.",
            "Increased memory load during task completion when procedures are presented on mobile screens.",
            "Exploring factors influencing mobile users' intention to adopt multimedia messaging service.",
            "Mobile device impairment ... similar problems, similar solutions?",
            "Exploring the logic of mobile search.",
            "Editorial.",
            "An investigation of the usability of the stylus pen for various age groups on personal digital assistants.",
            "Investigating the effects of multimodal feedback through tracking state in pen-based interfaces.",
            "Integrating discrete events and continuous head movements for video-based interaction techniques.",
            "Video-based person recognition using fovea intensity comparison code.",
            "Supporting dictation speech recognition error correction: the impact of external information.",
            "Colour size illusion on liquid crystal displays and design guidelines for bioinformatics tools.",
            "The influence of product aesthetics and user state in usability testing.",
            "Effects of typographic variables on eye-movement measures in reading Chinese from a screen.",
            "The effect of user characteristics on the efficiency of visual querying.",
            "Evaluating gaze-based interface tools to facilitate point-and-select tasks with small targets.",
            "The influence of different electronic maps and displays on performance and operator state in a geographic orientation task.",
            "Using the Internet for speech research: an evaluative study examining affect in speech.",
            "The promise of zoomable user interfaces.",
            "The handbook of human-machine interaction - a human centered design approach."
        ]
    },
    {
        "name": "BIT",
        "year": "2010",
        "info": "Volume 29: 2010",
        "count": 54,
        "papers": [
            "Editorial.",
            "The expressive and conversational affordances of mobile messaging.",
            "Acceptability of an asynchronous learning forum on mobile devices.",
            "Measuring perceived interactivity of mobile advertisements.",
            "Exploring critical usability factors for handsets.",
            "Design guidelines for effective recommender system interfaces based on a usability criteria conceptual model: results from a college student population.",
            "Joint influence of online store attributes and offline operations on performance of multichannel retailers.",
            "Dogmas in the assessment of usability evaluation methods.",
            "The effect of motor difficulty on the acquisition of a computer task: a comparison between young and older adults.",
            "An investigation of subjective operational biases in steering tasks evaluation.",
            "Pen pressure control in trajectory-based interaction.",
            "Beyond errors: measuring reliability for error-prone interaction devices.",
            "Anticipatory movement compatibility for virtual reality interaction devices.",
            "Increasing the geometric field of view in head mounted displays through proprioceptive task and multimodal feedback for effective close range interaction.",
            "The relationship between monochronicity, polychronicity and individual characteristics.",
            "Improved link analysis method for user interface design - modified link table and optimisation-based algorithm.",
            "Writing and Designing Manuals and Warnings.",
            "Perception of information security.",
            "The psychology of password management: a tradeoff between security and convenience.",
            "Individual attitude toward improvisation in information systems development.",
            "A structurational analysis of how course management systems are used in practice.",
            "What do computer science students think about software piracy?",
            "How employees' perception of information technology application and their knowledge management capacity influence organisational performance.",
            "Investigating the role of identity and gender in technology mediated learning.",
            "Distance learning success - a perspective from socio-technical systems theory.",
            "Book Review.",
            "Does government effort or citizen word-of-mouth determine e-Government service diffusion?",
            "Relationship of Metacognitive Monitoring with Interaction in an Asynchronous Online Discussion Forum.",
            "Editorial.",
            "Knowledge contribution in virtual communities: accounting for multiple dimensions of social presence through social identity.",
            "Knowledge retrieval through virtual communities of practice.",
            "Does virtual team composition matter? Trait and problem-solving configuration effects on team performance.",
            "Students and social networking sites: the posting paradox.",
            "Predicting continuance in online communities: model development and empirical test.",
            "The use of information and communication technology in the sea fishing industry.",
            "Cultural issues in developing E-Government in Malaysia.",
            "Building better government IT: understanding community beliefs and attitudes toward smart card technologies.",
            "Systems and applications.",
            "Exploring the evaluation framework of strategic information systems using repertory grid technique: a cognitive perspective from chief information officers.",
            "Stress training and simulator complexity: why sometimes more is less.",
            "A prototype Greek text to Greek Sign Language conversion system.",
            "Effects of communication style and time orientation on notification systems and anti-virus software.",
            "A benefit-cost perspective of the consumer adoption of the mobile banking system.",
            "Assessing the suitability of process and information technology in supporting tacit knowledge transfer.",
            "A reference level for assessing the acceptable visual demand of in-vehicle information systems.",
            "Trust in medical technology by patients and healthcare providers in obstetric work systems.",
            "Online communities.",
            "Understanding continuance intention of knowledge creation using extended expectation-confirmation theory: an empirical study of Taiwan and China online communities.",
            "Elementary students' participation style in synchronous online communication and collaboration.",
            "What makes online community members commit? A social exchange perspective.",
            "Validating the distinction between computer addiction and engagement: online game playing and personality.",
            "Modelling the acceptance of internet sites with domestic-violence information.",
            "Online shopping viewed from a habit and value perspective.",
            "Connection between customer emotions and relationship quality in online music services."
        ]
    },
    {
        "name": "BIT",
        "year": "2009",
        "info": "Volume 28: 2009",
        "count": 46,
        "papers": [
            "Editorial.",
            "Implementation of an electronic health records system in a small clinic: the viewpoint of clinic staff.",
            "A theoretical model of health information technology usage behaviour with implications for patient safety.",
            "General practitioners' understanding pertaining to reliability, interactive and usability components associated with health websites.",
            "The influence of a knowledge-based system on designers' cognitive activities: a study involving professional web designers.",
            "Graph theory application and web page ranking for website link structure improvement.",
            "Factor structure of content preparation for e-business web sites: results of a survey of 428 industrial employees in the People's Republic of China.",
            "Information structure and practice as facilitators of deaf users' navigation in textual websites.",
            "Usability evaluation.",
            "User certification of workplace software: assessing both artefact and usage.",
            "The theoretical foundation and validity of a component-based usability questionnaire.",
            "Comparing of feedback-collection and think-aloud methods in program comprehension studies.",
            "Scrutinising usability evaluation: does thinking aloud affect behaviour and mental workload?",
            "Multiple robot / single human interaction: effects on perceived workload.",
            "Usability.",
            "Comparison of different documentation styles for frameworks of object-oriented code.",
            "The emergence of object-oriented technology: the role of community.",
            "How to mitigate the significant negative influence of computer anxiety on ease of use perceptions.",
            "Design and evaluation of smart home user interface: effects of age, tasks and intelligence level.",
            "Effects of age, cognitive, and personal factors on PDA menu navigation performance.",
            "User interface evaluation of a multimedia CD-ROM for teaching minor skin surgery.",
            "Usability engineering laboratories: limitations and challenges toward a unifying tools/practices environment.",
            "Task-dependent processing of tables and graphs.",
            "Acceptance, emotion and behaviour.",
            "Exploring the emotional, aesthetic, and ergonomic facets of innovative product on fashion technology acceptance model.",
            "The effect of online store atmosphere on consumer's emotional responses - an experimental study of music and colour.",
            "Understanding consumer intention in online shopping: a respecification and validation of the DeLone and McLean model.",
            "Understanding customers' loyalty intentions towards online shopping: an integration of technology acceptance model and fairness theory.",
            "An empirical investigation of a modified technology acceptance model of IPTV.",
            "Modelling electronic customer relationship management success: functional and temporal considerations.",
            "The intention-behaviour gap in technology usage: the moderating role of attitude strength.",
            "Editorial.",
            "Virtual communities as a resource for the development of OSS projects: the case of Linux ports to embedded processors.",
            "Examination of cognitive absorption influencing the intention to use a virtual community.",
            "Determinants of success for online communities: an analysis of three communities in terms of members' perceived professional development.",
            "Gender differences in website production and preference aesthetics: preliminary implications for ICT in education and beyond.",
            "Understanding user interface needs of e-commerce web sites.",
            "A user study of accessing web applications via voice cellular phone: a model comparison approach.",
            "Features and predictors of problematic internet use in Chinese college students.",
            "Editorial.",
            "Behaviour modelling, instruction and exploration training approaches in group and individual contexts.",
            "Action-oriented classification of families' information and communication actions: exploring mothers' viewpoints.",
            "An efficient approach for the maintenance of user behaviours.",
            "Effect of trust level on mobile banking satisfaction: a multi-group analysis of information system success instruments.",
            "The amplification effects of procedural justice on a threat control model of information systems security behaviours.",
            "Information systems 'in the wild': supporting activity in the world."
        ]
    },
    {
        "name": "BIT",
        "year": "2008",
        "info": "Volume 27: 2008",
        "count": 51,
        "papers": [
            "Editorial.",
            "Comparing the effects of website quality on customer initial purchase and continued purchase at e-commerce websites.",
            "Effect of indirect information on system trust and control allocation.",
            "Exploring anchoring effect and the moderating role of repeated anchor in electronic commerce.",
            "Content preparation for cross-cultural e-commerce: a review and a model.",
            "Critical purchasing incidents in e-business.",
            "Managing readiness in enterprise systems-driven organizational change.",
            "Development and validation of a computer expertise questionnaire for older adults.",
            "You are never alone with a computer - Social issues.",
            "Structural reproduction of social networks in computer-mediated communication forums.",
            "How do different types of intragroup conflict affect group potency in virtual compared with face-to-face teams? A longitudinal study.",
            "Factors affecting members' trust belief and behaviour intention in virtual communities.",
            "Bridging the gap between students and computers: supporting activity awareness for network collaborative learning with GSM network.",
            "Exploring computer-based multilingual negotiation support for English - Chinese dyads: can we negotiate in our native languages?",
            "Factors influencing feature usage in work-related communication.",
            "Beliefs about the social roles and capabilities of computing technology: development of the computing technology continuum of perspective.",
            "The top 10 greatest screen legends and what their definitive roles demonstrate about management and organizational behaviour.",
            "Editorial.",
            "Evaluating websites for older adults: adherence to 'senior-friendly' guidelines and end-user performance.",
            "Continued use of a Chinese online portal: an empirical study.",
            "Back vs. stack: training the correct mental model affects web browsing.",
            "Understanding individual investor's behavior with financial information disclosed on the web sites.",
            "Online privacy control via anonymity and pseudonym: Cross-cultural implications.",
            "Lost in translation: investigating the ambiguity of availability cues in an online media space.",
            "Comparative usability evaluation (CUE-4).",
            "History of WWDU Conferences - A personal view.",
            "Good computing systems for everyone - how on earth? Cultural aspects.",
            "Usability and interaction design - new challenges for the Scandinavian tradition.",
            "Case study: integrating usability activities in a software development process.",
            "A case study of three software projects: can software developers anticipate the usability problems in their software?",
            "Visual cognitive performance of elderly people: effects on reading time of age, character size and visual distance.",
            "Foundations of an age-differentiated adaptation of the human-computer interface.",
            "Development and validation of a computer expertise questionnaire for older adults.",
            "Cultural influences on the comprehensibility of icons in mobile-computer interaction.",
            "Learning to interact with a computer by gaze.",
            "Use of information and communication technology to supply health-care services to nomadic patients: An explorative survey.",
            "Editorial.",
            "Effective advertising on mobile phones: a literature review and presentation of results from 53 case studies.",
            "The effects of information quality of mobile information services on user satisfaction and service acceptance-empirical evidence from Finland.",
            "Directional bias in scrolling tasks: a study of users' scrolling behaviour using a mobile text-entry strategy.",
            "Do video clips add more value than audio clips? Presenting industrial research and development results using multimedia.",
            "User developed application success: sources and effects of involvement.",
            "Making the law accessible to non-lawyers: effects of different kinds of expertise on perceived usability of online legal information services.",
            "Adaptively shortened pull down menus: location knowledge and selection efficiency.",
            "Keeping our network safe: a model of online protection behaviour.",
            "Editorial.",
            "Effective user involvement in product development by improving the analysis of user needs.",
            "Towards an account of intuitiveness.",
            "Measuring success of electronic trading in the insurance industry: operationalising the disconfirmation of expectations paradigm.",
            "A technological acceptance of e-learning tools used in practical and laboratory teaching, according to the European higher education area.",
            "Detrimental effects of earphone conversation on auditory environmental monitoring of visually impaired people."
        ]
    },
    {
        "name": "BIT",
        "year": "2007",
        "info": "Volume 26: 2007",
        "count": 49,
        "papers": [
            "Supporting community-based learning: case study of a geographical community organization designing its website.",
            "Fostering an informal learning community of computer technologies at school.",
            "Implementing virtual collaborative inquiry practises in a middle-school context.",
            "Learning in asynchronous discussion groups: a multilevel approach to study the influence of student, group and task characteristics.",
            "Facilitating asynchronous discussions in learning communities: the impact of moderation strategies.",
            "Reality is our laboratory: communities of practice in applied computer science.",
            "Editorial.",
            "A study into the effects of personality type and methodology on cohesion in software engineering teams.",
            "Information systems security and human behaviour.",
            "End-user adoption of animated interface agentsin everyday work applications.",
            "Predicting effectiveness of children participants in user testing based on personality characteristics.",
            "A survey of what customers want in a cell phone design.",
            "Constructing Chinese characters: keypad design for mobile phones.",
            "Using Hollywood's greatest film scenes to illustrate concepts of organisational behaviour and management.",
            "Never apologise, never explain.",
            "Website task performance by older adults.",
            "Natural language interface for information management on mobile devices.",
            "An approach for designing composite metaphors for user interfaces.",
            "Evaluating the behaviour of information systems developers: the relevance and utility of paradigms.",
            "A theory of personalisation of appearance: quantitative evaluation of qualitatively derived data.",
            "Improving the match between callers and receivers: A study on the effect of contextual information on cell phone interruptions.",
            "Colour induction on computer displays - adjacency and shape effects.",
            "Supporting intergenerational groups in computer-supported cooperative work (CSCW).",
            "How older people account for their experiences with interactive technology.",
            "Embracing ambiguity in the design of non-stigmatizing digital technology for social interaction among senior citizens.",
            "Now what was that password again? A more flexible way of identifying and authenticating our seniors.",
            "Forum Theatre as a requirements gathering methodology in the design of a home telecommunication system for older adults.",
            "Interface design and engagement with older people.",
            "Methods for human - computer interaction research with older people.",
            "New forms of organisation and communication.",
            "The effects from technology-mediated interaction and openness in virtual team performance measures.",
            "Employees' attitudes towards Telecommuting. An empirical investigation in the Egyptian Governorate of Dakahlia.",
            "The role of presence awareness in organizational communication: An exploratory field experiment.",
            "Unintended consequences of computer-mediated communications.",
            "Application of TPB to punctuation usage in instant messaging.",
            "Voting with their seats: computer laboratory design and the casual user.",
            "Analyses of user rationality and system learnability: performing task variants in user tests.",
            "Organizational software piracy: an empirical assessment.",
            "Editorial.",
            "Investigating the problems faced by older adults and people with disabilities in online environments.",
            "A comparative study of mobile map displays in a geographic orientation task.",
            "The impact of information technology on individual and firm marketing performance.",
            "User acceptance of context-aware services: self-efficacy, user innovativeness and perceived sensitivity on contextual pressure.",
            "Contextualising design: Aspects of using usability context analysis and hierarchical task analysis for software design.",
            "Online stickiness: its antecedents and effect on purchasing intention.",
            "Hidden menu options in automated human - computer telephone dialogues: dissonance in the user's mental model.",
            "Collegial verbalisation - a case study on a new method on information acquisition.",
            "DiTV and e-commerce among disadvantaged community groups.",
            "A course model implemented in a teacher's learning community context: issues of course assessment."
        ]
    },
    {
        "name": "BIT",
        "year": "2006",
        "info": "Volume 25: 2006",
        "count": 42,
        "papers": [
            "Editorial.",
            "Internationalisation of e-commerce: a comparison of online shopping preferences among Korean, Turkish and US populations.",
            "Exploring the influence of gender on the web usage via partial least squares.",
            "Work on the bridge - studies of officers on high-speed ferries.",
            "Accessibility of ATMS for the functionally illiterate through icon-based interfaces.",
            "Width guidelines for rectangular objects with penetrable and impenetrable borders.",
            "User experience - a research agenda.",
            "User interfaces and consumer perceptions of online stores: The role of telepresence.",
            "Attention web designers: You have 50 milliseconds to make a good first impression!",
            "Interdisciplinary criticism: analysing the experience of riot! a location-sensitive digital narrative.",
            "Using psychophysiological techniques to measure user experience with entertainment technologies.",
            "Affectemes and allaffects: a novel approach to coding user emotional expression during interactive experiences.",
            "Adding method to meaning: a technique for exploring peoples' experience with technology.",
            "Usability beyond the website: an empirically-grounded e-commerce evaluation instrument for the total customer experience.",
            "Editorial.",
            "Assessing the information environment in intensive care units.",
            "Modelling consumer intention to use gambling technologies: an innovative approach.",
            "A study of the suitability of videophones for psychometric assessment.",
            "Workplace user frustration with computers: an exploratory investigation of the causes and severity.",
            "A study of presentations of mobile web banners for location-based information and entertainment information websites.",
            "A survey of usability capability maturity models: implications for practice and research.",
            "Computers and accessibility.",
            "Representing coordination and non-coordination in American Sign Language animations.",
            "A user study on tactile graphic generation methods.",
            "An investigation of handheld device use by older adults with age-related macular degeneration.",
            "Evaluating non-speech sound visualizations for the deaf.",
            "Designing the user interface of the computer-based speech training system ARTUR based on early user tests.",
            "3D sound interactive environments for blind children problem solving skills.",
            "Editorial.",
            "Evaluating causes and consequences of turnover intention among IT workers: the development of a questionnaire survey.",
            "LTV model in consultant sector. Case study: mental health clinic.",
            "The effect of computer self-efficacy on enterprise resource planning usage.",
            "On keys' meanings and modes: the impact of different key solutions on children's efficiency using a mobile phone.",
            "Important context changes for talking and text messaging during homeward commutes.",
            "The influence of alarm timing on driver response to collision warning systems following system failure.",
            "Editorial.",
            "Improving deaf users' accessibility in hypertext information retrieval: are graphical interfaces useful for them?",
            "Measuring task-specific perceptions of the world wide web.",
            "Determinants of success for online communities: an empirical study.",
            "Creating names for retrieval by self and others.",
            "To buy or not to buy online: adopters and non-adopters of online shopping in Singapore.",
            "Iterative process of design and evaluation of icons for interactive TV menu."
        ]
    },
    {
        "name": "BIT",
        "year": "2005",
        "info": "Volume 24: 2005",
        "count": 39,
        "papers": [
            "How can we best use landmarks to support older people in navigation?",
            "Understanding and modelling built environments for mobile guide interface design.",
            "User acceptance of location-aware mobile guides based on seven field studies.",
            "Evaluating the usability of a mobile guide: the influence of location, participants and resources.",
            "The impact of interface metaphor and context of use on the usability of a speech-based mobile city guide service.",
            "Editorial.",
            "Effect of display factors on Chinese reading times, comprehension scores and preferences.",
            "Individual differences in hypertext browsing strategies.",
            "Determinant elements of customer relationship management in e-business.",
            "Mobile phones and the evolution of social behaviour.",
            "A learning process in email use - a longitudinal case study of the interaction between organization and technology.",
            "Mental models and online consumer behaviour.",
            "Social presence in distributed group environments: the role of social identity.",
            "Editorial.",
            "Image pre-compensation to facilitate computer access for users with refractive errors.",
            "Understanding users with Diabetic Retinopathy: factors that affect performance in a menu selection task.",
            "Integrated text entry from power wheelchairs.",
            "A submovement analysis of cursor trajectories.",
            "Speech-based cursor control using grids: modelling performance and comparisons with other solutions.",
            "Achieving a more usable World Wide Web.",
            "Editorial.",
            "Attitudes to and factors affecting unauthorized copying of computer software in Finland.",
            "Perceived security determinants in e-commerce among Turkish university students.",
            "A flick in the right direction: a case study of gestural input.",
            "Evaluation on a keystroke authentication system by keying force incorporated with temporal characteristics of keystroke dynamics.",
            "A hybrid technology acceptance approach for exploring e-CRM adoption in organizations.",
            "Tailoring by integration of domain-specific components: the case of a document search tool.",
            "TouchGrid: Touchpad pointing by recursively mapping taps to smaller display regions.",
            "The sound of silence: The case of virtual team organising.",
            "Polite computing.",
            "Effects of the rate of computer-mediated speech on emotion-related subjective and physiological responses.",
            "How older adults meet complexity: Aging effects on the usability of different mobile phones.",
            "Information systems management: role of planning, alignment and leadership.",
            "Preamble.",
            "A retrospective look at website accessibility over time.",
            "Empirical validation of the Windows® accessibility settings and multimodal feedback for a menu selection task for users with Diabetic Retinopathy.",
            "Development of computer-supported collaborative social networks in a distributed learning community.",
            "Usage and user experience of communication before and during rendezvous.",
            "Are expert users always better searchers? Interaction of expertise and semantic grouping in hypertext search tasks."
        ]
    },
    {
        "name": "BIT",
        "year": "2004",
        "info": "Volume 23: 2004",
        "count": 39,
        "papers": [
            "SlideBar: Analysis of a linear input device.",
            "Improving performance on procedural tasks through presentation of locational procedure context: an empirical evaluation.",
            "Denotation and connotation in the human - computer interface: The 'Save as ...' command.",
            "Why are mobile phones annoying?",
            "CRT monitors: Do they interfere with learning?",
            "Long-term working memory and interrupting messages in human - computer interaction.",
            "Comparative usability evaluation.",
            "Reading vertical text from a computer screen.",
            "Computerized feature systems for identifying suspects: empirical tests using crime scenarios.",
            "Empathy and online interpersonal trust: A fragile relationship.",
            "Loyalty to computer terminals: is it anthropomorphism or consistency?",
            "A modelling method for the development of groupware applications as socio-technical systems.",
            "Early use of Internet-based educational resources: effects on students' engagement modes and flow experience.",
            "Editorial.",
            "Guest Editorial: HCI studies in management information systems.",
            "A study on tolerable waiting time: how long are Web users willing to wait?",
            "Do size and structure matter to mobile users? An empirical study of the effects of screen size, information structure, and task complexity on user activities with standard web phones.",
            "The impact of web page text-background colour combinations on readability, retention, aesthetics and behavioural intention.",
            "Senior government executives' use of the internet: A Bruneian scenario.",
            "Adopters and non-adopters of internet stock trading in Singapore.",
            "Editorial.",
            "An empirical evaluation of textual display configurations for supervisory tasks.",
            "Consumer reactions toward clicks and bricks: investigating buying behaviour on-line and at stores.",
            "The effects of multimodal feedback on older adults' task performance given varying levels of computer experience.",
            "On-the-move destination entry for vehicle navigation systems: Unsafe by any means?",
            "The cognitive task analysis methods for job and task design: review and reappraisal.",
            "Hearing only one side of normal and mobile phone conversations.",
            "CASSM and cognitive walkthrough: usability issues with ticket vending machines.",
            "The acceptance of a computerised decision-support system in primary care: A preliminary investigation.",
            "Are electronic medical records associated with improved perceptions of the quality of medical records, working conditions, or quality of working life?",
            "Architectural criteria for website evaluation - conceptual framework and empirical validation.",
            "Predicting electronic service continuance with a decomposed theory of planned behaviour.",
            "Editorial.",
            "How physical text layout affects reading from screen.",
            "Computer self-efficacy in an ongoing use context.",
            "Internet privacy concerns and their antecedents - measurement validity and a regression model.",
            "Using Hollywood one-liners to illustrate the communication process: an interactive approach.",
            "The speed of mouse-click as a measure of anxiety during human-computer interaction.",
            "Using 3D sound as a navigational aid in virtual environments."
        ]
    },
    {
        "name": "BIT",
        "year": "2003",
        "info": "Volume 22: 2003",
        "count": 34,
        "papers": [
            "User involvement: a review of the benefits and challenges.",
            "Impacts of GSS generic structures and task types on group communication process and outcome: some expected and unexpected research findings.",
            "Legitimate by design: towards trusted socio-technical systems.",
            "An investigation of volitional control in information ethics.",
            "An exploratory study of moral intensity regarding software piracy of students in Thailand.",
            "Graphical Web directory for Web search.",
            "A framework for reuse of user experience in Web browsing.",
            "Organizing for remote consultations in health care?-?the production process.",
            "Measuring the adaptability of universal accessible systems.",
            "Identifying managers who need ethics training in using IT at work.",
            "Trends in the use of verbal protocol analysis in software engineering research.",
            "An observation of adults with visual impairments carrying out copy-typing tasks.",
            "The effect of language inconsistency on performance and satisfaction in using the Web: results from three experiments.",
            "Usability in online shops: scale construction, validation and the influence on the buyers' intention and decision.",
            "Decision support in fighter aircraft: from expert systems to cognitive modelling.",
            "Comparison of 2D and 3D representations for visualising telecommunication usage.",
            "Small group decision-making in face-to-face and computer-mediated environments: the role of personality.",
            "Age differences in the performance of hypertext perusal as a function of text topology.",
            "Blending scenarios of use and informal argumentation to facilitate universal access: experience with the Universal Access Assessment Workshop method.",
            "How the Web is used to support collaborative writing.",
            "Effects of organizational context and inter-group behaviour on the success of strategic information systems planning: an empirical study.",
            "Adoption of the Internet and WAP-enabled phones in Singapore.",
            "Organisational databases of personnel information: contrasting the concerns of human resource managers and employees.",
            "Motivating creativity through a computer-mediated employee suggestion management system.",
            "Cognitive, physical, sensory, and functional affordances in interaction design.",
            "Retrospective vs. concurrent think-aloud protocols: testing the usability of an online library catalogue.",
            "Layout attributes and recall.",
            "Measurement of information processing load and visual load on a dynamic information processing task.",
            "Work environment and computer systems development.",
            "Health effects of 'the Paperless Office' - evaluations of the introduction of electronic document handling systems.",
            "Key principles for user-centred systems design.",
            "Addressing users' health issues in software development - an exploratory study.",
            "As easy as pie.",
            "Filters on computer displays - effects on legibility, performance and comfort."
        ]
    },
    {
        "name": "BIT",
        "year": "2002",
        "info": "Volume 21: 2002",
        "count": 43,
        "papers": [
            "The expanding telephone number Part 1: Keying briefly presented multiple-digit numbers.",
            "The expanding telephone number Part 2: Age variations in immediate memory for multiple-digit numbers.",
            "Clinical acceptance of a low-cost portable system for postural assessment.",
            "SODPM: a sequence-oriented decision process model for unstructured group decision problems.",
            "Determinants of academic use of the Internet: a structural equation model.",
            "Examining children's reading performance and preference for different computer-displayed text.",
            "The limits of shape constancy: point-to-point mapping of perspective projections of flat figures.",
            "Effects of the transition to a client-centred team organization in administrative surveying work.",
            "An experimental evaluation of comprehensibility aspects of knowledge structures derived through induction techniques: a case study of industrial fault diagnosis.",
            "Effectiveness of user testing and heuristic evaluation as a function of performance classification.",
            "Development and validation of user-adaptive navigation and information retrieval tools for an intranet portal organizational memory information system.",
            "Editorial.",
            "New type of standard for accessibility, designed to foster the competition and innovation of designers, developers, and project and business management.",
            "Automated telephone answering systems and aging.",
            "Critical design factors for successful e-commerce systems.",
            "Expandable indexes vs. sequential menus for searching hierarchies on the World Wide Web.",
            "Technology adoption as process: a case of integrating an information-intensive website into a patient education helpline.",
            "A UK study into the potential effects of virtual education: does online learning spell an end for on-campus learning?",
            "Book review.",
            "The effects of adverse condition warning system characteristics on driver performance: an investigation of alarm signal type and threshold level.",
            "Human factors in the design of a personalizable EPG: preference-indication strategies, habit watching and trust.",
            "Attitudes toward online shopping and the Internet.",
            "Do older adults underestimate their actual computer knowledge?",
            "Effects of transition to an integrated IT technology in surveying work.",
            "Impact of national culture on information technology usage behaviour: an exploratory study of decision making in Korea and the USA.",
            "The influence of user expertise and phone complexity on performance, ease of use and learnability of different mobile phones.",
            "Visibility and characteristics of the mobile phones for elderly people.",
            "Using mouse and keyboard under time pressure: preference, strategies and learning.",
            "User centred design for a digital welding machine.",
            "Requirements for community support systems - modularization, integration and ubiquitous user interfaces.",
            "User-friendly visualization of object versions and archives in collaborative computer work.",
            "Designing a dynamic system traffic control of a freight railway.",
            "The development of driver assistance systems following usability criteria.",
            "Requirements for software-support in concurrent engineering teams.",
            "SWOF - an open framework for shared workspaces to support different cooperation tasks.",
            "Describing functional requirements for knowledge sharing communities.",
            "Virtual communities - a virtual session on virtual conferences.",
            "Editorial.",
            "Shopping behaviour and preferences in e-commerce of Turkish and American university students: implications from cross-cultural design.",
            "Impact of website information design factors on consumer ratings of web-based auction sites.",
            "DEVAN: a tool for detailed video analysis of user test data.",
            "Shifting knowledge from analysis to design: requirements for contextual user interface development.",
            "The use of computers among the workers in the European Union and its impact on the quality of work."
        ]
    },
    {
        "name": "BIT",
        "year": "2001",
        "info": "Volume 20: 2001",
        "count": 44,
        "papers": [
            "Relaxing the homogeneity assumption in usability testing.",
            "Age differences in the performance of information retrieval tasks.",
            "The role of age, foreknowledge and complexity in learning to operate a complex device.",
            "Navigational issues in the design of online self-administered questionnaires.",
            "Design and evaluation of online multimedia maintenance manuals.",
            "Equation entry and editing via handwriting and gesture recognition.",
            "Harnessing knowledge workers' participation for IT planning effectiveness: the informational and motivational mediating effects of users' microplanning behaviour.",
            "Five years' experience from CID: an interdisciplinary competence centre for design of usable interactive IT applications.",
            "Shared 3-D workplace exhibitions as sites for community meetings.",
            "VideoCafé - exploring mediaspaces in public places within organizations.",
            "Meetings in a distributed group of experts: comparing face-to-face, chat and collaborative virtual environments.",
            "KidStory: a technology design partnership with children.",
            "Crossing the line: a field study of inhabited television.",
            "Printing and screen reading in the medical school curriculum: Guttenberg vs. the cathode ray tube.",
            "Visual search and preferences concerning different types of guidance displays.",
            "The role of visual search in the design of effective soft keyboards.",
            "User performance and attitude towards schemes for alphanumeric data entry using restricted input devices.",
            "Exploration strategies, performance, and error consequences when learning a complex computer task.",
            "Task analysis for knowledge descriptions (TAKD): a requiem for a method.",
            "Perception of job security in a process of technological change: its influence on psychological well-being.",
            "Technological coupling, job characteristics and operators' well-being as moderated by desirability of control.",
            "Optimizing the reading of electronic text using rapid serial visual presentation.",
            "Direct activation: a concept to encourage tailoring activities.",
            "Cognitive interference in computer anxiety.",
            "Development and validation of an Internet self-efficacy scale.",
            "Comparison between on- and off-campus behaviour and adaptability in online learning: a case from China.",
            "E-business: boom or gloom?",
            "A personal view.",
            "Community computing as human - computer interaction.",
            "The past recaptured: in search of lost paradigms.",
            "Changing perspectives on the organizational consequences of information technology.",
            "Usability and software architecture.",
            "Adaptively distributing cognition: a decision-making perspective on human - computer interaction.",
            "Sociability and usability in online communities: determining and measuring success.",
            "A personal perspective on behaviour and information technology: a 20-year progress and future trend.",
            "Universal usability as a stimulus to advanced interface design.",
            "Twenty years of telecommunications research in BIT.",
            "The running ergonomist; a permanent appearance?",
            "20 years in the life of a long-term empirical personal electronic filing study.",
            "An empirical investigation of the novice experience with soft keyboards.",
            "Virtual information space navigation: evaluating the use of head tracking.",
            "Displaying meta-information in context.",
            "How consistent is your web design?",
            "User-centred design does make a difference. The case of decision support systems in crop production."
        ]
    },
    {
        "name": "BIT",
        "year": "2000",
        "info": "Volume 19: 2000",
        "count": 40,
        "papers": [
            "A theoretical framework and empirical examination of the effects of foreign and translated interface language.",
            "Understanding the roles of signs and norms in organizations - a semiotic approach to information systems design.",
            "Prioritizing usability problems: Data-driven and judgement-driven severity estimates.",
            "Model mismatch analysis: Towards a deeper explanation of users' usability problems.",
            "The importance of task analysis in Usability Context Analysis - designing for fitness for purpose.",
            "An exploratory investigation of the antecedents and impact of internet usage: An individual perspective.",
            "Productivity prediction by extrapolation: Using workload memory as a predictor of target performance.",
            "Interacting with infotainment applications: Navigation patterns and mental models.",
            "Influences of general computer experience and age on library database search performance.",
            "Positive and negative aspects of the work of information technology personnel: An exploratory analysis.",
            "An ergonomics approach for work in the next millennium in an IT world.",
            "Knowledge architecture for the twenty-first century.",
            "Information technology and knowledge-based business development.",
            "Integrating working and enrichment approach learning: A document.",
            "Learning at work - a combination of experience based learning and theoretical education.",
            "Sharing engineering design knowledge in a distributed environment.",
            "Information technology levels, competence development and performance in Swedish small business enterprises.",
            "Influences of the 'social contract', technology and restructuring, and training on the supply and demand for skilled technology workers.",
            "Information technology and learning strategies in small enterprises.",
            "Competence via the web.",
            "Articulating collaboration in a learning community.",
            "Sociotechnical issues in the implementation of imaging technology.",
            "The artful use of groupware: An ethnographic study of how Lotus Notes is used in practice.",
            "How useful are strategic plans for information systems?",
            "Gender differences in internet usage and task preferences.",
            "Heart period variability as mental effort monitor in Human Computer Interaction.",
            "Do systems development methodologies and CASE tools decrease stress among systems analysts?",
            "Knowledge acquisition in ecological product design: The effects of computer-mediated communication and elicitation method.",
            "An experimental investigation of the impact of NSS and proximity on negotiation outcomes.",
            "The value of video in work at a distance: Addition or distraction?",
            "Building a perceptual visualization architecture.",
            "Aesthetics and preferences of web pages.",
            "Discrimination between design errors and user errors by binomial test.",
            "Exposure to information technology and its relation to burnout.",
            "Facilitating data exploration with query previews: A study of user performance and preference.",
            "Barriers and facilitators to the use of knowledge management systems.",
            "Evaluating the usability of virtual reality user interfaces.",
            "The effect of network delay and media on user perceptions of web resources.",
            "Effects of dialogue design on automatic teller machine (ATM) usability: Transaction times and card loss.",
            "Designing time at the user interface."
        ]
    },
    {
        "name": "BIT",
        "year": "1999",
        "info": "Volume 18: 1999",
        "count": 38,
        "papers": [
            "Reading and writing mathematics: The MAVIS1 Project.",
            "TGuide: A guidance system for tactile image exploration.",
            "Auditory navigation in hyperspace: Design and evaluation of a non-visual hypermedia system for blind users.",
            "A model of keyboard configuration requirements.",
            "Gestures and multimodal input.",
            "Toward the use of speech and natural language technology in intervention for a languagedisordered population.",
            "Automatic babble recognition for early detection of speech related disorders.",
            "The use of icons and labels in an end user application program: An empirical study of learning and retention.",
            "Navigational abilities in audial voice-controlled dialogue structures.",
            "Acceptance of the phone-based interface for automated call direction.",
            "Attitudes towards end-user computing: A structural equation model.",
            "Modelling cyclic interaction.",
            "Psychological research of computer-mediated communication in Russia.",
            "The IsoMetrics usability inventory: An operationalization of ISO 9241-10 supporting summative and formative evaluation of software systems.",
            "Correcting menu usability problems with sound.",
            "Group processes in solving two problems: Face-to-face and computer-mediated communication.",
            "Tailoring groupware for different scopes of validity.",
            "An empirical study of navigation aids in customer interfaces.",
            "Choosing electronic supermarket customers.",
            "Nationality as a factor in the use of information management technologies.",
            "Text entry using soft keyboards.",
            "Methods for defining user groups and user-adjusted information structures.",
            "Applying information technology to the presentation of emergency operating procedures: Implications for usability criteria.",
            "Attitudes, satisfaction and usage: Factors contributing to each in the acceptance of information technology.",
            "Computer self-efficacy, training effectiveness and user attitudes: An empirical study.",
            "Vagueness in models of socio-technical systems.",
            "Task modelling for cooperative work.",
            "Telecooperation in decentralized organizations: Conclusions based on empirical research.",
            "Teams without trust? Investigations in the influence of video-mediated communication on the origin of trust among cooperating persons.",
            "Real-time collaboration in design engineering: An expensive fantasy or affordable reality?",
            "Experiences with a cooperative design process in developing a telecooperation system for collaborative document production.",
            "Changing interpersonal communication through groupware use.",
            "User agreement with incorrect expert system advice.",
            "Development of a methodology for optimizing elicited knowledge.",
            "Usability aspects, socio-relational context and learning performance in the virtual classroom: A laboratory experiment.",
            "Redressing the anxiety imbalance: Computerphobia and educators.",
            "Involving users in the specification of functionality using scenarios and model-based evaluation.",
            "Designing menus for the Chinese population: Horizontal or vertical?"
        ]
    },
    {
        "name": "BIT",
        "year": "1998",
        "info": "Volume 17: 1998",
        "count": 36,
        "papers": [
            "Positioning HCI: Journals, descriptors and parent disciplines.",
            "Remote ultrasound using cooperative video: A field study.",
            "Visualization using colour: Visual presentation of events in particle physics.",
            "It's not really theft!: Personal and workplace ethics that enable software piracy.",
            "The consideration of organizational issues during the systems development process: An empirical analysis.",
            "The influence of time on error-detection.",
            "Implementing the directive for VDU work- the EU-state of the art.",
            "An experimental evaluation of preferences for data entry method in automated telephone services.",
            "The auditory AlphaWheel: A challenge to digit code representation of objects.",
            "Triangulation strategies in user requirements investigations: A case study on the development of an IT-mediated service.",
            "Leveraging information technology to achieve the IT2000 vision: The case study of an intelligent island.",
            "Development of a user-centred IT strategy: A case study.",
            "Improving the availability and cost-effectiveness of guidelines for guideline-users: Towards a structured approach.",
            "Using a bilingual group support system.",
            "End user dialogue context management of office automation systems.",
            "MOTHER: System for continuous capturing of display stream.",
            "Persuasiveness of expert systems.",
            "Computer-mediated communication and media preference: An investigation of the dimensionality of perceived task equivocality and media richness.",
            "Design issues in a semiotic description of user responses to three interfaces.",
            "Psychological factors in virtual classroom situations: A pilot study for a model of learning through technological devices.",
            "The effect of time pressure on expert system based training for emergency management.",
            "Designing information systems for maximum use in a dealing room environment.",
            "Analysing 'work' in complex system tasks: An exploratory study with GIS.",
            "Usability and database search at the Swedish Employment Service.",
            "On an experimental evaluation of claim analysis.",
            "On our case study of claims analysis and other usability evaluation methods.",
            "Viewing personal history records: A comparison of tabular format and graphical presentation using LifeLines.",
            "Integrating textual and pictorial information via pop-up windows: An experimental study.",
            "Assessing the usability of on-line library systems.",
            "Understanding sources of user variability in computer-based data entry performance.",
            "The effects of delay on the performance of computerized feature systems for identifying suspects.",
            "Participating informally: Opportunities and dilemmas in user-driven design.",
            "Effectiveness of expert semantic knowledge as a navigational aid within hypertext.",
            "A situated cognition view about the effects of planning and authorship on computer program debugging.",
            "Representation still matters: Cognitive engineering and user interface design.",
            "Predicting the use and effectiveness of an office automation system (OAS): A case study."
        ]
    },
    {
        "name": "BIT",
        "year": "1997",
        "info": "Volume 16: 1997",
        "count": 28,
        "papers": [
            "An interview study of 'continuous' implementations of information technology.",
            "The evaluation of an information system for intensive care.",
            "Style guides and their application: The case of Microsoft 'Windows' and a remote tutoring environment.",
            "Evaluating and improving the usability of a user manual.",
            "Graphing small data sets: Should we bother?",
            "Reading music from screens vs paper.",
            "Spoken help for a car stereo: An exploratory study.",
            "In-vehicle intelligent information technologies as safety benefit systems: Consideration of philosophy and function.",
            "Trade-off decision making in user interface design.",
            "Determinants of user participation: A Finnish survey.",
            "Public attitudes toward voice-based electronic messaging technologies in the United States: A national survey of opinions about voice response units and telephone answering machines.",
            "An analysis of the use of natural language processing systems in business.",
            "Empirical assessment of individuals' 'personal information management systems'.",
            "A design-oriented framework for modelling the planning and control of multiple task work in secretarial office administration.",
            "Tracking the effectiveness of usability evaluation methods.",
            "A planning aid for human factors evaluation practice.",
            "Ergonomic criteria for evaluating the ergonomic quality of interactive systems.",
            "Software evaluation using the 9241 evaluator.",
            "Comparison of evaluation methods using structured usability problem reports.",
            "A proposed index of usability: A method for comparing the relative usability of different software systems.",
            "The MUSiC performance measurement method.",
            "The role of working memory on graphical information processing.",
            "Age differences in reactions to errors in computer-based work.",
            "Responses to comprehension questions and verbal protocols as measures of computer program comprehension processes.",
            "The importance of the number of degrees of freedom for rotation of objects.",
            "Applying the AHP approach to evaluate human sensitivity to chromatic light.",
            "Software development: Some critical views.",
            "Boosting trainees' expectations of success through knowledge of performance norms."
        ]
    },
    {
        "name": "BIT",
        "year": "1996",
        "info": "Volume 15: 1996",
        "count": 31,
        "papers": [
            "A sociotechnical approach to smart card systems design: An Australian case study.",
            "Auditor evidence evaluation: Expert systems as credible sources.",
            "A model of group satisfaction in computer-mediated communication and face-to-face meetings.",
            "Deixis and points of view in media spaces: An empirical gesture.",
            "Experimental evaluation of dialogue styles for hybrid telephone-based interfaces.",
            "Slow and steady wins the race? Three-year-old children and pointing device use.",
            "User involvement in the early stages of the development of an aircraft warning system.",
            "The role of users in interactive systems design: When computers are theatre, do we want the audience to write the script?",
            "Pull-down versus traditional menu types: An empirical comparison.",
            "The use or misuse of three-dimensional graphs to represent lower-dimensional data.",
            "Teaching human- computer interaction in context: An illustrative lesson on windows.",
            "Identifying decision maker's preferences through a prototype based inductive learning method: A medical case study.",
            "Assessing user interfaces for diverse user groups: Evaluation strategies and defining characteristics.",
            "An objective approach to exploring skill differences in strategies of computer program comprehension.",
            "Towards the development of classes of interaction: Initial illustration with reference to off-load planning.",
            "Stress, control and computer system design: A psychophysiological field study.",
            "A modest experiment in the usefulness of electronic archives.",
            "Implicit knowledge and fault diagnosis in the control of advanced manufacturing technology.",
            "Planning and knowledge about strategies: Their relationship to work characteristics in software design.",
            "Don't underestimate the problems of user centredness in software development projectsthere are many!",
            "Software development: Knowledge-intensive work organizations.",
            "Scenarios for system development: Matching context and strategy.",
            "Becoming social: Expanding scenario-based approaches in HCI.",
            "Knowledge-based systems from a socio-cognitive 1 perspective.",
            "Complexity of user interfaces: Can it be reduced by a mode key?",
            "One size fits all- or does it?",
            "An attributional explanation of individual resistance to the introduction of information technologies in the workplace.",
            "An attributional explanation of individual resistance to the introduction of information technologies in the workplace.",
            "Reducing conflicts in groupware: Metafunctions and their empirical evaluation.",
            "Information administrative support of decision processes in organizations.",
            "User involvement in the systems design process-a practical guide for users."
        ]
    },
    {
        "name": "BIT",
        "year": "1995",
        "info": "Volume 14: 1995",
        "count": 37,
        "papers": [
            "Editorial.",
            "The retrieval of images from image databases: trademarks.",
            "A comparison of mouse and speech input control of a text-annotation system.",
            "Occupational differences in computer-related anxiety: implications for the implementation of a computerized patient management information system.",
            "Effect of job demands and social support on worker stress: a study of VDT users.",
            "Dialogue modelling of graphical user interfaces with a production system.",
            "Programmable applications: exploring the potential for language/interface symbiosis.",
            "Editorial.",
            "Multiple multimodal mentors: delivering computer-based instruction via specialized anthropomorphic advisors.",
            "Breakdowns in writing intentions when simultaneously deploying SGML-marked texts in hard copy and electronic copy.",
            "The influence of design decisions on the usability of direct manipulation user interfaces.",
            "Issues in training older adults to use computers.",
            "Design and validation of knowledge acquisition tools in a business domain.",
            "Editorial.",
            "A comparison of display methods for spatial point layout.",
            "Negotiability: a metafunction to tailor access to data in groupware.",
            "The effect of a database feedback system on user performance.",
            "A structural equation model of job performance using a computer-based order entry system.",
            "Impact of cognitive abilities of experts on the effectiveness of elicited knowledge.",
            "Network politics in an educational organization.",
            "Editorial.",
            "Appropriateness of communications media use in organizations: situation requirements and media characteristics.",
            "Graphical versus character-based word processors: an analysis of user performance.",
            "Discretionary use of personal computers by knowledge workers: testing of a social psychology theoretical model.",
            "Anthropocentrism and computers.",
            "Spatial metaphors and disorientation in hypertext browsing.",
            "The Cockpit Metaphor.",
            "Live, audio-visual communication systems for distance learning: experience, heuristics, and ISDN.",
            "Excellent software professionals: experience, work activities, and perception by peers.",
            "Response effects and computer-administered questionnaires: the role of the entry task and previous computer experience.",
            "Age and cognitive ability as predictors of computerized information retrieval.",
            "Editorial.",
            "Individual and organizational influences on voice mail use and evaluation.",
            "Comprehending user behaviour using psycholinguistics.",
            "Private Camera Conversation: a new method for eliciting user responses?",
            "The Singapore Government's role in national computerization efforts.",
            "Theoretical upper and lower bounds on typing speed using a stylus and a soft keyboard."
        ]
    },
    {
        "name": "BIT",
        "year": "1994",
        "info": "Volume 13: 1994",
        "count": 39,
        "papers": [
            "Editorial.",
            "Usability laboratories.",
            "Smoke and mirrors: setting the stage for a successful usability test.",
            "Comparative usability measurement: the role of the usability lab in PC Magazine UK and PC/ Computing.",
            "Designing a usability lab: a case study from Taligent.",
            "The usability engineering laboratories at Sun Microsystems.",
            "Care and feeding of the usability laboratory at Symantec Corporation: a survival guide.",
            "The ergonomics lab: a practical approach.",
            "The cobbler's children: usability in the lab.",
            "Bellcore's user-centred-design support centre.",
            "Ameritech's usability laboratory: from prototype to final design.",
            "Designing and equipping a usability laboratory.",
            "A practical guide to using software usability labs: lessons learned at IBM.",
            "Usability testing - on a budget: a NASA usability test case study.",
            "Usability laboratories at Philips: supporting research, development, and design for consumer and professional products.",
            "Breaking away from the conventional 'usability lab': the Customer-Centered Design Group at Tektronix, Inc.",
            "Usability measurement in context.",
            "Using the usability laboratory: BT's experiences.",
            "Preventing user interface disasters.",
            "Designing and using integrated data collection and analysis tools: challenges and considerations.",
            "Understanding the applicability of sequential data analysis techniques for analysing usability data.",
            "Are we overlooking some usability testing methods? A comparison of lab, beta, and forum tests.",
            "Usability testing in a competive market: lessons learned.",
            "Analysing and evaluating multi-actor multi-goal systems in use: social contexts and participation in three Vocational Guidance Systems (VGS).",
            "A management strategy for innovation and organizational design: the case of MRP2/JIT production management systems.",
            "The impact of interface-induced handling requirements on action generation in technical system control.",
            "Decision-making using computer conferencing: a case study.",
            "Towards real-time GOMS: a model of expert behaviour in a highly interactive task.",
            "Information technology and self managing work groups.",
            "A blackboard framework for the design of group decision support Systems.",
            "Organizational and behavioural issues raised by intelligent argumentation systems.",
            "Do human factors experts accept the ISO 9241 Part 10 - Dialogue Principle - standard?",
            "Measuring the quality of computer-mediated communication.",
            "The perception and measurement of contrast: the influence of gaps between display elements.",
            "Effects of output display and control - display gain on human performance in interactive systems.",
            "Implementing expert systems technology: a corporate-wide approach.",
            "The respective roles of perceived usefulness and perceived fun in the acceptance of microcomputer technology.",
            "Using predictors to partition menu selection times.",
            "Performance effects of reduced proprioceptive feedback on touch typists and casual users in a typing task."
        ]
    },
    {
        "name": "BIT",
        "year": "1993",
        "info": "Volume 12: 1993",
        "count": 40,
        "papers": [
            "Simplifying graphics-based data: applying the fisheye lens viewing strategy.",
            "Investigating touchscreen typing: the effect of keyboard size on typing speed.",
            "Status conspicuity, peripheral vision, and text editing.",
            "The effects of feedback on performance and retention of skill for a natural language interface.",
            "Combining natural language with direct manipulation: the conceptual framework for a hybrid human-computer interface.",
            "Electronic point of sale scanning in multiple food retailing: a rebuttal to 'Scanning in the supermarket: for better or worse?",
            "Editorial.",
            "Human-computer interaction research agendas.",
            "Interaction styles and input/output devices.",
            "Research directions for user interface software tools.",
            "User interface development processes and methodologies.",
            "Computer-supported co-operative work: research issues for the 90s.",
            "Building HCI partnerships and infrastructure.",
            "Editorial.",
            "Evaluation of user interfaces: EVADIS II - a comprehensive evaluation approach.",
            "Sleuthing in HyperHolmes : aTM an evaluation of using hypertext vs. a book to answer questions.",
            "Computer assistance in design engineering.",
            "Visual search in modern human-computer interfaces.",
            "Solutioneering in user interface design.",
            "Can information technology improve the quality of democracy?",
            "Editorial.",
            "Computer communication as an aid to independence for older adults.",
            "Sound effects as an interface element for older users.",
            "Executive support systems in strategic environmental information processing.",
            "A transaction cost view of decision support systems.",
            "Decision-making in management information systems research: the utility of policy capturing methodology.",
            "An instrument for the measurement of the visual quality of displays.",
            "Editorial.",
            "Social systems that marginalize the psychological and organizational aspects of information technology.",
            "Social and psychological aspects of computer-aided design systems.",
            "Social isolation and integration in electronic environments.",
            "Computer user training and attitudes: a study of business undergraduates.",
            "Effects of hedonic components and user's gender on the acceptance of screen-based information services.",
            "Expertise transfer, knowledge elicitation, and delayed recall in a design context.",
            "Editorial.",
            "The history and future of direct manipulation.",
            "Short term memory demands in processing synthetic speech by old and young adults.",
            "Future assessment by metaphors.",
            "Nine- to fourteen-year-old children's conception of computers using drawings.",
            "External power frequency magnetic field-induced jitter on computer monitors."
        ]
    }
]