[
    {
        "name": "Computer Supported Cooperative Work",
        "year": "2022",
        "info": "Volume 31, 2022",
        "count": 4,
        "papers": [
            "Crowdsourcing historical photographs: autonomy and control at the Copenhagen City Archives.",
            "Regional Differences in Information Privacy Concerns After the Facebook-Cambridge Analytica Data Scandal.",
            "Examining Co-Owners' Privacy Consideration in Collaborative Photo Sharing.",
            "Inverted Hierarchies on the Shop Floor: The Organisational Layer of Workarounds for Collaboration in the Metal Industry."
        ]
    },
    {
        "name": "Computer Supported Cooperative Work",
        "year": "2021",
        "info": "Volume 30, 2021",
        "count": 25,
        "papers": [
            "Care Managers and Role Ambiguity: The Challenges of Supporting the Mental Health Needs of Patients with Chronic Conditions.",
            "How Potential New Members Approach an Online Community.",
            "Brokerbot: A Cryptocurrency Chatbot in the Social-technical Gap of Trust.",
            "shARe-IT: Ad hoc Remote Troubleshooting through Augmented Reality.",
            "Studies of Work 'in the Wild'.",
            "Ethnography, CSCW and Ethnomethodology.",
            "Observing Inequality: Can Ergonomic Observations Help Interventions Transform the Role of Gender in Work Activity?",
            "A Historical View of Studies of Women's Work.",
            "Context-based Automated Responses of Unavailability in Mobile Messaging.",
            "Immersive Cooperative Work Environments (CWE): Designing Human-Building Interaction in Virtual Reality.",
            "Tensions in Representing Behavioral Data in an Electronic Health Record.",
            "Disruptive online communication: How asymmetric trolling-like response strategies steer conversation off the track.",
            "Encoding Collective Knowledge, Instructing Data Reusers: The Collaborative Fixation of a Digital Scientific Data Set.",
            "Participatory Design as the Temporal Flow of Coalescing Participatory Lines.",
            "The Automation of the Taxi Industry - Taxi Drivers' Expectations and Attitudes Towards the Future of their Work.",
            "Understanding Matchmakers' Experiences, Principles and Practices of Assembling Innovation Teams.",
            "Materializing activism.",
            "Technology for Activism: Toward a Relational Framework.",
            "Organizing Safe Spaces: #MeToo Activism in Sweden.",
            "Hybrid Framing in the Justice for Antwon Rose II Movement.",
            "Assembling Amazon Fires through English Hashtags. Materializing Environmental Activism within Twitter Networks.",
            "Make a Difference in a Different Way: Twitter Bot Creators and Wikipedia Transparency.",
            "Research with a Solidarity Clinic: Design Implications for CSCW Healthcare Service Design.",
            "Disclose to Tell: a Data Design Framework for Alternative Narratives.",
            "Future Protest Made Risky: Examining Social Media Based Civil Unrest Prediction Research and Products."
        ]
    },
    {
        "name": "Computer Supported Cooperative Work",
        "year": "2020",
        "info": "Volume 29, 2020",
        "count": 26,
        "papers": [
            "Making Sense of Enterprise Apps in Everyday Work Practices.",
            "Technologies for Enhancing Collocated Social Interaction: Review of Design Solutions and Approaches.",
            "Simulations at Work - a Framework for Configuring Simulation Fidelity with Training Objectives.",
            "Infrastructuring and Participatory Design: Exploring Infrastructural Inversion as Analytic, Empirical and Generative.",
            "Platformic Management, Boundary Resources for Gig Work, and Worker Autonomy.",
            "Accountability on the Fly - Accounting for Trouble in Space Operations.",
            "The Unbearable Modernity of Mobile Money.",
            "Privacy in Crowdsourcing: a Review of the Threats and Challenges.",
            "The Role of Discretion in the Age of Automation.",
            "Coordinative Entities: Forms of Organizing in Data Intensive Science.",
            "Introduction to the Special Issue on 'Information Infrastructures in Healthcare: Governance, Quality Improvement and Service Efficiency'.",
            "Informating Hospital Workflow Coordination.",
            "A Socio-Temporal Perspective on Pilot Implementation: Bootstrapping Preventive Care.",
            "Infrastructuring as an Occasion for Resistance: Organized Resistance to Policy-Driven Information Infrastructure Development in the U.S. Healthcare Industry.",
            "A Worker-Driven Common Information Space: Interventions into a Digital Future.",
            "Infrastructuring Public Consultation in Town Planning - How Town Planners Translate Public Consultation into a Socio-Technical Support System.",
            "Changing Categorical Work in Healthcare: the Use of Patient-Generated Health Data in Cancer Rehabilitation.",
            "Achieving Accuracy through Ambiguity: the Interactivity of Risk Communication in Severe Weather Events.",
            "Correction to: Co-Creating Platform Governance Models Using Boundary Resources: a Case Study from Dementia Care Services.",
            "Introducing 'ECSCW Contributions'.",
            "Coding and Classifying Knowledge Exchange on Social Media: a Comparative Analysis of the #Twitterstorians and AskHistorians Communities.",
            "When the System Does Not Fit: Coping Strategies of Employment Consultants.",
            "How Does Collaborative Reflection Unfold in Online Communities? An Analysis of Two Data Sets.",
            "Unpacking the Role of Boundaries in Computer-Supported Collaborative Teaching.",
            "(Re)Configuring Hybrid Meetings: Moving from User-Centered Design to Meeting-Centered Design.",
            "Streaming your Identity: Navigating the Presentation of Gender and Sexuality through Live Streaming."
        ]
    },
    {
        "name": "Computer Supported Cooperative Work",
        "year": "2019",
        "info": "Volume 28, 2019",
        "count": 35,
        "papers": [
            "Mediating Environments and Objects as Knowledge Infrastructure.",
            "A trajectory for technology-supported elderly care work.",
            "RescueGlass: Collaborative Applications involving Head-Mounted Displays for Red Cross Rescue Dog Units.",
            "Overcoming Social Barriers When Contributing to Open Source Software Projects.",
            "Dynamics of Design Collaboration: BIM Models as Intermediary Digital Objects.",
            "Repetita Iuvant: Exploring and Supporting Redundancy in Hospital Practices.",
            "Understanding eSports Team Formation and Coordination.",
            "Civic Technology for Social Innovation.",
            "Introduction to ECSCW 2019.",
            "Online Harassment in the Workplace: the Role of Technology in Labour Law Disputes.",
            "Moral and Affective Differences in U.S. Immigration Policy Debate on Twitter.",
            "Scholars' Perceptions of Relevance in Bibliography-Based People Recommender System.",
            "Territorial Functioning in Collaborative Writing - Fragmented Exchanges and Common Outcomes.",
            "The Virtual Clinic: Two-sided Affordances in Consultation Practice.",
            "Cyber-Physical Systems for Knowledge and Expertise Sharing in Manufacturing Contexts: Towards a Model Enabling Design.",
            "Rethinking Financial Inclusion: from Access to Autonomy.",
            "Co-Creating Platform Governance Models Using Boundary Resources: a Case Study from Dementia Care Services.",
            "Platforms, Scales and Networks: Meshing a Local Sustainable Sharing Economy.",
            "Flexible Turtles and Elastic Octopi: Exploring Agile Practice in Knowledge Work.",
            "The Missing \"Turn to Practice\" in the Digital Transformation of Industry.",
            "Translation and Adoption: Exploring Vocabulary Work in Expert-Layperson Encounters.",
            "Exploring Indie Game Development: Team Practices and Social Experiences in A Creativity-Centric Technology Community.",
            "Three Gaps in Opening Science.",
            "Crowd Dynamics: Conflicts, Contradictions, and Community in Crowdsourcing.",
            "Investigating the Amazon Mechanical Turk Market Through Tool Design.",
            "Crowd Anatomy Beyond the Good and Bad: Behavioral Traces for Crowd Worker Modeling and Pre-selection.",
            "The Evolution of Power and Standard Wikidata Editors: Comparing Editing Behavior over Time to Predict Lifespan and Volume of Edits.",
            "Citizen Representation in City Government-Driven Crowdsourcing.",
            "Rating Working Conditions on Digital Labor Platforms.",
            "Examining Community Dynamics of Civic Crowdfunding Participation.",
            "Capitalizing Relationships: Modes of Participation in Crowdsourcing.",
            "Personal Health Records and Patient-Oriented Infrastructures: Building Technology, Shaping (New) Patients, and Healthcare Practitioners.",
            "Between Personal and Common: the Design of Hybrid Information Spaces.",
            "Aligning Concerns in Telecare: Three Concepts to Guide the Design of Patient-Centred E-Health.",
            "I'm Trying to Find my Way of Staying Organized: the Socio-Technical Assemblages of Personal Health Information Management."
        ]
    },
    {
        "name": "Computer Supported Cooperative Work",
        "year": "2018",
        "info": "Volume 27, 2018",
        "count": 32,
        "papers": [
            "Collaborative Affordances of Medical Records.",
            "From Object-Oriented to Fluid Ontology: a Case Study of the Materiality of Design Work in Agile Software Development.",
            "Latent Groups in Online Communities: a Longitudinal Study in Wikipedia.",
            "New Perspectives on Plans: Studying Planning as an Instance of Instructed Action.",
            "Bottom-up Infrastructures: Aligning Politics and Technology in building a Wireless Community Network.",
            "Infrastructuring as Ambiguous Repair: A Case Study of a Surveillance Infrastructure Project.",
            "Imaginaries and Crystallization Processes in Bitcoin Infrastructuring.",
            "Studying Infrastructuring Ethnographically.",
            "An Afterword to 'Infrastructuring and Collaborative Design'.",
            "Introduction to ECSCW 2018.",
            "Speaking their Mind: Populist Style and Antagonistic Messaging in the Tweets of Donald Trump, Narendra Modi, Nigel Farage, and Geert Wilders.",
            "Online Support Groups for Depression in China: Culturally Shaped Interactions and Motivations.",
            "The Beauty of Ugliness: Preserving while Communicating Online with Shared Graphic Photos.",
            "Room for Silence: Ebola Research, Pluralism and the Pragmatic Study of Sociomaterial Practices.",
            "Don't be afraid! Persuasive Practices in the Wild.",
            "'Worksome but Rewarding' -Stakeholder Perceptions on Value in Collaborative Design Work.",
            "Designing for Sustainability: Key Issues of ICT Projects for Ageing at Home.",
            "Variations in Oncology Consultations: How Dictation Allows Variations to be Documented in Standardized Ways.",
            "The Effect of Collaboration Styles and View Independence on Video-Mediated Remote Collaboration.",
            "Physical Versus Digital Sticky Notes in Collaborative Ideation.",
            "Folksonomies to Support Coordination and Coordination of Folksonomies.",
            "Newcomers' Barriers. . . Is That All? An Analysis of Mentors' and Newcomers' Barriers in OSS Projects.",
            "Accountability in Brazilian Governmental Software Project: How Chat Technology Enables Social Translucence in Bug Report Activities.",
            "An Analysis of Merge Conflicts and Resolutions in Git-Based Open Source Projects.",
            "The Types, Roles, and Practices of Documentation in Data Analytics Open Source Software Libraries - A Collaborative Ethnography of Documentation Work.",
            "From Work to Life and Back Again: Examining the Digitally-Mediated Work/Life Practices of a Group of Knowledge Workers.",
            "In Search for the Perfect Pathway: Supporting Knowledge Work of Welfare Workers.",
            "Of Embodied Action and Sensors: Knowledge and Expertise Sharing in Industrial Set-Up.",
            "\"What do you want for dinner?\" - need anticipation and the design of proactive technologies for the home.",
            "Co-Creating the Workplace: Participatory Efforts to Enable Individual Work at the Hoffice.",
            "Towards Evolutionary Named Group Recommendations.",
            "Citizen Representation in City Government-Driven Crowdsourcing."
        ]
    },
    {
        "name": "Computer Supported Cooperative Work",
        "year": "2017",
        "info": "Volume 26, 2017",
        "count": 30,
        "papers": [
            "A Preface to 'Infrastructuring and Collaborative Design'.",
            "Re-Infrastructuring for eHealth: Dealing with Turns in Infrastructure Development.",
            "Infrastructuring in Healthcare through the OpenEHR Architecture.",
            "Biography of a Design Project through the Lens of a Facebook Page.",
            "Infrastructuring for Cultural Commons.",
            "Surfacing Small Worlds through Data-In-Place.",
            "Infrastructuring for Cross-Disciplinary Synthetic Science: Meta-Study Research in Land System Science.",
            "This Is Not a Fish: On the Scale and Politics of Infrastructure Design Studies.",
            "Tying Knots: Participatory Infrastructuring at Work.",
            "Digital Infrastructure for the Humanities in Europe and the US: Governing Scholarship through Coordinated Tool Development.",
            "From Episodes to Continuity of Care: a Study of a Call Center for Supporting Independent Living.",
            "Counter-Discourse Activism on Social Media: The Case of Challenging \"Poverty Porn\" Television.",
            "Introduction to ECSCW 2017.",
            "Exploring the Difficulties African-American Middle School Girls Face Enacting Computational Algorithmic Thinking over three Years while Designing Games for Social Change.",
            "What if it Switched on the Sun? Exploring Creativity in a Brainstorming Session with Children Through a Vygotskyan Perspective.",
            "Repacking 'Privacy' for a Networked World.",
            "Authority as an Interactional Achievement: Exploring Deference to Smart Devices in Hospital-Based Resuscitation.",
            "Augmenting Multi-Party Face-to-Face Interactions Amongst Strangers with User Generated Content.",
            "Becoming a Good Homecare Practitioner: Integrating Many Kinds of Work.",
            "Data Work: How Energy Advisors and Clients Make IoT Data Accountable.",
            "Interaction and Outcomes in Collaborative Storytelling Systems: a Framework, a Field Study, and a Model.",
            "Deliberate Individual Change Framework for Understanding Programming Practices in four Oceanography Groups.",
            "Collaborative Exploration and Sensemaking of Big Environmental Sound Data.",
            "Working Digital Money into a Cash Economy: The Collaborative Work of Loan Payment.",
            "Paper Practices in Institutional Talk: How Financial Advisors Impress their Clients.",
            "One Social Movement, Two Social Media Sites: A Comparative Study of Public Discourses.",
            "An Analysis of the Use of Qualifications on the Amazon Mechanical Turk Online Labor Market.",
            "A Case Study of How a Reduction in Explicit Leadership Changed an Online Game Community.",
            "Designing in between Local Government and the Public - Using Institutional Analysis in Interventions on Civic Infrastructures.",
            "From Facebook to the Neighbourhood: Infrastructuring of Hybrid Community Engagement."
        ]
    },
    {
        "name": "Computer Supported Cooperative Work",
        "year": "2016",
        "info": "Volume 25, 2016",
        "count": 25,
        "papers": [
            "On Intertext in Chemotherapy: an Ethnography of Text in Medical Practice.",
            "Turking in a Global Labour Market.",
            "Telecare Call Centre Work and Ageing in Place.",
            "Book Review - Taking [A]Part: The Politics and Aesthetics of Participation in Experience-Centered Design, John McCarthy & Peter Wright, 2015, MIT Press, Cambridge MA., 181 pp. ISBN 978-0-262-02, 855-4.",
            "Challenging Citizenship: Social Media and Big Data.",
            "Genomic Big Data and Privacy: Challenges and Opportunities for Precision Medicine.",
            "Smart Citizens: Exploring the Tools of the Urban Bottom-Up Movement.",
            "Open Data, Crowdsourcing and Game Mechanics. A case study on civic participation in the digital age.",
            "Bloggers' Responses to the Snowden Affair: Combining Automated and Manual Methods in the Analysis of News Blogging.",
            "From Publics to Communities: Researching the Path of Shared Issues Through ICT.",
            "Erratum to: Interactional Order and Constructed Ways of Seeing with Touchless Imaging Systems in Surgery.",
            "Preface to the Special Issue on 'Reconsidering \"Awareness\" in CSCW'.",
            "From I-Awareness to We-Awareness in CSCW.",
            "Implications of We-Awareness to the Design of Distributed Groupware Tools.",
            "From I-Awareness to We-Awareness in CSCW: a Review Essay.",
            "The Trouble with Common Ground.",
            "On Rhetorical Tricks and Overloaded Concepts.",
            "Treacherous Ground: On Some Conceptual Pitfalls in CSCW.",
            "From Intersubjectivity to Group Cognition.",
            "Discourse/s in/of CSCW.",
            "What Is Common in Accounts of Common Ground?",
            "Unpacking the Notion of Participation in Participatory Design.",
            "Turning to Peers: Integrating Understanding of the Self, the Condition, and Others' Experiences in Making Sense of Complex Chronic Conditions.",
            "Cooperative Epistemic Work in Medical Practice: An Analysis of Physicians' Clinical Notes.",
            "Book Review - Networked: the New Social Operating System, Lee Rainie and Barry Wellman, MIT Press, Cambridge, Massachusetts, 2012, 357 pp. ISBN 978-0-262-52616-6."
        ]
    },
    {
        "name": "Computer Supported Cooperative Work",
        "year": "2015",
        "info": "Volume 24, 2015",
        "count": 25,
        "papers": [
            "Sketching Awareness: A Participatory Study to Elicit Designs for Supporting Ad Hoc Emergency Medical Teamwork.",
            "An Object-Centred Approach to Encourage Online Participation in the Context of Behaviour Change.",
            "Book Review - Fieldwork for Healthcare: Case Studies Investigating Human Factors in Computing Systems, Dominic Furniss, Aisling O'Kane, Rebecca Randell, Svetlena Taneva, Helena Mentis and Ann Blandford (eds.), Morgan & Claypool Publishees series, 2014, 129 pp. ISBN 978-1-6-270-5319-8.",
            "Collaboration Meets Interactive Surfaces: A Brief Introduction.",
            "Towards Concurrent Multi-Tasking in Shareable Interfaces.",
            "Tracking Deictic Gestures over Large Interactive Surfaces.",
            "Supporting Collaboration on Very Large-Scale Interactive Wall Surfaces.",
            "Exploring Collaboration Patterns in a Multitouch Game to Encourage Social Interaction and Collaboration Among Users with Autism Spectrum Disorder.",
            "Deploying and Visualising Teacher's Scripts of Small Group Activities in a Multi-surface Classroom Ecology: a Study in-the-wild.",
            "Blended Spaces for Collaboration.",
            "Editorial - In Memoriam: John Hughes.",
            "Collaboration Across Professional Boundaries - The Emergence of Interpretation Drift and the Collective Creation of Project Jargon.",
            "Reflections and Encounters: Exploring Awareness in an Academic Environment.",
            "The Multiple Intersecting Sites of Design in CSCW Research.",
            "Life After Weight Loss: Design Implications for Community-based Long-term Weight Management.",
            "Book Review The Data Revolution: Big Data, Open Data, Data Infrastructures & Their Consequences - Rob Kitchin, Sage, London, 222 pp. ISBN-13 978-1446287484.",
            "How Do Users Discover New Tools in Software Development and Beyond?",
            "The Digital Coral: Infrastructuring Environmental Monitoring.",
            "Situational Awareness as an Instructable and Instructed Matter in Multi-Media Supported Debriefing: a Case Study from Aviation.",
            "Book Review - Sociomaterial-Design, Pernille Bjørn and Carsten Østerlund, Springer Press, 2015.",
            "Collaboration in Augmented Reality.",
            "Design and Implementation of TeleAdvisor: a Projection-Based Augmented Reality System for Remote Collaboration.",
            "The Effect of View Independence in a Collaborative AR System.",
            "Using Projected Light for Mobile Remote Guidance.",
            "Providing Information on the Spot: Using Augmented Reality for Situational Awareness in the Security Domain."
        ]
    },
    {
        "name": "Computer Supported Cooperative Work",
        "year": "2014",
        "info": "Volume 23, 2014",
        "count": 23,
        "papers": [
            "Practices of Stigmergy in the Building Process.",
            "Latent Users in an Online User-Generated Content Community.",
            "Big Board: Teleconferencing Over Maps for Shared Situational Awareness.",
            "Boundary-Object Trimming: On the Invisibility of Medical Secretaries' Care of Records in Healthcare Infrastructures.",
            "Book Review - Heritage and Social Media. Understanding Heritage in a Participatory Culture, Elisa Giaccardi (ed.), Routledge, London & New York, 251 pp. ISBN-10 0415616670 ISBN-13 978-0415616676.",
            "Book Review - Ethnography and Virtual Worlds - A Handbook of Method, Tom Boellstorff, Bonnie Nardi, Celia Pearce and T.L. Taylor, Princeton University Press, 2012, 264 pp. ISBN 978-0-691-14951-6.",
            "Work Practices, Nomadicity and the Mediational Role of Technology.",
            "Understanding Constellations of Technologies in Use in a Collaborative Nomadic Setting.",
            "Nomadicity and the Care of Place - on the Aesthetic and Affective Organization of Space in Freelance Creative Work.",
            "Officing: Mediating Time and the Professional Self in the Support of Nomadic Work.",
            "Nomadic Work as Life-Story Plot.",
            "Nomadic Work: Romance and Reality. A Response to Barbara Czarniawska's 'Nomadic Work as Life-Story Plot'.",
            "Book Review - Enterprise Mobility: Tiny Technology with Global Impact on Work, Carsten Sørensen, Palgrave Macmillan, 2011, 208 pp. ISBN: 9780230306202, DOI: 10.1057/9780230306202.",
            "The Day-to-Day Co-Production of Ageing in Place.",
            "Sensework - Conceptualising Sociotechnical Work in Safety-Critical Operations.",
            "Interactional Order and Constructed Ways of Seeing with Touchless Imaging Systems in Surgery.",
            "Crisis Informatics and Collaboration: A Brief Introduction.",
            "Information and Expertise Sharing in Inter-Organizational Crisis Management.",
            "Crisis Crowdsourcing Framework: Designing Strategic Configurations of Crowdsourcing for the Emergency Management Domain.",
            "Journalists as Crowdsourcerers: Responding to Crisis by Reporting with a Crowd.",
            "Good Enough is Good Enough: Overcoming Disaster Response Organizations' Slow Social Media Data Adoption.",
            "Identifying Seekers and Suppliers in Social Media Communities to Support Crisis Coordination.",
            "Information Sharing Among Disaster Responders - An Interactive Spreadsheet-Based Collaboration Approach."
        ]
    },
    {
        "name": "Computer Supported Cooperative Work",
        "year": "2013",
        "info": "Volume 22, 2013",
        "count": 19,
        "papers": [
            "Grounding Privacy in Mediated Communication.",
            "Concealment of Emotion in an Emergency Room: Expanding Design for Emotion Awareness.",
            "Unearthing the Infrastructure: Humans and Sensors in Field-Based Scientific Research.",
            "Book Review - Lars Rune Christensen: Coordinative Practices in the Building Process: An Ethnographic perspective, London: Springer, 2013 152 pages ISBN 978-1-4471-4116-4.",
            "Differentiated Awareness-Support in Computer Supported Collaborative Work - Special Issue Introduction.",
            "Awareness Support in Distributed Software Development: A Systematic Review and Mapping of the Literature.",
            "The Mind's Eye on Personal Profiles: A Cognitive Perspective on Profile Elements that Inform Initial Trustworthiness Assessments and Social Awareness in Virtual Project Teams.",
            "Turning Conflicts into Collaboration.",
            "Awareness Support for Combining Individual and Collaborative Process Design in Co-located Meetings.",
            "An Approach for Asynchronous Awareness Support in Collaborative Non-Linear Storytelling.",
            "Ambient Awareness to Strengthen the Family Social Network of Older Adults.",
            "Constructing CSCW: The First Quarter Century.",
            "Reflections on 25 Years of Ethnography in CSCW.",
            "Supporting Effortless Coordination: 25 Years of Awareness Research.",
            "Computational Coordination Mechanisms: A tale of a struggle for flexibility.",
            "Sharing Knowledge and Expertise: The CSCW View of Knowledge Management.",
            "From Artefacts to Infrastructures.",
            "A Review of 25 Years of CSCW Research in Healthcare: Contributions, Challenges and Future Agendas.",
            "Supporting Scientific Collaboration: Methods, Tools and Concepts."
        ]
    },
    {
        "name": "Computer Supported Cooperative Work",
        "year": "2012",
        "info": "Volume 21, 2012",
        "count": 22,
        "papers": [
            "Building Urban Narratives: Collaborative Site-Seeing and Envisioning in the MR Tent.",
            "Pursuing Leisure: Reflections on Theme Park Visiting.",
            "Social Infrastructures as Barriers and Foundation for Informal Learning: Technology Integration in an Urban After-School Center.",
            "Book Review - Video in Qualitative Research, Christian Heath, Jon Hindmarsh and Paul Luff, Sage Publications, 2010, 184 pp. ISBN 978-1412929431.",
            "Knowledge Management in Practice: A Special Issue.",
            "Doing Business with Theory: Communities of Practice in Knowledge Management.",
            "The Trouble with 'Tacit Knowledge'.",
            "Affording Mechanisms: An Integrated View of Coordination and Knowledge Management.",
            "Bridging Artifacts and Actors: Expertise Sharing in Organizational Ecosystems.",
            "Beyond Expertise Seeking: A Field Study of the Informal Knowledge Practices of Healthcare IT Teams.",
            "Exploring Appropriation of Enterprise Wikis: - A Multiple-Case Study.",
            "Collective Intelligence in Organizations: Tools and Studies - Introduction.",
            "Productive Interrelationships between Collaborative Groups Ease the Challenges of Dynamic and Multi-Teaming.",
            "The Management and Use of Social Network Sites in a Government Department.",
            "Contested Collective Intelligence: Rationale, Technologies, and a Human-Machine Annotation Study.",
            "Enabling Large-Scale Deliberation Using Attention-Mediation Metrics.",
            "Editorial - The CSCW Journal Turns 20.",
            "Who's Got the Data? Interdependencies in Science and Technology Collaborations.",
            "Collaboration in Translation: The Impact of Increased Reach on Cross-organisational Work.",
            "Bridging Identity Gaps - Supporting Identity Performance in Citizen Service Encounters.",
            "Book Review - Cooperative Work and Coordinative Practices: Contributions to the Conceptual Foundations of Computer-Supported Cooperative Work (CSCW), Kjeld Schmidt, Springer, 2011. 440 pp. ISBN 978-1848000674.",
            "Book Review - Divining a Digital Future: Mess and Mythology in Ubiquitous Computing, Paul Dourish & Genevieve Bell 2011. MIT Press. (pp. 264). ISBN 978-0262015554."
        ]
    },
    {
        "name": "Computer Supported Cooperative Work",
        "year": "2011",
        "info": "Volume 20, 2011",
        "count": 18,
        "papers": [
            "Bloggers and Readers Blogging Together: Collaborative Co-creation of Political Blogs.",
            "Variations and Commonalities in Processes of Collaboration: The Need for Multi-Site Workplace Studies.",
            "Tertiary-Level Telehealth: A Media Space Application.",
            "Artefactual Multiplicity: A Study of Emergency-Department Whiteboards.",
            "Layers in Sorting Practices: Sorting out Patients with Potential Cancer.",
            "Special Theme: Project Management in E-Science: Challenges and Opportunities.",
            "Bridging the Disciplinary Divide: Co-Creating Research Ideas in eScience Teams.",
            "Agile Project Management: A Case Study of a Virtual Research Environment Development Project.",
            "Socially Embedded Collaborative Practices: Introduction to a Special Issue based on the COOP 2010 Conference.",
            "\"Remain Faithful to the Earth!\"*: Reporting Experiences of Artifact-Centered Design in Healthcare.",
            "Analyzing Political Activists' Organization Practices: Findings from a Long Term Case Study of the European Social Forum.",
            "Collocated Social Practices Surrounding Photo Usage in Archaeology.",
            "The Concept of 'Work' in CSCW.",
            "Supporting the Collaborative Appropriation of an Open Software Ecosystem.",
            "Technology in Protestant Ministry.",
            "Accounting and Co-Constructing: The Development of a Standard for Electronic Health Records.",
            "Computer Interaction Analysis: Toward an Empirical Approach to Understanding User Practice and Eye Gaze in GUI-Based Interaction.",
            "Investigating the Role of a Large, Shared Display in Multi-Display Environments."
        ]
    },
    {
        "name": "Computer Supported Cooperative Work",
        "year": "2010",
        "info": "Volume 19, 2010",
        "count": 24,
        "papers": [
            "An Admissibility-Based Operational Transformation Framework for Collaborative Editing Systems.",
            "Mobile Technology and Action Teams: Assessing BlackBerry Use in Law Enforcement Units.",
            "PeerCare: Supporting Awareness of Rhythms and Routines for Better Aging in Place.",
            "Context-Based Workplace Awareness - Concepts and Technologies for Supporting Distributed Awareness in a Hospital Environment.",
            "Technology Effects in Distributed Team Coordination - High-Interdependency Tasks in Offshore Oil Production.",
            "The Dynamics of Material Artifacts in Collaborative Research Teams.",
            "Knowing the Way. Managing Epistemic Topologies in Virtual Game Worlds.",
            "Sociotechnical Studies of Cyberinfrastructure and e-Research: Current Themes and Future Trajectories.",
            "Synergizing in Cyberinfrastructure Development.",
            "The Dialectical Tensions in the Funding Infrastructure of Cyberinfrastructure.",
            "Transforming Scholarly Practice: Embedding Technological Interventions to Support the Collaborative Analysis of Ancient Texts.",
            "Reconfiguring Evidence: Interacting with Digital Objects in Scientific Practice.",
            "Reusing Scientific Data: How Earthquake Engineering Researchers Assess the Reusability of Colleagues' Data.",
            "Infrastructure Time: Long-term Matters in Collaborative Development.",
            "Editorial - Susan Leigh Star - in memoriam.",
            "Collaboration on Social Network Sites: Amateurs, Professionals and Celebrities.",
            "Knowledge Management in Locating the Patient in an Emergency Medical Service in Italy.",
            "Collaboration Within Different Settings: A Study of Co-located and Distributed Multidisciplinary Medical Team Meetings.",
            "My Life as a Night Elf Priest. An Antropological Account of World of Warcraft. - Bonnie Nardi 2010. The University of Michigan Press. (pp. 236). ISBN 978-0-472-02671-5.",
            "Information Infrastructures for Health Care: Connecting Practices Across Institutional and Professional Boundaries.",
            "e-Infrastructures: How Do We Know and Understand Them? Strategic Ethnography and the Biography of Artefacts.",
            "The Role of Integration in Health-Based Information Infrastructures.",
            "Prescriptions, X-rays and Grocery Lists. Designing a Personal Health Record to Support (The Invisible Work Of) Health Information Management in the Household.",
            "Infrastructuring and Ordering Devices in Health Care: Medication Plans and Practices on a Hospital Ward."
        ]
    },
    {
        "name": "Computer Supported Cooperative Work",
        "year": "2009",
        "info": "Volume 18, 2009",
        "count": 22,
        "papers": [
            "Making Space for a New Medium: On the Use of Electronic Mail in a Newspaper Newsroom.",
            "How to Use Information Technology for Cooperative Work: Development of Shared Technological Frames.",
            "alt.metadata.health: Ontological Context for Data Use and Integration.",
            "Designing for Diagnosing: Introduction to the Special Issue on Diagnostic Work.",
            "Time, Narratives and Participation Frameworks in Software Troubleshooting.",
            "\"You Are Well Clear of Friendlies\": Diagnostic Error and Cooperative Work in an Iraq War Friendly Fire Incident.",
            "Cooperative Advocacy: An Approach for Integrating Diverse Perspectives in Anomaly Response.",
            "Designing Technology as an Embedded Resource for Troubleshooting.",
            "Communication and Diagnostic Work in Medical Emergency Calls in Italy.",
            "Diagnostic Reasoning in the Use of Travel Management System.",
            "The Home Network as a Socio-Technical System: Understanding the Challenges of Remote Home Network Problem Diagnosis.",
            "Leveraging Coordinative Conventions to Promote Collaboration Awareness.",
            "Scenario-Based Methods for Evaluating Collaborative Systems.",
            "Achieving Diagnosis by Consensus.",
            "Software Engineering as Cooperative Work.",
            "What Counts as Software Process? Negotiating the Boundary of Software Work Through Artifacts and Conversation.",
            "On The Roles of APIs in the Coordination of Collaborative Software Development.",
            "Bridging, Patching and Keeping the Work Flowing: Defect Resolution in Distributed Software Development.",
            "Using Developer Activity Data to Enhance Awareness during Collaborative Software Development.",
            "Testing in the Wild: The Social and Organisational Dimensions of Real World Practice.",
            "Software Development Cultures and Cooperation Problems: A Field Study of the Early Stages of Development of Software for a Scientific Community.",
            "Integration and Generification - Agile Software Development in the Healthcare Market."
        ]
    },
    {
        "name": "Computer Supported Cooperative Work",
        "year": "2008",
        "info": "Volume 17, 2008",
        "count": 23,
        "papers": [
            "Introduction to Special Issue on Learning and Work.",
            "Sotto Voce:  Facilitating Social Learning in a Historic House.",
            "Unpacking Tasks: The Fusion of New Technology with Instructional Work.",
            "\"What are We Missing?\" Usability's Indexical Ground.",
            "In Absentia: Designing for Social Learning.",
            "Settings for Collaboration: the Role of Place.",
            "Places: People, Events, Loci - the Relation of Semantic Frames in the Construction of Place.",
            "Places: People, Events, Loci - the Relation of Semantic Frames in the Construction of Place.",
            "Geographic 'Place' and 'Community Information' Preferences.",
            "Communication Spaces.",
            "Documents in Place: Demarcating Places for Collaboration in Healthcare Settings.",
            "Place and Technology in the Home.",
            "Of Coffee Shops and Parking Lots: Considering Matters of Space and Place in the Use of Public Wi-Fi.",
            "Understanding Situated Social Interactions: A Case Study of Public Places in the City.",
            "Social Loafing in Technology-Supported Teams.",
            "Physical and Digital Artifact-Mediated Coordination in Building Design.",
            "The CACHE Study: Group Effects in Computer-supported Collaborative Analysis.",
            "Triage Drift: A Workplace Study in a Pediatric Emergency Department.",
            "Preface to the Special Issue on 'Consistency Management in Synchronous Collaboration'.",
            "Multi-level Editing of Hierarchical Documents.",
            "An Operational Transformation Algorithm and Performance Evaluation.",
            "A Multi-Versioning Scheme for Intention Preservation in Collaborative Editing Systems.",
            "An Approach to Ensuring Consistency in Peer-to-Peer Real-Time Group Editors."
        ]
    },
    {
        "name": "Computer Supported Cooperative Work",
        "year": "2007",
        "info": "Volume 16, 2007",
        "count": 24,
        "papers": [
            "Leisure and CSCW: Introduction to Special Edition.",
            "Collecting and Sharing Location-based Content on Mobile Phones in a Zoo Visitor Experience.",
            "A Look at Tokyo Youth at Leisure: Towards the Design of New Media to Support Leisure Outings.",
            "Group-Based Mobile Messaging in Support of the Social Side of Leisure.",
            "Entertaining Situated Messaging at Home.",
            "Virtual \"Third Places\": A Case Study of Sociability in Massively Multiplayer Games.",
            "The Cooperative Work of Gaming: Orchestrating a Mobile SMS Game.",
            "Let's Get Physical! In, Out and Around the Gaming Circle of Physical Gaming at Home.",
            "How Can I Help You? Call Centres, Classification Work and Coordination.",
            "Doing Virtually Nothing: Awareness and Accountability in Massively Multiplayer Online Worlds.",
            "Boundary Negotiating Artifacts: Unbinding the Routine of Boundary Objects and Embracing Chaos in Collaborative Work.",
            "Beyond Boundary Objects: Collaborative Reuse in Aircraft Technical Support.",
            "Learning In Communities: Introduction to the Special Issue.",
            "Local Groups Online: Political Learning and Participation.",
            "Sustaining a Community Computing Infrastructure for Online Teacher Professional Development: A Case Study of Designing Tapped In.",
            "Expert Recommender: Designing for a Network Organization.",
            "Architecture, Infrastructure, and Broadband Civic Network Design: An Institutional View.",
            "Supporting Community Emergency Management Planning through a Geocollaboration Software Architecture.",
            "Seeds of Cross-Media Production.",
            "Improving the Effectiveness of Virtual Teams by Adapting Team Processes.",
            "Telehealth in Context: Socio-technical Barriers to Telehealth use in Labrador, Canada.",
            "Book Review.",
            "Book Review.",
            "Book Review."
        ]
    },
    {
        "name": "Computer Supported Cooperative Work",
        "year": "2006",
        "info": "Volume 15, 2006",
        "count": 22,
        "papers": [
            "Computer Support for Social Awareness in Flexible Work.",
            "Temporality in Medical Work: Time also Matters.",
            "Sensemaking in Technology-Use Mediation: Adapting Groupware Technology in Organizations.",
            "Information Infrastructures for Distributed Collective Practices.",
            "Modern Information Infrastructure in the Support of Distributed Collective Practice in Transport.",
            "Pushing the Distribution Model to its Limits: Distributed \"listening\" in a Helpline.",
            "Experiences in Automating the Analysis of Linguistic Interactions for the Study of Distributed Collectives.",
            "Scientific Data Collections and Distributed Collective Practice.",
            "Documentarisation Processes in Documents for Action (DofA): The Status of Annotations and Associated Cooperation Technologies.",
            "A Methodological Framework for Socio-Cognitive Analyses of Collaborative Design of Open Source Software.",
            "Special Issue: Collaboration in e-Research.",
            "Remote Collaboration Over Video Data: Towards Real-Time e-Social Science.",
            "Developing Digital Records: Early Experiences of Record and Replay.",
            "Enriching the Notion of Data Curation in E-Science: Data Managing and Information Infrastructuring in the Long Term Ecological Research (LTER) Network.",
            "What can Studies of e-Learning Teach us about Collaboration in e-Research? Some Findings from Digital Library Studies.",
            "Walking the Tightrope: The Balancing Acts of a Large e-Research Project.",
            "Special Issue: CSCW and Dependable Healthcare Systems.",
            "The Wireless Nursing Call System: Politics of Discourse, Technology and Dependability in a Pilot Project.",
            "Seamless Integration: Standardisation across Multiple Local Settings.",
            "Achieving Dependability in the Configuration, Integration and Testing of Healthcare Technologies.",
            "Multidisciplinary Medical Team Meetings: An Analysis of Collaborative Working with Special Attention to Timing and Teleconferencing.",
            "Loose Coupling and Healthcare Organizations: Deployment Strategies for Groupware."
        ]
    },
    {
        "name": "Computer Supported Cooperative Work",
        "year": "2005",
        "info": "Volume 14, 2005",
        "count": 23,
        "papers": [
            "Creating Assemblies in Public Environments: Social Interaction, Interactive Exhibits and CSCW.",
            "ICT and Integrated Care: Some Dilemmas of Standardising Inter-Organisational Communication.",
            "Book Review: Where the Action Is: The Foundations of Embodied Interaction, Paul Dourish, MIT Press, Cambridge, 2001, 256 pp. ISBN 0-262-04196-0.",
            "Book Review: Distributed Work, Pamela J. Hinds and Sara Kiesler (eds.), MIT Press, Cambridge, 2002, 475 pp. ISBN 0-262-08305-1.",
            "Book Review: Social Thinking - Software Practice, Yvonne Dittrich, Christiane Floyd and Ralf Klischewski (eds.), MIT Press, Cambridge, 2002.",
            "Beyond Bandwidth: Dimensions of Connection in Interpersonal Communication.",
            "Mobility Work: The Spatial Dimension of Collaboration at a Hospital.",
            "Words about Images: Coordinating Community in Amateur Photography.",
            "The Electronic Laboratory Journal: A Collaborative and Cooperative Learning Environment for Web-Based Experimentation.",
            "Moving with the Times: IT Research and the Boundaries of CSCW.",
            "Collaboration Among Designers: Analysing an Activity for System Development.",
            "Book review: The Locales Framework: Understanding and Designing for Wicked Problems, Geraldine Fitzpatrick, (ed.), The Kluwer International Series on Computer Supported Cooperative Work 2003, 254 pp. Hardcover ISBN: 1-4020-1190-3.",
            "Book Review: Public and Situated Displays: Social and Interactional Aspects of Shared Display Technologies, Kenton O'Hara, Mark Perry, Elizabeth Churchill and Daniel Russell (eds.), The Kluwer International Series on Computer Supported Cooperative Work, 2003, 456 pp, ISBN 1-4020-1677-8.",
            "Book Review: Tracing Genres through Organizations. A Sociocultural Approach to Information Design, Clay Spinuzzi, MIT Press, Cambridge, MA, 2003, 264 pp, ISBN 0-262-19491-0.",
            "Book Review: Computer-Supported Collaboration with Applications to Software Development, Fadi P. Deek and James A. M. McHugh, The Kluwer International Series in Engineering and Computer Science, 2003, 264 pp, ISBN 1-4020-7385-2.",
            "Conceptualizing the Awareness of Collaboration: A Qualitative Study of a Global Virtual Team.",
            "Socialization in an Open Source Software Community: A Socio-Technical Analysis.",
            "Collaboration and Trust in Healthcare Innovation: The eDiaMoND Case Study.",
            "The Metamorphoses of Workflow Projects in their Early Stages.",
            "When Plans do not Work Out: How Plans are Used in Software Development Projects.",
            "Supporting Adaptable Consistency Control in Structured Collaborative Workspaces.",
            "Over the Shoulder Learning: Supporting Brief Informal Learning.",
            "Discovering Social Networks from Event Logs."
        ]
    },
    {
        "name": "Computer Supported Cooperative Work",
        "year": "2004",
        "info": "Volume 13, 2004",
        "count": 22,
        "papers": [
            "Adapting Virtual Reality for the Participatory Design of Work Environments.",
            "Small-Scale Classification Schemes: A Field Study of Requirements Engineering.",
            "Empirical Study on Collaborative Writing: What Do Co-authors Do, Use, and Like?",
            "From Cards to Code: How Extreme Programming Re-Embodies Programming as a Collective Practice.",
            "Ambiguities, Awareness and Economy: A Study of Emergency Service Work.",
            "Organizational Memory as Objects, Processes, and Trajectories: An Examination of Organizational Memory in Use.",
            "Domestic Routines and Design for the Home.",
            "Introduction to Special Issue on Context-Aware Computing in CSCW.",
            "A Historical View of Context.",
            "People-to-People-to-Geographical-Places: The P3 Framework for Location-Based Community Systems.",
            "Modelling Shared Contexts in Cooperative Environments: Concept, Implementation, and Evaluation.",
            "Building Connections among Loosely Coupled Groups: Hebb's Rule at Work.",
            "Building a Context Sensitive Telephone: Some Hopes and Pitfalls for Context Sensitive Computing.",
            "Preface.",
            "Ordering Systems: Coordinative Practices and Artifacts in Architectural Design and Planning.",
            "Push-to-Talk Social Talk.",
            "Increasing Workplace Independence for People with Cognitive Disabilities by Leveraging Distributed Cognition among Caregivers and Clients.",
            "Community-Building with Web-Based Systems - Investigating a Hybrid Community of Students.",
            "Roles of Orientation in Tabletop Collaboration: Comprehension, Coordination and Communication.",
            "The MAUI Toolkit: Groupware Widgets for Group Awareness.",
            "Consistency Control for Synchronous and Asynchronous Collaboration Based on Shared Objects and Activities.",
            "Software Framework for Managing Heterogeneity in Mobile Collaborative Systems."
        ]
    },
    {
        "name": "Computer Supported Cooperative Work",
        "year": "2003",
        "info": "Volume 12, 2003",
        "count": 22,
        "papers": [
            "The Camera as an Actor Design-in-Use of Telemedicine Infrastructure in Surgery.",
            "Synchronizations in Team Automata for Groupware Systems.",
            "A Patchwork Planet Integration and Cooperation in Hospitals.",
            "Infrastructure Management as Cooperative Work: Implications for Systems Design.",
            "Workplace Studies: Recovering Work Practice and Informing System Design.",
            "People in Control: Human Factors in Control Room Design.",
            "Wireless World - Social and Interactional Aspects of the Mobile Age.",
            "The Role of Objects in Design Co-Operation: Communication through Physical or Virtual Objects.",
            "Against Ambiguity.",
            "Boundary Objects and Prototypes at the Interfaces of Engineering Design.",
            "Intermediary Objects as a Means to Foster Co-operation in Engineering Design.",
            "Design Tools and Framing Practices.",
            "Making a Case in Medical Work: Implications for the Electronic Medical Record.",
            "The Gift of the Gab?: A Design Oriented Sociology of Young People's Use of Mobiles.",
            "Recomposition: Coordinating a Web of Software Dependencies.",
            "Tree-Based Concurrency Control in Distributed Groupware.",
            "A Citation Analysis of Influences on Collaborative Computing Research.",
            "Introduction to Special Issue on Evolving Use of Groupware.",
            "Creating Heterogeneity - Evolving Use of Groupware in a Network of Freelancers.",
            "Virtual Teams and the Appropriation of Communication Technology: Exploring the Concept of Media Stickiness.",
            "Constructing Interdependencies with Collaborative Information Technology.",
            "The Appropriation of Interactive Technologies: Some Lessons from Placeless Documents."
        ]
    },
    {
        "name": "Computer Supported Cooperative Work",
        "year": "2002",
        "info": "Volume 11, 2002",
        "count": 21,
        "papers": [
            "Introduction to the Special Issue on Activity Theory and the Practice of Design.",
            "A View of Software Development Environments Based on Activity Theory.",
            "Steps Across the Border - Cooperation, Knowledge Production and Systems Design.",
            "Activity Theory and System Design: A View from the Trenches.",
            "Realist Activity Theory for Digital Library Evaluation: Conceptual Framework and Case Study.",
            "Information Systems Development as an Activity.",
            "Articulating User Needs in Collaborative Design: Towards an Activity-Theoretical Approach.",
            "Physical and Virtual Tools: Activity Theory Applied to the Design of Groupware.",
            "Collaboration as an Activity Coordinating with Pseudo-Collective Objects.",
            "NetWORKers and their Activity in Intensional Networks.",
            "Activity Theory and Distributed Cognition: Or What Does CSCW Need to DO with Theories?",
            "Coda and Response to Christine Halverson.",
            "Preface.",
            "The Problem with 'Awareness': Introductory Remarks on 'Awareness in CSCW'.",
            "The Public Availability of Actions and Artefacts.",
            "Configuring Awareness.",
            "Conventions and Commitments in Distributed CSCW Groups.",
            "Awareness, Representation and Interpretation.",
            "A Descriptive Framework of Workspace Awareness for Real-Time Groupware.",
            "Supporting Public Availability and Accessibility with Elvin: Experiences and Reflections.",
            "Integrating Awareness in Cooperative Applications through the Reaction-Diffusion Metaphor."
        ]
    },
    {
        "name": "Computer Supported Cooperative Work",
        "year": "2001",
        "info": "Volume 10, 2001",
        "count": 18,
        "papers": [
            "Landscapes of Practice: Bricolage as a Method for Situated Design.",
            "The Communication Bottleneck in Knitwear Design: Analysis and Computing Solutions.",
            "An Integrated Approach to Designing and Evaluating Collaborative Applications and Infrastructures.",
            "Co-Constructing Non-Mutual Realities: Delay-Generated Trouble in Distributed Interaction.",
            "Alan J. Munro, Kristina Höök and David Benyon (eds.), Social Navigation of Information Space - Review.",
            "Bonnie Nardi and Vicki O'Day, Information Ecologies: Using Technology with Heart - Review.",
            "Geoffrey Bowker and Susan Leigh Star, Sorting Things Out: Classification and Its Consequences - Review.",
            "Work Practices Surrounding PACS: The Politics of Space in Hospitals.",
            "Computer Supported Social Networking For Augmenting Cooperation.",
            "Bridging Work Practice and System Design: Integrating Systemic Analysis, Appreciative Intervention and Practitioner Participation.",
            "Reviewing Practices in Collaborative Writing.",
            "Hunting for the Treasure at the End of the Rainbow: Standardizing corporate IT Infrastructure.",
            "Unpacking a Timesheet: Formalisation and Representation.",
            "Shift Changes, Updates, and the On-Call Architecture in Space Shuttle Mission Control.",
            "Designing Work Oriented Infrastructures.",
            "Distributed High-End Audio-Visual Content Creation: An Experience Report.",
            "Organisational Change and Retail Finance: An Ethnographic Perspective, by Richard Harper, Dave Randall, Mark Rouncefield.",
            "From Web to Workplace: Designing Open Hypermedia Systems, Kaj Grønbæk and Randall H. Trigg."
        ]
    },
    {
        "name": "Computer Supported Cooperative Work",
        "year": "2000",
        "info": "Volume 9, 2000",
        "count": 20,
        "papers": [
            "Introduction.",
            "A Coordination Language For Building Collaborative Applications.",
            "A Tale of Two Toolkits: Relating Infrastructure and Use in Flexible CSCW Toolkits.",
            "Design of Extensible Component-Based Groupware.",
            "Tailoring as Collaboration: The Mediating Role of Multiple Representations and Application Units.",
            "Users as Composers: Parts and Features as a Basis for Tailorability in CSCW Systems.",
            "Tailoring Groupware: The Cooperative Hypermedia Approach.",
            "Editorial.",
            "Temporal Coordination - On Time and Coordination of Collaborative Activities at a Surgical Department.",
            "Workflow Systems: Occasions for Success and Failure.",
            "Talking Work: Language-games, Organisations and Computer Supported Cooperative Work.",
            "The Organisation in Ethnography - A Discussion of Ethnographic Fieldwork Programs in CSCW.",
            "Introduction to the Special Issue on Adaptive Workflow Systems.",
            "Techniques for Supporting Dynamic and Adaptive Workflow.",
            "ML-DEWS: Modeling Language to Support Dynamic Evolution within Workflow Systems.",
            "A Light Workflow Management System Using Simple Process Models.",
            "Supporting Different Dimensions of Adaptability in Workflow Modeling.",
            "A Knowledge-based Approach to Handling Exceptions in Workflow Systems.",
            "Configuration for Adaptation - A Human-centered Approach to Flexible Workflow Enactment.",
            "Work-arounds and Boundary Crossing in a High Tech Optronics Company: The Role of Co-operative Workflow Technologies."
        ]
    },
    {
        "name": "Computer Supported Cooperative Work",
        "year": "1999",
        "info": "Volume 8, 1999",
        "count": 18,
        "papers": [
            "A Web on the Wind: The Structure of Invisible Work.",
            "Layers of Silence, Arenas of Voice: The Ecology of Visible and Invisible Work.",
            "Invisible Work of Telephone Operators: An Ethnocritical Analysis.",
            "Expansive Visibilization of Work: An Activity-Theoretical Perspective.",
            "Collaborative Networks Among Female Middle Managers in a Hierarchical Organization.",
            "Visible and Invisible Work: The Emerging Post-Industrial Employment Relation.",
            "\"It's Just a Matter of Common Sense\": Ethnography as Invisible Work.",
            "The Invisible World of Intermediaries: A Cautionary Tale.",
            "Meetings of the Board: The Impact of Scheduling Medium on Long Term Group Coordination in Software Development.",
            "Visualizing Common Artefacts to Support Awareness in Computer-Mediated Cooperation.",
            "Integrating Contexts to Support Coordination: The CHAOS Project.",
            "Sharrock and Button ? and Much Ado about Nothing.",
            "CSCW Requirements and Evaluation, Thomas, P.J. (ed.).",
            "Video-Mediated Communication. Kathleen E. Finn, Abigail J. Sellen, Sylvia B. Wilbur (eds.).",
            "Media Production: Towards Creative Collaboration Using Communication Networks.",
            "Formality Considered Harmful: Experiences, Emerging Themes, and Directions on the Use of Formal Representations in Interactive Systems.",
            "Voice Loops as Coordination Aids in Space Shuttle Mission Control.",
            "Accumulating and Coordinating: Occasions for Information Technologies in Medical Work."
        ]
    },
    {
        "name": "Computer Supported Cooperative Work",
        "year": "1998",
        "info": "Volume 7, 1998",
        "count": 15,
        "papers": [
            "Introduction: The State of Play.",
            "Moving Practice: From Classrooms to MOO Rooms.",
            "Community Support for Constructionist Learning.",
            "Computing, Social Activity, and Entertainment: A Field Study of a Game MUD.",
            "Network Communities: Something Old, Something New, Something Borrowed?",
            "Preface.",
            "Participatory Design: Issues and Concerns.",
            "When Survival is an Issue: PD in Support of Landscape Architecture.",
            "Shoppers and Tailors: Participative Practices in Small Australian Design Companies.",
            "CAVEAT Exemplar: Participatory Design in a Non-Profit Volunteer Organisation.",
            "Participatory Design at a Radio Station.",
            "Participatory Design in Consulting.",
            "User Advocacy in Participatory Design: Designers? Experiences with a New Communication Channel.",
            "Network Community Design: A Social-Technical Design Circle.",
            "Community Participation in Health Informatics in Africa: An Experiment in Tripartite Partnership in Ile-Ife, Nigeria."
        ]
    },
    {
        "name": "Computer Supported Cooperative Work",
        "year": "1997",
        "info": "Volume 6, 1997",
        "count": 18,
        "papers": [
            "A Collaborative Schema Integration System.",
            "Collaborative Writing Is Hard to Support: A Field Study of Collaborative Writing.",
            "When Are Group Scheduling Tools Useful?",
            "Groupware Environments as Action Constitutive Resources: A Social Action Framework for Analyzing Groupware Technologies.",
            "The World Wide Web as Enabling Technology for CSCW: The Case of BSCW.",
            "Challenges for Cooperative Work on the Web: An Analytical Approach.",
            "Structured Cooperative Authoring for the World Wide Web.",
            "Distributed Coordination and Workflow on the World Wide Web.",
            "Enterprise-Level Groupware Choices: Evaluating Lotus Notes and Intranet-Based Solutions.",
            "Virtual Society: Collaboration in 3D Spaces on the Internet.",
            "Negotiating Boundaries. Configuration Management in Software Development Teams.",
            "Informing General CSCW Product Development through Cooperative Design in Specific Work Domains.",
            "Supporting Cooperation through Customisation: The Tviews Approach.",
            "Hypermedia Use in Group Work: Changing the Product, Process, and Strategy.",
            "On the Relevance of Habermas? Theory of Communicative Action for CSCW.",
            "Cognition in the Wild, Edwin Hutchins.",
            "Aramis or The Love of Technology, Bruno Latour.",
            "Review: Cognition and Communication at Work, Engeström, Y. and Middleton, D. (eds)."
        ]
    },
    {
        "name": "Computer Supported Cooperative Work",
        "year": "1996",
        "info": "Volume 5, 1996",
        "count": 18,
        "papers": [
            "The Coordination of Work Activities: Cooperation and Conflict in a Hospital Context.",
            "Your Place or Mine? Learning from Long-Term Use of Audio-Video Communication.",
            "Information Needs in Technical Work Settings and Their Implications for the Design of Computer Tools.",
            "Object-Oriented Activity Support: A Model for Integrated CSCW Systems.",
            "Modelling Co-Operation in the Design of Knowledge Production Systems: The MadeIn-Coop Method An example in the field of C3I systems.",
            "Coordination Mechanisms: Towards a Conceptual Foundation of CSCW Systems Design.",
            "Normalized Interactions between Autonomous Agents A Case Study in Inter-Organizational Project Management.",
            "Contexts, Work Processes, and Workspaces.",
            "Collaboration and Underlying Issues or The Surprises of Cooperative Dialogues.",
            "Negotiation Based on Constraints in Cooperation.",
            "Cooperation and Cooperator Modeling.",
            "Cooperation between Humans and Machines: First Results of an Experiment with a Multi-Level Cooperative Organisation in Air Traffic Control.",
            "Constructive Difference and Disagreement: A SuprA-Cooperation among Agents.",
            "Embodied Actions in Time and Place: The Cooperative Design of a Multimedia, Educational Computer Game.",
            "Project Work: The Organisation of Collaborative Design and Development in Software Engineering.",
            "From the Social to the Systematic Mechanisms supporting coordination in design.",
            "Collaborative Conceptual Design: A Large Software Project Case Study.",
            "Supporting Articulation Work Using Software Configuration Management Systems."
        ]
    },
    {
        "name": "Computer Supported Cooperative Work",
        "year": "1995",
        "info": "Volume 4, 1995",
        "count": 14,
        "papers": [
            "A Model of Social, Emotional and Symbolic Aspects of Computer-Mediated Communication within Organizations.",
            "The Effects of a \"Distinct Window\" Screen Design on Computer-Mediated Group Decision Making.",
            "Comparing Collaborative Drawing Tools and Whiteboards: An Analysis of the Group Process.",
            "Video-as-Data: Technical and Social Aspects of a Collaborative Multimedia Application.",
            "Introduction: The JEMCO-2 Study of Time, Technology, and Groups.",
            "Interaction Process in Computer-Mediated and Face-to-Face Groups.",
            "The Development of Group Identity in Computer and Face-to-Face Groups with Membership Change.",
            "Equality of Participation and Influence in Groups: The Effects of Communication Medium and Sex Composition.",
            "Affect in Computer-Mediated and Face-to-Face Work Groups: The Construction and Testing of a General Model.",
            "Developing Complex Group Products: Idea Combination in Computer-Mediated and Face-to-Face Groups.",
            "Time, Technology and Groups: An Integration.",
            "The Relevance of 'Work-Practice' for Design.",
            "Information Technology and Regulatory Reform. The Interorganisational Effects of a Technological Innovation.",
            "Why People Do and Don?t Wear Active Badges: A Case Study."
        ]
    },
    {
        "name": "Computer Supported Cooperative Work",
        "year": "1994",
        "info": "Volume 3, 1994",
        "count": 14,
        "papers": [
            "Alleviating Convergence Problems in Group Support Systems: The Shared Context Approach.",
            "Speech Acts and Voices: Response to Winograd et al.",
            "Cooperative Work in Mission Operations: Analysis and Implications for Computer Support.",
            "Unpacking Collaboration: the Interactional Organisation of Trading in a City Dealing Room.",
            "From High Tech to Human Tech: Empowerment, Measurement, and Social Studies of Computing.",
            "COLA: A Lightweight Platform for CSCW.",
            "Collaborative Writing and Technological Change: Implications for Writing Practice and System Design.",
            "The Interfunctionality of Talk and Text.",
            "Collaborative Writing in Multiple Discourse Contexts.",
            "Accommodating Mixed Sensory/Modal Preferences in Collaborative Writing Systems.",
            "Collaborative Document Annotation using Electronic Mail.",
            "Comparative Study on the Effects of Groupware and Conventional Technologies on the Efficiency of Collaborative Writing.",
            "Design Issues and Model for a Distributed Multi-User Editor.",
            "Identification and use of guidelines for the design of computer supported collaborative writing tools."
        ]
    },
    {
        "name": "Computer Supported Cooperative Work",
        "year": "1994",
        "info": "Volume 2, 1994",
        "count": 17,
        "papers": [
            "Preface to the special issue of computer supported cooperative work (CSCW) on 'networking'.",
            "Networking actors and organisations.",
            "Working relations of technology production and use.",
            "Mediated collaborative research?",
            "Considering privacy in the development of multi-media communications.",
            "Social control and social contract in networking.",
            "The politics of networking technology in health care.",
            "The LookingGlass distributed shared workspace.",
            "A new architecture for a collaborative authoring system.",
            "A new departure.",
            "Do categories have politics?",
            "Categories, disciplines, and social coordination.",
            "Keeping people apart.",
            "A prototype of an integrated coordination support system.",
            "GDSS' formative fundaments.",
            "Groups are not always the same.",
            "Overcoming social awareness in computer-supported groups."
        ]
    },
    {
        "name": "Computer Supported Cooperative Work",
        "year": "1992",
        "info": "Volume 1, 1992",
        "count": 12,
        "papers": [
            "Taking CSCW seriously.",
            "Supporting cooperative applications.",
            "Collaboration and controlCrisis management and multimedia technology in London Underground Line Control Rooms.",
            "On the social organisation of organisations.",
            "From ethnographic record to system design.",
            "Can organisations afford knowledge?",
            "Why do users like video?",
            "Survey of collaborative drawing support tools.",
            "Constructing the 'Dossier Représentatif' - Computer-based information-sharing in French hospitals.",
            "Negotiating temporal orders - The case of collaborative time management in a surgery clinic.",
            "Blurred partitions but thicker walls - Involving citizens in computer supported cooperative work for public administration.",
            "Coordinating computer-mediated work."
        ]
    }
]