[
    {
        "year": "2021",
        "name": "DIS 2021",
        "info": "Virtual Event, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ACMdis/2021",
                "sub_name": "DIS '21: Designing Interactive Systems Conference 2021, Virtual Event, USA, 28 June, July 2, 2021.",
                "count": 153,
                "papers": [
                    "Family and Friend Communication over Distance in Canada During the COVID-19 Pandemic.",
                    "Designing a Multi-Agent Occupant Simulation System to Support Facility Planning and Analysis for COVID-19.",
                    "Crisis Couture: A Study on Motivations and Practices of Mask Makers During A Crisis.",
                    "\"Are We Now Post-COVID?\": Exploring Post-COVID Futures Through a Gamified Story Completion Method.",
                    "From Mild to Wild: Reimagining Friendships and Romance in the Time of Pandemic Using Design Fiction.",
                    "Is it Better With Onboarding? Improving First-Time Cryptocurrency App Experiences.",
                    "IoTIZER: A Versatile Mechanical Hijacking Device for Creating Internet of Old Things.",
                    "\"I thought you were okay\": Participatory Design with Young Adults to Fight Multiparty Privacy Conflicts in Online Social Networks.",
                    "Spidey Sense: Designing Wrist-Mounted Affective Haptics for Communicating Cybersecurity Warnings.",
                    "Don't Stop Me Now! Exploring Challenges Of First-Time Cryptocurrency Users.",
                    "The Trial of Posit in Shared Offices: Controlling Disclosure Levels of Schedule Data for Privacy by Changing the Placement of a Personal Interactive Calendar.",
                    "A Taxonomy of Sounds in Virtual Reality.",
                    "Exploring Terminology for Perception of Motion in Virtual Reality.",
                    "From Limitations to \"Superpowers\": A Design Approach to Better Focus on the Possibilities of Virtual Reality to Augment Human Capabilities.",
                    "Show, don't tell: Using Go-along Interviews in Immersive Virtual Reality.",
                    "Portalware: Exploring Free-Hand AR Drawing with a Dual-Display Smartphone-Wearable Paradigm.",
                    "Augmented Silkscreen: Designing AR Interactions for Debugging Printed Circuit Boards.",
                    "ProcessAR: An augmented reality-based tool to create in-situ procedural 2D/3D AR Instructions.",
                    "Citizen-Centered Design in Urban Planning: How Augmented Reality can be used in Citizen Participation Processes.",
                    "Exploring Relations in Neuroscientific Literature using Augmented Reality: A Design Study.",
                    "SelectVisAR: Selective Visualisation of Virtual Environments in Augmented Reality.",
                    "VXSlate: Exploring Combination of Head Movements and Mobile Touch for Large Virtual Display Interaction.",
                    "Vivian: A Technical Framework for Deploying and Operating Virtual Prototypes in XR.",
                    "Designing Blended Experiences.",
                    "Discovering the Design Challenges of Autonomous Vehicles through Exploring Scenarios via an Immersive Design Workshop.",
                    "Co-Designing Interactions between Pedestrians in Wheelchairs and Autonomous Vehicles.",
                    "Guiding Preferred Driving Style Using Voice in Autonomous Vehicles: An On-Road Wizard-of-Oz Study.",
                    "Accessibility and The Crowded Sidewalk: Micromobility's Impact on Public Space.",
                    "Investigating human-robot cooperation in a hospital environment: Scrutinising visions and actual realisation of mobile robots in service work.",
                    "Less is More: Exploring Support for Time Management Planning.",
                    "Discarded Labor: : Countervisualities for Representing AI Integration in Essential Work.",
                    "Identifying the Factors That Influence DHH Employee Success Under Hearing Supervisors.",
                    "Work of the Unemployed: An inquiry into individuals' experience of data usage in public services and possibilities for their agency.",
                    "Elucidating Skills for Job Seekers: Insights and Critical Concerns from a Field Deployment in Switzerland.",
                    "The Office Jungle: Exploring Unusual Ways of Working through Bodily Experimentations.",
                    "\"Why are they all obsessed with Gender?\" - (Non)binary Navigations through Technological Infrastructures.",
                    "Alexa, We Need to Talk: A Data Literacy Approach on Voice Assistants.",
                    "Coding Bias in the Use of Behavior Management Technologies: Uncovering Socio-technical Consequences of Data-driven Surveillance in Classrooms.",
                    "I/O Bits: User-Driven, Situated, and Dedicated Self-Tracking.",
                    "MEMEories: Internet Memes as Means for Daily Journaling.",
                    "Exploring Generative Reflection by Agency of Visual Practice: An Autoethnographic Study on Reflection by Noticing and Making.",
                    "Show Me How You Interact, I Will Tell You What You Think: Exploring the Effect of the Interaction Style on Users' Sensemaking about Correlation and Causation in Data.",
                    "Tailored Science Badges: Enabling New Forms of Research Interaction.",
                    "Investigating Preferred Food Description Practices in Digital Food Journaling.",
                    "FoodScrap: Promoting Rich Data Capture and Reflective Food Journaling Through Speech Input.",
                    "How Cultural Norms Influence Persuasive Design: A Study on Chinese Food Journaling Apps.",
                    "FoodChattAR: Exploring the Design Space of Edible Virtual Agents for Human-Food Interaction.",
                    "Exploring Food based Interactive, Multi-Sensory, and Tangible Storytelling Experiences.",
                    "Sensory Probes: An Exploratory Design Research Method for Human-Food Interaction.",
                    "One Byte at a Time: Insights about Meaningful Data for Sustainable Food Consumption Practices.",
                    "Drawing From Social Media to Inspire Increasingly Playful and Social Drone Futures.",
                    "Misattribution of Error Origination: The Impact of Preconceived Expectations in Co-Operative Online Games.",
                    "The CoCe Design Space: Exploring the Design Space for Co-Located Collaborative Games that Use Multi-Display Composition.",
                    "Nowhere to Now-here: Empowering Children to Reimagine Bully Prevention at Schools Using Critical Design Fiction: Exploring the Potential of Participatory, Empowering Design Fiction in Collaboration with Children.",
                    "Hybrid Embroidery Games: Playing with Materials, Machines, and People.",
                    "\"I am Definitely Manipulated, Even When I am Aware of it. It's Ridiculous!\" - Dark Patterns from the End-User Perspective.",
                    "Design Patterns of Investing Apps and Their Effects on Investing Behaviors.",
                    "Troubling Care: Four Orientations for Wickedness in Design.",
                    "\"Too old to bank digitally? \": A Survey of Banking Practices and Challenges Among Older Adults in China.",
                    "Hugs, Bible Study, and Speakeasies: Designing for Older Adults' Multimodal Connectedness.",
                    "Clustering and Unclustering: Understanding dialogic potential in design for Ongoingness.",
                    "CommunityPulse: Facilitating Community Input Analysis by Surfacing Hidden Insights, Reflections, and Priorities.",
                    "Designing Interactive Alerts to Improve Recognition of Critical Events in Medical Emergencies.",
                    "Design and Evaluation of a Head-Worn Display Application for Multi-Patient Monitoring.",
                    "Exploring Personalized Vibrotactile and Thermal Patterns for Affect Regulation.",
                    "The Multiplicative Patient and the Clinical Workflow: Clinician Perspectives on Social Interfaces for Self-Tracking and Managing Bipolar Disorder.",
                    "\"I wrote as if I were telling a story to someone I knew.\": Designing Chatbot Interactions for Expressive Writing in Mental Health.",
                    "Designing Visual Cards for Digital Mental Health Research with Ethnic Minorities.",
                    "Exploring the Design Space of InterActive Urban Environments: triggering physical activity through embedded technology.",
                    "How HCI Bridges Health and Design in Online Health Communities: A Systematic Review.",
                    "Contemplative Interactions: Exploring the Use of Defamiliarization in a Serious Game to Promote Reflective Thinking about Personal Health.",
                    "Appropriation of Digital Tracking Tools in an Online Weight Loss Community: Individual and Shared Experiences: Appropriation of Digital Tracking tools in an online weight loss community.",
                    "Laina: Dynamic Data Physicalization for Slow Exercising Feedback.",
                    "\"This is the story of me\": Designing audiovisual narratives to support reflection on cancer journeys.",
                    "CameraReady: Assessing the Influence of Display Types and Visualizations on Posture Guidance.",
                    "Aesthetic of Friction for Exercising Motivation: a Prototyping Journey.",
                    "Understanding the Design Space of Mouth Microgestures.",
                    "SneezeLove: Embodying Cultural Superstitions in Connected Devices.",
                    "Hybrid Paper-Digital Interfaces: A Systematic Literature Review.",
                    "Compressables: A Haptic Prototyping Toolkit for Wearable Compression-based Interfaces.",
                    "Circuit Assemblies: Electronic Modules for Interactive 3D-Prints.",
                    "Crafting On-Skin Interfaces: An Embodied Prototyping Journey.",
                    "WovenProbe: Probing Possibilities for Weaving Fully-Integrated On-Skin Systems Deployable in the Field.",
                    "Exploring Affordances of Surface Gestures on Textile User Interfaces.",
                    "More than it Seams: Garment Stitching in Wearable e-Textiles.",
                    "KnitDermis: Fabricating Tactile On-Body Interfaces Through Machine Knitting.",
                    "Audio-Frequency Induction Loops (AFILs) as a Design Materialfor Architectural Interactivity: An Illustrated Guide.",
                    "Living light Interfaces - an Exploration of Bioluminescence Aesthetics.",
                    "Designing Direct Interactions with Bioluminescent Algae.",
                    "Hydrogel-based DIY Underwater Morphing Artifacts: A morphing and fabrication technique to democratize the creation of controllable morphing 3D underwater structures with low-cost, easily available hydrogel beads adhered to a substrate.",
                    "deformTable: Crafting a Shape-changing Device for Creative Appropriations Over Time.",
                    "The Breathing Wings: An Autobiographical Soma Design Exploration of Touch Qualities through Shape-Change Materials.",
                    "Electriflow: Soft Electrohydraulic Building Blocks for Prototyping Shape-changing Interfaces.",
                    "Transtexture Lamp: Composing a Deformable Device as a Computational Whole.",
                    "Adapt2Learn: A Toolkit for Configuring the Learning Algorithm for Adaptive Physical Tools for Motor-Skill Learning.",
                    "\"I'm Better Off on my Own\": Understanding How a Tutorial's Medium Affects Physical Skill Development.",
                    "Designing an embodied conversational agent for a learning space.",
                    "Analysis of Gender Stereotypes for the Design of Service Robots: Case Study on the Chinese Catering Market.",
                    "What Robots Need From Clothing.",
                    "Learning from robotic artefacts: A quest for strong concepts in Human-Robot Interaction.",
                    "Collection of Metaphors for Human-Robot Interaction.",
                    "Exploring the Role of Social Robot Behaviors in a Creative Activity.",
                    "Social Robots in Service Contexts: Exploring the Rewards and Risks of Personalization and Re-embodiment.",
                    "Machine Body Language: Expressing a Smart Speaker's Activity with Intelligible Physical Motion.",
                    "Synergistic Social Technology: Designing Systems with 'Needs' that Encourage and Support Social Interaction.",
                    "Understanding How Users Experience the Physiological Expression of Non-humanoid Voice-based Conversational Agent in Healthcare Services.",
                    "Conversations with GUIs.",
                    "Chatbot or Chat-Blocker: Predicting Chatbot Popularity before Deployment.",
                    "Trust and Anthropomorphism in Tandem: The Interrelated Nature of Automated Agent Appearance and Reliability in Trustworthiness Perceptions.",
                    "User Expectations of Conversational Chatbots Based on Online Reviews.",
                    "Do Integral Emotions Affect Trust? The Mediating Effect of Emotions on Trust in the Context of Human-Agent Interaction.",
                    "Chatbots to Support Children in Coping with Online Threats: Socio-technical Requirements.",
                    "Interactive Hyperparameter Optimization with Paintable Timelines.",
                    "Towards A Process Model for Co-Creating AI Experiences.",
                    "Teaching-Learning Interaction: A New Concept for Interaction Design to Support Reflective User Agency in Intelligent Systems.",
                    "Wikipedia ORES Explorer: Visualizing Trade-offs For Designing Applications With Machine Learning API.",
                    "Learning Personal Style from Few Examples.",
                    "A Survey of Collaborative Reinforcement Learning: Interactive Methods and Design Patterns.",
                    "Who needs to know what, when?: Broadening the Explainable AI (XAI) Design Space by Looking at Explanations Across the AI Lifecycle.",
                    "A Design Inquiry into Introspective AI: Surfacing Opportunities, Issues, and Paradoxes.",
                    "Towards Understanding People's Experiences of AI Computer Vision Fitness Instructor Apps.",
                    "Hammers for Robots: Designing Tools for Reinforcement Learning Agents.",
                    "Exploring the Potential of Apple Face ID as a Drag, Queer and Trans Technology Design Tool.",
                    "Supporting Remote Survey Data Analysis by Co-researchers with Learning Disabilities through Inclusive and Creative Practices and Data Science Approaches.",
                    "Problematising Transparency Through LARP And Deliberation.",
                    "Advocacy Through Design: Partnering to Improve Online Communications and Connections in a Life Plan Community.",
                    "\"It's like a GPS community tool\": Tactics to foster Digital Commons through Artifact Ecology.",
                    "Deliberating Data-Driven Societies Through Live Action Role Play.",
                    "Giving Space to Your Message: Assistive Word Segmentation for the Electronic Typing of Digital Minorities.",
                    "Speculative Design for Education: Using Participatory Methods to Map Design Challenges and Opportunities in Pakistan.",
                    "Leveraging the Twitch Platform and Gamification to Generate Home Audio Datasets.",
                    "Participatory Design for the Anarchive: The Amagugu Ethu / Our Treasures Documentation Project.",
                    "Speculative Blackness: Considering Afrofuturism in the Creation of Inclusive Speculative Design Probes.",
                    "Prototyping Things: Reflecting on Unreported Objects of Design Research for IoT.",
                    "The Intersection of Users, Roles, Interactions, and Technologies in Creativity Support Tools.",
                    "Shöwn: Adaptive Conceptual Guidance Aids Example Use in Creative Tasks.",
                    "Pedagogical Strategies for Reflection in Project-based HCI Education with End Users.",
                    "The Benefits of Using Design Workbooks with Speculative Design Proposals in Information Communication Technology for Development (ICTD).",
                    "Eliciting New Perspectives in RtD Studies through Annotated Portfolios: A Case Study of Robotic Artefacts.",
                    "A Gendered Perspective on Making from an Autoethnography in Makerspaces.",
                    "The Impact of Spinal Cord Injury on Participation in Human-Centered Research.",
                    "The Overlaps and Boundaries Between Service Design and User Experience Design.",
                    "Moving Design Research: GIFs as Research Tools.",
                    "Examining Opaque Infrastructures with the Desktop Odometer.",
                    "Land, Water and Sun: Tuning into Socio-Ecological Relations in Radio Design.",
                    "Search Atlas: Visualizing Divergent Search Results Across Geopolitical Borders.",
                    "It's Ugly, That's Why it Works Beautifully: An Exploratory Study Using Design Strategies to Violate Aesthetic Principles as Means to Influence Usage Behaviors.",
                    "Entangled Reflections on Designing with Leaky Breastfeeding Bodies.",
                    "Prototyping Machine Learning Through Diffractive Art Practice.",
                    "Expanding the Design Space for Technology-Mediated Theatre Experiences.",
                    "Studying Choreographic Collaboration in the Wild.",
                    "Current Use, Non-Use, and Future Use of Ballet Learning Technologies.",
                    "DataMoves: Entangling Data and Movement to Support Computer Science Education."
                ]
            }
        ]
    },
    {
        "year": "2020",
        "name": "DIS 2020",
        "info": "Eindhoven, The Netherlands",
        "venues": [
            {
                "sub_name_abbr": "conf/ACMdis/2020",
                "sub_name": "DIS '20: Designing Interactive Systems Conference 2020, Eindhoven, The Netherlands, July 6-10, 2020.",
                "count": 164,
                "papers": [
                    "Applying Ability-Based Design Principles to Adaptive Outdoor Activities.",
                    "HaptiRead: Reading Braille as Mid-Air Haptic Information.",
                    "Voiceye: A Multimodal Inclusive Development Environment.",
                    "Experience is not Required: Designing a Sailing Experience for Individuals with Tetraplegia.",
                    "Human-in-the-Loop Machine Learning to Increase Video Accessibility for Visually Impaired and Blind Users.",
                    "What Kind of Work Do \"Asshole Designers\" Create? Describing Properties of Ethical Concern on Reddit.",
                    "Moving for the Movement: Applying Viewpoints and Composition Techniques to the Design of Online Social Justice Campaigns.",
                    "\"We come together as one...and hope for solidarity to live on\": On Designing Technologies for Activism and the Commemoration of Lost Lives.",
                    "Crafting Everyday Resistance through Lightweight Design.",
                    "Using European Human Rights Jurisprudence for Incorporating Values into Design.",
                    "An Autobiographical Design Study of a Long Distance Relationship: When Telepresence Robots Meet Smart Home Tools.",
                    "Chasing Lions: Co-Designing Human-Drone Interaction in Sub-Saharan Africa.",
                    "Exploring Future Work - Co-Designing a Human-robot Collaboration Environment for Service Domains.",
                    "Robotic Futures: Learning about Personally-Owned Agents through Performance.",
                    "Punishable AI: Examining Users' Attitude Towards Robot Punishment.",
                    "Useful Uselessness?: Teaching Robots to Knit with Humans.",
                    "Recordkeeping and Relationships: Designing for Lifelong Information Rights.",
                    "Creating a Chatbot for and with Migrants: Chatbot Personality Drives Co-Design Activities.",
                    "InsTime: A Case Study on the Co-design of Interactive Installations on Deep Time.",
                    "\"I Understand, Mate\": A Co-designed Comic-based Digital Story from 'Down Under'.",
                    "Drawing on Experiences of Self: Dialogical Sketching.",
                    "Visualizing Personal Rhythms: A Critical Visual Analysis of Mental Health in Flux.",
                    "Exploring the Reflective Potentialities of Personal Data with Different Temporal Modalities: A Field Study of Olo Radio.",
                    "Entangling the Roles of Maker and Interpreter in Interpersonal Data Narratives: Explorations in Yarn and Sound.",
                    "Data Dashboard: Exploring Centralization and Customization in Personal Data Curation.",
                    "Disconnecting: Towards a Semiotic Framework for Personal Data Trails.",
                    "Crafting Research Products through Digital Machine Embroidery.",
                    "Alternative Presents for Dynamic Fabric.",
                    "Weaving a Second Skin: Exploring Opportunities for Crafting On-Skin Interfaces Through Weaving.",
                    "FabriClick: Interweaving Pushbuttons into Fabrics Using 3D Printing and Digital Embroidery.",
                    "The Nudge Deck: A Design Support Tool for Technology-Mediated Nudging.",
                    "SemanticCollage: Enriching Digital Mood Board Design with Semantic Labels.",
                    "Design Card Sets: Systematic Literature Survey and Card Sorting Study.",
                    "Hit the Thumb Jack! Using Electromyography to Augment the Piano Keyboard.",
                    "Storycoding - Programming Physical Artefacts for Research Through Design.",
                    "Evaluating Creativity Support Tools in HCI Research.",
                    "Lexichrome: Text Construction and Lexical Discovery with Word-Color Associations Using Interactive Visualization.",
                    "\"This just felt to me like the right thing to do\": Decision-Making Experiences of Parents of Young Children.",
                    "Design for Change With and for Children: How to Design Digital StoryTelling Tool to Raise Stereotypes Awareness.",
                    "Probes to Explore the Individual Perspectives on Technology Use that exist within Sets of Parents.",
                    "Body Matters: Exploration of the Human Body as a Resource for the Design of Technologies for Meditation.",
                    "Crafting an Embodied Speculation: An Account of Prototyping Methods.",
                    "Gut-Tracking as Cultivation.",
                    "Designing Drone Chi: Unpacking the Thinking and Making of Somaesthetic Human-Drone Interaction.",
                    "Designing with Intimate Materials and Movements: Making \"Menarche Bits\".",
                    "InsideOut: Towards an Understanding of Designing Playful Experiences with Imaging Capsules.",
                    "OmniGlobeVR: A Collaborative 360-Degree Communication System for VR.",
                    "VRtefacts: Performative Substitutional Reality with Museum Objects.",
                    "JeL: Breathing Together to Connect with Others and Nature.",
                    "Designing Mind(set) and Setting for Profound Emotional Experiences in Virtual Reality.",
                    "Exploring Hybrid Virtual-Physical Homes.",
                    "Play Design as a Relational Strategy to Intensify Affective Encounters in the Art Museum.",
                    "Have a SEAT on Stage: Restoring Trust with Spectator Experience Augmentation Techniques.",
                    "Scienscope: Hand-Held Mediation Device for Facilitating Exploratory Behaviors with Exhibits in Museum Visitors.",
                    "Putting Down Roots: Exploring the Placeness of Virtual Collections in Public Libraries.",
                    "Designing an Interactive Non-Linear Documentary Contributed by Public Participation: Suburbs of Istanbul.",
                    "Inclusion at Scale: Deploying a Community-Driven Moderation Intervention on Twitch.",
                    "TalkFutures: Supporting Qualitative Practices in Distributed Community Engagements.",
                    "Participatory Memory Making: Creating Postcolonial Dialogic Engagements with Namibian Youth.",
                    "GeoPact: Engaging Publics in Location-aware Smart Contracts through Technological Assemblies.",
                    "Exploring the Non-Use of Mobile Devices in Families through Provocative Design.",
                    "Visions, Values, and Videos: Revisiting Envisionings in Service of UbiComp Design for the Home.",
                    "Strangers in the Room: Unpacking Perceptions of 'Smartness' and Related Ethical Concerns in the Home.",
                    "A Systematic Review of Gesture Elicitation Studies: What Can We Learn from 216 Studies?",
                    "An Exploratory Physical Computing Toolkit for Rapid Exploration and Co-Design of On-Bicycle Notification Interfaces.",
                    "Digital Bookmark: Seamless Switching Between Printed and Electronic Books.",
                    "Comparing the Tangible Tutorial System and the Human Teacher in Intangible Cultural Heritage Education.",
                    "Tangible Interfaces with Printed Paper Markers.",
                    "Pictorial Unleashed: Into the Folds of Interactive Qualities.",
                    "\"Would You Please Buy Me a Coffee?\": How MicroculturesImpact People's Helpful Actions Toward Robots.",
                    "WeScream!: Toward Understanding the Design of Playful Social Gustosonic Experiences with Ice Cream.",
                    "Material Food Probe: Personalized 3D Printed Flavors for Emotional Communication in Intimate Relationships.",
                    "Chasing Play Potentials in Food Culture: Learning from Traditions to Inspire Future Human-Food Interaction Design.",
                    "Disrupting (More-than-) Human-Food Interaction: Experimental Design, Tangibles and Food-Tech Futures.",
                    "MakeAware: Designing to Support Situation Awareness in Makerspaces.",
                    "ThermoPixels: Toolkit for Personalizing Arousal-based Interfaces through Hybrid Crafting.",
                    "Investigating Underdetermination Through Interactive Computational Handweaving.",
                    "Plotting with Thread: Fabricating Delicate Punch Needle Embroidery with X-Y Plotters.",
                    "The Wooden Quilt: Carving Out Personal Narratives in a Women-Only Makerspace.",
                    "10 Years of Research With and On Hackathons.",
                    "Cultivating Material Knowledge: Experiments with a Low Cost Interface for 3D Texture Scanning.",
                    "Where is that Feature?: Designing for Cross-Device Software Learnability.",
                    "How Peripheral Interactive Systems Can Support Teachers with Differentiated Instruction: Using FireFlies as a Probe.",
                    "Cultural Clash: Exploring How Studio-Based Pedagogy Impacts Learning for Students in HCI Classrooms.",
                    "Designing Interactive Scaffolds to Encourage Reflection on Peer Feedback.",
                    "Peek-through Customization: Example-Based In-Context Sharing for Learning Management Systems.",
                    "Understanding How People Reason about Aesthetic Evaluations of Artificial Intelligence.",
                    "Understanding and Supporting Knowledge Decomposition for Machine Teaching.",
                    "A Survey on Interactive Reinforcement Learning: Design Principles and Open Challenges.",
                    "Staging Reflections on Ethical Dilemmas in Machine Learning: A Card-Based Design Workshop for High School Students.",
                    "A Teaching Language for Building Object Detection Models.",
                    "Artificial Intelligence and Risk in Design.",
                    "Keeping Designers in the Loop: Communicating Inherent Algorithmic Trade-offs Across Multiple Objectives.",
                    "Communicating Sustainable Consumption and Production in 360° Video.",
                    "The Disaster and Climate Change Artathon: Staging Art/Science Collaborations in Crisis Informatics.",
                    "Econundrum: Visualizing the Climate Impact of Dietary Choice through a Shared Data Sculpture.",
                    "Introducing the Sustainable Prototyping Life Cycle for Digital Fabrication to Designers.",
                    "Making Air Quality Data Meaningful: Coupling Objective Measurement with Subjective Experience through Narration.",
                    "Scaling Up to Tackle Low Levels of Urban Food Waste Recycling.",
                    "Push-Pull Energy Futures: Using Design to Discuss Agency in Distributed Energy Systems.",
                    "1300 Pieces of Rubbish: A Collaborative Approach to Making Sense of Everyday Resource Sufficiency in the Home.",
                    "A Wizard of Oz Study on Passengers' Experiences of a Robo-Taxi Service in Real-Life Settings.",
                    "Context-Based Interface Prototyping and Evaluation for (Shared) Autonomous Vehicles Using a Lightweight Immersive Video-Based Simulator.",
                    "Exploring the Design of History-Enriched Floor Interfaces for Asynchronous Navigation Support.",
                    "Designing Ambient Wanderer: Mobile Recommendations for Urban Exploration.",
                    "The Making of Accessibility to Rural Place for Blind People: The Relational Design of an Interactive Map.",
                    "Paper to Pixels: A Chronicle of Map Interfaces in Games.",
                    "Enriched Social Translucence in Medical Crowdfunding.",
                    "ManneqKit Cards: A Kinesthetic Empathic Design Tool Communicating Depression Experiences.",
                    "AmbientEcho: Exploring Interactive Media Experiences in the Context of Residential Dementia Care.",
                    "\"You Have to Piece the Puzzle Together\": Implications for Designing Decision Support in Intensive Care.",
                    "Experience Matters: Design and Evaluation of an Anesthesia Support Tool Guided by User Experience Theory.",
                    "Design for Co-responsibility: Connecting Patients, Partners, and Professionals in Bariatric Lifestyle Changes.",
                    "From Ancient Contemplative Practice to the App Store: Designing a Digital Container for Mindfulness.",
                    "Design Opportunities for Digital Men's Health: An Exploratory Study Focusing on Football Fandom.",
                    "Sleep Ecologies: Tools for Snoozy Autoethnography.",
                    "PizzaBlock: Designing Artefacts and Roleplay to Understand Decentralised Identity Management Systems.",
                    "Replay Enactments: Exploring Possible Futures through Historical Data.",
                    "Prototypes as Objects of Desire.",
                    "Strategies for Annotating Portfolios: Mapping Designs for New Domains.",
                    "Tricky Design Probes: Triggering Reflection on Design Research Methods in Service Design.",
                    "More Than Human Aesthetics: Interactive Enrichment for Elephants.",
                    "Canine Co-design: Investigating Buttons as an Input Modality for Dogs.",
                    "Exploration of Aural & Visual Media About Birds Informs Lessons for Citizen Science Design.",
                    "Understanding the Interaction Between Animals and Wearables: The Wearer Experience of Cats.",
                    "Co-Designing with Orangutans: Enhancing the Design of Enrichment for Animals.",
                    "Security Fictions: Bridging Speculative Design and Computer Security.",
                    "Hacked Time: Design and Evaluation of a Self-Efficacy Based Cybersecurity Game.",
                    "Don't lose your coin! Investigating Security Practices of Cryptocurrency Users.",
                    "Implementation and In Situ Assessment of Contextual Privacy Policies.",
                    "Removal as a Method: A Fourth Wave HCI Approach to Understanding the Experience of Self-Tracking.",
                    "DayClo: An Everyday Table Clock Providing Interaction with Personal Schedule Data for Self-reflection.",
                    "The Role of Uncertainty as a Facilitator to Reflection in Self-Tracking.",
                    "\"A Postcard from Your Food Journey in the Past\": Promoting Self-Reflection on Social Food Posting.",
                    "Putting Phenomenological Theories to Work in the Design of Self-Tracking Technologies.",
                    "Exploring Virtual Rewards in Real Life: A Gimmick or a Motivational Tool for Promoting Physical Activity?",
                    "'Pataphysical Software: (Ridiculous) Technological Solutions for Imaginary Problems.",
                    "Magical Realist Design.",
                    "Useless, not Worthless: Absurd Making as Critical Practice.",
                    "Evaluating Design Fiction: The Right Tool for the Job.",
                    "Transurbanism: Smart Cities for Transhumans.",
                    "The Inclusion Zone: Grounded Speculations in Chernobyl.",
                    "Morphino: A Nature-Inspired Tool for the Design of Shape-Changing Interfaces.",
                    "Affordances of Shape-Changing Interfaces: An Information Perspective on Transformability and Movement.",
                    "Reshaping Interaction with Rotary Knobs: Combining Form, Feel and Function.",
                    "EcoPatches: Maker-Friendly Chemical-Based UV Sensing.",
                    "Siloseam: A Morphogenetic Workflow for the Design and Fabrication of Inflatable Silicone Bladders.",
                    "Designing the Expressivity of Multiple Smart Things for Intuitive and Unobtrusive Interactions.",
                    "Exploring Potential Scenarios and Design Implications Through a Camera-like Physical Odor Capture Prototype.",
                    "Interactive Auditory Mediated Reality: Towards User-defined Personal Soundscapes.",
                    "\"All Rise for the AI Director\": Eliciting Possible Futures of Voice Technology through Story Completion.",
                    "Using Remote Controlled Speech Agents to Explore Music Experience in Context.",
                    "'A Modern Up-To-Date Laptop' - Vagueness in Natural Language Queries for Product Search.",
                    "Tracing Design: Practitioner Accounts of Design Value, Documentation & Practices.",
                    "Tensions in Enacting a Design Philosophy in UX Practice.",
                    "Inarticulate Devices: Critical Encounters with Network Technologies in Research Through Design.",
                    "Parallels, Tangents, and Loops: Reflections on the 'Through' Part of RtD.",
                    "Fragile! Handle with Care: The Morse Things.",
                    "Research Journeys: Making the Invisible, Visual.",
                    "BuSiNec - Studying the Effects of a Busyness Signifying Necklace in the Wild.",
                    "Overcoming Reserve - Supporting Professional Appropriation of Interactive Costumes.",
                    "SoundWear: Effect of Non-speech Sound Augmentation on the Outdoor Play Experience of Children.",
                    "Monarch V2: An Iterative Design Approach to Prototyping a Wearable Electronics Project.",
                    "Keeping the Data within the Garment: Balancing Sensing and Actuating in Fashion Technology."
                ]
            },
            {
                "sub_name_abbr": "conf/ACMdis/2020c",
                "sub_name": "DIS '20: Designing Interactive Systems Conference 2020, Eindhoven, The Netherlands, July 6-10, 2020, Companion Volume.",
                "count": 109,
                "papers": [
                    "Exploring Public Playgrounds through A Data-Enabled Design Approach.",
                    "Ivy: Reading a Critical Design for Sedentary Behavior in the Office Context.",
                    "An Analytical Visualization of Local Running Activity on a Public Display.",
                    "The Hub: Facilitating Walking Meetings through a Network of Interactive Devices.",
                    "Designing Interactive Clothing to Raise Awareness of and Comfort the Wearer Suffering from Anxiety.",
                    "Serious Games for Professional Skills: The Design of an Escape Room to Explore the Possibilities of eMental Health.",
                    "MindPeaks: Formative Evaluation Method of Mindfulness Meditation Apps.",
                    "Stakeholder Perspectives on Design Interventions in Dementia Care.",
                    "Exploring Complementarity of Professional Information and Online Health Communities in an Application.",
                    "Designing a Tablet-Based Application for Self-Assessment Questionnaires with Nursing Home Residents.",
                    "Disabled and Design Researcher: An Unexpected Relationship?",
                    "Beyond \"Assistive\": Four Tensions in the Design of AAL Based on the Capability Approach.",
                    "Understanding How Audio Mediates Experiences of Reminiscence for People Living with Blindness.",
                    "Co-Designing Assistive Tools to Support Social Interactions by Individuals Living with Deafblindness.",
                    "What Gestures Do Users with Visual Impairments Prefer to Interact with Smart Devices?: And How Much We Know About It.",
                    "BusMyFriend: Designing a Bus Reservation Service for People with Visual Impairments in Taipei.",
                    "Presley: Designing Non-Obtrusive Tactile Rhythmic Wearable Devices for Improving Speech Fluency.",
                    "CodeRhythm: Designing Inclusive Tangible Programming Blocks.",
                    "The Osteoarthritis-Journey: Patients' Development of Long-Term Motivation.",
                    "CyberGuardians: Improving Community Cyber Resilience Through Embedded Peer-to-Peer Support.",
                    "Full Frontal Intimacy - on HCI, Design & Intimacy.",
                    "Somehow They Are Never Horny!",
                    "Project Us: A Wearable for Enhancing Empathy.",
                    "Designing for the Emotional Pregnancy.",
                    "EmotiTactor: Emotional Expression of Robotic Physical Contact.",
                    "Invisiborders: Wearable Politics.",
                    "Unpacking Forms of Relatedness around Older People and Telecare.",
                    "Fictional, Interactive Narrative as a Foundation to Talk about Racism.",
                    "Bridging Internet Coverage Gaps among Nomadic Pastoralists in Namibia.",
                    "Messy Fieldwork: A Natural Necessity or a Result of Western Origins and Perspectives?",
                    "Medieval Robots: The Role of Historical Automata in the Design of Future Robots.",
                    "The Marios and Luigis of Design: Design Plumbers Wanted!",
                    "Ethnographic Fictions: Research for Speculative Design.",
                    "Beyond Human-Centered Design: Proposing a Biocentric View on Design Research Involving Vegetal Subjects.",
                    "Becoming Travelers: Enabling the Material Drift.",
                    "Exploring Location Histories as a Design Material for Reflection with Memory Compass & Memory Tracer.",
                    "Towards Making Children Independent in Design.",
                    "Circular HCI: Tools for Embedding Circular Thinking in Material-Driven Design.",
                    "Foam Sheets as Material for Fabricating Large and Functional Soft Objects.",
                    "When Do Design Workshops Work (or Not)?",
                    "Designing Human-Automation Collaboration for Predictive Maintenance.",
                    "Post-human Interaction Design, Yes, but Cautiously.",
                    "Experts in the Shadow of Algorithmic Systems: Exploring Intelligibility in a Decision-Making Context.",
                    "The Expert of Oz: A Two-sided Study Paradigm for Intelligent Systems.",
                    "Sybil: A Divinatory Home Device.",
                    "Living with RITA: Tenants, Landlords and Agents Trusting Agents.",
                    "Envisioning Haptic Design for Immersive Virtual Environments.",
                    "The Importance of Data Curation for Data Physicalization.",
                    "From Controls on the Steering Wheel to Controls on the Finger: Using Smart Rings for In-Vehicle Interactions.",
                    "NaMemo: Enhancing Lecturers' Interpersonal Competence of Remembering Students' Names.",
                    "Investigating Opaque Infrastructures: The Desktop Odometer.",
                    "Roomba+Clips Cam: Exploring Unpredictable Autonomy in Everyday Smart Systems.",
                    "Dash Lane: An Adaptive Exergame for People Using Manual Wheelchairs.",
                    "Playing With Shadows: An Exploration of Calm Game Interaction.",
                    "Ivy: A Qualitative Interface to Reduce Sedentary Behavior in the Office Context.",
                    "WORM-E: An Interactive Toy Enriching Children's Bodily and Social Play.",
                    "Ruta, a Loom for Making Sense of Industrial Weaving.",
                    "The Office Jungle: A Vision for Wildness to Turn Offices into Jungles.",
                    "LUEUR: Exploring the Tangible Interaction of Light by Visuo-Haptic Illusions.",
                    "Browser Based Digital Sticky Notes for Design Thinking.",
                    "A Demonstration of SoundWear: Wearable Device Using Sound Augmentation to Enrich Open-ended Outdoor Play Experience of Children.",
                    "Designing Towards Inward-Oriented Fashion Technology: Demo Projects.",
                    "Together in Shape: A Co-responsibility System to Support Bariatric Lifestyle Changes.",
                    "Demonstration for Weaving a Second Skin: Exploring Opportunities for Crafting On-Skin Interfaces Through Weaving.",
                    "IoT Communicator: A Physical Interface for Expressing Situational Info of an IoT System.",
                    "Urban AI: Formulating an Agenda for the Interdisciplinary Research of Artificial Intelligence in Cities.",
                    "Fantastic(e)ating Food Futures: Reimagining Human Food Interaction.",
                    "Designing with More-than-Human Food Practices for Climate-Resilience.",
                    "Speculative and Critical Design in Education: Practice and Perspectives.",
                    "The Nature of Biodesigned Systems: Directions for HCI.",
                    "Weaving Healthy Behaviors into New Technology Routines: Designing in (and for) the COVID-19 Work-from-Home Period.",
                    "More-Than-Human Design and AI: In Conversation with Agents.",
                    "RtD in Situ: Discussing the Domains and Impact of Design Research.",
                    "Don't Blush: Sexuality, Aging & Design.",
                    "Designing for Tangible (Un-)Connectedness.",
                    "Communicate, Critique and Co-create (CCC) Future Technologies through Design Fictions in VR Environment.",
                    "Designing for the End of Life of IoT Objects.",
                    "Expressive/Sensitive: Full Day Workshop at DIS 2020.",
                    "Mental Wellbeing: Future Agenda Drawing from Design, HCI and Big Data.",
                    "Designing Futures of Money and FinTech.",
                    "Making Civic Initiatives Last: Ecosystems, Technologies, Approaches and Challenges.",
                    "Stymphalian Birds - Exploring the Aesthetics of A Hybrid Textile.",
                    "Ministry of Multispecies Communications.",
                    "Designing a Radio-Tuner-Thing; Transparency as Metaphor for our Experience of Objects and Things.",
                    "A Cloud, A Gathering, An Echo: Performing Network Technology.",
                    "Embracing Imperfection in the Age of Digital Reproduction.",
                    "re|Traces of Search: Exploring Human-Software Entanglements Through the Search Engine.",
                    "Disobedient Antennas: Breaking the Rules of Textile Antenna Design.",
                    "Ghosts in the Smart Home.",
                    "Eccentric Sensing: Exploring Ubiquity, Distribution, and Autonomy in Everyday Sensing Technologies.",
                    "Burglar Alarm: More Than 100 Years of Smart Textiles.",
                    "Drum Roll: A Data Physicalization of Real-Time Radiation Sensor Readings.",
                    "Latent Sheep Dreaming: : Machine for Extrapolated Visual Inception.",
                    "Wearing the Invisible: Wearable Manifestations of Embodied Experiences.",
                    "Awareness of Things: Designing Novel Data for Future Daily Objects.",
                    "A Contemporary Way of Playing - Designing Interactive Urban Play for Playful Placemaking.",
                    "Co-located Social Engineering Through Novel Technology Design.",
                    "Exploring the Design Space of Embodied Architectonic Interaction.",
                    "Careful Design: Implicit Interactions with Care, Taboo, and Humor.",
                    "Unobtrusive Interfaces for Historical and Culturally Sensitive Places.",
                    "The Data Hungry Home: Humans Harvesting Data for Living Devices.",
                    "Mine, Yours or Amazon's?: Designing Agent Ownership and Affiliation.",
                    "Decentring the Human in Digital Making - Towards Embodied Mattering.",
                    "Squeeze Interaction in Physical & Occupational Therapy.",
                    "Designing with the Body: Addressing Emotion Regulation and Expression.",
                    "Plantimate: Personality Augmentation for Fostering Empathy Towards Plants.",
                    "AICA: Artificial Intelligence Conversation Assistant.",
                    "Labeling: The Reflective Design of Socialized Gender Classification.",
                    "AI-Bots as Influencers in Social Behavior - A Speculative Concept."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "DIS 2019",
        "info": "San Diego, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ACMdis/2019",
                "sub_name": "Proceedings of the 2019 on Designing Interactive Systems Conference, DIS 2019, San Diego, CA, USA, June 23-28, 2019.",
                "count": 125,
                "papers": [
                    "The Role of Space Technology to Support Sustainable Development.",
                    "Virtual Reality and the Feeling of Virtue: Women of Color Narrators, Enforced Hospitality, and the Leveraging of Empathy.",
                    "Screen Smashing: Iconoclasty in an Age of Illusionary Intelligence (Sheridan See C&C'19 id# cckn07dis for correct DOI & pdf).",
                    "The Stories People Tell About The Home Through IoT Toolkits.",
                    "Turker Tales: Integrating Tangential Play into Crowd Work.",
                    "Biographical Prototypes: Reimagining Recognition and Disability in Design.",
                    "Evaluating the Pleasures of Agency in Shiva's Rangoli, a Tangible Storytelling Installation.",
                    "Creating Persona Skeletons from Imbalanced Datasets - A Case Study using U.S. Older Adults' Health Data.",
                    "Foregrounding Everyday Sounds in Dementia.",
                    "Activities as a Gateway to Sustained Subjective Well-Being Mediated by Products.",
                    "Performance by Design: Supporting Decisions Around Indoor Air Quality in Offices.",
                    "Making Up Instruments: Design Fiction for Value Discovery in Communities of Musical Practice.",
                    "muRedder: Shredding Speaker for Ephemeral Musical Experience.",
                    "Making Sense of Sensors: Discovery Through Craft Practice With an Open-Ended Sensor Material.",
                    "ListeningCups: A Case of Data Tactility and Data Stories.",
                    "Co-notate: Exploring Real-time Annotations to Capture Situational Design Knowledge.",
                    "Sketching and Ideation Activities for Situated Visualization Design.",
                    "User Experience (UX) Capacity-Building: A Conceptual Model and Research Agenda.",
                    "I Beg to Differ: Soft Conflicts in Collaborative Design Using Design Fictions.",
                    "Keep the Ball Rolling: Designing Game-Based Tangible VR for Spatial Penetrative Thinking Ability.",
                    "PneumAct: Pneumatic Kinesthetic Actuation of Body Joints in Virtual Reality Environments.",
                    "Understanding Emerging Design Practices for Avatar Systems in the Commercial Social VR Ecology.",
                    "Perch to Fly: Embodied Virtual Reality Flying Locomotion with a Flexible Perching Stance.",
                    "Designing for Ballet Classes: Identifying and Mitigating Communication Challenges Between Dancers and Teachers.",
                    "Devising Interactive Theatre: Trajectories of Production with Complex Bespoke Technologies.",
                    "Examining Interdependencies and Constraints in Co-Creation.",
                    "Exploring the Design of Social VR Experiences with Older Adults.",
                    "Mannequette: Understanding and Enabling Collaboration and Creativity on Avant-Garde Fashion-Tech Runways.",
                    "\"The Printer is Telling Me about Itself\": Supporting the Appropriation of Hardware by Using Projection Mapping.",
                    "The Tilting Bowl: Electronic Design for a Research Product.",
                    "Mediating Relatedness for Adolescents with ME: Reducing Isolation through Minimal Interactions with a Robot Avatar.",
                    "Examining Online Practices of an Autism Parent Community in Turkey: Goals, Needs, and Opportunities.",
                    "\"That's the Way Sighted People Do It\": What Blind Parents Can Teach Technology Designers About Co-Reading with Children.",
                    "The Cross-Sensory Globe: Participatory Design of a 3D Audio-Tactile Globe Prototype for Blind and Low-Vision Users to Learn Geography.",
                    "Sensing is Believing: What People Think Biosensors Can Reveal About Thoughts and Feelings.",
                    "Judgment Call the Game: Using Value Sensitive Design and Design Fiction to Surface Ethical Concerns Related to Technology.",
                    "A Design Approach towards Affording the Trend of Privacy.",
                    "Biometric Mirror: Exploring Ethical Opinions towards Facial Analysis and Automated Decision-Making.",
                    "Virtually the Same Experience?: Learning from User Experience Evaluation of In-vehicle Systems in VR and in the Field.",
                    "AV-Pedestrian Interaction Design Using a Pedestrian Mixed Traffic Simulator.",
                    "You Invaded my Tracking Space! Using Augmented Virtuality for Spotting Passersby in Room-Scale Virtual Reality.",
                    "Should I Interrupt or Not?: Understanding Interruptions in Head-Mounted Display Settings.",
                    "Privacy, Patriarchy, and Participation on Social Media.",
                    "Anticipating Smart Home Security and Privacy Threats with Survivors of Intimate Partner Abuse.",
                    "Vivewell: Speculating Near-Future Menstrual Tracking through Current Data Practices.",
                    "Ovum: Designing for Fertility Tracking as a Shared and Domestic Experience.",
                    "Sharing 9-1-1 Video Call Information between Dispatchers and Firefighters During Everyday Emergencies.",
                    "Clearing the Smoke: The Changing Identities and Work in Firefighters.",
                    "How do Gestures Matter for Mutual Awareness in Cockpits?: Disclosing Interactions through Graphical Representations.",
                    "Beepless: Using Peripheral Interaction in an Intensive Care Setting.",
                    "A Survey of Users' Expectations Towards On-body Companion Robots.",
                    "Re-Embodiment and Co-Embodiment: Exploration of social presence for robots and conversational agents.",
                    "Negotiating the Creative Space in Human-Robot Collaborative Design.",
                    "Interaction Needs and Opportunities for Failing Robots.",
                    "Understanding Embodied State Using Speculative Artifacts.",
                    "Sensorstation: Exploring Simple Sensor Data in the Context of a Shared Apartment.",
                    "Bespoke Booklets: A Method for Situated Co-Speculation.",
                    "Astral: Prototyping Mobile and Smart Object Interactive Behaviours Using Familiar Applications.",
                    "Designing Interactive Manual Wheelchair Skills Training for Children.",
                    "Magical Realism and Augmented Reality: Designing Apps with Children in a Cultural Institution.",
                    "A Scenario-Based Methodology for Exploring Risks: Children and Programmable IoT.",
                    "See the World Through the Eyes of a Child: Learning from children's cognitive maps for the design of child-targeted locative systems.",
                    "FamilySong: Designing to Enable Music for Connection and Culture in Internationally Distributed Families.",
                    "Chronoscope: Designing Temporally Diverse Interactions with Personal Digital Photo Collections.",
                    "Personalised Soundscapes in Homes.",
                    "Peekaboo Cam: Designing an Observational Camera for Home Ecologies Concerning Privacy.",
                    "Shedding Light: Integrating Bioimaging Technologies into the Design of an Interactive Museum Exhibit.",
                    "Exploring the Intersection of Emotional Literacy and Computational Modeling Using Scratch.",
                    "How Peripheral Data Visualisation Systems Support Secondary School Teachers during VLE-Supported Lessons.",
                    "Design in the HCI Classroom: Setting a Research Agenda.",
                    "Non-Rigid HCI: A Review of Deformable Interfaces and Input.",
                    "Phosphenes: Crafting Resistive Heaters within Thermoreactive Composites.",
                    "Sensing Kirigami.",
                    "Lifting Kirigami Actuators Up Where They Belong: Possibilities for SCI.",
                    "ExpanDial: Designing a Shape-Changing Dial.",
                    "DynaKnob: Combining Haptic Force Feedback and Shape Change.",
                    "MorphIO: Entirely Soft Sensing and Actuation Modules for Programming Shape Changes through Tangible Interaction.",
                    "Seamless Seams: Crafting Techniques for Embedding Fabrics with Interactive Actuation.",
                    "Design Framework for Social Wearables.",
                    "Enlightened Yoga: Designing an Augmented Class with Wearable Lights to Support Instruction.",
                    "Use Your Head! Exploring Interaction Modalities for Hat Technologies.",
                    "Satisfying a Conversation with Materials for Dynamic Fabrics.",
                    "V.Ra: An In-Situ Visual Authoring System for Robot-IoT Task Planning with Augmented Reality.",
                    "The Apple Does Fall Far from the Tree: User Separation of a System from its Developers in Human-Automation Trust Repair.",
                    "Designing and Prototyping from the Perspective of AI in the Wild.",
                    "Effect of Interaction Design on the Human Experience with Interactive Reinforcement Learning.",
                    "E-Pad: Large Display Pointing in a Continuous Interaction Space around a Mobile Device.",
                    "Mobile Devices in Programming Contexts: A Review of the Design Space and Processes.",
                    "Monomizo: A Tangible Desktop Artifact Providing Schedules from E-ink Screen to Paper.",
                    "Mobile Realities: Designing for the Medium of Smartphone-VR.",
                    "Towards a Design Framework for Trust in Digital Civics.",
                    "Roam-IO: Engaging with People Tracking Data through an Interactive Physical Data Installation.",
                    "The Civic Data Deluge: Understanding the Challenges of Analyzing Large-Scale Community Input.",
                    "Flowing Bodies: Exploring the Micro and Macro Scales of Bodily Interactions with Urban Media Installations.",
                    "Making an Interactive Dance Piece: Tensions in Integrating Technology in Art.",
                    "Do You Have to Pee?: A Design Space for Intimate and Somatic Data.",
                    "Circus, Play and Technology Probes: Training Body Awareness and Control with Children.",
                    "Teaching Soma Design.",
                    "\"Co-riding With My eBike to Get Green Lights\".",
                    "Chasing Play Potentials: Towards an Increasingly Situated and Emergent Approach to Everyday Play Design.",
                    "Taste Your Emotions: An Exploration of the Relationship between Taste and Emotional Experience for HCI.",
                    "Play Poles: Towards IoT Resources for Outdoor Play.",
                    "Designing with Waste: A Situated Inquiry into the Material Excess of Making.",
                    "LiveNature: Ambient Display and Social Robot-Facilitated Multi-Sensory Engagement for People with Dementia.",
                    "Listening to Save Wildlife: Lessons Learnt from Use of Acoustic Technology by a Species Recovery Team.",
                    "Our Symbiotic Life: An Exploration of Interspecies Relations.",
                    "Workshops as Boundary Objects for Data Infrastructure Literacy and Design.",
                    "Diversifying the Domestic: A Design Inquiry into Collective and Mobile Living.",
                    "Data Rhetoric and Uneasy Alliances: Data Advocacy in US Labor History.",
                    "Design and Diversity?: Speculations on What Could Go Wrong.",
                    "How the Arrangement of Content and Location Impact the Use of Multiple Distributed Public Displays.",
                    "OmniGlobe: An Interactive I/O System For Symmetric 360-Degree Video Communication.",
                    "Dead Angles of Personalization: Integrating Curation Algorithms in the Fabric of Design.",
                    "BlocKit: A Physical Kit for Materializing and Designing for Blockchain Infrastructure.",
                    "Keeping and Discarding Personal Data: Exploring a Design Space.",
                    "Towards Affective Chronometry: Exploring Smart Materials and Actuators for Real-time Representations of Changes in Arousal.",
                    "Predictive Prototyping for Real-World Applications: A model-based evaluation approach based on the ACT-R cognitive architecture.",
                    "Feeding the World with Data: Visions of Data-Driven Farming.",
                    "Talk to Me Intelligibly: Investigating An Answer Space to Match the User's Language in Visual Analysis.",
                    "Vitro: Designing a Voice Assistant for the Scientific Lab Workplace.",
                    "Exploring Interaction with Remote Autonomous Systems using Conversational Agents.",
                    "Once a Kind Friend is Now a Thing: Understanding How Conversational Agents at Home are Forgotten.",
                    "Hacking Difference in Indonesia: The Ambivalences of Designing for Alternative Futures.",
                    "Involving Syrian Refugees in Design Research: Lessons Learnt from the Field.",
                    "Exploring Rural Community Practices in HIV Management for the Design of Technology for Hypertensive Patients Living with HIV."
                ]
            },
            {
                "sub_name_abbr": "conf/ACMdis/2019c",
                "sub_name": "Companion Publication of the 2019 on Designing Interactive Systems Conference, DIS 2019, San Diego, CA, USA, June 23-28, 2019.",
                "count": 78,
                "papers": [
                    "Chronoscope: A Near-eye Tangible Device for Interacting with Photos In and Across Time.",
                    "Anmoji: A Novel Body-Controlled Massage Robot.",
                    "Citizen Dialogue Kit: Public Polling and Data Visualization Displays for Bottom-Up Citizen Participation.",
                    "The Creativity Kernel: An Open Platform for Distributed Design Intelligence.",
                    "PintAR: Sketching Spatial Experiences in Augmented Reality.",
                    "Designing to Reflect Our Better Nature.",
                    "Cook Your Way: Political Game Design with Alternative Controllers.",
                    "Shiva's Rangoli: Tangible Interactive Storytelling in Ambient Environments.",
                    "Exploring States Of Mind: Emotion Visualization With Bio-Feedback Sensors In A 3D Environment.",
                    "muRedder: Shredding Speaker for Ephemeral Musical Experience.",
                    "MixedUX: A Mixed Prototyping Framework for Usability Testing in Augmented Reality.",
                    "Table War: A Tabletop Projection Game for Attack-and-Defence Battle.",
                    "EquiDot: Art Reflecting The Social Constructs.",
                    "Ambivalence: Simultaneous Tactile Experiences of Using and Recycling Smartphones.",
                    "Sentic: A Tailored Interface Design for People with Dementia to Access Music.",
                    "FamilySong: A Design for Managing Synchronous Intergenerational Remote Music Sharing.",
                    "Development of an ICT-based Training System for People with Dementia.",
                    "Mycelium Artifacts: Exploring Shapeable and Accessible Biofabrication.",
                    "GameLight - Gamification of the Outdoor Cycling Experience.",
                    "Exploring Physical Intelligibility and Control with Smart Speakers.",
                    "Alternative Vision of Living with IoT.",
                    "Critical Controllers: How Alternative Game Controllers Foster Reflective Game Design.",
                    "Designing Self-tracking Devices for Vulnerable Chronic Ill.",
                    "Supporting Collaborative Use of Self-Tracking Data in the Context of Healthcare and Chronic Conditions.",
                    "Using Passenger Elicitation for Developing Gesture Design Guidelines for Adjusting Highly Automated Vehicle Dynamics.",
                    "Designing with, through, and for Human-Nature Interaction.",
                    "Designing for Sharing and Trust: Opening the Access to Personal Data.",
                    "Community Indicator Data Dashboards as Infrastructures for Data Literacy.",
                    "Understanding the Benefits and Drawbacks of Shape Change in Contrast or Addition to other Modalities.",
                    "Exploring Place-based, Physical Social Networks: A Case-study of Starbucks in a University Campus.",
                    "Materializing Interpretability: Exploring Meaning in Algorithmic Systems.",
                    "Exploring Public Engagement with the Social Impact of Algorithms.",
                    "Tangiball: Dynamic Embodied Tangible Interaction with a Ball in Virtual Reality.",
                    "The Promise and Limits of Tailorability for Turkopticon.",
                    "A World Following Farmer Almanac: Speculation on Lifestyle Interweaving Folk Religion and Smart Home.",
                    "Can Personas Speak? Biopolitics in Design Processes.",
                    "Ideas of Things: The IOT Design Kit.",
                    "Adding Voices to Support Web Navigation Among a Low Digital Literacy Group.",
                    "Stop Wasting, Start Tasting! Design Speculations for Reducing Food Waste in The Hospitality Sector.",
                    "Proxemics Play: Exploring the Interplay between Mobile Devices and Interiors.",
                    "HOT SWAP: Probing Embodied Game Interfaces With Reconfigurable Controllers.",
                    "How the Design of Social Technology Fails Rural America.",
                    "Participatory Design and the Future of Rural LGBTQ Communities.",
                    "Designing Mobile Presentation Apps for North American K-12 Teachers.",
                    "FlipMe: Exploring Tangible Peer-to-Peer Communication in On-Line-Learning.",
                    "Drogon, the Thermal-Sensing Drone: Exploring Aerial Imagery as a Tool for Citizen Science Research.",
                    "The Implementation of MiRO, a Media-as-Place Computer Game.",
                    "Envisioning Reflective and Relaxing Design with ASMR.",
                    "Designing Internal Structure of Chocolate and Its Effect on Food Texture.",
                    "What Can We Expect from Navigating?: Exploring Navigation, Wearables and Data Through Critical Design Concepts.",
                    "Story-Me: Design of a System to Support Intergenerational Storytelling and Preservation for Older Adults.",
                    "Exploring the Reactions of Companion Animals as Unintended Users of Social Robots.",
                    "The Blind Processor - Embodying The Perspectives of an Interaction.",
                    "Design Daydreams: Juxtaposing Digital and Physical Inspiration.",
                    "MeMa: Designing the Memory Machine.",
                    "Supporting Natural Navigation for Running in Unknown Places.",
                    "PC Builder Hero: An Immersive Computer Building Workshop Experience in Virtual Reality.",
                    "Designing Technology to Support Safety for Transgender Women & Non-Binary People of Color.",
                    "Honk? Talk!: Designing Driver-to-Driver Communication Methods for Social Driving.",
                    "Designing calmworklight: Signaling Focus with a Desk Light.",
                    "VizEmo: Child Communication Technology for Learning Ambience.",
                    "Ageing Clouds: Novel yet Natural Support for Urban Exploration.",
                    "Introduction to Game Theory via an Interactive Gameplay Experience.",
                    "Recipes for Breaking Data Free: Alternative Interactions for Experiencing Personal Data.",
                    "Conceptualizing Care in the Everyday Work Practices of Machine Learning Developers.",
                    "Towards Low-burden In-situ Self-reporting: A Design Space Exploration.",
                    "Wwall: A Public Water Dispenser System to Motivate Regular Water Intake in the Office Environment.",
                    "Academic Accomplices: Practical Strategies for Research Justice.",
                    "Intersections in HCI, Design and Dementia: Inclusivity in Participatory Approaches.",
                    "Crafting and Tasting Issues in Everyday Human-Food Interactions.",
                    "At the Intersection of Culture and Method: Designing Feminist Action.",
                    "Designing at the End of the World.",
                    "Exploring, Defining, & Advancing Community-Driven Design for Social Impact.",
                    "Exploring Noticing as Method in Design Research.",
                    "Co-designing AI Futures: Integrating AI Ethics, Social Computing, and Design.",
                    "A Sample of One: First-Person Research Methods in HCI.",
                    "Larping (Live Action Role Playing) as an Embodied Design Research Method.",
                    "Towards a Research Agenda for Gameful Creativity."
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "DIS 2018",
        "info": "Hong Kong, China",
        "venues": [
            {
                "sub_name_abbr": "conf/ACMdis/2018",
                "sub_name": "Proceedings of the 2018 on Designing Interactive Systems Conference 2018, DIS 2018, Hong Kong, China, June 09-13, 2018.",
                "count": 114,
                "papers": [
                    "To Study Interaction and Interfaces: An Approach and Some Findings.",
                    "Data and Design for Action.",
                    "Design Research, for What?: Different Perspectives on Design Research.",
                    "Diversifying Design Imaginations.",
                    "Exploring Trust in Digital Civics.",
                    "Beyond the Prototype: Maintenance, Collective Responsibility, and Public IoT.",
                    "Designing Future Employment Applications for Underserved Job Seekers: A Speed Dating Study.",
                    "Designing for Intersections.",
                    "VMotion: Designing a Seamless Walking Experience in VR.",
                    "Attending to Breath: Exploring How the Cues in a Virtual Environment Guide the Attention to Breath and Shape the Quality of Experience to Support Mindfulness.",
                    "Your Place and Mine: Designing a Shared VR Experience for Remotely Located Users.",
                    "VRSpinning: Exploring the Design Space of a 1D Rotation Platform to Increase the Perception of Self-Motion in VR.",
                    "A Situated Exploration of Designing for Personal Health Ecosystems through Data-enabled Design.",
                    "Social Support Mosaic: Understanding Mental Health Management Practice on College Campus.",
                    "Examining Self-Tracking by People with Migraine: Goals, Needs, and Opportunities in a Chronic Health Condition.",
                    "Exploring Self-Defining Memories in Old Age and their Digital Cues.",
                    "Making Grooves with Needles: Using e-textiles to Encourage Gender Diversity in Embedded Audio Systems Design.",
                    "Open Design, Inclusivity and the Intersections of Making.",
                    "Statement Making: A Maker Fashion Show Foregrounding Feminism, Gender, and Transdisciplinarity.",
                    "Exploring Aesthetic Enhancement of Wearable Technologies for Deaf Women.",
                    "Interweaving Visual and Audio-Haptic Augmented Reality for Urban Exploration.",
                    "Scale Impacts Elicited Gestures for Manipulating Holograms: Implications for AR Gesture Design.",
                    "Bare-Handed 3D Drawing in Augmented Reality.",
                    "Body as a Canvas: An Exploration on the Role of the Body as Display of Digital Information.",
                    "Designing Interactive Visual Supports for Children with Special Needs in a School Setting.",
                    "Design Artefacts to Support People with a Disability to Build Personal Infrastructures.",
                    "The Use(fulness) of Therapeutic Toys: Practice-derived Design Lenses for Toy Design.",
                    "Identifying Children's Fidget Object Preferences: Toward Exploring the Impacts of Fidgeting and Fidget-Friendly Tangibles.",
                    "Designing for an other Home: Expanding and Speculating on Different Forms of Domestic Life.",
                    "ActuEating: Designing, Studying and Exploring Actuating Decorative Artefacts.",
                    "Designing the IoT Sandbox.",
                    "Exploring Hygge as a Desirable Design Vision for the Sustainable Smart Home.",
                    "Generating Mobile Application Onboarding Insights Through Minimalist Instruction.",
                    "How Do Sketching and Non-Sketching Actions Convey Design Intent?",
                    "Designing for Situational Visual Impairments: Supporting Early-Career Designers of Mobile Content.",
                    "From Hyperlinks to Hypercues: Entity-Based Affordances for Fluid Information Exploration.",
                    "Designing Connected Resources for Older People.",
                    "Conducting Qualitative Fieldwork with Ageing Saudis: A Visual Diary.",
                    "Designing the Lost Self: Older Adults' Self-representations in Online Games.",
                    "Investigating Gamification for Seniors Aged 75+.",
                    "An Annotated Portfolio on Doing Postphenomenology Through Research Products.",
                    "Understanding Craft-Based Inquiry in HCI.",
                    "Bricks, Blocks, Boxes, Cubes, and Dice: On the Role of Cubic Shapes for the Design of Tangible Interactive Devices.",
                    "Making Things Apart: Gaining Material Understanding.",
                    "Words Become Worlds: The LIT ROOM, a Literacy Support Tool at Room-Scale.",
                    "Deepening Visitor Engagement with Museum Exhibits through Hand-crafted Visual Markers.",
                    "TouchBranch: Understanding Interpersonal Touches in Interactive Installation.",
                    "Unlocking the Interactive Office: Concurrent Prototyping Approach.",
                    "\"It's hard to argue with a computer\": Investigating Psychotherapists' Attitudes towards Automated Evaluation.",
                    "Grounding Interactive Machine Learning Tool Design in How Non-Experts Actually Build Models.",
                    "Investigating How Experienced UX Designers Effectively Work with Machine Learning.",
                    "Interaction Challenges in AI Equipped Environments Built to Teach Foreign Languages Through Dialogue and Task-Completion.",
                    "Designing for Multiple Hand Grips and Body Postures within the UX of a moving Smartphone.",
                    "Gestures for Smart Rings: Empirical Results, Insights, and Design Implications.",
                    "Interactive and Situated Guidelines to Help Users Design a Personal Desk that Fits Their Bodies.",
                    "EMGuitar: Assisting Guitar Playing with Electromyography.",
                    "Improvising with an Audience-Controlled Robot Performer.",
                    "Reconfiguring the Appearance and Expression of Social Robots by Acknowledging their Otherness.",
                    "Designing Expressions of Movement Qualities.",
                    "Aeroquake: Drone Augmented Dance.",
                    "Towards Materials for Computational Heirlooms: Blockchains and Wristwatches.",
                    "Design Inspirations from the Wisdom of Years.",
                    "Respectful Disconnection: Understanding Long Distance Family Relationships in a South Korean Context.",
                    "Understanding Automatic Conveyor-belt Columbaria: Emerging Sites of Interactive Memorialization in Japan.",
                    "Revealing Tensions in Autobiographical Design in HCI.",
                    "Living Without a Mobile Phone: An Autoethnography.",
                    "Photography as a Design Research Tool into Natureculture.",
                    "Behavior Change Design Sprints.",
                    "Viking VR: Designing a Virtual Reality Experience for a Museum.",
                    "Immersive Design Fiction: Using VR to Prototype Speculative Interfaces and Interaction Rituals within a Virtual Storyworld.",
                    "SketchStudio: Experience Prototyping with 2.5-Dimensional Animated Design Scenarios.",
                    "How Display Shapes Affect 360-Degree Panoramic Video Communication.",
                    "\"Hey Alexa, What's Up?\": A Mixed-Methods Studies of In-Home Conversational Agent Usage.",
                    "Intimate Futures: Staying with the Trouble of Digital Personal Assistants through Design Fiction.",
                    "Designing for Workplace Reflection: A Chat and Voice-Based Conversational Agent.",
                    "Evaluating and Informing the Design of Chatbots.",
                    "The Emerging Nature of Participation in Multispecies Interaction Design.",
                    "BubbleTalk: Enriching Experience with Fish by Supporting Human Behavior.",
                    "Confronting People's Fears about Bats: Combining Multi-modal and Environmentally Sensed Data to Promote Curiosity and Discovery.",
                    "Hiking Hacks: Workshop Model for Exploring Wilderness Interaction Design.",
                    "Social Media Is Polarized, Social Media Is Polarized: Towards a New Design Agenda for Mitigating Polarization.",
                    "Grumble to Policy Need: Deriving Public Policy Needs from Daily Life on Social Media Platform.",
                    "Caller Needs and Reactions to 9-1-1 Video Calling for Emergencies.",
                    "POSEIDON - Passive-acoustic Ocean Sensor for Entertainment and Interactive Data-gathering in Opportunistic Nautical-activities.",
                    "Assessment of Perceptual-Cognitive Abilities among Athletes in Virtual Environments: Exploring Interaction Concepts for Soccer Players.",
                    "Flow State Feedback Through Sports Wearables: A Case Study on Tennis.",
                    "Movement Correction in Instructed Fitness Training: Design Recommendations and Opportunities.",
                    "Botanical Printer: An Exploration on Interaction Design with Plantness.",
                    "Designing Blo-nut: Design Principles, Choreography and Otherness in an Expressive Social Robot.",
                    "Multiscale Design Strategies in a Landscape Architecture Classroom.",
                    "Plain2Fun: Augmenting Ordinary Objects with Interactive Functions by Auto-Fabricating Surface Painted Circuits.",
                    "Design with Minimal Intervention: Drawing with Light and Cracks.",
                    "PARAMETRIC HABITAT: Virtual Catalog of Design Prototypes.",
                    "CutCAD - An Open-source Tool to Design 3D Objects in 2D.",
                    "Roaming Objects: Encoding Digital Histories of Use into Shared Objects and Tools.",
                    "ShareBox: Designing A Physical System to Support Resource Exchange in Local Communities.",
                    "Pinsight: A Novel Way of Creating and Sharing Digital Content through 'Things' in the Wild.",
                    "Stop the Noise! Enhancing Meaningfulness in Participatory Sensing with Community Level Indicators.",
                    "GazeForm: Dynamic Gaze-adaptive Touch Surface for Eyes-free Interaction in Airliner Cockpits.",
                    "WristOrigami: Exploring Foldable Design for Multi-Display Smartwatch.",
                    "Pressure or Movement?",
                    "Traffico: A Tangible Timetable Delivering Transportation Information between Schedules.",
                    "Twenty Years of Creativity Research in Human-Computer Interaction: Current State and Future Directions.",
                    "Guardians of Practice: A Contextual Inquiry of Failure-Mitigation Strategies within Creative Practices.",
                    "\"More than just Space\": Designing to Support Assemblage in Virtual Creative Hubs.",
                    "Prism: Enhancing Graphic Designers' Visual Research with Interactive Search Trails.",
                    "Investigating Proactive Search Support in Conversations.",
                    "Measuring the Learnability of Interactive Systems Using a Petri Net Based Approach.",
                    "A Multi-Phased Co-design of an Interactive Analytics System for MOBA Game Occurrences.",
                    "Design Guidelines for Assistance Systems Supporting Sustainable Purchase Decisions.",
                    "An Interface without A User: An Exploratory Design Study of Online Privacy Policies and Digital Legalese.",
                    "When BCIs have APIs: Design Fictions of Everyday Brain-Computer Interface Adoption.",
                    "Metaphor Cards: A How-to-Guide for Making and Using a Generative Metaphorical Design Toolkit.",
                    "Washing with the Wind: A Study of Scripting towards Sustainability."
                ]
            },
            {
                "sub_name_abbr": "conf/ACMdis/2018c",
                "sub_name": "Companion Publication of the 19th International ACM SIGACCESS Conference on Computers and Accessibility, DIS 2018, Hong Kong, China, June 09-13, 2018.",
                "count": 81,
                "papers": [
                    "Tangible Interactive Upper Limb Training Device.",
                    "Exploring Augmented Reality Approaches to Real-Time Captioning: A Preliminary Autoethnographic Study.",
                    "MaxiFab: Applied Fabrication to Advance Period Technologies.",
                    "Country Road Finder: Exploring Beauty when Driving Around.",
                    "Neither One is Enough: Exploring the Use of Wrist-worn Activity Trackers to Assist Acute Psychiatric Healthcare.",
                    "Bod-IDE: An Augmented Reality Sandbox for eFashion Garments.",
                    "Placing Music in Space: A Study on Music Appreciation with Spatial Mapping.",
                    "SilverCycling: Evaluating Persuasive Strategies to Promote Physical Activity among Older Adults.",
                    "Explorations on Reciprocal Interplay in Things Ecology.",
                    "Walkers' Union: Designing New Urban Walking Rituals with Blockchain.",
                    "Exploring Cognitive Playfulness Through Zero Interactions.",
                    "Exploring the Knowledge Creation Practices of UX Designers on Stack Exchange.",
                    "We Are Not All Makers: The Paradox of Plurality In The Maker Movement.",
                    "An Artistic Provocation to Explore Effects and Opportunities of Virtual Surreal Spaces.",
                    "Dark Intentions or Persuasion?: UX Designers' Activation of Stakeholder and User Values.",
                    "Designing Social Playware Mediated Communication with Contingent Feedback Devices.",
                    "Visualization Tool for Environmental Sensing and Public Health Data.",
                    "IdleBot: Exploring the Design of Serendipitous Artifacts.",
                    "Hacking Occupational Therapy Tools for Center-based Care.",
                    "Ring x2: Designing Gestures for Smart Rings using Temporal Calculus.",
                    "WiredRadio: A Study of Living with Radio Awareness.",
                    "Designing for Co-located and Virtual Social Interactions in Residential Care.",
                    "Body Inspired Design for Knitted Body-Protection Wearables.",
                    "Design Challenges for Reconnecting in Later Life: A Qualitative Study.",
                    "Exploring Dynamic Expressions on Soft Wearables for Physical Exercises.",
                    "Text Visualisation Tool for Exploring Digitised Historical Documents.",
                    "Once Upon a Future: An Audio Drama Game for Episodic Imagination.",
                    "Pick, Place, And Follow: A Ball Run for Visually Impaired Children.",
                    "Building a Community of Audio Game Designers - Towards an Online Audio Game Editor.",
                    "Giving up Control - A Speculative Air Pollution Mask to Reflect on Autonomy and Technology Design.",
                    "Human-Drone Interaction: Drone Delivery & Services for Social Events.",
                    "Ecphoria Player: Exploring, Revisiting, & Living-with a Lifetime of Digital Music.",
                    "ARtLens: Enhancing Museum Visitors' Engagement with African Art.",
                    "Dynamic Displays at Wrist for Real Time Visualization of Affective Data.",
                    "Can Interactive Systems Be Designed for Conviviality?: A Case Study.",
                    "Towards Multisensory Storming.",
                    "Designing Conversational Interfaces to Reduce Dissonance.",
                    "A Virtual Environment Gesture Interaction System for People with Dementia.",
                    "transFORM - A Cyber-Physical Environment Increasing Social Interaction and Place Attachment in Underused, Public Spaces.",
                    "Designing Systems in the Digital Immortality Era.",
                    "Visualising the Landscape of Human-Food Interaction Research.",
                    "MeTAP: A Personalized Spatial Memory Training for Improving Functional Autonomy of Adults with Mild Cognitive Impairments in China.",
                    "MemoryPin: Turning Digitally Co-Present Moments into Tangible Memory Keepsakes.",
                    "Using Experiential-Learning and Iterative Design to Benefit Colorado's Refugees.",
                    "Artifact Mixtape: Curating Music in Personal Tangible Artifacts.",
                    "Verbal Design: A Participatory Design Approach with Illiterate Patient User Groups.",
                    "Investigating the Effects of Legacy Bias: User Elicited Gestures from the End Users Perspective.",
                    "Designing Personalized Movement-based Representations to Support Yoga.",
                    "What's It Mean to \"Be Social\" in VR?: Mapping the Social VR Design Ecology.",
                    "MagicPAPER: An Integrated Shadow-Art Hardware Device Enabling Touch Interaction on Paper.",
                    "Expansion of Textile Expression Utilizing Op Art Methods and Transmissive Liquid Crystal Film, and Progress toward Its Use in Garments.",
                    "The \"Choose Your Own Beverage\" Table: Swing Compass in the Wild.",
                    "UMorph: Self-Change Tracker to Reflect Yourself to the Future and Past.",
                    "HeartMe: Thermochromic Display as An Expression of Heart Health.",
                    "SenseCenser: an Interactive Device for Sensing Incense Smoke & Supporting Memorialization Rituals in Japan.",
                    "Gaze Controlled Interface For Limited Mobility Environment.",
                    "RIPT: Improvising with an Audience-Sourced Performance Robot.",
                    "The Living Tree: Using Surface Transducers to Explore the Secret Life of Trees through Sonic Interactions.",
                    "LightSight: A Dice to Meet the Eyes.",
                    "SketchStudio: Rapid Prototyping Tool for 2.5D Animated Design Scenarios.",
                    "Monitoring the Emotional Flow of Blind People by Using Physiological Sensors and Smart Glasses.",
                    "Behavior Change Theory and Design: Translational Science Steps and Gaps.",
                    "Complex Intentions: A Methodology for Contemporary Design Practice.",
                    "Multiscale Curation: Supporting Collaborative Design and Ideation.",
                    "Hybrid Aesthetics: Design of New Media Practices within Digital Fabrication.",
                    "Connecting Couture: Engaging With the Crafted Textile Interface in an Internet of Things Ecology.",
                    "Rapid Smart Environment Prototyping for Early Conceptual Design.",
                    "Trust and Community Engagement in Digital Civics: Exploring Opportunities for Design.",
                    "Collaborative Design of Health Educational Materials on Anxiety to Increase Mental Health Literacy.",
                    "Design, Maintenance, and the Menstruating Body.",
                    "Older Adults Designing Avatars for Socializing.",
                    "Time, Temporality, and Slowness: Future Directions for Design Research.",
                    "From Artifacts to Architecture.",
                    "Designing for Everyday Care in Communities.",
                    "Let's Get Divorced: Constructing Knowledge Outcomes for Critical Design and Constructive Design Research.",
                    "The 'Next Billion Users': Designing for Emerging Markets.",
                    "Designing Interactive Systems to Support and Augment Creativity - A Roadmap for Research and Design.",
                    "Designing within Connected Systems.",
                    "Manipulating Reality?: Designing and Deploying Virtual Reality in Sensitive Settings.",
                    "Designing for Effective Interactions with Data in the Internet of Things.",
                    "Handmaking Food Ideals: Crafting the Design of Future Food-related Technologies."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "DIS 2017",
        "info": "Edinburgh, UK",
        "venues": [
            {
                "sub_name_abbr": "conf/ACMdis/2017",
                "sub_name": "Proceedings of the 2017 Conference on Designing Interactive Systems, DIS '17, Edinburgh, United Kingdom, June 10-14, 2017.",
                "count": 122,
                "papers": [
                    "The Third Infoscape: Opportunities for Design.",
                    "Control and Being Controlled: Exploring the use of Technology in an Immersive Theatre Performance.",
                    "Conceptualising Resourcefulness as a Dispersed Practice.",
                    "Aesthetic, Functional and Conceptual Provocation in Research Through Design.",
                    "Involving Autistics in User Experience Studies: A Critical Review.",
                    "Exploring Design Opportunities for a Context-Adaptive Medical Checklist Through Technology Probe Approach.",
                    "Design Features in Games for Health: Disciplinary and Interdisciplinary Expert Perspectives.",
                    "Participatory Design to Address Stigma with Adolescents with Type 1 Diabetes.",
                    "Designing Contestability: Interaction Design, Machine Learning, and Mental Health.",
                    "Attention from Afar: Simulating the Gazes of Remote Participants in Hybrid Meetings.",
                    "Gaze-Adaptive Above and On-Surface Interaction.",
                    "Let's Talk About X: Combining Image Recognition and Eye Gaze to Support Conversation for People with ALS.",
                    "\"MyEyes\": The Design and Evaluation of First Person View Video Streaming for Long-Distance Couples.",
                    "Design Techniques for Exploring Automotive Interaction in the Drive towards Automation.",
                    "What Lies Above: Alternative User Experiences Produced Through Focussing Attention on GNSS Infrastructure.",
                    "Designing Intelligent Assistant through User Participations.",
                    "Guided Selfies using Models of Portrait Aesthetics.",
                    "Reef: Exploring the Design Opportunity of Comfort-Aware Eco-Coaching Thermostats.",
                    "Prototyping Ubiquitous Imaging Surfaces.",
                    "Evaluating Interface Characteristics for Shared Lighting Systems in the Office Environment.",
                    "Supporting Cultural Heritage Professionals Adopting and Shaping Interactive Technologies in Museums.",
                    "The Evolution of a Scale Model as an Impromptu Design Tool.",
                    "Cairn: A Tangible Apparatus for Situated Data Collection, Visualization and Analysis.",
                    "[X]Changing Perspectives: An Interactive System for Participatory Sensemaking.",
                    "Video Prototyping for Interaction Design Across Multiple Displays in the Commercial Flight Deck.",
                    "Design Guidelines for Web Readability.",
                    "Translating Texture: Design as Integration.",
                    "The Moving Context Kit: Designing for Context Shifts in Multi-Device Experiences.",
                    "Thoughts and Tools for Crafting Colors: Implications from Designers' Behavior.",
                    "StressTree: A Metaphorical Visualization for Biofeedback-assisted Stress Management.",
                    "Turned On / Turned Off: Speculating on the Microchip-based Contraceptive Implant.",
                    "Mindfulness and Technology: Traces of A Middle Way.",
                    "Examining Localization Approaches for Community Health.",
                    "In Harmony: Making a Wearable Musical Instrument as a Case Study of using Boundary Objects in an Interdisciplinary Collaborative Design Process.",
                    "Interioractive: Smart Materials in the Hands of Designers and Architects for Designing Interactive Interiors.",
                    "Exploring Interactions and Perceptions of Kinetic Wearables.",
                    "AnimSkin: Fabricating Epidermis with Interactive, Functional and Aesthetic Color Animation.",
                    "Left Them 4 Dead: Perception of Humans versus Non-Player Character Teammates in Cooperative Gameplay.",
                    "Touchomatic: Interpersonal Touch Gaming In The Wild.",
                    "Audience Participation Games: Blurring the Line Between Player and Spectator.",
                    "AutoJam: Exploring Interactive Music Experiences in Stop-and-Go Traffic.",
                    "Image-based Emotion Feedback: How Does the Crowd Feel? And Why?",
                    "Designing for Self-Tracking of Emotion and Experience with Tangible Modality.",
                    "Designing Authentic Emotions for Non-Human Characters: A Study Evaluating Virtual Affective Behavior.",
                    "What Can Self-Reports and Acoustic Data Analyses on Emotions Tell Us?",
                    "Morse Things: A Design Inquiry into the Gap Between Things and Us.",
                    "Towards Commoditised Near Infrared Spectroscopy.",
                    "\"Proof in the Pudding\": Designing IoT Plants to Promote Wellbeing.",
                    "Fruit Are Heavy: A Prototype Public IoT System to Support Urban Foraging.",
                    "The Rise of Bots: A Survey of Conversational Interfaces, Patterns, and Paradigms.",
                    "Real-Fictional Entanglements: Using Science Fiction and Design Fiction to Interrogate Sensing Technologies.",
                    "Apply Now!: Fictional Job Postings as an Instrument to Discuss Interactive Futures of Work.",
                    "Tiles: A Card-based Ideation Toolkit for the Internet of Things.",
                    "De-emphasizing Content to Study the Relationship between Meaning, Messages, and Content in IM Systems.",
                    "Soil, Rock, and Snow: On Designing for Information Sharing in Outdoor Sports.",
                    "Applying Real-Time Text on Instant Messaging for a Rapid and Enriched Conversation Experience.",
                    "TransPoint: Real-Time Remote Lecturing via Adaptive Transparency.",
                    "FutureSelf: What Happens When We Forecast Self-Trackers? Future Health Statuses?",
                    "Designing Documentary Informatics.",
                    "Digital Systems and the Experience of Legacy.",
                    "The Autobiographical Design and Long Term Usage of an Always-On Video Recording System for the Home.",
                    "How Game Balancing Affects Play: Player Adaptation in an Exergame for Children with Cerebral Palsy.",
                    "Engaging Children Using a Digital Living Media System.",
                    "Calming Children When Drawing Blood Using Breath-based Biofeedback.",
                    "Enabling Collaboration in Learning Computer Programing Inclusive of Children with Vision Impairments.",
                    "Voodle: Vocal Doodling to Sketch Affective Robot Motion.",
                    "GUI Robots: Using Off-the-Shelf Robots as Tangible Input and Output Devices for Unmodified GUI Applications.",
                    "Robotic Table and Bench Enhance Mirror Type Social Telepresence.",
                    "CoilMove: An Actuated to-body Energy Transfer System.",
                    "The Visual and Beyond: Characterizing Experiences with Auditory, Haptic and Visual Data Representations.",
                    "Towards Personalized Visualization: Information Granularity, Situation, and Personality.",
                    "Recognition of Text and Shapes on a Large-Sized Head-Up Display.",
                    "The Impact of a Narrative Design Strategy for Information Visualization on a Public Display.",
                    "Understanding Creativity Methods in Design.",
                    "Creative Evaluation.",
                    "Logue: Unitizing Interactive Fictions for Co-creation.",
                    "The Rough Mile: Testing a Framework of Immersive Practice.",
                    "Designing Memory Probes to Inform Dialogue.",
                    "Giving Form to a Hedonic Haptics Player.",
                    "Wear.x: Developing Wearables that Embody Felt Experience.",
                    "Ori-mandu: Korean Dumpling into Whatever Shape You Want.",
                    "AscoltaMe: Retracing the Computational Expressivity of a Tactful Object for Sensitive Settings.",
                    "Translational Resources: Reducing the Gap Between Academic Research and HCI Practice.",
                    "Reviewing the Big Questions Literature;: or, Should HCI Have Big Questions?",
                    "Critical Design Research and Information Technology: Searching for Empowering Design.",
                    "Beyond Hybrids: Metaphors and Margins in Design.",
                    "\"Interview with Things\": A First-thing Perspective to Understand the Scooter's Everyday Socio-material Network in Taiwan.",
                    "\"Against Marrying a Stranger\": Marital Matchmaking Technologies in Saudi Arabia.",
                    "Navigating Media Use: Chinese Parents and Their Overseas Adolescent Children on WeChat.",
                    "Living Apart, Together: Cohousing as a Site for ICT Design.",
                    "Do-It-Yourself Empowerment as Experienced by Novice Makers with Disabilities.",
                    "Understanding Uncertainty in Measurement and Accommodating its Impact in 3D Modeling and Printing.",
                    "Hackerspace Tropes, Identities, and Community Values.",
                    "AnimaStage: Hands-on Animated Craft on Pin-based Shape Displays.",
                    "f3.js: A Parametric Design Tool for Physical Computing Devices for Both Interaction Designers and End-users.",
                    "Exploring At-Your-Side Gestural Interaction for Ubiquitous Environments.",
                    "Hands as a Controller: User Preferences for Hand Specific On-Skin Gestures.",
                    "Large-Scale User Perception of Synthetic Stroke Gestures.",
                    "The Meaning of Place in Supporting Sociality.",
                    "Designing Connections for Hearing Rehabilitation: Exploring Future Client Journeys with Elderly Hearing Aid Users, Relatives and Healthcare Providers.",
                    "Creating Conditions for Patients' Values to Emerge in Clinical Conversations: Perspectives of Health Care Team Members.",
                    "Digital Decoupling and Disentangling: Towards Design for Romantic Break Up.",
                    "Articulating Challenges of Hybrid Crafting for the Case of Interactive Silversmith Practice.",
                    "Community Inventor Days: Scaffolding Grassroots Innovation with Maker Events.",
                    "Machine Learning for Makers: Interactive Sensor Data Classification Based on Augmented Code Examples.",
                    "Enabling Hand-Crafted Visual Markers at Scale.",
                    "TASC: Combining Virtual Reality with Tangible and Embodied Interactions to Support Spatial Cognition.",
                    "Tangible VR: Diegetic Tangible Objects for Virtual Reality Narratives.",
                    "The Challenges of Visual-Kinaesthetic Experience.",
                    "Examining Low-Cost Virtual Reality for Learning in Low-Resource Environments.",
                    "PolySurface: A Design Approach for Rapid Prototyping of Shape-Changing Displays Using Semi-Solid Surfaces.",
                    "Critiquing Physical Prototypes for a Remote Audience.",
                    "Being, Bringing and Bridging: Three Aspects of Sketching with Nature.",
                    "Replicating an In-The-Wild Study One Year Later: Comparing Prototypes with Different Material Dimensions.",
                    "Collaboration with 360° Videochat: Challenges and Opportunities.",
                    "Utilizing Smartphones as a Multi-Device Single Display Groupware to Design Collaborative Games.",
                    "Collaboration, Awareness, and Communication in Real-Life Escape Rooms.",
                    "The Distaff: A Physical Interface to Facilitate Interdisciplinary Collaborative Performance.",
                    "Time and Space in Broken Panorama.",
                    "Dark Clouds, Io&#!+, and [Crystal Ball Emoji]: Projecting Network Anxieties with Alternative Design Metaphors.",
                    "Exploring Active Perception in Disseminating Design Research.",
                    "Let's Get Physical: Promoting Data Physicalization in Workshop Formats."
                ]
            },
            {
                "sub_name_abbr": "conf/ACMdis/2017c",
                "sub_name": "Companion Publication of the 2017 ACM Conference Companion Publication on Designing Interactive Systems, DIS '17, Edinburgh, United Kingdom, June 10-14, 2017.",
                "count": 89,
                "papers": [
                    "Understanding Autonomy, Animism and Presence as a Design Strategy for Behavior Change.",
                    "A Provocation for Rethinking and Democratising Emoji Design.",
                    "UX Practitioners' Engagement with Intermediate-Level Knowledge.",
                    "Designing Commenting Mechanisms for Dynamic Media: Synchronous Overlay and Adjacent Scrollable.",
                    "Not on Demand: Internet of Things Enabled Energy Temporality.",
                    "Best Way to Go?: Intriguing Citizens to Investigate What Is Behind Smart City Technologies.",
                    "GestAnalytics: Experiment and Analysis Tool for Gesture-Elicitation Studies.",
                    "Sustainable HCI: Blending Permaculture and User-experience.",
                    "An Augmented Reality Game using Face Recognition Technology.",
                    "Co-Designing Innovations for Energy Saving in Large Organisations.",
                    "Exploring the Materials of TUIs: A Multi-Method Approach.",
                    "Beauty and the Beast: An IoT Design Method Based on Improvisational Acting.",
                    "Interaction Under Pressure: Increased Mental Workload Makes Issues of Intuitive Interaction Visible.",
                    "Time-Turner: Data Engagement Through Everyday Objects in the Home.",
                    "Piecing Together the Past: Constructing Stories with Jigsaw Puzzles in Museums.",
                    "Animating Matter: Creating Organic-like Movement in Soft Materials.",
                    "The Grumpy Bin: Reducing Food Waste Through Playful Social Interactions.",
                    "Designing For Meaningfulness: A Case Study Of A Pregnancy Wearable For Men.",
                    "Old, Sick And No Health Insurance.: Will You Need A Permit To Use Your Home-made Health Wearable?",
                    "Food-to-Person Interaction: How to Get Information About What We Eat?",
                    "In Search of UX Translators: Analyzing Researcher-Practitioner Interactions on Twitter.",
                    "Tunneling Through Alternative Facts: The Qwand Problem Space Machine.",
                    "Musico: Personal Playlists through Peripheral and Implicit Interaction.",
                    "CADLens: Haptic Feedback for Navigating in 3D Environments.",
                    "MyWord: Supporting the Interest-based Learning of Words through a Personal Visual Dictionary.",
                    "How and Why I Cheated On My App: User Experience of Cheating Physical Activity Exergame Applications.",
                    "\"This is My Story...\": Storytelling with Tangible Artifacts among Migrant Women in Germany.",
                    "DeepBUFS: Deep Learned Biometric User Feedback System.",
                    "Transform Your Kids Into Self Sustainable Power Plants: Teaching Sustainable Behaviour to Young Users.",
                    "Mobile Hand Gesture Toolkit: Co-Designing Mobile Interaction Interfaces.",
                    "Composting as Interior Design: Encouraging Sustainability throughout a Participatory Design Process.",
                    "Analyzing Student Travel Patterns With Augmented Data Visualizations.",
                    "Reconstrained Design: A Manifesto.",
                    "Leaky Objects: Implicit Information, Unintentional Communication.",
                    "The Meaningful Integration of Interactive Media in Architecture.",
                    "RunMerge: Towards Enhanced Proprioception for Advanced Amateur Runners.",
                    "Experimental Engineering: Articulating and Valuing Design Experimentation.",
                    "Celebrating Laughter: Capturing and Sharing Tangible Representations of Laughter.",
                    "Exploring People's Emotional Bond with Places in the City: A Pilot Study.",
                    "Empowering Citizens with Spatially Distributed Public Visualization Displays.",
                    "HeartBeats: A Speculative Proposal For Ritualization of Digital Objects.",
                    "Takt: The Wearable Timepiece That Enables Sensory Perception of Time.",
                    "The Sophi HUD: A Novel Visual Analytics Tool for News Media.",
                    "ReflectiveHUD: Designing Spatial Interaction History.",
                    "Exploring the Making Activities of Women in Crisis Situations.",
                    "Provoking Performing Objects: Expanding the Design Space for Soft Robotics.",
                    "Is Driverless Car Another Weiserian Mistake?",
                    "Aesthetics of Haptics: An Experience Approach to Haptic Interaction Design.",
                    "Light Behavior Design: Violation of Unification Principles and the Effect on the User Experience.",
                    "The Voice Pump: An Affectively Engaging Interface for Changing Attachments.",
                    "CymaSense: A Real-Time 3D Cymatics-Based Sound Visualisation Tool.",
                    "Effects of Color and Threshold on User Perception of Heat Maps.",
                    "Stakeholder Tokens: A Constructive Method for Value Sensitive Design Stakeholder Analysis.",
                    "LOOP: A Physical Artifact to Facilitate Seamless Interaction with Personal Data in Everyday Life.",
                    "Augmented Table-Top Role-Playing Game with Movement-Based Gameplay and Arm-Worn Devices.",
                    "Development of a Low-cost Multimodal VR System for Engineering Design.",
                    "The Hedonic Haptics Player: A Wearable Device to Experience Vibrotactile Compositions.",
                    "Xketch: A Sketch-Based Prototyping Tool to Accelerate Mobile App Design Process.",
                    "Echo(): Listening to the Reflection of Obsolete Technology.",
                    "E-textile Production of Wearable Ambient Notification Devices.",
                    "BREF: BRowser-based Evaluation Framework.",
                    "Calm Station: An Interactive Perpetual Desk Object that Reduces Digital Distractions.",
                    "The Ambient Birdhouse: Bringing Birds Inside to Learn About Birds Outside.",
                    "Tele-Handwriter: Affective Digital Text Communication Using Physical Handwriting.",
                    "GPS Tarot: Encounters with Satellites as Divination Tools.",
                    "Designing the Expressive Point Lights to Enhance User's Situated Awareness of Smart Systems.",
                    "RecycHongs: Mobile App Co-design.",
                    "Triangulation in UX Studies: Learning from Experience.",
                    "Pedagogy & Physicalization: Designing Learning Activities around Physical Data Representations.",
                    "Designing for the Arab World.",
                    "New Value Transactions: Understanding and Designing for Distributed Autonomous Organisations.",
                    "SketchingDIS: Hand-drawn Sketching in HCI.",
                    "People, Personal Data and the Built Environment.",
                    "Interrogating Biosensing in Everyday Life.",
                    "Designing Reconfigurable Televisual Experiences.",
                    "Setting the Stage with Metaphors for Interaction - Researching Methodological Approaches for Interaction Design of Autonomous Vehicles.",
                    "Design Tools and Materials in Creative Work.",
                    "The Augmented House Museum: Co-Exploring Tangible Interaction to Increase Engagement with Heritage in House Museums.",
                    "Tangible and Virtual Interactions for Supporting Spatial Cognition.",
                    "Touch, E-textiles and Participation: Using E-textiles to Facilitate Hands-On Making Workshops with Blind and Visually-Impaired People.",
                    "Interacting with the Internet of Lighting.",
                    "Designing Interactive Costumes: Challenges and Prospects to Integrate Computational Clothing in the Performing Arts.",
                    "Hybrid Body Craft.",
                    "From Exploring and Constructing to Understanding: Mediating Intermediate-Level Knowledge.",
                    "HCI Knowledges and Situated Dissemination.",
                    "Drawing Design Futures for Shape-Changing Interfaces.",
                    "Comparing Constraints in Virtual Reality and Screen-based Media for Collaborative Music Making.",
                    "Exploring Emotion, Affect and Technology in the Urban Environment.",
                    "Experiencing Automation: UX and Practices with Automated Systems."
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "DIS 2016",
        "info": "Brisbane, QLD, Australia",
        "venues": [
            {
                "sub_name_abbr": "conf/ACMdis/2016",
                "sub_name": "Proceedings of the 2016 ACM Conference on Designing Interactive Systems, DIS '16, Brisbane, QLD, Australia, June 04 - 08, 2016.",
                "count": 122,
                "papers": [
                    "Futurecraft.",
                    "Androids, Replicants and Chimeras: Alternate Embodiments / Uncanny Agencies.",
                    "Creative Agency and the Space Race of the 21st Century: Towards a Museum of Natural Futures.",
                    "Uncovering the Honeypot Effect: How Audiences Engage with Public Interactive Systems.",
                    "Exploring Large-Scale Interactive Public Illustrations.",
                    "Designing for Children's Outdoor Play.",
                    "Sens-Us: Designing Innovative Civic Technology for the Public Good.",
                    "Understanding the Sociality of Experience in Mobile Music Listening with Pocketsong.",
                    "Understanding the Challenges of Designing and Developing Multi-Device Experiences.",
                    "Timelessness: User Experience of unplanned Smartphone Use.",
                    "The Design, Perception, and Practice of Tablet Photography.",
                    "Documenting the Research Through Design Process.",
                    "Interaction Design Labels: Concepts, Inscriptions, and Concealed Intentions.",
                    "When a Product Is Still Fictional: Anticipating and Speculating Futures through Concept Videos.",
                    "The Case of the Strangerationist: Re-interpreting Critical Technical Practice.",
                    "FusePrint: A DIY 2.5D Printing Technique Embracing Everyday Artifacts.",
                    "ProxyPrint: Supporting Crafting Practice through Physical Computational Proxies.",
                    "Probing the Potential of Post-Anthropocentric 3D Printing.",
                    "Ontological Surprises: A Relational Perspective on Machine Learning.",
                    "3D Folded PrintGami: Transforming Passive 3D Printed Objects to Interactive by Inserted Paper Origami Circuits.",
                    "Motion Echo Snowboard: Enhancing Body Movement Perception in Sport via Visually Augmented Feedback.",
                    "Designing Mid-Air TV Gestures for Blind People Using User- and Choice-Based Elicitation Approaches.",
                    "Interaction in Motion: Designing Truly Mobile Interaction.",
                    "CardboardSense: Interacting with DIY Cardboard VR Headset by Tapping.",
                    "If Words Could Dance: Moving from Body to Data through Kinesthetic Evaluation.",
                    "Designing for Advanced Personalization in Personal Task Management.",
                    "Patina-inspired Personalization: Personalizing Products with Traces of Daily Use.",
                    "What Can You Do?: Studying Social-Agent Orientation and Agent Proactive Interactions with an Agent for Employees.",
                    "Yo!: Enriching Emotional Quality of Single-Button Messengers through Kinetic Typography.",
                    "T.A.I: A Tangible AI Interface to Enhance Human-Artificial Intelligence (AI) Communication Beyond the Screen.",
                    "Fostering Engagement with Personal Informatics Systems.",
                    "Connected Baby Bottle: A Design Case Study Towards a Framework for Data-Enabled Design.",
                    "Teens, Parents, and Financial Literacy.",
                    "Tap-Kick-Click: Foot Interaction for a Standing Desk.",
                    "Paper Street View: A Guided Tour of Design and Making Using Comics.",
                    "Mime: An AR-based System Helping Patients to Test their Blood at Home.",
                    "Behind the Lens: A Visual Exploration of Epistemological Commitments in HCI Research on the Home.",
                    "Thing Ethnography: Doing Design Research with Non-Humans.",
                    "Design Proposal for a Wireless Derouter: Speculatively Engaging Digitally Disconnected Space.",
                    "From Breakage to Icebreaker: Inspiration for Designing Technological Support for Human-Human Interaction.",
                    "CrowdUX: A Case for Using Widespread and Lightweight Tools in the Quest for UX.",
                    "Trust Me: Doubts and Concerns Living with the Internet of Things.",
                    "DECO: A Design Space for Device Composition.",
                    "PeerPresents: A Web-Based System for In-Class Peer Feedback during Student Presentations.",
                    "Developing a Comprehensive Engagement Framework of Gamification for Reflective Learning.",
                    "Linking Data to Action: Designing for Amateur Energy Management.",
                    "SOLE meets MOOC: Designing Infrastructure for Online Self-organised Learning with a Social Mission.",
                    "The Prediction Machine: Performing Scientific and Artistic Process.",
                    "Live Participation: Augmenting Events with Audience-Performer Interaction Systems.",
                    "Situated Encounters with Socially Engaged Art in Community-based Design.",
                    "Improv Remix: Mixed-Reality Video Manipulation Using Whole-Body Interaction to Extend Improvised Theatre.",
                    "Sketchplore: Sketch and Explore with a Layout Optimiser.",
                    "Impatience Induced by Waiting: An Effect Moderated by the Speed of Countdowns.",
                    "Planning Adaptive Mobile Experiences When Wireframing.",
                    "Surveying Expert-Level Gesture Use and Adoption on Multi-Touch Tablets.",
                    "Design Interactions in ?elәwkw: Belongings.",
                    "The Form Design of the Datacatcher: A Research Prototype.",
                    "Virtual Trainer: A Low Cost AR Simulation of a Sudden Cardiac Arrest Emergency.",
                    "The Tuning of Materials: A Designer's Journey.",
                    "Live Prototyping.",
                    "A Design Approach for Authenticity and Technology.",
                    "Social Justice-Oriented Interaction Design: Outlining Key Design Strategies and Commitments.",
                    "Privacy & Social Media in the Context of the Arab Gulf.",
                    "Redesigning the Trans-disciplinary: Working Across Design, Craft and Technological Boundaries to Deliver an Integrated Wearable for Cardiac Monitoring.",
                    "ArmSleeve: A Patient Monitoring System to Support Occupational Therapists in Stroke Rehabilitation.",
                    "Heartefacts: Augmenting Mobile Video Sharing Using Wrist-Worn Heart Rate Sensors.",
                    "A Craft Approach to Health Awareness in Children.",
                    "Engaging with Death Online: An Analysis of Systems that Support Legacy-Making, Bereavement, and Remembrance.",
                    "People Searched by People: Context-Based Selectiveness in Online Search.",
                    "The Social Context of Video Game Play: Challenges and Strategies.",
                    "Social Network, Web Forum, or Task Market?: Comparing Different Crowd Genres for Design Feedback Exchange.",
                    "Fiat-Lux: Interactive Urban Lights for Combining Positive Emotion and Efficiency.",
                    "Study and Design of a Shape-Shifting Wall Display.",
                    "Utilizing Audio Cues to Raise Awareness and Entice Interaction on Public Displays.",
                    "AmbiGaze: Direct Control of Ambient Devices by Gaze.",
                    "The Humming Wall: Vibrotactile and Vibroacoustic Interactions in an Urban Environment.",
                    "Attention, please!: Comparing Features for Measuring Audience Attention Towards Pervasive Displays.",
                    "FeltRadio: Sensing and Making Sense of Wireless Traffic.",
                    "Tangible Apps Bracelet: Designing Modular Wrist-Worn Digital Jewellery for Multiple Purposes.",
                    "Skintillates: Designing and Creating Epidermal Interactions.",
                    "Biosignals as Social Cues: Ambiguity and Emotional Interpretation in Social Displays of Skin Conductance.",
                    "Revealing the Shopper Experience of Using a \"Magic Mirror\" Augmented Reality Make-Up Application.",
                    "Fantibles: Capturing Cricket Fan's Story in 3D.",
                    "Speculative Design and Heterogeneity in Indigenous Nation Building.",
                    "The Tumble Clock: Bringing Users in Touch with their Snooze Time.",
                    "Designing for Disadvantaged Job Seekers: Insights from Early Investigations.",
                    "Developing Compelling Repetitive-Motion Exergames by Balancing Player Agency with the Constraints of Exercise.",
                    "Integrating Serious Games and Tangible Objects for Functional Handgrip Training: A User Study of Handly in Persons with Multiple Sclerosis.",
                    "Design Strategies for Balancing Exertion Games: A Study of Three Approaches.",
                    "Doing While Thinking: Physical and Cognitive Engagement and Immersion in Mixed Reality Games.",
                    "A Picture Paints a Thousand Words but Can it Paint Just One?",
                    "RtD Comics: A Medium for Representing Research Through Design.",
                    "Being Photo-Visual in HCI and Design.",
                    "Spin: Examining the Role of Engagement, Integration, and Modularity in Supporting Youth Creating Documentation.",
                    "'I'm a rambler, I'm a gambler, I'm a long way from home': The Place of Props, Music, and Design in Dementia Care.",
                    "Towards an Analysis Framework of Technology Habituation by Older Users.",
                    "Rethinking the Design of Robotic Pets for Older Adults.",
                    "Designing for the Third Hand: Empowering Older Adults with Cognitive Impairment through Creating and Sharing.",
                    "Finding Design Value in Modern Mundanity.",
                    "Designing for Movement in Public Life with Itinerant Probes.",
                    "Performative Photography as an Ideation Method.",
                    "The Visual Thinking Gallery: A Five Year Retrospective.",
                    "Phases of Urban Tourists' Exploratory Navigation: A Field Study.",
                    "Elevating Communication, Collaboration, and Shared Experiences in Mobile Video through Drones.",
                    "Active Corners: Collaborative In-Car Interaction Design.",
                    "Evaluation of an Application Based on Conceptual Metaphors for Social Interaction Between Vehicles.",
                    "What's for Lunch?: A Socio-ecological Approach to Childcare Nutrition.",
                    "\"It just seems outside my health\": How Patients with Chronic Conditions Perceive Communication Boundaries with Providers.",
                    "EnGaze: Designing Behavior Visualizations with and for Behavioral Scientists.",
                    "Doctor, Can You See My Squats?: Understanding Bodily Communication in Video Consultations for Physiotherapy.",
                    "Switter: Supporting Exploration of Software Learning Materials on Social Media.",
                    "DiscoverySpace: Suggesting Actions in Complex Software.",
                    "Designing for Exploratory Play with a Hackable Digital Musical Instrument.",
                    "Many Makings: Entangling Publics, Participation and Things in a Complex Collaborative Context.",
                    "Productive Frictions: Moving from Digital to Material Prototyping and Low-Volume Production for Design Research.",
                    "Engaging Amateurs in the Design, Fabrication, and Assembly of Electronic Devices.",
                    "Happy Moves, Sad Grooves: Using Theories of Biological Motion and Affect to Design Shape-Changing Interfaces.",
                    "Sensing History: Contextualizing Artifacts with Sensory Interactions and Narrative Design.",
                    "Designing for Multi-User Interaction in the Home Environment: Implementing Social Translucence.",
                    "The Frustrations and Benefits of Mobile Device Usage in the Home when Co-Present with Family Members.",
                    "The Living Room: Exploring the Haunted and Paranormal to Transform Design and Interaction.",
                    "Designing for Active Place Presence at Home: The Hole in Space Design Experiment."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "DIS 2014",
        "info": "Vancouver, BC, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/ACMdis/2016c",
                "sub_name": "Companion Publication of the 2014 ACM Conference on Designing Interactive Systems, DIS '16, Brisbane, QLD, Australia, June 04 - 08, 2016.",
                "count": 48,
                "papers": [
                    "Drawn To Customisation: The Machine As Artist.",
                    "LiveObjects: Leveraging Theatricality for an Expressive Internet of Things.",
                    "B4 - Brisbane Backyard Bird Box: Connecting People to the Environment.",
                    "Candle Shadow Display for Ambient Communication Delivery.",
                    "Co-designing Encounters with Digital Cultural Heritage.",
                    "Moody: Haptic Sensations to Enhance Mood in Film Music.",
                    "Designing Digital Vertigo Games.",
                    "Design Space for Tangible and Embodied Interaction with Cultural Heritage.",
                    "Critical Design as Networked Counter Public.",
                    "Representation & Interpretation of Biosensing.",
                    "Design for Type 1 Diabetes: How Adolescents? Interactions with Medical Technology Can Inform Design.",
                    "The [Everyday] Future by Design: Opportunities for the Design Exploration of Everyday Sustainability.",
                    "Asynchronous Creative Collaboration in Distributed Design Teams.",
                    "Designing ICT to Support Positive Ageing in Saudi Arabia.",
                    "Multi-user Interaction with Domestic Lighting Systems.",
                    "Data-Enabled-Design: A Situated Exploration of Rich Interactions.",
                    "Social Living Labs for Digital Participation: Designing with Regional and Rural Communities.",
                    "Designing with Data: A Designerly Approach to Data and Data Analytics.",
                    "Digital Craftsmanship: HCI Takes on Technology as an Expressive Medium.",
                    "IoT: Designing for Human Values.",
                    "Designing Against the Status Quo.",
                    "Merging Realities: Exploring Meaningful Placement of AR Content.",
                    "Documenting Design Research Processes.",
                    "Designing Gameful and Ethical Experiences.",
                    "The Making of Cross-Device Experiences: A Hands-on Workshop.",
                    "Insertable Digital Devices: Voluntarily Under the Skin.",
                    "Urban HCI: (Re)adapting the City Together.",
                    "assimilate: Holistic System Design for Collaborative Narrative Construction.",
                    "Feral Screens: Queering Urban Networked Publics.",
                    "Illuminating LEGOs with Digital Information to Create Urban Data Observatory and Intervention Simulator.",
                    "Lyssna: A Design Fiction to Reframe Food Waste.",
                    "Challenges in Designing Visual Analytics for Environmental Acoustic Monitoring.",
                    "Handle the Way: Enhancing Web Accessibility for People with Disability.",
                    "A Consumer-Centred Sensory Vocabulary for Open-Food Innovation.",
                    "ComixTrip: Reading Comic Books with Text Sequenced through Gaze Tracking.",
                    "JogChalking: Capturing and Visualizing Affective Experience for Recreational Runners.",
                    "Deference and Demeanor: Exploring Interaction Design for Intelligent User Interface.",
                    "Designing Multi-user Lighting Interfaces: Four strategies to implement Social Translucence.",
                    "StoryLamp: Sentimentality is Killing the World.",
                    "Indirect Interaction: A Computing Lecture for Five to Seven Year-Olds.",
                    "Material Programming: A New Interaction Design Practice.",
                    "Designing Mediated Nurturing Play with Dogs to Alleviate Workplace Stress.",
                    "Calls from the Wild: Engaging Citizen Scientist with Animal Sounds.",
                    "A Feedback System for the Prevention of Forward Head Posture in Sedentary Work Environments.",
                    "Designing for the Marginalized: A Step Towards Understanding the Lives of Refugees and Asylum Seekers.",
                    "Data Affordances and the Dynamics of Constraints in Redesign.",
                    "Muru in Wonderland: An Immersive Video Tour with Gameful Character Interaction for Children.",
                    "Could the Inherent Nature of the Internet of Things Inhibit Person-to-Person Connection?"
                ]
            },
            {
                "sub_name_abbr": "conf/ACMdis/2014",
                "sub_name": "Designing Interactive Systems Conference 2014, DIS '14, Vancouver, BC, Canada, June 21-25, 2014.",
                "count": 118,
                "papers": [
                    "On icarus' wings: craft and the art of hybridization.",
                    "CityStudio Vancouver: collborative city building.",
                    "Leather as a material for crafting interactive and physical artifacts.",
                    "Sewing interest in E-textiles: analyzing making from a gendered perspective.",
                    "Participatory materials: having a reflective conversation with an artifact in the making.",
                    "Crafting code at the demo-scene.",
                    "Enhancing everyday paper interactions with paper circuits.",
                    "Moving from talking heads to newlyweds: exploring video chat use during major life events.",
                    "Domestic appropriations of tokens to the web.",
                    "\"If these walls could talk\": designing with memories of places.",
                    "Homemade cookbooks: a recipe for sharing.",
                    "Situated design for creative, reflective, collaborative, technology-mediated learning.",
                    "Reviewing reflection: on the use of reflection in interactive system design.",
                    "Ripening room: designing social media for self-reflection in self-expression.",
                    "Experiencing art through kinesthetic dialogue.",
                    "Time telescope: engagement with heritage through participatory design.",
                    "Materializing infrastructures for participatory hacking.",
                    "Some variations on a counterfunctional digital camera.",
                    "Growth plan for an inspirational test-bed of smart textile services.",
                    "Eclipse: eliciting the subjective qualities of public places.",
                    "tPad: designing transparent-display mobile interactions.",
                    "What you see is what you touch: visualizing touch screen interaction in the head-up display.",
                    "The design space of shape-changing interfaces: a repertory grid study.",
                    "The previewable switch: a light switch with feedforward.",
                    "Sensing touch using resistive graphs.",
                    "Structured observation with polyphony: a multifaceted tool for studying music composition.",
                    "Cinejack: using live music to control narrative visuals.",
                    "Musical meshworks: from networked performance to cultures of exchange.",
                    "Collaborating with computer vision systems: an exploration of audio feedback.",
                    "Medium probes: exploring the medium not the message.",
                    "Interactive personal storytelling: an ethnographic study and simulation of apartheid-era narratives.",
                    "The PumpSpark fountain development kit.",
                    "The design of slow-motion feedback.",
                    "Temporal anchors in user experience research.",
                    "Let's giggle!: design principles for humorous products.",
                    "A small space for playful messaging in the workplace: designing and deploying Picco.",
                    "Understanding guide dog team interactions: design opportunities to support work and play.",
                    "The 'hedonic' in human-computer interaction: history, contributions, and future research directions.",
                    "Supporting crisis response with dynamic procedure aids.",
                    "Shape-changing robot for stroke rehabilitation.",
                    "Design for complex persuasive experiences: helping parents of hospitalized children take care of themselves.",
                    "Prototyping 'clasp': implications for designing digital technology for and with adults with autism.",
                    "Analyzing critical designs: categories, distinctions, and canons of exemplars.",
                    "PKI: crafting critical design.",
                    "Counterfunctional things: exploring possibilities in designing digital limitations.",
                    "A story without end: writing the residual into descriptive infrastructure.",
                    "Interactive two-sided transparent displays: designing for collaboration.",
                    "Computer supported novice group critique.",
                    "A qualitative study of workplace intercultural communication tensions in dyadic face-to-face and computer-mediated interactions.",
                    "Product versus process: representing and appropriating DIY projects online.",
                    "Exploring the perceptions and use of electronic medical record systems by non-clinicians.",
                    "Constructive visualization.",
                    "Using data to stimulate creative thinking in the design of new products and services.",
                    "A constraint-based understanding of design spaces.",
                    "Supporting the synthesis of information in design teams.",
                    "Growing traces on objects of daily use: a product design perspective for HCI.",
                    "Practical notes on paper circuits.",
                    "Stillness and motion, meaning and form.",
                    "Admixed portrait: reflections on being online as a new parent.",
                    "Unpacking the thinking and making behind a user enactments project.",
                    "Dark patterns in proxemic interactions: a critical perspective.",
                    "Proxemics play: understanding proxemics for designing digital play experiences.",
                    "Implications of location and touch for on-body projected interfaces.",
                    "Crafting the body-tool: a body-centred perspective on wearable technology.",
                    "Crafting diversity in radiology image stack scrolling: control and annotations.",
                    "\"Every pregnancy is different\": designing mHealth for the pregnancy ecology.",
                    "Towards the crafting of personal health technologies.",
                    "A study of the challenges related to DIY assistive technology in the context of children with disabilities.",
                    "Freaky: performing hybrid human-machine emotion.",
                    "The remediation of nosferatu: exploring transmedia experiences.",
                    "The deliberate cargo cult.",
                    "Unexpected journeys with the HOBBIT: the design and evaluation of an asocial hiking app.",
                    "Winter is coming: introducing climate sensitive urban computing.",
                    "Sharing real-time biometric data across social networks: requirements for research experiments.",
                    "Taming data complexity in lifelogs: exploring visual cuts of personal informatics data.",
                    "Understanding and leveraging social networks for crowdfunding: opportunities and challenges.",
                    "Exploring the benefits and uses of web analytics tools for non-transactional websites.",
                    "Design sensitivities for interactive sport-training games.",
                    "Tango cards: a card-based design tool for informing the design of tangible learning games.",
                    "Game of words: tagging places through crowdsourcing on public displays.",
                    "Gaming to sit safe: the restricted body as an integral part of gameplay.",
                    "Reprioritizing the relationship between HCI research and practice: bubble-up and trickle-down effects.",
                    "On the presentation and production of design research artifacts in HCI.",
                    "Emergent boundary objects and boundary zones in collaborative design research projects.",
                    "Making wellbeing: a process of user-centered design.",
                    "Informing online and mobile map design with the collective wisdom of cartographers.",
                    "'alksjdf;Lksfd': tumblr and the fandom user experience.",
                    "Community historians: scaffolding community engagement through culture and heritage.",
                    "PosterVote: expanding the action repertoire for local political activism.",
                    "Liveness, localization and lookahead: interaction elements for parametric design.",
                    "Everyday making: identifying future uses for 3D printing in the home.",
                    "Volvelles, domes and wristbands: embedding digital fabrication within a visitor's trajectory of engagement.",
                    "Towards sociable technologies: an empirical study on designing appropriation infrastructures for 3D printing.",
                    "TuneTracker: tensions in the surveillance of traditional music.",
                    "Designing social greetings in human robot interaction.",
                    "An interactive, cyber-physical read-aloud environment: results and lessons from an evaluation activity with children and their teachers.",
                    "Crowd-based design activities: helping students connect with users online.",
                    "What does it mean for a system to be useful?: an exploratory study of usefulness.",
                    "Understanding the role of designers' personal experiences in interaction design practice.",
                    "Learning, innovation, and sustainability among mobile phone repairers in Dhaka, Bangladesh.",
                    "Ajna: negotiating forms in the making of a musical cabinet.",
                    "LightSet: enabling urban prototyping of interactive media façades.",
                    "The puppeteer display: attracting and actively shaping the audience with an interactive public banner display.",
                    "Using embodied audio-visual interaction to promote social encounters around large media façades.",
                    "The appropriation of a digital \"speakers\" corner: lessons learned from the deployment of mégaphone.",
                    "An emergent framework for digital memorials.",
                    "Legacy in the age of the internet: reflections on how interactive systems shape how we are remembered.",
                    "Placelessness, spacelessness, and formlessness: experiential qualities of virtual possessions.",
                    "The reflexive printer: toward making sense of perceived drawbacks in technology-mediated reminiscence.",
                    "Fashion thinking: lessons from fashion and sustainable interaction design, concepts and issues.",
                    "Catch my drift?: achieving comfort more sustainably in conventionally heated buildings.",
                    "No easy compromise: sustainability and the dilemmas and dynamics of change.",
                    "Patterns of persuasion for sustainability.",
                    "PianoText: redesigning the piano keyboard for text entry.",
                    "Practicing somaesthetics: exploring its impact on interactive product design ideation.",
                    "Human actions made tangible: analysing the temporal organization of activities.",
                    "The uncanny valley of embodied interaction design.",
                    "Vocalizing dance movement for interactive sonification of laban effort factors."
                ]
            },
            {
                "sub_name_abbr": "conf/ACMdis/2014c",
                "sub_name": "Companion Publication of the 2014 ACM SIGCHI Conference on Designing Interactive Systems Conference, DIS '14, Vancouver, BC, Canada, June 21-25, 2014.",
                "count": 55,
                "papers": [
                    "Honoring protocol: design by, for and with aboriginal peoples.",
                    "Intimate care: exploring eTextiles for teaching female pelvic fitness.",
                    "Picgo: designing reminiscence and storytelling for the elderly with photo annotation.",
                    "Designing interactive systems to encourage empathy between users.",
                    "Stimulating a dialogue on renewable energy through making.",
                    "Music is my life: disseminating design research to the community.",
                    "Interactions in the mouth: the voicemint electronic voice prosthesis.",
                    "Sfuture: envisioning a sustainable university campus in 2065.",
                    "Being the machine: exploring new modes of making.",
                    "Monologger: visualizing engagement in doctor-patient conversation.",
                    "The office smartwatch: development and design of a smartwatch app to digitally augment interactions in an office environment.",
                    "A quantified past: remembering with personal informatics.",
                    "Beat my bass, pluck my drum.",
                    "AutoEmotive: bringing empathy to the driving experience to manage stress.",
                    "Human-computer non-interaction: the activity of non-use.",
                    "Encouraging ambiguous experience: guides for personal meaning making.",
                    "Growing an interpretation ecology in a walled kitchen garden.",
                    "A digital interactive playground for children to explore on their own.",
                    "The multiple layers of materiality.",
                    "Computer supported urban gardening.",
                    "CAMBRIA: a tool for managing multiple design alternatives.",
                    "The bubble user interface: a tangible representation of information to enhance the user experience in IPTV systems.",
                    "Postulater: slowing the pace of media sharing.",
                    "Puzzle facade: a site-specific urban technological intervention.",
                    "The reflexive printer: embodying personal memory for social provocation.",
                    "BioShare: a research tool for analyzing social networks effects when sharing biometric data.",
                    "The sweetfeedback: the platform for persuasive technology.",
                    "The consumed endurance workbench: a tool to assess arm fatigue during mid-air interactions.",
                    "LiveNature: connecting people with their cherished places.",
                    "Exploring the health benefits of an emoting water cooler.",
                    "Parallels: an exploration engine for the discovery of ideas.",
                    "Electric flora: an interactive energy harvesting installation.",
                    "PianoText: redesigning the piano keyboard for text entry.",
                    "ICT to support community gardening: a system to help people to connect to each other in real life.",
                    "The Haggle-O-Tron: design intervention in secondhand retail.",
                    "Modular-Mus: towards an interaction design toolkit for music.",
                    "Situated remembering with digital technology.",
                    "Making art and making artists.",
                    "Exploring the alternative means to communicate interaction design research.",
                    "Prototyping speculative objects for the internet of things.",
                    "Pragmatic and practical somaesthetics for interactive product design.",
                    "An exploratory study into the public and situated visualisation of local data in urban communities.",
                    "Exploring material representations of physical activity.",
                    "For every action: interactive installations in liminal spaces.",
                    "Ecofeminism and sustainable HCI.",
                    "CyberPLAYce: a play space of creative, intelligent tools promoting personal and computational expression for early learners.",
                    "Hacking HCI3P: second workshop on human computer interaction in third places.",
                    "Crafting user experience of self-service technologies: key challenges and potential solutions.",
                    "HCI: human-computer improvisation.",
                    "StoryStorm: a collaborative exchange of methods for storytelling.",
                    "Environments for creative interaction design processes.",
                    "Social NUI: social perspectives in natural user interfaces.",
                    "Products as platforms: a framework for designing open source interactive artifacts.",
                    "A personal perspective on visualization and visual analytics.",
                    "Contextual constraints: consequences for interaction design."
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "DIS 2012",
        "info": "Newcastle Upon Tyne, United Kingdom",
        "venues": [
            {
                "sub_name_abbr": "conf/ACMdis/2012",
                "sub_name": "Designing Interactive Systems Conference 2012, DIS '12, Newcastle Upon Tyne, United Kingdom, June 11-15, 2012.",
                "count": 104,
                "papers": [
                    "Embodied narratives: a performative co-design technique.",
                    "Crafting quality in design: integrity, creativity, and public sensibility.",
                    "Kolab: appropriation & improvisation in mobile tangible collaborative interaction.",
                    "Design tools in practice: studying the designer-tool relationship in interaction design.",
                    "Clique Trip: feeling related in different cars.",
                    "Telematic dinner party: designing for togetherness through play and performance.",
                    "Kissenger: design of a kiss transmission device.",
                    "Dynamics of research through design.",
                    "The logic of annotated portfolios: communicating the value of 'research through design'.",
                    "Processlessness: staying open to interactional possibilities.",
                    "Discursive navigation of online news.",
                    "Considerate Audio MEdiating Oracle (CAMEO): improving human-to-human communications in conference calls.",
                    "Focusing on shared experiences: moving beyond the camera in video communication.",
                    "I'll knock you when I'm ready...: reflecting on media richness beyond bandwidth and imitation.",
                    "User-centered research in the early stages of a learning game.",
                    "Designing visualizations to facilitate multisyllabic speech with children with autism and speech delays.",
                    "Magic land: the design and evaluation of an interactive tabletop supporting therapeutic play with children.",
                    "People, content, location: sweet spotting urban screens for situated engagement.",
                    "Active aging in community centers and ICT design implications.",
                    "A long-term strategy for designing (in) the wild: lessons from the urban mediator and traffic planning in Helsinki.",
                    "Designed for work, but not from here: rural and remote perspectives on networked technology.",
                    "\"Dead China-make\" phones off the grid: investigating and designing for mobile phone use in rural Africa.",
                    "Putting it in perspective: designing a 3D visualization to contextualize indigenous knowledge in rural Namibia.",
                    "Understanding personal digital collections: an interdisciplinary exploration.",
                    "iSpace: interactivity expression for self-expression in an online communication environment.",
                    "Expanding the design space for intimacy: supporting mutual reflection for local partners.",
                    "A process of engagement: engaging with the process.",
                    "Time, topic and trawl: stories about how we reach our past.",
                    "Photographic social media: a framework for design.",
                    "Phybots: a toolkit for making robotic things.",
                    "At the seams: DIYbio and opportunities for HCI.",
                    "Case studies in the personal fabrication of electronic products.",
                    "Framespaces: framing of frameworks.",
                    "Critical design and critical theory: the challenge of designing for provocation.",
                    "How learning works in design education: educating for creative awareness through formative reflexivity.",
                    "Designing interaction with media façades: a case study.",
                    "A cross-device interaction style for mobiles and surfaces.",
                    "Small gestures go a long way: how many bits per gesture do recognizers actually need?",
                    "A fieldwork of the future with user enactments.",
                    "Digital Christmas: an exploration of festive technology.",
                    "What do lab-based user studies tell us about in-the-wild behavior?: insights from a study of museum interactives.",
                    "Co-creating games through intergenerational design workshops.",
                    "User interface design by collaborative sketching.",
                    "Provotypes for participatory innovation.",
                    "The i-Cube: design considerations for block-based digital manipulatives and their applications.",
                    "Sonic Cradle: designing for an immersive experience of meditation by connecting respiration to music.",
                    "MelodicBrush: a novel system for cross-modal digital art creation linking calligraphy and music.",
                    "Reflective design documentation.",
                    "Framing, aligning, paradoxing, abstracting, and directing: how design mood boards work.",
                    "Interaction-driven design: a new approach for interactive product development.",
                    "Virtual prototyping using miniature model and visualization for interactive public displays.",
                    "Territoriality and behaviour on and around large vertical publicly-shared displays.",
                    "Evaluating ambient displays in the wild: highlighting social aspects of use in public settings.",
                    "Interactive philanthropy: an interactive public installation to explore the use of gaming for charity.",
                    "The material move how materials matter in interaction design research.",
                    "Designing for perceptive qualities: 7 showcases.",
                    "Identifying unintentional touches on handheld touch screen devices.",
                    "Holding onto the magic: lightweight augmentation of digital reading devices.",
                    "Autobiographical design in HCI research: designing and learning through use-it-yourself.",
                    "Memory-storming: externalizing and sharing designers' personal experiences.",
                    "Invisible design: exploring insights and ideas through ambiguous film scenarios.",
                    "That syncing feeling: early user experiences with the cloud.",
                    "Unremarkable networking: the home network as a part of everyday life.",
                    "Exquisite Corpse 2.0: qualitative analysis of a community-based fiction project.",
                    "Understanding participation and opportunities for design from an online postcard sending community.",
                    "Value biases of sensor-based assistive technology: case study of a GPS tracking system used in dementia care.",
                    "To move or to remove?: a human-centric approach to understanding gesture interpretation.",
                    "Style by demonstration for interactive robot motion.",
                    "Designing everyday technologies with human-power and interactive microgeneration.",
                    "Power to the people: dynamic energy management through communal cooperation.",
                    "Re-conceptualizing fashion in sustainable HCI.",
                    "The local energy indicator: designing for wind and solar energy systems in the home.",
                    "Inspiring the design of longer-lived electronics through an understanding of personal attachment.",
                    "DIAM: towards a model for describing appropriation processes through the evolution of digital artifacts.",
                    "Towards a more cherishable digital object.",
                    "Photobox: on the design of a slow technology.",
                    "Showing is sharing: building shared understanding in human-centered design teams with Dazzle.",
                    "Experiences: a year in the life of an interactive desk.",
                    "Designing soundscapes of virtual environments for crisis management training.",
                    "Supporting the aviation industry: a traveler-centered approach.",
                    "Making the office catch up: comparing generation Y interactions at home and work.",
                    "The role of physical controllers in motion video gaming.",
                    "The final TimeWarp: using form and content to support player experience and presence when designing location-aware mobile augmented reality games.",
                    "Muse-based game design.",
                    "Do you care if a computer says sorry?: user experience design through affective messages.",
                    "UX_Mate: from facial expressions to UX evaluation.",
                    "Enhancing User eXperience during waiting time in HCI: contributions of cognitive psychology.",
                    "Movement qualities as interaction modality.",
                    "An unfinished drama: designing participation for the theatrical dance performance Parcival XX-XI.",
                    "Bodily experience and imagination: designing ritual interactions for participatory live-art contexts.",
                    "Designing wellbeing.",
                    "Designing performative interactions in public spaces.",
                    "Food for thought: designing for critical reflection on food practices.",
                    "Research in the wild: understanding 'in the wild' approaches to design and development.",
                    "Crafting urban camouflage.",
                    "Perspectives on participation: evaluating cross-disciplinary tools, methods and practices.",
                    "Designing interactive lighting.",
                    "Supporting reflection in and on design processes.",
                    "Designing for cognitive limitations.",
                    "Designing musical interactions for mobile systems.",
                    "(DIY)biology and opportunities for HCI.",
                    "The message in the bottle: best practices for transferring the knowledge from qualitative user studies.",
                    "Re-conceptualizing fashion in sustainable HCI.",
                    "Slow technology: critical reflection and future directions."
                ]
            }
        ]
    },
    {
        "year": "2010",
        "name": "DIS 2010",
        "info": "Aarhus, Denmark",
        "venues": [
            {
                "sub_name_abbr": "conf/ACMdis/2010",
                "sub_name": "Proceedings of the Conference on Designing Interactive Systems, Aarhus, Denmark, August 16-20, 2010.",
                "count": 72,
                "papers": [
                    "HCI and environmental sustainability: the politics of design and the design of politics.",
                    "A tale of two publics: democratizing design at the margins.",
                    "Participatory sensing in public spaces: activating urban surfaces with sensor probes.",
                    "ResearchWave: an ambient visualization for providing awareness of research activities.",
                    "Social distance, mobility and place: global and intimate genres in geo-tagged photographs of Guguletu, South Africa.",
                    "TouchFace: the interaction between cursors and live video images for casual videoconferencing.",
                    "Telling calls: making informed call handling decisions.",
                    "Mind the body!: designing a mobile stress management application encouraging personal reflection.",
                    "TiY (tag-it-yourself).",
                    "Breakbot: a social motivator for the workplace.",
                    "Design's processional character.",
                    "Investigating the relationship between imagery and rationale in design.",
                    "Open-ended objects: a tool for brainstorming.",
                    "Ideation decks: a card-based design ideation tool.",
                    "Coffee maker patterns and the design of energy feedback artefacts.",
                    "Design requirements for ambient display that supports sustainable lifestyle.",
                    "Materializing energy.",
                    "Using vocal sketching for designing sonic interactions.",
                    "The look, the feel and the action: making sets of ActDresses for robotic movement.",
                    "Creating the perception-based LADDER sketch recognition language.",
                    "Designing for dynamic family structures: divorced families and interactive systems.",
                    "Age and experience: ludic engagement in a residential care setting.",
                    "Enhancing the sleeping quality of partners living apart.",
                    "Engaging the disengaged: how do we design technology for digitally excluded older adults?",
                    "Intuino: an authoring tool for supporting the prototyping of organic interfaces.",
                    "Bosu: a physical programmable design tool for transformability with soft mechanics.",
                    "LilyPad in the wild: how hardware's long tail is supporting new engineering and design communities.",
                    "WallBots: interactive wall-crawling robots in the hands of public artists and political activists.",
                    "Creating a rural community display with local engagement.",
                    "Sharebee: encouraging Osusowake to promote community development.",
                    "\"Mate, we don't need a chip to tell us the soil's dry\": opportunities for designing interactive systems to support urban food production.",
                    "On the design of a \"moody\" keyboard.",
                    "Watt-Lite: energy statistics made tangible.",
                    "Some consideration on the (in)effectiveness of residential energy feedback systems.",
                    "Enabling new forms of agency using wearable environments.",
                    "Take it personally: accounting for individual difference in designing diabetes management systems.",
                    "Making chocolate-covered broccoli: designing a mobile learning game about food for young people with diabetes.",
                    "The booTable experience: iterative design and prototyping of an alternative interactive tabletop.",
                    "Design from the everyday: continuously evolving, embedded exploratory prototypes.",
                    "Visual design of physical user interfaces for NFC-based mobile interaction.",
                    "Designing for the invisible: user-centered design of infrastructure awareness systems.",
                    "Incorporating user control in automated interactive scheduling systems.",
                    "An analysis and critique of Research through Design: towards a formalization of a research approach.",
                    "Bridging designers' intentions to outcomes with constructivism.",
                    "The CLOTHO project: predicting application utility.",
                    "Water wars: designing a civic game about water scarcity.",
                    "U.F.O.scope!: families playing together at the public library.",
                    "Observing the mobile music phenomenon: one in nine commuters is wired.",
                    "TTI model: model extracting individual's curiosity level in urban spaces.",
                    "Human-to-dancer interaction: designing for embodied performances in a participatory installation.",
                    "Clear Panels: a technique to design mobile application interactivity.",
                    "Valence method for formative evaluation of user experience.",
                    "Virtual possessions.",
                    "Do emotions matter in creative design?",
                    "Digital user research in Korea: defining quality factors for an internet-based research tool.",
                    "Bricolage and consultation: addressing new design challenges when building large-scale installations.",
                    "Designing for high expectations: balancing ambiguity and thorough specification in the design of a wayfinding tool for firefighters.",
                    "DynamiCross: dynamic representation and sharing of information with flexible cross-reality interactions.",
                    "IT-services for everyday life with diabetes: learning design, community design, inclusive design.",
                    "LumiBots: making emergence graspable in a swarm of robots.",
                    "TacTowers: an interactive training equipment for elite athletes.",
                    "Home awareness: connecting people sensuously to places.",
                    "SINAIS: home consumption package: a low-cost eco-feedback energy-monitoring research platform.",
                    "ThanatoFenestra: photographic family altar supporting a ritual to pray for the deceased.",
                    "SnowGlobe: the development of a prototype awareness system for longitudinal field studies.",
                    "Towards multimodal interaction in smart home environments: the home operating system.",
                    "Handcrafting textile mice.",
                    "Heritage inquiries: a designerly approach to human values.",
                    "Informing the design of the future urban landscape.",
                    "Tracing design(ed) authority in critical modes of making.",
                    "Open design spaces: socially crafting interactive experiences.",
                    "Materialities influencing the design process."
                ]
            }
        ]
    },
    {
        "year": "2008",
        "name": "DIS 2008",
        "info": "Cape Town, South Africa",
        "venues": [
            {
                "sub_name_abbr": "conf/ACMdis/2008",
                "sub_name": "Proceedings of the Conference on Designing Interactive Systems, Cape Town, South Africa, February 25-27, 2008.",
                "count": 50,
                "papers": [
                    "Envisioning systemic effects on persons and society throughout interactive system design.",
                    "Getting the message across: visual attention, aesthetic design and what users remember.",
                    "Designing for inquisitive use.",
                    "The role of a cohort in the design and evaluation of pervasive systems.",
                    "Paper interface to electronic medical records: a case of usage-driven technology appropriation.",
                    "Zebra: exploring users' engagement in fieldwork.",
                    "Designing e-learning games for rural children in India: a format for balancing learning with fun.",
                    "Playground games: a design strategy for supporting and understanding coordinated activity.",
                    "Towards guidelines for designing augmented toy environments.",
                    "The landscape's apprentice: lessons for place-centred design from grounding documentary.",
                    "Place-specific computing: conceptual design cases from urban contexts in four countries.",
                    "Exploring true multi-user multimodal interaction over a digital table.",
                    "Cognitive partnerships on the bench top: designing to support scientific researchers.",
                    "Supporting cooperative teamwork: information, action and communication in sailing.",
                    "e-du box: educational multimedia with tangible-enhanced interaction.",
                    "Flutter: directed random browsing of photo collections with a tangible interface.",
                    "Beyond the screen: designing immersive collaborative experiences for children through digital and physical interaction.",
                    "Bringing context to the foreground: designing for creative engagement in a novel still camera application.",
                    "CityFlocks: designing social navigation for urban mobile information systems.",
                    "Handy navigation in ever-changing spaces: an ethnographic study of firefighting practices.",
                    "Interaction as a component of meaning-making.",
                    "Taming the situationist beast.",
                    "Evaluating usability: using models of argumentation to improve persuasiveness of usability feedback.",
                    "Designing marketing experiences.",
                    "Constructivism, virtual reality and tools to support design.",
                    "Integrating agile methods for mixed reality design space exploration.",
                    "Sharing digital photographs in the home through physical mementos, souvenirs, and keepsakes.",
                    "Photo displays in the home.",
                    "The past is a different place: they do things differently there.",
                    "Projected cognition: capturing intent in descriptions of complex interaction.",
                    "The iterative design of a project charter for interdisciplinary research.",
                    "Games for virtual team building.",
                    "Designing for nomadic work.",
                    "Near real-time fire alert system in South Africa: from desktop to mobile service.",
                    "Anchored mobilities: mobile technology and transnational migration.",
                    "Aesthetic journeys.",
                    "Art, design, education and research in pursuit of interactive experiences.",
                    "Objects of wonderment.",
                    "Evaluating the effectiveness of term frequency histograms for supporting interactive web search tasks.",
                    "\"Narrowcast yourself\": designing for community storytelling in a rural Indian context.",
                    "Understanding iDTV in a developing country and designing a T-gov application prototype.",
                    "TapGlance: designing a unified smartphone interface.",
                    "Interface designs for pen-based mobile video browsing.",
                    "Reflecting human behavior to motivate desirable lifestyle.",
                    "Opening the design space: the soft set of requirements.",
                    "Subjective objectivity: negotiating emotional meaning.",
                    "Theories and practice of design for information systems: eight design perspectives in ten short weeks.",
                    "Where all the interaction is: sketching in interaction design as an embodied practice.",
                    "More than meets the eye: transforming the user experience of home network management.",
                    "Empathetic living media."
                ]
            }
        ]
    },
    {
        "year": "2006",
        "name": "DIS 2006",
        "info": "University Park, PA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ACMdis/2006",
                "sub_name": "Proceedings of the Conference on Designing Interactive Systems,University Park, PA, USA, June 26-28, 2006.",
                "count": 50,
                "papers": [
                    "In search of lasting principles for designing interactive systems.",
                    "Inspiration card workshops.",
                    "Storyboarding: an empirical determination of best practices and effective guidelines.",
                    "Child-personas: fact or fiction?",
                    "The spatial character of sensor technology.",
                    "Using kinetic typography to convey emotion in text-based interpersonal communication.",
                    "Sensorial interfaces.",
                    "Supporting ethnographic studies of ubiquitous computing in the wild.",
                    "DJs' perspectives on interaction and awareness in nightclubs.",
                    "SESAME: towards better 3D conceptual design systems.",
                    "How do design and evaluation interrelate in HCI research?",
                    "Staying open to interpretation: engaging multiple meanings in design and evaluation.",
                    "Unfolding understandings: co-designing UbiComp In Situ, over time.",
                    "Can we measure quality in design and do we need to?",
                    "The effect of group composition on divergent thinking in an interaction design activity.",
                    "Randomness as a resource for design.",
                    "How bodies matter: five themes for interaction design.",
                    "Popcorn: the personal knowledge base.",
                    "iTell: supporting retrospective storytelling with digital photos.",
                    "Mock games: a new genre of pervasive play.",
                    "Morphome: a constructive field study of proactive information technology in the home.",
                    "The impact of pre-patterns on the design of digital home applications.",
                    "The history tablecloth: illuminating domestic activity.",
                    "What do usability evaluators do in practice?: an explorative study of think-aloud testing.",
                    "Collaborative architecture design and evaluation.",
                    "Design documentaries: inspiring design research through documentary film.",
                    "The origin and design of intentional affordances.",
                    "External representations in ubiquitous computing design and the implications for design tools.",
                    "The use of abstraction and motion in the design of social interfaces.",
                    "\"It's Just a Method!\": a pedagogical experiment in interdisciplinary design.",
                    "Interaction, usability and aesthetics: what influences users' preferences?",
                    "ec(h)o: situated play in a tangible and audio museum guide.",
                    "Experiencing BLISS when becoming a bus passenger.",
                    "Challenges in designing interactive systems for emergency response.",
                    "Back to school: design principles for improving webcast interactivity from face-to-face classroom observation.",
                    "Wikifying your interface: facilitating community-based interface translation.",
                    "A persistent chat space for work groups: the design, evaluation and deployment of loops.",
                    "An empirical framework for designing social products.",
                    "Designing and evaluating glanceable peripheral displays.",
                    "Designing for experiences: randomness as a resource.",
                    "Designing for social interaction: an experimental design research project.",
                    "Designing interfaces to enrich personalization.",
                    "Design research for a context-aware capture system to support biology education.",
                    "Investigating design knowledge reuse for interface development.",
                    "\"Just the facts ma'am?\": a contextual approach to the legal information use environment.",
                    "Trees of life: models of children's creative processes.",
                    "Visualizing network traffic for intrusion detection.",
                    "Exploring design as a research activity.",
                    "Exploring the interrelationships between the design and evaluation of interactive systems.",
                    "Fun & games: on the process of game design."
                ]
            }
        ]
    },
    {
        "year": "2004",
        "name": "DIS 2004",
        "info": "Cambridge, MA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ACMdis/2004",
                "sub_name": "Proceedings of the Conference on Designing Interactive Systems: Processes, Practices, Methods, and Techniques, Cambridge, MA, USA, August 1-4, 2004.",
                "count": 56,
                "papers": [
                    "Keynote.",
                    "Keynote.",
                    "Sharing multimedia content with interactive public displays: a case study.",
                    "Easing the wait in the emergency room: building a theory of public information systems.",
                    "Contextualizing mobile IT.",
                    "Eliciting reactive and reflective feedback for a social communication tool: a multi-session approach.",
                    "Making tea: iterative design through analogy.",
                    "Design in the absence of practice: breaching experiments.",
                    "Between the dazzle of a new building and its eventual corpse: assembling the ubiquitous home.",
                    "Gate reminder: a design case of a smart reminder.",
                    "Privacy risk models for designing privacy-sensitive ubiquitous computing systems.",
                    "The interactive thread: exploring methods for multi-disciplinary design.",
                    "Integrating creativity workshops into structured requirements processes.",
                    "Communication functions and the adaptation of design representations in interdisciplinary teams.",
                    "Daisyphone: the design and impact of a novel environment for remote group music improvisation.",
                    "Jukola: democratic music choice in a public space.",
                    "Tutor design for speech-based interfaces.",
                    "The calder toolkit: wired and wireless components for rapidly prototyping interactive devices.",
                    "Interaction frogger: a design framework to couple action and function through feedback and feedforward.",
                    "Hands-only scenarios and video action walls: novel methods for tangible user interaction design.",
                    "The swisshouse: an inhabitable interface for connecting nations.",
                    "Shaping experiences in the hunt museum: a design case study.",
                    "Infotropism: living and robotic plants as interactive displays.",
                    "Supporting time-based coordination in everyday service interactions: the fluidtime system.",
                    "Development and evaluation of emerging design patterns for ubiquitous computing.",
                    "Seamful interweaving: heterogeneity in the theory and design of interactive systems.",
                    "Designing for ephemerality and prototypicality.",
                    "Understanding experience in interactive systems.",
                    "Aesthetic interaction: a pragmatist's aesthetics of interactive systems.",
                    "Unpacking critical parameters for interface design: evaluating notification systems with the IRC framework.",
                    "PHOXEL-SPACE: an interface for exploring volumetric data with physical voxels.",
                    "Context-descriptive prototypes and their application to medicine administration.",
                    "Blendie.",
                    "Context photography.",
                    "Dialog Table.",
                    "Fashion victims.",
                    "I am driving through sound space.",
                    "I: move.",
                    "_knowscape mobile at DIS2004, Cambridge.",
                    "Rabbit field.",
                    "Recycled soundscapes.",
                    "Soundscapes.",
                    "Friction in scheduling and coordinating lives of families: designing from an interaction metaphor.",
                    "Activity wallpaper: ambient visualization of activity information.",
                    "FIASCO: game interface for location-based play.",
                    "Chat spaces.",
                    "Active photos.",
                    "Intimate objects.",
                    "Speakeasy: overcoming barriers and promoting community development in an immigrant neighborhood.",
                    "Rapid information architecture prototyping.",
                    "Designing full body movement interaction using modern dance as a starting point.",
                    "The information discovery framework.",
                    "Design for hackability.",
                    "Designing the future: writing, design and research on NOT-linear interaction.",
                    "Science friction.",
                    "Beyond human centered design?"
                ]
            }
        ]
    },
    {
        "year": "2002",
        "name": "DIS 2002",
        "info": "London, England",
        "venues": [
            {
                "sub_name_abbr": "conf/ACMdis/2002",
                "sub_name": "Proceedings of the 4th Conference on Designing Interactive Systems: Processes, Practices, Methods, and Techniques, DIS 2002, London, England, UK, June 25-28, 2002.",
                "count": 58,
                "papers": [
                    "Interviews with interaction designers.",
                    "The Placebo project.",
                    "Everyday adaptive design.",
                    "Some recent thoughts on digital media.",
                    "Neither Bauhäusler nor nerd educating the interaction designer.",
                    "Who will design the cathedrals of information technology?",
                    "Can we learn anything about the process of UI design?",
                    "Investigating exhibits.",
                    "\"...a load of ould boxology!\".",
                    "Design of an interactive system for group learning support.",
                    "A group game played in interactive virtual space: design and evaluation.",
                    "Design of a 3D interactive math learning environment.",
                    "Community design of community simulations.",
                    "The enigmatics of affect.",
                    "From user to character: an investigation into user-descriptions in scenarios.",
                    "Abstract information appliances: methodological exercises in conceptual design of computational things.",
                    "Form is function.",
                    "How does the design community think about design?",
                    "Cubby+: exploring interaction.",
                    "Forming interactivity: a tool for rapid prototyping of physical interactive products.",
                    "Designing for serendipity: supporting end-user configuration of ubiquitous computing environments.",
                    "Simplifying video editng using metadata.",
                    "Virtual video prototyping of pervasive healthcare systems.",
                    "Innovation in extremis: evolving an application for the critical work of email and information management.",
                    "The roads not taken: detours and dead ends on the design path of speeder reader.",
                    "User purposes and information-seeking behaviors in web-based media: a user-centered approach to information design on websites.",
                    "Improving the design of business and interactive system concepts in a digital business consultancy.",
                    "Technology choice as a first step in design: the interplay of procedural and sensemaking processes.",
                    "Pools and satellites: intimacy in the city.",
                    "Of maps and guidebooks: designing geographical technologies.",
                    "Practical strategies for integrating a conversation analyst in an iterative design process.",
                    "Pattern-based support for interactive design in domestic settings.",
                    "Notes towards an ethnography of domestic technology.",
                    "But how, Donald, tell us how?: on the creation of meaning in interaction design through feedforward and inherent feedback.",
                    "Wear, point, and tilt: designing support for mobile service and maintenance in industrial settings.",
                    "MessyDesk and MessyBoard: two designs inspired by the goal of improving human memory.",
                    "ComTouch: design of a vibrotactile communication device.",
                    "All robots are not created equal: the design and perception of humanoid robot heads.",
                    "Location-sensitive services: it's now ready for prime time on cellular phones!",
                    "Push me, shove me and I show you how you feel: recognising mood from emotionally rich interaction.",
                    "Mixers: a participatory approach to design prototyping.",
                    "What you see is what you feel: exploiting the dominance of the visual over the haptic domain to simulate force-feedback with cursor displacements.",
                    "Using a Wizard of Oz study to inform the design of SenToy.",
                    "Forest of thoughts.",
                    "The chat circles series: explorations in designing abstract graphical communication interfaces.",
                    "Examples and ideas in the development of sounding objects.",
                    "Things aren't what they seem to be: innovation through technology inspiration.",
                    "Mediator and medium: doors as interruption gateways and aesthetic displays.",
                    "Multilevel design and role play: experiences in assessing support for neighborhood participation in design.",
                    "Exploring exhibit space in a personal perspective: an interactive photo collage of a folk crafts museum.",
                    "Origami Desk: integrating technological innovation and human-centric design.",
                    "Networked information services in context sensitive environments.",
                    "Collecting and incorporating user requirements into design solutions.",
                    "Cross-cultural UI design: for home, work, and on the way.",
                    "Handheld usability.",
                    "Scenario-based usability engineering.",
                    "Co-design in practice.",
                    "Look mama, with hands!: on tangible interaction, gestures and learning."
                ]
            }
        ]
    },
    {
        "year": "2000",
        "name": "DIS 2000",
        "info": "New York City, NY, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ACMdis/2000",
                "sub_name": "Proceedings of the 3rd Conference on Designing Interactive Systems: Processes, Practices, Methods, Techniques, DIS 2000, New York City, NY, USA, August 17-19, 2000.",
                "count": 56,
                "papers": [
                    "Design as Common Ground.",
                    "Making Use: Scenarios and Scenario-Based Design.",
                    "Looking and Leaping.",
                    "Wrapping Up: Commentary on DIS 2000.",
                    "The Social Life of Engineering Authorizations.",
                    "Using a Technique from Graphic Designers to Develop Innovative System Designs.",
                    "Taking the Best from a Company History - Designing with Interaction Styles.",
                    "MoMA and the Three-Legged Stool: Fostering Creative Insight in Interactive System Design.",
                    "Touch Me, Hit Me and I Know How You Feel: A Design Approach to Emotionally Rich Interaction.",
                    "Beyond the Snapshot: From Speculation to Prototypes in Audiophotography.",
                    "Interaction Relabelling and Extreme Characters: Methods for Exploring Aesthetic Interactions.",
                    "Video Artifacts for Design: Bridging the Gap Between Abstraction and Detail.",
                    "Virtually Living Together: A Design Framework for New Communication Media.",
                    "Designing StoryRooms: Interactive Storytelling Spaces for Children.",
                    "Browsers with Changing Parts: A Catalog Explorer for Philip Glass' Website.",
                    "The Design of the Xi-Hu Historical Landscape and Culture in Media.",
                    "Javelin: A Personal Communication Device Demo.",
                    "Design of a Social Interaction Environment for Electronic Marketplaces.",
                    "Just-in-Time Design in a Fast-Paced Product Group.",
                    "Two-Dimensional Spatial Positioning as a Means for Reflection in Design.",
                    "Tightly Coupling Authoring and Evaluation in an Integrated Tool to Support Iterative Design of Interactive Hypermedia Educational Manuals.",
                    "The Jam-O-Drum Interactive Music System: A Study in Interaction Design.",
                    "Sound: An Emotional Element of Interactions - A Case Study of a Microwave Oven.",
                    "Augmented Reality as a Design Tool for Mobile Interfaces.",
                    "On the Move with a Magic Thing: Role Playing in Concept Design of Mobile Services and Devices.",
                    "Mapping the Physical World to Psychological Reality: Creating Synthetic Environments.",
                    "Bridge for Buttons - A GUI Design Methodology Applied in Non-GUI Consumer Product Design.",
                    "PaperButtons: Expanding a Tangible User Interface.",
                    "Informing the Design of an Information Management System with Iterative Fieldwork.",
                    "The Development of Cooperation: Five Years of Participatory Design in the Virtual School.",
                    "Creativity, Cooperation and Interactive Design.",
                    "Sitemaps, Storyboards, and Specifications: A Sketch of Web Site Design Practice.",
                    "Case Study: User Research to Inform the Design and Development of Integrated Wearable Computers and Web-Based Services.",
                    "Rapid Ethnography: Time Deepening Strategies for HCI Field Research.",
                    "On the Contributions of Different Empirical Data in Usability Testing.",
                    "From Usability Lab to \"Design Collaboratorium\": Reframing Usability Practice.",
                    "A Case Study for Evaluating Interface Design Through Communicability.",
                    "Improving Electronic Guidebook Interfaces Using a Task-Oriented Design Approach.",
                    "Task-Based Groupware Design: Putting Theory into Practice.",
                    "Designs Conducive to the Use of Efficient Strategies.",
                    "Communicating a Task Analysis with Task Layer Maps.",
                    "Lingua Francas for Design: Sacred Places and Pattern Languages.",
                    "A Pattern Approach to Interaction Design.",
                    "Performance Targets, Models and Innovation in Interactive System Design.",
                    "Contextual Prototyping of User Interfaces.",
                    "Meta-Design: Design for Designers.",
                    "A Dimension Space for the Design of Interactive Systems within their Physical Environments.",
                    "The Building Blocks of Experience: An Early Framework for Interaction Designers.",
                    "Experience Prototyping.",
                    "User-Driven Design of a Tangible Awareness Landscape.",
                    "Mergers and Acquisitions: The Changing Practice of HCI and Design.",
                    "Teaching Tangible Interaction Design.",
                    "Stories and Storytelling in the Design of Interactive Systems.",
                    "The Trialectical Architecture of Buildings, Intranets, and Organisations.",
                    "Reflecting on Design Practice: Exploring Video Documentary of Designers in Action.",
                    "Envisioning the E-Quarium: Strategic Design Planning for the Monterey Bay Aquarium's Website."
                ]
            }
        ]
    },
    {
        "year": "1997",
        "name": "DIS 1997",
        "info": "Amsterdam, the Netherlands",
        "venues": [
            {
                "sub_name_abbr": "conf/ACMdis/1997",
                "sub_name": "Proceedings of the 2nd Conference on Designing Interactive Systems: Processes, Practices, Methods and Techniques, DIS 1997, Grand Hotel Krasnapolsky, Amsterdam, the Netherlands, August 18-20, 1997.",
                "count": 49,
                "papers": [
                    "Enhancing Communication, Facilitating Shared Understanding, and Creating Better Artifacts by Integrating Physical and Computational Media for Design.",
                    "Mahler, Mondriaan, and Bauhaus: Using Artistic Ideas to Improve Application Usability.",
                    "Sound Design for Brain Opera's Mind Forest: Audio for a Complex Interactive System.",
                    "A Teleradiology System Design Case.",
                    "Active Design Documents.",
                    "Designing More Deeper: Integrating Task Analysis, Process Simulation, and Object Definition.",
                    "Requirements Development: Stages of Opportunity for Collaborative Needs Discovery.",
                    "Design As Interaction with Computer Based Materials.",
                    "The Application of Process Models of Information Seeking During Conceptual Design: The Case of an Intranet Resource for the Re-Use of Multimedia Training Material in the Motor Industry.",
                    "Designing the OpenDoc Human Interface.",
                    "User Involvement in Concept Creation.",
                    "A Comparison of Usability Techniques for Evaluating Design.",
                    "The Role of User Studies in the Design of OpenDoc.",
                    "Design @ Carnegie Mellon: A Web Story.",
                    "Triangles: Design of a Physical/Digital Construction Kit.",
                    "Using Organizational Learning Techniques to Develop Context-Specific Usability Guidelines.",
                    "Involving Remote Users in Continuous Design of Web Content.",
                    "Designing with Ethnography: A Presentation Framework for Design.",
                    "Quick But Not So Dirty Web Design: Applying Empirical Conceptual Clustering Techniques to Organise Hypertext Content.",
                    "IBIS - a Convincing Concept ... But a Lousy Instrument?",
                    "Designing Support for Remote Intensive-Care Telehealth Using the Locales Framework.",
                    "Bridging the Analysis of Work Practice and System Redesign in Cooperative Workshops.",
                    "Expected Usability and Product Preference.",
                    "On the Inevitable Intertwining of Analysis and Design: Developing Systems for Complex Cooperations.",
                    "Network Design: Tasks and Tools.",
                    "HCI, Natural Science and Design: A Framework for Triangulation Across Disciplines.",
                    "Experiences with Adding New Input Modalities to PC Desktop Computing.",
                    "Better or Just Different? On the Benefits of Designing Interactive Systems in Terms of Critical Parameters.",
                    "Interactive Systems in Domestic Environments.",
                    "The Singing Tree: Design of an Interactive Musical Interface.",
                    "Interface to Architecture: Integrating Technology Into the Environment in the Brain Opera.",
                    "Design in the POLITeam Project: Evaluating User Needs in Real Work Practice.",
                    "Collaborative Design for Virtual Team Collaboration: A Case Study of Jostling on the Web.",
                    "Design Case: Building Community in a Design Effort in a Decentralized, Individualistic Setting.",
                    "The AVANTI Project: Prototyping and Evaluation with a Cognitive Walkthrough Based on the Norman's Model of Action.",
                    "Technology Design and Mimicry.",
                    "Designing As the World Turns.",
                    "Designing User-Adapted Interfaces: The Unified Design Method for Transformable Interactions.",
                    "A New Approach to Human-Computer Interaction - Synchronous Modelling in Real and Virtual Spaces.",
                    "Design of a One to Many Collaborative Product.",
                    "Comparing Interaction Design Techniques: A Method for Objective Comparison to Find the Conceptual Basis for Interaction Design.",
                    "The Flower Model for Multidisciplinary Teamwork on a New Product-Market Combination - In This Case E-Mail-on-TV.",
                    "How to Make Software Softer - Designing Tailorable Applications.",
                    "A Case Study in Interactive Narrative Design.",
                    "A Designer's Nightmare: Designing a Reusable Information Retrieval Class Library in a Multinational Consortium.",
                    "Simple, But Cumbersome.",
                    "Searching Requirements for a System to Support Cooperative Concept Design in Product Development.",
                    "Capturing What is Needed in Multi-User System Design: Observations From the Design of Three Healthcare Systems.",
                    "A Framework for Assessing Group Memory Approaches for Software Design Projects."
                ]
            }
        ]
    },
    {
        "year": "1995",
        "name": "DIS 1995",
        "info": "Ann Arbor, MI, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ACMdis/1995",
                "sub_name": "Proceedings of the 1st Conference on Designing Interactive Systems: Processes, Practices, Methods and Techniques, DIS '95, Ann Arbor, MI, USA, August 23-25, 1995.",
                "count": 29,
                "papers": [
                    "Building a History of the Blacksburg Electronic Village.",
                    "Supporting the Evolution of Design Artifacts with Representations of Context and Intent.",
                    "Technology-Driven Design of Speech Recognition Systems.",
                    "Empowering Users in a Task-Based Approach to Design.",
                    "Requirements Rationales: Integrating Approaches to Requirement Analysis.",
                    "A Framework for Developing Experience-Based Usability Guidelines.",
                    "Towards an Integrated Organization and Technology Development.",
                    "Facilitating Communication in Software Development.",
                    "From Domain Modeling to Collaborative Domain Construction.",
                    "Applying Design Methodology to Software Development.",
                    "A Framework for Describing and Understanding Interdisciplinary Interactions in Design.",
                    "A Preliminary Study of the Relationship Between Industrial Design and Engineering Design.",
                    "An Applied Ethnographic Method for Redesigning User Interfaces.",
                    "Combining Programming Languages and Direct Manipulation in Environments for Computational Science.",
                    "Designing Deeper: Towards a User-Centered Development Environment.",
                    "Learner-Centered System Design: HCI Perspective for the Future.",
                    "A Method for Analyzing Team Design Activity.",
                    "Analysis of Gestures in Face-to-Face Design Teams Provides Guidance for How to Use Groupware in Design.",
                    "Inference Bear: Designing Interactive Interfaces Through Before and After Snapshots.",
                    "Deceived by Ease of Use: Using Paradigmatic Applications to Build Visual Design Environments.",
                    "Self-Disclosing Design Tools: A Gentle Introduction to End-User Programming.",
                    "OBSM: a Notation to Integrate Different Levels of User Interface Design.",
                    "Designing Complex Systems - A Structured Activity.",
                    "A Formal Technique for Automated Dialogue Development.",
                    "An Integration of Scenarios with Their Purposes in Task Modeling.",
                    "Using Scenario-Based Designs to Review User Interface Changes and Enhancements.",
                    "Using Schematic Scenarios to Understand User Needs.",
                    "The Evolution of Useful Things.",
                    "Designing in a Design Community: Insights and Challenges."
                ]
            }
        ]
    }
]