[
    {
        "year": "2020",
        "name": "13th GROUP 2020",
        "info": "Sanibel Island, Florida, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/group/2020c",
                "sub_name": "Companion of the 2020 ACM International Conference on Supporting Group Work, GROUP 2020, Sanibel Island, FL, USA, January 6-8, 2020.",
                "count": 29,
                "papers": [
                    "Self-regulating Soft Skills in Group Project-Based Design Education.",
                    "Exploring Transformative Fandom to Broaden Participation in Computing.",
                    "Beyond Transparency: Exploring Algorithmic Accountability.",
                    "Algorithmic Decision Making in Public Administration: A CSCW-Perspective.",
                    "Understanding and Designing Sociotechnical Systems to Support the Impression Management Practices of Online Freelance Workers.",
                    "Identity and User Behavior in Online Communities.",
                    "Understanding and Designing for Privacy in Wearable Fitness Platforms.",
                    "Using Stories to Understand Technology Needs and Technology Reuse by Rural Communities.",
                    "Designing CMC Tools for Separated Families.",
                    "Understanding Information and Technology Role in the Life of International Student Saudi Mothers in the United States.",
                    "Willing Buyer, Willing Seller: Personal Data Trade as a Service.",
                    "Autono-preneurial Agents in the Community: Developing a Socially Aware API for Autonomous Entrepreneurial Lawn Mowers.",
                    "The Future of Public Libraries as Convivial Spaces: A Design Fiction.",
                    "When Social Norms Fail.",
                    "The Trust-Building Process in the Social Media Environment of Rumour Spreading.",
                    "Enhancing Smart Home Security using Co-Monitoring of IoT Devices.",
                    "Measuring Collaborative Problem Solving Capability in Creative Problem Solving Situation.",
                    "A Circle of Friends: Persuasive Tools to Improve Heart Health.",
                    "Algorithmic Decision Making in Public Services: A CSCW-Perspective.",
                    "Veterans, PTSD and Social Media: Towards Identifying Trauma Text Categories using Grounded Theory.",
                    "Child Welfare System: Interaction of Policy, Practice and Algorithms.",
                    "Children's Perspectives on Human Sex Trafficking Prevention Education.",
                    "Extending CoNavigator into a Collaborative Digital Space.",
                    "Privacy Norms within the Internet of Things Using Contextual Integrity.",
                    "POST: A Machine Learning Based Paper Organization and Scheduling Tool.",
                    "CampusPartner: An Assistive Technology for Mobility Impaired Pedestrians.",
                    "Towards the Automatic Assessment of Student Teamwork.",
                    "GROUP4Good: Exploring Positive Impacts of GROUP Research.",
                    "Mapping Out Human-Centered Data Science: Methods, Approaches, and Best Practices."
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "12th GROUP 2018",
        "info": "Sanibel Island, Florida, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/group/2018",
                "sub_name": "Proceedings of the 2018 ACM Conference on Supporting Groupwork, GROUP 2018, Sanibel Island, FL, USA, January 07 - 10, 2018.",
                "count": 54,
                "papers": [
                    "Pay-per-Question: Towards Targeted Q&A with Payments.",
                    "Enabling Uneven Task Difficulty in Micro-Task Crowdsourcing.",
                    "Growth in Social Network Connectedness among Different Roles in Organizational Crowdfunding.",
                    "Reflektor: An Exploration of Collaborative Music Playlist Creation for Social Context.",
                    "Modeling User Intrinsic Characteristic on Social Media for Identity Linkage.",
                    "Optimizing User Experience through Implicit Content-aware Network Service in the Home Environment.",
                    "Collaboration Success Factors in an Online Music Community.",
                    "Geographic Biases are 'Born, not Made': Exploring Contributors' Spatiotemporal Behavior in OpenStreetMap.",
                    "Information Fortification: An Online Citation Behavior.",
                    "Keynote Speaker.",
                    "Twenty Thousand Leagues Above the Book: An Interactive Visual Analytics Approach to Literature.",
                    "A Personalized \"Course Navigator\" Based on Students' Goal Orientation.",
                    "Using Native Tongue Mnemonics to Enhance English Learning.",
                    "Cooperative Mixed Reality: An Analysis Tool.",
                    "Enhancing Collaboration in Classroom Using Smartphone in Developing Countries.",
                    "Understanding Book Popularity on Goodreads.",
                    "MobiAssist - ICT-based Training System for People with Dementia and Their Caregivers: Results from a Field Study.",
                    "Why Did They #Unfollow Me?: Early Detection of Follower Loss on Twitter.",
                    "Is Breaking Up Hard To Do?: Managing Relationship Boundaries on Social Networking Sites.",
                    "A Hot Bot: Testing Effect of Temperature on Feelings of Closeness When Interacting With a Chatbot.",
                    "Designing Social Interaction Support System with Shyness in Mind.",
                    "Identifying Opinion and Fact Subcategories from the Social Web.",
                    "Examining the Effects of Parenting Styles on Offline and Online Adolescent Peer Problems.",
                    "Carebit: A Privacy-Preserving \"Step\" Toward Remote Informal Caregiving.",
                    "A Stakeholders' Analysis of the Systems that Support Foster Care.",
                    "Designing a Video Co-Watching Web App to Support Interpersonal Relationship Maintenance.",
                    "Regrets, I've Had a Few: When Regretful Experiences Do (and Don't) Compel Users to Leave Facebook.",
                    "FitAware: Promoting Group Fitness Awareness ThroughGlanceable Smartwatches.",
                    "Psychological Wellbeing as an Explanation of User Engagement in the Lifecycle of Online Community Participation.",
                    "Re-thinking Traceability: A Prototype to Record and Revisit the Evolution of Design Artefacts.",
                    "Danmaku vs. Forum Comments: Understanding User Participation and Knowledge Sharing in Online Videos.",
                    "Open Data Standards for Open Source Software Risk Management Routines: An Examination of SPDX.",
                    "Crisis Informatics for Everyday Analysts: A Design Fiction Approach to Social Media Best Practices.",
                    "What Would You Do?: Design Fiction and Ethics.",
                    "LiveDissent: A Media Platform for Remote Participation in Activist Demonstrations.",
                    "Ad Empathy: A Design Fiction.",
                    "Creating, Reinterpreting, Combining, Cuing: Paper Practices on the Shopfloor.",
                    "Reflections on Operators' and Maintenance Engineers' Experiences of Smart Factories.",
                    "Infrastructural Grind: Introducing Blockchain Technology in the Shipping Domain.",
                    "Disaggregating the Impacts of Virtuality on Team Identification.",
                    "Towards Professionalization in an Online Community of Emerging Occupation: Discourses among UX Practitioners.",
                    "Working toward Empowering a Community: How Immigrant-Focused Nonprofit Organizations Use Twitter during Political Conflicts.",
                    "Effects of Comment Curation and Opposition on Coherence in Online Policy Discussion.",
                    "Workshop: Work in the Age of Intelligent Machines.",
                    "Refugees & Technology: Determining the Role of HCI Research.",
                    "Technology on the Trail.",
                    "Strengthening the Role of Female Young Professionals in IT-Organizations by Using a PAR Approach in Gender Studies.",
                    "AAPI Identity Work on Reddit: Toward Social Support and Collective Action.",
                    "Dynamics of Peer Production of Knowledge in Online Social Q&A Communities: A Life-Cycle Perspective of Successful and Failed Cases.",
                    "Investigating Collaboration Within Online Communities: Software Development vs. Artistic Creation.",
                    "Designing an ICT-based Training System for People with Dementia and their Caregivers.",
                    "Research Ethics Town Hall Meeting.",
                    "GRACE: Broadening Narratives of Computing through History, Craft and Technology.",
                    "Video-game based Exergames for People with Dementia and Their Caregivers."
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "11th GROUP 2016",
        "info": "Sanibel Island, Florida, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/group/2016",
                "sub_name": "Proceedings of the 19th International Conference on Supporting Group Work, Sanibel Island, FL, USA, November 13 - 16, 2016.",
                "count": 66,
                "papers": [
                    "Keynote Symposium on Systems Work.",
                    "Machine Learning and Grounded Theory Method: Convergence, Divergence, and Combination.",
                    "Beyond the Individual: The Dynamic Features of Distributed Affect.",
                    "Chess as a Conversation: Artefact-Based Communication in Online Competitive Board Games.",
                    "Habits of the Heart(rate): Social Interpretation of Biosignals in Two Interaction Contexts.",
                    "Near Real-Time Peer-to-Peer Shared Editing on Extensible Data Types.",
                    "High Responsiveness for Group Editing CRDTs.",
                    "Operational Transformation for Real-time Synchronization of Shared Workspace in Cloud Storage.",
                    "Designing for Inclusion: Supporting Gender Diversity in Independent Innovation Teams.",
                    "Curating an Infinite Basement: Understanding How People Manage Collections of Sentimental Artifacts.",
                    "Help Me Help You: Shared Reflection for Personal Data.",
                    "Raising your Eminence inside the Enterprise Social Network.",
                    "Exploring Trust and Cooperation Development with Agent-Based Simulation in A Pseudo Scale-free Network.",
                    "Influences of Peers, Friends, and Managers on Employee Engagement.",
                    "Lifecycles of Computer Clubs: Rhythms and Patterns of Collaboration and Learning in an Intercultural Setting.",
                    "Popup Networks: Creating Decentralized Social Media on Top of Commodity Wireless Routers.",
                    "Improvising Harmony: Opportunities for Technologies to Support Crowd Orchestration.",
                    "\"Guess what! You're the First to See this Event\": Increasing Contribution to Online Production Communities.",
                    "Motivating Invisible Contributions: Framing Volunteer Classification Design in a Fanfiction Repository.",
                    "Barriers to Using, Customizing, and Printing 3D Designs on Thingiverse.",
                    "Building Mood, Building Community: Usage Patterns of an Interactive Art Installation.",
                    "\"Hey, I know what this is!\": Cultural Affinities and Early Stage Appropriation of the Emerging Bitcoin Technology.",
                    "\"It is Not Because You Have Tools that You Must use Them\": The Difficult Domestication of a Telemedicine Toolkit to Manage Emergencies in Nursing Homes.",
                    "Caring About Sharing: Couples' Practices in Single User Device Access.",
                    "The Impact of Spatial Properties on Collaboration: An Exploratory Study in the Automotive Domain.",
                    "Communication, Coordination and Awareness around Continuous Location Sharing.",
                    "Handheld Augmented Reality for Distributed Collaborative Crime Scene Investigation.",
                    "The Emergence of High-Speed Interaction and Coordination in a (Formerly) Turn-based Groupware Game.",
                    "SocialStreamViewer: Guiding the Viewer Experience of Multiple Streams of an Event.",
                    "Formalization and Accountability in Surgery Planning.",
                    "Exploring Computer-Supported Professional Development for Novice Museum and Zoo Professionals.",
                    "Demo or Die: Narrative Construction as Articulation Work for Promoting Early Stage Digital Innovations.",
                    "On Being Actionable: Mythologies of Business Intelligence and Disconnects in Drill Downs.",
                    "The IKEA Catalogue: Design Fiction in Academic and Industrial Collaborations.",
                    "The Co-ordinates of Design Fiction: Extrapolation, Irony, Ambiguity and Magic.",
                    "Incorporation of Generational Learning in Familiar Interfaces and Systems: A Design Fiction.",
                    "Reading Elinor Ostrom In Silicon Valley: Exploring Institutional Diversity on the Internet.",
                    "Characterizations of Online Harassment: Comparing Policies Across Social Media Platforms.",
                    "The Strength of Awkward Ties: Online Interactions between High School Students and Adults.",
                    "The Coaches Said...What?: Analysis of Online Dating Strategies Recommended by Dating Coaches.",
                    "Designing an Application for Social Media Needs in Emergency Public Information Work.",
                    "Challenges of CI Initiatives in a Political Unstable Situation - Case Study of a Computer Club in a Refugee Camp.",
                    "Privacy and Weight Loss Apps: A First Look at How Women with Eating Disorders Use Social Features.",
                    "Understanding User Reviews of Adolescent Mobile Safety Apps: A Thematic Analysis.",
                    "Autonomy Support for Elderly People through Everyday Life Gadgets.",
                    "Tracky Notes: Trackable Sticky Notes for Indexing a Video of Meetings.",
                    "Towards Card-based User Interfaces Workspaces for Group Mission Planning.",
                    "Analysis of Human Nodding Behavior during Group Work for Designing Nodding Robots.",
                    "Novel Web-based Remote Collaboration System Architecture for Wider Use Cases.",
                    "Fostering Organizational Change through Co-Designing Collaborative Media.",
                    "Shaing Code Among Academic Researchers: Lessons Learned.",
                    "Learning Outcomes From a Student-generated.",
                    "Engaging with Users and Stakeholders: The Emotional and the Personal.",
                    "Exploring Ethics and Obligations for Studying Digital Communities.",
                    "Social Media for Sensitive Disclosures and Social Support: The Case of Miscarriage.",
                    "The Role of Social Media in Participatory Democracy: A Case Study of Facebook Groups.",
                    "Designing Social Memory Artifacts in a Smart Home.",
                    "Digital Traces of Online Self-Organizing and Problem Solving in Disaster.",
                    "Media and Information Literacy Competences in the Workplace: Collaborative Practices and Workers' Empowerment.",
                    "Engaging Newcomers in Hybrid Communities.",
                    "Taking a More Balanced Approach to Adolescent Mobile Safety.",
                    "Enhancing Visibility of Distance Learners To Promote Sense Of Community.",
                    "Towards Re-Orienting the Big Data Rhetoric.",
                    "Seeing Work: Constructing Visions of Work in and through Data.",
                    "Understanding and Supporting Document-based Knowledge Transfer with Moderator-Learner Interaction.",
                    "Enhancing Evaluation of Potential Romantic Partners Online."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "10th GROUP 2014",
        "info": "Sanibel Island, Florida, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/group/2014",
                "sub_name": "Proceedings of the 18th International Conference on Supporting Group Work, Sanibel Island, FL, USA, November 09 - 12, 2014.",
                "count": 50,
                "papers": [
                    "Turk-Life in India.",
                    "Routine and Standardization in Global Software Development.",
                    "Why Closely Coupled Work Matters in Global Software Development.",
                    "Losing It Online: Characterizing Participation in an Online Weight Loss Community.",
                    "If It Is Funny, It Is Mean: Understanding Social Perceptions of Yelp Online Reviews.",
                    "Impression Management Struggles in Online Dating.",
                    "Investigating the Use of a Simulator to Support Users in Anticipating Impact of Privacy Settings in Facebook.",
                    "Designing Better Location Fields in User Profiles.",
                    "Exploring How a Co-dependent Tangible Tool Design Supports Collaboration in a Tabletop Activity.",
                    "Metrics for Cooperative Systems.",
                    "The Dream About the Magic Silver Bullet: the Complexity of Designing for Tablet-Mediated Learning.",
                    "Community Code Engagements: Summer of Code & Hackathons for Community Building in Scientific Software.",
                    "Anyone for Bowling?: Coalescing for Shared Activities.",
                    "Exploring How Parents in Economically Depressed Communities Access Learning Resources.",
                    "Media2gether: Sharing Media during a Call.",
                    "The Backstage Work of Data Sharing.",
                    "Revisiting Corporate Social Media: Challenges and Implications from a Long-Term Study.",
                    "The Nomad and the Couch Potato: Enriching Mobile Shared Experiences with Contextual Information.",
                    "Is Living With Others A Barrier To Technical Literacy?",
                    "Supporting Collaborative Reflection at Work: A Comparative Case Analysis.",
                    "Work Practices in Coordinating Center Enabled Networks (CCENs).",
                    "Informing Digital Cognitive Aids Design for Emergency Medical Work by Understanding Paper Checklist Use.",
                    "Verbal Equity, Cognitive Specialization, and Performance.",
                    "Supporting String-Wise Operations and Selective Undo for Peer-to-Peer Group Editing.",
                    "A Field Trial of an Anonymous Backchannel Among Primary School Pupils.",
                    "How Do You IM When You Get Emotional?",
                    "Citizen Adoption of Technology Mediated Social Participation Systems.",
                    "Networked Handhelds for Collaborative Sense-Making in Undergraduate Physics.",
                    "Using Technology to Increase Meaningful Engagement in a Memory Care Unit.",
                    "Designing Communication Technologies for Children with a Chronic Illness.",
                    "Distributed Leadership in OSS.",
                    "The Collaborative Management of Information Problems in Hospitals.",
                    "The Potential of VMC Systems to Support Social Capital.",
                    "Pregnancy Ecologies As Teachable Moments For The Lifecourse: Changing The mHealth Design Paradigm.",
                    "Emotional Communication in Instant Messaging.",
                    "Collaboratively Designed Information Structures in Wikipedia.",
                    "Supporting the Information Management Needs of People Helping Animals in Disasters.",
                    "The Collaborative Agile Knowledge Engine CAKE.",
                    "BIG Science: A Collaborative Framework for Large Scale Research.",
                    "Support for Collaboration between Large and Small & Medium Enterprises.",
                    "\"I Am Not a Lawyer\": Copyright Q&A in Online Creative Communities.",
                    "Presenting the Kludd: A Shared Workspace for Collaboration.",
                    "Sound Planet: An Interactive Sound Visualization on the Spherical Display for Group Work.",
                    "Evaluating Mobile Remote Presence (MRP) Robots.",
                    "Designing Meaningful Participation: Analyzing Contribution Patterns in an Alternate Reality Game.",
                    "Human-Robot Interaction in Groups: Theory, Method, and Design for Robots in Groups.",
                    "Potentials of the \"Unexpected\": Technology Appropriation Practices and Communication Needs.",
                    "The Morphing Organization: Rethinking Groupwork Systems in the Era of Crowdwork.",
                    "Quality Hackathon: Evaluating the Products of Online Co-Production Systems.",
                    "Collaboration and Coordination in the Context of Informal Care (CCCiC): Concepts, Methods, and Technologies."
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "9th GROUP 2012",
        "info": "Sanibel Island, Florida, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/group/2012",
                "sub_name": "ACM 2012 International Conference on Support Group Work, GROUP '12, Sanibel Island, FL, USA, October 27-31, 2012.",
                "count": 53,
                "papers": [
                    "Can a table regulate participation in top level managers' meetings?",
                    "Visualizing history to improve users' location and comprehension of collaborative work.",
                    "Controlling an avatar's pointing gestures in desktop collaborative virtual environments.",
                    "To see or not to see: a study comparing four-way avatar, video, and audio conferencing for work.",
                    "The sociality of fieldwork: designing for social science research practice and collaboration.",
                    "Human infrastructure as process and effect: its impact on individual scientists' participation in international collaboration.",
                    "Collaborative reflection at work: supporting informal learning at a healthcare workplace.",
                    "Newcomer integration and learning in technical support communities for open source software.",
                    "Purposeful gaming & socio-computational systems: a citizen science design case.",
                    "Location-based crowdsourcing of hyperlocal news: dimensions of participation preferences.",
                    "Designing an authoring environment for community-created virtual heritage environments: experiences with the geografia platform.",
                    "Decision making tasks in time-critical medical settings.",
                    "Eating alone, together: new forms of commensality.",
                    "ATCoPE: any-time collaborative programming environment for seamless integration of real-time and non-real-time teamwork in software development.",
                    "Decentralized documents authoring system for decentralized teamwork: matching architecture with organizational structure.",
                    "Adaptive forward error correction for real-time groupware.",
                    "Authenticating operation-based history in collaborative systems.",
                    "A string-wise CRDT for group editing.",
                    "At a different tempo: what goes wrong in online cross-cultural group chat?",
                    "Augmenting classroom participation through public digital backchannels.",
                    "Supporting research collaboration through bi-level file synchronization.",
                    "Disclosure, ambiguity and risk reduction in real-time dating sites.",
                    "Understanding participant behavior trajectories in online health support groups using automatic extraction methods.",
                    "Personalized incremental users' engagement: driving contributions one step forward.",
                    "Supporting initial trust in distributed idea generation and idea evaluation.",
                    "From credit and risk to trust: towards a credit flow based trust model for social networks.",
                    "Tagging Wikipedia: collaboratively creating a category system.",
                    "Twitter zombie: architecture for capturing, socially transforming and analyzing the twittersphere.",
                    "Towards an understanding of social inference opportunities in social computing.",
                    "The gap between producer intentions and consumer behavior in social media.",
                    "Supporting artifact-mediated discourses through a recursive annotation tool.",
                    "Discovering habits of effective online support group chatrooms.",
                    "The role of narratives in collaborative information seeking.",
                    "Qualitative data collection technologies: a comparison of instant messaging, email, and phone.",
                    "Workflow transparency in a microtask marketplace.",
                    "From consumer to community: factors of influence in the purchasing decision making process.",
                    "Social technologies and knowledge sharing within and across organizations.",
                    "Communication breakdowns in global software development teams: is knowledge creation the answer?",
                    "Language proficiency matters in group chat: supporting cross-cultural communication processes.",
                    "Impression formation in online collaborative communities.",
                    "A framework and future direction for studying productive applications of social media / social networking sites.",
                    "Learning landscapes: physical space and digital technology in museum collaboration and learning.",
                    "Scenario-based design of a digital reminiscing system for the elderly.",
                    "Collaborating with others trying to do the same thing: coordination in an educational improvement network.",
                    "Better understanding of human decision making can inform the design of sociotechnical systems that foster and support behavior modification.",
                    "Group dynamics findings from coordination in problem solving and decision making meetings.",
                    "Tweet recall: examining real-time civic discourse on twitter.",
                    "Readers' motivations to participate in hyperlocal news content creation.",
                    "Knowledge transferability in partially distributed conceptual design teams.",
                    "Elastic collaboration support: from workflow-based to emergent collaboration.",
                    "GROUP workshop proposal: collaboration in managing computer systems.",
                    "CSCL@work revisited - beyond CSCL and CSCW?: are there key design principles for computer supported collaborative learning at the workplace?",
                    "Moving beyond talking heads to shared experiences: the future of personal video communication."
                ]
            }
        ]
    },
    {
        "year": "2010",
        "name": "8th GROUP 2010",
        "info": "Sanibel Island, Florida, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/group/2010",
                "sub_name": "Proceedings of the 2010 International ACM SIGGROUP Conference on Supporting Group Work, GROUP 2010, Sanibel Island, Florida, USA, November 6-10, 2010.",
                "count": 66,
                "papers": [
                    "Why it works (when it works): success factors in online creative collaboration.",
                    "Everyday favors: a case study of a local online gift exchange system.",
                    "Televiewpointer: an integrated workspace awareness widget for real-time collaborative 3d design systems.",
                    "Progressive scenarios: a rapid method for understanding user interpretations of technology.",
                    "Avatars meet meetings: design issues in integrating avatars in distributed corporate meetings.",
                    "Design methods as discourse on practice.",
                    "The effects of group composition on decision quality in a social production community.",
                    "Coordination by avoidance: bringing things together and keeping them apart across hospital departments.",
                    "Dealing with wandering: a case study on caregivers' attitudes towards privacy and autonomy when reflecting the use of LBS.",
                    "The effects of life disruptions on home technology routines.",
                    "Shared identity helps partially distributed teams, but distance still matters.",
                    "Enhancing group recommendation by incorporating social relationship interactions.",
                    "Network analysis of trace data for the support of group work: activity patterns in a completely online course.",
                    "On the hierarchicalness of q&a posting networks.",
                    "A study of cultural effects on mobile-collocated group photo sharing.",
                    "An algorithm for selective undo of any operation in collaborative applications.",
                    "Forming reasonably optimal groups: (FROG).",
                    "Transform 'pipeline' into 'pebble': an approach to improve efficiency.",
                    "bumpy, caution with merging: an exploration of tagging in a geowiki.",
                    "Negotiating with angry mastodons: the wikipedia policy environment as genre ecology.",
                    "kultagg: ludic design for tagging interfaces.",
                    "Social regulation in an online game: uncovering the problematics of code.",
                    "Searching for reputable source code on the web.",
                    "The human factors of consistency maintenance in multiplayer computer games.",
                    "Speaking through text: the influence of real-time text on discourse and usability in IM.",
                    "We are all lurkers: consuming behaviors among authors and readers in an enterprise file-sharing service.",
                    "Collaboard: a remote collaboration groupware device featuring an embodiment-enriched shared workspace.",
                    "Design, implementation, and evaluation of an approach for determining when programmers are having difficulty.",
                    "Coordination in innovative design and engineering: observations from a lunar robotics project.",
                    "Places for lightweight group meetings: the design of come together.",
                    "Supporting ad-hoc re-planning and shareability at large-scale events.",
                    "The japanese garden: task awareness for collaborative multitasking.",
                    "Show me a good time: using content to provide activity awareness to collaborators with activityspotter.",
                    "Towards building a productive, scalable and sustainable collaboration model for open educational resources.",
                    "A review of patterns in collaborative work.",
                    "Practice-centered e-science: a practice turn perspective on cyberinfrastructure design.",
                    "Alternate reality games and groupwork.",
                    "Collaborative poetry on the facebook social network.",
                    "Conceptualizing social information.",
                    "Conferencing room for telepresence with remote participants.",
                    "Designing qbox: a tool for sorting things out in digital spaces.",
                    "Empathy & enjoyment in computer-mediated design work.",
                    "Flag: an ambient awareness tool to support informal collaborative learning.",
                    "Group's affective relevance: a proposal for studying affective relevance in collaborative information seeking.",
                    "R u ok?: increasing perceptions of safety and community through social networks.",
                    "Navigation companion: a web portal for volkswagen drivers.",
                    "Perceptions of copyright compliance.",
                    "Petex - platform for e-learning and telemetric experimentation: a holistic approach for tele-operated live experiments in production engineering.",
                    "Promoting oneself on flickr: users' strategies and attitudes.",
                    "Towards a group recommender process model for ad-hoc groups and on-demand recommendations.",
                    "Using social media for social activism.",
                    "Bringing back channels up front: towards an active learning environment.",
                    "Collaborative information foraging: an application to emergency response.",
                    "Crowdsourcing science: organizing virtual participation in knowledge production.",
                    "Examining the ways in which people learn in social groups in second life: an ethnographic study.",
                    "Integrating older adults into social networking sites through ambient intelligence.",
                    "Practices of balancing privacy and publicness in social network services.",
                    "The socio-technical design of a library and information science collaboratory.",
                    "Technology as a resource for reconstituting the social world: life in a war zone.",
                    "Using cultures of participation to change behaviors.",
                    "Using language-retrieved pictures to support intercultural group brainstorming.",
                    "The virtual home mode: photography & biography work.",
                    "Clorg: collective intelligence in organizations.",
                    "Collaborative information seeking (CIS): toward new theories and applications.",
                    "Computer supported collaborative learning at work: CSCL at work.",
                    "Connecting families: new technologies, family communication, and the impact on domestic space."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "7th GROUP 2009",
        "info": "Sanibel Island, Florida, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/group/2009",
                "sub_name": "Proceedings of the 2009 International ACM SIGGROUP Conference on Supporting Group Work, GROUP 2009, Sanibel Island, Florida, USA, May 10-13, 2009.",
                "count": 54,
                "papers": [
                    "Enhancing information scent: identifying and recommending quality tags.",
                    "Improving personal privacy in social systems with people-tagging.",
                    "Analysis of tag within online social networks.",
                    "Spreading the honey: a system for maintaining an online community.",
                    "Contribution, commercialization & audience: understanding participation in an online creative community.",
                    "Wikipedians are born, not made: a study of power editors on Wikipedia.",
                    "Effects of feedback and peer pressure on contributions to enterprise social media.",
                    "Translating social support practices into online services for family caregivers.",
                    "Cluestr: mobile social networking for enhanced group communication.",
                    "Personalized retrieval in social bookmarking.",
                    "When social networks cross boundaries: a case study of workplace use of facebook and linkedin.",
                    "Is Wikipedia growing a longer tail?",
                    "Two peers are better than one: aggregating peer reviews for computing assignments is surprisingly accurate.",
                    "The influence of boundary objects on group collaboration in construction project teams.",
                    "For a science of group interaction.",
                    "GroupMind: supporting idea generation through a collaborative mind-mapping tool.",
                    "Supporting transitions in work: informing large display application design by understanding whiteboard use.",
                    "Lazy scheduling of processing and transmission tasks in collaborative systems.",
                    "Usability heuristics for networked multiplayer games.",
                    "Presence & placement: exploring the benefits of multiple shared displays on an intellective sensemaking task.",
                    "Supporting group decisions by mediating deliberation to improve information pooling.",
                    "The dissemination of knowledge management.",
                    "Member behavior in company online communities.",
                    "WaterCooler: exploring an organization through enterprise social media.",
                    "Exploring bilingual, task-oriented, document-centric chat.",
                    "I felt like a contributing member of the class: increasing class participation with classcommons.",
                    "How and why people Twitter: the role that micro-blogging plays in informal communication at work.",
                    "Image, appearance and vanity in the use of media spaces and video conference systems.",
                    "Grounding interpersonal privacy in mediated settings.",
                    "CIVIL: support geo-collaboration with information visualization.",
                    "Collaborative feed reading in a community.",
                    "All My People Right Here, Right Now: management of group co-presence on a social networking site.",
                    "Locating patient expertise in everyday life.",
                    "Information handover in time-critical work.",
                    "Toward technologies that support family reflections on health.",
                    "Implementing new ways of working: interventions and their effect on the use of an electronic medication record.",
                    "Musical fingerprints: collaboration around home media collections.",
                    "Emergent team coordination: from fire emergency response practice to a non-mimetic simulation game.",
                    "Probing the potential of non-verbal group communication.",
                    "A view from Mount Olympus: the impact of activity tracking tools on the character and practice of moderation.",
                    "Motivated by information: information about online collective action as an incentive for participation.",
                    "Open innovation and the solver community.",
                    "Validation of an inventory of social connectedness.",
                    "COVE: a visual environment for multidisciplinary science collaboration.",
                    "Automated discovery of social networks in text-based online communities.",
                    "Towards a better understanding of group forking dynamics in virtual contexts.",
                    "Supporting and transforming leadership in online creative collaboration.",
                    "Exploring the use of Wikis for information sharing in interdisciplinary design.",
                    "Temporal patterns of communication: media combos.",
                    "Expressing territoriality in collaborative activity.",
                    "Creativity support in IT research organization.",
                    "Cross-organizational information reuse: a third vision of collaborative memory in the enterprise.",
                    "Supporting collaborative sensemaking in map-based emergency management and planning.",
                    "Social performances: understanding the motivations for online participatory behavior."
                ]
            }
        ]
    },
    {
        "year": "2007",
        "name": "6th GROUP 2007",
        "info": "Sanibel Island, Florida, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/group/2007",
                "sub_name": "Proceedings of the 2007 International ACM SIGGROUP Conference on Supporting Group Work, GROUP 2007, Sanibel Island, Florida, USA, November 4-7, 2007.",
                "count": 47,
                "papers": [
                    "Permutations of cooperative work practices: a study of two oncology clinics.",
                    "Practices of stigmergy in architectural work.",
                    "From plans to planning: the case of nursing plans.",
                    "Supporting creativity with awareness in distributed collaboration.",
                    "Providing awareness through situated process maps: the hospital care case.",
                    "Privacy in the open: how attention mediates awareness and privacy in open-plan offices.",
                    "The implications of enterprise-wide pipeline management tools for organizational relations and exchanges.",
                    "Expressive interactions - supporting collaboration in urban design.",
                    "The potential impact of 3d telepresence technology on task performance in emergency trauma care.",
                    "A field study of community bar: (mis)-matches between theory and practice.",
                    "Suitable notification intensity: the dynamic awareness system.",
                    "The magic window: lessons from a year in the life of a co-present media space.",
                    "Searching for experts in the enterprise: combining text and social network analysis.",
                    "Recommendations in taste related domains: collaborative filtering vs. social filtering.",
                    "Arkose: reusing informal information from online discussions.",
                    "Supporting collaborative software development through the visualization of socio-technical dependencies.",
                    "Dcv: a causality detection approach for large-scale dynamic collaboration environments.",
                    "Community, consensus, coercion, control: cs*w or how policy mediates mass participation.",
                    "Knowledge work artifacts: kernel cousins for free/open source software development.",
                    "Structuring cross-organizational knowledge sharing.",
                    "The gospel of knowledge management in and out of a professional community.",
                    "Cooperation and groupness: community formation in small online collaborative groups.",
                    "Feedback for guiding reflection on teamwork practices.",
                    "A metrics framework for evaluating group formation.",
                    "How does common ground increase?",
                    "Tensions across the scales: planning infrastructure for the long-term.",
                    "Growing an infrastructure: the role of gateway organizations in cultivating new communities of users.",
                    "The story of a working workflow management system.",
                    "Creating, destroying, and restoring value in wikipedia.",
                    "An investigation of the use of a wiki to support knowledge exchange in public health.",
                    "Twiki and wetpaint: two wikis in academic environments.",
                    "The \"active\" gatekeeper in collaborative information seeking activities.",
                    "Value tensions in design: the value sensitive design, development, and appropriation of a corporation's groupware system.",
                    "Beyond the lan: techniques from network games for improving groupware performance.",
                    "Users as contextual features of software product development and testing.",
                    "Transparency and technology appropriation: social impacts of a video blogging system in dental hygiene clinical instruction.",
                    "Mixed-method validation of pedagogical concepts for an intercultural online learning environment: a case study.",
                    "The effects of explicit referencing in distance problem solving over shared maps.",
                    "Comparing tagging vocabularies among four enterprise tag-based services.",
                    "Evaluating tagging behavior in social bookmarking systems: metrics and design heuristics.",
                    "The quest for quality tags.",
                    "Judging you by the company you keep: dating on social networking sites.",
                    "That's what friends are for: facilitating 'who knows what' across group boundaries.",
                    "Identity management: multiple presentations of self in facebook.",
                    "The dogear game: a social bookmark recommender system.",
                    "Supporting trust building in distributed groups by appropriate security technology.",
                    "Unpacking the social dimension of external interruptions."
                ]
            }
        ]
    },
    {
        "year": "2005",
        "name": "5th GROUP 2005",
        "info": "Sanibel Island, Florida, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/group/2005",
                "sub_name": "Proceedings of the 2005 International ACM SIGGROUP Conference on Supporting Group Work, GROUP 2005, Sanibel Island, Florida, USA, November 6-9, 2005.",
                "count": 57,
                "papers": [
                    "Becoming Wikipedian: transformation of participation in a collaborative online encyclopedia.",
                    "Follow the (slash) dot: effects of feedback on new members in an online community.",
                    "Supporting social worlds with the community bar.",
                    "The proximity factor: impact of distance on co-located collaboration.",
                    "Integrating 2D and 3D views for spatial collaboration.",
                    "Benefits of synchronous collaboration support for an application-centered analysis team working on complex problems: a case study.",
                    "Matching human actors based on their texts: design and evaluation of an instance of the ExpertFinding framework.",
                    "Searching for expertise in social networks: a simulation of potential strategies.",
                    "Real-world oriented information sharing using social networks.",
                    "A survey of collaborative information seeking practices of academic researchers.",
                    "Broadcasting information via display names in instant messaging.",
                    "\"...real, concrete facts about what works...\": integrating evaluation and design through patterns.",
                    "Uncovering privacy attitudes and practices in instant messaging.",
                    "Instant messaging bots: accountability and peripheral participation for textual user interfaces.",
                    "VERN: facilitating democratic group decision making online.",
                    "Adaptive radio: achieving consensus using negative preferences.",
                    "Quality improvement of email communication in work groups and organizations by reflection.",
                    "FrameDrops: a mobile VideoBlog for workgroups and virtual communities.",
                    "Design decisions in the RideNow project.",
                    "Collaboration support for novice team programming.",
                    "\"Bring your own laptop unless you want to follow the lecture\": alternative communication in the classroom.",
                    "Supporting the dissertation process with grad tools.",
                    "Negotiated rhythms of mobile work: time, place, and work schedules.",
                    "When once is not enough: the role of redundancy in a hospital ward setting.",
                    "A web of coordinative artifacts: collaborative work at a hospital ward.",
                    "Thematic coherence and quotation practices in OSS design-oriented online discussions.",
                    "Negotiation and the coordination of information and activity in distributed software problem management.",
                    "Seeking the source: software source code as a social and technical artifact.",
                    "Supporting the shared experience of spectators through mobile group media.",
                    "Supporting creativity in distributed scientific communities.",
                    "eCell: spatial IT design for group collaboration in school environments.",
                    "Roles and relationships for unified activity management.",
                    "Proactive support for the organization of shared workspaces using activity patterns and content analysis.",
                    "As technophobia disappears: implications for design.",
                    "What ideal end users teach us about collaborative software.",
                    "Consistency maintenance based on the mark & retrace technique in groupware systems.",
                    "An optimization approach to group coupling in heterogeneous collaborative systems.",
                    "A landmark-based transformation approach to concurrency control in group editors.",
                    "Designing for transformations in collaboration: a study of the deployment of homecare technology.",
                    "Involvement matters: the proper involvement of users and behavioural theories in the design of a medical teleconferencing application.",
                    "Timing in the art of integration: 'that's how the bastille got stormed'.",
                    "Intelligent design or felicitous evolution? sustaining order and activity in online communities.",
                    "Why everyone loves to text message: social management with SMS.",
                    "Proactive behaviour may lead to failure in virtual project-based collaborative learning.",
                    "SAGE: software agent-based groupware using e-services.",
                    "A survey of personal and household scheduling.",
                    "Pair programming and the re-appropriation of individual tools for collaborative programming.",
                    "Heterogeneity in harmony: diverse practice in a multimedia arts collective.",
                    "Collaboratory use by peripheral scientists.",
                    "Mediating the co-production of complex media products.",
                    "Taking juxtaposition into account: supporting people's work with maps.",
                    "Promoting awareness in distributed mobile organizations: a cultural and technological challenge.",
                    "Thoughts on critical infrastructure collaboration.",
                    "DAView: a linux WebDAV client supporting effective distributed authoring.",
                    "Insightful illusions: requirements gathering for large-scale groupware systems.",
                    "Unraveling the ordering in persistent chat: a new message ordering feature.",
                    "Analyzing misconceptions in multilingual computer-mediated communication."
                ]
            }
        ]
    },
    {
        "year": "2003",
        "name": "4th GROUP 2003",
        "info": "Sanibel Island, Florida, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/group/2003",
                "sub_name": "Proceedings of the 2003 International ACM SIGGROUP Conference on Supporting Group Work, GROUP 2003, Sanibel Island, Florida, USA, November 9-12, 2003.",
                "count": 41,
                "papers": [
                    "The active lurker: influence of an in-house online community on its outside environment.",
                    "E-community-building in wiInf-central.",
                    "Free software developers as an occupational community: resolving conflicts and fostering collaboration.",
                    "Exms: an animated and avatar-based messaging system for expressive peer communication.",
                    "Text chat in action.",
                    "Introducing chat into business organizations: toward an instant messaging maturity model.",
                    "Collaborative virtual environments for supporting learning communities: an experience of use.",
                    "Expectations for a scientific collaboratory: a case study.",
                    "Designing for loose coupling in mobile groups.",
                    "Motorcycling and social interaction: design for the enjoyment of brief traffic encounters.",
                    "Increasing workplace independence for people with cognitive disabilities by leveraging distributed cognition among caregivers and clients.",
                    "\"Breaking the code\", moving between private and public work in collaborative software development.",
                    "Supporting activity-centric collaboration through peer-to-peer shared objects.",
                    "Software framework for managing heterogeneity in mobile collaborative systems.",
                    "Technology-use mediation: making sense of electronic communication in an organizational context.",
                    "The evolution of artifacts in cooperative work: constructing meaning through activity.",
                    "Making sense of collaboration: the challenge of thinking together in global design teams.",
                    "Why do we ReachOut?: functions of a semi-persistent peer support tool.",
                    "How push-to-talk makes talk less pushy.",
                    "What counts as success? punctuated patterns of use in a persistent chat environment.",
                    "Communities of action: a cognitive and social approach to the design of CSCW systems.",
                    "Managing virtual knowledge networks: topology and performance.",
                    "Improving individual and organizational performance through communities of practice.",
                    "Using the transformational approach to build a safe and generic data synchronizer.",
                    "Owner/user role in computational grid extension by non-dedicated resources.",
                    "Process inheritance and instance modification.",
                    "Information seeking and sharing in design teams.",
                    "Stimulating knowledge discovery and sharing.",
                    "Awareness support in a groupware widget toolkit.",
                    "Instant group communication with QuickML.",
                    "Ordering systems: coordinative practices in architectural design and planning.",
                    "Shaping technology across social worlds: groupware adoption in a distributed organization.",
                    "Using cursor prediction to smooth telepointer jitter.",
                    "From genre analysis to the design of meetingware.",
                    "Technology for boundaries.",
                    "Studying the effect of similarity in online task-focused interactions.",
                    "Group unified histories an instrument for productive unconstrained co-browsing.",
                    "Data at work: supporting sharing in science and engineering.",
                    "Concepts for usable patterns of groupware applications.",
                    "Designed for unanticipated use: common artefacts as design principle for CSCW applications.",
                    "How people use orientation on tables: comprehension, coordination and communication."
                ]
            }
        ]
    },
    {
        "year": "2001",
        "name": "3rd GROUP 2001",
        "info": "Boulder, Colorado, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/group/2001",
                "sub_name": "Proceedings of GROUP 2001, ACM 2001 International Conference on Supporting Group Work, September 30 - October 3, 2001, Boulder, Colorado, USA.",
                "count": 34,
                "papers": [
                    "A computer game virtual environment for collaboration.",
                    "Third annual collaborative editing workshop.",
                    "Decentralized ad-hoc groupware API and framework for mobile collaboration.",
                    "A diary study of rendezvousing: implications for position-aware computing and communications for the general public.",
                    "Group formation in computer-supported collaborative learning.",
                    "Interaction as a framework for flexible workflow modelling.",
                    "Beyond workflow management: product-driven case handling.",
                    "Process descriptions as organisational accounting devices: the dual use of workflow technologies.",
                    "An integrative framework for knowledge extraction in collaborative virtual environments.",
                    "Experiencing a presentation through a mixed reality boundary.",
                    "Characterizing modes of coordination: a comparison between oral and artifact based coordination.",
                    "Towards an optimal resolution to information overload: an infomediary approach.",
                    "Demonstrational customization of a shared whiteboard to support user-defined semantic relationships among objects.",
                    "Exploration environments: concept and empirical evaluation.",
                    "Effects of communication medium on interpersonal perceptions.",
                    "A comparison of usage evaluation and inspection methods for assessing groupware usability.",
                    "Workflow performance and scalability analysis using the layered queuing modeling methodology.",
                    "From local to global coordination: lessons from software reuse.",
                    "Social presence with video and application sharing.",
                    "Building boundaries and negotiating work at home.",
                    "Collaborative document monitoring.",
                    "WWG: a wide-area infrastructure to support groups.",
                    "A team collaboration space supporting capture and access of virtual meetings.",
                    "Undoing any operation in collaborative graphics editing systems.",
                    "When culture and style aren't about clothes: perceptions of task-technology \"fit\" in global virtual teams.",
                    "Evaluating expertise recommendations.",
                    "Symgroup: applying social agents in a group interaction system.",
                    "Diffusion of a collaborative technology cross distance.",
                    "'Safety in numbers': calculation and document re-use in knowledge work.",
                    "The social web cockpit: support for virtual communities.",
                    "Visual and spatial communication and task organization using the visual knowledge builder.",
                    "Effects of group task pressure on perceptions of email and face-to-face communication effectiveness.",
                    "Organizational adoption and diffusion of electronic meeting systems: a case study.",
                    "RoamWare: an integrated architecture for seamless interaction in between mobile meetings."
                ]
            }
        ]
    },
    {
        "year": "1999",
        "name": "2nd GROUP 1999",
        "info": "Phoenix, Arizona USA",
        "venues": [
            {
                "sub_name_abbr": "conf/group/1999",
                "sub_name": "Proceedings of GROUP'99, International Conference on Supporting Group Work, November 14-17, 1999, Embassy Suites Hotel, Phoenix, Arizona, USA.",
                "count": 39,
                "papers": [
                    "Concept indexing.",
                    "Building bridges: customisation and mutual intelligibility in shared category management.",
                    "Negotiation support for compiling knowledge.",
                    "Getting to know the 'customer in the machine'.",
                    "It's all in the words: supporting work activites with lightweight tools.",
                    "\"Let's see your search-tool!\" - collaborative use of tailored artifacts in groupware.",
                    "Supporting cooperation across shared virtual environments.",
                    "Perspective layered visualization of collaborative workspaces.",
                    "Supporting virtual team collaboration: the TeamSCOPE system.",
                    "Supporting the shared care of diabetic patients.",
                    "The coordinative functions of flight strips: air traffic control work revisited.",
                    "Supporting shop floor intelligence: a CSCW approach to production planning and control in flexible manufacturing.",
                    "A distributed algorithm for graphic objects replication in real-time group editors.",
                    "Reducing the problems of group undo.",
                    "An access control framework for multi-user collaborative environments.",
                    "Evaluating the usability of an evolving collaborative product - Changes in user type, tasks and evaluation methods over time.",
                    "An investigation of the influence of network quality of service on the effectiveness of multimedia communication.",
                    "Impacts of PACS on radiological work.",
                    "Pavilion: a middleware framework for collaborative Web-based applications.",
                    "Modeling collaboration using shared objects.",
                    "Modeling shared information spaces (SIS).",
                    "Use of Virtual Science Park resource rooms to support group work in a learning environment.",
                    "Oxymoron, a non-distance knowledge sharing tool for social science students and researchers.",
                    "The role of expectations in human-computer interaction.",
                    "User population and user contributions to virtual publics: a systems model.",
                    "An investigation of social loafing and social compensation in computer-supported cooperative work.",
                    "Pragmatic solutions for better integration of the visually impaired in virtual communities.",
                    "Augmenting recommender systems by embedding interfaces into practices.",
                    "\"Making place\" to make IT work: empirical explorations of HCI for mobile CSCW.",
                    "From description to requirements: an activity theoretic perspective.",
                    "A design process for embedding knowledge management in everyday work.",
                    "The geography of coordination: dealing with distance in R&D work.",
                    "Intertwining perspectives and negotiation.",
                    "Collaboration transparency in the DISCIPLE framework.",
                    "Runtime dynamics in collaborative systems.",
                    "A system architecture for the extension of structured information spaces by coordinated CSCW services.",
                    "Recognition and reasoning in an awareness support system for generation of storyboard-like views of recent activity.",
                    "Facilitating orientation in shared hypermedia workspaces.",
                    "Getting some perspective: using process descriptions to index document history."
                ]
            }
        ]
    },
    {
        "year": "1997",
        "name": "1st GROUP 1997",
        "info": "Phoenix, Arizona USA",
        "venues": [
            {
                "sub_name_abbr": "conf/group/1997",
                "sub_name": "Proceedings of GROUP'97, International Conference on Supporting Group Work: The Integration Challenge, November 16-19, 1997, Embassy Suites Hotel, Phoenix, Arizona, USA.",
                "count": 56,
                "papers": [
                    "Developing collaborative applications on the Web (tutorial).",
                    "Construction search and retrieval of a World-Wide Web (WWW) expert knowledge base (tutorial).",
                    "Using social network analysis to study computer networks (tutorial).",
                    "Real-world groupware frameworks (tutorial): Digital LinkWorks and OpenText LiveLink.",
                    "Methods, tools and technologies for coordination and workflow management (tutorial).",
                    "Collaborative technologies (tutorial).",
                    "Tailorable groupware (workshop): issues, methods, and architectures.",
                    "The role for technology in knowledge management (panel).",
                    "Issues in technology supported learning (panel).",
                    "Using Internet technology within the organization: a structurational analysis of intranets.",
                    "Merging multiple perspectives in groupware use: intra- and intergroup conventions.",
                    "Fostering interdepartmental knowledge communication through groupware: a process improvement perspective.",
                    "Recognising \"success\" and \"failure\": evaluating groupware in a commercial context.",
                    "CEVA: a tool for collaborative video analysis.",
                    "A first step to formally evaluate collaborative work.",
                    "Requirements for a virtual collocation environment.",
                    "Informing the design of collaborative virtual environments.",
                    "Virtual classrooms and communities.",
                    "Infrastructure management as cooperative work: implications for systems design.",
                    "Locating the scene: the particular and the general in contexts for ambulance control.",
                    "Internal information brokering and patterns of usage on corporate intranets.",
                    "Understanding the role of documents in a hierarchical flow of work.",
                    "Telework under the co-ordination of a distributed workflow management system.",
                    "Of maps and scripts - the status of formal constructs in cooperative work.",
                    "GSS for cooperative policymaking: no trivial matter.",
                    "Toward knowledge management systems in the legal domain.",
                    "The CDT mStar environment: scalable distributed teamwork in action.",
                    "Augmenting and multiplying spaces for creative design.",
                    "Collaborative workspace for time deferred electronic cooperation.",
                    "Collaborative virtual workspace.",
                    "Internet-based workflows: a paradigm for dynamically reconfigurable desktop environments.",
                    "A web based enterprise workflow system.",
                    "Automated process support for organizational and personal processes.",
                    "From workplace to development: what have we learned so far and where do we go?",
                    "Evolving Orbit: a process report on building locales.",
                    "\"I love the system - I just don't use it!\".",
                    "Organizational metaphors as lenses for analyzing workflow technology.",
                    "Enhancing workflows by web technology.",
                    "Integrating synchronous multimedia collaboration into workflow management.",
                    "SOAP: social agents providing people with useful information.",
                    "WorkWeb system - multi-workflow management with a multi-agent system.",
                    "Flexible specification of workflow compensation scopes.",
                    "Facilitating idea generation in computer-supported teleconferences.",
                    "An experimental system for transactional messaging.",
                    "Bridging the gap between face-to-face communication and long-term collaboration.",
                    "Flexible support for business processes: extending cooperative hypermedia with process support.",
                    "Developing the cooperative mission development environment.",
                    "Compositional features for promoting awareness within and across cooperative applications.",
                    "Valentine: an environment for home office worker providing informal communication and personal space.",
                    "SISCO: providing a cooperation filter for a shared information space.",
                    "NYNEX portholes: initial user reactions and redesign implications.",
                    "MEDIATE: video as a first-order datatype.",
                    "Integration of face-to-face and video-mediated meetings: HERMES.",
                    "Team automata for groupware systems.",
                    "A generic operation transformation scheme for consistency maintenance in real-time cooperative editing systems.",
                    "Serialization of concurrent operations in a distributed collaborative environment."
                ]
            }
        ]
    }
]