[
    {
        "name": "HCI",
        "year": "2021",
        "info": "Volume 36: 2021",
        "count": 18,
        "papers": [
            "Seeing (Movement) is Believing: The Effect of Motion on Perception of Automatic Systems Performance.",
            "The Allure and the Paucity of Design: Cultures of Design and Design in Culture.",
            "Scaffolding the Mastery of Healthy Behaviors with Fittle+ Systems: Evidence-Based Interventions and Theory.",
            "Interaction Strategies for Effective Augmented Reality Geo-Visualization: Insights from Spatial Cognition.",
            "Screenomics: A Framework to Capture and Analyze Personal Life Experiences and the Ways that Technology Shapes Them.",
            "Technology-Facilitated Intimate Partner Abuse: a qualitative analysis of data from online domestic abuse forums.",
            "Collaboration on large interactive displays: a systematic review.",
            "Modeling interaction as a complex system.",
            "Eye-Mind reader: an intelligent reading interface that promotes long-term comprehension by detecting and responding to mind wandering.",
            "Human-human-robot interaction: robotic object's responsive gestures improve interpersonal evaluation in human interaction.",
            "Contesting control: journeys through surrender, self-awareness and looseness of control in embodied interaction.",
            "Commentary: critique of contesting control: how an excellent exemplar of artist-led HCI research surfaces unresolved issues.",
            "Why mess with users' autonomy? On ideals and dualism in design.",
            "User Representations in Human-Computer Interaction.",
            "Notes of memories: Fostering social interaction, activity and reminiscence through an interactive music exergame developed for people with dementia and their caregivers.",
            "Goldilocks conditions for workplace gamification: how narrative persuasion helps manufacturing workers create self-directed behaviors.",
            "Prioritizing unread e-mails: people send urgent responses before important or short ones.",
            "Physical Programming for Blind and Low Vision Children at Scale."
        ]
    },
    {
        "name": "HCI",
        "year": "2020",
        "info": "Volume 35: 2020",
        "count": 17,
        "papers": [
            "Gaze Interaction With Vibrotactile Feedback: Review and Design Guidelines.",
            "Image-Based Tactile Emojis: Improved Interpretation of Message Intention and Subtle Nuance for Visually Impaired Individuals.",
            "Optimal Orientation of Text Documents for Reading and Writing.",
            "Mobile Video Conferencing for Sharing Outdoor Leisure Activities Over Distance.",
            "Loss Aversion and Preferences in Interaction.",
            "Torino: A Tangible Programming Language Inclusive of Children with Visual Disabilities.",
            "Technology-Mediated Relationship Maintenance in Romantic Long-Distance Relationships: An Autoethnographical Research through Design.",
            "Eudaimonia and Hedonia in the Design and Evaluation of a Cooperative Game for Psychosocial Well-Being.",
            "The Usability Construct: A Concern for Both Theory and Practice.",
            "Introduction to this special issue on unifying human computer interaction and artificial intelligence.",
            "ML Lifecycle Canvas: Designing Machine Learning-Empowered UX with Material Lifecycle Thinking.",
            "RADAR: automated task planning for proactive decision support.",
            "Interactive machine teaching: a human-centered approach to building machine-learned models.",
            "Topicalizer: reframing core concepts in machine learning visualization by co-designing for interpretivist scholarship.",
            "An empirically grounded sociotechnical perspective on designing virtual agents for older adults.",
            "A framework of artificial intelligence augmented design support.",
            "Designing fair AI for managing employees in organizations: a review, critique, and design agenda."
        ]
    },
    {
        "name": "HCI",
        "year": "2019",
        "info": "Volume 34: 2019",
        "count": 14,
        "papers": [
            "Collocated Collaboration Analytics: Principles and Dilemmas for Mining Multimodal Interaction Data.",
            "The Perceptual Quality of the Oculus Rift for Immersive Virtual Reality.",
            "Detecting Intention Through Motor-Imagery-Triggered Pupil Dilations.",
            "Why Would I Use This in My Home? A Model of Domestic Social Robot Acceptance.",
            "Translocality in Global Software Development: the Dark Side of Global Agile.",
            "Virtual Reality Interventions for Personal Development: A Meta-Analysis of Hardware and Software.",
            "Feel the image: The role of emotions in the image-seeking process.",
            "Facets of Website Content.",
            "Distributed Apprenticeship in Online Communities.",
            "Introduction to This Special Issue on Open Design at the Intersection of Making and Manufacturing.",
            "Framing Open Design through Theoretical Concepts and Practical Applications: A Systematic Literature Review.",
            "Producing Printability: Articulation Work and Alignment in 3D Printing.",
            "Makerspaces on Social Media: Shaping Access to Open Design.",
            "Open Source, Open Vision: The MakerPro Network and the Broadening of Participation in Setting Taiwan's IT Vision Agenda."
        ]
    },
    {
        "name": "HCI",
        "year": "2018",
        "info": "Volume 33: 2018",
        "count": 23,
        "papers": [
            "Dealing With Information Overload in Multifaceted Personal Informatics Systems.",
            "Lived Data: Tinkering With Bodies, Code, and Care Work.",
            "Designing for Lived Informatics in Out-of-Clinic Physical Rehabilitation.",
            "The Usability Construct: A Dead End?",
            "Commentary: Usability - A Sensitizing Concept.",
            "Commentary: Usability and the Primacy of Practice.",
            "Commentary: Usability and Theory Building.",
            "Commentary: Usability in Vivo.",
            "Commentary: Usability in Theory and Practice.",
            "Commentary: Actionable Constructs for Practitioners.",
            "Commentary: Appreciative Disagreements.",
            "Erratum.",
            "Interactive Instruction in Bayesian Inference.",
            "Modeling Gesture-Typing Movements.",
            "Vulnerable Young People and Their Experience of Online Risks.",
            "Beyond \"Same Time, Same Place\": Introduction to the Special Issue on Collocated Interaction.",
            "Gaze Patterns and the Temporal Organization of Multiple Activities in Mobile Smartphone Uses.",
            "Facilitating Collocated Crowdsourcing on Situated Displays.",
            "\"Do You See What I Hear?\": Designing for Collocated Patient-Practitioner Collaboration in Audiological Consultations.",
            "Impact of Interaction Paradigms on Full-Body Interaction Collocated Experiences for Promoting Social Initiation and Collaboration.",
            "Beyond Presentation: Shared Slideware Control as a Resource for Collocated Collaboration.",
            "Supporting Place-Specific Interaction through a Physical/Digital Assembly.",
            "Creating Interdependencies: Managing Incidents in Large Organizational Environments."
        ]
    },
    {
        "name": "HCI",
        "year": "2017",
        "info": "Volume 32: 2017",
        "count": 18,
        "papers": [
            "Barriers to and Enablers of Usability in Electronic Consumer Product Development: A Multiple Case Study.",
            "Not Even Past: Information Aging and Temporal Privacy in Online Social Networks.",
            "The Meaning of Interactivity - Some Proposals for Definitions and Measures.",
            "Commentary: Interactivity - Agency, Pace and Attention.",
            "Commentary: Beyond Predictions and Measures.",
            "Commentary: Making Interactivity Meaningful for Contemporary HCI.",
            "Commentary: Interactivity as Cultural.",
            "Designing for Appropriation: A Theoretical Account.",
            "Introduction to This Special Issue on the Lived Experience of Personal Informatics.",
            "What Does All This Data Mean for My Future Mood? Actionable Analytics and Targeted Reflection for Emotional Well-Being.",
            "Personal Informatics, Self-Insight, and Behavior Change: A Critical Review of Current Literature.",
            "Persuasive Anxiety: Designing and Deploying Material and Formal Explorations of Personal Tracking Devices.",
            "Know Thyself: A Theory of the Self for Personal Informatics.",
            "Persuading to Reflect: Role of Reflection and Insight in Persuasive Systems Design for Physical Health.",
            "Quantifying the Changeable Self: The Role of Self-Tracking in Coming to Terms With and Managing Bipolar Disorder.",
            "Evolving the Ecosystem of Personal Behavioral Data.",
            "Using Visual Histories to Reconstruct the Mental Context of Suspended Activities.",
            "EOV Editorial Board."
        ]
    },
    {
        "name": "HCI",
        "year": "2016",
        "info": "Volume 31: 2016",
        "count": 14,
        "papers": [
            "Improving Remote Collaboration With Video Conferencing and Video Portals.",
            "Do (and Say) as I Say: Linguistic Adaptation in Human-Computer Dialogs.",
            "Appropriate or Remix? The Effects of Social Recognition and Psychological Ownership on Intention to Share in Online Communities.",
            "Priming Effects and Strategic Influences in Social Tagging.",
            "Introduction to Special Issue on Body Tracking and Healthcare.",
            "Assessing Multiple Sclerosis With Kinect: Designing Computer Vision Systems for Real-World Use.",
            "Co-Interpreting Movement With Sensors: Assessing Parkinson's Patients' Deep Brain Stimulation Programming.",
            "A Kinect and Inertial Sensor-Based System for the Self-Assessment of Fall Risk: A Home-Based Study in Older People.",
            "Automated Rehabilitation System: Movement Measurement and Feedback for Patients and Physiotherapists in the Rehabilitation Clinic.",
            "Go-with-the-Flow: Tracking, Analysis and Sonification of Movement and Breathing to Build Confidence in Activity Despite Chronic Pain.",
            "Improving the Performance of Input Interfaces Through Scaling and Human Motor Models.",
            "Nomadic Input on Mobile Devices: The Influence of Touch Input Technique and Walking Speed on Performance and Offset Modeling.",
            "Monetary Practices of Traditional Rural Communities in Ethiopia: Implications for New Financial Technology Design.",
            "A Quantified Past: Toward Design for Remembering With Personal Informatics."
        ]
    },
    {
        "name": "HCI",
        "year": "2015",
        "info": "Volume 30: 2015",
        "count": 18,
        "papers": [
            "Learning, Forgetting, and Relearning for Keystroke- and Mouse-Driven Tasks: Relearning Is Important.",
            "Controlling a Smartphone Using Gaze Gestures as the Input Mechanism.",
            "An Investigation of Metrics for the In Situ Detection of Software Expertise.",
            "Application of the Resources Model to the Supervision of an Automated Process.",
            "A Mouse With Two Optical Sensors That Eliminates Coordinate Disturbance During Skilled Strokes.",
            "Interactivity Improves Usability of Geographic Maps for Visually Impaired People.",
            "Introduction to this Special Issue on HCI and Games.",
            "Game-Play Breakdowns and Breakthroughs: Exploring the Relationship Between Action, Understanding, and Involvement.",
            "Reducing Compensatory Motions in Motion-Based Video Games for Stroke Rehabilitation.",
            "From England to Uganda: Children Designing and Evaluating Serious Games.",
            "The Lens of Intrinsic Skill Atoms: A Method for Gameful Design.",
            "Voice in Virtual Worlds: The Design, Use, and Influence of Voice Chat in Online Play.",
            "Guidelines for the Design of Movement-Based Games and Their Relevance to HCI.",
            "Avatars Versus Agents: A Meta-Analysis Quantifying the Effect of Agency on Social Influence.",
            "Examining Factors Influencing the Disruptiveness of Notifications in a Mobile Museum Context.",
            "Evaluating Peripheral Interaction Design.",
            "Faceless Interaction - A Conceptual Examination of the Notion of Interface: Past, Present, and Future.",
            "Commentary: Conduits and Communities."
        ]
    },
    {
        "name": "HCI",
        "year": "2014",
        "info": "Volume 29: 2014",
        "count": 16,
        "papers": [
            "Introduction to This Special Issue on Transnational HCI.",
            "Transnational Imagination and Social Practices: A Transnational Website in a Migrant Community.",
            "Friend or Freund: Social Media and Transnational Connections in Berlin.",
            "Multisited Design: An Analytical Lens for Transnational HCI.",
            "User Experience of On-Screen Interaction Techniques: An Experimental Investigation of Clicking, Sliding, Zooming, Hovering, Dragging, and Flipping.",
            "WallTop: Managing Overflowing Windows on a Large Display.",
            "A Situated Approach of Roles and Participation in Open Source Software Communities.",
            "Providing Adaptive Health Updates Across the Personal Social Network.",
            "Heuristics for Evaluating IT Security Management Tools.",
            "Agent-Based Modeling to Inform Online Community Design: Impact of Topical Breadth, Message Volume, and Discussion Moderation on Member Commitment and Contribution.",
            "Using Task-Induced Pupil Diameter and Blink Rate to Infer Cognitive Load.",
            "Introduction to This Special Issue on Understanding Design Thinking.",
            "What Designers Talk About When They Talk About Context.",
            "Making Things Visible: Opportunities and Tensions in Visual Approaches for Design Research and Practice.",
            "Exploring the Utility of Bayesian Truth Serum for Assessing Design Knowledge.",
            "A Design Thinking Rationality Framework: Framing and Solving Design Problems in Early Concept Generation."
        ]
    },
    {
        "name": "HCI",
        "year": "2013",
        "info": "Volume 28: 2013",
        "count": 16,
        "papers": [
            "Using Visual Information for Grounding and Awareness in Collaborative Tasks.",
            "Understanding the Role of Body Movement in Player Engagement.",
            "Analyzing the Adequacy of Interaction Paradigms in Artificial Reality Experiences.",
            "Enhancing Musical Experience for the Hearing-Impaired Using Visual and Haptic Displays.",
            "Tests of Concepts About Different Kinds of Minds: Predictions About the Behavior of Computers, Robots, and People.",
            "Making Graph-Based Diagrams Work in Sound: The Role of Annotation.",
            "Challenges and Opportunities for Mathematics Software in Expert Problem Solving.",
            "Paratyping: A Contextualized Method of Inquiry for Understanding Perceptions of Mobile and Ubiquitous Computing Technologies.",
            "The Routineness of Routines: Measuring Rhythms of Media Interaction.",
            "An Observational Study of Dual Display Usage in University Classroom Lectures.",
            "Teaching Robots Style: Designing and Evaluating Style-by-Demonstration for Interactive Robotic Locomotion.",
            "Alternatives to Eye Tracking for Predicting Stimulus-Driven Attentional Selection Within Interfaces.",
            "Remote Technical Support Requires Diagnosing the End User (Customer) as well as the Computer.",
            "Machines Outperform Laypersons in Recognizing Emotions Elicited by Autobiographical Recollection.",
            "Do Pedagogical Agents Enhance Software Training?",
            "Issues Related to HCI Application of Fitts's Law."
        ]
    },
    {
        "name": "HCI",
        "year": "2012",
        "info": "Volume 27: 2012",
        "count": 13,
        "papers": [
            "Introduction to this Special Issue on Designing for Personal Memories: Past, Present, and Future.",
            "Before I Forget: From Personal Memory to Family History.",
            "Socio-Technical Lifelogging: Deriving Design Principles for a Future Proof Digital Past.",
            "A Design Perspective on Three Technology Heirlooms.",
            "Reconstructing the Past: Personal Memory Technologies Are Not Just Personal and Not Just for Memory.",
            "Food for Talk: Phototalk in the Context of Sharing a Meal.",
            "Experiences of Aiding Autobiographical Memory Using the SenseCam.",
            "Experiences With Designing Tools for Everyday Reminiscing.",
            "An Experimental Analysis of Experiential and Cognitive Variables in Web Navigation.",
            "It's a Pleasure Buying Here: The Effects of Web-Store Design on Consumers' Emotions and Attitudes.",
            "Interaction Design Beyond the Product: Creating Technology-Enhanced Activity Spaces.",
            "Collective Practices in Common Information Spaces: Insight From Two Case Studies.",
            "Multilingual Touchscreen Keyboard Design and Optimization."
        ]
    },
    {
        "name": "HCI",
        "year": "2011",
        "info": "Volume 26: 2011",
        "count": 10,
        "papers": [
            "Introduction to this Special Issue on Sensemaking.",
            "Resolving Safety-Critical Incidents in a Rally Control Center.",
            "Making Sense of Digital Footprints in Team-Based Legal Investigations: The Acquisition of Focus.",
            "Sensemaking in Collaborative Web Search.",
            "Self-Directed Learning and the Sensemaking Paradox.",
            "Where Am I? How Can I Get There? Impact of Navigability and Narrative Transportation on Spatial Presence.",
            "A Real-Time Eye Tracking System for Predicting and Preventing Postcompletion Errors.",
            "The Expertise Effect on Web Accessibility Evaluation Methods.",
            "A Computational Model of \"Active Vision\" for Visual Search in Human-Computer Interaction.",
            "The Human-Artifact Model: An Activity Theoretical Approach to Artifact Ecologies."
        ]
    },
    {
        "name": "HCI",
        "year": "2010",
        "info": "Volume 25: 2010",
        "count": 11,
        "papers": [
            "Privacy, Trust, and Self-Disclosure Online.",
            "The Importance of Active Exploration, Optical Flow, and Task Alignment for Spatial Learning in Desktop 3D Environments.",
            "Human-Computer Interface Issues in Controlling Virtual Reality With Brain-Computer Interface.",
            "Concept-Driven Interaction Design Research.",
            "Inferring Cross-Sections: When Internal Visualizations Are More Important Than Properties of External Visualizations.",
            "Environment Analysis as a Basis for Designing Multimodal and Multidevice User Interfaces.",
            "NDM-Based Cognitive Agents for Supporting Decision-Making Teams.",
            "The Inference of Perceived Usability From Beauty.",
            "Providing Dynamic Visual Information for Collaborative Tasks: Experiments With Automatic Camera Control.",
            "Toward Spoken Human-Computer Tutorial Dialogues.",
            "Direct Pen Interaction With a Conventional Graphical User Interface."
        ]
    },
    {
        "name": "HCI",
        "year": "2009",
        "info": "Volume 24: 2009",
        "count": 11,
        "papers": [
            "Introduction to this Special Issue on Ubiquitous Multi-Display Environments.",
            "Toward the Digital Design Studio: Large Display Explorations.",
            "The Social Life of Information Displays: How Screens Shape Psychological Responses in Social Contexts.",
            "Equal Opportunities: Do Shareable Interfaces Promote More Group Participation Than Single User Displays?",
            "Synchronous Gestures in Multi-Display Environments.",
            "There and Back Again: Cross-Display Object Movement in Multi-Display Environments.",
            "Shaping the Display of the Future: The Effects of Display Size and Curvature on User Performance and Insights.",
            "A Predictive Model of Human Performance With Scrolling and Hierarchical Lists.",
            "Toolkit Support for Integrating Physical and Digital Interactions.",
            "Interaction Unit Analysis: A New Interaction Design Framework.",
            "Designing Internet-Based Payment Systems: Guidelines and Empirical Basis."
        ]
    },
    {
        "name": "HCI",
        "year": "2008",
        "info": "Volume 23: 2008",
        "count": 10,
        "papers": [
            "Strategies for Guiding Interactive Search: An Empirical Investigation Into the Consequences of Label Relevance for Assessment and Selection.",
            "Exiting the Cleanroom: On Ecological Validity and Ubiquitous Computing.",
            "The Impact of Tangible User Interfaces on Designers' Spatial Cognition.",
            "Integrating Physical and Digital Interactions on Walls for Fluid Design Collaboration.",
            "The Impact of Control-Display Gain on User Performance in Pointing Tasks.",
            "A Study of the Evaluator Effect in Usability Testing.",
            "Scoping Analytical Usability Evaluation Methods: A Case Study.",
            "Usability Problem Reports for Comparative Studies: Consistency and Inspectability.",
            "Analogical Problem Solving in Casual and Experienced Users: When Interface Consistency Leads to Inappropriate Transfer.",
            "Reviewing Meetings in TeamSpace."
        ]
    },
    {
        "name": "HCI",
        "year": "2007",
        "info": "Volume 22: 2007",
        "count": 12,
        "papers": [
            "Introduction to this Special Issue on Awareness Systems Design.",
            "Incorporating Human and Machine Interpretation of Unavailability and Rhythm Awareness Into the Design of Collaborative Applications.",
            "The Impact of Increased Awareness While Face-to-Face.",
            "Interpreting and Acting on Mobile Awareness Cues.",
            "Announcing Activity: Design and Evaluation of an Intentionally Enriched Awareness Service.",
            "Exploring Awareness Related Messaging Through Two Situated-Display-Based Systems.",
            "Defining, Designing, and Evaluating Peripheral Displays: An Analysis Using Activity Theory.",
            "Allocating Time Across Multiple Texts: Sampling and Satisficing.",
            "Social Norms and Behavioral Regulation in Asynchronous Communication: The Shift of Attention During Speed Communication.",
            "Virtual Interpersonal Touch: Expressing and Recognizing Emotions Through Haptic Devices.",
            "SNIF-ACT: A Cognitive Model of User Navigation on the World Wide Web.",
            "The Design Tensions Framework."
        ]
    },
    {
        "name": "HCI",
        "year": "2006",
        "info": "Volume 21: 2006",
        "count": 11,
        "papers": [
            "Introduction to This Special Issue on Foundations of Design in HCI.",
            "Design Perspectives.",
            "Pattern Languages in HCI: A Critical Review.",
            "Designing as Construction of Representations: A Dynamic Viewpoint in Cognitive Design Research.",
            "Modeling the Visual Search of Displays: A Revised ACT-R Model of Icon Search Based on Eye-Tracking Data.",
            "Virtual Video Prototyping.",
            "The Watcher and the Watched: Social Judgments About Privacy in a Public Place.",
            "Communication via Videoconference: Emotional and Cognitive Consequences of Affective Personality Dispositions, Seeing One's Own Picture, and Disturbing Events.",
            "Collective Information Practice: Exploring Privacy and Security as Social and Cultural Phenomena.",
            "Experimental Evaluations of the Twiddler One-Handed Chording Mobile Keyboard.",
            "How to Overcome Disorientation in Mobile Phone Menus: A Comparison of Two Different Types of Navigation Aids."
        ]
    },
    {
        "name": "HCI",
        "year": "2005",
        "info": "Volume 20: 2005",
        "count": 12,
        "papers": [
            "Introduction to This Special Issue on Revisiting and Reinventing E-Mail.",
            "In Search of Coherence: A Review of E-Mail Research.",
            "Supporting Collaborative Task Management in E-mail.",
            "Quality Versus Quantity: E-Mail-Centric Task Management and Its Relation With Overload.",
            "E-Mail Research: Targeting the Enterprise.",
            "Active Messenger: E-Mail Filtering and Delivery in a Heterogeneous Network.",
            "Pricing Electronic Mail to Solve the Problem of Spam.",
            "Automating Human-Performance Modeling at the Millisecond Level.",
            "Exploring the Functional Specifications of a Localized Wayfinding Verbal Aid for Blind Pedestrians: Simple and Structured Urban Areas.",
            "Information Theoretic Models of HCI: A Comparison of the Hick-Hyman Law and Fitts' Law.",
            "Complex Mediation.",
            "Toward a Multidisciplinary Model of Context to Support Context-Aware Computing."
        ]
    },
    {
        "name": "HCI",
        "year": "2004",
        "info": "Volume 19: 2004",
        "count": 20,
        "papers": [
            "Introduction to This Special Issue on Human-Robot Interaction.",
            "Toward a Framework for Human-Robot Interaction.",
            "Assistive Robotics and an Ecology of Elders Living Independently in Their Homes.",
            "Interactive Robots as Social Partners and Peer Tutors for Children: A Field Trial.",
            "Moonlight in Miami: Field Study of Human-Robot Interaction in the Context of an Urban Search and Rescue Disaster Response Training Exercise.",
            "Beyond Usability Evaluation: Analysis of Human-Robot Interaction at a Major Robotics Competition.",
            "Whose Job Is It Anyway? A Study of Human-Robot Interaction in a Collaborative Task.",
            "Cognitive Strategies for the Visual Search of Hierarchical Computer Displays.",
            "Modeling Information Navigation: Implications for Information Architecture.",
            "Gestures Over Video Streams to Support Remote Collaboration on Physical Tasks.",
            "Introduction to This Special Section on Beauty, Goodness, and Usability.",
            "The Interplay of Beauty, Goodness, and Usability in Interactive Products.",
            "A Few Notes on the Study of Beauty in HCI.",
            "Beauty as a Design Prize.",
            "Beauty in Use.",
            "The Product as a Fixed-Effect Fallacy.",
            "Beautiful Objects as an Extension of the Self: A Reply.",
            "Introduction to this Special Section on Change Blindness.",
            "Unseen and Unaware: Implications of Recent Research on Failures of Visual Awareness for Human-Computer Interface Design.",
            "Change Blindness and Its Implications for Complex Monitoring and Control Systems Design and Operator Training."
        ]
    },
    {
        "name": "HCI",
        "year": "2003",
        "info": "Volume 18: 2003",
        "count": 14,
        "papers": [
            "Introduction to This Special Issue on Talking About Things in Mediated Conversations.",
            "Visual Information as a Conversational Resource in Collaborative Physical Tasks.",
            "Fractured Ecologies: Creating Environments for Collaboration.",
            "Ceci n'est pas un Objet? Talking About Objects in E-mail.",
            "Making the Organization Come Alive: Talking Through and About the Technology in Remote Banking.",
            "Things to Talk About When Talking About Things.",
            "Talking About Distributed Communication and Medicine: On Bringing Together Remote and Local Actors.",
            "Talking About Talking About Things.",
            "Theory of Personalization of Appearance: Why Users Personalize Their PCs and Mobile Phones.",
            "Hands-Free, Speech-Based Navigation During Dictation: Difficulties, Consequences, and Solutions.",
            "DENIM: An Informal Web Site Design Tool Inspired by Observations of Practice.",
            "Using Film Cutting Techniques in Interface Design.",
            "Generating Systems Requirements With Facilitated Group Techniques.",
            "Improving Navigation and Learning in Hypertext Environments With Navigable Concept Maps."
        ]
    },
    {
        "name": "HCI",
        "year": "2002",
        "info": "Volume 17: 2002",
        "count": 9,
        "papers": [
            "The Scope and Importance of Human Interruption in Human-Computer Interaction Design.",
            "Comparison of Four Primary Methods for Coordinating the Interruption of People in Human-Computer Interaction.",
            "Introduction to This Special Issue on Text Entry for Mobile Computing.",
            "Text Entry for Mobile Computing: Models and Methods, Theory and Practice.",
            "Dasher: A Gesture-Driven Data Entry Interface for Mobile Computing.",
            "Performance Optimization of Virtual Keyboards.",
            "Empirical Bi-Action Tables: A Tool for the Evaluation and Optimization of Text-Input Systems. Application I: Stylus Keyboards.",
            "Playability in Action Videogames: A Qualitative Design Model.",
            "Reasoning About Users' Actions in a Graphical User Interface."
        ]
    },
    {
        "name": "HCI",
        "year": "2001",
        "info": "Volume 16: 2001",
        "count": 20,
        "papers": [
            "Note-Taking for Self-Explanation and Problem Solving.",
            "Automated Eye-Movement Protocol Analysis.",
            "Introduction to This Special Issue on Context-Aware Computing.",
            "A Conceptual Framework and a Toolkit for Supporting the Rapid Prototyping of Context-Aware Applications.",
            "Privacy in Context.",
            "Changing Places: Contexts of Awareness in Computing.",
            "Intelligibility and Accountability: Human Considerations in Context-Aware Systems.",
            "Distributed Context-Aware Systems.",
            "Seeking a Foundation for Context-Aware Computing.",
            "Articulating the Task at Hand and Making Information Relevant to It.",
            "Context as a Dynamic Construct.",
            "Desituating Action: Digital Representation of Context.",
            "An Infrastructure Approach to Context-Aware Computing.",
            "The Context of Work.",
            "Mobile Devices and Mobile Data-Issues of Identity and Reference.",
            "On Typologies of Situated Interaction.",
            "Context Shifts: Extending the Meanings of Physical Objects With Language.",
            "Interaction Issues in Context-Aware Intelligent Environments.",
            "Context-Aware Technology: A Phenomenological Perspective.",
            "Architectures for Context."
        ]
    },
    {
        "name": "HCI",
        "year": "2000",
        "info": "Volume 15: 2000",
        "count": 11,
        "papers": [
            "Analyzing Human-Computer Interaction as Distributed Cognition: The Resources Model.",
            "Understanding the Relation Between Network Quality of Service and the Usability of Distributed Multimedia Documents.",
            "Introduction to This Special Issue on New Agendas for Human-Computer Interaction.",
            "Let's Stop Pushing the Envelope and Start Addressing It: A Reference Task Agenda for HCI.",
            "The Strategic Use of Complex Computer Systems.",
            "Distance Matters.",
            "The Intellectual Challenge of CSCW: The Gap Between Social Requirements and Technical Feasibility.",
            "Future Design Mindful of the MoRAS.",
            "Designing the User Interface for Multimodal Speech and Pen-Based Gesture Applications: State-of-the-Art Systems and Future Research Directions.",
            "Troubles With the Internet: The Dynamics of Help at Home.",
            "Prototyping Praxis: Constructing Computer Systems and Building Belief."
        ]
    },
    {
        "name": "HCI",
        "year": "1999",
        "info": "Volume 14: 1999",
        "count": 11,
        "papers": [
            "Introduction to This Special issue on Representations in Interactive Systems Development.",
            "Coherence: An Approach to Representing Ethnographic Analyses in Systems Design.",
            "Representations and User-Developer Interaction in Cooperative Analysis and Design.",
            "Representing Cognitive Activity in Complex Tasks.",
            "Metaphors and Models: Conceptual Foundations of Representations in Interactive Systems Development.",
            "The Untrained Eye: How Languages for Software Specification Support Understanding in Untrained Users.",
            "Timetrees: A Branching-Time Structure for Modeling Activity and State in Human-Computer Interaction.",
            "Cooperative Work and Shared Visual Context: An Empirical Study of Comprehension Problems in Side-by-Side and Remote Help Dialogues.",
            "User Interface Affordances in a Planning Representation.",
            "Training Conditions and Strategic Aspects of Skill Transfer in a Simulated Process Control Task.",
            "Effects of Humor in Task-Oriented Human-Computer Interaction and Computer-Mediated Communication: A Direct Test of SRCT Theory."
        ]
    },
    {
        "name": "HCI",
        "year": "1998",
        "info": "Volume 13: 1998",
        "count": 13,
        "papers": [
            "Promoting Active Learning: The Role of System Structure in Learning From Hypertext.",
            "The Work of IT System Developers in Context: An Organizational Case Study.",
            "Cognitive Support: Extending Human Knowledge and Processing Capacities.",
            "Understanding Representation in Design.",
            "Developing and Using Interaction Coding Systems for Studying Groupware Use.",
            "MUST: A Method for Participatory Design.",
            "Introduction to This Special issue on Experimental Comparisons of Usability Evaluation Methods.",
            "Damaged Merchandise? A Review of Experiments That Compare Usability Evaluation Methods.",
            "Commentary on \"Damaged Merchandise?\".",
            "Repairing Damaged Merchandise: A Rejoinder.",
            "Syndetic Modelling.",
            "On \"Technomethodology\": Foundational Relationships Between Ethnomethodology and System Design.",
            "Concerns at Work: Designing Useful Procedures."
        ]
    },
    {
        "name": "HCI",
        "year": "1997",
        "info": "Volume 12: 1997",
        "count": 13,
        "papers": [
            "Introduction to This Special Issue on Multimodal Interfaces.",
            "Transforming Graphical Interfaces Into Auditory Interfaces for Blind Users.",
            "Access to Mathematics for Visually Disabled Students Through Multimodal Interaction.",
            "Mulitmodal Interactive Maps: Designing for Human Performance.",
            "Toward an Information Visualization Workspace: Combining Multiple Means of Expression.",
            "A mechanism for Multimodal Presentation Planning Based on Agent Cooperation and Negotiation.",
            "Technology, Group Process, and Group Outcomes: Testing the Connections in Computer-Mediated and Face-to-Face Groups.",
            "Graphical Argumentation and Design Cognition.",
            "Introduction to This Special issue on Cognitive Architectures and Human-Computer.",
            "The Role of Cognitive Architecture in Modeling the User: Soar's Learning Mechanism.",
            "A Comprehension-Based Model of Exploration.",
            "An Overview of the EPIC Architecture for Cognition and Performance With Application to Human-Computer Interaction.",
            "ACT-R: A Theory of Higher Level Cognition and Its Relation to Visual Attention."
        ]
    },
    {
        "name": "HCI",
        "year": "1996",
        "info": "Volume 11: 1996",
        "count": 14,
        "papers": [
            "One-Handed Touch Typing on a QWERTY keyboard.",
            "Procedural Network Representations of Sequential Data.",
            "Transfer of Declarative Knowledge in Complex Information-Processing Domains.",
            "When the Interface Is a Face.",
            "Interacting With Hypertext: A Meta-Analysis of Experimental Studies.",
            "Quick and Dirty GOMS: A Case Study of Computed Tomography Interpretation.",
            "Mapping Actors and Agendas: Political Frameworks of Systems Design and Participation.",
            "Creating Conditions for Participation: Conflicts and Resources in Systems Development.",
            "Reflections on a Work-Oriented Design Project.",
            "User Participation and Participatory Design: Topics in Computing Education.",
            "Encountering Others: Reciprocal Openings in Participatory Design and User-Centered Design.",
            "Literate Specification: Using Design Rationale to Support Formal Methods in the Development of Human-Machine Interfaces.",
            "TYPIST: A Theory of Performance in Skilled Typing.",
            "Interpersonal Access Control in Computer-Mediated Communications: A Systematic Analysis of the Design Space."
        ]
    },
    {
        "name": "HCI",
        "year": "1995",
        "info": "Volume 10: 1995",
        "count": 11,
        "papers": [
            "Living Design Memory: Framework, Implementation, Lessons Learned.",
            "Algorithms for Automatic Dialogue Analysis Using Propositional Production Systems.",
            "Beyond Object-Oriented Technology: Where Current Approaches Fall Short.",
            "Design Strategies and Knowledge in Object-Oriented Programming: Effects of Experience.",
            "Cognitive Activities and Levels of Abstraction in Procedural and Object-Oriented Design.",
            "Are Objects That Important? Effects of Expertise and Familiarity on Classification of Object-Oriented Code.",
            "Object-Oriented Analysis and Design in Software Project Teams.",
            "Object-Oriented System Development in a Banking Project: Methodology, Experience, and Conclusions.",
            "Objects of Our Desire: Empirical Research on Object-Oriented Development.",
            "Development of Text-Editing Skill: From Semantic and Syntactic Mappings to Procedures.",
            "Remote Conversations: The Effects of Mediating Talk With Technology."
        ]
    },
    {
        "name": "HCI",
        "year": "1994",
        "info": "Volume 9: 1994",
        "count": 13,
        "papers": [
            "Introduction to This Special issue on Context in Design.",
            "Borderline Issues: Social and Material Aspects of Design.",
            "Commentary on Borderline issues.",
            "Patrolling the Border: A Reply.",
            "Representations and Requirements: The Value of Ethnography in System Design.",
            "The Role of Visual Fidelity in Computer-Based Instruction.",
            "What Does Pseudo-Code Do? A Psychological Analysis of the use of Pseudo-Code by Experienced Programmers.",
            "Introduction to This Special issue on Exploratory Sequential Data Analysis.",
            "Exploratory Sequential Data Analysis: Foundations.",
            "Sequences of Actions for Individual and Teams of Air Traffic Controllers.",
            "Developing Process Models as Summaries of HCI Action Sequences.",
            "Management of Repair in Human-Computer Interaction.",
            "Characterizing the Sequential Structure of Interactive Behaviors Through Statistical and Grammatical Techniques."
        ]
    },
    {
        "name": "HCI",
        "year": "1993",
        "info": "Volume 8: 1993",
        "count": 14,
        "papers": [
            "An Empirical Evaluation of Some Articulatory and Cognitive Aspects of Marking Menus.",
            "Internalizing and the Use Specificity of Device Knowledge.",
            "A Wizard of Oz Study of Advice Giving and Following.",
            "Understanding Calendar Use.",
            "Automated Protocol Analysis.",
            "Text-Based On-Line Conferencing: A Conceptual and Empirical Analysis Using a Minimal Prototype.",
            "Predicting the Skilled Use of Hierarchical Menus With the Keystroke-Level Model.",
            "Animated Demonstrations for Learning Procedural Computer-Based Tasks.",
            "Who Controls the Technology in Group Support Systems? Determinants and Consequences.",
            "Project Ernestine: Validating a GOMS Analysis for Predicting and Explaining Real-World Task Performance.",
            "Using ITS to Create an Insurance Industry Application: A Joint Case Study.",
            "Is It Easier to Hop or Walk? Development Issues in Interface Design.",
            "A Cognitive Model for Understanding Graphical Perception.",
            "Conversations Over Video Conferences: An Evaluation of the Spoken Aspects of Video-Mediated Communication."
        ]
    },
    {
        "name": "HCI",
        "year": "1992",
        "info": "Volume 7: 1992",
        "count": 12,
        "papers": [
            "Temporal Aspects of Tasks in the User Action Notation.",
            "Inferring Graphical Procedures: The Compleat Metamouse.",
            "Fitts' Law as a Research and Design Tool in Human-Computer Interaction.",
            "The Prevention of Mode Errors Through Sensory Feedback.",
            "Human-Computer Collaboration.",
            "An Assessment of Written/Interactive Dialogue for Information Retrieval Applications.",
            "An Assessment of the Experimental Literature on Electronic Support of Group Work: Results of a Meta-Analysis.",
            "Supporting Indirect Collaborative Design With Integrated Knowledge-Based Design Environments.",
            "Media Space and Communicative Asymmetries: Preliminary Observations of Video-Mediated Interaction.",
            "Small Group Design Meetings: An Analysis of Collaboration.",
            "Task Requirements and Media Choice in Collaborative Writing.",
            "Error as Opportunity: Learning in a Cooperative Task."
        ]
    },
    {
        "name": "HCI",
        "year": "1991",
        "info": "Volume 6: 1991",
        "count": 13,
        "papers": [
            "Knowledge Creation and Retrieval in Program Design: A Comparison of Novice and intermediate Student Programmers.",
            "Users Request Help From Advisory Systems With Simple and Restricted Language: Effects of Real-Time Constraints and Limited Shared Context.",
            "Errors in Training Computer Skills: on the Positive Function of Errors.",
            "How Decisions Happen in Organizations.",
            "The Equalization Phenomenon: Status Effects in Computer-Mediated and Face-to-Face Decision-Making Groups.",
            "Systematic Sources of Suboptimal Interface Design in Large Product Development Organizations.",
            "Introduction to This Special issue on Design Rationale.",
            "Questions, Options, and Criteria: Elements of Design Space Analysis.",
            "What's in Design Rationale?",
            "Deliberated Evolution: Stalking the View Matcher in Design Space.",
            "Problem-Centered Design for Expressiveness and Facility in a Graphical Programming System.",
            "A Process-Oriented Approach to Design Rationale.",
            "Making Argumentation Serve Design."
        ]
    },
    {
        "name": "HCI",
        "year": "1990",
        "info": "Volume 5: 1990",
        "count": 12,
        "papers": [
            "The Acquisition and Performance of Text-Editing Skill: A Cognitive Complexity Analysis.",
            "Specific Versus General Procedures in Instructions.",
            "Inferring User Expertise for Adaptive Interfaces.",
            "A Research Agenda for the Nineties in Human-Computer Interaction.",
            "A Semantic Analysis of the Design Space of Input Devices.",
            "Theory-Based Design for Easily Learned Interfaces.",
            "The Growth of Cognitive Modeling in Human-Computer Interaction Since GOMS.",
            "Expertise in a Computer Operating System: Conceptualization and Performance.",
            "Designing the Design Process: Exploiting Opportunistic Thoughts.",
            "The Cognitive Consequences of Object-Oriented Design.",
            "Effective Feedback Content for Tutoring Complex Skills.",
            "The Nature of Device Models: The Yoked State Space Hypothesis and Some Experiments With Text Editors."
        ]
    },
    {
        "name": "HCI",
        "year": "1989",
        "info": "Volume 4: 1989",
        "count": 10,
        "papers": [
            "Earcons and Icons: Their Structure and Common Design Principles.",
            "Soundtrack: An Auditory Interface for Blind Users.",
            "The SonicFinder: An Interface That Uses Auditory Icons.",
            "Testing the Principle of Orthogonality in Language Design.",
            "Some Lessons From an Exercise in Specification.",
            "Does the Medium Make a Difference? Two Studies of Writing With Pen and Paper and With Computers.",
            "A Human Activity Approach to User Interfaces.",
            "Individual Differences and Conceptual Models in Training Novice Users.",
            "Finding Information on a Menu: Linking Menu Organization to the User's Goals.",
            "Out of Scandinavia: Alternative Approaches to Software Design and System Development."
        ]
    },
    {
        "name": "HCI",
        "year": "1987",
        "info": "Volume 3: 1987",
        "count": 12,
        "papers": [
            "Introduction to This Special issue on Computer-Supported Cooperative Work.",
            "A Language/Action Perspective on the Design of Cooperative Work.",
            "Relationships and Tasks in Scientific Research Collaboration.",
            "Cognitive Science and Organizational Design: A Case Study of Computer Conferencing.",
            "An Architecture for Intelligent Interfaces: Outline of an Approach to Supporting Operators of Complex Systems.",
            "The Minimal Manual.",
            "Procedures for Obtaining and Testing User-Selected Terminologies.",
            "Construction Kits and Design Environments: Steps Toward Human Problem-Domain Communication.",
            "A Keystroke Analysis of Learning and Transfer in Text Editing.",
            "Animation Using Temporal Constraints: An Overview of the Animus System.",
            "Analysis of the Cognition Involved in Spreadsheet Software Interaction.",
            "Debugging: An Analysis of Bug-Location Strategies."
        ]
    },
    {
        "name": "HCI",
        "year": "1986",
        "info": "Volume 2: 1986",
        "count": 13,
        "papers": [
            "Learning to Use a Text Editor: Some Learner Characteristics That Predict Success.",
            "A Cognitively Based Functional Taxonomy of Decision Support Techniques.",
            "The Influence of Color and Graphical Information Presentation in a Managerial Decision Simulation.",
            "Task-Action Grammars: A Model of the Mental Representation of Task Languages.",
            "Learning Flow of Control: Recursive and Iterative Procedures.",
            "Auditory Icons: Using Sound in Computer Interfaces.",
            "Graphic Representation of Judgmental Information.",
            "Structure and Development of Plans in Computer Text Editing.",
            "Softening Up Hard Science: Reply to Newell and Card.",
            "Straightening Out Softening Up: Response to Carroll and Campbell.",
            "Graphically Defining New Building Blocks in ThingLab.",
            "Designing Interactive Tutorials for Computer Users.",
            "A Cognitive Model and Computer Tutor for Programming Recursion."
        ]
    },
    {
        "name": "HCI",
        "year": "1985",
        "info": "Volume 1: 1985",
        "count": 14,
        "papers": [
            "A Principled Design for an Integrated Computational Environment.",
            "Systems with Human Monitors: A Signal Detection Analysis.",
            "Affect in Computer-Meditated Communication: An Experiment in Synchronous Terminal-to-Terminal Discussion.",
            "Introduction to this Special issue on Novice Programming.",
            "Novice LISP Errors: Undetected Losses of Information from Working Memory.",
            "Preprogramming Knowledge: A Major Source of Misconceptions in Novice Programmers.",
            "A Goal/Plan Analysis of Buggy Pascal Programs.",
            "The Prospects for Psychological Science in Human-Computer Interaction.",
            "An Application of the Birmingham Discourse Analysis System to the Study of Computer Guidance Interactions.",
            "Exploring Exploring a Word Processor.",
            "Introduction to This Special Issue on New Perspectives on Human-Computer Interaction.",
            "Direct Manipulation Interfaces.",
            "Knowledge-Based User Interface Design.",
            "Issues in Cognitive and Social Ergonomics: From Our House to Bauhaus."
        ]
    }
]