[
    {
        "year": "2021",
        "name": "20th IDC 2021",
        "info": "Athens, Greece",
        "venues": [
            {
                "sub_name_abbr": "conf/acmidc/2021",
                "sub_name": "IDC '21: Interaction Design and Children, Athens, Greece, 24-30 June, 2021.",
                "count": 98,
                "papers": [
                    "Sensor-Based Interactive Worksheets to Support Guided Scientific Inquiry.",
                    "Circular Species: Designing critical thinking into children's science education through biomaterials and augmented reality.",
                    "Designing an Engaging Story-stem taken from the MCAST test.",
                    "Digital Design Literacy in K-9 Education: Experiences from Pioneer Teachers.",
                    "\"I'm in his belly!\": Children's Responses to Different Types of Characters in Virtual Reality.",
                    "How do children's perceptions of machine intelligence change when training and coding smart programs?",
                    "Conversation Analysis for Facilitation in Children's Intercultural Collaboration.",
                    "Stay Connected in An Immersive World: Why Teenagers Engage in Social Virtual Reality.",
                    "From Sustainable Mobility to Good Deeds: Supporting School Participation during COVID-19 Emergency through a Playful Education Platform.",
                    "Using Explainability to Help Children UnderstandGender Bias in AI.",
                    "Accembly at Home: Accessible Spatial Programming for Children with Visual Impairments and their Families.",
                    "Analyzing Teleoperation Interface Usage of Robots in Therapy for Children with Autism.",
                    "A Systematic Review of Empowerment in Child-Computer Interaction Research.",
                    "Would You Rather: A Focus Group Method for Eliciting and Discussing Formative Design Insights with Children.",
                    "Capturing and Considering Idea Development in School Pupils' Design Activities.",
                    "\"The concept of learning goals will always be in my head\" - Aligning and Applying Learning Goals in Participatory Design in a School Context.",
                    "Playing on the Globe: Facilitating virtual communications between Namibian and Finnish learners to co-design an interactive map game.",
                    "Robots, Bullies and Stories: A Remote Co-design Study with Children.",
                    "\"Let's Draw Chocolate Milk Together\": Supports and Challenges for Families' Joint Engagement with Artistic Tablet Apps.",
                    "Designing Mobile Applications to Minimize Disorientation in Informal Learning Environments.",
                    "ZooDesign: Methods for Understanding and Facilitating Children's Education at Zoos.",
                    "Evaluating the vocal characteristics of elementary school students: basic assessment tools and methodology.",
                    "Engaging Parents and Teens in an Asynchronous, Remote, Community-Based Method for Understanding the Future of Voice Technology.",
                    "PlushPal: Storytelling with Interactive Plush Toys and Machine Learning.",
                    "Opportunities and Limitations of Construction Kits in Culturally Responsive Computing Contexts: Lessons from ScratchJr and Family Creative Learning.",
                    "3DnST: A Framework Towards Understanding Children's Interaction with Tinkercad and Enhancing Spatial Thinking Skills.",
                    "A Survey of Interface Representations in Visual Programming Language Environments for Children's Physical Computing Kits.",
                    "Challenges and Unexpected Affordances of Physical Computing Going Remote.",
                    "RoboMath: Designing a Learning Companion Robot to Support Children's Numerical Skills.",
                    "Symbolic Relations in Collaborative Coding: How Children and Parents Map Across Symbol Systems While Coding Robots.",
                    "\"Alexa, Can I Program You?\": Student Perceptions of Conversational Artificial Intelligence Before and After Programming Alexa.",
                    "Designing Emotionally Expressive Social Commentary to Facilitate Child-Robot Interaction.",
                    "Social bots of conviction as dialogue facilitators for history education: Promoting historical empathy in teens through dialogue.",
                    "Can Conversational Agents Change the Way Children Talk to People?",
                    "Information flow and children's emotions during collaborative coding: A causal analysis.",
                    "Children as players, modders, and creators of simulation games: A design for making sense of complex real-world problems: Children as players, modders and creators of simulation games.",
                    "When Children Program Intelligent Environments: Lessons Learned from a Serious AR Game.",
                    "Towards Designing Enactment-Scaffolded Narrative Authoring Tools for Elementary-School Children.",
                    "Supporting Shy Preschool Children in Joining Social Play.",
                    "Children's Play and Problem Solving in Motion-Based Educational Games: Synergies between Human Annotations and Multi-Modal Data.",
                    "How Can Digital Education Contribute To A Pedagogy For Environmental Care?",
                    "Draw2Code: Low-Cost Tangible Programming for Creating AR Animations.",
                    "Touching Information with DIY Paper Charts & AR Markers.",
                    "Myco-kit: Towards a design for interspecies creative learning.",
                    "Scientific Inquiry in Middle Schools by combining Computational Thinking, Wet Lab Experiments, and Liquid Handling Robots.",
                    "Designing Biotech Ethics Cards: Promoting Critical Making During an Online Workshop with Youth.",
                    "Romi: Screen Peripheral Companion for Mediating Children's Healthy Screen Use.",
                    "Designing domain-specific blocks for diffusion: The dialogue between pedagogical principles and design decisions.",
                    "Bio Sketchbook: an AI-assisted Sketching Partner for Children's Biodiversity Observational Learning.",
                    "Introducing Teenagers to Machine Learning through Design Fiction: An Exploratory Case Study.",
                    "MakerCards: Designing An Electronic Component Discovery Tool to Support Remote Physical Computing Education.",
                    "Apples and Oranges: Comparing Crafty Sonic Circuits for Electronics Education.",
                    "Designing Collective Teacher-Children Personas in Preschool: A Methodological Approach.",
                    "Understanding the Role of Digital Technology in the Transitions of Refugee Families with Young Children into A New Culture: A Case Study of Scotland.",
                    "TikTok as a data gathering space: the case of grandchildren and grandparents during the COVID-19 pandemic.",
                    "Reflective Data Storytelling for Youth: The CODAP Story Builder.",
                    "Teacher Views on Storytelling-based Cybersecurity Education with Social Robots.",
                    "\"Alexa, What is That Sound?\" A Video Analysis of Child-Agent Communication From Two Amazon Alexa Games.",
                    "Assessing Children's First Impressions of \"WallBo\" - A Robotic Handwashing Buddy.",
                    "Do Shy Children Keep more Distance from a Social Robot? Exploring Shy Children's Proxemics with a Social Robot or a Human.",
                    "Exploring the Concept of Fairness in Everyday, Imaginary and Robot Scenarios: A Cross-Cultural Study With Children in Japan and Uganda.",
                    "The Effects of Motivational Strategies and Goal Attainment on Children's Trust in a Virtual Social Robot: A Pilot Study.",
                    "CozmoNAOts: Designing an Autonomous Learning Task with Social and Educational Robots.",
                    "ModHera: A modular kit for parents to take care babies.",
                    "To be Defined or Not to Be? Addressing Internal Questions in the Online Community for Gender Diverse Youth.",
                    "Designing the Virtual SPIKEY-20 Epidemic: Engaging Youth in Seeking Information and Using Personal Protection.",
                    "sssnake: a remote multiplayer toy for children.",
                    "Dot's World: An Emotional Development Support Platform for Children.",
                    "CodeQuilt: Designing an Hour of Code Activity for Creative and Critical Engagement with Computing.",
                    "Pandemic Pivot: Designing a Participatory Simulation to Support Social Distancing and Remote Learning.",
                    "Engage!: Co-designing Search Engine Result Pages to Foster Interactions.",
                    "Bubble Beats: A Breathing Exercise Game Based on Music Rhythm for Children.",
                    "Learn to Machine Learn: Designing a Game Based Approach for Teaching Machine Learning to Primary and Secondary Education Students.",
                    "Mapping Engaging Experiences and Frame Shifting in Elucidation and Interactive Animation with Blending Theory in Public Exhibitions.",
                    "Scaffolding Design to Bridge the Gaps between Machine Learning and Scientific Discovery for K-12 STEM Education.",
                    "Designing Children's New Learning Partner: Collaborative Artificial Intelligence for Learning to Solve the Rubik's Cube.",
                    "MODU: A Story-Based Empathy Expression Training Game for Children with Mild Intellectual Disability and Borderline Intellectual Functioning.",
                    "EPPics: Enhanced Personalised Picture Stories.",
                    "Child's Bonding and Self-Disclosing with a Robot in Family Care.",
                    "Designing for collaborative learning through the use of Projection-Based Augmented Reality: In cultural heritage context.",
                    "Participatory Design for STEM Learning Environments with Youth & Families.",
                    "Towards Effective Robot-Teleoperation in Therapy for Children with Autism.",
                    "How do we teach Emerging Technologies in K-9 Education?: Using design fiction and constructionist approaches to support the understanding of emerging technologies' societal implications in formal K-9 education.",
                    "Introducing Children to Machine Learning Through Machine Teaching.",
                    "Exploring Multi-Sensory Interaction to Enhance Children' Learning Experience.",
                    "Embodied design for non-speaking Autistic children: the emergence of rhythmical joint action.",
                    "Toy Design for Emotion Regulation: Current and Potential Research Opportunities: Toy Design for Emotion Regulation.",
                    "Child-Computer Interaction in the Global South: Designing for Children on the Margins.",
                    "5th KidRec Workshop: Search and Recommendation Technology through the Lens of a Teacher.",
                    "Designing Games for and with Children. Co-design Methodologies for playful activities using AR/VR and Social Agents.",
                    "Justice-Centered Design Engagements with Children and Teens: : What's at Stake, the Actions we Take, and the Commitments we Make.",
                    "Translational IDC: Bridging the IDC Research-Practice Gap.",
                    "Developing Ideas and Methods for Supporting Whole Body Interaction in Remote Co-Design with Children.",
                    "Smart Toys++: Exploiting the Social Connectedness for Playing and Learning.",
                    "Children, Robots, and Virtual Agents: Present and Future Challenges.",
                    "Participatory Design of the World's Largest DPD Project with Children.",
                    "Crafting Sound: Simple Sonic Interfaces for Education and Creation.",
                    "Introducing the CCI UX Playbook."
                ]
            }
        ]
    },
    {
        "year": "2020",
        "name": "19th IDC 2020",
        "info": "London, UK",
        "venues": [
            {
                "sub_name_abbr": "conf/acmidc/2020",
                "sub_name": "Proceedings of the 19th ACM International Conference on Interaction Design and Children, IDC 2020, London, United Kingdom, June 17-24, 2020.",
                "count": 55,
                "papers": [
                    "Decoding design agendas: an ethical design activity for middle school students.",
                    "Coming to your senses: promoting critical thinking about sensors through playful interaction in classrooms.",
                    "SmileyCluster: supporting accessible machine learning in K-12 scientific discovery.",
                    "Investigating children's spontaneous gestures when programming using TUIs and GUIs.",
                    "'Phone apps know a lot about you!': educating early adolescents about informational privacy through a phygital interactive book.",
                    "Youth making machine learning models for gesture-controlled interactive media.",
                    "Out of tune: discord and learning in a music programming museum exhibit.",
                    "A designerly approach as a foundation for school children's computational thinking skills while developing digital games.",
                    "Can design documentaries disrupt design for disability?",
                    "Designing an online sex education resource for gender-diverse youth.",
                    "\"It's your private information. it's your life.\": young people's views of personal data use by online technologies.",
                    "Not on any map: co-designing a meaningful bespoke technology with a child with profound learning difficulties.",
                    "Exploring accessible programming with educators and visually impaired children.",
                    "18 Years of ethics in child-computer interaction research: a systematic literature review.",
                    "Enabling children to design for others with expanded proxy design.",
                    "Designing dyadic caregiver-child personas for interactive digital media use.",
                    "Another decade of IDC research: examining and reflecting on values and ethics.",
                    "Exploring young children's engagement in joint reading with a conversational agent.",
                    "Investigating family perceptions and design preferences for an in-home robot.",
                    "Better together: young children's tendencies to help a non-humanoid robot collaborator.",
                    "What is a robot?: an artistic approach to understand children's imaginaries about robots.",
                    "\"Whom would you like to talk with?\": exploring conversational agents for children's linguistic assessment.",
                    "Teachers' perspectives on social robots in education: an exploratory case study.",
                    "Using tabletop robots to promote inclusive classroom experiences.",
                    "\"When is the pressure zero inside a container? Mission impossible\": 7th grade students learn science by constructing computational models using the much.matter.in.motion platform.",
                    "Phenomenological programming: a novel approach to designing domain specific programming environments for science learning.",
                    "Gathering garbage or going green?: shifting social perspectives to empower individuals with special needs.",
                    "Designing to engage children in monitoring indoor air quality: a participatory approach.",
                    "CCI in the wild: designing for environmental stewardship through children's nature-play.",
                    "Augmented scientific investigation: support the exploration of invisible \"fine details\" in science via augmented reality.",
                    "What do atoms feel?: understanding forces and energy in chemical bonding through the ELI-Chem environment.",
                    "A content analysis of voice-based apps on the market for early literacy development.",
                    "Spelling their pictures: the role of visual scaffolds in an authoring app for young children's literacy and creativity.",
                    "An english language learning study with rural chinese children using an augmented reality app.",
                    "Guiding the selection of child spellchecker suggestions using audio and visual cues.",
                    "\"Try your best\": parent behaviors during administration of an online language assessment tool for bilingual Mandarin-English children.",
                    "Ding- dong: the Storybell and its wizard.",
                    "Collaborative comic-based digital storytelling with primary school children.",
                    "Ebook presentation styles and their impact on the learning of children.",
                    "\"Otter this world\": can a mobile application promote children's connectedness to nature?",
                    "\"The thinking cap 2.0\": preliminary study on fostering growth mindset of children by means of electroencephalography and perceived magic using artifacts from fictional sci-fi universes.",
                    "Pengunaut trainer: a playful VR app to prepare children for MRI examinations: in-depth game design analysis.",
                    "Therapist vibe: children's expressions of their emotions through storytelling with a chatbot.",
                    "Identifying opportunities and challenges: how children use technologies for managing diabetes.",
                    "Exploring an augmented reality social learning game for elementary school students.",
                    "LifeMosaic: co-design of a personal informatics tool for youth.",
                    "Puppy island: theory-driven design of a serious game for young children with cystic fibrosis.",
                    "Using sensing technologies to explain children's self-representation in motion-based educational games.",
                    "Engaging families around museum exhibits: comparing tangible and multi-touch interfaces.",
                    "Supporting children's math learning with feedback-augmented narrative technology.",
                    "How do we design for concreteness fading?: survey, general framework, and design dimensions.",
                    "Techniques for augmented-tangibles on mobile devices for early childhood learning.",
                    "Blue whale street art as a landmark: extracting landmarks from children's cognitive maps for the design of locative systems.",
                    "Giggle gauge: a self-report instrument for evaluating children's engagement with technology.",
                    "\"It's just too much\": exploring children's views of boredom and strategies to manage feelings of boredom."
                ]
            },
            {
                "sub_name_abbr": "conf/acmidc/2020ea",
                "sub_name": "Extended Abstracts Proceedings of the 19th ACM International Conference on Interaction Design and Children, IDC 2020, London, United Kingdom, June 17-24, 2020.",
                "count": 61,
                "papers": [
                    "Digital childcare: need of the hour for international student mothers.",
                    "Better together: designing for child-robot collaboration.",
                    "Cyber security education for children through gamification: research plan and perspectives.",
                    "Using conversational agents to foster young children's science learning from screen media.",
                    "Capturing engagement in early science learning: triangulating observational and psychophysiological measures.",
                    "Combining computational and science practices in K-12 education.",
                    "Exploring child-robot interaction ecology in the development of computational thinking.",
                    "Designing an augmented reality learning environment for visuospatial thinking in geometry.",
                    "Smart toys, smart tangibles, robots and other smart things for children.",
                    "Chasing play potentials in food culture: embracing children's perspectives.",
                    "Emergent, situated and prospective ethics for child-computer interaction research.",
                    "Researchers' toolbox for the future: designing the future of technology with and for children.",
                    "Teaching the next generation of child-computer interaction researchers and designers.",
                    "Evaluation of emerging educational technologies in the classroom.",
                    "Multi-modal gesture elicitation methodology for children.",
                    "Creating opportunities for children's critical reflections on AI, robotics and other intelligent technologies.",
                    "From design to difference: increasing impact of IDC research.",
                    "4th KidRec workshop - \"what does good look like?\": from design, research, and practice to policy.",
                    "What we learn when designing with marginalised children.",
                    "Planning the world's most inclusive PD project.",
                    "Technology-mediated personalised learning for younger learners: concepts, design, methods and practice.",
                    "Child development and interaction design.",
                    "More than numbers: self-expression centered T1D app design for teenagers.",
                    "Social making: teaching children to design solutions for the global goals.",
                    "OSMoSIS: interactive sound generation system for children with autism.",
                    "Synchronised shared spaces: design considerations for tablet technology.",
                    "Impact of exergames and game elements on cerebral palsy children: resistance and sound.",
                    "Designing experiments for children and robots.",
                    "Teen evaluations of a game targeting school refusal.",
                    "Smart buckets: an interactive interface enabling sensory integration.",
                    "Understanding coding activities for teens: a focus on school teachers' perspectives.",
                    "EdBoard: an educational breadboard.",
                    "Social robot teaches cybersecurity.",
                    "ARbits: Towards a DIY, AR-compatible electrical circuitry toolkit for children.",
                    "The AL Goldberg machine: a virtual environment for engaging learners in algorithmic practices.",
                    "Can you guide me?: supporting children's spatial perspective taking through games with robots.",
                    "Towards smart rooms for children: mapping children's needs in the context of their bedrooms in the IoT era.",
                    "The graphic routines of closed and open shapes: children's drawing strategies on a touchscreen.",
                    "VWorld: an immersive VR system for learning programming.",
                    "Two in a Pod: promoting sustainability and healthy eating in children through smart gardening.",
                    "SuperSolar: a wearable energy generator for children's outdoor play.",
                    "Wonder with elinor: designing a socially contingent video viewing experience.",
                    "Interaction design & children toolkit.",
                    "Engaging children and parents in physically active maths sessions.",
                    "βWave: an EEG-based self-awareness curriculum.",
                    "Community garden: designing for connectedness in online museum exhibits.",
                    "Interactive educational game using machine learning.",
                    "Virtual dioramas transform natural history museum exhibit halls & gardens to life with immersive AR.",
                    "Buildagram: a constructionist environment for spatial reasoning.",
                    "GROWBOT: a robotic system to help children grow plants.",
                    "EPESonic: understanding fictional framing of metaphorical actions in young children's digital interaction.",
                    "My first biolab: an inquiry-based learning system for microbiology exploration.",
                    "Designing for children's values: conceptualizing value-sensitive technologies with children.",
                    "Co-designing immersive VR with and for adolescents in elementary school.",
                    "Exploring children's everyday journeys with user-generated AR.",
                    "Towards automatic drawing animation using physics-based evolution.",
                    "Gamifying bioethics: a case study of co-designing empirical tools with adolescents.",
                    "Co-designing a conversational interactive exhibit for children.",
                    "Exploratory study of young children's social media needs and requirements.",
                    "Designing a tool for promoting fluid-intake behavior: a qualitative study with pediatric patients.",
                    "Designing playful, tangible self-report tools to give the child a voice."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "18th IDC 2019",
        "info": "Boise, ID, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/acmidc/2019",
                "sub_name": "Proceedings of the 18th ACM International Conference on Interaction Design and Children, IDC 2019, Boise, ID, USA, June 12-15, 2019.",
                "count": 104,
                "papers": [
                    "Keynote: Experiencing the Body as Play.",
                    "Broadening the Discussion of Ethics in the Interaction Design and Children Community.",
                    "Paths to Partnering.",
                    "2018 Edith Ackermann Award: Bildungsmedien: where TechKreativ meets Footwork.",
                    "Using Gameplay Design Patterns with Children in the Redesign of a Collaborative Co-located Game.",
                    "Engaging Teenagers in Asynchronous Online Groups to Design for Stress Management.",
                    "Assessing Children's Perceptions and Acceptance of a Social Robot.",
                    "Evaluating Long Term User Experience with Children: Comparing the MemoLine with Interviews.",
                    "Supporting Parent-Child Collaborative Learning through Haptic Feedback Displays.",
                    "Supporting Interest in Science Learning with a Social Robot.",
                    "Understanding Context in Children's Use of Smartwatches for Everyday Science Reflections.",
                    "Discussion Prompts to Support Family Engagement in Science: Talking about Astroengineering in Library-based Making Programs.",
                    "Exploring Parent Use of Early STEM Media to Inform Design for Children.",
                    "Query Formulation Assistance for Kids: What is Available, When to Help & What Kids Want.",
                    "Youth Learning Machine Learning through Building Models of Athletic Moves.",
                    "Joint Emotional State of Children and Perceived Collaborative Experience in Coding Activities.",
                    "Smart Homes Programming: Development and Evaluation of an Educational Programming Application for Young Learners.",
                    "Exploring Globally Inclusive Online Collaboration for Indian and Finnish Schoolchildren.",
                    "A Review of Design Interventions for Promoting Adolescents' Physical Activity.",
                    "Behind the Scenes: Design, Collaboration, and Video Creation with Youth.",
                    "Enacting Identities: Participatory Design as a Context for Youth to Reflect, Project, and Apply their Emerging Identities.",
                    "Brokering Data: Co-Designing Technology with Latina Teens to Support Communication with Parents: Leveraging Cultural Practices of Latinx Youth through Co-Design.",
                    "Is My Game OK Dr. Scratch?: Exploring Programming and Computational Thinking Development via Metrics in Student-Designed Serious Games for STEM.",
                    "Tinkering with Music: Designing a Maker Curriculum for an After School Youth Club.",
                    "Programs in the Palm of your Hand: How Live Programming Shapes Children's Interactions with Physical Computing Devices.",
                    "Facilitation in an Intergenerational Making Activity: How Facilitative Moves Shift Across Traditional and Digital Fabrication.",
                    "Understanding the Practices and the Products of Creativity: Making and Tinkering Family Program at Informal Learning Environments.",
                    "PrototypAR: Prototyping and Simulating Complex Systems with Paper Craft and Augmented Reality.",
                    "I'm Drowning in Squirrels!: How Children Embody and Debug Computational Algorithms Through Designing Mixed Reality Games.",
                    "Designing for Impact: Shifting Children's Perspectives of Civic and Social Issues Through Making Mobile Games.",
                    "MaR-T: Designing a Projection-Based Mixed Reality System for Nonsymbolic Math Development of Preschoolers: Guided by Theories of Cognition and Learning.",
                    "An Exploration of Using Virtual Reality to Assess the Sensory Abnormalities in Children with Autism Spectrum Disorder.",
                    "Hey Google, Do Unicorns Exist?: Conversational Agents as a Path to Answers to Children's Questions.",
                    "Voice Agents Supporting High-Quality Social Play.",
                    "Designing Tangible ABCs: Fröbel's Sticks and Rings for the 21st Century.",
                    "Active Listening: Encouraging Sound Awareness Through Tangible Sonic Toys.",
                    "No Touch Pig! Investigating Child-Parent Use of a System for Training Executive Function.",
                    "Intergenerational Family Storytelling and Modeling with Large-Scale Data Sets.",
                    "Co-designing Inclusive Multisensory Story Mapping with Children with Mixed Visual Abilities.",
                    "Together Together: Combining Shared and Separate Activities in Designing Technology for Family Life.",
                    "Detecting Gender Stereotypes in Children Digital StoryTelling.",
                    "Stranger Danger!: Social Media App Features Co-designed with Children to Keep Them Safe Online.",
                    "Creating a Framework to Support the Critical Consideration of Dark Design Aspects in Free-to-Play Apps.",
                    "A Framework of Touchscreen Interaction Design Recommendations for Children (TIDRC): Characterizing the Gap between Research Evidence and Design Practice.",
                    "The Added Challenge of Digital Reading: Exploring Young Children's Page Turning Behaviors.",
                    "Anon what what?: Children's Understanding of the Language of Privacy.",
                    "Designing Sensory-Inclusive Virtual Play Spaces for Children.",
                    "Designing Software to Prevent Child Marriage Globally.",
                    "Trove: A Digitally Enhanced Memory Box for Looked after and Adopted Children.",
                    "Co-adapting a Design Thinking Activity to Engage Students with Learning Disabilities: Insights and Lessons Learned.",
                    "Designing a Collaborative Virtual Reality Game for Teen-Robot Interactions.",
                    "Design implications from Cognitive Event Analysis: A case study of digitally mediated interaction in autistic children.",
                    "Co-Designing an Intelligent Conversational History Tutor with Children.",
                    "A Serious Videogame to Support Emotional Awareness of People with Down Syndrome.",
                    "Broadening Participation for Remote Communities: Situated Distance Telepresence.",
                    "My Name Is My Password: Understanding Children's Authentication Practices.",
                    "Comic-based Digital Storytelling with Primary School Children.",
                    "Creative Learning Kits for Physical Microworlds: Supporting the making of meaningful projects using low-cost materials.",
                    "Children's Assessment of Co-design Skills: Creativity, Empathy and Collaboration.",
                    "Hey Emotion Companion, Can You Be My Friend?",
                    "ARCat: A Tangible Programming Tool for DFS Algorithm Teaching.",
                    "Timeless Homes: Exploring Genealogy and Family Histories through Co-Design with Children.",
                    "Peppy: A Paper-Based Augmented Reality Application to Help Children Against Dysgraphia.",
                    "Designing Social Play to Support Young Hospitalised Children.",
                    "HugBot: A soft robot designed to give human-like hugs.",
                    "Thought Disposal: Co-Designing a virtual interaction to reduce stress in teens.",
                    "Searching for spellcheckers: What kids want, what kids need.",
                    "Mixed Reality for Learning Programming.",
                    "Exploring Tangible Interaction and Diegetic Feedback in an AR Math Game for Children.",
                    "Diverso: make learning relevant for all students.",
                    "Exploring the Needs and Interests of Fifth Graders for Personalized Math Word Problem Generation.",
                    "Knowledge Places: Embedding Knowledge in the Space of the Classroom.",
                    "Participatory design with teens: A social robot design challenge.",
                    "Gesture-based Video Games to Support Fine-Motor Coordination Skills of Children with Autism.",
                    "Investigating the Social and Temporal Aspects of Children's Physical Activity Games.",
                    "Towards Better Transitions for Children with Diabetes: User Experiences on a Mobile Health App.",
                    "Towards a child-led design process A pilot study: when pre-schoolers' play becomes designing.",
                    "Supporting self-evaluation for children with mental disabilities through Augmented Reality.",
                    "From Doodles to Designs: Participatory Pedagogical Agent Design with Elementary Students.",
                    "The Sensing Bridge Between Perceptuomotor Experience and Scientific Investigation.",
                    "VisualNote: Physical Image Tagging for Building a Personal Visual Library.",
                    "Harmonious: expressive confidence through explorative construction of chord progressions.",
                    "City Settlers: Participatory Games to Build Sustainable Cities.",
                    "Rewire: A Game About Neuroplasticity.",
                    "Programmable Battery as a Computational Crafting Material for Children.",
                    "Mazi: a Tangible Toy for Collaborative Play between Children with Autism.",
                    "ACM's New SIGCHI Extended Abstracts Sample File.",
                    "3rd KidRec Workshop: What does good look like?",
                    "Immersive Media Design and Children.",
                    "Pushing the Boundaries of Participatory Design with Children with Special Needs.",
                    "Child Development and Interaction Design.",
                    "Quantitative Methods for Child-Computer Interaction.",
                    "Craft- and Project-based Pedagogy for Digital Fabrication and Making.",
                    "Supporting Friendship Development for Children with Autism and Their Typically Developing Peers.",
                    "Designing to Support Teen Mental Health Using Asynchronous Online Groups.",
                    "Youth Design of Digital Stories to Promote Indigenous Voices.",
                    "The Development of Face-to-Face Collaboration Technology for Young Children.",
                    "User Experience challenges for designing and evaluating Computer-Based Assessments for children.",
                    "Can Haptic Feedback Improve STEM Learning for Young Children?: Lessons from an Experiment and Teacher Focus Groups.",
                    "Children's Authentication: Understanding and Usage.",
                    "Exploring Embodied Learning for Early Childhood Education.",
                    "Digipack Pro: Revamping Social Interactions and Supporting Physical Activity.",
                    "EmotoTent: Reducing School Violence through Embodied Empathy Games.",
                    "KidLED: A colorful approach to children's activity awareness."
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "17th IDC 2018",
        "info": "Trondheim, Norway",
        "venues": [
            {
                "sub_name_abbr": "conf/acmidc/2018",
                "sub_name": "Proceedings of the 17th ACM Conference on Interaction Design and Children, IDC 2018, Trondheim, Norway, June 19-22, 2018.",
                "count": 101,
                "papers": [
                    "Germane robots.",
                    "Capturing the everyday magic of play.",
                    "Teaching children through innovation: experiences from EduApp4Syria and kahoot!",
                    "A conceptual framework to compare two paradigms of augmented and mixed reality experiences.",
                    "Designing for bodily interplay: engaging with the adaptive social exertion game \"plunder planet\".",
                    "\"Pump that press!\": design evaluation of audience interaction using collaborative digital and physical games.",
                    "Effects of playful audio augmentation on teenagers' motivations in cooperative physical play.",
                    "Co-designing voice user interfaces with teenagers in the context of smart homes.",
                    "Co-designing online privacy-related games and stories with children.",
                    "You have to start somewhere: initial meanings making in a design and making project.",
                    "Audio journaling for self-reflection and assessment among teens in participatory media programs.",
                    "MyWord: enhancing engagement, interaction and self-expression with minimally-verbal children on the autism spectrum through a personal audio-visual dictionary.",
                    "Apraxia world: a speech therapy game for children with speech sound disorders.",
                    "Bonk: accessible programming for accessible audio games.",
                    "\"Teegi's so cute!\": assessing the pedagogical potential of an interactive tangible interface for schoolchildren.",
                    "Tangible interaction in parent-child collaboration: encouraging awareness and reflection.",
                    "When toys come to life: considering the internet of toys from an animistic design perspective.",
                    "Printy3D: in-situ tangible three-dimensional design for augmented fabrication.",
                    "When deictic gestures in a robot can harm child-robot collaboration.",
                    "Measuring young children's long-term relationships with social robots.",
                    "Bringing letters to life: handwriting with haptic-enabled tangible robots.",
                    "How smart are the smart toys?: children and parents' agent interaction and intelligence attribution.",
                    "A day in the life of jos: a web-based game to increase children's digital literacy.",
                    "Going beyond performance scores: understanding cognitive-affective states in kindergarteners.",
                    "Designing to illuminate children's scientific funds of knowledge through social media sharing.",
                    "Designing for concreteness fading in primary computing.",
                    "A survey of computational kits for young children.",
                    "Children asking questions: speech interface reformulations and personification preferences.",
                    "Children's conversation with experience: making emotional imprints.",
                    "Overcoming socio-technical challenges for cross-cultural collaborative applications.",
                    "Why doesn't it work?: voice-driven interfaces and young children's communication repair strategies.",
                    "\"Wow he is talking!\": a study on intrinsic motivations for child-robotic toy interactions.",
                    "Evaluating elementary student interaction with ubiquitous touch projection technology.",
                    "Light it up: using paper circuitry to enhance low-fidelity paper prototypes for children.",
                    "The stamp plate and the kicking chair: playful productivity for mealtime in preschools.",
                    "Child designers creating personas to diversify design perspectives and concepts for their own technology enhanced library.",
                    "Paper mechatronics: present and future.",
                    "Fun as a user gain in participatory design processes involving children: a case study.",
                    "Semi-automatic suggestion generation for young novice programmers in an open-ended context.",
                    "Co-designing tablet computer applications with Sri Lankan practitioners to support children with ASD.",
                    "Leo con lula, introducing global reading methods to children with ASD.",
                    "Computer mediated playful interactions: investigating how variations in the level of gaze affect children's gameplay.",
                    "Towards equity and equality in American co-design: a case study.",
                    "Designing for the 'at home' experience of parents and children with tablet games.",
                    "Scratch memories: a visualization tool for children to celebrate and reflect on their creative trajectories.",
                    "Critical design in interaction design and children: impossible, inappropriate or critical imperative?",
                    "Interaction design project encouraging contact between elderly and children.",
                    "Deceptive cadence an interactive artwork for cooperative play.",
                    "Tree it: a tangible user interface for constructing the sample space.",
                    "Tingets: a system for young students to communicate and reflect.",
                    "The storytellers project.",
                    "Visualizing platonic solids with augmented reality.",
                    "Testudinata: a tangible interface for exploring functional programming.",
                    "ClipWorks: a tangible interface for collaborative video editing.",
                    "Manipul8: an interactive experience to inspire pattern-based algebraic thinking and representational fluency.",
                    "domino: mobile phones as accessible microcontrollers.",
                    "Tappetina's empathy game: a playground of storytelling and emotional understanding.",
                    "Exploring computational thinking through collaborative problem solving and audio puzzles.",
                    "AssisT-task: a smartphone application to support people with cognitive disabilities in their daily life activities.",
                    "Paper piano: making circuits with everyday things.",
                    "Inside out: teaching empathy and social-emotional skills.",
                    "Patchwork: an expressive e-textile construction kit.",
                    "Exploring how children interact with 3D shapes using haptic technologies.",
                    "An exploratory study of children's online password behaviours.",
                    "DBugs: large-scale artefacts for collaborative computer programming.",
                    "Deep making: curricular modules for transferable content-knowledge and scientific literacy in makerspaces and FabLabs.",
                    "Multisensory storytelling: a co-design study with children with mixed visual abilities.",
                    "Introducing children to machine learning concepts through hands-on experience.",
                    "Empowering children to author digital media effects for reader's theatre.",
                    "The telling board: an interactive storyboarding tool for children.",
                    "Investigating query formulation assistance for children.",
                    "Teaching news literacy to children with digital games.",
                    "Design considerations for family-centered health management: preliminary findings with pediatric BMT patients.",
                    "A little bit of coding goes a long way: effects of coding on outdoor play.",
                    "Fostering civic engagement through native maps: a preliminary study.",
                    "AR-maze: a tangible programming tool for children based on AR technology.",
                    "Storytelling shapes: a toolkit to enable children to express their needs and wishes.",
                    "\"My doll says it's ok\": a study of children's conformity to a talking doll.",
                    "Eliciting social biases in children using tangible games.",
                    "Dancing to design: a gesture elicitation study.",
                    "Code notes: designing a low-cost tangible coding tool for/with children.",
                    "\"Should I answer what the atom feels?\": learning about forces in chemical bonding using ELI-chem simulation.",
                    "Don't steal my balloons: designing for musical adult-child ludic engagement.",
                    "Plan&do: a technology probe supporting children with intellectual disabilities in leisure activities.",
                    "Developing children's empathy in co-design activities: a pilot case study.",
                    "Blended making: multi-interface designs and e-crafting with elementary and middle school youth.",
                    "Exploring the 3D printing process for young children in curriculum-aligned making in the classroom.",
                    "Game modding for computational thinking: an integrated design approach.",
                    "Maintaining long-distance relationships with children: exploring autobiographical designs and life logging.",
                    "Intermediate-level knowledge in child-computer interaction.",
                    "International and interdisciplinary perspectives on children & recommender systems (KidRec).",
                    "Sustaining girls' participation in STEM, gaming and making.",
                    "The near future of children's robotics.",
                    "STEAM learning in formal and informal settings via craft and maker projects.",
                    "Rethinking children's co-creation processes beyond the design of TUIs.",
                    "Design guidelines for location-based mobile games for learning.",
                    "Doing research with children: a child computer interaction perspective.",
                    "Ethics in interaction design and children: a panel and community dialogue.",
                    "Create: a platform for pre-adolescent creativity and collaborative play.",
                    "Culture box: education app on the world through history and time.",
                    "The bits & atoms of play: critical engagements with intercultural meaning making."
                ]
            },
            {
                "sub_name_abbr": "conf/acmidc/2018girls",
                "sub_name": "Proceedings of the IDC Workshop: Sustaining Girls' Participation in STEM, Gaming and Making 2018, Trondheim, Norway, June 19, 2018.",
                "count": 4,
                "papers": [
                    "Colored Raindrops - A Fiction-Driven Workshop for Girls.",
                    "Sustaining Gender Balance In Top Academic Positions In STEM Will Influence Girls' Participation In STEM.",
                    "Happily ever after? Gender Stereotypes in Stories.",
                    "A Gender-Sensitive Curriculum for Learning and Teaching Programing at Primary School."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "16th IDC 2017",
        "info": "Stanford, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/acmidc/2017",
                "sub_name": "Proceedings of the 2017 Conference on Interaction Design and Children, Stanford, CA, USA, June 27-30, 2017.",
                "count": 114,
                "papers": [
                    "What If Your Project's Timeline is a 100 Years?: Reflections on Computational Literacies.",
                    "Crazy Like Us: Design for Vulnerable Populations.",
                    "Teaching Teachers and Making Makers: What the Maker Movement Can Teach the World about Accessibility and Design.",
                    "Intermediate-Level Knowledge in Child-Computer Interaction: A Call for Action.",
                    "Abandoned but Not Forgotten: Providing Access While Protecting Foster Youth from Online Risks.",
                    "Child as Protagonist: Expanding the Role of Children in Participatory Design.",
                    "Blending Methods: Developing Participatory Design Sessions for Autistic Children.",
                    "The Haptic Bridge: Towards a Theory for Haptic-Supported Learning.",
                    "Not my Gumdrop Buttons!: Youth Tool Use in Designing an Electronic Shrek-themed Bean Bag Toss.",
                    "Design Guidelines for Parent-School Technologies to Support the Ecology of Parental Engagement.",
                    "Plan & Play: Supporting Intentional Media Use in Early Childhood.",
                    "Investigating the Effects of Interactive Features for Preschool Television Programming.",
                    "Identifying Patterns in IDC Research: Technologies for Improving Children's Well-being Connected to Overweight Issues.",
                    "Bicultural: Examining Teenage Latinas' Perspectives on Technologies for Emotional Support.",
                    "Virtual Reality MRI: Playful Reduction of Children's Anxiety in MRI Exams.",
                    "Sex Talk: Designing for Sexual Health with Adolescents.",
                    "SPRING: Customizable, Motivation-Driven Technology for Children with Autism or Neurodevelopmental Differences.",
                    "From Smart Homes to Smart Kids: Design Research for CataKit.",
                    "Using Eye-Tracking to Unveil Differences Between Kids and Teens in Coding Activities.",
                    "Between a Block and a Typeface: Designing and Evaluating Hybrid Programming Environments.",
                    "Tangible and Shared Storytelling: Searching for the Social Dimension of Constructionism.",
                    "Collaborative Storytelling between Robot and Child: A Feasibility Study.",
                    "Classification of Children's Handwriting Errors for the Design of an Educational Co-writer Robotic Peer.",
                    "Designing for Parasocial Relationships and Learning: Linear Video, Interactive Media, and Artificial Intelligence.",
                    "Persistent Memory in Repeated Child-Robot Conversations.",
                    "SpeechBlocks: A Constructionist Early Literacy App.",
                    "The Sound Labyrinth: Computers, Constructionism and Language Learning.",
                    "Agency, Embodiment, & Affect During Play in a Mixed-Reality Learning Environment.",
                    "TaBooGa: A Hybrid Learning App to Support Children's Reading Motivation.",
                    "Creating Environmental Awareness with Upcycling Making Activities: A Study of Children in Germany and Palestine.",
                    "Where are the Glass-Boxes?: Examining the Spectrum of Modularity in Physical Computing Hardware Tools.",
                    "Toward Understanding Children's Perspectives on Using 3D Printing Technologies in their Everyday Lives.",
                    "Kindergarten Programming Goes Mobile: Should The Next Years Be About Ubiquity?",
                    "Supporting Interactive Youth Maker Programs in Public and School Libraries: Design Hypotheses and First Implementations.",
                    "Becoming Makers: Examining \"Making\" Literacy in the Elementary School Science Classroom.",
                    "Designing Together?: Group Dynamics in Participatory Digital Badge Design with Teens.",
                    "The Binding of Fenrir: Children in an Emerging Age of Transhumanist Technology.",
                    "The SEL Transition Wheel: Designing for Early Childhood Social Emotional Learning.",
                    "Making in Minecraft: A Means of Self-Expression for Youth with Autism.",
                    "Parent-Child Dialogue with eBooks.",
                    "Adolescent Online Safety: Moving Beyond Formative Evaluations to Designing Solutions for the Future.",
                    "Constructing Meaning: Designing Powerful Story-Making Explorations for Children to Express with Tangible Computational Media.",
                    "Designing for Massive Engagement in a Tween Community: Participation, Prevention, and Philanthropy in a Virtual Epidemic.",
                    "Augmented Games: Exploring Design Opportunities in AR Settings With Children.",
                    "The KOROGARU Park Series: Three Features of the Park of the Future.",
                    "Drawn into Science Through Authentic Virtual Practice.",
                    "Exploring and Evaluating Sound for Helping Children Self-Regulate with a Brain-Computer Application.",
                    "Children's Views on Identification and Intention Communication of Self-driving Vehicles.",
                    "Teaching and Learning of Chinese History in Minecraft: A Pilot Case-Study in Hong Kong Secondary Schools.",
                    "Youth Reasoning With Interactive Data Visualizations: A Preliminary Study.",
                    "Multisensory Games on Children's Empathetic Feelings and Cooperative Behavior: Developing a Kansei-Based Sensory Playground Design Workshop.",
                    "YOLO, a Robot for Creativity: A Co-Design Study with Children.",
                    "Creating Social Stories as Wearable Hyper-Immersive Virtual Reality Experiences for Children with Neurodevelopmental Disorders.",
                    "Programming Literacy: Computational Thinking in Brazilian Public Schools.",
                    "Cracking The Code: The Impact of Computer Coding on the Interactions of a Child with Autism.",
                    "Designing a Robot Companion for Children with Neuro-Developmental Disorders.",
                    "Bots for Tots: Girls' Perceived Versus Actual Competency in Technology and Making.",
                    "Toward a Socio-Cultural Perspective on \"Making\": Pupils' Journey through Materials, People and Places.",
                    "Click to Enter: Comparing Graphical and Textual Passwords for Children.",
                    "Wearable Immersive Virtual Reality for Children with Disability: a Case Study.",
                    "TunePad: Computational Thinking Through Sound Composition.",
                    "Multisensory Participatory Design for Children with Special Educational Needs and Disabilities.",
                    "D-TOX: Inducing Digital Detox for Nighttime via Smart Lamp Applied Gamification.",
                    "Growing Designs with biomakerlab in High School Classrooms.",
                    "Aiding the Transition from Novice to Traditional Programming Environments.",
                    "The Programmable Battery: A Tool to Make Computational Making More Simple, Playful, and Meaningful.",
                    "RobIn: A Half-baked Robot for Electronics in a STEM Context.",
                    "A Multi-User Tabletop Application to Train Children with Autism Social Attention Coordination Skills without Forcing Eye-Gaze Following.",
                    "Emotion Recognition via Face Tracking with RealSense(TM) 3D Camera for Children with Autism.",
                    "Digital Natives and Cardboard Cubes: Co-Creating a Physical Play(ful) Ideation Tool with Preschool Children.",
                    "Digital Fabrication as a Tool for Teaching High-School Students STEM at the University.",
                    "Interactive fiction: Weaving together literacies of text and code.",
                    "Investigating an Intervention System to Increase User Engagements on an Educational Social Q&A.",
                    "Designing Inclusive STEM Activities: A Comparison of Playful Interactive Experiences Across Gender.",
                    "CodeStitch: Leveraging Analogical Encoding in a Game Space.",
                    "Mathematical Reflections: The Design Potential of Ensemble Performance.",
                    "Designing Towards Maximum Motivation and Engagement in an Interactive Speech Therapy Game.",
                    "\"Hey Google is it OK if I eat you?\": Initial Explorations in Child-Agent Interaction.",
                    "Scratch Nodes: Coding Outdoor Play Experiences to enhance Social-Physical Interaction.",
                    "From Parents to Mentors: Parent-Child Interaction in Co-Making Activities.",
                    "Investigating Children's Passwords using a Game-based Survey.",
                    "BacToMars: Creative Engagement with Bio-Design for Children.",
                    "Connected Spaces: Helping Makers Know Their Neighbors.",
                    "A Tattooed Bracelet for Child Vaccination Records in a Developing World Context.",
                    "An Observational Coding Scheme for Detecting Children's Usability Problems in Augmented Reality.",
                    "Autistic Children's Use of Technology and Media: A Fieldwork Study.",
                    "Designing a Physical Computing Toolkit to Utilize Miniature Computers: A Case Study of Selective Exposure.",
                    "Home Game: an Educational Game for Children with Cognitive Impairments.",
                    "SAM: The School Attachment Monitor.",
                    "Close the Circuit 'N Play the Electrons: Learning Electricity with an Augmented Circuit Exhibit.",
                    "Revisiting Turtles and Termites: an Open-ended Interactive Physical Game with Multiple Robots.",
                    "Bear Abouts: Sharing Stories across the Physical and Digital.",
                    "Energetic Alpha, Playful Handwriting Practice for Children.",
                    "Children Designing Videos: Tools, Pedagogical Models, and Best Practices for Digital Storytelling and Media-Making in the Classroom.",
                    "Geometris: Designing Collaborative Mathematical Interactions For Children.",
                    "Forest Friends Demo: A Game-Exhibit to Promote Computer Science Concepts in Informal Spaces.",
                    "Knitting Visualizer: Connecting Craft and Code.",
                    "Cool Cities A Tangible User Interface for Thinking Critically about Climate Change.",
                    "StringForce: A Forced Collaborative Interaction Game for Special Education.",
                    "On Active Sharing and Responses to Joint Attention Bids by Children with Autism in a Loosely Coupled Collaborative Play Environment.",
                    "DiMBI: An Interface to Connect People to Math's Big Ideas of Patterns and Relations.",
                    "Tuk Tuk: A Block-Based Programming Game.",
                    "The Conference of the Birds: A Collaborative Storytelling Environment for Literacy Development.",
                    "Sonification Blocks: A Block-Based Programming Environment For Embodied Data Sonification.",
                    "BetaKit: Tinkering with Physical Programming.",
                    "Interaction Design and Autistic Children.",
                    "Playing Together: The Importance of Joint Engagement in the Design of Technology for Children.",
                    "Of Kittens and Kiddies: Reflections on Participatory Design with Small Animals and Small Humans.",
                    "Make2Learn with IoT: Engaging Children into Joyful Design and Making of Interactive Connected Objects.",
                    "Equity & Inclusivity at IDC.",
                    "Analyzing Children's Contributions and Experiences in Co-design Activities: Synthesizing Productive Practices.",
                    "Learning by Making for STEM Success.",
                    "Feelbot: Reducing Use of Bad Words in Children through Wearable using Artificial Intelligence and Gamification.",
                    "Promoting CARE: Changes via Awareness, Recognition and Experience."
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "15th IDC 2016",
        "info": "Manchester, UK",
        "venues": [
            {
                "sub_name_abbr": "conf/acmidc/2016",
                "sub_name": "Proceedings of the The 15th International Conference on Interaction Design and Children, IDC '16, Manchester, United Kingdom, June 21-24, 2016.",
                "count": 93,
                "papers": [
                    "Inclusive Co-Design within a Three-Dimensional Game Environment.",
                    "Traversing Transmedia Together: Co-designing an Educational Alternate Reality Game For Teens, With Teens.",
                    "Future's Butterflies: Co-Designing ICT Wayfaring Technology with Refugee Syrian Youth.",
                    "Andantino: Teaching Children Piano with Projected Animated Characters.",
                    "Expressivity in Open-ended Constructive Play: Building and Playing Musical Lego Instruments.",
                    "Design of a Health Monitoring Toy for Children.",
                    "Making as the New Colored Pencil: Translating Elementary Curricula into Maker Activities.",
                    "Bots for Tots: Building Inclusive Makerspaces by Leveraging \"Ways of Knowing\".",
                    "Inclusive Interactives: the Transformative Potential of Making and Using Craft-Tech Social Objects Together in an After-School Centre.",
                    "Design Rationale: Opportunities and Recommendations for Tangible Reading Systems for Children.",
                    "Evaluating Engagement in Reading: Comparing Children and Adult Assessors.",
                    "Recommendations for Developing Technologies that Encourage Reading Practices Among Children in Families with Low-literate Adults.",
                    "Of Elephants and Nested Loops: How to Introduce Computing to Youth in Rural India.",
                    "User-Centered Design in Block-Based Programming: Developmental & Pedagogical Considerations for Children.",
                    "A Tangible, Story-Construction Process Employing Spatial, Computational-Thinking.",
                    "Legitimate Participation in the Classroom Context: Adding Learning Goals to Participatory Design.",
                    "Make Good Choices: Exploring Narrative Game Design with Young People in Prison.",
                    "Playscapes: a Design Perspective on Young Children's Physical Play.",
                    "iPad vs Paper Prototypes: Does Form Factor Affect Children's Ratings of a Game Concept?",
                    "Seeking Independent Management of Problem Behavior: A Proof-of-Concept Study with Children and their Teachers.",
                    "The Research Diary, Supporting Pupils' Reflective Thinking during Design Activities.",
                    "Learning through Participatory Design: Designing Digital Badges for and with Teens.",
                    "Empowering Children To Rapidly Author Games and Animations Without Writing Code.",
                    "How Different Input and Output Modalities Support Coding as a Problem-Solving Process for Children.",
                    "Frogs to Think with: Improving Students' Computational Thinking and Understanding of Evolution in A Code-First Learning Environment.",
                    "BitBlox: A Redesign of the Breadboard.",
                    "Lands of Fog: Helping Children with Autism in Social Interaction through a Full-Body Interactive Experience.",
                    "SharedPhys: Live Physiological Sensing, Whole-Body Interaction, and Large-Screen Visualizations to Support Shared Inquiry Experiences.",
                    "Comparing Children's Crosshair and Finger Interactions in Handheld Augmented Reality: Relationships Between Usability and Child Development.",
                    "Audience Involvement and Agency in Digital Games: Effects on Learning, Game Experience, and Social Presence.",
                    "Five Degrees of Happiness: Effective Smiley Face Likert Scales for Evaluating with Children.",
                    "An Experiential Approach to the Design and Evaluation of a Gamified Research Tool for Law in Children's Lives.",
                    "Do It for the Viewers!: Audience Engagement Behaviors of Young YouTubers.",
                    "Gestures by Children and Adults on Touch Tables and Touch Walls in a Public Science Center.",
                    "It's Not That Long!: Helping Children to Understand Time with an Ambient Light Display.",
                    "Should We Design for Control, Trust or Involvement?: A Discourses Survey about Children's Online Safety.",
                    "The Robot Who Knew Too Much: Toward Understanding the Privacy/Personalization Trade-Off in Child-Robot Conversation.",
                    "From Nosy Little Brothers to Stranger-Danger: Children and Parents' Perception of Mobile Threats.",
                    "A Follow-up Study of a Successful Assistive Technology for Children with ADHD and Their Families.",
                    "Hide and Seek: A LEGO Village Game for Developing Spatial Ability of Children.",
                    "Interactive and Connected Tableware for Promoting Children's Vegetable-Eating and Family Interaction.",
                    "Designing Animated Characters for Children of Different Ages.",
                    "Studying situated learning in a constructionist programming camp: A multimethod microgenetic analysis of one girl's learning pathway.",
                    "Make or Shake: An Empirical Study of the Value of Making in Learning about Computing Technology.",
                    "Connectors in Maker Kits: Investigating Children's Motor Abilities in Making.",
                    "Designing ReduCat: Audio-Augmented Paper Drawings Tangible Interface in Educational Intervention for High-Functioning Autistic Children.",
                    "The Code of Many Colours: Evaluating the Effects of a Dynamic Colour-Coding Scheme on Children's Spelling in a Tangible Software System.",
                    "Playful Cognitive Behavioral Therapy Apps: Design Concepts and Tactics for Engaging Young Patients.",
                    "Design Implications for a User Study on a Tangible Tabletop.",
                    "Teaching with an Interactive E-book to Improve Children's Online Privacy Knowledge.",
                    "Talkoo: A new paradigm for physical computing at school.",
                    "Beagle: A Stimulating Quest Throughout the Hospital.",
                    "Mummy, Why Do I Have Diabetes?: A Tangible Interface For Educating Children With Type-1 Diabetes.",
                    "Evaluating the ChillFish Biofeedback Game with Children with ADHD.",
                    "Gossip, Cooperation and Cyberbullying in Children's Online Communication: Designing an Intervention Based on Original Empirical Research.",
                    "Linguistic and social treatment of Specific Language Impairment (SLI) using Scratch.",
                    "Playful interactive mirroring to support bonding between parents and children with Down Syndrome.",
                    "Set&Motion: Tool for Authoring Interactive Stories with Sensors and Actuators.",
                    "Children's evolving capabilities in their interaction with touchable devices from birth to 2 years old.",
                    "Creative Programming Experiences for Teenagers: Attitudes, Performance and Gender Differences.",
                    "Crescendo: Routine Learning App for Children with Autism Spectrum Disorders.",
                    "The Role Definition Matrix: Creating a Shared Understanding of Children's Participation in the Design Process.",
                    "Game Kits: Metadesign considerations on game modding for learning.",
                    "Reflections on the Adoption of Virtual Reality-based Application on Word Recognition for Chinese Children with Autism.",
                    "Social Competence and STEM: Teen Mentors in a Makerspace.",
                    "I will Help You Pass the Puzzle Piece to Your Partner if This is What You Want Me to: The Design of Collaborative Puzzle Games to Train Chinese Children with Autism Spectrum Disorder Joint Attention Skills.",
                    "Boxing against drones: Drones in sports education.",
                    "Making Sense of Body and Space through Full-Body Interaction Design: A Case Study.",
                    "DenTeach: A Device for Fostering Children's Good Tooth-brushing Habits.",
                    "Children's Books: Paper VS Digital, What Do They Prefer?",
                    "Developing Transmedia Puzzle Play to Facilitate Spatial Skills of Preschoolers.",
                    "Participatory Design of UKIYO-E Game for Children to Support Art Appreciation Based on Interacting with Pictures.",
                    "Creating an Environment in which Elementary Educators Can Teach Coding.",
                    "Preparatory development of a collaborative / interactive learning game using bodily movements for deaf children.",
                    "Multiple-Player Full-Body Interaction Game to Enhance Young Children's Cooperation.",
                    "Co-designing a physical to digital experience for an onboarding and blended learning platform.",
                    "Helping Neuro-typical Individuals to \"Read\" the Emotion of Children with Autism Spectrum Disorder: an Internet-of-Things Approach.",
                    "Collaborative Conversational Language Learning with CityCompass.",
                    "A Demonstration of ToonTalk where Children Build Programs by Demonstration in a Game World.",
                    "The Ensoulment of Virtual Space Minecraft as a Tool for Engaging With a Sculpture Park.",
                    "DEMO: Web Application ArtEater.",
                    "Supporting Social Innovation in Children: Developing a Game to Promote Health Eating.",
                    "Barcino, Creation of a Cross-Disciplinary City.",
                    "Developing children's cultural awareness and empathy through games and fairy tales.",
                    "Child-centred design supported by comprehensive child application use analysis.",
                    "Being Explicit about Underlying Values, Assumptions and Views when Designing for Children in the IDC Community.",
                    "How Many Roles Can Children Play?",
                    "Designing Tangibles for Children: One Day Hands-on Workshop.",
                    "Making as a Pathway to Foster Joyful Engagement and Creativity in Learning.",
                    "Philosophy with Children: Helping Designers Cooperate with Children.",
                    "roboTwin: A Modular & Evolvable Robotic Companion for Children.",
                    "The Story of Things: Awareness through Happenstance Interaction.",
                    "All Creatures Great and Small: Becoming Other Organisms through the EmbodySuit."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "14th IDC 2015",
        "info": "Medford, MA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/acmidc/2015",
                "sub_name": "Proceedings of the 14th International Conference on Interaction Design and Children, IDC '15, Medford, MA, USA, June 21-25, 2015.",
                "count": 84,
                "papers": [
                    "Designing for youth interpreter professional development: a sociotechnologically-framed participatory design approach.",
                    "HandiMate: exploring a modular robotics kit for animating crafted toys.",
                    "Marker-based augmented reality: instructional-design to improve children interactions with astronomical concepts.",
                    "Fishing with friends: using tabletop games to raise environmental awareness in aquariums.",
                    "Maximizing children's opportunities with inclusive play: considerations for interactive technology design.",
                    "Designing visible engineering: supporting tinkering performances in museums.",
                    "BrainQuest: an active smart phone game to enhance executive function.",
                    "Designing motion-based activities to engage students with autism in classroom settings.",
                    "Designing technology for and with developmentally diverse children: a systematic literature review.",
                    "The medium matters: the impact of full-body interaction on the socio-affective aspects of collaboration.",
                    "A case for intergenerational distributed co-design: the online kidsteam example.",
                    "Touchscreen prompts for preschoolers: designing developmentally appropriate techniques for teaching young children to perform gestures.",
                    "Using neurofeedback to teach self-regulation to children living in poverty.",
                    "Hi-Lo tech games: crafting, coding and collaboration of augmented board games by high school youth.",
                    "Understanding the lived experience of adolescents with type 1 diabetes: opportunities for design.",
                    "Framing open-ended and constructive play with emerging interactive materials.",
                    "Small group learning with games in museums: effects of interactivity as mediated by cultural differences.",
                    "Sensitivity to parental play beliefs and mediation in young children's hybrid play activities.",
                    "Narrative support for young game designers' writing.",
                    "Reverse scaffolding: a constructivist design architecture for mathematics learning with educational technology.",
                    "To block or not to block, that is the question: students' perceptions of blocks-based programming.",
                    "Opportunistic uses of the traditional school day through student examination of Fitbit activity tracker data.",
                    "Challenging group dynamics in participatory design with children: lessons from social interdependence theory.",
                    "\"I have a tutorial for this\": the language of online peer support in the scratch programming community.",
                    "Using haptic inputs to enrich story listening for young children.",
                    "Design and evaluation of socially assistive robotics providing assistance for children through machine learning of languages.",
                    "Interactive eye tracking for gaze strategy modification.",
                    "Anxiety storm: creating a playful prevention program against performance anxiety in primary school.",
                    "Sketching through the body: child-generated gestures in full-body interaction design.",
                    "Investigating technology for children with selective mutism.",
                    "\"Let's dive into it!\": Learning electricity with multiple representations.",
                    "Interactive design by children: a construct map for programming.",
                    "Code and tell: assessing young children's learning of computational thinking using peer video interviews with ScratchJr.",
                    "Game based learning tool seeking peer support for empowering adolescent girls in rural Assam.",
                    "Design for self-reporting psychological health in children with intellectual disabilities.",
                    "LEGO music: learning composition with bricks.",
                    "Supporting creativity in designing story authoring tools.",
                    "Physics-based gaming: exploring touch vs. mid-air gesture input.",
                    "Augmenting children's tablet-based reading experiences with variable friction haptic feedback.",
                    "Initial validation of an assistive technology to enhance executive functioning among children with ADHD.",
                    "Using children's drawings to improve a programming app.",
                    "Learning complex systems with story-building in scratch.",
                    "The influence of constructing robot's behavior on the development of theory of mind (ToM) and theory of artificial mind (ToAM) in young children.",
                    "Kiteracy: a kit of tangible objects to strengthen literacy skills in children with down syndrome.",
                    "A tangible programming system conveying event handling concept.",
                    "The role of materiality in tangibles for young children's digital art drawings.",
                    "Creative design process in making electronic textiles.",
                    "Colouring the path from instruction to practice: perspectives on software for struggling readers.",
                    "\"Siri, is this you?\": Understanding young children's interactions with voice input systems.",
                    "Make, wear, play: remix designs of wearable controllers for scratch games by middle school youth.",
                    "Designing games for learning and assessment: the radix endeavor.",
                    "Resources, facilitation, and partnerships: three design considerations for youth makerspaces.",
                    "Blending robots and full-body interaction with large screens for children with intellectual disability.",
                    "Designing a relational social robot toolkit for preschool children to explore computational concepts.",
                    "Designing a virtual assistant for in-car child entertainment.",
                    "A value sensitive design approach to parental software for young children.",
                    "Mattie: a simple educational platform for children to realize their first robot prototype.",
                    "Paper mechatronics: a design case study for a young medium.",
                    "Learning practices of making: developing a framework for design.",
                    "Exploring children's designs for maker technologies.",
                    "Lifelong learning lab: collaborative design of hands-on science for chinese schools.",
                    "Designing a socially assistive robot for pediatric care.",
                    "Sketching intentions: comparing different metaphors for programming robots.",
                    "Using augmented reality to support observations about trees during summer camp.",
                    "Making physical and digital games with e-textiles: a workshop for youth making responsive wearable games and controllers.",
                    "uChoose by InteractAble: learning social skills via game play.",
                    "TADCAD: a tangible and gestural 3D modeling & printing platform for building creativity.",
                    "Strawbies: explorations in tangible programming.",
                    "ScratchJr demo: a coding language for kindergarten.",
                    "KIBO robot demo: engaging young children in programming and engineering.",
                    "Spin: a photography turntable system for creating animated documentation.",
                    "Seen music: ambient music data visualization for children with hearing impairments.",
                    "Cyberchase shape quest: pushing geometry education boundaries with augmented reality.",
                    "Odyssey: an interactive simulation to learn concepts of the solar system.",
                    "Crafting technology with circuit stickers.",
                    "Using computational manipulatives to support story construction by early and emergent readers.",
                    "Pencil code: block code for a text world.",
                    "MakerShoe: towards a wearable e-textile construction kit to support creativity, playful making, and self-expression.",
                    "LevelSpaceGUI: scaffolding novice modelers' inter-model explorations.",
                    "Early math with Gracie & Friends™ demo: app-infused curriculum and teacher support for preschool.",
                    "Innovations in interaction design & learning.",
                    "Digital assessment and promotion of children's curiosity.",
                    "Every child a coder?: research challenges for a 5-18 programming curriculum.",
                    "Balancing the needs of children and adults in the design of technology for children."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "13th IDC 2014",
        "info": "Aarhus, Denmark",
        "venues": [
            {
                "sub_name_abbr": "conf/acmidc/2014",
                "sub_name": "IDC '14, Proceedings of the 2014 Conference on Interaction Design and Children, June 17-20, 2014, Aarhus, Denmark.",
                "count": 65,
                "papers": [
                    "Reempowering powerful ideas: designers' mission in the age of ubiquitous technology.",
                    "The relations between play and learning in digital environments: the significance of motives and demands.",
                    "Interpreting data from within: supporting humandata interaction in museum exhibits through perspective taking.",
                    "Designing and evaluating touchless playful interaction for ASD children.",
                    "\"Child as the measure of all things\": the body as a referent in designing a museum exhibit to understand the nanoscale.",
                    "Emergent dialogue: eliciting values during children's collaboration with a tabletop game for change.",
                    "Designing digital peer support for children: design patterns for social interaction.",
                    "Investigating interaction with tabletops in kindergarten environments.",
                    "Exploring physical and digital identity with a teenage cohort.",
                    "Sparkles of brilliance: incorporating cultural and social context in codesign of digital artworks.",
                    "Participatory design strategies to enhance the creative contribution of children with special needs.",
                    "Play it our way: customization of game rules in children's interactive outdoor games.",
                    "Giving ideas an equal chance: inclusion and representation in participatory design with children.",
                    "Incorporating peephole interactions into children's second language learning activities on mobile devices.",
                    "Search result visualization with characters for children.",
                    "A diary study of children's user experience with EBooks using flow theory as framework.",
                    "Waiting for learning: designing interactive education materials for patient waiting areas.",
                    "\"It helped me do my science.\": a case of designing social media technologies for children in science learning.",
                    "Fiabot!: design and evaluation of a mobile storytelling application for schools.",
                    "Shake up the schoolyard: iterative design research for public playful installations.",
                    "CamQuest: design and evaluation of a tablet application for educational use in preschools.",
                    "Connecting children to nature with technology: sowing the seeds for proenvironmental behaviour.",
                    "Connected messages: a maker approach to interactive community murals with youth.",
                    "Design and evaluation of interactive musical fruit.",
                    "Understanding childdefined gestures and children's mental models for touchscreen tabletop interaction.",
                    "Jigsaw together: a distributed collaborative game for players with diverse skills and preferences.",
                    "ChiroBot: modularrobotic manipulation via spatial hand gestures.",
                    "Affective communication aid using wearable devices based on biosignals.",
                    "Screen time for children.",
                    "Power puppet: science and technology education through puppet building.",
                    "Motivating children's initiations with novelty and surprise: initial design recommendations for autism.",
                    "MakeScape lite: a prototype learning environment for making and design.",
                    "StampOn in a museum: helping children's scientific inquiry.",
                    "Children as coresearchers: more than just a roleplay.",
                    "Considering visual programming environments for documenting physical computing artifacts.",
                    "A study of auti: a socially assistive robotic toy.",
                    "Design with the deaf: do deaf children need their own approach when designing technology?",
                    "Applying the CHECk tool to participatory design sessions with children.",
                    "Lowfidelity prototyping tablet applications for children.",
                    "An OWL in the classroom: development of an interactive storytelling application for preschoolers.",
                    "KIKIWAKE: participatory design of language play game for children to promote creative activitybased on recognition of japanese phonology.",
                    "Exploring challenging group dynamics in participatory design with children.",
                    "Detecting handwriting errors with visual feedback in early childhood for Chinese characters.",
                    "Adapting design probes to explore health management practices in pediatric type 1 diabetes.",
                    "Design guidelines for more engaging electronic books: insights from a cooperative inquiry study.",
                    "Do interactions speak louder than words?: Dialogic Reading of an Interactive Tabletbased Ebook with Children between 16 Months and Three Years of Age.",
                    "Building an internet of school things ecosystem: a national collaborative experience.",
                    "TangiPlan: designing an assistive technology to enhance executive functioning among children with adhd.",
                    "ExciteTray: developing an assistive technology to promote selffeeding among young children.",
                    "Understanding and fostering children's storytelling during game narrative design.",
                    "Interactive and live performance design with children.",
                    "Designing digital media for creative mathematical learning.",
                    "Craft, click and play: crafted videogames, a new approach for physicaldigital entertainment.",
                    "Head mounted displays and deaf children: Facilitating Sign Language in Challenging Learning Environments.",
                    "3D printed tactile picture books for children with visual impairments: a design probe.",
                    "Metadesigning interactive outdoor games for children: a case study.",
                    "The effects of visual contextual structures on children's imagination in story authoring interfaces.",
                    "Towards a constructively aligned approach to teaching interaction design & children.",
                    "Using digital game as clinical screening test to detect color deficiency in young children.",
                    "SmartHolder: sensing and raising families' awareness of tooth brushing habits.",
                    "Action!: codesigning interactive technology with immigrant teens.",
                    "RaBit EscAPE: a board game for computational thinking.",
                    "FabCode: visual programming environment for digital fabrication.",
                    "Frog pond: a codefirst learning environment on evolution and natural selection.",
                    "How can interaction with digital creative tools support child development?: (closing panel)."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "12. IDC 2013",
        "info": "New York, NY, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/acmidc/2013",
                "sub_name": "Interaction Design and Children 2013, IDC '13, New York, NY, USA - June 24 - 27, 2013.",
                "count": 134,
                "papers": [
                    "Designing ScratchJr: support for early childhood learning through computer programming.",
                    "Automatically generating tutorials to enable middle school children to learn programming independently.",
                    "A curriculum for teaching computer science through computational textiles.",
                    "From surveys to collaborative art: enabling children to program with online data.",
                    "Learning extended writing: designing for children's collaboration.",
                    "Design to support interpersonal communication in the special educational needs classroom.",
                    "Discrepancies in a virtual learning environment: something \"worth communicating about\" for young children with ASC?",
                    "moosikMasheens: music, motion and narrative with young people who have complex needs.",
                    "Rapid prototyping of outdoor games for children in an iterative design process.",
                    "Design strategy to stimulate a diversity of motor skills for an exergame addressed to children.",
                    "Leaving room for improvisation: towards a design approach for open-ended play.",
                    "Exploring motion-based touchless games for autistic children's learning.",
                    "In-car game design for children: child vs. parent perspective.",
                    "Translating Roberto to Omar: computational literacy, stickerbooks, and cultural forms.",
                    "PBS KIDS mathematics transmedia suites in preschool homes.",
                    "Designing healthcare games and applications for toddlers.",
                    "Translating preschoolers' game experiences into design guidelines via a laddering study.",
                    "Examining the need for visual feedback during gesture interaction on mobile touchscreen devices for kids.",
                    "Games as neurofeedback training for children with FASD.",
                    "Gears of our childhood: constructionist toolkits, robotics, and physical computing, past and future.",
                    "Towards an ecological inquiry in child-computer interaction.",
                    "Understanding the fidelity effect when evaluating games with children.",
                    "Brownies or bags-of-stuff?: domain expertise in cooperative inquiry with children.",
                    "Interaction design research with adolescents: methodological challenges and best practices.",
                    "Toward a taxonomy of design genres: fostering mathematical insight via perception-based and action-based experiences.",
                    "Augmenting play and learning in the primary classroom.",
                    "Playing for real: designing alternate reality games for teenagers in learning contexts.",
                    "Designing for science learning and collaborative discourse.",
                    "Revisiting PointAssist and studying effects of control-display gain on pointing performance by four-year-olds.",
                    "Things to imagine with: designing for the child's creativity.",
                    "Drawing the electric: storytelling with conductive ink.",
                    "Building an experience framework for a digital peer support service for children surviving from cancer.",
                    "Quantified recess: design of an activity for elementary students involving analyses of their own movement data.",
                    "A Wizard-of-Oz elicitation study examining child-defined gestures with a whole-body interface.",
                    "Designing the LIT KIT, an interactive, environmental, cyber-physical artifact enhancing children's picture-book reading.",
                    "MemoLine: evaluating long-term UX with children.",
                    "Low-tech and high-tech prototyping for eBook co-design with children.",
                    "Children initiating and leading cooperative inquiry sessions.",
                    "Students' use of mobile technology to collect data in guided inquiry on field trips.",
                    "Beelight: helping children discover colors.",
                    "Programming robots at the museum.",
                    "TUI, GUI, HUI: is a bimodal interface truly worth the sum of its parts?",
                    "Recruiting and retaining young participants: strategies from five years of field research.",
                    "PuppetPlay: testing interactive puppets to promote reading comprehension in Uganda & El Salvador.",
                    "Exploration of videochat for children with autism.",
                    "CASTOR: listening to engaging context-aware stories outdoors.",
                    "You are the real experts!: Studying teenagers' motivation in participatory design.",
                    "Participatory design workshops with children with cancer: lessons learned.",
                    "Designing creative activities for children: the importance of collaboration and the threat of losing control.",
                    "Playful taste interaction.",
                    "TanPro-kit: a tangible programming tool for children.",
                    "The mobile learning exploration system (MoLES) in semantically modeled ambient learning spaces.",
                    "Fun and fair: influencing turn-taking in a multi-party game with a virtual agent.",
                    "The play grid.",
                    "The DEVICE project: development of educational programs with a specific focus on design for children.",
                    "Human SUGOROKU: full-body interaction system for students to learn vegetation succession.",
                    "Invent-abling: enabling inventiveness through craft.",
                    "Learning in critter corral: evaluating three kinds of feedback in a preschool math app.",
                    "Designing early childhood math games: a research-driven approach.",
                    "Digital culture creative classrooms (DC3): teaching 21st century proficiencies in high schools by engaging students in creative digital projects.",
                    "Engaging children in cars through a robot companion.",
                    "Using gamification to motivate children to complete empirical studies in lab environments.",
                    "A comparative evaluation of touch and pen gestures for adult and child users.",
                    "Engaging children in longitudinal behavioral studies through playful technologies.",
                    "Feel the burn: exploring design parameters for effortful interaction for educational games.",
                    "Pirate island: an immersion-style language-learning RPG.",
                    "Know your enemy: learning from in-game opponents.",
                    "Embodied metaphor elicitation through augmented-reality game design.",
                    "Little backpackers: studying children's psychological needs in an interactive exhibition context.",
                    "Children as webmakers: designing a web editor for beginners.",
                    "Designing interactive activities within Scratch 2.0 for improving abilities to identify numerical sequences.",
                    "Using social media and learning analytics to understand how children engage in scientific inquiry.",
                    "The digital economy: a case study of designing for classrooms.",
                    "Towards the design of technology for measuring and capturing children's attention on e-learning tasks.",
                    "The education arcade: crafting, remixing, and playing with controllers for Scratch games.",
                    "Once upon a time in the Bronx: working with youth to address violence through performance and play.",
                    "Comic creation, comic relief: kids expression of self and others.",
                    "Enacting orbits: refining the design of a full-body learning simulation.",
                    "Acquiring educational access for neurodiverse learners through multisensory design principles.",
                    "Cloudcommuting: games, interaction, and learning.",
                    "Go go games: therapeutic video games for children with autism spectrum disorders.",
                    "Evaluation of interactive puppet theater based on inclusive design methods: a case study of students at elementary school for the deaf.",
                    "Pre-pilot findings on developing a literacy tablet.",
                    "Rethinking transparency: constructing meaning in a physical and digital design for algebra.",
                    "On the aesthetics of children's computational modeling for learning science.",
                    "Meta-modeling knowledge: comparing model construction and model interaction in bifocal modeling.",
                    "Papert's prison fab lab: implications for the maker movement and education design.",
                    "LightUp: an augmented, learning platform for electronics.",
                    "Graph hopping: learning through physical interaction quantification.",
                    "Bilingual storybook app designed for deaf children based on research principles.",
                    "SINQ: designing social media to foster everyday scientific inquiry for children.",
                    "Cloud rhymer: prototype demo and intervention proposal.",
                    "An educational application for botanical study in science classes at elementary schools.",
                    "Interaction design and physical computing in the era of miniature embedded computers.",
                    "Blockuits: innovating building blocks.",
                    "A software infrastructure for managing the lifecycle of context-aware stories.",
                    "Next generation preschool math demo: tablet games for preschool classrooms.",
                    "Interactive reflexive and embodied exploration of sound qualities with BeSound.",
                    "Owl pellets and head-mounted displays: a demonstration of visual interaction for children who communicate in a sign language.",
                    "HygieneHelper: promoting awareness and teaching life skills to youth with autism spectrum disorder.",
                    "RoyoBlocks: an exploration in tangible literacy learning.",
                    "AR-based chemistry learning with mobile molecules.",
                    "Cyberchase 3D builder: a new way to look at geometry.",
                    "TOTA: a construction set for the impending apocalypse.",
                    "Plus minus: passive education of basic circuitry through DIY product design.",
                    "Dr. Wagon: a 'stretchable' toolkit for tangible computer programming.",
                    "Youtopia: a collaborative, tangible, multi-touch, sustainability learning activity.",
                    "Bridging book: a not-so-electronic children's picturebook.",
                    "Using demibooks composer to create remedial learning apps for the profoundly deaf.",
                    "Exploring early designs for teaching anatomy and physiology to children using wearable e-textiles.",
                    "VidCoach: a mobile video modeling system for youth with special needs.",
                    "BunnyBolt: a mobile fitness app for youth.",
                    "BeatTable: a tangible approach to rhythms and ratios.",
                    "Interactive e-books for children.",
                    "Interactive technologies that enhance children's creativity.",
                    "Enhancing children's voices with media and technology.",
                    "Designing for and with children with special needs in multiple settings.",
                    "Bridging books: the printed book as a support for digital experiences.",
                    "Behaviour change interventions: teenagers, technology and design.",
                    "The makers' movement and FabLabs in education: experiences, technologies, and research.",
                    "Evaluating accessibility in fabrication tools for children.",
                    "Do animations in enhanced ebooks for children favour the reading comprehension process?: a pilot study.",
                    "Designing for the needs of child patients in hospital settings.",
                    "Interaction design, books, and cultural forms.",
                    "Scatter!: a mobile non-parallel multiplayer exertion game.",
                    "Making \"making\" accessible.",
                    "Measuring learning and fun in video games for young children: a proposed method.",
                    "The LIT ROOM: advancing literacy in children through a networked suite of architectural robotic artifacts.",
                    "Two-way play: early learners' experiences with bi-directional television.",
                    "Designing a tangible interface for collaborative storytelling to access 'embodiment' and meaning making.",
                    "Infant emotional engagement in video mediated interactions.",
                    "Deliberate discrepancies as a design strategy for motivating social communication in virtual environments for young children with autism.",
                    "Scripting and orchestration of collaborative inquiry in smart classrooms.",
                    "An embodied approach to collaborative knowledge construction for science inquiry."
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "11. IDC 2012",
        "info": "Bremen, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/acmidc/2012",
                "sub_name": "The 11th International Conference on Interaction Design and Children, IDC '12, Bremen, UNK, Germany, June 12 - 15, 2012.",
                "count": 72,
                "papers": [
                    "CASTOR: learning to create context-sensitive and emotionally engaging narrations in-situ.",
                    "DisCo: a co-design online tool for asynchronous distributed child and adult design partners.",
                    "Embedding technology in the classroom: the train the teacher model.",
                    "Exploring children's 'indexical encounter' with real and digitised archive photographs using tablet and large flat screen technologies.",
                    "Family and design in the IDC and CHI communities.",
                    "Fostering early literacy skills in children's libraries: opportunities for embodied cognition and tangible technologies.",
                    "Impact of embodied interaction on learning processes: design and analysis of an educational application based on physical activity.",
                    "Investigating children's opinions of games: Fun Toolkit vs. This or That.",
                    "Learning kinematics in elementary grades using agent-based computational modeling: a visual programming-based approach.",
                    "Revive!: reactions to migration between different embodiments when playing with robotic pets.",
                    "Robo-Blocks: designing debugging abilities in a tangible programming system for early primary school children.",
                    "Scandinavian participatory design: dialogic curation with teenagers.",
                    "Sciensations: making sense of science by designing with sensors.",
                    "StoryFaces: pretend-play with ebooks to support social-emotional storytelling.",
                    "Supporting the design contributions of children with autism spectrum conditions.",
                    "Tangicons 3.0: an educational non-competitive collaborative game.",
                    "Technology for promoting scientific practice and personal meaning in life-relevant learning.",
                    "The choreography of conceptual development in computer supported instructional environments.",
                    "A networked suite of mixed-technology robotic artifacts for advancing literacy in children.",
                    "BeSound: embodied reflexion for music education in childhood.",
                    "Building examples: media and learning affordances.",
                    "Characters as agents for the co-design process.",
                    "Children's web search with Google: the effectiveness of natural language queries.",
                    "Creative access to technology: building sounding artifacts with children.",
                    "Design challenges and concept for intergenerational online learning.",
                    "Designing digital media for teen-aged apprentices: a participatory approach.",
                    "Designing textual password systems for children.",
                    "Development and evaluation of Fingu: a mathematics iPad game using multi-touch interaction.",
                    "Development of intelligent play practice for trampolines.",
                    "Digitally augmenting the flannel board.",
                    "Evaluation of the puppet theater based on inclusive design method: a case study of fourth-year elementary school students with normal hearing.",
                    "From tools to communities: designs to support online creative collaboration in scratch.",
                    "Group interaction on interactive multi-touch tables by children in India.",
                    "Growing up with Nell: a narrative interface for literacy.",
                    "Ilha Musical: a CAVE for nurturing cultural appreciation.",
                    "Independent exploration with tangibles for students with intellectual disabilities.",
                    "Interactive applications for children with hearing impairments: a process of inspiration, ideation, and conceptualization.",
                    "Material pets, virtual spaces, isolated designers: how collaboration may be unintentionally constrained in the design of tangible computational crafts.",
                    "Math on a sphere: using public displays to support children's creativity and computational thinking on 3D surfaces.",
                    "Parents and children having and using technology: what should we ask?",
                    "Participatory design for exertion interfaces for children.",
                    "Robotic companion for diabetic children: emotional and educational support to diabetic children, through an interactive robot.",
                    "Standing on the shoulders of their peers: success factors for massive cooperation among children creating open source animations and games on their smartphones.",
                    "Time-Me: helping children understand time.",
                    "Understanding reading experience to inform the design of ebooks for children.",
                    "Using children's drawings to elicit feedback on interactive museum prototypes.",
                    "v-Penglipur Lara: the development of a pedagogical agent in Malaysian folktales land.",
                    "What makes competitions fun to participate?: the role of audience for middle school game designers.",
                    "You have to die!: parents and children playing cooperative games.",
                    "An interactive exploration system that visually supports learning of country features.",
                    "Bifocal modeling: mixing real and virtual labs for advanced science learning.",
                    "Catroid: a mobile visual programming system for children.",
                    "Designing a community to support long-term interest in programming for middle school children.",
                    "Designing the anti-heuristic game: a game which violates heuristics.",
                    "Improving on a physics-based programming system for children.",
                    "Proportion: a tablet app for collaborative learning.",
                    "Replay: a self-documenting construction kit.",
                    "t-books: merging traditional storybooks with electronics.",
                    "Augmenting imagination for children with autism.",
                    "Creating physically active games for young adolescents.",
                    "Designing for emergent play.",
                    "Developing adaptive exergames for adolescent children.",
                    "Empowerment through design: engaging alternative high school students through the design, development and crafting of digitally-enhanced pets.",
                    "Supporting non-formal learning through co-design of social games with children.",
                    "The choreography of conceptual development in computer supported instructional environments.",
                    "Towards a socially adaptive digital playground.",
                    "Waiting for learning: designing interactive educational materials for patient waiting areas.",
                    "Interactive technologies for children with special needs.",
                    "Challenges, opportunities and future perspectives in including children with disabilities in the design of interactive technology.",
                    "Tangibles for students with intellectual disabilities.",
                    "Digital fabrication for educational contexts.",
                    "\"Seeing solids\" via patterns of light: evaluating a tangible 3D-input device."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "10. IDC 2011",
        "info": "Ann Arbor, MI, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/acmidc/2011",
                "sub_name": "Interaction Design and Children, Proceedings of the 10th International Conference on Interaction Design and Children, IDC 2011, Ann Arbor, MI, USA, June 20-23, 2011.",
                "count": 49,
                "papers": [
                    "Toward an embodied-interaction design framework for mathematical concepts.",
                    "Towards Utopia: designing tangibles for learning.",
                    "Mobile learning in museums: how mobile supports for learning influence student behavior.",
                    "Paper vs. tablet computers: a comparative study using Tangible Flags.",
                    "How children represent sustainability in the home.",
                    "Cross-platform learning: children's learning from multiple media.",
                    "An open-ended tangible environment for disabled children's learning.",
                    "Using a large display in the periphery to support children learning through design.",
                    "The UCube: a child-friendly device for introductory three-dimensional design.",
                    "Designing learning representations around physical manipulation: hands and objects.",
                    "How real is 'real enough'?: designing artifacts and procedures for embodied simulations of science practices.",
                    "Pop goes the cell phone: asynchronous messaging for preschoolers.",
                    "Beyond one-size-fits-all: how interactive tabletops support collaborative learning.",
                    "Collaboration through documentation: automated capturing of tangible constructions to support engineering design.",
                    "T-Maze: a tangible programming tool for children.",
                    "Examining values: an analysis of nine years of IDC research.",
                    "TinkRBook: shared reading interfaces for storytelling.",
                    "Dance dance Pleo: developing a low-cost learning robotic dance therapy aid.",
                    "Reviewing children's collaboration practices in storytelling environments.",
                    "Improving learning transfer from stencils-based tutorials.",
                    "Learning sustainability: families, learning, and next-generation eco-feedback technology.",
                    "Steps toward child-designed interactive stuffed toys.",
                    "Twooter: designing a musical expression tool for use in social networks.",
                    "Representing equality: a tangible balance beam for early algebra education.",
                    "Supporting children's learning with body-based metaphors in a mixed reality environment.",
                    "The design of t-vote: a tangible tabletop application supporting children's decision making.",
                    "A method for involving children with autism in design.",
                    "Modeling on the table: agent-based modeling in elementary school with NetTango.",
                    "Evaluating technology that makes physical games for children more engaging.",
                    "Evaluating the usability of an interactive map activity for climate change education.",
                    "Pokaboo: a networked toy for distance communication and play.",
                    "NFC-based interactive learning environments for children.",
                    "Social networking as a vehicle to foster cross-cultural awareness.",
                    "TofuDraw: a mixed-reality choreography tool for authoring robot character performance.",
                    "Supporting pretend and narrative play over videochat.",
                    "The fun semantic differential scales.",
                    "LightUp: a low-cost, multi-age toolkit for learning and prototyping electronics.",
                    "Electric Agents: combining television and mobile phones for an educational game.",
                    "Pas a Pas: a platform for enabling schools to teach educational content using stop motion animation.",
                    "QWERTY and the art of designing microcontrollers for children.",
                    "Sticking together: handcrafting personalized communication interfaces.",
                    "Pattern poses: embodied geometry with tangibles and computer visualization.",
                    "Collaborative technologies for children with autism.",
                    "Modkit: blending and extending approachable platforms for creating computer programs and interactive objects.",
                    "OpenGesture: a low-cost authoring framework for gesture and speech based application development and learning analytics.",
                    "Teaching interaction design & children within diverse disciplinary curricula.",
                    "Children's co-design and inclusive education.",
                    "Opportunities and challenges when designing and developing with kids @ school.",
                    "Creating a child computer interaction curriculum."
                ]
            }
        ]
    },
    {
        "year": "2010",
        "name": "9. IDC 2010",
        "info": "Barcelona, Spain",
        "venues": [
            {
                "sub_name_abbr": "conf/acmidc/2010",
                "sub_name": "Interaction Design and Children, Proceedings of the 9th International Conference on Interaction Design and Children, IDC 2010, Barcelona, Spain, June 9-12, 2010.",
                "count": 68,
                "papers": [
                    "Mobile system to motivate teenagers' physical activity.",
                    "Collective digital storytelling at school as a whole-class interaction.",
                    "Mobile collaboration: collaboratively reading and creating children's stories on mobile devices.",
                    "In my own words: configuration of tangibles, object interaction and children with autism.",
                    "How do you play with a robotic toy animal?: a long-term study of Pleo.",
                    "Video play: playful interactions in video conferencing for long-distance families with young children.",
                    "Let robots do the talking.",
                    "User interfaces for tangible characters: can children connect remotely through toy perspectives?",
                    "Paper-based multimedia interaction as learning tool for disabled children.",
                    "Us hunters: interactive communication for young cavemen.",
                    "Bridging the gap between children and tabletop designers.",
                    "Considering context, content, management, and engagement in design activities with children.",
                    "Detecting and modeling play behavior using sensor-embedded rock-climbing equipment.",
                    "Assessment of the involuntary motion of children with motor impairments to improve the accessibility of an inertial interface.",
                    "Lo-fi prototyping to design interactive-tabletop applications for children.",
                    "Noising around: investigations in mobile learning.",
                    "Laddering with young children in User eXperience evaluations: theoretical groundings and a practical case.",
                    "Learning environmental factors through playful interaction.",
                    "Zydeco: using mobile and web technologies to support seamless inquiry between museum and school contexts.",
                    "jogo: an explorative design for free play.",
                    "BeeSign: designing to support mediated group inquiry of complex science by early elementary students.",
                    "TechSportiv: using a smart textile toolkit to approach young people's physical education.",
                    "Informing design for tangible interaction: a case for children with learning difficulties.",
                    "SMART-games: a video game intervention for children with Autism Spectrum Disorders.",
                    "Investigating the impact of design processes on children.",
                    "Co-designing with children: a comparison of embodied and disembodied sketching techniques in the design of child age communication devices.",
                    "Make a Riddle and TeleStory: designing children's applications for the siftables platform.",
                    "My Green Pet: a current-based interactive plant for children.",
                    "Fröbel's forgotten gift: textile construction kits as pathways into play, design and computation.",
                    "Designing technologies with children with special needs: Children in the Centre (CiC) framework.",
                    "Exploring rules and underlying concepts while engaged with collaborative full-body games.",
                    "A collaborative approach to the design and evaluation of an interactive learning tool for children with special educational needs.",
                    "An e-sewing tutorial for DIY learning.",
                    "KaleiVoiceKids: interactive real-time voice transformation for children.",
                    "Touch-screen technology for children: giving the right instructions and getting the right responses.",
                    "Craftopolis: blending tangible, informal construction into virtual multiuser communities.",
                    "BeeSim: leveraging wearable computers in participatory simulations with young children.",
                    "Querying and navigating a database of images with the magical objects of the wizard Zurlino.",
                    "Introducing the FabLab as interactive exhibition space.",
                    "Comparing canonical and digital-based narrative activities in a formal educational setting.",
                    "Enjoyable \"LEGS\" system deepens children's learning in a zoo.",
                    "Design of an instrument for the evaluation of communication technologies with children.",
                    "Teaching social competence: in search of design patterns.",
                    "PIPLEX: tangible experience in an augmented reality video game.",
                    "TRAZO: a tool to acquire handwriting skills using tablet-PC devices.",
                    "TeddIR: tangible information retrieval for children.",
                    "Oriental well-being design.",
                    "The BEAM: a digitally enhanced balance beam for mathematics education.",
                    "Musical box: draw it yourself.",
                    "Playing with toys on a tabletop active surface.",
                    "Tangible manipulatives and digital content: the transparent link that benefits young deaf children.",
                    "Quadratic: manipulating algebraic expressions on an interactive tabletop.",
                    "Singing Fingers: fingerpainting with sound.",
                    "Dermaland.",
                    "The World is Canvas: a coloring application for children based on physical interaction.",
                    "vSked: an interactive visual schedule system for use in classrooms for children with autism.",
                    "Hacker's mentality: integrating games and hacking to build it fluency among middle school students.",
                    "Exploring the value of audience collaboration and game design in immersive virtual learning environments.",
                    "Improving children's self-report in user-centered evaluations.",
                    "Collective creation of games using free play technologies.",
                    "Gifts for intertwining with modern nature.",
                    "Using data to promote healthy behavior in children.",
                    "Programming & storytelling: opportunities for learning about coding & composition.",
                    "Social inclusion through the digital economy: digital creative engagement and youth-led innovation.",
                    "Interactive storytelling for children.",
                    "Digital Technologies and Marginalized Youth.",
                    "Digital inclusion in Chilean in rural schools.",
                    "How the social structure of intercultural computer clubs fosters interactive storytelling."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "8. IDC 2009",
        "info": "Como, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/acmidc/2009",
                "sub_name": "Interaction Design and Children, Proceedings of the 8th International Conference on Interaction Design and Children, IDC 2009, Como, Italy, June 3-5, 2009.",
                "count": 69,
                "papers": [
                    "Children's programming, reconsidered: settings, stuff, and surfaces.",
                    "EduWear: smart textiles as ways of relating computing technology to everyday life.",
                    "Designing wiimprovisation for mediation in group music therapy with children suffering from behavioral disorders.",
                    "Designing a story-based platform for HIV and AIDS counseling with Tanzanian children.",
                    "An investigation of purpose built netbooks for primary school education.",
                    "Interactive storytelling in pre-school: a case-study.",
                    "Ten design lessons from the literature on child development and children's use of technology.",
                    "Out of the box: exploring the richness of children's use of an interactive table.",
                    "The fantasy table.",
                    "Hands on what?: comparing children's mouse-based and tangible-based interaction.",
                    "How children search the internet with keyword interfaces.",
                    "Developing a media space for remote synchronous parent-child interaction.",
                    "Children designing together on a multi-touch tabletop: an analysis of spatial orientation and user interactions.",
                    "Putting interference to work in the design of a whole-class learning activity.",
                    "Designing for spatial competence.",
                    "A novel approach to interactive playgrounds: the interactive slide project.",
                    "Identifying embodied metaphors in children's sound-action mappings.",
                    "A team of presentation agents for edutainment.",
                    "Formative evaluation of a didactic software for acquiring problem solving abilities using Prolog.",
                    "Virtual sandbox: adding groupware abilities to Scratch.",
                    "SyCo: a collaborative learning tool for generating ideas in private and in public.",
                    "MunchCrunch: a game to learn healthy-eating heuristics.",
                    "State machines are child's play: observing children ages 9 to 11 playing Escape Machine.",
                    "Lali: exploring a tangible interface for augmented play for preschoolers.",
                    "First steps in distributed tangible technologies: a virtual tug of war.",
                    "Increasing children's social competence through games, an exploratory study.",
                    "Sniff: designing characterful interaction in a tangible toy.",
                    "User-oriented design and tangible interaction for kindergarten children.",
                    "Designing for physical-digital correspondence in tangible learning environments.",
                    "Drama prototyping for the design of urban interactive systems for children.",
                    "Kingdom of the Knights: evaluation of a seamlessly augmented toy environment for playful learning.",
                    "Bubble Letters: a child-centric interface for virtual and real world experience.",
                    "Augmented-reality scratch: a children's authoring environment for augmented-reality experiences.",
                    "GENTORO: a system for supporting children's storytelling using handheld projectors and a robot.",
                    "StoryTime: a new way for children to write.",
                    "LEGS system in a zoo: use of mobile phones to enhance observation of animals.",
                    "WeWrite: 'on-the-fly' interactive writing on electronic textiles with mobile phones.",
                    "\"Playing with\" museum exhibits: designing educational games mediated by mobile technology.",
                    "Learning abstract concepts through bodily engagement: a comparative, qualitative study.",
                    "Materiality, practice, body.",
                    "Awakening to maker methodology: the metamorphosis of a curious caterpillar.",
                    "\"It has to be a group work!\": co-design with children.",
                    "Evaluating outdoor play for children: virtual vs. tangible game objects in pervasive games.",
                    "Computer game design and the imaginative play of young children.",
                    "Designing the 'record' button: using children's understanding of icons to inform the design of a musical interface.",
                    "Exploring children's investigation of data outliers.",
                    "Experience it, draw it, rate it: capture children's experiences with their drawings.",
                    "Enhancing user experience while gaming in archaeological parks with cellular phones.",
                    "Game as life --- life as game.",
                    "Petimo: safe social networking robot for children.",
                    "FearNot!: providing children with strategies to cope with bullying.",
                    "Tangible optical chess: a laser strategy game on an interactive tabletop.",
                    "Human-robot interactions to promote play and learning.",
                    "A museum mobile game for children using QR-codes.",
                    "Jots: reflective learning in scratch.",
                    "Pendaphonics: an engaging tangible pendulum-based sonic interaction experience.",
                    "Simple tangible language elements for young children.",
                    "Huggy pajama: a parent and child hugging communication system.",
                    "TOFU: a socially expressive robot character for child interaction.",
                    "Cultural coding and de-coding as ways of participation: digital media for marginalized young people.",
                    "Fostering inclusion in Portuguese schools: key lessons from ICT projects.",
                    "Voices beyond walls: the role of digital storytelling for empowering marginalized youth in refugee camps.",
                    "Children and embodied interaction: seeking common ground.",
                    "Stimulating physical and social activity through open-ended play.",
                    "Creative interactive play for disabled children.",
                    "The huggable: a platform for research in robotic companions for pediatric care.",
                    "Family communication: phone conversations with children.",
                    "Designing intergenerational mobile storytelling.",
                    "Designing and testing mobile interfaces for children."
                ]
            }
        ]
    },
    {
        "year": "2008",
        "name": "7. IDC 2008",
        "info": "Chicago, IL, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/acmidc/2008",
                "sub_name": "Proceedings of the 7th International Conference on Interaction Design and Children, IDC 2008, Chicago, Illinois, USA, June 11-13, 2008.",
                "count": 69,
                "papers": [
                    "The world's longest street: how Sesame Street is working to meet a diversity of children's needs across the globe.",
                    "Toys to fall for or live with?",
                    "What works, what doesn't, and/or how to make it work?",
                    "Testing interfaces that do not exist.",
                    "Rethinking product research when time is on your side, but funds are not!",
                    "What's a screen mean in a video game?",
                    "Dan Anderson - University of Massachusetts, Amherst.",
                    "Thinking inside the box: tales from the trenches.",
                    "Screen cultures: cross-pollination between videogame and television research.",
                    "Accountable game designs for classroom learning.",
                    "Utilizing technology to support the development of empathy.",
                    "Digital learning ecosystems: authoring, collaboration, immersion and mobility.",
                    "Designing and evaluating affective open-learner modeling tutors.",
                    "LinguaBytes.",
                    "Tangible computer programming for informal science learning.",
                    "Supporting children as they program to make physical and virtual objects interact.",
                    "Robotics in special needs education.",
                    "Supporting parent-child interaction in divorced families.",
                    "Use of goals and dramatic elements in behavioral training of children with ASD.",
                    "Evaluation of technology acceptance of a computer rehabilitation tool.",
                    "Smartphones to facilitate communication and improve social skills of children with severe autism spectrum disorder: special education teachers as proxies.",
                    "Robot-assisted therapy for children with autism spectrum disorders.",
                    "TREK: transportation research, education, and knowledge.",
                    "Developing a multi-user virtual environment for adolescent psychotherapy.",
                    "Designing with and for children with special needs: an inclusionary model.",
                    "Interactive and intelligent visual communication systems.",
                    "Working with children with severe motor impairments as design partners.",
                    "A role for grammar in autism CAIs.",
                    "iSET: interactive social-emotional toolkit for autism spectrum disorder.",
                    "Designing virtual peers for assessment and intervention for children with autism.",
                    "Three-dimensional virtual learning environments for mediating social skills acquisition among individuals with autism spectrum disorders.",
                    "Designing toys with automatic play characterization for supporting the assessment of a child's development.",
                    "Semiotics artifacts, space and community: a case study on pinholes.",
                    "Can ICT support inclusion?: evidence from multi-user edutainment experiences based on 3D worlds.",
                    "Marginalized young people: inclusion through ICT.",
                    "Interaction design for kid's technology-enhanced environmental education.",
                    "Sensor-enabled detection of stereotypical motor movements in persons with autism spectrum disorder.",
                    "A storytelling support system using robots and handheld projectors.",
                    "Testing interactive products with the robot intervention method.",
                    "Mocotos: mobile communications tools for children with special needs.",
                    "Designing ThinkeringSpaces.",
                    "Push-me, pull-me: describing and designing technologies for varying degrees of reflection and invention.",
                    "Sketch-based educational games: \"drawing\" kids away from traditional interfaces.",
                    "Youth as media art designers: workshops for creative coding.",
                    "Living labs: driving innovation through civic involvement.",
                    "Sampling young children's experiences with cultural probes.",
                    "Designing an interactive spoken help application for preschool children.",
                    "Using a mobile phone and a geobrowser to create multisensory geographic information.",
                    "Handcrafted physical syntax elements for illetterate children: initial concepts.",
                    "KEI-time traveler: visiting a past world with mobile phones to enhance learning motivation.",
                    "Parents' views of the benefits claimed in educational toy advertising.",
                    "LoRy: a locative story game to encourage playful and social learning.",
                    "Web-based multi-player games to encourage flexibility and social interaction in high-functioning children with autism spectrum disorder.",
                    "Camera for the invisible.",
                    "Universal design for learning in science: more than multiple representations.",
                    "Playing with the sound maker: do embodied metaphors help children learn?",
                    "Broadening children's involvement as design partners: from technology to \"experience\".",
                    "Tangible programming and informal science learning: making TUIs work for museums.",
                    "PointAssist: helping four year olds point with ease.",
                    "Breaking the sound barrier: designing an interactive tool for language acquisition in preschool deaf children.",
                    "A modelling tool to support children making their ideas work.",
                    "Creating mathematical artifacts: extending children's engagement with math beyond the classroom.",
                    "Embodying scientific concepts in the physical space of the classroom.",
                    "Tangicons: algorithmic reasoning in a collaborative game for children in kindergarten and first class.",
                    "Huggy Pajama: a mobile parent and child hugging communication system.",
                    "Key issues for the successful design of an intelligent, interactive playground.",
                    "Comparing the creativity of children's design solutions based on expert assessment.",
                    "How children's individual needs challenge the design of educational robotics.",
                    "Escape machine: teaching computational thinking with a tangible state machine game."
                ]
            }
        ]
    },
    {
        "year": "2007",
        "name": "6. IDC 2007",
        "info": "Aalborg, Denmark",
        "venues": [
            {
                "sub_name_abbr": "conf/acmidc/2007",
                "sub_name": "Interaction Design and Children, Proceedings of the 6th International Conference on Interaction Design and Children, IDC 2007, Aalborg, Denmark, June 6-8, 2007.",
                "count": 45,
                "papers": [
                    "Towards a likeability framework that meets child-computer interaction & communication sciences.",
                    "A comparison of usability evaluation methods for child participants in a school setting.",
                    "Comparing early design methods for children.",
                    "Designing and testing a tangible interface prototype.",
                    "Investigating the educational effectiveness of multiplayer online games for children.",
                    "Adventure Author: a learning environment to support creative design.",
                    "A learner-centred design approach to developing a visual language for interactive storytelling.",
                    "aMAZEd: designing an affective social game for children.",
                    "StorySurfer: a playful book browsing installation for children's libraries.",
                    "Mediated education in a creative arts context: research and practice at Whittier Elementary School.",
                    "Using an emergent system concept in designing interactive games for autistic children.",
                    "Children designers in the museum: applying participatory design for the development of an art education program.",
                    "ProBoNO: transferring knowledge of virtual environments to real world situations.",
                    "Remix and Robo: sampling, sequencing and real-time control of a tangible robotic construction system.",
                    "PageCraft: learning in context a tangible interactive storytelling platform to support early narrative development for young children.",
                    "Agency, tangible technology and young children.",
                    "\"The Fire and The Mountain\": tangible and social interaction in a museum exhibition for children.",
                    "Does mouse size affect study and evaluation results?: a study comparing preschool children's performance with small and regular-sized mice.",
                    "Stepstone: an interactive floor application for hearing impaired children with a cochlear implant.",
                    "Sprock-it: a physically interactive play system.",
                    "Use of images in instructional technology for children with attentional difficulties.",
                    "Designing spoken instructions with preschool children.",
                    "Jabberstamp: embedding sound and voice in traditional drawings.",
                    "bibPhone: adding sound to the children's library.",
                    "How preschool children used a behaviour-based programming tool.",
                    "SketchCam: creative photography for children.",
                    "Pixel Materiali: a system for creating and understanding pixel animations.",
                    "Kids story \"writers\": POGO, Tell-Tale, Sprite.",
                    "Stimulating children's physical play through interactive games: two exploratory case studies.",
                    "Evaluating interactive TV applications for and with pre-literate children.",
                    "ScratchR: sharing user-generated programmable media.",
                    "Emerging interactions as a resource for designing learning environments.",
                    "Using handhelds to promote environmental stewardship.",
                    "GATELOCK: a game authoring tool for children.",
                    "Video-Wikis and media fluency.",
                    "The preliminary study of animation dictionary for onomatopoeic learning.",
                    "Facilitorials.",
                    "Mobile collaboration for young children.",
                    "Design and evaluation of interactive cross-platform applications for pre-literate children.",
                    "Scaffolding cooperative multi-device activities in an informal learning environment.",
                    "'My world(s)': a tabletop environment to support fantasy play for kindergarten children.",
                    "Requirements gathering in designing technology for children.",
                    "How to optimize early design methods with children?",
                    "HUGs: head-up games.",
                    "Design and evaluation of tangible interfaces for primary school children."
                ]
            }
        ]
    },
    {
        "year": "2006",
        "name": "5. IDC 2006",
        "info": "Tampere, Finland",
        "venues": [
            {
                "sub_name_abbr": "conf/acmidc/2006",
                "sub_name": "Interaction Design and Children, Proceedings of the 2006 conference on Interaction design and children, IDC 2006, Tampere, Finland, June 7-9, 2006.",
                "count": 32,
                "papers": [
                    "A case study of tangible flags: a collaborative technology to enhance field trips.",
                    "On the design of Camelot, an outdoor game for children.",
                    "The literacy fieldtrip: using UbiComp to support children's creative writing.",
                    "Practical considerations for participatory design with rural school children in underdeveloped regions: early reflections from the field.",
                    "Interaction design: a multidimensional approach for learners with autism.",
                    "Integrating scaffolds into goal-based scenarios: the case of an interactive game on biodiversity for children.",
                    "Pupil's ecological reasoning with help of modeling tool.",
                    "CarettaKids: a system for supporting children's face-to-face collaborative learning by integrating personal and shared spaces.",
                    "Electronic/computational textiles and children's crafts.",
                    "Telebeads: social network mnemonics for teenagers.",
                    "Learning from preschool children's pointing sub-movements.",
                    "Assessing the applicability of the structured expert evaluation method (SEEM) for a wider age group.",
                    "Using the fun toolkit and other survey methods to gather opinions in child computer interaction.",
                    "Teachers' involvement in usability testing with children.",
                    "Initial observations on children and online instructions.",
                    "Reading in the wild: sociable literacy in practice.",
                    "The evolution of the international children's digital library searching and browsing interface.",
                    "FaTe2: storytelling edutainment experiences in 2D and 3D collaborative spaces.",
                    "An ecological approach to children's playground props.",
                    "Rethinking children's programming with contextual signs.",
                    "UbiPlay: an interactive playground and visual programming tools for children.",
                    "When play works: turning game-playing into learning.",
                    "Marble track music sequencers for children.",
                    "Mediated intimacy in families: understanding the relation between children and parents.",
                    "Home-school technologies: considering the family.",
                    "Network force-feedback applications for hospitalized children in sterile room.",
                    "A technological platform for trans-media scientific exploration.",
                    "Musical multimodal child computer interaction.",
                    "MagicWords: a programmable learning toy.",
                    "Nature talk: a proposed audible database system for environmental learning.",
                    "Experiences from designing a tangible musical toy for children.",
                    "In search for evaluation methods for children's tangible technology."
                ]
            }
        ]
    },
    {
        "year": "2005",
        "name": "4. IDC 2005",
        "info": "Boulder, Colorado, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/acmidc/2005",
                "sub_name": "Interaction Design and Children, Proceedings of the 2005 conference on Interaction design and children, IDC 2005, Boulder, Colorado, USA, June 8-10, 2005.",
                "count": 16,
                "papers": [
                    "Playthings that do things: a young kid's \"incredibles\"!",
                    "Comparison of think-aloud and constructive interaction in usability testing with children.",
                    "Spookies: combining smart materials and information technology in an interactive toy.",
                    "Tools of contextualization: extending the classroom to the field.",
                    "pOwerball: the design of a novel mixed-reality game for children with mixed abilities.",
                    "Mission from Mars: a method for exploring user requirements for children in a narrative space.",
                    "Child's play: a comparison of desktop and physical interactive environments.",
                    "Making educational computer games \"educational\".",
                    "Designing ubiquitous computing to enhance children's interaction in museums.",
                    "Development of an American Sign Language game for deaf children.",
                    "A review of research methods in children's technology design.",
                    "Reading alone together: creating sociable digital library books.",
                    "Tangicam: exploring observation tools for children.",
                    "Assessing usability and fun in educational software.",
                    "Promotion of creative activity in children with severe autism through visuals in an interactive multisensory environment.",
                    "Some reflections on designing construction kits for kids."
                ]
            }
        ]
    },
    {
        "year": "2004",
        "name": "3. IDC 2004",
        "info": "Baltimore, MD, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/acmidc/2004",
                "sub_name": "Interaction Design and Children, IDC'04, Baltimore, MD, USA, June 1-3, 2004.",
                "count": 40,
                "papers": [
                    "Ambient wood: designing new forms of digital augmentation for learning outdoors.",
                    "Teaching rhetorical skills with a tangible user interface.",
                    "Tangible ideas for children: materials sciences as the future of educational technology.",
                    "Wizard of Oz prototyping of computer vision based action games for children.",
                    "Mixing ideas: a new technique for working with young children as design partners.",
                    "Usability testing with young children.",
                    "Evaluating computer game concepts with children.",
                    "Children's narrative development through computer game authoring.",
                    "Designing sound tools and toys for blind and visually impaired children.",
                    "Read-It: five-to-seven-year-old children learn to read in a tabletop environment.",
                    "Requirements for the design of a handwriting recognition based writing interface for children.",
                    "Supporting sociable literacy in the international children's digital library.",
                    "Supporting children's emotional expression and exploration in online environments.",
                    "What's so \"new\" about \"new media?\": comparing effective features of children's educational software, television, and magazines.",
                    "A comparison of think-aloud and post-task interview for usability testing with children.",
                    "Force feedback and student reasoning.",
                    "Chemation: classroom impact of a handheld chemistry modeling and animation tool.",
                    "Designing software for young children: theoretically grounded guidelines.",
                    "Computer games authored by children: a multi-perspective evaluation.",
                    "Using storyboards to guide virtual world design.",
                    "The organization of inventing and prototyping activities with children as design partners.",
                    "Programming environments for young learners: a comparison of their characteristics and students' use.",
                    "Preschoolers' moral judgments: distinctions between realistic and cartoon-fantasy transgressions.",
                    "The diary of the future: defining a self-documentation system with child design partners.",
                    "Designing an augmented reality board game with children: the battleboard 3D experience.",
                    "CODACHROME: a system for creating interactive electronic jewelry for children.",
                    "The child-engineering of arithmetic in ToonTalk.",
                    "Towards a new kind of computational manipulative: children learning math and designing quilts with manipulatives that afford both.",
                    "Chemation: a handheld chemistry modeling and animation tool.",
                    "The Icicle programming environment.",
                    "3D augmented reality comic book and notes for children using mobile phones.",
                    "The informal informing the formal to form new models of learning.",
                    "Explorations in theoretical computer science for kids (using paper toys).",
                    "An interactive 3D exploration narrative interface for storytelling.",
                    "Hands-on modeling and simulation of systems.",
                    "A child-centric interface: Graffiti or not Graffiti.",
                    "Encapsulating streams of consciousness into the international children's digital library.",
                    "Sustaining student engagement with a constructionist design tool for craft and math.",
                    "Examining young learners' activity within interactive virtual environments.",
                    "An engaging multimedia design model."
                ]
            }
        ]
    },
    {
        "year": "2003",
        "name": "2. IDC 2003",
        "info": "Preston, England, UK",
        "venues": [
            {
                "sub_name_abbr": "conf/acmidc/2003",
                "sub_name": "Interaction Design and Children, IDC'03, Preston, England, UK, July 1-3, 2003.",
                "count": 34,
                "papers": [
                    "Being playful: learning from children.",
                    "Children designing software for children: what can we learn?",
                    "Electronic whiteboard in kindergarten: opportunities and requirements.",
                    "Developing a web authoring tool that promotes accessibility in children's designs.",
                    "As we may print: new directions in output devices and computational crafts for children.",
                    "Assessing usability evaluation methods on their effectiveness to elicit verbal comments from children subjects.",
                    "Starting an intergenerational technology design team: a case study.",
                    "Case study: the design of CBC4Kids' StoryBuilder.",
                    "Experiences obtained from designing with children.",
                    "Children's perception of computer programming as an aid to designing programming environments.",
                    "Ghostwriter: a narrative virtual environment for children.",
                    "Using developmental theories to inform the design of technology for children.",
                    "Conceptualising tangibles to support learning.",
                    "Wearable computing and the geographies of urban childhood: working with children to explore the potential of new technology.",
                    "Curriculum-focused design.",
                    "Pupil consultation online: developing a web-based questionnaire system.",
                    "What's going on?: discovering what children understand about handwriting recognition interfaces.",
                    "Children's online interfaces: is usability testing worthwhile?",
                    "Ely the explorer: a multi-user interactive play system to promote collaborative learning.",
                    "Participatory design approach to information architecture design for children.",
                    "Multimodal interaction to support multilingualism acquisition and development in young children.",
                    "Cegadef: a collaborative educational game development framework.",
                    "Children's contributions to new technology: the design of AdventureAuthor.",
                    "Using digital cultural probes in design with children.",
                    "'Good enough for what?': acceptance of handwriting recognition errors by child users.",
                    "Evaluating the effectiveness of a computer based letter formation system for children.",
                    "Phonics for young children: a computer based approach.",
                    "Construction of the child as a user.",
                    "Multimedia software to motivate ethnic minority children to learn about their culture and language of origin.",
                    "Games to explore programming.",
                    "Who is afraid of spiders?: two perceptive computer games for children.",
                    "A computer based letter formation system for children.",
                    "Web navigation recorder eyetracking software application demo.",
                    "Creating a collaborative learning environment for children."
                ]
            }
        ]
    }
]