[
    {
        "name": "IEEE Transactions on Human-Machine Systems",
        "year": "2022",
        "info": "Volume 52: 2022",
        "count": 27,
        "papers": [
            "Eye-Tracking for Performance Evaluation and Workload Estimation in Space Telerobotic Training.",
            "A Review of Human-Machine Cooperation in the Robotics Domain.",
            "Finite-Time Observer-Based Variable Impedance Control of Cable-Driven Continuum Manipulators.",
            "Would You Imagine Yourself Negotiating With a Robot, Jennifer? Why Not?",
            "Information-Based Control of Robots in Search-and-Rescue Missions With Human Prior Knowledge.",
            "A Naturalistic Driving Study of Feedback Timing and Financial Incentives in Promoting Speed Limit Compliance.",
            "Bringing a Vehicle to a Controlled Stop: Effectiveness of a Dual-Control Scheme for Identifying Driver Drowsiness and Preventing Lane Departures Under Partial Driving Automation Requiring Hands-on-Wheel.",
            "Evolutionary Game and Collaboration Mechanism of Human-Computer Interaction for Future Intelligent Aircraft Cockpit Based on System Dynamics.",
            "CNN Confidence Estimation for Rejection-Based Hand Gesture Classification in Myoelectric Control.",
            "SAIL: A Deep-Learning-Based System for Automatic Gait Assessment From TUG Videos.",
            "Vision Processing for Assistive Vision: A Deep Reinforcement Learning Approach.",
            "A Survey of 17 Indoor Travel Assistance Systems for Blind and Visually Impaired People.",
            "Curb Negotiation With Dynamic Human-Robotic Wheelchair Collaboration.",
            "OAST: Obstacle Avoidance System for Teleoperation of UAVs.",
            "Quantitative Physical Ergonomics Assessment of Teleoperation Interfaces.",
            "Cognitive Workload Assessment of Prosthetic Devices: A Review of Literature and Meta-Analysis.",
            "Multiview Video-Based 3-D Pose Estimation of Patients in Computer-Assisted Rehabilitation Environment (CAREN).",
            "A Computer Vision Approach for Estimating Lifting Load Contributors to Injury Risk.",
            "A Technical Framework for Musical Biofeedback in Stroke Rehabilitation.",
            "EEG Correlates of Driving Performance.",
            "A Multiplayer VR Live Concert With Information Exchange Through Feedback Modulated by EEG Signals.",
            "EEG-Based Auditory Attention Detection via Frequency and Channel Neural Attention.",
            "Can Visually Impaired Use Gestures to Interact With Computers? A Cognitive Load Perspective.",
            "SoDar: Multitarget Gesture Recognition Based on SIMO Doppler Radar.",
            "L-Sign: Large-Vocabulary Sign Gestures Recognition System.",
            "Binocular Feature Fusion and Spatial Attention Mechanism Based Gaze Tracking.",
            "SPEye: A Calibration-Free Gaze-Driven Text Entry Technique Based on Smooth Pursuit."
        ]
    },
    {
        "name": "IEEE Transactions on Human-Machine Systems",
        "year": "2021",
        "info": "Volume 51: 2021",
        "count": 71,
        "papers": [
            "An Adaptive General Type-2 Fuzzy Logic Approach for Psychophysiological State Modeling in Real-Time Human-Machine Interfaces.",
            "Local Domain Adaptation for Cross-Domain Activity Recognition.",
            "A Comparison of Expert Ratings and Marker-Less Hand Tracking Along OSATS-Derived Motion Scales.",
            "Gesture-Radar: A Dual Doppler Radar Based System for Robust Recognition and Quantitative Profiling of Human Gestures.",
            "Gesture Recognition Using Reflected Visible and Infrared Lightwave Signals.",
            "Hand Gesture Recognition Using Multiple Acoustic Measurements at Wrist.",
            "Delivering Critical Stimuli for Decision Making in VR Training: Evaluation Study of a Firefighter Training Scenario.",
            "3D Model-Based Gaze Tracking Via Iris Features With a Single Camera and a Single Light Source.",
            "A Survey of Eye Tracking in Automobile and Aviation Studies: Implications for Eye-Tracking Studies in Marine Operations.",
            "EEG Correlates of Difficulty Levels in Dynamical Transitions of Simulated Flying and Mapping Tasks.",
            "A Self-Paced BCI With a Collaborative Controller for Highly Reliable Wheelchair Driving: Experimental Tests With Physically Disabled Individuals.",
            "Use of Mobile EEG in Decoding Hand Movement Speed and Position.",
            "Electromyography for Teleoperated Tasks in Weightlessness.",
            "Characteristics That Make Linear Time-Invariant Dynamic Systems Difficult for Humans to Control.",
            "Assessing Collaborative Physical Tasks Via Gestural Analysis.",
            "Holoscopic 3D Microgesture Recognition by Deep Neural Network Model Based on Viewpoint Images and Decision Fusion.",
            "Does Explicit Categorization Taxonomy Facilitate Performing Goal-Directed Task Analysis?",
            "How Does Explanation-Based Knowledge Influence Driver Take-Over in Conditional Driving Automation?",
            "Driving Skill Modeling Using Neural Networks for Performance-Based Haptic Assistance.",
            "An Improved IOHMM-Based Stochastic Driver Lane-Changing Model.",
            "Archery Skill Assessment Using an Acceleration Sensor.",
            "Implementation of a Character Recognition System Based on Finger-Joint Tracking Using a Depth Camera.",
            "Assessment of Machine Learning Models for Classification of Movement Patterns During a Weight-Shifting Exergame.",
            "Neurophysiological Evaluation of Haptic Feedback for Myoelectric Prostheses.",
            "Investigating the P300 Response as a Marker of Working Memory in Virtual Training Environments.",
            "Predicting Emotion Reactions for Human-Computer Conversation: A Variational Approach.",
            "Who/What Is My Teammate? Team Composition Considerations in Human-AI Teaming.",
            "Human-Machine Interaction Sensing Technology Based on Hand Gesture Recognition: A Review.",
            "Toward Long-Term FMG Model-Based Estimation of Applied Hand Force in Dynamic Motion During Human-Robot Interactions.",
            "Best Viewpoints for External Robots or Sensors Assisting Other Robots.",
            "Cobots in Industry 4.0: A Roadmap for Future Practice Studies on Human-Robot Collaboration.",
            "A Novel Application of Flexible Inertial Sensors for Ambulatory Measurement of Gait Kinematics.",
            "Sequential Weakly Labeled Multiactivity Localization and Recognition on Wearable Sensors Using Recurrent Attention Networks.",
            "Incentive Mechanism for Mobile Devices in Dynamic Crowd Sensing System.",
            "Using Operator Gaze Tracking to Design Wrist Mechanism for Surgical Robots.",
            "Radar Command Group Time Entropy Signature as a Visual Monitoring Enhancement for Air Traffic Controllers.",
            "Classification of Officers' Driving Situations Based on Eye-Tracking and Driver Performance Measures.",
            "The Benefit of Assisted and Unassisted Eco-Driving for Electrified Powertrains.",
            "Impact of Human-Centered Vestibular System Model for Motion Control in a Driving Simulator.",
            "On Task Dependence of Helicopter Pilot Biodynamic Feedthrough and Neuromuscular Admittance: An Experimental and Numerical Study.",
            "Impact of Pilot's Expertise on Selection, Use, Trust, and Acceptance of Automation.",
            "A Deep Learning Framework of Autonomous Pilot Agent for Air Traffic Controller Training.",
            "Identifying Drone Operator by Deep Learning and Ensemble Learning of IMU and Control Data.",
            "Automation Error Type and Methods of Communicating Automation Reliability Affect Trust and Performance: An Empirical Study in the Cyber Domain.",
            "Discovering Tactical Memory From Observed Human Performance in Machine Learning.",
            "Computer Interface for Real-Time Gait Biofeedback Using a Wearable Integrated Sensor System for Data Acquisition.",
            "Lifting Posture Prediction With Generative Models for Improving Occupational Safety.",
            "Variable Damping Control for pHRI: Considering Stability, Agility, and Human Effort in Controlling Human Interactive Robots.",
            "A Collaborative Filtering Approach Toward Plug-and-Play Myoelectric Robot Control.",
            "Interaction With Gaze, Gesture, and Speech in a Flexibly Configurable Augmented Reality System.",
            "Multiuser Stereoscopic Projection Techniques for CAVE-Type Virtual Reality Systems.",
            "Separability of Motor Imagery Directions Using Subject-Specific Discriminative EEG Features.",
            "Two Fall-Related and Kinematic Data-Based Approaches for an Instrumented Conventional Cane.",
            "ArmSym: A Virtual Human-Robot Interaction Laboratory for Assistive Robotics.",
            "Toward Robots' Behavioral Transparency of Temporal Difference Reinforcement Learning With a Human Teacher.",
            "Motion Planning for Human-Robot Collaboration Using an Objective-Switching Strategy.",
            "Extending the Evaluation of Social Assistive Robots With Accessibility Indicators: The AUSUS Evaluation Framework.",
            "The Effects of Haptic Feedback and Transition Type on Transfer of Control Between Drivers and Vehicle Automation.",
            "Assessing Alternative Approaches for Conveying Automated Vehicle \"Intentions\".",
            "Evaluating the Effect of Poor Contrast Ratio in Simulated Sensor-Based Vision Systems on Performance.",
            "A Review of Virtual Reality Studies on Autonomous Vehicle-Pedestrian Interaction.",
            "Performance Analysis of Learning From Demonstration Approaches During a Fine Movement Generation.",
            "Attentive Sequence-to-Sequence Modeling of Stroke Gestures Articulation Performance.",
            "Levels of Automation and Transparency: Interaction Design Considerations in Assistive Robots for Older Adults.",
            "Phase Variable Based Recognition of Human Locomotor Activities Across Diverse Gait Patterns.",
            "Exploration of Teammate Trust and Interaction Dynamics in Human-Autonomy Teaming.",
            "Individualized Mutual Adaptation in Human-Agent Teams.",
            "Influencing Human Escape Maneuvers With Perceptual Cues in the Presence of a Visual Task.",
            "A Systematic Review on Motor-Imagery Brain-Connectivity-Based Computer Interfaces.",
            "Load Asymmetry Angle Estimation Using Multiple-View Videos.",
            "Delay Time Fractional-Order Model for the Soft Exoskeleton Glove Control."
        ]
    },
    {
        "name": "IEEE Transactions on Human-Machine Systems",
        "year": "2020",
        "info": "Volume 50: 2020",
        "count": 58,
        "papers": [
            "User Recruitment System for Efficient Photo Collection in Mobile Crowdsensing.",
            "Annotation Generation From IMU-Based Human Whole-Body Motions in Daily Life Behavior.",
            "Grasp Prediction Toward Naturalistic Exoskeleton Glove Control.",
            "A Novel Postprocessing Method for Robust Myoelectric Pattern-Recognition Control Through Movement Pattern Transition Detection.",
            "Natural Human-Robot Interface Using Adaptive Tracking System with the Unscented Kalman Filter.",
            "A New Mixed-Reality-Based Teleoperation System for Telepresence and Maneuverability Enhancement.",
            "Effects of Target Trajectory Bandwidth on Manual Control Behavior in Pursuit and Preview Tracking.",
            "Supporting Multitracking Performance With Novel Visual, Auditory, and Tactile Displays.",
            "Efficacy of Incentive Structures for Boundedly Rational Dispatchers in Large-Scale Queueing Networks.",
            "Brain-Computer Interface Software: A Review and Discussion.",
            "State of the Art in Bionic Hands.",
            "Review of Human-Machine Interfaces for Small Unmanned Systems With Robotic Manipulators.",
            "Active Compliance Control Reduces Upper Body Effort in Exoskeleton-Supported Walking.",
            "Determination of the Gain for a Walking Speed Amplifying Belt Using Brain Activity.",
            "A Unifying Theory of Driver Perception and Steering Control on Straight and Winding Roads.",
            "How Communicating Features can Help Pedestrian Safety in the Presence of Self-Driving Vehicles: Virtual Reality Experiment.",
            "Guest Editorial: Agent and System Transparency.",
            "Models of Trust in Human Control of Swarms With Varied Levels of Autonomy.",
            "Influence of Culture, Transparency, Trust, and Degree of Automation on Automation Use.",
            "Agent Transparency: A Review of Current Theory and Evidence.",
            "Transparency for a Workload-Adaptive Cognitive Agent in a Manned-Unmanned Teaming Application.",
            "Individual Differences in Trust in Autonomous Robots: Implications for Transparency.",
            "The IMPACT of Agent Transparency on Human Performance.",
            "Agent Transparency and Reliability in Human-Robot Interaction: The Influence on User Confidence and Perceived Reliability.",
            "Demand-Driven Transparency for Monitoring Intelligent Agents.",
            "Performance of a Steady-State Visual Evoked Potential and Eye Gaze Hybrid Brain-Computer Interface on Participants With and Without a Brain Injury.",
            "A Usability Study of Low-Cost Wireless Brain-Computer Interface for Cursor Control Using Online Linear Model.",
            "Cross-Modality Matching for Evaluating User Experience of Emerging Mobile EEG Technology.",
            "An Ego-Vision System for Discovering Human Joint Attention.",
            "Statistical Modeling of Visual Attention of Junior and Senior Anesthesiologists During the Induction of General Anesthesia in Real and Simulated Cases.",
            "Development and Validation of a Scenario-Based Drilling Simulator for Training and Evaluating Human Factors.",
            "A Comparative Evaluation of a Virtual Reality Table and a HoloLens-Based Augmented Reality System for Anatomy Training.",
            "The Effect of Room Complexity on Physical Object Selection Performance in 3-D Mobile User Interfaces.",
            "State-of-the-Art Robotic Devices for Wrist Rehabilitation: Design and Control Aspects.",
            "Musculoskeletal Model for Path Generation and Modification of an Ankle Rehabilitation Robot.",
            "Reciprocity and Its Neurological Correlates in Human-Agent Cooperation.",
            "Physiological Synchrony Revealed by Delayed Coincidence Count: Application to a Cooperative Complex Environment.",
            "A Multiviewpoint Outdoor Dataset for Human Action Recognition.",
            "A Smartphone-Based Adaptive Recognition and Real-Time Monitoring System for Human Activities.",
            "Finding a Secure Place: A Map-Based Crowdsourcing System for People With Autism.",
            "Agreement Study Using Gesture Description Analysis.",
            "Human Threshold Model for Perceiving Changes in System Dynamics.",
            "Estimating an LPV Model of Driver Neuromuscular Admittance Using Grip Force as Scheduling Variable.",
            "Hierarchical Eye-Tracking Data Analytics for Human Fatigue Detection at a Traffic Control Center.",
            "A Review of Shared Control for Automated Vehicles: Theory and Applications.",
            "Techniques for Constructing Indoor Navigation Systems for the Visually Impaired: A Review.",
            "An AI-Based Visual Aid With Integrated Reading Assistant for the Completely Blind.",
            "Characteristics of Recovery Motion Resulting From Side Contact With a Physical Assistant Robot Worn During Gait.",
            "Analysis of Driving Patterns and On-Board Feedback-Based Training for Proactive Road Safety Monitoring.",
            "Facial Expression Imitation Method for Humanoid Robot Based on Smooth-Constraint Reversed Mechanical Model (SRMM).",
            "Automated Analysis of the Origin of Movement: An Approach Based on Cooperative Games on Graphs.",
            "Evaluation of a Predictor-Based Framework in High-Speed Teleoperated Military UGVs.",
            "An Empirical Approach to Modeling User-System Interaction Conflicts in Smart Homes.",
            "The HoloLens Augmented Reality System Provides Valid Measures of Gait Performance in Healthy Adults.",
            "Two-Dimensional Fingertip Force Training With Improved Haptic Sensation via Stochastic Resonance.",
            "3-D Interface for the P300 Speller BCI.",
            "Inherent Kinematic Features of Dynamic Bimanual Path Following Tasks.",
            "Organizing Audible Alarm Sounds in the Hospital: A Card-Sorting Study."
        ]
    },
    {
        "name": "IEEE Transactions on Human-Machine Systems",
        "year": "2019",
        "info": "Volume 49: 2019",
        "count": 65,
        "papers": [
            "Dissociation Between Mental Workload, Performance, and Task Awareness in Pilots of High Performance Aircraft.",
            "Influence of Familiarity on the Driving Behavior, Route Risk, and Route Choice of Older Drivers.",
            "Rolling Out the Red (and Green) Carpet: Supporting Driver Decision Making in Automation-to-Manual Transitions.",
            "Control Methods for Internet-Based Teleoperation Systems: A Review.",
            "Use of Automatic Chinese Character Decomposition and Human Gestures for Chinese Calligraphy Robots.",
            "Controlling Object Hand-Over in Human-Robot Collaboration Via Natural Wearable Sensing.",
            "Human Work and Status Evaluation Based on Wearable Sensors in Human Factors and Ergonomics: A Review.",
            "Predicting 3-D Lower Back Joint Load in Lifting: A Deep Pose Estimation Approach.",
            "Multiview-Based 3-D Action Recognition Using Deep Networks.",
            "A Multisensor Multiclassifier Hierarchical Fusion Model Based on Entropy Weight for Human Activity Recognition Using Wearable Inertial Sensors.",
            "Dual-Axis Manual Control: Performance Degradation, Axis Asymmetry, Crossfeed, and Intermittency.",
            "Human Adaptation to Human-Robot Shared Control.",
            "Age and Gender Differences in Performance for Operating a Robotic Manipulator.",
            "Team Coordination and Effectiveness in Human-Autonomy Teaming.",
            "Semantic Place Understanding for Human-Robot Coexistence - Toward Intelligent Workplaces.",
            "Framework for Human Haptic Perception With Delayed Force Feedback.",
            "Co-Design of Musical Haptic Wearables for Electronic Music Performer's Communication.",
            "Using Wearable Sensors to Capture Posture of the Human Lumbar Spine in Competitive Swimming.",
            "Evaluating Fluency in Human-Robot Collaboration.",
            "Modeling Interaction Structure for Robot Imitation Learning of Human Social Behavior.",
            "Politeness Counts: Perceptions of Peacekeeping Robots.",
            "Ecological Interface Design, the Proximity Compatibility Principle, and Automation Reliability in Road Traffic Management.",
            "Predicting Locomotive Crew Performance in Rail Operations with Human and Automation Assistance.",
            "Automatic Lock of Cursor Movement: Implications for an Efficient Eye-Gaze Input Method for Drag and Menu Selection.",
            "Software Architecture for Automating Cognitive Science Eye-Tracking Data Analysis and Object Annotation.",
            "Click Sequence Prediction in Android Mobile Applications.",
            "A Continuous-Time Model-Based Approach for Activity Recognition in Pervasive Environments.",
            "Evaluating Movement Quality Through Intrapersonal Synchronization.",
            "Designing Wearable Systems for Sports: A Review of Trends and Opportunities in Human-Computer Interaction.",
            "A Machine Learning Approach to Predict Human Judgments in Compensatory and Noncompensatory Judgment Tasks.",
            "Human-Centered Reinforcement Learning: A Survey.",
            "Data-Driven Shared Steering Control of Semi-Autonomous Vehicles.",
            "High Cognitive Load Assessment in Drivers Through Wireless Electroencephalography and the Validation of a Modified N-Back Task.",
            "Robotic Leg Illusion: System Design and Human-in-the-Loop Evaluation.",
            "Application of Cognitive Task Performance Modeling for Assessing Usability of Transradial Prostheses.",
            "Expert Surgeons Can Smoothly Control Robotic Tools With a Discrete Control Interface.",
            "Biometric Systems Interaction Assessment: The State of the Art.",
            "Decoding Simultaneous Multi-DOF Wrist Movements From Raw EMG Signals Using a Convolutional Neural Network.",
            "A User-Centered Framework for Designing Midair Gesture Interfaces.",
            "Evaluation of a Wearable Hand Kinesthetic Feedback System for Virtual Reality: Psychophysical and User Experience Evaluation.",
            "Simulation-Based Optimization Methodology for a Manual Material Handling Task Design That Maximizes Productivity While Considering Ergonomic Constraints.",
            "An Astute Assistive Device for Mobility and Object Recognition for Visually Impaired People.",
            "Knee Pain Patient Simulation for Recommendation of Sit-to-Stand Handrail Positions.",
            "Editorial Special Issue on Computational Human Performance Modeling.",
            "Information Constrained Control Analysis of Eye Gaze Distribution Under Workload.",
            "Computational Modeling of the Dynamics of Human Trust During Human-Machine Interactions.",
            "Drivers' Attentional Instability on a Winding Roadway.",
            "Queueing Network Based Driver Model for Varying Levels of Information Processing.",
            "A Formal Approach to Connectibility Affordances.",
            "Formalizing Human-Machine Interactions for Adaptive Automation in Smart Manufacturing.",
            "Operator Strategy Model Development in UAV Hacking Detection.",
            "Interactive Context-Aware Anomaly Detection Guided by User Feedback.",
            "Eye Tracking: A Process-Oriented Method for Inferring Trust in Automation as a Function of Priming and System Reliability.",
            "The Statistical Saliency Model Can Choose Colors for Items on Maps.",
            "A Time-Efficient Approach for Decision-Making Style Recognition in Lane-Changing Behavior.",
            "Electroencephalographic Phase-Amplitude Coupling in Simulated Driving With Varying Modality-Specific Attentional Demand.",
            "Using EEG for Mental Fatigue Assessment: A Comprehensive Look Into the Current State of the Art.",
            "A Context-Supported Deep Learning Framework for Multimodal Brain Imaging Classification.",
            "Exploring Short-Term Training Effects of Ecological Interfaces: A Case Study in Air Traffic Control.",
            "Drilling Into Dashboards: Responding to Computer Recommendation in Fraud Analysis.",
            "An Interface for Verification and Validation of Unmanned Systems Mission Planning: Communicating Mission Objectives and Constraints.",
            "Through the Looking Glass(es): Impacts of Wearable Augmented Reality Displays on Operators in a Safety-Critical System.",
            "Modeling Human Pilot Behavior for Aircraft With a Smart Inceptor.",
            "A Flight Simulator Study of an Energy Control System for Manual Flight.",
            "Effects of Gain and Index of Difficulty on Mouse Movement Time and Fitts' Law."
        ]
    },
    {
        "name": "IEEE Transactions on Human-Machine Systems",
        "year": "2018",
        "info": "Volume 48: 2018",
        "count": 64,
        "papers": [
            "Guest Editorial: Multifaceted Driver-Vehicle Systems: Toward More Effective Driving Simulations, Reliable Driver Modeling, and Increased Trust and Safety.",
            "A Motion Cueing Algorithm With Look-Ahead and Driver Characterization: Application to Vertical Car Dynamics.",
            "Continuous Subjective Rating of Perceived Motion Incongruence During Driving Simulation.",
            "Subjective Evaluation of High-Fidelity Virtual Environments for Driving Simulations.",
            "A Study on Objective Evaluation of Vehicle Steering Comfort Based on Driver's Electromyogram and Movement Trajectory.",
            "Combined EEG-Gyroscope-tDCS Brain Machine Interface System for Early Management of Driver Drowsiness.",
            "Risky Driver Recognition Based on Vehicle Speed Time Series.",
            "Safety Verification Methods for Human-Driven Vehicles at Traffic Intersections: Optimal Driver-Adaptive Supervisory Control.",
            "Driver Trust in Automated Driving Systems: The Case of Overtaking and Passing.",
            "Creating Appropriate Trust in Automated Vehicle Systems: A Framework for HMI Design.",
            "Improvement of Evaluation Indices for Rear-End Collision Risk.",
            "Eye Tracking the Visual Attention of Nurses Interpreting Simulated Vital Signs Scenarios: Mining Metrics to Discriminate Between Performance Level.",
            "Design, Development, and Evaluation of a Noninvasive Autonomous Robot-Mediated Joint Attention Intervention System for Young Children With ASD.",
            "Hand-in-Hand: A Communication-Enhancement Collaborative Virtual Reality System for Promoting Social Interaction in Children With Autism Spectrum Disorders.",
            "Real-Time Assessment of the Cross-Task Mental Workload Using Physiological Measures During Anomaly Detection.",
            "Analysis of Upper-Extremity Motion and Muscle and Brain Activation During Machine Operation in Consideration of Mass and Friction.",
            "Design and Construction of Electronic Aid for Visually Impaired People.",
            "Smart Cable-Driven Camera Robotic Assistant.",
            "Effects of Augmented Reality on the Performance of Teleoperated Industrial Assembly Tasks in a Robotic Embodiment.",
            "A New Dactylology and Interactive System Development for Blind-Computer Interaction.",
            "Sensory-Glove-Based Open Surgery Skill Evaluation.",
            "Force Exertion Affects Grasp Classification Using Force Myography.",
            "A Symbiotic Human-Machine Learning Approach for Production Ramp-up.",
            "Standard Time Estimation of Manual Tasks via Similarity Measure of Unequal Scale Time Series.",
            "Examining Social, Information, and Task Networks in Submarine Command and Control.",
            "Video Analytics for Customer Emotion and Satisfaction at Contact Centers.",
            "Pedestrians' Receptivity Toward Fully Automated Vehicles: Research Review and Roadmap for Future Research.",
            "Modeling Intradriver Steering Variability Based on Sensorimotor Control Theories.",
            "Recognition and Detection of Two-Person Interactive Actions Using Automatically Selected Skeleton Features.",
            "The Mobile Pass Project: A User Interaction Evaluation.",
            "Influence of Information Layout on Diagnosis Performance.",
            "Understanding Human Response to the Presence and Actions of Unmanned Ground Vehicle Systems in Field Environment.",
            "A Survey on Unmanned Aerial Vehicle Remote Control Using Brain-Computer Interface.",
            "Human-Centered Transparency of Grasping via a Robot-Assisted Minimally Invasive Surgery System.",
            "Modeling Human Difference Threshold in Perceiving Mechanical Properties From Force.",
            "Evaluation of Artificial Mouths in Social Robots.",
            "IoT-Enabled Adaptive Context-Aware and Playful Cyber-Physical System for Everyday Energy Savings.",
            "A Novel Three-Dimensional P300 Speller Based on Stereo Visual Stimuli.",
            "Effects of Image Presentation Highlighting and Accuracy on Target Category Learning.",
            "Efficacy of Group-View Displays in Nuclear Control Rooms.",
            "Editorial Golden Jubilee Anniversary Issue of IEEE Transactions on Human-Machine Systems.",
            "Ironies of Automation: Still Unresolved After All These Years.",
            "A Survey of Workload Assessment Algorithms.",
            "The Underpinnings of Workload in Unmanned Vehicle Systems.",
            "Manual Control Cybernetics: State-of-the-Art and Current Trends.",
            "Effects of Preview Time in Manual Tracking Tasks.",
            "Effects of Linear Perspective on Human Use of Preview in Manual Control.",
            "A Topology of Shared Control Systems - Finding Common Ground in Diversity.",
            "Visual Sampling Processes Revisited: Replicating and Extending Senders (1983) Using Modern Eye-Tracking Equipment.",
            "Ecological Interface Design for Vehicle Locomotion Control.",
            "Analysis of User Network and Correlation for Community Discovery Based on Topic-Aware Similarity and Behavioral Influence.",
            "Driver Behavior Characteristics Identification Strategies Based on Bionic Intelligent Algorithms.",
            "The Effects of Lead Time of Take-Over Request and Nondriving Tasks on Taking-Over Control of Automated Vehicles.",
            "Using Driver Control Models to Understand and Evaluate Behavioral Validity of Driving Simulators.",
            "Evaluation of a Visual-Tactile Multimodal Display for Surface Obstacle Avoidance During Walking.",
            "Testing a Shape-Changing Haptic Navigation Device With Vision-Impaired and Sighted Audiences in an Immersive Theater Setting.",
            "Projection-Based AR: Effective Visual Feedback in Gait Rehabilitation.",
            "Learning Complex Spatio-Temporal Configurations of Body Joints for Online Activity Recognition.",
            "Force Myography Based Novel Strategy for Locomotion Classification.",
            "Effects of Continuous Auditory Feedback on Drawing Trajectory-Based Finger Gestures.",
            "Photosensor Oculography: Survey and Parametric Analysis of Designs Using Model-Based Simulation.",
            "Negotiating Corners With Teleoperated Mobile Robots With Time Delay.",
            "Calibrating Adaptable Automation to Individuals.",
            "Does Predictability Play a Role in Task Management? An Experimental Study With a Financial Trading Simulation."
        ]
    },
    {
        "name": "IEEE Transactions on Human-Machine Systems",
        "year": "2017",
        "info": "Volume 47: 2017",
        "count": 104,
        "papers": [
            "Guest Editorial Special Issue on Wearable and Ego-Vision Systems for Augmented Experience.",
            "Recognizing Personal Locations From Egocentric Videos.",
            "Accelerated Visual Context Classification on a Low-Power Smartwatch.",
            "Autonomous Fall Detection With Wearable Cameras by Using Relative Entropy Distance Measure.",
            "Online Cross-Modal Adaptation for Audio-Visual Person Identification With Wearable Cameras.",
            "A Kinect-Based Wearable Face Recognition System to Aid Visually Impaired Users.",
            "Summarization of Egocentric Videos: A Comprehensive Survey.",
            "Toward Storytelling From Visual Lifelogging: An Overview.",
            "Force-Velocity Assessment of Caress-Like Stimuli Through the Electrodermal Activity Processing: Advantages of a Convex Optimization Approach.",
            "Effects of Visual Feedback on Out-of-Body Illusory Tactile Sensation When Interacting With Augmented Virtual Objects.",
            "Metaphoric Hand Gestures for Orientation-Aware VR Object Manipulation With an Egocentric Viewpoint.",
            "TunnelSlice: Freehand Subspace Acquisition Using an Egocentric Tunnel for Wearable Augmented Reality.",
            "Augmented-Reality-Based Indoor Navigation: A Comparative Analysis of Handheld Devices Versus Google Glass.",
            "Using Semantics to Automatically Generate Speech Interfaces for Wearable Virtual and Augmented Reality Applications.",
            "Guest Editorial Special Issue on Drawing and Handwriting Processing for User-Centered Systems.",
            "Signature Verification Based on the Kinematic Theory of Rapid Human Movements.",
            "A User-Centered Segmentation Method for Complex Historical Manuscripts Based on Document Graphs.",
            "SketchSeeker: Finding Similar Sketches.",
            "Recognition of Paper-Based Conceptual Models Captured Under Uncontrolled Conditions.",
            "Synthetic Word Gesture Generation for Stroke-Based Virtual Keyboards.",
            "Identification and Rating of Developmental Dysgraphia by Handwriting Analysis.",
            "The Influence of the Spatio-Temporal Terzi Treatment on the Kinematics of Cursive Writing of Dysgraphic Subjects.",
            "Combining Speech and Handwriting Modalities for Mathematical Expression Recognition.",
            "EMOTHAW: A Novel Database for Emotional State Recognition From Handwriting and Drawing.",
            "End-to-End Online Writer Identification With Recurrent Neural Network.",
            "Identifying Developmental Dysgraphia Characteristics Utilizing Handwriting Classification Methods.",
            "Handwriting Movement Sonification: Why and How?",
            "Guest EditorialSpecial Issue on Situation, Activity, and Goal Awareness in Cyber-Physical Human-Machine Systems.",
            "A Feature-Based Knowledge Transfer Framework for Cross-Environment Activity Recognition Toward Smart Home Applications.",
            "Information Model and Architecture Specification for Context Awareness Interaction Decision Support in Cyber-Physical Human-Machine Systems.",
            "Accurate and Reliable Human Localization Using Composite Particle/FIR Filtering.",
            "A Human-Centered Activity Tracking System: Toward a Healthier Workplace.",
            "User Recognition From Social Behavior in Computer-Mediated Social Context.",
            "From Activity Recognition to Intention Recognition for Assisted Living Within Smart Homes.",
            "Fine-Grained Urban Event Detection and Characterization Based on Tensor Cofactorization.",
            "ActiveCrowd: A Framework for Optimized Multitask Allocation in Mobile Crowdsensing Systems.",
            "Continuous Authentication With Touch Behavioral Biometrics and Voice on Wearable Glasses.",
            "Mining Skier Transportation Patterns From Ski Resort Lift Usage Data.",
            "Effect of Robot Performance on Human-Robot Trust in Time-Critical Situations.",
            "Implicit Intention Communication in Human-Robot Interaction Through Visual Behavior Studies.",
            "Neuromuscular-System-Based Tuning of a Haptic Shared Control Interface for UAV Teleoperation.",
            "Cooperative Navigation for Mixed Human-Robot Teams Using Haptic Feedback.",
            "An Unobtrusive Measurement Method for Assessing Physiological Response in Physical Human-Robot Interaction.",
            "A Comprehensive Review of Smart Wheelchairs: Past, Present, and Future.",
            "SmartPowerchair: Characterization and Usability of a Pervasive System of Systems.",
            "Depth-Projection-Map-Based Bag of Contour Fragments for Robust Hand Gesture Recognition.",
            "An Ego-Vision System for Hand Grasp Analysis.",
            "Nonlinear Dynamic Classification of Momentary Mental Workload Using Physiological Features and NARX-Model-Based Least-Squares Support Vector Machines.",
            "Online and Offline Domain Adaptation for Reducing BCI Calibration Effort.",
            "Toward an Enhanced Human-Machine Interface for Upper-Limb Prosthesis Control With Combined EMG and NIRS Signals.",
            "Myoelectric Pattern Recognition Based on Muscle Synergies for Simultaneous Control of Dexterous Finger Movements.",
            "Humans Can Integrate Augmented Reality Feedback in Their Sensorimotor Control of a Robotic Hand.",
            "Assistive Pointing Device Based on a Head-Mounted Camera.",
            "Deep Models for Engagement Assessment With Scarce Label Information.",
            "Guest EditorialHolistic Approaches for Human-Vehicle Systems: Combining Models, Interactions, and Control.",
            "A Stochastic Driver Pedal Behavior Model Incorporating Road Information.",
            "A Personalizable Driver Steering Model Capable of Predicting Driver Behaviors in Vehicle Collision Avoidance Maneuvers.",
            "Wearable Mobile-Based Emotional Response-Monitoring System for Drivers.",
            "Driving Style Classification Using a Semisupervised Support Vector Machine.",
            "Encouraging Eco-Driving With Visual, Auditory, and Vibrotactile Stimuli.",
            "Application of Open-Loop Stackelberg Equilibrium to Modeling a Driver's Interaction with Vehicle Active Steering Control in Obstacle Avoidance.",
            "Nonlinear Driver Parameter Estimation and Driver Steering Behavior Analysis for ADAS Using Field Test Data.",
            "Modeling, Identification, and Predictive Control of a Driver Steering Assistance System.",
            "Cooperative Shared Control Driver Assistance Systems Based on Motion Primitives and Differential Games.",
            "Shared-Control for a Rear-Wheel Drive Car: Dynamic Environments and Disturbance Rejection.",
            "Takeover Requests in Simulated Partially Autonomous Vehicles Considering Human Factors.",
            "The Effect of a Haptic Guidance Steering System on Fatigue-Related Driver Behavior.",
            "Fusion of Random Walk and Discrete Fourier Spectrum Methods for Gait Recognition.",
            "Efficient Human Motion Retrieval via Temporal Adjacent Bag of Words and Discriminative Neighborhood Preserving Dictionary Learning.",
            "Simulation Modeling and Ergonomic Assessment of Complex Multiworker Physical Processes.",
            "Qualitative Action Recognition by Wireless Radio Signals in Human-Machine Systems.",
            "A System to Analyze Group Socializing Behaviors in Social Parties.",
            "Situation Awareness Inferred From Posture Transition and Location: Derived From Smartphone and Smart home Sensors.",
            "A Formal Machine-Learning Approach to Generating Human-Machine Interfaces From Task Models.",
            "Verification of User Interface Software: The Example of Use-Related Safety Requirements and Programmable Medical Devices.",
            "Web Design Attributes in Building User Trust, Satisfaction, and Loyalty for a High Uncertainty Avoidance Culture.",
            "Smart Enough for the Web? A Responsive Web Design Approach to Enhancing the User Web Browsing Experience on Smart TVs.",
            "GenealogyVis: A System for Visual Analysis of Multidimensional Genealogical Data.",
            "The Effects of Data Density, Display Organization, and Stress on Search Performance: An Eye Tracking Study of Clutter.",
            "Using Eye Tracking to Detect the Effects of Clutter on Visual Search in Real Time.",
            "CAPFF: A Context-Aware Assistant for Paper Form Filling.",
            "Scaling to Massiveness With ANALYSE: A Learning Analytics Tool for Open edX.",
            "Interaction of Automation Visibility and Information Quality in Flight Deck Information Automation.",
            "Simulation-Based Evaluation of Adaptive Automation Revoking Strategies on Cognitive Workload and Situation Awareness.",
            "Heuristic Information Acquisition and Restriction Rules for Decision Support.",
            "A LAMSTAR Network-Based Human Judgment Analysis.",
            "On the Usability of Electroencephalographic Signals for Biometric Recognition: A Survey.",
            "Dynamic Texture Comparison Using Derivative Sparse Representation: Application to Video-Based Face Recognition.",
            "A Framework for Biometric and Interaction Performance Assessment of Automated Border Control Processes.",
            "A Closer Look at Pure-Text Human-Interaction Proofs.",
            "CrowdOLR: Toward Object Location Recognition With Crowdsourced Fingerprints Using Smartphones.",
            "Sherlock: Experimental Evaluation of a Conversational Agent for Mobile Information Tasks.",
            "Mobile Three-Dimensional Maps for Wayfinding in Large and Complex Buildings: Empirical Comparison of First-Person Versus Third-Person Perspective.",
            "A New Framework for Cognitive Mobility of Visually Impaired Users in Using Tactile Device.",
            "Framework of Multiuser Satisfaction for Assessing Interaction Models Within Collaborative Virtual Environments.",
            "GESTO: A Glove for Enhanced Sensing and Touching Based on Inertial and Magnetic Sensors for Hand Tracking and Cutaneous Feedback.",
            "Vision-Based Mid-Air Unistroke Character Input Using Polar Signatures.",
            "Modified Nonnegative Matrix Factorization Using the Hadamard Product to Estimate Real-Time Continuous Finger-Motion Intentions.",
            "Handwriting on Smartwatches: An Empirical Investigation.",
            "ISR-AIWALKER: Robotic Walker for Intuitive and Safe Mobility Assistance and Gait Analysis.",
            "A Biomimetical Dynamic Window Approach to Navigation for Collaborative Control.",
            "Review on Design and Control Aspects of Robotic Shoulder Rehabilitation Orthoses.",
            "Usability Comparison of Conventional Direct Control Versus Pattern Recognition Control of Transradial Prostheses.",
            "Unpowered Sensorimotor-Enhancing Suit Reduces Muscle Activation and Improves Force Perception."
        ]
    },
    {
        "name": "IEEE Transactions on Human-Machine Systems",
        "year": "2016",
        "info": "Volume 46: 2016",
        "count": 85,
        "papers": [
            "Editorial IEEE Transactions on Human-Machine Systems: Year in Review for 2015.",
            "Human Interaction With Robot Swarms: A Survey.",
            "\"Teach Me-Show Me\" - End-User Personalization of a Smart Home and Companion Robot.",
            "Strategic Conformance: Overcoming Acceptance Issues of Decision Aiding Automation?",
            "A Formal Task-Analytic Approach to Medical Device Alarm Troubleshooting Instructions.",
            "The GRASP Taxonomy of Human Grasp Types.",
            "A Novel Rubber Hand Illusion Paradigm Allowing Active Self-Touch With Variable Force Feedback Controlled by a Haptic Device.",
            "Exploration of Location-Aware You-Are-Here Maps on a Pin-Matrix Display.",
            "Toward Personalized Activity Recognition Systems With a Semipopulation Approach.",
            "Automated Laughter Detection From Full-Body Movements.",
            "Integration of Visual Temporal Information and Textual Distribution Information for News Web Video Event Mining.",
            "Strategy Shifting With Multisensorial Cueing: Theoretical Capability of Multitasking Throughput.",
            "SteganoPIN: Two-Faced Human-Machine Interface for Practical Enforcement of PIN Entry Security.",
            "Personalized Travel Package With Multi-Point-of-Interest Recommendation Based on Crowdsourced User Footprints.",
            "A Progression and Retrogression Mathematical Model for the Motor Learning Process.",
            "Guest Editorial Special Issue on Systematic Approaches to Human-Machine Interface: Improving Resilience, Robustness, and Stability.",
            "Using Model Checking to Detect Simultaneous Masking in Medical Alarms.",
            "Toward Reliable Autonomous Robotic Assistants Through Formal Verification: A Case Study.",
            "Improved EGT-Based Robustness Analysis of Negotiation Strategies in Multiagent Systems via Model Checking.",
            "A Systems Analysis of the Introduction of Unmanned Aircraft Into Aircraft Carrier Operations.",
            "Learning Mitigations for Pilot Issues When Landing Aircraft (via Multiobjective Optimization and Multiagent Simulations).",
            "Biometric-Enabled Authentication Machines: A Survey of Open-Set Real-World Applications.",
            "Task Model-Based Systematic Analysis of Both System Failures and Human Errors.",
            "Expertise Level, Control Strategies, and Robustness in Future Air Traffic Control Decision Aiding.",
            "Automatic Detection of Potential Automation Surprises for ADEPT Models.",
            "An Observer/Predictor-Based Model of the User for Attaining Situation Awareness.",
            "A Human Operator Model for Medical Device Interaction Using Behavior-Based Hybrid Automata.",
            "Formal Verification of a Space System's User Interface With the IVY Workbench.",
            "A Bisimulation-Based Design of User Interface With Alerts Avoiding Automation Surprises.",
            "Movement Primitive Segmentation for Human Motion Modeling: A Framework for Analysis.",
            "Hierarchical Sample-Based Joint Probabilistic Data Association Filter for Following Human Legs Using a Mobile Robot in a Cluttered Environment.",
            "A Multisensor Technique for Gesture Recognition Through Intelligent Skeletal Pose Analysis.",
            "Applying Fuzzy Linear Regression to Understand Metacognitive Judgments in a Human-in-the-Loop Simulation Environment.",
            "Textual Affect Communication and Evocation Using Abstract Generative Visuals.",
            "PassBYOP: Bring Your Own Picture for Securing Graphical Passwords.",
            "MobiGroup: Enabling Lifecycle Support to Social Activity Organization and Suggestion With Mobile Crowd Sensing.",
            "Air-Writing Recognition - Part I: Modeling and Recognition of Characters, Words, and Connecting Motions.",
            "Gaze Estimation From Color Image Based on the Eye Model With Known Head Pose.",
            "Using Wireless EEG Signals to Assess Memory Workload in the n-Back Task.",
            "Air-Writing Recognition - Part II: Detection and Recognition of Writing Activity in Continuous Stream of Motion Data.",
            "Crossmodal Matching: A Critical but Neglected Step in Multimodal Research.",
            "Investigating Redundant Encoding Methods for Tactile Messaging in Multitask Scenarios.",
            "User-Centered and Analytic-Based Approaches to Generate Usable Gestures for Individuals With Quadriplegia.",
            "An Open Voice Command Interface Kit.",
            "Leveraging Pattern Recognition Consistency Estimation for Crowdsourcing Data Analysis.",
            "Online Classification and Sensor Selection Optimization With Applications to Human Material Handling Tasks Using Wearable Sensing Technologies.",
            "Action Recognition From Depth Maps Using Deep Convolutional Neural Networks.",
            "Iterative Learning From Novice Human Demonstrations for Output Tracking.",
            "Frenet Frame-Based Generalized Space Curve Representation for Pose-Invariant Classification and Recognition of 3-D Face.",
            "Expert-Driven Perceptual Features for Modeling Style and Affect in Human Motion.",
            "Eye-Gaze Tracking Analysis of Driver Behavior While Interacting With Navigation Systems in an Urban Area.",
            "Optimal Human-Machine Teaming for a Sequential Inspection Operation.",
            "Roadmap for the Development of at-Home Telemonitoring Systems to Augment Occupational Therapy.",
            "Predictive Communication Quality Control in Haptic Teleoperation With Time Delay and Packet Loss.",
            "Multiclass Steady-State Visual Evoked Potential Frequency Evaluation Using Chirp-Modulated Stimuli.",
            "A Multimodal Gaze-Controlled Virtual Keyboard.",
            "Graphical Password-Based User Authentication With Free-Form Doodles.",
            "Exploring Latent Preferences for Context-Aware Personalized Recommendation Systems.",
            "Improving Team's Consistency of Understanding in Meetings.",
            "A Patient-Specific Model for Predicting Tibia Soft Tissue Insertions From Bony Outlines Using a Spatial Structure Supervised Learning Framework.",
            "Smoothness of Surgical Tool Tip Motion Correlates to Skill in Endovascular Tasks.",
            "Driver Assistance System With a Dual Control Scheme: Effectiveness of Identifying Driver Drowsiness and Preventing Lane Departure Accidents.",
            "Evaluation of Haptic and Visual Cues for Repulsive or Attractive Guidance in Nonholonomic Steering Tasks.",
            "Combined Use of Rear Touch Gestures and Facial Feature Detection to Achieve Single-Handed Navigation of Mobile Devices.",
            "Human Mobility Modeling for Robot-Assisted Evacuation in Complex Indoor Environments.",
            "Behavior Hierarchy-Based Affordance Map for Recognition of Human Intention and Its Application to Human-Robot Interaction.",
            "Human-Like Rewards to Train a Reinforcement Learning Controller for Planar Arm Movement.",
            "MouseIdentity: Modeling Mouse-Interaction Behavior for a User Verification System.",
            "A Usability Study of a Critical Man-Machine Interface: Can Layperson Responders Perform Optimal Compression Rates When Using a Public Access Defibrillator with Automated Real-Time Feedback During Cardiopulmonary Resuscitation?",
            "RELIVE: A Markerless Assistant for CPR Training.",
            "iLeg - A Lower Limb Rehabilitation Robot: A Proof of Concept.",
            "Badminton Stroke Recognition Based on Body Sensor Networks.",
            "Optimized Bi-Objective EEG Channel Selection and Cross-Subject Generalization With Brain-Computer Interfaces.",
            "Palmprint Recognition Using Neighboring Direction Indicator.",
            "Partial Data Ear Recognition From One Sample per Person.",
            "Automatic Facial Expression Learning Method Based on Humanoid Robot XIN-REN.",
            "Real-Time Human Foot Motion Localization Algorithm With Dynamic Speed.",
            "Interactive Teleoperation of a Mobile Manipulator Using a Shared-Control Approach.",
            "A Predictive Model for Use of an Assistive Robotic Manipulator: Human Factors Versus Performance in Pick-and-Place/Retrieval Tasks.",
            "Human Velocity Control of Admittance-Type Robotic Devices With Scaled Visual Feedback of Device Motion.",
            "Motion Guidance for a Passive Robot Walking Helper via User's Applied Hand Forces.",
            "Discrete Event Simulation and Virtual Reality Use in Industry: New Opportunities and Future Trends.",
            "Supporting Operators in Process Control Tasks - Benefits of Interactive 3-D Visualization.",
            "Coupled Topic Model for Collaborative Filtering With User-Generated Content.",
            "Adjusting Haptic Guidance to Idiosyncratic Visuo-Haptic Matching Errors Improves Perceptual Consistency in Reaching."
        ]
    },
    {
        "name": "IEEE Transactions on Human-Machine Systems",
        "year": "2015",
        "info": "Volume 45: 2015",
        "count": 77,
        "papers": [
            "An Eye Movement Analysis Algorithm for a Multielement Target Tracking Task: Maximum Transition-Based Agglomerative Hierarchical Clustering.",
            "Game-Theoretic Modeling of the Steering Interaction Between a Human Driver and a Vehicle Collision Avoidance Controller.",
            "Integrating Human Behavior Modeling and Data Mining Techniques to Predict Human Errors in Numerical Typing.",
            "Improving Human Action Recognition Using Fusion of Depth Camera and Inertial Sensors.",
            "Two Large Open-Access Datasets for Fitts' Law of Human Motion and a Succinct Derivation of the Square-Root Variant.",
            "Hand and Wrist Movement Control of Myoelectric Prosthesis Based on Synergy.",
            "Improving Web Navigation Usability by Comparing Actual and Anticipated Usage.",
            "Intelligent Fashion Recommender System: Fuzzy Logic in Personalized Garment Design.",
            "Proof of Concept for Robot-Aided Upper Limb Rehabilitation Using Disturbance Observers.",
            "The Validity and Reliability of a Hybrid Reality Simulator for Wire Navigation in Orthopedic Surgery.",
            "SmartMood: Toward Pervasive Mood Tracking and Analysis for Manic Episode Detection.",
            "Score-Level Multibiometric Fusion Based on Dempster-Shafer Theory Incorporating Uncertainty Factors.",
            "Ecological Interface Design Two Decades On: Whatever Happened to the SRK Taxonomy?",
            "Beyond Ecological Interface Design: Lessons From Concerns and Misconceptions.",
            "Combining Decision-Making Theories With a Cognitive Theory for Intelligent Help: A Comparison.",
            "Path-Constrained Motion Analysis: An Algorithm to Understand Human Performance on Hydraulic Manipulators.",
            "Recognition of Mental Workload Levels Under Complex Human-Machine Collaboration by Using Physiological Features and Adaptive Support Vector Machines.",
            "Conflict Detection Scheme Based on Formal Rule Model for Smart Building Systems.",
            "Changes in Usage of an Indoor Public Space: Analysis of One Year of Person Tracking.",
            "Robust Framework of Single-Frame Face Superresolution Across Head Pose, Facial Expression, and Illumination Variations.",
            "Evaluation of an \"On-Thigh\" Vibrotactile Collision Avoidance Alerting Component in a Simulated Flight Mission.",
            "Usability Guidelines for the Design of Robot Teleoperation: A Taxonomy.",
            "GyroPen: Gyroscopes for Pen-Input With Mobile Phones.",
            "Unlocking the Complexity of Port Data With Visualization.",
            "Correction to: \"Using Smart-Phones and Floor Plans for Indoor Location Tracking\".",
            "Robotic Dance in Social Robotics - A Taxonomy.",
            "Selective Review and Analysis of Aging Effects in Biometric System Implementation.",
            "Improved Gender Classification Using Nonpathological Gait Kinematics in Full-Motion Video.",
            "Class-Specific Reference Discriminant Analysis With Application in Human Behavior Analysis.",
            "A Methodology for Extracting Standing Human Bodies From Single Images.",
            "Text and User Generic Model for Writer Verification Using Combined Pen Pressure Information From Ink Intensity and Indented Writing on Paper.",
            "A Formal Transparency Framework for Validation of Real-Time Discrete-Event Control Requirements Modeled by Timed Transition Graphs.",
            "ExtendedThumb: A Target Acquisition Approach for One-Handed Interaction With Touch-Screen Mobile Phones.",
            "A Rapid Screening and Testing Protocol for Keyboard Layout Speed Comparison.",
            "Bezier Interpolation for 3-D Freehand Ultrasound.",
            "Vibrotactile Stimulation to Increase and Decrease Texture Roughness.",
            "Being Aware of the World: Toward Using Social Media to Support the Blind With Navigation.",
            "Automatic Interpretation of Affective Facial Expressions in the Context of Interpersonal Interaction.",
            "Eye Gaze Tracking With a Web Camera in a Desktop Environment.",
            "Targeted-Tracking With Pointing Devices.",
            "Wi-Counter: Smartphone-Based People Counter Using Crowdsourced Wi-Fi Signal Data.",
            "Binary Data Embedding Framework for Multiclass Classification.",
            "Dysphagia Screening: Contributions of Cervical Auscultation Signals and Modern Signal-Processing Techniques.",
            "Comprehension and Learning of Social Goals Through Visualization.",
            "Data-Driven Modeling of the Airport Configuration Selection Process.",
            "Application of Evolving Self-Organizing Maps for Analysis of Human Adverse Events in the Context of Complex Socioeconomic Infrastructure Interactions.",
            "Blended Emotion Detection for Decision Support.",
            "Zero-Shot Object Recognition System Based on Topic Model.",
            "Glove-Based Continuous Arabic Sign Language Recognition in User-Dependent Mode.",
            "HTML5 Technologies for Effective Cross-Platform Interactive/Smart TV Advertising.",
            "Guest Editorial Special Issue on Ambient-Assisted Living: Sensors, Methods, and Applications.",
            "Multiperson Locating and Their Soft Tracking in a Binary Infrared Sensor Network.",
            "Activity Sequence-Based Indoor Pedestrian Localization Using Smartphones.",
            "Automated Detection of Activity Transitions for Prompting.",
            "Human Activity Recognition Process Using 3-D Posture Data.",
            "Fuzzy Temporal Segmentation and Probabilistic Recognition of Continuous Human Daily Activities.",
            "Automatic Generation of Tailored Accessible User Interfaces for Ubiquitous Services.",
            "Situation-Based Assess Tree for User Behavior Assessment in Persuasive Telehealth.",
            "An Assistive Navigation Framework for the Visually Impaired.",
            "A Haptic Solution to Assist Visually Impaired in Mobility Tasks.",
            "Comparison of Interaction Modalities for Mobile Indoor Robot Guidance: Direct Physical Interaction, Person Following, and Pointing Control.",
            "Supporting Human-Robot Interaction Based on the Level of Visual Focus of Attention.",
            "Petri-Net-Based Modeling of Human Operator's Planning for the Evaluation of Task Performance Using the Example of Air Traffic Control.",
            "Accuracy and Effort of Decision-Making Strategies With Incomplete Information: Implications for Decision Support System Design.",
            "Investigating Performance of Command Team Structures in the NATO Problem-Approach Space.",
            "Tactor-Induced Skin Stretch as a Sensory Substitution Method in Teleoperated Palpation.",
            "Introducing the Edges Paradigm: A P300 Brain-Computer Interface for Spelling Written Words.",
            "Thresholds of Vision of the Human Visual System: Visual Adaptation for Monocular and Binocular Vision.",
            "Appearance-Based Gaze Estimation With Online Calibration From Mouse Operations.",
            "Score-Level Fusion of Face and Voice Using Particle Swarm Optimization and Belief Functions.",
            "Effect of Pooled Comparative Information on Judgments of Quality.",
            "UOIT Keyboard: A Constructive Keyboard for Small Touchscreen Devices.",
            "Structure of Hand/Mouse Movements.",
            "Robust Biometric Recognition From Palm Depth Images for Gloved Hands.",
            "Multidomain Verification of Dynamic Signatures Using Local Stability Analysis.",
            "Supporting Serendipitous Social Interaction Using Human Mobility Prediction.",
            "Managing Wandering Risk in People With Dementia."
        ]
    },
    {
        "name": "IEEE Transactions on Human-Machine Systems",
        "year": "2014",
        "info": "Volume 44: 2014",
        "count": 70,
        "papers": [
            "Editorial: IEEE Transactions on Human-Machine Systems: Year in Review for 2013.",
            "Human-Agent Teaming for Multirobot Control: A Review of Human Factors Issues.",
            "Dynamic Operator Overload: A Model for Predicting Workload During Supervisory Control.",
            "A Gesture Learning Interface for Simulated Robot Path Shaping With a Human Teacher.",
            "Supporting Air Versus Ground Vehicle Decisions for Interfacility Medical Transport Using Historical Data.",
            "Driving Assistance by Deictic Control for a Smart Wheelchair: The Assessment Issue.",
            "Enhancing Memory Recall via an Intelligent Social Contact Management System.",
            "An Ontology-Based Hybrid Approach to Activity Modeling for Smart Homes.",
            "Increasing Crane Payload Swing by Shaping Human Operator Commands.",
            "Energy Efficient Collaborative Sensing-Based Design: Soft Keyboard Case Study.",
            "Identifying Successful Motor Task Completion via Motion-Based Performance Metrics.",
            "ATD: A Multiplatform for Semiautomatic 3-D Detection of Kidneys and Their Pathology in Real Time.",
            "Designing and Evaluating a Social Gaze-Control System for a Humanoid Robot.",
            "Who is Interacting With me? Identification of an Interacting Person Through Playful Interaction With a Small Robot.",
            "PeMMAS: A Tool for Studying the Performance of Multiagent Systems Developed in JADE.",
            "Experimental Performance Analysis of a Homotopy-Based Shared Autonomy Framework.",
            "Effects of Multivantage Point Systems on the Teleoperation of Spacecraft Docking.",
            "Using Smart-Phones and Floor Plans for Indoor Location Tracking.",
            "Wearable Audio Monitoring: Content-Based Processing Methodology and Implementation.",
            "Assistive Clothing Pattern Recognition for Visually Impaired People.",
            "Mitigating Behavioral Variability for Mouse Dynamics: A Dimensionality-Reduction-Based Approach.",
            "Online Segmentation and Classification of Manipulation Actions From the Observation of Kinetostatic Data.",
            "Merging Neuroimaging and Multimedia: Methods, Opportunities, and Challenges.",
            "An Essay on the Origin of Software Evolution.",
            "Modular Simulation-Based Physical and Emotional Assessment of Ambient Intelligence in Traffic.",
            "A Hand Gesture Recognition Framework and Wearable Gesture-Based Interaction Prototype for Mobile Devices.",
            "PhoneLens: A Low-Cost, Spatially Aware, Mobile-Interaction Device.",
            "Linking Team Composition to Team Performance: An Application to Postdisaster Debris Removal Operations.",
            "Formal Detection of Attentional Tunneling in Human Operator-Automation Interactions.",
            "Application of Adaptive Controllers in Teleoperation Systems: A Survey.",
            "Task Versus Vehicle-Based Control Paradigms in Multiple Unmanned Vehicle Supervision by a Single Operator.",
            "Programming Robots to Express Emotions: Interaction Paradigms, Communication Modalities, and Context.",
            "Evaluation of Proxemic Scaling Functions for Social Robotics.",
            "Regression-Based Facial Expression Optimization.",
            "Software, Hardware, and Procedure Reliability by Testing and Verification: Evidence of Learning Trends.",
            "A Novel Methodology for Assessing the Fall Risk Using Low-Cost and Off-the-Shelf Devices.",
            "A Decision Support Tool for the Pushback Rate Control of Airport Departures.",
            "Recoil Measurement, Mitigation Techniques, and Effects on Small Arms Weapon Design and Marksmanship Performance.",
            "Cognitive Workload and Learning Assessment During the Implementation of a Next-Generation Air Traffic Control Technology Using Functional Near-Infrared Spectroscopy.",
            "Modeling Teamwork in Supervisory Control of Multiple Robots.",
            "Affective Movement Recognition Based on Generative and Discriminative Stochastic Dynamic Models.",
            "Prospect-Theoretic Modeling of Customer Affective-Cognitive Decisions Under Uncertainty for User Experience Design.",
            "Improved Active Handrest Performance Through Use of Virtual Fixtures.",
            "Novice and Expert Performance of KeyScretch: A Gesture-Based Text Entry Method for Touch-Screens.",
            "To What Extent do the Findings of Laboratory-Based Spatial Attention Research Apply to the Real-World Setting of Driving?",
            "Estimating 3-D Point-of-Regard in a Real Environment Using a Head-Mounted Eye-Tracking System.",
            "Power-Aware Activity Monitoring Using Distributed Wearable Sensors.",
            "Biosignals Sensing by Novel Use of Bidirectional Microphones in a Mobile Phone for Ubiquitous Healthcare Monitoring.",
            "Image-Based and Sensor-Based Approaches to Arabic Sign Language Recognition.",
            "Correction to \"Wearable Audio Monitoring: Content-Based Processing Methodology and Implementation\".",
            "Correction to \"Recoil Measurement, Mitigation Techniques and Effects on Small Arms Weapon Design and Marksmanship Performance\".",
            "Automatically Generating Specification Properties From Task Models for the Formal Verification of Human-Automation Interaction.",
            "Example of a Complementary Use of Model Checking and Human Performance Simulation.",
            "Contributing Factor Map: A Taxonomy of Influences on Human Performance and Health in Space.",
            "Anticipation in Driving: The Role of Experience in the Efficacy of Pre-event Conflict Cues.",
            "Shared Experiences of Technology and Trust: An Experimental Study of Physiological Compliance Between Active and Passive Users in Technology-Mediated Collaborative Encounters.",
            "Multiparty Interaction Understanding Using Smart Multimodal Digital Signage.",
            "Measuring Algebraic Complexity of Text Understanding Based on Human Concept Learning.",
            "Human Action Recognition With Video Data: Research and Evaluation Challenges.",
            "Integrating Radio Imaging With Gene Expressions Toward a Personalized Management of Cancer.",
            "Application of Fuzzy Inference Rules to Early Semi-automatic Estimation of Activity Duration in Software Project Management.",
            "Improving Smart Conference Participation Through Socially Aware Recommendation.",
            "Recent Advances on Singlemodal and Multimodal Face Recognition: A Survey.",
            "EEG Analysis for Olfactory Perceptual-Ability Measurement Using a Recurrent Neural Classifier.",
            "Augmentation Of Stiffness Perception With a 1-Degree-of-Freedom Skin Stretch Device.",
            "Human Movement Modeling and Activity Perception Based on Fiber-Optic Sensing System.",
            "Traffic Displays for Visual Flight Indicating Track and Priority Cues.",
            "Evaluation of Head Gaze Loosely Synchronized With Real-Time Synthetic Speech for Social Robots.",
            "Social Cognitive and Affective Neuroscience in Human-Machine Systems: A Roadmap for Improving Training, Human-Robot Interaction, and Team Performance.",
            "The Impact of Human-Robot Interface Design on the Use of a Learning Robot System."
        ]
    },
    {
        "name": "IEEE Transactions on Human-Machine Systems",
        "year": "2013",
        "info": "Volume 43: 2013",
        "count": 57,
        "papers": [
            "Editorial: IEEE Systems, Man, and Cybernetics Society's Continuing Legacy in Human - Machine Systems.",
            "Enhancing Driver Car-Following Performance with a Distance and Acceleration Display.",
            "Characterizing Driver Intention via Hierarchical Perception-Action Modeling.",
            "Mapping and Analysis of Human Guidance Performance From Trajectory Ensembles.",
            "Improving Manual Tracking of Systems With Oscillatory Dynamics.",
            "On the Human-Machine Interaction of Unmanned Aerial System Mission Specialists.",
            "Emotional State Classification in Patient-Robot Interaction Using Wavelet Analysis and Statistics-Based Feature Selection.",
            "The Development and Evaluation of an Eyes-Free Interaction Model for Mobile Reading Devices.",
            "Supporting Virtual Collaboration in Spatial Design Tasks: Are Surrogate or Natural Gestures More Effective?",
            "Perception of Springs With Visual and Proprioceptive Motion Cues: Implications for Prosthetics.",
            "Enabling Effective Programming and Flexible Management of Efficient Body Sensor Network Applications.",
            "Human-Automation Collaboration in Occluded Trajectory Smoothing.",
            "Effects of Display Mode and Input Method for Handheld Control of Micro Aerial Vehicles for a Reconnaissance Mission.",
            "EEG-Based Brain-Controlled Mobile Robots: A Survey.",
            "Improving Mouse-Based Computer Interaction in Users With Weak Upper Limb Motion Control Using a Haptic Assistive System.",
            "Uncovering Measurements of Social and Demographic Behavior From Smartphone Location Data.",
            "Design and Implementation of an Integrated Performance Monitoring Tool for Swimming to Extract Stroke Information at Real Time.",
            "Robust Multimodal Person Identification With Limited Training Data.",
            "Vertical Ground Reaction Forces for Given Human Standing Posture With Uneven Terrains: Prediction and Validation.",
            "Two-Stage Enhancement Scheme for Low-Quality Fingerprint Images by Learning From the Images.",
            "Ordinary Preserving Manifold Analysis for Human Age and Head Pose Estimation.",
            "Rate of Information Transmission in Human Manual Control of an Unstable System.",
            "Motion Scaling for High-Performance Driving Simulators.",
            "Design of a Coplanar Airborne Separation Display.",
            "Experimental Evaluation of a Coplanar Airborne Separation Display.",
            "Modeling Aggressive Behaviors With Evolutionary Taxonomers.",
            "A Stochastic Framework for Movement Strategy Identification and Analysis.",
            "A Text-Driven Conversational Avatar Interface for Instant Messaging on Mobile Devices.",
            "Wearable Sensorimotor Enhancer for Fingertip Based on Stochastic Resonance Effect.",
            "An Integrated Electrooculography and Desktop Input Bimodal Interface to Support Robotic Arm Control.",
            "An Experimental Space for Conducting Controlled Driving Behavior Studies based on a Multiuser Networked 3D Virtual Environment and the Scenario Markup Language.",
            "Discovering Contexts from Observed Human Performance.",
            "Modeling Human Guidance Behavior Based on Patterns in Agent-Environment Interactions.",
            "Design and Evaluation of a Haptic Computer-Assistant for Telemanipulation Tasks.",
            "Measurement of Angular Motion in Golf Swing by a Local Sensor at the Grip End of a Golf Club.",
            "Evaluation of Sternocleidomastoid Muscle Activity of a Passenger in Response to a Car's Lateral Acceleration While Slalom Driving.",
            "Reliably Creating Collision Avoidance Advisories in Piloted Simulations.",
            "Hybrid User-Assisted Incremental Model Adaptation for Activity Recognition in a Dynamic Smart-Home Environment.",
            "Toward Nonconventional Human-Machine Interfaces for Supervisory Plant Process Monitoring.",
            "Data Mining Meets the Needs of Disaster Information Management.",
            "Understanding an Online Classroom System: Design and Implementation Based on a Model Blending Pedagogy and HCI.",
            "Assessing the Perception of Human-Like Mechanical Impedance for Robotic Systems.",
            "Mouse and Keyboard Cursor Warping to Accelerate and Reduce the Effort of Routine HCI Input Tasks.",
            "Considering Factors of and Knowledge About Patients in Handover Assessment.",
            "Verification of Static Signatures by Optical Flow Analysis.",
            "Using Temporal Logic and Model Checking in Automated Recognition of Human Activities for Ambient-Assisted Living.",
            "Person Tracking in Large Public Spaces Using 3-D Range Sensors.",
            "Automatic Standby Power Management Using Usage Profiling and Prediction.",
            "Validation of a Haptic-Based Simulation to Test Complex Figure Reproduction Capability.",
            "Detection and Discrimination of Motion-Defined Form: Implications for the Use of Night Vision Devices.",
            "Analytical Study of Perceptual and Motor Transparency in Bilateral Teleoperation.",
            "Requirements for Future Collision Avoidance Systems in Visual Flight: A Human-Centered Approach.",
            "Framework to Support Scenario Development for Human-Centered Alerting System Evaluation.",
            "Culture and the Safety of Complex Automated Sociotechnical Systems.",
            "SentiView: Sentiment Analysis and Visualization for Internet Popular Topics.",
            "Boat Dynamics and Force Rendering Models for the SPRINT System.",
            "Haptic Assistance for Memorization of 2-D Selection Sequences."
        ]
    },
    {
        "name": "IEEE Transactions on Human-Machine Systems",
        "year": "2012",
        "info": "Volume 42: 2012",
        "count": 155,
        "papers": [
            "Guest Editorial Foreword to the Special Issue on Semantics-Enabled Software Engineering.",
            "Incorporating the Ontology Paradigm Into Software Engineering: Enhancing Domain-Driven Programming in Clojure/Java.",
            "Supporting Object-Oriented Programming of Semantic-Web Software.",
            "Semantics-Based Aspect-Oriented Management of Exceptional Flows in Business Processes.",
            "Semantic Integration of Software and Systems Engineering Environments.",
            "An Empirically Grounded Conceptual Architecture for Applications on the Web of Data.",
            "Applying Ontology-Based Models for Supporting Integrated Software Development and IT Service Management Processes.",
            "On the Voice-Activated Question Answering.",
            "A Taxonomy and Experimental Study on Prototype Generation for Nearest Neighbor Classification.",
            "Model-Based Systems Engineering: An Emerging Approach for Modern Systems.",
            "Smartphone-Based Collaborative and Autonomous Radio Fingerprinting.",
            "A Meta-Analysis of Vibrotactile and Visual Information Displays for Improving Task Performance.",
            "Understanding Plagiarism Linguistic Patterns, Textual Features, and Detection Methods.",
            "Learning Algorithms for Fuzzy Cognitive Maps - A Review Study.",
            "Single RFID Tag Ownership Transfer Protocols.",
            "Multiobjective Optimization Approach for Sensor Arrangement in A Complex Indoor Environment.",
            "FPGA-Based Remote-Code Integrity Verification of Programs in Distributed Embedded Systems.",
            "Experience Replay for Real-Time Reinforcement Learning Control.",
            "On the Use of Mobile Phones and Biometrics for Accessing Restricted Web Services.",
            "Toward Automated Definition Acquisition From Operations Law.",
            "Wave Probabilistic Functions for Quantum Cybernetics.",
            "Computer Simulations of a Humanoid Robot Capable of Walking Like Fashion Models.",
            "Intruder Detection: An Optimal Decision Analysis Strategy.",
            "Optimizing the Vehicle Routing Problem With Time Windows: A Discrete Particle Swarm Optimization Approach.",
            "Passive UHF RFID-Based Localization Using Detection of Tag Interference on Smart Shelf.",
            "Sensors for Gesture Recognition Systems.",
            "A Survey of Evolutionary Algorithms for Decision-Tree Induction.",
            "Hierarchical Filtered Motion for Action Recognition in Crowded Videos.",
            "Bringing Content Awareness to Web-Based IDTV Advertising.",
            "Ontology-Driven Information System Design.",
            "Generalized Locally Weighted GMDH for Short Term Load Forecasting.",
            "Principles and Methods for Nanomechatronics: Signaling, Structure, and Functions Toward Nanorobots.",
            "A Bioinspired Multilayered Intelligent Cooperative Controller for Stretching Process of Fiber Production.",
            "Towards Better Fault Localization: A Crosstab-Based Statistical Approach.",
            "Movie Rating and Review Summarization in Mobile Environment.",
            "An Ant Colony Optimization Approach for Maximizing the Lifetime of Heterogeneous Wireless Sensor Networks.",
            "Machine Learning in Financial Crisis Prediction: A Survey.",
            "Deadlock Control of Automated Manufacturing Systems Based on Petri Nets - A Literature Review.",
            "A Review on Ensembles for the Class Imbalance Problem: Bagging-, Boosting-, and Hybrid-Based Approaches.",
            "Computational Intelligence in Urban Traffic Signal Control: A Survey.",
            "Estimation of Walking Exercise Intensity Using 3-D Acceleration Sensor.",
            "Information Flow Control for Collaborative Distributed Data Fusion and Multisensor Multitarget Tracking.",
            "Autonomous Management of Everyday Places for a Personalized Location Provider.",
            "Collaborative Modeling Process for Development of Domain-Specific Discrete Event Simulation Systems.",
            "Clustered Mixture Particle Filter for Underwater Multitarget Tracking in Multistatic Active Sonobuoy Systems.",
            "Personal Autonomy Rehabilitation in Home Environments by a Portable Assistive Robot.",
            "Chamber Matching of Semiconductor Manufacturing Process Using Statistical Analysis.",
            "Applying a Functional Neurofuzzy Network to Real-Time Lane Detection and Front-Vehicle Distance Measurement.",
            "Web Interface Interpretation Using Graph Grammars.",
            "Elman Fuzzy Adaptive Control for Obstacle Avoidance of Mobile Robots Using Hybrid Force/Position Incorporation.",
            "Guest Editorial: Special Issue on Engineering Applications of Memetic Computing.",
            "A Conceptual Modeling of Meme Complexes in Stochastic Search.",
            "Quantum Memetic Evolutionary Algorithm-Based Low-Complexity Signal Detection for Underwater Acoustic Sensor Networks.",
            "Neighborhood Search-Driven Accelerated Biogeography-Based Optimization for Optimal Load Dispatch.",
            "Evolutionary Multivalued Decision Diagrams for Obtaining Motion Representation of Humanoid Robots.",
            "University Course Timetabling Using a Hybrid Harmony Search Metaheuristic Algorithm.",
            "A Hybrid Estimation of Distribution Algorithm with Decomposition for Solving the Multiobjective Multiple Traveling Salesman Problem.",
            "Improving Grammar Inference by a Memetic Algorithm.",
            "Automatic Design of an Indoor User Location Infrastructure Using a Memetic Multiobjective Approach.",
            "A Comparative Study of 3-D Face Recognition Under Expression Variations.",
            "Machine Learning Algorithms in Bipedal Robot Control.",
            "Hybridizing Differential Evolution and Particle Swarm Optimization to Design Powerful Optimizers: A Review and Taxonomy.",
            "Autonomous Adaptive and Active Tuning Up of the Dissolved Oxygen Setpoint in a Wastewater Treatment Plant Using Reinforcement Learning.",
            "Developing an Intelligent e-Restaurant With a Menu Recommender for Customer-Centric Service.",
            "Sensor-Based Activity Recognition.",
            "A Sensor Technology Survey for a Stress-Aware Trading Process.",
            "Brain-Machine Interfaces: Basis and Advances.",
            "Social Security and Social Welfare Data Mining: An Overview.",
            "Either, Or: Exploration of an Emerging Decision Theory.",
            "Video-Based Abnormal Human Behavior Recognition - A Review.",
            "Mani-Web: Large-Scale Web Graph Embedding via Laplacian Eigenmap Approximation.",
            "Unsupervised Construction of an Indoor Floor Plan Using a Smartphone.",
            "Modeling the Strategic Process of Decision-Making Support Systems Implementations: A System Dynamics Approach Review.",
            "Predicting DNA Motifs by Using Evolutionary Multiobjective Optimization.",
            "Energy-Efficiency-Based Gait Control System Architecture and Algorithm for Biped Robots.",
            "Graph-Based Multiprototype Competitive Learning and Its Applications.",
            "Application-Oriented Intelligent Middleware for Distributed Sensing and Control.",
            "An Efficient Evolutionary Approach to Parameter Identification in a Building Thermal Model.",
            "Classification of Upper Limb Motion Trajectories Using Shape Features.",
            "A Negotiation-Based Capacity-Planning Model.",
            "A New Intelligent Agent-Based AGC Design With Real-Time Application.",
            "Color Trend Forecasting of Fashionable Products with Very Few Historical Data.",
            "Kernel Ridge Regression with Lagged-Dependent Variable: Applications to Prediction of Internal Bond Strength in a Medium Density Fiberboard Process.",
            "Robust and Effective Component-Based Banknote Recognition for the Blind.",
            "A Fuzzy Intimacy Space Model to Develop Human-Robot Attitudinal Relationship.",
            "A Novel Approach to Optimization of Refining Schedules for Crude Oil Operations in Refinery.",
            "Autonomous Application Recovery in Distributed Intelligent Automation and Control Systems.",
            "Optimal Periodic Scheduling Under Multimodel Per-Item Constraints in Wireless Systems.",
            "The Adaptive Recommendation Mechanism for Distributed Group in Mobile Environments.",
            "An Evolutionary Multiobjective Sleep-Scheduling Scheme for Differentiated Coverage in Wireless Sensor Networks.",
            "Attribute-Driven Hidden Markov Model Trees for Intention Prediction.",
            "An Adaptive Recognition Model for Image Annotation.",
            "A Genetic Algorithm-Inspired UUV Path Planner Based on Dynamic Programming.",
            "Fault Simulator Based on a Hardware-in-the-Loop Technique.",
            "Multimodal Communication for Human-Friendly Robot Partners in Informationally Structured Space.",
            "Multimodal Interfaces to Improve Therapeutic Outcomes in Robot-Assisted Rehabilitation.",
            "A Multimodal Human-Robot Interface to Drive a Neuroprosthesis for Tremor Management.",
            "A New Gaze-BCI-Driven Control of an Upper Limb Exoskeleton for Rehabilitation in Real-World Tasks.",
            "Information-Theoretic Linear Feature Extraction Based on Kernel Density Estimators: A Review.",
            "A Review of Smart Homes - Past, Present, and Future.",
            "Iterative Deadlock Control by Using Petri Nets.",
            "Toward Intelligent Security Robots: A Survey.",
            "Problem-Solving Variability in Cognitive Architectures.",
            "Wireless Sensor Network Reliability and Security in Factory Automation: A Survey.",
            "A Review of Anomaly Detection in Automated Surveillance.",
            "Nature-Inspired Techniques in the Context of Fraud Detection.",
            "A Survey of Actor-Critic Reinforcement Learning: Standard and Natural Policy Gradients.",
            "Gear Fault Location Detection for Split Torque Gearbox Using AE Sensors.",
            "T-Hive: Bilateral Haptic Interface Using Vibrotactile Cues for Presenting Spatial Information.",
            "A New Inequality-Based Obstacle-Avoidance MVN Scheme and Its Application to Redundant Robot Manipulators.",
            "Unsupervised Locating of WiFi Access Points Using Smartphones.",
            "Revealing miRNA Regulation and miRNA Target Prediction Using Constraint-Based Learning.",
            "Enhancing Interaction Design on the Semantic Web: A Case Study.",
            "Optimal Sensor Placement for a Constellation of Multistatic Narrowband Pixelated Sensors.",
            "Verification and Validation of Hierarchical Fault Diagnosis in Satellites Formation Flight.",
            "Impedance Control for Legged Robots: An Insight Into the Concepts Involved.",
            "Chaotic Oscillatory-Based Neural Network for Wind Shear and Turbulence Forecast With LiDAR Data.",
            "Supply Chain Coordination Using an Adaptive Distributed Search Strategy.",
            "Model-Driven Development of Reconfigurable Protocol Stack for Networked Control Systems.",
            "Uncertainty Propagation in Quantitative Risk Assessment Modeling for Fire in Road Tunnels.",
            "Synthesizing Globally Asynchronous Locally Synchronous Systems With IEC 61499.",
            "K-Complex Detection Using a Hybrid-Synergic Machine Learning Method.",
            "Principal Line-Based Alignment Refinement for Palmprint Recognition.",
            "A New Feature Selection Method for One-Class Classification Problems.",
            "Cooperative Search Using Agents for Cardinality Constrained Portfolio Selection Problem.",
            "A Fuzzy Goal Programming Approach for Optimal Product Family Design of Mobile Phones and Multiple-Platform Architecture.",
            "A Visual Detection System for Rail Surface Defects.",
            "A Path-Planning Method for Human-Tracking Agents Based on Long-Term Prediction.",
            "Collaborative Strategies for the Search of 3-D Targets in Molecular Environments.",
            "Employing Structural and Textual Feature Extraction for Semistructured Document Classification.",
            "Dynamical System Theory for the Detection of Anomalous Behavior in Computer Programs.",
            "Feature Selection and Clustering of Gene Expression Profiles Using Biological Knowledge.",
            "Dealing With Uncertain Entities in Ontology Alignment Using Rough Sets.",
            "Adaptive-Differential-Evolution-Based Design of Two-Channel Quadrature Mirror Filter Banks for Sub-Band Coding and Data Transmission.",
            "Fuzzy Control for Electric Power-Assisted Wheelchair Driving on Disturbance Roads.",
            "Characteristic Model-Based Adaptive Discrete-Time Sliding Mode Control for the Swing Arm in a Fourier Transform Spectrometer.",
            "A Comparative Study on Multiobjective Swarm Intelligence for the Routing and Wavelength Assignment Problem.",
            "Agent-Based Decision Support and Simulation for Wood Products Manufacturing.",
            "User Authentication Based on Representative Users.",
            "A Machine Learning-Based Framework for Automatic Visual Inspection of Microdrill Bits in PCB Production.",
            "Analyzing Log Files for Postmortem Intrusion Detection.",
            "Using Multidimensional Bayesian Network Classifiers to Assist the Treatment of Multiple Sclerosis.",
            "Path-Tracking Maneuvers With Industrial Robot Manipulators Using Uncalibrated Vision and Impedance Control.",
            "Chemical Detection Using the Receptor Density Algorithm.",
            "Multiagent-Based Reinforcement Learning for Optimal Reactive Power Dispatch.",
            "Comparing Optical Flow Algorithms Using 6-DOF Motion of Real-World Rigid Objects.",
            "Neural Network-Based Active Learning in Multivariate Calibration.",
            "Evolving a Multiagent Controller for Micro Aerial Vehicles.",
            "Ensemble Clustering for Internet Security Applications.",
            "Elegant Object-Oriented Software Design via Interactive, Evolutionary Computation.",
            "Using Coding-Based Ensemble Learning to Improve Software Defect Prediction.",
            "Decision Forest for Root Cause Analysis of Intermittent Faults.",
            "A Dynamic AdaBoost Algorithm With Adaptive Changes of Loss Function.",
            "Cost Analysis of WDM and TDM Fiber-to-the-Home (FTTH) Networks: A System-of-Systems Approach.",
            "Initial Profile Generation in Recommender Systems Using Pairwise Comparison."
        ]
    },
    {
        "name": "IEEE Transactions on Human-Machine Systems",
        "year": "2011",
        "info": "Volume 41: 2011",
        "count": 82,
        "papers": [
            "Forward-Special Issue on Industrial Applications of Holonic Manufacturing Systems.",
            "Comparing the Control Structures of ISA S88- and Holonic Component-Based Architecture.",
            "Rockwell Automation's Holonic and Multiagent Control Systems Compendium.",
            "Abstract Architecture for Task-oriented Multi-agent Problem Solving.",
            "Design and Execution Issues in IEC 61499 Distributed Automation and Control Systems.",
            "Toward Self-Reconfiguration of Manufacturing Systems Using Automation Agents.",
            "Reconfiguration Protocol for Multi-Agent Control Software Architectures.",
            "Distributed Power System Automation With IEC 61850, IEC 61499, and Intelligent Control.",
            "Genetic Algorithms With Guided and Local Search Strategies for University Course Timetabling.",
            "A Unified Framework for the Analysis of Availability, Reliability and Security, With Applications to Quantum Networks.",
            "A Reciprocal and Extensible Architecture for Multiple-Target Tracking in a Smart Home.",
            "An Intrusion-Detection Model Based on Fuzzy Class-Association-Rule Mining Using Genetic Network Programming.",
            "Morphogenetic Robotics: An Emerging New Field in Developmental Robotics.",
            "Optimizing Operator-Agent Interaction in Intelligent Adaptive Interface Design: A Conceptual Framework.",
            "A Case-Driven Ambient Intelligence System for Elderly in-Home Assistance Applications.",
            "Time Series Clustering Via RPCL Network Ensemble With Different Representations.",
            "Modeling Competition in the Telecommunications Market Based on Concepts of Population Biology.",
            "WASP: A System and Algorithms for Accurate Radio Localization Using Low-Cost Hardware.",
            "Hierarchical Fault Diagnosis and Health Monitoring in Satellites Formation Flight.",
            "Pareto-Optimal Design of Damping Controllers Using Modified Artificial Immune Algorithm.",
            "Normality Mining: Privacy Implications of Behavioral Profiles Drawn From GPS Enabled Mobile Phones.",
            "Particle Swarm Optimization in Wireless-Sensor Networks: A Brief Survey.",
            "A Decision-Support Model for Filtering RFID Read Data in Supply Chains.",
            "3-D Palmprint Recognition With Joint Line and Orientation Features.",
            "Guest Editorial Forward to the Special Issue on Systems Integration and Collaboration in Design, Manufacturing, and Services.",
            "Comparative Effectiveness of Mixed Reality-Based Virtual Environments in Collaborative Design.",
            "Modeling Co-construction Processes in a Socio-Technical Framework to Support Collaborative Engineering Design.",
            "Maintenance Chain Integration Using Petri-Net Enabled Multiagent System Modeling and Implementation Approach.",
            "Constructing Collaborative Service Systems: A Mutualism-Based NSD Method.",
            "Fast and Simultaneous Data Aggregation Over Multiple Regions in Wireless Sensor Networks.",
            "Decision-Making Assistance in Engineering-Change Management Process.",
            "A Survey of Modeling and Control Techniques for Micro- and Nanoelectromechanical Systems.",
            "Automated Conflict Resolution Utilizing Probability Collectives Optimizer.",
            "Positioning and Utilizing Sensors on a 3-D Terrain Part I - Theory and Modeling.",
            "BPM and Exception Handling: Focus on Organizational Resilience.",
            "An Optimal Satellite Antenna Profile Using Reinforcement Learning.",
            "A Multifaceted Approach to Modeling Agent Trust for Effective Communication in the Application of Mobile Ad Hoc Vehicular Networks.",
            "Case-Based Reasoning Systems in the Health Sciences: A Survey of Recent Trends and Developments.",
            "Supervisory Control of Multiple Robots: Human-Performance Issues and User-Interface Design.",
            "Likelihood-Ratio Approaches to Automatic Modulation Classification.",
            "Positioning and Utilizing Sensors on a 3-D Terrain Part II - Solving With a Hybrid Evolutionary Algorithm.",
            "NABS: Novel Approaches for Biometric Systems.",
            "F-Sign: Automatic, Function-Based Signature Generation for Malware.",
            "Robust Small Robot Localization From Highly Uncertain Sensors.",
            "Evolutionary Multiobjective Footstep Planning for Humanoid Robots.",
            "SimCoL: A Simulation Tool for Computer-Supported Collaborative Learning.",
            "A Hybrid Simulated Annealing Algorithm for Nonslicing VLSI Floorplanning.",
            "Finding Innovative Design Principles for Multiobjective Optimization Problems.",
            "Guest Editorial Introduction to the Special Issue on Pattern Recognition Technologies for Anti-Terrorism Applications.",
            "Robust Detection of Abandoned and Removed Objects in Complex Surveillance Videos.",
            "Combining Perceptual Features With Diffusion Distance for Face Recognition.",
            "Scene Analysis for Object Detection in Advanced Surveillance Systems Using Laplacian Distribution Model.",
            "Enhancing Identity Prediction Using a Novel Approach to Combining Hard- and Soft-Biometric Information.",
            "Reasoning About Threats: From Observables to Situation Assessment.",
            "Computational Analysis of Sparse Datasets for Fault Diagnosis in Large Tribological Mechanisms.",
            "Biologically Inspired Network Systems: A Review and Future Prospects.",
            "Two-Way Multidimensional Scaling: A Review.",
            "Word-Map Systems for Content-Based Document Classification.",
            "Applying Wave Probabilistic Functions for Dynamic System Modeling.",
            "Multiobjective Simulated Annealing for Fuzzy Clustering With Stability and Validity.",
            "Models, Methodologies, and Tools Supporting Establishment and Management of Second-Generation VBEs.",
            "Feature Relevance Network-Based Transfer Learning for Indoor Location Estimation.",
            "Video Motion Interpolation for Special Effect Applications.",
            "Bayesian Supply Chain Tracking Using Serial-Level Information.",
            "Personal Identification Using Multibiometrics Rank-Level Fusion.",
            "Classification and Assessment of Power System Security Using Multiclass SVM.",
            "Identifying the Productive and Influential Bloggers in a Community.",
            "Local Binary Patterns and Its Application to Facial Image Analysis: A Survey.",
            "Offline Recognition of Devanagari Script: A Survey.",
            "A Survey on Visual Content-Based Video Indexing and Retrieval.",
            "Statistical Interaction Modeling of Bovine Herd Behaviors.",
            "PLS-Based Gene Selection and Identification of Tumor-Specific Genes.",
            "Applying Regional Level-Set Formulation to Postsawing Four-Element LED Wafer Inspection.",
            "Data Extraction for Deep Web Using WordNet.",
            "System Identification and Estimation Framework for Pivotal Automotive Battery Management System Characteristics.",
            "Self-Organizing Assembly Systems.",
            "Gender Recognition Using 3-D Human Body Shapes.",
            "System Architectures Enabling Reconfigurable Laboratory-Automation Systems.",
            "Stable Sensorless Localization of 3-D Objects.",
            "An Automatic Planning and Scheduling System for the Mars Express Uplink Scheduling Problem.",
            "Switching Between Collaboration Levels in a Human-Robot Target Recognition System.",
            "Intercell Interference Management in OFDMA Networks: A Decentralized Approach Based onReinforcement Learning."
        ]
    },
    {
        "name": "IEEE Transactions on Human-Machine Systems",
        "year": "2010",
        "info": "Volume 40: 2010",
        "count": 61,
        "papers": [
            "A Survey on Wearable Sensor-Based Systems for Health Monitoring and Prognosis.",
            "Advances in View-Invariant Human Motion Analysis: A Review.",
            "Wearable Obstacle Avoidance Electronic Travel Aids for Blind: A Survey.",
            "Infrastructure and Reliability Analysis of Electric Networks for E-Textiles.",
            "Genetic Algorithms With Immigrants and Memory Schemes for Dynamic Shortest Path Routing Problems in Mobile Ad Hoc Networks.",
            "Optimizing Discounted Cash Flows in Project Scheduling - An Ant Colony Optimization Approach.",
            "Clustering Methods for Agent Distribution Optimization.",
            "A Nonlinear Filter Coupled With Hospitability and Synthetic Inclination Maps for In-Surveillance and Out-of-Surveillance Tracking.",
            "A Feature Ranking Strategy to Facilitate Multivariate Signal Classification.",
            "Simulated Responses to Support Surface Disturbances in a Humanoid Biped Model With a Vestibular-Like Apparatus.",
            "A Survey on the Application of Genetic Programming to Classification.",
            "A Review of Active Appearance Models.",
            "Hybrid Petri Net Modeling and Schedulability Analysis of High Fusion Point Oil Transportation Under Tank Grouping Strategy for Crude Oil Operations in Refinery.",
            "Optimization of Spatiotemporal Clustering for Target Tracking From Multisensor Data.",
            "Status-based Routing in Baggage Handling Systems: Searching Verses Learning.",
            "Reducing the Probability of Bankruptcy Through Supply Chain Coordination.",
            "Microarray Data Classifier Consisting of k-Top-Scoring Rank-Comparison Decision Rules With a Variable Number of Genes.",
            "An Object-Process-Based Modeling Language for Multiagent Systems.",
            "Grid Resource Negotiation: Survey and New Directions.",
            "Burst Detection From Multiple Data Streams: A Network-Based Approach.",
            "A Mathematical Programming Solution to the Mars Express Memory Dumping Problem.",
            "Geometric Distortion Insensitive Image Watermarking in Affine Covariant Regions.",
            "Distributed Text Classification With an Ensemble Kernel-Based Learning Approach.",
            "CIMDS: Adapting Postprocessing Techniques of Associative Classification for Malware Detection.",
            "Design of Networked Control Systems With Explicit Compensation for Time-Delay Variations.",
            "Master Defect Record Retrieval Using Network-Based Feature Association.",
            "Synthesis of Structurally Simple Supervisors Enforcing Generalized Mutual Exclusion Constraints in Petri Nets.",
            "Model-Based Control for Route Choice in Automated Baggage Handling Systems.",
            "Channel Equalization Using Neural Networks: A Review.",
            "Design of an Automatic Wood Types Classification System by Using Fluorescence Spectra.",
            "Guest Editorial Foreword to the Special Issue on Availability, Reliability, and Security.",
            "Multifactor Identity Verification Using Aggregated Proof of Knowledge.",
            "A Frequency-based Approach for Features Fusion in Fingerprint and Iris Multimodal Biometric Identification Systems.",
            "Constructing Authorization Systems Using Assurance Management Framework.",
            "Survivable RFID Systems: Issues, Challenges, and Techniques.",
            "A Security Analysis for Wireless Sensor Mesh Networks in Highly Critical Systems.",
            "A Cost Analysis of Systems Subject to Random Field Environments and Reliability.",
            "Electric Load Forecasting Based on Locally Weighted Support Vector Regression.",
            "Distributed Explicit Rate Schemes in Multi-Input-Multi-Output Network Systems.",
            "Evolutionary Tristate PSO for Strategic Bidding of Pumped-Storage Hydroelectric Plant.",
            "Privacy-Preserving Collaborative Recommender Systems.",
            "An Application of Reinforcement Learning for Efficient Spectrum Usage in Next-Generation Mobile Cellular Networks.",
            "A Service-Oriented Framework for Running Quantum Mechanical Simulations of Material Properties in a Grid Environment.",
            "Survey on Contemporary Remote Surveillance Systems for Public Safety.",
            "Toward Credible Evaluation of Anomaly-Based Intrusion-Detection Methods.",
            "A Biologically Inspired Sensor Wakeup Control Method for Wireless Sensor Networks.",
            "Anonymity and Monitoring: How to Monitor the Infrastructure of an Anonymity System.",
            "An Adaptive Q -Learning Algorithm Developed for Agent-Based Computational Modeling of Electricity Market.",
            "A Hybrid Recommendation Method with Reduced Data for Large-Scale Application.",
            "Provably Secure Integrated On/Off-Line Electronic Cash for Flexible and Efficient Payment.",
            "Incremental Embedding and Learning in the Local Discriminant Subspace With Application to Face Recognition.",
            "Age-Related Physical and Emotional Characteristics to Safety Warning Sounds: Design Guidelines for Intelligent Vehicles.",
            "Educational Data Mining: A Review of the State of the Art.",
            "Intelligent Fabric Hand Prediction System With Fuzzy Neural Network.",
            "Motion Control of Omni-Directional Three-Wheel Robots by Brain-Emotional-Learning-Based Intelligent Controller.",
            "Rough Sets for Selection of Molecular Descriptors to Predict Biological Activity of Molecules.",
            "Efficient Decision Makings for Dynamic Weapon-Target Assignment by Virtual Permutation and Tabu Search Heuristics.",
            "Bio-inspired Algorithms for Autonomous Deployment and Localization of Sensor Nodes.",
            "Multimodal Biometric Human Recognition for Perceptual Human-Computer Interaction.",
            "Secure Collaborative Social Networks.",
            "Hardware/Software Codesign for a Fuzzy Autonomous Road-Following System."
        ]
    },
    {
        "name": "IEEE Transactions on Human-Machine Systems",
        "year": "2009",
        "info": "Volume 39: 2009",
        "count": 58,
        "papers": [
            "Short-Term Schedulability Analysis of Multiple Distiller Crude Oil Operations in Refinery With Oil Residency Time Constraint.",
            "Closed-Loop Modeling in Future Automation System Engineering and Validation.",
            "An Ant Colony Optimization Approach to a Grid Workflow Scheduling Problem With Various QoS Requirements.",
            "Detection and Prognostics on Low-Dimensional Systems.",
            "A Hybrid of Cooperative Particle Swarm Optimization and Cultural Algorithm for Neural Fuzzy Networks and Its Prediction Applications.",
            "Power Transformer Fault Classification Based on Dissolved Gas Analysis by Implementing Bootstrap and Genetic Programming.",
            "Integrating a Piecewise Linear Representation Method and a Neural Network Model for Stock Trading Points Prediction.",
            "Recruiter Selection Model and Implementation Within the United States Army.",
            "Anomaly Detection and Diagnosis Algorithms for Discrete Symbol Sequences with Applications to Airline Safety.",
            "Factorial HMM and Parallel HMM for Gait Recognition.",
            "Multicriteria Partner Selection in Virtual Organizations With Transportation Costs and Other Network Interdependencies.",
            "A Survey of Evolutionary Algorithms for Clustering.",
            "A Divide-and-Conquer Strategy to Deadlock Prevention in Flexible Manufacturing Systems.",
            "Fuzzy Neural Control for Economic-Driven Radio Resource Management in Beyond 3G Networks.",
            "Integrated Resource Allocation and Scheduling in a Bidirectional Flowshop With Multimachine and COS Constraints.",
            "Adaptive Sensor Fault Detection and Identification Using Particle Filter Algorithms.",
            "Target Detection in SAR Images Based on a Level Set Approach.",
            "Mining Demand Chain Knowledge for New Product Development and Marketing.",
            "A Human-Centered Multiple Instance Learning Framework for Semantic Video Retrieval.",
            "Disturbance Attenuation in Fault Detection of Gas Turbine Engines: A Discrete Robust Observer Design.",
            "Resident Location-Recognition Algorithm Using a Bayesian Classifier in the PIR Sensor-Based Indoor Location-Aware System.",
            "Comparison of Polymers: A New Application of Shape From Focus.",
            "A Decade of Kasabov's Evolving Connectionist Systems: A Review.",
            "Emergency Response Workflow Resource Requirements Modeling and Analysis.",
            "Evolving Best-Response Strategies for Market-Driven Agents Using Aggregative Fitness GA.",
            "Modeling the Ambient Intelligence Application System: Concept, Software, Data, and Network.",
            "Emotional Intensity-based Facial Expression Cloning for Low Polygonal Applications.",
            "Evolutionary Generative Process for an Artificial Creature's Personality.",
            "Study on Road Network Traffic Coordination Control Technique With Bus Priority.",
            "Application of Two Hopfield Neural Networks for Automatic Four-Element LED Inspection.",
            "Real-Time Moving Target Evaluation Search.",
            "Corrections to \"Pareto-Based Multiobjective Machine Learning: An Overview and Case Studies\" [May 08 397-415].",
            "Guest Editorial Forward to the Special Issue on Information Reuse and Integration.",
            "Empirical Case Studies in Attribute Noise Detection.",
            "Measuring Semantic Similarity Between Biomedical Concepts Within Multiple Ontologies.",
            "Formal Concept Analysis With Background Knowledge: Attribute Priorities.",
            "Neural-Network-Based Path Planning for a Multirobot System With Moving Obstacles.",
            "Performance Evaluation of Some Symmetry-Based Cluster Validity Indexes.",
            "Cascaded and Hierarchical Neural Networks for Classifying Surface Images of Marble Slabs.",
            "Toward Empirical Aspects of Secure Scalar Product.",
            "Concurrent Collective Strategy Diffusion of Multiagents: The Spatial Model and Case Study.",
            "Nonlinear System Control Using Adaptive Neural Fuzzy Networks Based on a Modified Differential Evolution.",
            "Process Mining Applied to the Test Process of Wafer Scanners in ASML.",
            "Dual Features Functional Support Vector Machines for Fault Detection of Rechargeable Batteries.",
            "Understanding Video Events: A Survey of Methods for Automatic Interpretation of Semantic Occurrences in Video.",
            "Palmprint Recognition Using 3-D Information.",
            "Design and Implementation of a Fuzzy-Modified Ant Colony Hardware Structure for Image Retrieval.",
            "Optimization-Based Dynamic Sensor Management for Distributed Multitarget Tracking.",
            "A Hybrid CPG-ZMP Controller for the Real-Time Balance of a Simulated Flexible Spine Humanoid Robot.",
            "Security-Enhanced OSGi Service Environments.",
            "Development and Specification of a Reference Model for Agent-Based Systems.",
            "Association Rule Mining-Based Dissolved Gas Analysis for Fault Diagnosis of Power Transformers.",
            "An Objective Function to Evaluate Performance of Human-Robot Collaboration in Target Recognition Tasks.",
            "Increasing Safety of Bomb Disposal Missions: A Body Sensor Network Approach.",
            "A Model-Driven Approach for Describing Semantic Web Services: From UML to OWL-S.",
            "Integrate the GM(1, 1) and Verhulst Models to Predict Software Stage Effort.",
            "An Intelligent Testing System Embedded With an Ant-Colony-Optimization-Based Test Composition Method.",
            "Classification of Aeronautics System Health and Safety Documents."
        ]
    },
    {
        "name": "IEEE Transactions on Human-Machine Systems",
        "year": "2008",
        "info": "Volume 38: 2008",
        "count": 76,
        "papers": [
            "Guest Editorial Foreword to the Special Issue on Intelligent Computation for Bioinformatics.",
            "Sequential Data Mining: A Comparative Case Study in Development of Atherosclerosis Risk Factors.",
            "Learning Relational Descriptions of Differentially Expressed Gene Groups.",
            "Selection of DNA Markers.",
            "Blind Microarray Gridding: A New Framework.",
            "Information Visualization for DNA Microarray Data Analysis: A Critical Review.",
            "Gene Identification: Classical and Computational Intelligence Approaches.",
            "Business Process Analysis and Optimization: Beyond Reengineering.",
            "Survey of Non-facial/Non-verbal Affective Expressions for Appearance-Constrained Robots.",
            "A Petri-Net-Based Correctness Analysis of Internet Stock Trading Systems.",
            "Analysis of CCME: Coevolutionary Dynamics, Automatic Problem Decomposition, and Regularization.",
            "Shared Content Management in Replicated Web Systems: A Design Framework Using Problem Decomposition, Controlled Simulation, and Feedback Learning.",
            "Stimulation Pattern-Free Control of FES Cycling: Simulation Study.",
            "A New Nonbinary Matrix Clustering Algorithm for Development of System Architectures.",
            "Gait Components and Their Application to Gender Recognition.",
            "A Comprehensive Survey of Multiagent Reinforcement Learning.",
            "A Survey and Comparison of Petri Net-Based Deadlock Prevention Policies for Flexible Manufacturing Systems.",
            "A Prototype for Hardware-in-the-Loop Simulation of a Distributed Control Architecture.",
            "A Position-Based Clustering Technique for Ad Hoc Intervehicle Communication.",
            "Noisy Chaotic Neural Networks With Variable Thresholds for the Frequency Assignment Problem in Satellite Communications.",
            "A Genetic-Algorithm-Based Optimization Model for Solving the Flexible Assembly Line Balancing Problem With Work Sharing and Workstation Revisiting.",
            "Wholesale Power Price Dynamics Under Transmission Line Limits: A Use of an Agent-Based Intelligent Simulator.",
            "A FAST Method to Achieve Flexible Production Programming Systems.",
            "A CAD System for Modeling and Simulation of Computer Networks Using Cellular Automata.",
            "Password Authentication Using Hopfield Neural Networks.",
            "Distributed Scheduling for Reactive Maintenance of Complex Systems.",
            "Guest Editorial Foreword to the Special Issue on Enterprise Services Computing and Industrial Applications.",
            "Unleashing the Effectiveness of Process-Oriented Information Systems: Problem Analysis, Critical Success Factors, and Implications.",
            "A New Model for Secure Dissemination of XML Content.",
            "Bridging Global and Local Models of Service-Oriented Systems.",
            "The Pervasive Workflow: A Decentralized Workflow System Supporting Long-Running Transactions.",
            "An Impregnable Lightweight Device Discovery (ILDD) Model for the Pervasive Computing Environment of Enterprise Applications.",
            "An Incremental Approach to the Analysis and Transformation of Workflows Using Region Trees.",
            "Lightweight Cryptographic Authentication in Passive RFID-Tagged Systems.",
            "Roles in Information Systems: A Survey.",
            "Pareto-Based Multiobjective Machine Learning: An Overview and Case Studies.",
            "Automatic Video Classification: A Survey of the Literature.",
            "Computer Tool With a Code Generator for Avionic Distributed Fuel Control Systems With Smart Sensors and Actuators.",
            "A Methodology for Assessing the Value of Knowledge in a Service Parts Supply Chain.",
            "A Survey of Glove-Based Systems and Their Applications.",
            "Engineering Open Complex Agent Systems: A Case Study.",
            "Grid Implementation of a Parallel Multiobjective Genetic Algorithm for Optimized Allocation of Chlorination Stations in Drinking Water Distribution Systems: Chojnice Case Study.",
            "A Satisficing Approach to Aircraft Conflict Resolution.",
            "A Geometric Approach to the Theory of Evidence.",
            "A Double-Deck Elevator Group Supervisory Control System Using Genetic Network Programming.",
            "Decentralized Inventory Control for Large-Scale Reverse Supply Chains: A Computationally Tractable Approach.",
            "Wise-ShopFloor: An Integrated Approach for Web-Based Collaborative Manufacturing.",
            "On the Equivalence of a Table Lookup (TL) Technique and Fuzzy Neural Network (FNN) With Block Pulse Membership Functions (BPMFs) and Its Application to Water Injection Control of an Automobile.",
            "Navigation Technologies for Autonomous Underwater Vehicles.",
            "An Integrated Approach for Agricultural Ecosystem Management.",
            "Optimization of Industrial, Vision-Based, Intuitively Generated Robot Point-Allocating Tasks Using Genetic Algorithms.",
            "Automatic Signature Verification: The State of the Art.",
            "Timetable Synchronization of MassRapid Transit System Using Multiobjective Evolutionary Approach.",
            "Random-Forests-Based Network Intrusion Detection Systems.",
            "Employing Clustering Techniques for Automatic Information Extraction From HTML Documents.",
            "Solving Multiple-Objective Flexible Job Shop Problems by Evolution and Local Search.",
            "A Multiagent System for Assisting Citizens in Their Search of E-Government Services.",
            "Implementation of a Holonic Control System in a Flexible Manufacturing System.",
            "Setting the Processing Parameters in Injection Molding Through Multiple-Criteria Optimization: A Case Study.",
            "PID Control Using Presearched Genetic Algorithms for a MIMO System.",
            "Beyond Traditional Kernels: Classification in Two Dissimilarity-Based Representation Spaces.",
            "A Business Process Intelligence System for Enterprise Process Performance Management.",
            "Reliability-Constrained Optimum Placement of Reclosers and Distributed Generators in Distribution Networks Using an Ant Colony System Algorithm.",
            "Short-Term Schedulability Analysis of Crude Oil Operations in Refinery With Oil Residency Time Constraint Using Petri Nets.",
            "Why Did the California Electricity Crisis Occur?: A Numerical Analysis Using a Multiagent Intelligent Simulator.",
            "Machine Vision/GPS Integration Using EKF for the UAV Aerial Refueling Problem.",
            "A Hybrid System Integrating a Wavelet and TSK Fuzzy Rules for Stock Price Forecasting.",
            "Gaussian Mixture Modeling of Keystroke Patterns for Biometric Applications.",
            "Predicting the Parts Weight in Plastic Injection Molding Using Least Squares Support Vector Regression.",
            "Two-Layered Confabulation Architecture for an Artificial Creature's Behavior Selection.",
            "Comments on \"An Adaptive Multimodal Biometric Management Algorithm\".",
            "Vision-Based Grasp Tracking for Planar Objects.",
            "A Tool for the Accumulation and Evaluation of Multimodal Research.",
            "Designing Effective Alarms for Radiation Detection in Homeland Security Screening.",
            "Reducing the Uncertainty on Location Estimation of Mobile Users to Support Hospital Work.",
            "Hierarchical Pattern Discovery in Graphs."
        ]
    },
    {
        "name": "IEEE Transactions on Human-Machine Systems",
        "year": "2007",
        "info": "Volume 37: 2007",
        "count": 120,
        "papers": [
            "Avoiding Pitfalls in Neural Network Research.",
            "Toward Developing Data Warehousing Process Standards: An Ontology-Based Review of Existing Methodologies.",
            "Bayesian Classification of Cork Stoppers Using Class-Conditional Independent Component Analysis.",
            "A New Approach to Motion Pattern Recognition and Its Application to Optical Flow Estimation.",
            "A Performance Study on a Multiagent E-Scheduling and Coordination Framework for Maintenance Networks.",
            "Combining Global and Local Surrogate Models to Accelerate Evolutionary Optimization.",
            "Implementation of a Remote Hierarchical Supervision System Using Petri Nets and Agent Technology.",
            "Multiresolution Abnormal Trace Detection Using Varied-Length n-Grams and Automata.",
            "Gray Forecast Approach for Developing Distance Learning and Diagnostic Systems.",
            "Exploiting the Information Web.",
            "Formal Approach of FMS Cyclic Scheduling.",
            "Reducing the Memory Size of a Fuzzy Case-Based Reasoning System Applying Rough Set Techniques.",
            "Genetic Algorithm for the Multiple-Query Optimization Problem.",
            "Guest Editorial: Networking, Sensing, and Control for Networked Control Systems: Architectures, Algorithms, and Applications.",
            "Guaranteed Cost Networked Control for T-S Fuzzy Systems With Time Delays.",
            "Design and Stability Criteria of Networked Predictive Control Systems With Random Network Delay in the Feedback Channel.",
            "Multirate Control in Internet-Based Control Systems.",
            "Service-Oriented Smart-Home Architecture Based on OSGi and Mobile-Agent Technology.",
            "Fairness and Dynamic Flow Control in Both Unicast and Multicast Architecture Networks.",
            "Characteristic Model-Based All-Coefficient Adaptive Control Method and Its Applications.",
            "Distributed Simulation of Differential Algebraic Systems Using Optimal Sliding-Mode Control.",
            "A Robust In-Car Digital Image Stabilization Technique.",
            "Pattern Recognition Approach for Music Style Identification Using Shallow Statistical Descriptors.",
            "Band Selection in Multispectral Images by Minimization of Dependent Information.",
            "Improving Quality of Crane-Lorry Assignments With Constraint Programming.",
            "Mining Mobile Sequential Patterns in a Mobile Commerce Environment.",
            "Machine Learning With AIBO Robots in the Four-Legged League of RoboCup.",
            "Gesture Recognition: A Survey.",
            "Molecular Computation and Evolutionary Wetware: A Cutting-Edge Technology for Artificial Life and Nanobiotechnologies.",
            "Robust Neural-Network-Based Data Association and Multiple Model-Based Tracking of Multiple Point Targets.",
            "Incorporating Web Analysis Into Neural Networks: An Example in Hopfield Net Searching.",
            "Therapeutic Drug Monitoring of Kidney Transplant Recipients Using Profiled Support Vector Machines.",
            "Multiagent Coordination Techniques for Complex Environments: The Case of a Fleet of Combat Ships.",
            "Agent-Based Approach to Mass-Oriented Production Planning: Case Study.",
            "Information Sharing as a Coordination Mechanism for Reducing the Bullwhip Effect in a Supply Chain.",
            "A Recurrent Fuzzy-Network-Based Inverse Modeling Method for a Temperature System Control.",
            "A Real-Time Visual Inspection System for Railway Maintenance: Automatic Hexagonal-Headed Bolts Detection.",
            "Trust Modeling for Networked Organizations Using Reputation and Collaboration Estimates.",
            "Guest Editorial Special Issue on Engineering Applications of Petri Nets.",
            "Constructing and Refining Large-Scale Railway Models Represented by Petri Nets.",
            "Modeling and Conflict Detection of Crude Oil Operations for Refinery Process Based on Controlled Colored Timed Petri Net.",
            "Charging Information Collection Modeling and Analysis of GPRS Networks.",
            "Applying Petri Nets in Active Database Systems.",
            "Navigation Behavior Selection Using Generalized Stochastic Petri Nets for a Service Robot.",
            "Application of Petri Nets and Lagrangian Relaxation to Scheduling Automatic Material-Handling Vehicles in 300-mm Semiconductor Manufacturing.",
            "Design of Liveness-Enforcing Supervisors for Flexible Manufacturing Systems Using Petri Nets.",
            "Review and Preview: Disocclusion by Inpainting for Image-Based Rendering.",
            "Deadlock Detection and Avoidance Strategies for Automated Storage and Retrieval Systems.",
            "An Intelligent Telephony Interface of Multiagent Decision Support Systems.",
            "Data Mining for Hierarchical Model Creation.",
            "Multiscale Optimization for the Management of Runoff Risks in Agricultural Watersheds.",
            "Designing an Evolutionary Strategizing Machine for Game Playing and Beyond.",
            "A Systematic Approach to Predict Performance of Human-Automation Systems.",
            "Planning Product Configurations Based on Sales Data.",
            "Neurofuzzy-Based Approach to Mobile Robot Navigation in Unknown Environments.",
            "Evolutionary Rough Feature Selection in Gene Expression Data.",
            "Formal Representation of Meta-Operation of Chemical Plants.",
            "Online Tracking of Component Interactions for Failure Detection and Localization in Distributed Systems.",
            "Assignment and Scheduling in Flexible Job-Shops by Hierarchical Optimization.",
            "Synthesis of a Class of Discrete-Event Controllers for Large Manufacturing Systems.",
            "Integration of Coordination Architecture and Behavior Fuzzy Learning in Quadruped Walking Robots.",
            "Coalition Formation for Resource Coallocation Using BDI Assignment Agents.",
            "Mobile Network Analysis Using Probabilistic Connectivity Matrices.",
            "Synthesis of Parallel Operation for Enhanced Chemical Plant Operation.",
            "Trilevel Optimization in Power Network Defense.",
            "Uncertainty Modeling and Analysis of Natural Resonant Frequency and Transconductance Parameters in Microresonators Design.",
            "The Future of Systems, Man, and Cybernetics: Application Domains and Research Methods.",
            "Toward Real-Time Distributed Intelligent Control: A Survey of Research Themes and Applications.",
            "Computational Intelligence in Product Design Engineering: Review and Trends.",
            "Review and Synthesis of Considerations in Architecting Heterogeneous Teams of Humans and Robots for Optimal Space Exploration.",
            "Imaging Order Scheduling of an Earth Observation Satellite.",
            "Large-Scale Optimal Sensor Array Management for Multitarget Tracking.",
            "Linearized Model of Object Caching and Heuristic Solution.",
            "Evolution-Based Tabu Search Approach to Automatic Clustering.",
            "Effects of Augmented Reality Display Settings on Human Wayfinding Performance.",
            "An Ontological Approach to Evaluating Standards in E-Commerce Platforms.",
            "Real-Time Edge Follow: A Real-Time Path Search Approach.",
            "Immune-Inspired Adaptable Error Detection for Automated Teller Machines.",
            "Improving Robustness of Spacecraft Downlink Schedules.",
            "Adaptive Control of Mechanical Systems Using Neural Networks.",
            "A Complete Multiagent Framework for Robust and Adaptable Dynamic Job Shop Scheduling.",
            "Minimization of Job Waiting Time Variance on Identical Parallel Machines.",
            "Mercatus: A Toolkit for the Simulation of Market-Based Resource Allocation Protocols in Grids.",
            "Fuzzy Logic-Based Torque Control System for Milling Process Optimization.",
            "Opportunity Cost and OCBA Selection Procedures in Ordinal Optimization for a Fixed Number of Alternative Systems.",
            "Online Support Vector Regression Approach for the Monitoring of Motor Shaft Misalignment and Feedwater Flow Rate.",
            "Real-Time Iris Detection on Coronal-Axis-Rotated Faces.",
            "A Semiautomatic Approach to Deriving Turbine Generator Diagnostic Knowledge.",
            "Vibrotactile Guidance Cues for Target Acquisition.",
            "Design of Intelligent Acceleration Schedules for Extending the Life of Aircraft Engines.",
            "A Multiagent-Based Algorithm for Ring-Structured Shipboard Power System Reconfiguration.",
            "Intelligent Learning Algorithms for Active Vibration Control.",
            "A Framework for Sign Language Sentence Recognition by Commonsense Context.",
            "Hierarchical Fault Diagnosis: Application to an Ozone Plant.",
            "Information Systems Theory and Informational Macrodynamics: Review of the Main Results.",
            "Survey of Wireless Indoor Positioning Techniques and Systems.",
            "Content-Based 3-D Model Retrieval: A Survey.",
            "Iterative Learning Control: Brief Survey and Categorization.",
            "Segmentation and Modeling of Full Human Body Shape From 3-D Scan Data: A Survey.",
            "Modeling, Identification, Design, and Implementation of Nonlinear Automotive Idle Speed Control Systems - An Overview.",
            "Security Challenge and Defense in VoIP Infrastructures.",
            "An Integrated Diagnostic Development Process for Automotive Engine Control Systems.",
            "Business-to-Consumer Mobile Agent-Based Internet Commerce System (MAGICS).",
            "Optimal Advertising Campaign Generation for Multiple Brands Using MOGA.",
            "A Type-2 Fuzzy Switching Control System for Biped Robots.",
            "Haptic Interaction Stability With Respect to Grasp Force.",
            "Progressive Random Sampling With Stratification.",
            "Human Performance Issues and User Interface Design for Teleoperated Robots.",
            "On the Detection of Clones in Sensor Networks Using Random Key Predistribution.",
            "Dynamic Modeling and Simulation of a 3-D Serial Eel-Like Robot.",
            "Wavelet-Based Detection and Its Application to Tracking in an IR Sequence.",
            "Modeling and Performance Evaluation of Inventory Systems Using Batch Deterministic and Stochastic Petri Nets.",
            "Restoration of Services in Interdependent Infrastructure Systems: A Network Flows Approach.",
            "Discriminant Analysis Based Prognostics of Avionic Systems.",
            "An Ontology for Virtual Organization Breeding Environments.",
            "Incorporation of a Software Robot anda Mobile Robot Using a Middle Layer.",
            "Learning Performance Assessment Approach Using Web-Based Learning Portfolios for E-learning Systems.",
            "Automated Fault Detection and Diagnosis in Mechanical Systems.",
            "E-Quality for Manufacturing (EQM) Within the Framework of Internet-Based Systems.",
            "Deadlock-Free Resource Allocation Control for a Reconfigurable Manufacturing System With Serial and Parallel Configuration."
        ]
    },
    {
        "name": "IEEE Transactions on Human-Machine Systems",
        "year": "2006",
        "info": "Volume 36: 2006",
        "count": 75,
        "papers": [
            "Satisficing negotiations.",
            "Integrative negotiation among agents situated in organizations.",
            "Bilateral negotiation decisions with uncertain dynamic outside options.",
            "Bilateral bargaining with multiple opportunities: knowing your opponent's bargaining position.",
            "Software agents and market (in) efficiency: a human trader experiment.",
            "A game theoretic approach to contracts in multiagent systems.",
            "A Cooperative mediation-based protocol for dynamic distributed resource allocation.",
            "Learning dynamic prices in MultiSeller electronic retail markets with price sensitive customers, stochastic demands, and inventory replenishments.",
            "ISEM: a multiagent Simulator for testing agent market strategies.",
            "Editorial Recent Advances in Cognitive Informatics.",
            "A layered reference model of the brain (LRMB).",
            "Ruthless reductionism in recent neuroscience.",
            "Characterizing chaos through Lyapunov metrics.",
            "Mixing semantic networks and conceptual vectors application to hyperonymy.",
            "On the informatics laws and deductive semantics of software.",
            "Perceptual learning and abstraction in machine learning: an application to autonomous robotics.",
            "Defining and testing metaadaptable agents.",
            "Signal classification through multifractal analysis and complex domain neural networks.",
            "Cognitive informatics models of the brain.",
            "Multiresolution FIR neural-network-based learning algorithm applied to network traffic prediction.",
            "Experiences with goal-oriented modeling of organizational change.",
            "Inverted hierarchical neuro-fuzzy BSP system: a novel neuro-fuzzy model for pattern classification and rule extraction in databases.",
            "Assessing the effectiveness of feature groups in author recognition tasks with the SOM model.",
            "Evaluation of enterprise information technologies: a decision model for high-level consideration of strategic and operational issues.",
            "Guest Editorial Special Issue on Engineering of Autonomic Systems.",
            "Autonomous and autonomic systems: a paradigm for future space exploration missions.",
            "Modeling reflex-healing autonomy for large-scale embedded systems.",
            "Personal autonomic computing reflex reactions and self-healing.",
            "Autonomic mobile sensor network with self-coordinated task allocation and execution.",
            "Task-based adaptation for ubiquitous computing.",
            "Accord: a programming framework for autonomic applications.",
            "Autonomic workflow execution in the grid.",
            "Autonomic features of the IBM DB2 universal database for linux, UNIX, and windows.",
            "Rational function distribution in computer system architectures: key to stable and secure platforms.",
            "Risk assessment based on weak information using belief functions: a case study in water treatment.",
            "Application of soft computing techniques to adaptive user buffer overflow control on the Internet.",
            "A* search: an efficient and flexible approach to materialized view selection.",
            "Explication and sharing of design knowledge through a novel product design approach.",
            "Fusion of soft computing and hard computing: computational structures and characteristic features.",
            "Guest Editorial Special Issue: Industrial Applications of Soft Computing.",
            "Linguistic information feedforward-based dynamical fuzzy systems.",
            "Understanding representational sensitivity in the iterated prisoner's dilemma with fingerprints.",
            "Synergistic use of soft computing technologies for fault detection in gas turbine engines.",
            "Removing spike noise from railway geometry measures with a fuzzy filter.",
            "Efficient chromosome encoding and problem-specific mutation methods for the flexible bay facility layout problem.",
            "Gesture-based control and EMG decomposition.",
            "Neighborhood topologies in fully informed and best-of-neighborhood particle swarms.",
            "Using genetic algorithms to estimate confidence intervals for missing spatial data.",
            "Linear and neural dynamic models: shared benefits between the industrial customer and the ESCo from the energy services' perspective.",
            "Automatic detection and classification of grains of pollen based on shape and texture.",
            "Differential Petri net models for industrial automation and supervisory control.",
            "Performance-oriented integrated control of production scheduling.",
            "Agent-based distributed manufacturing process planning and scheduling: a state-of-the-art survey.",
            "Role-based collaboration and its kernel mechanisms.",
            "Pseudocoevolutionary genetic algorithms for power electronic circuits optimization.",
            "Evolutionary computation in bioinformatics: a review.",
            "Bioinformatics with soft computing.",
            "Algorithmic approaches for genome rearrangement: a review.",
            "Classification methods and inductive learning rules: what we may learn from theory.",
            "Neural network control of air-to-fuel ratio in a bi-fuel engine.",
            "Active-vision-based multisensor surveillance - an implementation.",
            "Automatic detection and elimination of specular reflectance in color images by means of MS diagram and vector connected filters.",
            "On Dempster-Shafer and bayesian detectors.",
            "A system for supporting group activities with a sensor-embedded board.",
            "Multiagent technology for fault tolerance and flexible control.",
            "Derivation of monotone decision models from noisy data.",
            "Force Sensing and Control in Micromanipulation.",
            "A New Control Approach for a Robotic Walking Support System in Adapting User Characteristics.",
            "Survey of Data Mining Approaches to User Modeling for Adaptive Hypermedia.",
            "Using Image Processing Methods to Improve the Explosive Detection Accuracy.",
            "Neuro-Fuzzy Control for MPEG Video Transmission Over Bluetooth.",
            "A Dynamic User Concept Pattern Learning Framework for Content-Based Image Retrieval.",
            "Improving Weapon Detection in Single Energy X-Ray Images Through Pseudocoloring.",
            "Geometrical Error Modeling and Compensation Using Neural Networks.",
            "Using Fuzzy Cognitive Maps for Knowledge Management in a Conflict Environment."
        ]
    },
    {
        "name": "IEEE Transactions on Human-Machine Systems",
        "year": "2005",
        "info": "Volume 35: 2005",
        "count": 59,
        "papers": [
            "Movement-flow-based visual servoing and force control fusion for Manipulation Tasks in unstructured environments.",
            "Online statistical model recognition and State estimation for autonomous compliant motion.",
            "Visual quality measures for Characterizing Planar robot grasps.",
            "A cognitive architecture for Robotic hand posture learning.",
            "From biological inspiration toward next-generation manipulators: manipulator control focused on human tasks.",
            "Improvement of visual perceptual capabilities by feedback structures for robotic system FRIEND.",
            "Intelligent robotic cell for Trencadí mosaics manufacturing.",
            "Including efficient object recognition capabilities in online robots: from a statistical to a Neural-network classifier.",
            "iBotGuard: an Internet-based Intelligent Robot security system using Invariant Face Recognition against intruder.",
            "Robust data fusion with occupancy grid.",
            "Pattern tracking and 3-D motion reconstruction of a rigid body from a 2-D image sequence.",
            "Corrections to \"An Information-Theoretical Framework for Modeling Component-Based Systems\".",
            "A distributed evolutionary classifier for knowledge discovery in data mining.",
            "Agent-based evolutionary approach for interpretable rule-based knowledge extraction.",
            "Evolutionary feature synthesis for object recognition.",
            "Knowledge interaction with genetic programming in mechatronic systems design using bond graphs.",
            "Accelerating evolutionary algorithms with Gaussian process fitness function models.",
            "Clustering and learning Gaussian distribution for continuous optimization.",
            "A constraint-based genetic algorithm approach for mining classification rules.",
            "An evolutionary algorithm for solving nonlinear bilevel programming based on a new constraint-handling scheme.",
            "Search biases in constrained evolutionary optimization.",
            "Evolutionary fuzzy neural networks for hybrid financial prediction.",
            "Genetic recurrent fuzzy system by coevolutionary computation with divide-and-conquer technique.",
            "Knowledge-based fast evaluation for evolutionary learning.",
            "Multiobjective GA optimization using reduced models.",
            "A comparative study of three evolutionary algorithms incorporating different amounts of domain knowledge for node covering problem.",
            "Improved class statistics estimation for sparse data problems in offline signature verification.",
            "Fingerprint classification based on learned features.",
            "On the use of different speech representations for speaker modeling.",
            "Eigenspace-based face recognition: a comparative study of different approaches.",
            "An appearance model constructed on 3-D surface for robust face recognition against pose and illumination variations.",
            "Time-series detection of perspiration as a liveness test in fingerprint devices.",
            "An adaptive multimodal biometric management algorithm.",
            "Fingerprint and speaker verification decisions fusion using a functional link network.",
            "iShopFloor: an Internet-enabled agent-based intelligent shop floor.",
            "Coupling fuzzy modeling and neural networks for river flood prediction.",
            "The life cycle CO2 emission performance of the DOE/NASA solar power satellite system: a comparison of alternative power generation systems in Japan.",
            "Support vector machines for quality monitoring in a plastic injection molding process.",
            "Face authentication from cell phone camera images with illumination and temporal variations.",
            "Target dependent score normalization techniques and their application to signature verification.",
            "Hallucinating face by eigentransformation.",
            "Improving iris recognition accuracy via cascaded classifiers.",
            "A real-time focusing algorithm for iris recognition camera.",
            "Model checking for E-business control and assurance.",
            "An efficient coordinate frame calibration method for 3-D measurement by multiple camera systems.",
            "Separating core and noncore knowledge: an application of neural network rule extraction to a cross-national study of brand image perception.",
            "Top-down induction of decision trees classifiers - a survey.",
            "Automatic system for quality-based classification of marble textures.",
            "C-fuzzy decision trees.",
            "\"Sticky Hands\": learning and generalization for cooperative physical interactions with a humanoid robot.",
            "Social utility Functions-part I: theory.",
            "Social utility Functions-part II: applications.",
            "Modular system synthesis: example for composite packaged software.",
            "Evolutionary design and optimization of aircraft engine controllers.",
            "Fuzzy tessellation approach for environmental site characterization.",
            "Face recognition using the weighted fractal neighbor distance.",
            "A novel approach to multiagent reinforcement learning: utilizing OLAP mining in the learning process.",
            "On the development of a computer-assisted testing system with genetic test sheet-generating approach.",
            "Extracting salient dimensions for automatic SOM labeling."
        ]
    },
    {
        "name": "IEEE Transactions on Human-Machine Systems",
        "year": "2004",
        "info": "Volume 34: 2004",
        "count": 51,
        "papers": [
            "Guest Editorial Special Issue on Computational Intelligence in Telecommunications Networks and Internet Services - Part III.",
            "Active Networking: One View of the Past, Present, and Future.",
            "An Active Networking Based Service for Media Transcoding in Multicast Sessions.",
            "Real-Time VBR Video Traffic Prediction for Dynamic Bandwidth Allocation.",
            "An Approach to Rollback Recovery of Collaborating Mobile Agents.",
            "An Extensible, Programmable, Commercial-Grade Platform for Internet Service Architecture.",
            "Service Configuration and Traffic Distribution in Composite Radio Environments.",
            "Component-Based Execution Environments of Network Elements and a Protocol for Their Configuration.",
            "Introduction to the Special Issue on Human-Robot Interaction.",
            "Final report for the DARPA/NSF interdisciplinary study on human-robot interaction.",
            "Involving users in the design of a mobile office robot.",
            "Roles for agent assistants in field science: understanding personal projects and collaboration.",
            "Human-robot interaction in rescue robotics.",
            "Spatial language for human-robot dialogs.",
            "Usability evaluation of high-level user assistance for robot mission specification.",
            "Social interactions in HRI: the robot view.",
            "Function meets style: insights from emotion theory applied to HRI.",
            "A social informatics approach to human-robot interaction with a service social robot.",
            "Envisioning human-robot coordination in future operations.",
            "A neural network approach-decision neural network (DNN) for preference assessment.",
            "Design of a six DOF reconfigurable gripper for flexible fixtureless assembly.",
            "Modeling search in group decision support systems.",
            "Introduction of independent players in a centrally planned market: decision support by long-term production costing.",
            "Toward agency and ontology for web-based information retrieval.",
            "Efficient web content delivery using proxy caching techniques.",
            "Fuzzy logic arbiters for multiple-bus multiprocessor systems.",
            "Learning algorithms for a class of neurofuzzy network and application.",
            "Model-reference adaptive control based on neurofuzzy networks.",
            "A new point process transition density model for space-time event prediction.",
            "Automatic visual recognition of deformable objects for grasping and manipulation.",
            "A survey on visual surveillance of object motion and behaviors.",
            "A simulation study on the evolution of hopping motions in animals.",
            "Neural-network-based predictive learning control of ram velocity in injection molding.",
            "iJADE WeatherMAN: a weather forecasting system using intelligent multiagent-based fuzzy neuro network.",
            "Special Issue on Learning: Advances in Multimedia Communications, Information Processing, and Education.",
            "A fixed-point algorithm to minimax learning with neural networks.",
            "Using all data to generate decision tree ensembles.",
            "Enhancing genetic feature selection through restricted search and Walsh analysis.",
            "Blind source separation in post-nonlinear mixtures using competitive learning, Simulated annealing, and a genetic algorithm.",
            "Hybrid higher-order statistics learning in multiuser detection.",
            "On understanding understanding. Perception-based processing of NL texts in SCIP systems, or meaning constitution as visualized learning.",
            "Fuzzy user modeling for adaptation in educational hypermedia.",
            "Stimulating creative design alternatives using customer values.",
            "Strategy-based design of reusable business components.",
            "An information-theoretical framework for modeling component-based systems.",
            "Multisensor fusion in the frame of evidence theory for landmines detection.",
            "Knowledge-based fuzzy color processing.",
            "Fuzzy estimation of feed-cutting force from current measurement-a case study on intelligent tool wear condition monitoring.",
            "Discovering golden nuggets: data mining in financial application.",
            "Ladder diagram and Petri-net-based discrete-event control design methods.",
            "A survey of motion-parallax-based 3-D reconstruction algorithms."
        ]
    },
    {
        "name": "IEEE Transactions on Human-Machine Systems",
        "year": "2003",
        "info": "Volume 33: 2003",
        "count": 52,
        "papers": [
            "Guest Editorial.",
            "Madan G. Singh (1946-2002): distinguished academic, scholar, and entrepreneur.",
            "The IEEE Systems, Man, and Cybernetics Society: historical development, current status, and future perspectives.",
            "Knowledge bounded least squares method for the identification of fuzzy systems.",
            "Fuzzy analytic network process and its application to the development of decision support systems.",
            "A decision support system for interactive decision making-Part I: model formulation.",
            "A decision support system for interactive decision making - Part II: analysis and output interpretation.",
            "Decision support system for urban transportation networks.",
            "A decision model for spatial site selection by criminals: a foundation for law enforcement decision support.",
            "Multiresolutional hierarchical decision support systems.",
            "Toward a decision informatics paradigm: a real-time, information-based approach to decision making.",
            "Pattern discovery: a data driven approach to decision support.",
            "Development and application of a Lyapunov synthesis based neural adaptive controller.",
            "The internationalization of engineering education: a tale of two countries.",
            "Engineering complex systems: implications for research in systems engineering.",
            "Special issue on intelligent techniques in flexible manufacturing systems.",
            "Virtual assembly with biologically inspired intelligence.",
            "Finite automata decomposition for flexible manufacturing systems control and scheduling.",
            "A distributed scheduling for agro-food manufacturing problems.",
            "Integrating simulation and optimization of manufacturing systems.",
            "Component and agent-based FMS modeling and controller synthesis.",
            "Extensions of an integrated approach for multi-resource shop scheduling.",
            "A fuzzy genetic multiobjective optimization algorithm for a multilevel generalized assignment problem.",
            "Reactive scheduling of complex system maintenance in a cooperative environment with communication times.",
            "Online pattern classification with multiple neural network systems: an experimental study.",
            "Subsethood based adaptive linguistic networks for pattern classification.",
            "A neural-network based control solution to air-fuel ratio control for automotive fuel-injection systems.",
            "Sensor fusion in anti-personnel mine detection using a two-level belief function model.",
            "Automated control synthesis for an assembly line using discrete event system control theory.",
            "Correction to \"A decision support system for interactive decision making - Part I: model formulation\".",
            "Correction to \"A decision support system for interactive decision making - Part II: analysis and output interpretation\".",
            "Correction to \"Binocular transfer method for point-feature tracking of image sequences\".",
            "Special issue on computational intelligence in telecommunications networks and Internet services. I.",
            "Optimizing QoS routing in hierarchical ATM networks using computational intelligence techniques.",
            "A genetic algorithm for the design of a fuzzy controller for active queue management.",
            "Design and implementation of a distributed evolutionary computing software.",
            "Key issues in next-generation Web-based education.",
            "Building reusable mobile agents for network management.",
            "Aggregated hierarchical multicast-a many-to-many communication paradigm using programmable networks.",
            "A domain-specific language approach to programmable networks.",
            "Collusion-secure and cost-effective detection of unlawful multimedia redistribution.",
            "Designing power aware self-reconfiguring topology for mobile wireless personal area networks using fuzzy logic.",
            "An enhanced intelligent DCA technique for unlicensed wLANs and PAWNs.",
            "Intelligent binding in the engineering of automation systems using ontology and Web services.",
            "A secure PLAN.",
            "Guest Editorial - Special issue on computational intelligence in telecommunications networks and internet services - Part II.",
            "Active security support for active networks.",
            "Creating value added services in Internet telephony: an overview and a case study on a high-level service creation environment.",
            "Materialized view selection as constrained evolutionary optimization.",
            "An intelligent-agent architecture for flexible service integration on the web.",
            "Towards intelligent geographic load balancing for mobile cellular networks.",
            "Adaptive provisioning of differentiated services networks based on reinforcement learning."
        ]
    },
    {
        "name": "IEEE Transactions on Human-Machine Systems",
        "year": "2002",
        "info": "Volume 32: 2002",
        "count": 43,
        "papers": [
            "Approach by localization and multiobjective evolutionary optimization for flexible job-shop scheduling problems.",
            "The application of robustness analysis to the conflict with incomplete information.",
            "Dynamic triangular neural controller for stepper motor trajectory tracking.",
            "Statistical analysis of the main parameters involved in the design of a genetic algorithm.",
            "Pursuit evasion: the herding noncooperative dynamic game - the stochastic model.",
            "Spectral fuzzy classification: an application.",
            "System-level training of neural networks for counting white blood cells.",
            "Improving group decision making: a fuzzy GSS approach.",
            "Guest editorial special issue on fusion of soft computing and hard computing in industrial applications.",
            "Fusion of soft computing and hard computing in industrial applications: an overview.",
            "Fusion of hard and soft computing techniques in indirect, online tool wear monitoring.",
            "Fusing hard and soft computing for fault management in telecommunications systems.",
            "Performance comparison of fused soft control/hard observer type controller with hard control/hard observer type controller for switched reluctance motors.",
            "Intelligent bounds on modeling uncertainty: applications to sliding mode control.",
            "Soft computing applications in aircraft sensor management and flight control law reconfiguration.",
            "Adaptive dynamic programming.",
            "Incorporating soft computing techniques into a probabilistic intrusion detection system.",
            "Computational military tactical planning system.",
            "Correction to \"approach by localization and multiobjective evolutionary optimization for flexible job-shop scheduling problems\".",
            "Modeling gait transitions of quadrupeds and their generalization with CMAC neural networks.",
            "Reliability, validity, and imprecision in fuzzy multicriteria decision-making.",
            "Characteristics of engineering systems thinking - a 3D approach for curriculum content.",
            "A genetic algorithm-based clustering approach for database partitioning.",
            "On the behavior-based architectures of autonomous agency.",
            "Aggregating evidence in pavement management decision-making using belief functions and qualitative Markov tree.",
            "Gaussian-based edge-detection methods - a survey.",
            "Evolution of digital images.",
            "On the development of a cooperative tutoring environment on computer networks.",
            "Need to know-information, knowledge, and decision making.",
            "A LP-RR principle-based admission control for a mobile network.",
            "Hybrid artificial intelligence methods in oceanographic forecast models.",
            "Petri nets and integrality relaxations: A view of continuous Petri net models.",
            "Fuzzy decision tree, linguistic rules and fuzzy knowledge-based network: generation and evaluation.",
            "Security PIDS with physical sensors, real-time pattern recognition, and continuous patrol.",
            "A distributed robotic control system based on a temporal self-organizing neural network.",
            "A prediction-based neural network scheme for lossless data compression.",
            "An approach for organizing knowledge according to terminology and representing it visually.",
            "Guaranteed robust nonlinear estimation with application to robot localization.",
            "Automatic construction of online catalog topologies.",
            "Binocular transfer methods for point-feature tracking of image sequences.",
            "An O(N) modular algorithm for the dynamic simulation of robots constrained by a single contact.",
            "A high precision global prediction approach based on local prediction approaches.",
            "Bio-mimetic trajectory generation of robots via artificial potential field with time base generator."
        ]
    },
    {
        "name": "IEEE Transactions on Human-Machine Systems",
        "year": "2001",
        "info": "Volume 31: 2001",
        "count": 54,
        "papers": [
            "PREHEP: human error probability based process unit selection.",
            "A novel iron loss reduction technique for distribution transformers based on a combined genetic algorithm - neural network approach.",
            "Dynamic programming solution for a class of pursuit evasion problems: the herding problem.",
            "A deadzone compensator of a DC motor system using fuzzy logic control.",
            "A neuro-fuzzy approach for robot system safety.",
            "Speaker identification for security systems using reinforcement-trained pRAM neural network architectures.",
            "Process operating mode monitoring: switching online the right controller.",
            "Hybrid applications of constraint satisfaction and meta-heuristics to railway timetabling: a comparative study.",
            "Intelligent decision support for the pricing of products and services in competitive consumer markets.",
            "A new approach to numerical stability analysis of fuzzy control systems.",
            "Gesture-based interaction and communication: automated classification of hand gesture contours.",
            "Nonparametric genetic clustering: comparison of validity indices.",
            "Complex character decomposition using deformable model.",
            "Model-aided diagnosis: an inexpensive combination of model-based and case-based condition assessment.",
            "A decision model and support system for the optimal design of health information networks.",
            "Optimum contouring of industrial robot arms under assigned velocity and torque constraints.",
            "A modeling and analysis methodology for modular logic controllers of machining systems using Petri net formalism.",
            "A heuristic genetic algorithm for subcontractor selection in a global manufacturing environment.",
            "Rule base reduction: some comments on the use of orthogonal transforms.",
            "A remote sensing-based integrated approach for sustainable development of land water resources.",
            "An overview of character recognition focused on off-line handwriting.",
            "Language identification of controlled systems: modeling, control, and anomaly detection.",
            "An efficient gray search algorithm for the estimation of motion vectors.",
            "An improved naive Bayesian classifier technique coupled with a novel input solution method [rainfall prediction].",
            "Assessment of operation plan performance under uncertainty.",
            "Intelligent feedback control-based adaptive resource management for asynchronous, decentralized real-time systems.",
            "Fault diagnosis of electronic systems using intelligent techniques: a review.",
            "An evolutionary approach to materialized views selection in a data warehouse environment.",
            "A web-based virtual laboratory on a frequency modulation experiment.",
            "A design framework for e-business infrastructure integration and resource management.",
            "Deregulated electricity market data representation by fuzzy regression models.",
            "Control architecture and operator interface for a free-flying robotic vehicle.",
            "Particle filtering based likelihood ratio approach to fault diagnosis in nonlinear stochastic systems.",
            "Integrating expert knowledge in environmental site characterization.",
            "Steady state hierarchical optimizing control for large-scale industrial processes with fuzzy parameters.",
            "A scheduling approach for design activities in concurrent engineering.",
            "Application of multiattribute decision analysis to quality function deployment for target setting.",
            "Multiresolution data integration using mobile agents in distributed sensor networks.",
            "Fuzzy temporal rules for mobile robot guidance in dynamic environments.",
            "Adaptive action selection without explicit communication for multirobot box-pushing.",
            "Path planning of 3-D objects using a new workspace model.",
            "Knowledge management tutorial: an editorial overview.",
            "Information seeking in social context: structural influences and receipt of information benefits.",
            "Cognizant enterprise maturity model (CEMM).",
            "Exploiting data preparation to enhance mining and knowledge discovery.",
            "DNA sequence classification via an expectation maximization algorithm and neural networks: a case study.",
            "Predictive and reactive approaches to the train-scheduling problem: a knowledge management perspective.",
            "Articulation management for intelligent integration of information.",
            "Learn++: an incremental learning algorithm for supervised neural networks.",
            "Stages of autonomy determination.",
            "Visualizing latent domain knowledge.",
            "Flood forecasting using radial basis function neural networks.",
            "Asymmetric hemisphere modeling in an offline brain-computer interface.",
            "Fast full search motion estimation algorithm using various matching scans in video coding."
        ]
    },
    {
        "name": "IEEE Transactions on Human-Machine Systems",
        "year": "2000",
        "info": "Volume 30: 2000",
        "count": 57,
        "papers": [
            "Human motor control: learning to control a time-varying, nonlinear, many-to-one system.",
            "An object-oriented, constraint-based heuristic for a class of passenger-train scheduling problems.",
            "Optimal design of CMAC neural-network controller for robot manipulators.",
            "Multi-expert operational risk management.",
            "A signal detection system based on Dempster-Shafer theory and comparison to fuzzy detection.",
            "Design of an integrated database for a multiplant cable manufacturer.",
            "A framework for fuzzy recognition technology.",
            "Probability density function estimation using the MinMax measure.",
            "To reject or not to reject: that is the question-an answer in case of neural classifiers.",
            "Chaos control on universal learning networks.",
            "A model-independent definition of attractor behavior applicable to interactive tasks.",
            "Virtual knowledge: bistable reality and the solution of ill-defined problems.",
            "Translation, rotation, and scale-invariant object recognition.",
            "An adaptive fuzzy-synchronous machine stabilizer.",
            "A comparison of some adaptive-predictive fuzzy-control strategies.",
            "Multisensor data fusion for surface land-mine detection.",
            "Prototyping structural description using an inductive learning program.",
            "Systems engineering education.",
            "Toward a unified systems engineering education.",
            "Project monitoring in a graduate engineering school.",
            "Practising what we teach: quality management of systems-engineering education.",
            "Negotiating knowledge in systems engineering curriculum design: shaping the present while struggling with the past.",
            "A comparison of systems engineering programs in the United States.",
            "Individual-centered education: An any one, any time, any where approach to engineering education.",
            "Representation of robot motion control skill.",
            "Exploratory analysis of factors influencing performance dynamics of telecommuters and traditional office workers.",
            "Concurrent design of machined products: a multivariate decision approach.",
            "Parallel system design for time-delay neural networks.",
            "A fuzzy rule-based approach to spatio-temporal hand gesture recognition.",
            "A fuzzy expert system for fault detection in statistical process control of industrial processes.",
            "Multiobjective programming using uniform design and genetic algorithm.",
            "On using fuzzy logic to integrate learning mechanisms in an electro-hydraulic system. I. Actuator's fuzzy modeling.",
            "On using fuzzy logic to integrate learning mechanisms in an electro-hydraulic system. II. Actuator's position control.",
            "Connection admission control in ATM networks using survey-based type-2 fuzzy logic systems.",
            "Using discretization and Bayesian inference network learning for automatic filtering profile generation.",
            "Real-time tool condition monitoring using wavelet transforms and fuzzy techniques.",
            "Models for air quality management and assessment.",
            "Anchor point indexing in Web document retrieval.",
            "Dynamic evaluation approach for virtual conflict decision training.",
            "Automated segmentation of human brain MR images aided by fuzzy information granulation and fuzzy inference.",
            "Cooperative problem solving in human-machine systems: theory, models, and intelligent associate systems.",
            "Optimization of automated high-speed modular placement machines using knowledge-based systems.",
            "Progressive random sampling: a multiperiod estimation technique with applications.",
            "Adaptive integrated image segmentation and object recognition.",
            "Dynamic knowledge inference and learning under adaptive fuzzy Petri net framework.",
            "Neural networks for classification: a survey.",
            "A hidden Markov model-based algorithm for fault diagnosis with partial and imperfect tests.",
            "A brokering protocol for agent-based e-commerce.",
            "Multiagent reinforcement learning using function approximation.",
            "A decision support algorithm to assess cost-effective control of detriments associated with a production planning system.",
            "Simulated annealing-based algorithms for the studies of the thermoelastic scaling behavior.",
            "Implementation of vision-based planar grasp planning.",
            "Solving a generalized constrained optimization problem with both logic AND and OR relationships by a mathematical transformation and its application to robot motion planning.",
            "Evolving color recipes.",
            "Adaptive friction compensation using neural network approximations.",
            "Combined heuristic knowledge and limited measurement based fuzzy logic antiskid control for railway applications.",
            "Analysis of the predictive ability of time delay neural networks applied to the S&P 500 time series."
        ]
    },
    {
        "name": "IEEE Transactions on Human-Machine Systems",
        "year": "1999",
        "info": "Volume 29: 1999",
        "count": 51,
        "papers": [
            "Measurement of cumulative trauma disorder risk in clerical tasks using fuzzy linear regression.",
            "Agent behaviors in virtual negotiation environments.",
            "How to select fair improving directions in a negotiation model over continuous issues.",
            "Variable neural networks for adaptive control of nonlinear systems.",
            "A genetic algorithm approach to a general category project scheduling problem.",
            "A log-linearized Gaussian mixture network and its application to EEG pattern classification.",
            "Exploiting process integration and composition in the context of active vision.",
            "Promises and challenges of evolvable hardware.",
            "Hierarchical rule-based and self-organizing fuzzy logic control for depth of anaesthesia.",
            "Cooperating agents for 3-D scientific data interpretation.",
            "Analyzing the media usage behavior of telework groups: a contingency approach.",
            "A fuzzy classifier with ellipsoidal regions for diagnosis problems.",
            "Neural-network-based fuzzy model and its application to transient stability prediction in power systems.",
            "A procedure for the optimization of air quality monitoring networks.",
            "A multisession comparative study of group size and group performance in an electronic meeting system environment.",
            "The chording glove: a glove-based text input device.",
            "Necessary and sufficient conditions for deadlock-free operation in flexible manufacturing systems using a colored Petri net model.",
            "Automatic data capture for geographic information systems.",
            "Reactive robots and amnesics: a comparative study in memoryless behavior.",
            "Can a GSS stimulate group polarization? an empirical study.",
            "Sensitivity analysis of neocognitron.",
            "Modeling and analysis of message passing in distributed manufacturing systems.",
            "Distributed and cooperative fuzzy controllers for traffic intersections group.",
            "Dynamic multistage software estimation.",
            "Integrated segmentation and recognition of handwritten numerals with cascade neural network.",
            "Analytical analysis and feedback linearization tracking control of the general Takagi-Sugeno fuzzy dynamic systems.",
            "A color texture based visual monitoring system for automated surveillance.",
            "Automatic landing method of a reclaimer on the stockpile.",
            "Risk Modeling, Assessment, And Management (Book Review).",
            "Development of an end-use model for analyzing policy options to reduce greenhouse gas emissions.",
            "Intelligent resource simulation for an airport check-in counter allocation system.",
            "A prescriptive production-distribution approach for decision making in new product design.",
            "Sufficient conditions for inventive solutions.",
            "A neuro fuzzy logic approach to material processing.",
            "MSS4TQM-a management support system for total quality management.",
            "Memory processes and motor control in extreme environments.",
            "Sustainable decision making: the role of decision support systems.",
            "VIATO-visual interactive aircraft trajectory optimization.",
            "A framework for building intelligent manufacturing systems.",
            "Temperature control with a neural fuzzy inference network.",
            "Sensor-based fuzzy reactive navigation of a mobile robot through local target switching.",
            "Neural net-based robust controller design for brushless DC motor drives.",
            "ATM traffic management and congestion control using fuzzy logic.",
            "A control-system architecture for robots used to simulate dynamic force and moment interaction between humans and virtual objects.",
            "New algorithms for learning and pruning oblique decision trees.",
            "Decision making in an uncertain world: information-gap modeling in water resources management.",
            "Adaptive-edge search for power plant start-up scheduling.",
            "A simulation approach based on negotiation and cooperation between agents: a case study.",
            "A comparative study of assembly planning in traditional and virtual environments.",
            "Calculating attribute values using inheritance structures in fuzzy object-oriented data models.",
            "Soft computing for multicustomer due-date bargaining."
        ]
    },
    {
        "name": "IEEE Transactions on Human-Machine Systems",
        "year": "1998",
        "info": "Volume 28: 1998",
        "count": 56,
        "papers": [
            "Maximizing sets and fuzzy Markoff algorithms.",
            "Quantitative industrial ecology.",
            "Graphbots: cooperative motion planning in discrete spaces.",
            "Supervised classification in high-dimensional space: geometrical, statistical, and asymptotical properties of multivariate data.",
            "On the construction of hierarchical fuzzy systems models.",
            "Multiple-prototype classifier design.",
            "The design-methods comparison project.",
            "Recursive calculation of probability distributions for sequential decision analysis models.",
            "New techniques for genetic development of a class of fuzzy controllers.",
            "A system for visualizing the viewpoints of information and its application to intelligent activity support.",
            "Design of industrial automated systems via relay ladder logic programming and Petri nets.",
            "Static data association with a terrain-based prior density.",
            "The role of leverage points in option generation.",
            "Nearest prototype classification: clustering, genetic algorithms, or random search?",
            "Rule-based modeling: precision and transparency.",
            "An overview of decision networks and organizations.",
            "A neural network based fuzzy set model for organizational decision making.",
            "AND/OR net representation for robotic task sequence planning.",
            "ITERATE: a conceptual clustering algorithm for data mining.",
            "Nonlinear system modeling by competitive learning and adaptive fuzzy inference system.",
            "An experimental approach to robotic grasping using a connectionist architecture and generic grasping functions.",
            "An experiment in automatic modeling an electrical drive system using fuzzy logic.",
            "An evidence-theoretic k-NN rule with parameter optimization.",
            "The role of qualitative knowledge in the formulation of compartmental models.",
            "Adaptive fusion of correlated local decisions.",
            "Feature selection by analyzing class regions approximated by ellipsoids.",
            "Inductive learning from preclassified training examples: an empirical study.",
            "Quantizability and learning complexity in multilayer neural networks.",
            "Supporting conceptual and neighborhood queries on the World Wide Web.",
            "Knowledge maps for knowledge mining: application to R&D/technology management.",
            "Computer-assisted conversation for nonvocal people using prestored texts.",
            "Backing control problem of a mobile robot with multiple trailers: fuzzy modeling and LMI-based design.",
            "Fuzzy inference system learning by reinforcement methods.",
            "Automated mathematical modeling from experimental data: an application to material science.",
            "Generating optimal adaptive fuzzy-neural models of dynamical systems with applications to control.",
            "A multi-objective genetic local search algorithm and its application to flowshop scheduling.",
            "A mathematical framework for solving dynamic optimization problems with adaptive networks.",
            "Bias and variance of validation methods for function approximation neural networks under conditions of sparse data.",
            "Optimal and near-optimal algorithms for multiple fault diagnosis with unreliable tests.",
            "Global stability of generalized additive fuzzy systems.",
            "On generating distributed intelligence systems architectures using genetic algorithms.",
            "Auditory guidance with the Navbelt-a computerized travel aid for the blind.",
            "A nonrecursive Newton-Euler formulation for the parallel computation of manipulator inverse dynamics.",
            "Automatically integrating multiple rule sets in a distributed-knowledge environment.",
            "Matching strengths of answers in fuzzy relational databases.",
            "Delayed reinforcement learning for adaptive image segmentation and feature extraction.",
            "Minimum entropy and information measure.",
            "A fuzzy due-date bargainer for the make-to-order manufacturing systems.",
            "R&D/technology management: a framework for putting technology to work.",
            "Re-evaluating systems engineering concepts using systems thinking.",
            "A survey of systems approaches to green design with illustrations from the computer industry.",
            "A multicriteria methodology for global negotiations on climate change.",
            "On replacement models via a fuzzy set theoretic framework.",
            "An empirical measure of element contribution in neural networks.",
            "The fractal architecture of the systems engineering method.",
            "Representing and comparing two kinds of fuzzy numbers."
        ]
    }
]