[
    {
        "name": "IJHCI",
        "year": "2021",
        "info": "2021: Volume 37",
        "count": 145,
        "papers": [
            "A Review and Reappraisal of Social Media Misuse: Measurements, Consequences, and Predictors.",
            "Collaboration Support in Co-located Collaborative Systems for Users with Autism Spectrum Disorders: A Systematic Literature Review.",
            "Effects of Visual Cues on Distance Perception in Virtual Environments Based on Object Identification and Visually Guided Action.",
            "Unifying Functional User Interface Design Principles.",
            "Quick Assessment of Web Content Perceptions.",
            "Systematic Review: Trust-Building Factors and Implications for Conversational Agent Design.",
            "Correction.",
            "Correction.",
            "Investigating the Relationship between Web Object Characteristics and Cognitive Conflict Using Mouse-tracking.",
            "Comparing Two Methods of Usability Testing in Saudi Arabia: Concurrent Think-Aloud vs. Co-Discovery.",
            "Depth and Breadth of Pie Menus for Mid-air Gesture Interaction.",
            "How Does Personification Impact Ad Performance and Empathy? An Experiment with Online Advertising.",
            "Cultural Impact on Perceptions of Aging, Care, and Lifelogging Technology: A Comparison between Turkey and Germany.",
            "Evaluation of a Hybrid of Hand Gesture and Controller Inputs in Virtual Reality.",
            "Self-identification with a Virtual Experience and Its Moderating Effect on Self-efficacy and Presence.",
            "Investigating the Effect of Deictic Movements of a Multi-Robot.",
            "Effects of Non-Driving-Related Task Attributes on Takeover Quality in Automated Vehicles.",
            "Use of Eye-tracking in Artworks to Understand Information Needs of Visitors.",
            "When Preschoolers Use Tablets: The Effect of Educational Serious Games on Children's Attention Development.",
            "Child-Robot Interaction in a Musical Dance Game: An Exploratory Comparison Study between Typically Developing Children and Children with Autism.",
            "Mapping Human-Computer Interaction Research Themes and Trends from Its Existence to Today: A Topic Modeling-Based Review of past 60 Years.",
            "Why Users Comply with Wearables: The Role of Contextual Self-Efficacy in Behavioral Change.",
            "Introduction to the Special Issue on Human-Computer Interaction in Autonomous Vehicle and Mobility.",
            "User Experience & Usability of Driving: A Bibliometric Analysis of 2000-2019.",
            "How to Increase Automated Vehicles' Acceptance through In-Vehicle Interaction Design: A Review.",
            "Comfort or Not? Automated Driving Style and User Characteristics Causing Human Discomfort in Automated Driving.",
            "How People Perceive and Expect Safety in Autonomous Vehicles: An Empirical Study for Risk Sensitivity and Risk-related Feelings.",
            "Take over Gradually in Conditional Automated Driving: The Effect of Two-stage Warning Systems on Situation Awareness, Driving Stress, Takeover Performance, and Acceptance.",
            "Warning Apps for Road Safety: A Technological and Economical Perspective for Autonomous Driving - The Warning Task in the Transition from Human Driver to Automated Driving.",
            "From Wayfinding Model to Future Context-based Adaptation of HCI in Urban Mobility for Pedestrians with Active Navigation Needs.",
            "Distrust as a Hazard for Future Sustainable Mobility Planning. Rethinking Employees' Vulnerability When Introducing New Information and Communication Technologies in Local Authorities.",
            "Attention: Theory, Principles, Models and Applications.",
            "Integrating Mobile Multimodal Interactions based on Programming By Demonstration​.",
            "Accountability Increases Resource Sharing: Effects of Accountability on Human and AI System Performance.",
            "Toward a Task-driven Intelligent GUI Adaptation by Mixed-initiative.",
            "The Effect of Adjusting Screen Height and Keyboard Placement on Neck and Back Discomfort, Posture, and Muscle Activities during Laptop Work.",
            "User Experience Evaluation: A Validation Study of a Tool-based Approach for Automatic Stress Detection Using Physiological Signals.",
            "Comparison of Eye-Based and Controller-Based Selection in Virtual Reality.",
            "Acknowledgement to external reviewers for reviews completed between January - December 2020.",
            "LooseLeaf, a Mobile-Based Application to Monitor Cannabis Use and Cannabis-Related Experiences for Youth at Clinical High-Risk for Psychosis: Development and User Acceptance Testing.",
            "Exploring the Privacy Concerns in Using Intelligent Virtual Assistants under Perspectives of Information Sensitivity and Anthropomorphism.",
            "A Personalized Pre-operative and Intra-operative Ergonomic Feedback to Improve the Dental Work Posture.",
            "The Effects of Consumers' In-Store Technology Experience on Perceived Interactivity, Retail Brand Commitment, and Revisit Intention in a Korean Beauty Store.",
            "Influences of Color Salience and Location of Website Links on User Performance and Affective Experience with a Mobile Web Directory.",
            "My Smart Speaker is Cool! Perceived Coolness, Perceived Values, and Users' Attitude toward Smart Speakers.",
            "Perceived Enjoyment and Attractiveness Influence Taiwanese Elementary School Students' Intention to Use Interactive Video Learning.",
            "Human Computer Interaction on the Modern Flight Deck.",
            "The Effects of Visual Complexity and Decluttering Methods on Visual Search and Target Detection in Cockpit Displays.",
            "Examining Minimum Information Requirements for Electronic Aeronautical Charts.",
            "Generating Design Requirements for Flight Deck Applications: Applying the Perceptual Cycle Model to Engine Failures on Take-off.",
            "Integrating Uncertified Information from the Electronic Flight Bag into the Aircraft Panel: Impacts on Pilot Response.",
            "High-Fidelity Line Operational Simulation Evaluation of Synthetic Vision Flight Deck Technology for Enhanced Unusual Attitude Awareness and Recovery.",
            "Flying by Feeling: Communicating Flight Envelope Protection through Haptic Feedback.",
            "Can't Touch This: Hammer Time on Touchscreen Task Performance Variability under Simulated Turbulent Flight Conditions.",
            "Mitigation of Biodynamic Feedthrough for Touchscreens on the Flight Deck.",
            "Plan B for Eliminating Mode Confusion: An Interpreter Display.",
            "Evaluation of Playbook Delegation Approach in Human-Autonomy Teaming for Single Pilot Operations.",
            "Mastering Automation: New Airline Pilots' Perspective.",
            "How Should My Chatbot Interact? A Survey on Social Characteristics in Human-Chatbot Interaction Design.",
            "Users' Cognitive and Affective Response to the Risk to Privacy from a Smart Speaker.",
            "Website Interactivity's Effects on Revisit Intention: A Moderated-Mediation Analysis of the Particulate Matter Issue in South Korea.",
            "In Search for Design Elements: A New Perspective for Employing Ethnography in Human-Computer Interaction Design Research.",
            "Computerized Device Equivalence: A Comparison of Surveys Completed Using A Smartphone, Tablet, Desktop Computer, and Paper-and-Pencil.",
            "Evaluating Usability of Mobile-Based Augmented Reality Learning Environments for Early Childhood.",
            "Comparing Youth Engagement on the AttentionTrip to the Child Attention Network Test.",
            "Interaction Styles in Context: Comparing Drag-and-Drop, Point-and-Touch, and Touch in a Mobile Spelling Game.",
            "A Reflection on Virtual Reality Design for Psychological, Cognitive and Behavioral Interventions: Design Needs, Opportunities and Challenges.",
            "Using Reflexive Photography to Investigate Design Affordances for Creativity in Digital Entertainment Games.",
            "A Lightweight Mobile Outdoor Augmented Reality Method Using Deep Learning and Knowledge Modeling for Scene Perception to Improve Learning Experience.",
            "University Students' Perception of Video-Based Learning in Times of COVID-19: A TAM/TTF Perspective.",
            "Knowledge, Perceived Benefits, Adoption, and Use of Smart Home Products.",
            "Older Adults' Online Shopping Continuance Intentions: Applying the Technology Acceptance Model and the Theory of Planned Behavior.",
            "Online Financial Trading among Young Adults: Integrating the Theory of Planned Behavior, Technology Acceptance Model, and Theory of Flow.",
            "Detection of Affective States of the Students in a Blended Learning Environment Comprising of Smartphones.",
            "Artificial Intelligence Is Trusted Less than a Doctor in Medical Treatment Decisions: Influence of Perceived Care and Value Similarity.",
            "Determination of Player Types according to Digital Game Playing Preferences: Scale Development and Validation Study.",
            "Assessing Academics' Perceptions of Blackboard Usability Using SUS and CSUQ: A Case Study during the COVID-19 Pandemic.",
            "Can an Engagement Platform Persuade Students to Stay? Applying Behavioral Models for Retention.",
            "Memoryscapes: Designing Situated Narratives of Place through Heritage Collections.",
            "Insights into Older Adults' Technology Acceptance through Meta-Analysis.",
            "Effect of Imperfect Information and Action Automation on Attentional Allocation.",
            "Evaluating Use of the Doppler Effect to Enhance Auditory Alerts.",
            "Correction.",
            "Video Game Interfaces and Diegesis: The Impact on Experts and Novices' Performance and Experience in Virtual Reality.",
            "Ping Pong: An Exergame for Cognitive Inhibition Training.",
            "Study of Full-body Virtual Embodiment Using noninvasive Brain Stimulation and Imaging.",
            "The More, the Merrier? - How Adding and Removing Game Design Elements Impact Motivation and Performance in a Gamification Environment.",
            "Interpersonalizing Intimate Museum Experiences.",
            "Screen Mirroring is not as Easy as it Seems: A Closer Look at Older Adults' Cross-Device Experience Through Touch Gestures.",
            "Empirical Decision Rules for Improving the Uncertainty Reporting of Small Sample System Usability Scale Scores.",
            "The Effects of Feedback and Goal on the Quality of Crowdsourcing Tasks.",
            "Visualizing Off-screen Targets: Effects of Response Time and Visual Cue Design on Users' Wayfinding Performance Using a Dynamic Peephole Interface.",
            "Selfish or Utilitarian Automated Vehicles? Deontological Evaluation and Public Acceptance.",
            "Exploring Influence Factors of WeChat Users' Health Information Sharing Behavior: Based on an Integrated Model of TPB, UGT and SCT.",
            "Characteristics of Technology Adoption by Older Adults with Visual Disabilities.",
            "The Effect of Value Similarity on Trust in the Automation Systems: A Case of Transportation and Medical Care.",
            "Mobile Application User Experience Checklist: A Tool to Assess Attention to Core UX Principles.",
            "The Effects of Initial-Terminal Position on Pointing Task for Touch-Screen Tablet.",
            "Moving Fast and Slow: Analysis of Representations and Post-Processing in Speech-Driven Automatic Gesture Generation.",
            "What Drives Gift-giving Intention in Live Streaming? The Perspectives of Emotional Attachment and Flow Experience.",
            "The Migration of Viewers in Gaming Streaming: The Perspective of a Push-Pull-Mooring Model.",
            "Toward Trustworthy and Comfortable Lane Keeping Assistance System: An Empirical Study of the Level of Haptic Authority.",
            "Self-Driving Vehicles and Pedestrian Interaction: Does an External Human-Machine Interface Mitigate the Threat of a Tinted Windshield or a Distracted Driver?",
            "Prediction of Navigational Decisions in the Real-World: A Visual P300 Event-Related Potentials Brain-Computer Interface.",
            "Barriers to AV Bus Acceptance: A National Survey and Research Agenda.",
            "Effect of Touch Button Interface on In-Vehicle Information Systems Usability.",
            "Designing Immersive Stories for Health: Choosing Character Perspective Based on the Viewer's Modality.",
            "Video Cameras for Lifelogging at Home: Preferred Visualization Modes, Acceptance, and Privacy Perceptions among German and Turkish Participants.",
            "Online Privacy Literacy and Online Privacy Behavior - The Role of Crystallized Intelligence and Personality.",
            "Driver Situation Awareness and Perceived Sleepiness during Truck Platoon Driving - Insights from Eye-tracking Data.",
            "Usability Evaluation of Police Mobile Computer Terminals: A Focus Group Study.",
            "A Usability Study of the Central-Bantu Multilingual Keyboards.",
            "SNS Adoption for Consumer Active Information Search (AIS) - the Dyadic Role of Information Credibility.",
            "User-Defined Gestures for Mid-Air Interaction: A Comparison of Upper Limb Muscle Activity, Wrist Kinematics, and Subjective Preference.",
            "Chinese UMUX: Cross-Cultural Adaptation for Perceived Usability Measurement.",
            "ViBreathe: Heart Rate Variability Enhanced Respiration Training for Workaday Stress Management via an Eyes-Free Tangible Interface.",
            "Psychometric Evaluation of the F-SUS: Creation and Validation of the French Version of the System Usability Scale.",
            "Correction.",
            "Applying Bioaffordances through an Inquiry-Based Model: A Literature Review of Interactive Biodesign.",
            "Content Prioritization Based on Usage Pattern Analysis.",
            "WristDial: An Eyes-Free Integer-Value Input Method by Quantizing the Wrist Rotation.",
            "Haptic Responses to Angry and Happy Faces.",
            "The Impact of Interactivity on User Satisfaction in Digital Social Reading: Social Presence as a Mediator.",
            "Examining the Use of Nonverbal Communication in Virtual Agents.",
            "Advantages of Print Reading over Screen Reading: A Comparison of Visual Patterns, Reading Performance, and Reading Attitudes across Paper, Computers, and Tablets.",
            "A Survey of 15 Years of Data-Driven Persona Development.",
            "Do Warning Message Design Recommendations Address Why Non-Experts Do Not Protect Themselves from Cybersecurity Threats? A Review.",
            "Extensible, Extendable, Expandable, Extractable: The 4E Design Approach for Reconfigurable Displays.",
            "Visual Enhancements for the Driver's Information Search on Automotive Head-up Display.",
            "Designing a Digital Assistant for Developing a Life Plan.",
            "I Like My Relational Machine Teacher: An AI Instructor's Communication Styles and Social Presence in Online Education.",
            "Investigating the Effectiveness of Virtual Reality for Culture Learning.",
            "E-Grocery Retailing Mobile Application: Discerning Determinants of Repatronage Intentions in an Emerging Economy.",
            "M-AR: A Visual Representation of Manual Operation Precision in AR Assembly.",
            "Arabic Translation, Cultural Adaptation and Psychometric Validation of the Post-Study System Usability Questionnaire (PSSUQ).",
            "From Design Requirements to Effective Privacy Notifications: Empowering Users of Online Services to Make Informed Decisions.",
            "Wireless Ranging for Contactless Cognitive Load Inference in Ubiquitous Computing.",
            "Evaluating the Use of Smartwatches for Learning Purposes through the Integration of the Technology Acceptance Model and Task-Technology Fit.",
            "A Heterophenomenological Framework for Analyzing User Experiences with Affordances.",
            "Augmented Reality of 3D Content Application in Common Operational Picture Training System for Army.",
            "Examining the Effects of Feedback-giving as a Gamification Mechanic in Crowd Rating Systems.",
            "Exploring User Micro-Behaviors Towards Five Wearable Device Types in Everyday Learning-Oriented Scenarios.",
            "User Requirements for Inclusive Technology for Older Adults.",
            "Investigate Symmetry, Complexity, and Screen Shapes in Interface Design Aesthetics to Promote Users' Quality Perceptions and Continuous Usage Intention of the Smartwatch.",
            "An Arabic Translation of the Computer System Usability Questionnaire (CSUQ) with Psychometric Evaluation Using Kuwait University Portal."
        ]
    },
    {
        "name": "IJHCI",
        "year": "2020",
        "info": "2020: Volume 36",
        "count": 146,
        "papers": [
            "TapSix: A Palm-Worn Glove with a Low-Cost Camera Sensor that Turns a Tactile Surface into a Six-Key Chorded Keyboard by Detection Finger Taps.",
            "Cyberslacking or Smart Work: Smartphone Usage Log-Analysis Focused on App-Switching Behavior in Work and Leisure Conditions.",
            "Runners' Perspectives on 'Smart' Wearable Technology and Its Use for Preventing Injury.",
            "Evaluating Simultaneous Visual Instructions with Kindergarten Children on Touchscreen Devices.",
            "A Dynamic User Interface Based BCI Environmental Control System.",
            "Interactive Immersive Public Displays as Facilitators for Deeper Participation in Urban Planning.",
            "Investigating the Combination of Adaptive UIs and Adaptable UIs for Improving Usability and User Performance of Complex UIs.",
            "Objective Design to Subjective Evaluations: Connecting Visual Complexity to Aesthetic and Usability Assessments of eHealth.",
            "Brain-Computer Interface Games Based on Consumer-Grade EEG Devices: A Systematic Literature Review.",
            "Relationship between System Parameters and Operator's Haptic Sensation in Bilateral Controlled Master-Slave System.",
            "Predicting the Use of Brand Application Based on a TRAM.",
            "Healthier Life with Digital Companions: Effects of Reflection-Level and Statement-Type of Messages on Behavior Change via a Perceived Companion.",
            "Psychosocial Outcomes Associated with Engagement with Online Chat Systems.",
            "Development of an Approach to Measuring Learnability Based on NGOMSL from Perspectives of Extended Learnability.",
            "Characteristics of Chinese Online Movie Reviews and Opinion Leadership Identification.",
            "Aiming the Mobile Targets in a Cross-Cultural Context: Effects of Trust, Privacy Concerns, and Attitude.",
            "Moderating Role of Long-Term Orientation on Augmented Reality Adoption.",
            "Understanding Interaction Design Challenges in Mobile Extreme Citizen Science.",
            "The Role of Flow in Dissemination of Recommendations for Hedonic Products in User-Generated Review Websites.",
            "Correlations between Human Performance in Information Seeking, Information Integration, and Overall Process in Diagnostic Tasks.",
            "Takeover Transition in Autonomous Vehicles: A YouTube Study.",
            "The Effects of Interactivity on the Attitudes and Intentions about Second-hand Smoke: Comparison of Two Mechanisms.",
            "Anticipated Emotions in Initial Trust Evaluations of a Drone System Based on Performance and Process Information.",
            "Continuous Stress Monitoring under Varied Demands Using Unobtrusive Devices.",
            "Creating Effective Automation to Maintain Explicit User Engagement.",
            "Planting the Seed of Positive Human-IoT Interaction.",
            "Examining Course Layouts in Blackboard: Using Eye-Tracking to Evaluate Usability in a Learning Management System.",
            "The Social Media Party: Fear of Missing Out (FoMO), Social Media Intensity, Connection, and Well-Being.",
            "Students' Continuance Intention Toward Programming Games: Hedonic and Utilitarian Aspects.",
            "The Effect of Online Customization on Consumers' Happiness and Purchase Intention and the Mediating Roles of Autonomy, Competence, and Pride of Authorship.",
            "Designing an Electronic Brainstorming Environment for Engaging East-Asian Teams.",
            "Autonomous Taxi Service Design and User Experience.",
            "The Role of Individuals' Need for Online Social Interactions and Interpersonal Incompetence in Digital Game Addiction.",
            "Assessing Engagement during Rescue Operation Simulated in Virtual Reality: A Psychophysiological Study.",
            "Enhancing Social Closeness between Drivers by Digital Augmentation.",
            "Human-Centered Artificial Intelligence: Reliable, Safe & Trustworthy.",
            "Social Environment Simulation in VR Elicits a Distinct Reaction in Subjects with Different Levels of Anxiety and Somatoform Dissociation.",
            "Multilingual News-An Investigation of Consumption, Querying, and Search Result Selection Behaviors.",
            "A Toolkit for Prototyping Tabletop-Centric Cross-Device Interaction.",
            "A Cross-organizational Ecology for Virtual Communities of Practice in Higher Education.",
            "Does a Smile Matter if the Person Is Not Real?: The Effect of a Smile and Stock Photos on Persona Perceptions.",
            "A Systematic Review of the Personality of Robot: Mapping Its Conceptualization, Operationalization, Contextualization and Effects.",
            "Correction.",
            "Investigating the Willingness of Sharing Real-Time Daily Activities among Friends.",
            "Leap Motion- and Mouse-Based Target Selection: Productivity, Perceived Comfort and Fatigue, User Preference, and Perceived Usability.",
            "Abnormal Usage Sequence Detection for Identification of User Needs via Recurrent Neural Network Semantic Variational Autoencoder.",
            "An Evaluation of Uncertainty and Anticipatory Anxiety Impacts on Technology Use.",
            "Robot Transparency and Team Orientation Effects on Human-Robot Teaming.",
            "The Impact of Virtual Reality on Curiosity and Other Positive Characteristics.",
            "Effects of Progressive Visuospatial Cues on EFL Learners' Processing of Animated Visualizations Through Mobile Device.",
            "Grasping VR: Presence of Pseudo-Haptic Interface Based Portable Hand Grip System in Immersive Virtual Reality.",
            "Design of Semantic-Based Colorization of Graphical User Interface Through Conditional Generative Adversarial Nets.",
            "Translation and Validation of the System Usability Scale in a Danish Mental Health Setting Using Digital Technologies in Treatment Interventions.",
            "Decreasing the Presentation Speed of Animated Soccer Scenes Does Not Always Lead to Better Learning Outcomes in Young Players.",
            "Exploring the Typology and Impacts of Audience Gratifications Gained from TV-Smartphone Multitasking.",
            "Can You Easily Perceive the Local Environment? A User Interface with One Stitched Live Video for Mobile Robotic Telepresence Systems.",
            "A Formal Modeling Framework for the Implementation of Gaze Guiding as an Adaptive Computer-Based Job Aid for the Control of Complex Technical Systems.",
            "Investigation of an EEG-based Indicator of Skill Acquisition as Novice Participants Practice a Lifeboat Maneuvering Task in a Simulator.",
            "Persona Transparency: Analyzing the Impact of Explanations on Perceptions of Data-Driven Personas.",
            "Bibliometric Analysis of Affective Computing Researches during 1999~2018.",
            "Using Physiological Recordings for Studying User Experience: Case of Conversational Agent-Equipped TV.",
            "Combined Effect of Multiple Performance Shaping Factors on Human Reliability: Multiplicative or Additive?",
            "Social Glasses: Simulating Interactive Gaze for Visually Impaired People in Face-to-Face Communication.",
            "Adaptive Visual Assistance System for Enhancing the Driver Awareness of Pedestrians.",
            "How User's First Impression Forms on Mobile user Interface?: An ERPs Study.",
            "Who Do You Prefer? The Effect of Age, Gender and Role on Users' First Impressions of Embodied Conversational Agents in eHealth.",
            "A Systematic Review of a Virtual Reality System from the Perspective of User Experience.",
            "User-Centered Design Approaches to Integrating Intellectual Property Information into Early Design Processes with a Design Patent Retrieval Application.",
            "Perceiving a Mind in a Chatbot: Effect of Mind Perception and Social Cues on Co-presence, Closeness, and Intention to Use.",
            "Predictors of Perceived Learning in a Distance Learning Environment from the Perspective of SIPS Model.",
            "Chinese System Usability Scale: Translation, Revision, Psychological Measurement.",
            "Using Live Video Streaming in Online Tutoring: Exploring Factors Affecting Social Interaction.",
            "User-Defined Gestures for Dual-Screen Mobile Interaction.",
            "User Acceptance of Virtual Reality: An Extended Technology Acceptance Model.",
            "An Exploratory Study Using Electroencephalography (EEG) to Measure the Smartphone User Experience in the Short Term.",
            "Investigating the Crowd's Creativity for Creating On-Demand IoT Scenarios.",
            "An Arabic Adaptation of the Usability Metric for User Experience (UMUX).",
            "The Assessment Scale for Creative Collaboration (ASCC) Validation and Reliability Study.",
            "Reliability of Perceived Usability Assessment via Crowdsourcing Platform: Retrospective Analysis and Novel Feedback Quality Inspection Method.",
            "Impacts of Situational Factors on Consumers' Adoption of Mobile Payment Services: A Decision-Biases Perspective.",
            "Determinants of Trust in Health Information Technology: An Empirical Investigation in the Context of an Online Clinic Appointment System.",
            "The Influence of Smartphone Text Input Method, Posture, and Environment on User Experience.",
            "Inciting Incidents: How Can We Motivate Family Conversations about Health?",
            "Designing Embodied Virtual Agents as Product Specialists in a Multi-Product Category E-Commerce: The Roles of Source Credibility and Social Presence.",
            "Effect of Warning Graphics Location on Driving Performance: An Eye Movement Study.",
            "Cybersickness in Virtual Reality Head-Mounted Displays: Examining the Influence of Sex Differences and Vehicle Control.",
            "Understanding Continuance Intention toward Crowdsourcing Games: A Longitudinal Investigation.",
            "Multi-Device Use: Understanding the Motivations behind Switching between Multiple Devices during a Task.",
            "Correction.",
            "Player Experience of Needs Satisfaction (PENS) in an Immersive Virtual Reality Exercise Platform Describes Motivation and Enjoyment.",
            "Gaming Insight: Conversion of Popular Sedentary Games into Motion-Based Form.",
            "Perceived Usability and the Modified Technology Acceptance Model.",
            "Effects of Cognitive Style and Information Acquisition Method on Diagnosis Task Performance.",
            "Haptic Feedback Helps Me? A VR-SAR Remote Collaborative System with Tangible Interaction.",
            "External Interface-based Autonomous Vehicle-to-Pedestrian Communication in Urban Traffic: Communication Needs and Design Considerations.",
            "Customization Support in Computer-Based Technologies for Autism: A Systematic Mapping Study.",
            "Acknowledgement to reviewers for reviews completed between January - December 2019.",
            "Home-care Professionals' Ethical Perceptions of the Development and Use of Home-care Robots for Older Adults in Japan.",
            "Does Emotional Intelligence of Online Shoppers Affect Their Shopping Behavior? From a Cognitive-Affective-Conative Framework Perspective.",
            "China's New Mania for Live Streaming: Gender Differences in Motives and Uses of Social Live Streaming Services.",
            "\"I Am Most Grateful.\" Using Gratitude to Improve the Sense of Relatedness and Motivation for Online Volunteerism.",
            "How Can Online Communities Support Resilience Factors among Older Adults.",
            "Designing a Scalable, Accessible, and Effective Mobile App Based Solution for Common Mental Health Problems.",
            "Differentiating between the \"Need\" for and the \"Experience\" of Self-determination Regarding Their Influence on Pupils' Learning of Creativity through Story-based Digital Games.",
            "Automatic Nonverbal Mimicry Detection and Analysis in Medical Video Consultations.",
            "Design Guidelines for Schematizing and Rendering Haptically Perceivable Graphical Elements on Touchscreen Devices.",
            "Dangerous or Desirable: Utilizing Augmented Content for Field Policing.",
            "Enterprise Social Media and Cyber-slacking: An Integrated Perspective.",
            "Emotional Satisfaction and IS Continuance Behavior: Reshaping the Expectation-Confirmation Model.",
            "Empowering Caregivers to Customizing the Assistive Computing Support of Older Adults - an End-User Domain-Specific Approach.",
            "From Consensus to Innovation. Evolving Towards Crowd-based User-Centered Design.",
            "Feedback Control to a Static Target Angle in the Middle Finger Metacarpophalangeal Joint Using Functional Electrical Stimulation.",
            "Correction.",
            "Talking Head-based L2 Pronunciation Training: Impact on Achievement Emotions, Cognitive Load, and Their Relationships with Learning Performance.",
            "A Shoe Is a Shoe Is a Shoe: Interpersonalization and Meaning-making in Museums - Research Findings and Design Implications.",
            "Towards Personalized Movie Selection for Wellness: Investigating Event-Inspired Movies.",
            "Estimating Level of Engagement from Ocular Landmarks.",
            "Effect of Visual Awareness of the Real Hand on User Performance in Partially Immersive Virtual Environments: Presence of Virtual Kinesthetic Conflict.",
            "User Requirement Analysis for Smart Voice Technology for Older Adults with Visual Impairments.",
            "Interactive Web Documentaries: A Case Study of Audience Reception and User Engagement on iOtok.",
            "A Quantitative Measurement Model for Persuasive Technologies Using Storytelling via a Virtual Narrator.",
            "Open Challenges of Blind People Using Smartphones.",
            "Older Adults and Web 2.0 Storytelling Technologies: Probing the Technology Acceptance Model through an Age-related Perspective.",
            "Exposed by AIs! People Personally Witness Artificial Intelligence Exposing Personal Information and Exposing People to Undesirable Content.",
            "System Dialog Message and Its Effect on Task Switching by Age.",
            "Virtual Reality Sickness: A Review of Causes and Measurements.",
            "Exploring the Relative Effects of Body Position and Spatial Cognition on Presence When Playing Virtual Reality Games.",
            "3D Travel Comparison Study between Multi-Touch and GamePad.",
            "Design for Luxury Front-Seat Passenger Infotainment Systems with Experience Prototyping through VR.",
            "Freehand-Steering Locomotion Techniques for Immersive Virtual Environments: A Comparative Evaluation.",
            "Comparing Flat and Edge-Screen Smartphones Operated on a One-Hand-Only Basis: A Video Observation in Laboratory Settings.",
            "Why Is Artificial Intelligence Blamed More? Analysis of Faulting Artificial Intelligence for Self-Driving Car Accidents in Experimental Settings.",
            "Cultural Differences in Self-Expression on Facebook: A Comparison of Facebook Status Updates in Turkey and the U.S.A.",
            "Identifying Causes of and Solutions for Cybersickness in Immersive Technology: Reformulation of a Research and Development Agenda.",
            "A Systematic Review of Ten Years of Research on Human Interaction with Social Robots.",
            "Understanding Social Interaction across Social Network Sites.",
            "Online Privacy Breaches, Offline Consequences: Construction and Validation of the Concerns with the Protection of Informational Privacy Scale.",
            "Asymmetry in Usability Evaluation of the Assistive Technology among Users With and Without Disabilities.",
            "Remote Deictic Communication: Simulating Deictic Pointing Gestures across Distances Using Electro Muscle Stimulation.",
            "Multi-Language Toolkit for the System Usability Scale.",
            "My Teacher Is a Machine: Understanding Students' Perceptions of AI Teaching Assistants in Online Education.",
            "Aladdin's magic carpet: Navigation by in-air static hand gesture in autonomous vehicles.",
            "Sexist AI: An Experiment Integrating CASA and ELM.",
            "Motivation and Evaluation Criteria Influencing Consumer Experience of One-Person Media.",
            "Personality Traits and Intention to Continue Using Massive Open Online Courses (ICM) in Spain: The Mediating Role of Motivations.",
            "Just Sit Back and Watch: Large Disparities between Video and Face-to-face Interview Observers in Applicant Ratings."
        ]
    },
    {
        "name": "IJHCI",
        "year": "2019",
        "info": "2019: Volume 35",
        "count": 158,
        "papers": [
            "Serious Game for Children with Autism to Learn Vocabulary: An Experimental Evaluation.",
            "The Effect of Learning in a Virtual Environment on Explicit and Implicit Memory by Applying a Process Dissociation Procedure.",
            "Influence of Gift-Giving in Social Network Games on Social Capital: Relationship Types, Gift-Giving Types, and the Big Five Factors of Personality.",
            "Supporting Social Interaction in Care Environments: Exploring Stakeholder Perspectives on the Potential of Interactive Technology.",
            "Complexity of In-Vehicle Controllers and Their Effect on Task Performance.",
            "Virtual Reality Interfaces for Interacting with Three-Dimensional Graphs.",
            "Attention for Web Directory Advertisements: A Top-Down or Bottom-Up Process?",
            "Multiscreen Social TV System: A Mixed Method Understanding of Users' Attitudes and Adoption Intention.",
            "Designing an Algorithm-Driven Text Generation System for Personalized and Interactive News Reading.",
            "The Impact of Geographic Location on the Subjective Assessment of System Usability.",
            "What Is Good Help? Responses to Solicited and Unsolicited Assistance.",
            "Older Adults' Physical Activity and Exergames: A Systematic Review.",
            "Reflecting on the Design Process for Virtual Reality Applications.",
            "Motion-Display Gain: A New Control-Display Mapping Reflecting Natural Human Pointing Gesture to Enhance Interaction with Large Displays at a Distance.",
            "Erratum.",
            "Towards a Hybrid BCI Gaming Paradigm Based on Motor Imagery and SSVEP.",
            "The Impact of Interrupting Nurses on Mental Workload in Emergency Departments.",
            "Do Individual Characteristics Influence the Types of Technostress Reported by Workers?",
            "A Clustered-Based Categorization of Millennials in their Technology Behavior.",
            "Using Variable Dwell Time to Accelerate Gaze-Based Web Browsing with Two-Step Selection.",
            "Argumentation Models for Usability Problem Analysis in Individual and Collaborative Settings.",
            "EduGene: A UIDP-Based Educational App Generator for Multiple Devices and Platforms.",
            "Human Factors and Personalized Digital Learning: An Editorial.",
            "Differences between EFL Beginners and Intermediate Level Readers When Reading Onscreen Narrative Text with Pictures: A Study of Eye Movements as a Guide to Personalization.",
            "Exploring the Relationships between Reading Behavior Patterns and Learning Outcomes Based on Log Data from E-Books: A Human Factor Approach.",
            "Influence of an Interactive e-Book on the Reading Comprehension of Different Ethnic Groups Using Indigenous Culture as Content.",
            "Impacts of Different Smartphone Caption/Subtitle Mechanisms on English Listening Performance and Perceptions of Students with Different Learning Styles.",
            "Strategies for Multimedia Learning Object Recommendation in a Language Learning Support System: Verbal Learners Vs. Visual Learners.",
            "Supporting Self-Regulated Learning in Online Learning Environments and MOOCs: A Systematic Review.",
            "Effects of Children's Trait Emotional Intelligence on Digital Game-Based Learning.",
            "The Effects of Human Factors on the Use of Avatars in Game-Based Learning: Customization vs. Non-Customization.",
            "The Relationships among Gender, Cognitive Styles, Learning Strategies, and Learning Performance in the Flipped Classroom.",
            "Personalized Wearable Guides or Audio Guides: An Evaluation of Personalized Museum Guides for Improving Learning Achievement and Cognitive Load.",
            "Effect of Prior Knowledge on Attitudes, Behavior, and Learning Performance in Video Lecture Viewing.",
            "An Investigation of 3D Human Pose Estimation for Learning Tai Chi: A Human Factor Perspective.",
            "Adaptation and Validation of the Temple Presence Inventory in a Portuguese Population.",
            "I Know My Professor: Teacher Self-Disclosure in Online Education and a Mediating Role of Social Presence.",
            "A Personal Resource for Technology Interaction: Development and Validation of the Affinity for Technology Interaction (ATI) Scale.",
            "Optimization of Split Keyboard Design for Touchscreen Devices.",
            "Understanding the Effect of Handedness on Both-Handed Task Performance: An Experimental Study based on a Haptic-Controlled, Simulation-Based Surgical Skill Training Scenario.",
            "Exploring Relationships Between Eye Tracking and Traditional Usability Testing Data.",
            "User Roles in Online Communities and Their Moderating Effect on Online Community Usage Intention: An Integrated Approach.",
            "Computational Modeling of Touchscreen Drag Gestures Using a Cognitive Architecture and Motion Tracking.",
            "Exploring Preservice Teachers' Emotional Experiences in an Immersive Virtual Teaching Simulation through Facial Expression Recognition.",
            "An Empirical Study of Home IoT Services in South Korea: The Moderating Effect of the Usage Experience.",
            "How Social Network Site Users' Motives Predict Their Online Network Sizes: A Quantile Regression Approach to Japanese Twitter Usage.",
            "An Tactile ERP-Based Brain-Computer Interface for Communication.",
            "Inclusive Web Empirical Studies in Remote and In-Situ Settings: A User Evaluation of the RemoTest Platform.",
            "Enhancing Employee Job satisfaction via E-learning: The Mediating Role of an Organizational Learning Culture.",
            "\"Reliving my Childhood Dream of being a Pokémon Trainer\": An Exploratory Study of College Student Uses and Gratifications Related to Pokémon Go.",
            "Evaluating the Use of Daily Care Notes Software for Older People with Dementia.",
            "Comparison of Gaze Cursor Input Methods for Virtual Reality Devices.",
            "Cybersecurity for Android Applications: Permissions in Android 5 and 6.",
            "Special Issue on Designing With and For Users on the Autism Spectrum.",
            "A Tablet Computer-Assisted Motor and Language Skills Training Program to Promote Communication Development in Children with Autism: Development and Pilot Study.",
            "Thinking OutsideTheBox - Designing Smart Things with Autistic Children.",
            "\"Today I Tell\" A Comics and Story Creation App for People with Autism Spectrum Condition.",
            "Collaborative Virtual Environment to Facilitate Game Design Evaluation with Children with ASC.",
            "Participatory Design of a Hybrid Kinect Game to Promote Collaboration between Autistic Players and Their Peers.",
            "Using Semantic Context to Rank the Results of Keyword Search.",
            "Dashboards to Support Operational Decision Making in Health Centers: A Case for Role-Specific Design.",
            "Applying Spatial Augmented Reality to Anti-Smoking Message: Focusing on Spatial Presence, Negative Emotions, and Threat Appraisal.",
            "Investigating the Effect of System Reliability, Risk, and Role on Users' Emotions and Attitudes toward a Safety-Critical Drone System.",
            "Investigating the User Behaviors of Sharing Health- and Fitness-Related Information Generated by Mi Band on Weibo.",
            "Development and Application of a Classification System for Voice Intelligent Agents.",
            "Head-up Display Graphic Warning System Facilitates Simulated Driving Performance.",
            "Uses and Gratifications of Pokémon Go: Why do People Play Mobile Location-Based Augmented Reality Games?",
            "Correction.",
            "A MORF-Vision Method for Strategic Creation of IoT Solution Opportunities.",
            "Amphitheater Layout with Egocentric Distance-Based Item Sizing and Landmarks for Browsing in Virtual Reality.",
            "Toward Brain-Actuated Mobile Platform.",
            "Determinants of Mobile Wallet Intentions to Use: The Mental Cost Perspective.",
            "HealthSit: Designing Posture-Based Interaction to Promote Exercise during Fitness Breaks.",
            "An Empirical Study of the Impacts of Perceived Security and Knowledge on Continuous Intention to Use Mobile Fintech Payment Services.",
            "m-Government Security Response System: Predicting Citizens' Adoption Behavior.",
            "Human - System Cooperation in Automated Driving.",
            "Evaluating Initial Public Acceptance of Highly and Fully Autonomous Vehicles.",
            "Human-Vehicle Cooperation in Automated Driving: A Multidisciplinary Review and Appraisal.",
            "A Hidden Markov Framework to Capture Human-Machine Interaction in Automated Vehicles.",
            "\"Human\" Problems in Semi-Autonomous Vehicles: Understanding Drivers' Reactions to Off-Nominal Scenarios.",
            "System Attributes that Influence Reported Improvement in Drivers' Experiences with Adaptive Cruise Control and Active Lane Keeping after Daily Use in Five Production Vehicles.",
            "Announcing Automated Lane Changes: Active Vehicle Roll Motions as Feedback for the Driver.",
            "Drivers' Performance Examination using a Personalized Adaptive Curve Speed Warning: Driving Simulator Study.",
            "Highly Automated Driving Impact on Drivers' Gaze Behaviors during a Car-Following Task.",
            "An Open Road Evaluation of a Self-Driving Vehicle Human-Machine Interface Designed for Visually Impaired Users.",
            "Lost at the Edge of Uncertainty: Measuring Player Uncertainty in Digital Games.",
            "Digital Piracy: Factors that Influence the Intention to Pirate - A Structural Equation Model Approach.",
            "Proposal of an Index for the Operator's Haptic Sensation in a Master-Slave System with Force-Feedback Function.",
            "The Impact of Flow Experience and Personality Type on the Intention to Use Virtual World.",
            "TANGAEON: Tangible Interaction to Support People in a Mindfulness Practice.",
            "The Gesture Disagreement Problem in Free-hand Gesture Interaction.",
            "Employing Emotion Regulation Strategies in Tracking Personal Fitness Progress.",
            "Segmented Animation, User-Control Strategy and Cognition.",
            "An Empirical Evaluation of Factors Influencing Patients' Reactions to the Implementation of Health Information Exchanges (HIEs).",
            "Effects of Switchable DOF for Mid-Air Manipulation in Immersive Virtual Environments.",
            "Private Self-Awareness and Aggression in Computer-Mediated Communication: Abusive User Comments on Online News Articles.",
            "Exploring Design Guidelines of Using User-Centered Design in Gamification Development: A Delphi Study.",
            "Interactive Behavior of an Immigrant Group on Mobile Instant Messenger-Based SNS: Textual Research on Topic-Centered Interactivity.",
            "The Effect of Webpage Complexity and Banner Animation on Banner Effectiveness in a Free Browsing Task.",
            "Application of Object-Based Metrics for Recognition of Well-Designed Dashboards.",
            "Understanding Continuance Intention to Use Social Media in China: The Roles of Personality Drivers, Hedonic Value, and Utilitarian Value.",
            "Seven HCI Grand Challenges.",
            "Effects of Travel Modes on Performances and User Comfort: A Comparison between ArmSwinger and Teleporting.",
            "With a View to the Side: YouTube's Sidebar and YouTuber's Linguistic Style as Hints for Trust-Related Evaluations.",
            "Does False and Missed Lane Departure Warnings Impact Driving Performances Differently?",
            "The Reciprocal Influences among Motivation, Personality Traits, and Game Habits for Playing Pokémon GO.",
            "An Integrated Success Factor Model of Professional Virtual Communities: Incorporation of the Operators, Members, and Life Cycle Perspectives.",
            "The Role of HCI in the Age of AI.",
            "Prolonged Aftereffect of Visuomotor Adaptation to Gradually Distorted Reality Displayed on a See-Through Head-Mounted Device.",
            "Measuring Workload in a Multitasking Environment Using Fractal Dimension of Pupil Dilation.",
            "An Integrated Model of Voice-User Interface Continuance Intention: The Gender Effect.",
            "Analyzing Social Media to Assess User Satisfaction with Transport for London's Oyster.",
            "User Perceptions of Sound Quality: Implications for the Design and Use of Audio-Based Mobile Applications.",
            "The Underlying Reasons of the Navigation Control Effect on Performance in a Virtual Reality Endoscopic Surgery Training Simulator.",
            "Measuring Perceived Usability: SUS, UMUX, and CSUQ Ratings for Four Everyday Products.",
            "How to Help Older Adults Move the Focus on a Smart TV? Exploring the Effects of Arrow Hints and Element Size Consistency.",
            "Validation of an Adaptive Alarm Interface Design for Digital Control Panels.",
            "Influence of Expectation Confirmation, Network Externalities, and Flow on Use of Mobile Shopping Apps.",
            "A Systematic Mapping Study of HCI Practice Research.",
            "Navigating the Online World: Gaze, Fixations, and Performance Differences between Younger and Older Users.",
            "Selecting Menu Items in Mobile Head-Mounted Displays: Effects of Selection Technique and Active Area.",
            "The Engagement of Website Initial Aesthetic Impressions: An Experimental Investigation.",
            "Investigating Smartphone Touch Area with One-Handed Interaction: Effects of Target Distance and Direction on Touch Behaviors.",
            "Establishing Social Dialog between Buildings and Their Users.",
            "Examining Game Transfer Phenomena in the Hybrid Reality Game, Ingress.",
            "The Effect of Head Tracking on the Degree of Presence in Virtual Reality.",
            "Response Times for Auditory and Vibrotactile Directional Cues in Different Immersive Displays.",
            "Prosody of Text Communication? How to Induce Synchronization and Coherence in Chat Conversations.",
            "LIA: A Virtual Assistant that Can Be Taught New Commands by Speech.",
            "Accessible Ubiquitous Services for Supporting Daily Activities: A Case Study with Young Adults with Intellectual Disabilities.",
            "Examining the Effects of Passive WeChat Use in China.",
            "Improving Usability Perception of Error-Prone AI Speakers: Elaborated Feedback Mitigates Negative Consequences of Errors.",
            "Correction.",
            "A Multimodal Interface for Virtual Character Animation Based on Live Performance and Natural Language Processing.",
            "Why Do People Watch Multiscreen Videos and Use Dual Screening? Investigating Users' Polychronicity, Media Multitasking Motivation, and Media Repertoire.",
            "Handing over the Keys: A Qualitative Study of the Experience of Automation in Driving.",
            "Shared Gaze in Collaborative Visual Search.",
            "Designing for \"Raressential\" Functions: Usage Patterns and UI Guidelines for Infrequent but Essential Tasks.",
            "The Design of Hand Gestures for Selecting Virtual Objects.",
            "How Motion-Control Influences a VR-Supported Technology for Mental Rotation Learning: From the Perspectives of Playfulness, Gender Difference and Technology Acceptance Model.",
            "Empirical Research in Mid-Air Interaction: A Systematic Review.",
            "In Automatic We Trust: Investigating the Impact of Trust, Control, Personality Characteristics, and Extrinsic and Intrinsic Motivations on the Acceptance of Autonomous Vehicles.",
            "Facilitating Students' Interaction in MOOCs through Timeline-Anchored Discussion.",
            "A Human-Cognitive Perspective of Users' Password Choices in Recognition-Based Graphical Authentication.",
            "A Comparison of Engagement between the Attention Network Test and a Videogame-Like Version, Called the AttentionTrip.",
            "Workload Management in Teleoperation of Unmanned Ground Vehicles: Effects of a Delay Compensation Aid on Human Operators' Workload and Teleoperation Performance.",
            "Predictors for Human Performance in Information Seeking, Information Integration, and Overall Process in Diagnostic Tasks.",
            "Translating Tourist Requirements into Mobile AR Application Engineering Through QFD.",
            "The Dating and Domestic Violence App Rubric: Synthesizing Clinical Best Practices and Digital Health App Standards for Relationship Violence Prevention Smartphone Apps.",
            "The Role of Visual Feedback and Age When Grasping, Transferring and Passing Objects in Virtual Environments.",
            "Toward Better Understanding of Task Difficulty during Physicians' Interaction with Electronic Health Record System (EHRs).",
            "Beyond Leaders and Followers: Understanding Participation Dynamics in Event-Based Social Networks.",
            "I-Portrait: An Interactive Photograph System for Enhancing Social Presence.",
            "Determinants for Successful Agile Collaboration between UX Designers and Software Developers in a Complex Organisation.",
            "A Study on User Experience of Automotive HUD Systems: Contexts of Information Use and User-Perceived Design Improvement Points.",
            "The Effect of a Humanoid Robot's Emotional Behaviors on Users' Emotional Responses: Evidence from Pupillometry and Electroencephalography Measures.",
            "Towards an Online Continuous Adaptation Mechanism (OCAM) for Enhanced Engagement: An EEG Study.",
            "Eliciting Public Display Awareness and Engagement: An Experimental Study and Semantic Strategy."
        ]
    },
    {
        "name": "IJHCI",
        "year": "2018",
        "info": "2018: Volume 34",
        "count": 89,
        "papers": [
            "Developing Predictive Equations to Model the Visual Demand of In-Vehicle Touchscreen HMIs.",
            "Using an Eye-Tracking Approach to Explore Gender Differences in Visual Attention and Shopping Attitudes in an Online Shopping Environment.",
            "The User Affective Experience Scale: A Measure of Emotions Anticipated in Response to Pop-Up Computer Warnings.",
            "A Measurement and Structural Model for Usability Evaluation of Shared Workspace Groupware.",
            "Adoption and Use of Software in Land Use Planning Practice: A Multiple-Country Study.",
            "How a Retailer's Website Quality Fosters Relationship Quality: The Mediating Effects of Parasocial Interaction and Psychological Distance.",
            "Using Personas to Support Augmentative Alternative Communication Device Design: A Validation and Evaluation Study.",
            "Acceptance of Health-Related ICT among Elderly People Living in the Community: A Systematic Review of Qualitative Evidence.",
            "Choosing a Physician on Social Media: Comments and Ratings of Users are More Important than the Qualification of a Physician.",
            "A Study on New Virtual Reality System in Maze Terrain.",
            "Monitoring for Awareness and Reflection in Ubiquitous Learning Environments.",
            "How Seniors in Taiwan Use Information Technology: Computer and Cell Phones.",
            "The Impact of Personality on the Subjective Assessment of Usability.",
            "Sense of Immersion in Computer Games Using Single and Stereoscopic Augmented Reality.",
            "A Heuristic Evaluation for Deaf Web User Experience (HE4DWUX).",
            "StretchArms: Promoting Stretching Exercise with a Smartwatch.",
            "An EEG Brain-Computer Interface Approach for Classifying Vigilance States in Humans: A Gamma Band Focus Supports Low Misclassification Rates.",
            "User-Defined Gestures for Gestural Interaction: Extending from Hands to Other Body Parts.",
            "Design of Mobile Phones for Older Adults: An Empirical Analysis of Design Guidelines and Checklists for Feature Phones and Smartphones.",
            "Too Much of a Good Thing: Investigating the Association between Actual Smartphone Use and Individual Well-Being.",
            "Editorial of the Special Issue on Social Media in Crisis Management.",
            "Social Media in Crisis Management: An Evaluation and Analysis of Crisis Informatics Research.",
            "The Crowd is the Territory: Assessing Quality in Peer-Produced Spatial Data During Disasters.",
            "Processing Social Media Images by Combining Human and Machine Computing during Crises.",
            "Social Positions and Collective Sense-Making in Crisis Communication.",
            "Understanding WeChat Users' Behavior of Sharing Social Crisis Information.",
            "Software Innovations to Support the Use of Social Media by Emergency Managers.",
            "Increasing Recognition of Wrong-Patient Errors through Improved Interface Design of a Computerized Provider Order Entry System.",
            "Factors Influencing the Adoption of Smart Wearable Devices.",
            "The Social Value of Snapchat: An Exploration of Affiliation Motivation, the Technology Acceptance Model, and Relational Maintenance in Snapchat Use.",
            "Exploring Explanation Effects on Consumers' Trust in Online Recommender Agents.",
            "Towards the Use of Brain-Computer Interface and Gestural Technologies as a Potential Alternative to PIN Authentication.",
            "Adapting Information Search Tools for use by Health Consumers: Challenges and Lessons for Software Designers.",
            "Subliminal Techniques: Considerations and Recommendations for Analyzing Feasibility.",
            "Relating Task Demand, Mental Effort and Task Difficulty with Physicians' Performance during Interactions with Electronic Health Records (EHRs).",
            "A Review of Alarm System Design for Advanced Control Rooms of Nuclear Power Plants.",
            "Semi-Automated, Large-Scale Evaluation of Public Displays.",
            "Information-Seeking Strategies in Medicine Queries: A Clinical Eye-Tracking Study with Gaze-Cued Retrospective Think-Aloud Protocol.",
            "Effects of User's Hand Orientation and Spatial Movements on Free Hand Interactions with Large Displays.",
            "How does Parallax Scrolling Influence User Experience? A Test of TIME (Theory of Interactive Media Effects).",
            "Modeling and Predicting Mobile Phone Touchscreen Transcription Typing Using an Integrated Cognitive Architecture.",
            "Balancing the Fluency-Consistency Tradeoff in Collaborative Information Search with a Recommender Approach.",
            "The System Usability Scale: Past, Present, and Future.",
            "Gender Differences in Motivations for Identity Reconstruction on Social Network Sites.",
            "The Effect of Stimulus Size and Position on the Task Performance of an Eye Mouse: Comparing Blink and Dwell Methods in a Click Task.",
            "B2B E-Commerce Adoption in Iranian Manufacturing Companies: Analyzing the Moderating Role of Organizational Culture.",
            "A Human Factors Approach to Exploring the Experience of Group Trip Planning from the Perspective of Intragroup Interaction.",
            "Head Movement Based Interaction in Mobility.",
            "Mobile Technology in the Classroom: What Drives Student-Lecturer Interactions?",
            "Games and HCI.",
            "What Makes a Champion: The Behavioral and Neural Correlates of Expertise in Multiplayer Online Battle Arena Games.",
            "Evaluating Photoplethysmogram as a Real-Time Cognitive Load Assessment during Game Playing.",
            "Approaches to Measuring the Difficulty of Games in Dynamic Difficulty Adjustment Systems.",
            "Multi-Device Classification Model for Game Interaction Techniques.",
            "Towards a Trait Model of Video Game Preferences.",
            "The Influence of Affect on the Decision-Making Process in Virtual Simulation.",
            "Social Game Elements in World of Warcraft: Interpersonal Relations, Groups, and Organizations for Gamification Design.",
            "Addiction by Design: Using Netnography for User Experiences in Female Online Gambling Game.",
            "Understanding Online Game Cheating: Unpacking the Ethical Dimension.",
            "Towards a Standard Arabic System Usability Scale: Psychometric Evaluation using Communication Disorder App.",
            "Understanding the Role of Conscious and Automatic Mechanisms in Social Networking Services: A Longitudinal Study.",
            "Marker versus Markerless Augmented Reality. Which Has More Impact on Users?",
            "Exploration of Assistive Technologies Used by People with Quadriplegia Caused by Degenerative Neurological Diseases.",
            "The Ten Shades of Silver: Segmentation of Older Adults in the Mobile Phone Market.",
            "Using Distributable User Interfaces in CSCL In-Situ Classrooms.",
            "Expanding the Technology Acceptance Model with the Inclusion of Trust, Social Influence, and Health Valuation to Determine the Predictors of German Users' Willingness to Continue using a Fitness App: A Structural Equation Modeling Approach.",
            "Editorial of the Special Issue on Following User Pathways: Key Contributions and Future Directions in Cross-Platform Social Media Research.",
            "Validity, Reliability, and the Case for Participant-Centered Research: Reflections on a Multi-Platform Social Media Study.",
            "Complementing or Substituting? News in an Era of Multiple Platforms and Second Screens.",
            "Facebook and Moodle Integration into Instructional Media Design Courses: A Comparative Analysis of Students' Learning Experiences using the Community of Inquiry (CoI) Model.",
            "The Generativity of Social Media: Opportunities, Challenges, and Guidelines for Conducting Experimental Research.",
            "Exploring User Experience of Smartphones in Social Media: A Mixed-Method Analysis.",
            "One-Handed Input Through Rotational Motion for Smartwatches.",
            "The Effects of Vibration Patterns of Take-Over Request and Non-Driving Tasks on Taking-Over Control of Automated Vehicles.",
            "Watch It! Factors Driving Continued Feature Use of the Smartwatch.",
            "Spatialized Vibrotactile Feedback Improves Goal-Directed Movements in Cluttered Virtual Environments.",
            "Usability Study of Two In-Vehicle Information Systems Using Finger Tracking and Facial Expression Recognition Technology.",
            "Body Movement Reduces Pain Intensity in Virtual Reality-Based Analgesia.",
            "Ergonomics To Go: Designing The Mobile Workspace.",
            "Cultural Effects on Use of Online Social Media for Health-Related Information Acquisition and Sharing in Taiwan.",
            "Designing Warnings to Reduce Identity Disclosure.",
            "PolyMorph: Increasing the Spelling Efficiency of P300 by Selection Matrix PolyMorphism and Sentence-Based Predictions.",
            "Effects of Quantity and Size of Buttons of In-Vehicle Touch Screen on Drivers' Eye Glance Behavior.",
            "What Works in Facebook Content Versus Relational Communication: A Study of their Effectiveness in the Context of Museums.",
            "Rethinking the Mini-Map: A Navigational Aid to Support Spatial Learning in Urban Game Environments.",
            "Measuring Perceived Usability: The CSUQ, SUS, and UMUX.",
            "Affective Communication through Air Jet Stimulation: Evidence from Event-Related Potentials.",
            "A Systematic and Generalizable Approach to the Heuristic Evaluation of User Interfaces.",
            "Understanding the Intention of Using Mobile Social Networking Apps Across Cultures."
        ]
    },
    {
        "name": "IJHCI",
        "year": "2017",
        "info": "2017: Volume 33",
        "count": 83,
        "papers": [
            "Introduction to Special Issue: Foundations of Cognitive Science for the Design of Human-Computer Interactive Systems.",
            "How Cognitive Linguistics Inspires HCI: Image Schemas and Image-Schematic Metaphors.",
            "Hand- and Foot-Controlled Dual-Tracking Task Performance Together with a Discrete Spatial Stimulus-Response Compatibility Task.",
            "Theory-based Models of Attention in Visual Workspaces.",
            "Human Subtlety Proofs: Using Computer Games to Model Cognitive Processes for Cybersecurity.",
            "Measuring Situation Awareness of Student Air Traffic Controllers with Online Probe Queries: Are We Asking the Right Questions?",
            "Use of PC-based Simulators to Train Basic Control Functions of a Hydraulic Excavator: Audiovisual Instruction Contrasted with Hands-On Exploration.",
            "Escaping the Trough: Towards Real-World Impact of Tabletop Research.",
            "Supporting Creativity through the Interactive Exploratory Search Paradigm.",
            "Effects of Stereoscopic Display on Learning and User Experience in an Educational Virtual Environment.",
            "Using GOMS and NASA-TLX to Evaluate Human-Computer Interaction Process in Interactive Segmentation.",
            "Click \"Like\" on Facebook: The Effect of Customer-to-customer Interaction on Customer Voluntary Performance for Social Networking Sites.",
            "Text Input on a Smartwatch QWERTY Keyboard: Tap vs. Trace.",
            "Uncertainty Visualization for Mobile and Wearable Devices Based Activity Recognition Systems.",
            "Interacting with Context Factors in Music Recommendation and Discovery.",
            "Exploring Performance of Gendered Identities through Language in World of Warcraft.",
            "Are Two Better Than One? A Comparison Between Single- and Dual-Monitor Work Stations in Productivity and User's Windows Management Style.",
            "Why Do Some People Become Addicted to Digital Games More Easily? A Study of Digital Game Addiction from a Psychosocial Health Perspective.",
            "Expert Sources in Warnings May Reduce the Extent of Identity Disclosure in Cyber Contexts.",
            "Analyzing the Role of Interactivity in User Experience.",
            "Developing Playability Heuristics Based on Nouns and Adjectives from Online Game Reviews.",
            "Human Factors of Health Information Technology - Challenges and Opportunities.",
            "Nurses' Perceptions of a Novel Health Information Technology: A Qualitative Study in the Pediatric Intensive Care Unit.",
            "Exploring Patients' Use Intention of Personal Health Record Systems: Implications for Design.",
            "Variations in the Usability of Independent Web-Based Personal Health Records.",
            "A Collaborative Usability Evaluation (CUE) Model for Health IT Design and Implementation.",
            "Human Factors Analysis, Design, and Evaluation of Engage, a Consumer Health IT Application for Geriatric Heart Failure Self-Care.",
            "Obstacles Experienced by Care Managers in Managing Information for the Care of Chronically Ill Patients.",
            "Embracing Complexity: Rethinking Culturally Informed Design in Human Factors/Ergonomics and Consumer Health Informatics.",
            "Consumer Health Informatics Interventions Must Support User Workflows, Be Easy-To-Use, and Improve Cognition: Applying the SEIPS 2.0 Model to Evaluate Patients' and Clinicians' Experiences with the CONDUIT-HID Intervention.",
            "Sharing, Saving, and Living Well on Less: Supporting Social Connectedness to Mitigate Financial Hardship.",
            "A Textual Feedback Tool for Empowering Participants in Usability and UX Evaluations.",
            "Tracing College Students' Acceptance of Online Health Services.",
            "A Characterization of Actuation Techniques for Generating Movement in Shape-Changing Interfaces.",
            "Bootstrap Analyses of Anxiety Index Measuring the Prefrontal Cortex of Subjects at Rest with Two-Channel Portable NIRS Device.",
            "More Photos From Me to Thee: Factors Influencing the Intention to Continue Sharing Personal Photos on an Online Social Networking (OSN) Site among Young Adults in the Netherlands.",
            "Using a Tablet Device to Compensate for Underestimation of Cognitive Function due to Impaired Dominant Hand Function in Stroke Patients.",
            "Editorial of the Special Issue on Mobile Human-Computer Interaction.",
            "The Effects of Visualization and Synchronization on Clustered-Based Mobile Web Search.",
            "Tripartite Effects: Exploring Users' Mental Model of Mobile Gestures under the Influence of Operation, Handheld Posture, and Interaction Space.",
            "Adapting the Navigation Interface of Smart Watches to User Movements.",
            "ContextZoom: A Single-Handed Partial Zooming Technique for Touch-Screen Mobile Devices.",
            "Visual Impairments and Mobile Touchscreen Interaction: State-of-the-Art, Causes of Visual Impairment, and Design Guidelines.",
            "Human Robot Engagement and Acceptability in Residential Aged Care.",
            "Inviting Strangers to Participate in Collaborative Consumption through Mobile App.",
            "The Effects of Hover Interface on Users' Behavioral Multitasking Intention.",
            "Use of a Modified UTAUT Model to Investigate the Perspectives of Internet Access Device Users.",
            "An Empirical Study on the Interaction Capability of Arm Stretching.",
            "Visually Perceived Distance Judgments: Tablet-Based Augmented Reality Versus the Real World.",
            "Interface Adaptation to Novice Older Adults' Mental Models through Concrete Metaphors.",
            "Corrigendum.",
            "An Empirical Study of Some Critical Adoption Factors of ERP Software.",
            "Toward a Hybrid BCI: Self-Paced Operation of a P300-based Speller by Merging a Motor Imagery-Based \"Brain Switch\" into a P300 Spelling Approach.",
            "Comparison of Cognitive Modeling and User Performance Analysis for Touch Screen Mobile Interface Design.",
            "A Glance into Social and Evolutionary Aspects of an Artifact Ecology for Collaborative Learning through the Lens of Distributed Cognition.",
            "Ritual in Online Communities: A Study of Post-Voting in MOOC Discussion Forums.",
            "Evaluating Digital Peer Support for Children Cured from Cancer.",
            "A Comparative Study of Map Exploration Interfaces for Multi-Touch Tabletops.",
            "Engaging Adolescents with Down Syndrome in an Educational Video Game.",
            "Beyond Features for Recognition: Human-Readable Measures to Understand Users' Whole-Body Gesture Performance.",
            "Watching a Movie Alone yet Together: Understanding Reasons for Watching Danmaku Videos.",
            "Design and Evaluation of a Team Mutual Awareness Toolkit for Digital Interfaces of Nuclear Power Plant Context.",
            "Data-Driven Texture Rendering on an Electrostatic Tactile Display.",
            "Features of the Postural Sway Signal as Indicators to Estimate and Predict Visually Induced Motion Sickness in Virtual Reality.",
            "Evaluation of Internal and External Validity of a Virtual Environment for Learning a Long Procedure.",
            "Comparison of Two Target Selection Methods for Two-Thumb Touchpad Typing.",
            "Examining the Effectiveness of Gamification in Human Computation.",
            "Fingerskate: Relaxing the Physical Constraint of Two-Finger Touchscreen Operations.",
            "Push Notifications in Diet Apps: Influencing Engagement Times and Tasks.",
            "Toward More Comprehensive Chinese Internet Users' Studies: Translation and Validation of the Chinese-Mandarin Version of the 8-Item Information Retrieval on the Web Self-Efficacy Scale (Ch-IROWSE).",
            "Short-Term Physiological Strain and Recovery among Employees Working with Agile and Lean Methods in Software and Embedded ICT Systems.",
            "Evaluating Representativeness of Qualitative Text Data in Identifying UX Issues.",
            "On the Efficiency of a VR Hand Gesture-Based Interface for 3D Object Manipulations in Conceptual Design.",
            "Evaluation of an Electronic App Developed to Assist Clinicians in the Management of Behavioral and Psychological Symptoms of Dementia (BPSD).",
            "Input Behavior When Using Two Fingers on a Multi-Touch Device.",
            "A Study on Designing Video Tutorials for Promoting Security Features: A Case Study in the Context of Two-Factor Authentication (2FA).",
            "Adaptive Social Robot for Sustaining Social Engagement during Long-Term Children-Robot Interaction.",
            "The Social Media Use Integration Scale: Toward Reliability and Validity.",
            "Smartphone Guide Technology in Cultural Spaces: Measuring Visitor Experience with an iPhone Multimedia Guide in Shakespeare's Church.",
            "Understanding Key Antecedents of User Loyalty toward Mobile Messenger Applications: An Integrative View of Emotions and the Dedication-Constraint Model.",
            "Effect of Loading Symbol of Online Video on Perception of Waiting Time.",
            "Walking under a Different Sky: Urban Colored Routes for Creative Engagement and Pleasure.",
            "Editorial Board."
        ]
    },
    {
        "name": "IJHCI",
        "year": "2016",
        "info": "2016: Volume 32",
        "count": 68,
        "papers": [
            "Editorial.",
            "Principles for Designing Interfaces Compatible With Human Information Processing.",
            "Comparing Ocular Parameters for Cognitive Load Measurement in Eye-Gaze-Controlled Interfaces for Automotive and Desktop Computing Environments.",
            "Using the Default Option Bias to Influence Decision Making While Driving.",
            "A Review of Exploratory Factor Analysis Decisions and Overview of Current Practices: What We Are Doing and How Can We Improve?",
            "Review of Semantic-Free Utterances in Social Human-Robot Interaction.",
            "The Effects of Haptic Feedback and Visual Distraction on Pointing Task Performance.",
            "Designing Usable Voting Systems for Voters With Hidden Barriers: A Pilot Study.",
            "Evaluating User Needs in Wellness Apps.",
            "Seniors and Information Technology in China.",
            "Effects of Superimposition of a Head-Up Display on Driving Performance and Glance Behavior in the Elderly.",
            "The U-Constructs and Mobile Usage Behavior: Development and Validation of the U-Feat Scale.",
            "Special Issue on Interactive Persuasive Systems.",
            "Interactive Persuasive Systems: A Perspective on Theory and Evaluation.",
            "Persuasive Strategies for Encouraging Social Interaction for Older Adults.",
            "The Role of Instructional Design in Persuasion: A Comics Approach for Improving Cybersecurity.",
            "Influencing Participation in Group Brainstorming Through Ambient Intelligence.",
            "Hunting Relics: A Persuasive Exergame to Promote Collective Exercise in Young Children.",
            "Designing an Educational Website to Improve Quality of Supportive Oncology Care for Women with Ovarian Cancer: An Expert Usability Review and Analysis.",
            "The Role of Aesthetics and Perception in Raising Situation Awareness: Lessons from SpringRain.",
            "A Comparison of Head Pose and Deictic Pointing Interaction Methods for Smart Environments.",
            "Power of the Swipe: Why Mobile Websites Should Add Horizontal Swiping to Tapping, Clicking, and Scrolling Interaction Techniques.",
            "The Stroop and Reverse Stroop Effects as Measured by an Interactive Tabletop.",
            "Exploring the Effect of Avatar Trust on Learners' Perceived Participation Intentions in an e-Learning Environment.",
            "Evaluation of Three Tablet Computers at Two Levels of Ambient Illumination.",
            "An Affordance-Based Model of Human Action Selection in a Human-Machine Interaction System with Cognitive Interpretations.",
            "Data Fusion for Real-time Multimodal Emotion Recognition through Webcams and Microphones in E-Learning.",
            "An Investigation of a Joyful Peer Response System: High Ability vs. Low Ability.",
            "Effects of Perceived Usability and Aesthetics on Emotional Responses in Different Contexts of Use.",
            "Chinese-Based Spearcons: Improving Pedestrian Navigation Performance in Eyes-Free Environment.",
            "Prevalence and Characteristics of Game Transfer Phenomena: A Descriptive Survey Study.",
            "Mushaca: A 3-Degrees-of-Freedom Mouse Supporting Rotation.",
            "Child Perception of Humanoid Robot Appearance and Behavior.",
            "Cross-Platform Users' Experiences Toward Designing Interusable Systems.",
            "Out of Syria: Mobile Media in Use at the Time of Civil War.",
            "User Satisfaction and Retention of Mobile Telecommunications Services in Korea.",
            "Understanding User Behavior of Asking Location-Based Questions on Microblogs.",
            "Nontechnical Deterrence Effects of Mild and Severe Internet Use Policy Reminders in Reducing Employee Internet Abuse.",
            "Which Tags Do We Remember in Personal Information Management?",
            "Citizen Science: New Research Challenges for Human-Computer Interaction.",
            "Gamification Solutions to Enhance Software User Engagement - A Systematic Review.",
            "Usability of RPG-based Learning Framework.",
            "Perceived Visual Complexity of In-Vehicle Information Display and Its Effects on Glance Behavior and Preferences.",
            "Theory, Practice and Policy: An Inquiry into the Uptake of HCI Practices in the Software Industry of a Developing Country.",
            "Robust Eye-Based Dwell-Free Typing.",
            "Factors for Customer Information Satisfaction: User Approved and Empirically Evaluated.",
            "An Augmented Reality-Assisted Therapeutic Healthcare Exercise System Based on Bare-Hand Interaction.",
            "Intention-Sensing Recipe Guidance via User Accessing to Objects.",
            "Ambiguous Agents: The Influence of Consistency of an Artificial Agent's Social Cues on Emotion Recognition, Recall, and Persuasiveness.",
            "Unleashing the Power of mCRM: Investigating Antecedents of Mobile CRM Values from Managers' Viewpoint.",
            "Evaluation of Text Entry Methods for Interactive Digital Television Applications with Devices Alternative to Conventional Remote Controls.",
            "Don't Cry While You're Driving: Sad Driving Is as Bad as Angry Driving.",
            "Interrupted by Your Pupil: An Interruption Management System Based on Pupil Dilation.",
            "User Experience Design of a Prototype Kiosk: A Case for the İstanbul Public Transportation System.",
            "Factors Affecting Web Portal Information Services Usability: A Canonical Correlation Analysis.",
            "Targeting Potential Active Users for Mobile App Install Advertising: An Exploratory Study.",
            "Mobile Instant Messengers and Middle-Aged and Elderly Adults in Taiwan: Uses and Gratifications.",
            "Exploring Experience of Runners with Sports Tracking Technology.",
            "Binary DE-Based Channel Selection and Weighted Ensemble of SVM Classification for Novel Brain-Computer Interface Using Devanagari Script-Based P300 Speller Paradigm.",
            "A P300-Based Brain-Computer Interface for Chinese Character Input.",
            "Better Safe than Sorry: A Study of Investigating Individuals' Protection of Privacy in the Use of Storage as a Cloud Computing Service.",
            "Notifications Efficiency, Impact, and Interference in Second-Screen Scenarios.",
            "Two-Player Game: Playing Casual Video Games with Outgroup Members Reduces Levels of Prejudice Toward That Outgroup.",
            "Influence of SNS User Innovativeness and Public Individuation on SNS Usage Patterns and Social Capital Development: The Case of Facebook.",
            "Integration of Subjective and Objective Usability Evaluation Based on IEC/IEC 15939: A Case Study for Traffic Supervision Systems.",
            "Stress Detection in Human-Computer Interaction: Fusion of Pupil Dilation and Facial Temperature Features.",
            "Donation via Mobile Applications: A Study of the Factors Affecting Mobile Donation Application Use.",
            "Why That Picture? Discovering Password Properties in Recognition-Based Graphical Authentication."
        ]
    },
    {
        "name": "IJHCI",
        "year": "2015",
        "info": "2015: Volume 31",
        "count": 76,
        "papers": [
            "Menu Navigation With In-Vehicle Technologies: Auditory Menu Cues Improve Dual Task Performance, Preference, and Workload.",
            "Improving User Interaction in Interactive TV Based on Ethnographic Insights From Real-Life Problems.",
            "Influence of Different Types of Vibrations on Technical Acceptance of a Mobile Game Aiming for Hedonic Satisfaction.",
            "Paternal and Maternal Information and Communication Technology Usage as Their Very Low Birth Weight Infants Transition Home From the NICU.",
            "Usability of Online Assistance From Semiliterate Users' Perspective.",
            "\"Once More, With Feeling\": Using Haptics to Preserve Tactile Memories.",
            "Users' Emotional Valence, Arousal, and Engagement Based on Perceived Usability and Aesthetics for Web Sites.",
            "Effects of Feedforward in In-Air Remote Pointing.",
            "Students' Web Search Strategies With Different Task Types: An Eye-Tracking Study.",
            "A Slovene Translation of the System Usability Scale: The SUS-SI.",
            "Evaluating Social Navigation Visualization in Online Geographic Maps.",
            "Use of the Backseat Driving Technique in Evaluation of a Perceptually Optimized In-Car Navigation Display.",
            "Detecting Driver Normal and Emergency Lane-Changing Intentions With Queuing Network-Based Driver Models.",
            "Narrative Structure and Player Experience in Role-Playing Games.",
            "Differences Between People Who Use Only Facebook and Those Who Use Facebook Plus Twitter.",
            "Interruptibility Estimation Based on Head Motion and PC Operation.",
            "A Study of Users' Reactions to a Mixed Online Discussion Model: A Lag Sequential Analysis Approach.",
            "On the Usability and Effectiveness of Different Interaction Types in Augmented Reality.",
            "An Empirical Investigation Into Typing Errors in Interactive Digital Television Applications.",
            "What Are the Causes of Noncompliance Behaviors in Bar Code Medication Administration System Processes?",
            "Testing Aesthetic and Function Design Preference for Touch Screen and Non-Touch Screen Mobile Phones Using Interactive Genetic Algorithms.",
            "Search Engine or Content Website? A Local Information Seeking Classification Model Based on Consumer Characteristics and Website Perceptions.",
            "Multimodal Intelligent Eye-Gaze Tracking System.",
            "Wayfinding of Users With Visual Impairments in Haptically Enhanced Virtual Environments.",
            "Privacy Concerns for Use of Voice Activated Personal Assistant in the Public Space.",
            "Augmented Reality-Based Manual Assembly Support With Visual Features for Different Degrees of Difficulty.",
            "Open Challenges in Relationship-Based Privacy Mechanisms for Social Network Services.",
            "User Behavior Model Based on Affordances and Emotions: A New Approach for an Optimal Use Method in Product-User Interactions.",
            "Communicating Art, Virtually! Psychological Effects of Technological Affordances in a Virtual Museum.",
            "Geospatial Reasoning Ability: Definition, Measurement and Validation.",
            "A Lexical Approach to Study Computer Games and Game Play Experience via Online Reviews.",
            "Smartphone Information Displays When Reading News in Persian and English Languages.",
            "Comparing Four Touch-Based Interaction Techniques for an Image-Based Audience Response System.",
            "Aim, Shoot, Deplete: Playing Video Games Depletes Self-Regulatory Resources.",
            "μcaptcha: Human Interaction Proofs Tailored to Touch-Capable Devices via Math Handwriting.",
            "Negotiation Strategy Video Modeling Training for Adolescents with Autism Spectrum Disorder: A Usability Study.",
            "Introduction to the Special Issue on Usability and User Experience: Psychometrics.",
            "Assessing User Satisfaction in the Era of User Experience: Comparison of the SUS, UMUX, and UMUX-LITE as a Function of Product Experience.",
            "Measuring Perceived Usability: The SUS, UMUX-LITE, and AltUsability.",
            "Measuring Attitudes Towards the Internet: The General Internet Attitude Scale.",
            "Measuring the Usability of Mobile Applications for Phones and Tablets.",
            "Experience-Oriented and Product-Oriented Evaluation: Psychological Need Fulfillment, Positive Affect, and Product Perception.",
            "Psychometric Evaluation of the EMO and the SUS in the Context of a Large-Sample Unmoderated Usability Study.",
            "Introduction to the Special Issue on Usability and User Experience: Methodological Evolution.",
            "What Do Thinking-Aloud Participants Say? A Comparison of Moderated and Unmoderated Usability Sessions.",
            "Concept Mapping Usability Evaluation: An Exploratory Study of a New Usability Inspection Method.",
            "Whose Experience Do We Care About? Analysis of the Fitness of Scrum and Kanban to User Experience.",
            "An Exploration of the Relation Between Expectations and User Experience.",
            "Challenges to Assessing Usability in the Wild: A Case Study.",
            "HCI for Elderly and Smart Vehicle Interaction.",
            "Research Issues in Smart Vehicles and Elderly Drivers: A Literature Review.",
            "User Perceptions Toward In-Vehicle Technologies: Relationships to Age, Health, Preconceptions, and Hands-On Experience.",
            "Can Autonomous Vehicles Be Safe and Trustworthy? Effects of Appearance and Autonomy of Unmanned Driving Systems.",
            "Investigating the Importance of Trust on Adopting an Autonomous Vehicle.",
            "A Weighted QFD-Based Usability Evaluation Method for Elderly in Smart Cars.",
            "Utilization of Visual Information Perception Characteristics to Improve Classification Accuracy of Driver's Visual Search Intention for Intelligent Vehicle.",
            "Design and Evaluation of a Touch-Based Personalizable In-Vehicle User Interface.",
            "Performance Comparisons Between Thumb-Based and Finger-Based Input on a Small Touch-Screen Under Realistic Variability.",
            "Toward a Taxonomy of Affective Computing.",
            "Muscle Activity and Comfort Perception on Neck, Shoulder, and Forearm While Using a Tablet Computer at Various Tilt Angles.",
            "Comparing Zooming Methods in Mobile Devices: Effectiveness, Efficiency, and User Satisfaction in Touch and Nontouch Smartphones.",
            "Creativity Bento Box: A Physical Resource Pack to Support Interaction in Virtual Space.",
            "Influence of Customer Identification on Online Usage and Purchasing Behaviors in Social Commerce.",
            "Need for Affiliation, Need for Popularity, Self-Esteem, and the Moderating Effect of Big Five Personality Traits Affecting Individuals' Self-Disclosure on Facebook.",
            "Lonely and Susceptible: The Influence of Social Exclusion and Gender on Persuasion by an Artificial Agent.",
            "The Collaborative Critique: An Inspection Method for Expert Evaluation of User Interfaces.",
            "Sense of Touch in Training Tasks Demanding High Precision and Short Time of Execution.",
            "Self-Care Technologies and Collaboration.",
            "Usability Evaluation of VR Interface for Mobile Robot Teleoperation.",
            "Perceived Visual Complexity and Visual Search Performance of Automotive Instrument Cluster: A Quantitative Measurement Study.",
            "Analysis of Distance Collaboration Modalities: Alternatives to Meeting Face-to-Face.",
            "Gender Differences in Mouse and Cursor Movements.",
            "Impact of Knowledge Representations on Problem-Oriented Learning in Online Environments.",
            "Prosocial Activists in SNS: The Impact of Isomorphism and Social Presence on Prosocial Behaviors.",
            "Do People Really Experience Information Overload While Reading Online Reviews?",
            "An Empirical Analysis of Factors Influencing M-Shopping Use."
        ]
    },
    {
        "name": "IJHCI",
        "year": "2014",
        "info": "2014: Volume 30",
        "count": 76,
        "papers": [
            "Perceived Visual Aesthetics of Text-Overlaid Images: Computational Models and Experimental Research for White-Space Fraction.",
            "A Pilot Study of the VirtuSphere as a Virtual Reality Enhancement.",
            "Using Queuing Network and Logistic Regression to Model Driving with a Visual Distraction Task.",
            "Assessing the Usability of Raw Machine Translated Output: A User-Centered Study Using Eye Tracking.",
            "The Role of Body Postures in the Recognition of Emotions in Contextually Rich Scenarios.",
            "A Picture is Worth a Thousand Words: Source Credibility Theory Applied to Logo and Website Design for Heightened Credibility and Consumer Trust.",
            "Statement of Removal.",
            "Altered Visual Perception in Game Transfer Phenomena: An Empirical Self-Report Study.",
            "Engagement in Online Social Networks: The Impact of Self-Disclosure and Humor.",
            "An Analytical Approach to Creating Multitouch Gesture Vocabularies in Mobile Devices: A Case Study for Mobile Web Browsing Gestures.",
            "Attractive Agents Are More Persuasive.",
            "Effects of Luminosity Contrast and Stimulus Duration on User Performance and Preference in a P300-Based Brain-Computer Interface.",
            "Explaining Extreme Mobile Experiences.",
            "The Role of Search Result Position and Source Trustworthiness in the Selection of Web Search Results When Using a List or a Grid Interface.",
            "Exploring the Impact of Food Craving and Pleasure Technologies on Aesthetic Experience in Digital Media.",
            "The Impact of Advertising Location and User Task on the Emergence of Banner Ad Blindness: An Eye-Tracking Study.",
            "Automatic Stress Classification With Pupil Diameter Analysis.",
            "Multipurpose Public Displays: Can Automated Grouping of Applications and Services Enhance User Experience?",
            "The Cognitive Benefit of Dynamic Representations on Procedural Skill Acquisition: A Computational Modeling Approach.",
            "The Impact of Function Location on Typing and Pointing Tasks With an Intraoral Tongue-Computer Interface.",
            "Internet Skills, Sources of Support, and Benefiting From Internet Use.",
            "Effects of Visual Stimulus on Response Behavior of Control-on-Display Interface.",
            "Emotional Dimensions of User Experience: A User Psychological Analysis.",
            "An Empirical Investigation Into Text Input Methods for Interactive Digital Television Applications.",
            "Measuring Cognitive Load Using Linguistic Features: Implications for Usability Evaluation and Adaptive Interaction Design.",
            "Socially Assistive Robots in Elderly Care: A Mixed-Method Systematic Literature Review.",
            "The Influence of Network Structural Properties on Information Dissemination Power in Microblogging Systems.",
            "Widgets Dedicated to User Interface Evaluation.",
            "Study of User Search Activities With Two Discovery Tools at an Academic Library.",
            "Assessing Older Adults' Information Technology Ability: The Development of a Multiple Item Scale.",
            "Snap Target: Investigating an Assistance Technique for Mobile Magic Lens Interaction With Large Displays.",
            "Embodied Robot versus Virtual Agent: Involvement of Preschool Children in Motor Task Performance.",
            "Effects of Laptop Touchpad Texturing on User Performance.",
            "An Accessible Platform for People With Disabilities.",
            "Toward an Objective Linguistic-Based Measure of Perceived Embodied Conversational Agent Power and Likeability.",
            "Special Section Introduction.",
            "Measuring Software Screen Complexity: Relating Eye Tracking, Emotional Valence, and Subjective Ratings.",
            "The Effects of Experience and Strategy on Visual Attention Allocation in an Automated Multiple-Task Environment.",
            "Determinants of Postadoption Behaviors of Mobile Communications Applications: A Dual-Model Perspective.",
            "Personal Remote Assistance in Ambient Assisted Living - Experimental Research of Elderly People's Trust and Their Intention to Use.",
            "The Relationship Between System Effectiveness and Subjective Usability Scores Using the System Usability Scale.",
            "A Taxonomy-Based Usability Study of an Intelligent Speed Adaptation Device.",
            "Visual Search in Authentication Systems Based on Memorized Faces: Effects of Memory Load and Retention Interval.",
            "Special Issue on Human-Computer Interaction in the Asia-Pacific Region.",
            "Effects of Trust on Group Buying Websites in China.",
            "Using Social Media Platforms for Human-Robot Interaction in Domestic Environment.",
            "Evaluation of Flick and Ring Scrolling on Touch-Based Smartphones.",
            "An Investigation Into the Relationship Between Texture and Human Performance in Steering and Gesture Input Tasks.",
            "Usability: Lessons Learned ... and Yet to Be Learned.",
            "Development and Psychometric Evaluation of the Emotional Metric Outcomes (EMO) Questionnaire.",
            "INVISQUE as a Tool for Intelligence Analysis: The Construction of Explanatory Narratives.",
            "Gossiping Behavior on Social Networking Sites: Does Gender Matter?",
            "Older Adults' Text Entry on Smartphones and Tablets: Investigating Effects of Display Size and Input Method on Acceptance and Performance.",
            "A Comparative Study of Sonification Methods to Represent Distance and Forward-Direction in Pedestrian Navigation.",
            "Special Issue on Ambient Interaction.",
            "O/live: Transparent Distribution, Persistence, and Partial Replication for Ubiquitous User Interfaces.",
            "Ontology-Based Model for Supporting Dynamic and Adaptive User Interfaces.",
            "Human-Objects Interaction: A Framework for Designing, Developing and Evaluating Augmented Objects.",
            "Promoting Self-Reflection of Social Isolation Through Persuasive Mobile Technologies: The Case of Mother Caregivers of Children With Cancer.",
            "VirtualTouch: A Tool for Developing Mixed Reality Educational Applications and an Example of Use for Inclusive Education.",
            "Augmented Presentations: Supporting the Communication in Presentations by Means of Augmented Reality.",
            "Does Touch Matter?: The Effects of Haptic Visualization on Human Performance, Behavior and Perception.",
            "Scenario-Based Observation Approach for Eliciting User Requirements for Haptic User Interfaces.",
            "VITAKI: A Vibrotactile Prototyping Toolkit for Virtual Reality and Video Games.",
            "Haptics on a Touch Screen: Characterization of Perceptual Thresholds.",
            "The Effect of Vision on Discrimination of Compliance Using a Tool.",
            "Use of Reference Frame and Movement Pattern in Haptically Enhanced 3D Virtual Environment.",
            "The Impact of Combining Kinesthetic and Facial Expression Displays on Emotion Recognition by Users.",
            "Intermodal Audio-Haptic Metaphor: Improvement of Target Search in Abstract Environments.",
            "The Tap and Slide Keyboard: A New Interaction Method for Mobile Device Text Entry.",
            "A Context-Aware Interaction Model for the Analysis of Users' QoE in Mobile Environments.",
            "A Qualitative Study of Stakeholders' Perspectives on the Social Network Service Environment.",
            "Understanding the Different Influences of Online Trust on Loyalty by Risk Takers and Avoiders.",
            "The Discriminant Value of Personality, Motivation, and Online Relationship Quality in Predicting Attraction to Online Social Support on Facebook.",
            "Accessible Web Page Design for the Visually Impaired: A Case Study.",
            "Local News Chatter: Augmenting Community News by Aggregating Hyperlocal Microblog Content in a Tag Cloud."
        ]
    },
    {
        "name": "IJHCI",
        "year": "2013",
        "info": "2013: Volume 29",
        "count": 61,
        "papers": [
            "Optimal Entry Size of Handwritten Chinese Characters in Touch-Based Mobile Phones.",
            "Personality and Presence in Virtual Reality: Does Their Relationship Depend on the Used Presence Measure?",
            "Perceived Time as a Measure of Mental Workload: Effects of Time Constraints and Task Success.",
            "Reducing Error in Spreadsheets: Example Driven Modeling Versus Traditional Programming.",
            "A Cognitive Modeling Approach to Decision Support Tool Design for Anesthesia Provider Crisis Management.",
            "Usability Ratings for Everyday Products Measured With the System Usability Scale.",
            "Exploring Data Distributions: Visual Design and Evaluation.",
            "Trial Realization of Human-Centered Multimedia Navigation for Video Retrieval.",
            "Your Way Your Missions: A Location-Aware Pervasive Game Exploiting the Routes of Players.",
            "Predicting the Helpfulness of Online Reviews - A Replication.",
            "Technology-Based Service Encounters Using Self-Service Technologies in the Healthcare Industry.",
            "Don't Search, Just Show Me What I Did: Visualizing Provenance of Documents and Applications.",
            "A Comparative Study of Two Wayfinding Aids With Simulated Driving Tasks - GPS and a Dual-Scale Exploration Aid.",
            "Augmenting the Instant Messaging Experience Through the Use of Brain-Computer Interface and Gestural Technologies.",
            "Typology and Sociodemographic Characteristics of Massively Multiplayer Online Game Players.",
            "Reframing HCI Through Local and Indigenous Perspectives.",
            "Reflections on a Model of Culturally Influenced Human-Computer Interaction to Cover Cultural Contexts in HCI Design.",
            "Mobile Usability: Experiences From Iran and Turkey.",
            "Toward an Afro-Centric Indigenous HCI Paradigm.",
            "Website Usability in Asia \"From Within\": An Overview of a Decade of Literature.",
            "Scaffolding Technology for Low Literacy Groups: From Mobile Phone to Desktop PC?",
            "Revealing the Socio-Technical Context of Design Settings: Toward Participatory IS Design.",
            "Decentering Design: Wikipedia and Indigenous Knowledge.",
            "Psychometric Evaluation of the T-CSUQ: The Turkish Version of the Computer System Usability Questionnaire.",
            "Gender and Personality Trait Measures Impact Degree of Affect Change in a Hedonic Computing Paradigm.",
            "The Effect of Target Precuing on Pointing With Mouse and Touchpad.",
            "Thinking Aloud in the Presence of Interruptions and Time Constraints.",
            "Acceptance of Assistive Technology by Special Education Teachers: A Structural Equation Model Approach.",
            "A Comparative Study of Three Sorting Techniques in Performing Cognitive Tasks on a Tabular Representation.",
            "Chinese Keyboard Layout Design Based on Polyphone Disambiguation and a Genetic Algorithm.",
            "Development of a Weighted Heuristic for Website Evaluation for Older Adults.",
            "Learner Acceptance of a Multimedia-Based Learning System.",
            "Editorial Retractions.",
            "How In-Home Technologies Mediate Caregiving Relationships in Later Life.",
            "Development of an Instrument for Studying Flow in Computer Game Play.",
            "The \"Conducting Master\": An Interactive, Real-Time Gesture Monitoring System Based on Spatiotemporal Motion Templates.",
            "Elicitation of Haptic User Interface Needs of People with Low Vision.",
            "Usability Principles for Augmented Reality Applications in a Smartphone Environment.",
            "An Approach to Design Virtual Keyboards for Text Composition in Indian Languages.",
            "Age-Related Differences in Eye Tracking and Usability Performance: Website Usability for Older Adults.",
            "Enabling Human-Machine Interaction in Projected Virtual Environments Through Camera Tracking of Imperceptible Markers.",
            "Development of a Continuous Usage Model for the Adoption and Continuous Usage of a Smartphone.",
            "A Multimethod Evaluation of Online Trust and Its Interaction with Metacognitive Awareness: An Emotional Design Perspective.",
            "T2 Virtual PTSD Experience: A Virtual Worlds Environment to Educate Service Members and Veterans About Combat-Related Posttraumatic Stress Disorder.",
            "A Study of Pointing Performance of Elderly Users on Smartphones.",
            "Applying the Technology Acceptance Model to Social Networking Sites (SNS): Impact of Subjective Norm and Social Capital on the Acceptance of SNS.",
            "A Model-Based Analysis of Semiautomated Data Discovery and Entry Using Automated Content-Extraction.",
            "Dual Verbal Elicitation: The Complementary Use of Concurrent and Retrospective Reporting Within a Usability Test.",
            "A Review of Computer-Generated Simulation in the Pedagogy of Cataract Surgery Training and Assessment.",
            "Tweeting to Feel Connected: A Model for Social Connectedness in Online Social Networks.",
            "Understanding User Experience with Computer-Based Applications with Different Use Purposes.",
            "Accessibility Support for Older Adults with the ACCESS Framework.",
            "Mobile Web Browsing with Aural Flows: An Exploratory Study.",
            "How Does Software Visualization Contribute to Software Comprehension? A Grounded Theory Approach.",
            "Experimental Assessment of Agent-Supported Electronic Negotiations.",
            "Psychological Determinants of Using Facebook: A Research Review.",
            "Performance Comparison of a SSVEP BCI Task by Individual Stereoscopic 3D Susceptibility.",
            "Agency Effects in Human-Computer Interaction.",
            "EEG-Based Brain-Computer Interfaces: A Thorough Literature Survey.",
            "Creation of Interactive Virtual Environments for Exposure Therapy Through Game-Level Editors: Comparison and Tests on Presence and Anxiety.",
            "iReminder: An Intuitive Location-Based Reminder That Knows Where You Are Going."
        ]
    },
    {
        "name": "IJHCI",
        "year": "2012",
        "info": "2012: Volume 28",
        "count": 63,
        "papers": [
            "Designing Inclusive Interfaces Through User Modeling and Simulation.",
            "A Motivationally Oriented Approach to Understanding Game Appropriation.",
            "Enhancing Spatial Knowledge With Discrete Euclidean Virtual 3D Display Interfaces: Design Options.",
            "Investigating the Impact of Task Change Type and Transparency on Transfer of Learning.",
            "Recommender Systems: An Introduction, by Dietmar Jannach, Markus Zanker, Alexander Felfernig, and Gerhard FriedrichCambridge University Press, 2011, 336 pages. ISBN: 978-0-521-49336-9.",
            "Human Factors and Human-Computer Interaction Considerations in NextGen.",
            "Toward Automated Air Traffic Control - Investigating a Fundamental Paradigm Shift in Human/Systems Interaction.",
            "Using Engagement to Negate Vigilance Decrements in the NextGen Environment.",
            "Pilot Performance in Trajectory-Based Operations Under Concepts of Operation That Vary Separation Responsibility Across Pilots, Air Traffic Controllers, and Automation.",
            "Flight Deck Interval Management Delegated Separation Using Equivalent Visual Operations.",
            "Pilot Procedure-Following Behavior During Closely Spaced Parallel Approaches.",
            "Situation Awareness in the NextGen Air Traffic Management System.",
            "Understanding User Satisfaction With Instant Messaging: An Empirical Survey Study.",
            "Shall I Tell You Where I Live and Who I Am? Factors Influencing the Behavioral Intention to Disclose Personal Data for Online Government Transactions.",
            "Understanding the Intention to Use Technology by Preservice Teachers: An Empirical Test of Competing Theoretical Models.",
            "Codein - A New Notation for GOMS to Handle Evaluations of Reality-Based Interaction Style Interfaces.",
            "A Nonformal Interactive Therapeutic Multisensory Environment for People With Cerebral Palsy.",
            "Rapid Prototyping of Adaptable User Interfaces.",
            "Complexity Evaluation of Computer-Based Tasks.",
            "Understanding Computer Users With Tetraplegia: Survey of Assistive Technology Users.",
            "Updating Fitts' Law to Account for Restricted Display Field of View Conditions.",
            "Brain-Computer Interfaces for Multimodal Interaction: A Survey and Principles.",
            "DEEP: Design-Oriented Evaluation of Perceived Usability.",
            "Knowledge Sharing in Virtual Communities: A Study of Citizenship Behavior and Its Social-Relational Antecedents.",
            "Evaluation of a Geospatial Annotation Tool for Unmanned Vehicle Specialist Interface.",
            "Voice-Driven Sound Effect Manipulation.",
            "Skill Progression Demonstrated by Users in the Scratch Animation Environment.",
            "Are Stereotypes Relative to Gender Usage Applicable to Virtual Worlds?",
            "Generation, Adoption, and Tuning of Usability Evaluation Multimethods.",
            "Improving Window Manipulation and Content Interaction on High-Resolution, Wall-Sized Displays.",
            "Updating Fitts' Law to Account for Small Targets.",
            "Hedonic and Utilitarian Motivations for Physical Game Systems Use Behavior.",
            "Structuring Users' Self-Report Responses to Website Designs.",
            "A Chinese Text Input Brain-Computer Interface Based on the P300 Speller.",
            "Rethinking HCI Education for Design: Problem-Based Learning and Virtual Worlds at an HCI Design Studio.",
            "Explaining Instant Messaging Continuance Intention: The Role of Personality.",
            "Temporal Presence Variation in Immersive Computer Games.",
            "Does Context Matter? The Impact of Use Context on Mobile Internet Adoption.",
            "Considering Context: The Role of Mental Workload and Operator Control in Users' Perceptions of Usability.",
            "Development of an Adaptive EC Website With Online Identified Cognitive Styles of Anonymous Customers.",
            "Developing Multimodal Adaptation Algorithm for Mobility Impaired Users by Evaluating Their Hand Strength.",
            "Emotional Factors in Advertising Via Mobile Phones.",
            "Integration of Adaptable and Adaptive Approaches for Interface Personalization Through Collaborative Menu.",
            "Exploring the Individual's Behavior on Self-Disclosure Online.",
            "Formal Modeling and Reconfiguration of User Interfaces for Reduction of Errors in Failure Handling of Complex Systems.",
            "Reexamining the Factors for Trust in Cultivating Online Customer Repurchase Intentions: The Moderating Effect of Perceived Waiting.",
            "A Usable Security Heuristic Evaluation for the Online Health Social Networking Paradigm.",
            "The Voice in the Machine: Building Computers That Understand SpeechRoberto Pieraccini. MIT Press, 2012. 352 pages. ISBN: 978-0-262-01685-8.",
            "Distributed User Interfaces: Applications and Challenges.",
            "A Proposal to Validate the User's Goal in Distributed User Interfaces.",
            "From Centralized Interactive Tabletops to Distributed Surfaces: The Tangiget Concept.",
            "Investigating a Design Space for Multidevice Environments.",
            "Guidelines for Designing Awareness-Augmented Mobile DUIs.",
            "Design and Implementation of Post-WIMP Distributed User Interfaces with ZOIL.",
            "Using Distributed User Interfaces in Collaborative, Secure, and Privacy-Preserving Software Environments.",
            "Collaborative Map Exploration Using Multitouch Surfaces.",
            "A Comparative Evaluation of User Preferences for Extra-User Interfaces.",
            "Design and Evaluation of a Collaborative System That Supports Distributed User Interfaces.",
            "Relations Between the Tendency to Invest in Virtual Presence, Actual Virtual Presence, and Learning Outcomes in Educational Computer Games.",
            "Haptic User Interfaces for the Visually Impaired: Implications for Haptically Enhanced Science Learning Systems.",
            "Use and Design of Handheld Computers for Older Adults: A Review and Appraisal.",
            "Proposing a Survey Instrument for Measuring Operational, Formal, Information, and Strategic Internet Skills.",
            "Handbook of Human Factors and Ergonomics (4th ed.)."
        ]
    },
    {
        "name": "IJHCI",
        "year": "2011",
        "info": "2011: Volume 27",
        "count": 53,
        "papers": [
            "Current Trends in Brain-Computer Interface (BCI) Research and Development.",
            "A Feedback Information-Theoretic Approach to the Design of Brain-Computer Interfaces.",
            "Individual Characteristics and Their Effect on Predicting Mu Rhythm Modulation.",
            "Combining Eye Gaze Input With a Brain-Computer Interface for Touchless Human-Computer Interaction.",
            "A P300-Based Brain-Computer Interface: Effects of Interface Type and Screen Size.",
            "Predictive Spelling With a P300-Based Brain-Computer Interface: Increasing the Rate of Communication.",
            "Optimal Control Strategies for an SSVEP-Based Brain-Computer Interface.",
            "RAMSES: A Method for the Design Process of Interactive Information Systems.",
            "The Aesthetic Dimensions of U.S. and South Korean Responses to Web Home Pages: A Cross-Cultural Comparison.",
            "Understanding and Improving Cross-Cultural Decision Making in Design and Use of Digital Media: A Research Agenda.",
            "Perceived Impact of Asynchronous E-Learning After Long-Term Use: Implications for Design and Development.",
            "Perceived Electronic Service Quality: Some Preliminary Results From a Cross-National Study in Mobile Internet Services.",
            "Effects of Symmetry and Number of Compositional Elements on Chinese Users' Aesthetic Ratings of Interfaces: Experimental and Modeling Investigations.",
            "How Does the Agents' Appearance Affect Users' Interpretation of the Agents' Attitudes: Experimental Investigation on Expressing the Same Artificial Sounds From Agents With Different Appearances.",
            "An Improved Usability Measure Based on Novice and Expert Performance.",
            "Can User Choice Alter Experimental Findings in Human-Computer Interaction?: Similarity Attraction Versus Cognitive Dissonance in Social Responses to Synthetic Speech.",
            "Social Roles in an Online Support Community for Older People.",
            "A Visual Information Processing Model to Characterize Interactive Visualization Environments.",
            "Integrated Faceted Browser and Direct Search to Enhance Information Retrieval in Text-Based Digital Libraries.",
            "Menu Design for Computers and Cell Phones: Review and Reappraisal.",
            "Analyzing Social Media Networks with NodeXL: Insights from a Connected World by Derek Hansen, Ben Shneiderman, and Marc A. Smith.",
            "Event Perception in Mobile Interaction: Toward Better Navigation History Design on Mobile Devices.",
            "An Augmented Reality System for the Treatment of Phobia to Small Animals Viewed Via an Optical See-Through HMD: Comparison With a Similar System Viewed Via a Video See-Through HMD.",
            "Assessing Usability of Human-Machine Interfaces for Life Science Automation Using Computational Cognitive Models.",
            "In-Vehicle Information Systems to Meet the Needs of Drivers.",
            "Vision-Based Hand Interaction in Augmented Reality Environment.",
            "The Effects of Personality Traits on User Acceptance of Mobile Commerce.",
            "The Audience Funnel: Observations of Gesture Based Interaction With Multiple Large Displays in a City Center.",
            "Impact of Ergonomic and Social Psychological Perspective: A Case Study of Fashion Technology Adoption in Taiwan.",
            "Optimal View Angles in Three-Dimensional Objects Constructed From Plane Figures as Mental Images.",
            "Effects of Interactivity in Educational Games: A Mediating Role of Social Presence on Learning Outcomes.",
            "Templates for Cross-Cultural and Culturally Specific Usability Testing: Results From Field Studies and Ethnographic Interviewing in Three Countries.",
            "Identifying Usability Issues for Personalization During Formative Evaluations: A Comparison of Three Methods.",
            "Evaluation of Virtual Keyboards for Interactive Digital Television Applications.",
            "Personal Usability Constructs: How People Construe Usability Across Nationalities and Stakeholder Groups.",
            "Users' Attitude and Strategies in Information Management With Multiple Computers.",
            "The Role of Structure and Content in Perception of Visual Similarity Between Web Pages.",
            "An Empirical Study of Tagging for Personal Information Organization: Performance, Workload, Memory, and Consistency.",
            "Extensible Auditory Progress Bar Design: Performance and Aesthetics.",
            "The Effects of Social Influence on User Acceptance of Online Social Networks.",
            "Quantitative Physiological Assessment of Stress Via Altered Immune Functioning Following Interaction With Differing Automotive Interface Technologies.",
            "The Impact of Computer Self-Efficacy and Technology Dependence on Computer-Related Technostress: A Social Cognitive Theory Perspective.",
            "Ingredients and Meals Rather Than Recipes: A Proposal for Research That Does Not Treat Usability Evaluation Methods as Indivisible Wholes.",
            "Engaging Families in Lifestyle Changes Through Social Networking.",
            "Copresence and Its Social-Relational Antecedents in Computer-Mediated Communication: The Case of Instant Messenger.",
            "Communicative NGOMSL: Development of an Evaluation Method for a Text-Based Communication System.",
            "Social Mediating Technologies: Social Affordances and Functionalities.",
            "Rethinking Reading for Age From Paper and Computers.",
            "The Impact of Cognitive Style on User Preference Based on Usability and Aesthetics for Computer-Based Systems.",
            "Haptic Seat Interfaces for Driver Information and Warning Systems.",
            "Can Convenience and Effectiveness Converge in Mobile Web? A Critique of the State-of-the-Art Adaptation Techniques for Web Navigation on Mobile Handheld Devices.",
            "Predicting Attitudes Toward Knowledge Sharing by E-Mail: An Empirical Study.",
            "Examining Postadoption Usage of Mobile Services From a Dual Perspective of Enablers and Inhibitors."
        ]
    },
    {
        "name": "IJHCI",
        "year": "2010",
        "info": "2010: Volume 26",
        "count": 50,
        "papers": [
            "A Unified Human-Computer Interaction Requirements Analysis Framework for Complex Socio-technical Systems.",
            "Development of the Conceptual Prototype for Haptic Interface on the Telematics System.",
            "Usability: A Critical Analysis and a Taxonomy.",
            "Enabling Collaborative Work Across Different Communities of Practice Through Boundary Objects: Field Studies in Air Traffic Management.",
            "Editorial: Explorations Into Naturalistic Decision Making With Computers.",
            "Can Computers Help Overcome Limitations in Human Decision Making?",
            "Avoiding Latent Design Conditions Using UI Discovery Tools.",
            "Using the Decision-Ladder to Add a Formative Element to Naturalistic Decision-Making Research.",
            "Supporting Naturalistic Decision Making Through Location-Based Photography: A Study of Simulated Military Reconnaissance.",
            "From the 6 Ps of Planning to the 4 Ds of Digitization: Difficulties, Dilemmas, and Defective Decision Making.",
            "Designing an Information Visualization Tool for Sensemaking.",
            "Decisions, Decisions ... and Even More Decisions: Evaluation of a Digitized Mission Support System in the Land Warfare Domain.",
            "The Effect of a Geographical Information System on Performance and Communication of a Command and Control Organization.",
            "Design and Implementation of a Cognitive Command and Control System for Tower Controllers.",
            "Collaborative Activities During an Outbreak Early Warning Assisted by a Decision-Supported System (ASTER).",
            "Naturalistic Decision Making for Power System Operators.",
            "User Preference for a Control-Based Reduced Processing Decision Support Interface.",
            "Learning Virtual Community Loyalty Behavior From a Perspective of Social Cognitive Theory.",
            "Design of Eye-Typing Interface Using Saccadic Latency of Eye Movement.",
            "A Method of Human Reliability Assessment Based on Systemic-Structural Activity Theory.",
            "Editorial - Evaluating New Interactions in Health Care: Challenges and Approaches.",
            "Ecological Validity and Pervasiveness in the Evaluation of Ubiquitous Computing Technologies for Health Care.",
            "Fidelity Considerations for Simulation-Based Usability Assessments of Mobile ICT for Hospitals.",
            "InfoFlow Framework for Evaluating Information Flow and New Health Care Technologies.",
            "Human-Centered Evaluation for Broadband Tertiary Outpatient Telehealth: A Case Study.",
            "Multiple Forms of Appropriation in Self-Monitoring Technology: Reflections on the Role of Evaluation in Future Self-Care.",
            "Images of Usability.",
            "What Drives People to Continue to Play Online Games? An Extension of Technology Model and Theory of Planned Behavior.",
            "Evaluation of P300-Based Brain-Computer Interface in Real-World Contexts.",
            "HCI and Society: Towards a Typology of Universal Design Principles.",
            "Spatial Representation of a Virtual Room Space: Perspective and Vertical Movement.",
            "Structure Processing of Web-Based Menus.",
            "How Age Affects Pointing With Mouse and Touchpad: A Comparison of Young, Adult, and Elderly Users.",
            "HCI Remixed: Reflections on Works That Have Influenced the HCI Community by Thomas Erickson and David W. McDonald.",
            "State of the Art on the Cognitive Walkthrough Method, Its Variants and Evolutions.",
            "Comparing Inspections and User Testing for the Evaluation of Virtual Environments.",
            "Invisible Marker-Based Augmented Reality.",
            "Assessing Online Learning Ability From a Social Exchange Perspective: A Survey of Virtual Teams Within Business Organizations.",
            "Development of an Instrument to Measure Enjoyment of Computer Game Play.",
            "Measuring Internet Skills.",
            "Modeling the Interaction of Users and Mobile Payment System: Conceptual Framework.",
            "A Context-of-Use Taxonomy for Usability Studies.",
            "A Review of Online Advertising Effects on the User Experience.",
            "HCI and Social Computing.",
            "Too Many Facebook \"Friends\"? Content Sharing and Sociability Versus the Need for Privacy in Social Network Sites.",
            "TimeMatrix: Analyzing Temporal Social Networks Using Interactive Matrix-Based Visualizations.",
            "Designing Mobile Social Networking Service Through UCD Process: LifeDiary.",
            "An Analysis of Self-Construals, Motivations, Facebook Use, and User Satisfaction.",
            "The Influence of Cultural Differences on the Use of Social Network Services and the Formation of Social Capital.",
            "Older Adults in an Aging Society and Social Computing: A Research Agenda."
        ]
    },
    {
        "name": "IJHCI",
        "year": "2009",
        "info": "2009: Volume 25",
        "count": 36,
        "papers": [
            "Evaluation of Wayfinding Aids in Virtual Environment.",
            "Categorization Constructionist Assessment with Software-Based Affinity Diagramming.",
            "Exploring the Value of Usability Feedback Formats.",
            "Developing a Usability Evaluation Method for e-Learning Applications: Beyond Functional Usability.",
            "The Cognitive Artifacts of Designing. Lawrence Erlbaum Associates by Willemien Visser.",
            "Measuring Player Immersion in the Computer Game Narrative.",
            "The Effects of Different Presentation Modalities on a Person Identification Task: A Study of Wireless Multimedia PDA Use in a Security Context.",
            "Evaluation and Improvement of Interface Aesthetics with an Interactive Genetic Algorithm.",
            "Beyond the Desktop Metaphor: Design Integrated Digital Work Environments by Victor Kaptelinin.",
            "Understanding User Acceptance of DMB in South Korea Using the Modified Technology Acceptance Model.",
            "Hardware Support for Navigating Large Digital Documents.",
            "Learning Online Brand Personality and Satisfaction: The Moderating Effects of Gaming Engagement.",
            "Better in 3D? An Empirical Investigation of User Satisfaction and Preferences Concerning Two-Dimensional and Three-Dimensional Product Representations in Business-to-Consumer E-Commerce.",
            "Integration of Usability Evaluation Studies via a Novel Meta-Analytic Approach: What are Significant Attributes for Effective Evaluation?",
            "Editorial for the Special Issue of the International Journal of Human-Computer Interaction.",
            "The Balance Theory and the Work System Model ... Twenty Years Later.",
            "Can't We All Just Get Along? Some Alternative Views of the Knowledge Worker in Complex HCI Systems.",
            "Questionnaire Survey Nonresponse: A Comparison of Postal Mail and Internet Surveys.",
            "Do Beliefs About Hospital Technologies Predict Nurses' Perceptions of Quality of Care? A Study of Task-Technology Fit in Two Pediatric Hospitals.",
            "Mobile Internet Services from Consumers' Perspectives.",
            "Macroergonomics and Information Systems Development.",
            "Effects of Importance and Detectability of Usability Problems on Sample Size Requirements.",
            "Designing for All in Ambient Intelligence Environments: The Interplay of User, Context, and Technology.",
            "Review Study of Computer Input Devices and Older Users.",
            "Perception of Interactivity: Affects of Four Key Variables in Mobile Advertising.",
            "Dynamic Difficulty Adjustment in Computer Games Through Real-Time Anxiety-Based Affective Feedback.",
            "QN-ACES: Integrating Queueing Network and ACT-R, CAPS, EPIC, and Soar Architectures for Multitask Cognitive Modeling.",
            "Review and Reappraisal of Smart Clothing.",
            "The Role of Organizational and Individual Characteristics in Technology Acceptance.",
            "Softly Elastic 6 DOF Input.",
            "Nomadic Speech-Based Text Entry: A Decision Model Strategy for Improved Speech to Text Processing.",
            "Designing the User Interface: Strategies for Effective Human-Computer Interaction (5th Edition) by B. Shneiderman and C. Plaisant.",
            "Active-Input Provides More Movement and Muscle Activity During Electronic Game Playing by Children.",
            "Content Preparation for E-Commerce Involving Chinese and U.S. Online Consumers.",
            "The Optimal Size of Handwriting Character Input Boxes on PDAs.",
            "Vision for Performance in Virtual Environments: The Role of Feedback Timing."
        ]
    },
    {
        "name": "IJHCI",
        "year": "2008",
        "info": "2008: Volume 24",
        "count": 44,
        "papers": [
            "Editorial: Welcome to the First Issue of 2008.",
            "Human-Centered Computing: Defining a Research Agenda.",
            "Applying Web Usability Criteria for Vision-Impaired Users: Does It Really Improve Task Performance?",
            "Investigation of the Use of Navigation Tools in Web-Based Learning: A Data Mining Approach.",
            "Evaluation of the Efficacy of Affective Education Online Training in Promoting Academic and Professional Learning and Social Capital.",
            "Effects of Time Lag of Utterances to Communicative Actions on Embodied Interaction With Robot and CG Character.",
            "Introduction to Social TV: Enhancing the Shared Experience with Interactive TV.",
            "At the Intersection of Broadband and Broadcasting: How Interactive TV Technologies can Support Human Connectedness.",
            "Social TV: Designing for Distributed, Sociable Television Viewing.",
            "Toward Advanced Social TV in a Cooperative Media Space.",
            "Interactive TV for the Home: An Ethnographic Study on Users' Requirements and Experiences.",
            "Coupling the Users: The Benefits of Paired User Testing for iDTV.",
            "Viewers' Experiences of a TV Quiz Show with Integrated Interactivity.",
            "Application of Systemic-Structural Theory of Activity in the Development of Predictive Models of User Performance.",
            "Effects of Symmetry and Number of Compositional Elements on Interface and Design Aesthetics.",
            "Understanding Usability and User Experience of Web-Based 3D Graphics Technology.",
            "Examining Usability of Web Privacy Policies.",
            "A Comparative Study Between Tablet and Laptop PCs: User Satisfaction and Preferences.",
            "Introduction: In-Use, In-Situ: Extending Field Research Methods - Part 2.",
            "Evaluation of Human Interaction with Complex Systems Using a Full-Scope Simulator: Lessons Learned and Methodological Issues.",
            "Challenges of Capturing Natural Web-Based User Behaviors.",
            "Discriminating Conduct: Deploying Systems to Support Awareness in Organizations.",
            "Special Issue Introduction: Investigating and Cultivating Creativity.",
            "An Exploration of Constraints and End User Development in Environments for Creative Tasks.",
            "An Experimental Method for Measuring the Emergence of New Ideas in Information Discovery.",
            "Aspects of Everyday Design: Resourcefulness, Adaptation, and Emergence.",
            "Group Creativity in Interaction: Collaborative Referencing, Remembering, and Bridging.",
            "Dancing with Words: Using Animated Text for Captioning.",
            "Norman, D. (2007). The Design of Future Things.",
            "A Framework and an Environment for Collaborative Analysis of User Experience.",
            "User Interface Design Principles for Interactive Television Applications.",
            "An Empirical Evaluation of the System Usability Scale.",
            "Attributions of Responsibility Toward Computing Technology: The Role of Interface Social Cues and User Gender.",
            "Gerry Stahl. Group Cognition: Computer Support for Building Collaborative Knowledge.",
            "Jonathan Lazar. Web Usability: A User-Centered Design Approach.",
            "Special Issue Introduction: HCI Studies in MIS.",
            "Two Types of Attitudes in ICT Acceptance and Use.",
            "The Relationship Between Mobile Service Quality, Perceived Technology Compatibility, and Users' Perceived Playfulness in the Context of Mobile Information and Entertainment Services.",
            "An Experimental Study of Antecedents and Consequences of Online Ad Intrusiveness.",
            "Designing Product Lists for E-commerce: The Effects of Sorting on Consumer Decision Making.",
            "Exploring Multidimensional Conceptualization of Social Presence in the Context of Online Communities.",
            "Experiences with the Implementation of Computerized Tools in Health Care Units: A Review Article.",
            "Development of a Dual-Modal Presentation of Texts for Small Screens.",
            "Use of Decision Support for Clothing Products on the Web Results in No Difference in Perception of Tactile Sensation Than Actually Touching the Material."
        ]
    },
    {
        "name": "IJHCI",
        "year": "2007",
        "info": "2007: Volumes\n22, 23",
        "count": 32,
        "papers": [
            "In Use, In Situ: Extending Field Research Methods.",
            "Studying Usability In Sitro: Simulating Real World Phenomena in Controlled Environments.",
            "Drivers Using Mobile Phones in Traffic: An Ethnographic Study of Interactional Adaptation.",
            "Cognitive Artifacts in Support of Medical Shift Handover: An In Use, In Situ Evaluation.",
            "Contextual Method for the Redesign of Existing Software Products.",
            "Conducting In Situ Evaluations for and With Ubiquitous Computing Technologies.",
            "Electronic Furniture for the Curious Home: Assessing Ludic Designs in the Field.",
            "An Approach to the Evaluation of Usefulness as a Social Construct Using Technological Frames.",
            "Modular or Integrated? - An Activity Perspective for Designing and Evaluating Computer-Based Systems.",
            "The Effect of Rich Web Portal Design and Floating Animations on Visual Search.",
            "Work-Domain Experts as Evaluators: Usability Inspection of Domain-Specific Work-Support Systems.",
            "What Frustrates Screen Reader Users on the Web: A Study of 100 Blind Users.",
            "Optimizing Heuristic Evaluation Process in E-Commerce: Use of the Taguchi Method.",
            "Understanding Mobile Human-Computer Interaction.",
            "Introduction: Toward Universal ICT Media Design: HCI Research at NTT Cyber Solutions Laboratories.",
            "Search Result Clustering Using Informatively Named Entities.",
            "Kanshinji Antenna: A Japanese-language Concept Search System.",
            "Instant Topic Extraction From a Text-Based Communication Channel for Seeing the World.",
            "EyePrint: Using Passive Eye Trace From Reading to Enhance Document Access and Comprehension.",
            "VoiceBlog: Universally Designed Voice Browser.",
            "A New Multimedia Content Skimming Technique at Arbitrary User-Set Rate Based on Automatic Speech Emphasis Extraction.",
            "Discovery Search System That Supports the User's Interest Using the Referrals of Other Users.",
            "C-Blink: A Hue-Difference-Based Light Signal Marker via a Cell Phone Color Display.",
            "Factors Affecting User Reassurance When Handling Information in a Public Work Environment.",
            "A Review of: \"Foundations of Augmented Cognition by Schmorrow, D. D.\".",
            "A Review of: \"Handbook of Human Factors and Ergonomics by Salvendy, G.\".",
            "in Honor of Ben Shneiderman's 60th Birthday: Reflections on Human-Computer Interaction.",
            "Find What You Need, Understand What You Find.",
            "20 Years of Four HCI Conferences: A Visual Exploration.",
            "Exploratory Data Analysis With Categorical Variables: An Improved Rank-by-Feature Framework and a Case Study.",
            "Capture, Annotate, Browse, Find, Share: Novel Interfaces for Personal Photo Management.",
            "HCI and Societal Issues: A Framework for Engagement."
        ]
    },
    {
        "name": "IJHCI",
        "year": "2006",
        "info": "2006: Volumes\n20, 21",
        "count": 36,
        "papers": [
            "Editorial.",
            "A Study of the Feasibility and Effectiveness of Dual-Modal Information Presentations.",
            "Interruption Management and Telephone Call Screening.",
            "Brick-Building Interface Support for Cocreative Communication.",
            "Creativity Support Tools: Report From a U.S. National Science Foundation Sponsored Workshop.",
            "A Process-Oriented Interactive Design Environment for Automatic User-Interface Adaptation.",
            "Enhancing the Minority Discipline in the IT Industry: A Survey of Usability and User-Centered Design Practice.",
            "Query-By-Object Interface for Information Requirement Elicitation in M-Commerce.",
            "Book Review: Handbook of Human Factors in Web Design, 2005.",
            "Book Review: Usability and Internationalization of Information Technology (Human Factors/Ergonomics Series).",
            "Editorial: HCI Innovations in Korea.",
            "Culturability in Mobile Data Services: A Qualitative Study of the Relationship Between Cultural Characteristics and User-Experience Attributes.",
            "A Usability Checklist for the Usability Evaluation of Mobile Phone User Interface.",
            "Presenting a Submenu Window for Menu Search on a Cellular Phone.",
            "A Novel Interactive Mouse System for Holistic Haptic Display in a Human-Computer Interface.",
            "A 3D Vision-Based Ambient User Interface.",
            "Development of a Virtual Reality Training System for Live-Line Workers.",
            "Eye-gaze input versus mouse: Cursor control as a function of age.",
            "Design and evaluation of visualization support to facilitate association rules modeling.",
            "A study on the factors that improve the velocity perception of a virtual reality-based vehicle simulator.",
            "Designing intelligent systems to handle system failures: Enhancing explanatory power with less restrictive user interfaces and deep explanations.",
            "Effective display of medical laboratory report results on small screens: Evaluation of linear and hierarchical displays.",
            "Left-handed scrolling for pen-based devices.",
            "Book review.",
            "The Interplay Between Usability Evaluation and User Interaction Design.",
            "Problem Prioritization in Usability Evaluation: From Severity Assessments Toward Impact on Design.",
            "Evaluating the Downstream Utility of User Tests and Examining the Developer Effect: A Case Study.",
            "The Impact of Usability Reports and User Test Observations on Developers' Understanding of Usability Data: An Exploratory Study.",
            "Claims Analysis \"In the Wild: \" A Case Study on Digital Library Development.",
            "People, Organizations, and Processes: An Inquiry into the Adoption of User-Centered Design in Industry.",
            "Focus, Fit, and Fervor: Future Factors Beyond Play With the Interplay.",
            "The Cognitive Revolution at Age 50: Has the Promise of the Human Information-Processing Approach Been Fulfilled?",
            "Hand Motion Oscillatory Gestures and Multimodal Discourse Analysis.",
            "\"You've Got E-Mail!\" ... Shall I Deal With It Now? Electronic Mail From the Recipient's Perspective.",
            "Evaluating and Improving a Self-Help Technical Support Web Site: Use of Focus Group Interviews.",
            "Book Review: User Interface Design and Evaluation by Stone, Jarrett, Woodroffe, & Minocha."
        ]
    },
    {
        "name": "IJHCI",
        "year": "2005",
        "info": "2005: Volumes\n18, 19",
        "count": 33,
        "papers": [
            "Hidden Costs of Graphical User Interfaces: Failure to Make the Transition from Menus and Icon Toolbars to Keyboard Shortcuts.",
            "Distributed Collaborative Design Teams: Media Effects on Design Processes.",
            "Usability of Graphical Icons in the Design of Human-Computer Interfaces.",
            "Multimodal Feedback as a Solution to Ocular Disease-Based User Performance Decrements in the Absence of Functional Visual Loss.",
            "The Role of Size of an Augmented Force Field in Computer-Aided Target Acquisition Tasks.",
            "Book Review: The Handbook of Data Mining by N. Ye.",
            "Book Review: The Handbook of Task Analysis for Human-Computer Interaction by D. Diaper and N. Stanton.",
            "Experiments Toward a Mutual Adaptive Speech Interface That Adopts the Cognitive Features Humans Use for Communication and Induces and Exploits Users' Adaptations.",
            "Use Contexts for the Mobile Internet: A Longitudinal Study Monitoring Actual Use of Mobile Internet Services.",
            "Challenges, Methodologies, and Issues in the Usability Testing of Mobile Applications.",
            "Five Psychometric Scales for Online Measurement of the Quality of Human-Computer Interaction in Web Sites.",
            "User-Centered Awareness in Computer-Supported Cooperative Work-Systems: Structured Embedding of Findings from Social Sciences.",
            "Editorial.",
            "Introduction: Human-Computer Interaction Studies in Management Information Systems.",
            "Visualizing E-Brand Personality: Exploratory Studies on Visual Attributes and E-Brand Personalities in Korea.",
            "The Enhanced Restricted Focus Viewer.",
            "Issues in Building Multiuser Interfaces.",
            "Online Consumer Trust and Live Help Interfaces: The Effects of Text-to-Speech Voice and Three-Dimensional Avatars.",
            "An Empirical Examination of the Effects of Web Personalization at Different Stages of Decision Making.",
            "Beyond Perceptions and Usage: Impact of Nature of Information Systems Use on Information System-Enabled Productivity.",
            "Role of Human-Computer Interaction Factors as Moderators of Occupational Stress and Work Exhaustion.",
            "Book Review Understanding Your Users: A Practical Guide to User Requirements by Catherine Courage and Kathy Baxter.",
            "Book Review Conceptual Foundations of Human Factors Measurement by David Meister.",
            "Monitoring and Evaluation of Time Delay.",
            "Navigation Fidelity in 3D Perspective Displays for Web-Based Shopping: From Nodes to Views.",
            "Why Does the Negative Impact of Inconsistent Knowledge on Web Navigation Persist?",
            "Kinematic Analysis of Cursor Trajectories Controlled With a Touchpad.",
            "A Process for Anticipating and Executing Icon Selection in Graphical User Interfaces.",
            "\"Tsunagari-kan\" Communication: Design of a New Telecommunication Environment and a Field Test with Family Members Living Apart.",
            "Speech-Based Text Entry for Mobile Handheld Devices: An Analysis of Efficacy and Error Correction Techniques for Server-Based Solutions.",
            "Learning Theory as Applied to Mechanical CAD Training of Novices.",
            "Empirically Testing User Characteristics and Fitness Factors in Enterprise Resource Planning Success.",
            "Speech Versus Touch: A Comparative Study of the Use of Speech and DTMF Keypad for Navigation."
        ]
    },
    {
        "name": "IJHCI",
        "year": "2004",
        "info": "2004: Volume\n17",
        "count": 29,
        "papers": [
            "Introduction.",
            "A Microworld Approach to Identifying Issues of Human-Automation Systems Design for Supporting Operator's Situation Awareness.",
            "Evaluation of Organizational Structure in Emergency Situations From the Viewpoint of Communication.",
            "InterActor: Speech-Driven Embodied Interactive Actor.",
            "Remote Infrared Audible Signage System.",
            "Design of Interactive Skill-Transfer Agent From a Viewpoint of Ecological Psychology.",
            "Visualization of Respiration in the Embodied Virtual Communication System and Its Evaluation.",
            "Trends in Usability Research and Activities in Japan.",
            "Introduction.",
            "Overview of the DARPA Augmented Cognition Technical Integration Experiment.",
            "Real-Time Analysis of EEG Indexes of Alertness, Cognition, and Memory Acquired With a Wireless EEG Headset.",
            "Neural Network Analysis of the Mastoid EEG for the Assessment of Vigilance.",
            "A Real-Time Index of Vagal Activity.",
            "Functional Optical Brain Imaging Using Near-Infrared During Cognitive Tasks.",
            "A Paradigm Shift in Interactive Computing: Deriving Multimodal Design Principles from Behavioral and Neurological Foundations.",
            "Dynamic Models of Augmented Cognition.",
            "Postural Control as a Probe for Cognitive State: Exploiting Human Information Processing to Enhance Performance.",
            "Book Review: Paper prototyping-The fast and easy way to design and refine user interfaces, by Carolyn Snyder.",
            "Book Review: HCI Models, theories, and frameworks: Towards a multidisciplinary science, by John M. Carroll.",
            "An Investigation of Text Throughput Speeds Associated with Pocket PC Input Method Editors.",
            "Proactive Task Support Enabled by a Neural Network: A Prototype for Telephone Triage.",
            "Determining Causes and Severity of End-User Frustration.",
            "Usability Inspection by Metaphors of Human Thinking Compared to Heuristic Evaluation.",
            "Cognitive Modeling of Student Learning in Web-Based Instructional Programs.",
            "Ethnography, Scenario-Based Observational Usability Study, and Other Reviews Inform the Design of a Web-Based E-Notebook.",
            "Human Body as the Medium in Dance Movement.",
            "Sharing Sense of Walking With Locomotion Interfaces.",
            "Effects of Duration of Immersion in a Virtual Reality Environment on Postural Stability.",
            "The Computer-Email-Web (CEW) Fluency Scale-Development and Validation."
        ]
    },
    {
        "name": "IJHCI",
        "year": "2003",
        "info": "2003: Volumes\n15, 16",
        "count": 59,
        "papers": [
            "Editorial: Design Versus design: A Nordic Perspective.",
            "Design Versus design-From the Shaping of Products to the Creation of User Experiences.",
            "Dialogue Design-With Mutual Learning as Guiding Principle.",
            "Ethnographic Fieldwork Under Industrial Constraints: Toward Design-in-Context.",
            "Alarms-Localization, Orientation, and Recognition.",
            "Interaction Styles: An Aesthetic Sense of Direction in Interface Design.",
            "User Study of Video-Mediated Communication in the Domestic Environment With Intellectually Disabled Persons.",
            "Visitor-Oriented Design-Three Studies of Visitor Accommodation and a Call for Action.",
            "Visualizing Discussion History.",
            "Book Review.",
            "Book Review.",
            "Criteria For Evaluating Usability Evaluation Methods.",
            "The Evaluator Effect: A Chilling Fact About Usability Evaluation Methods.",
            "Introduction to Mediated Reality.",
            "Early Experiences of Visual Memory Prosthesis for Supporting Episodic Memory.",
            "Wearable Mobility Aid for Low Vision Using Scene Classification in a Markov Random Field Model Framework.",
            "Testing Visual Search Performance Using Retinal Light Scanning as a Future Wearable Low Vision Aid.",
            "Mediated Reality Through Glasses or Binoculars? Exploring Use Models of Wearable Computing in the Context of Aircraft Maintenance.",
            "Seeing with the Brain.",
            "The Internet Chair.",
            "On the Advantages of a Systematic Inspection for Evaluating Hypermedia Usability.",
            "Flexible User Interfaces for Group Collaboration.",
            "Training Novice Users in Developing Strategies for Responding to Errors When Browsing the Web.",
            "Effects of Cursor Orientation and Required Precision on Positioning Movements on Computer Screens.",
            "Muscular Activity in Relation to Support of the Upper Extremity in Work With a Computer Mouse.",
            "Evaluation of Shoulder Muscular Fatigue Induced During VDT Tasks.",
            "Does the Use of E-Mail Change Over Time?",
            "Presenting Movement in a Computer-Based Dance Tutor.",
            "Development and Evaluation of a Parenting Intervention Program: Integration of Scientific and Practical Approaches.",
            "Immersive Virtual Reality for Reducing Experimental Ischemic Pain.",
            "Book Review.",
            "Book Review.",
            "Introduction.",
            "ERP Implementation: Chief Information Officers' Perceptions of Critical Success Factors.",
            "Implementation Partner Involvement and Knowledge Transfer in the Context of ERP Implementations.",
            "A Process Change-Oriented Model for ERP Application.",
            "Analyzing ERP Implementation at a Public University Using the Innovation Strategy Model.",
            "Misalignments in ERP Implementation: A Dialectic Perspective.",
            "The Decision-Support Characteristics of ERP Systems.",
            "The Performance of Automated Speech Recognition Systems Under Adverse Conditions of Human Exertion.",
            "The Development and Evaluation of a Speech-to-Sign Translation System to Assist Transactions.",
            "Data Entry for Mobile Devices Using Soft Keyboards: Understanding the Effects of Keyboard Size and User Tasks.",
            "Electronic Survey Methodology: A Case Study in Reaching Hard-to-Involve Internet Users.",
            "Perceptions of Customer Service, Information Privacy, and Product Quality From Semiotic Design Features in an Online Web Store.",
            "A Systemic-Structural Activity Approach to the Design of Human-Computer Interaction Tasks.",
            "A Study of Computerized Offices in Greece: Are Ergonomic Design Requirements Met?",
            "Interfaces That Heal: Coupling Real and Virtual Objects to Treat Spider Phobia.",
            "Simulating Network Delays: Applications, Algorithms, and Tools.",
            "Cognitive Analysis of Process Knowledge Transfer in Computer Supported Cooperative Work.",
            "A Detailed Analysis of Task Performance With and Without Computer Monitoring.",
            "Interaction With Robots: Physical Constraints on the Interpretation of Demonstrative Pronouns.",
            "Introduction: Augmented Reality-Usability and Collaborative Aspects.",
            "Communication Behaviors in Colocated Collaborative AR Interfaces.",
            "Browsing the Real-World Wide Web: Maintaining Awareness of Virtual Information in an AR Information Space.",
            "Visual Performance in Augmented Reality Systems for Mobile Use.",
            "Field Design Sessions: Augmenting Whose Reality?",
            "Through-Walls Communication for Medical Emergency Services.",
            "Augmented Reality (AR) for Assembly Processes Design and Experimental Evaluation.",
            "Book Review: User Interfaces for All: Concepts, Methods, and Tools by C. Stephanidis (Ed.)."
        ]
    },
    {
        "name": "IJHCI",
        "year": "2002",
        "info": "2002: Volume\n14",
        "count": 27,
        "papers": [
            "Intuitive Human-Computer Interaction-Toward a User-Friendly Information Society.",
            "Content Preparation and Management for Web Design: Eliciting, Structuring, Searching, and Displaying Information.",
            "Intranets and Organizational Learning: A Research and Development Agenda.",
            "Book Review.",
            "Editorial.",
            "Modeling Cooperative Work Processes-A Multiple Perspectives Framework.",
            "Atmosphere: A Framework for Contextual Awareness.",
            "Development and Evaluation of a Groupware System to Support Chemical Design Processes.",
            "Awareness of Organizational Expertise.",
            "Documented Norms and Conventions on the Internet.",
            "Video Conferencing and Application Sharing: Routes to Awareness.",
            "Hypermedia Design Methodology in World Wide Web Applications.",
            "Designing the Total User Experience at IBM: An Examination of Case Studies, Research Findings, and Advanced Methods.",
            "DB2 Universal Database: A Case Study of a Successful User-Centered Design Program.",
            "Putting the \"D\" in UCD: User-Centered Design in the ThinkPad Experience Development.",
            "A Walk-Up-and-Use Information System for the Sydney Olympics: A Case Study in User-Centered Design.",
            "User-Centered Design at IBM Consulting.",
            "That's Entertainment! Designing Streaming, Multimedia Web Experiences.",
            "Ubiquitous Access to Unified Messaging: A Study of Usability and the Use of Pervasive Computing.",
            "Development of Diagrammatic Procedural Instructions for Performing Complex One-Time Tasks.",
            "Effect of Auditory Waiting Cues on Time Estimation in Speech Recognition Telephony Applications.",
            "Extending the Usability of Heuristics for Design and Evaluation: Lead, Follow, and Get Out of the Way.",
            "Psychometric Evaluation of the PSSUQ Using Data from Five Years of Usability Studies.",
            "Remote Usability Evaluation: Overview and Case Studies.",
            "The Use of Stories in User Experience Design.",
            "Crafting the Compelling User Experience.",
            "Book Review."
        ]
    },
    {
        "name": "IJHCI",
        "year": "2001",
        "info": "2001: Volume\n13",
        "count": 26,
        "papers": [
            "The Effectiveness of Virtual Reality Pain Control With Multiple Treatments of Longer Durations: A Case Study.",
            "Can a More Neutral Position of the Forearm When Operating a Computer Mouse Reduce the Pain Level for Visual Display Unit Operators? A Prospective Epidemiological Intervention Study: Part II.",
            "Beyond Translation: Approaches to Interactive Products for Chinese Consumers.",
            "Model Testing of Users' Comprehension in Graphical Animation: The Effect of Speed and Focus Areas.",
            "The Implications of Visualization Ability and Structure Preview Design for Web Information Search Tasks.",
            "Book Reviews.",
            "Introduction: Ubiquitous Computing: Anytime, Anyplace, Anywhere?",
            "Ensemble Computing.",
            "Wearable Computers: A Human Factors Review.",
            "Sensory Fabric for Ubiquitous Interfaces.",
            "\"You Talking to Me?\" Exploring Voice in Self-Service User Interfaces.",
            "A Case Study of On-Screen Prototypes and Usability Evaluation of Electronic Timers and Food Menu Systems.",
            "Where Is Computing Driving Cars?",
            "Data Collection in the Palm of Your Hand: A Case Study.",
            "Ubiquitous Computing on Campus: Patterns of Engagement by University Students.",
            "The Effects of Wireless Computing in Collaborative Learning Environments.",
            "Experience of Stress, Musculoskeletal Discomfort, and Eyestrain in Computer-Based Office Work: A Study in Municipal Workplaces.",
            "Proposal of an Index to Evaluate Visual Fatigue Induced During Visual Display Terminal Tasks.",
            "Implications of User Characteristics in Information Seeking on the World Wide Web.",
            "Introduction: Current Issues in Usability Evaluation.",
            "Usability Science. I: Foundations.",
            "Criteria For Evaluating Usability Evaluation Methods.",
            "Task-Selection Bias: A Case for User-Defined Tasks.",
            "The Evaluator Effect: A Chilling Fact About Usability Evaluation Methods.",
            "Evaluation of Procedures for Adjusting Problem-Discovery Rates Estimated From Small Samples.",
            "The Effect of Perceived Hedonic Quality on Product Appealingness."
        ]
    },
    {
        "name": "IJHCI",
        "year": "2000",
        "info": "2000: Volume 12",
        "count": 26,
        "papers": [
            "A Review of Presence and Performance in Virtual Environments.",
            "Metacognitive Processes in Human-Computer Interaction: Self-Assessments of Knowledge as Predictors of Computer Expertise.",
            "A Hierarchical Search History for Web Searching.",
            "Users' Recognition of Semantic Affinity Among Tasks and the Effects of Consistency.",
            "Work With the Visual Display Unit: Health Consequences.",
            "Using Electroencephalogram to Investigate Stages of Visual Search in Visually Impaired Computer Users: Preattention and Focal Attention.",
            "Visual Impairment: The Use of Visual Profiles in Evaluations of Icon Use in Computer-Based Tasks.",
            "Introduction: Empirical Studies of WWW Usability.",
            "Performance Benefits of Simultaneous Over Sequential Menus as Task Complexity Increases.",
            "Contextual Navigation Aids for Two World Wide Web Systems.",
            "Academic Articles on the Web: Reading Patterns and Formats.",
            "International Aspects of World Wide Web Usability and the Role of High-End Graphical Enhancements.",
            "Increasing the Usability of Online Information for Older Users: A Case Study in Participatory Design.",
            "Editorial.",
            "Introduction.",
            "Performance Model for Market-Oriented Design of Software Products.",
            "Problems and Benefits of Requirements Gathering With Focus Groups: A Case Study.",
            "Culture and Context: An Empirical Study for the Development of a Framework for the Elicitation of Cultural Influence in Product Usage.",
            "How to Build Up an Infrastructure for Intercultural Usability Engineering.",
            "Innovative User Interfaces in Automation Engineering by Application of Usability Engineering Methods Shown by the Example of a Three-Dimensional Plant Representation.",
            "User-Centered Standardization of Industrial Process Control User Interfaces.",
            "Design of a Graphical User Interface for Process Control Based on the Example of a Paper Recycling Plant.",
            "Designing a Telephone-Based Interface for a Home Automation System.",
            "Synergy and Subsidiarity: The Systematic Determination of Software, User, and Operating Instructions.",
            "Interactive Design Using the Example of a Complex Medical Application.",
            "Capturing Design Space From a User Perspective: The Repertory Grid Technique Revisited."
        ]
    },
    {
        "name": "IJHCI",
        "year": "1999",
        "info": "1999: Volume 11",
        "count": 18,
        "papers": [
            "Toward an Information Society for All: HCI Challenges and R&D Recommendations.",
            "Implications for Design of Computer Interfaces for Chinese Users in Mainland China.",
            "An Analysis of the Performance and Usability of a Software User Coach for Navy Manpower Planning.",
            "Handbook of Human-Computer Interaction (Book Review).",
            "Human Values and the Design of Computer Technology (Book Reviews).",
            "Can a More Neutral Position of the Forearm When Operating a Computer Mouse Reduce the Pain Level for Visual Display Unit Operators? A Prospective Epidemiological Intervention Study.",
            "Psychological Mood State, Psychosocial Aspects of Work, and Musculoskeletal Discomfort in Intensive Video Display Terminal (VDT) Work.",
            "Effect of Physical Ergonomics on VDT Workers' Health: A Longitudinal Intervention Field Study in a Service Organization.",
            "Extending Effective Target Width in Fitts' Law to a Two-Dimensional Pointing Task.",
            "Toward the Task-Complete Development of Activity-Oriented User Interfaces.",
            "Cognitive Walkthroughs: Understanding the Effect of Task-Description Detail on Evaluator Performance.",
            "Facilitate Complex Search Tasks in Hypertext by Externalizing Functional Properties of a Work Domain.",
            "An Investigation of Groupware Support for Collaborative Awareness Through Distortion-Oriented Views.",
            "How Experienced Users Avoid Getting Lost in Large Display Networks.",
            "Templates for Search Queries: A User-Centered Feature for Improving Web Search Tools.",
            "A Corporate Style Guide That Includes Domain Knowledge.",
            "Identification of an Acceptable Mixture of Key and Speech Inputs in Bimodal Interfaces.",
            "Decision Support for Indexing and Retrieval of Information in Hypertext Systems."
        ]
    },
    {
        "name": "IJHCI",
        "year": "1998",
        "info": "1998: Volume 10",
        "count": 18,
        "papers": [
            "Relation Between Quantitative and Qualitative Measures of Information Use.",
            "Improvement of Pointing Time by Predicting Targets in Pointing With a PC Mouse.",
            "Reliability of User Proficiency Measurement Technique.",
            "Information Flow and Development of Coordination in Distributed Supervisory Control Teams.",
            "External Statistical Data: Understanding Users and Improving Access.",
            "Codex, Memex, Genex: The Pursuit of Transformational Technologies.",
            "Toward an Information Society for All: An International Research and Development Agenda.",
            "Aftereffects and Sense of Presence in Virtual Environments: Formulation of a Research and Development Agenda.",
            "A Review of Intelligent Human-Machine Interfaces in the Light of the ARCH Model.",
            "Measuring the Sense of Presence and its Relations to Fear of Heights in Virtual Environments.",
            "Virtual Chess: Meaning Enhances Users' Sense of Presence in Virtual Environments.",
            "Testing the Boundaries of Two User-Centered Design Principles: Metaphors and Memory Load.",
            "Effectiveness of Speech Response Under Dual-Task Situations.",
            "Employing Queuing and Modeling in Intelligent Multimedia User Interfaces.",
            "The Integration of Speech and Camera Control in Message Transfer TV Conferencing.",
            "Evaluating the Layout of Graphical User Interface Screens: Validation of a Numerical Computerized Model.",
            "Heavy Users of Electronic Mail.",
            "A Taxonomy of Error Types for Failure Analysis and Risk Assessment."
        ]
    },
    {
        "name": "IJHCI",
        "year": "1997",
        "info": "1997: Volume 9",
        "count": 28,
        "papers": [
            "Neural Networks Approach to User Modeling and Intelligent Interface: A Review and Reappraisal.",
            "Modeling a User's Domain Knowledge With Neural Networks.",
            "A Comparison of Three Methods of Task Analysis: Cognitive Analysis, Graph-Matrix Analysis, and Self-Organizing Networks.",
            "A Neural Network Approach to Tracking Eye Position.",
            "Automatic Setting of Article Format Through Neural Networks.",
            "Workload When Using a Mouse as an Input Device.",
            "The Effect of Pictogram-Based Interface Design on Human-Computer Performance.",
            "Desktop Agent Manager (DAM): Decision Mechanism.",
            "Toward a Theory of the Effectiveness of Multimedia Systems.",
            "Effects of Color Combination and Typography on Identification of Characters Briefly Presented on VDTs.",
            "Individual Differences in the Use of Command Line and Menu Computer Interfaces.",
            "Development and Evaluation of the Windows Computer Experience Questionnaire (WCEQ).",
            "Heuristic Walkthroughs: Finding the Problems Without the Noise.",
            "The Effect of the Interface on Learning Style in a Simulation-Based Learning Situation.",
            "Analysis of Information Utilization (AIU).",
            "Preference-Based Human Factors Knowledge Repository for Designing User Interfaces.",
            "Temporal issues of Quality Working Life and Stress in Human-Computer Interaction.",
            "A Longitudinal Study of Work Characteristics and Health Complaints Among Insurance Employees in VDT Work.",
            "Longitudinal Study of Work Stress Among Information System Professionals.",
            "Toward a Multilevel Model in Longitudinal Studies on Computerization in Offices.",
            "New Information Technologies, Job Profiles, and External Workload as Predictors of Subjectively Experienced Stress and Dissatisfaction at Work.",
            "Implementation of Office Automation and Its Effects on Job Characteristics and Strain in a District Court.",
            "Use of Design Methods, Team Leaders' Goal Orientation, and Team Effectiveness: A Follow-Up Study in Software Development Projects.",
            "Would-Be-Worlds (Book Review).",
            "Genetic Algorithms and Engineering Design (Book Review).",
            "Goodbye, Descartes (Book Review).",
            "The Media Equation (Book Review).",
            "Building Executive Information Systems and other Decision Support Applications."
        ]
    },
    {
        "name": "IJHCI",
        "year": "1996",
        "info": "1996: Volume 8",
        "count": 26,
        "papers": [
            "Foreword: The interface will not disappear.",
            "Multimodal virtual reality: Input-output devices, system integration, and human factors.",
            "Postural instability induced by virtual reality exposure: Development of a certification protocol.",
            "Navigating large virtual spaces.",
            "Task-level interaction with virtual environments and virtual actors.",
            "The virtual academy: A simulated environment for constructionist learning.",
            "GENIUS: Generating software-ergonomic user interfaces.",
            "A theory of command language dialogue for a knowledge-based human-computer interaction.",
            "The importance of package features and learning factors for ease of use.",
            "Cognitive engineering principles for enhancing human-computer performance.",
            "Introduction: ML meets HCI.",
            "Survey of expert opinion: Which machine learning method may be used for which task?",
            "Automated user modeling for intelligent interface.",
            "Teaching intelligent agents: The disciple approach.",
            "Different ways to support intelligent assistant systems by use of machine learning methods.",
            "A machine learning approach to knowledge acquisitions from text databases.",
            "Sharing knowledge with robots.",
            "The application of genetic algorithms in a career planning environment: CAPTAINS.",
            "Book reviews.",
            "Mood disturbances and musculoskeletal discomfort: Effects of electronic performance monitoring under different levels of VDT data-entry performance.",
            "The effect of degree of upper arm flexion on shoulder-neck discomfort at the VDT.",
            "A longitudinal study of health complaints in professional computer work: Effects of computer-aided design.",
            "Ergonomic, job task, and psychosocial risk factors for work-related musculoskeletal disorders among teleservice center representatives.",
            "Dynamic workflow analysis in a multiuser task context.",
            "Empirical evaluation of performance models of pointing accuracy and speed with a PC mouse.",
            "Book reviews."
        ]
    },
    {
        "name": "IJHCI",
        "year": "1995",
        "info": "1995: Volume 7",
        "count": 24,
        "papers": [
            "Tactile feedback applied to computer mice.",
            "The influence of performance standards and feedback on speed and accuracy in an electronically monitored data-entry task.",
            "Visualization of three-dimensional structure during computer-aided design.",
            "IBM computer usability satisfaction questionnaires: Psychometric evaluation and instructions for use.",
            "Applying bifocal displays to topological maps.",
            "Book review.",
            "Evaluating a user interface with ergonomic criteria.",
            "A method for estimating code key-in times of college students.",
            "Domain-specific design of user interfaces.",
            "Considerations for linking seatpan and backrest angles.",
            "Predictors of learning performance in a computer-user training environment: A path-analytic study.",
            "Book review.",
            "Applications of fuzzy-based linguistic patterns for the assessment of computer screen design quality.",
            "The effects of mice and pull-down menus versus command-driven interfaces on writing.",
            "Factors affecting user tolerance for voice mail message transmission delays.",
            "A dialogue-based (natural language) platform for human interaction with an intelligent mining machine.",
            "Displaying a boundary in graphic and symbolic \"wait\" displays: Duration estimates and users' preferences.",
            "The relative effectiveness of hypertext and text.",
            "Experiences on computerization in different occupational groups.",
            "Visual interference with users' tasks on multiwindow systems.",
            "Methodology guide to task analysis with the goal of extracting relevant characteristics for human-computer interfaces.",
            "An approach to the design of a skill adaptive interface.",
            "Interactive reconstructive student modeling: A machine-learning approach.",
            "Book reviews."
        ]
    },
    {
        "name": "IJHCI",
        "year": "1994",
        "info": "1994: Volume 6",
        "count": 22,
        "papers": [
            "From users' task knowledge to high-level interface specification.",
            "Winners and losers from computerization: A study of the psychosocial work conditions and health of Swedish state employees.",
            "Performance variability as an indicator of fatigue and boredom effects in a VDT data-entry task.",
            "Contours and borders in animated mimic displays.",
            "Human-machine cooperation: Toward an activity regulation assistance for different air traffic control levels.",
            "Quantitative and qualitative differences between experts and novices in chunking computer software knowledge.",
            "Human-computer interaction and lean production: The shop floor example.",
            "Brain potential correlates of supraliminal contrast functions and defocus.",
            "Effects of electronic performance monitoring on job design and worker stress: Results of two studies.",
            "Multimedia and its impact on training engineers.",
            "New analysis of HRV through wavelet transform.",
            "Percentage of procedural knowledge acquired as a function of the number of experts from whom knowledge is acquired for diagnosis, debugging, and interpretation tasks.",
            "Self-assessment of VDT operator health: Hierarchical structure and validity analysis of a health checklist.",
            "Ergodynamics and macroergonomics in analysis of decision-making efficiency and complexity.",
            "A method for assessing the usability of graphical, direct-manipulation style interfaces.",
            "Automated speech recognition for spreadsheet tasks: Performance effects for experts and novices.",
            "Effects of six different highlighting modes on visual search performance in menu options.",
            "The full-time VDT operator as a working person: Musculoskeletal work discomfort and life situation.",
            "Error training: Replication and the function of exploratory behavior.",
            "An empirical evaluation of knowledge, cognitive style, and structure upon the performance of a hypertext task.",
            "Parallel use of hand gestures and force-input device for interacting with 3d and virtual reality environments.",
            "Human processing of two-dimensional graphics: Information-volume concepts and effects in graph-task fit anchoring frameworks."
        ]
    },
    {
        "name": "IJHCI",
        "year": "1993",
        "info": "1993: Volume 5",
        "count": 22,
        "papers": [
            "Stress reactions to computer-interactive tasks as a function of task structure and individual differences.",
            "Applications of psychology to computer-based tutoring systems.",
            "New goals for HCI training: How to mix old and new skills in the trainee.",
            "Application of theories of decision making to group decision support systems (GDSS).",
            "Book review.",
            "Pool size, job stressors, and health problems: A study of data entry clerks.",
            "The relationship between post-task and continuous-vicarious ratings of difficulty.",
            "The role of previous questions and answers in natural language dialogues with computers.",
            "Transfer of knowledge across computer command menus.",
            "A complexity measure of task content in information-input tasks.",
            "Cognitive processes in software fault detection: A review and synthesis.",
            "A comparative review of knowledge structure measurement techniques for interface design.",
            "Measurements of computer anxiety: A review.",
            "Operation of ternary chorded keys.",
            "Design of an alternative keyboard layout for the Greek language.",
            "Visual comfort in using different VDT screens.",
            "The structure and content of programming knowledge: Disentangling training and language effects in theories of skill development.",
            "Performance comparison of multiple image depth and shape cues.",
            "Visualization of 3-D computer-aided design objects.",
            "Multipoint scales: Mean and median differences and observed significance levels.",
            "The effects of running fewer subjects on time-on-task measures.",
            "Book reviews."
        ]
    },
    {
        "name": "IJHCI",
        "year": "1992",
        "info": "1992: Volume 4",
        "count": 22,
        "papers": [
            "The applications of cognitive theory and science to HCI: A psychological perspective.",
            "Towards a cognitive browser for OOPS.",
            "Conceptual instructions derived from an analysis of device models.",
            "Using neural net modeling for user assistance in HCI tasks.",
            "Interactive multimedia for instruction: A cognitive analysis of the role of audition and vision.",
            "Thinking or acting? Mental workload and subjective preferences for a command code and a direct manipulation interaction style.",
            "The impact of new technology by occupation and age on work in financial firms: A 2-year follow-up.",
            "An experimental investigation of the roles of the computer interface and individual characteristics in the learning of computer systems.",
            "VDT work affects urinary excretion of catecholamines in the young.",
            "A validation of ergonomic criteria for the evaluation of human-computer interfaces.",
            "A longitudinal study of VDT work and health.",
            "Effects of an episode of intensive keying on data process operators.",
            "Work rhythm and physiological rhythms in repetitive computer work: Effects of synchronization on well-being.",
            "The use of computers in offices: Impact on task characteristics and worker stress.",
            "Working conditions and weil-being among women office workers.",
            "Variety in VDT work: An issue for assessment in work environment research.",
            "Book reviews.",
            "Errors in working with office computers: A first validation of a taxonomy for observed errors in a field setting.",
            "Moving icons as a human interrupt.",
            "Focused interaction in dialogues.",
            "The effects of hierarchical structure and visualization ability on computerized information retrieval.",
            "Muscular loading and subjective ratings of muscular tension by novices when typing with standard and split-design computer keyboards."
        ]
    },
    {
        "name": "IJHCI",
        "year": "1991",
        "info": "1991: Volume 3",
        "count": 26,
        "papers": [
            "A study of handwriting and its implications for cognitive considerations in human-computer interactions.",
            "The impact of knowledge representation on cognitive-oriented task performance.",
            "What users say about software usability.",
            "Information technology transfer: Problems facing African developing nations.",
            "Analysis and classification of operators' demands for system improvements.",
            "Book reviews.",
            "Task orientation and user-oriented dialog design.",
            "Voice as interface: An overview.",
            "Measurements of computer attitudes: A review.",
            "What do novices learn during program comprehension?",
            "Information society and information technology.",
            "Book reviews.",
            "Dedication and acknowledgement.",
            "Foreword.",
            "An evaluation of VDT operations through the two-dimensional analysis of fixation points.",
            "Cooperative document retrieval making user's Ill-defined query evolve.",
            "An image technology expert system and its application to design consultation.",
            "Reconsidering engineering efficiency from the viewpoint of the disabled: The final report of the research and development group on handicapped ergonomics (R&DGHE).",
            "Ergonomic study of automatic teller machine operability.",
            "Basic study of the VRT (visual reaction test): The effects of illumination and luminance.",
            "Book review.",
            "Job stress and human-computer interaction.",
            "The potential contribution of information technology to the mental III health, job dissatisfaction, and alcohol intake of money market dealers: An exploratory study.",
            "Well-being and computer-mediated work of various occupational groups in banking and insurance.",
            "Working conditions and mental strain of automation personnel.",
            "Experimental comparison of CAD systems by stressor variables."
        ]
    },
    {
        "name": "IJHCI",
        "year": "1990",
        "info": "1990: Volume 2",
        "count": 21,
        "papers": [
            "Integrating social and cognitive factors in design of human-computer interactive communication.",
            "Acceptable muscle load on the neck and shoulder regions assessed in relation to the incidence of musculoskeletal sick leave: Implications for human-computer interaction.",
            "The design strategies of Chinese information display in supervisory control systems.",
            "Learning second and subsequent programming languages: A problem of transfer.",
            "Future directions for human-computer interaction.",
            "Ecological interfaces: A technological imperative in high-tech systems?",
            "Evaluation of a compact CAD course in laboratory experiments.",
            "Use and non-use of VDTs - organization of terminal work: Research findings from Swedish cross-site studies in the field of office automation.",
            "Potentially important factors in the success of microcomputers in small and medium-sized Colombian firms: An exploratory study.",
            "Public uses of information systems: Principles for design and application.",
            "Dominant wavelength and stimulus purity for VDT display color in terms of readability.",
            "Organizing human factors knowledge for the evaluation and design of interfaces.",
            "Measurements of computer satisfaction, literacy, and aptitudes: A review.",
            "The effect of screen complexify on user preference and performance.",
            "An adaptive document retrieval system using a neural network.",
            "Book reviews.",
            "A framework for development of fuzzy GOMS model for human-computer interaction.",
            "Identifying and interpreting design errors.",
            "Hypertext functionality: A theoretical framework.",
            "Using protocol analyses and drawings to study mental model construction during hypertext navigation.",
            "Book reviews."
        ]
    },
    {
        "name": "IJHCI",
        "year": "1989",
        "info": "1989: Volume 1",
        "count": 12,
        "papers": [
            "Editorial.",
            "Lost in computer space.",
            "System response time and method of pay: Stress effects in computer-based tasks.",
            "An experimental evaluation of three touch screen strategies within a hypertext database.",
            "The effects of withholding information about implementation details on the design of a human-computer interface.",
            "A study of human performance in computer-aided architectural design.",
            "An iconoclastic view beyond the desktop metaphor.",
            "Luminance and stimulus purify of VDT display color in terms of readability.",
            "What do users really want?",
            "Contribution of display size to speech intelligibility in videophone systems.",
            "A knowledge-based software environment (KBSE) for designing concurrent processes.",
            "Monitoring speech recognizer feedback during data entry from short-term memory: A working memory analysis."
        ]
    }
]