[
    {
        "year": "2021",
        "name": "ISS 2021",
        "info": "Łódź, Poland",
        "venues": [
            {
                "sub_name_abbr": "conf/tabletop/2021c",
                "sub_name": "ISS '21: Interactive Surfaces and Spaces, Łódź, Poland, November 14 - 17, 2021, Companion Volume.",
                "count": 11,
                "papers": [
                    "No Door Handle, No Entry! Expressing Cues through a Shape-Changing Door.",
                    "Distant Assist Cursor (DAC): Designing an Augmented Reality System to Facilitate Remote Collaboration for Novice Users.",
                    "Touch and Explore: A VR Game Exploration, Based on Haptic Driven Game-play.",
                    "Artefact: A UML-based framework for model-driven development of interactive surface prototypes.",
                    "Sweet Spot: Displaying Interaction Areas on Everyday Home Surfaces using AR.",
                    "How Content Drives Interaction With Public Displays.",
                    "ALiSE: Through the mirrored space, and what user interacts with avatars naturally.",
                    "Fast 3D point-cloud segmentation for interactive surfaces.",
                    "Adapting a Floor Sensor for Autonomous Robots in a Smart Building.",
                    "Teaching Conversational Robots in a Museum Exhibition with Interactive Surfaces.",
                    "Transitional Interfaces in Mixed and Cross-Reality: A new frontier?"
                ]
            }
        ]
    },
    {
        "year": "2020",
        "name": "ISS 2020",
        "info": "Virtual Event, Portugal",
        "venues": [
            {
                "sub_name_abbr": "conf/tabletop/2020c",
                "sub_name": "ISS '20: Interactive Surfaces and Spaces, Virtual Event, Portugal, November 8-11, 2020, Companion Volume.",
                "count": 26,
                "papers": [
                    "The Future of Mixed Reality Interactions.",
                    "Beyond Performance: Considerations for End-User Comfort in the Design of In-Situ User Interfaces.",
                    "Towards Visualizing and Exploring Multivariate Networks on Mobile Devices.",
                    "MarioControl: An Intuitive Control Method for a Mobile Robot from a Third-Person Perspective.",
                    "Smart Elevator Hall: Prototype of In-building Guiding Using Interactive Floor Display.",
                    "Interactions with Digital Mountains: Tangible, Immersive and Touch Interactive Virtual Reality.",
                    "Augmented Reality Application in Vocational Education: A Case of Welding Training.",
                    "MaskMe: Using Masks to Design Collaborative Games for Helping Children with Autism Make Eye Contact.",
                    "Exploring Tangible VR as a Tool for Workplace Design.",
                    "Towards Computational Identification of Visual Attention on Interactive Tabletops.",
                    "Backhand Display: A Wearable Device for the Back of the Hand.",
                    "TapStr: A Tap and Stroke Reduced-Qwerty for Smartphones.",
                    "IIMR: A Framework for Intangible Mid-Air Interactions in a Mixed Reality Environment.",
                    "Applying Pen Pressure, Tilt and Touch Interactions to Data Visualizations.",
                    "Project Esky: Enabling High Fidelity Augmented Reality on an Open Source Platform.",
                    "Face HotPot: An Interactive Projection Device for Hot Pot.",
                    "Interactions with a Hybrid Map for Navigation Information Visualization in Virtual Reality.",
                    "SIERA: The Seismic Information Extended Reality Analytics Tool.",
                    "ShadowDancXR: Body Gesture Digitization for Low-cost Extended Reality (XR) Headsets.",
                    "EDUCO: An Augmented Reality Application to Enrich Learning Experience of Students for History and Civics Subjects.",
                    "Virtual Reality for Understanding Multidimensional Spatiotemporal Phenomena in Neuroscience.",
                    "PUMP FIT: An Augmented Reality Application Which Helps People with Their Workout More Efficiently.",
                    "Designing Interactions for Multi-touch Spherical Displays to Support Collaborative Learning in Museums.",
                    "Merging Physical and Digital in the Initial Design Stages of Architecture.",
                    "Volumetric Reach-through Displays for Direct Manipulation of 3D Content.",
                    "International Workshop on Cross-Reality (XR) Interaction."
                ]
            },
            {
                "sub_name_abbr": "conf/tabletop/2020xr",
                "sub_name": "Proceedings of the International Workshop on Cross-Reality (XR) Interaction co-located with 14th ACM International Conference on Interactive Surfaces and Spaces (ACM ISS 2020), Lisbon, Portugal, October 8, 2020.",
                "count": 8,
                "papers": [
                    "Cross-Virtuality Visualization, Interaction and Collaboration.",
                    "Sound 2121: Cross-Reality Transitions Between Real and Augmented Sound Landscape.",
                    "It Takes Two To Tango: Conflicts Between Users on the Reality-Virtuality Continuum and Their Bystanders.",
                    "Outdoors Mobile Augmented Reality for Coastal Erosion Visualization Based on Geographical Data.",
                    "Individual and Collaborative Cross-reality Immersive Analytics - Initial Ideas.",
                    "The Body in Cross-Reality: A Framework for Selective Augmented Reality Visualisation of Virtual Objects.",
                    "Exploring Visuo-Tactile Embodiment in a Social Virtual Reality Setting with a Physical Wheelchair for Training Empathy Towards Social Disability Barriers.",
                    "Using a VR Field Study to Assess the Effects of Visual and Haptic Cues in \"In-the-Wild\" Locomotion."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "ISS 2019",
        "info": "Daejeon, South Korea",
        "venues": [
            {
                "sub_name_abbr": "conf/tabletop/2019",
                "sub_name": "Proceedings of the 2019 ACM International Conference on Interactive Surfaces and Spaces, ISS 2019, Daejeon, South Korea, November 10-13, 2019.",
                "count": 52,
                "papers": [
                    "Ubiety, Mobility & Transitions: The Quest for Ecological Intelligence.",
                    "Shared, Subscribed & Supernatural Surface, Surfable - Speculation and Strategy.",
                    "Is it Real? Measuring the Effect of Resolution, Latency, Frame rate and Jitter on the Presence of Virtual Entities.",
                    "Creating Accessible Interactive Audio-Tactile Drawings using Spatial Augmented Reality.",
                    "DesignAR: Immersive 3D-Modeling Combining Augmented Reality with Interactive Displays.",
                    "Spotlight on Off-Screen Points of Interest in Handheld Augmented Reality: Halo-based techniques.",
                    "CARDS: A Mixed-Reality System for Collaborative Learning at School.",
                    "Modeling Pen Steering Performance in a Single Constant-width Curved Path.",
                    "ShearSheet: Low-Cost Shear Force Input with Elastic Feedback for Augmenting Touch Interaction.",
                    "Eliciting Pen-Holding Postures for General Input with Suitability for EMG Armband Detection.",
                    "EyeDescribe: Combining Eye Gaze and Speech to Automatically Create Accessible Touch Screen Artwork.",
                    "SonicSpray: A Technique to Reconfigure Permeable Mid-Air Displays.",
                    "Hopping-Pong: Changing Trajectory of Moving Object Using Computational Ultrasound Force.",
                    "On Gesture Combination: An Exploration of a Solution to Augment Gesture Interaction.",
                    "EchoTube: Robust Touch Sensing along Flexible Tubes using Waveguided Ultrasound.",
                    "Towards More Practical Spacing for Smartphone Touch GUI Objects Accompanied by Distractors.",
                    "Finding the Sweet Spot: Analyzing Unrestricted Touchscreen Interaction In-the-Wild.",
                    "Comparing Lassoing Criteria and Modeling Straight-line and One-loop Lassoing Motions Considering Criteria.",
                    "Awareness, Usage and Discovery of Swipe-revealed Hidden Widgets in iOS.",
                    "Learning to Drag: The Effects of Social Interactions in Touch Gestures Learnability for Older Adults.",
                    "Situated Sketching and Enactment for Pervasive Displays.",
                    "Feel the Water: Expressing Physicality of District Heating Processes in Functional Overview Displays.",
                    "Visual Link Routing in Immersive Visualisations.",
                    "Inking Your Insights: Investigating Digital Externalization Behaviors During Data Analysis.",
                    "BEXHI: A Mechanical Structure for Prototyping Bendable and EXpandable Handheld Interfaces.",
                    "Digital Assistance for Quality Assurance: Augmenting Workspaces Using Deep Learning for Tracking Near-Symmetrical Objects.",
                    "Tailored Controls: Creating Personalized Tangible User Interfaces from Paper.",
                    "SpaceState: Ad-Hoc Definition and Recognition of Hierarchical Room States for Smart Environments.",
                    "Autotator: Semi-Automatic Approach for Accelerating the Chart Image Annotation Process.",
                    "A Web-Based Remote Assistance System with Gravity-Aware 3D Hand Gesture Visualization.",
                    "Data-driven Texture Modeling and Rendering on Electrovibration Display.",
                    "In-Place Ink Text Editor: A Notepad-like Simple Text Editor with Direct Writing.",
                    "EPES: Seizure Propagation Analysis in an Immersive Environment.",
                    "FIESTA: A Free Roaming Collaborative Immersive Analytics System.",
                    "Towers of Saliency: A Reinforcement Learning Visualization Using Immersive Environments.",
                    "JoyHolder: Tangible Back-of-Device Mobile Interactions.",
                    "Compatible 2D Table Navigation System for Visually Impaired Users.",
                    "MirrorPad: A Touchpad for Direct Pen Interaction on a Laptop.",
                    "ISAR: An Authoring System for Interactive Tabletops.",
                    "HandPoseMenu: Hand Posture-Based Virtual Menus for Changing Interaction Mode in 3D Space.",
                    "Interactive Exhibition from Wall Panels in a Museum.",
                    "Lessons Learned from an Auditory-vibrotactile Sensory Experience in the Museum.",
                    "Haptic-Payment: Stimulating 'Pain' of Payment through Vibration Feedback in Mobile Devices.",
                    "Though Miles Apart: Soft Tangible Interface that Evokes Nostalgic Memories.",
                    "Toward Long Distance Tabletop Hand-Document Telepresence.",
                    "A Comparative Study of Hand Gesture Recognition Devices in the Context of Game Design.",
                    "A Taxonomy for Selecting Wearable Input Devices for Mixed Reality.",
                    "Tabletop AR with HMD and Tablet: A Comparative Study for 3D Selection.",
                    "RARE Shop: Real & Augmented Retail Bookshop Experience using Projection Mapping.",
                    "Surface Haptics.",
                    "Walk-in-Place Navigation in VR.",
                    "Introduction to IATK: An Immersive Visual Analytics toolkit."
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "ISS 2018",
        "info": "Tokyo, Japan",
        "venues": [
            {
                "sub_name_abbr": "conf/tabletop/2018",
                "sub_name": "Proceedings of the 2018 ACM International Conference on Interactive Surfaces and Spaces, ISS 2018, Tokyo, Japan, November 25-28, 2018.",
                "count": 68,
                "papers": [
                    "The City Is My Homescreen.",
                    "City and Architecture as Media.",
                    "Welcome OnBoard: An Interactive Large Surface Designed for Teamwork and Flexibility in Surgical Flow Management.",
                    "Increasing Passersby Engagement with Public Large Interactive Displays: A Study of Proxemics and Conation.",
                    "Sage River Disaster Information (SageRDI): Demonstrating Application Data Sharing In SAGE2.",
                    "Post-meeting Curation of Whiteboard Content Captured with Mobile Devices.",
                    "Browsing Group First-Person Videos with 3D Visualization.",
                    "EagleView: A Video Analysis Tool for Visualising and Querying Spatial Interactions of People and Devices.",
                    "Velt: A Framework for Multi RGB-D Camera Systems.",
                    "Hands-Free Remote Collaboration Over Video: Exploring Viewer and Streamer Reactions.",
                    "Replicating User-defined Gestures for Text Editing.",
                    "How Memorizing Positions or Directions Affects Gesture Learning?",
                    "How to Hold Your Phone When Tapping: A Comparative Study of Performance, Precision, and Errors.",
                    "Risk Effects of Surrounding Distractors Imposing Time Penalty in Touch-Pointing Tasks.",
                    "Optimal-T9: An Optimized T9-like Keyboard for Small Touchscreen Devices.",
                    "DiaQwerty: QWERTY Variants to Better Utilize the Screen Area of a Round or Square Smartwatch.",
                    "Design and Evaluation of Semi-Transparent Keyboards on a Touchscreen Tablet.",
                    "A Small Virtual Keyboard is Better for Intermittent Text Entry on a Pen-Equipped Tablet.",
                    "FingerInput: Capturing Expressive Single-Hand Thumb-to-Finger Microgestures.",
                    "On the Effects of a Nomadic Multisensory Solution for Children's Playful Learning.",
                    "The Haptic Video Player: Using Mobile Robots to Create Tangible Video Annotations.",
                    "AdapTable: Extending Reach over Large Tabletops through Flexible Multi-Display Configuration.",
                    "Scoopirit: A Method of Scooping Mid-Air Images on Water Surface.",
                    "Fade-in Pixel: A Selective and Gradual Real-World Pixelization Filter.",
                    "Sand to Water: Manipulation of Liquidness Perception with Fluidized Sand and Spatial Augmented Reality.",
                    "LeviCursor: Dexterous Interaction with a Levitating Object.",
                    "MlioLight: Projector-camera Based Multi-layered Image Overlay System for Multiple Flashlights Interaction.",
                    "ColourAIze: AI-Driven Colourisation of Paper Drawings with Interactive Projection System.",
                    "Floor-Projected Guidance Cues for Collaborative Exploration of Spatial Augmented Reality Setups.",
                    "Awareness Techniques to Aid Transitions between Personal and Shared Workspaces in Multi-Display Environments.",
                    "A Study of Material Sonification in Touchscreen Devices.",
                    "A Tabletop System Using an OmniDirectional Projector-Camera.",
                    "Aligned Functional Paste: Enhancing Handwriting with Retrieval Results on a Large Surface.",
                    "An Encounter Type VR System Aimed at Exhibiting Wall Material Samples for Show House.",
                    "Body-Prop Interaction: Augmented Open Discs and Egocentric Body-Based Interaction for Exploring Immersive Visualizations.",
                    "Cross-Ratio Based Gaze Estimation using Polarization Camera System.",
                    "CrosSI: A Novel Workspace with Connected Horizontal and Vertical Interactive Surfaces.",
                    "Define, Refine, and Identify Events in a Bendable Interface.",
                    "Designing for Ambient UX: Case Study of a Dynamic Lighting System for a Work Space.",
                    "Here's looking at you: A Spherical FTVR Display for Realistic Eye-Contact.",
                    "Practice System for Controlling Cutting Pressure for Paper-cutting.",
                    "Recognizing Gestures on Projected Button Widgets with an RGB-D Camera Using a CNN.",
                    "Simplicity is Not Always Best: Image Preferences in Patients with Mild Cognitive Impairment.",
                    "SmartSurveys: Does Context Influence Whether We'll Share Healthcare Experience Data with our Smartphone?",
                    "Traditionally Crafted Digital Interfaces.",
                    "An Integral Illumination Device Using Heat-Resistant Hybrid Optics.",
                    "AURA: Urban Personal Projection to Initiate the Communication.",
                    "Crafting Textiles of the Digital Era.",
                    "Dynamic, Flexible and Multi-dimensional Visualization of Digital Photos and their Metadata.",
                    "FlexFace: A Head Gesture Motion Display with Flexible Screen for Telecommunication.",
                    "Handheld Haptic Interface for Rendering Size, Shape, and Stiffness of Virtual Objects.",
                    "JackIn Neck: A Neckband Wearable Telepresence System Designed for High Comfortability.",
                    "MagicPAPER: Tabletop Interactive Projection Device Based on Kraft Paper.",
                    "NiwViw: Immersive Analytics Authoring Tool.",
                    "OmniEyeball: An Interactive I/O Device For 360-Degree Video Communication.",
                    "Printable Hydroponics: Digital Fabrication of Ecological Systems.",
                    "Proposal of a Method of Directing by Pseudo-hologram Using Motion Body and Body Information.",
                    "Real Time Animation of 3D Models with Finger Plays and Hand Shadow.",
                    "Real-time Visual Feedback for Golf Training Using Virtual Shadow.",
                    "Real-Virtual Bridge: Operating Real Smartphones from the Virtual World.",
                    "Scalable Autostereoscopic Display for Interaction with Floating Images.",
                    "SNS Door Phone as Robotic Process Automation.",
                    "SoundPond: Making Sound Visible and Intuitively Manipulable.",
                    "Touchable Wall: Easy-to-Install Touch-Operated Large-Screen Projection System.",
                    "Ultrasound from Cyber Map: Intuitive Guidance Method using Binaural Parametric Loudspeaker.",
                    "Generating Spherical Hyperlapse Videos via Recursive Intelligent Sampling for StratoJump.",
                    "Computational Augmented Reality Displays.",
                    "Approaching Aesthetics on User Interface and Interaction Design."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "ISS 2017",
        "info": "Brighton, UK",
        "venues": [
            {
                "sub_name_abbr": "conf/tabletop/2017",
                "sub_name": "Proceedings of the Interactive Surfaces and Spaces, ISS 2017, Brighton, United Kingdom, October 17 - 20, 2017.",
                "count": 73,
                "papers": [
                    "Taking Haptic Design from Research to Practice.",
                    "Understanding Interactive Surfaces and Spaces in Everyday Life.",
                    "Hand Contact Shape Recognition for Posture-Based Tabletop Widgets and Interaction.",
                    "CircGR: Interactive Multi-Touch Gesture Recognition using Circular Measurements.",
                    "Mirror, Mirror on the Wall: Attracting Passers-by to Public Touch Displays With User Representations.",
                    "Gesture Elicitation Study on How to Opt-in & Opt-out from Interactions with Public Displays.",
                    "Measuring Readiness-to-Hand through Differences in Attention to the Task vs. Attention to the Tool.",
                    "Summon and Select: Rapid Interaction with Interface Controls in Mid-air.",
                    "Investigating the Use of Spatial Interaction for 3D Data Visualization on Mobile Devices.",
                    "Superiority of a Handheld Perspective-Coupled Display in Isomorphic Docking Performances.",
                    "Robotic Assembly of Haptic Proxy Objects for Tangible Interaction and Virtual Reality.",
                    "Desktop VR using a Mirror Metaphor for Natural User Interface.",
                    "Fast Lossless Depth Image Compression.",
                    "MeetAlive: Room-Scale Omni-Directional Display System for Multi-User Content and Control Sharing.",
                    "Using Variable Movement Resistance Sliders for Remote Discrete Input.",
                    "Sunny Day Display: Mid-air Image Formed by Solar Light.",
                    "ThermoTouch: a New Scalable Hardware Design for Thermal Displays.",
                    "Programmable Liquid Matter: 2D Shape Deformation of Highly Conductive Liquid Metals in a Dynamic Electric Field.",
                    "Interactive FUrniTURE: Evaluation of Smart Interactive Textile Interfaces for Home Environments.",
                    "TastyFloats: A Contactless Food Delivery System.",
                    "OSpace: Towards a Systematic Exploration of Olfactory Interaction Spaces.",
                    "RapTapBath: User Interface System by Tapping on a Bathtub Edge Utilizing Embedded Acoustic Sensors.",
                    "Creepy Tracker Toolkit for Context-aware Interfaces.",
                    "Typing on a Smartwatch for Smart Glasses.",
                    "Designing Touch Gestures Using the Space around the Smartwatch as Continuous Input Space.",
                    "Estimating the Finger Orientation on Capacitive Touchscreens Using Convolutional Neural Networks.",
                    "PredicTouch: A System to Reduce Touchscreen Latency using Neural Networks and Inertial Measurement Units.",
                    "Effects of Bend Gesture Training on Learnability and Memorability in a Mobile Game.",
                    "Release, Don't Wait!: Reliable Force Input Confirmation with Quick Release.",
                    "In the Footsteps of Henri Tudor: Creating Batteries on a Tangible Interactive Workbench.",
                    "FireFlies2: Interactive Tangible Pixels to enable Distributed Cognition in Classroom Technologies.",
                    "ClimbVis: Investigating In-situ Visualizations for Understanding Climbing Movements by Demonstration.",
                    "Run&Tap: Investigation of On-Body Tapping for Runners.",
                    "Towards Around-Device Interaction using Corneal Imaging.",
                    "A Comparative Study of Menus in Virtual Reality Environments.",
                    "A Tangible Interactive Space Odyssey to Support Children Learning of Computer Programming.",
                    "Bringing Your Own Device into Multi-device Ecologies: A Technical Concept.",
                    "Computational Foresight: Forecasting Human Body Motion in Real-time for Reducing Delays in Interactive System.",
                    "Effects of the Display Angle and Physical Size on Large Touch Displays in the Work Place.",
                    "Evaluation of Flick Gestures on Multitouch Tabletop Surfaces.",
                    "Gesture Typing on Virtual Tabletop: Effect of Input Dimensions on Performance.",
                    "HoloFacility: Get in Touch with Machines at Trade Fairs using Holograms.",
                    "Improving the Feasibility of Ultrasonic Hand Tracking Wearables.",
                    "Investigating Communication Grounding in Cross-Surface Interaction.",
                    "Learner versus System Control in Augmented Lab Experiments.",
                    "Objective Meaning: Presentation Mediation in an Interactive Installation.",
                    "ProDesk: An Interactive Ubiquitous Desktop Surface.",
                    "PULSE: Sonifying Data to Motivate Physical Activity in Outdoor Spaces.",
                    "TiltPass: Using Device Tilts as an Authentication Method.",
                    "Towards a Mixed-Reality Interface for Mind-Mapping.",
                    "Towards Touch-Based Medical Image Diagnosis Annotation.",
                    "What Are We Missing?: Adding Eye-Tracking to the HoloLens to Improve Gaze Estimation Accuracy.",
                    "Adaptive Workspace using MovemenTable.",
                    "Ambient Notifications with Shape Changing Circuits in Peripheral Locations.",
                    "CAPP: Capacitive Passive Programmable Tangibles.",
                    "Distant Pointing User Interfaces based on 3D Hand Pointing Recognition.",
                    "Floating Widgets: Interaction with Acoustically-Levitated Widgets.",
                    "FootStriker: A Wearable EMS-based Foot Strike Assistant for Running.",
                    "GooseBumps: Towards Sensory Substitution Using Servo Motors.",
                    "Haptics and Directional Audio Using Acoustic Metasurfaces.",
                    "Illuminated Interactive Paper with Multiple Input Modalities for Form Filling Applications.",
                    "iVoLVER: A Visual Language for Constructing Visualizations from In-the-Wild Data.",
                    "LeviSpace: Augmenting the Space above Displays with Levitated Particles.",
                    "Paper for E-Paper: Towards Paper Like Tangible Experience using E-Paper.",
                    "Printerface: Screen Printed Electroluminescent Touch Interface.",
                    "Programmable Liquid Matter: 2D Shape Drawing of Liquid Metals by Dynamic Electric Field.",
                    "Proposal of Product Navigation Interface and Evaluation of Purchasing Motivation.",
                    "SensArt Demo: A Multisensory Prototype for Engaging with Visual Art.",
                    "Smart Home Control using Motion Matching and Smart Watches.",
                    "Multisensory Experiences & Spaces.",
                    "Personalized Interactive Surfaces with Printed Electronics.",
                    "Analyzing Qualitative Data.",
                    "The Disappearing Tabletop: Social and Technical Challenges for Cross-Surface Collaboration."
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "ISS 2016",
        "info": "Niagara Falls, ON, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/tabletop/2016",
                "sub_name": "Proceedings of the 2016 ACM on Interactive Surfaces and Spaces, ISS 2016, Niagara Falls, ON, Canada, November 6-9, 2016.",
                "count": 80,
                "papers": [
                    "Movement, Material, Mind: Tangible and Embodied Interactions for Discovery and Learning.",
                    "An Artist's Perspective on Interactive Surfaces and Spaces.",
                    "Less Is More: Efficient Back-of-Device Tap Input Detection Using Built-in Smartphone Sensors.",
                    "TapSkin: Recognizing On-Skin Input for Smartwatches.",
                    "RootCap: Touch Detection on Multi-electrodes using Single-line Connected Capacitive Sensing.",
                    "Ballumiere: Real-Time Tracking and Spherical Projection for High-Speed Moving Balls.",
                    "AnyLight: Programmable Ambient Illumination via Computational Light Fields.",
                    "Ketsuro-Graffiti: An Interactive Display with Water Condensation.",
                    "EV-Pen: Leveraging Electrovibration Haptic Feedback in Pen Interaction.",
                    "In-Place-Ink: Toward More Direct Handwriting Interfaces.",
                    "ShadowHands: High-Fidelity Remote Hand Gesture Visualization using a Hand Tracker.",
                    "DIRECT: Making Touch Tracking on Ordinary Surfaces Practical with Hybrid Depth-Infrared Sensing.",
                    "Are Kindergarten Children Ready for Indirect Drag Interactions?",
                    "Effect of Touch Latency on Elementary vs. Bimanual Composite Tasks.",
                    "UD Co-Spaces: A Table-Centred Multi-Display Environment for Public Engagement in Urban Design Charrettes.",
                    "Towards Road Traffic Management with Forecasting on Wall Displays.",
                    "Active Pathways: Using Active Tangibles and Interactive Tabletops for Collaborative Modeling in Systems Biology.",
                    "MultiLens: Fluent Interaction with Multi-Functional Multi-Touch Lenses for Information Visualization.",
                    "Expanding Selection for Information Visualization Systems on Tablet Devices.",
                    "CurationSpace: Cross-Device Content Curation Using Instrumental Interaction.",
                    "CapCam: Enabling Rapid, Ad-Hoc, Position-Tracked Interactions Between Devices.",
                    "UI Testing Cross-Device Applications.",
                    "LayerFish: Bimanual Layering with a Fisheye In-Place.",
                    "Talaria: Continuous Drag & Drop on a Wall Display.",
                    "Rapid Command Selection on Multi-Touch Tablets with Single-Handed HandMark Menus.",
                    "GlassHands: Interaction Around Unmodified Mobile Devices Using Sunglasses.",
                    "Differentiating in-Game Frustration from at-Game Frustration using Touch Pressure.",
                    "Miners: Communication and Awareness in Collaborative Gaming at an Interactive Display Wall.",
                    "The Effect of Visual Distractors in Peripheral Vision on User Performance in Large Display Wall Systems.",
                    "Multimodal Segmentation on a Large Interactive Tabletop: Extending Interaction on Horizontal Surfaces with Gaze.",
                    "Physical-Digital Privacy Interfaces for Mixed Reality Collaboration: An Exploratory Study.",
                    "ControllAR: Appropriation of Visual Feedback on Control Surfaces.",
                    "A Dynamic 3D Performance Space for Control of Virtual Musical Instruments.",
                    "Shared Interactive Music Experiences in Public Spaces: User Engagement and Motivations.",
                    "Felines, Foragers, and Physicists: Supporting Scientific Outreach with Multi-Surface and Multi-Space Games.",
                    "Lightweight Capacitance-based Block System for 3D Space Interaction.",
                    "A Distributed Framework for Location-oriented Motion-based Interactive Public Installations and Games.",
                    "Presenting Business Data: Challenges during Board Meetings in Multi-Display Environments.",
                    "Combining Mobile, Tangible and Virtual World Platforms to Support Participatory Campus Planning.",
                    "Pose Estimation for a Cuboid with Regular Patterns in an Interactive Assembly-support Projection System.",
                    "Touch Detection System for Various Surfaces Using Shadow of Finger.",
                    "SUR40 Linux: Reanimating an Obsolete Tangible Interaction Platform.",
                    "Exploring Time-dependent Scientific Data Using Spatially Aware Mobiles and Large Displays.",
                    "Synchronized Mixed Presence Data-Conferencing Using Large-Scale Shared Displays.",
                    "Sports Support System: Augmented Ball Game for Filling Gap between Player Skill Levels.",
                    "Foldable3D: Interacting with 3D Content Using Dual-Display Devices.",
                    "Twosome Coloring: Designing a Playful Coloring System on Dual-sided Transparent Surfaces.",
                    "Finding the Minimum Perceivable Size of a Tactile Element on an Ultrasonic Based Haptic Tablet.",
                    "Accessing Mobile Apps with User Defined Gesture Shortcuts: An Exploratory Study.",
                    "Fun-f! Game-furniture Experimenting Interactive Surfaces for Children's Sensory Learning.",
                    "HABITAT EXPLORER: Designing Educational Games for Collaborative Learning on Interactive Surfaces.",
                    "Exploring Interactive Surface Designs for Eliciting Social Activity from Elderly Adults.",
                    "Learning New Words and Spelling with Autocorrections.",
                    "WebTEM: A Web Application to Record Text Entry Metrics.",
                    "Interactive Multi-Modal Display Spaces for Visual Analysis.",
                    "The Use of a Multi-Display System in University Classroom Lectures.",
                    "Grab This, Swipe That: Combining Tangible and Gestural Interaction in Multiple Display Collaborative Gameplay.",
                    "Carbon Copy Metaphor: Mode Switching Technique for Trackpad-based Manipulations.",
                    "Quantum Cats: The Demo.",
                    "CHI PLAYGUE: A Mobile Conference Networking Game.",
                    "Single-Handed HandMark Menus: Rapid Command Selection on Tablets.",
                    "Instruction for Paper-cutting: A System for Learning Experts' Skills.",
                    "Exploring Genetic Mutations on Mitochondrial DNA Cancer Data with Interactive Tabletop and Active Tangibles.",
                    "ControllAR: Appropriation of Visual Feedback on Control Surfaces.",
                    "Actibles: Open Source Active Tangibles.",
                    "Proxemics-Based Visual Concepts to Attract and Engage Public Display Users: Adaptive Content Motion and Adaptive User Shadow.",
                    "A Dynamic 3D Performance Space for Control of Virtual Musical Instruments.",
                    "BacPack for New Frontiers: A Tangible Tabletop Museum Exhibit Exploring Synthetic Biology.",
                    "A Toolkit for Building Collaborative Immersive Multi-Surface Applications.",
                    "ERWear: Wearable System Design through the Lens of First Responders.",
                    "Tunnel Divisions: Interactive Sound Mapping of Transitory Public Spaces.",
                    "ABOVE WATER: Extending the Play Space for Health.",
                    "A Demonstration of Haptic Retargeting: Dynamic Repurposing of Passive Haptics for Enhanced Virtual Reality Experiences.",
                    "Collaboration Meets Interactive Surfaces and Spaces (CMIS): Walls, Tables, Mobiles, and Wearables.",
                    "Cross-Surface: Challenges and Opportunities of Spatial and Proxemic Interaction.",
                    "Cross-Device Interfaces: Existing Research, Current Tools, Outlook.",
                    "Projected Augmented Reality with the RoomAlive Toolkit.",
                    "Let's Talk Architecture: An Introduction to Glass Buildings.",
                    "SIVARG: Spatial Interaction in Virtual/Augmented Reality and Games.",
                    "Immersive Analytics: Exploring Future Interaction and Visualization Technologies for Data Analytics."
                ]
            },
            {
                "sub_name_abbr": "conf/tabletop/2016c",
                "sub_name": "Proceedings of the 2016 ACM Companion on Interactive Surfaces and Spaces, ISS Companion '16, Niagara Falls, Ontario, Canada, November 6-9, 2016.",
                "count": 17,
                "papers": [
                    "Effects of Workspace Awareness and Territoriality in Environments with Large, Shared Displays.",
                    "ParaXplore Interfaces: Parametric Interfaces for Parallel Exploration in Design.",
                    "Use of Landmarks to Design Large and Efficient Command Interfaces.",
                    "Designing and Developing Technologies to Facilitate Clinician-Patient Communication.",
                    "Immersive solutions for future Air Traffic Control and Management.",
                    "Visual Immersion in the Context of Wall Displays.",
                    "Redefining a Contribution for Immersive Visualization Research.",
                    "On Spatial Perception Issues In Augmented Reality Based Immersive Analytics.",
                    "Gesture-driven Interactions on a Virtual Hologram in Mixed Reality.",
                    "Improving 3D Visualizations: Exploring Spatial Interaction with Mobile Devices.",
                    "Immersive Analysis of Health-Related Data with Mixed Reality Interfaces: Potentials and Open Question.",
                    "Gaze-directed Immersive Visualization of Scientific Ensembles.",
                    "Personalized Views for Immersive Analytics.",
                    "Slicing the Aurora: An Immersive Proxemics-Aware Visualization.",
                    "Immersive Analytics for Multi-objective Dynamic Integrated Climate-Economy (DICE) Models.",
                    "Immersive Analytics for Medicine: Hybrid 2D/3D Sketch-Based Interfaces for Annotating Medical Data and Designing Medical Devices.",
                    "A Taxonomy for Designing Walking-based Locomotion Techniques for Virtual Reality."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "ITS 2015",
        "info": "Funchal, Madeira, Portugal",
        "venues": [
            {
                "sub_name_abbr": "conf/tabletop/2015",
                "sub_name": "Proceedings of the 2015 International Conference on Interactive Tabletops & Surfaces, ITS 2015, Funchal, Portugal, November 15-18, 2015.",
                "count": 83,
                "papers": [
                    "In Touch with the Future.",
                    "From Surface to Space.",
                    "The Influence of Multi-Touch Interaction on Procedural Training.",
                    "Training of Cognitive Performance in Complex Tasks with a Tabletop-Based Rehabilitation System.",
                    "Blind People Interacting with Large Touch Surfaces: Strategies for One-handed and Two-handed Exploration.",
                    "Knobology Revisited: A Comparison of User Performance between Tangible and Virtual Rotary Knobs.",
                    "3D Tabletop User Interface with High Synchronization Accuracy using a High-speed Stereo Camera.",
                    "Quantifying the Targeting Performance Benefit of Electrostatic Haptic Feedback on Touchscreens.",
                    "Estimating 3D Finger Angle on Commodity Touchscreens.",
                    "One-Touch Pose Detection on Touchscreen Smartphones.",
                    "Dynamir: Optical Manipulations Using Dynamic Mirror Brushes.",
                    "CapAuth: Identifying and Differentiating User Handprints on Commodity Capacitive Touchscreens.",
                    "TalkingTiles: Supporting Personalization and Customization in an AAC App for Individuals with Aphasia.",
                    "\"Callout Bubble Saved My Life\": Workspace Awareness Support in BYOD Classrooms.",
                    "Smart Makerspace: An Immersive Instructional Space for Physical Tasks.",
                    "Studying Attraction Power in Proxemics-Based Visual Concepts for Large Public Interactive Displays.",
                    "What People Really Remember: Understanding Cognitive Effects When Interacting with Large Displays.",
                    "Understanding Researchers' Use of a Large, High-Resolution Display Across Disciplines.",
                    "BodyLenses: Embodied Magic Lenses and Personal Territories for Wall Displays.",
                    "BricoSketch: Mixing Paper and Computer Drawing Tools in Professional Illustration.",
                    "Ghost Touch: Turning Surfaces into Interactive Tangible Canvases with Focused Ultrasound.",
                    "Eyes-Free Touch Command Support for Pen-Based Digital Whiteboards via Handheld Devices.",
                    "Gesture Bike: Examining Projection Surfaces and Turn Signal Systems for Urban Cycling.",
                    "The dBoard: A Digital Scrum Board for Distributed Software Development.",
                    "SoD-Toolkit: A Toolkit for Interactively Prototyping and Developing Multi-Sensor, Multi-Device Environments.",
                    "Coordinating Collaborative Interactions in Web-based Mobile Applications.",
                    "Pins 'n' Touches: An Interface for Tagging and Editing Complex Groups.",
                    "Personal Device as a Controller for Interactive Surfaces: Usability and Utility of Different Connection Methods.",
                    "Reducing Latency with a Continuous Prediction: Effects on Users' Performance in Direct-Touch Target Acquisitions.",
                    "A Predictive Approach for an End-to-End Touch-Latency Measurement.",
                    "A Public Ideation of Shape-Changing Applications.",
                    "ART-Chess: A Tangible Augmented Reality Chess on Tabletop.",
                    "Augmenting Remote Presence For Interactive Dashboard Collaborations.",
                    "Walls Have Ears: Using Conductive Surfaces of Furniture and Everyday Objects for Room-Wide Power Usage and Crowd Activity Sensing.",
                    "MoBat: Sound-Based Localization of Multiple Mobile Devices on Everyday Surfaces.",
                    "Connected Paper, EKKO and Analytic Futures: News and Paper Data.",
                    "Collaborative Position Patterns for Pairs Working with Shared Tiled-Wall Display using Mobile Devices.",
                    "pART bench: A Hybrid Search Tool for Floor Plans in Architecture.",
                    "Hi-AppV: Viewing Tabletop Application Windows on Mobile Devices.",
                    "Capture The Flag: Engaging In A Multi-Device Augmented Reality Game.",
                    "Tabletop-Supported Rehabilitation with fun.tast.tisch.: Lessons Learned.",
                    "PhySig: Incorporating Physical Products with Digital Signage in Shopping Environments.",
                    "Studying User-Defined Gestures Toward Off the Screen Interactions.",
                    "A See-Through Display for Interactive Museum Showcases.",
                    "Police Analyst Workstation: Towards a Multi-Surface User Interface.",
                    "STRIPE: Fluid and Zoomable Lean-back Interface for Navigating Content Landscape on a Large Screen.",
                    "Tangible Holographic 3D Objects with Virtual Touch.",
                    "A Tabletop System to Promote Argumentation in Computer Science Students.",
                    "ViZCom: Viewing, Zooming and Commenting through Mobile Devices.",
                    "Investigating the Potential of a Two-finger Chord Button in Multi-touch Applications.",
                    "Multi-user Multi-device Interaction with Large Displays at the Point of Sale: An Application Case.",
                    "Towards a Fluid Interaction Concept Bringing Star Plots to Interactive Displays.",
                    "Interaction Space of Chords on a Vertical Multi-touch Screen.",
                    "aWall: A Socio-Cognitive Tool for Agile Team Collaboration using Large Multi-Touch Wall Systems.",
                    "Hi Robot: Evaluating RoboTale.",
                    "Marker-free Object Recognition on Tabletops: An Exploratory Study.",
                    "Towards Collaborative Modelling of Business Processes on Large Interactive Touch Display Walls.",
                    "A TUI Platform for your Desktop.",
                    "PERCs Demo: Persistently Trackable Tangibles on Capacitive Multi-Touch Displays.",
                    "Capture The Flag Demo: Engaging In A Multi-Device Augmented Reality Game.",
                    "EnchanTable: Displaying a Vertically Standing Mid-air Image on a Table Surface using Reflection.",
                    "Fall of Humans: Interactive Tabletop Games and Transmedia Storytelling.",
                    "aWall: A Socio-Cognitive Tool for Agile Team Collaboration using Large Multi-Touch Wall Systems.",
                    "MAPS: A Multi-Dimensional Password Scheme for Mobile Authentication.",
                    "Airsteroids: Re-designing the Arcade Game Using MarkAirs.",
                    "DreamScope Catcher: A Touch Sensitive Interface to Catch Dreams.",
                    "BlackBlocks: Tangible Interactive System for Children to Learn 3-Letter Words and Basic Math.",
                    "The MiTable Multi-Touch Gestures Engine.",
                    "Making Fashion More Trendy through Touchless Interactive Displays Integrated with Mobile Devices.",
                    "Usability Guidelines for Co-Located Multi-User Interaction on Wall Displays.",
                    "Designing Ad-Hoc Cross Device Collaborations For Small Groups.",
                    "Toward Motor: Intuitive Interaction Primitives for Touchless Interfaces.",
                    "Interactive Spaces: Models and Algorithms for Reality-based Music Applications.",
                    "Collaborative Learning In An Artifact Ecology: A Distributed Cognition Perception.",
                    "Supporting the Meeting Journey: Understanding and Designing Collaborative Device Ecologies.",
                    "Supporting Interactive Graph Analysis Using Adjustable Magic Lenses.",
                    "Architecting Collaborative Learning Places.",
                    "Collaboration Meets Interactive Surfaces (CMIS): Walls, Tables, Mobiles, and Wearables.",
                    "Cross-Surface: Workshop on Interacting with Multi-Device Ecologies in the Wild.",
                    "ITS Workshop DEXIS 2015: Visual Data Exploration on Interactive Surfaces.",
                    "MULTIsensory Interaction and Assistive Technology: Feasibility and Effectiveness (MULTI-AT).",
                    "Shared Infrastructures for Tangible Tabletops & Interactive Surfaces.",
                    "Interaction Techniques for Wall-Sized Screens."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "ITS 2014",
        "info": "Dresden, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/tabletop/2014",
                "sub_name": "Proceedings of the Ninth ACM International Conference on Interactive Tabletops and Surfaces, ITS 2014, Dresden, Germany, November 16 - 19, 2014.",
                "count": 76,
                "papers": [
                    "A New You: From Augmented Reality to Augmented Human.",
                    "Sensitive Skins in Media Art and Design.",
                    "Exploring Narrative Gestures on Digital Surfaces.",
                    "Web on the Wall Reloaded: Implementation, Replication and Refinement of User-Defined Interaction Sets.",
                    "User-defined Interface Gestures: Dataset and Analysis.",
                    "A Survey on Multi-touch Gesture Recognition and Multi-touch Frameworks.",
                    "HuddleLamp: Spatially-Aware Mobile Displays for Ad-hoc Around-the-Table Collaboration.",
                    "Uminari: Freeform Interactive Loudspeakers.",
                    "Multi-push Display using 6-axis Motion Platform.",
                    "Multi Surface Interactions with Geospatial Data: A Systematic Review.",
                    "The Effect of View Techniques on Collaboration and Awareness in Tabletop Map-Based Tasks.",
                    "Spatial Querying of Geographical Data with Pen-Input Scopes.",
                    "Surface Ghosts: Promoting Awareness of Transferred Objects during Pick-and-Drop Transfer in Multi-Surface Environments.",
                    "PolyChrome: A Cross-Device Framework for Collaborative Web Visualization.",
                    "ActivitySpace: Managing Device Ecologies in an Activity-Centric Configuration Space.",
                    "SleeD: Using a Sleeve Display to Interact with Touch-sensitive Display Walls.",
                    "Structure Editing of Handwritten Mathematics: Improving the Computer Support for the Calculational Method.",
                    "P.I.A.N.O.: Faster Piano Learning with Interactive Projection.",
                    "Exploring Visual Cues for Intuitive Communicability of Touch Gestures to Pre-kindergarten Children.",
                    "Improving Pre-Kindergarten Touch Performance.",
                    "DT-DT: Top-down Human Activity Analysis for Interactive Surface Applications.",
                    "NetBoards: Investigating a Collection of Personal Noticeboard Displays in the Workplace.",
                    "Supporting Situation Awareness in Collaborative Tabletop Systems with Automation.",
                    "An Empirical Characterization of Touch-Gesture Input-Force on Mobile Devices.",
                    "Characterising the Physicality of Everyday Buttons.",
                    "Towards Habitable Bits: Digitizing the Built Environment.",
                    "ePlan Multi-Surface: A Multi-Surface Environment for Emergency Response Planning Exercises.",
                    "Designing a Remote Video Collaboration System for Industrial Settings.",
                    "The Usability of a Tabletop Application for Neuro-Rehabilitation from Therapists' Point of View.",
                    "HyPR Device: Mobile Support for Hybrid Patient Records.",
                    "ACTO: A Modular Actuated Tangible User Interface Object.",
                    "BullsEye: High-Precision Fiducial Tracking for Table-based Tangible Interaction.",
                    "An Interaction Model for Grasp-Aware Tangibles on Interactive Surfaces.",
                    "3D Tabletop User Interface Using Virtual Elastic Objects.",
                    "Cyber Chamber: Multi-user Collaborative Assistance System for Online Shopping.",
                    "Corona: Haptic Sensation Using Body-Carried Electrostatic Charge for Body Area Network Feedback Companion.",
                    "Evaluation of Visuo-haptic Feedback in a 3D Touch Panel Interface.",
                    "UbiBeam: An Interactive Projector-Camera System for Domestic Deployment.",
                    "Task Assignment and Visualization on Tabletops and Smartphones.",
                    "X-O Arch Menu: Combining Precise Positioning with Efficient Menu Selection on Touch Devices.",
                    "Second Look: Combining Interactive Surfaces with Wearable Computing to support Creative Writing.",
                    "Making Tabletop Interaction Accessible for Blind Users.",
                    "Intelligent Ink Annotation Framework that uses User's Intention in Electronic Document Annotation.",
                    "Studying Teacher Cognitive Load in Multi-tabletop Classrooms Using Mobile Eye-tracking.",
                    "Combining Timeline and Graph Visualization.",
                    "Single Locus of Control in a Tangible Paper-based Tabletop Application: An Exploratory Study.",
                    "Interact! An Evidence-Based Framework For Digitally Supported School Field Trips.",
                    "Using Scalable, Interactive Floor Projection for Production Planning Scenario.",
                    "Interactive Surface Composition Based on Arduino in Multi-Display Environments.",
                    "Overcoming Interaction Barriers in Large Public Displays Using Personal Devices.",
                    "Interactive Tactile Maps for Blind People using Smartphones? Integrated Cameras.",
                    "A Cooperative Multitouch Scrum Task Board for Synchronous Face-to-Face Collaboration.",
                    "Exploring Multi-Surface Interactions in Retail Environments.",
                    "A Multi-Display System for Deploying and Controlling Home Automation.",
                    "ThumbCam: Returning to single touch interactions to explore 3D virtual environments.",
                    "Bancada: Using Mobile Zoomable Lenses for Geospatial Exploration.",
                    "ClothLens Demo: Simultaneous Multi-User Interaction with Shared Content on a Tabletop.",
                    "The Interactive Dining Table, or Pass the Weather Widget, Please.",
                    "CubeQuery: Tangible Interface for Creating and Manipulating Database Queries.",
                    "Fusion of Mixed-Reality Tabletop and Location-Based Applications for Pervasive Games.",
                    "Multi-Touch Manipulation of Magic Lenses for Information Visualization.",
                    "Demonstrating HuddleLamp: Spatially-Aware Mobile Displays for Ad-hoc Around-the-Table Collaboration.",
                    "FlexiWall: Exploring Layered Data with Elastic Displays.",
                    "Demonstration and Applications of Fiberio: A Touchscreen That Senses Fingerprints.",
                    "ComforTable: A Tabletop for Relaxed and Playful Interactions in Museums.",
                    "NEMOSHELL Demo: Windowing System for Concurrent Applications on Multi-user Interactive Surfaces.",
                    "Explicit & Implicit Interaction Design for Multi-Focus Visualizations.",
                    "Towards an Interaction Model for Multi-Surface Personal Computing Spaces.",
                    "Improving Interaction Discoverability in Large Public Interactive Displays.",
                    "Touching the Third Dimension.",
                    "Supporting Everyday Thinking Practices in Information Visualization Interfaces.",
                    "Exploiting Spatial Memory and Navigation Performance in Dynamic Peephole Environments.",
                    "Tactile/Haptic User Interfaces for Tabletops and Tablets.",
                    "Collaboration Meets Interactive Surfaces: Walls, Tables, Tablets, and Phones (CMIS).",
                    "Tutorial: Hot Topics in Personal Fabrication Research.",
                    "TUIO Hackathon."
                ]
            },
            {
                "sub_name_abbr": "conf/tabletop/2014tactt",
                "sub_name": "Proceedings of the International Workshop on Tactile/Haptic User Interfaces for Tabletops and Tablets, held in conjunction with ACM ITS 2014, Dresden, Germany, November 16, 2014.",
                "count": 10,
                "papers": [
                    "Redesigning Input Controls of a Touch-Sensitive Pin-Matrix Device.",
                    "Touch and Tangibles - Interacting with fun.tast.tisch. Results of a Study with Non-Target-Group Users.",
                    "BrailleIO - A Tactile Display Abstraction Framework.",
                    "Collaborative Tactile Graphic Workstation for Touch-Sensitive Pin-Matrix Devices.",
                    "Preparing a Psychological Experiment on a Tactile Display.",
                    "Blind User Requirements to Support Tactile Mobility.",
                    "A Tactile Presentation Method of Mind Maps in Co-located Meetings.",
                    "The Micro Smart Grid Tabletop - A Real World Case Study for Tangible Multitouch Technologies for Communicating Complex Concepts.",
                    "Vibrotactile Exploration of Indoor Objects.",
                    "Study of Static Tactile Detection Threshold via Pneumatically Driven Polydimethylsiloxane Membrane."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "ITS 2013",
        "info": "St Andrews, United Kingdom",
        "venues": [
            {
                "sub_name_abbr": "conf/tabletop/2013",
                "sub_name": "The ACM International Conference on Interactive Tabletops and Surfaces, ITS '13, St Andrews, United Kingdom - October 06 - 09, 2013.",
                "count": 85,
                "papers": [
                    "The cube: a very large-scale interactive engagement space.",
                    "AstroTouch: a multi-touch digital desktop for astrodynamics.",
                    "SkyHunter: a multi-surface environment for supporting oil and gas exploration.",
                    "The effect of egocentric body movements on users' navigation performance and spatial memory in zoomable user interfaces.",
                    "Peripheral array of tangible NFC tags: positioning portals for embodied trans-surface interaction.",
                    "Body Panning: a movement-based navigation technique for large interactive surfaces.",
                    "Pen and touch gestural environment for document editing on interactive tabletops.",
                    "Perceptual grouping: selection assistance for digital sketching.",
                    "Automatic annotation placement for interactive maps.",
                    "Instant user interfaces: repurposing everyday objects as input devices.",
                    "The fun.tast.tisch. project: a novel approach to neuro-rehabilitation using an interactive multiuser multitouch tabletop.",
                    "Comparing physical, overlay, and touch screen parameter controls.",
                    "PUCs: detecting transparent, passive untouched capacitive widgets on unmodified multi-touch displays.",
                    "TempTouch: a novel touch sensor using temperature controllers for surface based textile displays.",
                    "Extending tabletop application design to the classroom.",
                    "Making 3D content accessible for teachers.",
                    "Activity pad: teaching tool combining tangible interaction and affordance of paper.",
                    "OrMiS: a tabletop interface for simulation-based training.",
                    "AquaTop display: interactive water surface for viewing and manipulating information in a bathroom.",
                    "TapTiles: LED-based floor interaction.",
                    "ForceForm: a dynamically deformable interactive surface.",
                    "TransformTable: a self-actuated shape-changing digital table.",
                    "The sound of touch: on-body touch and gesture sensing based on transdermal ultrasound propagation.",
                    "Deconstructing the touch experience.",
                    "Arpège: learning multitouch chord gestures vocabularies.",
                    "Multi-touch pinch gestures: performance and ergonomics.",
                    "PointPose: finger pose estimation for touch input on mobile devices using a depth sensor.",
                    "Towards user-defined multi-touch gestures for 3D objects.",
                    "Two touch system latency estimators: high accuracy and low overhead.",
                    "A case study of object and occlusion management on the eLabBench, a mixed physical/digital tabletop.",
                    "ObjecTop: occlusion awareness of physical objects on interactive tabletops.",
                    "An interactive surface solution to support collaborative work onboard ships.",
                    "Support for collaborative situation analysis and planning in crisis management teams using interactive tabletops.",
                    "Penbook: bringing pen+paper interaction to a tablet device to facilitate paper-based workflows in the hospital domain.",
                    "TouchMover: actuated 3D touchscreen with haptic feedback.",
                    "The SimMed experience: medical education on interactive tabletops.",
                    "Introducing Kupla UI: a generic interactive wall user interface based on physics modeled spherical content widgets.",
                    "Prototype of operator interface for monitoring and controlling in the mobile control room.",
                    "PhoneCog: a device authentication method on interactive tabletops using color sequence pattern recognition.",
                    "The fun.tast.tisch. project: interactive tabletops in neuro-rehabilitation.",
                    "Positioning portals with peripheral NFC tags to embody trans-surface interaction.",
                    "PointPose demo: using a depth camera for finger pose estimation on touch-based mobile devices.",
                    "PUCs demo: detecting transparent, passive untouched capacitive widgets.",
                    "SWINGNAGE: gesture-based mobile interactions on distant public displays.",
                    "Forearm menu: using forearm as menu widget on tabletop system.",
                    "An assistive tabletop keyboard for stroke rehabilitation.",
                    "Examining interactive surfaces for maritime operations.",
                    "Navigating and annotating 3D geological outcrops through multi-touch interaction.",
                    "PeriTop: extending back-projected tabletops with top-projected peripheral displays.",
                    "Improving awareness of automated actions using an interactive event timeline.",
                    "Beauty technology as an interactive computing platform.",
                    "Exploring modeling language for multi-touch systems using petri nets.",
                    "Setting of document importance based on analysis of user's usual working.",
                    "Eye-tracking volume simulation method to configure hardware settings for tangible and multi-user tabletop interaction.",
                    "Dinner metaphor interface: operating your computers with a knife and fork.",
                    "Comparing visual feedback techniques for object transfer between private and shared surfaces.",
                    "Investigating attraction and engagement of animation on large interactive walls in public settings.",
                    "How to choose element sizes for novel interactive systems.",
                    "Exploring the effect of display size on pointing performance.",
                    "Sidelock: authentication on mobile device sides.",
                    "Adding context to multi-touch region selections.",
                    "SLFiducials: 6DoF markers for tabletop interaction.",
                    "Designing for expert users on a large non-standard display.",
                    "Natural interaction for card games on multiple devices.",
                    "An environment for fast development of tabletop applications.",
                    "Workload on your fingertips: the influence of workload on touch-based drag and drop.",
                    "Inspirations from honey bees: exploring movement measures for dynamic whole body gestures.",
                    "Comparing eye and gesture pointing to drag items on large screens.",
                    "LampTop: touch detection for a projector-camera system based on shape classification.",
                    "Music mixing surface.",
                    "Augmenting tandem language learning with the TandemTable.",
                    "CubIT: large-scale multi-user presentation and collaboration.",
                    "TouchModifier: enriched multi-touch gestures for tablet browsers.",
                    "The effect of active encouragements of situated public display with interactive quiz.",
                    "Collaborative task assignment on tabletop computer.",
                    "Producing live participation with big screen: case study of constructive design of kupla ui.",
                    "The immersive museum.",
                    "Beauty technology: muscle based computing interaction.",
                    "Achieving soft and directly deformable interaction on tabletop interactive surfaces.",
                    "Collaboration meets interactive surfaces: walls, tables, tablets, and phones.",
                    "Interactive surfaces for interaction with stereoscopic 3d (ISIS3D): tutorial and workshop at its 2013.",
                    "Digital surfaces in libraries.",
                    "ITS 2013 workshop on visual adaptation of interfaces.",
                    "Proxemic interactions with and around digital surfaces.",
                    "Sketching user experiences tutorial: stories, strategies, surfaces."
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "ITS 2012",
        "info": "Cambridge/Boston, MA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/tabletop/2012",
                "sub_name": "Interactive Tabletops and Surfaces, ITS'12, Cambridge/Boston, MA, USA, November 11-14, 2012.",
                "count": 64,
                "papers": [
                    "Comparing elicited gestures to designer-created gestures for selection above a multitouch surface.",
                    "Direct manipulation and the third dimension: co-planar dragging on 3d displays.",
                    "Evaluation of depth perception for touch interaction with stereoscopic rendered objects.",
                    "Gradual engagement: facilitating information exchange between digital devices as a function of proximity.",
                    "Eliciting usable gestures for multi-display environments.",
                    "MobiSurf: improving co-located collaboration through integrating mobile devices and interactive surfaces.",
                    "Tabletop games for photo consumption at theme parks.",
                    "Investigating menu discoverability on a digital tabletop in a public setting.",
                    "Re-collision: a collision reconstruction forensics tabletop interface.",
                    "Investigating mid-air pointing interaction for projector phones.",
                    "Web on the wall: insights from a multimodal interaction elicitation study.",
                    "Kinected browser: depth camera interaction for the web.",
                    "A collaborative environment for engaging novices in scientific inquiry.",
                    "Orchestrating a multi-tabletop classroom: from activity design to enactment and reflection.",
                    "Combinatorix: a tangible user interface that supports collaborative learning of probabilities.",
                    "Tangible paper interfaces: interpreting pupils' manipulations.",
                    "Empirical evaluation of uni- and bimodal pen and touch interaction properties on digital tabletops.",
                    "Hand-rewriting: automatic rewriting similar to natural handwriting.",
                    "Towards the keyboard of oz: learning individual soft-keyboard models from raw optical sensor data.",
                    "Finger and hand detection for multi-touch interfaces based on maximally stable extremal regions.",
                    "Measuring the linear and rotational user precision in touch pointing.",
                    "SnapRail: a tabletop user interface widget for addressing occlusion by physical objects.",
                    "HandyWidgets: local widgets pulled-out from hands.",
                    "Pseudo-Weight: Making Tabletop Interaction with Virtual Objects More Tangible.",
                    "Touch, click, navigate: comparing tabletop and desktop interaction for map navigation tasks.",
                    "Microanalysis of active reading behavior to inform design of interactive desktop workspaces.",
                    "Interaction and recognition challenges in interpreting children's touch and gesture input on mobile devices.",
                    "Branch-explore-merge: facilitating real-time revision control in collaborative visual exploration.",
                    "Use your head: tangible windows for 3D information spaces in a tabletop environment.",
                    "TouchWave: kinetic multi-touch manipulation for hierarchical stacked graphs.",
                    "Perception and reality: exploring urban planners' vision on GIS tasks for multi-touch displays.",
                    "Scalable interaction design for collaborative visual exploration of big data.",
                    "Spatially aware tangible display interaction in a tabletop environment.",
                    "Improving awareness of automated actions within digital tabletops.",
                    "Designing tabletop activities for inquiry-based learning: lessons from phylogenetics, neuroscience and logistics.",
                    "3D touch panel interface using an autostereoscopic display.",
                    "FloTree: a multi-touch interactive simulation of evolutionary processes.",
                    "SynFlo: an interactive installation introducing synthetic biology concepts.",
                    "MoClo planner: supporting innovation in bio-design through multi-touch interaction.",
                    "Fluid surface: interactive water surface display for viewing information in a bathroom.",
                    "Flexible surfaces for interactive audio.",
                    "8D display: a relightable glasses-free 3D display.",
                    "Skin games.",
                    "Quantitative evaluation of an illusion of fingertip motion.",
                    "Seamless integration of mobile devices into interactive surface environments.",
                    "Control of ridge by using visuotactile cross-modal phenomenon.",
                    "Touch-consistent perspective for direct interaction under motion parallax.",
                    "Perceived intensity of click sensation for small touchscreen devices.",
                    "Novel interaction techniques using touch-sensitive tangibles in tabletop environments.",
                    "Tangible interactions on a flat panel display using actuated paper sheets.",
                    "Revisiting hovering: interaction guides for interactive surfaces.",
                    "An immersive surface for 3D interactions.",
                    "Development of a context-enhancing surface based on the entrainment of embodied rhythms and actions sharing via interaction.",
                    "Development of wall amusement with infrared radars.",
                    "Tool support for developing scalable multiuser applications on multi-touch screens.",
                    "ITS in the classroom: perspectives on using a multi-touch classroom.",
                    "Mobile assistant: enhancing desktop interaction using mobile phone.",
                    "Amazing forearm as an innovative interaction device and data storage on tabletop display.",
                    "WALDEN: multi-surface multi-touch simulation of climate change and species loss in thoreau's woods.",
                    "Comparing the effect of interactive tabletops and desktops on students' cognition.",
                    "PiMarking: co-located collaborative digital annotating on large tabletops.",
                    "uEmergency: a collaborative system for emergency management on very large tabletop.",
                    "Bridging private and shared interaction surfaces in co-located group settings.",
                    "BrainExplorer: an innovative tool for teaching neuroscience."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "ITS 2011",
        "info": "Kobe, Japan",
        "venues": [
            {
                "sub_name_abbr": "conf/tabletop/2011",
                "sub_name": "ACM International Conference on Interactive Tabletops and Surfaces, ITS 2011, Kobe, Japan, November 13-16, 2011.",
                "count": 65,
                "papers": [
                    "Neat: a set of flexible tools and gestures for layout tasks on interactive displays.",
                    "Pointable: an in-air pointing technique to manipulate out-of-reach targets on tabletops.",
                    "Designing user-, hand-, and handpart-aware tabletop interactions with the TouchID toolkit.",
                    "Eye-Shield: protecting bystanders from being blinded by mobile projectors.",
                    "FuSA touch display: a furry and scalable multi-touch display.",
                    "Optical pressure sensing for tangible user interfaces.",
                    "KinectTouch: accuracy test for a very low-cost 2.5D multitouch tracking system.",
                    "Augmenting touch interaction through acoustic sensing.",
                    "Enhanced interaction with physical toys.",
                    "Interactive phone call: synchronous remote collaboration and projected interactive surfaces.",
                    "HATs: interact using height-adjustable tangibles in tabletop interfaces.",
                    "TaPS widgets: interacting with tangible private spaces.",
                    "Palm touch panel: providing touch sensation through the device.",
                    "Enhancing naturalness of pen-and-tablet drawing through context sensing.",
                    "Tangible actions.",
                    "RealTimeChess: Lessons from a Participatory Design Process for a Collaborative Multi-Touch, Multi-User Game.",
                    "Adaptive personal territories for co-located tabletop interaction in a museum setting.",
                    "Triangle cursor: interactions with objects above the tabletop.",
                    "Design of unimanual multi-finger pie menu interaction.",
                    "Applying mobile device soft keyboards to collaborative multitouch tabletop displays: design and evaluation.",
                    "Exploring physical information cloth on a multitouch table.",
                    "ZoomPointing revisited: supporting mixed-resolution gesturing on interactive surfaces.",
                    "Data analysis on interactive whiteboards through sketch-based interaction.",
                    "Dynamic portals: a lightweight metaphor for fast object transfer on interactive surfaces.",
                    "Firestorm: a brainstorming application for collaborative group work at tabletops.",
                    "Who did what? Who said that?: Collaid: an environment for capturing traces of collaborative learning at the tabletop.",
                    "Flow of electrons: an augmented workspace for learning physical computing experientially.",
                    "\"Point it, split it, peel it, view it\": techniques for interactive reservoir visualization on tabletops.",
                    "The eLabBench: an interactive tabletop system for the biology laboratory.",
                    "Code space: touch + air gesture hybrid interactions for supporting developer meetings.",
                    "Display-adaptive window management for irregular surfaces.",
                    "Using mobile phones to interact with tabletop computers.",
                    "Anamorphicons: an extended display with a cylindrical mirror.",
                    "uTable: a seamlessly tiled, very large interactive tabletop system.",
                    "Interactive sensemaking in authorship networks.",
                    "Reminiscence Park Interface: personal spaces to listen to songs with memories and diffusions and overlaps of their spaces.",
                    "Analysis of pointing motions by introducing a joint model for supporting embodied large-surface presentation.",
                    "Spatial connectedness of information presentation for safety training in chemistry experiments.",
                    "Interaction design of 2D/3D map navigation on wall and tabletop displays.",
                    "Tap2Count: numerical input for interactive tabletops.",
                    "An interaction on a flat panel display using a planar 1-DOF electrostatic actuator.",
                    "Optically hiding of tabletop information with polarized complementary image projection: your shadow reveals it!",
                    "Extending interactions into hoverspace using reflected light.",
                    "SourceVis: a tool for multi-touch software visualization.",
                    "Multi-touch wall display system using multiple laser range scanners.",
                    "Novel interaction techniques by combining hand and foot gestures on tabletop environments.",
                    "Rainterior: an interactive water display with illuminating raindrops.",
                    "Process Pad: a multimedia multi-touch learning platform.",
                    "Multimodal feedback for tabletop interactions.",
                    "Mobile phones as a tactile display for tabletop typing.",
                    "Dual mode IR position and state transfer for tangible tabletops.",
                    "Digital board games: peripheral activity eludes ennui.",
                    "TESIS: turn every surface into an interactive surface.",
                    "TUIC open source SDK: enabling tangible interaction on unmodified capacitive multi-touch displays.",
                    "WobblySurface: tactile feedback by holding/releasing a surface panel.",
                    "Biri-biri: pressure-sensitive touch interface with electrical stimulation.",
                    "FuSA2 touch display.",
                    "Hovering fingertips detection on diffused surface illumination.",
                    "Tocalize: token localization on tablet computer displays.",
                    "Interactive surface that can dynamically change the shape and touch sensation.",
                    "Ficon: a tangible display device for tabletop system using optical fiber.",
                    "Core infrastructures and interfaces for context-travel at a tabletop.",
                    "Interaction with stereoscopic data on and above multi-touch surfaces.",
                    "Mining the collaborative learning process at the tabletop to offer adapted support.",
                    "Supporting note taking in co-located collaborative visual analytics on large interactive surfaces."
                ]
            }
        ]
    },
    {
        "year": "2010",
        "name": "ITS 2010",
        "info": "Saarbrücken, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/tabletop/2010",
                "sub_name": "ACM International Conference on Interactive Tabletops and Surfaces, ITS 2010, Saarbrücken, Germany, November 7-10, 2010.",
                "count": 82,
                "papers": [
                    "BendDesk: dragging across the curve.",
                    "MudPad: tactile feedback and haptic texture overlay for touch surfaces.",
                    "Cool interaction with calm technologies: experimenting with ice as a multitouch surface.",
                    "Multi-point interactions with immersive omnidirectional visualizations in a dome.",
                    "VisTACO: visualizing tabletop collaboration.",
                    "Gesture play: motivating online gesture learning with fun, positive reinforcement and physical metaphors.",
                    "Towards a formalization of multi-touch gestures.",
                    "Tool support for testing complex multi-touch gestures.",
                    "Using a depth camera as a touch sensor.",
                    "Seeing through the fog: an algorithm for fast and accurate touch detection in optical tabletop surfaces.",
                    "Construction and evaluation of multi-touch screens using multiple cameras located on the side of the display.",
                    "Z-touch: an infrastructure for 3d gesture interaction in the proximity of tabletop surfaces.",
                    "Switch: exploring the design of application and configuration switching at tabletops.",
                    "Touching the depths: introducing tabletop interaction to reservoir engineering.",
                    "WaveWindow: public, performative gestural interaction.",
                    "A set of multi-touch graph interaction techniques.",
                    "A multi-touch tabletop for robust multimedia interaction in museums.",
                    "Proxemic interaction: designing for a proximity and orientation-aware environment.",
                    "IdLenses: dynamic personal areas on shared surfaces.",
                    "FlashLight: optical communication between mobile phones and interactive tabletops.",
                    "What caused that touch?: expressive interaction with a surface through fiduciary-tagged gloves.",
                    "Sketched menus and iconic gestures, techniques designed in the context of shareable interfaces.",
                    "Multitouch puppetry: creating coordinated 3D motion for an articulated arm.",
                    "Tangible views for information visualization.",
                    "Physical and digital media usage patterns on interactive tabletop surfaces.",
                    "Hybrid documents ease text corpus analysis for literary scholars.",
                    "Towards a teacher-centric approach for multi-touch surfaces in classrooms.",
                    "Digital mysteries: designing for learning at the tabletop.",
                    "Collaborative concept mapping at the tabletop.",
                    "OA-graphs: orientation agnostic graphs for improving the legibility of charts on horizontal displays.",
                    "Integrating 2D Mouse Emulation with 3D Manipulation for Visualizations on a Multi-Touch Table.",
                    "Hugin: a framework for awareness and coordination in mixed-presence collaborative information visualization.",
                    "A slim tabletop interface based on high resolution LCD screens with multiple cameras.",
                    "A collaborative touch-based newspaper editor concept.",
                    "Integrating a multitouch kiosk system with mobile devices and multimodal interaction.",
                    "Usage of multimodal maps for blind people: why and how.",
                    "From digital to physical: learning physical computing on interactive surfaces.",
                    "Surface-poker: multimodality in tabletop games.",
                    "Applying bimanual interaction principles to text input on multi-touch surfaces and tabletops.",
                    "A multi-touch alignment guide for interactive displays.",
                    "Can \"touch\" get annoying?",
                    "Collaborative sketching with distributed displays and multimodal interfaces.",
                    "Supporting creativity workshops with interactive tabletops and digital pen and paper.",
                    "ScatterTouch: a multi touch rubber sheet scatter plot visualization for co-located data exploration.",
                    "SCiVA: a design process for applications on interactive surfaces.",
                    "Medical education on an interactive surface.",
                    "A language to define multi-touch interactions.",
                    "TouchBridge: augmenting active tangibles for camera-based multi-touch surfaces.",
                    "PhysicsBox: playful educational tabletop games.",
                    "Multitouch navigation in zoomable user interfaces for large diagrams.",
                    "IdWristbands: IR-based user identification on multi-touch surfaces.",
                    "Experiences in conceiving and prototyping a commercial business application using multi-touch technology.",
                    "Bounsight table: a view-dependent display with a single front projection.",
                    "pPen: enabling authenticated pen and touch interaction on tabletop surfaces.",
                    "Selecting targets on large display with mobile pointer and touchscreen.",
                    "Player-defined configurable soft dialogues: an extensible input system for tabletop games.",
                    "EGrid: supporting the control room operation of a utility company with multi-touch tables.",
                    "Towards making graphical user interface palettes tangible.",
                    "Some thoughts on a model of touch-sensitive surfaces.",
                    "Development of eye-tracking tabletop interface for media art works.",
                    "Alternative multitouch gestures for map interaction.",
                    "e-science on the surface.",
                    "Lumino: tangible building blocks based on glass fiber bundles: invited demo.",
                    "Multi-touch surface as input device.",
                    "Interactive learning experience on nanotechnology.",
                    "TouchLab: the all-in-one multi-touch marketing tool.",
                    "lzrdm: collaborative multi-touch sequencer.",
                    "Editing and exploring node-link diagrams on pen- and multi-touch-operated tabletops.",
                    "Waves: multi-touch VJ interface.",
                    "MudPad: a tactile memory game.",
                    "Xpaaand: interacting with rollable displays.",
                    "Demo for digital mysteries: designing for learning at the tabletop.",
                    "TouchBridge: augmenting active tangibles for camera-based multi-touch surfaces.",
                    "Comparing most recent 3D manipulation techniques for multi-touch displays.",
                    "Holocubtile: 3D multitouch brings the virtual world into the user's hands.",
                    "iliGHT 3D touch: a multiview multitouch surface for 3d content visualization and viewpoint sharing.",
                    "PhoneTouch: a technique for direct phone interaction on surfaces.",
                    "radarTOUCH: multi-touch interaction on large planar surfaces.",
                    "Novel fields of application for tangible displays above the tabletop.",
                    "Humanaquarium.",
                    "The BendDesk demo: multi-touch on a curved display.",
                    "GlobalData: multi-user interaction with geographic information systems on interactive surfaces."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "ITS 2009",
        "info": "Banff, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/tabletop/2009",
                "sub_name": "ACM International Conference on Interactive Tabletops and Surfaces, ITS 2009, Banff / Calgary, Alberta, Canada, November 23-25, 2009.",
                "count": 44,
                "papers": [
                    "Single user multitouch on the DiamondTouch: from 2 x 1D to 2D.",
                    "Trollskogen: a multitouch table top framework for enhancing communication amongst cognitively disabled children.",
                    "The Haptic Tabletop Puck: the video.",
                    "Getting practical with interactive tabletop displays: designing for dense data, \"fat fingers, \" diverse interactions, and face-to-face collaboration.",
                    "RealTimeChess: a real-time strategy and multiplayer game for tabletop displays.",
                    "Curator: a design environment for curating tabletop museum experiences.",
                    "Seamless interaction between \"creation\" and \"appreciation\": multi-touch drawing interface.",
                    "PaperLens: advanced magic lens interaction above the tabletop.",
                    "PAC-PAC: pinching gesture recognition for augmented tabletop video game.",
                    "reacTIVision and TUIO: a tangible tabletop toolkit.",
                    "MeTaTop: a multi-sensory and multi-user interface for collaborative analysis.",
                    "3D multitouch advanced interaction techniques and applications.",
                    "TAP: visual analytics on surface computers.",
                    "TouchTones: multi-user collaborative music composer.",
                    "FiberBoard: compact multi-touch display using channeled light.",
                    "A multi-touch tabletop interface for applying collaborative creativity techniques.",
                    "Nori Scrum meeting table.",
                    "PyMT: a post-WIMP multi-touch user interface toolkit.",
                    "FiberBoard: compact multi-touch display using channeled light.",
                    "Inverted FTIR: easy multitouch sensing for flatscreens.",
                    "CRISTAL: a collaborative home media and device controller based on a multi-touch display.",
                    "Analysis of natural gestures for controlling robot teams on multi-touch tabletop surfaces.",
                    "Developing the story: designing an interactive storytelling application.",
                    "FluidPaint: an interactive digital painting system using real wet brushes.",
                    "Stacks on the surface: resolving physical order using fiducial markers with structured transparency.",
                    "I-Grabber: expanding physical reach in a large-display tabletop environment through the use of a virtual grabber.",
                    "Visualizing and manipulating automatic document orientation methods using vector fields.",
                    "PaperLens: advanced magic lens interaction above the tabletop.",
                    "Exploring tangible and direct touch interfaces for manipulating 2D and 3D information on a digital table.",
                    "The Haptic Tabletop Puck: tactile feedback for interactive tabletops.",
                    "Enhancing input on and above the interactive surface with muscle sensing.",
                    "Hand distinction for multi-touch tabletop interaction.",
                    "Getting practical with interactive tabletop displays: designing for dense data, \"fat fingers, \" diverse interactions, and face-to-face collaboration.",
                    "Extending touch: towards interaction with large-scale surfaces.",
                    "Simulating grasping behavior on an imaging interactive surface.",
                    "Sticky tools: full 6DOF force-based interaction for multi-touch tables.",
                    "Navigation modes for combined table/screen 3D scene rendering.",
                    "Investigating multi-touch and pen gestures for diagram editing on interactive surfaces.",
                    "The effects of changing projection geometry on the interpretation of 3D orientation on tabletops.",
                    "ShadowGuides: visualizations for in-situ learning of multi-touch and whole-hand gestures.",
                    "Stacked Half-Pie menus: navigating nested menus on interactive tabletops.",
                    "WebSurface: an interface for co-located collaborative information gathering.",
                    "Actions speak loudly with words: unpacking collaboration around the table.",
                    "Collaborative Puzzle Game: a tabletop interactive game for fostering collaboration in children with Autism Spectrum Disorders (ASD)."
                ]
            }
        ]
    },
    {
        "year": "2008",
        "name": "Tabletop 2008",
        "info": "Amsterdam, The Netherlands",
        "venues": [
            {
                "sub_name_abbr": "conf/tabletop/2008",
                "sub_name": "Third IEEE International Workshop on Tabletops and Interactive Surfaces (Tabletop 2008), October 1-3 2008, Amsterdam, The Netherlands.",
                "count": 30,
                "papers": [
                    "Group coordination and negotiation through spatial proximity regions around mobile devices on augmented tabletops.",
                    "Improving digital handoff in shared tabletop workspaces.",
                    "Pen and paper techniques for physical customisation of tabletop interfaces.",
                    "DocuDesk: An interactive surface for creating and rehydrating many-to-many linkages among paper and digital documents.",
                    "Presenting using Two-Handed Interaction in Open Space.",
                    "When the fingers do the talking: A study of group participation with varying constraints to a tabletop interface.",
                    "TableTrays: Temporary, reconfigurable work surfaces for tabletop groupware.",
                    "Tilted tabletops: In between horizontal and vertical workspaces.",
                    "Contextual design considerations for co-located, collaborative tables.",
                    "IntuPaint: Bridging the gap between physical and digital painting.",
                    "From DigiQuilt to DigiTile: Adapting educational technology to a multi-touch table.",
                    "Ghosts in the interface: Meta-user interface visualizations as guides for multi-touch interaction.",
                    "A single-user tabletop card game system for older persons: General lessons learned from an in-situ study.",
                    "TurTan: A tangible programming language for creative exploration.",
                    "Little fingers on the tabletop: A usability evaluation in the kindergarten.",
                    "System design for the WeSpace: Linking personal devices to a table-centered multi-user, multi-surface environment.",
                    "A field study of knowledge workers' use of interactive horizontal displays.",
                    "\"I don't understand it either, but it is cool\" - visitor interactions with a multi-touch table in a museum.",
                    "Tabletop AgilePlanner: A tabletop-based project planning tool for agile software development teams.",
                    "ShapeTouch: Leveraging contact shape on interactive surfaces.",
                    "Implementation and evaluations of vision-based finger flicking gesture recognition for tabletops.",
                    "The deformable workspace: A membrane between real and virtual space.",
                    "Adaptive interface for text input on large-scale interactive surfaces.",
                    "Creating malleable interactive surfaces using liquid displacement sensing.",
                    "Visibility control using revolving polarizer.",
                    "On top of tabletop: A virtual touch panel display.",
                    "i-m-Top: An interactive multi-resolution tabletop system accommodating to multi-resolution human vision.",
                    "Experiences with building a thin form-factor touch and tangible tabletop.",
                    "Pokey: Interaction through covert structured light.",
                    "UlteriorScape: Interactive optical superimposition on a view-dependent tabletop display."
                ]
            }
        ]
    },
    {
        "year": "2007",
        "name": "Tabletop 2007",
        "info": "Newport, Rhode Island, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/tabletop/2007",
                "sub_name": "Second IEEE International Workshop on Horizontal Interactive Human-Computer Systems (Tabletop 2007), October 10-12 2007, Newport, Rhode Island, USA.",
                "count": 28,
                "papers": [
                    "C-Slate: A Multi-Touch and Object Recognition System for Remote Collaboration using Horizontal Surfaces.",
                    "T3: Rapid Prototyping of High-Resolution and Mixed-Presence Tabletop Applications.",
                    "Distributed Tabletops: Supporting Remote and Mixed-Presence Tabletop Collaboration.",
                    "TableTops: Worthwhile Experiences of Collocated and Remote Collaboration.",
                    "Put That There NOW: Group Dynamics of Tabletop Interaction under Time Pressure.",
                    "Affective Tabletop Game: A New Gaming Experience for Children.",
                    "The TViews Table in the Home.",
                    "Living with a Tabletop: Analysis and Observations of Long Term Office Use of a Multi-Touch Table.",
                    "Applying an Aesthetic Framework of Touch for Table-Top Interactions.",
                    "Reproducing and Re-experiencing the Writing Process in Japanese Calligraphy.",
                    "Reading Revisited: Evaluating the Usability of Digital Display Surfaces for Active Reading Tasks.",
                    "Photohelix: Browsing, Sorting and Sharing Digital Photo Collections.",
                    "Information Layout and Interaction on Virtual and Real Rotary Tables.",
                    "Examination of Text-Entry Methods for Tabletop Displays.",
                    "Tabletop File System Access: Associative and Hierarchical Approaches.",
                    "Improving Menu Interaction for Cluttered Tabletop Setups with User-Drawn Path Menus.",
                    "Multimodal Split View Tabletop Interaction Over Existing Applications.",
                    "Going Deeper: a Taxonomy of 3D on the Tabletop.",
                    "Augmenting Mood Boards: Flexible and Intuitive Interaction in the Context of the Design Studio.",
                    "Tablescape Plus: Interactive Small-sized Vertical Displays on a Horizontal Tabletop Display.",
                    "Spilling: Expanding Hand held Interaction to Touch Table Displays.",
                    "Supporting Multiple Off-Axis Viewpoints at a Tabletop Display.",
                    "Multiple Input Support in a Model-Based Interaction Framework.",
                    "EmiTable: A Tabletop Surface Pervaded with Imperceptible Metadata.",
                    "Ortholumen: Using Light for Direct Tabletop Input.",
                    "High Precision Multi-touch Sensing on Surfaces using Overhead Cameras.",
                    "Depth-Sensing Video Cameras for 3D Tangible Tabletop Interaction.",
                    "Low-Cost Malleable Surfaces with Multi-Touch Pressure Sensitivity."
                ]
            }
        ]
    },
    {
        "year": "2006",
        "name": "Tabletop 2006",
        "info": "Adelaide, Australia",
        "venues": [
            {
                "sub_name_abbr": "conf/tabletop/2006",
                "sub_name": "First IEEE International Workshop on Horizontal Interactive Human-Computer Systems (Tabletop 2006), 5-7 January 2006, Adelaide, Australia.",
                "count": 32,
                "papers": [
                    "Message from the General Chair.",
                    "Message from Co-Program Chairs.",
                    "Committees.",
                    "Sponsors and Supporters.",
                    "Augmented Coliseum: An Augmented Game Environment with Small Vehicles.",
                    "pHotOluck: A Home-use Table-ware to Vitalize Mealtime Communications by Projecting Photos onto Dishes.",
                    "A Study on the Application of DVE to a Mental Support System for the Aged Segregated from Family.",
                    "MultiSpace: Enabling Electronic Document Micro-mobility in Table-Centric, Multi-Device Environments.",
                    "\"Lazy Susan\" Communication System for Remote, Spatial and Physical Collaborative Works.",
                    "Disoriented Pen-Gestures for Identifying Users around the Tabletop without Cameras and Motion Sensors.",
                    "Multi-User Interface and Interactions on Direct-Touch Horizontal Surfaces: Collaborative Tabletop Research at MERL.",
                    "Supporting Effective Interaction with Tabletop Groupware.",
                    "Considering Reach in Tangible and Table Top Design.",
                    "ViCAT: Visualisation and Interaction on a Collaborative Access Table.",
                    "Supporting Mixed Presence Groupware in Tabletop Applications.",
                    "Extending Tabletops to Support Flexible Collaborative Interactions.",
                    "Rotation and Translation Mechanisms for Tabletop Interaction.",
                    "Experiences with and Observations of Direct-Touch Tabletops.",
                    "TeamSearch: Comparing Techniques for Co-Present Collaborative Search of Digital Media.",
                    "Studying Designers using a Tabletop System for 3D Design with a Focus on the Impact on Spatial Cognition.",
                    "Behavioral analysis of asymmetric information sharing on Lumisight Table.",
                    "Feel the Beat: Direct Manipulation of Sound during Playback.",
                    "Supporting the creation of Mood Boards: Industrial Design in Mixed Reality.",
                    "Proposal of a Multi-layer Structure for Multilingual Display on a Lumisight Table.",
                    "Visualizing Audio in Group Table Conversation.",
                    "Augmented Tabletops, an Incentive for Distributed Collaboration.",
                    "Transparent Tabletop Interface for Multiple Users on Lumisight Table.",
                    "Collaborative Searching for Video Using the Físchlár System and a Diamond Touch Table.",
                    "uPen: A Smart Pen-liked Device for Facilitating Interaction on Large Displays.",
                    "The 3D Tractus: A Three-Dimensional Drawing Board.",
                    "Direct Intentions: The Effects of Input Devices on Collaboration around a Tabletop Display.",
                    "Gesture Registration, Relaxation, and Reuse for Multi-Point Direct-Touch Surfaces."
                ]
            }
        ]
    }
]