[
    {
        "name": "IWC",
        "year": "2021",
        "info": "Volume 33: 2021",
        "count": 20,
        "papers": [
            "Heterogeneous Models and Modelling Approaches for Engineering of Interactive Systems.",
            "Empirical Results for High-definition Video and Augmented Reality Content Delivery in Hyper-connected Cars.",
            "Engineering Task-based Augmented Reality Guidance: Application to the Training of Aircraft Flight Procedures.",
            "Using Task Models to Understand the Intersection of Numeracy Skills and Technical Competence With Medical Device Design.",
            "Balancing the formal and the informal in user-centred design.",
            "Model-based Engineering of Feedforward Usability Function for GUI Widgets.",
            "On the Benefits of Using MVC Pattern for Structuring Event-B Models of WIMP Interactive Applications.",
            "Shared Gaze Visualizations in Collaborative Interactions: Past, Present and Future.",
            "AugIR Meets GestureCards: A Digital Sketching Environment for Gesture-Based Applications.",
            "Usability Problem Identification Based on Explainable Neural Network in Asynchronous Testing Environment.",
            "Embodied Conversational Agents in eHealth: How Facial and Textual Expressions of Positive and Neutral Emotions Influence Perceptions of Mutual Understanding.",
            "Effects of the Font Size and Line Spacing of Simplified Chinese Characters on Smartphone Readability.",
            "Priming Effect of Colour on Aiding the Attentional Reorientation in Sequential Presentations of Temporal Data Visualization: Evidence From Eye-Tracking.",
            "A Novel Gaze Input System Based on Iris Tracking With Webcam Mounted Eyeglasses.",
            "Gaps Between Continuous Measurement Methods: A Longitudinal Study of Perceived Usability.",
            "Talking with an IoT-CA: Effects of the Use of Internet of Things Conversational Agents on Face-to-Face Conversations.",
            "Time and Temporality in HCI Research.",
            "Design Strategies for Collaborative Learning in Tangible Tabletops: Positive Interdependence and Reflective Pauses.",
            "The Reflection Object: An Activity-Theory Informed Concept for Designing for Reflection.",
            "Audio-Visual Mixed Reality Representation of Hazard Zones for Safe Pedestrian Navigation of a Space."
        ]
    },
    {
        "name": "IWC",
        "year": "2020",
        "info": "Volume 32: 2020",
        "count": 30,
        "papers": [
            "Interoceptive Awareness: The 'Being' Dimension of 'Being There' in Virtual Worlds.",
            "Gaze-based Kinaesthetic Interaction for Virtual Reality.",
            "Restating The Meaning Of UCD And HCD For A New World Of Design Theories.",
            "Keyboard-Based Protocol for Typing Algebraic Expressions.",
            "Understanding Usage Behavior of Different Mobile Application Categories Based on Personality Traits.",
            "Investigating Agreement Among HCI Researchers About Human-Computer Interaction in CMMI-DEV Model: A Case Study.",
            "Corrigendum to: Using Conceptual Metaphors to Represent Temporal Context in Time Series Data Sonification.",
            "Understanding Users' Engagement and Responses in 3D Virtual Reality: The Influence of Presence on User Value.",
            "Entrepreneurial Intention: The Impact of General Computer Self-Efficacy and Computer Anxiety.",
            "Can a Low-Cost Eye Tracker Assess the Impact of a Valent Stimulus? A Study Replicating the Visual Backward Masking Paradigm.",
            "EM-FEE: An Efficient Multitask Scheme for Facial Expression Estimation.",
            "Using a Head Pointer or Eye Gaze: The Effect of Gaze on Spatial AR Remote Collaboration for Physical Tasks.",
            "Understanding Meaningful Participation and the Situated Use of Technology in Community Music for Active Ageing.",
            "Predicting Human Operator's Decisions Based on Prospect Theory.",
            "Benchmarking Human Performance in Semi-Automated Image Segmentation.",
            "Visual Search Fixation Strategies in a 3D Image Set: An Eye-Tracking Study.",
            "Effect of Visual Design on the Evaluation of Technology- vs. Design-Based Novel Interactive Products.",
            "Wayfinding in Virtual Environments With Landmarks on Overview Maps.",
            "Embodied Interaction and Spatial Skills: A Systematic Review of Empirical Studies.",
            "Systematic Review of Design Guidelines for Full-Body Interactive Games.",
            "EduRecomSys: An Educational Resource Recommender System Based on Collaborative Filtering and Emotion Detection.",
            "Erratum to: Rational or Irrational Decision? Examination on Gamers' Intention to Purchase Probability-Type Items.",
            "Use of a Persona to Support the Interdisciplinary Design of an Assistive Technology for Meal Preparation in Traumatic Brain Injury.",
            "Investigating Physical Interaction With Digital Data Through the Materialization of Email Handling.",
            "Beyond the Lexical Sense of Online Reviews: The Role of Emoticons and Consumer Experience.",
            "Interactive Exploration of Large-Scale UI Datasets with Design Maps.",
            "The Effect of an Adaptive Simulated Inner Voice on User's Eye-gaze Behaviour, Ownership Perception and Plausibility Judgement in Virtual Reality.",
            "A Survey on Applying Automated Recognition of Touchscreen Stroke Gestures to Children's Input.",
            "Managing User-Centered Design Activities in Distributed Agile Development.",
            "Smartwatch User Authentication Based on the Arm-Raising Gesture."
        ]
    },
    {
        "name": "IWC",
        "year": "2019",
        "info": "Volume 31: 2019",
        "count": 38,
        "papers": [
            "The effects of visual feedback designs on long wait time of mobile application user interface.",
            "Effects of Self-Disclosure on Attributions in Human-IoT Conversational Agent Interaction.",
            "A Human-Centered Taxonomy of Interaction Modalities and Devices.",
            "Lowering the Usability Entry Barrier to Interactive Poetics Experimentation in Dance.",
            "Examining the Relative Impact of Professional Profile Images and Facial Expressions in Small Business-to-Business Marketing Online.",
            "Searching vs. Browsing - The Influence of Consumers' Goal Directedness on Website Evaluations.",
            "Popular topics in HCI: Special Issue of Selected Extended Papers from the 32nd International BCS Human Computer Interaction Conference.",
            "Chatbots and Gender Stereotyping.",
            "Enhancing Patient Motivation through Intelligibility in Cardiac Tele-rehabilitation.",
            "How Different Personalities Benefit From Gamification.",
            "Honesty, Social Presence and Self-Service in Retail.",
            "A Virtual Reality Platform for Analyzing Remote Archaeological Sites.",
            "Investigating the Impact of Adding Plan Reminders on Implementation Intentions to Support Behaviour Change.",
            "Understanding and Measuring User Experience in Conversational Interfaces.",
            "Navigation Comparison between a Real and a Virtual Museum: Time-dependent Differences using a Head Mounted Display.",
            "How People Judge the Usability of a Desktop Graphic User Interface at Different Time Points: Is there Evidence for Memory Decay, Recall Bias or Temporal Bias?",
            "Temporarily Unavailable: Memory Inhibition in Cognitive and Computer Science.",
            "The Effect of Auditory Stimuli on User's Meditation and Workload in a Brain-Computer Interface Game.",
            "Dual-Cursor: Improving User Performance and Perceived Usability for Cursor-Based Text Entry on TV Using Remote Control.",
            "Technology for Children With Autism Spectrum Disorder: What Do Sri Lankan Parents and Practitioners Want?",
            "How Knowledge Workers Manage Their Personal Information Spaces: Perceptions, Challenges and High-Level Strategies.",
            "An Initial Model of Trust in Chatbots for Customer Service - Findings from a Questionnaire Study.",
            "Sound Stories: A Context-Based Study of Everyday Listening to Augmented Soundscapes.",
            "The State of Speech in HCI: Trends, Themes and Challenges.",
            "Identifying Five Archetypes of Interaction Design Professionals and Their Universal Design Expertise.",
            "Longitudinal Study on Retrospective Assessment of Perceived Usability: A New Method and Perspectives.",
            "The Use of Virtual Reality in the Assessment of Paranoid Thoughts: A Comparison with Desktop-Based Tools.",
            "User-Centered Gamification for E-Learning Systems: A Quantitative and Qualitative Analysis of its Application.",
            "Understanding and Encouraging Online Reviewing With a Selection-Based Review System.",
            "Ubiquitous Intelligent Services for Vehicular Users: A Systematic Mapping.",
            "Measuring Situational Anxiety Related to Information Retrieval on the Web Among English-Speaking Internet Users.",
            "Empowering Community Water Data Stakeholders.",
            "Augmented Experiences: Investigating the Feasibility of Virtual Reality as Part of a Workplace Wellbeing Intervention.",
            "Consolidation of Usability Problems With Novice Evaluators Re-Examined in Individual vs. Collaborative Settings.",
            "CamCutter: Impromptu Vision-Based Cross-Device Application Sharing.",
            "Hand Gesture-Based Virtual Reality Training Simulator for Collaboration Rescue of a Railway Accident.",
            "Facebook Live: A Mixed-Methods Approach to Explore Individual Live Streaming Practices and Motivations on Facebook.",
            "Rational or Irrational Decision? Examination on Gamers' Intention to Purchase Probability-Type Items."
        ]
    },
    {
        "name": "IWC",
        "year": "2018",
        "info": "Volume 30: 2018",
        "count": 34,
        "papers": [
            "Rings: A Game with a Purpose for Test Data Generation.",
            "Watt-I-See: Design and Evaluation of an Interactive Installation Using Eco-feedforward Strategies.",
            "The Cognitive Costs of Upgrades.",
            "Trans Competent Interaction Design: A Qualitative Study on Voice, Identity, and Technology.",
            "Situated Organization of Video-Mediated Interaction: A Review of Ethnomethodological and Conversation Analytic Studies.",
            "Design and Evaluation of Trust-Eliciting Cues in Drug-Drug Interaction Alerts.",
            "On Ethical Responsiveness: Being Answerable to Others as an HCI Researcher.",
            "Pictogram Tablet: A Speech Generating Device Focused on Language Learning.",
            "Aesthetics in Context - The Role of Aesthetics and Usage Mode for a Website's Success.",
            "Assessing Intrinsic and Extraneous Cognitive Complexity of E-textbook Learning.",
            "Students' Experience with Online Simulation Games: From Computer Anxiety to Satisfaction.",
            "Corrigendum: Situated Organization of Video-Mediated Interaction: A Review of Ethnomethodological and Conversation Analytic Studies.",
            "'Can I Trust the Spoken Dialogue System Because It Uses the Same Words as I Do?' - Influence of Lexically Aligned Spoken Dialogue Systems on Trustworthiness and User Satisfaction.",
            "Children's Acceptance of a Collaborative Problem Solving Game Based on Physical Versus Digital Learning Spaces.",
            "Measuring Visual User Interface Complexity of Mobile Applications With Metrics.",
            "HoloBox: Augmented Visualization and Presentation with Spatially Integrated Presenter.",
            "Differences and Similarities between Dominant and Non-dominant Thumbs for Pointing and Gesturing Tasks with Bimanual Tablet Gripping Interaction.",
            "Examining the Usability of Touch Screen Gestures for Children With Down Syndrome.",
            "Exploring Interactivity and Co-Creation in Rural China.",
            "The New Snapshot Narrators: Changing Your Visions and Perspectives!",
            "Design of Interactive Mechanisms to Support the Communication of Users' Intentions.",
            "I-Typed DMML: A Novel DSL for Direct Manipulation Interaction with Virtual Objects.",
            "Biometric Properties of Mouse Interaction Features on the Web.",
            "Relating Experience Goals With Visual User Interface Design.",
            "Evaluating an Interface for Cross-Modal Collaborative Information Seeking.",
            "Affective Image Classification Based on User Eye Movement and EEG Experience Information.",
            "Women's Experiences Receiving Support Online for Intimate Partner Violence: How Does it Compare to Face-to-Face Support from a Health Professional?",
            "Exploring the State of Human-centred Design Practice in Software Development Companies: A Cross-Case Analysis of Three Nigerian Software Companies.",
            "Supporting Better Decisions: How Order Effects Influence Decision Support System Alignment.",
            "Uncanny...But Convincing? Inconsistency Between a Virtual Agent's Facial Proportions and Vocal Realism Reduces Its Credibility and Attractiveness, but Not Its Persuasive Success.",
            "Designing for Coping.",
            "An Empirical Evidence of Barriers in a Big Data Infrastructure.",
            "Comparison of Gaze and Mouse Pointers for Video-based Collaborative Physical Task.",
            "Corrigendum: Life Is Too Short to RTFM: How Users Relate to Documentation and Excess Features in Consumer Products."
        ]
    },
    {
        "name": "IWC",
        "year": "2017",
        "info": "Volume 29: 2017",
        "count": 52,
        "papers": [
            "Disruptions, Dilemmas and Paradoxes: Ethical Matter(s) in Design Research.",
            "A Framework for Negotiating Ethics in Sensitive Settings: Hospice as a Case Study.",
            "Our Year With the Glass: Expectations, Letdowns and Ethical Dilemmas of Technology Trials With Vulnerable People.",
            "From Empathy to Care: A Feminist Care Ethics Perspective on Long-Term Researcher-Participant Relations.",
            "Is Sustainability a Special Case for Persuasion?",
            "Blended, Not Bossy: Ethics Roles, Responsibilities and Expertise in Design.",
            "Multi-Lifespan Information System Design in Support of Transitional Justice: Evolving Situated Design Principles for the Long(er) Term.",
            "Evaluating Multitouch Semiotics to Empower Prekindergarten Instruction with Interactive Surfaces.",
            "Organizational Affordances: A Structuration Theory Approach to Affordances.",
            "Donating Context Data to Science: The Effects of Social Signals and Perceptions on Action-Taking.",
            "Towards a Design Space for Multisensory Data Representation.",
            "The Evocative Object - Introspection and Emotional Reflection Through Computer Use.",
            "ISAB: Integrated Indoor Navigation System for the Blind.",
            "On the Use of Electronic Documentation Systems in Fast-Paced, Time-Critical Medical Settings.",
            "In-Action Ethics.",
            "Co-constructing Meaning and Negotiating Participation: Ethical Tensions when 'Giving Voice' through Digital Storytelling.",
            "Exploring Social Interaction With a Tangible Music Interface.",
            "Absolute and Relative User Perception of Classification Accuracy in an Affective Video Game.",
            "Placing Location-Based Narratives in Context Through a Narrator and Visual Markers.",
            "User Experience in the Work Domain: A Longitudinal Field Study.",
            "Is It Still Where I Expect It? - Users' Current Expectations of Interface Elements on the Most Frequent Types of Websites.",
            "Fly a Drone Safely: Evaluation of an Embodied Egocentric Drone Controller Interface.",
            "Tapping Task Performance on Smartphones in Cold Temperature.",
            "Context of Use: The Final Frontier in the Practice of User-Centered Design?",
            "Exploring Women's Everyday Mobile Phone Experiences in Nairobi, Kenya.",
            "An Autoethnographic Approach to Guide Situated Ethical Decisions in Participatory Design with Teenagers.",
            "Socially Augmented Music Discovery with Collaborative Playlists and Mood Pictures.",
            "The Human Element: Social Leveraging of User Engagement with Assisted Living Technology.",
            "When You Exercise Your Avatar in a Virtual Game: The Role of Avatars' Body Shape and Behavior in Users' Health Behavior.",
            "How do Perceived Enjoyment and Perceived Usefulness of a Software Product Interact over Time to Impact Technology Acceptance?",
            "Undesirable Consequences and Social Contexts of Technology Use: A Micro-analysis of Embodied User Interaction.",
            "Who Controls Who? Embodied Control Within Human-Technology Choreographies†.",
            "Reciprocal Control in Adaptive Environments.",
            "MyWebSteps: Aiding Revisiting with a Visual Web History.",
            "The Kinematic Theory Produces Human-Like Stroke Gestures.",
            "Software Feature Life Cycles: Insights From a Value-Based Typology of Software Feature Innovation.",
            "3D Selection Techniques for Mobile Augmented Reality Head-Mounted Displays.",
            "Effectiveness of Multi-Parameter Compound Tactons for Navigating in a Virtual Urban Environment.",
            "Exploring the Potential of GeoPass: A Geographic Location-Password Scheme.",
            "The Function and Future of the Folder.",
            "Drawing Inspiration from World of Warcraft: Gamification Design Elements for Behavior Change Technologies.",
            "Reminiscence of People With Dementia Mediated by Multimedia Artifacts.",
            "How We Talk About Interactivity: Modes and Meanings in HCI Research.",
            "Extending Value Sensitive Design to Off-the-Shelf Technology: Lessons Learned from a Local Intercultural Computer Club.",
            "Cumulative Experience and Recent Behavior and their Relation to Content Quality on Wikipedia.",
            "A Novel Head Cursor Facilitation Technique for Cerebral Palsy: Functional and Clinical Implications.",
            "Relationship Between Internet Addiction and Self-Esteem: Cross-Cultural Study in Portugal and Brazil.",
            "Rethinking Age in HCI Through Anti-Ageist Playful Interactions.",
            "Adapting the Web for People With Upper Body Motor Impairments Using Touch Screen Tablets.",
            "A Model of Nature Soundscape for Calm Information Display.",
            "Walking: A Grounded Theory of Social Engagement and Experience.",
            "Discovering Visual Elements of Web Pages and Their Roles: Users' Perception."
        ]
    },
    {
        "name": "IWC",
        "year": "2016",
        "info": "Volume 28: 2016",
        "count": 53,
        "papers": [
            "Pointing and Selecting with Facial Activity.",
            "Modeling Traditional Literacy, Internet Skills and Internet Usage: An Empirical Study.",
            "Life Is Too Short to RTFM: How Users Relate to Documentation and Excess Features in Consumer Products.",
            "Effect of Age on Human-Computer Interface Control Via Neck Electromyography.",
            "Should I Stay or Should I Go? Improving Event Recommendation in the Social Web.",
            "\"I Need to Be Explicit: You're Wrong\": Impact of Face Threats on Social Evaluations in Online Instructional Communication.",
            "The Potential of a Text-Based Interface as a Design Medium: An Experiment in a Computer Animation Environment.",
            "Framing a Set: Understanding the Curatorial Character of Personal Digital Bibliographies.",
            "Identifying Problems Associated with Focus and Context Awareness in 3D Modelling Tasks.",
            "IWC Special Issue in Human Factors and Interaction Design for Critical Systems.",
            "Developing Design Guidelines for a Visual Vocabulary of Electronic Medical Information to Improve Health Literacy.",
            "Factors Affecting User Perception of a Spoken Language vs. Textual Search Interface: A Content Analysis.",
            "ShifTable: A Natural Remote Target-Selection Technique on Large Displays.",
            "Employing Number-Based Graphical Representations to Enhance the Effects of Visual Check on Entry Error Detection.",
            "The Effects of Perceptual Interference on Number-Entry Errors.",
            "Editorial.",
            "Understanding Local Community Attachment, Engagement and Social Support Networks Mediated by Mobile Technology.",
            "TreatmentExplorer: an Interactive Decision Aid for Medical Risk Communication and Treatment Exploration.",
            "Attending to Email.",
            "On the Role of Digital Consultation Tools in Public Space Design: A Case Study.",
            "TouchRoller: A Touch-sensitive Cylindrical Input Device for GUI Manipulation of Interactive TVs.",
            "Exploring the Role of Ten Universal Values in Using Products and Services.",
            "Towards Understanding the Design Space of Tangible User Interfaces for Collaborative Urban Planning.",
            "Shuffling Services: Current Trends in Interacting with Digital Music.",
            "Creating Bridges: The Role of Exploratory Design Research in an Intelligent Tutoring System Project.",
            "Look Who's Talking: Evaluating the Utility of Interventions During an Interactive Think-Aloud.",
            "Editorial.",
            "Field Dependence-Independence and Eye Movement Patterns: Investigating Users' Differences Through an Eye Tracking Study.",
            "Design Feedback From Users Through an Online Social Platform: Benefits and Limitations.",
            "Apathy Towards the Integration of Usability Work: A Case of System Justification.",
            "Provoking Imagination and Emotion Through a Lively Mobile Phone: A User Experience Study.",
            "Improving the User Engagement in Large Display Using Distance-Driven Adaptive Interface.",
            "Extending the Repertoire of Activity Theory in HCI: N. A. Bernstein and the Role of the Body.",
            "Unselfconscious Interaction: A Conceptual Construct.",
            "Emotional Reactions to Point-Light Display Animations.",
            "Understanding Advice Sharing among Physicians: Towards Trust-Based Clinical Alerts.",
            "Effects of Different Website Designs on First Impressions, Aesthetic Judgements and Memory Performance after Short Presentation.",
            "Exploring Whole-Body Interaction and Design for Museums.",
            "The Heuristic Quality Scale.",
            "Stakeholder Attitudes Toward and Values Embedded in a Sensor-Enhanced Personal Emergency Response System.",
            "Worker Performance in a Situated Crowdsourcing Market.",
            "Perception of Representation Modalities and Affordances in Tangible Environments by Children with Intellectual Disabilities.",
            "Design Research as Conceptual Designing: The Manhattan Design Concept.",
            "How Should Organizations Adapt to Youth Civic Engagement in Social Media? A Lead User Approach.",
            "The Influences of Design Esthetic, Site Relevancy and Task Relevancy on Attention to Banner Advertising.",
            "Mobile Mindfulness and User's Worry: A Qualitative Study of Using a Smartphone App for Distancing from Negative Thoughts.",
            "Effects of Temporal Format of Everyday Video on Narrative Engagement and Social Interactivity.",
            "Methodology of Affective Intervention Design for Intelligent Systems.",
            "GenderMag: A Method for Evaluating Software's Gender Inclusiveness.",
            "An In-the-Wild Study of Learning to Brainstorm: Comparing Cards, Tabletops and Wall Displays in the Classroom.",
            "Comparison of Three QWERTY Keyboards for a Smartwatch.",
            "Semi-aural Interfaces: Investigating Voice-controlled Aural Flows.",
            "Group vs Individual Web Accessibility Evaluations: Effects with Novice Evaluators."
        ]
    },
    {
        "name": "IWC",
        "year": "2015",
        "info": "Volume 27: 2015",
        "count": 47,
        "papers": [
            "Methods for Studying Technology in the Home.",
            "Situating Digital Interventions: Mixed Methods for HCI Research in the Home.",
            "Disruption as a Research Method for Studying Technology Use in Homes.",
            "At Home with Users: A Comparative View of Living Labs.",
            "Researching Young Children's Everyday Uses of Technology in the Family Home.",
            "Seeing the First-Person Perspective in Dementia: A Qualitative Personal Evaluation Game to Evaluate Assistive Technology for People Affected by Dementia in the Home Context.",
            "Tailored Scenarios: A Low-Cost Online Method to Elicit Perceptions of Home Technologies Using Participant-Specific Contextual Information.",
            "Transference of PIM Research Prototype Concepts to the Mainstream: Successes or Failures.",
            "Dynamic Facial Emotion Recognition Oriented to HCI Applications.",
            "Let'S Talk About Technology for Peace: A Systematic Assessment of Problem-Based Group Collaboration Around an Interactive Tabletop.",
            "Natural Language-based Representation of User Preferences.",
            "Design and Evaluation of a Hand-held Trackball-based Touch-Haptic Interface for Providing Directional Feedback.",
            "The Impact of an Embodied Agent's Emotional Expressions Over Multiple Interactions.",
            "The Development of a Companionship Scale for Artificial Pets.",
            "Towards Intuitive Interaction Theory.",
            "An Experience Perspective on Intuitive Interaction: Central Components and the Special Effect of Domain Transfer Distance.",
            "Designing with Image Schemas: Resolving the Tension Between Innovation, Inclusion and Intuitive Use.",
            "Screening Prototype Features in Terms of Intuitive Use: Design Considerations and Proof of Concept.",
            "Designing Intuitive Interactions: Exploring Performance and Reflection Measures.",
            "Conceptual Framework for Evaluating Intuitive Interaction Based on Image Schemas.",
            "Strategies for Intuitive Interaction in Public Urban Spaces.",
            "Motor-Intuitive Interactions Based on Image Schemas: Aligning Touchless Interaction Primitives with Human Sensorimotor Abilities.",
            "Intuitive Learnability of Touch Gestures for Technology-Naïve Older Adults.",
            "What is Intuitive Interaction? Balancing Users' Performance and Satisfaction with Natural User Interfaces.",
            "A Process Model of Empathy For Virtual Agents.",
            "Addressing the Context of Use in Mobile Computing: a Survey on the State of the Practice.",
            "Interactive Audio-haptic Map Explorer on a Tactile Display.",
            "The Effects of Task Difficulty and Multitasking on Performance.",
            "Interacting with Classic Design Engineering.",
            "Show Me or Tell Me: Designing Avatars for Feedback.",
            "Graphical Toolkits for Rapid Prototyping of Multimodal Systems: A Survey.",
            "Applications and Issues for Physiological Computing Systems: An Introduction to the Special Issue.",
            "A New Tool for the Automatic Detection of Muscular Voluntary Contractions in the Analysis of Electromyographic Signals.",
            "Usability of Three Electroencephalogram Headsets for Brain-Computer Interfaces: A Within Subject Comparison.",
            "Investigating Mental Workload Changes in a Long Duration Supervisory Control Task.",
            "Neuro-Fuzzy Physiological Computing to Assess Stress Levels in Virtual Reality Therapy.",
            "Connecting Brains and Bodies: Applying Physiological Computing to Support Social Interaction.",
            "What People Do with Consumption Feedback: A Long-Term Living Lab Study of a Home Energy Management System.",
            "Affect Modeling with Field-based Physiological Responses.",
            "Wizard of Oz Experimentation for Language Technology Applications: Challenges and Tools.",
            "Workload Estimation in Physical Human-Robot Interaction Using Physiological Measurements.",
            "Spotting the Latest Version of a File with Old'nGray.",
            "Idea Garden: Situated Support for Problem Solving by End-User Programmers.",
            "The Impact of Social Presence on Feelings of Closeness in Personal Relationships.",
            "Context-Aware Gestures for Mixed-Initiative Text Editing UIs.",
            "Revisiting Gender Preference for a First-Person Shooter Videogame: Effects of Non-Verbal Sensitivity and Gender on Enjoyment.",
            "A Personalized User Authentication Approach Based on Individual Differences in Information Processing."
        ]
    },
    {
        "name": "IWC",
        "year": "2014",
        "info": "Volume 26: 2014",
        "count": 41,
        "papers": [
            "A Study of Gamer Experience and Virtual World Behaviour.",
            "Playing with Nonverbal Communication: Using Grasp and Facial Direction to Create Adaptive Interaction in a Game.",
            "Designing for Self-Reflection on Values for Improved Life Decision.",
            "Dynamic Anamorphosis as a Special, Computer-Generated User Interface.",
            "Utilizing Mobile Devices' Tactile Feedback for Presenting Braille Characters: An Optimized Approach for Fast Reading and Long Battery Life.",
            "Advanced Social Recommendations with SoNARS++.",
            "User Evaluation of Websites: From First Impression to Recommendation.",
            "Context-Driven Human-Environment Interaction (CdH-E Interaction).",
            "System Implications of Context-Driven Interaction in Smart Environments.",
            "User-Aware Location Management of Prosumed Micro-services.",
            "Speaker Verification for Multi-Task Interactions.",
            "Communication Protocol for Enabling Continuous Monitoring of Elderly People through Near Field Communications.",
            "Development of a Technology Adoption and Usage Prediction Tool for Assistive Technology for People with Dementia.",
            "The Effects of Audio and Haptic Feedback on Collaborative Scanning and Placing.",
            "Citizen Motivation on the Go: The Role of Psychological Empowerment.",
            "Personal Information Management: The Case for an Evolutionary Approach.",
            "Sentence Completion for Understanding Users and Evaluating User Experience.",
            "Automatic Cognitive Load Detection from Face, Physiology, Task Performance and Fusion During Affective Interference.",
            "An fMRI Study to Analyze Neural Correlates of Presence during Virtual Reality Experiences.",
            "Emotion Prediction from Physiological Signals: A Comparison Study Between Visual and Auditory Elicitors.",
            "Guest Editorial.",
            "A Novel Sensor-Based Methodology for Learner's Motivation Analysis in Game-Based Learning.",
            "Note-Taking for 3D Curricular Contents using Markerless Augmented Reality.",
            "A Virtual Experiential Learning and Students' Ill-Structured Problem-Solving Ability.",
            "A Progressive Prompting Approach to Conducting Context-Aware Learning Activities for Natural Science Courses.",
            "Learning with the Body: An Embodiment-Based Learning Strategy Enhances Performance of Comprehending Fundamental Optics.",
            "Empowering Classroom Observation with an E-Book Reading Behavior Monitoring System Using Sensing Technologies.",
            "Hierarchical Menu Selection with a Body-Centered Remote Interface.",
            "Wayfinding without Visual Cues: Evaluation of an Interactive Audio Map System.",
            "Designing for Spontaneous and Secure Delegation in Digital Payments.",
            "Validation of a Framework for Enriching Human-Computer-Human Interaction with Awareness in a Seamless Way.",
            "The Relationship Between Design Factors and Affective Response in Personalized Blog Interfaces.",
            "Branded Interactions: Predicting Perceived Product Traits and User Image from Interface Consistency and Visual Guidance.",
            "Gender, Representation and Online Participation: A Quantitative Study.",
            "An Embodied View of Flow.",
            "Anxiety Induction in Virtual Environments: An Experimental Comparison of Three General Techniques.",
            "Formative Evaluation of IT-based Services: A Case Study of a Meal Planning Service.",
            "Measuring Anxiety Towards Wiki Editing: Investigating the Dimensionality of the Wiki Anxiety Inventory-Editing.",
            "Determining the Efficacy of Multi-Parameter Tactons in the Presence of Real-world and Simulated Audio Distractors.",
            "Evaluation of a Mobile Projector-Based Indoor Navigation Interface.",
            "Online Disclosure of Personally Identifiable Information with Strangers: Effects of Public and Private Sharing."
        ]
    },
    {
        "name": "IWC",
        "year": "2013",
        "info": "Volume 25: 2013",
        "count": 45,
        "papers": [
            "Getting Down to Details: Using Theories of Cognition and Learning to Inform Tangible User Interface Design.",
            "Indoor Human Navigation Systems: A Survey.",
            "Boredom and Distraction in Multiple Unmanned Vehicle Supervisory Control.",
            "The Perceived Hazard of Earcons in Information Technology Exception Messages: The Effect of Musical Dissonance/Consonance and Pitch.",
            "Mediated Cues of Group Emotion during Knowledge-Work Tasks: Effects on Subjective and Physiological Responses.",
            "Predicting and Detecting the Relevant Contextual Information in a Movie-Recommender System.",
            "Effects of Perceived Prototype Fidelity in Usability Testing under Different Conditions of Observer Presence.",
            "An Exploratory Study Examining the Appropriateness and Potential Benefit of the Nintendo Wii as a Physical Activity Tool in Adults Aged ≥ 55 Years.",
            "Special Issue: Organic User Interfaces.",
            "Anthropomorphic Resonances: On the Relationship Between Computer Interfaces and the Human Form and Motion.",
            "The Design of Organic User Interfaces: Shape, Sketching and Hypercontext.",
            "Designing Interactive Paper-Craft Systems with Selective Inductive Power Transmission.",
            "'MoleBot': An Organic User-Interface-Based Robot That Provides Users with Richer Kinetic Interactions.",
            "AmbiKraf Byobu: Merging Technology with Traditional Craft.",
            "Theatre, PlayDoh and Comic Strips: Designing Organic User Interfaces with Young Adolescent and Teenage Participants.",
            "Introduction to the Special Section: The Social Implications of Embedded Systems.",
            "Exploring Interpretations of Data from the Internet of Things in the Home.",
            "Audience Measurement of Digital Signage: Quantitative Study in Real-World Environment Using Computer Vision.",
            "Terms of Agreement: Rethinking Consent for Pervasive Computing.",
            "A Design, Tests and Considerations for Improving Keystroke and Mouse Loggers.",
            "Effect of Interface Dynamism on Learning Procedural Motor Skills.",
            "Introduction to the Special Issue: The Tricky Landscape of Developing Rating Scales in HCI.",
            "GEQ (Game Engagement/Experience Questionnaire): A Review of Two Papers.",
            "Gauging Engagement in Video Games: Does Game Violence Relate to Player Behavior? Report on a Study.",
            "Comments on the Article 'Characterising and Measuring User Experiences in Digital Games' by IJsselsteijn et al. (2007).",
            "The Development of the Game Engagement Questionnaire: A Measure of Engagement in Video Game Playing: Response to Reviews.",
            "The Psychometric Approach to User Satisfaction Measurement.",
            "Critical Review of 'The Intranet Satisfaction Questionnaire: Development and Validation of a Questionnaire to Measure User Satisfaction with the Intranet'.",
            "Comments on Lascu and Clow (2008).",
            "Response to the Reviews on Bargas-Avila et al. (2009) 'Intranet Satisfaction Questionnaire: Development and Validation of a Questionnaire to Measure User Satisfaction with the Intranet'.",
            "Website Interaction Satisfaction: A Reassessment.",
            "A Commentary on Short Questionnaires for Assessing Usability.",
            "Creating a Short Usability Metric for User Experience (UMUX) Scale.",
            "Critical Review of 'The Usability Metric for User Experience'.",
            "A Single-Item Measure of Website Usability: Comments on Christophersen and Konradt (2011).",
            "Response to commentaries on 'The Usability Metric for User Experience'.",
            "Measuring Psychological Constructs Using Single-Item Scales: Answers to Experts' Comments and Additional Questions.",
            "Intuitive Multi-Touch Gestures for Mobile Web Browsers.",
            "Amail: Design and Evaluation of an Accessible Email Tool for Persons with Aphasia.",
            "Working with an Invisible Active User: Understanding Trust in Technology and Co-User from the Perspective of a Passive User.",
            "Shared Input Multimodal Mobile Interfaces: Interaction Modality Effects on Menu Selection in Single-Task and Dual-Task Environments.",
            "Satisficing and the Use of Keyboard Shortcuts: Being Good Enough Is Enough?",
            "Silver Surfers, E-government and the Digital Divide: An Exploratory Study of UK Local Authority Websites and Older Citizens.",
            "The Influence of a Location-Aware Mobile Guide on Museum Visitors' Behavior.",
            "Software Refactoring Process to Accommodate User-Interface Adaptivity in Existing Applications."
        ]
    },
    {
        "name": "IWC",
        "year": "2012",
        "info": "Volume 24: 2012",
        "count": 43,
        "papers": [
            "Wireless Face Interface: Using voluntary gaze direction and facial muscle activations for human-computer interaction.",
            "An interactive 3D movement path manipulation method in an augmented reality environment.",
            "Understanding the most satisfying and unsatisfying user experiences: Emotions, psychological needs, and context.",
            "An experimental study of learner perceptions of the interactivity of web-based instruction.",
            "Querying event sequences by exact match or similarity search: Design and empirical evaluation.",
            "Using think-aloud and psychometrics to explore users' experience with a news Web site.",
            "Interpretation and generation incremental management in natural interaction systems.",
            "Fast and independent access to map directions for people who are blind.",
            "User-friendly locations of error messages in web forms: Put them on the right side of the erroneous input field.",
            "Acting by hand: Informing interaction design for the periphery of people's attention.",
            "Positive mood induction procedures for virtual environments designed for elderly people.",
            "Gender affordances of conversational agents.",
            "A survey of methods for data fusion and system adaptation using autonomic nervous system responses in physiological computing.",
            "Reprint of a process model for developing usable cross-cultural websites.",
            "Andy Smith: In memoriam.",
            "Special issue: Presence and interaction.",
            "Presence and general principles of brain function.",
            "From the body to the tools and back: A general framework for presence in mediated interactions.",
            "Embodiment and telepresence: Toward a comprehensive theoretical framework.",
            "Presence in blended spaces.",
            "Manipulating subjective realism and its impact on presence: Preliminary results on feasibility and neuroanatomical correlates.",
            "Interacting with the Music Paint Machine: Relating the constructs of flow experience and presence.",
            "The effects of egocentric and allocentric representations on presence and perceived realism: Tested in stereoscopic 3D games.",
            "May I experience more presence in doing the same thing in virtual reality than in reality? An answer from a simulated job interview.",
            "Does locality make a difference? Assessing the effectiveness of location-aware narratives.",
            "Age differences in the perception of social presence in the use of 3D virtual world for social interaction.",
            "Video-mediated and co-present gameplay: Effects of mutual gaze on game experience, expressiveness and perceived social presence.",
            "Physiological compliance for social gaming analysis: Cooperative versus competitive play.",
            "Subjective and behavioral presence measurement and interactivity in the collaborative augmented reality game TimeWarp.",
            "The Digital Reading Desk: A lightweight approach to digital note-taking.",
            "User interactions with an affective nutritional coach.",
            "The impact of paper prototyping on card sorting: A case study.",
            "Of organization, device and context: Interruptions from mobile communication in highly specialized care.",
            "SymbolChat: A flexible picture-based communication platform for users with intellectual disabilities.",
            "Shared online spreadsheets and hidden profiles: Technological effects on dyad decision strategy.",
            "Enhancing group awareness on the web: Prototype and experiments of sharing web page visitation information among teammates.",
            "Counting clicks and beeps: Exploring numerosity based haptic and audio PIN entry.",
            "A direct touch table-top display as a multi-user information kiosk: Comparing the usability of a single display groupware either by a single user or people cooperating as a group.",
            "Rating reflection on experience: A case study of teachers' and tutors' reflection around images.",
            "Analytic review of usability evaluation in ISMAR.",
            "Evaluation of the quality of collaboration between the client and the therapist in phobia treatments.",
            "Grading in interaction design education using design practitioners' conceptions of process quality.",
            "Towards building intelligent speech interfaces through the use of more flexible, robust and natural dialogue management solutions."
        ]
    },
    {
        "name": "IWC",
        "year": "2011",
        "info": "Volume 23: 2011",
        "count": 56,
        "papers": [
            "Socio-technical systems: From design methods to systems engineering.",
            "An integrated model of interaction experience for information retrieval in a Web-based encyclopaedia.",
            "Enhancing online forms: Use format specifications for fields with format restrictions to help respondents.",
            "Towards the ubiquitous visualization: Adaptive user-interfaces based on the Semantic Web.",
            "Usability evaluation of voiceprint authentication in automated telephone banking: Sentences versus digits.",
            "Development and application of a framework for comparing early design methods for young children.",
            "\"Moving to the centre\": A gaze-driven remote camera control for teleoperation.",
            "Surfing the web - Recreation or resource? Exploring how young people in the UK use the Internet as an advice portal for problems with a legal dimension.",
            "Caring through technology: Using e-mail for Christian pastoral care.",
            "Exploring the wiki user experience: The effects of training spaces on novice user usability and anxiety towards wiki editing.",
            "Efficient electronic navigation: A metaphorical question?",
            "Automatic web accessibility metrics: Where we are and where we can go.",
            "Visualizing references to off-screen content on mobile devices: A comparison of Arrows, Wedge, and Overview + Detail.",
            "Measuring web usability using item response theory: Principles, features and opportunities.",
            "Selecting users for participation in IT projects: Trading a representative sample for advocates and champions?",
            "The organization of interaction design pattern languages alongside the design process.",
            "Activity recognition using eye-gaze movements and traditional interactions.",
            "Maintaining and modifying pace through tactile and multimodal feedback.",
            "Supporting business process experts in tailoring business processes.",
            "Interpretation of a cross-cultural usability evaluation: A case study based on a hypermedia system for rare species management in Namibia.",
            "Automatic detection of accommodation steps as an indicator of knowledge maturing.",
            "Using and managing multiple passwords: A week to a view.",
            "Evaluation of motion-based interaction for mobile devices: A case study on image browsing.",
            "Identification of the design variables of eLearning tools.",
            "Cognitive Ergonomics for Situated Human-Automation Collaboration.",
            "Hidden roles of the train driver: A challenge for metro automation.",
            "Evaluating the potential of new technological tools for safety critical work.",
            "Distributed collaborative situation-map making for disaster response.",
            "Influences of haptic communication on a shared manual task.",
            "The role of Game Discourse Analysis and curiosity in creating engaging and effective serious games by implementing a back story and foreshadowing.",
            "Designing and assessing everyday objects: Impact of externalisation tools and judges' backgrounds.",
            "Task and user effects on reading patterns in information search.",
            "Too good to be bad: Favorable product expectations boost subjective usability ratings.",
            "Affective responses to system messages in human-computer-interaction: Effects of modality and message type.",
            "IwC Special Issue \"Feminism and HCI: New Perspectives\" Special Issue Editors' Introduction.",
            "Making epistemological trouble: Third-paradigm HCI as successor science.",
            "A theoretical agenda for feminist HCI.",
            "(Un)dressing the interface: Exposing the foundational HCI metaphor \"computer is woman\".",
            "Domestic violence and information communication technologies.",
            "Feminist HCI meets facebook: Performativity and social networking sites.",
            "HCI as heterodoxy: Technologies of identity and the queering of interaction with computers.",
            "Playing stupid, caring for users, and putting on a good show: Feminist acts in usability study work.",
            "Feminism asks the \"Who\" questions in HCI.",
            "Gender pluralism in problem-solving software.",
            "The dilemma of the hedonic - Appreciated, but hard to justify.",
            "UX Curve: A method for evaluating long-term user experience.",
            "DOGeye: Controlling your home with eye interaction.",
            "Where the attention is: Discovery learning in novel tangible environments.",
            "Examining proactiveness and choice in a location-aware mobile museum guide.",
            "Barriers common to mobile and disabled web users.",
            "Everyday use of computer-mediated communication tools and its evolution over time: An ethnographical study with older people.",
            "40 years of searching for the best computer system response time.",
            "Identifying the effectiveness of using three different haptic devices for providing non-visual access to the web.",
            "On designing usable and secure recognition-based graphical authentication mechanisms.",
            "Experiences with professional theatre for awareness raising.",
            "Interaction criticism: An introduction to the practice."
        ]
    },
    {
        "name": "IWC",
        "year": "2010",
        "info": "Volume 22: 2010",
        "count": 53,
        "papers": [
            "Guest Editors' Introduction.",
            "Conceptualizing a possible discipline of human-computer interaction.",
            "Human-computer interaction: A stable discipline, a nascent science, and the growth of the long tail.",
            "Longing for service: Bringing the UCL Conception towards services research.",
            "Diagnosing co-ordination problems in the emergency management response to disasters.",
            "Applying the conception of HCI engineering to the design of economic systems.",
            "Some celebratory HCI reflections on a celebratory HCI festschrift.",
            "The usability inspection performance of work-domain experts: An empirical study.",
            "Interaction between prior knowledge and concept-map structure on hypertext comprehension, coherence of reading orders and disorientation.",
            "Identification of the optimum resolution specification for a haptic graphic display.",
            "Guiding the designer: A radar diagram process for applications with multiple layers.",
            "Spoken Spanish generation from sign language.",
            "Mental models for web objects: Where do users expect to find the most frequent objects in online shops, news portals, and company web pages?",
            "Usable security: User preferences for authentication methods in eBanking and the effects of experience.",
            "Fictional characters in participatory design sessions: Introducing the \"design alter egos\" technique.",
            "A realistic, virtual head for human-computer interaction.",
            "Haptic experience and the design of drawing interfaces.",
            "Enhancing privacy management support in instant messaging.",
            "The effects of virtual characters on audiences' movie experience.",
            "Effects of different scenarios of game difficulty on player immersion.",
            "Guest editor's introduction.",
            "Design and evaluation guidelines for mental health technologies.",
            "Problems people with dementia have with kitchen tasks: The challenge for pervasive computing.",
            "Using a touch screen computer to support relationships between people with dementia and caregivers.",
            "Maintaining reality: Relational agents for antipsychotic medication adherence.",
            "Response to a relational agent by hospital patients with depressive symptoms.",
            "The therapist user interface of a virtual reality exposure therapy system in the treatment of fear of flying.",
            "Modelling user experience - An agenda for research and practice.",
            "The Usability Metric for User Experience.",
            "Measuring the dynamics of remembered experience over time.",
            "More than a feeling: Measurement of sonic user experience and psychophysiology in a first-person shooter game.",
            "The influence of hedonic and utilitarian motivations on user engagement: The case of online shopping experiences.",
            "Needs, affect, and interactive products - Facets of user experience.",
            "The roles of conceptual device models and user goals in avoiding device initialization errors.",
            "Third-party error detection support mechanisms for dictation speech recognition.",
            "Revisiting breadth vs. depth in menu structures for blind users of screen readers.",
            "Visual search in dynamic 3D visualisations of unstructured picture collections.",
            "The impact of progress indicators on task completion.",
            "The effects of trust, security and privacy in social networking: A security-based approach to understand the pattern of adoption.",
            "Inclusion and interaction: Designing interaction for inclusive populations.",
            "Towards analytical evaluation of human machine interfaces developed in the context of smart homes.",
            "Multimodal interaction: A suitable strategy for including older users?",
            "Physical gestures for abstract concepts: Inclusive design with primary metaphors.",
            "Playful persuasion to support older adults' social and physical activities.",
            "It is normal to be different: Applying inclusive design in industry.",
            "Influencing technology adoption by older adults.",
            "Developing a model of cognitive interaction for analytical inclusive design evaluation.",
            "Understanding user preferences based on usability and aesthetics before and after actual use.",
            "Audio makes a difference in haptic collaborative virtual environments.",
            "Using interactive 3-D visualization for public consultation.",
            "Increasing the expressive power of task analysis: Systematic comparison and empirical assessment of tool-supported task models.",
            "User experience to improve the usability of a vision-based interface.",
            "The impact of voice characteristics on user response in an interactive voice response system."
        ]
    },
    {
        "name": "IWC",
        "year": "2009",
        "info": "Volume 21: 2009",
        "count": 43,
        "papers": [
            "Special issue on enactive interfaces.",
            "Toward natural interaction through visual recognition of body gestures in real-time.",
            "On scaling strategies for the full-body postural control of virtual mannequins.",
            "Integrating tactile and force feedback for highly dynamic tasks: Technological, experimental and epistemological aspects.",
            "Tactile sensory substitution: Models for enaction in HCI.",
            "A run-time programmable simulator to enable multi-modal interaction with rigid-body systems.",
            "Physicality and interaction.",
            "What the body knows: Exploring the benefits of embodied metaphors in hybrid physical digital environments.",
            "Designing physical and social intergenerational family entertainment.",
            "Translating experience.",
            "Of pages and paddles: Children's expectations and mistaken interactions with physical-digital tools.",
            "The role of physical artefacts in agile software development: Two complementary perspectives.",
            "Setting the stage - Embodied and spatial dimensions in emerging programming practices.",
            "Between 2: Tango as interactive design.",
            "Fundamentals of physiological computing.",
            "The impact of self-efficacy, ease of use and usefulness on e-purchasing: An analysis of experienced e-shoppers.",
            "Older adults' perceptions and experiences of online social support.",
            "Augmenting paper-based learning with mobile phones.",
            "The motivational and control structure underlying the acceptance of adaptive museum guides - An empirical study.",
            "A survey of sketch-based 3-D modeling techniques.",
            "Cultural cognition in usability evaluation.",
            "Incorporating user motivations to design for video tagging.",
            "Look-ahead and look-behind shortcuts in large item category hierarchies: The impact on search performance.",
            "Technology for supporting web information search and learning in Sign Language.",
            "Error prevention in online forms: Use color instead of asterisks to mark required-fields.",
            "A framework for evaluating the usability of mobile phones based on multi-level, hierarchical model of usability factors.",
            "Reducing working memory load in spoken dialogue systems.",
            "UbiCicero: A location-aware, multi-device museum guide.",
            "An integrative approach to requirements analysis: How task models support requirements reuse in a user-centric design framework.",
            "Private whispers/public eyes: Is receiving highly personal information in a public place stressful?",
            "In Memoriam Brian Shackel 1927-2007.",
            "Designing for people in the age of information.",
            "Back to the future: A retrospective on early predictions.",
            "Telescreens, keypens, and the expert: A 60 year snapshot.",
            "Usability - Context, framework, definition, design and evaluation.",
            "A test-first view of usability.",
            "Early traces of usability as a science and as a profession.",
            "Human-computer interaction - Whence and whither?",
            "Inventing HCI: The grandfather of the field.",
            "Brian Shackel's contribution to the written history of Human-Computer Interaction.",
            "Brian Shackel (1927-2007).",
            "Understanding factors affecting trust in and satisfaction with mobile banking in Korea: A modified DeLone and McLean's model perspective.",
            "Using the Internet: Skill related problems in users' online behavior."
        ]
    },
    {
        "name": "IWC",
        "year": "2008",
        "info": "Volume 20: 2008",
        "count": 52,
        "papers": [
            "Motivations in personalisation behaviour.",
            "EmoPlayer: A media player for video clips with affective annotations.",
            "Customization of Web applications through an intelligent environment exploiting logical interface descriptions.",
            "Tracing impact in a usability improvement process.",
            "Pedagogy and usability in interactive algorithm visualizations: Designing and evaluating CIspace.",
            "Animated demonstrations and training wheels interfaces in a complex learning environment.",
            "A language-driven approach for the design of interactive applications.",
            "Projected Cognition - extending Distributed Cognition for the study of human interaction with computers.",
            "A socio-cognitive analysis of online design discussions in an Open Source Software community.",
            "Simple pen interaction performance of young and older adults using handheld computers.",
            "Collaborative use of individual search histories.",
            "Building up usability-engineering capability by improving access to automated usability evaluation.",
            "Explaining B2C e-commerce acceptance: An integrative model based on the framework by Gatignon and Robertson.",
            "Psychological responses to simulated displays of mismatched emotional expressions.",
            "West meets East: Adapting Activity Theory for HCI & CSCW applications?",
            "57 Varieties of Activity Theory.",
            "\"Working sphere/engagement\" and the concept of task in activity theory.",
            "Enriching activity theory without shortcuts.",
            "Reactionary reactions to altering activity theory.",
            "Missing links in the rhetoric of Activity Theory.",
            "Understanding work units and activities - A perspective from general psychsology.",
            "Working spheres or engagements: Implications for designing?",
            "Special issue on the abuse and misuse of social agents.",
            "When sex, drugs, and violence enter the classroom: Conversations between adolescents and a female pedagogical agent.",
            "I hate you! Disinhibition with virtual partners.",
            "\"She is just stupid\" - Analyzing user-agent interactions in emotional game situations.",
            "Sometimes it's hard to be a robot: A call for action on the ethics of abusing artificial agents.",
            "Response to \"Sometimes it's hard to be a robot: A call for action on the ethics of abusing artificial agents\".",
            "Robot ethics? Not yet: A reflection on Whitby's \"Sometimes it's hard to be a robot\".",
            "Humour, Relationship Maintenance and Personality Matching in automated dialogue: A controlled study.",
            "Did you feel something? Distracter tasks and the recognition of vibrotactile cues.",
            "Using multiple data sources to get closer insights into user cost and task performance.",
            "Software development methods and usability: Perspectives from a survey in the software industry in Norway.",
            "Non-visual game design and training in gameplay skill acquisition - A puzzle game case study.",
            "User errors on scanning keyboards: Empirical study, model and design principles.",
            "Modelling user experience with web sites: Usability, hedonic value, beauty and goodness.",
            "Understanding purchasing behaviors in a virtual economy: Consumer behavior involving virtual currency in Web 2.0 communities.",
            "Being-with: A study of familiarity.",
            "The role of stereopsis in virtual anatomical learning.",
            "A model of user adoption of interface agents for email notification.",
            "How motivational orientation influences the evaluation and choice of hedonic and pragmatic interactive products: The role of regulatory focus.",
            "Generating multimodal user interfaces for Web services.",
            "Effects of visual cues and sustained attention on spatial presence in virtual environments based on spatial and object distinction.",
            "Most Cited Paper Award.",
            "Inside Front Cover - Editorial Board.",
            "Comparison of techniques for matching of usability problem descriptions.",
            "TAM-based success modeling in ERP.",
            "A web-based programming learning environment to support cognitive development.",
            "Automated semantic elaboration of web site information architecture.",
            "The use of modality in the design of verbal aids in computer-based learning environments.",
            "Extending drag-and-drop to new interactive environments: A multi-display, multi-instrument and multi-user approach.",
            "Designing new technologies for illiterate populations: A study in mobile phone interface design."
        ]
    },
    {
        "name": "IWC",
        "year": "2007",
        "info": "Volume 19: 2007",
        "count": 50,
        "papers": [
            "Moving face-to-face communication to Web-based systems.",
            "Consumers, channels and communication: Online and offline communication in service consumption.",
            "Intentional and unintentional consequences of substituting face-to-face interaction with e-mail: An employee-based perspective.",
            "Health Websites that people can trust - the case of hypertension.",
            "The role of social presence in establishing loyalty in e-Service environments.",
            "A study of the usability of handwriting recognition for text entry by children.",
            "Disrupting digital library development with scenario informed design.",
            "Evaluating the effectiveness of customers' communication experiences with online retailers - A study of e-mortgages.",
            "Exploring virtual team-working effectiveness in the construction sector.",
            "Cursor type and response conflict in graphical user interfaces.",
            "Haptic recognition of shapes at different scales: A comparison of two methods of interaction.",
            "Corrigendum to \"Desktop virtual environments: a study of navigation and age\" [Interacting with Computers 16 (2004) 939-956].",
            "HCI issues in computer games.",
            "Bimanual text entry using game controllers: Relying on users' spatial familiarity with QWERTY.",
            "High-resolution gaming: Interfaces, notifications, and the user experience.",
            "A model of cognitive loads in massively multiplayer online role playing games.",
            "Video game values: Human-computer interaction and games.",
            "Design and evaluation of a tactile memory game for visually impaired children.",
            "Applying simulation experience design methods to creating serious game-based adaptive training systems.",
            "An HCI method to improve the human performance reduced by local-lag mechanism.",
            "Heuristic evaluation: Comparing ways of finding and reporting usability problems.",
            "Functionality and usability in design for eStatements in eBanking services.",
            "Drag-and-drop errors in young children's use of the mouse.",
            "Realism is not all! User engagement with task-related interface characters.",
            "Eye movements as indices for the utility of life-like interface agents: A pilot study.",
            "Are interface agents scapegoats? Attributions of responsibility in human-agent interaction.",
            "Usefulness of VRML building models in a direction finding context.",
            "TAPRAV: An interactive analysis tool for exploring workload aligned to models of task execution.",
            "Usable error message presentation in the World Wide Web: Do not show errors right away.",
            "Towards an empirical method of efficiency testing of system parts: A methodological study.",
            "Implicit measures of lostness and success in web navigation.",
            "An experimental study on the role of graphical information about hand movement when interacting with objects in virtual reality environments.",
            "Introducing task-based general computer self-efficacy: An empirical comparison of three general self-efficacy instruments.",
            "Going online for health advice: Changes in usage and trust practices over the last five years.",
            "User performance with trackball-mice.",
            "To do or not to do: Differences in user experience and retrospective judgments depending on the presence or absence of instrumental goals.",
            "Dependable domestic systems design: A socio-technical approach.",
            "Lightweight techniques for structural evaluation of animated metaphors.",
            "User acceptance of mobile Internet: Implication for convergence technologies.",
            "The effects of speech-gesture cooperation in animated agents' behavior in multimedia presentations.",
            "Evaluating a cross-cultural children's online book community: Lessons learned for sociability, usability, and cultural exchange.",
            "Looking at human-computer interface design: Effects of ethnicity in computer agents.",
            "Semi-automatic photo annotation strategies using event based clustering and clothing based person recognition.",
            "Computers in talk-based mental health interventions.",
            "Providing end-user facilities to simplify ontology-driven web application authoring.",
            "The efficacy of narrative video for raising awareness in ICT designers about older users' requirements.",
            "Towards useful and usable interaction design tools: CanonSketch.",
            "The effects of visual metaphor and cognitive style for mental modeling in a hypermedia-based environment.",
            "Visualizing set concordance with permutation matrices and fan diagrams.",
            "Corrigendum to \"Exploring the design space of robots: Children's perspectives\" [Interacting with Computers 18 (2006) 1390-1418]."
        ]
    },
    {
        "name": "IWC",
        "year": "2006",
        "info": "Volume 18: 2006",
        "count": 65,
        "papers": [
            "Collaborative design: Managing task interdependencies and multiple perspectives.",
            "Awareness and teamwork in computer-supported collaborations.",
            "User Needs Analysis and requirements engineering: Theory and practice.",
            "Inclusive development: Software engineering requirements for universally accessible interactions.",
            "Tasks for and tasks in human-computer interaction.",
            "Emotion representation and physiology assignments in digital systems.",
            "Continuous electronic data capture of physiology, behavior and experience in real life: towards ecological momentary assessment of emotion.",
            "Severity and impact of computer user frustration: A comparison of student and workplace users.",
            "Real-time estimation of emotional experiences from facial expressions.",
            "Empathic agents to reduce user frustration: The effects of varying agent characteristics.",
            "Levels of automation and user participation in usability testing.",
            "Signposts on the digital highway: The effect of semantic and pragmatic hyperlink previews.",
            "Device-independent web browsing based on CC/PP and annotation.",
            "Systematic evaluation methodology for cell phone user interfaces.",
            "Human factors in personalised systems and services.",
            "A web-based tutoring system with styles-matching strategy for spatial geometric transformation.",
            "Designing learner-controlled educational interactions based on learning/cognitive style and learner behaviour.",
            "Adapting to intelligence profile in an adaptive educational system.",
            "Improving the prediction accuracy of recommendation algorithms: Approaches anchored on human factors.",
            "Goal-based structuring in recommender systems.",
            "Personalising web page presentation for older people.",
            "Adapting the interaction in a call centre system.",
            "Metrics for evaluating human information interaction systems.",
            "A computer support tool for the early stages of architectural design.",
            "When humans need humans: The lack of use of computer-based ICT in distance pastoral care.",
            "Usability professionals - current practices and future development.",
            "The lonesome cowboy: A study of the usability designer role in systems development.",
            "'Representing the User' in software development - a cultural analysis of usability work in the product development context.",
            "Evaluating and implementing a collaborative office document system.",
            "An interactive computer graphics interface for the introduction of fuzzy inference in environmental education.",
            "On integration of interface design methods: Can debates be resolved?",
            "Towards optimal navigation through video content on interactive TV.",
            "A method for conflict detection based on team intention inference.",
            "The effects of metaphors on novice and expert learners' performance and mental-model development.",
            "Clover: Connecting technology and character education using personally-constructed animated vignettes.",
            "Towards culture-centred design.",
            "An overview of auditory display to assist comprehension of molecular information.",
            "Flexible tool support for accessibility evaluation.",
            "When humans form media and media form humans: An experimental study examining the effects different digital media have on the learning outcomes of students who have different learning styles.",
            "An approach integrating two complementary model-based environments for the construction of multimodal interactive applications.",
            "The emerging roles of performance within HCI and interaction design.",
            "Gaining insight into unfamiliar contexts: A design toolbox as input for using role-play techniques.",
            "Interacting with user data - Theory and examples of drama and dramaturgy as methods of exploration and evaluation in user-centered design.",
            "The use of theatre in requirements gathering and usability studies.",
            "Designing for programming as joint performances among groups of children.",
            "Guiding design with approaches to masked performance.",
            "The influence of hedonic quality on the attractiveness of user interfaces of business management software.",
            "The need for transparency and rationale in automated systems.",
            "Modeling users' task performance on the mobile device: PC convergence system.",
            "Usability evaluation of multi-modal biometric verification systems.",
            "Optimizing conditions for computer-assisted anatomical learning.",
            "Pastiche scenarios: Fiction as a resource for user centred design.",
            "Special issue of interacting with computers: Symbiotic performance between humans and intelligent systems.",
            "Agent coordination and communication in sociotechnological systems: Design and measurement issues.",
            "Evaluation metrics and methodologies for user-centered evaluation of intelligent systems.",
            "Toward a real-time model-based training system.",
            "Small-vocabulary speech recognition using surface electromyography.",
            "When the chips are down: Social and technical aspects of computer failure and repair.",
            "Interacting with parallel coordinates.",
            "Exploring 'Canned Communication' for coordinating distributed mobile work activities.",
            "Conceptual models of software artifacts.",
            "Homepage aesthetics: The search for preference factors and the challenges of subjectivity.",
            "Cross-cultural differences in recognizing affect from body posture.",
            "Exploring the design space of robots: Children's perspectives.",
            "Intentional processing as a key for rational behaviour through Natural Interaction."
        ]
    },
    {
        "name": "IWC",
        "year": "2005",
        "info": "Volume 17: 2005",
        "count": 38,
        "papers": [
            "Designing for civil society.",
            "Participating in civil society: the case of networked communities.",
            "Net neighbours: adapting HCI methods to cross the digital divide.",
            "Fairtrade.com versus Fairtrade.org - how Fairtrade organisations use the Internet.",
            "Online design for bilingual civil society: a Welsh perspective.",
            "Programming for cognitive justice: Towards an ethical framework for democratic code.",
            "Chinese character entry for mobile phones: a longitudinal investigation.",
            "Participatory design with train drivers - a process analysis.",
            "When fingers do the talking: a study of text messaging.",
            "Findex: improving search result use through automatic filtering categories.",
            "Modelling form-based interfaces with bipartite state machines.",
            "In search of effective text input interfaces for off the desktop computing.",
            "Using handhelds for wireless remote control of PCs and appliances.",
            "How productivity improves in hands-free continuous dictation tasks: lessons learned from a longitudinal study.",
            "Model-based tools for pervasive usability.",
            "Semiotic engineering: bringing designers and users together at interaction time.",
            "Mobile agents for mobile tourists: a user evaluation of Gulliver's Genie.",
            "The long-term effects of integral versus composite metaphors on experts' and novices' search behaviors.",
            "Will it be a capital letter: signalling case mode in mobile phones.",
            "Designing interfaces that support formation of cognitive maps of transitional processes: an empirical study.",
            "Text formats and web design for visually impaired and dyslexic readers - Clear Text for All.",
            "The social implications of emerging technologies.",
            "Moving towards inclusive design guidelines for socially and ethically aware HCI.",
            "Sharing experiences through awareness systems in the home.",
            "Assessing the effects of building social intelligence in a robotic interface for the home.",
            "Rendezvousing with location-aware devices: Enhancing social coordination.",
            "A system of agent-based software patterns for user modeling based on usage mining.",
            "Better discount evaluation: illustrating how critical parameters support heuristic creation.",
            "HCI and the older population.",
            "Introducing the Internet to the over-60s: Developing an email system for older novice computer users.",
            "The design of next generation in-vehicle navigation systems for the older driver.",
            "Successful strategies of older people for finding information.",
            "Socially dependable design: The challenge of ageing populations for HCI.",
            "Age differences in trust and reliance of a medication management system.",
            "'It's just like you talk to a friend' relational agents for older adults.",
            "Writing with speech recognition: The adaptation process of professional writers with and without dictating experience.",
            "Cross-user analysis: Benefits of skill level comparison in usability testing.",
            "Affordance as context."
        ]
    },
    {
        "name": "IWC",
        "year": "2004",
        "info": "Volume 16: 2004",
        "count": 60,
        "papers": [
            "Global human-computer systems: cultural determinants of usability.",
            "The impact of religious affiliation on trust in the context of electronic commerce.",
            "Introducing ATMs in India: a contextual inquiry.",
            "Chinese culture and e-commerce: an exploratory study.",
            "A process model for developing usable cross-cultural websites.",
            "Integrated digital communities: combining web-based interaction with text messaging to develop a system for encouraging group communication and competition.",
            "Personalised adult e-training on computer use based on multiple attribute decision making.",
            "Coupling structural and functional models for interaction design.",
            "Developing web annotation tools for learners and instructors.",
            "Evaluation of multimedia applications using inspection methods: the Cognitive Walkthrough case.",
            "Task demands and memory in web interaction: a levels of processing approach.",
            "Unified user interface design: designing universally accessible interactions.",
            "Tailoring reveals information requirements: the case of anaesthesia alarms.",
            "The effects of affective interventions in human-computer interaction.",
            "Preferences of young children regarding interface layouts in child community web sites.",
            "Interaction patterns for future interactive systems components.",
            "Critical factors for the aesthetic fidelity of web pages: empirical studies with professional web designers and users.",
            "What active users and designers contribute in the design process.",
            "Universal usability revisited.",
            "Successful and available: interface design exemplars for older users.",
            "Capturing tacit knowledge from young girls.",
            "A system for automatic structure discovery and reasoning-based navigation of the web.",
            "Abstract representations as a basis for usable user interfaces.",
            "Applying heuristics to accessibility inspections.",
            "Justification of the need for an ontology for accessibility requirements (Theoretic framework).",
            "Understanding visual influence in graph design through temporal and spatial eye movement characteristics.",
            "A framework for analyzing and understanding online communities.",
            "Human-computer interaction in Latin America.",
            "A dialogue-based approach for evaluating educational software.",
            "Compulsory institutionalization: investigating the paradox of computer-supported informal social processes.",
            "Study and analysis of workspace awareness in CDebate: a groupware application for collaborative debates.",
            "Doing to Be: Multiple Routes to Affective Interaction.",
            "The bug in the salad: the uses of emotions in computer interfaces.",
            "From doing to being: getting closer to the user experience.",
            "Affective computing: problems, reactions and intentions.",
            "Affective computing in the era of contemporary neurophysiology and health informatics.",
            "Adventurers versus nit-pickers on affective computing.",
            "Designing to persuade: the use of emotion in networked media.",
            "Pressing the right buttons: taking the viewer there.",
            "Tools over solutions? Comments on Interacting with Computers special issue on affective computing.",
            "Multiple paradigms in affective computing.",
            "Individual differences and task-based user interface evaluation: a case study of pending tasks in email.",
            "Four approaches to user modelling - a qualitative research interview study of HCI professionals' practice.",
            "Heuristic evaluation of virtual reality applications.",
            "The emergence of physiological computing.",
            "A research agenda for physiological computing.",
            "An analysis of facial movement tracking in ordinary human-computer interaction.",
            "On physiological computing with an application in interactive art.",
            "A platform for wearable physiological computing.",
            "Desktop virtual environments: a study of navigation and age.",
            "Investigating actability dimensions: a language/action perspective on criteria for information systems evaluation.",
            "An experimental study on the role of software synthesized 3D sound in augmented reality environments.",
            "My password is here! An investigation into visuo-spatial authentication mechanisms.",
            "An experimental study on the role of 3D sound in augmented reality environment.",
            "Audio channel constraints in video-mediated communication.",
            "Evaluating the user-centredness of development organisations: conclusions and implications from empirical usability capability maturity assessments.",
            "Collaborating around vertical and horizontal large interactive displays: which way is best?",
            "Employing think-aloud protocols and constructive interaction to test the usability of online library catalogues: a methodological comparison.",
            "Immediate usability: a case study of public access design for a community photo library.",
            "Effective attention allocation behavior and its measurement: a preliminary study."
        ]
    },
    {
        "name": "IWC",
        "year": "2003",
        "info": "Volume 15: 2003",
        "count": 44,
        "papers": [
            "Intelligence and interaction in community-based systems (Part 2).",
            "Agent mediated retailing in the connected local community.",
            "Multi-agent systems support for Community-Based Learning.",
            "Using conversational agents to support the adoption of knowledge sharing practices.",
            "Adding cultural signposts in adaptive community-based virtual environments.",
            "Designing interactive interfaces: theoretical consideration of the complexity of standards and guidelines, and the difference between evolving and formalised systems.",
            "The effects of movement of attractors and pictorial content of rewards on users' behaviour in virtual environments: an empirical study in the framework of perceptual opportunities.",
            "Interaction design and children.",
            "The International Children's Digital Library: viewing digital books online.",
            "Using 'tangibles' to promote novel forms of playful learning.",
            "KidReporter: a user requirements gathering technique for designing with children.",
            "Using peer tutoring in evaluating the usability of a physically interactive computer game with children.",
            "On the assessment of usability testing methods for children.",
            "Symbiosis and synergy? scenarios, task analysis and reuse of HCI knowledge.",
            "Exploring the potential of unobtrusive proactive task support.",
            "A Unifying Reference Framework for multi-target user interfaces.",
            "A tool-supported design framework for safety critical interactive systems.",
            "Runtime transformations for modal independent user interface migration.",
            "A unified method for designing interactive systems adaptable to mobile and stationary platforms.",
            "Implementation of automated interaction design with collaborative models.",
            "Hidden messages: evaluating the efficiency of code elision in program navigation.",
            "What was I looking for? The influence of task specificity and prior knowledge on students' search strategies in hypertext.",
            "What is this evasive beast we call user satisfaction?.",
            "Integrating work environment considerations into usability evaluation methods - the ADA approach.",
            "Understanding interaction with mobile devices.",
            "Improving web search on small screen devices.",
            "ASUR++: Supporting the design of mobile mixed systems.",
            "Adapting applications in handheld devices using fuzzy context information.",
            "Towards an improved readability on mobile devices: evaluating adaptive rapid serial visual presentation.",
            "Personal location agent for communicating entities (PLACE).",
            "Investigating the usability of assistive user interfaces.",
            "Comparing mouse and steady-state visual evoked response-based control.",
            "Why usability gets lost or usability in in-house software development.",
            "From artefact to instrument.",
            "Appropriating artifacts as instruments: when design-for-use meets design-in-use.",
            "From computer to instrument system: a developmental perspective.",
            "Information technology artefacts as structuring devices in organizations: design, appropriation and use issues.",
            "Design as a mutual learning process between users and designers.",
            "Editorial.",
            "Collaborating with writing tools: An instrumental perspective on the problem of computer-supported collaborative activities.",
            "Appropriating the use of a Moo for collaborative learning.",
            "From artifact to instrument: mathematics teaching mediated by symbolic calculators.",
            "Mediating effects of active and distributed instruments on narrative activities.",
            "Learning with artefacts: integrating technologies into activities."
        ]
    },
    {
        "name": "IWC",
        "year": "2001",
        "info": "Volume 14: 2001/2002",
        "count": 43,
        "papers": [
            "A web of contradictions.",
            "Perceived disorientation: an examination of a new measure to assess web design effectiveness.",
            "Teallach: a model-based user interface development environment for object databases.",
            "Linking tasks, dialogue and GUI design: a method involving UML and Lean Cuisine+.",
            "From doing to being: bringing emotion into interaction (Editorial).",
            "Frustrating the user on purpose: a step toward building an affective computer.",
            "This computer responds to user frustration: Theory, design, and results.",
            "Computers that recognise and respond to user emotion: theoretical and practical implications.",
            "Guest Editors' Introduction.",
            "Developing adaptable user interfaces for component-based systems.",
            "The stretchable selection tool: an alternative to copy and paste.",
            "Which animation effects improve indirect manipulation?",
            "Visual gesture interfaces for virtual environments.",
            "Supporting special-purpose health care models via adaptive interfaces to the web.",
            "Universal usability.",
            "Developing a practical inclusive interface design approach.",
            "E-graffiti: evaluating real-world use of a context-aware system.",
            "Auditing accessibility of UK Higher Education web sites.",
            "Intelligent speech for information systems: towards biliteracy and trilingualism.",
            "Yes/No or Maybe - further evaluation of an interface for brain-injured individuals.",
            "Head-operated computer controls: effect of control method on performance for subjects with and without disability.",
            "Scenarios and task analysis.",
            "Scenarios and the HCI-SE design problem.",
            "Data entry for mobile devices: an empirical comparison of novice performance with Jot and Graffiti.",
            "Using music to communicate computing information.",
            "Musical program auralisation: a structured approach to motif design.",
            "Users' schemata of hypermedia: what is so 'spatial' about a website?",
            "A longitudinal study of attitude changes in a medical service organisation after an email introduction.",
            "Testing dialogue systems by means of automatic generation of conversations.",
            "A grounded theory approach to modelling learnability of hypermedia authoring tools.",
            "Trust in information sources: seeking information from people, documents, and virtual agents.",
            "Web navigation and the behavioral effects of constantly visible site maps.",
            "Making use is more than a matter of task analysis.",
            "Task scenarios and thought.",
            "Intelligence and interaction in community-based systems.",
            "Exquisite variety: computer as mirror to community.",
            "Living memory: agent-based information management for connected local communities.",
            "Design and deployment of community systems: reflections on the Campiello experience.",
            "Conference assistant system for supporting knowledge sharing in academic communities.",
            "Effectiveness of spatial representation in the formation of network communities: experimental study on community organizer.",
            "Discovering user communities on the Internet using unsupervised machine learning techniques.",
            "When bugs sing.",
            "Prototype evaluation and redesign: structuring the design space through contextual techniques."
        ]
    },
    {
        "name": "IWC",
        "year": "2000",
        "info": "Volume 13: 2000/2001",
        "count": 36,
        "papers": [
            "Lost in hyperspace: metrics and mental models.",
            "Introduction to this Special Issue on \"Scenario-Based System Development\".",
            "Five reasons for scenario-based design.",
            "Scenarios in user-centred designsetting the stage for reflection and action.",
            "Improving reviews of conceptual models by extended traceability to captured system usage.",
            "Linking soft systems and use-case modelling through scenarios.",
            "Applying and testing an approach to design for culturally diverse user groups.",
            "What is beautiful is usable.",
            "Effective information visualisation: a study of graph drawing aesthetics and algorithms.",
            "World Wide Web working whilst ignoring graphics: good news for web page designers.",
            "The effects of sound and colour on responses to a computer game.",
            "Surveying the scene: technologies for everyday awareness and monitoring in control rooms.",
            "RemUSINE: a bridge between empirical and model-based evaluation when evaluators and users are distant.",
            "Electronic mail versus printed text: the effects on recipients.",
            "Exploration environments: supporting users to learn groupware functions.",
            "A framework for engineering metaphor at the user interface.",
            "Interfaces for the Active Web.",
            "Beyond the interface: users' perceptions of interaction and audience on websites.",
            "Supporting educational activities through dynamic web interfaces.",
            "Navigating the World Wide Web: bookmark maintenance architectures.",
            "Multi-authoring virtual worlds via the World Wide Web.",
            "Comparing two spreadsheet calculation paradigms: an empirical study with novice users.",
            "Time and representational devices in Rapid Application Development.",
            "Semiotic engineering principles for evaluating end-user programming environments.",
            "Human-computer interface design issues for a multi-cultural and multi-lingual English speaking country Botswana.",
            "The effects of frame layout and differential background contrast on visual search performance in Web pages.",
            "A student centered methodology for the development of a physics video based laboratory.",
            "The mediating effects of intrinsic motivation, ease of use and usefulness perceptions on performance in first-time and subsequent computer users.",
            "A linguistic approach to user interface design.",
            "N-fingers: a finger-based interaction technique for wearable computers.",
            "Interfaces for the Active Web (Part 2).",
            "Automatic generation of instructional hypermedia with APHID.",
            "Supporting interactive collaboration on the Web with CORK.",
            "Designing a document-centric coordination application over the Internet.",
            "Creating user-adapted Websites by the use of collaborative filtering.",
            "Interactivity and collaboration on the WWW is the 'WWW shell' sufficient?"
        ]
    },
    {
        "name": "IWC",
        "year": "1999",
        "info": "Volume 12: 1999/2000",
        "count": 34,
        "papers": [
            "Designing multimedia for human needs and capabilities.",
            "The influence of structure and reading-manipulation on usability of hypertexts.",
            "The validity of rational criteria for the interpretation of user-hypertext interaction.",
            "Multimedia systems in distance education: effects of usability on learning.",
            "Bringing the internet to the community.",
            "Empathic communities: balancing emotional and factual communication.",
            "Development milestones towards a tool for working with guidelines.",
            "User interface guidelines and standards: progress, issues, and prospects.",
            "A taxonomy of design guidance for hypermedia design.",
            "Automatic cross-referencing of HCI guidelines by statistical methods.",
            "Incorporating standards and guidelines in an approach that balances usability concerns for developers and end users.",
            "Formalization and proof of design guidelines within the scope of testing formally specified electronic product catalogues.",
            "A methodology and tools for applying context-specific usability guidelines to interface design.",
            "A model based approach to semi-automated user interface generation for process control interactive applications.",
            "Integrated support for working with guidelines: the Sherlock guideline management system.",
            "Special issue on intelligent interface technology: editor's introduction.",
            "Intelligent interface technology: from theory to reality?",
            "Vanishing Windows - a technique for adaptive window management.",
            "Assistant agents for the world wide web intelligent interface design challenges.",
            "Encapsulating intelligent interactive behaviour in unified user interface artefacts.",
            "Steps to take before intelligent user interfaces become real.",
            "Information technology acceptance in a sample of government employees: a test of the technology acceptance model.",
            "Distributed visual reasoning for intelligent information retrieval on the Web.",
            "Side effects of decision guidance in decision support systems.",
            "Design and evaluation of the alignment stick.",
            "Possible implications of aging for interface designers.",
            "Intelligent graphical user interface design utilizing multiple fuzzy agents.",
            "Intelligent interfaces through interactive planners.",
            "An analysis of errors in interactive proof attempts.",
            "Communication with users: insights from second language acquisition.",
            "How to replace an old email system with a new.",
            "Gathering accurate client information from World Wide Web sites.",
            "Why don't telephones have off switches? Understanding the use of everyday technologies.",
            "The effects of simulating human conversational style in a computer-based interview."
        ]
    },
    {
        "name": "IWC",
        "year": "1998",
        "info": "Volume 11: 1998/1999",
        "count": 35,
        "papers": [
            "Introduction to the Special Issue on Temporal Aspects of Usability.",
            "Interaction in the large.",
            "Designing a real-time telepathology workstation to mitigate communication delays.",
            "Representing the impact of time on human error and systems failure.",
            "Temporal aspects of interaction in shared virtual worlds.",
            "Integrating natural language generation and hypertext to produce dynamic documents.",
            "The Attribute Explorer: information synthesis via exploration.",
            "The effect of interaction style and training method on end user learning of software packages.",
            "The HOMER UIMS for dual user interface development: Fusing visual and non-visual interactions.",
            "The design of sonically-enhanced widgets.",
            "Wanted: psychologically relevant, device- and event-independent work analysis techniques.",
            "A comparison of the comprehension of object-oriented and procedural programs by novice programmers.",
            "A performance comparison of two handwriting recognizers.",
            "The ergonomic criteria and the ISO/DIS 9241-10 dialogue principles: a pilot comparison in an evaluation task.",
            "Managing the use of style guides in an organisational setting: practical lessons in ensuring UI consistency.",
            "Supporting the group creation of formal and informal graphics during business process modeling.",
            "Virtual reality: an overview of User-related Design Issues.",
            "CLIMATE: A framework for developing holistic requirements analysis in Virtual Environments.",
            "Interacting with virtual environments: an evaluation of a model of interaction.",
            "Physicians in virtual environments multimodal human-computer interaction.",
            "Learning through virtual reality: a preliminary investigation.",
            "Usability and Educational Software Design: Special Issue of Interacting with Computers.",
            "Predicting quality in educational software: Evaluating For Learning, Usability and the Synergy between Them.",
            "Learning technology and usability: a framework for understanding courseware.",
            "Contexts for evaluating educational software.",
            "Why human error modeling has failed to help systems development.",
            "A case study of a human error in a dynamic environment.",
            "Automatic reasoning and help about human errors in using an operating system.",
            "Toward a model of unreliability to study error prevention supports.",
            "A study of incidents involving programmable electronic safety-related systems.",
            "A classification and analysis of erroneous actions in computer supported co-operative work environment.",
            "Work process analysis: a necessary step in the development of decision support systems. An aviation safety case study.",
            "A co-operative scenario based approach to acquisition and validation of system requirements: How exceptions can help!",
            "Human factors in requirements engineering: A survey of human sciences literature relevant to the improvement of dependable systems development processes.",
            "Human error and information systems failure: the case of the London ambulance service computer-aided despatch system project."
        ]
    },
    {
        "name": "IWC",
        "year": "1998",
        "info": "Volume 10: 1998",
        "count": 23,
        "papers": [
            "Designing towards emotional usability in customer interfaces trustworthiness of cyber-banking system interfaces.",
            "About the importance of auditory alarms during the operation of a plant simulator.",
            "MobiCom: networking dispersed groups.",
            "Subjectivity and Notions of Time and Value in Interactive Information Retrieval.",
            "A psychological investigation of long retrieval times on the World Wide Web.",
            "Designing for delay in interactive information retrieval.",
            "Generalised similarity analysis and pathfinder network scaling.",
            "Navigation in hyperspace: An evaluation of the effects of navigational tools and subject matter expertise on browsing and information retrieval in hypertext.",
            "A flexible hypertext courseware on the Web based on a dynamic link structure.",
            "Genres in support of collaborative information retrieval in the virtual library.",
            "Designing interfaces to support collaboration in information retrieval.",
            "Providing a networked future for interpersonal information retrieval: InfoVine and user modelling.",
            "Information rendezvous.",
            "Exploring the layers of information retrieval evaluation.",
            "Interactive searching and interface issues in the Okapi best match probabilistic retrieval system.",
            "Human-computer interaction in information retrieval: nature and manifestations of feedback.",
            "Evaluation of information-seeking performance in hypermedia digital libraries.",
            "Modelling information seeking.",
            "How many relevances in information retrieval?",
            "Towards a cognitive theory of information retrieval.",
            "How did university departments interweave the Web: A study of connectivity and underlying factors.",
            "The effects of password length and reference profile size on the performance of a multivariate text-dependent typist verification system.",
            "The beta test of an electronic supermarket."
        ]
    },
    {
        "name": "IWC",
        "year": "1997",
        "info": "Volume 9: 1997/1998",
        "count": 25,
        "papers": [
            "Multimodal messages: the pen and voice opportunity.",
            "The computer science education crisis: fact or illusion?",
            "Assessing the cognitive consequences of the object-oriented approach: A survey of empirical research on object-oriented.",
            "Supporting user-adapted interface design: The USE-IT system.",
            "Editorial Formality, Its Role in Bridging the Communication Gap between Humans and Computers.",
            "Human-Formalism Interaction: Studies in Communication through Formalism.",
            "Synergistic Modelling of Tasks, Users and Systems using Formal Specification Techniques.",
            "Using the Template Model to Analyse Directory Visualisation.",
            "Formal Reasoning about Dialogue Properties with Automatic Support.",
            "Composition and Synthesis with a Formal Interactor Model.",
            "Integrating Information - A Task-Orientated Approach.",
            "Moneypenny: Lessons from the Messy Desk.",
            "Editorial: Shared Values and Shared Interfaces: The Role of Culture in the Globalisation of Human-Computer Systems.",
            "The Role of Cultural Fitness in User Resistance to Information Technology Tools.",
            "Meaning, The Central Issue in Cross-Cultural HCI Design.",
            "A Knowledge-Based Methodology for Supporting Multilingual and User-Tailored Interfaces.",
            "Using the LUCID Method to Optimize the Acceptability of Shared Interfaces.",
            "The Use of the Internet as a Research Tool: The Nature and Characteristics of Seasonal Affective Disorder (SAD) amongst a Population of Users.",
            "The Role of Task Analysis in Capturing Requirements for Interface Design.",
            "Investigation of Decision Making Process: A Hypermedia Approach.",
            "Editorial: Shared Values and Shared Interfaces 2: Preview and Current Research.",
            "An Abstract Framework for Globalising Interactive Systems.",
            "Design of Icons for Use by Chinese in Mainland China.",
            "Cross-Cultural and Cognitive Issues in the Implementation of New Technology: Focus on Group Support Systems and Bulgaria.",
            "Creating Global Software: A Conspectus and Review."
        ]
    },
    {
        "name": "IWC",
        "year": "1996",
        "info": "Volume 8: 1996",
        "count": 26,
        "papers": [
            "A Goal Satisfied: Rapid Journal Publication.",
            "Effect of Grading Schemes on Outcomes in Query Writing Experiments.",
            "Comparison of Input Devices in an ISEE Direct Timbre Manipulation Task.",
            "Structured Task Analysis: An Instantiation of the MUSE Method for Usability Engineering.",
            "Intelligent Adaptive Assistance and its Automatic Generation.",
            "Requirements for Graphical User Interface Development Environments for Groupware.",
            "Delivering Cognitive Psychology to HCI: The Problems of Common Language and of Knowledge Transfer.",
            "An Analysis of User Interface Design Projects: Information Sources and Constraints in Design.",
            "The Identifiability of Auditory Icons for Use in Educational Software for Children.",
            "Formal Framework and Necessary Properties of the Fusion of Input Modes in User Interfaces.",
            "Cognitive and Educational Aspects of Desktop Videoconferencing (Part 1).",
            "The Role of the Face in Communication: Implications for Videophone Design.",
            "Comparison of Face-to-Face and Video-Mediated Interaction.",
            "Impact of Video-Mediated Communication on Simulated Service Encounters.",
            "Videoconferencing in a Language Learning Application.",
            "Documenting the Design of Safety-Critical, User Interfaces.",
            "Information Technology Support for Shared Task Performance within an Office Environment.",
            "Cognitive and Educational Aspects of Desktop Videoconferencing (Part 2).",
            "Evaluating Audio and Video Quality in Low-Cost Multimedia Conferencing Systems.",
            "Informal Communication is about Sharing Objects in Media.",
            "Real-Time Interactivity on the SuperJANET Network.",
            "A Visual Approach to Versioning for Text Co-Authoring.",
            "Interaction of Screen Distances, Screen Letter Heights and Source Document Distances.",
            "Investigation of Voice and Text Output Modes with Abstraction in a Computer Interface.",
            "Triadic Relationship between Doctor, Computer and Patient.",
            "Towards a Practical Measure of Hypertext Usability."
        ]
    },
    {
        "name": "IWC",
        "year": "1995",
        "info": "Volume 7: 1995",
        "count": 21,
        "papers": [
            "Towards Modelling Exploratory Learning in the Context of Direct Manipulation Interfaces.",
            "Multi-Paradigm Query Interface to an Object-Oriented Database.",
            "Lean Cuisine+: An Executable Graphical Notation for Describing Direct Manipulation Interfaces.",
            "Experimental Comparison between Automatic and Manual Menu Interface Design Methods.",
            "Integrating Technologies to Support Action.",
            "The Case for Supportive Evaluation During Design.",
            "Harmony through Working Together: Editorial to the Australasian Special Issue.",
            "Colour in Map Displays: Issues for Task-Specific Display Design.",
            "Process Support: Inflexible Imposition or Chaotic Composition?",
            "Computer Anxiety: Correlates, Norms and Problem Definition in Health Care and Banking Employees using the Computer Attitude Scale.",
            "Four Principles of Groupware Design.",
            "Functional Visual Programming Interface to Geographical Information Systems.",
            "Video Support for Shared Work-Space Interaction: An Empirical Study.",
            "Human Performance in Fault Diagnosis: Can Expert Systems Help?",
            "Database Systems: Challenges and Opportunities for Graphical HCI.",
            "Modelling of Menu Design in Computerized Work.",
            "PETRA: Participatory Evaluation Through Redesign and Analysis.",
            "Field Evaluation of a Prototype Laser Safety Decision Support System.",
            "Menu - What Menu?",
            "Theoretical Examination of the Effects of Anxiety and Electronic Performance Monitoring on Behavioural Biometric Security Systems.",
            "An Examination of Four User-Based Software Evaluation Methods."
        ]
    },
    {
        "name": "IWC",
        "year": "1994",
        "info": "Volume 6: 1994",
        "count": 21,
        "papers": [
            "Learning to Use a Spreadsheet By Doing and By Watching.",
            "Effect of Error Information in Tutorial Documentation.",
            "Design and Implementation of a User-Oriented Speech Recognition Interface: The Synergy of Technology and Human Factors.",
            "Interacting Cognitive Subsystems: A Framework for Considering the Relationships between Performance and Knowledge Representations.",
            "Understanding Usability Issues Addressed by Three User-System Interface Evaluation Techniques.",
            "Reply to Fraser and Wrigley or Definitely Not the Last Word on Language Varieties.",
            "Electronic Bulletin Boards: A Case Study of Computer-Mediated Communication.",
            "Multiple Worlds: An Approach to Multimedia Resource Management Using Truth Maintenance.",
            "Studies of Turn-Taking in Computer-Mediated Communication.",
            "A Conceptualisation of Multiparty Interaction.",
            "Development and Validation of Icons Varying in their Abstractness.",
            "Prediction of Pointing and Dragging Times in Graphical User Interfaces.",
            "Organisation of Design Activities: Opportunistic, with Hierarchical Episodes.",
            "Task-Based Method for Creating Usable Hypertext.",
            "Comparative Analysis of Task Analysis Products.",
            "Delivering HCI Modelling to Designers: A Framework and Case Study of Cognitive Modelling.",
            "Foundations of Multimodal Representations: A Taxonomy of Representational Modalities.",
            "User Interface Design for Older Adults.",
            "Interdisciplinary Collaboration: A Case Study of Software Development for Fashion Designers.",
            "Review of Graphical Notations for Specifying Direct Manipulation Interfaces.",
            "Structure for User-Oriented Dialogues in Computer-Aided Telephony."
        ]
    },
    {
        "name": "IWC",
        "year": "1992",
        "info": "Volume 5: 1992",
        "count": 25,
        "papers": [
            "Creating a Design Science of Human-Computer Interaction.",
            "Using Unfamiliar Programming Languages: The Effects on Expertise.",
            "Effects of Linguistic Sophistication on the Usability of a Natural Language Interface.",
            "A Study of Breakdowns and Repairs in a Computer-Mediated Communication System.",
            "Managing Design Ideas with a Shared Drawing Tool.",
            "Understanding and Uncovering Design Issues in Synchronous Shared-Window Conferencing.",
            "A Task-Based Cognitive Model for User-Network Interaction: Defining a Task Taxonomy to Guide the Interface Designer.",
            "User-Competence and Other Usability Aspects when Introducing a Patient Administrative System: A Case Study.",
            "Interpersonal Communication and Human-Computer Interaction: An Examination of the Use of Computers in Medical Consultations.",
            "From Rooms to Cyberspace: Models of Interaction in Large Virtual Computer Spaces.",
            "Designing with Ethnography: Making Work Visible.",
            "Approaches to Interface Design.",
            "User Interface Design for Medical Imaging Workstations: Image Display and Processing.",
            "Patterns of Students' Interactions with a Hypermedia System.",
            "MOG User Interface Builder: A Mechanism for Integrating Application and User Interface.",
            "On Distinguishing Work Tasks and Enabling Tasks.",
            "Sublanguages and Registers: A Note on Terminology.",
            "Assessment of the Minimalist Approach to Computer User Documentation.",
            "Hypertext and Expert Systems: The Possibilities for Integration.",
            "Supporting the Use of Guidelines and Style Guides in Professional User Interface Design.",
            "Influence, Discretion and Time Available: A Case Study of HCI Practice in Software Development.",
            "Where Should a Public Access Health Information System be Sited?",
            "Practical User Interface Design Notation.",
            "In Defense of Sublinguistics.",
            "Sublanguage, Register and Natural Language Interfaces."
        ]
    },
    {
        "name": "IWC",
        "year": "1992",
        "info": "Volume 4: 1992",
        "count": 21,
        "papers": [
            "Animated Demonstrations for Exploratory Learners.",
            "Motivation, Practice and Guidelines for 'Undoing'.",
            "Combining CSCW and User Support Techniques to Design Collaborative User Interfaces.",
            "Branching Selection of Suggestions.",
            "Formal Interactive Menu Design.",
            "The Role of Task Analysis in Systems Design.",
            "Task Analysis and Systems Analysis for Software Development.",
            "TripleSpace: An Experiment in a 3D Graphical Interface to a Binary Relational Database.",
            "Microcomputer Version of a Digit Span Test in Clinical Use.",
            "Further Investigations into the Use of Colour Coding Scales.",
            "Shopfloor Attitudes Towards Advanced Manufacturing Technology: The Changing Focus of Industrial Conflict?",
            "Utility and Usability: Research Issues and Development Contexts.",
            "Field Testing a Natural-Language Information System: Usage Characteristics and Users' Comments.",
            "Display Elements and Gaps: A Comparison of Flat Panel Display Characteristics.",
            "Task Analysis and System Design: The Discipline of Data.",
            "Computer-Based Task Representation: A Methodology for Improving System Design.",
            "How Should Fitts' Law be Applied to Human-Computer Interaction?",
            "Computer Support for Co-Operative Work.",
            "Giving Undo Attention.",
            "Locating Systems at Work: Implications for the Development of Active Badge Applications.",
            "Human and Technical Factors of Distributed Group Drawing Tools."
        ]
    },
    {
        "name": "IWC",
        "year": "1991",
        "info": "Volume 3: 1991",
        "count": 19,
        "papers": [
            "Importance of Failure Analysis for Human-Computer Interface Design.",
            "Direct Manipulation Interaction Tasks: A Macintosh-Based Analysis.",
            "Adaptive Predictive Text Generation and the Reactive Keyboard.",
            "Rapid Prototyping in Human-Computer Interface Development.",
            "Teaching the Practitioners: Developing a Distance Learning Postgraduate HCI Course.",
            "Rogerian Psychology and Human-Computer Interaction.",
            "IMAGES: A User Interface Development System.",
            "Users, A Software Usability Model and Product Evaluation.",
            "Interactive Modelling in Decision Support Systems.",
            "Visual Simulation as an Aid to Understanding Computer Functions.",
            "Observations and Inventions: New Approaches to the Study of Human-Computer Interaction.",
            "Visual Guidance for Information Navigation: A Computer-Human Interface Design Principle Derived from Cognitive Neuroscience.",
            "Report on the INTERACT'90 Workshop on Education in HCI: Transcending Disciplinary and National Boundaries.",
            "Context and its Representation.",
            "Improving Touchscreen Keyboards: Design Issues and a Comparison with Other Devices.",
            "Cognitive Assessment of Alternatives.",
            "The Challenge of Interface Design for Communication Theory: From Interaction Metaphor to Contexts of Discovery.",
            "Visual Development of Database Applications.",
            "A Survey of CSCW Systems."
        ]
    },
    {
        "name": "IWC",
        "year": "1990",
        "info": "Volume 2: 1990",
        "count": 25,
        "papers": [
            "The Contribution of Practitioner Case Studies to Human-Computer Interaction Science.",
            "You're Right About the Cure: Don't Do That.",
            "Redefining Software: A Comment on Thimbleby's Paper.",
            "A Methodology for the Design of Computerised Qualitative Research Tools.",
            "Using a Touchscreen for Simple Tasks.",
            "The Predictability of Commands in a Spreadsheet Program.",
            "An Overview of Knowledge Acquisition Methods.",
            "USTM: A New Approach to Requirements Specification.",
            "Human-Centered Expert Systems: A Response to Taylorism and the Scientific Paradigm.",
            "What Philosophy Can Offer to Information Science: The Example of Medical Expert Systems.",
            "A Meta-model for Interacting with Computers.",
            "Expanding Human-Computer Interaction by Computer-Aided Creativity.",
            "Human Aspects of Interactive Multimedia Communication.",
            "Historical Analysis: A Method for Evaluating Requirement Capture Methodologies.",
            "Lean Cuisine: No Sauces, No Courses!",
            "An Interface Prototyping System Based on Lean Cuisine.",
            "Enhancing the Efficiency of Multiparty Interaction Through Computer Mediation.",
            "Further Discussion on Increasing the Efficiency of Multiparty Interaction.",
            "3M: A User Modelling Interface of an Expert System for X-Ray Topographic Image Interpretation.",
            "HCI 'Intraface Model' for System Design.",
            "Monitoring Hypertext Users.",
            "Planning Procedural Advice.",
            "Reflexive CSCW: Supporting Long-Term Personal Work.",
            "Incremental Maintenance of Semantic Links in Dynamically Changing Hypertext Systems.",
            "Datenbank-DIALOG: How to Communicate with Your Database in German (and Enjoy It)."
        ]
    },
    {
        "name": "IWC",
        "year": "1989",
        "info": "Volume 1: 1989",
        "count": 25,
        "papers": [
            "The Discipline of HCI.",
            "Task Analysis, Systems Analysis and Design: Symbiosis or Synthesis?",
            "Embedded User Models - Where Next?",
            "People Interact Through Computers Not With Them.",
            "Interacting WITH Computers.",
            "Lean Cuisine: A Low-Fat Notation for Menus.",
            "Explanatory Dialogues.",
            "Moral Judgements in Designing Better Systems.",
            "Icons at the Interface: Their Usefulness.",
            "Who's Joking? The Information System at Play.",
            "A Formal Structure for Automatic Icons.",
            "Human Factors in Expert System Design: Can Lessons in the Promotion of Methods be Learned from Commercial DP?",
            "Inductive Analysis Applied to the Evaluation of a CAL Tutorial.",
            "Computer Technology and Knowledge Workers: A Pilot Study of Job Impact.",
            "Human Factors of Journal Usage and Design of Electronic Texts.",
            "The Personal Browser: A Tool for Directed Navigation in Hypertext Systems.",
            "'Working-to-Rules': A Case of Taylor-Made Expert Systems.",
            "Modelling Devices and Modelling Speakers.",
            "Shaping User Input: A Strategy for Natural Language Dialogue Design.",
            "A Knowledge-Based System with Audio-Visual Aids.",
            "Interacting with Electronic Mail Can be a Dream or a Nightmare: A User's Point View.",
            "The Application of Metaphor, Analogy, and Conceptual Models in Computer Systems.",
            "Exploiting Convergence to Improve Natural Language Understanding.",
            "The User Interface in a Hypertext, Multiwindow Program Browser.",
            "The Individual 'Working-to-Rules': Reducing Determinism in Taylor-Made Expert Systems."
        ]
    }
]