[
    {
        "year": "2021",
        "name": "MobiQuitous 2021",
        "info": "Virtual Event",
        "venues": [
            {
                "sub_name_abbr": "conf/mobiquitous/2021",
                "sub_name": "Mobile and Ubiquitous Systems: Computing, Networking and Services - 18th EAI International Conference, MobiQuitous 2021, Virtual Event, November 8-11, 2021, Proceedings.",
                "count": 57,
                "papers": [
                    "Event Detection and Event-Relevant Tweet Extraction with Human Mobility.",
                    "Design of Room-Layout Estimator Using Smart Speaker.",
                    "Dynamic Taxi Ride-Sharing Through Adaptive Request Propagation Using Regional Taxi Demand and Supply.",
                    "Exploring the Challenges of Using Food Journaling Apps: A Case-study with Young Adults.",
                    "Fine-Grained Respiration Monitoring During Overnight Sleep Using IR-UWB Radar.",
                    "Teledrive: A Multi-master Hybrid Mobile Telerobotics System with Federated Avatar Control.",
                    "Is This IoT Device Likely to Be Secure? Risk Score Prediction for IoT Devices Using Gradient Boosting Machines.",
                    "Optimizing Unlicensed Coexistence Network Performance Through Data Learning.",
                    "One-Shot Wayfinding Method for Blind People via OCR and Arrow Analysis with a 360-Degree Smartphone Camera.",
                    "WiFi-Based Multi-task Sensing.",
                    "A User-Centric Privacy-Preserving Approach to Control Data Collection, Storage, and Disclosure in Own Smart Home Environments.",
                    "Q-Learning-Based Spatial Reuse Method Considering Throughput Fairness by Negative Reward for High Throughput.",
                    "System Architecture for Autonomous Drone-Based Remote Sensing.",
                    "Adaptive Replica Selection in Mobile Edge Environments.",
                    "Generalizing Wireless Ad Hoc Routing for Future Edge Applications.",
                    "Longitudinal Compliance Analysis of Android Applications with Privacy Policies.",
                    "Design Validation of a Workplace Stress Management Mobile App for Healthcare Workers During COVID-19 and Beyond.",
                    "SEMEO: A Semantic Equivalence Analysis Framework for Obfuscated Android Applications.",
                    "ReHAna: An Efficient Program Analysis Framework to Uncover Reflective Code in Android.",
                    "A Route Guidance Method for Vehicles to Improve Driver's Experienced Delay Against Traffic Congestion.",
                    "A Localization Method Using Reflected Luminance Distribution.",
                    "Is Adding More Modalities Better in a Multimodal Spatio-temporal Prediction Scenario? A Case Study on Japan Air Quality.",
                    "Expanding the Positioning Area for Acoustic Localization Using COTS Mobile Devices.",
                    "Body Part Detection from Neonatal Thermal Images Using Deep Learning.",
                    "The MARBLE Dataset: Multi-inhabitant Activities of Daily Living Combining Wearable and Environmental Sensors Data.",
                    "Comparative Analysis of High- and Low-Performing Factory Workers with Attention-Based Neural Networks.",
                    "Human Localization Using a Single Camera Towards Social Distance Monitoring During Sports.",
                    "Vehicle Routing for Incremental Collection of Disaster Information Along Streets.",
                    "Smartwatch-Based Face-Touch Prediction Using Deep Representational Learning.",
                    "Radar-Based Gesture Recognition Towards Supporting Communication in Aphasia: The Bedroom Scenario.",
                    "Wi-Fi CSI-Based Activity Recognition with Adaptive Sampling Rate Selection.",
                    "Air Handling Unit Explainability Using Contextual Importance and Utility.",
                    "Internet of Robot Things in a Dynamic Environment: Narrative-Based Knowledge Representation and Reasoning.",
                    "An Empirical Study on News Recommendation in Multiple Domain Settings.",
                    "Concept Drift Detection with Denoising Autoencoder in Incomplete Data.",
                    "Synthetic People Flow: Privacy-Preserving Mobility Modeling from Large-Scale Location Data in Urban Areas.",
                    "A Study on Metrics for Concept Drift Detection Based on Predictions and Parameters of Ensemble Model.",
                    "Event-Driven Interest Detection for Task-Oriented Mobile Apps.",
                    "Caring Without Sharing: A Federated Learning Crowdsensing Framework for Diversifying Representation of Cities.",
                    "AR-T: Temporal Relation Embedded Transformer for the Real World Activity Recognition.",
                    "Analysis of The Effects of Cognitive Stress on the Reliability of Participatory Sensing.",
                    "Design and Implementation of an Online and Cost-Effective Attendance Management System Using Smartphones and Cloud Services.",
                    "Daily Health Condition Estimation Using a Smart Toothbrush with Halitosis Sensor.",
                    "Collision-Free Channel Assignment with Overlapped Channels in Multi-radio Multi-channel Wireless Mesh Networks.",
                    "Evaluating Multiple-Access Protocols: Asynchronous Pulse Coding vs. Carrier-Sense with Collision Avoidance.",
                    "Rate Control for Multi-link and Multi-relay Wireless LANs Supporting Real-Time Mobile Data Transmissions.",
                    "Quality Analysis of Audio-Video Transmission in an OFDM-Based Communication System.",
                    "Coordinated Multi-UAV Adaptive Exploration Under Recurrent Connectivity Constraints.",
                    "The Evaluation of the Angled Antenna Based Direction Estimation Scheme for RFID Tags.",
                    "A Method for Expressing Intention for Suppressing Careless Responses in Participatory Sensing.",
                    "A Privacy-Aware Browser Extension to Track User Search Behavior for Programming Course Supplement.",
                    "Building a Crowdsensing Platform Based on Spatio-Temporal Fencing.",
                    "WatchID: Wearable Device Authentication via Reprogrammable Vibration.",
                    "Premises Based Smart Door Chains System Using IoT Cloud.",
                    "A Multimodal Approach to Synthetic Personal Data Generation with Mixed Modelling: Bayesian Networks, GAN's and Classification Models.",
                    "MeAct: A Non-obstructive Persuasive End-to-End Platform for Active and Healthy Ageing Support.",
                    "Brain Activity Analysis of Stressed and Control Groups in Response to High Arousal Images."
                ]
            }
        ]
    },
    {
        "year": "2020",
        "name": "MobiQuitous 2020",
        "info": "Virtual Event / Darmstadt, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/mobiquitous/2020",
                "sub_name": "MobiQuitous '20: Computing, Networking and Services, Virtual Event / Darmstadt, Germany, December 7-9, 2020.",
                "count": 54,
                "papers": [
                    "LAMAR: LiDAR based Multi-inhabitant Activity Recognition.",
                    "Starling Swarm Algorithm: An Approach to Autonomous Coordination of Intensive Agents.",
                    "Feature Recommendation by Mining Updates and User Feedback from Competitor Apps.",
                    "Movement and Orientation Visualization using Wearable Inertial Sensors.",
                    "State Deployment in Fog Computing.",
                    "VR Book: A Tangible Interface for Smartphone-based Virtual Reality.",
                    "Towards Enhancing Fault Tolerance in Neural Networks.",
                    "Finger Air Writing - Movement Reconstruction with Low-cost IMU Sensor.",
                    "Quantifying Privacy Leakage in Graph Embedding.",
                    "Learned Taxi Fare for real-life trip trajectories via Temporal ResNet Exploration.",
                    "SpiderHand: Supporting Arachnophobia Therapy Using Motion-Controlled Robotic Manipulator.",
                    "AI-Fairness Towards Activity Recognition of Older Adults.",
                    "Optimization of rechargeable battery lifespan in wireless networking protocols.",
                    "Security Awareness of End-Users of Mobile Health Applications: An Empirical Study.",
                    "Exploiting SWIPT for IoT NOMA-based Diamond Relay Networks.",
                    "RedMesh: A WiFi-Direct Network Formation Algorithm for Large-Scale Scenarios.",
                    "Efficient discovery of emerging patternsin heterogeneous spatiotemporal data from mobile sensors.",
                    "Watching the Watchers: Resource-Efficient Mobile Video Decoding through Context-Aware Resolution Adaptation.",
                    "Positioning with Map Matching using Deep Neural Networks.",
                    "AutoCogniSys: IoT Assisted Context-Aware Automatic Cognitive Health Assessment.",
                    "Reliability Model for Incentive-Driven IoT Energy Services.",
                    "InsideOut: Model to Predict Outside CO Concentrations from Mobile CO Dosimeter Measurements Inside Vehicles.",
                    "Let's Forget About Exact Signal Strength: Indoor Positioning based on Access Point Ranking and Recurrent Neural Networks.",
                    "Visually-defined Real-Time Orchestration of IoT Systems.",
                    "A Deep Reinforcement Learning Approach to Fair Distributed Dynamic Spectrum Access.",
                    "A Flock-of-Starling Optimization Algorithm with Reinforcement Learning Capability.",
                    "TinnituSense: a Mobile Electroencephalography (EEG) Smartphone App for Tinnitus Research.",
                    "MIRES: Recovering Mobile Applications based on Backend-as-a-Service from Cyber Attacks.",
                    "My House, My Rules: A Private-by-Design Smart Home Platform.",
                    "Towards a Machine Learning-driven Trust Evaluation Model for Social Internet of Things: A Time-aware Approach.",
                    "Ubi-Interact.",
                    "Performance Analysis of D2D-enabled Non-orthogonal Multiple Access in Cooperative Relaying System.",
                    "Elastic Composition of Crowdsourced IoT Energy Services.",
                    "Resource-aware log monitoring data transmission for Smart and IoT devices.",
                    "Deep Reinforcement Learning for UAV-Assisted Emergency Response.",
                    "IAM - Interpolation and Aggregation on the Move: Collaborative Crowdsensing for Spatio-temporal Phenomena.",
                    "Kairos: a self-configuring approach for short and accurate event timeouts in IoT.",
                    "Generation of Realistic Activity Scenarios for SUMO.",
                    "dFDA-VeD: A Dynamic Future Demand Aware Vehicle Dispatching System.",
                    "k-Anonymous Crowd Flow Analytics.",
                    "Formation-based Selection of Drone Swarm Services.",
                    "Towards Bike Type and E-Scooter Classification With Smartphone Sensors.",
                    "MobDL: A Framework for Profiling Deep Learning Models: A Case Study using Mobile Digital Health Applications.",
                    "A Bilateral Recommendation Strategy for Mobile Event-Based Social Networks.",
                    "An Empirical Analysis of the Progress in Wireless Communication Generations.",
                    "Speed Prediction on Real-life Traffic Data: Deep Stacked Residual Neural Network and Bidirectional LSTM.",
                    "Detecting of Vertically-Oriented Texts in Images Containing Natural Scenes.",
                    "New Ways to Estimate Blood Pressure, Heartrate Variability and SpO2 Via Smartphone Camera - Proof of Concept.",
                    "Design and evaluation on task allocation interfaces in gamified participatory sensing for tourism.",
                    "How far can Wearable Augmented Reality Influence Customer Shopping Behavior.",
                    "Towards a System for Aged Care Centres based on Multiuser-Multidevice Interactions in IoT Collectives.",
                    "Proactive Connection Migration in QUIC.",
                    "Consumer Wearables and Affective Computing for Wellbeing Support.",
                    "Machine Learning Approach to Manage Adaptive Push Notifications for Improving User Experience."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "MobiQuitous 2019",
        "info": "Houston, TX, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/mobiquitous/2019",
                "sub_name": "MobiQuitous 2019, Proceedings of the 16th EAI International Conference on Mobile and Ubiquitous Systems: Computing, Networking and Services, Houston, Texas, USA, November 12-14, 2019.",
                "count": 58,
                "papers": [
                    "Regression-based network monitoring in swarm robotic systems.",
                    "Efficient content caching for named data network nodes.",
                    "A deep spatio-temporal attention-based neural network for passenger flow prediction.",
                    "Mobile augmented reality techniques for emergency response.",
                    "The impression of virtual experience: mobile augmented reality cloud solution.",
                    "Jive: spatially-constrained encryption key sharing using visible light communication.",
                    "{P}Net: privacy-preserving personalization of AI-based models by anonymous inter-person similarity networks.",
                    "HEliOS: huffman coding based lightweight encryption scheme for data transmission.",
                    "Indoor localization based on subcarrier parameter estimation of LoS with wi-fi.",
                    "Pushing smart caching to the edge with BayCache.",
                    "MultiLock: biometric-based graded authentication for mobile devices.",
                    "An intelligent optimization method for information recommendation.",
                    "Quantifying location privacy in permissioned blockchain-based internet of things (IoT).",
                    "A scheme for anomalous RFID trajectory detection based on improved clustering algorithm under digital-twin-driven.",
                    "Adaptive robotic rehabilitation using muscle fatigue as a trigger.",
                    "PatientSense: patient discrimination from in-bottle sensors data.",
                    "A cost-effective and non-invasive system for sleep and vital signs monitoring using passive RFID tags.",
                    "AugToAct: scaling complex human activity recognition with few labels.",
                    "PPCA: privacy-preserving conditional actions for IoT environments using smart contracts.",
                    "MFE-HAR: multiscale feature engineering for human activity recognition using wearable sensors.",
                    "A trust architecture for blockchain in IoT.",
                    "Detecting malicious applications using system services request behavior.",
                    "WiLay: building wi-fi-based human activity recognition system through activity hierarchical relationship.",
                    "On optimization of ad-blocking lists for mobile devices.",
                    "Impact of consensus on appendable-block blockchain for IoT.",
                    "Time-aware reactive storage in wireless edge environments.",
                    "MicPrint: acoustic sensor fingerprinting for spoof-resistant mobile device authentication.",
                    "DeepLoc: deep neural network-based telco localization.",
                    "Smart discovery of periodic-frequent human routines for home automation.",
                    "NextAct: a hybrid approach for high-resolution human activity predictions.",
                    "Understanding the impact of number of CPU cores on user satisfaction in smartphones.",
                    "Multi-destination vehicular route planning with parking and traffic constraints.",
                    "Distances for wifi based topological indoor mapping.",
                    "User-connection behaviour analysis in service management using bipartite labelled property graph.",
                    "FitAssist: virtual fitness assistant based on wifi.",
                    "How smart your smartphone is in lie detection?",
                    "A generalized mechanism beyond NLP for real-time detection of cyber abuse through facial expression analytics.",
                    "SCARF: a scalable data management framework for context-aware applications in smart environments.",
                    "YanuX: pervasive distribution of the user interface by co-located devices.",
                    "Simulation of a big number of microservices in a highly distributed vast network.",
                    "An augmented real-world interactive classroom for developing learning numbers and counting skills for preschool children.",
                    "DeepFit: deep learning based fitness center equipment use modeling and prediction.",
                    "Examining the energy impact of sorting algorithms on android: an empirical study.",
                    "A social-relation-based game model for distributed clustering in cooperative wireless networks.",
                    "Participatory location fingerprinting through stationary crowd in a public or commercial indoor environment.",
                    "PerFlow: configuring the information flow in a pervasive middleware via visual scripting.",
                    "Saving private addresses: an analysis of privacy issues in the bluetooth-low-energy advertising mechanism.",
                    "Fuzzy clustering-based task allocation approach using bipartite graph in cloud-fog environment.",
                    "Learning trajectories as words: a probabilistic generative model for destination prediction.",
                    "MMLOC: multi-mode indoor localization system based on smart access points.",
                    "Analysis of the duration and energy consumption of AES algorithms on a contiki-based IoT device.",
                    "Channel prediction based on adaptive structure extreme learning machine for UAV mmWave communications.",
                    "Performance evaluation of wi-fi for underground robots.",
                    "Constructing 3d maps for dynamic environments using autonomous UAVs.",
                    "A novel routing metric for IEEE 802.11s-based swarm-of-drones applications.",
                    "A game-theoretic framework for dynamic cyber deception in internet of battlefield things.",
                    "An analysis of fog computing data placement algorithms.",
                    "Lighter U-net for segmenting white matter hyperintensities in MR images."
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "MobiQuitous 2018",
        "info": "New York, NY, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/mobiquitous/2018",
                "sub_name": "Proceedings of the 15th EAI International Conference on Mobile and Ubiquitous Systems: Computing, Networking and Services, MobiQuitous 2018, 5-7 November 2018, New York City, NY, USA.",
                "count": 52,
                "papers": [
                    "bTracked: Highly Accurate Field Deployable Real-Time Indoor Spatial Tracking for Human Behavior Observations.",
                    "Direct-path based fingerprint extraction algorithm for indoor localization.",
                    "Predicting Citywide Passenger Demand via Reinforcement Learning from Spatio-Temporal Dynamics.",
                    "Beyond the RSSI value in BLE-based passive indoor localization: let data speak.",
                    "ReSPonSe: Real-time, Secure, and Privacy-aware Video Redaction System.",
                    "Predicting Human Count through Environmental Sensing in Closed Indoor Settings.",
                    "Polyglot CerberOS: Resource Security, Interoperability and Multi-Tenancy for IoT Services on a Multilingual Platform.",
                    "RFHUI: An Intuitive and Easy-to-Operate Human-UAV Interaction System for Controlling a UAV in a 3D Space.",
                    "Leveraging Smart-Phone Cameras and Image Processing Techniques to Classify Mosquito Species.",
                    "Continuous Identification in Smart Environments Using Wrist-Worn Inertial Sensors.",
                    "CardioFi: Enabling Heart Rate Monitoring on Unmodified COTS WiFi Devices.",
                    "Antilizer: Run Time Self-Healing Security for Wireless Sensor Networks.",
                    "ArmIn: Explore the Feasibility of Designing a Text-entry Application Using EMG Signals.",
                    "Task assignment for Eco-friendly Mobile Crowdsensing.",
                    "Wi-Sign: Device-free Second Factor User Authentication.",
                    "SpeedyChain: A framework for decoupling data from blockchain for smart cities.",
                    "Toward privacy in IoT mobile devices for activity recognition.",
                    "Hapi: A Robust Pseudo-3D Calibration-Free WiFi-based Indoor Localization System.",
                    "Queueing Network Modeling Patterns for Reliable and Unreliable Publish/Subscribe Protocols.",
                    "NYCER: A Non-Emergency Response Predictor for NYC using Sparse Gaussian Conditional Random Fields.",
                    "Automated Dynamic Electrocardiogram Noise Reduction Using Multilayer LSTM Network.",
                    "In-vivo and offline optimisation of energy use in the presence of small energy signals: A case study on a popular Android library.",
                    "MLStar: Machine Learning in Energy Profile Estimation of Android Apps.",
                    "Experiences & Challenges with Server-Side WiFi Indoor Localization Using Existing Infrastructure.",
                    "Adaptive Video Content Manipulation for OLED Display Power Management.",
                    "Deep Auto-Set: A Deep Auto-Encoder-Set Network for Activity Recognition Using Wearables.",
                    "GazeRevealer: Inferring Password Using Smartphone Front Camera.",
                    "Live Migration of Virtual Machines and Containers over Wide Area Networks with Distributed Mobility Management.",
                    "Tour Guides Get Guided: Intelligent Coordination of Simultaneous Tours in Exhibition Environments.",
                    "Mining Pattern Similarity for Mobility Prediction in Location-based Social Networks.",
                    "Phascope: Fine-grained, Fast, Flexible Motion Profiling based on Phase Offset in Acoustic OFDM Signal.",
                    "Leveraging ARM TrustZone and Verifiable Computing to Provide Auditable Mobile Functions.",
                    "Trackr: Reliable UI Element Tracking for Application Refactoring Based Mobilization of Enterprise Web Applications.",
                    "Securing Highly-Sensitive Information in Smart Mobile Devices through Difficult-to-Mimic and Single-Time Usage Analytics.",
                    "Resilience of Stateful IoT Applications in a Dynamic Fog Environment.",
                    "Inferring Transportation Mode and Human Activity from Mobile Sensing in Daily Life.",
                    "Duity: A Low-cost and Pervasive Finger-count Based Hand Gesture Recognition System for Low-literate and Novice Users.",
                    "Joint Mobility Pattern Mining with Urban Region Partitions.",
                    "EvaLoc: Evaluating Performance Degradation in Wireless Fingerprint-based Indoor Localization.",
                    "BFound: Sensor Enhanced Localization for Internet of Things.",
                    "ProMETheus: An Intelligent Mobile Voice Meeting Minutes System.",
                    "Benchmark Data for Mobile App Traffic Research.",
                    "Dynamic Price Prediction in Ride-on-demand Service with Multi-source Urban Data.",
                    "Smartphone Applications Testbed Using Virtual Reality.",
                    "A machine learning approach for dynamic control of RTS/CTS in WLANs.",
                    "Towards Blockchain-Driven, Secure and Transparent Audit Logs.",
                    "Constructing Trustworthy and Safe Communities on a Blockchain-Enabled Social Credits System.",
                    "Censorship Resistant Decentralized IoT Management Systems.",
                    "A Generic Paradigm for Blockchain Design.",
                    "A Network Coding Based Information Spreading Approach for Permissioned Blockchain in IoT Settings.",
                    "Reputation-based Distributed Knowledge Sharing System in Blockchain.",
                    "Roll-DPoS: A Randomized Delegated Proof of Stake Scheme for Scalable Blockchain-Based Internet of Things Systems."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "MobiQuitous 2017",
        "info": "Melbourne, Australia",
        "venues": [
            {
                "sub_name_abbr": "conf/mobiquitous/2017",
                "sub_name": "Proceedings of the 14th EAI International Conference on Mobile and Ubiquitous Systems: Computing, Networking and Services, Melbourne, Australia, November 7-10, 2017.",
                "count": 69,
                "papers": [
                    "Predicting the city foot traffic with pedestrian sensor data.",
                    "Gait Optimization for Multiple Humanoid Robots Based on Parallel Multi-swarm Particle Swarm Algorithm.",
                    "Authentication and Access Control for Open Messaging Interface Standard.",
                    "Multi-Person Brain Activity Recognition via Comprehensive EEG Signal Analysis.",
                    "PrivaSense: Privacy-Preserving and Reputation-Aware Mobile Participatory Sensing.",
                    "AP-Attack: A Novel User Re-identification Attack On Mobility Datasets.",
                    "A Study on the Impact of Indoor Positioning Performance on Activity Recognition Applications.",
                    "EGAIM: Enhanced Genetic Algorithm based Incentive Mechanism for Mobile Crowdsensing.",
                    "An Novel Approach to Evaluate the Reliability of Cloud Rendering System Using Probabilistic Model Checker PRISM: A Quantitative Computing Perspective.",
                    "Direction-Aware, Audio-Based Pedestrian Relative Positioning by Swing Induced Doppler Shift.",
                    "Modeling and Provisioning IoT Cloud Systems for Testing Uncertainties.",
                    "CapSense: Capacitor-based Activity Sensing for Kinetic Energy Harvesting Powered Wearable Devices.",
                    "PROFICIENT: Productivity Tool for Semantic Interoperability in an Open IoT Ecosystem.",
                    "WiCare: Towards In-Situ Breath Monitoring.",
                    "From Ride-Sourcing to Ride-Sharing through Hot-Spots.",
                    "It Can be Cheaper: Using Price Prediction to Obtain Better Prices from Dynamic Pricing in Ride-on-demand Services.",
                    "Capturing Daily Student Life by Recognizing Complex Activities Using Smartphones.",
                    "TagController: A Universal Wireless and Battery-free Remote Controller using Passive RFID Tags.",
                    "Sensor Agnostic Photoplethysmogram Signal Quality Assessment using Morphological Analysis.",
                    "PIN: Potential Wise Crowd From Million Grassroots.",
                    "Towards an Analysis of Traffic Shaping and Policing in Fog Networks Using Stochastic Fluid Models.",
                    "Trust-based Scheme for Cheating and Collusion Detection in Wireless Multihop Networks.",
                    "Real Time Distant Speech Emotion Recognition in Indoor Environments.",
                    "Edge-based Content-aware Crowdsourcing Approach for Image Sensing in Disaster Environment.",
                    "GOCRGO and GOGO: Two Minimal Communication Topologies for WiFi-Direct Multi-group Networking.",
                    "ParkUs 2.0: Automated Cruise Detection for Parking Availability Inference.",
                    "Understanding Vulnerabilities of Location Privacy Mechanisms against Mobility Prediction Attacks.",
                    "CloudAnalyzer: Uncovering the Cloud Usage of Mobile Apps.",
                    "Follow The Best: Crowdsourced Automated Travel Advice.",
                    "Markov Dynamic Subsequence Ensemble for Energy-Efficient Activity Recognition.",
                    "GraMap: QoS-Aware Indoor Mapping Through Crowd-Sensing Point Clouds with Grammar Support.",
                    "Duck Attack on Accountable Distributed Systems.",
                    "BikeMate: Bike Riding Behavior Monitoring with Smartphones.",
                    "Less is More: Learning More with Concurrent Transmissions for Energy-Efficient Flooding.",
                    "RFlow-ID: Unobtrusive Workflow Recognition with COTS RFID.",
                    "Mining Spatial-temporal Correlation of Sensory Data for Estimating Traffic Volumes on Highways.",
                    "WiPush: Opportunistic Notifications over WiFi without Association.",
                    "Selective Jamming of LoRaWAN using Commodity Hardware.",
                    "A Group-based Fault Tolerant Mechanism for Heterogeneous Mobile Clouds.",
                    "Dirichlet Process Gaussian Mixture Model for Activity Discovery in Smart Homes with Ambient Sensors.",
                    "Wi-Auth: WiFi based Second Factor User Authentication.",
                    "A Fast and Accurate Index Structure for Spatiotemporal Trajectories.",
                    "Next2Me: Capturing Social Interactions through Smartphone Devices using WiFi and Audio signals.",
                    "Detecting Falls Using a Wearable Accelerometer Motion Sensor.",
                    "On Design of A Fine-Grained Access Control Architecture for Securing IoT-Enabled Smart Healthcare Systems.",
                    "Interpolating the Missing Values for Multi-Dimensional Spatial-Temporal Sensor Data: A Tensor SVD Approach.",
                    "Trusted Operations On Mobile Phones.",
                    "Combining Frequency and Spatial Diversities to Calibrate Ranging over WLAN.",
                    "Object Localization for Determining Customer's Behavior: Auto-ID Based Approach.",
                    "Service-Mediated On-Road Situation-Awareness for Group Activity Safety.",
                    "A Mobile Crowdsensing Framework for Integrating Smartphone and IoT Devices to Cloud Computing Services.",
                    "Variable Length Sliding Window-based Network Coding Algorithm in MANETs.",
                    "Profiling and Predicting User Activity on a Home Network.",
                    "Connecting Paper to Digitization: a Homework Data Processing System with Data Labeling and Visualization.",
                    "Persuasive Events and User's Roles in Mobile-Based Interactive Solutions for Nature Discovery.",
                    "Life Style Modification by Peer Monitoring of Physical Activity.",
                    "On the Feasibility of a Smartphone-based Solution to Rapid Qantitative Urinalysis using Nanomaterial Bioprobes.",
                    "Novel approach to shopping experience.",
                    "Estimation of Local Coverage Areas Based on Detected Objects.",
                    "PBAC4M: Provenance-Based Access Control for Mobile.",
                    "AndroCon: An Android-Based Context-Aware Middleware Framework for Data Provisioning.",
                    "Modelling Dynamic Risks in Internet-of-Things Applications.",
                    "Drone Services for Augmenting Mobile User Devices On-Demand: Concept and Prototype.",
                    "The Ubiquitous Device Transition Experience of the Mobile User.",
                    "Vehicular Cooperation to Overcome the Car Park Challenge.",
                    "Unobtrusive User Verification using Piezoelectric Energy Harvesting.",
                    "Privacy-preserving Comparison of Cloud Exposure Induced by Mobile Apps.",
                    "Identifying Recent Behavioral Data Length in Mobile Phone Log.",
                    "Viewer of Synthetic Scenarios to Evaluate Estimators of Local Coverage Areas Based on Detected Objects."
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "MobiQuitous 2016",
        "info": "Hiroshima, Japan",
        "venues": [
            {
                "sub_name_abbr": "conf/mobiquitous/2016",
                "sub_name": "Proceedings of the 13th International Conference on Mobile and Ubiquitous Systems: Computing, Networking and Services, MobiQuitous 2016, Hiroshima, Japan, November 28 - December 1, 2016.",
                "count": 40,
                "papers": [
                    "A Deep Learning Approach to Mid-air Gesture Interaction for Mobile Devices from Time-of-Flight Data.",
                    "Optimal time window for temporal segmentation of sensor streams in multi-activity recognition.",
                    "Supervised and Unsupervised Transfer Learning for Activity Recognition from Simple In-home Sensors.",
                    "WashInDepth: Lightweight Hand Wash Monitor Using Depth Sensor.",
                    "Detecting Activities of Daily Living from Low Frequency Power Consumption Data.",
                    "WFID: Passive Device-free Human Identification Using WiFi Signal.",
                    "Mobile Activity Recognition through Training Labels with Inaccurate Activity Segments.",
                    "Job Alerts in the Wild: Study of Expectations and Effects of Location-based Notifications in an Existing Mobile Crowdsourcing Application.",
                    "A method for distinction of bicycle traffic violations by detection of cyclists' behavior using multi-sensors.",
                    "MetroEye: Smart Tracking Your Metro Trips Underground.",
                    "SocialProbe: Understanding Social Interaction Through Passive WiFi Monitoring.",
                    "IoT-based Smart Parking System for Sporting Event Management.",
                    "TeCoLa: A Programming Framework for Dynamic and Heterogeneous Robotic Teams.",
                    "Scalable Learning for Dispersed Knowledge Systems.",
                    "KIRKE: Re-engineering of Web Applications to Mobile Apps.",
                    "Wi-Fi Channel Selection Based on Urban Interference Measurement.",
                    "Wi-Fi Human Behavior Analysis and BLE Tag Localization: A Case Study at an Underground Shopping Mall.",
                    "WWOF: An Energy Efficient Offloading Framework for Mobile Webpage.",
                    "Increasing the Efficiency of Code Offloading in n-tier Environments with Code Bubbling.",
                    "Fine-Grained Energy Modeling for the Source Code of a Mobile Application.",
                    "An Audio-based Hierarchical Smoking Behavior Detection System Based on A Smart Neckband Platform.",
                    "Feedback Method Evaluation of CPR Support Systems under Practical Situations.",
                    "Gait-based authentication using a wrist-worn device.",
                    "Cooperation Incentive System Balancing Virtual Credit in Mobile Ad hoc Networks.",
                    "Throughput Estimation for Short Lived TCP Cubic Flows.",
                    "Reliable Distance-Vector Routing for Static-node-assisted Vehicular Networks.",
                    "Determining a smartphone's placement by material detection using harmonics produced in sound echoes.",
                    "Real Time Autonomous Point of Interest Mining through Ambient Smartphone Sensing.",
                    "On the Behavioral Drift Estimation of Ubiquitous Computing Systems in Partially Known Environments.",
                    "An Energy-Aware Forwarding Protocol for Multimedia Opportunistic Networks.",
                    "A Method for Identifying Laser-tracked Vehicles Using Velocity Data from V2V Messages.",
                    "A Book Search System Displaying Revised Book Cover Images Reflecting Reader Impressions.",
                    "An IoT-based Safe Driving Management System.",
                    "A System for Identifying Toilet User by Characteristics of Paper Roll Rotation.",
                    "STICK TRACK: a Musical Score Generation System for Drums Considering Hitting Hand.",
                    "A Mobile VR Input Adaptation Architecture.",
                    "Gesture Recognition Method Based on Ultrasound Propagation in Body.",
                    "Opportunistic Human Activity Recognition: a study on Opportunity dataset.",
                    "A System for Linking Ground Truth to Mobile Network Traffic.",
                    "Physical and Psychophysiological Impacts of GPS Labor Management in Nursing Home Workers."
                ]
            },
            {
                "sub_name_abbr": "conf/mobiquitous/2016a",
                "sub_name": "Adjunct Proceedings of the 13th International Conference on Mobile and Ubiquitous Systems: Computing Networking and Services, MobiQuitous 2016, Hiroshima, Japan, November 28 - December 1, 2016.",
                "count": 44,
                "papers": [
                    "EverySense: An end-to-end IoT market platform.",
                    "Low-cost and Device-free Activity Recognition System with Energy Harvesting PIR and Door Sensors.",
                    "Line Replacement Algorithm for L1-scale Packet Processing Cache.",
                    "Proposal of Dynamic Information Flow Management Method Under Disaster Situations.",
                    "Milk Carton: Family Tracing and Reunification system using Face Recognition over a DTN with Deployed Computing Nodes.",
                    "Solving City Problems with Sensorized Everything A Case Study in Fujisawa.",
                    "Detecting Moving Objects Using Optical Flow with a Moving Stereo Camera.",
                    "IRI Estimation by the Frequency Domain Analysis of Vehicle Dynamic Responses and Its Large-scale Application.",
                    "A Method to Detect Accurately Falling Asleep and Awakening Time.",
                    "Damage Detector: The Damage Automatic Detection of Compartment Lines Using A Public Vehicle and A Camera.",
                    "Activity Recognition and Future Prediction in Hospitals.",
                    "Bilateration-based Position Estimation of Sensor Nodes for UAV-assisted Wireless Power Transfer Systems.",
                    "Baseline Intrusion Detection Framework for 6LoWPAN Devices.",
                    "Person Detection Techniques for an IoT Based Emergency Evacuation Assistance System.",
                    "Lightweight Authentication Scheme with Dynamic Group Members in IoT Environments.",
                    "A Method for Estimating Walking Speed by Using Magnetic Signature to Grasp People Flow in Indoor Passages.",
                    "Investigating recognition accuracy improvement by adding user's acceleration data to location and power consumption-based in-home activity recognition system.",
                    "In-home Activity and Micro-motion Logging Using Mobile Robot with Kinect.",
                    "An Emergency Application for Smartphones Based on Rhythm Pattern Recognition.",
                    "Improving Precision of BLE-based Indoor Positioning by Using Multiple Wearable Devices.",
                    "A Location Estimation Method using BLE Tags Distributed Among Participants of a Large-Scale Exhibition.",
                    "A Real-Time Detection and Localization System of Unexpected Events Using Crowd-Sourcing.",
                    "Local Attention Analysis and Prediction of Online News Articles in Twitter.",
                    "Mapping Historical Documents to Geographical Space.",
                    "S3 System: A System for Sharing Social Sensor Data and Analytical Programs.",
                    "Robotic SLAM: a Review from Fog Computing and Mobile Edge Computing Perspective.",
                    "Caffe2C: A Framework for Easy Implementation of CNN-based Mobile Applications.",
                    "Energy Efficient Flow Coverage Scheme for Mobile Crowd Sensing in Urban Streets.",
                    "Average consensus in asymmetric broadcasting wireless sensor networks through gossiping.",
                    "A Planning Simulation Tool for Energy Harvesting Applications.",
                    "Intentional Collisions for Secure Ad-Hoc Networks.",
                    "Towards Optimizing Time of File Transfer Among Multiple Smartphones using Wi-Fi Direct.",
                    "Cooperative Video Data Transmission for Sewer Inspection Using Multiple Drifting Cameras.",
                    "Performance Improvement in WLAN and LTE Based on Backlog Control Middleware.",
                    "Data Analysis Framework for Visualizing Correlation of Energy Consumption and Transit Time in Road Sections using the ECOLOG database.",
                    "Accuracy Evaluation by GPS Data Correction for the EV Energy Consumption Database.",
                    "High-Accuracy Joint Position Estimation and Posture Detection System for Driving.",
                    "Development of Zero Powered Human Detection Sensor Using Environmental Electric Noise.",
                    "pakapaka Method For BLE Beacon Identification.",
                    "Implementing and Evaluating Priority Control Mechanism for Heterogeneous Remote Monitoring IoT System.",
                    "Cache Management with Extended Interest for Information-centric Networking.",
                    "A Design and Evaluation of User-space IP Mobility Implementation.",
                    "Implementation Design of Available Bandwidth Measurement Scheme: A Proxy based Approach.",
                    "Network Application Performance Improvement with Deeply Programmable Switch."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "MobiQuitous 2015",
        "info": "Coimbra, Portugal",
        "venues": [
            {
                "sub_name_abbr": "conf/mobiquitous/2015",
                "sub_name": "Proceedings of the 12th EAI International Conference on Mobile and Ubiquitous Systems: Computing, Networking and Services, MobiQuitous 2015, Coimbra, Portugal, July 22-24, 2015.",
                "count": 18,
                "papers": [
                    "Recognising Activities in Real Time Using Body Worn Passive Sensors With Sparse Data Streams: To Interpolate or Not To Interpolate?",
                    "TagFall: Towards Unobstructive Fine-Grained Fall Detection based on UHF Passive RFID Tags.",
                    "Interference-Aware Self-Optimizing Carrier Sensor for High Efficiency Wireless LANs in Dense Networks.",
                    "On-line Entropy Estimation for Secure Information Reconciliation.",
                    "Efficient Spatial Tracking for iOS Devices.",
                    "A Synchronisation Mechanism based on User Feedback for Second Screen Applications.",
                    "Group-to-Group Bidirectional Wi-Fi Direct Communication with Two Relay Nodes.",
                    "An Open Labelled Dataset for Mobile Phone Sensing Based Fall Detection.",
                    "Better Performance in LTE Networks with Edge Assistance: The World of Warcraft Case.",
                    "VANESS: DNS for Nomadic Users in Vehicular Networks.",
                    "Anonymity in Preference-Aware Location-based Services without Third Trusted-Party.",
                    "Message based integration in Cyber-Physical System: firefighters in the field.",
                    "CSSWare: An Actor-Based Middleware for Mobile Crowd-Sourced Services.",
                    "Asynchronous Distance Measurement for Smartphone-Based Localization Exploiting Chirp Signals.",
                    "Making Sense of EveXL, a DSL for Context Awareness.",
                    "LIMBus: a lightweight remote monitoring system powered by iOS and BLE.",
                    "Mobile Device-to-Device Distributed Computing Using Data Sets.",
                    "Decentralized Storage for Networks of Hand-held Devices."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "MobiQuitous 2014",
        "info": "London, UK",
        "venues": [
            {
                "sub_name_abbr": "conf/mobiquitous/2014",
                "sub_name": "11th International Conference on Mobile and Ubiquitous Systems: Computing, Networking and Services, MOBIQUITOUS 2014, London, United Kingdom, December 2-5, 2014.",
                "count": 56,
                "papers": [
                    "Optimal predictive code offloading.",
                    "Network state estimation using smart experts.",
                    "ThingsNavi: finding most-related things via multi-dimensional modeling of human-thing interactions.",
                    "Hypermedia APIs for sensor data: a pragmatic approach to the web of things.",
                    "SenseMe: a system for continuous, on-device, and multi-dimensional context and activity recognition.",
                    "Gravity and linear acceleration estimation on mobile devices.",
                    "SBC: scalable smartphone barometer calibration through crowdsourcing.",
                    "It's the human that matters: accurate user orientation estimation for mobile computing applications.",
                    "TagTrack: device-free localization and tracking using passive RFID tags.",
                    "Accurate estimation of indoor travel times: learned unsupervised from position traces.",
                    "Method, design and implementation of a multiuser indoor localization system with concurrent fault detection.",
                    "Bleep bleep!: determining smartphone locations by opportunistically recording notification sounds.",
                    "Privacy-aware location privacy preference recommendations.",
                    "How dangerous is your Android app?: an evaluation methodology.",
                    "No technical understanding required: helping users make informed choices about access to their personal data.",
                    "The use of pseudo pressure in authenticating smartphone users.",
                    "Tube star: crowd-sourced experiences on public transport.",
                    "Estimating crowd densities and pedestrian flows using wi-fi and bluetooth.",
                    "Large-scale participatory sensing experimentation using smartphones within a smart city.",
                    "Wallah: design and evaluation of a task-centric mobile-based crowdsourcing platform.",
                    "When twitter meets foursquare: tweet location prediction using foursquare.",
                    "Watchdog: a novel, accurate and reliable method for addressing wandering-off using passive RFID tags.",
                    "ClimbTheWorld: real-time stairstep counting to increase physical activity.",
                    "MobIPLity: a trace-based mobility scenario generator for mobile applications.",
                    "myDeal: a mobile shopping assistant matching user preferences to promotions.",
                    "Situation-aware mobile health monitoring.",
                    "Can smart plugs predict electric power consumption?: a case study.",
                    "Multi-modal fusion for flasher detection in a mobile video chat application.",
                    "MyMedia: mobile semantic peer-to-peer video search and live streaming.",
                    "Handling the internet of things with care.",
                    "Policy-enabled internet of things deployable platforms for vaccine cold chains.",
                    "The proximal workspace architecture for wearable I/O-device cloud applications.",
                    "MMaPFlow: a crowd-sourcing based approach for mapping mass pedestrian flow.",
                    "Mobile indoor localization in museum environment: an experimentation in FIBAC project.",
                    "Selective mixture of Gaussians clustering for location fingerprinting.",
                    "Personalized multi-modal route planning: a preference-measurement and learning-based approach.",
                    "Building a platform for pervasive personalization in a ubiquitous computing world.",
                    "Dual scheme phone: a user assisted mechanism to effectively run sensor analytics applications on smartphones.",
                    "Smart-chairs: ubiquitous presentation evaluation based on audience's activity recognition.",
                    "WiFiBoost: a terminal-based method for detection of indoor/outdoor places.",
                    "NubiVis: a personal cloud file explorer.",
                    "A web-based toolkit for remote direct manipulation interaction with public displays via smartphones.",
                    "LICS - light paint coding system: mobile device based information encoding and decoding using light paintings.",
                    "OSCAR: a deployable adaptive mobile bandwidth sharing and aggregation system.",
                    "VividhaVahana: smartphone based vehicle classification and its applications in developing region.",
                    "Performance evaluation of sensor-fused energy-efficient geofencing for smartphones.",
                    "Tap to interact: towards dynamically remixing the internet of things.",
                    "Raising awareness on smartphone privacy issues with SASQUATCH, and solving them with PrivacyPolice.",
                    "An energy efficient implementation of differential synchronization on mobile devices.",
                    "My places diary: automatic place and transportation-mode detection.",
                    "Privacy-aware negative surveys with a hidden category in mobile sensing.",
                    "Slide-to-unlock revisited: two new user authentication techniques for touchscreen-based smartphones.",
                    "Radio propagation models for UAVs: what is missing?",
                    "Implementation of smartphone applications supporting end-to-end communication.",
                    "Location sharing services as sensors for analyzing airports' traffic.",
                    "RSS based cell fingerprint patterns and algorithms for cell identification in the context of self-organized energy saving."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "MobiQuitous 2013",
        "info": "Tokyo, Japan",
        "venues": [
            {
                "sub_name_abbr": "conf/mobiquitous/2013",
                "sub_name": "Mobile and Ubiquitous Systems: Computing, Networking, and Services - 10th International Conference, MOBIQUITOUS 2013, Tokyo, Japan, December 2-4, 2013, Revised Selected Papers.",
                "count": 69,
                "papers": [
                    "OPSitu: A Semantic-Web Based Situation Inference Tool Under Opportunistic Sensing Paradigm.",
                    "Model-Driven Public Sensing in Sparse Networks.",
                    "An Integrated WSN and Mobile Robot System for Agriculture and Environment Applications.",
                    "Sensor Deployment in Bayesian Compressive Sensing Based Environmental Monitoring.",
                    "A Mobile Agents Control Scheme for Multiple Sinks in Dense Mobile Wireless Sensor Networks.",
                    "Highly Distributable Associative Memory Based Computational Framework for Parallel Data Processing in Cloud.",
                    "MobiPLACE*: A Distributed Framework for Spatio-Temporal Data Streams Processing Utilizing Mobile Clients' Processing Power.",
                    "Modelling Energy-Aware Task Allocation in Mobile Workflows.",
                    "Recognition of Periodic Behavioral Patterns from Streaming Mobility Data.",
                    "Detection of Real-Time Intentions from Micro-blogs.",
                    "Fast and Accurate Wi-Fi Localization in Large-Scale Indoor Venues.",
                    "Reality Mining: Digging the Impact of Friendship and Location on Crowd Behavior.",
                    "Robust Overlay Routing in Structured, Location Aware Mobile Peer-to-Peer Systems.",
                    "Crossroads: A Framework for Developing Proximity-based Social Interactions.",
                    "Merging Inhomogeneous Proximity Sensor Systems for Social Network Analysis.",
                    "Device Analyzer: Understanding Smartphone Usage.",
                    "Evaluation of Energy Profiles for Mobile Video Prefetching in Generalized Stochastic Access Channels.",
                    "MITATE: Mobile Internet Testbed for Application Traffic Experimentation.",
                    "Declarative Programming for Mobile Crowdsourcing: Energy Considerations and Applications.",
                    "Types in Their Prime: Sub-typing of Data in Resource Constrained Environments.",
                    "Privacy-Aware Trust-Based Recruitment in Social Participatory Sensing.",
                    "Privacy-Preserving Calibration for Participatory Sensing.",
                    "Complexity of Distance Fraud Attacks in Graph-Based Distance Bounding.",
                    "Protecting Movement Trajectories Through Fragmentation.",
                    "Trust-Based, Privacy-Preserving Context Aggregation and Sharing in Mobile Ubiquitous Computing.",
                    "A Novel Approach for Addressing Wandering Off Elderly Using Low Cost Passive RFID Tags.",
                    "Focus and Shoot: Efficient Identification Over RFID Tags in the Specified Area.",
                    "Middleware - Software Support in Items Identification by Using the UHF RFID Technology.",
                    "A Wearable RFID System for Real-Time Activity Recognition Using Radio Patterns.",
                    "Evaluation of Wearable Sensor Tag Data Segmentation Approaches for Real Time Activity Classification in Elderly.",
                    "MobiSLIC: Content-Aware Energy Saving for Educational Videos on Mobile Devices.",
                    "An Un-tethered Mobile Shopping Experience.",
                    "Gestyboard BackTouch 1.0: Two-Handed Backside Blind-Typing on Mobile Touch-Sensitive Surfaces.",
                    "Passive, Device-Free Recognition on Your Mobile Phone: Tools, Features and a Case Study.",
                    "AcTrak - Unobtrusive Activity Detection and Step Counting Using Smartphones.",
                    "Practical Image-Enhanced LBS for AR Applications.",
                    "Appstrument - A Unified App Instrumentation and Automated Playback Framework for Testing Mobile Applications.",
                    "A Layered Secret Sharing Scheme for Automated Profile Sharing in OSN Groups.",
                    "Distributed Key Certification Using Accumulators for Wireless Sensor Networks.",
                    "On Malware Leveraging the Android Accessibility Framework.",
                    "Safe Reparametrization of Component-Based WSNs.",
                    "Toward Agent Based Inter-VM Traffic Authentication in a Cloud Environment.",
                    "Adaptive Wireless Networks as an Example of Declarative Fractionated Systems.",
                    "Elastic Ring Search for Ad Hoc Networks.",
                    "Suitability of a Common ZigBee Radio Module for Interaction and ADL Detection.",
                    "The Need for QoE-driven Interference Management in Femtocell-Overlaid Cellular Networks.",
                    "Modeling Guaranteed Delay of Virtualized Wireless Networks Using Network Calculus.",
                    "A Data Distribution Model for Large-Scale Context Aware Systems.",
                    "EduBay: A Mobile-Based, Location-Aware Content Sharing Platform.",
                    "Enhancing Context-Aware Applications Accuracy with Position Discovery.",
                    "How's My Driving? A Spatio-Semantic Analysis of Driving Behavior with Smartphone Sensors.",
                    "Impact of Contextual Factors on Smartphone Applications Use.",
                    "A Highly Accurate Method for Managing Missing Reads in RFID Enabled Asset Tracking.",
                    "A New Method for Automated GUI Modeling of Mobile Applications.",
                    "Towards Augmenting Legacy Websites with Context-Awareness.",
                    "Improving Mobile Video Streaming with Mobility Prediction and Prefetching in Integrated Cellular-WiFi Networks.",
                    "Integration and Evolution of Data Mining Models in Ubiquitous Health Telemonitoring Systems.",
                    "ITS-Light: Adaptive Lightweight Scheme to Resource Optimize Intelligent Transportation Tracking System (ITS) - Customizing CoAP for Opportunistic Optimization.",
                    "MELON: A Persistent Message-Based Communication Paradigm for MANETs.",
                    "MVPTrack: Energy-Efficient Places and Motion States Tracking.",
                    "Neighbourhood-Pair Attack in Social Network Data Publishing.",
                    "On-demand Mobile Charger Scheduling for Effective Coverage in Wireless Rechargeable Sensor Networks.",
                    "Tailoring Activity Recognition to Provide Cues that Trigger Autobiographical Memory of Elderly People.",
                    "Two-Way Communications Through Firewalls Using QLM Messaging.",
                    "Towards a Privacy Risk Assessment Methodology for Location-Based Systems.",
                    "Mobility Models-Based Performance Evaluation of the History Based Prediction for Routing Protocol for Infrastructure-Less Opportunistic Networks.",
                    "LTE_FICC: A New Mechanism for Provision of QoS and Congestion Control in LTE/LTE-Advanced Networks.",
                    "Virtual Wireless User: A Practical Design for Parallel MultiConnect Using WiFi Direct in Group Communication.",
                    "Small Cell Enhancement for LTE-Advanced Release 12 and Application of Higher Order Modulation."
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "MobiQuitous 2012",
        "info": "Beijing, China",
        "venues": [
            {
                "sub_name_abbr": "conf/mobiquitous/2012",
                "sub_name": "Mobile and Ubiquitous Systems: Computing, Networking, and Services - 9th International Conference, MobiQuitous 2012, Beijing, China, December 12-14, 2012. Revised Selected Papers.",
                "count": 23,
                "papers": [
                    "Traffic Density Estimation Protocol Using Vehicular Networks.",
                    "Mobile-to-Mobile Video Recommendation.",
                    "DualCodes: Backward Compatible Multi-layer 2D-Barcodes.",
                    "A Collaborative Framework of Enabling Device Participation in Mobile Cloud Computing.",
                    "Design and Evaluation of a Publish/Subscribe Framework for Ubiquitous Systems.",
                    "Where am I? Using Mobile Sensor Data to Predict a User's Semantic Place with a Random Forest Algorithm.",
                    "Recognizing a Mobile Phone's Storing Position as a Context of a Device and a User.",
                    "Privacy Preserving Social Mobile Applications.",
                    "Fine-Grained Transportation Mode Recognition Using Mobile Phones and Foot Force Sensors.",
                    "Towards In-network Aggregation for People-Centric Sensing.",
                    "Smartphone Sensor Reliability for Augmented Reality Applications.",
                    "Differential Private Trajectory Obfuscation.",
                    "CooS: Coordination Support for Mobile Collaborative Applications.",
                    "Spitty Bifs are Spiffy Bits: Interest-Based Context Dissemination Using Spatiotemporal Bloom Filters.",
                    "Trust Evaluation for Participatory Sensing.",
                    "HealthyLife: An Activity Recognition System with Smartphone Using Logic-Based Stream Reasoning.",
                    "GroupMe: Supporting Group Formation with Mobile Sensing and Social Graph Mining.",
                    "Locus: An Indoor Localization, Tracking and Navigation System for Multi-story Buildings Using Heuristics Derived from Wi-Fi Signal Strength.",
                    "Honeybee: A Programming Framework for Mobile Crowd Computing.",
                    "A Trust Framework for Social Participatory Sensing Systems.",
                    "Adapting the Obtrusiveness of Service Interactions in Dynamically Discovered Environments.",
                    "Efficient Position Sharing for Location Privacy Using Binary Space Partitioning.",
                    "MES: A System for Location-Aware Smart Messaging in Emergency Situations."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "MobiQuitous 2011",
        "info": "Copenhagen, Denmark",
        "venues": [
            {
                "sub_name_abbr": "conf/mobiquitous/2011",
                "sub_name": "Mobile and Ubiquitous Systems: Computing, Networking, and Services - 8th International ICST Conference, MobiQuitous 2011, Copenhagen, Denmark, December 6-9, 2011, Revised Selected Papers.",
                "count": 34,
                "papers": [
                    "Social Geoscape: Visualizing an Image of the City for Mobile UI Using User Generated Geo-Tagged Objects.",
                    "On the Spatio-temporal Information Content and Arithmetic Coding of Discrete Trajectories.",
                    "A Proposal on Direction Estimation between Devices Using Acoustic Waves.",
                    "Using SIFT and WiFi Signals to Provide Location-Based Services for Smartphones.",
                    "What's around Me? Spatialized Audio Augmented Reality for Blind Users with a Smartphone.",
                    "Real-Time Detection of Anomalous Taxi Trajectories from GPS Traces.",
                    "Scalable Data Processing for Community Sensing Applications.",
                    "Gander: Personalizing Search of the Here and Now.",
                    "A Mean-Variance Based Index for Dynamic Context Data Lookup.",
                    "HiCHO: Attributes Based Classification of Ubiquitous Devices.",
                    "On the Effects of Input Unreliability on Classification Algorithms.",
                    "Unsupervised Power Profiling for Mobile Devices.",
                    "Towards a New Classification of Location Privacy Methods in Pervasive Computing.",
                    "A Simulation Model for Evaluating Distributed Storage Services for Smart Product Systems.",
                    "Instance-Informed Information Systems: A Pre-requisite for Energy-Efficient and Green Information Systems.",
                    "SenseBox - A Generic Sensor Platform for the Web of Things.",
                    "Analysis of Data from a Taxi Cab Participatory Sensor Network.",
                    "POSTER Adaptive OSGi-Based Context Modeling for Android.",
                    "POSTER Towards Proactive Adaptation in Pervasive Environments.",
                    "POSTER Zero-Configuration Path Loss Model-Based Indoor Localization.",
                    "POSTER Towards a Privacy - Respectful Telematic Verification System for Vehicle and Driver Authorizations.",
                    "POSTER IPS: A Ubiquitous Indoor Positioning System.",
                    "POSTER An Embedded Fusion System for Location Management.",
                    "DEMO MultiCAMBA: A System to Assist in the Broadcasting of Sport Events.",
                    "DEMO Classroom7: Please, Make Sure Your Phones Are Switched On!",
                    "ZigBee-Assisted WiFi Transmission for Multi-interface Mobile Devices.",
                    "A Dynamic and Distributed Addressing and Routing Protocol for Wireless Sensor Networks.",
                    "Neuron Inspired Collaborative Transmission in Wireless Sensor Networks.",
                    "Minimizing the Side Effect of Context Inconsistency Resolution for Ubiquitous Computing.",
                    "Activity-Oriented Context Adaptation in Mobile Applications.",
                    "PINtext: A Framework for Secure Communication Based on Context.",
                    "In Search of an Internet of Things Service Architecture: REST or WS-*? A Developers' Perspective.",
                    "Towards Meeting Assistance: An Integrated Appointment Assistance and Group Pedestrian Navigation System.",
                    "Recognizing Group Activities Using Wearable Sensors."
                ]
            }
        ]
    },
    {
        "year": "2010",
        "name": "MobiQuitous 2010",
        "info": "Sydney, Australia",
        "venues": [
            {
                "sub_name_abbr": "conf/mobiquitous/2010",
                "sub_name": "Mobile and Ubiquitous Systems: Computing, Networking, and Services - 7th International ICST Conference, MobiQuitous 2010, Sydney, Australia, December 6-9, 2010, Revised Selected Papers.",
                "count": 53,
                "papers": [
                    "Safe Execution of Dynamically Loaded Code on Mobile Phones.",
                    "Towards Enabling Next Generation Mobile Mashups.",
                    "Mirroring Smartphones for Good: A Feasibility Study.",
                    "μC-SemPS: Energy-Efficient Semantic Publish/Subscribe for Battery-Powered Systems.",
                    "Collaborative Algorithm with a Green Touch.",
                    "Evaluating Mobile Phones as Energy Consumption Feedback Devices.",
                    "Developing Pervasive Systems as Service-Oriented Multi-Agent Systems.",
                    "Adaptation Support for Agent Based Pervasive Systems.",
                    "Mining Emerging Sequential Patterns for Activity Recognition in Body Sensor Networks.",
                    "Indoor Cooperative Positioning Based on Fingerprinting and Support Vector Machines.",
                    "Crowd Sourcing Indoor Maps with Mobile Sensors.",
                    "Real Time Six Degree of Freedom Pose Estimation Using Infrared Light Sources and Wiimote IR Camera with 3D TV Demonstration.",
                    "VLOCI: Using Distance Measurements to Improve the Accuracy of Location Coordinates in GPS-Equipped VANETs.",
                    "On Improving the Energy Efficiency and Robustness of Position Tracking for Mobile Devices.",
                    "An ETX Based Positioning System for Wireless Ad-Hoc Networks.",
                    "A Dynamic Authentication Scheme for Hierarchical Wireless Sensor Networks.",
                    "Anonymity-Aware Face-to-Face Mobile Payment.",
                    "LINK: Location Verification through Immediate Neighbors Knowledge.",
                    "Passport/Visa: Authentication and Authorisation Tokens for Ubiquitous Wireless Communications.",
                    "Virtualization for Load Balancing on IEEE 802.11 Networks.",
                    "A Packet Error Recovery Scheme for Vertical Handovers Mobility Management Protocols.",
                    "A Quantitative Comparison of Communication Paradigms for MANETs.",
                    "Multi-modeling and Co-simulation-Based Mobile Ubiquitous Protocols and Services Development and Assessment.",
                    "TERMOS: A Formal Language for Scenarios in Mobile Computing Systems.",
                    "Enforcing Security Policies in Mobile Devices Using Multiple Personas.",
                    "Scalable and Efficient Pattern Recognition Classifier for WSN.",
                    "Pervasive Integrity Checking with Coupled Objects.",
                    "Service Discovery for Service-Oriented Content Adaptation.",
                    "A Hybrid Mutual Authentication Protocol for RFID.",
                    "E2E Mobility Management in Ubiquitous and Ambient Networks Context.",
                    "Energy-Aware Cooperative Download Method among Bluetooth-Ready Mobile Phone Users.",
                    "Measuring Quality of Experience in Pervasive Systems Using Probabilistic Context-Aware Approach.",
                    "Task-Oriented Systems for Interaction with Ubiquitous Computing Environments.",
                    "Context Data Management for Mobile Spaces.",
                    "Efficient Intrusion Detection for Mobile Devices Using Spatio-temporal Mobility Patterns.",
                    "A Study on Security Management Architecture for Personal Networks.",
                    "Preliminary Results in Virtual Testing for Smart Buildings.",
                    "A Model-Based Approach for Building Ubiquitous Applications Based on Wireless Sensor Network.",
                    "Probabilistic Distance Estimation in Wireless Sensor Networks.",
                    "Context Aware Framework.",
                    "MOHA: A Novel Target Recognition Scheme for WSNs.",
                    "Policy-Based Personalized Context Dissemination for Location-Aware Services.",
                    "Automatic Generation of Radio Maps for Localization Systems.",
                    "Monitoring Interactions with RFID Tagged Objects Using RSSI.",
                    "AmICA - A Flexible, Compact, Easy-to-Program and Low-Power WSN Platform.",
                    "The Use of GPS for Handling Lack of Indoor Constraints in Particle Filter-Based Inertial Positioning.",
                    "F4Plan: An Approach to Build Efficient Adaptation Plans.",
                    "Context Acquisition and Acting in Pervasive Physiological Applications.",
                    "Linking between Personal Smart Spaces.",
                    "A Smart-Phone-Based Health Management System Using a Wearable Ring-Type Pulse Sensor.",
                    "An Adaptive Driver Alert System Making Use of Implicit Sensing and Notification Techniques.",
                    "Defining the Criteria for Supporting Pervasiveness in Complex Adaptive Systems.",
                    "User Centric Systems: Ethical Consideration."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "MobiQuitous 2009",
        "info": "Toronto, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/mobiquitous/2009",
                "sub_name": "6th Annual International Conference on Mobile and Ubiquitous Systems: Computing, Networking and Services, MOBIQUITOUS 2009, Toronto, Canada, July 13-16, 2009.",
                "count": 57,
                "papers": [
                    "Social context: Supporting interaction awareness in ubiquitous environments.",
                    "Multi-layered friendship modeling for location-based Mobile Social Networks.",
                    "\"I can't lie anymore!\": The implications of location automation for mobile social applications.",
                    "Security for pervasive medical sensor networks.",
                    "EagleVision: A pervasive mobile device protection system.",
                    "Hash-Based Sequential Aggregate and Forward Secure Signature for Unattended Wireless Sensor Networks.",
                    "Implementation and evaluation of a mobile tetherless VoIP/PSTN gateway.",
                    "Model-based fault Diagnosis for IEEE 802.11 wireless LANs.",
                    "On real-time capacity of event-driven data-gathering sensor networks.",
                    "EcoPlex: Empowering compact wireless sensor platforms via roaming and interoperability support.",
                    "Adaptive wireless services for augmented environments.",
                    "MOBIX: System for managing mobility using information exchange.",
                    "Extracting Co-locator context.",
                    "DiaSim: A parameterized simulator for pervasive computing applications.",
                    "Flockfs, a moderated group authoring system for wireless workgroups.",
                    "Temporal addressing for mobile context-aware communication.",
                    "Trajectory enabled service support platform for mobile users' behavior pattern mining.",
                    "Mining Emerging Patterns for recognizing activities of multiple users in pervasive computing.",
                    "Understanding and minimizing identity exposure in ubiquitous computing environments.",
                    "A SystemC-centric approach for simulation and generation of WSN applications targeted to ZigBee.",
                    "MediNet: A mobile healthcare management system for the Caribbean region.",
                    "Mining Emerging Patterns for recognizing activities of multiple users in pervasive computing.",
                    "Moderated group authoring among weakly connected workgroups.",
                    "MOBIX: System for managing mobility using information exchange.",
                    "Presto: A pluggable platform for supporting user participation in smart workflows.",
                    "QoS compromise in data gathering for WSN.",
                    "Resolving and mediating ambiguous contexts for pervasive care environments.",
                    "Security for pervasive healthcare.",
                    "SimBetAge: Utilizing temporal changes in social networks for delay/disconnection tolerant networking.",
                    "MDD-based agent-oriented software engineering for ubiquitous deployment.",
                    "Distance encoding in vibro-tactile guidance cues.",
                    "ADV-MAC: Advertisement-based MAC Protocol for wireless sensor networks.",
                    "Poster: An adaptive content sharing protocol for P2P Mobile Social Networks.",
                    "An intrusion detection framework for Sensor Networks using Honeypot and Swarm Intelligence.",
                    "Automation not automatically good in mobile social applications.",
                    "BlueFriend: Using Bluetooth technology for mobile social networking.",
                    "Cooperative parking space allocation in vehicular ad hoc networks.",
                    "Deescription lookup based UPnP extension for wireless sensor networks.",
                    "Designing communication-oriented node authentication for VANETs.",
                    "DiaSim: A parameterized simulator for pervasive computing applications.",
                    "UPS: Unified Protocol Stack for wireless sensor networks.",
                    "MPCS: Mobile-phone based patient compliance system for chronic illness care.",
                    "RFID-based information system for preventing medical errors.",
                    "Ad-hoc association of pre-determined ZigBee devices.",
                    "FASH: Detecting tiredness of walking people using pressure sensors.",
                    "MobiDiagnosis: A mobile headache characterization system.",
                    "How to interact: Evaluating the interface between mobile healthcare systems and the monitoring of blood sugar and blood pressure.",
                    "Visual and interaction design themes in mobile healthcare.",
                    "TreeDMA: a hybrid MAC/routing solution for small-scale wireless networks.",
                    "Analysis of cross-layer routing protocols for quality of service in real-time wireless ad hoc sensor networks.",
                    "A multi-layer approach for cross-technology communication in a pervasive community.",
                    "A scheme for efficient tracking of dynamic event region in wireless sensor networks.",
                    "Adaptive pruning of event decision trees for energy efficient collaboration in event-driven WSN.",
                    "Sensor fusion-based event detection in Wireless Sensor Networks.",
                    "A distributed nodes' localisation approach in Wireless Sensor Networks.",
                    "Energy-efficient task allocation for data fusion in Wireless Sensor Networks.",
                    "Secure self-adaptive mission-critical communication for distributed smart home sensor network."
                ]
            }
        ]
    },
    {
        "year": "2008",
        "name": "MobiQuitous 2008",
        "info": "Dublin, Ireland",
        "venues": [
            {
                "sub_name_abbr": "conf/mobiquitous/2008",
                "sub_name": "5th Annual International Conference on Mobile and Ubiquitous Systems: Computing, Networking, and Services, MobiQuitous 2008, July 21-25, 2008, Dublin, Ireland.",
                "count": 63,
                "papers": [
                    "TransDB: GPS data management with applications in collective transport.",
                    "Some research questions for computational transportation science.",
                    "On the feasibility of large-scale automated highways.",
                    "Data management challenges for computational transportation.",
                    "Mining sequential association rules for traveler context prediction.",
                    "A multi-agent traffic controller with distributed fuzzy intelligence.",
                    "On extracting commuter information from GPS motion data.",
                    "Location prediction within the mobility data analysis environment DAEDALUS.",
                    "A real-time integrated transport/communication/database architecture to support traffic simulation.",
                    "GPS use by households: early indicators of privacy preferences regarding ubiquitous mobility information access.",
                    "Scalable and efficient car communication topology.",
                    "Intelligent traveler assistant (ITA) simulation platform design.",
                    "Data aggregation in VANETs: the VESPA approach.",
                    "SP-TAG: a routing algorithm in non-stationary transportation networks.",
                    "A natural pointing technique for semi-immersive virtual environments.",
                    "A study on authentication/authorization/accounting and roaming mechanism in pervasive environment.",
                    "Congestion control protocol for wireless sensor networks handling prioritized heterogeneous traffic.",
                    "The home device authentication system construction for pervasive home network.",
                    "Tangible security for mobile devices.",
                    "An RFID-based application for handling the workflow of radioactive patients in a nuclear medicine department.",
                    "TMACS: type-based distributed middleware for mobile ad-hoc networks.",
                    "Context-aware fault tolerance in migratory services.",
                    "A document centric approach for supporting incremental deployment of pervasive applications.",
                    "PAN-on-Demand: leveraging multiple radios to build self-organizing, energy-efficient pans.",
                    "Modeling of the channel-hopping anti-jamming defense in multi-radio wireless networks.",
                    "Using physical layer emulation to optimize and evaluate mobile and wireless systems.",
                    "Encryption-based access control for building management.",
                    "End user tool for deploying smart object systems.",
                    "Demonstration of a mobility-enhanced pedestrian navigation on mobile devices.",
                    "ScreenSpot resource discovery for smart spaces and mobilevue media sharing application.",
                    "Seamless indoor/outdoor positioning with streamspin.",
                    "Exploring NFC interactive panel.",
                    "RECOUP: efficient reconfiguration for wireless sensor networks.",
                    "Community multimedia cards: CoMu cards.",
                    "SimCon: a tool for modeling context sources for rapid evaluation of pervasive applications using virtual reality.",
                    "Determining user presence using context in a decentralized unified messaging system (IPAD-UMS).",
                    "Towards on embedded agent model for Android mobiles.",
                    "Using near field communication technology to achieve near-zero-configuration of sensors.",
                    "Sharing mobile user experiences with context-based mashups.",
                    "Application of ubiquitous technology to ship environment.",
                    "ScreenSpot: multidimensional resource discovery for distributed applications in smart spaces.",
                    "Evaluation of context distribution methods via Bluetooth and WLAN: insights gained while examining battery power consumption.",
                    "User-driven visual mashups in interactive public spaces.",
                    "A quantitative approach to non-intrusive computing.",
                    "Designing context-aware in-car information systems.",
                    "Towards mobility oriented interaction design: experiments in pedestrian navigation on mobile devices.",
                    "Avoiding \"big brother\" anxiety with progressive self-management of ubiquitous computing services.",
                    "Exploiting Schelling behavior for improving data accessibility in mobile peer-to-peer networks.",
                    "Predicting network availability using user context.",
                    "How to edit gigabyte XML files on a mobile phone with XAS, RefTrees, and RAXS.",
                    "Accessing speech documents on smartphones.",
                    "Online trajectory data reduction using connection-preserving dead reckoning.",
                    "A study on user acceptance of error visualization techniques.",
                    "Handwritten character recognition using orientation quantization based on 3D accelerometer.",
                    "Privacy-friendly user modelling for smart environments.",
                    "A multi-dimensional model enabling autonomic reasoning for context-aware pervasive applications.",
                    "Fundamental services for context-sensitive mobile applications.",
                    "A formalization of the SMEPP model in Maude.",
                    "A secure middleware for wireless sensor networks.",
                    "Tailoring service discovery to embedded P2P systems.",
                    "Implementation and performance analysis for key divergent and evolution protocols in wireless sensor network.",
                    "General security concept for embedded P2P systems.",
                    "An adaptive middleware applied to the ad-hoc nature of cardiac health care."
                ]
            }
        ]
    },
    {
        "year": "2007",
        "name": "MobiQuitous 2007",
        "info": "Philadelphia, PA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/mobiquitous/2007",
                "sub_name": "4th Annual International Conference on Mobile and Ubiquitous Systems (MobiQuitous 2007), August 6-10, 2007, Philadelphia, PA, USA.",
                "count": 75,
                "papers": [
                    "Musicology: Bringing Personal Music into Shared Spaces.",
                    "Large Surface Area Electronic Textiles for Ubiquitous Computing: A System Approach.",
                    "A Wireless Sensor Network and Incident Command Interface for Urban Firefighting.",
                    "Bypassing Bluetooth Device Discovery Using a Multimodal User Interface.",
                    "Improving Wireless Positioning with Look-ahead Map-Matching.",
                    "Energy-efficient Tracking of Mobile Objects with Early Distance-based Reporting.",
                    "Combining GPS and GSM Cell-ID positioning for Proactive Location-based Services.",
                    "Battery-Aware Embedded GPS Receiver Node.",
                    "Poster: Scalable Service-Oriented Telemetry Acquisition and Distribution.",
                    "A User-centered Approach to Context-awareness in Mobile Computing.",
                    "A new Routing & Mobility Management Solution for Wireless Mesh Network.",
                    "Poster: P2P search routing concepts for mobile object tracking.",
                    "Lightweight and Distributed Algorithms for Efficient Data-Centric Storage in Sensor Networks.",
                    "Hierarchical Trustworthy Authentication for Pervasive Computing.",
                    "Demo: Sensor Relocation with Mobile Sensors.",
                    "Demo: Implementation of Information-Provision Service with Smart Phone and Field Trial in Shopping Area.",
                    "A SpatioTemporal Placement Model for Caching Location Dependent Queries.",
                    "Assessing Standard and Inverted Skip Graphs Using Multi-Dimensional Range Queries and Mobile Nodes.",
                    "Application Based Distance Measurement for Context Retrieval in Ubiquitous Computing.",
                    "Content Source Selection in Bluetooth Networks.",
                    "Distributed Service Deployment in Mobile Ad-Hoc Networks.",
                    "Minimum Disruption Service Composition and Recovery over Mobile Ad Hoc Networks.",
                    "Route Discovery in Mobile Ad Hoc Networks: From Unilaterality to Bilaterality.",
                    "DETOUR: Delay- and Energy-Aware Multi-Path Routing in Wireless Ad Hoc Networks.",
                    "On Improving Dynamic Source Routing for Intermittently Available Nodes in MANETs.",
                    "Using Weighted Graphs for Computationally Efficient WLAN Location Determination.",
                    "Self-Managed Cell: A Middleware for Managing Body-Sensor Networks.",
                    "Temporary Interconnection of ZigBee Personal Area Network (PAN).",
                    "High Performance AODV Routing Protocol for Hybrid Wireless Mesh Networks.",
                    "Privacy-Preserving Detection of Sybil Attacks in Vehicular Ad Hoc Networks.",
                    "Network-Layer Assisted Mechanism to Optimize Authentication Delay during Handoff in 802.11 Networks.",
                    "TRULLO - local trust bootstrapping for ubiquitous devices.",
                    "Anonymous Data Collection in Sensor Networks.",
                    "Design and Evaluation of a Hybrid Physical Space Service for Pervasive Computing Applications.",
                    "NORS: An Open Source Platform to Facilitate Participatory Sensing with Mobile Phones.",
                    "Dynamic Channel Assignment and Link Scheduling in Multi-Radio Multi-Channel Wireless Mesh Networks.",
                    "Towards Scalable and Robust Service Discovery in Ubiquitous Computing Environments via Multi-hop Clustering.",
                    "Contextual Usage-Level Analysis of Mobile Services.",
                    "The Analysis of Publish/Subscribe Systems over Mobile Wireless Ad Hoc Networks.",
                    "Cooperative Dynamic Voltage Scaling using Selective Slack Distribution in Distributed Real-Time Systems.",
                    "Spatial Indexing for Location-Aware Systems.",
                    "A Ubiquitous Context-Aware Environment for Surgical Training.",
                    "Privacy Infusion in Ubiquitous Computing.",
                    "An Efficient Context-Aware Coordination Model for Ubiquitous Computing.",
                    "A Taxonomy of Specialized Ad Hoc Networks and Systems for Emergency Applications.",
                    "Towards Touching Interaction: A Simple Explicit Input.",
                    "IMOGA: An Architecture for Integrating Mobile Devices into Grid Applications.",
                    "Smart Tracker: Light Weight Infrastructure-less Assets Tracking solution for Ubiquitous Computing Environment.",
                    "Asynchronous Self-Localization of Sensor Networks with Large Clock Drift.",
                    "Optimal Relay Node Fault Recovery.",
                    "A Distributed Topology Control Algorithm in the Presence of Multipath Propagation.",
                    "Diffusion-based Approach to Deploying Wireless Sensors to Satisfy Coverage, Connectivity and Reliability.",
                    "Secure Multiple Deployment in Wireless Sensor Networks.",
                    "Secure Data Transmission of Wireless Sensor Network Based on Information Hiding.",
                    "Time Division Flooding Synchronization Protocol for Sensor Networks.",
                    "An Alamouti Coded Cooperative Transmission Robust to Both Timing Errors and Frequency Offsets.",
                    "Reliable Data Gathering in Tree-Based IEEE 802.15.4 Wireless Sensor Networks.",
                    "An Energy Efficiency Scheme Using Local SNR for Clustered Wireless Sensor Networks.",
                    "An Efficient Bi-directional Routing Protocol for Wireless Sensor Networks.",
                    "Adaptive Security Architecture based on EC-MQV Algorithm in Personal Network (PN).",
                    "Securing inter-cluster communication in Personal Networks.",
                    "Anomaly-Based Behavior Analysis of Wireless Network Security.",
                    "First experiences with Personal Networks as an enabling platform for service providers.",
                    "Design and Implementation of a VIPSec Based Application.",
                    "A Framework for the Self-organization of Personal Networks.",
                    "A Low-delay Protocol for Multihop Wireless Body Area Networks.",
                    "Cross Layer Design for Enhanced Quality Routing in Personal Wireless Networking.",
                    "Using Semantic Policies to Reason over User Availability.",
                    "Efficient User Controlled Inter-Domain SIP Mobility Authentication, Registration, and Call Routing.",
                    "Privacy Challenges in Context-sensitive Access Control for Pervasive Computing Environment.",
                    "Key Establishment Using Secure Distance Bounding Protocols.",
                    "A Ferry-based Intrusion Detection Scheme for Sparsely Connected Ad Hoc Networks.",
                    "Optimistic fair exchange for secure forwarding.",
                    "Securing Cooperative Transmission in Wireless Communications.",
                    "On Adjusting Power to Defend Wireless Networks from Jamming."
                ]
            }
        ]
    },
    {
        "year": "2006",
        "name": "MobiQuitous 2006",
        "info": "San Jose, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/mobiquitous/2006",
                "sub_name": "3rd Annual International ICST Conference on Mobile and Ubiquitous Systems: Computing, Networking and Services, MOBIQUITOUS 2006, San Jose, California, USA, July 17-21, 2006.",
                "count": 77,
                "papers": [
                    "Location Privacy of Users in Location-based Services.",
                    "The Software-as-a-Service Model for Mobile and Ubiquitous Computing Environments.",
                    "Learning Sensor Data Characteristics in Unknown Environments.",
                    "The Impact of the Context Interpretation Error on the Context Prediction Accuracy.",
                    "Pervaho: A Development & Test Platform for Mobile Ad hoc Applications.",
                    "POISE: An Inexpensive, Low-Power Location Sensor Based on Electrostatics.",
                    "A Generic Large Scale Simulator for Ubiquitous Computing.",
                    "Optimal Actuation Strategies for Sensor/Actuator Networks.",
                    "Context-Based Adaptation of Mobile Phones Ussing Near-Field Communication.",
                    "A Framework to Provide Anonymity in Reputation Systems.",
                    "SIPCache: A Distributed SIP Location Service for Mobile Ad-Hoc Networks.",
                    "Adaptilve Data Collectilon Scheme for Trackilng Mobille Target in Wireless Sensor Networks.",
                    "Generalized \"Yoking-Proofs\" for a Group of RFID Tags.",
                    "Decomposing Data-Centric Storage Query Hot-Spots in Sensor Networks.",
                    "Using Location Dependence to Manage Mobile Data.",
                    "Interference based Call Admission Control for Wireless Ad Hoc Networks.",
                    "Overload-Driven Mobility-Aware Cache Management in Wireless Environments.",
                    "A Cross-layer Decentralized BitTorrent for Mobile Ad hoc Networks.",
                    "APHD: End-to-End Delay Assurance in 802.11e Based MANETs.",
                    "A Comparative Study of Data Dissemination Models for VANETs.",
                    "An Empirical Evaluation of the Student-Net Delay Tolerant Network.",
                    "Controlled Epidemic-style Dissemination Middleware for Mobile Ad Hoc Networks.",
                    "Sleeper: A Power-Conserving Service Discovery Protocol.",
                    "MURU: A Multi-Hop Routing Protocol for Urban Vehicular Ad Hoc Networks.",
                    "Non-Inference: An Information Flow Control Model for Location-based Services.",
                    "Rapid Dual Channel Frequency and Frame Synchronizer for OFDM Packet Transmission.",
                    "Biometric Authentication for a Mobile Personal Device.",
                    "TypeCast: Type-Based Routing in Wireless Ad-hoc Networks.",
                    "A Generic Context Management Framework for Personal Networking Environments.",
                    "Bridging the Gap between Privacy and Security in Multi-Domain Federations with Identity Tokens.",
                    "Strategies for Context-Adaptive Message Dissemination in Vehicular Ad Hoc Networks.",
                    "Removing The Barriers to Ubiquitous Services : A User Perspective.",
                    "Towards Useful and Usable Services in Personal Networks.",
                    "Architectural and QoS Aspects of Personal Networks.",
                    "Channel Modeling for V2V Communications.",
                    "Service Composition for Mobile Personal Networks.",
                    "A Framework for Opportunistic Forwarding in Disconnected Networks.",
                    "A Security Architecture for Personal Networks.",
                    "The Wireless Autonomous Spanning tree Protocol for Multihop Wireless Body Area Networks.",
                    "A Data Intensive Reputation Management Scheme for Vehicular Ad Hoc Networks.",
                    "Access Control and Authentication for Converged Wireless Networks.",
                    "Using semantic policies for ad-hoc coalition access control.",
                    "LAAC: A Location-Aware Access Control Protocol.",
                    "Byzantine Generals Problem in the Light of P2P Computing.",
                    "On the definition and relevance of context-awareness in Personal Networks.",
                    "A Method for Sharing Traffic Jam Information using Inter-Vehicle Communication.",
                    "Identifying meaningful locations.",
                    "Optimized inter-vehicle communications using NEMO and MANET.",
                    "A new paradigm of V2V communication services using Nomadic Agent.",
                    "Survey of Routing Protocols for Inter-Vehicle Communications.",
                    "FleaNet: A Virtual Market Place on Vehicular Networks.",
                    "Introduction and Preliminary Experimental Results of Wireless Access for Vehicular Environments (WAVE) Systems.",
                    "Automesh: Flexible Simulation Framework for Vehicular Communication.",
                    "Dynamic Local Peer Group Organizations for Vechicle Communications.",
                    "Location-Based Flooding Techniques for Vehicular Emergency Messaging.",
                    "Ubiquitous Access Control and Policy Management in Personal Networks.",
                    "Application-Centric Networking Framework for Wireless Sensor Nodes.",
                    "A Novel Decentralized Hierarchical Access Control Scheme for the Medical Scenario.",
                    "GrooveNet: A Hybrid Simulator for Vehicle-to-Vehicle Networks.",
                    "Rate Control to Reduce Bioeffects in Wireless Biomedical Sensor Networks.",
                    "A Cluster-Based Coverage-Preserved Node Scheduling Scheme in Wireless Sensor Networks.",
                    "Architectures for Communication in Personal Networks.",
                    "Bottleneck around Base Station in Wireless Sensor Network and its Solution.",
                    "Personal Networks: An Overlay Network of Wireless Personal Area Networks and 3G Networks.",
                    "TinySIP: Providing Seamless Access to Sensor-based Services.",
                    "A Multi-Protocol Approach to Service Discovery and Access in Pervasive Environments.",
                    "Distributed Reputation System for Tracking Applications in Sensor Networks.",
                    "Context-Aware Access Control; Making Access Control Decisions Based on Context Information.",
                    "Efficient Scheduling for Sensor Networks.",
                    "Metric-Based Scatternet Formation and Recovery Optimization for Intel Mote.",
                    "Challenges on providing services in a Ubiquitous, Mobile Environment.",
                    "SIP roaming solution amongst different WLAN-based service providers.",
                    "Towards Balancing Medium Access Energy Trade-Offs in Wireless Sensor Networks.",
                    "Dynamic multiband antenna system for high capacity data communications to mobile platforms.",
                    "Randomized 3D Position-based Routing Algorithms for Ad-hoc Networks.",
                    "Exploiting Access Control Information in User Profiles to Reconfigure User Equipment.",
                    "A Discrete Distributed Topology-control Algorithm of Wireless Sensor Network."
                ]
            }
        ]
    },
    {
        "year": "2005",
        "name": "MobiQuitous 2005",
        "info": "San Diego, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/mobiquitous/2005",
                "sub_name": "2nd Annual International Conference on Mobile and Ubiquitous Systems (MobiQuitous 2005), 17-21 July 2005, San Diego, CA, USA.",
                "count": 64,
                "papers": [
                    "Title Page.",
                    "Copyright.",
                    "Message from the General Chairs.",
                    "Organizing Committee.",
                    "Technical Program Committee.",
                    "A Reputation-based Mechanism for Isolating Selfish Nodes in Ad Hoc Networks.",
                    "Secure Reporting of Traffic Forwarding Activity in Mobile Ad Hoc Networks.",
                    "Defend Against Cache Consistency Attacks in Wireless Ad Hoc Networks.",
                    "An ECA-P Policy-based Framework for Managing Ubiquitous Computing Environments.",
                    "Content-Based Routing in Mobile Ad Hoc Networks.",
                    "Multi-Constraint Dynamic Access Selection in Always Best Connected Networks.",
                    "Extended ZRP: a Routing Layer Based Service Discovery Protocol for Mobile Ad Hoc Networks.",
                    "Market Models and Pricing Mechanisms in a Multihop Wireless Hotspot Network.",
                    "SWAT: Small World-based Attacker Traceback in Ad-hoc Networks.",
                    "Correlation Analysis for Alleviating Effects of Inserted Data in Wireless Sensor Networks.",
                    "E.cient Aggregation of encrypted data in Wireless Sensor Networks.",
                    "Practical Broadcast Authentication in Sensor Networks.",
                    "PPP Migration: A Technique for Low-Latency Handoff in CDMA2000 Networks.",
                    "A Relay Based MAC Protocol to Support Multi-rate Feature in Mobile Ad Hoc Networks.",
                    "MPA assisted Optimized Proactive Handoff Scheme.",
                    "An Enhanced Dynamic Framed Slotted ALOHA Algorithm for RFID Tag Identification.",
                    "Loosely Coupling Ontological Reasoning with an Efficient Middleware for Context-awareness.",
                    "Contextualizing Applications via Semantic Middleware.",
                    "Plethora: A Framework for Converting Generic Applications to Run in a Ubiquitous Environment.",
                    "Exploiting co-location history for ef.cient service selection in ubiquitous computing systems.",
                    "A Generalization of the Face Routing Algorithm to a Class of Non-Planar Networks.",
                    "Routing in MANETs with Address Conflicts.",
                    "Transparent Heterogeneous Mobile Ad Hoc Networks.",
                    "SRDP: Securing Route Discovery in DSR.",
                    "On Incremental Processing of Continual Range Queries for Location-Aware Services and Applications.",
                    "Decentralizing Query Processing in Sensor Networks.",
                    "Energy Efficient Processing of K Nearest Neighbor Queries in Location-aware Sensor Networks.",
                    "A Location Aware Mobile Tourist Guide Selecting and Interpreting Sights and Services by Context Matching.",
                    "Decentralized Optimization of Dynamic Bluetooth Scatternets.",
                    "Improving Connectivity ofWireless Ad Hoc Networks.",
                    "Ef.cient Continuous Mapping in Sensor Networks Using Isolines.",
                    "A Peer-to-Peer Architecture for Context Lookup.",
                    "Community-Based Asynchronous Wakeup Protocol for Wireless Peer-to-Peer File Sharing Networks.",
                    "Multivariate Analysis for Probabilistic WLAN Location Determination Systems.",
                    "Proxy-based Hand-off of Web Sessions for User Mobility.",
                    "WebProfiles: A Negotiation Model for User Awareness in Personal Area Networks.",
                    "A SIP-based Architecture model for Contextual Coalition Access Control for Ubiquitous Computing.",
                    "A Cooperative Learning Framework for Mobility-Aware Resource Management in Multi-Inhabitant Smart Homes.",
                    "Multi-path Admission Control for Mobile Ad hoc Networks.",
                    "Personal AP Protocol for Mobility Management in IEEE 802.11 Systems.",
                    "On Upper Bound and Heuristics for Multicast Lifetime Maximization Using Dynamic Routing in Energy-Limited Wireless Ad Hoc Networks.",
                    "A Feedback Control Scheme for Resource Allocation in Wireless Multi-hop Ad Hoc Networks.",
                    "StateSnap: A Snapshot-based Interface for State-Reproductable Operation of Networked Appliances.",
                    "Bluetooth Base Station Minimal Deployment for High Definition Positioning.",
                    "An Assessment of the Audio Codec Performance in Voice over WLAN (VoWLAN) Systems.",
                    "Dynamically Re-Configurable Communication Protocols using Key Identifiers.",
                    "An Analysis of Strategies for Mitigating the Sensor Network Hot Spot Problem.",
                    "Wireless Sensor Networks for Health Monitoring.",
                    "Agent Negotiation in Ad-Hoc Networks.",
                    "Building a Ubiquitous Platform for Remote Sensing Using Smartphones.",
                    "Orion: P2P-based Inter-Space Context Discovery Platform.",
                    "MAIPAN - Middleware for Application Interconnection in Personal Area Networks.",
                    "KTR: an Efficient Key Management Scheme For Air Access Control.",
                    "Temporal Transcoding for Mobile Video Communication.",
                    "Embedded SW Design Issues for Distributed Applications on Mobile Terminals.",
                    "An Efficient Peer-to-Peer Lookup Protocol for Location-Aware Mobile Ad Hoc Networks.",
                    "Design and Implementation of a Software Infrastructure for Integrating Sentient Artefact.",
                    "Geographically Bound Mobile Agent in MANET.",
                    "Secure Address Auto-con.guration for Mobile Ad Hoc Networks."
                ]
            }
        ]
    },
    {
        "year": "2004",
        "name": "MobiQuitous 2004",
        "info": "Boston, Massachusetts, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/mobiquitous/2004",
                "sub_name": "1st Annual International Conference on Mobile and Ubiquitous Systems (MobiQuitous 2004), Networking and Services, 22-25 August 2004, Cambridge, MA, USA.",
                "count": 45,
                "papers": [
                    "LOCADIO: Inferring Motion and Location from Wi-Fi Signal Strengths.",
                    "Properties of Indoor Received Signal Strength for WLAN Location Fingerprinting.",
                    "An Integrated, Low Power Localization System for Sensor Networks.",
                    "Wireless Wallet.",
                    "GKMPAN: An Efficient Group Rekeying Scheme for Secure Multicast in Ad-Hoc Networks.",
                    "Composite Key Management for Ad Hoc Networks.",
                    "Efficient Data Prefetching for Power-Controlled Wireless Packet Networks.",
                    "Profile Based Caching to Enhance Data Availability in Push/Pull Mobile Environments.",
                    "Vision-Based Interfaces for Mobility.",
                    "Optimal Customer Provisioning in Network-Based Mobile VPNs.",
                    "User Identity Based Session Redirection in CDMA2000 Networks.",
                    "Adaptive Video Streaming in Vertical Handoff: A Case Study.",
                    "A Vehicle-to-Vehicle Communication Protocol for Cooperative Collision Warning.",
                    "What Are the Characteristics of Optimal Bluetooth Scatternets?",
                    "Leveraging Mobility to Improve Quality of Service in Mobile Networks.",
                    "The ubiQoS Middleware for Audio Streaming to Bluetooth Devices.",
                    "Lilith: An Interconnection Architecture Based on Label Switching for Spontaneous Edge Networks.",
                    "Dual Prediction-Based Reporting for Object Tracking Sensor Networks.",
                    "Efficient Tracking of Moving Objects with Precision Guarantees.",
                    "An Ubiquitous Architectural Framework and Protocol for Object Tracking Using RFID Tags.",
                    "Correlation Analysis and Applications in Wireless Microsensor Networks.",
                    "Ontology-Driven Adaptive Sensor Networks.",
                    "A Framework for Energy-Saving Data Gathering Using Two-Phase Clustering in Wireless Sensor Networks.",
                    "Challenges and Lessons Learned in Building a Practical Smart Space.",
                    "Processing Continual Range Queries over Moving Objects Using VCR-Based Query Indexes.",
                    "Search Continuous Nearest Neighbors on the Air.",
                    "Design and Implementation of a Large-Scale Context Fusion Network.",
                    "SOUPA: Standard Ontology for Ubiquitous and Pervasive Applications.",
                    "sTuples: Semantic Tuple Spaces.",
                    "Organizing Ad Hoc Agents for Human-Agent Service Matching.",
                    "Profile Aggregation and Policy Evaluation for Adaptive Internet Services.",
                    "Enforcing Policies in Pervasive Environments.",
                    "Dynamic Service Discovery and Management in Task Computing.",
                    "GloServ: Global Service Discovery Architecture.",
                    "In Reputation We Believe: Query Processing in Mobile Ad-Hoc Networks.",
                    "CoCo: Dynamic Composition of Context Information.",
                    "Messengers for the Dynamic Management of Distributed UDDI Registries.",
                    "Service Delivery in Smart Environments by Implicit Organizations.",
                    "Minimising Intrusiveness in Pervasive Computing Environments Using Multi-Agent Negotiation.",
                    "ContentCascade Incremental Content Exchange between Public Displays and Personal Devices.",
                    "A Middleware Infrastracture for Building Mixed Reality Applications in Ubiquitous Computing Environments.",
                    "Design and Implementation of an Extensible Rule Processing System for Wearable Computing.",
                    "Mobile Polymorphic Applications in Ubiquitous Computing Environments.",
                    "Portable Smart Messages for Ubiquitous Java-Enabled Devices.",
                    "Migratable User Interfaces: Beyond Migratory Interfaces."
                ]
            }
        ]
    }
]