[
    {
        "year": "2021",
        "name": "23rd Mobile HCI 2021",
        "info": "Toulouse & Virtual Event, France",
        "venues": [
            {
                "sub_name_abbr": "conf/mhci/2021",
                "sub_name": "MobileHCI '21: 23rd International Conference on Mobile Human-Computer Interaction, Toulouse & Virtual Event, France, 27 September 2021 - 1 October 2021.",
                "count": 49,
                "papers": [
                    "MagneTrack: Magnetic Field Separation Method for Continuous and Simultaneous 1-DOF Tracking of Two-magnets.",
                    "ThumbTrak: Recognizing Micro-finger Poses Using a Ring with Proximity Sensing.",
                    "3D Hand Pose Estimation on Conventional Capacitive Touchscreens.",
                    "An Interactive Design Space for Wearable Displays.",
                    "SF-LG: Space-Filling Line Graphs for Visualizing Interrelated Time-series Data on Smartwatches.",
                    "OM: A Comprehensive Tool to Elicit Subjective Vibrotactile Expressions Associated with Contextualised Meaning in Our Everyday Lives.",
                    "EdgeMark Menu: A 1D Menu for Curved Edge Display Smartphones.",
                    "Multimodal Icon Annotation For Mobile Applications.",
                    "Understanding User Strategies When Touching Arbitrary Shaped Objects.",
                    "A Scenario Adaptive Model for Predicting Error Rates in Moving Target Selection on Smartphones.",
                    "How We Swipe: A Large-scale Shape-writing Dataset and Empirical Findings.",
                    "ARO: Exploring the Design of Smart-Ring Interactions for Encumbered Hands.",
                    "Informed Choices, Progress Monitoring and Comparison with Peers: Features to Support the Autonomy, Competence and Relatedness Needs, as Suggested by the Self-Determination Theory.",
                    "Facilitating Bodily Insights Using Electromyography-Based Biofeedback during Physical Activity.",
                    "'I Don't Need a Goal': Attitudes and Practices in Fitness Tracking beyond WEIRD User Groups.",
                    "StepUp Forecast: Predicting Future to Promote Walking.",
                    "Anticipatory Detection of Compulsive Body-focused Repetitive Behaviors with Wearables.",
                    "Observing and Clustering Coaching Behaviours to Inform the Design of a Personalised Robotic Coach.",
                    "Towards Transparent Behavior of Automated Vehicles: Design and Evaluation of HUD Concepts to Support System Predictability Through Motion Intent Communication.",
                    "Increasing Pedestrian Safety Using External Communication of Autonomous Vehicles for Signalling Hazards.",
                    "Chat or Tap? - Comparing Chatbots with 'Classic' Graphical User Interfaces for Mobile Interaction with Autonomous Mobility-on-Demand Systems.",
                    "Investigating the Design of Information Presentation in Take-Over Requests in Automated Vehicles.",
                    "Understanding Drone Landing on the Human Body.",
                    "Drones in Firefighting: A User-Centered Design Perspective.",
                    "Public Drone: Attitude Towards Drone Capabilities in Various Contexts.",
                    "Nosype: A Novel Nose-tip Tracking-based Text Entry System for Smartphone Users with Clinical Disabilities for Touch-based Typing.",
                    "RePlay: Touchscreen Interaction Substitution Method for Accessible Gaming.",
                    "Using Computer Simulations to Investigate the Potential Performance of 'A to B' Routing Systems for People with Mobility Impairments.",
                    "Modeling Gliding-based Target Selection for Blind Touchscreen Users.",
                    "An Exploratory Study of Social Support Systems to Help Older Adults in Managing Mobile Safety.",
                    "Grab the Frog: Comparing Intuitive Use and User Experience of a Smartphone-only, AR-only, and Tangible AR Learning Environment.",
                    "AR-enhanced Widgets for Smartphone-centric Interaction.",
                    "Estimation of Human Sensitivity for Curvature Gain of Redirected Walking Technology.",
                    "Mobile Screen-based User Interface Design Guideline for Panoramic VR in Shopping Scene.",
                    "Understanding Bystanders' Tendency to Shoulder Surf Smartphones Using 360-degree Videos in Virtual Reality.",
                    "Ubiquitous Interactions for Heads-Up Computing: Understanding Users' Preferences for Subtle Interaction Techniques in Everyday Settings.",
                    "Bus Stop Spotting: a Field Experiment Comparing 2D Maps, Augmented Reality and 3D Maps.",
                    "StressShoe: A DIY Toolkit for just-in-time Personalised Stress Interventions for Office Workers Performing Sedentary Tasks.",
                    "Rainmaker: A Tangible Work-Companion for the Personal Office Space.",
                    "Evaluating Prototype Augmented and Adaptive guidance system to support Industrial Plant Maintenance.",
                    "Verbose : Designing a Context-based Educational System for Improving Communicative Expressions.",
                    "Development and Evaluation of a Tablet-Based Reading Fluency Test for Primary School Children.",
                    "'I would have Preferred an Ankle Tag': The Lived Experience of a Nationwide Quarantine App.",
                    "Exploring Designers' Practice of Online Example Management for Supporting Mobile UI Design.",
                    "Talk to Me on My Level - Linguistic Alignment for Chatbots.",
                    "Inviting Participants' Peers in a Mobile Assessment Study: An Empirical Investigation.",
                    "User Burden of Microinteractions: An In-lab Experiment Examining User Performance and Perceived Burden Related to In-situ Self-reporting.",
                    "Exploring Privacy Aspects of Smartphone Notifications.",
                    "\"It's Like Being Gone For A Second\": Using Subjective Evidence-Based Ethnography to Understand Locked Smartphone Use Among Young Adults."
                ]
            },
            {
                "sub_name_abbr": "conf/mhci/2021ea",
                "sub_name": "MobileHCI '21: 23rd International Conference on Mobile Human-Computer Interaction, Extented Abstracts, oulouse & Virtual Event, France, 27 September 2021- 1 October 2021.",
                "count": 29,
                "papers": [
                    "Resync: Towards Transferring Somnolent Passengers to Consciousness.",
                    "An Augmented Reality Guided Capture Platform for Structured and Consistent Product Reference Imagery.",
                    "Fostering digital literacy through a mobile demo-kit development: Co-designing didactic prototypes with older adults.",
                    "EyeKnowYou: A DIY Toolkit to Support Monitoring Cognitive Load and Actual Screen Time using a Head-Mounted Webcam.",
                    "Designing a mobile AR application for improving pediatric psychological wellbeing.",
                    "BLEXVFR: Designing a Mobile Assistant for Pilots.",
                    "Choice of Social Music Systems in China: A Study of NetEase Cloud Music.",
                    "Understanding the influence of stress on sedentary workers' sitting behavior in screen-based interaction context.",
                    "Towards Understanding Users' Engagement and Enjoyment in Immersive Virtual Reality-Based Exercises.",
                    "scrAPP: Enabling Reuse of Scrap Materials with a Smartphone.",
                    "\"The Dementia Diva Strikes Again!\": A Thematic Analysis of How Informal Carers of Persons with Dementia Use TikTok.",
                    "Exploring the Design of Streaming Data Interfaces for Emergency Medical Contexts.",
                    "Exploring an Opportunity to Support Local Food Systems through Online Food Delivery Services with Live-Streaming Farms in China.",
                    "Lessons Learned from Supporting Low-income Older Adults to Use a Tablet PC in the Age of Digital Divide.",
                    "Towards Designing Human-Centered Time Management Interfaces: The Development of 14 UX Design Guidelines for Time-related Experiences in Mobile HCI.",
                    "Predicting population exclusion for services dependent on mobile digital interfaces.",
                    "Towards Understanding Physiological Responses to Emotional Autobiographical Memory Recall in Mobile VR Scenarios.",
                    "Investigating Page Turning Methods for Sheet Music during Piano Play.",
                    "A Mobile Tool that Helps Nonexperts Make Sense of Pretrained CNN by Interacting with Their Daily Surroundings.",
                    "AR-some Chemistry Models: Interactable 3D Molecules through Augmented Reality.",
                    "Low-level Voice and Hand-Tracking Interaction Actions: Explorations with Let's Go There.",
                    "SiteSCAN: Intuitive Exchange of Spatial Information in Mixed Reality.",
                    "Designing Mobile EEG Neurofeedback Games for Children with Autism.",
                    "Encouraging Improvisation in Piano LearningUsing Adaptive Visualisations and Spatiotemporal Models.",
                    "Instructional Guidance in Extended Reality for Learning.",
                    "Everyday Emergencies: Challenges and Designs Involving 9-1-1 Systems.",
                    "VROOM - Measurement and Design Research for Virtual Reality in Automated Vehicles.",
                    "2nd Workshop on Mobile Resilience: Designing Mobile Interactive Systems for Crisis Response.",
                    "Interactive Technology for Cycling - ideate, make - remote, together."
                ]
            }
        ]
    },
    {
        "year": "2020",
        "name": "22nd Mobile HCI 2020",
        "info": "Oldenburg, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/mhci/2020",
                "sub_name": "MobileHCI '20: 22nd International Conference on Human-Computer Interaction with Mobile Devices and Services, Oldenburg, Germany, October 5-9, 2020.",
                "count": 39,
                "papers": [
                    "Modeling User-Centered Page Load Time for Smartphones.",
                    "A Survey of Patterns for Adapting Smartphone App UIs to Smart Watches.",
                    "Understanding Visual Saliency in Mobile User Interfaces.",
                    "Exploring 3D Objects with Non-Linear Perspectives in Real-Time, a First User Study.",
                    "VibroComm: Using Commodity Gyroscopes for Vibroacoustic Data Reception.",
                    "Exploring Fitness Tracker Visualisations to Avoid Rumination.",
                    "StrengthGaming: Enabling Dynamic Repetition Tempo in Strength Training-based Exergame Design.",
                    "Medical Selfies: Emotional Impacts and Practical Challenges.",
                    "Extracting Daytime-Dependent Alertness Patterns from Mobile Game Data.",
                    "Lung Function Estimation from a Monosyllabic Voice Segment Captured Using Smartphones.",
                    "Augmenting Public Bookcases to Support Book Sharing.",
                    "Distance-Dependent Barcodes for Context-Aware Mobile Applications.",
                    "Evaluating Menu Techniques for Handheld AR with a Smartphone & Mid-Air Pen.",
                    "Tent Mode Interactions: Exploring Collocated Multi-User Interaction on a Foldable Device.",
                    "Director-360: Introducing Camera Handling to 360 Cameras.",
                    "MAGHair: A Wearable System to Create Unique Tactile Feedback by Stimulating Only the Body Hair.",
                    "Headbang: Using Head Gestures to Trigger Discrete Actions on Mobile Devices.",
                    "Active PinScreen: Exploring Spatio-Temporal Tactile Feedbackfor Multi-Finger Interaction.",
                    "Physio-Stacks: Supporting Communication with Ourselves and Others via Tangible, Modular Physiological Devices.",
                    "Is Implicit Authentication on Smartphones Really Popular? On Android Users' Perception of \"Smart Lock for Android\".",
                    "Attracktion: Field Evaluation of Multi-Track Audio as Unobtrusive Cues for Pedestrian Navigation.",
                    "Save the Smombies: App-Assisted Street Crossing.",
                    "Brotate and Tribike: Designing Smartphone Control for Cycling.",
                    "Point Me In the Right Direction: Understanding User Behaviour with As-The-Crow-Flies Navigation.",
                    "Disaster Strikes! Internet Blackout! What's the Fate of Crisis Mapping?",
                    "Characterizing the Mobile Microtask Writing Process.",
                    "STAT: Subtle Typing Around the Thigh for Head-Mounted Displays.",
                    "Messaging Beyond Texts with Real-time Image Suggestions.",
                    "Investigating Performance and Usage of Input Methods for Soft Keyboard Hotkeys.",
                    "VoiceMessage++: Augmented Voice Recordings for Mobile Instant Messaging.",
                    "LiveSnippets: Voice-based Live Authoring of Multimedia Articles about Experiences.",
                    "Characterizing the Effect of Audio Degradation on Privacy Perception And Inference Performance in Audio-Based Human Activity Recognition.",
                    "Augmenting Conversational Agents with Ambient Acoustic Contexts.",
                    "See What I'm Saying? Comparing Intelligent Personal Assistant Use for Native and Non-Native Language Speakers.",
                    "\"They Like to Hear My Voice\": Exploring Usage Behavior in Speech-Based Mobile Instant Messaging.",
                    "\"I'd like an Explanation for That!\"Exploring Reactions to Unexpected Autonomous Driving.",
                    "What If Your Car Would Care? Exploring Use Cases For Affective Automotive User Interfaces.",
                    "Increasing User Experience and Trust in Automated Vehicles via an Ambient Light Display.",
                    "A Long-Term Evaluation of Adaptive Interface Design for Mobile Transit Information."
                ]
            },
            {
                "sub_name_abbr": "conf/mhci/2020ea",
                "sub_name": "MobileHCI '20: 22nd International Conference on Human-Computer Interaction with Mobile Devices and Services: Expanding the Horizon of Mobile Interaction, Extented Abstracts, Oldenburg, Germany, October 5-9, 2020.",
                "count": 60,
                "papers": [
                    "Voice Assistants as Learning Companions: An Initial Exploration With Computer Science Students.",
                    "Performance of Mobile Users on Side Drawer and Bottom Drawer Menus.",
                    "Interaction (f)or Recall? Evaluating Recall on Large Screens.",
                    "Impact of using UI Design Patterns on the Workload of Rapid Prototyping of Smartphone Applications: An Experimental Study.",
                    "How Throbber Components Affect Users' Perception of Waiting Time.",
                    "Restaurant Menu Understanding: Illustrating the Need for Culturally Augmented Translation.",
                    "Quantifying the Consistency of Gesture Articulation for Users with Low Vision with the Dissimilarity-Consensus Method.",
                    "Exploring the Presentation of Estimated Receptivity Status for Instant Messaging.",
                    "Enrico: A Dataset for Topic Modeling of Mobile UI Designs.",
                    "Emobook: A Multimedia Life Story Book App for Reminiscence Intervention.",
                    "Investigating Smartphones and AR Glasses for Pedestrian Navigation and their Effects in Spatial Knowledge Acquisition.",
                    "Student Informal Learning at Museum Field Trips using Tablet Computers.",
                    "Dots - An Inclusive Natural User Interfaces (NUI) for Spatial Computing.",
                    "Content-Aware Automated Parameter Tuning for Approximate Color Transforms.",
                    "Understanding Decline in Medical Video Consultation: A User-Centred Approach.",
                    "On the Impact of Context-Aware Notifications on Exercising.",
                    "The Wearable Radar: Sensing Gestures Through Fabrics.",
                    "Note-on-Watch: Live Scribing from Board-works to Class-notes.",
                    "PassO - New Circular Patter Lock Scheme Evaluation.",
                    "The Effect of Latency on High Precision Micro Instructions in Mobile AR.",
                    "Impact of Situational Impairment on Interaction with Wearable Displays.",
                    "Advocating for Users' Privacy Protections: A Case study of COVID-19 apps.",
                    "Linguistic Features to Consider When Applying Persona of the Real Person to the Text-based Agent.",
                    "Aco-Wi : Acoustic Initiated Wi-Fi Peer-group Communication for Opportunistic Messaging.",
                    "All Tomorrow's Parties: Empowerment Game for Young Adults.",
                    "A Demonstration of an interactive Virtual Reality Prototype for Exploring the Cultural Heritage of Southern African Rock Art.",
                    "Azalea: Co-experiencing Embodied Information in Remote Communication.",
                    "Emotional Response Language Education for Mobile Devices.",
                    "Having a Heart Time? A Wearable-based Biofeedback System.",
                    "StrengthGaming: Enabling Dynamic Repetition Tempo in Strength Training-based Exergame Design.",
                    "Touchless Gestures for Interactive Messaging: Gesture Interface for Sending Emoji.",
                    "Pinhole Paper: Making Static Objects Perceptually Dynamic with Rear Projection on Perforated Paper.",
                    "Towards an Understanding of Real-time Captioning on Head-worn Displays.",
                    "Let's Go There: Voice and Pointing Together in VR.",
                    "A Digital Companion for Air Travelers.",
                    "Understanding Statistics.",
                    "Smartphone and Sensor based Health Monitoring Enabled with IoT and ML.",
                    "Integrating Trust Measurements into Experimental Designs.",
                    "Mobile Learning Model for the Zimbabwe Higher Education Sector.",
                    "Environment-Triggered Microlearning.",
                    "A Mobile App to Combat Loneliness and Social Isolation Among University Students.",
                    "Context Aware Photo Protection for In-Situ Sharing.",
                    "WeCARe: Workshop on Inclusive Communication between Automated Vehicles and Vulnerable Road Users.",
                    "Mobile Resilience: Designing Mobile Interactive Systems for Societal and Technical Resilience.",
                    "Learning from mHealth Success Stories: Effective Interventions for Marginalised Populations.",
                    "Workshop on Designing Technologies for Future Forms of Sustainable Mobility.",
                    "DatEthics: Ethical Data-Centric Design of Intelligent Behaviour.",
                    "Cloudless Skies? Decentralizing Mobile Interaction.",
                    "Mobile and Wearable Interactions in the Retail Domain.",
                    "Challenges of Sustainable Urban Mobility Integration.",
                    "Gamifying the \"unspoken\": Designing to Resolve Myths on Contraceptives among the Himba people of Namibia.",
                    "Designing for Technology-Enabled Social-Ecological Resilience.",
                    "Psychosocial ICT - Therapeutic Methods becoming Self-Help Tools.",
                    "The Challenge of \"Informal mHealth\" and Community Health Worker Practices.",
                    "Home-Based Rehabilitation Coach for Stroke Survivors! A Critical Reflection.",
                    "Crisis Volunteering Nerds: Three Months After COVID-19 Hackathon #WirVsVirus.",
                    "Crisis Informatics Challenges From A Political Science Perspective.",
                    "Data-Driven System for Treatment of Obese Children in Rural Areas.",
                    "Watch Your Vehicle Driving at the City: Interior HMI with Augmented Reality for Automated Driving.",
                    "The Evolution of Driver Monitoring Systems: A Shortened Story on Past, Current and Future Approaches How Cars Acquire Knowledge About the Driver's State."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "21st Mobile HCI 2019",
        "info": "Taipei, Taiwan",
        "venues": [
            {
                "sub_name_abbr": "conf/mhci/2019",
                "sub_name": "Proceedings of the 21st International Conference on Human-Computer Interaction with Mobile Devices and Services, MobileHCI 2019, Taipei, Taiwan, October 1-4, 2019.",
                "count": 80,
                "papers": [
                    "SeeingHaptics: Visualizations for Communicating Haptic Designs.",
                    "Investigating Smartphone-based Pan and Zoom in 3D Data Spaces in Augmented Reality.",
                    "Understanding Emoji Interpretation through User Personality and Message Context.",
                    "The Influence of Hand Size on Touch Accuracy.",
                    "Mapping Perceptions of Humanness in Intelligent Personal Assistant Interaction.",
                    "Tiger: Wearable Glasses for the 20-20-20 Rule to Alleviate Computer Vision Syndrome.",
                    "From Design to Development to Evaluation of a Pregnancy App for Low-Income Women in a Community-Based Setting.",
                    "Exploring Cross-Modal Training via Touch to Learn a Mid-Air Marking Menu Gesture Set.",
                    "How do People Type on Mobile Devices?: Observations from a Study with 37, 000 Volunteers.",
                    "Help!: I'm Stuck, and there's no F1 Key on My Tablet!",
                    "WatchPen: Using Cross-Device Interaction Concepts to Augment Pen-Based Interaction.",
                    "Cake Cam: Take Your Photo and Be in it Too.",
                    "Efficient Speech-Recognition Error-Correction Interface for Japanese Text Entry on Smartwatches.",
                    "I Think It's Her: Investigating Smartphone Users' Speculation about Phone Notifications and Its Influence on Attendance.",
                    "The Limits of Expert Text Entry Speed on Mobile Keyboards with Autocorrect.",
                    "An Evaluation of Discrete and Continuous Mid-Air Loop and Marking Menu Selection in Optical See-Through HMDs.",
                    "Visualising Location Uncertainty to Support Navigation under Degraded GPS Signals: a Comparison Study.",
                    "Private Reader: Using Eye Tracking to Improve Reading Privacy in Public Spaces.",
                    "WRIST: Watch-Ring Interaction and Sensing Technique for Wrist Gestures and Macro-Micro Pointing.",
                    "Touch Pointing Performance for Uncertain Touchable Sizes of 1D Targets.",
                    "HasAnswers: Development of a Mobile Service to Support Young People to Find and Keep a Home.",
                    "Challenges of Parkinson's Disease: User Experiences with STOP.",
                    "Using Poke Stimuli to Improve a 3x3 Watch-back Tactile Display.",
                    "Exploring the Use of Fingerprint Sensor Gestures for Unlock Journaling: A Comparison With Slide-to-X.",
                    "Gesture-Based Auto-Completion of Handwritten Text.",
                    "Tangible Around-Device Interaction Using Rotatory Gestures with a Magnetic Ring.",
                    "Investigating the Influence of External Car Displays on Pedestrians' Crossing Behavior in Virtual Reality.",
                    "EEG-based Measures of Auditory Saliency in a Complex Context.",
                    "Explicit Disaster Response Features in Social Media: Safety Check and Community Help Usage on Facebook during Typhoon Mangkhut.",
                    "Interacting with Autostereograms.",
                    "Exploring the Potential of Augmented Reality in Domestic Environments.",
                    "Hand-Over-Face Input Sensing for Interaction with Smartphones through the Built-in Camera.",
                    "Understanding How Digital Gifting Influences Social Interaction on Live Streams.",
                    "Investigating Unintended Inputs for One-Handed Touch Interaction Beyond the Touchscreen.",
                    "A Shortcut for Caret Positioning on Touch-Screen Phones.",
                    "AudioTouch: Minimally Invasive Sensing of Micro-Gestures via Active Bio-Acoustic Sensing.",
                    "Enabling Personal Alcohol Tracking using Transdermal Sensing Wristbands: Benefits and Challenges.",
                    "WithDorm: Dormitory Solution for Linking Roommates.",
                    "CryptoAR Wallet: A Blockchain Cryptocurrency Wallet Application that Uses Augmented Reality for On-chain User Data Display.",
                    "Predicting Smartphone Users' General Responsiveness to IM Contacts Based on IM Behavior.",
                    "Indoor human localization based on the corneal reflection of illumination.",
                    "Force Touch Detection on Capacitive Sensors using Deep Neural Networks.",
                    "Designing an Urban Support for Autism.",
                    "An Information Behaviour-Based Approach to Virtual Doctor Design.",
                    "Evaluating User Experience under Location Quality Variations: A Framework for in-the-wild Studies.",
                    "Revisiting Facebook: A Study on Changes in Social Network Usage.",
                    "Designing for Task Resumption Support in Mobile Learning.",
                    "Fostering Virtual Guide in Exhibitions.",
                    "Semantic 3D gaze mapping for estimating focused objects.",
                    "Alexa, I'm in Need!: Investigating the Potential and Barriers of Voice Assistance Services for Social Work.",
                    "Towards Graphical User Interface Redefinition without Source Code Access: System Design and Evaluation.",
                    "UI Design Pattern-driven Rapid Prototyping for Agile Development of Mobile Applications.",
                    "Sense-able Lunch Recommendations.",
                    "A Mobile Robot Generating Video Summaries of Seniors' Indoor Activities.",
                    "A Formative Study for Record-time Manual Annotation of First-person Videos.",
                    "Effects of WER on ASR Correction Interfaces for Mobile Text Entry.",
                    "Engaging Seniors through Automatically-Generated Photo Digests from their Families' Social Media.",
                    "She is in a Bad Mood Now: Leveraging Peers to Increase Data Quantity via a Chatbot-Based ESM.",
                    "When There is No Progress with a Task-Oriented Chatbot: A Conversation Analysis.",
                    "Chat with Smart Conversational Agents: How to Evaluate Chat Experience in Smart Home.",
                    "Exploring the Design of Availability Status in Mobile IM Messaging with User Enactments.",
                    "Watch Spaces: A Spatial User Interface for Smart Watches.",
                    "WatchPen: Using Cross-Device Interaction Concepts to Augment Pen-Based Interaction.",
                    "R2S: A Public Augmented Printed Media System to Promote Care Home Residents' Social Interaction.",
                    "An Application for Wrist Rehabilitation Using Smartphones.",
                    "SCAN: Indoor Navigation Interface on a User-Scanned Indoor Map.",
                    "EOG Glasses: an Eyewear Platform for Cognitive and Social Interaction Assessments in the Wild.",
                    "Communicating Multimodal Wayfinding Messages for Visually Impaired People via Wearables.",
                    "Deformable Interactions to Improve the Usability of Handheld Mobile Devices.",
                    "Methods and Interfaces for Closed Loop Smartphone Notifications.",
                    "Interactive Voice Technologies and the Digital Marginalization of Older Adults.",
                    "Tools to Support Voice User Interface Design.",
                    "Measuring Holistic User Experience: Keeping an Eye on What Matters Most to Users.",
                    "Scrappy User Research: How to Get Feedback in 24 Hours or Less.",
                    "Designing Mobile Technologies for Neurodiversity: Challenges and Opportunities.",
                    "Bounded & Nuanced: Designing Mobile Technology for Children and Parents.",
                    "Hacks for Cost-Justifying Usability: \"Fear-Setting\" vs. \"Goal-Setting\".",
                    "Integrating HCI Perspective into a Mobile Software Development Team: Strategies and lessons from the field.",
                    "Crowdsourcing Images for Global Diversity.",
                    "Behind the Scenes of Researching Android 9 Pie's System Navigation."
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "20th Mobile HCI 2018",
        "info": "Barcelona, Spain",
        "venues": [
            {
                "sub_name_abbr": "conf/mhci/2018",
                "sub_name": "Proceedings of the 20th International Conference on Human-Computer Interaction with Mobile Devices and Services, MobileHCI 2018, Barcelona, Spain, September 03-06, 2018.",
                "count": 50,
                "papers": [
                    "Forecasting user attention during everyday mobile interactions using device-integrated and wearable sensors.",
                    "Snooze!: investigating the user-defined deferral of mobile notifications.",
                    "Dismissed!: a detailed exploration of how mobile phone users handle push notifications.",
                    "Good vibrations: can a digital nudge reduce digital overload?",
                    "Hand range interface: information always at hand with a body-centric mid-air input surface.",
                    "Magicscroll: a rollable display device with flexible screen real estate and gestural input.",
                    "Pinchmove: improved accuracy of user mobility for near-field navigation in virtual environments.",
                    "A liquid tangible display for mobile colour mixing.",
                    "Analyzing mobile application usage: generating log files from mobile screen recordings.",
                    "The hidden image of mobile apps: geographic, demographic, and cultural factors in mobile usage.",
                    "Typical phone use habits: intense use does not predict negative well-being.",
                    "Circles vs. scales: an empirical evaluation of emotional assessment GUIs for mobile phones.",
                    "Mobiceil: cost-free indoor localizer for office buildings.",
                    "From reading to driving: priming mobile users for take-over situations in highly automated driving.",
                    "Augmenting bicycles and helmets with multimodal warnings for children.",
                    "Workaholistic: on balancing typing- and handover-performance in automated driving.",
                    "Wish you were here: being together through composite video and digital keepsakes.",
                    "Review of unconventional user interfaces for emotional communication between long-distance partners.",
                    "Toward \"JOMO\": the joy of missing out and the freedom of disconnecting.",
                    "Memstone: a tangible interface for controlling capture and sharing of personal memories.",
                    "Effect of gaps with penal distractors imposing time penalty in touch-pointing tasks.",
                    "Multiplexing spatial memory: increasing the capacity of FastTap menus with multiple tabs.",
                    "$Q: a super-quick, articulation-invariant stroke-gesture recognizer for low-resource devices.",
                    "Subliminal semantic number processing on smartphones.",
                    "Parklearn: creating, sharing and engaging with place-based activities for seamless mobile learning.",
                    "Privacy and design ethics vs designing for curiosity, communication and children: lessons learned.",
                    "Supporting out of office software development using personal devices.",
                    "Inclusively designing IDA: effectively communicating falls risk to stakeholders.",
                    "Designing finger orientation input for mobile touchscreens.",
                    "Pressure-sensitive zooming-out interfaces for one-handed mobile interaction.",
                    "Knock knock, what's there: converting passive objects into customizable smart controllers.",
                    "GATO: predicting human performance with multistroke and multitouch gesture input.",
                    "Brassau: automatic generation of graphical user interfaces for virtual assistants.",
                    "I don't want to seem trashy: exploring context and self-presentation through young gay and bisexual males' attitudes toward shirtless selfies on instagram.",
                    "Motivations and practices for cheating in Pokémon GO.",
                    "YouTube needs: understanding user's motivations to watch videos on mobile devices.",
                    "A large-scale analysis of YouTube videos depicting everyday thermal camera use.",
                    "The past, present, and future of gaze-enabled handheld mobile devices: survey and lessons learned.",
                    "RadialLight: exploring radial peripheral LEDs for directional cues in head-mounted displays.",
                    "Beyond Halo and Wedge: visualizing out-of-view objects on head-mounted virtual and augmented reality devices.",
                    "AlertnessScanner: what do your pupils tell about your alertness.",
                    "ARPilot: designing and investigating AR shooting interfaces on mobile devices for drone videography.",
                    "MyoTilt: a target selection method for smartwatches using the tilting operation and electromyography.",
                    "BubbleFlick: investigating effective interface for Japanese text entry on smartwatches.",
                    "Auto-switching list search interface for touchscreen smartwatches.",
                    "Disabled, but at what cost?: an examination of wheelchair routing algorithms.",
                    "Mobile location-based games to support orientation & mobility training for visually impaired students.",
                    "Mobile support for adults with mild learning disabilities during clinical consultations.",
                    "Customized communication between healthcare members during the medication administration stage.",
                    "SpokeIt: building a mobile speech therapy experience."
                ]
            },
            {
                "sub_name_abbr": "conf/mhci/2018a",
                "sub_name": "Proceedings of the 20th International Conference on Human-Computer Interaction with Mobile Devices and Services Adjunct, MobileHCI 2018, Barcelona, Spain, September 03-06, 2018.",
                "count": 65,
                "papers": [
                    "AVotar: exploring personalized avatars for mobile interaction with public displays.",
                    "RainSense: exploring the concept of a sense for weather awareness.",
                    "MonoculAR: a radial light display to point towards out-of-view objects on augmented reality devices.",
                    "Predicting stroke gesture input performance for users with motor impairments.",
                    "Mobile farm for software testing.",
                    "S5: selective sensing of single sound sources.",
                    "On designing a way-finding system to assist users with respiratory ailments and track symptoms.",
                    "Information push and pull in tactile pedestrian navigation support.",
                    "So you're planning a baby?: a review of preconception care apps.",
                    "Mixed-focus collaboration activities for designing mobile interactions.",
                    "Towards designing a mobile app that creates avatars for privacy protection.",
                    "The case for IVR-based citizen journalism in Pakistan.",
                    "IoT for the circular economy: the case of a mobile set for video-makers.",
                    "Let there be LITE: design and evaluation of a label for IoT transparency enhancement.",
                    "Virtual reality on the go?: a study on social acceptance of VR glasses.",
                    "Exploring requirements and opportunities of conversational user interfaces for the cognitively impaired.",
                    "Investigating the usability and user experiences of voice user interface: a case of Google home smart speaker.",
                    "Reinforcement based learning through communicative Android app for autism personnel.",
                    "Affective keys: towards unobtrusive stress sensing of smartphone users.",
                    "Wink it: investigating wink-based interactions for smartphones.",
                    "Usability of a mood assessment smartphone prototype based on humor appreciation.",
                    "Scentery: a calming multisensory environment by mixing virtual reality, sound, and scent.",
                    "Investigating controller less input methods for smartphone based virtual reality platforms.",
                    "Why do smartphone users hesitate to delete unused apps?",
                    "Bornomala AR-bengali learning experience using augmented reality.",
                    "Privacy in the smart grid: end-user concerns and requirements.",
                    "Evaluating a pervasive game for urban awareness.",
                    "Aidme: interactive non-visual smartphone tutorials.",
                    "Airbot: using a work flow model for proactive assistance in public spaces.",
                    "A glimpse of mobile text entry errors and corrective behaviour in the wild.",
                    "Exploring the key design functions of an overactive bladder application.",
                    "Walk after stroke: initial development of a step counting game for stroke survivors.",
                    "A framework to enhance the user experience of car mobile applications.",
                    "Towards the development of a tablet-based screening for cognitive symptoms of neuropsychiatric disorders.",
                    "Don't panic!: guiding pedestrians in autonomous traffic with augmented reality.",
                    "Design guidelines for hands-free speech interaction.",
                    "On sociocultural-centered graphical passwords: an initial framework.",
                    "Develop a user-centered, accessible and harmonized terminology for mobile ICT - freely available in five languages - with us!",
                    "Senbay: a platform for instantly capturing, integrating, and restreaming of synchronized multiple sensor-data stream.",
                    "S3: environmental fingerprinting with a credit card-sized NFC powered sensor board.",
                    "A tablet game to target dyslexia screening in pre-readers.",
                    "LETSmath.",
                    "Affsens: a mobile platform for capturing affect in context.",
                    "Responsive snippets: adaptive skim-reading for mobile devices.",
                    "The gravity of thought: exploring positively surprising interactions.",
                    "PHARA: an augmented reality grocery store assistant.",
                    "Sharing physical objects using smart contracts.",
                    "Demonstrating palm touch: the palm as an additional input modality on commodity smartphones.",
                    "Musical data: a novel approach to create music from mobile data.",
                    "Holo-mis: a mixed reality based drone mission definition system.",
                    "Quiri: chronic pain assessment for patients and physicians.",
                    "Designing speech interaction for the Sony Xperia Ear and Oakley Radar Pace smartglasses.",
                    "Design-led exploration of indoor parking: an industry perspective.",
                    "Smart glasses based intelligent trainer for factory new recruits.",
                    "Using technology acceptance models for product development: case study of a smart payment card.",
                    "Mobile crowdsourcing in the wild: challenges from a global community.",
                    "User practices for smartphone control of TV.",
                    "Augmenting the reading experience.",
                    "Augmented humans interacting with an augmented world.",
                    "Augmenting daily spaces and objects for opportunistic social interaction.",
                    "Connecting across the miles: mediating emotional communication for distant loved ones through unconventional artifacts.",
                    "Appropriation of wearable augmented reality.",
                    "Usable transparency for enhancing privacy in mobile health apps.",
                    "Augmented self-presentation: supporting collocated social interaction.",
                    "Opportunities and challenges for creating a digital payments ecosystem: a case of auto-rickshaw and cabdrivers in India."
                ]
            },
            {
                "sub_name_abbr": "conf/mhci/2018ch",
                "sub_name": "Proceedings of the 2nd Workshop on Mobile Access to Cultural Heritage co-located with 20th International Conference on Human-Computer Interaction with Mobile Devices and Services, mobileCH@Mobile HCI 2018, Barcelona, Spain, September 3, 2018.",
                "count": 7,
                "papers": [
                    "Recommending user experiences based on extracted cultural personas for mobile applications - REPEAT methodology.",
                    "Personalisation of digital museum guides through implicit recognition of visitor personas.",
                    "#thismymob: Preserving and promoting indigenous Australian cultural heritage.",
                    "Towards chatbots in the museum.",
                    "Memory in copper.",
                    "Towards evaluating the impact of recommender systems on visitor experience in physical museums.",
                    "A museum app to trigger users' reflection."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "19th Mobile HCI 2017",
        "info": "Vienna, Austria",
        "venues": [
            {
                "sub_name_abbr": "conf/mhci/2017",
                "sub_name": "Proceedings of the 19th International Conference on Human-Computer Interaction with Mobile Devices and Services, MobileHCI 2017, Vienna, Austria, September 4-7, 2017.",
                "count": 107,
                "papers": [
                    "Zap++: a 20-channel electrical muscle stimulation system for fine-grained wearable force feedback.",
                    "TapSense: combining self-report patterns and typing characteristics for smartphone based emotion detection.",
                    "An interactive 3D health app with multimodal information representation for frozen shoulder.",
                    "EXHI-bit: a mechanical structure for prototyping EXpandable handheld interfaces.",
                    "Understanding users' perception of simultaneous tactile textures.",
                    "The connected car: an empirical study of electric cars as mobile digital devices.",
                    "Pharos: improving navigation instructions on smartwatches by including global landmarks.",
                    "Camera-based mobile electronic travel aids support for cognitive mapping of unknown spaces.",
                    "CapSoles: who is walking on what kind of floor?",
                    "Usability of different types of commercial selfie sticks.",
                    "Productive, anxious, lonely: 24 hours without push notifications.",
                    "Predicting interruptibility for manual data collection: a cluster-based user model.",
                    "Too tense for candy crush: affect influences user engagement with proactively suggested content.",
                    "Evaluating deformable devices with emergent users.",
                    "Roman-txt: forms and functions of roman urdu texting.",
                    "Influence of letter size on word reading performance during walking.",
                    "Transition animations support orientation in mobile interfaces without increased user effort.",
                    "CrowdEyes: crowdsourcing for robust real-world mobile eye tracking.",
                    "Enabling remote deictic communication with mobile devices: an elicitation study.",
                    "Third-wave livestreaming: teens' long form selfie.",
                    "Exploring the feasibility of subliminal priming on smartphones.",
                    "FrontFace: facilitating communication between HMD users and outsiders using front-facing-screen HMDs.",
                    "Text entry tap accuracy and exploration of tilt controlled layered interaction on Smartwatches.",
                    "Investigating current techniques for opposite-hand smartwatch interaction.",
                    "SpeCam: sensing surface color and material with the front-facing camera of a mobile device.",
                    "Designing a gaze gesture guiding system.",
                    "EarTouch: turning the ear into an input surface.",
                    "Language learning on-the-go: opportune moments and design of mobile microlearning sessions.",
                    "CETA: designing mixed-reality tangible interaction to enhance mathematical learning.",
                    "Designing a ubiquitous sensor-based platform to facilitate learning for young children in Thailand.",
                    "Assessing the usability of smartwatches for academic cheating during exams.",
                    "Spatial knowledge acquired from pedestrian urban navigation systems.",
                    "Understanding the ergonomic constraints in designing for touch surfaces.",
                    "Finger tracking: facilitating non-commercial content production for mobile e-reading applications.",
                    "Exploiting mid-air gestures to share data among devices.",
                    "User-independent real-time hand gesture recognition based on surface electromyography.",
                    "WheelieMap: an exploratory system for qualitative reports of inaccessibility in the built environment.",
                    "EnergyHome: leveraging housemate dynamics to motivate energy conservation.",
                    "Weigh it and share it!: crowdsourcing for pro-environmental data collection.",
                    "Using nature elements in mobile AR for education with children.",
                    "Customizable automatic detection of bad usability smells in mobile accessed web applications.",
                    "\"What can i help you with?\": infrequent users' experiences of intelligent personal assistants.",
                    "Better together: disaggregating mobile services for emergent users.",
                    "No passwords needed: the iterative design of a parent-child authentication mechanism.",
                    "EatAR tango: portion estimation on mobile devices with a depth sensor.",
                    "CETA: open, affordable and portable mixed-reality environment for low-cost tablets.",
                    "MyoShare: sharing data among devices via mid-air gestures.",
                    "Walking motion recognition system by estimating position and pose of leg mounted camera device using visual SLAM.",
                    "Using frame of mind: documenting reminiscence through unstructured digital picture interaction.",
                    "PeriMR: a prototyping tool for head-mounted peripheral light displays in mixed reality.",
                    "βTap: back-of-device tap input with built-in sensors.",
                    "Study on manual palletization of inhomogeneous boxes with the help of different interfaces to assess specific factors of ergonomic impact.",
                    "Range-IT: detection and multimodal presentation of indoor objects for visually impaired people.",
                    "Activity recognition for movement-based interaction in mobile games.",
                    "FootStriker: an EMS-based assistance system for real-time running style correction.",
                    "User-centered development of a system to support assembly line worker.",
                    "Understanding mobile phone activities via retrospective review of visualizations of usage data.",
                    "Designing for delight.",
                    "Entrepreneurial & UX mindsets: two perspectives - one objective.",
                    "What users want in their mobile phones?: localization for low socio-economic emerging market.",
                    "Machine learning for intelligent mobile user interfaces using TensorFlow.",
                    "The car as an environment for mobile devices.",
                    "Speed dating, love letters, and couples interviews: how to get the spark back in user research methods.",
                    "Tutorial on wearable computing in sports.",
                    "Speech and Hands-free interaction: myths, challenges, and opportunities.",
                    "EMS in HCI: challenges and opportunities in actuating human bodies.",
                    "Towards smart notification management in multi-device environments.",
                    "Understanding and designing for emerging digital eco-systems: the cases of private and shared cars.",
                    "Designing mobile deformable controls for creation of digital art.",
                    "Augmenting human interaction capabilities with proximity, natural gestures, and eye gaze.",
                    "A mobile game system for improving the speech therapy experience.",
                    "Mobile context-aware cognitive testing system.",
                    "Crafting collocated interactions: exploring physical representations of personal data.",
                    "Workshop on object recognition for input and mobile interaction.",
                    "The UX of IoT: unpacking the internet of things.",
                    "NatureCHI 2017: the 2nd workshop on unobtrusive user experiences with technology in nature.",
                    "Mobile interaction with and in autonomous vehicles.",
                    "A design space for conversational in-vehicle information systems.",
                    "Are you hiding it?: usage habits of lifelogging camera wearers.",
                    "Visualizing out-of-view objects in head-mounted augmented reality.",
                    "Feasibility analysis of detecting the finger orientation with depth cameras.",
                    "Visual, auditory and haptic navigation feedbacks among older pedestrians.",
                    "Visualizing spatial and time-oriented data in a second screen application.",
                    "DroneCAST: towards a programming toolkit for airborne multimedia display applications.",
                    "Eliciting values through wearable expression in weight loss.",
                    "A location-based educational game for understanding the traveling salesman problem: a case study.",
                    "ShakeCast: using handshake detection for automated, setup-free exchange of contact data.",
                    "Towards pressure-based feedback for non-stressful tactile notifications.",
                    "Simplifying the making of probes, prototypes and toolkits in mobile interaction research using tasker.",
                    "How to look at two-sided photos?: exploring novel perspectives on digital images.",
                    "Creating community fountains by (re-)designing the digital layer of way-finding pillars.",
                    "Film, interrupted: investigating how mobile device notifications affect immersion during movies.",
                    "My phone assistant should know I am an Indian: influencing factors for adoption of assistive agents.",
                    "Which cloak dresses you best?: comparing location cloaking methods for mobile users.",
                    "Paper ladder: a rating scale to collect children's opinion in user studies.",
                    "\"In search of light\": enhancing touristic recommender services with local weather data.",
                    "Prototyping sonic interaction for walking.",
                    "Improving pocket paint usability via material design compliance and internationalization & localization support on application level.",
                    "A smartphone prototype for touch interaction on the whole device surface.",
                    "Balance trees: a new visual representation for body balance.",
                    "Impact of location-based games on phone usage and movement: a case study on Pokémon GO.",
                    "MobiLearn go: mobile microlearning as an active, location-aware game.",
                    "Leveraging user-made predictions to help understand personal behavior patterns.",
                    "Interacting with large maps using HMDs in VR settings.",
                    "Fam-On: family shared time tracker to improve their emotional bond.",
                    "Improving software-reduced touchscreen latency.",
                    "Slate master: a tangible Braille slate tutor for mobile devices."
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "18th Mobile HCI 2016",
        "info": "Florence, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/mhci/2016",
                "sub_name": "Proceedings of the 18th International Conference on Human-Computer Interaction with Mobile Devices and Services, MobileHCI 2016, Florence, Italy, September 6-9, 2016.",
                "count": 56,
                "papers": [
                    "Nail+: sensing fingernail deformation to detect finger force touch interactions on rigid surfaces.",
                    "ScatterWatch: subtle notifications via indirect illumination scattered in the skin.",
                    "Exploring tilt for no-touch, wrist-only interactions on smartwatches.",
                    "NailTactors: eyes-free spatial output using a nail-mounted tactor array.",
                    "Does prediction really help in Marathi text input?: empirical analysis of a longitudinal study.",
                    "Effect of target size on non-visual text-entry.",
                    "Invisiboard: maximizing display and input space with a full screen text entry method for smartwatches.",
                    "SwipeKey: a swipe-based keyboard design for smartwatches.",
                    "What can I say?: addressing user experience challenges of a mobile voice user interface for accessibility.",
                    "Feasibility of using haptic directions through maps with a tablet and smart watch for people who are blind and visually impaired.",
                    "NavCog: a navigational cognitive assistant for the blind.",
                    "From tactile to virtual: using a smartwatch to improve spatial map exploration for visually impaired users.",
                    "Time to exercise!: an aide-memoire stroke app for post-stroke arm rehabilitation.",
                    "A longitudinal evaluation of the acceptability and impact of a diet diary app for older adults with age-related macular degeneration.",
                    "Back on bike: the BoB mobile cycling app for secondary prevention in cardiac patients.",
                    "Acceptance of mobile technology by older adults: a preliminary study.",
                    "Bitey: an exploration of tooth click gestures for hands-free user interface control.",
                    "2D-Dragger: unified touch-based target acquisition with constant effective width.",
                    "Investigating the effects of splitting detailed views in Overview+Detail interfaces.",
                    "Understanding back-to-front pinching for eyes-free mobile touch input.",
                    "Visual parameters impacting reaction times on smartwatches.",
                    "Wearable ESM: differences in the experience sampling method across wearable devices.",
                    "Natural group binding and cross-display object movement methods for wearable devices.",
                    "Digital vibrons: understanding users' perceptions of interacting with invisible, zero-weight matter.",
                    "Gesture morpher: video-based retargeting of multi-touch interactions.",
                    "In situ CAD capture.",
                    "Epistenet: facilitating programmatic access & processing of semantically related mobile personal data.",
                    "WAVI: improving motion capture calibration using haptic and visual feedback.",
                    "Technology literacy in poor infrastructure environments: characterizing wayfinding strategies in Lebanon.",
                    "Where are we?: evaluating the current rendering fidelity of mobile audio augmented reality systems.",
                    "NaviLight: investigating ambient light displays for turn-by-turn navigation in cars.",
                    "People, places, and perceptions: effects of location check-in awareness on impressions of strangers.",
                    "Interruption and pausing of public display games.",
                    "It's not how you stand, it's how you move: F-formations and collaboration dynamics in a mobile learning game.",
                    "Playing on AREEF: evaluation of an underwater augmented reality game for kids.",
                    "Virtual.Cultural.Collaboration: mobile phones, video technology, and cross-cultural learning.",
                    "Facilitating citizen engagement in situ: assessing the impact of pro-active geofenced notifications.",
                    "Combining contribution interactions to increase coverage in mobile participatory sensing systems.",
                    "Talkin' about the weather: incorporating TalkBack functionality and sonifications for accessible app design.",
                    "Discovering activities in your city using transitory search.",
                    "WatchMI: pressure touch, twist and pan gesture input on unmodified smartwatches.",
                    "ScrollingHome: bringing image-based indoor navigation to smartwatches.",
                    "Bringing mobile into meetings: enhancing distributed meeting participation on smartwatches and mobile phones.",
                    "Let your body move: a prototyping toolkit for wearable force feedback with electrical muscle stimulation.",
                    "Motion based remote camera control with mobile devices.",
                    "Software-reduced touchscreen latency.",
                    "Changing the camera-to-screen angle to improve AR browser usage.",
                    "See you next time: a model for modern shoulder surfers.",
                    "Mobile manifestations of alertness: connecting biological rhythms with patterns of smartphone app use.",
                    "Fix and slide: caret navigation with movable background.",
                    "Understanding call logs of smartphone users for making future calls.",
                    "Smartphones, apps and older people's interests: from a generational perspective.",
                    "Sender-intended functions of emojis in US messaging.",
                    "EmojiZoom: emoji entry via large overview maps 😄🔍.",
                    "Conversational context helps improve mobile notification management.",
                    "Let's take photos together: exploring asymmetrical interaction abilities on mobile camera phones."
                ]
            },
            {
                "sub_name_abbr": "conf/mhci/2016a",
                "sub_name": "Proceedings of the 18th International Conference on Human-Computer Interaction with Mobile Devices and Services Adjunct, MobileHCI 2016, Florence, Italy, September 6-9, 2016.",
                "count": 110,
                "papers": [
                    "Exploring best practices for card interactions through a three-method triangulation.",
                    "How to develop accessibility UX design guideline in Samsung.",
                    "Designing Android Marshmallow volume controls: a user experience case study.",
                    "I'm just trying to survive: an ethnographic look at mobile notifications and attention management.",
                    "A case study on capturing and visualising face-to-face interactions in the workplace.",
                    "Lessons learned from designing a displayless consumer wearable tech.",
                    "UbiMaze: a new genre of virtual reality game based on mobile devices.",
                    "WatchMI: applications of watch movement input on unmodified smartwatches.",
                    "ForceBoard: using force as input technique on size-limited soft keyboard.",
                    "On-mouse projector: extended workspace using a mouse with a projector.",
                    "Collaborative use of mobile devices to curate sources of inspiration.",
                    "Clothes integrated visual markers as self-expression tool.",
                    "MobileVideoTiles: video display on multiple mobile devices.",
                    "PZBoard: a prediction-based zooming interface for supporting text entry on a mobile device.",
                    "G3: bootstrapping stroke gestures design with synthetic samples and built-in recognizers.",
                    "Affective-ready, contextual and automated usability test for mobile software.",
                    "mSTROKE: a crowd-powered mobility towards stroke recognition.",
                    "MovingScreen: selecting hard-to-reach targets with automatic comfort zone calibration on mobile devices.",
                    "Rule of thumb: effect of social button icons on interaction.",
                    "Baby+: a mobile application to support pregnant women in Pakistan.",
                    "WhichHand: automatic recognition of a smartphone's position in the hand using a smartwatch.",
                    "Info-Bead group modeling in a mobile scenario.",
                    "If this, then habit: exploring context-aware implementation intentions on smartphones.",
                    "Investigating how the hand interacts with different mobile phones.",
                    "FLOW pillow: exploring sitting experience towards active ageing.",
                    "Watching movies on netflix: investigating the effect of screen size on viewer immersion.",
                    "Legal and ethical implications of mobile live-streaming video apps.",
                    "Ergonomics of thumb-based pointing while holding tablets.",
                    "Skeuomorphic, flat or material design: requirements for designing mobile planning applications for students with autism spectrum disorder.",
                    "Natural collocated interactions for merging results with mobile devices.",
                    "MusiSkate: enhancing the skateboarding experience through musical feedback.",
                    "Smiley face: why we use emoticon stickers in mobile messaging.",
                    "How do I communicate my emotions on SNS and IMs?",
                    "Spin-lock gesture authentication for mobile devices.",
                    "Microgesture detection for remote interaction with mobile devices.",
                    "ThumbRing: private interactions using one-handed thumb motion input on finger segments.",
                    "Accessible way finding on mobile devices for different user groups.",
                    "Observation based analysis on the use of mobile applications for visually impaired users.",
                    "A rhythmical tap approach for sending data across devices.",
                    "Mobile cross-media visualisations made from building information modelling data.",
                    "Lessons learned: designing a mobile application for teaching computer science concepts to middle school girls.",
                    "Multi-level interaction with an LED-matrix edge display.",
                    "Tag your emotions: a novel mobile user interface for annotating images with emotions.",
                    "Classifying weight training workouts with deep convolutional neural networks: a precedent study.",
                    "Oh that's what you meant!: reducing emoji misunderstanding.",
                    "What makes readers laugh?: value of sensing laughter for humor webtoon.",
                    "Zephyr: exploring digital behaviour change interventions to treat hoarding.",
                    "Educating bicycle safety and fostering empathy for cyclists with an affordable and game-based VR app.",
                    "TouchRing: subtle and always-available input using a multi-touch ring.",
                    "Methods for calibration free and multi-user eye tracking.",
                    "Modeling human behavior during touchscreen interaction in mobile situations.",
                    "Distance, time, and friends: system-generated cues and impression formation in mediated spaces.",
                    "Designing social wearables for mediation of intimate relationships.",
                    "Single-handed interaction for mobile and wearable computing.",
                    "In-situ semantic 3D modeling.",
                    "A multimodal networked kissing machine for mobile phones.",
                    "Smarttention, please!: 2nd workshop on intelligent attention management on mobile devices.",
                    "Managing smartwatch notifications through filtering and ambient illumination.",
                    "CoConUT: context collection for non-stationary user testing.",
                    "The importance of visual attention for adaptive interfaces.",
                    "Notification dashboard: enabling reflection on mobile notifications.",
                    "Exploring notifications in smart home environments.",
                    "Reducing distraction of smartwatch users with deep learning.",
                    "Embodied notifications: implicit notifications through electrical muscle stimulation.",
                    "Mobile access to cultural heritage: mobile-CH 2016.",
                    "New directions for preserving intangible cultural heritage through the use of mobile technologies.",
                    "A comparative pilot study of historical artifacts in a CAVE automatic virtual reality environment versus paper-based artifacts.",
                    "Dynamic personalization based on mobile behavior: from personality to personalization: a blueprint.",
                    "A novel image based positioning technique using mobile eye tracker for a museum visit.",
                    "Exploration of cultural heritage information via textual search queries.",
                    "From proximity to accurate indoor localization for context awareness in mobile museum guides.",
                    "Supporting professional guides to create personalized visit experiences.",
                    "A pervasive role-playing game for introducing elementary school students to archaeology.",
                    "Accessible museum collections for the visually impaired: combining tactile exploration, audio descriptions and mobile gestures.",
                    "Inferring user action with mobile gaze tracking.",
                    "A study on representational competence in physics using mobile eye tracking systems.",
                    "Knowledge transfer from experts to novices in minimally invasive catheter-mediated (MIC) interventions, eye-tracking study.",
                    "Classifying mobile eye tracking data with hidden Markov models.",
                    "Minimal sequential gaze models for inferring walkers' tasks.",
                    "Audio in place: media, mobility & HCI - creating meaning in space.",
                    "On the use of audio in the educational location based game platform MILE.",
                    "Local sounds & singing along in cars.",
                    "Numbers in places: creative interventions in musical space & time.",
                    "Towards ubiquitous location-based audio: challenges and future directions.",
                    "Workshop on mobile healthcare for the self-management of chronic diseases and the empowerment of patients.",
                    "Assistive mobile application for support of mobility and communication of people with IDD.",
                    "CoachMe: a platform for promoting healthy lifestyle.",
                    "End-user personalization of context-dependent applications in AAL scenarios.",
                    "Fingerprints: detecting meaningful moments for mobile health intervention.",
                    "Mobile apps for IBD self: management using wearable devices and sensors.",
                    "Opportunities for technology in the self-management of mental health.",
                    "Sociotechnical design of mHealth applications for chronic diseases.",
                    "Towards successful self-management and empowerment for COPD patients.",
                    "Wearable devices and AI techniques integration to promote physical activity.",
                    "Standing hypotension prediction based on smartwatch heart rate variability data: a novel approach.",
                    "Technologies to support psychologists and patients interactions.",
                    "Interaction techniques for mobile collocation.",
                    "A wearable handwriting system for time-warping collocation.",
                    "Indoor collocation: exploring the ultralocal context.",
                    "Using elicitation studies to generate collocated interaction methods.",
                    "Mobile energy sharing futures.",
                    "F-formations and collaboration dynamics study for designing mobile collocation.",
                    "The role and impact of aesthetics in designing mobile devices.",
                    "Exploring digital-fabricated natural materials and patterns for mobile devices.",
                    "The aesthetics of StripeMaps: being small and beautiful.",
                    "User perspective for interactive handbag design.",
                    "Design space of the new materials for fashionable wearables.",
                    "Wearable head-mounted 3D tactile display application scenarios.",
                    "IoT owl: soft tangible user interface for detecting the presence of people.",
                    "Aesthetic physical items for visualizing personal sleep data."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "17th Mobile HCI 2015",
        "info": "Copenhagen, Denmark",
        "venues": [
            {
                "sub_name_abbr": "conf/mhci/2015",
                "sub_name": "Proceedings of the 17th International Conference on Human-Computer Interaction with Mobile Devices and Services, MobileHCI 2015, Copenhagen, Denmark, August 24-27, 2015.",
                "count": 64,
                "papers": [
                    "I'll be there for you: Quantifying Attentiveness towards Mobile Messaging.",
                    "Investigating Mobile Users' Ringer Mode Usage and Attentiveness and Responsiveness to Communication.",
                    "Feeling Aware: Investigating the Use of a Mobile Variable-Friction Tactile Display for Awareness Information.",
                    "From Ambient to Adaptation: Interpersonal Attention Management Among Young Adults.",
                    "SAMMI: A Spatially-Aware Multi-Mobile Interface for Analytic Map Navigation Tasks.",
                    "CozyMaps: Real-time Collaboration on a Shared Map with Multiple Displays.",
                    "StripeMaps: Improving Map-based Pedestrian Navigation for Smartwatches.",
                    "GraphTiles: A Visual Interface Supporting Browsing and Imprecise Mobile Search.",
                    "Map Navigation Using a Wearable Mid-air Display.",
                    "EyeProtector: Encouraging a Healthy Viewing Distance when Using Smartphones.",
                    "In Situ Design for Mental Illness: Considering the Pathology of Bipolar Disorder in mHealth Design.",
                    "QuittyLink: Using Smartphones for Personal Counseling to Help People Quit Smoking.",
                    "ConCap: Designing to Empower Individual Reflection on Chronic Conditions using Mobile Apps.",
                    "RUFUS: Remote Supporter Feedback for Long-Distance Runners.",
                    "There is more to Typing than Speed: Expressive Mobile Touch Keyboards via Dynamic Font Personalisation.",
                    "On-screen keyboards: does the presence of feedback or tactile landmarks improve typing performance?",
                    "Modeling Human Performance of Stroke-Based Text Entry.",
                    "Typing on Glasses: Adapting Text Entry to Smart Eyewear.",
                    "PalmType: Using Palms as Keyboards for Smart Glasses.",
                    "Gluey: Developing a Head-Worn Display Interface to Unify the Interaction Experience in Distributed Display Environments.",
                    "A Comparison of Methods to Move Visual Objects Between Personal Mobile Devices in Different Contexts of Use.",
                    "Q-arrgh!: Commandeering Everyday Digital Codes.",
                    "Proxemic-Aware Controls: Designing Remote Controls for Ubiquitous Computing Ecologies.",
                    "MIME: Teaching Mid-Air Pose-Command Mappings.",
                    "Botential: Localizing On-Body Gestures by Measuring Electrical Signatures on the Human Skin.",
                    "PalmGesture: Using Palms as Gesture Interfaces for Eyes-free Input.",
                    "Exploring User-Defined Back-Of-Device Gestures for Mobile Devices.",
                    "Exploring Mobile Devices as Personal Public Displays.",
                    "SeeSaw: I See You Saw My Video Message.",
                    "Social Displays on Mobile Devices: Increasing Collocated People's Awareness of the User's Activities.",
                    "Sharing (and Discussing) the Moment: The Conversations that Occur Around Shared Mobile Media.",
                    "ColorSnakes: Using Colored Decoys to Secure Authentication in Sensitive Contexts.",
                    "Why aren't Users Using Protection? Investigating the Usability of Smartphone Locking.",
                    "Locked Your Phone? Buy a New One? From Tales of Fallback Authentication on Smartphones to Actual Concepts.",
                    "PassApp: My App is My Password!",
                    "Graphical Passwords in the Wild: Understanding How Users Choose Pictures and Passwords in Image-based Authentication Schemes.",
                    "LEaD: Utilizing Light Movement as Peripheral Visual Guidance for Scooter Navigation.",
                    "Shoe me the Way: A Shoe-Based Tactile Interface for Eyes-Free Urban Navigation.",
                    "GazeNav: Gaze-Based Pedestrian Navigation.",
                    "A Pilot Study of Collaborative Accessibility: How Blind People Find an Entrance.",
                    "Exploratory Navigation for Runners Through Geographic Area Classification with Crowd-Sourced Data.",
                    "Don't look at me that way!: Understanding User Attitudes Towards Data Glasses Usage.",
                    "Investigating Effects of Control and Ads Awareness on Android Users' Privacy Behaviors and Perceptions.",
                    "Caring for Batteries: Maintaining Infrastructures and Mobile Social Contexts.",
                    "Adoption factors of NFC Mobile Proximity Payments in Italy.",
                    "Modeling Sharing Decision of Campus Safety Reports and Its Design Implications to Mobile Crowdsourcing for Safety.",
                    "Elasticcon: Elastic Controllers for Casual Interaction.",
                    "Using Electromagnetic Input for Multi-User or Two-Handed Spatial Gestural Interaction based on the Digital Compass.",
                    "On the Applicability of Computer Vision based Gaze Tracking in Mobile Scenarios.",
                    "Corona: Interactivity of Body Electrostatics in Mobile Scenarios Using Wearable High-Voltage Static Charger.",
                    "CommuniSense: Crowdsourcing Road Hazards in Nairobi.",
                    "Exploring mobile news reading interactions for news app personalisation.",
                    "Leveraging Mobile Technology to Increase the Permanent Adoption of Shelter Dogs.",
                    "Leveraging Mobile Technology to Engage College Students in Scientific Research.",
                    "CrowdColor: Crowdsourcing Color Perceptions Using Mobile Devices.",
                    "Engaging with Mobile Music Retrieval.",
                    "From in the wild to in vivo: Video Analysis of Mobile Device Use.",
                    "Understanding the Challenges of Mobile Phone Usage Data.",
                    "Collect, Decompile, Extract, Stats, and Diff: Mining Design Pattern Changes in Android Apps.",
                    "Boosting Mobile Experience Sampling with Social Media.",
                    "DisplayCover: A Tablet Keyboard with an Embedded Thin-Film Touchscreen Display.",
                    "The Effects of Encumbrance and Mobility on Touch-Based Gesture Interactions for Mobile Phones.",
                    "Bimanual Input for Tablet Devices with Pressure and Multi-Touch Gestures.",
                    "Exploring Boundless Scroll by Extending Motor Space."
                ]
            },
            {
                "sub_name_abbr": "conf/mhci/2015a",
                "sub_name": "Proceedings of the 17th International Conference on Human-Computer Interaction with Mobile Devices and Services Adjunct, MobileHCI '15, Copenhagen, Denmark, August 24-27, 2015.",
                "count": 115,
                "papers": [
                    "Polly Wanna Show You: Examining Viewpoint-Conveyance Techniques for a Shoulder-Worn Telepresence System.",
                    "A Case Study in Mobile-Optimized vs. Responsive Web Application Design.",
                    "Mental Health App Design: A Journey From Concept to Completion.",
                    "ACTUI: Using Commodity Mobile Devices to Build Active Tangible User Interfaces.",
                    "Habito News: A research tool to investigate mobile news reading.",
                    "QuittyLink: A Mobile Application that helps people Quit Smoking.",
                    "An AR Interface to Enable Real-time Preview Design Variations in Actual Environment.",
                    "A GazeWatch Prototype.",
                    "MultiRep: A Platform Enabling Seamless Mobile Interaction.",
                    "Thrimage: An Empathy-Oriented Discussion Tool for Classroom Use.",
                    "Automated Usability Tests for Mobile Devices through Live Emotions Logging.",
                    "Accessibility Devices for Mobile Interfaces Extensions: A Survey.",
                    "Assessing the Relationship between Technical Affinity, Stress and Notifications on Smartphones.",
                    "Dabbawala: Introducing Technology to the Dabbawalas of Mumbai.",
                    "TalkingCane: Designing Interactive White Cane for Visually Impaired People's Bus Usage.",
                    "Hi Grandpa!: A communication Tool Connecting Grandparents and Grandchildren Living Apart.",
                    "Improving Mobile Web Search by Clustering and Visualizing Search Engine Results.",
                    "Inter-Device Communication with Interactive Sharing Service.",
                    "Typing Tutor: Automatic Error Detection and Instruction in Text Entry for Elderly People.",
                    "Investigating Handedness in Air Signatures for Magnetic 3D Gestural User Authentication.",
                    "Exploring Urban Events with Transitory Search on Mobiles.",
                    "The Infinite Canvas: A Novel Presentation of Newspaper Search Results on a Tablet.",
                    "Visualizing Scheduling: A Hierarchical Event-Based Approach on a Tablet.",
                    "Towards Mobile Blended Interaction Fostering Critical Thinking.",
                    "Using Serious Games to Improve Therapeutic Goals in Children with Special Needs.",
                    "Enhancing Social Interaction with Seamless Face Recognition on Google Glass: Leveraging opportunistic multi-tasking on smart phones.",
                    "From Start to Finish: Understanding Group Sharing Behavior in a Backcountry Skiing Community.",
                    "What Do You Like? Early Design Explorations of Sound and Haptic Preferences.",
                    "Lessons from Mobile Users: Resilience Strategies and Behaviors.",
                    "Mobile Recommender Systems: Trust and Context-Awareness.",
                    "Where To Go And How To Get There: Guidelines For Indoor Landmark-Based Navigation In A Museum Context.",
                    "Designed with Older Adults to SupportBetter Error Correction in SmartPhone Text Entry: The MaxieKeyboard.",
                    "Index Finger Zone: Study on Touchable Area Expandability Using Thumb and Index Finger.",
                    "Supporting Sit-To-Stand Rehabilitation Using Smartphone Sensors and Arduino Haptic Feedback Modules.",
                    "Smartphone Notifications: A Study on the Sound to Soundless Tendency.",
                    "Subliminal Priming of Nonconscious Goals on Smartphones.",
                    "Fun, Cool...and Awkward: Preliminary Reactions to Cooperative Photography.",
                    "Implicit Engagement Detection for Interactive Museums Using Brain-Computer Interfaces.",
                    "Effects of Display Sizes on a Scrolling Task using a Cylindrical Smartwatch.",
                    "Investigating Pressure-based Interactions with Mobile Phones While Walking and Encumbered.",
                    "Children as Participatory Designers of a New Type of Mobile Social Learning Application.",
                    "Who Needs a Doctor Anymore? Risks and Promise of Mobile Health Apps.",
                    "Mobile UX: Breaking the Glass to Richer User Experiences.",
                    "Patents as Business Assets for the Mobile Industry.",
                    "Mobile Persuasion for Health and Safety Promotion.",
                    "Emerging Research in Mobile Visualization.",
                    "Smart Communication in Lifestyles under Transformation: Exploring Smart Mobile Devices User Experience among Youth in Hong Kong.",
                    "Designing a multi-input modality architecture for universal accessibility.",
                    "Designing Mobile Devices Encouraging and Supporting Collocated Interactions.",
                    "Micro-Atmospheres: Exploring Portable and Wearable Solutions to Support Individual Thermal Comfort.",
                    "Gamification in mobile applications usability evaluation: A New Approach.",
                    "Platform for cycling data collection and service development.",
                    "Content Sharing Building Social User Experiences.",
                    "How Can Technology Best Disrupt Bad Health Habits?",
                    "2nd Workshop on Designing with Older Adults: Towards a Complete Methodology.",
                    "Time to Retire Old Methodologies? Reflecting on Conducting Usability Evaluations with Older Adults.",
                    "Mobilizing Senior Citizens in Co-Design Work.",
                    "Cultural probes and levels of creativity.",
                    "User-centered Interaction Design of a Mobile Learning Platform for the Generation 60+.",
                    "Involvement of End Users in a Navigation Aid Design Project.",
                    "Mobile Cognitive Training Games for older adults with mild cognitive impairment.",
                    "From Mobile to Wearable: Using Wearable Devices to Enrich Mobile Interaction.",
                    "Assistive Wearable Technology for Visually Impaired.",
                    "Concepting Wearables for Ice-Hockey Youth.",
                    "Optimizing Smartphone Micro-usage with Smartwatch Notifications.",
                    "Design and Technology Challenges for Body Proximate Display Ecosystems.",
                    "Anomaly Detection with Smartwatches as an Opportunity for Implicit Interaction.",
                    "Brain Computer Interfaces for Mobile Interaction: Opportunities and Challenges.",
                    "Palm-based Interaction with Head-mounted Displays.",
                    "Wearables in the Wild: Advocating Real-Life User Studies.",
                    "Workshop on Mobile Cognition: Using Mobile Devices to Enhance Human Cognition.",
                    "Mobile Being: How Inbodied & Embodied Practice May Inform Mobile Cognition.",
                    "Re-Live the Moment: Visualizing run experiences to motivate future exercises.",
                    "Map: making: designing a mobile application for enhancing memories' retrieval.",
                    "PulseCam: Biophysically Driven Life Logging.",
                    "Exploring Nonconscious Behaviour Change Interventions on Mobile Devices.",
                    "Mobile Cognition: Balancing User Support and Learning.",
                    "Requirement and input collection: Development of guidelines to allow people with cognitive disabilities to exploit the full potential of mobile ICT.",
                    "The Role of Self-Reflection in Sustainability.",
                    "Reflection processes in energy regulation situations assisted with reflective tools.",
                    "Mobile Awareness: Design for Connectedness.",
                    "Designing for Human Sustainability: The Role of Self-Reflection.",
                    "Retroflection: Self-Reflection for Knowledge and Culture Sustainability.",
                    "Design of Individualized Eco Labels using Social Media.",
                    "The Ethical Challenges of Experience Sampling Using Wearable Cameras.",
                    "What's cooking: A digital intervention to encourage sustainable food behaviour using mobile and wearable technologies.",
                    "The Role of Accidental Self-Reflection in Wearable Camera Research.",
                    "Smarttention, Please! Intelligent Attention Management on Mobile Devices.",
                    "A Context-Aware Model for Proactive Recommender Systems in the Tourism Domain.",
                    "Designing seamless displays for interaction in motion.",
                    "Are our mobile phones driving us apart? Divert attention from mobile phones back to physical conversation!",
                    "A Framework for Attention-Based Implicit Interaction on Mobile Screens.",
                    "Impact of Smartphone Notification Display Choice in a Typing Task.",
                    "Investigating The Role of Task Engagement in Mobile Interruptibility.",
                    "Boredom-Triggered Proactive Recommendations.",
                    "Assessment of Notifications on Smartwatches.",
                    "Towards Smart Notifications using Research in the Large.",
                    "Empowering Users to Make Informed Permission Request Choices.",
                    "Interactive Displays through Mobile Projection.",
                    "Extending the Design Space in Industrial Manufacturing Through Mobile Projection.",
                    "Medium and transition in mobile projected interfaces.",
                    "Mobile Collocated Interactions With Wearables.",
                    "Performing Interpretations of Museum Exhibits in Groups.",
                    "Bonjour! Greeting Gestures for Collocated Interaction with Wearables.",
                    "Collocated Social Interaction through Music: Cooperation and Collaboration.",
                    "Co-located games created by children with visual impairments.",
                    "Reflecting on the Study of Mobile Collocated Interactions: The Changing Face of Wearable Devices.",
                    "Perceptual and Social Challenges in Body Proximate Display Ecosystems.",
                    "Desktop-Gluey: Augmenting Desktop Environments with Wearable Devices.",
                    "Soft, Embodied, Situated & Connected.",
                    "Mobiscool: 1st Workshop on Mobile, Social and Culturally Oriented Learning.",
                    "Actions and advice in coli: a mobile social network to support agricultural peer learning.",
                    "What Happens when Students Go Offline in Mobile Devices?",
                    "Pocket Game Jams: a Constructionist Approach at Schools.",
                    "An evaluation method for location-based mobile learning based on spatio-temporal analysis of learner trajectories."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "16th Mobile HCI 2014",
        "info": "Toronto, ON, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/mhci/2014",
                "sub_name": "Proceedings of the 16th international conference on Human-computer interaction with mobile devices & services, MobileHCI 2014, Toronto, ON, Canada, September 23-26, 2014.",
                "count": 102,
                "papers": [
                    "Collective mobile interaction in urban spaces.",
                    "Identity, identification and identifiability: the language of self-presentation on a location-based mobile dating app.",
                    "Understanding localness of knowledge sharing: a study of Naver KiN 'here'.",
                    "Comparing evaluation methods for encumbrance and walking on interaction with touchscreen mobile devices.",
                    "Field evaluation of a camera-based mobile health system in low-resource settings.",
                    "Was it worth the hassle?: ten years of mobile HCI research discussions on lab and field evaluations.",
                    "Comparing pointing techniques for grasping hands on tablets.",
                    "BoD taps: an improved back-of-device authentication technique on smartphones.",
                    "Toffee: enabling ad hoc, around-device interaction with acoustic time-of-arrival correlation.",
                    "BackPat: one-handed off-screen patting gestures.",
                    "Around-device devices: my coffee mug is a volume dial.",
                    "Contextual experience sampling of mobile application micro-usage.",
                    "Mobile cloud storage: a contextual experience.",
                    "A wearable virtual guide for context-aware cognitive indoor navigation.",
                    "Learning to recognise disruptive smartphone notifications.",
                    "Exploring smartphone-based interaction with overview+detail interfaces on 3D public displays.",
                    "Identifying suitable projection parameters and display configurations for mobile true-3D displays.",
                    "Portallax: bringing 3D displays capabilities to handhelds.",
                    "Spaces of innovation in complex UX design.",
                    "Interaction for reading comprehension on mobile devices.",
                    "A long-term field study on the adoption of smartphones by children in panama.",
                    "Understanding shortcut gestures on mobile touch devices.",
                    "JuxtaPinch: exploring multi-device interaction in collocated photo sharing.",
                    "Are you comfortable doing that?: acceptance studies of around-device gestures in and for public settings.",
                    "Monox: extensible gesture notation for mobile devices.",
                    "Automating UI tests for mobile applications with formal gesture descriptions.",
                    "100 days of iPhone use: understanding the details of mobile device use.",
                    "An in-situ study of mobile phone notifications.",
                    "ProactiveTasks: the short of mobile device use sessions.",
                    "User challenges and successes with mobile payment services in North America.",
                    "TalkZones: section-based time support for presentations.",
                    "Direct manipulation video navigation on touch screens.",
                    "Enhancing KLM (keystroke-level model) to fit touch screen mobile devices.",
                    "Around-body interaction: sensing & interaction techniques for proprioception-enhanced input with mobile devices.",
                    "Investigating the effectiveness of peephole interaction for smartwatches in a map navigation task.",
                    "ambiPad: enriching mobile digital media with ambient feedback.",
                    "Cuenesics: using mid-air gestures to select items on interactive public displays.",
                    "AirAuth: evaluating in-air hand gestures for authentication.",
                    "MirrorTouch: combining touch and mid-air gestures for public displays.",
                    "Probabilistic touchscreen keyboard incorporating gaze point information.",
                    "The inviscid text entry rate and its application as a grand goal for mobile text entry.",
                    "Texting while walking: an evaluation of mini-qwerty text input while on-the-go.",
                    "ReviewCollage: a mobile interface for direct comparison using online reviews.",
                    "Mobile interaction analysis: towards a novel concept for interaction sequence mining.",
                    "FlexiGroups: binding mobile devices for collaborative interactions in medium-sized groups with device touch.",
                    "Ubi-jector: an information-sharing workspace in casual places using mobile devices.",
                    "CoSMiC: designing a mobile crowd-sourced collaborative application to find a missing child in situ.",
                    "Effective multimodal feedback for around-device interfaces.",
                    "Enhanced situational awareness and communication for emergency response.",
                    "Email management and work-home boundaries.",
                    "The effects of encumbrance on mobile interactions.",
                    "Co-design of cognitive telerehabilitation technologies.",
                    "Adaption of usability evaluation methods for native smartphone applications.",
                    "Body-worn sensors for remote implicit communication.",
                    "Urgent mobile tool for hearing impaired, language dysfunction and foreigners at emergency situation.",
                    "JuxtaPinch: an application for collocated multi-device photo sharing.",
                    "The realization of new virtual forest experience environment through PDA.",
                    "Back-of-device authentication with bod taps and bod shapes.",
                    "SqueezeDiary: using squeeze gesture as triggers of diary events.",
                    "Off the couch and out of the hospital, mobile applications for acceptance and commitment therapy.",
                    "Wearable haptic gaming using vibrotactile arrays.",
                    "Mobile experience lab: body editing.",
                    "Non-verbal communications in mobile text chat: emotion-enhanced mobile chat.",
                    "Changed shape of key: an approach to enhance the performance of the soft keyboard.",
                    "Ergonomic characteristics of gestures for front- and back-of-tablets interaction with grasping hands.",
                    "Towards usable and acceptable above-device interactions.",
                    "A comparison of location search UI patterns on mobile devices.",
                    "GUIDES: a graphical user identifier scheme using sketching for mobile web-services.",
                    "MuGIS multi-user geographical information system.",
                    "AudioTorch: using a smartphone as directional microphone in virtual audio spaces.",
                    "Wearable remote control of a mobile device: comparing one- and two-handed interaction.",
                    "Interactive opinion polls on public displays: studying privacy requirements in the wild.",
                    "Toward a non-intrusive, physio- behavioral biometric for smartphones.",
                    "A design framework of branded mobile applications.",
                    "Keep an eye on your photos: automatic image tagging on mobile devices.",
                    "Gravity: automatic location tracking system between a car and a pedestrian.",
                    "Shake 'n' Tap: a gesture enhanced keyboard for older adults.",
                    "Augmenting bend gestures with pressure zones on flexible displays.",
                    "A systematic comparison of 3 phrase sampling methods for text entry experiments in 10 languages.",
                    "Developing tactile feedback for wearable presentation: observations from using a participatory approach.",
                    "\"People don't bump\": sharing around mobile phones in close proximity.",
                    "Mobile designs to support user experiences of energy conservation in hotels.",
                    "Mobile-based tangible interaction techniques for shared displays.",
                    "Wearable computing: a human-centered view of key concepts, application domains, and quality factors.",
                    "Mobile health: beyond consumer apps.",
                    "Speech-based interaction: myths, challenges, and opportunities.",
                    "People, places and things: a mobile locative mapping workshop.",
                    "PID-MAD 2014: second international workshop on prototyping to support the interaction designing in mobile application development.",
                    "Enhancing self-reflection with wearable sensors.",
                    "Socio-technical practices and work-home boundaries.",
                    "Re-imagining commonly used mobile interfaces for older adults.",
                    "Workshop on designing the future of mobile healthcare support.",
                    "NARRATIVES: geolocative cinema application.",
                    "The switchboard: a virtual proprioceptive training and rehabilitation device.",
                    "Time tremors: developing transmedia gaming for children.",
                    "CoPerformance: a rapid prototyping platform for developing interactive artist-audience performances with mobile devices.",
                    "Phonorama: mobile spatial navigation by directional stereophony.",
                    "Experimenting on the cognitive walkthrough with users.",
                    "Logging an visualization of touch interactions on teach pendants.",
                    "Polly: \"being there\" through the parrot and a guide.",
                    "UX suite: a touch sensor evaluation platform.",
                    "Design and field testing of a system for remote monitoring of sea turtle nests."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "15th Mobile HCI 2013",
        "info": "Munich, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/mhci/2013",
                "sub_name": "15th International Conference on Human-Computer Interaction with Mobile Devices and Services, MobileHCI '13, Munich, Germany, August 27 - 30, 2013.",
                "count": 94,
                "papers": [
                    "Peripheral vibro-tactile displays.",
                    "Side pressure for bidirectional navigation on small devices.",
                    "Finding my beat: personalised rhythmic filtering for mobile music interaction.",
                    "VibPress: estimating pressure input using vibration absorption on mobile devices.",
                    "Annotating ecology: looking to biological fieldwork for mobile spatial annotation workflows.",
                    "Apps for art's sake: resistance and innovation.",
                    "The reconfiguration of triage by introduction of technology.",
                    "Enhancing remote live sports experiences through an eyes-free interaction.",
                    "Voice augmented manipulation: using paralinguistic information to manipulate mobile devices.",
                    "Understanding performance of eyes-free, absolute position control on touchable mobile phones.",
                    "Mobile pointing task in the physical world: balancing focus and performance while disambiguating.",
                    "Playing it real again: a repeated evaluation of magic lens and static peephole interfaces in public space.",
                    "Towards the design of an intuitive multi-view video navigation interface based on spatial information.",
                    "Toward compound navigation tasks on mobiles via spatial manipulation.",
                    "Imaginary devices: gesture-based interaction mimicking traditional input devices.",
                    "Does size matter?: investigating the impact of mobile phone screen size on users' perceived usability, effectiveness and efficiency.",
                    "Mobile devices as infotainment user interfaces in the car: contextual study and design implications.",
                    "Managing distractions in complex settings.",
                    "Exploring pinch and spread gestures on mobile devices.",
                    "No-look flick: single-handed and eyes-free Japanese text input system on touch screens of mobile devices.",
                    "Analysis of children's handwriting on touchscreen phones.",
                    "Sandwich keyboard: fast ten-finger typing on a mobile device with adaptive touch sensing on the back side.",
                    "Writing handwritten messages on a small touchscreen.",
                    "Can you see me now?: location, visibility and the management of impressions on foursquare.",
                    "City scene: field trial of a mobile street-imagery-based navigation service.",
                    "Moving beyond the map: automated landmark based pedestrian guidance using street level panoramas.",
                    "Investigating collaborative mobile search behaviors.",
                    "Responsive lighting: the city becomes alive.",
                    "Exploring smartphone-based web user interfaces for appliances.",
                    "Twisting touch: combining deformation and touch as input within the same interaction cycle on handheld devices.",
                    "ProjectorKit: easing rapid prototyping of interactive applications for mobile projectors.",
                    "Improving user authentication on mobile devices: a touchscreen graphical password.",
                    "Patterns in the wild: a field study of the usability of pattern and pin-based authentication on mobile devices.",
                    "Know your enemy: the risk of unauthorized access in smartphones by insiders.",
                    "Money on the move workload, usability and technology acceptance of second-screen atm-interactions.",
                    "Design guidelines for adaptive multimodal mobile input solutions.",
                    "Keep doing what i just did: automating smartphones by demonstration.",
                    "At the mobile experience flicks: making short films to make sense for mobile interaction design.",
                    "ACQR: acoustic quick response codes for content sharing on low end phones with no internet connectivity.",
                    "Exploring the interplay between community media and mobile web in developing regions.",
                    "The paper slip should be there!: perceptions of transaction receipts in branchless banking.",
                    "'Eyes free' in-car assistance: parent and child passenger collaboration during phone calls.",
                    "Smartphone use does not have to be rude: making phones a collaborative presence in meetings.",
                    "What's up with whatsapp?: comparing mobile instant messaging behaviors with traditional SMS.",
                    "Upright or sideways?: analysis of smartphone postures in the wild.",
                    "Making sense of screen mobility: dynamic maps and cartographic literacy in a highly mobile activity.",
                    "User-specific touch models in a cross-device context.",
                    "Oh app, where art thou?: on app launching habits of smartphone users.",
                    "Rapid selection of hard-to-access targets by thumb on mobile touch-screens.",
                    "Sparse selection of training data for touch correction systems.",
                    "OMG!: a new robust, wearable and affordable open source mobile gaze tracker.",
                    "MagPen: magnetically driven pen interactions on and around conventional smartphones.",
                    "A DIY power monitor to compare mobile energy consumption in situ.",
                    "Co-designing for NFC and ATMs: an inspirational bits approach.",
                    "Giving voice to enterprise mobile applications.",
                    "HMI development for a purpose-built electric taxi in Singapore.",
                    "An accessible, large-print, listening and talking e-book to support families reading together.",
                    "An experimentation environment for mobile 3D and virtual reality.",
                    "Creating a stereoscopic magic-lens to improve depth perception in handheld augmented reality.",
                    "Enhanced virtual transparency in handheld ar: digital magnifying glass.",
                    "Interaction with services using an augmented reality user interface.",
                    "Mobile augmented reality: exploring content in natural and controlled settings using 3d tracking.",
                    "PACMAN UI: vision-based finger detection for positioning and clicking manipulations.",
                    "Pufftext: a puff controlled software-based hands-free spin keyboard for mobile phones.",
                    "Storyteller: in-situ reflection on study experiences.",
                    "TimedNavigation: a time-based navigation approach.",
                    "A study of developing auditory icons for mobile phone service applications in taiwan region.",
                    "A tap and gesture hybrid method for authenticating smartphone users.",
                    "An interface for context-aware retrieval of mobile contacts.",
                    "Assessing contextual mood in public transport: a pilot study.",
                    "Connecting stakeholders through context logging.",
                    "Contextualise! personalise! persuade!: a mobile HCI framework for behaviour change support systems.",
                    "Developing mobile interface metaphors and gestures.",
                    "Evaluating NFC and touchscreen interactions in collaborative mobile pervasive games.",
                    "Exploring mobile representations of folksonomies to support the example context of a community gardening project.",
                    "Landscape vs portrait mode: which is faster to use on your smart phone?",
                    "Lessons learned from participatory design with and for people with dementia.",
                    "Linear interface for graphical interface of touch-screen: a pilot study on improving accessibility of the android-based mobile devices.",
                    "Milky: on-product app for emotional product to human interactions.",
                    "Moving shapes: a multiplayer game based on color detection running on public displays.",
                    "Proximity sensor: privacy-aware location sharing.",
                    "Representing and interpreting reformation in the wild.",
                    "Revisiting phone call UIs for multipurpose mobile phones.",
                    "Smart2poster. bridging information and locality.",
                    "Stop questioning me!: towards optimizing user involvement during data collection on mobile devices.",
                    "Tablets use in emerging markets: an exploration.",
                    "WozARd: a wizard of oz tool for mobile AR.",
                    "i2ME: a framework for building interactive mockups.",
                    "Informing future design via large-scale research methods and big data.",
                    "Designing mobile augmented reality.",
                    "Entertainment technology in transportation against frustration, aggression and irrationality.",
                    "SiMPE: 8th workshop on speech and sound in mobile and pervasive environments.",
                    "U-PriSM 2: the second usable privacy and security for mobile devices workshop.",
                    "Workshop on prototyping to support the interaction designing in mobile application development (PID-MAD 2013)."
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "14th Mobile HCI 2012",
        "info": "San Francisco, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/mhci/2012",
                "sub_name": "Mobile HCI '12, Proceedings of the 14th international conference on Human-computer interaction with mobile devices and services, San Francsico, CA, USA, September 21-24, 2012.",
                "count": 54,
                "papers": [
                    "Understanding tablet use: a multi-method exploration.",
                    "Exploring iPhone usage: the influence of socioeconomic differences on smartphone adoption, usage and usability.",
                    "A note paper on note-taking: understanding annotations of mobile phone calls.",
                    "Patterns of usage and context in interaction with communication support applications in mobile devices.",
                    "An exploration of inadvertent variations in mobile pressure input.",
                    "The fat thumb: using the thumb's contact size for single-handed mobile interaction.",
                    "The hold-and-move gesture for multi-touch interfaces.",
                    "Brush-and-drag: a multi-touch interface for photo triaging.",
                    "A longitudinal review of Mobile HCI research methods.",
                    "EdgeSplit: facilitating the selection of off-screen objects.",
                    "Around device interaction for multiscale navigation.",
                    "Dynamic visualization of large numbers of off-screen objects on mobile devices: an experimental comparison of wedge and overview+detail.",
                    "How to position the cursor?: an exploration of absolute and relative cursor positioning for back-of-device input.",
                    "Soft trust and mCommerce shopping behaviours.",
                    "Context-aware, technology enabled social contribution for public safety using M-Urgency.",
                    "\"There are no secrets here!\": professional stakeholders' views on the use of GPS for tracking dementia patients.",
                    "But i don't trust my friends: ecofriends - an application for reflective grocery shopping.",
                    "A recognition safety net: bi-level threshold recognition for mobile motion gestures.",
                    "Extending a mobile device's interaction space through body-centric interaction.",
                    "Tilt displays: designing display surfaces with multi-axis tilting and actuation.",
                    "m+pSpaces: virtual workspaces in the spatially-aware mobile environment.",
                    "Creative cameraphone use in rural developing regions.",
                    "AutoWeb: automatic classification of mobile web pages for revisitation.",
                    "Enough power to move: dimensions for representing energy availability.",
                    "Revisiting peephole pointing: a study of target acquisition with a handheld projector.",
                    "Mobile augmented reality: exploring design and prototyping techniques.",
                    "Playing it real: magic lens and static peephole interfaces for games in a public space.",
                    "Integrating the physical environment into mobile remote collaboration.",
                    "Touch behavior with different postures on soft smartphone keyboards.",
                    "Digging unintentional displacement for one-handed thumb use on touchscreen-based mobile devices.",
                    "PinyinPie: a pie menu augmented soft keyboard for chinese pinyin input methods.",
                    "An empirical investigation into how users adapt to mobile phone auto-locks in a multitask setting.",
                    "Back to the app: the costs of mobile application interruptions.",
                    "Visual search on a mobile device while walking.",
                    "Bridging waiting times on web pages.",
                    "Thermal icons: evaluating structured thermal feedback for mobile interaction.",
                    "Touching the micron: tactile interactions with an optical tweezer.",
                    "An evaluation of BrailleTouch: mobile touchscreen text entry for the visually impaired.",
                    "PocketMenu: non-visual menus for touch screen devices.",
                    "Clicking blindly: using spatial correspondence to select targets in multi-device environments.",
                    "A real-world study of an audio-tactile tourist guide.",
                    "TraceViz: \"brushing\" for location based services.",
                    "Urban exploration using audio scents.",
                    "iFitQuest: a school based study of a mobile location-aware exergame for adolescents.",
                    "Tacticycle: supporting exploratory bicycle trips.",
                    "Displaying mobile feedback during a presentation.",
                    "MobiComics: collaborative use of mobile phones and large displays for public expression.",
                    "I wanted to settle a bet!: understanding why and how people use mobile search in social settings.",
                    "Degrees of sharing: proximate media sharing and messaging by young people in khayelitsha.",
                    "Investigating collaborative annotation on slate pcs.",
                    "An investigation into the use of tactile instructions in snowboarding.",
                    "Tip tap tones: mobile microtraining of mandarin sounds.",
                    "MemReflex: adaptive flashcards for mobile microlearning.",
                    "Mobilizing education: evaluation of a mobile learning tool in a low-income school."
                ]
            },
            {
                "sub_name_abbr": "conf/mhci/2012c",
                "sub_name": "Mobile HCI '12, Companion Proceedings of the 14th international conference on Human-computer interaction with mobile devices and services, San Francsico, CA, USA, September 21-24, 2012.",
                "count": 60,
                "papers": [
                    "How to stop being a buzzkill: designing yamove!, a mobile tech mash-up to truly augment social play.",
                    "PaceGuard: improving running cadence by real-time auditory feedback.",
                    "A study of on-device gestures.",
                    "Walk2Build: a GPS game for mobile exergaming with city visualization.",
                    "QWERTH: an optimized semi-ambiguous keyboard design.",
                    "Investigating mobile quality of experience in public transport.",
                    "TeleTorchlight: remote pointing and annotation using a mobile camera projector.",
                    "A look at spectator technology: location-based services and mobile habits of collegiate sports fans.",
                    "Safe mathare: a mobile system for women's safe commutes in the slums.",
                    "Smart and space-aware interactions using smartphones in a shared space.",
                    "Design for emotion: a case study.",
                    "A wizard of oz tool for android.",
                    "Visualizing mobile design pattern relationships.",
                    "Force code: a new interaction technique using tangential force input.",
                    "User study of the subjective quality of mobile streaming service.",
                    "Exploring the effects of size on deformable user interfaces.",
                    "Privacy and secrecy in ubiquitous text messaging.",
                    "Camera-based mobile interaction techniques for physical objects.",
                    "Gender differences in the perception of security of mobile phones.",
                    "View from a distance: comparing online and retrospective ux-evaluations.",
                    "Wall Play: a novel wall/floor interaction concept for mobile projected gaming.",
                    "Monocular vision-based collision avoidance system.",
                    "When camera meets accelerometer: a novel way for 3d interaction of mobile phone.",
                    "A mobile application for collaborative learning.",
                    "Extracting user experience centered product requirements for mobile social media applications.",
                    "A prototype setup to integrate the physical environment into mobile remote collaboration.",
                    "Demonstration of an audio-tactile tourist guide.",
                    "AutoWeb: automatic classification of mobile web pages for revisitation.",
                    "Braille Touch: mobile touchscreen text entry for the visually impaired.",
                    "Breath mobile: a low-cost software-based breathing controlled mobile phone interface.",
                    "Brush-and-drag: a multi-touch interface for photo triaging.",
                    "Clip-on gadgets: expandable tactile controls for multi-touch devices.",
                    "A system for interactive visualization of off-screen objects on mobile devices.",
                    "EducaMovil: a mobile learning tool for low-income schools.",
                    "Exploring multi-dimensional data on mobile devices with single hand motion and orientation gestures.",
                    "Headphone taps: a simple technique to add input function to regular headphones.",
                    "MagiGuitar: a guitar that is played in air!",
                    "Magnetic signatures in air for mobile devices.",
                    "Meaningful melodies: personal sonification of text messages for mobile devices.",
                    "MemReflex: adaptive flashcards for mobile microlearning.",
                    "Mobile monitoring and control system for a food industry development laboratory.",
                    "POI Poi: point-of-interest poi for multimodal tethered whirling.",
                    "SideBySide: multi-user gestural interaction with handheld projectors.",
                    "The fat thumb: using the thumb's contact size for single-handed mobile interaction.",
                    "The hold-and-move gesture for multi-touch interfaces.",
                    "Tempera-tour, hot apps, cool widgets: thermal feedback for mobile devices.",
                    "Tilt display demonstration: a display surface with multi-axis tilt & actuation.",
                    "Tip tap tones: mobile microtraining of mandarin sounds.",
                    "Touching the micron: tactile interactions with an optical tweezer.",
                    "TraceViz: \"brushing\" for location based services.",
                    "Zone of impulse: physiological data enhanced gaming.",
                    "Mobile augmented reality: design, prototyping and evaluation.",
                    "Second mobile accessibility workshop.",
                    "The car as an arena for gaming.",
                    "Interaction with deformable displays.",
                    "Research in the large 3.0: app stores, wide distribution, and big data in MobileHCI research.",
                    "Workshop on mobility and web behaviors (MWB).",
                    "Mobile vision (MobiVis): vision-based applications and HCI.",
                    "SiMPE: 7th workshop on speech and sound in mobile and pervasive environments.",
                    "Research methods in Mobile HCI: trends and opportunities."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "13th Mobile HCI 2011",
        "info": "Stockholm, Sweden",
        "venues": [
            {
                "sub_name_abbr": "conf/mhci/2011",
                "sub_name": "Proceedings of the 13th Conference on Human-Computer Interaction with Mobile Devices and Services, Mobile HCI 2011, Stockholm, Sweden, August 30 - September 2, 2011.",
                "count": 116,
                "papers": [
                    "Exploring the effects of cumulative contextual cues on interpreting vibrotactile messages.",
                    "Tactile effect design and evaluation for virtual buttons on a mobile device touchscreen.",
                    "Intimate mobiles: grasping, kissing and whispering as a means of telecommunication in mobile phones.",
                    "Virtual sensors: rapid prototyping of ubiquitous interaction with a mobile phone and a Kinect.",
                    "Kick: investigating the use of kick gestures for mobile interactions.",
                    "A prototype of gesture-based interface.",
                    "Ethnography of the telephone: changing uses of communication technology in village life.",
                    "Falling asleep with Angry Birds, Facebook and Kindle: a large scale study on mobile application usage.",
                    "Performing a check-in: emerging practices, norms and 'conflicts' in location-sharing using foursquare.",
                    "Understanding mobile web and mobile search use in today's dynamic mobile landscape.",
                    "Understanding the importance of location, time, and people in mobile local search behavior.",
                    "Exploring display techniques for mobile collaborative learning in developing regions.",
                    "EcoChallenge: a race for efficiency.",
                    "\"Showing off\" your mobile device: adult literacy learning in the classroom and beyond.",
                    "Locast H2Flow: contextual learning through mobile video and guided documentary production.",
                    "Mobidev: a tool for creating apps on mobile phones.",
                    "Forcetap: extending the input vocabulary of mobile touch screens by adding tap gestures.",
                    "Evaluation of mapping functions for one-handed flick operations on a mobile device.",
                    "100, 000, 000 taps: analysis and improvement of touch performance in the large.",
                    "The effects of walking speed on target acquisition on a touchscreen interface.",
                    "The effects of walking, feedback and control method on pressure-based interaction.",
                    "Design of an intelligible mobile context-aware application.",
                    "Barriers and bridges in the adoption of today's mobile phone contextual services.",
                    "Field study of a waiting-time filler delivery system.",
                    "Investigating episodes of mobile phone activity as indicators of opportune moments to deliver notifications.",
                    "The influence of the spatial separation of control elements on the workload for mobile information systems.",
                    "Exploring user preferences for indoor navigation support through a combination of mobile and fixed displays.",
                    "Handheld augmented reality indoor navigation with activity-based instructions.",
                    "Pedestrian navigation with degraded GPS signal: investigating the effects of visualizing position uncertainty.",
                    "The secret life of my dog: design and evaluation of paw tracker concept.",
                    "Unpacking social interaction that make us adore: on the aesthetics of mobile phones as fashion items.",
                    "The hybrid shopping list: bridging the gap between physical and digital shopping lists.",
                    "Mirrormap: augmenting 2d mobile maps with virtual mirrors.",
                    "Augmented reality vs. street views: a driving simulator study comparing two emerging navigation aids.",
                    "Zebralocalizer: identification and localization of pedestrian crossings.",
                    "Navigating the world and learning to like it: mobility training through a pervasive game.",
                    "A versatile dataset for text entry evaluations based on genuine mobile emails.",
                    "Script-agnostic reflow of text in document images.",
                    "Understanding information preview in mobile email processing.",
                    "Solving the great Indian text input puzzle: touch screen-based mobile text input design.",
                    "Design and evaluation of Devanagari virtual keyboards for touch screen mobile phones.",
                    "PoCoMo: projected collaboration using mobile devices.",
                    "Prochinima: using pico projector to tell situated stories.",
                    "An exploratory study on the use of camera phones and pico projectors in rural India.",
                    "Evaluating depth illusion as method of adding emphasis in autostereoscopic mobile displays.",
                    "Content splitting & space sharing: collaboratively reading & sharing children's stories on mobile devices.",
                    "Naturalistic enactment to stimulate user experience for the evaluation of a mobile elderly care application.",
                    "People-centric mobile sensing with a pragmatic twist: from behavioral data points to active user involvement.",
                    "Experience characters: a design tool for communicating mobile phone experiences to designers.",
                    "Ubiquitous sketching for social media.",
                    "Sketching in software and hardware Bluetooth as a design material.",
                    "Visual reporting in time-critical work: exploring video use in emergency response.",
                    "Live-streaming mobile video: production as civic engagement.",
                    "Crowdsourced news reporting: supporting news content creation with mobile phones.",
                    "Smart phone use by non-mobile business users.",
                    "Beyond 'yesterday's tomorrow': towards the design of awareness technologies for the contemporary worker.",
                    "On the need for different security methods on mobile phones.",
                    "Mystate: sharing social and contextual information through touch interactions with tagged objects.",
                    "Characterizing user performance with assisted direct off-screen pointing.",
                    "Proximal and distal selection of widgets: designing distributed UI for mobile interaction with large display.",
                    "\"Can we work this out?\": an evaluation of remote collaborative interaction in a mobile shared environment.",
                    "The phone rings but the user doesn't answer: unavailability in mobile communication.",
                    "Exploring serendipitous social networks: sharing immediate situations among unacquainted individuals.",
                    "User experience in speech recognition of navigation devices: an assessment.",
                    "Mobile application for utility domains.",
                    "Feedback on the definition and design of innovative mobile services.",
                    "Using physical objects to enable enriched video communication.",
                    "Oh music, where art thou?",
                    "Markerless visual fingertip detection for natural mobile device interaction.",
                    "TouchOver map: audio-tactile exploration of interactive maps.",
                    "Legible thumbnail: summarizing on-line handwritten documents based on emphasized expressions.",
                    "A mobile guide for serendipitous exploration of cities.",
                    "Walky for embodied microblogging: sharing mundane activities through augmented everyday objects.",
                    "Pathlight: supporting navigation of small groups in the museum context.",
                    "3D interaction using mobile device on 3D environments with large screen.",
                    "Release your app on Sunday eve: finding the best time to deploy apps.",
                    "Bottom billion architecture: a generic software architecture for ICTD use case scenarios.",
                    "Mobile technology keeping people with dementia independent and socially active.",
                    "Restyling website design via touch-based interactions.",
                    "The mighty un-touchables: creating playful engagement on media façades.",
                    "Context tags: exploiting user-given contextual cues for disambiguation.",
                    "Much: presenting Roman church music in hand-held, locative hyper-audio.",
                    "Moody mobile TV: adding emotion to personalized playlists.",
                    "Interactivity to enhance perception: does increased interactivity in mobile visual presentation tools facilitate more accurate rating of textile properties?",
                    "Prototyping input controller for touch-less interaction with ubiquitous environments.",
                    "A snapshot diary to support conversational storytelling for persons with aphasia.",
                    "M-Urgency: a next generation, context-aware public safety application.",
                    "Open-source platform: exploring the opportunities for offline mobile learning.",
                    "Feeling the next track: designing mobile music player previews.",
                    "Utilizing sensor fusion in markerless mobile augmented reality.",
                    "Decreasing media breaks through content sharing in wireless networks with mobile devices.",
                    "Like the real world: online aesthetics and habits transferred to the physical space.",
                    "Free All Monsters!: a context-aware location based game.",
                    "Multimodal multi-device program guide for smart conferences.",
                    "Blicko social music places.",
                    "Real-time object recognition using mobile devices.",
                    "Mobile thumb interaction and speech.",
                    "First contact: encouraging use of emergency contact details on mobile phones.",
                    "MAWL: mobile assisted word-learning.",
                    "Spaces Without Faces.",
                    "BrailleTouch: designing a mobile eyes-free soft keyboard.",
                    "Designing mobile phones using silent speech input and auditory feedback.",
                    "We need to talk: rediscovering audio for universal access.",
                    "Time to revisit mobility in mobile HCI?",
                    "Mobile family interaction: how to use mobile technology to bring trust, safety and wellbeing into families.",
                    "IWS: interacting with sound: a workshop exploring context-aware, local and social audio applications.",
                    "Workshop on mobile interaction in retail environments (MIRE).",
                    "SiMPE: 6th Workshop on Speech in Mobile and Pervasive Environments.",
                    "Mobile work efficiency: enhancing workflows with mobile devices.",
                    "Exploring Design Methods for Mobile Learning.",
                    "Please enjoy!?: 2nd workshop on playful experiences in mobile HCI.",
                    "Mobile augmented reality: design issues and opportunities.",
                    "Internet of things marries social media.",
                    "Body, movement, gesture & tactility in interaction with mobile devices.",
                    "Mobile wellness: collecting, visualizing and interacting with personal health data.",
                    "Designing and evaluating mobile systems for collocated group use."
                ]
            }
        ]
    },
    {
        "year": "2010",
        "name": "12th Mobile HCI 2010",
        "info": "Lisbon, Portugal",
        "venues": [
            {
                "sub_name_abbr": "conf/mhci/2010",
                "sub_name": "Proceedings of the 12th Conference on Human-Computer Interaction with Mobile Devices and Services, Mobile HCI 2010, Lisbon, Portugal, September 7-10, 2010.",
                "count": 116,
                "papers": [
                    "My new pc is a mobile phone: techniques and technology for the new smallness.",
                    "Swipe is the new swoosh: how interaction design is changing the role of brand.",
                    "Mobile apps and the approaching zombie apocalypse.",
                    "Using mobile devices to support communication between emergency medical responders and deaf people.",
                    "Timbremap: enabling the visually-impaired to use maps on touch-enabled devices.",
                    "Supporting blind users in selecting from very long lists of items on mobile phones.",
                    "Assessing mobile touch interfaces for tetraplegics.",
                    "Mobile broadcasting: the whats and hows of live video as a social medium.",
                    "Linked internet UI: a mobile user interface optimized for social networking.",
                    "Hide and seek: location sharing practices with social media.",
                    "Social practices and mobile phone use of young migrant workers.",
                    "Semi-automatic zooming for mobile map navigation.",
                    "User experiences with activity-based navigation on mobile devices.",
                    "Situated local and global orientation in mobile you-are-here maps.",
                    "Investigating selection and reading performance on a mobile phone while walking.",
                    "Effects of content and time of delivery on receptivity to mobile interruptions.",
                    "Contextual push-to-talk: shortening voice dialogs to improve driving performance.",
                    "Mobile interaction with static and dynamic NFC-based displays.",
                    "Mobile and physical user interfaces for NFC-based mobile interaction with multiple tags.",
                    "Novel interfaces for digital cameras and camera phones.",
                    "Towards using embedded magnetic field sensor for around mobile device 3D interaction.",
                    "An explorative comparison of magic lens and personal projection for interacting with smart objects.",
                    "Zooming interfaces for augmented reality browsers.",
                    "RearType: text entry using keys on the back of a device.",
                    "Pressure-based menu selection for mobile devices.",
                    "Evaluation of an off-screen visualization for magic lens and dynamic peephole interfaces.",
                    "Exploiting the icon arrangement on mobile devices as information source for context-awareness.",
                    "An evaluation of product review modalities for mobile phones.",
                    "Off the beaten track: a mobile field study exploring the long tail of tourist recommendations.",
                    "Cross-platform service user experience: a field study and an initial framework.",
                    "A large scale study of text-messaging use.",
                    "User-defined gestures for connecting mobile phones, public displays, and tabletops.",
                    "Interacting with the flow.",
                    "Designing spatial audio interfaces to support multiple audio streams.",
                    "Improving vibrotactile pattern identification for mobile devices using perceptually transparent rendering.",
                    "GesturePIN: using discrete gestures for associating mobile devices.",
                    "Tactics for homing in mobile life: a fieldwalk study of extremely mobile people.",
                    "Would you do that?: understanding social acceptance of gestural interfaces.",
                    "Cross-use of smart phones and printed books in primary school education.",
                    "Field testing mobile digital storytelling software in rural Kenya.",
                    "Data logging plus e-diary: towards an online evaluation approach of mobile service field trial.",
                    "Amarino: a toolkit for the rapid prototyping of mobile ubiquitous computing.",
                    "On-demand cross-device interface components migration.",
                    "Virtual hooping: teaching a phone about hula-hooping for fitness, fun and rehabilitation.",
                    "Visualization of off-screen objects in mobile augmented reality.",
                    "Shared-screen social gaming with portable devices.",
                    "Contextual queries express mobile information needs.",
                    "Collaborative use of mobile phones for brainstorming.",
                    "\"I did it my way\": moving away from the tyranny of turn-by-turn pedestrian navigation.",
                    "Usability evaluation of beep-to-the-box.",
                    "Designing enterprise applications that connect employees on the go.",
                    "Designing a photo sharing service for mobile: a phone number as the key enabler.",
                    "A comparison of speech and GUI input for navigation in complex visualizations on mobile devices.",
                    "Addressing mobile information overload in the universal inbox through lenses.",
                    "A practical examination of multimodal feedback and guidance signals for mobile touchscreen keyboards.",
                    "Image-based cycle route generation on mobile devices.",
                    "Personal mobile controller for blind people.",
                    "Push the study to the App store: evaluating off-screen visualizations for maps in the android market.",
                    "Location and orientation based point of interest search interface.",
                    "Interaction with combinations of maps and images for pedestrian navigation and virtual exploration.",
                    "The key role of touch in non-visual mobile interaction.",
                    "Stroke++: a hybrid chinese input method for touch screen mobile phones.",
                    "Sharing mobile services: beyond the App store model.",
                    "Surpassing farley files: opportunities and challenges on obtaining personally relevant information.",
                    "Users' needs for social tagging and sharing on mobile contacts.",
                    "Mobile learning scenarios from a UCD perspective.",
                    "Designing to capture and share life experiences for persons with aphasia.",
                    "DRec: exploring indoor navigation with an un-augmented smart phone.",
                    "Multisensor data fusion for high accuracy positioning on mobile phones.",
                    "Indoor pedestrian navigation system using a modern smartphone.",
                    "Scanning angles for directional pointing.",
                    "Benchmarks for intuitive interaction with mobile devices.",
                    "Spatiotemporal visualization of mobile user experience.",
                    "Controlling ambient information flow between smart objects with a mobile mixed-reality interface.",
                    "Energy usage responsive space and personal mobile devices.",
                    "SemantiLynx: context based icons for mobile web navigation and directed search tasks.",
                    "\"Privacy-shake\", : a haptic interface for managing privacy settings in mobile location sharing applications.",
                    "Mobile service experiences: qualitative study with a broader perspective.",
                    "CAM: a collaborative object memory system.",
                    "Geo-referenced collaborative psychotherapy: design and evaluation of a low-fidelity prototype.",
                    "Google Sky Map: using your phone as an interface.",
                    "PocketNavigator: vibro-tactile waypoint navigation for everyday mobile devices.",
                    "ALEX: mobile language assistant for low-literacy adults.",
                    "AppAware: which mobile applications are hot?",
                    "Multi-pointer and collaborative system for mobile devices.",
                    "Secure and usable P2P VoIP for mobile devices.",
                    "MagiWrite: towards touchless digit entry using 3D space around mobile devices.",
                    "Co-interactive table: a new facility to improve collaborative meetings.",
                    "Behand: augmented virtuality gestural interaction for mobile phones.",
                    "Foogue: eyes-free interaction for smartphones.",
                    "Touch to play: mobile gaming with dynamic, NFC-based physical user interfaces.",
                    "HappyFeet! influencing at the turning points: walking or scooter ride for short-distance journey?",
                    "Find it: information at hand.",
                    "Pulse: tangible touch.",
                    "Day pad: a daily life assistant for autistic children.",
                    "Many tabs make a light board.",
                    "Interactive mobile presentation of textiles.",
                    "AppAware: serendipity in mobile applications.",
                    "Designing spatial audio interfaces for mobile devices: supporting multitasking and context information.",
                    "Influence of feedback on the quality of multimodal systems.",
                    "Assessing mobile-wise individual differences in the blind.",
                    "Indoor simultaneous localization and mapping for pedestrian with wearable computing.",
                    "On the move: creating domesticity through experience design.",
                    "Interaction assessment through physiological interfaces in collaborative & mobile environments.",
                    "Information visualization on mobile environments.",
                    "Improving mobile interaction with context-awareness, multimodality, and adaptive interfaces.",
                    "The Gurus' views 2010.",
                    "Tool-support for mobile and pervasive application development - issues and challenges.",
                    "Ensembles of on-body devices.",
                    "Please enjoy!: workshop on playful experiences in mobile HCI.",
                    "MobileHCI'10 workshop summary: social mobile web.",
                    "Mobile social signal processing: vision and research issues.",
                    "Mobile HCI and technical ICTD: a methodological perspective.",
                    "SiMPE: 5th workshop on speech in mobile and pervasive environments.",
                    "Using audio and haptics for delivering spatial information via mobile devices.",
                    "Nudge & influence through mobile devices."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "11th Mobile HCI 2009",
        "info": "Bonn, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/mhci/2009",
                "sub_name": "Proceedings of the 11th Conference on Human-Computer Interaction with Mobile Devices and Services, Mobile HCI 2009, Bonn, Germany, September 15-18, 2009.",
                "count": 109,
                "papers": [
                    "Text versus speech: a comparison of tagging input modalities for camera phones.",
                    "Fixed in time and \"time in motion\": mobility of vision through a SenseCam lens.",
                    "Practices in creating videos with mobile phones.",
                    "HoverFlow: expanding the design space of around-device interaction.",
                    "Dual-Surface input: augmenting one-handed interaction with coordinated front and behind-the-screen input.",
                    "Head tilting for interaction in mobile contexts.",
                    "Designing phrase builder: a mobile real-time query expansion interface.",
                    "A model of two-thumb chording on a phone keypad.",
                    "Pressure-based text entry for mobile devices.",
                    "Coupa: operation with pen linking on mobile devices.",
                    "GraspZoom: zooming and scrolling control model for single-handed mobile interaction.",
                    "Sweep-Shake: finding digital resources in physical environments.",
                    "Exploring the use of landmarks for mobile navigation support in natural environments.",
                    "PhotoMap: using spontaneously taken images of public maps for pedestrian navigation tasks on mobile devices.",
                    "User evaluation of lightweight user authentication with a single tri-axis accelerometer.",
                    "Evaluating mobile phones as risk information providers.",
                    "Using an ecological framework to design mobile technologies for pediatric asthma management.",
                    "Using handheld devices for mobile interaction with displays in home environments.",
                    "Exploring shopping information and navigation strategies with a mobile device.",
                    "A mobile tool for in-situ prototyping.",
                    "Ubikequitous computing: designing interactive experiences for cyclists.",
                    "pieTouch: a direct touch gesture interface for interacting with in-vehicle information systems.",
                    "Supporting map-based wayfinding with tactile cues.",
                    "Glancephone: an exploration of human expression.",
                    "Studying multi-user settings for pervasive games.",
                    "Acceptable intrusiveness of online help in mobile devices.",
                    "Friendlee: a mobile application for your social life.",
                    "Expectations for user experience in haptic communication with mobile devices.",
                    "A language of tactile motion instructions.",
                    "Emotion sharing via self-composed melodies on mobile phones.",
                    "User expectations and user experience with different modalities in a mobile phone controlled home entertainment system.",
                    "A study of direct versus planned 3D camera manipulation on touch-based mobile phones.",
                    "Hands on music: physical approach to interaction with digital music.",
                    "User acceptance of mobile TV services.",
                    "The collaborative work of producing meaningful shots in mobile video telephony.",
                    "Touch & connect and touch & select: interacting with a computer by touching it with a mobile phone.",
                    "Improving the accessibility of NFC/RFID-based mobile interaction through learnability and guidance.",
                    "Impact of item density on magic lens interactions.",
                    "Two NFC interaction techniques for quickly exchanging pictures between a mobile phone and a computer.",
                    "overView: physically-based vibrotactile feedback for temporal information browsing.",
                    "Tacticycle: a tactile display for supporting tourists on a bicycle trip.",
                    "Hoverflow: exploring around-device interaction with IR distance sensors.",
                    "Minimizing mobile phone disruption via smart profile management.",
                    "View & share: supporting co-present viewing and sharing of media using personal projection.",
                    "Information empowerment through mobile learning.",
                    "Elastic mobility: stretching interaction.",
                    "PocketDRAGON: a direct manipulation video navigation interface for mobile devices.",
                    "Mobile implementation of a web 3D carousel with touch input.",
                    "Wavelet menus: a stacking metaphor for adapting marking menus to mobile devices.",
                    "Automatic mobile menu customization based on user operation history.",
                    "Bridging the gap between useful and aesthetic maps in car navigation systems.",
                    "Usability evaluation of OpenWeb transcoding.",
                    "Industrial case study of the MICA support system for warehouse workers.",
                    "Security and usability research using a microworld environment.",
                    "Socio-scientific analysis of user requirements in mobile learning: a case study on marginalised young people.",
                    "Immediate user performances with touch Chinese text entry solutions on handheld devices.",
                    "Optimizing user interaction for mobile web browsing.",
                    "An evaluation of authoring interfaces for image-based navigation.",
                    "New business to business interaction: shake your iPhone and speak to it.",
                    "Effects of co-player visualization in a location-based chase-and-catch game.",
                    "Examining human values in adopting ubiquitous technology in school.",
                    "Lessons learned from an interaction-kiosk for open selection of input devices of a gaming application.",
                    "A camera-based tangible controller for cellular phones.",
                    "Gestures all around us: user differences in social acceptability perceptions of gesture based interfaces.",
                    "Using semantic descriptions for adaptive mobile games UIs.",
                    "Mobile educational game: adventure anywhere.",
                    "Exploring the urban environment with a camera phone: lessons from a user study.",
                    "A context-sensitive security model for privacy protection on mobile phones.",
                    "iPiccer: automatically retrieving and inferring tagged location information from web repositories.",
                    "Mobile phone web browsing: a study on usage and usability of the mobile web.",
                    "Please touch the exhibits!: using NFC-based interaction for exploring a museum.",
                    "Kartta: extracting landmarks near personalized points-of-interest from user generated content.",
                    "Poker surface: combining a multi-touch table and mobile phones in interactive card games.",
                    "Designing a mobile task based UI for tourists.",
                    "Inspire, guide, and entertain: designing a mobile assistant for runners.",
                    "RECON: capturing mobile and ubiquitous interaction in real contexts.",
                    "Supporting mobile work processes in logistics with wearable computing.",
                    "Familiarity as a factor in designing finger gestures for elderly users.",
                    "The use of mobile contact list applications and a context-oriented framework to support their design.",
                    "A preliminary evaluation of head and facial feature tracking for input on mobile devices.",
                    "A mobile starfield visualization with space compression capabilities.",
                    "Designing a mobile application to capture everyday activity.",
                    "SeCuUI: autocomplete your terminal input.",
                    "The mobile Oracle: a tool for early user involvement.",
                    "Touch based interaction using a three display interface design.",
                    "Context-aware communication support system with pictographic cards.",
                    "Eyes-free overviews for mobile map applications.",
                    "Contextual push-to-talk: a new technique for reducing voice dialog duration.",
                    "'Do you smell rotten eggs?': evaluating interactions with mobile agents in crisis response situations.",
                    "User experience with in-car GPS navigation systems: comparing the young and elderly drivers.",
                    "Phototropic memories.",
                    "Improving the recommendation of mobile services by interpreting the user's icon arrangement.",
                    "Flashlight interaction: a study on mobile phone interaction techniques with large displays.",
                    "Detecting physical shock by a mobile phone and its applications in security and emergency.",
                    "Emotional factors influencing technology acceptance particularly with regard to mobile service usage.",
                    "Developing principles for outdoor mobile multimedia guides in cultural heritage settings.",
                    "Designing mobile patient-centric self-help terminals for people with diabetes.",
                    "User-centered design of mobile wellness applications.",
                    "Designing for mobile interaction: looking for a pragmatic middleground.",
                    "Harnessing accelerometer technology for inclusive mobile learning.",
                    "Mobile application framework for the next billion mobile users.",
                    "Mobile attachment: emotional attachment towards mobile devices and services.",
                    "Sharing Experiences with Social Mobile Media.",
                    "SiMPE: Fourth Workshop on Speech in Mobile and Pervasive Environments.",
                    "Community Practices and Locative Media.",
                    "Mobile Interaction with the Real World.",
                    "Mobile Living Labs 09: Methods and Tools for Evaluation in the Wild: http://mll09.novay.nl.",
                    "Context-Aware Mobile Media and Social Networks.",
                    "Measuring Mobile Emotions: Measuring the Impossible?"
                ]
            }
        ]
    },
    {
        "year": "2008",
        "name": "10th Mobile HCI 2008",
        "info": "Amsterdam, The Netherlands",
        "venues": [
            {
                "sub_name_abbr": "conf/mhci/2008",
                "sub_name": "Proceedings of the 10th Conference on Human-Computer Interaction with Mobile Devices and Services, Mobile HCI 2008, Amsterdam, the Netherlands, September 2-5, 2008.",
                "count": 107,
                "papers": [
                    "A frequency based sighting blurring algorithm for use with location based services on the internet.",
                    "A large scale study of European mobile search behaviour.",
                    "Always-on information: services and applications on the mobile desktop.",
                    "Context-aware photo selection for promoting photo consumption on a mobile phone.",
                    "Designing mobile awareness cues.",
                    "Developing a questionnaire for measuring mobile business service experience.",
                    "Does context matter in quality evaluation of mobile television?",
                    "Effects of mobile map orientation and tactile feedback on navigation speed and situation awareness.",
                    "Evaluating capacitive touch input on clothes.",
                    "Experiments in mobile spatial audio-conferencing: key-based and gesture-based interaction.",
                    "Field evaluation of a mobile location-based notification system for police officers.",
                    "Getting off the treadmill: evaluating walking user interfaces for mobile devices in public spaces.",
                    "Learning-oriented vehicle navigation systems: a preliminary investigation in a driving simulator.",
                    "Lessons from early stages design of mobile applications.",
                    "Making a completely icon-based menu in mobile devices to become true: a user-centered design approach for its development.",
                    "Map, diagram, and web page navigation on mobile devices: the effectiveness of zoomable user interfaces with overviews.",
                    "Mobile collaborative live video mixing.",
                    "Mobile multimedia: identifying user values using the means-end theory.",
                    "Mobile phones assisting with health self-care: a diabetes case study.",
                    "Mobiphos: a collocated-synchronous mobile photo sharing application.",
                    "Point-to-GeoBlog: gestures and sensors to support user generated content creation.",
                    "Projector phone: a study of using mobile phones with integrated projector for interaction with maps.",
                    "Rangoli: a visual phonebook for low-literate users.",
                    "RotaTxt: Chinese pinyin input with a rotator.",
                    "TimeWarp: interactive time travel with a mobile mixed reality game.",
                    "Touch & interact: touch-based interaction of mobile phones with displays.",
                    "TripleBeat: enhancing exercise performance with persuasion.",
                    "Usability benchmark study of commercially available smart phones: cell phone type platform, PDA type platform and PC type platform.",
                    "User needs and design guidelines for mobile services for sharing digital life memories.",
                    "Using mobile phones to reveal the complexities of the school journey.",
                    "Visual feedback and different frames of reference: the impact on gesture interaction techniques for wearable computing.",
                    "A stroking device for spatially separated couples.",
                    "A tool for video content understanding on mobile smartphones.",
                    "An investigation into round touchscreen wristwatch interaction.",
                    "Applying models of user activity for dynamic power management in wireless devices.",
                    "Augmented mobile tagging.",
                    "ButtonSchemer: ambient program reader.",
                    "Capricorn - an intelligent user interface for mobile widgets.",
                    "Color match: an imaging based mobile cosmetics advisory service.",
                    "Deploying and evaluating a mixed reality mobile treasure hunt: Snap2Play.",
                    "Dynamic audiotactile feedback in gesture interaction.",
                    "Evaluating the appropriateness of speech input in marine applications: a field evaluation.",
                    "Evaluation of pause intervals between haptic/audio cues and subsequent speech information.",
                    "Evaluation of picture browsing using a projector phone.",
                    "Evaluation of predictive text and speech inputs in a multimodal mobile route guidance application.",
                    "Exploring music collections on mobile devices.",
                    "Exploring the design space of Smart Horizons.",
                    "Gauntlet: a wearable interface for ubiquitous gaming.",
                    "Geo-indexed object recognition for mobile vision tasks.",
                    "In the hands of children: exploring the use of mobile phone functionality in casual play settings.",
                    "MAMI: multimodal annotations on a camera phone.",
                    "Measuring user experience: complementing qualitative and quantitative assessment.",
                    "Multimodal interfaces for camera phones.",
                    "Playing different games on different phones: an empirical study on mobile gaming.",
                    "Presenting evacuation instructions on mobile devices by means of location-aware 3D virtual environments.",
                    "Sharing places: testing psychological effects of location cueing frequency and explicit vs. inferred closeness.",
                    "Social playlist: enabling touch points and enriching ongoing relationships through collaborative mobile music listening.",
                    "Supporting a mobile lost and found community.",
                    "T-Bars: towards tactile user interfaces for mobile touchscreens.",
                    "The relationship between goal difficulty and performance in the context of a physical activity intervention program.",
                    "The social contagion of mobile television.",
                    "Touch key design for target selection on a mobile phone.",
                    "Usage of spatial information for selection of co-located devices.",
                    "Vibrotactile feedback as an orientation aid for blind users of mobile guides.",
                    "Wrist rotation for interaction in mobile contexts.",
                    "A streamlined interface documentation methodology for mobile user interfaces.",
                    "Designing a new mobile search service: a user-centered approach.",
                    "Designing for the evolution of mobile contacts application.",
                    "Usability challenges in creating a multi-IM mobile application.",
                    "Advancing simulation-based driver training: lessons learned and future perspectives.",
                    "Efficient context-sensitive word completion for mobile devices.",
                    "Reconexp: a way to reduce the data loss of the experiencing sampling method.",
                    "Design and development of an everyday hand gesture interface.",
                    "Designing automated handheld navigation support.",
                    "EVAL - an evaluation component for mobile interfaces.",
                    "Friend forever: a healderly partner.",
                    "Interactive auditory virtual environments for mobile devices.",
                    "Making new learning environment in zoo by adopting mobile devices.",
                    "Spybuster - a community-based privacy tagging platform.",
                    "Understanding mobile information needs.",
                    "User segmentation & UI optimization through mobile phone log analysis.",
                    "Using Second Life to demonstrate a concept automobile heads up display (A-HUD).",
                    "VoiceList: user-driven telephone-based audio content.",
                    "Graphical representation of meetings on mobile devices.",
                    "Mobile interaction using steganographic image on mobile display.",
                    "Movial IXS mobile internet device.",
                    "NEAT-o-Games: novel mobile gaming versus modern sedentary lifestyle.",
                    "Pervasive awareness.",
                    "Physical-virtual linkage with contextual bookmarks.",
                    "Picture browsing and map interaction using a projector phone.",
                    "Touch & Interact: touch-based interaction with a tourist application.",
                    "United-pulse: feeling your partner's pulse.",
                    "A methodical approach to evaluating the use of audio-interfaces for mobile and wearable computing.",
                    "A user-adaptive and context-aware architecture for mobile and desktop training applications.",
                    "An activity-driven model for context-awareness in mobile computing.",
                    "Enabling orientation for the blind by means of mobile guides.",
                    "Exploring usability in mobile autonomic networks.",
                    "Factors affecting user experience in mobile systems and services.",
                    "Implicit participation from a glance.",
                    "Mobile audio capture in a learning ecology.",
                    "Visualization and interaction with mobile technology.",
                    "Co-design: practices, challenges and lessons learned.",
                    "Mobile interaction with the real world.",
                    "Mobile multimedia: content creation and use.",
                    "SiMPE: third workshop on speech in mobile and pervasive environments.",
                    "The second international workshop on mobile internet user experience.",
                    "MobiMundi: exploring the impact of user-generated mobile content -- the participatory panopticon."
                ]
            },
            {
                "sub_name_abbr": "conf/mhci/2008mirw",
                "sub_name": "Mobile Interaction with the Real World 2008, MIRW 2008, Mobile HCI Workshop, Amsterdam, The Netherlands, September 2, 2008.",
                "count": 12,
                "papers": [
                    "Workshop on Mobile Interaction with the Real World.",
                    "Acceptance and Usability of Physical Mobile Applications.",
                    "Supporting (Mobile) User Experience at a Rural Village \"Scarecrow Festival\": A Formative Study of a Geolocated Photo Mashup Utilising a Situated Display.",
                    "View & Share: A Collaborative Media Viewing and Sharing Framework using a Projector Phone.",
                    "Mobile Interaction with the real world.",
                    "Evaluation of Camera Phone Based Interaction to Access Information Related to Posters.",
                    "Photomap: Snap, Grab and Walk away with a \"You Are Here\" Map.",
                    "Towards a location model for indoor navigation support through public displays and mobile devices.",
                    "AmbientDJ: Enabling Interaction between People and Socially Aware Environments.",
                    "Social Proximity Networks on Cruise Ships.",
                    "MobileIoT Toolkit: Connecting the EPC Network to MobilePhones.",
                    "Associative Information Spaces."
                ]
            }
        ]
    },
    {
        "year": "2007",
        "name": "9th Mobile HCI 2007",
        "info": "Singapore",
        "venues": [
            {
                "sub_name_abbr": "conf/mhci/2007",
                "sub_name": "Proceedings of the 9th Conference on Human-Computer Interaction with Mobile Devices and Services, Mobile HCI 2007, Singapore, September 9-12, 2007.",
                "count": 63,
                "papers": [
                    "New methods for conducting experiments with mobile systems and services in the field.",
                    "Use of formal computational models for designing intelligent mobile device interfaces.",
                    "Pedestrian navigation systems: a showcase for deep personalization theory.",
                    "Xensible interruptions from your mobile phone.",
                    "A thermal information display for mobile applications.",
                    "Development and evaluation of multidimensional tactons for a wearable tactile display.",
                    "Multi-context photo browsing on mobile devices based on tilt dynamics.",
                    "Mobile support for communities of interest: design and implementation of Community2Go.",
                    "mCell: platform independent communication for small groups.",
                    "Gait alignment in mobile phone conversations.",
                    "Creating and sharing multi-media packages using large situated public displays and mobile phones.",
                    "On the design and evaluation of web augmented mobile applications.",
                    "Experiencing real-world interaction: results from a NFC user experience field trial.",
                    "MoBiS-Q: a tool for evaluating the success of mobile business services.",
                    "Design evaluation using virtual reality based prototypes: towards realistic visualization and operations.",
                    "Trafficking: design for the viral exchange of TV content on mobile phones.",
                    "'Divert: mother-in-law': representing and evaluating social context on mobile devices.",
                    "Understanding human-battery interaction on mobile phones.",
                    "Naturalistic use of cell phones in driving and context-based user assistance.",
                    "Co-present photo sharing on mobile devices.",
                    "Affordance in mobile speech-based user interaction.",
                    "Touch-based user interface for elderly users.",
                    "Personalized mobile health monitoring for elderly.",
                    "Memory karaoke: using a location-aware mobile reminiscence tool to support aging in place.",
                    "Mobile sales assistant: NFC for retailers.",
                    "Mobile interaction with web services through associated real world objects.",
                    "MILKey: multi illuminated indicator for KEYpad.",
                    "Implementation of OpenVG 1.0 using OpenGL ES.",
                    "Lifelink: a 4G experience game.",
                    "BlogWall: a new paradigm of artistic public mobile communication.",
                    "Physical mobile interaction with dynamic physical object.",
                    "Mobile spatial audio interfaces.",
                    "Talking media.",
                    "Group interaction with smart phones at work place.",
                    "Pileus: umbrella for mobile augmented reality.",
                    "News-on-the-go.",
                    "Effective learn-quiz generation for handheld devices.",
                    "A new interface for video browsing on PDAs.",
                    "Widgets & Mobile 2.0.",
                    "Target selection on mobile devices using display segmentation.",
                    "Dynamic visualisation of ski data: a context aware mobile piste map.",
                    "Culturally adapted mobile phone interface design: correlation between categorization style and menu structure.",
                    "The roaring navigator: a group guide for the zoo with shared auditory landmark display.",
                    "Sensing-based interaction for information navigation on handheld displays.",
                    "Mobile search: the future.",
                    "Mobile findex: supporting mobile web search with automatic result categories.",
                    "The role of context in query input: using contextual signals to complete queries on mobile devices.",
                    "Incidental information and mobile search.",
                    "A picture is worth a thousand keywords: exploring mobile image-based web search.",
                    "Interactive aesthetics: culture and games.",
                    "The digital workbook; using web 2.0 for generative research purposes.",
                    "Combining methods to evaluate mobile usability.",
                    "An industrial case study on wearable computing applications.",
                    "Create, sync, share: the role of mobile device on social entity.",
                    "Research issues in next generation DBMS for mobile platforms.",
                    "A study on usability of human-robot interaction using a mobile computer and a human interface device.",
                    "Renewal model of mobile data services through user experience analysis.",
                    "A study on the emotion expression using lights in apparel types.",
                    "BlogWall: displaying artistic and poetic messages on public displays via SMS.",
                    "An evaluation of stylus-based text entry methods on handheld devices in stationary and mobile settings.",
                    "Positional mapping Myanmar text input scheme for mobile devices.",
                    "Ad-hoc co-located collaborative work with mobile devices.",
                    "An environment to support multi-user interaction and cooperation for improving museum visits through games."
                ]
            }
        ]
    },
    {
        "year": "2006",
        "name": "8th Mobile HCI 2006",
        "info": "Helsinki, Finland",
        "venues": [
            {
                "sub_name_abbr": "conf/mhci/2006",
                "sub_name": "Proceedings of the 8th Conference on Human-Computer Interaction with Mobile Devices and Services, Mobile HCI 2006, Helsinki, Finland, September 12-15, 2006.",
                "count": 70,
                "papers": [
                    "Unacceptability of instantaneous errors in mobile television: from annoying audio to video.",
                    "Playability heuristics for mobile games.",
                    "The impact of the display type and content to a game adaptation.",
                    "MPTrain: a mobile, music and physiology-based personal trainer.",
                    "Bringing mobile guides and fitness activities together: a solution based on an embodied virtual trainer.",
                    "Two different interfaces to visualize patient histories on a PDA.",
                    "MACCS: enabling communications for mobile workers within healthcare environments.",
                    "Using mobility as a conceptual framework for informing the design of mobile ICT for construction professionals.",
                    "\"It's always there, it's always on\": Australian freelancer's management of availability using mobile technologies.",
                    "PePe field study: constructing meanings for locations in the context of mobile presence.",
                    "Sharing control of dispersed situated displays between nand residential users.",
                    "Scent field trial: understanding emerging social interaction.",
                    "Time to meet face-to-face and device-to-device.",
                    "A natural wayfinding exploiting photos in pedestrian navigation systems.",
                    "It's a long way to Monte Carlo: probabilistic display in GPS navigation.",
                    "Modeling context aware interaction for wayfinding using mobile devices.",
                    "A platform for mobile 3D map navigation development.",
                    "Acquisition of spatial knowledge in location aware mobile pedestrian navigation systems.",
                    "Comparing conceptual designs for mobile access to geo-spatial information.",
                    "RodDirect: two-dimensional input with stylus knob.",
                    "Requirements for in-situ authoring of location based experiences.",
                    "Multimodal interaction on mobile phones: development and evaluation using ACICARE.",
                    "HybridTouch: an intuitive manipulation technique for PDAs using their front and rear surfaces.",
                    "Gait analyzer based on a cell phone with a single three-axis accelerometer.",
                    "A novel interface to sensor networks using handheld augmented reality.",
                    "Improving photo searching interfaces for small-screen mobile computers.",
                    "Depth and breadth away from the desktop: the optimal information hierarchy for mobile use.",
                    "Supporting mobile access to digital video archives without user queries.",
                    "GeoPix: image retrieval on the geo web, from camera click to mouse click.",
                    "Implementing device UI in standards-based markup.",
                    "A case study of icon-scenario based animated menu's concept development.",
                    "Usability evaluation for mobile device: a comparison of laboratory and field tests.",
                    "ripcord: rapid interface prototyping for cordless devices.",
                    "Scan and tilt: towards natural interaction for mobile museum guides.",
                    "Usability benchmarking case study: media downloads via mobile phones in the US.",
                    "The right to information: setup of mobile terminals and services.",
                    "Target size study for one-handed thumb use on small touchscreen devices.",
                    "eye-q: eyeglass peripheral display for subtle intimate notifications.",
                    "Reading on-the-go: a comparison of audio and hand-held displays.",
                    "Simulator sickness in virtual display gaming: a comparison of stereoscopic and non-stereoscopic situations.",
                    "Multidimensional tactons for non-visual information presentation in mobile devices.",
                    "Visualizing locations of off-screen objects on mobile devices: a comparative evaluation of three approaches.",
                    "Visualization of uncertainty in context aware mobile applications.",
                    "A mobile multimodal dialogue system for public transportation navigation evaluated.",
                    "Automatic rotation and zooming in mobile roadmaps.",
                    "\"Collaborative mobile user interface design\": how should companies design the mobile UI together?",
                    "Novel input method shoot-out.",
                    "MobileHCI'06 demo: mobile remote usability testing.",
                    "MobileEssence: meeting capture on smartphones.",
                    "Immersive video as a rapid prototyping and evaluation tool for mobile and ambient applications.",
                    "AdapTex: contextually adaptive text entry for mobiles.",
                    "RIM: framework and tool support for adaptive graphical user interface for mobile applications.",
                    "Real-time spatial socializing through mobile device.",
                    "Mobile studying and social usability on a wireless campus.",
                    "senseMix: sharing creative mobile content.",
                    "A taxonomy for the evaluation of mobile museum guides.",
                    "The mobile phone as a medium for heightened sonic perception.",
                    "Striving for ubiquitous citizenship with mobile PICOLA.",
                    "User experience design guidelines for telecare services.",
                    "Character repertoires, ordering and assignment to the 12-key keypad supporting European cultural diversity.",
                    "Crafting the mobile experience.",
                    "Institutionalizing mobile user experience: key success factors, strategic positioning, and sustainable organisational implementations.",
                    "Designing user interfaces for future mobile applications and devices: a user-centred interaction and visual design process walkthrough.",
                    "\"Innovative mobile applications of context\".",
                    "Mobile usage of video and TV.",
                    "SiMPE: speech in mobile and pervasive environments.",
                    "Mobile interaction with the real world.",
                    "MODIE 2006: modeling and designing user assistance in intelligent environments.",
                    "MUIA 2006: third international workshop on mobile and ubiquitous information access.",
                    "MobileHCI'06 doctoral consortium."
                ]
            }
        ]
    },
    {
        "year": "2005",
        "name": "7th Mobile HCI 2005",
        "info": "Salzburg, Austria",
        "venues": [
            {
                "sub_name_abbr": "conf/mhci/2005",
                "sub_name": "Proceedings of the 7th Conference on Human-Computer Interaction with Mobile Devices and Services, Mobile HCI 2005, 2005, Salzburg, Austria, September 19-22, 2005.",
                "count": 89,
                "papers": [
                    "Dynamic privacy management: a plug-in service for the middleware in pervasive computing.",
                    "Towards improving trust in context-aware systems by displaying system confidence.",
                    "Searching common experience: a social communication tool based on mobile ad-hoc networking.",
                    "Just-for-us: a context-aware mobile information system facilitating sociality.",
                    "Building social discourse around mobile photos: a systemic perspective.",
                    "SEREFE: serendipitous file exchange between users and devices.",
                    "Exploring bluetooth based mobile phone interaction with the hermes photo display.",
                    "A comparison of feedback cues for enhancing pointing efficiency in interaction with spatial audio displays.",
                    "Placing links in mobile banking application.",
                    "Design requirements for mobile TV.",
                    "Supporting cognitive walkthrough with video data: a mobile learning evaluation study.",
                    "Dynamic generation of web migratory interfaces.",
                    "Tool-supported single authoring for device independence and multimodality.",
                    "VirHKey: a VIRtual Hyperbolic KEYboard with gesture interaction and visual feedback for mobile devices.",
                    "Augmenting audio messages with visual directions in mobile guides: an evaluation of three approaches.",
                    "Evaluating mobile text entry strategies with finite state automata.",
                    "Mobile text entry: relationship between walking speed and text input task difficulty.",
                    "ZuiScat: querying and visualizing information spaces on personal digital assistants.",
                    "Spatial interactive visualization on small screen.",
                    "Using context to navigate through a photo collection.",
                    "Context-based design of mobile applications for museums: a survey of existing practices.",
                    "SenseMS: a user-centered approach to enrich the messaging experience for teens by non-verbal means.",
                    "ContextContacts: re-designing SmartPhone's contact book to support mobile awareness and collaboration.",
                    "CANVIS: context-aware network visualization using smartphones.",
                    "Walk 'n scroll: a comparison of software-based navigation techniques for different levels of mobility.",
                    "Understanding the role of image recognition in mobile tour guides.",
                    "TGH: a case study of designing natural interaction for mobile guide systems.",
                    "Toward bridge building: mapping the landscape of telecommunication tools.",
                    "The effects of a wireless on-line community network on social capital.",
                    "'It's like if you opened someone else's letter': user perceived privacy and social practices with SMS communication.",
                    "Three applications for mobile epidemic algorithms.",
                    "Mobile 'tsunagari-kan': always-on, casual telecommunication.",
                    "Telelogs: a social communication space for urban environments.",
                    "Comparing two one-handed access methods on a PDA.",
                    "Just point and click?: using handhelds to interact with paper maps.",
                    "Providing support for mobile calendaring conversations: a wizard of oz evaluation of dual--purpose speech.",
                    "Creation and application of mobile media design drivers.",
                    "A personal-area network of low-power wireless interfacing devices for handhelds: system and hardware design.",
                    "Opportunities and challenges for location aware computing in the construction industry.",
                    "Customer expectation level in mobile data services.",
                    "Stroke break analysis: a practical method to study timeout value for handwriting recognition input.",
                    "Gather customer's real usage on mobile phones.",
                    "Visualizing use context with picture scenarios in the design process.",
                    "GpsTunes: controlling navigation via audio feedback.",
                    "Navigation control for mobile virtual environments.",
                    "Rolling, rotating and imagining in a virtual mobile world.",
                    "Landmarks: yes; but which?: five methods to select optimal landmarks for a landmark- and speech-based guiding system.",
                    "Survey of position location techniques in mobile systems.",
                    "Life is sharable: blogging life experience with RFID embedded mobile phones.",
                    "ISeeU: camera-based user interface for a handheld computer.",
                    "Context awareness via a single device-attached accelerometer during mobile computing.",
                    "Cultural difference and mobile phone interface design: icon recognition according to level of abstraction.",
                    "Mobile access to personal digital photograph archives.",
                    "Mystery in the museum: collaborative learning activities using handheld devices.",
                    "MAUSE-COST294: a community of interest and practice.",
                    "A support system for finding lost objects using spotlight.",
                    "Transforming data broadcast contents to fit different user interfaces: generating a readout service for mobile DTV receiver.",
                    "A collaborative environment for enhanced information access on small-form-factor devices.",
                    "Field-based mLearning: who wants what?",
                    "Mobile maze: a comparison of camera based mobile game human interfaces.",
                    "Interacting with virtual reality scenes on mobile devices.",
                    "Improving system recommendations using localization feedbacks.",
                    "User-centred system design: addressing user needs with a mobile information system.",
                    "Ubiquitous cognition: mobile environment achieved by migratable agent.",
                    "Reversible display: content browsing with reverse operations in mobile computing environments.",
                    "Beyond photoblogging: new directions of mobile communication.",
                    "AIRE: an ambient interactive and responsive environment for mobile image management.",
                    "Audio feedback on a mobile phone for number dialing.",
                    "Supporting information retrieval on mobile devices.",
                    "Using cascade method for table access on small devices.",
                    "Pr@senZ - P@CE: mobile interaction with virtual reality.",
                    "AIMS 2005: artificial intelligence in mobile systems.",
                    "Context in mobile HCI.",
                    "Enabling and improving the use of mobile e-services.",
                    "4th international workshop on: \"HCI in mobile guides\".",
                    "MOBILE MAPS 2005 interactivity and usability of map-based mobile services.",
                    "Designing with the human memory in mind.",
                    "Development of interactive applications for mobile devices.",
                    "Handheld usability: design, prototyping, & usability testing for mobile phones.",
                    "Mobile interaction design tutorial.",
                    "How to set-up a corporate user experience team: key success factors, strategic positioning, and sustainable organisational implementations.",
                    "Data collection and analysis tools for mobile HCI studies.",
                    "BuddyBeads: techno-jewelry for non verbal communication within groups of teenage girls.",
                    "Headphones with touch control.",
                    "Intellectual teamwork on smartphones.",
                    "Personal microdevices for wide-area location via mobile gateways.",
                    "SMMART: using context-awareness in m-commerce.",
                    "Visual object detection from mobile phone imagery for context awareness.",
                    "Mobile presence: what needs to be considered?"
                ]
            }
        ]
    },
    {
        "year": "2004",
        "name": "6th Mobile HCI 2004",
        "info": "Glasgow, UK",
        "venues": [
            {
                "sub_name_abbr": "conf/mhci/2004",
                "sub_name": "Mobile Human-Computer Interaction - Mobile HCI 2004, 6th International Symposium, Glasgow, UK, September 13-16, 2004, Proceedings.",
                "count": 76,
                "papers": [
                    "What Can You Say with Only Three Pixels?",
                    "Investigating the Relationship Between Battery Life and User Acceptance of Dynamic, Energy-Aware Interfaces on Handhelds.",
                    "Mental Models of a Cellular Phone Menu. Comparing Older and Younger Novice Users.",
                    "Using Landmarks to Support Older People in Navigation.",
                    "Heuristic Evaluation and Mobile Usability: Bridging the Realism Gap.",
                    "Is It Worth the Hassle? Exploring the Added Value of Evaluating the Usability of Context-Aware Mobile Systems in the Field.",
                    "Home Is Where Your Phone Is: Usability Evaluation of Mobile Phone UI for a Smart Home.",
                    "User Validation of a Nomadic Exhibition Guide.",
                    "Social Networks and Mobile Games: The Use of Bluetooth for a Multiplayer Card Game.",
                    "Eye Movement Study of Reading on a Mobile Device Using the Page and RSVP Text Presentation Formats.",
                    "Tilt-Based Automatic Zooming and Scaling in Mobile Devices - A State-Space Implementation.",
                    "An Evaluation of Techniques for Browsing Photograph Collections on Small Displays.",
                    "Variability in Wrist-Tilt Accelerometer Based Gesture Interfaces.",
                    "Mobile Note Taking: Investigating the Efficacy of Mobile Text Entry.",
                    "The Personal Audio Loop: Designing a Ubiquitous Audio-Based Memory Aid.",
                    "A Study on Gestural Interaction with a 3D Audio Display.",
                    "A Study of Application and Device Effects Between a WAP Phone and a Palm PDA.",
                    "Personalization-Based Optimization of Web Interfaces for Mobile Devices.",
                    "Mixed-Initiative, Trans-modal Interface Migration.",
                    "Web Page Transformation When Switching Devices.",
                    "Mobile Context Aware Systems: The Intelligence to Support Tasks and Effectively Utilise Resources.",
                    "Usability of MobiVR Concept: Towards Large Virtual Touch Screen for Mobile Devices.",
                    "Handy: A New Interaction Device for Vehicular Information Systems.",
                    "Interactive Positioning Based on Object Visibility.",
                    "IDeixis - Searching the Web with Mobile Images for Location-Based Information.",
                    "The Use of Landmarks in Pedestrian Navigation Instructions and the Effects of Context.",
                    "A Paper Prototype Study of the Interface for a Children's Collaborative Handheld Learning Application.",
                    "Ubibus: Ubiquitous Computing to Help Blind People in Public Transport.",
                    "Improving the Effectiveness of Mobile Application Design: User-Pairs Testing by Non-professionals.",
                    "Pen-Based Gestures: An Approach to Reducing Screen Clutter in Mobile Computing.",
                    "Dynamic Primitives for Gestural Interaction.",
                    "Touch Detection System for Mobile Terminals.",
                    "Mobile Text Input with Soft Keyboards: Optimization by Means of Visual Clues.",
                    "Watch-Top Text-Entry: Can Phone-Style Predictive Text-Entry Work with Only 5 Buttons?",
                    "Pair-wise Variability Index: Evaluating the Cognitive Difficulty of Using Mobile Text Entry Systems.",
                    "Xaudio: Results from a Field Trial Study on a Technology Enhancing Radio Listeners' User Experience.",
                    "O2 Active: Enhancing User Experience on Mobile Phones.",
                    "A Prototype for Remote Vehicle Diagnostics.",
                    "Adaptive Portal Aggregation for Pervasive Client Devices.",
                    "Supporting Mobile Applications with Real-Time Visualisation of GPS Availability.",
                    "Bringing the Office to the Stables.",
                    "Comparison of Mobile and Fixed Use of SmartLibrary.",
                    "Automatic Partitioning of Web Pages Using Clustering.",
                    "Acoustic Features for Profiling Mobile Users of Conversational Interfaces.",
                    "Butler: A Universal Speech Interface for Mobile Environments.",
                    "Learnability and Automatic Clustering of Images in Mobile Devices.",
                    "UbiquiTO: A Multi-device Adaptive Guide.",
                    "Visualizing the Thematic Update Status of Web and WAP Sites on Mobile Phones.",
                    "Adapting Web-Pages for Mobile / PC Collaboration.",
                    "EMG as a Subtle Input Interface for Mobile Computing.",
                    "Mobile Support for Team-Based Field Surveys.",
                    "\"Please Turn ON Your Mobile Phone\" - First Impressions of Text-Messaging in Lectures.",
                    "A Stereoscopic Image Rendering Method for Autostereoscopic Mobile Devices.",
                    "The Effects of Mobile Pedestrian Navigation Systems on the Concurrent Acquisition of Route and Survey Knowledge.",
                    "Supporting Museum Co-visits Using Mobile Devices.",
                    "Chording as a Text Entry Method in Mobile Phones.",
                    "Engaging Learners with Everyday Technology: A Participatory Simulation Using Mobile Phones.",
                    "One-Push Sharing: Facilitating Picture Sharing from Camera Phones.",
                    "Delivering Personalized Local Services.",
                    "Mobility Mapping - A Discount Technique for Exploring User Needs for Future Mobile Products and Services.",
                    "Memojog - An Interactive Memory Aid Incorporating Mobile Based Technologies.",
                    "JIKUKAN-POEMER: Geographic Information System Using Camera Phone Equipped with GPS, and Its Exhibition on a Street.",
                    "Visual Object Detection for Mobile Road Sign Inventory.",
                    "Integrated Care Plan and Documentation on Handheld Devices in Mobile Home Care.",
                    "CENTAUR: A Two-Panel User Interface for Mobile Document Access.",
                    "Smartphone Views: Building Multi-device Distributed User Interfaces.",
                    "The Lack of Intelligent Design in Mobile Phones.",
                    "Visual and Interaction Design for 3G Mobile Phone Interfaces.",
                    "Handheld Usability: Design, Prototyping, and Usability Testing for Mobile Phones, PDAs, and Pagers.",
                    "3rd International Workshop on: \"HCI in Mobile Guides\".",
                    "Interaction Design for CSCL in Ubiquitous Computing.",
                    "Mobile HCI 2004 Workshop on Location Systems Privacy and Control.",
                    "Mobile HCI and Sound.",
                    "Second International Workshop on Mobile and Ubiquitous Information Access.",
                    "Mobile Communications Versus Pervasive Communications: The Role of Handhelds.",
                    "The Myth of the 'Martini Solution'."
                ]
            }
        ]
    },
    {
        "year": "2003",
        "name": "5th Mobile HCI 2003",
        "info": "Udine, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/mhci/2003",
                "sub_name": "Human-Computer Interaction with Mobile Devices and Services, 5th International Symposium, Mobile HCI 2003, Udine, Italy, September 8-11, 2003, Proceedings.",
                "count": 50,
                "papers": [
                    "People versus Information: The Evolution of Mobile Technology.",
                    "The Zen of Everyday Encounters: Spontaneous Interaction in Ubiquitous Systems.",
                    "Understanding Mobile Contexts.",
                    "Motorcyclists Using Hocman - Field Trials on Mobile Interaction.",
                    "Connecting Remote Visits and Design Environment: User Needs and Prototypes for Architecture Design.",
                    "Everyday Wearable Computer Use: A Case Study of an Expert User.",
                    "Using Mobile Keypads with Limited Visual Feedback: Implications to Handheld and Wearable Devices.",
                    "Time-Out in Mobile Text Input: The Effects of Learning and Feedback.",
                    "SyncTap: An Interaction Technique for Mobile Networking.",
                    "Experiments with Multi-modal Interfaces in a Context-Aware City Guide.",
                    "Design Criteria for Location-Aware, Indoor, PDA Applications.",
                    "The Design and Evaluation of a Mobile Location-Aware Handheld Event Planner.",
                    "Supporting Local Mobility in Healthcare by Application Roaming Among Heterogeneous Devices.",
                    "Aligning Work Practices and Mobile Technologies: Groupware Design for Loosely Coupled Mobile Groups.",
                    "Encouraging Face-to-Face Collaborative Learning through the Use of Handheld Computers in the Classroom.",
                    "Human Pacman: A Mobile Entertainment System with Ubiquitous Computing and Tangible Interaction over a Wide Outdoor Area.",
                    "OpenTrek: A Platform for Developing Interactive Networked Games on Mobile Devices.",
                    "Supporting Efficient Design of Mobile HCI.",
                    "Dygimes: Dynamically Generating Interfaces for Mobile Computing Devices and Embedded Systems.",
                    "Online Transcoding of Web Pages for Mobile Devices.",
                    "Multi-modal Framework to Support Users with Special Needs in Interaction with Public Information Systems.",
                    "Usability Evaluations for Multi-device Application Development Three Example Studies.",
                    "A Review of Mobile HCI Research Methods.",
                    "Exploring the Utility of Remote Messaging and Situated Office Door Displays.",
                    "TimeMachine Oulu - Dynamic Creation of Cultural-Spatio-Temporal Models as a Mobile Service.",
                    "Awase-E: Image-Based Authentication for Mobile Phones Using User's Favorite Images.",
                    "Older Users' Requirements for Location Based Services and Mobile Phones.",
                    "GentleGuide: An Exploration of Haptic Output for Indoors Pedestrian Guidance.",
                    "Sound Visualization and Retrieval Technique for Assisting Hearing Memory of Patrol Worker.",
                    "Constructing Public Discourse with Ethnographic/SMS \"Texts\".",
                    "A Customer Satisfaction Evaluation Model for Mobile Internet Services.",
                    "Designing Adaptive Mobile Applications: Abstract Components and Composite Behaviors.",
                    "Cinematic Techniques for Mobile Presentations.",
                    "Using a Mobile Device to Vary the Pace of Search.",
                    "Designing Advanced Mobile Applications Examples of UMTS Trial Applications.",
                    "iCAMS2: Developing a Mobile Communication Tool Using Location Information and Schedule Information with J2ME.",
                    "Understanding and Modeling Physical Environments for Mobile Location Aware Information Services.",
                    "SmartLibrary - Location-Aware Mobile Library Service.",
                    "The Human Interface in Mobile Applications.",
                    "I'm Here!: A Wearable Object Remembrance Support System.",
                    "Towards a Framework to Develop Plastic User Interfaces.",
                    "Context-Aware Interaction in a Mobile Environment.",
                    "User Needs for Development of Context Dependent Devices in Mobile Home Care.",
                    "Context Information in Mobile Telephony.",
                    "Component Model and Programming: A First Step to Manage Human Computer Interaction Adaptation.",
                    "A Study on the Predicate Prediction Using Symbols in Augmentative and Alternative Communication System.",
                    "Electronic Navigation - Some Design Issues.",
                    "The Use of Statistically Derived Personas in Modelling Mobile User Populations.",
                    "M3I in a Pedestrian Navigation & Exploration System.",
                    "Mobile Devices: Opportunities for Users with Special Needs."
                ]
            },
            {
                "sub_name_abbr": "conf/mhci/2003w",
                "sub_name": "Mobile and Ubiquitous Information Access, Mobile HCI 2003 International Workshop, Udine, Italy, September 8, 2003, Revised and Invited Papers.",
                "count": 21,
                "papers": [
                    "The Concept of Relevance in Mobile and Ubiquitous Information Access.",
                    "Conversational Design as a Paradigm for User Interaction on Mobile Devices.",
                    "One-Handed Use as a Design Driver: Enabling Efficient Multi-channel Delivery of Mobile Applications.",
                    "Enabling Communities in Physical and Logical Context Areas as Added Value of Mobile and Ubiquitous Applications.",
                    "Accessing Web Educational Resources from Mobile Wireless Devices: The Knowledge Sea Approach.",
                    "Spoken versus Written Queries for Mobile Information Access.",
                    "Focussed Palmtop Information Access Combining Starfield Displays with Profile-Based Recommendations.",
                    "Designing Models and Services for Learning Management Systems in Mobile Settings.",
                    "E-Mail on the Move: Categorization, Filtering, and Alerting on Mobile Devices with the ifMail Prototype.",
                    "Mobile Access to the Físchlár-News Archive.",
                    "A PDA-Based System for Recognizing Buildings from User-Supplied Images.",
                    "SmartView and SearchMobil: Providing Overview and Detail in Handheld Browsing.",
                    "Compact Summarization for Mobile Phones.",
                    "Supporting Searching on Small Screen Devices Using Summarisation.",
                    "Towards the Wireless Ward: Evaluating a Trial of Networked PDAs in the National Health Service.",
                    "Aspect-Based Adaptation for Ubiquitous Software.",
                    "Context-Aware Retrieval for Ubiquitous Computing Environments.",
                    "Ubiquitous Awareness in an Academic Environment.",
                    "Accessing Location Data in Mobile Environments ? The Nimbus Location Model.",
                    "A Localization Service for Mobile Users in Peer-to-Peer Environments.",
                    "Sensing and Filtering Surrounding Data: The PERSEND Approach."
                ]
            }
        ]
    },
    {
        "year": "2002",
        "name": "4th Mobile HCI 2002",
        "info": "Pisa, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/mhci/2002",
                "sub_name": "Mobile Human-Computer Interaction, 4th International Symposium, Mobile HCI 2002, Pisa, Italy, September 18-20, 2002, Proceedings.",
                "count": 52,
                "papers": [
                    "Mobile Devices for Control.",
                    "Building Usable Wireless Applications for Mobile Phones.",
                    "A Diary Study of Rendezvousing: Group Size, Time Pressure and Connectivity.",
                    "Automated Multimedia Diaries of Mobile Device Users Need Summarization.",
                    "Personal Location Agent for Communicating Entities (PLACE).",
                    "Distributing Event Information by Simulating Word-of-Mouth Exchanges.",
                    "A New Transcoding Technique for PDA Browsers, Based on Content Hierarchy.",
                    "Sorting Out Searching on Small Screen Devices.",
                    "Adapting Applications in Mobile Terminals Using Fuzzy Context Information.",
                    "Direct Combination: A New User Interaction.",
                    "ASUR++: A Design Notation for Mobile Mixed Systems.",
                    "Designing LoL@, a Mobile Tourist Guide for UMTS.",
                    "Location-Aware Shopping Assistance: Evaluation of a Decision-Theoretic Approach.",
                    "handiMessenger: Awareness-Enhanced Universal Communication for Mobile Users.",
                    "An Empirical Study of the Minimum Required Size and the Minimum Number of Targets for Pen Input on the Small Display.",
                    "KSPC (Keystrokes per Character) as a Characteristic of Text Entry Techniques.",
                    "Lost or Found? A Usability Evaluation of a Mobile Navigation and Location-Based Service.",
                    "Towards an Improved Readability on Mobile Devices: Evaluating Adaptive Rapid Serial Visual Presentation.",
                    "Mobile and Collaborative Augmented Reality: A Scenario Based Design Approach.",
                    "The Unigesture Approach.",
                    "\"Just-in-Place\" Information for Mobile Device Interfaces.",
                    "Pushing Web Pages into Personal Digital Assistants: Need, Tools and Solutions.",
                    "Émigré: Metalevel Architecture and Migratory Work.",
                    "Interactions Model and Code Generation for J2ME Applications.",
                    "An Interface with Weight: Taking Interaction by Tilt beyond Disembodied Metaphors.",
                    "UML Modelling of Device-Independent Interfaces and Services for a Home Environment Application.",
                    "iTutor: A Wireless and Multimodal Support to Industrial Maintenance Activities.",
                    "ArtemisExpress: A Case Study in Designing Handheld Interfaces for an Online Digital Library.",
                    "Addressing Mobile HCI Needs through Agents.",
                    "Consistent Multi-device Design Using Device Categories.",
                    "New Generation of IP-Phone Enabled Mobile Devices.",
                    "A Content Provider-Specified Web Clipping Approach for Mobile Content Adaptation.",
                    "Case Study: A PDA Example of User Centered Design.",
                    "Leveraging the Context of Use in Mobile Service Design.",
                    "A Ubiquitous Computing Environment for Language Learning.",
                    "XHTML in Mobile Application Development.",
                    "Understanding Contextual Interactions to Design Navigational Context-Aware Applications.",
                    "Towards Scalable User Interfaces in 3D City Information Systems.",
                    "Mobile Image Messaging - Anticipating the Outlines of the Usage Culture.",
                    "Remote Control of Home Automation Systems with Mobile Devices.",
                    "Low-Resolution Supplementary Tactile Cues for Navigational Assistance.",
                    "Mobile Interface for a Smart Wheelchair.",
                    "Utilizing Gaze Detection to Simulate the Affordances of Paper in the Rapid Serial Visual Presentation Format.",
                    "On Interfaces for Mobile Information Retrieval.",
                    "User Requirement Analysis and Interface Conception for a Mobile, Location-Based Fair Guide.",
                    "A Cross-Modal Electronic Travel Aid Device.",
                    "Globalization of Voice-Enabled Internet Access Solutions.",
                    "Map-Based Access to Multiple Educational On-Line Resources from Mobile Wireless Devices.",
                    "Supporting Adaptivity to Heterogeneous Platforms through User Models.",
                    "Visualizing Bar Charts on WAP Phones.",
                    "Structured Menu Presentation Using Spatial Sound Separation.",
                    "\"Do as I Say! . But Who Says What I Should Say - or Do?\" On the Definition of a Standard Spoken Command Vocabulary for ICT Devices and Services."
                ]
            }
        ]
    },
    {
        "year": "2001",
        "name": "3rd Mobile HCI 2001",
        "info": "Lille, France",
        "venues": []
    },
    {
        "year": "1999",
        "name": "2nd Mobile HCI 1999",
        "info": "Edinburgh, Scotland",
        "venues": []
    },
    {
        "year": "1998",
        "name": "1st Mobile HCI 1998",
        "info": "Glasgow, Scotland",
        "venues": []
    }
]