[
    {
        "name": "PMC",
        "year": "2022",
        "info": "2022: Volumes\n79,\n80,",
        "count": 8,
        "papers": [
            "Hybrid metaheuristic algorithm for optimal cluster head selection in wireless sensor network.",
            "Exploring the effects of below-freezing temperatures on smartphone usage.",
            "Spectrum cartography techniques, challenges, opportunities, and applications: A survey.",
            "Three-phased clustered topology formation for Aeronautical Ad-Hoc Networks.",
            "A survey on privacy issues and solutions for Voice-controlled Digital Assistants.",
            "A lightweight distributed detection algorithm for DDAO attack on RPL routing protocol in Internet of Things.",
            "LwTool: A data processing toolkit for building a real-time pressure mapping smart textile software system.",
            "Power consumption analysis of access network in 5G mobile communication infrastructures - An analytical quantification model."
        ]
    },
    {
        "name": "PMC",
        "year": "2021",
        "info": "2021: Volumes\n70,\n71,\n72,\n73,\n74,\n75,\n76,\n77,\n78",
        "count": 73,
        "papers": [
            "Spatio-temporal AI inference engine for estimating hard disk reliability.",
            "EdgeDoc: An edge-based distributed collaborative editing system.",
            "Identifying users from the interaction with a door handle.",
            "Transposition of Location-based Games: Using Procedural Content Generation to deploy balanced game maps to multiple locations.",
            "MyDigitalFootprint: An extensive context dataset for pervasive computing applications at the edge.",
            "Relevant node discovery and selection approach for the Internet of Things based on neural networks and ant colony optimization.",
            "Dynamic and multi-source semantic annotation of raw mobility data using geographic and social media data.",
            "Distributed algorithms based on proximity for self-organizing fog computing systems.",
            "SWIFT: A non-emergency response prediction system using sparse Gaussian Conditional Random Fields.",
            "Assessing the impact of unbalanced resources and communications in edge computing.",
            "Efficient biometric-based identity management on the Blockchain for smart industrial applications.",
            "Hush now! Context factors behind smartphone ringer mode changes.",
            "Modeling an intelligent controller for predictive caching in AR/VR-enabled home scenarios.",
            "Merged glowworm swarm with ant colony optimization for energy efficient clustering and routing in Wireless Sensor Network.",
            "Editorial for this SI on \"Location Based Services and Applications in the era of Internet of Things\".",
            "Editorial for Special Issue on Block Chain Technology and its Applications.",
            "Intelligent decision-making in Smart Food Industry: Quality perspective.",
            "Optimal edge server deployment and allocation strategy in 5G ultra-dense networking environments.",
            "EDCRA-IoT: Edge-based Data Conflict Resolution Approach for Internet of Things.",
            "A blockchain-based trust management method for Internet of Things.",
            "ProDroid - An Android malware detection framework based on profile hidden Markov model.",
            "GEESE: Edge computing enabled by UAVs.",
            "A holistic approach to a context-aware IoT ecosystem with Adaptive Ubiquitous Middleware.",
            "A novel self-healing model using precoding & big-data based approach for 5G networks.",
            "Joint radio and local resources optimization for tasks offloading with priority in a Mobile Edge Computing network.",
            "SnapAppy: A positive psychology intervention using smartphone photography to improve emotional well-being.",
            "STAC: a spatio-temporal approximate method in data collection applications.",
            "bioMCS 2.0: A distributed, energy-aware fog-based framework for data forwarding in mobile crowdsensing.",
            "A comprehensive investigation on range-free localization algorithms with mobile anchors at different altitudes.",
            "A holistic approach to power efficiency in a clock offset based Intrusion Detection Systems for Controller Area Networks.",
            "A novel congestion propagation modeling algorithm for smart cities.",
            "Happiness recognition from smartphone usage data considering users' estimated personality traits.",
            "Online charging coordination of electric vehicles to optimize cost and smoothness.",
            "WiPass: 1D-CNN-based smartphone keystroke recognition Using WiFi signals.",
            "EMPC: Energy-Minimization Path Construction for data collection and wireless charging in WRSN.",
            "Energy and task completion time trade-off for task offloading in fog-enabled IoT networks.",
            "\"I still need my privacy\": Exploring the level of comfort and privacy preferences of German-speaking older adults in the case of mobile assistant robots.",
            "A lightweight authentication protocol for D2D-enabled IoT systems with privacy.",
            "TOTP Moving Target Defense for sensitive network services.",
            "Design and evaluation of a fog platform supporting device mobility through container migration.",
            "On producing energy-efficient and contrast-enhanced images for OLED-based mobile devices.",
            "Accurate indoor positioning using IEEE 802.11mc round trip time.",
            "W8-Scope: Fine-grained, practical monitoring of weight stack-based exercises.",
            "Device-independent cellular-based indoor location tracking using deep learning.",
            "Health and sleep nursing assistant for real-time, contactless, and non-invasive monitoring.",
            "SPIDERS+: A light-weight, wireless, and low-cost glasses-based wearable platform for emotion sensing and bio-signal acquisition.",
            "AI-driven autonomous vehicles as COVID-19 assessment centers: A novel crowdsensing-enabled strategy.",
            "Is blockchain for Internet of Medical Things a panacea for COVID-19 pandemic?",
            "Mobile and social sensing.",
            "Porting deep neural networks on the edge via dynamic K-means compression: A case study of plant disease detection.",
            "What makes people install a COVID-19 contact-tracing app? Understanding the influence of app design and individual difference on contact-tracing app adoption intention.",
            "Multi-level feature driven storage management of surveillance videos.",
            "ARMAND: Anti-Repackaging through Multi-pattern Anti-tampering based on Native Detection.",
            "Towards generating a reliable device-specific identifier for IoT devices.",
            "Towards the detection of driver-pedestrian eye contact.",
            "REAM: A Framework for Resource Efficient Adaptive Monitoring of Community Spaces.",
            "An intelligent charging scheme maximizing the utility for rechargeable network in smart city.",
            "Detecting Byzantine attacks in Cognitive Radio Networks : A two-layered approach using Hidden Markov Model and machine learning.",
            "Online policies for throughput maximization of backscatter assisted wireless powered communication via reinforcement learning approaches.",
            "Feature selection for proximity estimation in COVID-19 contact tracing apps based on Bluetooth Low Energy (BLE).",
            "MobIntel: Sensing and analytics infrastructure for urban mobility intelligence.",
            "Reconciling the what, when and how of privacy notifications in fitness tracking scenarios.",
            "Secure D2D caching framework inspired on trust management and blockchain for Mobile Edge Caching.",
            "IEEE International Conference on Pervasive Computing and Communications (PerCom) 2020.",
            "Special Issue on IoT for Fighting COVID-19.",
            "Guest editorial for the PMC special section on selected papers from ICDCN 2020.",
            "Editorial.",
            "ContrasGAN: Unsupervised domain adaptation in Human Activity Recognition via adversarial and contrastive learning.",
            "Continuous authentication through gait analysis on a wrist-worn device.",
            "ADAM-sense: Anxiety-displaying activities recognition by motion sensors.",
            "Magic-hand: Turn a smartwatch into a mouse.",
            "AR Peephole Interface: Extending the workspace of a mobile device using real-space information.",
            "VibeRing: Using vibrations from a smart ring as an out-of-band channel for sharing secret keys."
        ]
    },
    {
        "name": "PMC",
        "year": "2020",
        "info": "2020: Volumes\n61,\n62,\n63,\n64,\n65,\n66,\n67,\n68,\n69",
        "count": 68,
        "papers": [
            "Crowdsourcing from the True crowd: Device, vehicle, road-surface and driving independent road profiling from smartphone sensors.",
            "A novel data exploitation framework based on blockchain.",
            "Energy-aware dynamic Internet of Things security system based on Elliptic Curve Cryptography and Message Queue Telemetry Transport protocol for mitigating Replay attacks.",
            "DeepMag+: Sniffing mobile apps in magnetic field through deep learning.",
            "Survivability Aware Channel Allocation in WSN for IoT applications.",
            "On the robustness of Lightning Network in Bitcoin.",
            "ReCon: Sybil-resistant consensus from reputation.",
            "Mobile Crowdsourcing and Pervasive Computing for Smart Cities.",
            "Consensus-oriented cloud manufacturing based on blockchain technology: An exploratory study.",
            "SmartWheels: Detecting urban features for wheelchair users' navigation.",
            "When Blockchain meets Online Social Networks.",
            "Model checking smart contracts for Ethereum.",
            "Online distributed distance-based outlier clearance approaches for wireless sensor networks.",
            "Privacy and utility preserving sensor-data transformations.",
            "Overcoming 5G ultra-density with game theory: Alpha-beta pruning aided conflict detection.",
            "Distributed fine-tuning of CNNs for image retrieval on multiple mobile devices.",
            "Unsupervised domain adaptation for activity recognition across heterogeneous datasets.",
            "From seen to unseen: Designing keyboard-less interfaces for text entry on the constrained screen real estate of Augmented Reality headsets.",
            "MRCSC: A cross-layer algorithm for joint Multicast Routing, Channel selection, Scheduling, and Call admission control in multi-cell multi-channel multi-radio cognitive radio wireless networks.",
            "Special issue on \"Crowd-sensed Big Data for Internet of Things Services\".",
            "Selected papers from the 19th IEEE International Symposium on a World of Wireless, Mobile and Multimedia Networks.",
            "An efficient privacy-preserving data query and dissemination scheme in vehicular cloud.",
            "Detecting hidden webcams with delay-tolerant similarity of simultaneous observation.",
            "Signal strength based scheme for following mobile IoT devices in dynamic environments.",
            "Air-writing recognition using smart-bands.",
            "A blockchainized privacy-preserving support vector machine classification on mobile crowd sensed data.",
            "A mobile sensing and visualization platform for environmental data.",
            "Generative model based attenuation image recovery for device-free localization with radio tomographic imaging.",
            "A Deep Learning approach for Path Prediction in a Location-based IoT system.",
            "What's your protocol: Vulnerabilities and security threats related to Z-Wave protocol.",
            "IoT-enabled Low Power Environment Monitoring System for prediction of PM2.5.",
            "Secure and anonymous authentication scheme for the Internet of Things with pairing.",
            "bioSmartSense+: A bio-inspired probabilistic data collection framework for priority-based event reporting in IoT environments.",
            "The active learning multi-task allocation method in mobile crowd sensing based on normal cloud model.",
            "Activity-specific caloric expenditure estimation from kinetic energy harvesting in wearable devices.",
            "Efficient photo crowdsourcing with evolving POIs under delay-tolerant network environment.",
            "ECCbAP: A secure ECC-based authentication protocol for IoT edge devices.",
            "Context aware access control for home voice assistant in multi-occupant homes.",
            "SimRa: Using crowdsourcing to identify near miss hotspots in bicycle traffic.",
            "Sensing social interactions through BLE beacons and commercial mobile devices.",
            "Learning methods for RSSI-based geolocation: A comparative study.",
            "Optimising data diffusion while reducing local resources consumption in Opportunistic Mobile Crowdsensing.",
            "DASC: Towards a road Damage-Aware Social-media-driven Car sensing framework for disaster response applications.",
            "A framework for the recognition of horse gaits through wearable devices.",
            "Adaptive streaming of HD and 360° videos over software defined radios.",
            "A scalable Edge Computing architecture enabling smart offloading for Location Based Services.",
            "Fingerprint variation detection by unlabeled data for indoor localization.",
            "Distributed load balancing for heterogeneous fog computing infrastructures in smart cities.",
            "An approach to compute the scope of a social object in a Multi-IoT scenario.",
            "Towards better social crisis data with HERMES: Hybrid sensing for EmeRgency ManagEment System.",
            "Verification of smart contracts: A survey.",
            "A Novel Methodology for designing Policies in Mobile Crowdsensing Systems.",
            "The rhythm of the crowd: Properties of evolutionary community detection algorithms for mobile edge selection.",
            "Mobile music recommendations for runners based on location and emotions: The DJ-Running system.",
            "Cooperative monitoring and dissemination of urban events supported by dynamic clustering of vehicles.",
            "Opportunistic sensing based detection of crowdedness in public transport buses.",
            "Towards ensuring the reliability and dependability of vehicular crowd-sensing data in GPS-less location tracking.",
            "Annapurna: An automated smartwatch-based eating detection and food journaling system.",
            "Towards a methodological framework for estimating present population density from mobile network operator data.",
            "NOVN: A named-object based virtual network architecture to support advanced mobile edge computing services.",
            "A priority-aware lightweight secure sensing model for body area networks with clinical healthcare applications in Internet of Things.",
            "edgeTrans - Edge transport mode detection.",
            "When phones get personal: Predicting Big Five personality traits from application usage.",
            "Modeling and performance analysis of smart map application in the Multi-access Edge Computing paradigm.",
            "Bandwidth-constrained task throughput maximization in IoT-enabled 5G networks.",
            "An energy-efficient adaptive beaconing rate management for pedestrian safety: A fuzzy logic-based approach.",
            "DF-WiSLR: Device-Free Wi-Fi-based Sign Language Recognition.",
            "PoEWAL: A lightweight consensus mechanism for blockchain in IoT."
        ]
    },
    {
        "name": "PMC",
        "year": "2019",
        "info": "2019: Volumes\n52,\n53,\n54,\n55,\n56,\n57,\n58,\n59,\n60",
        "count": 81,
        "papers": [
            "A new genetic-based approach for maximizing network lifetime in directional sensor networks with adjustable sensing ranges.",
            "A trustworthy agent-based encrypted access control method for mobile cloud computing environment.",
            "Energy-efficient scheduling scheme with spatial and temporal aggregation for small and massive transmissions in LTE-M networks.",
            "Pseudo-linear localization using perturbed RSSI measurements and inaccurate anchor positions.",
            "Least fresh first cache replacement policy for NDN-based IoT networks.",
            "A survey on fog computing for the Internet of Things.",
            "Innovative architecture of single chip edge device based on virtualization technology.",
            "Remote interspecies interactions: Improving humans and animals' wellbeing through mobile playful spaces.",
            "Editorial.",
            "Relay node placement under budget constraint.",
            "Implications of smartphone user privacy leakage from the advertiser's perspective.",
            "A Reference Architecture to support the development of mobile applications based on self-adaptive services.",
            "Provisioning of energy consumption information for mobile ads.",
            "Spatio-temporal crime predictions in smart cities: A data-driven approach and experiments.",
            "Enhancing activity recognition using CPD-based activity segmentation.",
            "Guest editorial for the PMC special section on selected papers from ICDCN 2017.",
            "Range-free localization algorithm using a customary drone: Towards a realistic scenario.",
            "Large-scale trip planning for bike-sharing systems.",
            "Wireless non-invasive motion tracking of functional behavior.",
            "A parameterized model to select discriminating features on keystroke dynamics authentication on smartphones.",
            "Distributed allocation and dynamic reassignment of channels in UAV networks for wireless coverage.",
            "User authentication in a tactile internet based remote surgery environment: Security issues, challenges, and future research directions.",
            "Energy efficient secure data collection with path-constrained mobile sink in duty-cycled unattended wireless sensor network.",
            "CollaboRoid: Mobile platform support for collaborative applications.",
            "Mobile crowdsourcing based context-aware smart alarm sound for smart living.",
            "Foraging-based optimization of pervasive displays.",
            "Free floating electric car sharing design: Data driven optimisation.",
            "A survey of privacy enhancing technologies for smart cities.",
            "A test methodology for evaluating architectural delays of LoRaWAN implementations.",
            "Identity-based proxy-oriented outsourcing with public auditing in cloud-based medical cyber-physical systems.",
            "Markov decision process and network coding for reliable data transmission in wireless sensor and actor networks.",
            "An investigation into smartphone based weakly supervised activity recognition systems.",
            "Design and assessment of the data analysis process for a wrist-worn smart object to detect atomic activities in the smart home.",
            "Null-While-Talk: Interference nulling for improved inter-technology coexistence in LTE-U and WiFi networks.",
            "newNECTAR: Collaborative active learning for knowledge-based probabilistic activity recognition.",
            "CamTest: A laboratory testbed for camera-based mobile sensing applications.",
            "Cross-position activity recognition with stratified transfer learning.",
            "Smartphone-based localization for blind navigation in building-scale indoor environments.",
            "Multi-objective surrogate modeling for real-time energy-efficient station grouping in IEEE 802.11ah.",
            "Adaptable mobile cloud computing environment with code transfer based on machine learning.",
            "PS-Sim: A framework for scalable data simulation and incentivization in participatory sensing-based smart city applications.",
            "MOFPL: Multi-objective fractional particle lion algorithm for the energy aware routing in the WSN.",
            "Improving ambient FM indoor localization using multipath-induced amplitude modulation effect: A year-long experiment.",
            "Analyzing The Emotions of Crowd For Improving The Emergency Response Services.",
            "Beyond position-awareness - Extending a self-adaptive fall detection system.",
            "Bridging mobile device configuration to the user experience under budget constraint.",
            "Smart user identification using cardiopulmonary activity.",
            "Mobile collaborative computing on the fly.",
            "IoTPatchPool: Incentivized delivery network of IoT software updates based on proofs-of-distribution.",
            "CrowdMeter: Gauging congestion level in railway stations using smartphones.",
            "When analog meets digital: Source-Encoded Physical-Layer Network Coding.",
            "Solving the load balanced clustering and routing problems in WSNs with an fpt-approximation algorithm and a grid structure.",
            "Unobtrusive assessment of stress of office workers via analysis of their motion trajectories.",
            "App usage prediction for dual display device via two-phase sequence modeling.",
            "Retraction notice to \"Cognitive Caching for the Future Sensors in Fog Networking\" [Pervasive Mob. Comput. 42 (2017) 317-334].",
            "Interrelationship between energy efficiency and spectral efficiency in cognitive femtocell networks: A survey.",
            "User profiling from their use of smartphone applications: A survey.",
            "An efficient CPPA scheme for intelligent transportation networks.",
            "Mobile QoE prediction in the field.",
            "ICS-BlockOpS: Blockchain for operational data security in industrial control system.",
            "An incremental learning method based on formal concept analysis for pattern recognition in nonstationary sensor-based smart environments.",
            "Secure blockchain in the enterprise: A methodology.",
            "Light-weight streaming protocol for the Internet of Multimedia Things: Voice streaming over NB-IoT.",
            "Security and privacy of mobile wallet users in Bitcoin, Dash, Monero, and Zcash.",
            "Vulnerabilities on Hyperledger Fabric.",
            "Wireless energy efficient occupancy-monitoring system for smart buildings.",
            "Creating consensus group using online learning based reputation in blockchain networks.",
            "SSChain: A full sharding protocol for public blockchain without data migration overhead.",
            "Smart computing: Research trends and perspectives: Special Issue On Selected Papers from IEEE SMARTCOMP 2018.",
            "A comprehensive survey on networking over TV white spaces.",
            "Node placement for connected target coverage in wireless sensor networks with dynamic sinks.",
            "An efficient scheduling scheme for on-demand mobile charging in wireless rechargeable sensor networks.",
            "Vulnerability-based risk assessment and mitigation strategies for edge devices in the Internet of Things.",
            "Assessing interoperability solutions for distributed ledgers.",
            "Offline privacy preserving proxy re-encryption in mobile cloud computing.",
            "Where WTS meets WTB: A Blockchain-based Marketplace for Digital Me to trade users' private data.",
            "PhishDump: A multi-model ensemble based technique for the detection of phishing sites in mobile devices.",
            "An online reinforcement learning approach to quality-cost-aware task allocation for multi-attribute social sensing.",
            "WKNN indoor location algorithm based on zone partition by spatial features and restriction of former location.",
            "Identity based proficient message verification scheme for vehicle users.",
            "Maximizing MapReduce job speed and reliability in the mobile cloud by optimizing task allocation."
        ]
    },
    {
        "name": "PMC",
        "year": "2018",
        "info": "2018: Volumes\n43,\n44,\n45,\n46,\n47,\n48,\n49,\n50,\n51",
        "count": 72,
        "papers": [
            "Adaptive monitoring system for e-health smart homes.",
            "Consume: A privacy-preserving authorisation and authentication service for connecting with health and wellbeing APIs.",
            "ARBIC: An Adjustable Range Based Immune hierarchy Clustering protocol supporting mobility of Wireless Sensor Networks.",
            "Survivable Path Routing in WSN for IoT applications.",
            "Assessing the cost of deploying and maintaining indoor wireless sensor networks with RF-power harvesting properties.",
            "Unlocking the smartphone's sensors for smart city parking.",
            "Vehicular Social Networks: A survey.",
            "Best effort broadcast under cascading failures in interdependent critical infrastructure networks.",
            "On the semantic annotation of Wi-Fi SSID logs in mobile applications.",
            "The cloudUPDRS app: A medical device for the clinical assessment of Parkinson's Disease.",
            "Swarm-Sync: A distributed global time synchronization framework for swarm robotic systems.",
            "Highly efficient randomized authentication in VANETs.",
            "Time-division random-access scheme based on coverage level for cellular internet-of-things in 3GPP networks.",
            "A novel source location privacy preservation technique to achieve enhanced privacy and network lifetime in WSNs.",
            "Guest Editorial for Special Issue on Emerging Peer to Peer (P2P) Network Technologies for Pervasive and Mobile Computing.",
            "A secure and cost-efficient offloading policy for Mobile Cloud Computing against timing attacks.",
            "Enabling interactive mobile simulations through distributed reduced models.",
            "Counting via LED sensing: Inferring occupancy using lighting infrastructure.",
            "Smartphone based approximate localization using user highlighted texts from images.",
            "FastRank: Practical lightweight tolerance to rational behavior in edge assisted streaming.",
            "Approximation algorithm for data gathering from mobile sensors.",
            "RUP: Large Room Utilisation Prediction with carbon dioxide sensor.",
            "Queue based scheduling in single and multi channel dynamic spectrum access networks.",
            "Attitude estimation for indoor navigation and augmented reality with smartphones.",
            "A multi-objective and PSO based energy efficient path design for mobile sink in wireless sensor networks.",
            "Moves like Jagger: Exploiting variations in instantaneous gait for spontaneous device pairing.",
            "XWARE - A customizable interoperability framework for pervasive computing systems.",
            "Regions-of-interest discovering and predicting in smartphone environments.",
            "A survey on developing personalized content services in museums.",
            "Identification of activities of daily living through data fusion on motion and magnetic sensors embedded on mobile devices.",
            "Efficient data perturbation for privacy preserving and accurate data stream mining.",
            "Range based algorithms for precise localization of terrestrial objects using a drone.",
            "Secure authentication framework for cloud-based toll payment message dissemination over ubiquitous VANETs.",
            "Traffic characterization and LTE performance analysis for M2M communications in smart cities.",
            "An efficient method for physical fields mapping through crowdsensing.",
            "Walk and learn: Enabling accurate indoor positioning by profiling outdoor movement on smartphones.",
            "Fast flow volume estimation.",
            "A cellular data dissemination model for wireless sensor networks.",
            "Efficient feedback mechanism for LTE-based D2D communication.",
            "PLDP-TD: Personalized-location differentially private data analysis on trajectory databases.",
            "Minimum-cost mobile crowdsourcing with QoS guarantee using matrix completion technique.",
            "Efficient periodical boundary detection through boundary crossing record and sensor data overhearing in dense MWSNs.",
            "A distributed real-time data prediction and adaptive sensing approach for wireless sensor networks.",
            "Fine-grained LTE radio link estimation for mobile phones.",
            "Arcades: A deep model for adaptive decision making in voice controlled smart-home.",
            "The Curse of Sensing: Survey of techniques and challenges to cope with sparse and dense data in mobile crowd sensing for Internet of Things.",
            "VIVO: A secure, privacy-preserving, and real-time crowd-sensing framework for the Internet of Things.",
            "Privacy-respecting reward generation and accumulation for participatory sensing applications.",
            "Multi-priority fork-join scheduling in SDN for high-performance data transmissions in mobile crowdsourcing.",
            "Real-world large-scale study on adaptive notification scheduling on smartphones.",
            "System for monitoring and supporting the treatment of sleep apnea using IoT and big data.",
            "Fully automated OLED display power modeling for mobile devices.",
            "Machine-to-machine wireless communication technologies for the Internet of Things: Taxonomy, comparison and open issues.",
            "Shortest feasible paths with partial charging for battery-powered electric vehicles in smart cities.",
            "An online approach for joint task assignment and worker evaluation in crowd-sourcing.",
            "Distinguishing friends from strangers in location-based social networks using co-location.",
            "On-mouse projector: Peephole interaction using a mouse with a mobile projector.",
            "Physiological state in extreme environments.",
            "Survey on traffic prediction in smart cities.",
            "Mental health monitoring with multimodal sensing and machine learning: A survey.",
            "Energy efficient distributed analytics at the edge of the network for IoT environments.",
            "Cooperative data forwarding based on crowdsourcing in vehicular social networks.",
            "P3GQ: A practical privacy-preserving generic location-based services query scheme.",
            "Reputation-based multi-auditing algorithmic mechanism for reliable mobile crowdsensing.",
            "Effective truth discovery and fair reward distribution for mobile crowdsensing.",
            "Efficient dispatch of mobile sensors in a WSN with wireless chargers.",
            "Asfault:  A low-cost system to evaluate pavement conditions in real-time using smartphones and machine learning.",
            "Interference management for D2D communications in heterogeneous cellular networks.",
            "Cross-environment activity recognition using a shared semantic vocabulary.",
            "Study of relay-based ad hoc rendezvous and data transmission in cognitive radio networks.",
            "On the maximum movement to the power of random sensors for coverage and interference.",
            "Why energy matters? Profiling energy consumption of mobile crowdsensing data collection frameworks."
        ]
    },
    {
        "name": "PMC",
        "year": "2017",
        "info": "2017: Volumes\n34,\n35,\n36,\n37,\n38,\n39,\n40,\n41,\n42",
        "count": 197,
        "papers": [
            "Special Issue - Pervasive Computing for Gerontechnology.",
            "Mobile activity recognition and fall detection system for elderly people using Ameva algorithm.",
            "Recognition of falls using dense sensing in an ambient assisted living environment.",
            "A smart segmentation technique towards improved infrequent non-speech gestural activity recognition model.",
            "Arousal level classification of the aging adult from electro-dermal activity: From hardware development to software architecture.",
            "Adaptive exergames to support active aging: An action research study.",
            "Domain independent regulative norms for evaluating performance of assistive solutions.",
            "Tangibot: A tangible-mediated robot to support cognitive games for ageing people - A usability study.",
            "Rich contextual information for monitoring the elderly in an early stage of cognitive impairment.",
            "DemaWare2: Integrating sensors, multimedia and semantic analysis for the ambient care of dementia.",
            "Real-time fluid intake gesture recognition based on batteryless UHF RFID technology.",
            "Unsupervised visit detection in smart homes.",
            "Collaborative location recommendations with dynamic time periods.",
            "Using geosocial search for urban air pollution monitoring.",
            "Early analysis of resource consumption patterns in mobile applications.",
            "Field evaluation of context aware adaptive interfaces for efficient mobile contact retrieval.",
            "Beyond the \"single-operator, CDR-only\" paradigm: An interoperable framework for mobile phone network data analyses and population density estimation.",
            "Anomaly detection for smartphone data streams.",
            "Kernelized correlation tracker on smartphones.",
            "Joint cell selection and resource allocation games with backhaul constraints.",
            "Soft decision cooperative spectrum sensing with noise uncertainty reduction.",
            "An energy efficient Reinforcement Learning based Cooperative Channel Sensing for Cognitive Radio Sensor Networks.",
            "Special Issue on Pervasive Social Computing.",
            "A personalized recommender system for pervasive social networks.",
            "Social-aware hybrid mobile offloading.",
            "Trust and reputation management for opportunistic dissemination.",
            "Anonymous end-to-end communications in adversarial mobile clouds.",
            "Improving geolocation of social media posts.",
            "Automatic rule generation using crowdsourcing for better relationship type discovery.",
            "The role of social interaction on users motivation to exercise: A persuasive web framework to enhance the self-management of a healthy lifestyle.",
            "Collaborative cellular tail energy reduction: Feasibility and fairness.",
            "Augmenting flows for the consistent migration of multi-commodity single-destination flows in SDNs.",
            "Mining smartphone data for app usage prediction and recommendations: A survey.",
            "A survey of energy-efficient context recognition systems using wearable sensors for healthcare applications.",
            "Instrumenting Wireless Sensor Networks - A survey on the metrics that matter.",
            "Distributed algorithm for target localization in wireless sensor networks using RSS and AoA measurements.",
            "Convex optimization algorithms for cooperative RSS-based sensor localization.",
            "D-Log: A WiFi Log-based differential scheme for enhanced indoor localization with single RSSI source and infrequent sampling rate.",
            "A novel approach towards utilizing Dempster Shafer fusion theory to enhance WiFi positioning system accuracy.",
            "Energy-efficient WiFi scanning for localization.",
            "Opportunistic Time-of-Arrival localization in fully asynchronous wireless networks.",
            "A joint time synchronization and localization method without known clock parameters.",
            "Categorization framework and survey of occupancy sensing systems.",
            "Modeling human daily preferences through a context-aware web-mapping system using semantic technologies.",
            "Adaptive sliding window segmentation for physical activity recognition using a single tri-axial accelerometer.",
            "Advancing Android activity recognition service with Markov smoother: Practical solutions.",
            "Forecasting occurrences of activities.",
            "Information gain-based metric for recognizing transitions in human activities.",
            "Planning meets activity recognition: Service coordination for intelligent buildings.",
            "I-vector analysis for Gait-based Person Identification using smartphone inertial signals.",
            "Open source hardware based sensor platform suitable for human gait identification.",
            "Unsupervised illness recognition via in-home monitoring by depth cameras.",
            "Fast participant recruitment algorithm for large-scale Vehicle-based Mobile Crowd Sensing.",
            "Mobile crowd sensing management with the ParticipAct living lab.",
            "On the effect of human mobility to the design of metropolitan mobile opportunistic networks of sensors.",
            "Encircled Belt-Barrier Coverage in Wireless Visual Sensor Networks.",
            "Cloud-based query evaluation for energy-efficient mobile sensing.",
            "Notes on \"Secure authentication scheme for IoT and cloud servers\".",
            "Special Issue IEEE International Conference on Pervasive Computing and Communications (PerCom) 2016.",
            "Position-aware activity recognition with wearable devices.",
            "PEACE-Home: Probabilistic estimation of abnormal clinical events using vital sign correlations for reliable home-based monitoring.",
            "Active learning enabled activity recognition.",
            "Measuring muscle activities during gym exercises with textile pressure mapping sensors.",
            "iFrame: Dynamic indoor map construction through automatic mobile sensing.",
            "Identifying TV Channels & On-Demand Videos using Ambient Light Sensors.",
            "Exploiting the untapped potential of mobile distributed computing via approximation.",
            "A Simultaneous Extraction of Context and Community from pervasive signals using nested Dirichlet process.",
            "Task phase recognition and task progress estimation for highly mobile workers in large building complexes.",
            "Visualizing, clustering, and predicting the behavior of museum visitors.",
            "Special Issue on Context-aware Mobile Recommender Systems.",
            "Personalization and Context-awareness in Social Local Search: State-of-the-art and Future Research Challenges.",
            "UTravel: Smart Mobility with a Novel User Profiling and Recommendation Approach.",
            "Location-aware online learning for top-k recommendation.",
            "Towards a social and context-aware mobile recommendation system for tourism.",
            "DataGenCARS: A generator of synthetic data for the evaluation of context-aware recommendation systems.",
            "Routing in wireless sensor networks for wind turbine monitoring.",
            "Achieving fully privacy-preserving private range queries over outsourced cloud data.",
            "A survey on cyber attacks against nonlinear state estimation in power systems of ubiquitous cities.",
            "Deriving cryptographic keys from physiological signals.",
            "Does network quality matter? A field study of mobile user satisfaction.",
            "Security analysis of fast inter-LMA domain handover scheme in proxy mobile IPv6 networks.",
            "A game theoretic framework for stochastic multipath routing in self-organized MANETs.",
            "Gaussian Process models for ubiquitous user comfort preference sampling; global priors, active sampling and outlier rejection.",
            "Uncertainty handling in rule-based mobile context-aware systems.",
            "Impact of capacity and discharging rate on battery life time: A stochastic model to support mobile device autonomy planning.",
            "ICSSSS: An intelligent channel selection scheme for cognitive radio ad hoc networks using a self organized map followed by simple segregation.",
            "An empirical analysis of energy consumption of cross-platform frameworks for mobile development.",
            "Monitoring continuous all k-nearest neighbor query in mobile network environments.",
            "A crowd enabled approach for processing nearest neighbor and range queries in incomplete databases with accuracy guarantee.",
            "Multidevice mobile sessions: A first look.",
            "Evaluation of mobile cloud architectures.",
            "Probabilistic location-dependent queries at different location granularities.",
            "A hierarchical model for recognizing alarming states in a batteryless sensor alarm intervention for preventing falls in older people.",
            "iKnow: Ontology-driven situational awareness for the recognition of activities of daily living.",
            "Classification and visualization of skateboard tricks using wearable sensors.",
            "A smartphone based technique to monitor driving behavior using DTW and crowdsensing.",
            "Smart patrolling: An efficient road surface monitoring using smartphone sensors and crowdsourcing.",
            "A novel-Q DFSA algorithm for passive RFID system.",
            "Modeling pedestrian mobility in disaster areas.",
            "Trajectory segment selection with limited budget in mobile crowd sensing.",
            "Improved vehicle positioning algorithm using enhanced innovation-based adaptive Kalman filter.",
            "Cyber-physical systems: Extending pervasive sensing from control theory to the Internet of Things.",
            "Leveraging multi-modal smartphone sensors for ranging and estimating the intensity of explosion events.",
            "VCKSM: Verifiable conjunctive keyword search over mobile e-health cloud in shared multi-owner settings.",
            "Evaluation of user authentication methods in the gadget-free world.",
            "Decentralised Peer-to-Peer data dissemination in Wireless Sensor Networks.",
            "Motion artifact removal based on periodical property for ECG monitoring with wearable systems.",
            "MASSHA: An agent-based approach for human activity simulation in intelligent environments.",
            "A novel Energy-Efficient Video Streaming method for decentralized Mobile Ad-hoc Networks.",
            "Learning multi-level features for sensor-based human action recognition.",
            "Evolution of superpeer topologies - An analytical perspective.",
            "Edge-based interoperable service-driven information distribution for intelligent pervasive services.",
            "User interface-level QoE analysis for Android application tuning.",
            "Scalable and consistent radio map management using participatory sensing.",
            "Unsupervised understanding of location and illumination changes in egocentric videos.",
            "Analysing privacy in visual lifelogging.",
            "Enhanced radio tomographic imaging with heterogeneous Bayesian compressive sensing.",
            "Discovering and modeling meta-structures in human behavior from city-scale cellular data.",
            "Reachable but not receptive: Enhancing smartphone interruptibility prediction by modelling the extent of user engagement with notifications.",
            "A real-time routing protocol with adaptive traffic shaping for multimedia streaming over next-generation of Wireless Multimedia Sensor Networks.",
            "Mobile app adoption in different life stages: An empirical analysis.",
            "Exploiting write-only-once characteristics of file data in smartphone buffer cache management.",
            "Dynamic LTE resource reservation for critical M2M deployments.",
            "A flexible and generalized framework for access network selection in heterogeneous wireless networks.",
            "A game-theoretic and stochastic survivability mechanism against induced attacks in Cognitive Radio Networks.",
            "SkyEye: A tree-based peer-to-peer monitoring approach.",
            "Signaling game based strategy for secure positioning in wireless sensor networks.",
            "A wave propagation-based adaptive probabilistic broadcast containment strategy for reactive MANET routing protocols.",
            "A bandwidth adaptation mechanism for Cloud Radio Access Networks.",
            "Location-based IoT applications on campus: The IoTtalk approach.",
            "Improving the efficiency and reliability of wearable based mobile eHealth applications.",
            "Wearable IoT data stream traceability in a distributed health information system.",
            "Detecting abnormal behaviours of institutionalized older adults through a hybrid-inference approach.",
            "The Internet of People (IoP): A new wave in pervasive mobile computing.",
            "Context-aware RAON middleware for opportunistic network.",
            "A communication efficient distributed learning framework for smart environments.",
            "Topological dynamics of comparison-based fault identification in ad hoc networks.",
            "Secure communication through jammers jointly optimized in geography and time.",
            "Multi-objective optimization for spectrum sharing in cognitive radio networks: A review.",
            "Advanced internet of things for personalised healthcare systems: A survey.",
            "A fine-grained indoor fingerprinting localization based on magnetic field strength and channel state information.",
            "Data analysis and call prediction on dyadic data from an understudied population.",
            "Analysis of transmission capacity for multi-mode D2D communication in mobile networks.",
            "Dynamic energy-aware sensor configuration in multi-application monitoring systems.",
            "Recommender system for privacy-preserving solutions in smart metering.",
            "A secure cloud-assisted urban data sharing framework for ubiquitous-cities.",
            "Secure similarity-based cloud data deduplication in Ubiquitous city.",
            "Zero knowledge based client side deduplication for encrypted files of secure cloud storage in smart cities.",
            "V2X security: A case study of anonymous authentication.",
            "CloudBot: Advanced mobile botnets using ubiquitous cloud technologies.",
            "Compact public key encryption without full random oracles.",
            "Efficient 3-dimensional localization for RFID systems using jumping probe.",
            "Spatio-temporal adaptive indoor positioning using an ensemble approach.",
            "A QoS-sensitive task assignment algorithm for mobile crowdsensing.",
            "An energy-efficient data gathering method based on compressive sensing for pervasive sensor networks.",
            "Link quality aware channel allocation for multichannel body sensor networks.",
            "Content caching with virtual spatial locality in Cellular Network.",
            "ClariSense+: An enhanced traffic anomaly explanation service using social network feeds.",
            "Probabilistic time-series segmentation.",
            "APMD: A fast data transmission protocol with reliability guarantee for pervasive sensing data communication.",
            "Secure video summarization framework for personalized wireless capsule endoscopy.",
            "Towards robust and efficient device-free localization using UWB sensor network.",
            "Exploring traffic congestion correlation from multiple data sources.",
            "A new modulation technique and compensation algorithm for mainstream CO2 capnography.",
            "Automatic diabetic retinopathy diagnosis using adjustable ophthalmoscope and multi-scale line operator.",
            "Serious game based personalized healthcare system for dysphonia rehabilitation.",
            "Supporting location/identity separation in mobility-enhanced satellite networks by virtual attachment point.",
            "A secure authentication scheme for Internet of Things.",
            "Effective opportunistic dissemination of spatio-temporal contents in mobile environments.",
            "A model for optimal service allocation in a smart environment.",
            "A survey on the evolution of privacy enforcement on smartphones and the road ahead.",
            "An approach for the discovery and validation of urban mobility patterns.",
            "A single quadtree-based algorithm for top-k spatial keyword query.",
            "An algorithmic study in the vector model for Wireless Power Transfer maximization.",
            "EnergIoT: A solution to improve network lifetime of IoT devices.",
            "A Novel Mathematical Framework for Similarity-based Opportunistic Social Networks.",
            "An Uncertainty Quantification methodology for Broadband Wireless Access systems.",
            "Data collection and upload under dynamicity in smart community Internet-of-Things deployments.",
            "The SENSE-ME platform: Infrastructure-less smartphone connectivity and decentralized sensing for emergency management.",
            "An evolutionary cluster-game approach for Wireless Sensor Networks in non-collaborative settings.",
            "Preclude2 : Personalized conflict detection in heterogeneous health applications.",
            "Energy consumption of data mining algorithms on mobile phones: Evaluation and prediction.",
            "Dynamic radius and confidence prediction in grid-based location prediction algorithms.",
            "Optimizing the performance of sensor network programs through estimation-based code profiling.",
            "Price-based data delivery framework for dynamic and pervasive IoT.",
            "Optimized P2P streaming for wireless distributed networks.",
            "Secure and reliable patient body motion based authentication approach for medical body area networks.",
            "A social cognitive heuristic for adaptive data dissemination in mobile Opportunistic Networks.",
            "Implementing an emerging mobility model for a fleet of UAVs based on a fuzzy logic inference system.",
            "Software defined P2P architecture for reliable vehicular communications.",
            "Robust control in cloud assisted peer to peer live streaming systems.",
            "Outage and energy-efficiency analysis of cognitive radio networks: A stochastic approach to transmit antenna selection.",
            "Using big data analytics to extract disease surveillance information from point of care diagnostic machines.",
            "P2P-based resource allocation with coalitional game for D2D networks.",
            "Detecting breathing frequency and maintaining a proper running rhythm.",
            "Secure data-sharing using distributed environmental matching keys.",
            "Seamless IPv6 connectivity for two-wheelers."
        ]
    },
    {
        "name": "PMC",
        "year": "2016",
        "info": "2016: Volumes\n25,\n26,\n27,\n28,\n29,\n30,\n31,\n32,\n33",
        "count": 87,
        "papers": [
            "The rise of keyloggers on smartphones: A survey and insight into motion-based tap inference attacks.",
            "Finding a simple probability distribution for human mobile speed.",
            "Predicting the passenger demand on bus services for mobile users.",
            "SocialCRC: Enabling socially-consensual rendezvous coordination by mobile phones.",
            "An estimated method of urban concentration distribution for a mobile sensing system.",
            "MetaQ: A knowledge-driven framework for context-aware activity recognition combining SPARQL and OWL 2 activity patterns.",
            "A machine-learning based approach to privacy-aware information-sharing in mobile social networks.",
            "The immersive effect of adaptive architecture.",
            "Special issue introduction.",
            "User-optimized activity recognition for exergaming.",
            "Towards attention-aware adaptive notification on smart phones.",
            "Robust and ubiquitous smartphone-based lane detection.",
            "Type, Talk, or Swype: Characterizing and comparing energy consumption of mobile input modalities.",
            "Constella: Crowdsourced system setting recommendations for mobile devices.",
            "Mining hierarchical relations in building management variables.",
            "Recognizing composite daily activities from crowd-labelled social media data.",
            "Towards interfaces of mobile pedestrian navigation systems adapted to the user's orientation skills.",
            "A survey of values, technologies and contexts in pervasive healthcare.",
            "Remembering through lifelogging: A survey of human memory augmentation.",
            "Survey-based exploration of attitudes to participatory sensing tasks in location-based gaming communities.",
            "Game-theoretic model of asymmetrical multipath selection in pervasive computing environment.",
            "Precise execution offloading for applications with dynamic behavior in mobile cloud computing.",
            "Energy-efficient multisite offloading policy using Markov decision process for mobile cloud computing.",
            "An energy-efficient scheduling scheme for time-constrained tasks in local mobile clouds.",
            "Controlling the fluid factors of an environment by sensor and actuator networks.",
            "Level-based approach for minimum-transmission broadcast in duty-cycled wireless sensor networks.",
            "Exploring conflicts in rule-based sensor networks.",
            "Special Issue-Big Data for Healthcare.",
            "Synchronous Big Data analytics for personalized and remote physical therapy.",
            "Heart rate wavelet coherence analysis to investigate group entrainment.",
            "A cloud supported model for efficient community health awareness.",
            "Modeling patterns of activities using activity curves.",
            "Improving biomedical signal search results in big data case-based reasoning environments.",
            "Personalized healthcare cloud services for disease risk assessment and wellness management using social media.",
            "Special Issue on Security and Privacy in Mobile Clouds.",
            "Anonymizing mobility data using semantic cloaking.",
            "Secure bidirectional proxy re-encryption for cryptographic cloud storage.",
            "Cloud based data sharing with fine-grained proxy re-encryption.",
            "Efficient attribute-based data sharing in mobile clouds.",
            "Indoor localization with audible sound - Towards practical implementation.",
            "Soft computing-based localizations in wireless sensor networks.",
            "Analysis of stochastic coverage and connectivity in three-dimensional heterogeneous directional wireless sensor networks.",
            "Delay tolerant lazy release consistency for distributed shared memory in opportunistic networks.",
            "Battery-aware centralized schedulers for CPU-bound jobs in mobile Grids.",
            "Passive profiling of mobile engaging behaviours via user-end application performance assessment.",
            "Recovering from a lost digital wallet: A smart cards perspective extended abstract.",
            "Cryptographic techniques of strategic data splitting and secure information management.",
            "From the lab into the wild: Design and deployment methods for multi-modal tracking platforms.",
            "Multi-sensor data fusion methods for indoor localization under collinear ambiguity.",
            "Wi-Fi fingerprinting based on collaborative confidence level training.",
            "Enhancing WiFi-fingerprinting accuracy using RSS calibration in dual-band environments.",
            "Channel measurement-based access point selection in IEEE 802.11 WLANs.",
            "PeepList: Adapting ex-post interaction with pervasive display content using eye tracking.",
            "Segmenting human activities based on HMMs using smartphone inertial sensors.",
            "Smart-surface: Large scale textile pressure sensors arrays for activity recognition.",
            "Android vs. SEAndroid: An empirical assessment.",
            "Fine-grained appliance usage and energy monitoring through mobile and power-line sensing.",
            "Reliable transmissions in AWSNs by using O-BESPAR hybrid antenna.",
            "Power management techniques in smartphone-based mobility sensing systems: A survey.",
            "Cyclist-aware traffic lights through distributed smartphone sensing.",
            "Using accelerometer for counting and identifying swimming strokes.",
            "Classification of bipolar disorder episodes based on analysis of voice and motor activity of patients.",
            "An Adaptive Location Detection scheme for energy-efficiency of smartphones.",
            "A new asset tracking architecture integrating RFID, Bluetooth Low Energy tags and ad hoc smartphone applications.",
            "A crowdsourcing-based global indoor positioning and navigation system.",
            "Smart probabilistic fingerprinting for WiFi-based indoor positioning with mobile devices.",
            "A hierarchical RSS model for RF-based device-free localization.",
            "Easing the integration: A feasible indoor wayfinding system for cognitive impaired people.",
            "Automatic identification of relevant places from cellular network data.",
            "Mobile security and privacy: Advances, challenges and future research directions.",
            "DroidChain: A novel Android malware detection method based on behavior chains.",
            "An integrated static detection and analysis framework for android.",
            "Decoupling data-at-rest encryption and smartphone locking with wearable devices.",
            "This is my device! Why should I follow your rules? Employees' compliance with BYOD security policy.",
            "Android users in the wild: Their authentication and usage behavior.",
            "Android fine-grained permission control system with real-time expert recommendations.",
            "Mobile local search with noisy locations.",
            "A-PIE: An algorithm for preserving privacy, quality of information, and energy consumption in Participatory Sensing Systems.",
            "The role of wrist-mounted inertial sensors in detecting gait freeze episodes in Parkinson's disease.",
            "Wearable textile input device with multimodal sensing for eyes-free mobile interaction during daily activities.",
            "Detecting abnormal events on binary sensors in smart home environments.",
            "Differences in smartphone usage: Validating, evaluating, and predicting mobile user intimacy.",
            "On the regularity of human mobility.",
            "Mining human mobility patterns from social geo-tagged data.",
            "Triangle-based routing for mobile ad hoc networks.",
            "Social-aware data dissemination service in mobile social network with controlled overhead.",
            "ClariSense+: An enhanced traffic anomaly explanation service using social network feeds."
        ]
    },
    {
        "name": "PMC",
        "year": "2015",
        "info": "2015: Volumes\n16,\n17,\n18,\n19,\n20,\n21,\n22,\n23,\n24",
        "count": 109,
        "papers": [
            "Editorial.",
            "Multichannel assignment protocols in wireless sensor networks: A comprehensive survey.",
            "Securing DV-Hop localization against wormhole attacks in wireless sensor networks.",
            "On protecting end-to-end location privacy against local eavesdropper in Wireless Sensor Networks.",
            "Querying moving events in wireless sensor networks.",
            "Editorial.",
            "Efficient data collection in multimedia vehicular sensing platforms.",
            "Mobile multimedia streaming techniques: QoE and energy saving perspective.",
            "Scalable data dissemination in opportunistic networks through cognitive methods.",
            "Hotspot-entropy based data forwarding in opportunistic social networks.",
            "Editorial.",
            "User activity recognition for energy saving in smart homes.",
            "Averting the privacy risks of smart metering by local data preprocessing.",
            "Ear-Phone: A context-aware noise mapping using smart phones.",
            "Towards a position and orientation independent approach for pervasive observation of user direction with mobile phones.",
            "Collaborative Bluetooth-based location authentication on smart phones.",
            "RegionalSliding: Facilitating small target selection with marking menu for one-handed thumb use on touchscreen-based mobile devices.",
            "Performance analysis of a context aware cross layer scheme for fast handoff in IMS based integrated WiFi-WiMax networks.",
            "Self-orienting the cameras for maximizing the view-coverage ratio in camera sensor networks.",
            "User context-based data delivery in opportunistic smartphone networks.",
            "A collaborative approach to moving k-nearest neighbor queries in directed and dynamic road networks.",
            "10 years of Pervasive Computing A special issue of PMC in memory of Chatschik Bisdikian.",
            "Privacy protection in pervasive systems: State of the art and technical challenges.",
            "When sensing goes pervasive.",
            "A survey on engineering approaches for self-adaptive systems.",
            "Social context-aware middleware: A survey.",
            "Characterizing and modeling people movement from mobile phone sensing traces.",
            "Developing pervasive multi-agent systems with nature-inspired coordination.",
            "Special issue on Mobile and Pervasive Applications in Tourism.",
            "Adaptive landmark recommendations for travel planning: Personalizing and clustering landmarks using geo-tagged social media.",
            "Understanding tourist behavior using large-scale mobile sensing approach: A case study of mobile phone users in Japan.",
            "Efficient framework for mobile walkthrough application.",
            "Exploring real world points of interest: Design and evaluation of object-centric exploration techniques for augmented reality.",
            "Tourists responses to mobile augmented reality travel guides: The role of emotions on adoption behavior.",
            "The utility of Magic Lens interfaces on handheld devices for touristic map navigation.",
            "A resource allocation scheme for device-to-device communications using LTE-A uplink resources.",
            "Autonomous smartphone-based WiFi positioning system by using access points localization and crowdsourcing.",
            "Power-aware anomaly detection in smartphones: An analysis of on-platform versus externalized operation.",
            "Rule-based approaches for energy savings in an ambient intelligence environment.",
            "PlaceWalker: An energy-efficient place logging method that considers kinematics of normal human walking.",
            "A Bayesian approach for pervasive estimation of breaststroke velocity using a wearable IMU.",
            "KCAR: A knowledge-driven approach for concurrent activity recognition.",
            "Disorientation detection by mining GPS trajectories for cognitively-impaired elders.",
            "Automatically recognizing places of interest from unreliable GPS data using spatio-temporal density estimation and line intersections.",
            "DietCam: Multi-view regular shape food recognition with a camera phone.",
            "Spectrum efficient cross-layer adaptation of Raptor codes for video multicasting over mobile broadband networks.",
            "Embedded intelligence for fast QoS-based vertical handoff in heterogeneous wireless access networks.",
            "Performance improvement in ZigBee-based home networks with coexisting WLANs.",
            "A privacy mechanism for mobile-based urban traffic monitoring.",
            "A probabilistic kernel method for human mobility prediction with smartphones.",
            "Accurate smartphone indoor positioning using a WSN infrastructure and non-invasive audio for TDoA estimation.",
            "A middleware framework for application-aware and user-specific energy optimization in smart mobile devices.",
            "Fortune cookies and smartphones: Weakly unrelayable channels to counter relay attacks.",
            "Special issue on the Internet of things.",
            "LPDQ: A self-scheduled TDMA MAC protocol for one-hop dynamic low-power wireless networks.",
            "A standardized approach to deal with firewall and mobility policies in the IoT.",
            "A potential weakness in RFID-based Internet-of-things systems.",
            "A utility paradigm for IoT: The sensing Cloud.",
            "A resource oriented integration architecture for the Internet of Things: A business process perspective.",
            "Beyond the limit: A fast tag identification protocol for RFID systems.",
            "Multi-sensor data fusion methods for indoor activity recognition using temporal evidence theory.",
            "Deploying R&D sensors to monitor heterogeneous objects and accomplish temporal coverage.",
            "Proactive Highly Ambulatory Sensor Routing (PHASeR) protocol for mobile wireless sensor networks.",
            "Accelerometry-based recognition of the placement sites of a wearable sensor.",
            "EPA: An efficient and privacy-aware revocation mechanism for vehicular ad hoc networks.",
            "Modelling, analysis and performance improvement of an SRU's access request queue in multi-channel V2I communications.",
            "Editor's note on the Special Section on ICDCN 2014.",
            "Mobility aware scheduling for imbalance reduction through charging coordination of electric vehicles in smart grid.",
            "Community Aware Heterogeneous Human Mobility (CAHM): Model and analysis.",
            "Performance analysis of CR-honeynet to prevent jamming attack through stochastic modeling.",
            "Special issue on recent developments in Cognitive Radio Sensor Networks.",
            "Secure and reliable surveillance over cognitive radio sensor networks in smart grid.",
            "EMCOS: Energy-efficient Mechanism for Multimedia Streaming over Cognitive Radio Sensor Networks.",
            "Optimization of relay selection and ergodic capacity in cognitive radio sensor networks with wireless energy harvesting.",
            "Stochastic backlog and delay bounds of generic rate-based AIMD congestion control scheme in cognitive radio sensor networks.",
            "Robust privacy preservation and authenticity of the collected data in cognitive radio network - Walsh-Hadamard based steganographic approach.",
            "A quality of service distributed optimizer for Cognitive Radio Sensor Networks.",
            "Cognitive radio-based clustering for opportunistic shared spectrum access to enhance lifetime of wireless sensor network.",
            "Adaptive compressive sensing based sample scheduling mechanism for wireless sensor networks.",
            "A ferry-assisted solution for forwarding function in Wireless Sensor Networks.",
            "Semantic web technologies in pervasive computing: A survey and research roadmap.",
            "Monitoring elderly behavior via indoor position-based stigmergy.",
            "Indoor positioning via subarea fingerprinting and surface fitting with received signal strength.",
            "Determining the best vector distance measure for use in location fingerprinting.",
            "Asynchronous time difference of arrival (ATDOA) method.",
            "CSI-MIMO: An efficient Wi-Fi fingerprinting using Channel State Information with MIMO.",
            "OFDMA for wireless multihop networks: From theory to practice.",
            "A novel localization and coverage framework for real-time participatory urban monitoring.",
            "Methodological evaluation of architectural alternatives for an aeronautical delay tolerant network.",
            "MOEME: Real-time Mobility and Orientation Estimation for Mobile Environments.",
            "Secure ubiquitous computing.",
            "Feasibility and issues for establishing network-based carpooling scheme.",
            "The role of congestion in probabilistic broadcasting for ubiquitous wireless multi-hop networks through mediation analysis.",
            "Range-kNN queries with privacy protection in a mobile environment.",
            "Efficient provably secure password-based explicit authenticated key agreement.",
            "Modeling and verifying EPC network intrusion system based on timed automata.",
            "A survey on energy-aware security mechanisms.",
            "Efficient TVA metadata encoding for mobile and ubiquitous content services.",
            "Service-oriented mobile malware detection system based on mining strategies.",
            "Secure and reliable data communication in developing regions and rural areas.",
            "Secure multi-server-aided data deduplication in cloud computing.",
            "Personal information leakage detection method using the inference-based access control model on the Android platform.",
            "Utilizing a Bluetooth remote lock system for a smartphone.",
            "Augmented context-based recommendation service framework using knowledge over the Linked Open Data cloud.",
            "Modeling and checking for Cyber-Physical System based on hybrid interface automata.",
            "Secure and privacy-aware traffic information as a service in VANET-based clouds.",
            "Secure authentication scheme for IoT and cloud servers.",
            "Slide attack on standard stream cipher Enocoro-80 in the related-key chosen IV setting.",
            "Real-time and intelligent private data protection for the Android platform."
        ]
    },
    {
        "name": "PMC",
        "year": "2014",
        "info": "2014: Volumes\n10,\n11,\n12,\n13,\n14,\n15",
        "count": 96,
        "papers": [
            "Editorial.",
            "Smartphone sensing offloading for efficiently supporting social sensing applications.",
            "Secure interaction with piggybacked key-exchange.",
            "Sleep posture analysis using a dense pressure sensitive bedsheet.",
            "COMITY: A framework for adaptation coordination in multi-platform pervasive systems.",
            "Service-oriented middleware for large-scale mobile participatory sensing.",
            "Scheduling sensors for monitoring sentient spaces using an approximate POMDP policy.",
            "Tool support for detection and analysis of following and leadership behavior of pedestrians from mobile sensing data.",
            "Editorial.",
            "Dynamic context-aware personalisation in a pervasive environment.",
            "Activity recognition on streaming sensor data.",
            "Dynamic sensor data segmentation for real-time knowledge-driven activity recognition.",
            "Estimating and using absolute and relative viewing distance in interactive systems.",
            "Synergistic approaches to mobile intelligent transportation systems considering low penetration rate.",
            "Motivating the motivators: Lessons learned from the design and evaluation of a social persuasion system.",
            "Editorial.",
            "Dissemination of safety messages in IEEE 802.11p/WAVE vehicular network: Analytical study and protocol enhancements.",
            "SPoT: Representing the social, spatial, and temporal dimensions of human mobility with a unifying framework.",
            "Mitigating collisions through power-hopping to improve 802.11 performance.",
            "Linking wireless devices using information contained in Wi-Fi probe requests.",
            "Curve-based planar graph routing with guaranteed delivery in multihop wireless networks.",
            "Editorial.",
            "Leveraging Bluetooth co-location traces in group discovery algorithms.",
            "Exploiting user interest similarity and social links for micro-blog forwarding in mobile opportunistic networks.",
            "User generated content dissemination in mobile social networks through infrastructure supported content replication.",
            "CAMEO: A novel context-aware middleware for opportunistic mobile social networks.",
            "Inference management, trust and obfuscation principles for quality of information in emerging pervasive environments.",
            "Preserving quality of information by using semantic relationships.",
            "Quality-of-information-aware data collection for mobile sensor networks.",
            "Quality of information-aware mobile applications.",
            "Post-order based routing & transport protocol for wireless sensor networks.",
            "Using data mules to preserve source location privacy in Wireless Sensor Networks.",
            "Mining GPS data for mobility patterns: A survey.",
            "A semi-automatic end-user programming approach for smart space application development.",
            "Towards automatic conflict detection in home and building automation systems.",
            "An efficient and inexpensive method for activity recognition within a smart home based on load signatures of appliances.",
            "Where and what: Using smartphones to predict next locations and applications in daily life.",
            "Utility-based RAT selection optimization in heterogeneous wireless networks.",
            "VeSense: High-performance and energy-efficient vehicular sensing platform.",
            "A tree-based address configuration for a MANET.",
            "Guest Editor's comments for the Fast Track for MUCS 2011 and 2012.",
            "SimCon: A context simulator for supporting evaluation of smart building applications when faced with uncertainty.",
            "Creating human digital memories with the aid of pervasive mobile devices.",
            "Towards an adaptive mediation framework for Mobile Social Network in Proximity.",
            "Decision support for Web service adaptation.",
            "Segmenting Bayesian networks for intelligent information dissemination in collaborative, context-aware environments with Bayeslets.",
            "Adaptive and context-aware privacy preservation exploiting user interactions in smart environments.",
            "Keeping up with the jammers: Observe-and-adapt algorithms for studying mutually adaptive opponents.",
            "Parkinson's disease and essential tremor classification on mobile device.",
            "Pattern analysis in daily physical activity data for personal health management.",
            "Context-supported local crowd mapping via collaborative sensing with mobile phones.",
            "RRACE: Robust realtime algorithm for cadence estimation.",
            "DaaS: Cloud-based mobile Web service discovery.",
            "Adaptive content recommendation for mobile users: Ordering recommendations using a hierarchical context model with granularity.",
            "Predicting smartphone battery usage using cell tower ID monitoring.",
            "AWARE: Activity aware maintenance of communication structures for wireless sensor networks.",
            "An energy conservation indexing method for secure XML data broadcast in mobile wireless networks.",
            "Privacy preserving shortest path routing with an application to navigation.",
            "Utilizing correlated node mobility for efficient DTN routing.",
            "A light-weight trust-based QoS routing algorithm for ad hoc networks.",
            "Top K-leader election in mobile ad hoc networks.",
            "CURD: Controllable reactive jamming detection in underwater sensor networks.",
            "A pulse switching paradigm for ultra low power cellular sensor networks.",
            "Deployment of robust wireless sensor networks using gene regulatory networks: An isomorphism-based approach.",
            "Fault-tolerant design of wireless sensor networks with directional antennas.",
            "Dacksis: An efficient transport protocol with acknowledgment-assisted storage management for intermittently connected wireless sensor networks.",
            "Special issue on \"Pervasive Education\".",
            "A survey on pervasive education.",
            "To be or not to be in situ outdoors, and other implications for design and implementation, in geolocated mobile learning.",
            "Deploying learning designs across physical and web spaces: Making pervasive learning affordable for teachers.",
            "FreshUP - A pervasive educational game for freshmen.",
            "The impact of coupled games on the learning experience of learners at-risk: An empirical study.",
            "Special Issue on \"The Social Car: Socially-inspired Mechanisms for Future Mobility Services\".",
            "Towards privacy-driven design of a dynamic carpooling system.",
            "Investigating ride sharing opportunities through mobility data analysis.",
            "Volvo intelligent news: A context aware multi modal proactive recommender system for in-vehicle use.",
            "Dude, where's my avacar? A mixed-method examination of communication in the driving context.",
            "SocioTelematics: Harnessing social interaction-relationships in developing automotive applications.",
            "Three social car visions to improve driver behaviour.",
            "Special issue on information management in mobile applications.",
            "PS+Pre/Post: A novel structure and access mechanism for wireless XML stream supporting twig pattern queries.",
            "TIP-tree: A spatial index for traversing locations in context-aware mobile access to digital libraries.",
            "Indexing spatial data in cloud data managements.",
            "Practical access control management for distributed collaborative editors.",
            "SHERLOCK: Semantic management of Location-Based Services in wireless environments.",
            "Frequency and recency context for the management and retrieval of personal information on mobile devices.",
            "A hierarchical approach to resource awareness in DHTs for mobile data management.",
            "A PostgreSQL extension for continuous path and range queries in indoor mobile environments.",
            "Special issue on data mining in pervasive environments.",
            "A system for collecting activity annotations for home energy management.",
            "Understanding aspects of pilgrimage using social networks derived from smartphones.",
            "Behavior analysis of elderly using topic models.",
            "b-COELM: A fast, lightweight and accurate activity recognition model for mini-wearable devices.",
            "Discovery of activity composites using topic models: An analysis of unsupervised methods.",
            "An automatic data mining method to detect abnormal human behaviour using physical activity measurements.",
            "Using unlabeled data in a sparse-coding framework for human activity recognition."
        ]
    },
    {
        "name": "PMC",
        "year": "2013",
        "info": "Volume 9: 2013",
        "count": 66,
        "papers": [
            "Editorial.",
            "Application mobility in pervasive computing: A survey.",
            "Coordination problem in cognitive wireless mesh networks.",
            "CAMPUS: A middleware for automated context-aware adaptation decision making at run time.",
            "Managing context data for diverse operating spaces.",
            "Situation-based testing for pervasive computing environments.",
            "Formal verification of context and situation models in pervasive computing.",
            "Pervasive computing and communications for sustainability.",
            "Device characterization and cross-layer protocol design for RF energy harvesting sensors.",
            "Data interpolation for participatory sensing systems.",
            "RFID-enabled carbon offsetting and trading.",
            "The user side of sustainability: Modeling behavior and energy usage in the home.",
            "Middleware for pervasive computing: A survey.",
            "Special Section on mobile interaction with the real world.",
            "The mobile fitness coach: Towards individualized skill assessment using personalized mobile devices.",
            "Designing on-site: Facilitating participatory contextual architecture with mobile phones.",
            "Evaluating user preferences for video transfer methods from a mobile device to a TV screen.",
            "Exploring multi-user interactions with dynamic NFC-displays.",
            "Consumer value of camera-based mobile interaction with the real world.",
            "Architectural patterns for applications with external user interface elements.",
            "Mobile interactions with digital object memories.",
            "Bandwidth scavenging for device coexistence in pervasive computing systems.",
            "Reliable networks with unreliable sensors.",
            "GoDisco++: A gossip algorithm for information dissemination in multi-dimensional community networks.",
            "Editorial.",
            "PShare: Ensuring location privacy in non-trusted systems through multi-secret sharing.",
            "IncogniSense: An anonymity-preserving reputation framework for participatory sensing applications.",
            "Application and analysis of multidimensional negative surveys in participatory sensing applications.",
            "Enhancing the performance of indoor localization using multiple steady tags.",
            "Smartphone-based Wi-Fi tracking system exploiting the RSS peak to overcome the RSS variance problem.",
            "A framework for pedestrian comfort navigation using multi-modal environmental sensors.",
            "Mobile social networking middleware: A survey.",
            "Self-coexistence among interference-aware IEEE 802.22 networks with enhanced air-interface.",
            "Human-mobility enabled wireless networks for emergency communications during special events.",
            "Dynamic spectrum access and network selection in heterogeneous cognitive wireless networks.",
            "Evaluation of realtime people tracking for indoor environments using ubiquitous motion sensors and limited wireless network infrastructure.",
            "Classification and prediction of whereabouts patterns from the Reality Mining dataset.",
            "A convex optimization approach for clone detection in wireless sensor networks.",
            "Designing robust network topologies for wireless sensor networks in adversarial environments.",
            "The best keying protocol for sensor networks.",
            "Collaborative jamming and collaborative defense in cognitive radio networks.",
            "Epidemic theory and data survivability in unattended wireless sensor networks: Models and gaps.",
            "Trading privacy with incentives in mobile commerce: A game theoretic approach.",
            "In memory of Chatschik Bisdikian.",
            "Guest Editorial.",
            "Identifying and understanding urban sport areas using Nokia Sports Tracker.",
            "Combination of spatio-temporal correction methods using traffic survey data for reconstruction of people flow.",
            "Individuals among commuters: Building personalised transport information services from fare collection systems.",
            "Dwelling in the canyons: Dwelling detection in urban environments using GPS, Wi-Fi, and geolocation.",
            "Participatory noise mapping works! An evaluation of participatory sensing as an alternative to standard techniques for environmental monitoring.",
            "uSafe: A privacy-aware and participative mobile application for citizen safety in urban environments.",
            "Enabling real-time city sensing with kernel stream oracles and MapReduce.",
            "My neighbourhood: Studying perceptions of urban space and neighbourhood with moblogging.",
            "Digital urban ambience: Mediating context on mobile devices in a city.",
            "Special Issue on the Mobile Data Challenge.",
            "From big smartphone data to worldwide research: The Mobile Data Challenge.",
            "Feature engineering for semantic place prediction.",
            "Where to go from here? Mobility prediction from instantaneous information.",
            "Interdependence and predictability of human mobility and social interactions.",
            "Breaking the habit: Measuring and predicting departures from routine in individual human mobility.",
            "User demographics prediction based on mobile data.",
            "Generating storylines from sensor data.",
            "Visual analysis of social networks in space and time using smartphone logs.",
            "A visual exploration of mobile phone users, land cover, time, and space.",
            "Analysis of smartphone user mobility traces for opportunistic data collection in wireless sensor networks.",
            "Discovering periodic patterns of nodal encounters in mobile networks."
        ]
    },
    {
        "name": "PMC",
        "year": "2012",
        "info": "Volume 8: 2012",
        "count": 61,
        "papers": [
            "Editorial.",
            "Looking ahead in pervasive computing: Challenges and opportunities in the era of cyber-physical convergence.",
            "Pervasive computing at scale: Transforming the state of the art.",
            "Situation identification techniques in pervasive computing: A review.",
            "Special section on human activity recognition.",
            "Swimming performance and technique evaluation with wearable acceleration sensors.",
            "Disaggregated water sensing from a single, pressure-based sensor: An extended analysis of HydroSense using staged experiments.",
            "Detecting stereotypical motor movements in the classroom using accelerometry and pattern recognition algorithms.",
            "A hierarchical approach to real-time activity recognition in body sensor networks.",
            "Context-aware and quality-aware algorithms for efficient mobile object management.",
            "DietCam: Automatic dietary assessment with mobile camera phones.",
            "Editorial.",
            "RFID assisted vehicle positioning in VANETs.",
            "Delay-bounded data gathering in urban vehicular sensor networks.",
            "Peer-to-peer data structures for cooperative traffic information systems.",
            "Opportunistically assisted parking service discovery: Now it helps, now it does not.",
            "Efficient group communications in location aware mobile ad-hoc networks.",
            "Trajectory estimation algorithm for mobile nodes using encounter information and geographical information.",
            "Design and implementation of a self-guided indoor robot based on a two-tier localization architecture.",
            "Adaptive radio maps for pattern-matching localization via inter-beacon co-calibration.",
            "Analysis of WLAN's received signal strength indication for indoor location fingerprinting.",
            "Using snapshot query fidelity to adapt continuous query execution.",
            "Balancing behavioral privacy and information utility in sensory data flows.",
            "Market mechanisms for resource allocation in pervasive sensor applications.",
            "A survey of sensory data boundary estimation, covering and tracking techniques using collaborating sensors.",
            "Point-to-point voice over ad hoc networks: A survey.",
            "Virtual lifeline: Multimodal sensor data fusion for robust navigation in unknown environments.",
            "A location-based policy-specification language for mobile devices.",
            "Collaborative personal speaker identification: A generalized approach.",
            "Energy-efficient mobile target detection in Wireless Sensor Networks with random node deployment and partial coverage.",
            "Sensor9k : A testbed for designing and experimenting with WSN-based ambient intelligence applications.",
            "Context driven process selection and integration of mobile and pervasive systems.",
            "Special issue on \"Ambient Ecologies\".",
            "A Personal Smart Space approach to realising Ambient Ecologies.",
            "Emerging and adaptive fuzzy logic based behaviours in activity sphere centred ambient ecologies.",
            "A middleware to integrate robots, simple devices and everyday objects into an ambient ecology.",
            "Human-aware planning for robots embedded in ambient ecologies.",
            "Ubiquitous Agents for Ambient Ecologies.",
            "Grounding ecologies on multiple spaces.",
            "Egocentric interaction as a tool for designing ambient ecologies - The case of the easy ADL ecology.",
            "DoMAIns: Domain-based modeling for Ambient Intelligence.",
            "Special Section on Pervasive Networks for Future Internet.",
            "Balancing energy efficiency and throughput fairness in IEEE 802.11 WLANs.",
            "Analysis of power saving and its impact on web traffic in cellular networks with continuous connectivity.",
            "CoMP clustering and backhaul limitations in cooperative cellular mobile access networks.",
            "Push-and-track: Saving infrastructure bandwidth through opportunistic forwarding.",
            "Predicting missing contacts in mobile social networks.",
            "Centinela: A human activity recognition system based on acceleration and vital sign data.",
            "ActiSen: Activity-aware sensor network in smart environments.",
            "An adaptive epidemic information dissemination model for wireless sensor networks.",
            "The impact of sensor errors and building structures on particle filter-based inertial positioning.",
            "Understanding identity exposure in pervasive computing environments.",
            "A token based distributed algorithm for supporting mutual exclusion in opportunistic networks.",
            "Special Issue on Pervasive Healthcare.",
            "Implementation and evaluation of wearable reaction time tests.",
            "Recognizing whether sensors are on the same body.",
            "Assessing physical activity in the daily life of cystic fibrosis patients.",
            "ADR-SPLDA: Activity discovery and recognition by combining sequential patterns and latent Dirichlet allocation.",
            "Pervasive multimedia for autism intervention.",
            "A smartphone-based fall detection system.",
            "Mobile games and design requirements to increase teenagers' physical activity."
        ]
    },
    {
        "name": "PMC",
        "year": "2011",
        "info": "Volume 7: 2011",
        "count": 53,
        "papers": [
            "Indoor tracking for mission critical scenarios: A survey.",
            "AnonySense: A system for anonymous opportunistic sensing.",
            "Indoor location fingerprinting with heterogeneous clients.",
            "\"Don't trust anyone\": Privacy protection for location-based services.",
            "Measurement of TCP computational and communication energy cost in MANETs.",
            "Special Section on Self-organising Networks.",
            "Scheduling protocols for homogeneous and heterogeneous k-covered wireless sensor networks.",
            "An efficient routing protocol for connecting vehicular networks to the Internet.",
            "Bandwidth provisioning in infrastructure-based wireless networks employing directional antennas.",
            "Designing hierarchical sensor networks with mobile data collectors.",
            "K-directory community: Reliable service discovery in MANET.",
            "Special section on Mobile Opportunistic Networking.",
            "Connectivity in time-graphs.",
            "Impact of source counter on routing performance in resource constrained DTNs.",
            "Message ferries as generalized dominating sets in intermittently connected mobile networks.",
            "From encounters to plausible mobility.",
            "Vision-based user-centric light control for smart environments.",
            "E2MAC : An energy efficient MAC for RFID-enhanced wireless sensor networks.",
            "Motion- and location-based online human daily activity recognition.",
            "A multi-agent-based model for service-oriented interaction in a mobile grid computing environment.",
            "Knowledge-Driven Activity Recognition in Intelligent Environments.",
            "Recognizing multi-user activities using wearable sensors in a smart home.",
            "Rapid specification and automated generation of prompting systems to assist people with dementia.",
            "Leveraging human behavior models to predict paths in indoor environments.",
            "Activity knowledge transfer in smart environments.",
            "Cross-domain activity recognition via transfer learning.",
            "A top-level ontology for smart environments.",
            "OWL 2 modeling and reasoning with complex human activities.",
            "From wireless sensor networks towards cyber physical systems.",
            "Special Section on A World of Wireless, Mobile and Multimedia Networks.",
            "A metric and framework for measuring information utility in mission-oriented networks.",
            "Comparing simulation tools and experimental testbeds for wireless mesh networks.",
            "Backlogged queue based MAC frame aggregation.",
            "Peer-to-peer overlay topology control for mobile ad hoc networks.",
            "Least attained recent service for packet scheduling over access links.",
            "Intrusion-resilient integrity in data-centric unattended WSNs.",
            "SensorTrust: A resilient trust model for wireless sensing systems.",
            "Editorial on \"QoS and service provisioning for integrated wireless networks\".",
            "Service level agreements (SLAs) parameter negotiation between heterogeneous 4G wireless network operators.",
            "Cooperative strategies of wireless access technologies: A game-theoretic analysis.",
            "A QoS-based dynamic pricing approach for services provisioning in heterogeneous wireless access networks.",
            "Network selection in a WiMAX-WiFi environment.",
            "Out-of-order durable event processing in integrated wireless networks.",
            "A quality based routing protocol for wireless mesh networks.",
            "Engineering TCP transmission and retransmission mechanisms for wireless networks.",
            "Editorial.",
            "Social fMRI: Investigating and shaping social mechanisms in the real world.",
            "Recognizing interleaved and concurrent activities using qualitative and quantitative temporal relationships.",
            "Floating content for probabilistic information sharing.",
            "Jyotish: Constructive approach for context predictions of people movement from joint Wifi/Bluetooth trace.",
            "Model-driven engineering of planning and optimisation algorithms for pervasive computing environments.",
            "Motion fault detection and isolation in Body Sensor Networks.",
            "Accelerometer-based on-body sensor localization for health and medical monitoring applications."
        ]
    },
    {
        "name": "PMC",
        "year": "2010",
        "info": "Volume 6: 2010",
        "count": 47,
        "papers": [
            "SARA: A service architecture for resource aware ubiquitous environments.",
            "Supporting pervasive computing applications with active context fusion and semantic context delivery.",
            "Object relevance weight pattern mining for activity recognition and segmentation.",
            "Bubble-sensing: Binding sensing tasks to the physical world.",
            "Fast Track section on \"Mobile Ad Hoc and Sensor Networks\".",
            "On accurate and efficient statistical counting in sensor-based surveillance systems.",
            "A study of overheads and accuracy for efficient monitoring of wireless mesh networks.",
            "Connectivity monitoring in wireless sensor networks.",
            "Self-configurable border landmark selection in wireless networks: Algorithms and applications.",
            "Hydra: Efficient multicast routing in MANETs using sender-initiated multicast meshes.",
            "Introduction to the special issue on context modelling, reasoning and management.",
            "A survey of context modelling and reasoning techniques.",
            "Automatic feature selection for context recognition in mobile devices.",
            "Enhancing intelligence and dependability of a product line enabled pervasive middleware.",
            "Optimising context data dissemination and storage in distributed pervasive computing systems.",
            "Incremental awareness and compositionality: A design philosophy for context-aware pervasive systems.",
            "Towards the Model Driven Development of context-aware pervasive systems.",
            "Context modelling and a context-aware framework for pervasive service creation: A model-driven approach.",
            "A lightweight soft-state tracking framework for dense mobile ad hoc networks.",
            "Making infrastructure visible for nomadic work.",
            "Providing user context for mobile and social networking applications.",
            "Wearable sensor activity analysis using semi-Markov models with a grammar.",
            "Wearable indoor pedestrian dead reckoning system.",
            "A framework for utilizing qualitative spatial relations between networked embedded systems.",
            "A temporal RFID data model for querying physical objects.",
            "Introduction to the special issue on \"Human Behavior in Ubiquitous Environments: Modeling of Human Mobility Patterns\".",
            "Predicting mobility events on personal devices.",
            "The co-evolution of taxi drivers and their in-car navigation systems.",
            "Mobility profiler: A framework for discovering mobility profiles of cell phone users.",
            "Urban cycles and mobility patterns: Exploring and predicting trends in a bicycle-based public transport system.",
            "Utilization of user feedback in indoor positioning system.",
            "Detecting activities from body-worn accelerometers via instance-based algorithms.",
            "Human behavior in ubiquitous environments: Experience and interaction design.",
            "Priming, sense-making and help: Analysis of player behaviour in an immersive theatrical experience.",
            "P2P social networking for the rest of US.",
            "Context sharing in a 'real world' ubicomp deployment.",
            "Evaluation of a pervasive awareness system designed for busy parents.",
            "Affect-aware behaviour modelling and control inside an intelligent environment.",
            "Situvis: A sensor data analysis and abstraction tool for pervasive computing systems.",
            "Special Issue on Pervasive Computing and Communications (PerCom) 2010.",
            "Measuring mobile phone energy consumption for 802.11 wireless networking.",
            "ChunkStream: Interactive streaming of structured data.",
            "Map estimation using GPS-equipped mobile wireless nodes.",
            "FM radio for indoor localization with spontaneous recalibration.",
            "A system for destination and future route prediction based on trajectory mining.",
            "Scheduling and development support in the Scavenger cyber foraging system.",
            "Dynamic pricing incentive for participatory sensing."
        ]
    },
    {
        "name": "PMC",
        "year": "2009",
        "info": "Volume 5: 2009",
        "count": 52,
        "papers": [
            "Unicast routing protocols for vehicular ad hoc networks: A critical comparison and classification.",
            "A multi-layer experimental study of multimedia and QoS communication in wireless mesh networks.",
            "Gradient-based target localization in robotic sensor networks.",
            "REFiLL: A lightweight programmable middleware platform for cost effective RFID application development.",
            "Constructing special k-dominating sets using variations on the greedy algorithm.",
            "Energy saving strategies for cooperative cache replacement in mobile ad hoc networks.",
            "Adaptive state-based multi-radio multi-channel multi-path routing in Wireless Mesh Networks.",
            "rfid in pervasive computing: State-of-the-art and outlook.",
            "Introduction to the special issue on homeland and global security.",
            "JAID: An algorithm for data fusion and jamming avoidance on distributed sensor networks.",
            "Self-organization of unattended wireless acoustic sensor networks for ground target tracking.",
            "Target localization in camera wireless networks.",
            "Integration of sensing and computing in an intelligent decision support system for homeland security defense.",
            "SafeMesh: A wireless mesh network routing protocol for incident area communications.",
            "Preface.",
            "Context awareness in a handheld exercise agent.",
            "Evidential fusion of sensor data for activity recognition in smart homes.",
            "A user driven approach to develop a cognitive prosthetic to address the unmet needs of people with mild dementia.",
            "A wireless embedded tongue tactile biofeedback system for balance control.",
            "Ambient intelligence: Technologies, applications, and opportunities.",
            "Special section: ICDCN 2008.",
            "Dynamic address autoconfiguration in hybrid ad hoc networks.",
            "EEDTC: Energy-efficient dominating tree construction in multi-hop wireless networks.",
            "Improving the QoS for information discovery in autonomic wireless sensor networks.",
            "A framework for incremental construction of real global smart space applications.",
            "A data collection protocol for real-time sensor applications.",
            "MyAds: A system for adaptive pervasive advertisements.",
            "Extended EDCA for delay guarantees in wireless local area networks.",
            "Safe river water: A ubiquitous and collaborative water quality monitoring solution.",
            "REDFLAG: A Run-timE, Distributed, Flexible, Lightweight, And Generic fault detection service for data-driven wireless sensor applications.",
            "The use of pervasive sensing for behaviour profiling - a survey.",
            "Human-battery interaction on mobile phones.",
            "Mobile health monitoring for the elderly: Designing for diversity.",
            "An evaluation of stylus-based text entry methods on handheld devices studied in different user mobility states.",
            "Special section of selected papers from IEEE WoWMoM 2008.",
            "Bringing law and order to IEEE 802.11 networks - A case for DiscoSec.",
            "A cooperative approach for topology control in Wireless Sensor Networks.",
            "Improved sensor network lifetime with multiple mobile sinks.",
            "Making our environments intelligent.",
            "Ambient intelligence platform using multi-agent system and mobile ubiquitous hardware.",
            "Ontology-based modeling of dynamic ubiquitous computing applications as evolving activity spheres.",
            "Designing an extensible architecture for Personalized Ambient Information.",
            "Assessing everyday life behavioral rhythms for the older generation.",
            "Game-based e-retailing in GOLEM agent environments.",
            "Design of smart sensing components for volcano monitoring.",
            "Guest editorial: Special issue on pervasive computing and communications (PerCom) 2009.",
            "uWave: Accelerometer-based personalized gesture recognition and its applications.",
            "A dynamic platform for run-time adaptation.",
            "A hybrid approach for content-based publish/subscribe in vehicular networks.",
            "Unsupervised context detection using wireless signals.",
            "A comparative study of secure device pairing methods.",
            "TreeMAC: Localized TDMA MAC protocol for real-time high-data-rate sensor networks."
        ]
    },
    {
        "name": "PMC",
        "year": "2008",
        "info": "Volume 4: 2008",
        "count": 44,
        "papers": [
            "Editorial.",
            "Energy-efficient forwarding in wireless sensor networks.",
            "Multiple-access insights from bounds on sensor localization.",
            "P2P multicast for pervasive ad hoc networks.",
            "Protocols for mobility management in heterogeneous multi-hop wireless networks.",
            "QoS management middleware solutions for Bluetooth audio distribution.",
            "A fault tolerant mutual exclusion algorithm for mobile ad hoc networks.",
            "Automatic form filling on mobile devices.",
            "The ECORA framework: A hybrid architecture for context-oriented pervasive computing.",
            "Data-centric middleware for context-aware pervasive computing.",
            "Efficient data dissemination using locale covers.",
            "Editorial.",
            "Cognitive radio technology: From distributed spectrum coordination to adaptive network collaboration.",
            "Coverage and connectivity issues in wireless sensor networks: A survey.",
            "Cooperation among peers in an ad hoc network to support an energy efficient IM service.",
            "CoWSAMI: Interface-aware context gathering in ambient intelligence environments.",
            "Connectivity opportunity selection in heterogeneous wireless multi-hop networks.",
            "The sensor internet at work: Locating everyday items using mobile phones.",
            "Peer-it: Stick-on solutions for networks of things.",
            "Composing software services in the pervasive computing environment: Languages or APIs?",
            "Are our homes ready for services? A domotic infrastructure based on the Web service stack.",
            "High performance mobility without agent infrastructure for connection oriented service.",
            "Ring of Masters (ROM): A new ring structure for Bluetooth scatternets with dynamic routing and adaptive scheduling schemes.",
            "Distributed key management for dynamic groups in MANETs.",
            "Enabling opportunistic storage for mobile DTNs.",
            "Preface.",
            "Generating random graphs for the simulation of wireless ad hoc, actuator, sensor, and internet networks.",
            "A pragmatic analysis of user mobility patterns in macrocellular wireless networks.",
            "Exploiting users' social relations to forward data in opportunistic networks: The HiBOp solution.",
            "Secure data aggregation in wireless sensor networks: A watermark based authentication supportive approach.",
            "Dynamic filter merging and mergeability detection for publish/subscribe.",
            "Efficient profile aggregation and policy evaluation in a middleware for adaptive mobile applications.",
            "An application framework for mobile, context-aware trails.",
            "CASD: Management of a context-aware service directory.",
            "Performance evaluation of a mobile agent-based platform for ubiquitous service provision.",
            "Nearest neighbor queries with peer-to-peer data sharing in mobile environments.",
            "PerCom 2008 special issue.",
            "Structured decomposition of adaptive applications.",
            "A tamper-proof and lightweight authentication scheme.",
            "Shadow attacks on users' anonymity in pervasive computing environments.",
            "An effective location fingerprint model for wireless indoor localization.",
            "Data quality and query cost in pervasive sensing systems.",
            "SeeNSearch: A context directed search facilitator for home entertainment devices.",
            "A cross-layer framework for privacy enhancement in RFID systems."
        ]
    },
    {
        "name": "PMC",
        "year": "2007",
        "info": "Volume 3: 2007",
        "count": 33,
        "papers": [
            "Flexible and fast security solution for wireless LAN.",
            "Cryptographic key exchange based on locationing information.",
            "A three round authenticated group key agreement protocol for ad hoc networks.",
            "How smart are our environments? An updated look at the state of the art.",
            "Multi-modal emotive computing in a smart house environment.",
            "Recognition of emergent human behaviour in a smart home: A data mining approach.",
            "Intelligent association selection of embedded agents in intelligent inhabited environments.",
            "A location model for smart environments.",
            "Application of ultrasonic sensors in a smart environment.",
            "Robust location tracking using a dual layer particle filter.",
            "Analytical modeling and mitigation techniques for the energy hole problem in sensor networks.",
            "Adaptive application-driven WLAN power management.",
            "Task-driven automated component deployment for ambient intelligence environments.",
            "Power and accuracy trade-offs in sound-based context recognition systems.",
            "Middleware for pervasive computing.",
            "MundoCore: A light-weight infrastructure for pervasive computing.",
            "An effective offloading middleware for pervasive services on mobile devices.",
            "SensorWare: Programming sensor networks beyond code update and querying.",
            "An application adaptation layer for wireless sensor networks.",
            "Context-aware handoff middleware for transparent service continuity in wireless networks.",
            "MESHMdl event spaces - A coordination middleware for self-organizing applications in ad hoc networks.",
            "Buddy tracking - efficient proximity detection among mobile friends.",
            "OmniStore: Automating data management in a personal system comprising several portable devices.",
            "On improving the efficiency of truthful routing in MANETs with selfish nodes.",
            "A priori error estimates for wireless local area network positioning systems.",
            "Using electronic textiles to implement an acoustic beamforming array: A case study.",
            "Editorial PerCom 2007 special issue.",
            "BlueTorrent: Cooperative content sharing for Bluetooth users.",
            "Scenes: Abstracting interaction in immersive sensor networks.",
            "Securing distributed data storage and retrieval in sensor networks.",
            "Human-to-Human authorization for resource sharing in SHAD: Roles and protocols.",
            "GSM indoor localization.",
            "Methods and guidelines for the design and development of domestic ubiquitous computing applications."
        ]
    },
    {
        "name": "PMC",
        "year": "2006",
        "info": "Volume 2: 2006",
        "count": 22,
        "papers": [
            "Embedding expression: Pervasive computing architecture for art and entertainment.",
            "Developing context-aware pervasive computing applications: Models and approach.",
            "Selection and navigation of mobile sensor nodes using a sensor network.",
            "Power-aware data retrieval protocols for indexed broadcast parallel channels.",
            "Guest Editors' Note.",
            "Secured macro/micro-mobility protocol for multi-hop cellular IP.",
            "Security enforcement in wireless sensor networks: A framework based on non-cooperative games.",
            "Decorrelating wireless sensor network traffic to inhibit traffic analysis attacks.",
            "Scalable key management for secure multicast communication in the mobile environment.",
            "An energy efficient security protocol for IEEE 802.11 WLANs.",
            "Stronger interaction between link layer and network layer for an optimized mobility management in heterogeneous IPv6 networks.",
            "Two scalable location service protocols for wireless ad hoc networks.",
            "Design and implementation of two-tier MANETs with seamless roaming and load-balancing routing capability.",
            "Location Aided Mobile Peer-to-Peer system.",
            "Service discovery using volunteer nodes in heterogeneous pervasive computing environments.",
            "Exploiting information relationships for access control in pervasive computing.",
            "PerCom 2006 special issue.",
            "Context-aware resource management in multi-inhabitant smart homes: A framework based on Nash H.",
            "RFID malware: Design principles and examples.",
            "Avoiding privacy violations caused by context-sensitive services.",
            "Analysing fundamental properties of marker-based vision system designs.",
            "The Plan B OS for ubiquitous computing. Voice control, security, and terminals as case studies."
        ]
    },
    {
        "name": "PMC",
        "year": "2005",
        "info": "Volume 1: 2005",
        "count": 22,
        "papers": [
            "Spray computers: Explorations in self-organization.",
            "A specification model for context-based collaborative applications.",
            "Hourglass multimedia content and service composition framework for smart room environments.",
            "From battlefields to urban grids: New research challenges in ad hoc wireless networks.",
            "On communication models for algorithm design in networked sensor systems: A case study, .",
            "Secure context-sensitive authorization.",
            "Editorial.",
            "Guest editorial.",
            "Towards seamless mobility on pervasive hardware.",
            "A framework for building Bluetooth scatternets: A system design approach.",
            "Promoting cooperation among strangers to access Internet services from an ad hoc network.",
            "Understanding the real behavior of Mote and 802.11 ad hoc networks: an experimental approach.",
            "MediaBroker: A pervasive computing infrastructure for adaptive transformation and sharing of stream data.",
            "Editorial.",
            "REDMAN: An optimistic replication middleware for read-only resources in dense MANETs.",
            "Efficient implementations of all-to-all broadcasting in mobile ad hoc networks.",
            "Service discovery in mobile ad hoc networks: A field theoretic approach.",
            "Introduction to the special issue on PerCom 2005.",
            "Managing Adaptive Versatile environments.",
            "V3: A vehicle-to-vehicle live video streaming architecture.",
            "Sizzle: A standards-based end-to-end security architecture for the embedded Internet.",
            "Mobile data collection in sensor networks: The TinyLime."
        ]
    }
]