[
    {
        "name": "PUC",
        "year": "2022",
        "info": "Volume 26, 2022",
        "count": 35,
        "papers": [
            "Synergic deep learning model-based automated detection and classification of brain intracranial hemorrhage images in wearable networks.",
            "Improving network efficiency in wireless body area networks using dual forwarder selection technique.",
            "Diagnosis and combating COVID-19 using wearable Oura smart ring with deep learning methods.",
            "Correction to: Diagnosis and combating COVID-19 using wearable Oura smart ring with deep learning methods.",
            "Tangible interfaces in early years' education: a systematic review.",
            "Exploring digital support for the student transition to university through questionable concepts.",
            "Correction to: Exploring digital support for the student transition to university through questionable concepts.",
            "The Chatbot Usability Scale: the Design and Pilot of a Usability Scale for Interaction with AI-Based Conversational Agents.",
            "Collecting music in the streaming age.",
            "Optimal GTS distribution to heterogeneous sensors in IEEE 802.15.4 network for healthcare monitoring applications.",
            "The cardboard box study: understanding collaborative data management in the connected home.",
            "CAGAT: centrality-adjusted graph attention network for active scientific talent discovery.",
            "Assessing the cognitive load associated with ambient displays.",
            "New directions in knowledge-based personal computing.",
            "A study on Web service supporting mobility of users using ICT-based autonomous feedback knowledge information.",
            "CNN-based health model using knowledge mining of influencing factors.",
            "Construction of information search behavior based on data mining.",
            "Deep learning model for unstructured knowledge classification using structural features.",
            "Deep learning-based prediction model of occurrences of major adverse cardiac events during 1-year follow-up after hospital discharge in patients with AMI using knowledge mining.",
            "Design of containerized marine knowledge system based on IoT-Cloud and LoRaWAN.",
            "Correction to: Design of containerized marine knowledge system based on IoT-Cloud and LoRaWAN.",
            "Enhanced fault identification and optimal task prediction (EFIOTP) algorithm during multi-resource utilization in cloud-based knowledge and personal computing.",
            "Knowledge-based block chain networks for health log data management mobile service.",
            "Knowledge-based power monitoring and fault prediction system for smart factories.",
            "Knowledge-based single-tone digital filter implementation for DSP systems.",
            "Knowledge-based edge computing framework based on CoAP and HTTP for enabling heterogeneous connectivity.",
            "Lightweight knowledge-based authentication model for intelligent closed circuit television in mobile personal computing.",
            "MMCNet: deep learning-based multimodal classification model using dynamic knowledge.",
            "Modelling mobile-based technology adoption among people with dementia.",
            "Research of multi-object detection and tracking using machine learning based on knowledge for video surveillance system.",
            "The impacts of personal traits on knowledge discovery behaviors via mobile SNS.",
            "Unifying user preference and item knowledge-based similarity models for top-N recommendation.",
            "Urban traffic accident risk prediction for knowledge-based mobile multimedia service.",
            "A study on topic models using LDA and Word2Vec in travel route recommendation: focus on convergence travel and tours reviews.",
            "Factors enhancing independent tourists' experience through convergence of smartphone-based services and information searching."
        ]
    },
    {
        "name": "PUC",
        "year": "2021",
        "info": "Volume 25, 2021",
        "count": 80,
        "papers": [
            "Special issue on trends & advances to mine intelligence from ambient data.",
            "An open vibration and pressure platform for fall prevention with a reinforcement learning agent.",
            "Revealing the hidden features in traffic prediction via entity embedding.",
            "UAV-enabled intelligent traffic policing and emergency response handling system for the smart city.",
            "Estimating ambient visibility in the presence of fog: a deep convolutional neural network approach.",
            "Path complexity and bicyclist route choice set quality assessment.",
            "Triggers and connection-making for serendipity via user interface in recommender systems.",
            "Examining queue-jumping phenomenon in heterogeneous traffic stream at signalized intersection using UAV-based data.",
            "A location-based ubiquitous crowdsourcing approach for the emergency supply of oxygen cylinders.",
            "GAN-based imbalanced data intrusion detection system.",
            "A novel technique for automated concealed face detection in surveillance videos.",
            "Travelers' preferences regarding autonomous mobility in the State of Qatar.",
            "Smart home resident identification based on behavioral patterns using ambient sensors.",
            "Toward the improvement of traffic incident management systems using Car2X technologies.",
            "Performance evaluation of range-free localization algorithms for wireless sensor networks.",
            "Integrated agent-based microsimulation framework for examining impacts of mobility-oriented policies.",
            "Facilitating hikers' mobility in protected areas through smartphone app: a case of the Hoge Kempen National Park, Belgium.",
            "Estimation of travel time distributions for urban roads using GPS trajectories of vehicles: a case of Athens, Greece.",
            "MBS: Multilevel Blockchain System for IoT.",
            "Human computer-interaction in Latin America.",
            "The cost structure of influencers' posts: the risk of losing followers.",
            "Design and evaluation of a mobile smart home interactive system with elderly users in Brazil.",
            "Addressing Brazilian diversity in personal computing systems with a tailoring-based approach.",
            "Understanding how social media imagery empowers caregivers: an analysis of microcephaly in Latin America.",
            "Assisting older adults with medication reminders through an audio-based activity recognition system.",
            "Fighting disaster misinformation in Latin America: the #19S Mexican earthquake case study.",
            "Serious games for basic learning mechanisms: reinforcing Mexican children's gross motor skills and attention.",
            "Interactive sonification to assist children with autism during motor therapeutic interventions.",
            "An environment for motor skill transfer based on wearable haptic communication.",
            "Making visible the invisible: understanding the nuances of computer-supported cooperative work on informal elderly caregiving in Southern Cone families.",
            "Design and test of large-range wave height sensor based on water resistance measurement and fuzzy system.",
            "Point-cloud avatars to improve spatial communication in immersive collaborative virtual environments.",
            "A fuzzy model of wearable network real-time health monitoring system on pharmaceutical industry.",
            "Interaction of children with and without communication disorders using Montessori activities for the tablet.",
            "Designing for cultural learning and reflection using IoT serious game approach.",
            "Reconsidering the user in IoT: the subjectivity of things.",
            "Understanding usage style transformation during long-term smartwatch use.",
            "Proprioceptively displayed interfaces: aiding non-visual on-body input through active and passive touch.",
            "Dynamic resource allocation algorithm of virtual networks in edge computing networks.",
            "What investors say is what the market says: measuring China's real investor sentiment.",
            "Beyond self-reflection: introducing the concept of rumination in personal informatics.",
            "From AI, creativity and music to IoT, HCI, musical instrument design and audio interaction: a journey in sound.",
            "Correction to: from AI, creativity and music to IoT, HCI, musical instrument design and audio interaction: a journey in sound.",
            "Materialising contexts: virtual soundscapes for real-world exploration.",
            "Supervised machine learning for audio emotion recognition.",
            "CoHEARence of audible shapes - a qualitative user study for coherent visual audio design with resynthesized shapes.",
            "Analyzing journeys in sound: usability of graphical interpolators for sound design.",
            "EmoteControl: an interactive system for real-time control of emotional expression in music.",
            "Auditory augmented process monitoring for cyber physical production systems.",
            "Music & Soundscapes of our everyday lives: Music & Sound-making, meaning-making, and self-making.",
            "A proposal and evaluation of new timbre visualization methods for audio sample browsers.",
            "Sound design inducing attention in the context of audiovisual immersive environments.",
            "Touching the audience: musical haptic wearables for augmented and participatory live music performances.",
            "A new approach to creating and deploying audio description for live theater.",
            "Design and evaluation of a digitally active drum.",
            "Musical agency and an ecological perspective of DMIs: collective embodiment in third wave HCI.",
            "The current state of research on people, culture and cybersecurity.",
            "The importance of social identity on password formulations.",
            "From awareness to influence: toward a model for improving employees' security behaviour.",
            "The stray sheep of cyberspace a.k.a. the actors who claim they break the law for the greater good.",
            "Case-based learning in the management practice of information security: an innovative pedagogical instrument.",
            "I'm all ears! Listening to software developers on putting GDPR principles into software development practice.",
            "Understanding users' perceptions to improve fallback authentication.",
            "The role of self-efficacy on the adoption of information systems security innovations: a meta-analysis assessment.",
            "A framework and tool for the assessment of information security risk, the reduction of information security cost and the sustainability of information security culture.",
            "The social and cultural shaping of cybersecurity capacity building: a comparative study of nations and regions.",
            "Information, communication and computing technologies as enablers of advancements in modern information society.",
            "Event-based summarization method for scientific literature.",
            "The role of technology for accelerated motor learning in sport.",
            "Multi-object tracking by mutual supervision of CNN and particle filter.",
            "An active and dynamic credit reporting system for SMEs in China.",
            "Efficient continuous KNN join processing for real-time recommendation.",
            "A novel distributed Social Internet of Things service recommendation scheme based on LSH forest.",
            "Multi-scale visualization based on sketch interaction for massive surveillance video data.",
            "Cross-device task interaction framework between the smart watch and the smart phone.",
            "An action identification method based on FSM and limb dry weight.",
            "Utility analysis on privacy-preservation algorithms for online social networks: an empirical study.",
            "Learning behaviour recognition based on multi-object image in single viewpoint.",
            "Basic and personalized pattern-based workflow fragments discovery.",
            "Editorial Expression of Concern to various articles."
        ]
    },
    {
        "name": "PUC",
        "year": "2020",
        "info": "Volume 24, 2020",
        "count": 69,
        "papers": [
            "Special issue on pervasive and ubiquitous solutions for cultural enrichment.",
            "The construction of sports culture industry growth forecast model based on big data.",
            "Dynamic pricing analysis of redundant time of sports culture hall based on big data platform.",
            "An improved density-based single sliding clustering algorithm for large datasets in the cultural information system.",
            "Maximum-expectation integrated agglomerative nesting data mining model for cultural datasets.",
            "Cultural communication in double-layer coupling social network based on association rules in big data.",
            "Design of a sports culture data fusion system based on a data mining algorithm.",
            "Statistical analysis of tourist flow in tourist spots based on big data platform and DA-HKRVM algorithms.",
            "Database design of regional music characteristic culture resources based on improved neural network in data mining.",
            "Semantic change analysis of Korean verbs based on massive culture corpus data.",
            "Fast search of art culture resources based on big data and cuckoo algorithm.",
            "Analysis and data mining of intellectual property using GRNN and SVM.",
            "Study on the intelligent system of sports culture centers by combining machine learning with big data.",
            "Personalized recommendation of film and television culture based on an intelligent classification algorithm.",
            "Study on large-scale crowd evacuation method in cultural museum using mutation prediction RFID.",
            "Basketball culture event detection based on comprehensive integrated method.",
            "College public sports culture practice based on decision tree algorithm.",
            "Space-time distribution model of visitor flow in tourism culture construction via back propagation neural network model.",
            "Speech recognition in English cultural promotion via recurrent neural network.",
            "Research on music culture personalized recommendation based on factor decomposition machine.",
            "Multi-level word features based on CNN for fake news detection in cultural communication.",
            "Optimized integration of traditional folk culture based on DSOM-FCM.",
            "Logic detection method in network culture communication based on semantic relevance.",
            "Tourism culture and demand forecasting based on BP neural network mining algorithms.",
            "Exploration on Korean-Chinese collaborative translation method based on recursive recurrent neural network.",
            "Design on intelligence music system in the cultural center based on IoT.",
            "Intelligent library knowledge innovation service system based on multimedia technology.",
            "Improvement of culture media efficiency in Internet of Things based on global numerical ant colony algorithm.",
            "Soft trees with neural components as image-processing technique for archeological excavations.",
            "Application of unsupervised TSK fuzzy algorithm in large-scale online culture courses.",
            "Application analysis of AI reasoning engine in microblog culture industry.",
            "TouristGo: a location-based mobile game to improve tourist experience by visiting path optimisation.",
            "Student model construction of intelligent teaching system based on Bayesian network.",
            "An IoT data analytics approach for cultural heritage.",
            "Special issue on knowledge discovery and user modeling for smart cities.",
            "Dynamic route scheduler in vehicular ad hoc network for smart crowd control.",
            "Hierarchical syntactic models for human activity recognition through mobility traces.",
            "User consent modeling for ensuring transparency and compliance in smart cities.",
            "A survey on heterogeneous mobile networks planning in indoor dense areas.",
            "FloorSense: a novel crowdsourcing map construction algorithm based on conditional random field.",
            "A Stackelberg game theoretical approach for demand response in smart grid.",
            "A deep learning approach to automatic road surface monitoring and pothole detection.",
            "Utilizing digital traces of mobile phones for understanding social dynamics in urban areas.",
            "Anchor of trust: towards collusion-resistant trusted indoor location for enterprise and industrial use.",
            "Knowledge process of health big data using MapReduce-based associative mining.",
            "Discovery of knowledge of associative relations using opinion mining based on a health platform.",
            "Probing IoT-based consumer services: 'insights' from the connected shower.",
            "Smart home technology - comparing householder expectations at the point of installation with experiences 1 year later.",
            "More than step count: designing a workplace-based activity tracking system.",
            "SmartGrip: grip sensing system for commodity mobile devices through sound signals.",
            "Evaluating the user experience of acoustic data transmission.",
            "Life-swap: how discussions around personal data can motivate desire for change.",
            "A location history-aware recommender system for smart retail environments.",
            "Mood and personal information management: how we feel influences how we organize our information.",
            "LabelSens: enabling real-time sensor data labelling at the point of collection using an artificial intelligence-based approach.",
            "Correction to: Emotional computing based on cross-modal fusion and edge network data incentive.",
            "Everyday automation experience: a research agenda.",
            "Measuring commitment to self-tracking: development of the C2ST scale.",
            "Anticipatory experience in everyday autonomous driving.",
            "Designing everyday automation with well-being in mind.",
            "User-defined semantics for the design of IoT systems enabling smart interactive experiences.",
            "Suppose your bus broke down and nobody came.",
            "Special issue on virtual and mixed reality in culture and heritage.",
            "A hybrid augmented reality guide for underwater cultural heritage sites.",
            "Avatars as storytellers: affective narratives in virtual museums.",
            "Design methodology for 360° immersive video applications: the case study of a cultural heritage virtual tour.",
            "The effect of immersion towards place presence in virtual heritage environments.",
            "Enhancing cultural heritage outdoor experience with augmented-reality smart glasses.",
            "Culture 4 all: accessibility-enabled cultural experiences through immersive VR360 content."
        ]
    },
    {
        "name": "PUC",
        "year": "2019",
        "info": "Volume 23, 2019",
        "count": 74,
        "papers": [
            "Special issue on device-free sensing for human behavior recognition.",
            "DTransfer: extremely low cost localization irrelevant to targets and regions for activity recognition.",
            "Dynamic gesture recognition using wireless signals with less disturbance.",
            "Enabling non-invasive and real-time human-machine interactions based on wireless sensing and fog computing.",
            "Automated employee evaluation using fuzzy and neural network synergism through IoT assistance.",
            "Trip2Vec: a deep embedding approach for clustering and profiling taxi trip purposes.",
            "Alexa, are you listening to me? An analysis of Alexa voice service network traffic.",
            "The enriching limitations of the physical world.",
            "StretchyStars: a multitouch elastic display to support cooperative play among preschoolers.",
            "Developing hand-worn input and haptic support for real-world target finding.",
            "Critical incidents in everyday technology use: exploring digital breakdowns.",
            "Recognition of audible disruptive behavior from people with dementia.",
            "Energy-efficient prediction of smartphone unlocking.",
            "Mining social networks for local search and location-based recommender systems.",
            "LOOKER: a mobile, personalized recommender system in the tourism domain based on social media user-generated content.",
            "Point of interest recommendation based on social and linked open data.",
            "Exploiting semantics for context-aware itinerary recommendation.",
            "Twitter-based traffic delay detection based on topic propagation analysis using railway network topology.",
            "Recommender system for learning objects based in the fusion of social signals, interests, and preferences of learner users in ubiquitous e-learning systems.",
            "Making the city my own: uses and practices of mobile location technologies for exploration of a new city.",
            "Performance evaluation of raspberry Pi platform for bioimpedance analysis using least squares optimization.",
            "Breaching the future: understanding human challenges of autonomous systems for the home.",
            "Personal pollution monitoring: mobile real-time air quality in daily life.",
            "Designing and evaluating mobile self-reporting techniques: crowdsourcing for citizen science.",
            "Monitoring meaningful activities using small low-cost devices in a smart home.",
            "Editorial for the special issue on \"Research on methods of multimodal information fusion in emotion recognition\".",
            "Emotional computing based on cross-modal fusion and edge network data incentive.",
            "Hot news mining and public opinion guidance analysis based on sentiment computing in network social media.",
            "Multimodal emotion recognition algorithm based on edge network emotion element compensation and data fusion.",
            "Optimal path planning for two-wheeled self-balancing vehicle pendulum robot based on quantum-behaved particle swarm optimization algorithm.",
            "Network text sentiment analysis method combining LDA text representation and GRU-CNN.",
            "Multi-source heterogeneous data fusion based on perceptual semantics in narrow-band Internet of Things.",
            "A multiobjective evolutionary algorithm based on surrogate individual selection mechanism.",
            "Super node selection algorithm combining reputation and capability model in P2P streaming media network.",
            "An approach to eliminating end effects of EMD through mirror extension coupled with support vector machine method.",
            "A fuzzy control model based on BP neural network arithmetic for optimal control of smart city facilities.",
            "GPU-based parallel optimization for real-time scale-invariant feature transform in binocular visual registration.",
            "E-government recommendation algorithm based on probabilistic semantic cluster analysis in combination of improved collaborative filtering in big-data environment of government affairs.",
            "Gesture recognition algorithm based on image information fusion in virtual reality.",
            "Feature recognition of motor imaging EEG signals based on deep learning.",
            "Dynamic social privacy protection based on graph mode partition in complex social network.",
            "A novel speech emotion recognition algorithm based on wavelet kernel sparse classifier in stacked deep auto-encoder model.",
            "Facial expression recognition method based on deep convolutional neural network combined with improved LBP features.",
            "A security risk plan search assistant decision algorithm using deep neural network combined with two-stage similarity calculation.",
            "Unsupervised emotion recognition algorithm based on improved deep belief model in combination with probabilistic linear discriminant analysis.",
            "Fog computing perception mechanism based on throughput rate constraint in intelligent Internet of Things.",
            "Fault diagnosis of multi-state gas monitoring network based on fuzzy Bayesian net.",
            "Research on reliability of Internet of Things RFID based on improved random hash protocol and cooperative game in low-carbon supply chain environment.",
            "Data collection scheme with minimum cost and location of emotional recognition edge devices.",
            "A human pose estimation algorithm based on the integration of improved convolutional neural networks and multi-level graph structure constrained model.",
            "Regularized extreme learning machine-based intelligent adaptive control for uncertain nonlinear systems in networked control systems.",
            "Special issue on ambient systems, networks and technologies.",
            "Holonification model for a multilevel agent-based system - Application to road traffic.",
            "Estimating pro-environmental potential for the development of mobility-based informational intervention: a data-driven algorithm.",
            "A comprehensive reputation assessment framework for volunteered geographic information in crowdsensing applications.",
            "Network partitioning on time-dependent origin-destination electronic trace data.",
            "Future impacts of the reforestation policy on the atmospheric parameters in Ireland: a sensitivity study including heat discomfort impacts on humans and livestock.",
            "Optimal secret sharing for wireless information security in the era of Internet of Things.",
            "Investigating large curved interaction devices.",
            "Semantic enrichment of spatio-temporal trajectories for worker safety on construction sites.",
            "Geographic forwarding rules to reduce broadcast redundancy in mobile ad hoc wireless networks.",
            "Hybrid multicriteria fuzzy classification of network traffic patterns, anomalies, and protocols.",
            "ECASS: an encryption compression aggregation security scheme for secure data transmission in ambient assisted living systems.",
            "Fall detection system for elderly people using IoT and ensemble machine learning algorithm.",
            "AEA-FCP: an adaptive energy-aware fixed clustering protocol for data dissemination in wireless sensor networks.",
            "A systematic literature review of data governance and cloud data governance.",
            "Using phase shift fingerprints and inertial measurements in support of precise localization in urban areas.",
            "Affordance theory and e-books: evaluating the e-reading experience using netnography.",
            "Investigation of the impact of a wireless Fog Warning System with respect to road traffic on a highway.",
            "Enhanced LEACH protocol for increasing a lifetime of WSNs.",
            "A two-stage road traffic congestion prediction and resource dispatching toward a self-organizing traffic control system.",
            "Accurately forecasting temperatures in smart buildings using fewer sensors.",
            "Evaluation of a gamified e-learning platform to improve traffic safety among elementary school pupils in Belgium.",
            "Superposition modulation-based new structure of four-dimensional turbo code (4D-TC) using modified interleaver and its application in WiMAX & LTE systems."
        ]
    },
    {
        "name": "PUC",
        "year": "2018",
        "info": "Volume 22, 2018",
        "count": 96,
        "papers": [
            "Special issue: Advanced technology for smart home automation and entertainment.",
            "Electronic identity information hiding methods using a secret sharing scheme in multimedia-centric internet of things environment.",
            "Self-embedding fragile watermarking scheme to restoration of a tampered image using AMBTC.",
            "Resiliency of mobile OS security for secure personal ubiquitous computing.",
            "Study of detection method for spoofed IP against DDoS attacks.",
            "File changes with security proof stored in cloud service systems.",
            "Man-in-the-middle attacks on Secure Simple Pairing in Bluetooth standard V5.0 and its countermeasure.",
            "Correction to: Man-in-the-middle attacks on Secure Simple Pairing in Bluetooth standard V5.0 and its countermeasure.",
            "An efficient fingerprint identification algorithm based on minutiae and invariant moment.",
            "Efficient access control system based on aesthetic QR code.",
            "Palmprint recognition system on mobile devices with double-line-single-point assistance.",
            "Suboptimal LED selection for distributed MIMO visible light communications.",
            "A virtual uneven grid-based routing protocol for mobile sink-based WSNs in a smart home system.",
            "Hybrid computation offloading for smart home automation in mobile cloud computing.",
            "An efficient hybrid delivery technology for a broadcast TV service.",
            "fFTP: a fast file transfer protocol for home N-screen platform.",
            "Dynamically enabled defense effectiveness evaluation of a home Internet based on vulnerability analysis and attack layer measurement.",
            "Context-aware block-based motion estimation algorithm for multimedia internet of things (IoT) platform.",
            "Blocking-artifact detection in frequency domain for frame-rate up-conversion.",
            "Envisioned speech recognition using EEG sensors.",
            "Personal search system based on android using lifelog and machine learning.",
            "Mining intelligent solution to compensate missing data context of medical IoT devices.",
            "Wearable systems for e-health and wellbeing.",
            "Sleep behavior assessment via smartwatch and stigmergic receptive fields.",
            "Social recommendations for personalized fitness assistance.",
            "Robust orientation estimate via inertial guided visual sample consensus.",
            "SVM-based classification method to identify alcohol consumption using ECG and PPG monitoring.",
            "Special theme on privacy and the Internet of things.",
            "The practical politics of sharing personal data.",
            "Realising the right to data portability for the domestic Internet of things.",
            "Data provenance to audit compliance with privacy policy in the Internet of Things.",
            "Supporting users to take informed decisions on privacy settings of personal devices.",
            "Privacy preserving recognition of object-based activities using near-infrared reflective markers.",
            "Effects of robots' intonation and bodily appearance on robot-mediated communicative treatment outcomes for children with autism spectrum disorder.",
            "Gamification for development: a case of collaborative learning in Sri Lankan primary schools.",
            "SAViL: cross-display visual links for sensemaking in display ecologies.",
            "Activity trackers, prior motivation, and perceived informational and motivational affordances.",
            "Advancing researches on IoT systems and intelligent applications.",
            "Protecting query privacy with differentially private k-anonymity in location-based services.",
            "User social activity-based routing for cognitive radio networks.",
            "Smooth Gaze: a framework for recovering tasks across devices using eye tracking.",
            "Banded choropleth map.",
            "Wearing-independent hand gesture recognition method based on EMG armband.",
            "The design and empirical evaluations of 3D positioning techniques for pressure-based touch control on mobile devices.",
            "Smart sport equipment: SmartSki prototype for biofeedback applications in skiing.",
            "CRPD: a novel clustering routing protocol for dynamic wireless sensor networks.",
            "Dynamic cloud resource management for efficient media applications in mobile computing environments.",
            "A novel stock recommendation system using Guba sentiment analysis.",
            "Discrete PSO-based workload optimization in virtual machine placement.",
            "Accurate and energy-efficient boundary detection of continuous objects in duty-cycled wireless sensor networks.",
            "Effective cancer subtyping by employing density peaks clustering by using gene expression microarray.",
            "Personal information retrieval: smartphones vs. computers, emails vs. files.",
            "Towards accurate cursorless pointing: the effects of ocular dominance and handedness.",
            "A method to assess pervasive qualities in mobile games.",
            "Unobtrusive stress detection on the basis of smartphone usage data.",
            "Correction to: Unobtrusive stress detection on the basis of smartphone usage data.",
            "A life story in three parts: the use of triptychs to make sense of personal digital data.",
            "Exploring object-based content adaptation for mobile audio.",
            "Correction to: Exploring object-based content adaptation for mobile audio.",
            "Mood modeling: accuracy depends on active logging and reflection.",
            "Treasure codes: augmenting learning from physical museum exhibits through treasure hunting.",
            "SEQUENCE: a remote control technique to select objects by matching their rhythm.",
            "Sentiment analysis and Twitter: a game proposal.",
            "DeLight: biofeedback through ambient light for stress intervention and relaxation assistance.",
            "Uncover: supporting city exploration with egocentric visualizations of location-based content.",
            "Visual analysis of risks in peer-to-peer lending market.",
            "East meets west: a mobile brain-computer system that helps children living in poverty learn to self-regulate.",
            "Personalized stress monitoring: a smartphone-enabled system for quantification of salivary cortisol.",
            "Emerging trends, issues, and challenges in Internet of Medical Things and wireless networks.",
            "Design and development of microstrip patch antenna with circular and rectangular slot for structural health monitoring.",
            "Medical data fusion algorithm based on Internet of things.",
            "Research on geometric features and point cloud properties for tree skeleton extraction.",
            "A policy-oriented secured service for the e-commerce applications in cloud.",
            "Evidence-based personal applications of medical computing models in risk factors of cardiovascular disease for the middle-aged and elderly.",
            "Man-machine dialogue system optimization based on cloud computing.",
            "Optimization of QoS parameters using scheduling techniques in heterogeneous network.",
            "Node scheduling problem in underwater acoustic sensor network using genetic algorithm.",
            "Examining the variation of vascular structure in digital fundus images using textural pattern.",
            "A novel hybrid algorithm for feature selection.",
            "Decentralized low-order ADRC design for MIMO system with unknown order and relative degree.",
            "Photographer trajectory detection from images.",
            "Recurrent learning of context for salient region detection.",
            "Image spam filtering using convolutional neural networks.",
            "Predicting pathological response to neoadjuvant chemotherapy in breast cancer patients based on imbalanced clinical data.",
            "Efficiency-based multi-item bargaining design in cognitive radio networks with spectrum coordination.",
            "Efficiency optimization and simulation to manufacturing and service systems based on manufacturing technology Just-In-Time.",
            "On the security of MQ cryptographic systems for constructing secure Internet of medical things.",
            "Speech recognition with improved support vector machine using dual classifiers and cross fitness validation.",
            "Region-specific multi-attribute white mass estimation-based mammogram classification.",
            "A novel service deployment approach based on resilience metrics for service-oriented system.",
            "Deep learning over IoT big data-based ubiquitous parking guidance robot for parking near destination especially hospital.",
            "An improved nature inspired meta-heuristic algorithm for 1-D bin packing problems.",
            "The finite volume method for two-dimensional Burgers' equation.",
            "Paillier homomorphic cryptosystem with poker shuffling transformation based water marking method for the secured transmission of digital medical images.",
            "Solving dynamic normal distribution stochastic decision-making problems based on time degree and vertical projection distance.",
            "Swarm-based defense technique for tampering and cheating attack in WSN using CPHS."
        ]
    },
    {
        "name": "PUC",
        "year": "2017",
        "info": "Volume 21, 2017",
        "count": 87,
        "papers": [
            "Special issue on big data computing, analytics and applications.",
            "Redundancy reduction for indoor device-free localization.",
            "CondioSense: high-quality context-aware service for audio sensing system via active sonar.",
            "Participant selection for data collection through device-to-device communications in mobile sensing.",
            "Customized privacy preserving for inherent data and latent data.",
            "Big data challenges in ocean observation: a survey.",
            "The soil moisture sensor based on soil dielectric property.",
            "Counter-strike: accurate and robust identification of low-level radiation sources with crowd-sensing networks.",
            "Semantic trajectories-based social relationships discovery using WiFi monitors.",
            "SentiStory: multi-grained sentiment analysis and event summarization with crowdsourced social media data.",
            "Evaluation of missing value imputation methods for wireless soil datasets.",
            "Out of sight: a toolkit for tracking occluded human joint positions.",
            "Scenic route planning for tourists.",
            "Beyond \"yesterday's tomorrow\": future-focused mobile interaction design by and for emergent users.",
            "Look together: using gaze for assisting co-located collaborative search.",
            "Cultural heritage and new technologies: trends and challenges.",
            "Social recommendation service for cultural heritage.",
            "Experiencing touchless interaction with augmented content on wearable head-mounted displays in cultural heritage applications.",
            "Question matrix method according to divided dimensions of infographics evaluation.",
            "Using gamification to discover cultural heritage locations from geo-tagged photos.",
            "Innovative technologies for intangible cultural heritage education and preservation: the case of i-Treasures.",
            "Identifying and ranking cultural heritage resources on geotagged social media for smart cultural tourism services.",
            "Tangible data souvenirs as a bridge between a physical museum visit and online digital experience.",
            "Context-based infomobility system for cultural heritage recommendation: Tourist Assistant - TAIS.",
            "Visualizing museum visitors' behavior: Where do they go and what do they do there?",
            "Confucius computer: a philosophical digital agent for intergenerational philosophical play.",
            "Semantic infrastructure of a smart museum: toward making cultural heritage knowledge usable and creatable by visitors and professionals.",
            "Blended context-aware ubiquitous learning in museums: environment, navigation support and system development.",
            "A perspective on multi-user interaction design based on an understanding of domestic lighting conflicts.",
            "Cross-device media: a review of second screening and multi-device television.",
            "Ubiquitous Intelligence and computing for enabling a smarter world.",
            "Semantic segmentation of real-time sensor data stream for complex activity recognition.",
            "A novel orientation- and location-independent activity recognition method.",
            "Data fusion in automotive applications.",
            "Designing parallel data processing for enabling large-scale sensor applications.",
            "IoT-Lite: a lightweight semantic model for the internet of things and its use with dynamic semantics.",
            "GraphLoc: a graph-based method for indoor subarea localization with zero-configuration.",
            "Overcrowding detection in indoor events using scalable technologies.",
            "Comparison of detailed occupancy profile generative methods to published standard diversity profiles.",
            "On-demand energy monitoring and response architecture in a ubiquitous world.",
            "Theme issue on Histories of Ubicomp.",
            "The motivations of ubiquitous computing: revisiting the ideas behind and beyond the prototypes.",
            "Undisciplined disciples: everything you always wanted to know about ethnomethodology but were afraid to ask Yoda.",
            "Figuring ubicomp (out).",
            "Ubiquitous technologies for older people.",
            "Special issue on supporting a healthier lifestyle with e-coaching systems.",
            "E-coaching systems - What they are, and what they aren't.",
            "What technological features are used in smartphone apps that promote physical activity? A review and content analysis.",
            "Machine learning techniques in eating behavior e-coaching - Balancing between generalization and personalization.",
            "Talk and Tools: the best of both worlds in mobile user interfaces for E-coaching.",
            "A word of advice: how to tailor motivational text messages based on behavior change theory to personality and gender.",
            "An e-coaching ecosystem: design and effectiveness analysis of the engagement of remote coaching on athletes.",
            "Contributing or receiving-the role of social interaction styles in persuasion over a social networking platform.",
            "Personalised models for speech detection from body movements using transductive parameter transfer.",
            "Using thermal stimuli to influence affect in different picture display sizes.",
            "Environmental exposure assessment using indoor/outdoor detection on smartphones.",
            "Special issue on security and privacy for smart cities.",
            "Erratum to: Special issue on security and privacy for smart cities.",
            "A privacy-preserving degree-matching multi-attribute auction scheme in smart grid auction market.",
            "An efficient authentication and key agreement scheme with user anonymity for roaming service in smart city.",
            "Implementing RSA for sensor nodes in smart cities.",
            "Towards privacy protection and malicious behavior traceability in smart health.",
            "Utilizing fully homomorphic encryption to implement secure medical computation in smart cities.",
            "Anonymous identity-based broadcast encryption technology for smart city information system.",
            "Fully privacy-preserving and revocable ID-based broadcast encryption for data access control in smart city.",
            "Assessment of attribute-based credentials for privacy-preserving road traffic services in smart cities.",
            "Cost-effective privacy-preserving vehicular urban sensing system.",
            "Secure group information exchange scheme for vehicular ad hoc networks.",
            "Improved dynamic remote data auditing protocol for smart city security.",
            "Privacy-preserving identity-based file sharing in smart city.",
            "Proxy-assisted access control scheme of cloud data for smart cities.",
            "Secure public data auditing scheme for cloud storage in smart city.",
            "Virtual Environments and Advanced Interfaces.",
            "Integration scenarios of virtual worlds in learning management systems using the MULTIS approach.",
            "Experiencing sense of place in virtual and physical Avebury.",
            "User experience evaluation of human representation in collaborative virtual environments.",
            "Towards emotion recognition for virtual environments: an evaluation of eeg features on benchmark dataset.",
            "Versatile mixed reality medical educational spaces; requirement analysis from expert users.",
            "Long-life application - Situation detection in a context-aware all-in-one application.",
            "Practices and applications in ambient and intelligent information systems.",
            "Modeling value of time for trip chains using sigmoid utility.",
            "Introduction of car sharing into existing car fleets in microscopic travel demand modelling.",
            "Delay-aware power optimization model for mobile edge computing systems.",
            "From competitive sensor redundancy to competitive service redundancy in a Smart City context.",
            "Searching for the internet of things: where it is and what it looks like.",
            "Technical feasibility of context-aware passive payment authorization for physical points of sale.",
            "Detecting performance anomalies in large-scale software systems using entropy."
        ]
    },
    {
        "name": "PUC",
        "year": "2016",
        "info": "Volume 20, 2016",
        "count": 74,
        "papers": [
            "Facilitating peripheral interaction: design and evaluation of peripheral interaction for a gesture-based lighting control with multimodal feedback.",
            "Using mobile media creation to structure museum interpretation with professional vision.",
            "Assessing the value of brief automated biographies.",
            "Robotic experience companionship in music listening and video watching.",
            "Anonymous smartphone data collection: factors influencing the users' acceptance in mobile crowd sensing.",
            "LoCo: boosting for indoor location classification combining Wi-Fi and BLE.",
            "Design and evaluation of mood pictures in social music discovery service.",
            "Guided by music: pedestrian and cyclist navigation with route and beacon guidance.",
            "Touching the dematerialized.",
            "Dynamic adaptation of personal ubicomp environments.",
            "A model for learning objects adaptation in light of mobile and context-aware computing.",
            "Declarative GUI descriptions for device-independent applications.",
            "Model for adaptable context-based biometric authentication for mobile devices.",
            "A user-centric approach to dynamic adaptation of reusable communication services.",
            "A behavioral reflective architecture for managing the integration of personal ubicomp systems: automatic SNMP-based discovery and management of behavior context in smart-spaces.",
            "Interweaving place and story in a location-based audio drama.",
            "ExoPranayama: a biofeedback-driven actuated environment for supporting yoga breathing practices.",
            "Data intelligence on the Internet of Things.",
            "An efficient algorithm for partially matched services in internet of services.",
            "A survey on decision making for task migration in mobile cloud environments.",
            "Joint semantic similarity assessment with raw corpus and structured ontology for semantic-oriented service discovery.",
            "PicPick: a generic data selection framework for mobile crowd photography.",
            "RPR: recommendation for passengers by roads based on cloud computing and taxis traces data.",
            "TGM-COT: energy-efficient continuous object tracking scheme with two-layer grid model in wireless sensor networks.",
            "A laguerre neural network-based ADP learning scheme with its application to tracking control in the Internet of Things.",
            "A dynamic assignment scheduling algorithm for big data stream processing in mobile Internet services.",
            "Bitrate allocation among multiple video streams to maximize profit in content delivery networks.",
            "Comprehensive tempo-spatial data collection in crowd sensing using a heterogeneous sensing vehicle selection method.",
            "k-Multi-preference query over road networks.",
            "k-Nearest neighbors tracking in wireless sensor networks with coverage holes.",
            "Liveness detection for dorsal hand vein recognition.",
            "Online social trust reinforced personalized recommendation.",
            "The yoking-proof-based authentication protocol for cloud-assisted wearable devices.",
            "HCI at the boundary of work and life.",
            "Work or leisure? Designing a user-centered approach for researching activity \"in the wild\".",
            "Do-it-yourself services and work-like chores: on civic duties and digital public services.",
            "Rethinking technology on the boundaries of life and work.",
            "Exploring the relationship between impulsivity and decision-making on mobile devices.",
            "Searching for music: understanding the discovery, acquisition, processing and organization of music in a domestic setting for design.",
            "Bend Passwords: using gestures to authenticate on flexible devices.",
            "Designing calm technology and peripheral interaction for offshore service vessels.",
            "The design and evaluation of a photograph-sharing application for rural and urban Kenyan families.",
            "Shared mobile displays: an exploratory study of their use in a museum setting.",
            "New advances in data, information, and knowledge in the Internet of Things.",
            "Validation of smartphone gyroscopes for mobile biofeedback applications.",
            "Interference coordination based on random fractional spectrum reuse in femtocells toward Internet of Things.",
            "A two-time-scale load balancing framework for minimizing electricity bills of Internet Data Centers.",
            "A proportional fairness scheduling for wireless sensor networks.",
            "A novel contention-on-demand design for WiFi hotspots.",
            "Retrieving the maximal time-bounded positive influence set from social networks.",
            "Automatically constructing course dependence graph based on association semantic link model.",
            "Building text-based temporally linked event network for scientific big data analytics.",
            "Connected dominating set construction in cognitive radio networks.",
            "An energy-efficient source-anonymity protocol in surveillance systems.",
            "Adaptive fuzzy clustering by fast search and find of density peaks.",
            "QoS4IVSaaS: a QoS management framework for intelligent video surveillance as a service.",
            "Node localization algorithm for wireless sensor networks using compressive sensing theory.",
            "A framework for physiological indicators of flow in VR games: construction and preliminary evaluation.",
            "An energy efficient privacy-preserving content sharing scheme in mobile social networks.",
            "Internet of People and situated computing.",
            "Uplink access control for machine-type communications in LTE-A networks.",
            "AOM: adaptive mobile data traffic offloading for M2M networks.",
            "Android platform-based individual privacy information protection system.",
            "Predicting temporal centrality in Opportunistic Mobile Social Networks based on social behavior of people.",
            "Machine learning as a service for enabling Internet of Things and People.",
            "Personal video delivery with rapid Raptor code decoder.",
            "Analyzing of research patterns based on a temporal tracking and assessing model.",
            "Enabling the new economic actor: data protection, the digital economy, and the Databox.",
            "A smartphone-based system for detecting hand tremors in unconstrained environments.",
            "Lightful user interaction on smart wearables.",
            "SleepExplorer: a visualization tool to make sense of correlations between personal sleep data and contextual factors.",
            "PostBits: using contextual locations for embedding cloud information in the home.",
            "Stairstep recognition and counting in a serious Game for increasing users' physical activity.",
            "Towards cognitively grounded gaze-controlled interfaces."
        ]
    },
    {
        "name": "PUC",
        "year": "2015",
        "info": "Volume 19, 2015",
        "count": 99,
        "papers": [
            "Introduction to theme issue on technologies for patient-defined and patient-generated data.",
            "Observing health in everyday living: ODLs and the care-between-the-care.",
            "A standard-based model for the sharing of patient-generated health information with electronic health records.",
            "Sensor-based observations of daily living for aging in place.",
            "Challenges of integrating patient-centered data into clinical workflow for care of high-risk infants.",
            "Youth-centered design and usage results of the iN Touch mobile self-management program for overweight/obesity.",
            "Living Profiles: an example of user-centered design in developing a teen-oriented personal health record.",
            "What consumers want in personal health applications: findings from Project HealthDesign.",
            "Engaging patients while addressing their privacy concerns: the experience of Project HealthDesign.",
            "Developing a model for understanding patient collection of observations of daily living: a qualitative meta-synthesis of the Project HealthDesign program.",
            "Theme issue from ISWC 2013.",
            "A novel confidence-based multiclass boosting algorithm for mobile physical activity monitoring.",
            "3D ActionSLAM: wearable person tracking in multi-floor environments.",
            "Conductive rubber electrodes for earphone-based eye gesture input interface.",
            "FIDO - Facilitating interactions for dogs with occupations: wearable communication interfaces for working dogs.",
            "A location-sensitive visual interface on the palm: interacting with common objects in an augmented space.",
            "uSmell: exploring the potential for gas sensors to classify odors in ubicomp applications relative to airflow and distance.",
            "House rules: the collaborative nature of policy in domestic networks.",
            "Beyond the bar: the places where location-based services are used in the city.",
            "Evaluating children performance with graphical and tangible robot programming tools.",
            "Peripheral interaction: characteristics and considerations.",
            "Exploring the link between behaviour and health.",
            "Sensor-based Bayesian detection of anomalous living patterns in a home setting.",
            "Hierarchical activity recognition for dementia care using Markov Logic Network.",
            "Dynamic sensor event segmentation for real-time activity recognition in a smart home context.",
            "Daily life behaviour monitoring for health assessment using machine learning: bridging the gap between domains.",
            "LAB-IN-A-BOX: semi-automatic tracking of activity in the medical office.",
            "Mobile phones as medical devices in mental disorder treatment: an overview.",
            "Impact factor analysis: combining prediction with parameter ranking to reveal the impact of behavior on health outcome.",
            "Cell phone ownership and use among mental health outpatients in the USA.",
            "Behavioral data gathering for assessing functional status and health in older adults using mobile phones.",
            "Erratum to: Behavioral data gathering for assessing functional status and health in older adults using mobile phones.",
            "e-ESAS: Evolution of a participatory design-based solution for breast cancer (BC) patients in rural Bangladesh.",
            "Design of a motion-based gestural menu-selection interface for a self-portrait camera.",
            "EmoSnaps: a mobile application for emotion recall from facial expressions.",
            "Personal digital archives on mobile phones with MEO.",
            "Smart homes and their users: a systematic analysis and key challenges.",
            "Reviving community networks: hyperlocality and suprathresholding in Web 2.0 designs.",
            "Theme issue on mobile and pervasive games.",
            "Expanding social mobile games beyond the device screen.",
            "Head-mounted mixed reality projection display for games production and entertainment.",
            "Pervasive games field trials: recruitment of eligible participants through preliminary game phases.",
            "RouteMe: a multilevel pervasive game on mobile ad hoc routing.",
            "Touch-less interactive augmented reality game on vision-based wearable device.",
            "Aspects of ubiquitous computing for improved clinical practice.",
            "Information and communications technologies for elderly ubiquitous healthcare in a smart home.",
            "Patient responsibility reallocation: a user-centered approach to support nurses' handling of nurse calls.",
            "A development framework for mobile healthcare monitoring apps.",
            "Designing a reliable pain drawing tool: avoiding interaction flaws by better tailoring to patients' impairments.",
            "The role of ICT in addressing the challenges of age-related falls: a research agenda based on a systematic mapping of the literature.",
            "Real-time and location-based hand hygiene monitoring and notification: proof-of-concept system and experimentation.",
            "Alignment of an intra-operating management process to a health information system: a Lean analysis approach.",
            "Service innovation from the edges: enhanced by telemedicine decision support.",
            "Urban traffic analysis through multi-modal sensing.",
            "Mobile Imagery eXchange (MIX) toolkit: data sharing for the unconnected.",
            "Forward to the theme issue on interactive experiences for television and online video.",
            "A review of collocated multi-user TV - Examining the changing role of the TV in the multi-viewer, multi-screen home.",
            "Contextual aspects of typical viewing situations: a new perspective for recommending television and video content.",
            "Evaluating visual attention for multi-screen television: measures, toolkit, and experimental findings.",
            "A Web-based distributed architecture for multi-device adaptation in media applications.",
            "On free-hand TV control: experimental results on user-elicited gestures with Leap Motion.",
            "Understanding the behaviour of online TV users.",
            "Build me a Ubicomp: bespoke ubiquitous accessibility in live television production environments.",
            "Select & Apply: understanding how users act upon objects across devices.",
            "Applying geocaching principles to site-based citizen science and eliciting reactions via a technology probe.",
            "Safety services for children: a wearable sensor vest with wireless charging.",
            "When an eco-feedback system joins the family.",
            "Only play in your comfort zone: interaction methods for improving security awareness on mobile devices.",
            "Kinect cane: an assistive system for the visually impaired based on the concept of object recognition aid.",
            "Eye tracking for public displays in the wild.",
            "Erratum to: Developing technology for autism: an interdisciplinary approach.",
            "Theme issue on advances in the Internet of Things: identification, information, and knowledge.",
            "Wearable training system with real-time biofeedback and gesture user interface.",
            "Secure friend discovery based on encounter history in mobile social networks.",
            "The dissemination distance of mobile opportunistic networks.",
            "A new online anomaly learning and detection for large-scale service of Internet of Thing.",
            "Interference-controlled D2D routing aided by knowledge extraction at cellular infrastructure towards ubiquitous CPS.",
            "Noninvasive stress recognition considering the current activity.",
            "C2MP: Chebyshev chaotic map-based authentication protocol for RFID applications.",
            "Power consumption prediction of web services for energy-efficient service selection.",
            "A three-dimensional sub-region query processing mechanism in underwater WSNs.",
            "SShare: a simulator for studying and evaluating decentralized SPARQL query processing.",
            "A video cloud platform combing online and offline cloud computing technologies.",
            "Mobility-aware routing in delay tolerant networks.",
            "Chinese social media analysis for disease surveillance.",
            "Multi-objects scalable coordinated learning in internet of things.",
            "A novel verification method for payment card systems.",
            "IoT-enabled Web warehouse architecture: a secure approach.",
            "MeditAid: a wearable adaptive neurofeedback-based system for training mindfulness state.",
            "Understanding food consumption lifecycles using wearable cameras.",
            "Emotions in context: examining pervasive affective sensing systems, applications, and analyses.",
            "Erratum to: Emotions in context: examining pervasive affective sensing systems, applications, and analyses.",
            "Companion apps for information-rich television programmes: representation and interaction.",
            "Erratum to: Companion apps for information-rich television programmes: representation and interaction.",
            "Empirically derived user attributes for the design of home healthcare technologies.",
            "\"I've got a sheep with three legs if anybody wants it?\": re-visioning the rural economy.",
            "RFID interactive tabletop application with tangible objects: exploratory study to observe young children' behaviors.",
            "Fast and scalable 3D cyber-physical modeling for high-precision mobile augmented reality systems.",
            "Extending \"out of the body\" tactile phantom sensations to 2D and applying it to mobile interaction."
        ]
    },
    {
        "name": "PUC",
        "year": "2014",
        "info": "Volume 18, 2014",
        "count": 166,
        "papers": [
            "Assistive environments for the disabled and the senior citizens: theme issue of PETRA 2010 and 2011 conferences.",
            "Drug identification and interaction checker based on IoT to minimize adverse drug reactions and improve drug compliance.",
            "Non-invasive analysis of sleep patterns via multimodal sensor input.",
            "Self-taught learning via exponential family sparse coding for cost-effective patient thought record categorization.",
            "Non-manual cues in automatic sign language recognition.",
            "Using kernels for a video-based mouse-replacement interface.",
            "A k-anonymity privacy-preserving approach in wireless medical monitoring environments.",
            "An efficient privacy-preserving solution for finding the nearest doctor.",
            "E-EPR: a workflow-based electronic emergency patient record.",
            "Autoregressive energy-efficient context forwarding in wireless sensor networks for pervasive healthcare systems.",
            "Security and trust in context-aware applications.",
            "Incorporating behavioral trust theory into system development for ubiquitous applications.",
            "Crowdsourcing privacy preferences in context-aware applications.",
            "Efficient location aware intrusion detection to protect mobile devices.",
            "A classification of location privacy attacks and approaches.",
            "Efficient detection of counterfeit products in large-scale RFID systems using batch authentication protocols.",
            "ISWC 2012 best papers.",
            "Airwriting: a wearable handwriting recognition system.",
            "Activity recognition for creatures of habit - Energy-efficient embedded classification using prediction.",
            "A probabilistic approach to mining mobile phone data sequences.",
            "Exploring attractions and exhibits with interactive flashlights.",
            "Active video game head movement inputs.",
            "Guest Editorial: Theme issue on location and context-aware services.",
            "Effects of population size for location-aware node placement in WMNs: evaluation by a genetic algorithm-based approach.",
            "Hybrid indoor and outdoor location services for new generation mobile terminals.",
            "A connectivity index for moving objects in an indoor cellular space.",
            "A location-based personal task reminder for mobile users.",
            "Multimedia augmented reality information system for museum guidance.",
            "Mobile digcovery: discovering and interacting with the world through the Internet of things.",
            "A smart assistant toward product-awareness shopping.",
            "An introduction to the special issue on cross-community mining.",
            "Community Similarity Networks.",
            "Cross-domain community detection in heterogeneous social networks.",
            "Routing with multi-level cross-community social groups in mobile opportunistic networks.",
            "Understanding the locality effect in Twitter: measurement and analysis.",
            "SpinRadar: a spontaneous service provision middleware for place-aware social interactions.",
            "Cross-community context management in Cooperating Smart Spaces.",
            "The Internet of Things: connecting the world.",
            "Energy management in solar cells powered wireless sensor networks for quality of service optimization.",
            "Conception of ID layer performance at the network level for Internet of Things.",
            "Device-Independent Architecture for ubiquitous applications.",
            "Recent trends on mobile computing and future networks.",
            "IKEv2 authentication exchange model and performance analysis in mobile IPv6 networks.",
            "Driver acceptance of car navigation systems: integration of locational accuracy, processing speed, and service and display quality with technology acceptance model.",
            "Development of head detection and tracking systems for visual surveillance.",
            "Implementation of the personal healthcare services on automotive environments.",
            "Implementation of a cost-effective home lighting control system on embedded Linux with OpenWrt.",
            "Performance analysis of LTE downlink system using relay-based selective transmission.",
            "Relation model describing the effects of introducing RFID in the supply chain: evidence from the food and beverage industry in South Korea.",
            "Optimal collaboration of thin-thick clients and resource allocation in cloud computing.",
            "PUC theme issue: material interactions.",
            "Giving form to computational things: developing a practice of interaction design.",
            "Hybrid crafting: towards an integrated practice of crafting with physical and digital components.",
            "Crafting interaction: The epistemology of modern programming.",
            "Methodology for materiality: interaction design research through a material lens.",
            "Structures, forms, and stuff: the materiality and medium of interaction.",
            "Intangibles wear materiality via material composition.",
            "Broken probes: toward the design of worn media.",
            "Video interaction: a research agenda.",
            "Live mobile collaboration for video production: design, guidelines, and requirements.",
            "Context-dependent software solutions to handle video synchronization and delay in collaborative live mobile video production.",
            "Designing for video: investigating the contextual cues within viewing situations.",
            "Mobile video literacy: negotiating the use of a new visual technology.",
            "Crowds, citizens and sensors: process and practice for mobilising learning.",
            "Special issue on science fiction and ubiquitous computing.",
            "Futility and resistance.",
            "\"Resistance is futile\": reading science fiction alongside ubiquitous computing.",
            "\"A great and troubling beauty\": cognitive speculation and ubiquitous computing.",
            "The hitchhiker's guide to ubicomp: using techniques from literary and critical theory to reframe scientific agendas.",
            "Violence, death and robots: going to extremes with science fiction prototypes.",
            "Brain machines.",
            "User-centric ambient information systems and applications.",
            "Efficient and accurate sensor network localization.",
            "Innovative wearable interfaces: an exploratory analysis of paper-based interfaces with camera-glasses device unit.",
            "A context-aware cross-layer broadcast model for ad hoc networks.",
            "Context-aware hybrid reasoning framework for pervasive healthcare.",
            "Context-aware and automatic configuration of mobile devices in cloud-enabled ubiquitous computing.",
            "Building sustainable parking lots with the Web of Things.",
            "A personal meeting scheduling agent.",
            "Theme issue on identification, information, and knowledge in the Internet of Things.",
            "A truthful auction mechanism for channel allocation in multi-radio, multi-channel non-cooperative wireless networks.",
            "SPRITE: a novel strategy-proof multi-unit double auction scheme for spectrum allocation in ubiquitous communications.",
            "EGF-tree: an energy-efficient index tree for facilitating multi-region query aggregation in the internet of things.",
            "Characterizing home network traffic: an inside view.",
            "Enabling ubiquitous sensor-assisted applications on the internet-of-things.",
            "Square-root unscented Kalman filtering-based localization and tracking in the Internet of Things.",
            "Participative marketing: extending social media marketing through the identification and interaction capabilities from the Internet of things.",
            "From the private into the public: privacy-respecting mobile interaction techniques for sharing data on surfaces.",
            "Advances in context-aware mobile services.",
            "Online role mining for context-aware mobile service recommendation.",
            "Toward location-aware Web: extraction method, applications and evaluation.",
            "User-centric social context information management: an ontology-based approach and platform.",
            "Using a cloud-centric middleware to enable mobile hosting of Web services: mHealth use case.",
            "A pluggable middleware architecture for developing context-aware mobile applications.",
            "C3: an energy-efficient protocol for coverage, connectivity and communication in WSNs.",
            "Theme issue on designing collaborative interactive spaces.",
            "Blended Interaction: understanding natural human-computer interaction in post-WIMP interactive spaces.",
            "Trains of thought on the tabletop: visualizing association of ideas improves creativity.",
            "VisPorter: facilitating information sharing for collaborative sensemaking on multiple displays.",
            "Collaborative creativity: The Music Room.",
            "Real-time collaboration through web applications: an introduction to the Toolkit for Web-based Interactive Collaborative Environments (TWICE).",
            "Tangible displays for the masses: spatial interaction with handheld displays by using consumer depth cameras.",
            "AWE: an animated work environment for working with physical and digital tools and artifacts.",
            "Touch and gesture: mediating content display, inscriptions, and gestures across multiple devices.",
            "Pearl: living media enabled by interactive photo projection.",
            "Design challenges for ubiquitous and personal computing in chronic disease care and patient empowerment: a case study rethinking diabetes self-monitoring.",
            "Recent trends on convergence and ubiquitous computing.",
            "Robust vocabulary recognition clustering model using an average estimator least mean square filter in noisy environments.",
            "Investigation of the parallel efficiency of a PC cluster for the simulation of a CFD problem.",
            "Detection of ventricular fibrillation using Hilbert transforms, phase-space reconstruction, and time-domain analysis.",
            "Telemedicine health service using LTE-Advanced relay antenna.",
            "A study on algorithm to identify the abnormal status of a patient using acceleration algorithm.",
            "Coronary heart disease optimization system on adaptive-network-based fuzzy inference system and linear discriminant analysis (ANFIS-LDA).",
            "Discovery of automotive design paradigm using relevance feedback.",
            "Dangerous Wi-Fi access point: attacks to benign smartphone applications.",
            "Multiple categorizations of products: cognitive modeling of customers through social media data mining.",
            "A cross-layer approach for multiuser multiplexing on IP mobility.",
            "Extracting communication structure of a development organization from a software repository.",
            "The impact of policy measures on promoting the modal shift from road to rail.",
            "Theme issue on EIST.",
            "ScriptStorm: scripting to enhance tabletop brainstorming.",
            "Hidden in plain sight: low-literacy adults in a developed country overcoming social and educational challenges through mobile learning support tools.",
            "Designing smarter touch-based interfaces for educational contexts.",
            "Smart objects to support the discrimination training of children with autism.",
            "Learning dashboards: an overview and future research opportunities.",
            "Designing reality-based interfaces for experiential bio-design.",
            "Augmented reality in education: a meta-review and cross-media analysis.",
            "Understanding performative interactions in public settings.",
            "Ink: designing for performative literary interactions.",
            "The Malthusian Paradox: performance in an alternate reality game.",
            "Nightingallery: theatrical framing and orchestration in participatory performance.",
            "When noise becomes voice: designing interactive technology for crowd experiences through imitation and invention.",
            "From interaction to performance with public displays.",
            "Performative technologies for heritage site regeneration.",
            "Understanding the effects of contextual constraints on performative behaviour in interactive media installations.",
            "Social interaction and reflection for behaviour change.",
            "Categorizing users in behavior change support systems based on cognitive dissonance.",
            "Persuasive software design patterns for social influence.",
            "Deconstructing gamification: evaluating the effectiveness of continuous measurement, virtual rewards, and social comparison for promoting physical activity.",
            "Situated and mobile displays for reflection on shopping and nutritional choices.",
            "Reflection-through-performance: personal implications of documenting health behaviors for the collective.",
            "Classifying watermelon ripeness by analysing acoustic signals using mobile devices.",
            "Designing for reportability: sustainable gamification, public engagement, and promoting environmental debate.",
            "Understanding mass participatory pervasive computing systems for environmental campaigns.",
            "Advances on data, information, and knowledge in the internet of things.",
            "Strengthen nodal cooperation for data dissemination in mobile social networks.",
            "Self-Universum support vector machine.",
            "An extensible and active semantic model of information organizing for the Internet of Things.",
            "mDHT: a multi-level-indexed DHT algorithm to extra-large-scale data retrieval on HDFS/Hadoop architecture.",
            "A synergetic mechanism for digital library service in mobile and cloud computing environment.",
            "On improving aggregate recommendation diversity and novelty in folksonomy-based social systems.",
            "Toward inference attacks for k-anonymity.",
            "Session-based security enhancement of RFID systems for emerging open-loop applications.",
            "Secured access control for vehicles in RFID systems on roads.",
            "WTrack: HMM-based walk pattern recognition and indoor pedestrian tracking using phone inertial sensors.",
            "When smart grid meets PHEVs: a smart load distribution mechanism in smart grid.",
            "Performance monitoring and evaluation in dance teaching with mobile sensing technology.",
            "Directional communication with movement prediction in mobile wireless sensor networks.",
            "Research on the comprehensive traffic state evaluation model linked with drivers' perception under the vehicle networking.",
            "A utility maximization approach for information-communication tradeoff in Wireless Body Area Networks.",
            "Structural health monitoring by using a sparse coding-based deep learning algorithm with wireless sensor networks.",
            "Novel itinerary-based KNN query algorithm leveraging grid division routing in wireless sensor networks of skewness distribution.",
            "Managing obesity through mobile phone applications: a state-of-the-art review from a user-centred design perspective.",
            "Providing real-time assistance in disaster relief by leveraging crowdsourcing power.",
            "User interaction with everyday lighting systems.",
            "A robust device for large-scale monitoring of bar soap usage in free-living conditions."
        ]
    },
    {
        "name": "PUC",
        "year": "2013",
        "info": "Volume 17, 2013",
        "count": 161,
        "papers": [
            "Trends in measuring human behavior and interaction.",
            "An evaluation tool for research of user behavior in a realistic mobile environment.",
            "This is not classified: everyday information seeking and encountering in smart urban spaces.",
            "Measurement of toothbrushing behaviour in a natural environment.",
            "On operator effectiveness: the role of expertise and familiarity of environment on the detection of deviant behaviour.",
            "Measuring instant emotions based on facial expressions during computer-based assessment.",
            "Ubiquitous emotion-aware computing.",
            "How natural is a natural interface? An evaluation procedure based on action breakdowns.",
            "Measuring and adapting behavior during product interaction to influence affect.",
            "Establishing aesthetics based on human graph reading behavior: two eye tracking studies.",
            "Designing motivation using persuasive ambient mirrors.",
            "Design and evaluation of a smart home voice interface for the elderly: acceptability and objection aspects.",
            "Interaction design for supporting communication between Chinese sojourners.",
            "A novel concept of a wearable information appliance using context-based human-computer interaction.",
            "A near field communication-driven home automation framework.",
            "An empirical examination of the determinants of mobile purchase.",
            "A performance analysis of a wireless body-area network monitoring system for professional cycling.",
            "Mental health and the impact of ubiquitous technologies.",
            "Cross-validation of bimodal health-related stress assessment.",
            "Monitoring of mental workload levels during an everyday life office-work scenario.",
            "A mobile data collection platform for mental health research.",
            "Virtual reality and mobile phones in the treatment of generalized anxiety disorders: a phase-2 clinical trial.",
            "Towards long term monitoring of electrodermal activity in daily life.",
            "Facilitating parent-teenager communication through interactive photo cubes.",
            "Expected user experience of mobile augmented reality services: a user study in the context of shopping centres.",
            "Usability study of ME2.0 - User interface design for mobile context enhanced personalisation software.",
            "An internet of old things as an augmented memory system.",
            "Creating scalable location-based games: lessons from Geocaching.",
            "A kinect-based vocational task prompting system for individuals with cognitive impairments.",
            "Smartphone-based pedestrian tracking in indoor corridor environments.",
            "On the effectiveness of Overview+Detail visualization on mobile devices.",
            "Wireless outdoor personal area network using adaptive inquiry scanning for location-based services.",
            "Usability of one-handed interaction methods for handheld projection-based augmented reality.",
            "Note from the editors of the special issue of the best paper nominees from the 2011 International Symposium on Wearable Computers.",
            "Human interaction discovery in smartphone proximity networks.",
            "Mining large-scale smartphone data for personality studies.",
            "Training data selection with user's physical characteristics data for acceleration-based activity modeling.",
            "Discipline-based instruction to promote interdisciplinary design of wearable and pervasive computing products.",
            "Unsupervised adaptation for acceleration-based activity recognition: robustness to sensor displacement and rotation.",
            "Contextual usage patterns in smartphone communication services.",
            "When privacy and utility are in harmony: towards better design of presence technologies.",
            "Traffic flow harmonization in expressway merging.",
            "Telehealth and ubiquitous computing for bandwidth-constrained rural and remote areas.",
            "Segmenting sensor data for activity monitoring in smart environments.",
            "Collecting health-related data on the smart phone: mental models, cost of collection, and perceived benefit of feedback.",
            "IMAF: in situ indoor modeling and annotation framework on mobile phones.",
            "The use of attention resources in navigation versus search.",
            "iCROSS: toward a scalable infrastructure for cross-domain context management.",
            "Theme issue on electronic memories and life logging.",
            "Urban area characterization based on crowd behavioral lifelogs over Twitter.",
            "UbiqLog: a generic mobile phone-based life-log framework.",
            "Evaluating experience sampling of stress in a single-subject research design.",
            "Re-identification of Smart Meter data.",
            "Unconscious emotions: quantifying and logging something we are not aware of.",
            "Activity logging using lightweight classification techniques in mobile devices.",
            "A comparative study of location-sharing privacy preferences in the United States and China.",
            "PASU: A personal area situation understanding system using wireless camera sensor networks.",
            "Rediscovery of forgotten images in domestic photo collections.",
            "Understanding the effect of flow on user adoption of mobile games.",
            "To the Castle! A comparison of two audio guides to enable public discovery of historical events.",
            "On the human ability to discriminate audio ambiances from similar locations of an urban environment.",
            "Exercise repetition detection for resistance training based on smartphones.",
            "Configuring and controlling ubiquitous computing infrastructure with semantic connections: a tangible and an AR approach.",
            "Automotive user interfaces and interactive applications in the car.",
            "On credibility improvements for automotive navigation systems.",
            "Browsing the information highway while driving: three in-vehicle touch screen scrolling methods and driver distraction.",
            "Interactions between human-human multi-threaded dialogues and driving.",
            "Advanced security technologies and applications for ubiquitous computing.",
            "An ID-based online/offline signature scheme without random oracles for wireless sensor networks.",
            "Aspect ratio invariant visual cryptography by image filtering and resizing.",
            "An algorithm on fairness verification of mobile sink routing in wireless sensor network.",
            "A collaborative routing protocol against routing disruptions in MANETs.",
            "Reference-based importance assessment model of identity information.",
            "Protecting the sink location privacy in wireless sensor networks.",
            "On the security and improvement of a two-factor user authentication scheme in wireless sensor networks.",
            "A novel intrusion detection framework for wireless sensor networks.",
            "Compact and unified hardware architecture for SHA-1 and SHA-256 of trusted mobile computing.",
            "Go anywhere: user-verifiable authentication over distance-free channel for mobile devices.",
            "A novel secure key paring protocol for RF4CE ubiquitous smart home systems.",
            "Top-k entities query processing on uncertainly fused multi-sensory data.",
            "The burden of proof and the optimal security investment of firms in ubiquitous computing.",
            "New developments in pervasive and ambient information systems.",
            "A pure peer-to-peer approach for kNN query processing in mobile ad hoc networks.",
            "Enhancing biometric recognition with spatio-temporal reasoning in smart environments.",
            "Wireless sensor networks and human comfort index.",
            "Trust-based authentication scheme with user rating for low-resource devices in smart environments.",
            "Towards augmenting federated wireless sensor networks in forestry applications.",
            "A content search system considering the activity and context of a mobile user.",
            "SN-SEC: a secure wireless sensor platform with hardware cryptographic primitives.",
            "Special theme: ambient assisted living for mobility: safety, well-being and inclusion.",
            "Introducing the use of depth data for fall detection.",
            "Elderly frailty detection by using accelerometer-enabled smartphones and clinical information records.",
            "Activity recognition with hand-worn magnetic sensors.",
            "RFID breadcrumbs for enhanced care data management and dissemination.",
            "Augmented reality annotations to assist persons with Alzheimers and their caregivers.",
            "Adaptive manuals as assistive technology to support and train people with acquired brain injury in their daily life activities.",
            "CAMMInA: a mobile ambient information system to motivate elders to exercise.",
            "UCSA: a design framework for usable cognitive systems for the worried-well.",
            "Ubiquitous monitoring and assessment of childhood obesity.",
            "Self-configuring agents for ambient assisted living applications.",
            "Theme issue on persuasion, influence, nudge, or coercion (PINC).",
            "Adaptive persuasive messaging to increase service retention: using persuasion profiles to increase the effectiveness of email reminders.",
            "Persuasive strategies in mobile insomnia therapy: alignment, adaptation, and motivational support.",
            "Designing beyond habit: opening space for improved recycling and food waste behaviors through processes of persuasion, social influence and aversive affect.",
            "LunchTime: a slow-casual game for long-term dietary behavior change.",
            "A foundation for the study of behavior change support systems.",
            "Toward a persuasive mobile application to reduce sedentary behavior.",
            "Decision-making in the aisles: informing, overwhelming or nudging supermarket shoppers?",
            "A toolbox for managing organisational issues in the early stage of the development of a ubiquitous computing application.",
            "Future home design: an emotional communication channel approach to smart space.",
            "Exploring the impact of trust information visualization on mobile application usage.",
            "Theme issues on U-Business service and strategy, and U-Healthcare.",
            "A sensitive data aggregation scheme for body sensor networks based on data hiding.",
            "Semantic and structural similarities between XML Schemas for integration of ubiquitous healthcare data.",
            "A method of identifying chronic stress by EEG.",
            "Efficient techniques on retrieving bio-information for active U-healthcare.",
            "Sleeping situation monitoring system in ubiquitous environments.",
            "Effects of wheelchair-based rehabilitation on the physical functions and health perception of stroke patients.",
            "Encoder design for healthcare signals.",
            "Generating knowledge for the identification of device failure causes and the prediction of the times-to-failure in u-Healthcare environments.",
            "The relationship between healthcare information system and cost in hospital.",
            "Range image denoising using a constrained local Gaussian model for 3D object query service in the smart space.",
            "Generation of RFID test datasets using RSN tool.",
            "Low level light therapy by Red-Green-Blue LEDs improves healing in an excision model of Sprague-Dawley rats.",
            "On the security of the block cipher GOST suitable for the protection in U-business services.",
            "User privacy and modern mobile services: are they on the same path?",
            "Research on life-cycle of user model in U-Business.",
            "A u-IT collaboration evaluation model for value networks.",
            "A study on the promotion of the business service for regional retail store using smart technology.",
            "Taxonomy of ubiquitous computing service for city development.",
            "Interaction and visualization of 3D virtual environments on mobile devices.",
            "A scalable architecture for 3D map navigation on mobile devices.",
            "Interactive visualization of medical volume models in mobile devices.",
            "Mobile augmented reality for environmental monitoring.",
            "Smart Vidente: advances in mobile augmented reality for interactive visualization of underground infrastructure.",
            "Dual-Finger 3D Interaction Techniques for mobile devices.",
            "Special issue on child computer interaction.",
            "Bringing tabletop technology to all: evaluating a tangible farm game with kindergarten and special needs children.",
            "Find it if you can: usability case study of search engines for young users.",
            "Design requirements, student perception indicators and validation metrics for intelligent exploratory learning environments.",
            "Understanding children's behavior in an asynchronous video-mediated communication environment.",
            "Using machine learning to support pedagogy in the arts.",
            "In-game assessment and training of nonverbal cognitive skills using TagTiles.",
            "Child-centered game development (CCGD): developing games with children at school.",
            "Evaluating interfaces with children.",
            "Agent societies and social networks for ubiquitous computing.",
            "Recommendation of optimized information seeking process based on the similarity of user access behavior patterns.",
            "ALCA: agent learning-based clustering algorithm in vehicular ad hoc networks.",
            "Genetic algorithm for effective open port selection for a web filter.",
            "RFID-based indoor location tracking to ensure the safety of the elderly in smart home environments.",
            "Evaluation of messaging middleware for high-performance cloud computing.",
            "Semi-automatic construction of domain ontology for agent reasoning.",
            "Modeling user-generated contents: an intelligent state machine for user-centric search support.",
            "Semantic Web service discovery: state-of-the-art and research challenges.",
            "Social relation-based dynamic team organization by context-aware matchmaking.",
            "Efficient journaling writeback schemes for reliable and high-performance storage systems.",
            "Tangible versus graphical user interfaces for robot programming: exploring cross-age children's preferences.",
            "A personal perspective on photowork: implicit human-computer interaction for photo collection management.",
            "Intuitive substitute interface.",
            "Towards proximity-based passenger sensing on public transport buses.",
            "Personalized multi-modality image management and search for mobile devices."
        ]
    },
    {
        "name": "PUC",
        "year": "2012",
        "info": "Volume 16, 2012",
        "count": 85,
        "papers": [
            "Theme issue on personal projection.",
            "A pre-history of handheld projector-based interaction.",
            "Augmented reality using personal projection and retroreflection.",
            "Steerable projection: exploring alignment in interactive mobile displays.",
            "Pico-ing into the future of mobile projection and contexts.",
            "Projector phone use: practices and social implications.",
            "The projector as instrument.",
            "Usability classification for spontaneous device association.",
            "Discovering frequent user-environment interactions in intelligent environments.",
            "Habits make smartphone use more pervasive.",
            "Theme issue on autism and technology.",
            "Developing technology for autism: an interdisciplinary approach.",
            "Is simplicity the key to engagement for children on the autism spectrum?",
            "Using tangible user interfaces in computer-based training systems for low-functioning autistic children.",
            "Multitouch tablet applications and activities to enhance the social skills of children with autism spectrum disorders.",
            "Monitoring children's developmental progress using augmented toys and activity recognition.",
            "Supporting parents for in-home capture of problem behaviors of children with developmental disabilities.",
            "Embedded capture and access: encouraging recording and reviewing of data in the caregiving domain.",
            "User-driven RFID applications and challenges.",
            "Gesture recognition using RFID technology.",
            "RFID-based location-sensing system for safety management.",
            "A GA-based mobile RFID localization scheme for internet of things.",
            "X-CleLo: intelligent deterministic RFID data and event transformer.",
            "Costs of authentic pharmaceuticals: research on qualitative and quantitative aspects of enabling anti-counterfeiting in RFID-aided supply chains.",
            "Adding sense to the Internet of Things - An architecture framework for Smart Object systems.",
            "Evaluation and exploration of RFID systems by rapid prototyping.",
            "Extending ECC-based RFID authentication protocols to privacy-preserving multi-party grouping proofs.",
            "Security flaws in a recent RFID delegation protocol.",
            "A secure distance-based RFID identification protocol with an off-line back-end database.",
            "Editorial: the evolving field of tangible interaction for children: the challenge of empirical validation.",
            "Tangible interaction and learning: the case for a hybrid approach.",
            "MARBOWL: increasing the fun experience of shooting marbles.",
            "Tangibles for learning: a representational analysis of physical manipulation.",
            "TUIs vs. GUIs: comparing the learning potential with preschoolers.",
            "Embodied metaphors in tangible interaction design.",
            "User eXperience Laddering with preschoolers: unveiling attributes and benefits of cuddly toy interfaces.",
            "Theme issue on adaptation and personalization for ubiquitous computing.",
            "Social itinerary recommendation from user-generated digital trails.",
            "TruBeRepec: a trust-behavior-based reputation and recommender system for mobile applications.",
            "Context relevance assessment and exploitation in mobile recommender systems.",
            "AML: a modeling language for designing adaptive web applications.",
            "Personalization for unobtrusive service interaction.",
            "Personalization and user verification in wearable systems using biometric walking patterns.",
            "DIY-CDR: an ontology-based, Do-It-Yourself component discoverer and recommender.",
            "Generating recommendations for consensus negotiation in group personalization services.",
            "Guest editorial: Theme issue on smartphone applications and services for pervasive computing.",
            "my2cents: enabling research on consumer-product interaction.",
            "Sketching up the world: in situ authoring for mobile Augmented Reality.",
            "An Android runtime security policy enforcement framework.",
            "Resuscitating privacy-preserving mobile payment with customer in complete control.",
            "PowerPedia: changing energy usage with the help of a community-based smartphone application.",
            "Mobile exploration of geotagged photographs.",
            "Secure and efficient public key management in next generation mobile networks.",
            "A smartphone watch for mobile surveillance service.",
            "Performance analysis of authentication and key distribution scheme for mobile multi-hop relay in IEEE 802.16j.",
            "A recovery method of deleted record for SQLite database.",
            "A cross-country comparison of the adoption of ubiquitous supply chain management.",
            "Exploiting visual quasi-periodicity for real-time chewing event detection using active appearance models and support vector machines.",
            "An approach to domain-based scalable context management architecture in pervasive environments.",
            "You never call: Demoting unused contacts on mobile phones using DMTR.",
            "Blowtooth: a provocative pervasive game for smuggling virtual drugs through real airport security.",
            "Theme issue on \"Sensor-driven computing and applications for Ambient Intelligence\".",
            "Design and validation of a light inference system to support embedded context reasoning.",
            "Context provenance to enhance the dependability of ambient intelligence systems.",
            "Entity Notation: enabling knowledge representations for resource-constrained sensors.",
            "Context-based scene recognition from visual data in smart homes: an Information Fusion approach.",
            "PUCK: an automated prompting system for smart environments: toward achieving automated prompting - challenges involved.",
            "A study on automatic recognition of object use exploiting motion correlation of wireless sensors.",
            "Human motion recognition using a wireless sensor-based wearable system.",
            "Erratum to: Human motion recognition using a wireless sensor-based wearable system.",
            "A new spatial IP assignment method for IP-based wireless sensor networks.",
            "Variable elasticity spring-relaxation: improving the accuracy of localization for WSNs with unknown path loss exponent.",
            "Reconfigurable natural interaction in smart environments: approach and prototype implementation.",
            "Extreme navigation: introduction to the special issue.",
            "Navigation by pointing to GPS locations.",
            "Navigation your way: from spontaneous independent exploration to dynamic social journeys.",
            "Auditory display design for exploration in mobile audio-augmented reality.",
            "Analysis of verbal route descriptions and landmarks for hiking.",
            "Supporting pilgrims in navigating densely crowded religious sites.",
            "Landmarke: an ad hoc deployable ubicomp infrastructure to support indoor navigation of firefighters.",
            "Explorative research on the heat as an expression medium: focused on interpersonal communication.",
            "Investigating presentation of rail-specific spatial information on handheld computer screens.",
            "Enabling topic-level trust for collaborative information sharing.",
            "RFID-driven situation awareness on TangiSense, a table interacting with tangible objects.",
            "Informing and performing: investigating how mediated sociality becomes visible."
        ]
    },
    {
        "name": "PUC",
        "year": "2011",
        "info": "Volume 15, 2011",
        "count": 81,
        "papers": [
            "Methodological issues in studying player experiences of location aware games.",
            "A ludological view on the pervasive mixed-reality game research paradigm.",
            "Capturing the response of players to a location-based game.",
            "Using presence to evaluate an augmented reality location aware game.",
            "Theoretical and methodological implications of designing and implementing multiuser location-based games.",
            "Erratum to: Theoretical and methodological implications of designing and implementing multiuser location-based games.",
            "A research methodology for evaluating location aware experiences.",
            "An embedded system for real-time navigation and remote command of a trained canine.",
            "Potentials of IR-UWB technology for ubiquitous computing.",
            "Fiber optic sensors for wearable applications.",
            "Electronic mobile guides: a survey.",
            "Special issue on material computing.",
            "Electrostatic power harvesting for material computing.",
            "Experiments in design synthesis when behavior is determined by shape.",
            "Hyperform specification: designing and interacting with self-reconfiguring materials.",
            "Materials with computational experience and style.",
            "Shape-changing interfaces.",
            "Multi-field relations in designing for short-range RFID.",
            "Effect of use contexts on the continuous use of mobile services: the case of mobile games.",
            "Facilitating communication about books through an online community.",
            "Theme issue on context-aware middleware and applications.",
            "Toward a cooperative programming framework for context-aware applications.",
            "Mobility management in ubiquitous environments.",
            "Supporting rapid design and evaluation of pervasive applications: challenges and solutions.",
            "COSAR: hybrid reasoning for context-aware activity recognition.",
            "Context-aware pervasive service composition and its implementation.",
            "On context-aware distributed event dissemination.",
            "Theme issue: \"ubiquitous computing and ambient intelligence\".",
            "A model-driven approach for reusing tests in smart home systems.",
            "FamiWare: a family of event-based middleware for ambient intelligence.",
            "Ambient contracts: verifying and enforcing ambient object compositions à la carte.",
            "A design process enabling adaptation in pervasive heterogeneous contexts.",
            "EDIPS: an Easy to Deploy Indoor Positioning System to support loosely coupled mobile work.",
            "Design and evaluation of an ambient assisted living system based on an argumentative multi-agent system.",
            "Supporting the strategies to improve elders' medication compliance by providing ambient aids.",
            "Implicit interaction design for pervasive workflows.",
            "Awareness marks: adaptive services through user interactions with augmented objects.",
            "Imhotep: an approach to user and device conscious mobile applications.",
            "An internet of things-based personal device for diabetes therapy management in ambient assisted living (AAL).",
            "Editorial.",
            "Introduction.",
            "Situated cognitive engineering for crew support in space.",
            "A study on PDAs for onboard applications and technologies and methodologies.",
            "The challenges and opportunities of designing pervasive systems for deep-space colonies.",
            "Space extreme design - New ideas and approaches for space habitability.",
            "Space anthropology: physical and cultural adaptation in outer space.",
            "Space design - Visual interface of space habitats.",
            "Space art: aesthetics design as psychological support.",
            "Space psychology: natural elements in habitation design.",
            "Space extreme design: conclusion and acknowledgements.",
            "Brain-computer interfaces for space applications.",
            "The interior spatial environment: dynamic 0g environments and human places.",
            "Globicomp - doing ubicomp differently: introduction to the special issue.",
            "Cutting Chai, Jugaad, and Here Pheri: towards UbiComp for a global community.",
            "Designing ubiquitous information systems for a community of homeless young people: precaution and a way forward.",
            "Reflection on research methodologies for ubicomp in developing contexts.",
            "The politics of representing cultures in ubiquitous media: challenging national cultural norms by studying a map with Indian and British users.",
            "Kheti: mobile multimedia in an agricultural co-operative.",
            "Situated interactions between audiovisual media and African herbal lore.",
            "Empowerment through seamfulness: smart phones in everyday life.",
            "Organizing and presenting geospatial tags in location-based augmented reality.",
            "Enhancing and evaluating users' social experience with a mobile phone guide applied to cultural heritage.",
            "Accurate monitoring of human physical activity levels for medical diagnosis and monitoring using off-the-shelf cellular handsets.",
            "Capturing location-privacy preferences: quantifying accuracy and user-burden tradeoffs.",
            "A mobile mediation tool for improving interaction between depressed individuals and caregivers.",
            "The smart car seat: personalized monitoring of vital signs in automotive applications.",
            "Locating experience: touring a pervasive performance.",
            "A NFC-based pervasive solution for city touristic surfing.",
            "Bridging the gender and generation gap by ICT applying a participatory design process.",
            "A web-based pervasive recommendation system for mobile tourist guides.",
            "FARM: file annotation and retrieval on mobile devices.",
            "Challenges and trends in wireless ubiquitous computing systems.",
            "RiSeG: a ring based secure group communication protocol for resource-constrained wireless sensor networks.",
            "Stability routing with constrained path length for improved routability in dynamic MANETs.",
            "Robust video communication for ubiquitous network access.",
            "A new model for context-aware transactions in mobile services.",
            "A new scalable multicast routing algorithm for interactive real-time applications.",
            "Optimized skyline queries on road networks using nearest neighbors.",
            "Adapting the mobile phone for task efficiency: the case of predicting outgoing calls using frequency and regularity of historical calls.",
            "Supporting the transition from hospital to home for premature infants using integrated mobile computing and sensor support.",
            "A single tri-axial accelerometer-based real-time personal life log system capable of human activity recognition and exercise information generation."
        ]
    },
    {
        "name": "PUC",
        "year": "2010",
        "info": "Volume 14, 2010",
        "count": 62,
        "papers": [
            "Mobile map interactions during a rendezvous: exploring the implications of automation.",
            "Pursuing genius loci: interaction design and natural places.",
            "Easy on that trigger dad: a study of long term family photo retrieval.",
            "Dynamic 2D-barcodes for multi-device Web session migration including mobile phones.",
            "Information privacy in institutional and end-user tracking and recording technologies.",
            "Evaluation of a wearable computer system for telemonitoring in a critical environment.",
            "Interaction with large ubiquitous displays using camera-equipped mobile phones.",
            "Requirements for mobile photoware.",
            "Enhancing learning: a study of how mobile devices can facilitate sensemaking.",
            "Remote navigation of a mobile robot in an RFID-augmented environment.",
            "Identifying and facilitating social interaction with a wearable wireless sensor network.",
            "Family memories in the home: contrasting physical and digital mementos.",
            "Theme issue on social interaction and mundane technologies.",
            "Digital plumbing: the mundane work of deploying UbiComp in the home.",
            "Making video mundane: intellectual disability and the use of camcorders.",
            "The experience of photologging: global mechanisms and local interactions.",
            "Designing for social interaction with mundane technologies: issues of security and trust.",
            "Making the ordinary visible in microblogs.",
            "Conveying identity with mobile content.",
            "Making mundane pleasures visible: mediating daily likings with lightweight technology.",
            "Design ideas for IT in public spaces.",
            "Swiping paper: the second hand, mundane artifacts, gesture and collaboration.",
            "MIMOSA: context-aware adaptation for ubiquitous web access.",
            "Context-based authentication and transport of cultural assets.",
            "Exploiting ambient illumination to locate and recognise user behaviour in enclosed environments.",
            "A snapshot of trusted personal devices applicable to transaction processing.",
            "Exploring casual point-and-tilt interactions for mobile geo-blogging.",
            "Design for social interaction through physical play in diverse contexts of use.",
            "Designing playful interactions for social interaction and physical play.",
            "Get up and move: an interactive cuddly toy that stimulates physical activity.",
            "Space and places: when interacting with and in physical space becomes a meaningful experience.",
            "Towards understanding how to design for social play in exertion games.",
            "Designing intergenerational play via enactive interaction, competition and acceleration.",
            "Head Up Games: combining the best of both worlds by merging traditional and digital play.",
            "The effectiveness of using a robotics class to foster collaboration among groups of children with autism in an exploratory study.",
            "Expressing and interpreting emotional movements in social games with robots.",
            "Pervasive technologies for assistive environments: special issue of PETRA 2008 conference.",
            "The BehaviorScope framework for enabling ambient assisted living.",
            "An activity monitoring system for elderly care using generative and discriminative models.",
            "Design and implementation of a sensor-based wireless camera system for continuous monitoring in assistive environments.",
            "A database-based framework for gesture recognition.",
            "Design and implementation of a VoiceXML-driven wiki application for assistive environments on the web.",
            "Unobtrusive physiological monitoring in an airplane seat.",
            "A system for the provision of medical diagnostic and treatment advice in home care environment.",
            "Providing advanced remote medical treatment services through pervasive environments.",
            "Service personalization for assistive living in a mobile ambient healthcare-networked environment.",
            "Where will they turn: predicting turn proportions at intersections.",
            "Phone n' Computer: teaming up an information appliance with a PC.",
            "MobiEureka: an approach for enhancing the discovery of mobile web services.",
            "Rhythms and plasticity: television temporality at home.",
            "Mobile phone-based pervasive fall detection.",
            "Preprocessing techniques for context recognition from accelerometer data.",
            "Interactive visual supports for children with autism.",
            "Special issue on multimodal systems, services and interfaces for ubiquitous computing.",
            "Multimodal identification and tracking in smart environments.",
            "Multimodal sensing, recognizing and browsing group social dynamics.",
            "Multimodal support for social dynamics in co-located meetings.",
            "Toward accessible self-service kiosks through intelligent user interfaces.",
            "GeeAir: a universal multimodal remote control device for home appliances.",
            "Comparing picture and video prompting in autonomous indoor wayfinding for individuals with cognitive impairments.",
            "What is happening now? Detection of activities of daily living from simple visual features.",
            "A multi-modal dialogue analysis method for medical interviews based on design of interaction corpus."
        ]
    },
    {
        "name": "PUC",
        "year": "2009",
        "info": "Volume 13, 2009",
        "count": 61,
        "papers": [
            "Introduction to the special issue on emerging multimodal interfaces.",
            "Robust multimodal audio-visual processing for advanced context awareness in smart spaces.",
            "Integration of audiovisual sensors and technologies in a smart room.",
            "Multimodal identity tracking in a smart room.",
            "Multimodal focus attention and stress detection and feedback in an augmented driver simulator.",
            "A fuzzy expert system for the early warning of accidents due to driver hypo-vigilance.",
            "Interactive mixed reality white cane simulation for the training of the blind and the visually impaired.",
            "3D content-based search using sketches.",
            "Manual annotation and automatic image processing of multimodal emotional behaviors: validating the annotation of TV interviews.",
            "MPEG-4 facial expression synthesis.",
            "Mixed reality participants in smart meeting rooms and smart home environments.",
            "Face detection and recognition of natural human emotion using Markov random fields.",
            "An innovative mobile electronic tourist guide application.",
            "A user-adaptive city guide system with an unobtrusive navigation interface.",
            "Fabric PCBs, electronic sequins, and socket buttons: techniques for e-textile craft.",
            "Exploring mindlessness as an explanation for the media equation: a study of stereotyping in computer tutorials.",
            "Adaptive training of video sets for image recognition on mobile phones.",
            "Special issue on \"Ubiquitous e-Learning Solutions over Heterogeneous Networks\".",
            "End-to-end adaptation scheme for ubiquitous remote experimentation.",
            "Open corpus architecture for personalised ubiquitous e-learning.",
            "A grid based software architecture for delivery of adaptive and personalised learning experiences.",
            "Activity-based scenarios for and approaches to ubiquitous e-Learning.",
            "Satellite-based delivery of educational content to geographically isolated communities: a service based approach.",
            "Human factors and qualitative pedagogical evaluation of a mobile augmented reality system for science education used by learners with physical disabilities.",
            "Mobile Spatial Interaction.",
            "Supporting device discovery and spontaneous interaction with spatial references.",
            "Bearing-based selection in mobile spatial interaction.",
            "Handheld Augmented Reality for underground infrastructure visualization.",
            "The role of spatial contextual factors in mobile personalization at large sports events.",
            "Embodied interaction with a 3D versus 2D mobile map.",
            "Planners, navigators, and pragmatists: collaborative wayfinding using a single mobile phone.",
            "Contextual patterns in mobile service usage.",
            "Product features and task effects on experienced richness, control and engagement in voicemail browsing.",
            "Understanding and measuring the urban pervasive infrastructure.",
            "Experiencing the Affective Diary.",
            "Location-free haptic interaction for large-area social applications.",
            "Multimodal identity tracking in a smart room.",
            "An update on privacy in ubiquitous computing.",
            "A survey of computational location privacy.",
            "Understanding and capturing people's privacy policies in a mobile social networking application.",
            "A survey of RFID privacy approaches.",
            "RFID and privacy: what consumers really want and fear.",
            "Legal safeguards for privacy and data protection in ambient intelligence.",
            "Special issue on \"Intelligent systems and services for ubiquitous computing\".",
            "Intra domain route optimization for ubiquitous network.",
            "Robust and secure routing scheme for wireless multihop network.",
            "Bring QoS to P2P-based semantic service discovery for the Universal Network.",
            "Adaptive video-on-demand broadcasting in ubiquitous computing environment.",
            "Alleviating reader collision problem in mobile RFID networks.",
            "An efficient scheme of target classification and information fusion in wireless sensor networks.",
            "Design and evaluation of lightweight middleware for personal wireless body area network.",
            "A multimodal semantic location service for intelligent environments: an application for Smart Hospitals.",
            "Ubiquitous Personal Study: a framework for supporting information access and sharing.",
            "Special issue on interaction with coupled and public displays.",
            "Contact through canvas: an entertaining encounter.",
            "Investigating teamwork and taskwork in single- and multi-display groupware systems.",
            "A taxonomy for and analysis of multi-person-display ecosystems.",
            "Users' quest for an optimized representation of a multi-device space.",
            "Supporting casual interactions between board games on public tabletop displays and mobile devices.",
            "A visibility control system for collaborative digital table.",
            "Impact of item density on the utility of visual context in magic lens interactions."
        ]
    },
    {
        "name": "PUC",
        "year": "2008",
        "info": "Volume 12, 2008",
        "count": 54,
        "papers": [
            "Special Issue of Personal and Ubiquitous Computing: Papers from the Fourth International Conference on Mobile Business.",
            "Providing location based information/advertising for existing mobile phone users.",
            "Using short-range communication to control mobile device functionality.",
            "Evolution of 3D mobile games development.",
            "The disappearing screen: scenarios for audible interfaces.",
            "Service adoption strategies of push over cellular.",
            "Applying FLC-based dynamic buffer size tuning to shorten the information retrieval round trip time in mobile location-aware environments.",
            "An empirical investigation of mobile ticketing service adoption in public transportation.",
            "The perceptions towards mobile services: an empirical analysis of the role of use facilitators.",
            "A confidence-based framework for business to consumer (B2C) mobile commerce adoption.",
            "Benefits and challenges of new mobile service development in R&D network.",
            "Selected papers of the ARCS06 conference: an introduction.",
            "Architecture and applications of the FingerMouse: a smart stereo camera for wearable computing HCI.",
            "A wireless sensor networks MAC protocol for real-time applications.",
            "Functionality-power-packaging considerations in context aware wearable systems.",
            "A resource and context model for mobile middleware.",
            "Prototypical implementation of location-aware services based on a middleware architecture for super-distributed RFID tag infrastructures.",
            "Middleware support for the deployment of ubiquitous software components.",
            "Special issue on user-centred design and evaluation of ubiquitous groupware.",
            "Multimodal support to group dynamics.",
            "Design and evaluation of systems to support interaction capture and retrieval.",
            "Evaluating meeting support tools.",
            "Evaluating teamwork support in tabletop groupware applications using collaboration usability analysis.",
            "Using job-shop scheduling tasks for evaluating collocated collaboration.",
            "Adapting paper prototyping for designing user interfaces for multiple display environments.",
            "Implications of the socio-physical contexts when interacting with mobile media.",
            "Primary and secondary context in mobile video communication.",
            "Avatopia: a cross-media community for societal action.",
            "Modular framework support for context-aware mobile cinema.",
            "Interactive movie elements in a pervasive game.",
            "Towards autonomous updating of world models in location-aware spaces.",
            "Using tracked mobile sensors to make maps of environmental effects.",
            "Editorial.",
            "The disenchantment of affect.",
            "A designerly critique on enchantment.",
            "Alien presence in the home: the design of Tableau Machine.",
            "Sites of flux: imagining space in the dance-architectures of The Changing Room and Sea Unsea.",
            "Transports of delight? What the experience of receiving (mobile) phone calls can tell us about design.",
            "The enchanting potential of technology: a dialogical case study of enchantment and the Internet.",
            "Technology scruples: why intimidation will not save the recording industry and how enchantment might.",
            "The social representation of telecommunications.",
            "Informing augmented memory system design through autobiographical memory theory.",
            "Ubiquitous interaction with positioning and navigation using a novel light sensor-based information transmission system.",
            "A comparison of location and token-based interaction techniques for point-of-care access to medical information.",
            "The social representation of telecommunications.",
            "Hybrid ecologies: understanding cooperative interaction in emerging physical-digital environments.",
            "A calendar based Internet content pre-caching agent for small computing devices.",
            "ONTRACK: Dynamically adapting music playback to support navigation.",
            "Designing for privacy and self-presentation in social awareness.",
            "Understanding privacy regulation in ubicomp interactions.",
            "Considerate home notification systems: a field study of acceptability of notifications in the home.",
            "Tlk or txt? Using voice input for SMS composition.",
            "Investigating five key predictive text entry with combined distance and keystroke modelling.",
            "MobGeoSen: facilitating personal geosensor data collection and visualization using mobile phones."
        ]
    },
    {
        "name": "PUC",
        "year": "2007",
        "info": "Volume 11, 2007",
        "count": 59,
        "papers": [
            "Experiences in developing mobile applications using the Apricot Agent Platform.",
            "The reflective mobile agent paradigm implemented in a smart office environment.",
            "A file system for system programming in ubiquitous computing.",
            "Automated context aggregation and file annotation for PAN-based computing.",
            "Design for emergence: experiments with a mixed reality urban playground game.",
            "Improving service matching and selection in ubiquitous computing environments: a user study.",
            "The case of sculpting atmospheres: towards design principles for expressive tangible interaction in control of ambient systems.",
            "Capturing the effects of context on human performance in mobile computing systems.",
            "Interacting with mobile services: an evaluation of camera-phones and visual tags.",
            "Sound, paper and memorabilia: resources for a simpler digital photography.",
            "Uses of accelerometer data collected from a wearable system.",
            "Yesterday's tomorrows: notes on ubiquitous computing's dominant vision.",
            "The iterative development of a tangible pin-board to symmetrically link physical and digital documents.",
            "MobiPass: a passport for mobile business.",
            "Situated play in a tangible interface and adaptive audio museum guide.",
            "A breadboard architecture for pervasive context-aware services in smart spaces: middleware components and prototype applications.",
            "Welcome to the special issue on memory and sharing of experience for the Journal of Personal and Ubiquitous Computing.",
            "Active construction of experience through mobile media: a field study with implications for recording and sharing.",
            "Point-of-capture archiving and editing of personal experiences from a mobile device.",
            "Recognizing context for annotating a live life recording.",
            "Collaborative capturing, interpreting, and sharing of experiences.",
            "Integrating glucometers and digital photography as experience capture tools to enhance patient understanding and communication of diabetes self-management practices.",
            "Ubiquitous Memories: a memory externalization system using physical objects.",
            "Connecting the family with awareness systems.",
            "MEMENTO: a digital-physical scrapbook for memory sharing.",
            "Pervasive computing in the domestic space.",
            "Bringing emotion and physicality to domestic ICTs: interview with Steven Kyffin.",
            "When home base is not a place: parents' use of mobile telephones.",
            "Probing user values in the home environment within a technology driven Smart Home project.",
            "Designing home availability services.",
            "Back to the shed: gendered visions of technology and domesticity.",
            "Homes that make us smart.",
            "Digital homes on wheels: designing for the unimagined home.",
            "Designing technologies for presence-in-absence: illustrating the Cube and the Picture Frame.",
            "Kitchen stories: sharing recipes with the Living Cookbook.",
            "Personal and ubiquitous computing: special issue on location and context awareness.",
            "LuxTrace: indoor positioning using building illumination.",
            "Exploiting real world knowledge in ubiquitous applications.",
            "Improving the accuracy of ultrasound-based localisation systems.",
            "GETA sandals: a footstep location tracking system.",
            "Periodic properties of user mobility and access-point popularity.",
            "Pedestrian navigation with high sensitivity GPS receivers and MEMS.",
            "MoteTrack: a robust, decentralized approach to RF-based location tracking.",
            "Editorial: ubiquitous computing in the real world.",
            "Ubiquitous computing in the real world: lessons learnt from large scale RFID deployments.",
            "Supporting the unremarkable: experiences with the obje Display Mirror.",
            "When design just isn't enough: the unanticipated challenges of the real world for large collaborative displays.",
            "Exploring context-awareness for ubiquitous computing in the healthcare domain.",
            "Ubicomp challenges in collaborative scheduling: Pin&Play at the Göteborg film festival.",
            "Mobile Fair Diary: hybrid interface for taking, browsing and sharing context-aware notes.",
            "Self-organizable panel for assembling DIY ubiquitous computing.",
            "Introduction to the special issue on movement-based interaction.",
            "Towards a Multimodal Interaction Space: categorisation and applications.",
            "Movement-based interaction in camera spaces: a conceptual framework.",
            "Sports over a Distance.",
            "\"Come on momma, let's see the drummer\": movement-based interaction and the performance of personal style.",
            "Easy doesn't do it: skill and expression in tangible aesthetics.",
            "Move to get moved: a search for methods, tools and knowledge to design for expressive and rich movement-based interaction.",
            "Understanding movement for interaction design: frameworks and approaches."
        ]
    },
    {
        "name": "PUC",
        "year": "2006",
        "info": "Volume 10, 2006",
        "count": 54,
        "papers": [
            "Guidelines and open issues in systems support for Ubicomp: reflections on UbiSys 2003 and 2004.",
            "Middleware for pervasive and ad hoc computing.",
            "AMUN: an autonomic middleware for the Smart Doorplate Project.",
            "An adaptive middleware framework for context-aware applications.",
            "UbiqStack: a taxonomy for a ubiquitous computing software stack.",
            "EMMA: Epidemic Messaging Middleware for Ad hoc networks.",
            "Mires: a publish/subscribe middleware for sensor networks.",
            "Supporting ordering and consistency in a distributed Event Heap for Ubiquitous Computing.",
            "Towards self-protecting ubiquitous systems: monitoring trust-based interactions.",
            "Special issue of personal and ubiquitous computing: papers from 3AD-the second international conference on appliance design.",
            "Is automation automatically a good thing?",
            "The video window: my life with a ludic system.",
            "Digital Selves: Devices for intimate communications between homes.",
            "Affective is effective: how information appliances can mediate relationships within communities and increase one's social effectiveness.",
            "The friend locator: supporting visitors at large-scale events.",
            "Appliances for whom? Considering place.",
            "Creative connections: user, designer, context, and tools.",
            "Some Kind of Analogtivity: anti-simulation through design.",
            "BuddyBeads: techno-jewelry for non-verbal communication within teenager girls groups.",
            "Method to analyze user behavior in home environment.",
            "Taking clues from the world outside: navigating interactive panoramas.",
            "The PhotoMirror appliance: affective awareness in the hallway.",
            "Comparing end-user and intelligent remote control interface generation.",
            "Material light: exploring expressive materials.",
            "Re-using users: co-create and co-evaluate.",
            "A cube to learn: a tangible user interface for the design of a learning appliance.",
            "The value of storyboards in the product design process.",
            "MusicCube: a physical experience with digital music.",
            "Interactive lounge: an interdisciplinary approach to the design of a gestural interaction device.",
            "Phymail Box: an information appliance that checks and prints only important emails.",
            "PAWS: Personal Action Wireless Sensor.",
            "A rich user interface for a digital camera.",
            "The Light-Wall: tangible user interfaces for learning systems thinking.",
            "Cabinet: merging designers' digital and physical collections of visual materials.",
            "DiamondHelp: a new interaction design for networked home appliances.",
            "Network alarm clock (The 3AD International Design Competition).",
            "Theme issue on interactive mobile information access.",
            "From ethnography on infrastructure management to initial user feedback on PlaceMemo.",
            "Supporting information access in a hospital ward by a context-aware mobile electronic patient record.",
            "Marked-up maps: combining paper maps and electronic information resources.",
            "Using ubiquitous computing in interactive mobile marketing.",
            "Acoustic environment as an indicator of social and physical context.",
            "Reality mining: sensing complex social systems.",
            "Can we do without GUIs? Gesture and speech interaction with a patient information system.",
            "Accelerometer-based gesture control for a design environment.",
            "A mobile pet wearable computer and mixed reality system for human-poultry interaction through the internet.",
            "Social functions of location in mobile telephony.",
            "An ethnography of communication approach to mobile product testing.",
            "Bridging the physical and virtual worlds by local connectivity-based physical selection.",
            "Methods for quantitative usability requirements: a case study on the development of the user interface of a mobile phone.",
            "Meta-searches in peer-to-peer networks.",
            "The experience of enchantment in human-computer interaction.",
            "A software infrastructure for supporting spontaneous and personalized interaction in home computing environments.",
            "Human-agent service matching using natural language queries: system test and training."
        ]
    },
    {
        "name": "PUC",
        "year": "2005",
        "info": "Volume 9, 2005",
        "count": 34,
        "papers": [
            "A memory aid with remote communication using distributed technology.",
            "The design of the SensVest.",
            "On location models for ubiquitous computing.",
            "Spatial metaphors for a speech-based mobile city guide service.",
            "TimeSpace: activity-based temporal visualisation of personal information spaces.",
            "Ubiquitous service access through adapted user interfaces on multiple devices.",
            "User experience of communication before and during rendezvous: interim results.",
            "Distributed interface bits: dynamic dialogue composition from ambient computing resources.",
            "A rapid prototyping software infrastructure for user interfaces in ubiquitous augmented reality.",
            "Special issue on out-of-box experience and consumer devices.",
            "Perceptions versus expectations of multimedia messaging service (MMS).",
            "Beyond usability: the OoBE dynamics of mobile data services markets.",
            "Implementing a wireless network of PDAs in a hospital setting.",
            "Supporting a user facing a novel application: learnability in OOBE.",
            "Customer-centered design for mobile applications.",
            "HMD versus PDA: a comparative study of the user out-of-box experience.",
            "A behavioural model of temperature controller usage and energy saving.",
            "Special issue on ubiquitous mobile information and collaboration systems (UMICS).",
            "A natural language model for managing TV-Anytime information in mobile environments.",
            "Updated data dissemination methods for updating old replicas in ad hoc networks.",
            "Distributed processing of reminding tasks within the mobile memory aid system, MEMOS.",
            "Partitioning rules for orchestrating mobile information systems.",
            "Improving the effectiveness of monitoring and control systems exploiting knowledge-based approaches.",
            "Activity-based computing: support for mobility and collaboration in ubiquitous computing.",
            "Component-based development of Web-enabled eHome services.",
            "Collaborative design of web service networks in a multilingual user community.",
            "Browsing the environment with the SNAP&TELL wearable computer system.",
            "Browsing the environment with the SNAP&TELL wearable computer system - Erratum.",
            "The trouble with login: on usability and computer security in ubiquitous computing.",
            "Device-aware desktop web page transformation for rendering on handhelds.",
            "Refining visualization reference model for context information.",
            "An Experimental Investigation into Wayfinding Directions for Visually Impaired People.",
            "Age differences rendezvousing: reminders for side-stepping.",
            "User-perceived quality of service in wireless data networks."
        ]
    },
    {
        "name": "PUC",
        "year": "2004",
        "info": "Volume 8, 2004",
        "count": 52,
        "papers": [
            "A framework for contextual mediation in mobile and ubiquitous computing applied to the context-aware adaptation of maps.",
            "What we talk about when we talk about context.",
            "Evolving a pervasive IT infrastructure: a technology integration approach.",
            "Mobile access to real-time information-the case of autonomous stock brokering.",
            "An address assignment for the automatic configuration of mobile ad hoc networks.",
            "Using keyphrases as search result surrogates on small screen devices.",
            "HCI aspects of mobile devices and services.",
            "Human Pacman: a mobile, wide-area entertainment system based on physical, social, and ubiquitous computing.",
            "The design of a handheld, location-aware guide for indoor environments.",
            "Traffic encounters and Hocman: Associating motorcycle ethnography with design.",
            "Computational support to record and re-experience visits.",
            "Time-out in user interface: the case of mobile text input.",
            "Design iterations for a location-aware event planner.",
            "SyncTap: synchronous user operation for spontaneous network connection.",
            "Understanding mobile contexts.",
            "2AD: The second international conference on Appliance Design, held at HP Laboratories, Bristol, UK, 11-13 May 2004.",
            "From devices to tasks: automatic task prediction for personalized appliance control.",
            "Supporting routine decision-making with a next-generation alarm clock.",
            "The fuzzy felt ethnography-understanding the programming patterns of domestic appliances.",
            "The Ambient Horn: designing a novel audio-based learning experience.",
            "Sensible appliances: applying context-awareness to appliance design.",
            "WaterCalls: an ambient call queue for cooperation between emergency service centres.",
            "Interactive scenarios-building ubiquitous computing concepts in the spirit of participatory design.",
            "Heckel's law: conclusions from the user interface design of a music appliance-the bassoon.",
            "Low-vision reading aids: reading as a pleasurable experience.",
            "Communication enhancer-appliances for better communication in a family.",
            "GIA: design of a gesture-based interaction photo album.",
            "Evolution towards smart home environments: empirical evaluation of three user interfaces.",
            "Interactional features of a paper-based monitoring system.",
            "Finding a form to hold the act of queuing.",
            "An editing tool that manages device associations in an in-home environment.",
            "Dress and Ange: coercing the address of highly personal body-centric issues.",
            "Interactive and experiential design in smart textile products and applications.",
            "The Emotional Wardrobe.",
            "Tangible interfaces in perspective.",
            "Tangible products: redressing the balance between appearance and action.",
            "Supporting configurability in a mixed-media environment for design students.",
            "From turtles to Tangible Programming Bricks: explorations in physical language design.",
            "On tangible user interfaces, humans and spatiality.",
            "A taxonomy for and analysis of tangible interfaces.",
            "The TAC paradigm: specifying tangible user interfaces.",
            "Minimalism in ubiquitous interface design.",
            "3D story cube: an interactive tangible user interface for storytelling with 3D graphics and audio.",
            "eMoto: emotionally engaging interaction.",
            "Tagaboo: a collaborative children's game based upon wearable RFID technology.",
            "ISH and the search for resonant tangible interaction.",
            "Personal and Ubiquitous Computing.",
            "Security in the wild: user strategies for managing security as an everyday, practical problem.",
            "Little brother: could and should wearable computing technologies be applied to reducing older people's fear of crime?.",
            "Consumer perceptions of privacy, security and trust in ubiquitous commerce.",
            "Privacy in pervasive environments: next generation labeling protocols.",
            "Personal privacy through understanding and action: five pitfalls for designers."
        ]
    },
    {
        "name": "PUC",
        "year": "2003",
        "info": "Volume 7, 2003",
        "count": 40,
        "papers": [
            "Interval scripts: a programming paradigm for interactive environments and agents.",
            "Speech-as-data technologies for personal information devices.",
            "Students' experiences with PDAs for reading course materials.",
            "1D selection of 2D objects in head-worn displays.",
            "The information furnace: consolidated home control.",
            "User needs for location-aware mobile services.",
            "Selected papers of the ARCS02 conference: an introduction.",
            "An Architecture for the Integration of Physical and Informational Spaces.",
            "Rendezvous layer protocols for Bluetooth-enabled smart devices.",
            "The BTRC Bluetooth remote control system.",
            "Bayesian approach to sensor-based context awareness.",
            "Understanding contexts by being there: case studies in bodystorming.",
            "Papers from 1AD: First international conference on appliance design, May 2003.",
            "In formation: Support for flexibility, mobility, collaboration, and coherence.",
            "The 'adequate' design of ethnographic outputs for practice: some explorations of the characteristics of design resources.",
            "Developing information appliance design tools for designers.",
            "FReCon: a fluid remote controller for a FReely connected world in a ubiquitous environment.",
            "Urban Tapestries: Wireless networking, public authoring and social knowledge.",
            "The evolution of objects into hyper-objects: will it be mostly harmless?",
            "Pervasive Servers: A framework for creating a society of appliances.",
            "Smart home - digitally engineered domestic life.",
            "Schminky: The design of a café based digital experience.",
            "Designing appliances for mobile commerce and retailtainment.",
            "Getting into the Living Memory Box: Family archives & holistic design.",
            "Information Jukebox - A semi-public device for presenting multimedia information content.",
            "Smart doorplate.",
            "The Periscope: supporting a computer enhanced field trip for children.",
            "An EyeTap video-based featureless projective motion estimation assisted by gyroscopic tracking for wearable computer mediated reality.",
            "The evolution of perspective view in WalkMap.",
            "Wearable sensing to annotate meeting recordings.",
            "Using GPS to learn significant locations and predict movement across multiple users.",
            "Visual registration for unprepared augmented reality environments.",
            "The case for reconfigurable hardware in wearable computing.",
            "Social weight: designing to minimise the social consequences arising from technology use by the mobile professional.",
            "Customising WAP-based information services on mobile networks.",
            "Pedestrian navigation aids: information requirements and design implications.",
            "An application of a context-aware file system.",
            "An infrastructure for context-awareness based on first order logic.",
            "Designing mobile technologies to support co-present collaboration.",
            "Providing proper affordances when transferring source metaphors from information appliances to a 3G mobile multipurpose handset."
        ]
    },
    {
        "name": "PUC",
        "year": "2002",
        "info": "Volume 6, 2002",
        "count": 49,
        "papers": [
            "editorial: Special Issue on Wearable Computing.",
            "Smart Clothing Prototype for the Arctic Environment.",
            "User Interfaces for Applications on a Wrist Watch.",
            "The Well Mannered Wearable Computer.",
            "Wearable Visual Robots.",
            "Development of a Wearable Computer Orientation System.",
            "Accessing Context in Wearable Computers.",
            "First Person Indoor/Outdoor Augmented Reality Application: ARQuake.",
            "The Media Equation Does Not Always Apply: People are not Polite Towards Small Computers.",
            "Where Does the Mouse Go? An Investigation into the Placement of a Body-Attached TouchPad Mouse for Wearable Computers.",
            "User and Concept Studies as Tools in Developing Mobile Communication Services for the Elderly.",
            "Perceived Similarities and Preferences for Consumer Electronics Products.",
            "Data Structures in the Design of Interfaces.",
            "An Empirical and Theoretical Evaluation of BinScroll: A Rapid Selection Technique for Alphanumeric Lists.",
            "Obituary for a Fax.",
            "Editorial: The Design of In-car Communication and Information Applications.",
            "Using 3D Sound to Improve the Effectiveness of the Advanced Driver Assistance Systems.",
            "WIRE3: Driving Around the Information Super-Highway.",
            "Designing Leisure Applications for the Mundane Car-Commute.",
            "Overcoming the Lack of Screen Space on Mobile Computers.",
            "TRIP: A Low-Cost Vision-Based Location System for Ubiquitous Computing.",
            "The Design and Implementation of a Mobile Learning Resource.",
            "editorial: The Challenge of Mobile Devices for Human Computer Interaction.",
            "Evaluating Interface Design Choices on WAP Phones: Navigation and Selection.",
            "RSVP Browser: Web Browsing on Small Screen Devices.",
            "AudioGPS: Spatial Audio Navigation with a Minimal Attention Interface.",
            "Customizing Graphics for Tiny Displays of Mobile Devices.",
            "Smart CAPs for Smart Its - Context Detection for Mobile Users.",
            "Exploring Context-aware Information Push.",
            "Patterns of Mobile Interaction.",
            "Citywide: Supporting Interactive Digital Experiences Across Physical Space.",
            "Everyday Life as a Stage in Creating and Performing Scenarios for Wireless Devices.",
            "Mobile Devices as Props in Daily Role Playing.",
            "editorial: Special Issue on Location Modeling in Ubiquitous Computing.",
            "Beyond Position Awareness.",
            "A User-Centered Location Model.",
            "Location Models from the Perspective of Context-Aware Applications and Mobile Ad Hoc Networks.",
            "Expressing Location Information for Applications in the Internet.",
            "Location Models for Augmented Environments.",
            "A Location Model for Communicating and Processing of Context.",
            "Editorial: Special Issue on Ubiquitous Games.",
            "Integrating E-Commerce and Games.",
            "Smart Playing Cards: A Ubiquitous Computing Game.",
            "SenToy in FantasyA: Designing an Affective Sympathetic Interface to a Computer Game.",
            "Contextual Virtual Interaction as Part of Ubiquitous Game Design and Development.",
            "Movement Awareness for Ubiquitous Game Control.",
            "New Active Tools for Supporting Narrative Structures.",
            "Touch-Space: Mixed Reality Game Space Based on Ubiquitous, Tangible, and Social Computing.",
            "Designing Ubiquitous Computing Games - A Report from a Workshop Exploring Ubiquitous Computing Entertainment."
        ]
    },
    {
        "name": "PUC",
        "year": "2001",
        "info": "Volume 5, 2001",
        "count": 37,
        "papers": [
            "editoral: Situated Interaction and Context-Aware Computing.",
            "Understanding and Using Context.",
            "Using Context as a Crystal Ball: Rewards and Pitfalls.",
            "What are a Location's \"File\" and \"Edit\" Menus?",
            "Metaphors and Context-Aware Information Access.",
            "Modelling and Adapting to Context.",
            "Composite Device Computing Environment: A Framework for Situated Interaction Using Small Screen Devices.",
            "Modelling both the Context and the User.",
            "The Human Communication Space: Towards I-centric Communications.",
            "Building Distributed Context-Aware Applications.",
            "Better Living Through Geometry.",
            "Teaching Context to Applications.",
            "Using Personal Traces in Context Space: Towards Context Trace Technology.",
            "Magic Touch: A Simple Object Location Tracking System Enabling the Development of Physical-Virtual Artefacts in Office Environments.",
            "Context Awareness and Mobile Phones.",
            "Talking Wearables Exploit Context.",
            "Aware Community Portals: Shared Information Appliances for Transitional Spaces.",
            "Situated Interaction in Art.",
            "Active Environments: Sensing and Responding to Groups of People.",
            "A Context/Communication Information Agent.",
            "editorial: Guest Editorial: Mobile Communication and the Reformulation of the Social Order.",
            "The Mobile Phone: An Identity on the Move.",
            "Managing One's Availability to Telephone Communication Through Mobile Phones: A French Case Study of the Development Dynamics of Mobile Phone Use.",
            "Discovery and Integration of Mobile Communications in Everyday Life.",
            "\"We Release Them Little by Little\": Maturation and Gender Identity as Seen in the Use of Mobile Telephony.",
            "Negotiating Use: Making Sense of Mobile Technology.",
            "Configuring the Mobile User: Sociological and Industry Views.",
            "PEBBLES: A Personal Technology for Meeting Educational, Social and Emotional Needs of Hospitalised Children.",
            "Making Space for Voice: Technologies to Support Children's Fantasy and Storytelling.",
            "When are Personal Technologies for Children?",
            "Interface-Me: Pursuing Sociability Through Personal Devices.",
            "Slow Technology - Designing for Reflection.",
            "Group and Individual Time Management Tools: What You Get is Not What You Need.",
            "Broadband Cellular Radio Telecommunication Technologies in Distance Learning: A Human Factors Field Study.",
            "Using Handheld Devices in Synchronous Collaborative Scenarios.",
            "Context-aware Retrieval: Exploring a New Environment for Information Retrieval and Information Filtering.",
            "InfoPoint: A Device that Provides a Uniform User Interface to Allow Appliances to Work Together over a Network."
        ]
    },
    {
        "name": "PUC",
        "year": "2000",
        "info": "Volume 4, 2000",
        "count": 31,
        "papers": [
            "editoral: Domestic Design: An Introduction to the Research Issues Surrounding the Development and Design of Interactive Technologies for the Home.",
            "The Introduction of New Technology into the Household.",
            "Patterns of Home Life: Informing Design For Domestic Environments.",
            "The Future of the Personal Computer in the Home: A Research Note.",
            "A Digital Photography Framework Enabling Affective Awareness in Home Communication.",
            "Music in the Home: Interfaces for Music Appliances.",
            "editoral: Human Computer Interaction with Mobile Devices.",
            "Comparison of Speech Input and Manual Control of In-Car Devices while on the Move.",
            "Mobile Asynchronous Communication: Exploring the Potential for Converged Applications.",
            "Assessing Two New Wearable Input Paradigms: The Finger-Joint-Gesture Palm-Keypad Glove and the Invisible Phone Clock.",
            "Coping with Consistency under Multiple Design Constraints: The Case of the Nokia 9000 WWW Browser.",
            "Spatial Audio in Small Screen Device Displays.",
            "Mobile Computers in a Community NHS Trust: Is this a Relevant Context and Environment for their Use?",
            "Places to Stay on the Move: Software Architectures for Mobile User Interfaces.",
            "Studies of Mobile Document Work and their Contributions to the Satchel Project.",
            "Design Challenges of an In-Car Communication System UI.",
            "Using Mobile Communication Devices to Access Virtual Meeting Spaces.",
            "Implicit Human Computer Interaction Through Context.",
            "Editoral.",
            "Using Mobile Code to Build a Smart Kitchen.",
            "short paper: Augmenting Photographs with Audio.",
            "Presenting Dynamic Information on Mobile Computers.",
            "Semantic Location.",
            "Look, Ma, My Homepage is Mobile!",
            "Context Aware Messaging Service: A Dynamical Messaging Delivery using Location Information and Schedule Information.",
            "Context-Aware Telephony Over WAP.",
            "MemoClip: A Location-Based Remembrance Appliance.",
            "Magic Wardrobe: Situated Shopping from your own Bedroom.",
            "short paper: The Memory Box.",
            "The Shopping Jacket: Wearable Computing for the Consumer.",
            "Disseminating Trust Information in Wearable Communities."
        ]
    },
    {
        "name": "PUC",
        "year": "1999",
        "info": "Volume 3, 1999",
        "count": 24,
        "papers": [
            "Handheld CSCW: Personal Technologies for Collaboration.",
            "Spatial Conferencing Using a Wearable Computer.",
            "The Support of Mobile-Awareness in Collaborative Groupware.",
            "Pagers, Pilots and Prairie Dog: Awareness via Handheld Devices.",
            "PDAs and Shared Public Displays: Making Personal Information Public, and Public Information Personal.",
            "Supporting Group Collaboration with Interpersonal Awareness Devices.",
            "Enabling Collaborative Work: Work in Progress.",
            "Designing Handheld Technologies for Kids.",
            "Collaborating over Portable Reading Appliances.",
            "A Non-Obtrusive User Interface for Increasing Social Awareness on the World Wide Web.",
            "Computers and fun.",
            "Analysing fun as a candidate software requirement.",
            "Paradigms for the Design of Interactive Drama.",
            "Taking Fun Seriously: Using Cognitive Models to Reason About Interaction with Computer Games.",
            "Toward the Construction of Fun Computer Games: Differences in the views of developers and players.",
            "\"It's fun to do things together\" Two cases of explorative user studies.",
            "The New Media Paradigm - Users as Creators of Content.",
            "The Musical Playpen - An Immersive Digital Musical Instrument.",
            "Emotion in Interactive Systems: Applying Transactional Analysis.",
            "Mobile Audio Distribution.",
            "Using Digital but Physical Surrogates to Mediate Awareness, Communication and Privacy in Media Spaces.",
            "Evaluating the Usability of the Siemens C10 Mobile Phone Going Beyond Common Practice in Industry.",
            "Matching Information and Ambient Media.",
            "From web-site to on-line presence; from internet to information."
        ]
    },
    {
        "name": "PUC",
        "year": "1998",
        "info": "Volume 2, 1998",
        "count": 25,
        "papers": [
            "Pager Messages as Self-Reminders: a Case Study of their Use in Memory Impairment.",
            "Developing Personal Technologies for the Field.",
            "Triggering Information by Context.",
            "The Design of SmartSpace: a Personal Working Environment.",
            "Palmtop Programmable Appliance Controls.",
            "The Shadow Approach: An Orphan Detection Protocol for Mobile Agents.",
            "Transparent Migration of Java-Based Mobile Agents: Capturing and Reestablishing the State of Java Programs.",
            "Mobile Agents and Intellectual Property Protection.",
            "Protecting the Computation Results of Free-Roaming Agents.",
            "Mobile Agent Applicability.",
            "Integrating Mobile Agents into The Mobile Middleware.",
            "Designing a Videoconference System for Active Networks.",
            "MASIF: The OMG Mobile Agent System Interoperability Facility.",
            "Present and Future Trends of Mobile Agent Technology.",
            "Special Issue on Software Agents and Issues in Personalisation: Technology to Accomodate Individual Users.",
            "Adaptive Personal Agents.",
            "SmartText: Using Agents Supporting Personalised Reading Comprehension.",
            "The Virtual Library Secretary - A User Model Based Software Agent.",
            "Service Contracts: Coordination of User-Adaptation in Open Service Architectures.",
            "Knowledgeable CyberBrokers for Electronic Commerce.",
            "Competing Agents in Agent-Mediated Institutions.",
            "Specification-Led Design for Interface Simulation, Collecting Use-Data, Interactive Help, Writing Manuals, Analysis, Comparing Alternative Designs.",
            "Context-Aware Personal Communication for Teleliving.",
            "Designing Information Artefacts for Knowledge Workers.",
            "Mobile Pen-Based Technologies for Drivers Licence Administration."
        ]
    },
    {
        "name": "PUC",
        "year": "1997",
        "info": "Volume 1, 1997",
        "count": 28,
        "papers": [
            "Pervasive computing.",
            "The symbiosis of man and machine.",
            "The future of personal technologies.",
            "Personal systems.",
            "Smart clothing.",
            "Antisedentary beigeless computing.",
            "A View from the Luminous Room.",
            "The Development of Video Dialtone Networks.",
            "Wearable Computers: Field Test Observations and System Design Guidelines.",
            "Software Agents and Agency: A Personal Information Management Perspective.",
            "Design for a Fax.",
            "Editorial.",
            "The Optimal Assignment of Cells in PCS Networks.",
            "Experience with an Automated Hoarding System.",
            "Disconnected Operation for Heterogeneous Servers: A Practical Approach.",
            "Adaptive Caching and Refreshment in Mobile Databases.",
            "Pro-Motion: Support for Mobile Database Access.",
            "Expanding a Distributed Deductive Database with Mobile Computing.",
            "Mobile Architecture for Wishard Memorial Hospital Ambulatory Service.",
            "Adaptation in Mobile Workflow Management.",
            "Editorial.",
            "A Touring Machine: Prototyping 3D Augmented Reality Systems for Exploring the Urban Environment.",
            "The Wearable Remembrance Agent: A System for Augmented Memory.",
            "Tactual Displays for Wearable Computing.",
            "Affective Wearables.",
            "A Wearable Computer-Based American Sign Language Recogniser.",
            "Wearable Computers for Performance Support: Initial Feasibility Study.",
            "Metronaut: A Wearable Computer with Sensing and Global Communication Capabilities."
        ]
    }
]