[
    {
        "name": "TOCHI",
        "year": "2022",
        "info": "Volume 29, 2022",
        "count": 27,
        "papers": [
            "Privacy and Safety on Social Networking Sites: Autistic and Non-Autistic Teenagers' Attitudes and Behaviors.",
            "LGBTQ Persons' Use of Online Spaces to Navigate Conception, Pregnancy, and Pregnancy Loss: An Intersectional Approach.",
            "From Collaborative Habituation to Everyday Togetherness: A Long-Term Study of Use of the Messaging Kettle.",
            "Towards a Unified and Efficient Command Selection Mechanism for Touch-Based Devices Using Soft Keyboard Hotkeys.",
            "Clarifying Agreement Calculations and Analysis for End-User Elicitation Studies.",
            "Hypothesis Formalization: Empirical Findings, Software Limitations, and Design Implications.",
            "Protecting Privacy on Mobile Apps: A Principal-Agent Perspective.",
            "Flud: A Hybrid Crowd-Algorithm Approach for Visualizing Biological Networks.",
            "Design and Evaluation of Accessible Collaborative Writing Techniques for People with Vision Impairments.",
            "Can Computers Outperform Humans in Detecting User Zone-Outs? Implications for Intelligent Interfaces.",
            "Social Contexts, Agency, and Conflicts: Exploring Critical Aspects of Design for Future Smart Home Technologies.",
            "Manipulating Interface Design Features Affects Children's Stop-And-Think Behaviours in a Counterintuitive-Problem Game.",
            "Chatbots Language Design: The Influence of Language Variation on User Experience with Tourist Assistant Chatbots.",
            "Can Unhappy Pictures Enhance the Effect of Personas? A User Experiment.",
            "Creating and Augmenting Keyboards for Extended Reality with the Keyboard Augmentation Toolkit.",
            "Exploring the Design Space for Human-Food-Technology Interaction: An Approach from the Lens of Eating Experiences.",
            "Documentation Matters: Human-Centered AI System to Assist Data Science Code Documentation in Computational Notebooks.",
            "Introduction to the Special Issue on Digital Touch: Reshaping Interpersonal Communicative Capacity and Touch Practices.",
            "ANISMA: A Prototyping Toolkit to Explore Haptic Skin Deformation Applications Using Shape-Memory Alloys.",
            "TickleFoot: Design, Development and Evaluation of a Novel Foot-Tickling Mechanism That Can Evoke Laughter.",
            "The Making of Meaning through Dyadic Haptic Affective Touch.",
            "Touching Our Breathing through Shape-Change: Monster, Organic Other, or Twisted Mirror.",
            "Speculative Design as a Collaborative Practice: Ameliorating the Consequences of Illiteracy through Digital Touch.",
            "Whose Touch is This?: Understanding the Agency Trade-Off Between User-Driven Touch vs. Computer-Driven Touch.",
            "It's Good to Talk: A Comparison of Using Voice Versus Screen-Based Interactions for Agent-Assisted Tasks.",
            "Seeing Colours: Addressing Colour Vision Deficiency with Vision Augmentations using Computational Glasses.",
            "Physecology: A Conceptual Framework to Describe Data Physicalizations in their Real-World Context."
        ]
    },
    {
        "name": "TOCHI",
        "year": "2021",
        "info": "Volume 28, 2021",
        "count": 47,
        "papers": [
            "Designing Deep Reinforcement Learning for Human Parameter Exploration.",
            "A Longitudinal Study of Pervasive Display Personalisation.",
            "Detecting Depression and Predicting its Onset Using Longitudinal Symptoms Captured by Passive Sensing: A Machine Learning Approach With Robust Feature Selection.",
            "The Matter of Tools: Designing, Using and Reflecting on New Tools for Emerging eTextile Craft Practices.",
            "Machete: Easy, Efficient, and Precise Continuous Custom Gesture Segmentation.",
            "Fast and Secure Authentication in Virtual Reality Using Coordinated 3D Manipulation and Pointing.",
            "The Nudge Puzzle: Matching Nudge Interventions to Cybersecurity Decisions.",
            "Filtering and Informing the Design Space: Towards Design-Space Thinking.",
            "Comparison of Common Ground Models for Human-Computer Dialogue: Evidence for Audience Design.",
            "\"It Must Include Rules\": Middle School Students' Computational Thinking with Computer Models in Science.",
            "The Purpose of Play: How HCI Games Research Fails Neurodivergent Populations.",
            "Towards Dynamic Checklists: Understanding Contexts of Use and Deriving Requirements for Context-Driven Adaptation.",
            "Establishing Context: AAC Device Adoption and Support in a Special-Education Setting.",
            "Embracing Four Tensions in Human-Computer Interaction Research with Marginalized People.",
            "CogTool+: Modeling Human Performance at Large Scale.",
            "Introduction: Performing Rurality with Computing.",
            "As a Squash Plant Grows: Social Textures of Sparse Internet Connectivity in Rural and Tribal Communities.",
            "A Sociocultural Explanation of Internet-Enabled Work in Rural Regions.",
            "Digital Technology at the Edge of Capitalism: Experiences from the Brazilian Amazon Rainforest.",
            "Rural Uncommoning: Women, Community Networks and the Enclosure of Life.",
            "Rural Islandness as a Lens for (Rural) HCI.",
            "Living in a City, Living a Rural Life: Understanding Second Generation Mingongs' Experiences with Technologies in China.",
            "Co-design Techniques for and with Children based on Physical Theatre Practice to promote Embodied Awareness.",
            "Investigating the Effects of Individual Cognitive Styles on Collaborative Gameplay.",
            "Designing for Youth-Centered Moderation and Community Governance in Minecraft.",
            "Do You Feel the Same? On the Robustness of Cued-Recall Debriefing for User Experience Evaluation.",
            "GAVIN: Gaze-Assisted Voice-Based Implicit Note-taking.",
            "Around-the-Head Tactile System for Supporting Micro Navigation of People with Visual Impairments.",
            "PLIERS: A Process that Integrates User-Centered Methods into Programming Language Design.",
            "Entity Recommendation for Everyday Digital Tasks.",
            "Investigating Usability and User Experience of Individually Verifiable Internet Voting Schemes.",
            "\"Citizens Too\": Safety Setting Collaboration Among Older Adults with Memory Concerns.",
            "Adopting Diffractive Reading to Advance HCI Research: A Case Study on Technology for Aging.",
            "An Exploration of Freehand Crossing Selection in Head-Mounted Augmented Reality.",
            "Lean Privacy Review: Collecting Users' Privacy Concerns of Data Practices at a Low Cost.",
            "Intermittent Control as a Model of Mouse Movements.",
            "Predictable Robots for Autistic Children - Variance in Robot Behaviour, Idiosyncrasies in Autistic Children's Characteristics, and Child-Robot Engagement.",
            "Introduction to the Special Issue on First-Person Methods in HCI.",
            "Validity and Rigour in Soma Design-Sketching with the Soma.",
            "Towards a Contemplative Research Framework for Training Self-Observation in HCI: A Study of Compassion Cultivation.",
            "Unpacking Non-Dualistic Design: The Soma Design Case.",
            "Examining Narrative Sonification: Using First-Person Retrospection Methods to Translate Radio Production to Interaction Design.",
            "Cracks in the Success Narrative: Rethinking Failure in Design Research through a Retrospective Trioethnography.",
            "A Systematic Literature Review of Empirical Methods and Risk Representation in Usable Privacy and Security Research.",
            "The Effect of Audio-Visual Smiles on Social Influence in a Cooperative Human-Agent Interaction Task.",
            "Generative Theories of Interaction.",
            "Remote VR Studies: A Framework for Running Virtual Reality Studies Remotely Via Participant-Owned HMDs."
        ]
    },
    {
        "name": "TOCHI",
        "year": "2020",
        "info": "Volume 27, 2020",
        "count": 46,
        "papers": [
            "Performing the Digital Self: Understanding Location-Based Social Networking, Territory, Space, and Identity in the City.",
            "Entanglement HCI The Next Wave?",
            "Reducing Perceived Waiting Time in Theme Park Queues via an Augmented Reality Game.",
            "Eye, Head and Torso Coordination During Gaze Shifts in Virtual Reality.",
            "PIV: Placement, Pattern, and Personalization of an Inconspicuous Vibrotactile Breathing Pacer.",
            "Confident Privacy Decision-Making in IoT Environments.",
            "How Interaction Designers Use Tools to Manage Ideas.",
            "The Unexpected Downside of Paying or Sending Messages to People to Make Them Walk: Comparing Tangible Rewards and Motivational Messages to Improve Physical Activity.",
            "Voices of the Social Sector: A Systematic Review of Stakeholder Voice in HCI Research with Nonprofit Organizations.",
            "The Five Strands of Living Lab: A Literature Study of the Evolution of Living Lab Concepts in HCI.",
            "Countdown Timer Speed: A Trade-off between Delay Duration Perception and Recall.",
            "An Activity Centered Approach to Nonvisual Computer Interaction.",
            "Expanding the Bounds of Seated Virtual Workspaces.",
            "Shelfie: A Framework for Designing Material Representations of Physical Activity Data.",
            "Tell Me About Yourself: Using an AI-Powered Chatbot to Conduct Conversational Surveys with Open-ended Questions.",
            "Ordinary User Experiences at Work: A Study of Greenhouse Growers.",
            "It's All in the Timing: Principles of Transient Distraction Illustrated with Vibrotactile Tasks.",
            "Disclosure, Privacy, and Stigma on Social Media: Examining Non-Disclosure of Distressing Experiences.",
            "Designing Digital Vertigo Experiences.",
            "Introduction to the Special Issue on HCI and the Body: Reimagining Women's Health.",
            "The Menstruating Entrepreneur Kickstarting a New Politics of Women's Health.",
            "Multiples Over Models: Interrogating the Past and Collectively Reimagining the Future of Menstrual Sensemaking.",
            "Taking the Long, Holistic, and Intersectional View to Women's Wellbeing.",
            "Troubling Design: A Design Program for Designing with Women's Health.",
            "Reimagining (Women's) Health: HCI, Gender and Essentialised Embodiment.",
            "The Fundamental Uncertainties of Mothering: Finding Ways to Honor Endurance, Struggle, and Contradiction.",
            "Woman-Centered Design through Humanity, Activism, and Inclusion.",
            "Commanding and Re-Dictation: Developing Eyes-Free Voice-Based Interaction for Editing Dictated Text.",
            "Translations and Boundaries in the Gap Between HCI Theory and Design Practice.",
            "Privacy Norms and Preferences for Photos Posted Online.",
            "Use of Intelligent Voice Assistants by Older Adults with Low Technology Use.",
            "TimeToFocus: Feedback on Interruption Durations Discourages Distractions and Shortens Interruptions.",
            "Shortcut Gestures for Mobile Text Editing on Fully Touch Sensitive Smartphones.",
            "Machine Learning in Mental Health: A Systematic Review of the HCI Literature to Support the Development of Effective and Implementable ML Systems.",
            "Supporting the Analysis of Safety Critical User Interfaces: An Exploration of Three Formal Tools.",
            "SMELL SPACE: Mapping out the Olfactory Design Space for Novel Interactions.",
            "Designing Hybrid Gifts.",
            "\"I Cannot Do All of This Alone\": Exploring Instrumental and Prayer Support in Online Health Communities.",
            "BodyWire-HCI: Enabling New Interaction Modalities by Communicating Strictly During Touch Using Electro-Quasistatic Human Body Communication.",
            "Privacy Risks, Emotions, and Social Media: A Coping Model of Online Privacy.",
            "Rehabilitation Games in Real-World Clinical Settings: Practices, Challenges, and Opportunities.",
            "Multimodal Coordination Measures to Understand Users and Tasks.",
            "Engagement by Design: An Empirical Study of the \"Reactions\" Feature on Facebook Business Pages.",
            "Necessary and Unnecessary Distractor Avoidance Movements Affect User Behaviors in Crossing Operations.",
            "Longer Delays in Rehearsal-based Interfaces Increase Expert Use.",
            "Exploring How Persons with Dementia and Care Partners Collaboratively Appropriate Information and Communication Technologies."
        ]
    },
    {
        "name": "TOCHI",
        "year": "2019",
        "info": "Volume 26, 2019",
        "count": 41,
        "papers": [
            "How Can Affect Be Detected and Represented in Technological Support for Physical Rehabilitation?",
            "It Is About What They Could Do with the Data: A User Perspective on Privacy in Smart Metering.",
            "How UX Practitioners Produce Findings in Usability Testing.",
            "Support for Carers of Young People with Mental Illness: Design and Trial of a Technology-Mediated Therapy.",
            "Understanding the Role of Interactive Machine Learning in Movement Interaction Design.",
            "Introduction to Human-Building Interaction (HBI): Interfacing HCI with Architecture and Urban Design.",
            "Do Architects and Designers Think about Interactivity Differently?",
            "Temporal Constraints in Human-Building Interaction.",
            "Designing to Distract: Can Interactive Technologies Reduce Visitor Anxiety in a Children's Hospital Setting?",
            "Exploring and Understanding the Role of Workshop Environments in Personal Fabrication Processes.",
            "WindowWall: Towards Adaptive Buildings with Interactive Windows as Ubiquitous Displays.",
            "Adaptive Architecture and Personal Data.",
            "Of Dolls and Men: Anticipating Sexual Intimacy with Robots.",
            "Automated Usability Evaluation of Virtual Reality Applications.",
            "Infrastructuring Public Service Transformation: Creating Collaborative Spaces between Communities and Institutions through HCI Research.",
            "Isopleth: Supporting Sensemaking of Professional Web Applications to Create Readily Available Learning Experiences.",
            "Music, Search, and IoT: How People (Really) Use Voice Assistants.",
            "The Role of Social Computing Technologies in Grassroots Movement Building.",
            "Enact: Reducing Designer-Developer Breakdowns When Prototyping Custom Interactions.",
            "Exploring Low-Occlusion Qwerty Soft Keyboard Using Spatial Landmarks.",
            "Ambiguity as a Resource to Inform Proto-Practices: The Case of Skin Conductance.",
            "Rethinking Technologies for Behavior Change: A View from the Inside of Human Change.",
            "Recov-R: Evaluation of a Home-Based Tailored Exergame System to Reduce Fall Risk in Seniors.",
            "Local Decision Pitfalls in Interactive Machine Learning: An Investigation into Feature Selection in Sentiment Analysis.",
            "Going to School on a Robot: Robot and User Interface Design Features that Matter.",
            "Objects with Intent: Designing Everyday Things as Collaborative Partners.",
            "What Do We Mean by \"Interaction\"? An Analysis of 35 Years of CHI.",
            "Concurrent Think-Aloud Verbalizations and Usability Problems.",
            "\"It's a girl thing\": Examining Challenges and Opportunities around Menstrual Health Education in India.",
            "Making Maps Available for Play: Analyzing the Design of Game Cartography Interfaces.",
            "Human-Machine Collaboration for Content Regulation: The Case of Reddit Automoderator.",
            "Susceptibility to Spear-Phishing Emails: Effects of Internet User Demographics and Email Content.",
            "Diversifying Future-Making Through Itinerative Design.",
            "Designing Meaningful Products in the Digital Age: How Users Value Their Technological Possessions.",
            "The Reality of Reality-Based Interaction: Understanding the Impact of a Framework as a Research Tool.",
            "Designing for Awareness in Interactions with Shared Systems: The DASS Framework.",
            "Improving User Experience of Eye Tracking-Based Interaction: Introspecting and Adapting Interfaces.",
            "Agency of Autistic Children in Technology Research - A Critical Literature Review.",
            "Attention Regulation Framework: Designing Self-Regulated Mindfulness Technologies.",
            "The Struggle for Recognition in Advanced Dementia: Implications for Experience-Centered Design.",
            "Rebuilding Social Capital in Refugees and Asylum Seekers."
        ]
    },
    {
        "name": "TOCHI",
        "year": "2018",
        "info": "Volume 25, 2018",
        "count": 35,
        "papers": [
            "Introduction: Reimagining Participatory Design - Emerging Voices.",
            "Amplifying Quiet Voices: Challenges and Opportunities for Participatory Design at an Urban Scale.",
            "Participatory Design and Participatory Research: An HCI Case Study with Young Forced Migrants.",
            "Participatory Design that Matters - Facing the Big Issues.",
            "Participatory Design in Emerging Civic Engagement Initiatives in the New Public Sector: Applying PD Concepts in Resource-Scarce Organizations.",
            "Utopias of Participation: Feminism, Design, and the Futures.",
            "The Editor's Spotlight: TOCHI Issue 25: 2.",
            "Digital Educational Games: Methodologies for Evaluating the Impact of Game Type.",
            "Workload Alerts - Using Physiological Measures of Mental Workload to Provide Feedback During Tasks.",
            "Ink: Increasing Worker Agency to Reduce Friction in Hiring Crowd Workers.",
            "Hidden Work and the Challenges of Scalability and Sustainability in Ambulatory Assisted Living.",
            "Online Harassment and Content Moderation: The Case of Blocklists.",
            "Interactive Sports Analytics: An Intelligent Interface for Utilizing Trajectories for Interactive Sports Play Retrieval and Analytics.",
            "The Editor's Spotlight: TOCHI Issue 25: 3.",
            "Digital Behaviour Change Interventions to Break and Form Habits.",
            "Personal Informatics for Sport: Meaning, Body, and Social Relations in Amateur and Elite Athletes.",
            "Collective Privacy Management in Social Media: A Cross-Cultural Validation.",
            "Fallacies of Agreement: A Critical Review of Consensus Assessment Methods for Gesture Elicitation.",
            "Design Guideline for Developing Safe Systems that Apply Electricity to the Human Body.",
            "Interpretive Impacts of Text Visualization: Mitigating Political Framing Effects.",
            "Older Adults' Deployment of 'Distrust'.",
            "Automatics: Dynamically Generating Fabrication Tasks to Adapt to Varying Contexts.",
            "Personal Mobile Messaging in Context: Chat Augmentations for Expressiveness and Awareness.",
            "BotMap: Non-Visual Panning and Zooming with an Actuated Tabletop Tangible Interface.",
            "Assisted Shifting of Electricity Use: A Long-Term Study of Managing Residential Heating.",
            "Infrastructural Inaccessibility: Tech Entrepreneurs in Occupied Palestine.",
            "Speed-Accuracy Tradeoff: A Formal Information-Theoretic Transmission Scheme (FITTS).",
            "Social Support, Reciprocity, and Anonymity in Responses to Sexual Abuse Disclosures on Social Media.",
            "Getting There: Barriers and Facilitators to Transportation Access in Underserved Communities.",
            "Fast and Precise Touch-Based Text Entry for Head-Mounted Augmented Reality with Variable Occlusion.",
            "Responding to Sensitive Disclosures on Social Media: A Decision-Making Framework.",
            "CheerOn: Facilitating Online Social Support for Novice Project-Based Learning Teams.",
            "From Being There to Watching: Shared and Dedicated Telepresence Robot Usage at Academic Conferences.",
            "Empirical Measurement of Perceived Privacy Risk.",
            "Blending Human and Artificial Intelligence to Support Autistic Children's Social Communication Skills."
        ]
    },
    {
        "name": "TOCHI",
        "year": "2017",
        "info": "Volume 24, 2017",
        "count": 43,
        "papers": [
            "The Editor's Spotlight: TOCHI Issue 24: 1.",
            "Colors - Messengers of Concepts: Visual Design Mining for Learning Color Semantics.",
            "Introducing Mood Self-Tracking at Work: Empirical Insights from Call Centers.",
            "How People Write Together Now: Beginning the Investigation with Advanced Undergraduates in a Project Course.",
            "Sharing Policies in Multiuser Privacy Scenarios: Incorporating Context, Preferences, and Arguments in Decision Making.",
            "Beyond Just Text: Semantic Emoji Similarity Modeling to Support Expressive Communication 👫📲😃.",
            "WaitSuite: Productive Use of Diverse Waiting Moments.",
            "The Editor's Spotlight: TOCHI Issue 24: 2 Extravaganza - Special Issue on End-User Design for the Internet of Things, and The TOCHI Best Paper Award 2016.",
            "Editorial: End-User Development for the Internet of Things.",
            "Visual Simple Transformations: Empowering End-Users to Wire Internet of Things Objects.",
            "Exploring End User Programming Needs in Home Automation.",
            "Empowering End Users to Customize their Smart Environments: Model, Composition Paradigms, and Domain-Specific Tools.",
            "Natural Contextual Reasoning for End Users.",
            "Personalization of Context-Dependent Applications Through Trigger-Action Rules.",
            "Improv: An Input Framework for Improvising Cross-Device Interaction by Demonstration.",
            "Exploring DIY Practices of Complex Home Technologies.",
            "3D Printers as Sociable Technologies: Taking Appropriation Infrastructures to the Internet of Things.",
            "The Editor's Spotlight: TOCHI Issue 24: 3.",
            "Designing for Transformative Play.",
            "Gaze-Contingent Auditory Displays for Improved Spatial Attention in Virtual Reality.",
            "Educational Game and Intelligent Tutoring System: A Classroom Study and Comparative Design Analysis.",
            "Toward a Geographic Understanding of the Sharing Economy: Systemic Biases in UberX and TaskRabbit.",
            "Motion Correlation: Selecting Objects by Matching Their Movement.",
            "Collaborating around Digital Tabletops: Children's Physical Strategies from India, the UK and Finland.",
            "Designing for Bodily Interplay in Social Exertion Games.",
            "The Editor's Spotlight: TOCHI Issue 24: 4.",
            "Crafting Interactive Decoration.",
            "Control Theoretic Models of Pointing.",
            "Design and Evaluation of RaPIDO, A Platform for Rapid Prototyping of Interactive Outdoor Games.",
            "Investigating the Post-Training Persistence of Expert Interaction Techniques.",
            "Using Worker Self-Assessments for Competence-Based Pre-Selection in Crowdsourcing Microtasks.",
            "The Editor's Spotlight: TOCHI Issue 24: 5.",
            "Improving the Efficacy of Games for Change Using Personalization Models.",
            "Technology Acceptance and User Experience: A Review of the Experiential Component in HCI.",
            "Computational Support for Functionality Selection in Interaction Design.",
            "Metatation: Annotation as Implicit Interaction to Bridge Close and Distant Reading.",
            "BubbleView: An Interface for Crowdsourcing Image Importance Maps and Tracking Visual Attention.",
            "The Editor's Spotlight: TOCHI Issue 24: 6.",
            "Opening up the Design Space of Neurofeedback Brain-Computer Interfaces for Children.",
            "A Unified Model for User Identification on Multi-Touch Surfaces: A Survey and Meta-Analysis.",
            "No Need to Laugh Out Loud: Predicting Humor Appraisal of Comic Strips Based on Physiological Signals in a Realistic Environment.",
            "Moneywork: Practices of Use and Social Interaction around Digital and Analog Money.",
            "Text in Talk: Lightweight Messages in Co-Present Interaction."
        ]
    },
    {
        "name": "TOCHI",
        "year": "2016",
        "info": "Volume 23, 2016",
        "count": 40,
        "papers": [
            "Editorial: Welcome to a New Era for TOCHI.",
            "The Editor's Spotlight: TOCHI Issue 23: 1.",
            "Understanding Programming Expertise: An Empirical Study of Phasic Brain Wave Changes.",
            "Designing Interactions with Multilevel Auditory Displays in Mobile Audio-Augmented Reality.",
            "Physiopucks: Increasing User Motivation by Combining Tangible and Implicit Physiological Interaction.",
            "The Design and Evaluation of Interfaces for Navigating Gigapixel Images in Digital Pathology.",
            "Understanding Mass Interactions in Online Sports Viewing: Chatting Motives and Usage Patterns.",
            "The Editor's Spotlight: TOCHI Issue 23: 2.",
            "People Do Not Feel Guilty About Exploiting Machines.",
            "On Lions, Impala, and Bigraphs: Modelling Interactions in Physical/Virtual Spaces.",
            "The To-and-Fro of Sense Making: Supporting Users' Active Indexing in Museums.",
            "The Effects of Changing Projection Geometry on Perception of 3D Objects on and Around Tabletops.",
            "Accessible Play in Everyday Spaces: Mixed Reality Gaming for Adult Powered Chair Users.",
            "The Editor's Spotlight: TOCHI Issue 23: 3.",
            "Mobile Phones as Amplifiers of Social Inequality among Rural Kenyan Women.",
            "Design and Usability of Interactive User Profiles for Online Health Communities.",
            "SlideSpace: Heuristic Design of a Hybrid Presentation Medium.",
            "Target Acquisition vs. Expressive Motion: Dynamic Pitch Warping for Intonation Correction.",
            "Coupling Interactions and Performance: Predicting Team Performance from Thin Slices of Conflict.",
            "Diminished Control in Crowdsourcing: An Investigation of Crowdworker Multitasking Behavior.",
            "The Editor's Spotlight: TOCHI Issue 23: 4.",
            "Design for Rituals of Letting Go: An Embodiment Perspective on Disposal Practices Informed by Grief Therapy.",
            "Increasing Activity in Enterprise Online Communities Using Content Recommendation.",
            "Technology-Mediated Memory: Is Technology Altering Our Memories And Interfering With Well-Being?",
            "First Impressions in Human-Agent Virtual Encounters.",
            "Tariff Agent: Interacting with a Future Smart Energy System at Home.",
            "Adding Physical Objects to an Interactive Game Improves Learning and Enjoyment: Evidence from EarthShake.",
            "The Editor's Spotlight: TOCHI Issue 23: 5.",
            "Bearing an Open \"Pandora's Box\": HCI for Reconciling Everyday Food and Sustainability.",
            "ICT-Based Fall Prevention System for Older Adults: Qualitative Results from a Long-Term Field Study.",
            "Applying the Norman 1986 User-Centered Model to Post-WIMP UIs: Theoretical Predictions and Empirical Outcomes.",
            "Design of A GPS Monitoring System for Dementia Care and its Challenges in Academia-Industry Project.",
            "Investigating Expressive Tactile Interaction Design in Artistic Graphical Representations.",
            "Examining The Role of Smart TVs and VR HMDs in Synchronous At-a-Distance Media Consumption.",
            "The Editor's Spotlight: TOCHI Issue 23: 6.",
            "Leisure and Work, Good and Bad: The Role of Activity Domain and Valence in Modeling User Experience.",
            "Exploring Low-Cost, Internet-Free Information Access for Resource-Constrained Communities.",
            "Commensality and the Social Use of Technology during Family Mealtime.",
            "Managing Visibility and Validity of Distress Calls with an Ad-Hoc SOS System.",
            "Using Mobile Eye-Trackers to Unpack the Perceptual Benefits of a Tangible User Interface for Collaborative Learning."
        ]
    },
    {
        "name": "TOCHI",
        "year": "2015",
        "info": "Volume 22, 2015",
        "count": 34,
        "papers": [
            "Technological and Organizational Adaptation of EMR Implementation in an Emergency Department.",
            "An Age-Old Problem: Examining the Discourses of Ageing in HCI and Strategies for Future Research.",
            "Sharing Domestic Life through Long-Term Video Connections.",
            "To Call or to Recall? That's the Research Question.",
            "Introduction to Online Learning at Scale.",
            "Motivation as a Lens to Understand Online Learners: Toward Data-Driven Design with the OLEI Scale.",
            "OverCode: Visualizing Variation in Student Solutions to Programming Problems at Scale.",
            "Large-Scale Educational Campaigns.",
            "How Can Automatic Feedback Help Students Construct Automata?",
            "Teaching Recommender Systems at Large Scale: Evaluation and Lessons Learned from a Hybrid MOOC.",
            "The Challenges of Using Biodata in Promotional Filmmaking.",
            "Adding Human Learning in Brain-Computer Interfaces (BCIs): Towards a Practical Control Modality.",
            "Automatic Internationalization for Just In Time Localization of Web-Based User Interfaces.",
            "Automated Computational Cognitive-Modeling: Goal-Specific Analysis for Large Websites.",
            "Sustainable Making? Balancing Optimism and Criticism in HCI Discourse.",
            "Does Herzberg's Notion of Hygienes and Motivators Apply to User Experience?",
            "Social Haystack: Dynamic Quality Assessment of Citizen-Generated Content during Emergencies.",
            "SonicAIR: Supporting Independent Living with Reciprocal Ambient Audio Awareness.",
            "Teaching and Developing Social and Emotional Skills with Technology.",
            "Placing in Age: Transitioning to a New Home in Later Life.",
            "Mid-Air Pointing on Ultra-Walls.",
            "Differences and Similarities between Finger and Pen Stroke Gestures on Stationary and Mobile devices.",
            "An Inclusive, Value Sensitive Design Perspective on Future Identity Technologies.",
            "The Ethical Implications of HCI's Turn to the Cultural.",
            "Predicting User Performance and Learning in Human-Computer Interaction with the Herbal Compiler.",
            "Conceptual Priming for In-game BCI Training.",
            "TOCHI Editor-in-Chief Transition: Farewell from Shumin Zhai, Welcome Ken Hinckley.",
            "Visualizing Sets with Linear Diagrams.",
            "Deterring Cheating in Online Environments.",
            "Reciprocal Drag-and-Drop.",
            "Action-Transferred Navigation Technique Design Approach Supporting Human Spatial Learning.",
            "Internet Censorship in China: Examining User Awareness and Attitudes.",
            "Mapping User Preference to Privacy Default Settings.",
            "Self-Care Technologies in HCI: Trends, Tensions, and Opportunities."
        ]
    },
    {
        "name": "TOCHI",
        "year": "2014",
        "info": "Volume 21, 2014/2015",
        "count": 35,
        "papers": [
            "Editorial: TOCHI turns twenty.",
            "Age differences in credibility judgments of online health information.",
            "Emergent effects in multimodal feedback from virtual buttons.",
            "Disambiguation of imprecise input with one-dimensional rotational text entry.",
            "Moderated online social therapy: Designing and evaluating technology for mental health.",
            "Understand users' comprehension and preferences for composing information visualizations.",
            "Designing interfaces for multiple-goal environments: Experimental insights from in-vehicle speech interfaces.",
            "Complementing text entry evaluations with a composition task.",
            "On the benefits of providing versioning support for end users: An empirical study.",
            "A large-scale study of daily information needs captured in situ.",
            "Up close and personal: Collaborative work on a high-resolution multitouch wall display.",
            "User interfaces for smart things - A generative approach with semantic interaction descriptions.",
            "E-government intermediaries and the challenges of access and trust.",
            "Using Metrics of Curation to Evaluate Information-Based Ideation.",
            "The Hybrid Artisans: A Case Study in Smart Tools.",
            "Family Rituals and the Potential for Interaction Design: A Study of Christmas.",
            "Modeling What Friendship Patterns on Facebook Reveal About Personality and Social Capital.",
            "Reciprocal Habituation: A Study of Older People and the Kinect.",
            "Estrellita: A Mobile Capture and Access Tool for the Support of Preterm Infants and Their Caregivers.",
            "My Self and You: Tension in Bodily Sharing of Experience.",
            "Quantifying the Creativity Support of Digital Tools through the Creativity Support Index.",
            "Crowdsourced Monolingual Translation.",
            "Health Vlogs as Social Support for Chronic Illness Management.",
            "Optimistic Programming of Touch Interaction.",
            "An Assisted Photography Framework to Help Visually Impaired Users Properly Aim a Camera.",
            "Ad Hoc Participation in Situation Assessment: Supporting Mobile Collaboration in Emergencies.",
            "Does Distance Still Matter? Revisiting the CSCW Fundamentals on Distributed Collaboration.",
            "Exploring and Understanding Unintended Touch during Direct Pen Interaction.",
            "Introduction to the Special Issue on Physiological Computing for Human-Computer Interaction.",
            "Informing the Design of Novel Input Methods with Muscle Coactivation Clustering.",
            "Understanding Gesture Expressivity through Muscle Sensing.",
            "ColorBless: Augmenting Visual Information for Colorblind People with Binocular Luster Effect.",
            "Measurable Decision Making with GSR and Pupillary Analysis for Intelligent User Interface.",
            "A Framework for Psychophysiological Classification within a Cultural Heritage Context Using Interest.",
            "Designing Implicit Interfaces for Physiological Computing: Guidelines and Lessons Learned Using fNIRS."
        ]
    },
    {
        "name": "TOCHI",
        "year": "2013",
        "info": "Volume 20, 2013",
        "count": 36,
        "papers": [
            "Introduction to the special issue on the theory and practice of embodied interaction in HCI and interaction design.",
            "Epilogue: Where the action was, wasn't, should have been, and might yet be.",
            "Embodied cognition and the magical future of interaction design.",
            "Enabling the blind to see gestures.",
            "On the naturalness of touchless: Putting the \"interaction\" back into NUI.",
            "Embedded interaction: The accomplishment of actions in everyday and video-mediated environments.",
            "Moving and making strange: An embodied approach to movement-based interaction design.",
            "Interaction design for and with the lived body: Some implications of merleau-ponty's phenomenology.",
            "Predicting whether users view dynamic content on the world wide web.",
            "Influence of personality on satisfaction with mobile phone services.",
            "Negotiating food waste: Using a practice lens to inform design.",
            "Uncovering practices of making energy consumption accountable: A phenomenological inquiry.",
            "Introduction to the Special Issue of \"The Turn to The Wild\".",
            "Performance-Led Research in the Wild.",
            "Of Catwalk Technologies and Boundary Creatures.",
            "Wild at Home: The Neighborhood as a Living Laboratory for HCI.",
            "P-LAYERS - A Layered Framework Addressing the Multifaceted Issues Facing Community-Supporting Public Display Deployments.",
            "Sharing Stories \"in the Wild\": A Mobile Storytelling Case Study Using StoryKit.",
            "Wild in the Laboratory: A Discussion of Plans and Situated Actions.",
            "Introduction to the special issue on practice-oriented approaches to sustainable HCI.",
            "Practices as a unit of design: An exploration of theoretical guidelines in a study on bathing.",
            "Walking and the social life of solar charging in rural africa.",
            "A sustainable design fiction: Green practices.",
            "Collapse informatics and practice: Theory, method, and design.",
            "Applying the lens of sensory ethnography to sustainable HCI.",
            "Commentaries on the special issue on practice-oriented approaches to sustainable HCI.",
            "TaskGenies: Automatically Providing Action Plans Helps People Complete Tasks.",
            "Evaluating a Tool for Improving Accessibility to Charts and Graphs.",
            "Reviewing and Extending the Five-User Assumption: A Grounded Procedure for Interaction Evaluation.",
            "Health Mashups: Presenting Statistical Patterns between Wellbeing Data and Context in Natural Language to Promote Behavior Change.",
            "Exploring Sustainable Practices in Workplace Settings through Visualizing Electricity Consumption.",
            "Complex activity recognition using context-driven activity theory and activity signatures.",
            "Peer and self assessment in massive online classes.",
            "Crowdfunding: Motivations and deterrents for participation.",
            "A surrogate competition approach to enhancing game-based learning.",
            "Let's jam the reactable: Peer learning during musical improvisation with a tabletop tangible interface."
        ]
    },
    {
        "name": "TOCHI",
        "year": "2012",
        "info": "Volume 19, 2012",
        "count": 32,
        "papers": [
            "Mechanisms for collaboration: A design and evaluation framework for multi-user interfaces.",
            "Conceptualizing and advancing research networking systems.",
            "Evaluating and understanding the usability of a pen-based command system for interactive paper.",
            "Are we there yet?: The role of gender on the effectiveness and efficiency of user-robot communication in navigational tasks.",
            "End-user debugging strategies: A sensemaking perspective.",
            "Experiencing coincidence during digital music listening.",
            "Using context to reveal factors that affect physical activity.",
            "WindowScape: Lessons learned from a task-centric window manager.",
            "Dimensions of Concern: A Method to Use Cognitive Dimensions to Evaluate Interfaces.",
            "Study of Polynomial Mapping Functions in Video-Oculography Eye Trackers.",
            "User-Experience from an Inference Perspective.",
            "The Moderating Effects of Utilitarian and Hedonic Values on Information Technology Continuance.",
            "Teamwork Errors in Trauma Resuscitation.",
            "\"Spindex\" (Speech Index) Enhances Menus on Touch Screen Devices with Tapping, Wheeling, and Flicking.",
            "Supporting Personal Narrative for Children with Complex Communication Needs.",
            "Backtracking Events as Indicators of Usability Problems in Creation-Oriented Applications.",
            "Window brokers: Collaborative display space control.",
            "Designing a multi-slate reading environment to support active reading activities.",
            "\"Without the clutter of unimportant words\": Descriptive keyphrases for text visualization.",
            "A predictive speller controlled by a brain-computer interface based on motor imagery.",
            "Crafting technology: Reimagining the processes, materials, and cultures of electronics.",
            "The impact of interface affordances on human ideation, problem solving, and inferential reasoning.",
            "Strong concepts: Intermediate-level knowledge in interaction design research.",
            "Co-narrating a conflict: An interactive tabletop to facilitate attitudinal shifts.",
            "ExoBuilding: Physiologically Driven Adaptive Architecture.",
            "An Empirical Study of the \"Prototype Walkthrough\": A Studio-Based Activity for HCI Education.",
            "Beyond Recommendations: Local Review Web Sites and Their Impact.",
            "Two-Part Models Capture the Impact of Gain on Pointing Performance.",
            "Enriching Archaeological Parks with Contextual Sounds and Mobile Technology.",
            "All You Need is Love: Current Strategies of Mediating Intimate Relationships through Technology.",
            "What Does Touch Tell Us about Emotions in Touchscreen-Based Gameplay?",
            "Physical Activity Motivating Games: Be Active and Get Your Own Reward."
        ]
    },
    {
        "name": "TOCHI",
        "year": "2011",
        "info": "Volume 18, 2011",
        "count": 23,
        "papers": [
            "An exploration of relations between visual appeal, trustworthiness and perceived usability of homepages.",
            "Designing mobile interfaces for novice and low-literacy users.",
            "Blended interaction spaces for distributed team collaboration.",
            "Sketching interactive systems with sketchify.",
            "Towards a framework of publics: Re-encountering media sharing and its user.",
            "Design and evaluation of a command recommendation system for software applications.",
            "Measuring multitasking behavior with activity-based metrics.",
            "Improving performance, perceived usability, and aesthetics with culturally adaptive user interfaces.",
            "The organization of home media.",
            "Walking improves your cognitive map in environments that are large-scale and large in extent.",
            "Creating the spectacle: Designing interactional trajectories through spectator interfaces.",
            "Homogeneous physio-behavioral visual and mouse-based biometric.",
            "Effects of motor scale, visual scale, and quantization on small target acquisition difficulty.",
            "XICE windowing toolkit: Seamless display annexation.",
            "The relationship of action research to human-computer interaction.",
            "Two-handed marking menus for multitouch devices.",
            "Signing on the tactile line: A multimodal system for teaching handwriting to blind children.",
            "Introduction: Social media and collaborative systems for crisis management.",
            "High reliability virtual organizations: Co-adaptive technology and organizational structures in tsunami warning systems.",
            "Socio-cognitive aspects of interoperability: Understanding communication task environments among different organizations.",
            "Technology-mediated social arrangements to resolve breakdowns in infrastructure during ongoing disruption.",
            "Supporting common ground and awareness in emergency management planning: A design research project.",
            "The team coordination game: Zero-fidelity simulation abstracted from fire emergency response practice."
        ]
    },
    {
        "name": "TOCHI",
        "year": "2010",
        "info": "Volume 17, 2010",
        "count": 18,
        "papers": [
            "Editorial: Data mining for understanding user needs.",
            "Brief encounters: Sensing, modeling and visualizing urban mobility and copresence networks.",
            "Mining problem-solving strategies from HCI data.",
            "Potential for personalization.",
            "Experiments on the preference-based organization interface in recommender systems.",
            "Personalization via friendsourcing.",
            "Effects of facial similarity on user responses to embodied agents.",
            "Complex interaction.",
            "Foundations for designing and evaluating user interfaces based on the crossing paradigm.",
            "On human remains: Values and practice in the home archiving of cherished objects.",
            "SAK: Scanning ambiguous keyboard for efficient one-key text entry.",
            "Semantic imitation in social tagging.",
            "A model of novice and expert navigation performance in constrained-input interfaces.",
            "Indexicality: Understanding mobile human-computer interaction in context.",
            "Oasis: A framework for linking notification delivery to the perceptual structure of goal-directed tasks.",
            "Time warp sports for internet television.",
            "Interaction design for mobile product recommendation agents: Supporting users' decisions in retail stores.",
            "Parallel prototyping leads to better design results, more divergence, and increased self-efficacy."
        ]
    },
    {
        "name": "TOCHI",
        "year": "2009",
        "info": "Volume 16, 2009",
        "count": 21,
        "papers": [
            "Enabling nonexpert construction of basic sensor-based systems.",
            "Using direct and indirect input devices: Attention demands and age-related differences.",
            "Experiences with recombinant computing: Exploring ad hoc interoperability in evolving digital networks.",
            "Shifting the focus from accuracy to recallability: A study of informal note-taking on mobile information technologies.",
            "The benefits of using a walking interface to navigate virtual environments.",
            "The calendar is crucial: Coordination and awareness through the family calendar.",
            "Out on the town: A socio-physical approach to the design of a context-aware urban guide.",
            "The ins and outs of home networking: The case for useful and usable domestic networking.",
            "Rapid prototyping and evaluation of in-vehicle interfaces.",
            "Activity-based computing for medical work in hospitals.",
            "Kansuke: A logograph look-up interface based on a few modified stroke prototypes.",
            "Computer-supported access control.",
            "Can direct manipulation lower the barriers to computer programming and promote transfer of training? An experimental study.",
            "The ModelCraft framework: Capturing freehand annotations and edits to facilitate the 3D model design process using a digital pen.",
            "Unpacking the television: User practices around a changing technology.",
            "Introduction to the special issue on UIDL for next-generation user interfaces.",
            "Creating a lightweight user interface description language: An overview and analysis of the personal universal controller project.",
            "ICOs: A model-based user interface description technique dedicated to interactive systems addressing usability, reliability and scalability.",
            "MARIA: A universal, declarative, multiple abstraction-level language for service-oriented applications in ubiquitous environments.",
            "A specification paradigm for the design and implementation of tangible user interfaces.",
            "A natural, tiered and executable UIDL for 3D user interfaces based on Concept-Oriented Design."
        ]
    },
    {
        "name": "TOCHI",
        "year": "2008",
        "info": "Volume 15, 2008",
        "count": 18,
        "papers": [
            "An Integrated Approach for Modeling Learning Patterns of Students in Web-Based Instruction: A Cognitive Style Perspective.",
            "Strategy-Based Instruction: Lessons Learned in Teaching the Effective and Efficient Use of Computer Applications.",
            "Investigating the Roles of Knowledge and Cognitive Abilities in Older Adult Information Seeking on the Web.",
            "Data Sonification for Users with Visual Impairment: A Case Study with Georeferenced Data.",
            "A New Framework for Theory-Based Interaction Design Applied to Serendipitous Information Retrieval.",
            "Queuing Network Modeling of Transcription Typing.",
            "The anatomy of prototypes: Prototypes as filters, prototypes as manifestations of design ideas.",
            "From privacy methods to a privacy toolbox: Evaluation shows that heuristics are complementary.",
            "Making place for clutter and other ideas of home.",
            "Introduction to special issue on the aesthetics of interaction.",
            "The aesthetics of emergence: Co-constructed interactions.",
            "Interfaces with the ineffable: Meeting aesthetic experience on its own terms.",
            "Performing perception - staging aesthetics of interaction.",
            "Introduction to special issue on the aesthetics of interaction.",
            "Towards a theory of user judgment of aesthetics and user interface quality.",
            "Tangled interaction: On the expressiveness of tangible user interfaces.",
            "The soft qualities of interaction.",
            "Aesthetics and experience-centered design."
        ]
    },
    {
        "name": "TOCHI",
        "year": "2007",
        "info": "Volume 14, 2007",
        "count": 21,
        "papers": [
            "Model-based evaluation of expert cell phone menu interaction.",
            "PRISM interaction for enhancing control in immersive virtual environments.",
            "A field evaluation of an adaptable two-interface design for feature-rich software.",
            "Design parameters of rating scales for web sites.",
            "Approaching and leave-taking: Negotiating contact in computer-mediated communication.",
            "Untangling the usability of fisheye menus.",
            "Constructing reality: A study of remote, hands-on, and simulated laboratories.",
            "Modeling the effects of delayed haptic and visual feedback in a collaborative virtual environment.",
            "Evaluating the boundary conditions of the technology acceptance model: An exploratory investigation.",
            "SADIe: Structural semantics for accessibility and device independence.",
            "Introduction to special issue on computers and accessibility.",
            "Web accessibility for individuals with cognitive deficits: A comparative study between an existing commercial Web and its cognitively accessible equivalent.",
            "Analysis of navigability of Web applications for improving blind usability.",
            "Evaluating DANTE: Semantic transcoding for visually disabled users.",
            "Providing signed content on the Internet by synthesized animation.",
            "Proactive displays: Supporting awareness in fluid social environments.",
            "Subjunctive interfaces: Extending applications to support parallel setup, viewing and control of alternative scenarios.",
            "Papiercraft: A gesture-based command system for interactive paper.",
            "Comparing usability of one-way and multi-way constraints for diagram editing.",
            "Metaphors of human thinking for usability inspection and design.",
            "Understanding changes in mental workload during execution of goal-directed tasks and its application for interruption management."
        ]
    },
    {
        "name": "TOCHI",
        "year": "2006",
        "info": "Volume 13, 2006",
        "count": 19,
        "papers": [
            "Blur filtration fails to preserve privacy for home-based video conferencing.",
            "Queueing Network-Model Human Processor (QN-MHP): A computational architecture for multitask performance in human-machine systems.",
            "Physically large displays improve performance on spatial tasks.",
            "Can you see me now?",
            "User interfaces for privacy agents.",
            "Zooming versus multiple window interfaces: Cognitive costs of visual comparisons.",
            "Economic and subjective measures of the perceived value of aesthetics and usability.",
            "Investigating interaction in CAVE virtual environments.",
            "Spatial graph grammars for graphical user interfaces.",
            "Introduction to the special issue on information systems for an aging society.",
            "Shared family calendars: Promoting symmetry and accessibility.",
            "Designing a portal for older users: A case study of an industrial/academic collaboration.",
            "Leveraging data complexity: Pupillary behavior of older adults with visual impairment during HCI.",
            "Trends, similarities, and differences in the usage of teen and senior public online newsgroups.",
            "Chatting with teenagers: Considering the place of chat technologies in teen life.",
            "Navigating on handheld displays: Dynamic versus static peephole navigation.",
            "Analyzing the input stream for character- level errors in unconstrained text entry evaluations.",
            "The reification of metaphor as a design tool.",
            "Transparent adaptation of single-user applications for multi-user real-time collaboration."
        ]
    },
    {
        "name": "TOCHI",
        "year": "2005",
        "info": "Volume 12, 2005",
        "count": 24,
        "papers": [
            "Introduction to sensing-based interaction.",
            "Expected, sensed, and desired: A framework for designing sensing-based interaction.",
            "Foreground and background interaction with sensor-enhanced mobile devices.",
            "Designing mediation for context-aware applications.",
            "Token+constraint systems for tangible interaction with digital information.",
            "Predicting human interruptibility with sensors.",
            "Introduction.",
            "Making by making strange: Defamiliarization and the design of domestic technologies.",
            "Social empowerment and exclusion: A case study on digital libraries.",
            "A multilevel analysis of sociability, usability, and community dynamics in an online health community.",
            "Socio-technical environments supporting people with cognitive disabilities using public transportation.",
            "Voter-centered design: Toward a voter decision support system.",
            "Establishing and maintaining long-term human-computer relationships.",
            "The language of privacy: Learning from video media space analysis and design.",
            "Introduction to the special section on recommender systems.",
            "Designing and evaluating kalas: A social navigation system for food recipes.",
            "Social matching: A framework and research agenda.",
            "A probabilistic approach to modeling two-dimensional pointing.",
            "Benefits of merging command selection and direct manipulation.",
            "An investigation into the effects of Text-To-Speech voice and 3D avatars on the perception of presence and flow of live help in electronic commerce.",
            "Managing availability: Supporting lightweight negotiations to handle interruptions.",
            "Fitts' law and expanding targets: Experimental studies and designs for user interfaces.",
            "High-cost banner blindness: Ads increase perceived workload, hinder visual search, and are forgotten.",
            "Putting computing in context: An infrastructure to support extensible context-enhanced collaborative applications."
        ]
    },
    {
        "name": "TOCHI",
        "year": "2004",
        "info": "Volume 11, 2004",
        "count": 16,
        "papers": [
            "Crossing the divide.",
            "Improving graphical information system model use with elision and connecting lines.",
            "Patterns of cooperative interaction: Linking ethnomethodology and design.",
            "DateLens: A fisheye calendar interface for PDAs.",
            "Lessons learned from eClass: Assessing automated capture and access in the classroom.",
            "In pursuit of desktop evolution: User problems and practices with modern desktop systems.",
            "User interface design with matrix algebra.",
            "Introduction to mobile and adaptive conversational interfaces.",
            "multithreaded context for robust conversational interfaces: Context-sensitive speech recognition and interpretation of corrective fragments.",
            "ISIS: an adaptive, trilingual conversational system with interleaving interaction and delegation dialogs.",
            "Toward adaptive conversational interfaces: Modeling speech convergence with animated personas.",
            "Using confidence scores to improve hands-free speech based navigation in continuous dictation systems.",
            "Differences in pointing task performance between preschool children and adults using mice.",
            "A study of web usability for older adults seeking online health resources.",
            "\"Who's in charge here?\" communicating across unequal computer platforms.",
            "ContactMap: Organizing communication in a social desktop."
        ]
    },
    {
        "name": "TOCHI",
        "year": "2003",
        "info": "Volume 10, 2003",
        "count": 14,
        "papers": [
            "Diagramming information structures using 3D perceptual primitives.",
            "The effects of information scent on visual search in the hyperbolic tree browser.",
            "Experiments in social data mining: The TopicShop system.",
            "Designing human-computer interfaces for quadriplegic people.",
            "Reading patterns and usability in visualizations of electronic documents.",
            "Evaluating a scientific collaboratory: Results of a controlled experiment.",
            "ScentTrails: Integrating browsing and searching on the Web.",
            "Effects of scent and breadth on use of site-specific search on e-commerce Web sites.",
            "Are you looking at me? Eye contact and desktop video conferencing.",
            "Automatic generation of intelligent diagram editors.",
            "Introduction to multiple and collaborative tasks.",
            "Task analysis for groupware usability evaluation: Modeling shared-workspace tasks with the mechanics of collaboration.",
            "A model for notification systems evaluation - assessing user goals for multitasking activity.",
            "Towards modeling individual and collaborative construction of jigsaws using task knowledge structures (TKS)."
        ]
    },
    {
        "name": "TOCHI",
        "year": "2002",
        "info": "Volume 9, 2002",
        "count": 15,
        "papers": [
            "Consistency maintenance in real-time collaborative graphics editing systems.",
            "The importance of translucence in mobile computing systems.",
            "Introduction to the new usability.",
            "The usability of everyday technology: emerging and fading opportunities.",
            "From use to presence: on the expressions and aesthetics of everyday computational things.",
            "Beyond the handset: designing for wireless communications usability.",
            "The design collaboratorium: a place for usability design.",
            "Multimodal human discourse: gesture and speech.",
            "Cooperative visual manipulation of music notation.",
            "Rivalry and interference with a head-mounted display.",
            "Appendices A-D: A scalable method for deductive generalization in the spreadsheet paradigm.",
            "A scalable method for deductive generalization in the spreadsheet paradigm.",
            "Symmetric and asymmetric action integration during cooperative object manipulation in virtual environments.",
            "Undo as concurrent inverse in group editors.",
            "Navigation patterns and usability of zoomable user interfaces with and without an overview."
        ]
    },
    {
        "name": "TOCHI",
        "year": "2001",
        "info": "Volume 8, 2001",
        "count": 12,
        "papers": [
            "Drag-and-drop versus point-and-click mouse interaction styles for children.",
            "Role of interface manipulation style and scaffolding on cognition and concept learning in learnware.",
            "Multimodal error correction for speech user interfaces.",
            "Usability analysis with Markov models.",
            "An interface for melody input.",
            "The character, value, and management of personal paper archives.",
            "Visual search and mouse-pointing in labeled versus unlabeled two-dimensional visual hierarchies.",
            "Applying cartoon animation techniques to graphical user interfaces.",
            "Using model dataflow graphs to reduce the storage requirements of constraints.",
            "The Cassowary linear arithmetic constraint solving algorithm.",
            "Integrating paper and digital information on EnhancedDesk: a method for realtime finger tracking on an augmented desk system.",
            "Dealing with mobility: understanding access anytime, anywhere."
        ]
    },
    {
        "name": "TOCHI",
        "year": "2000",
        "info": "Volume 7, 2000",
        "count": 20,
        "papers": [
            "Past, present, and future of user interface software tools.",
            "Charting past, present, and future research in ubiquitous computing.",
            "Social translucence: an approach to designing systems that support social processes.",
            "Transcending the individual human mind--creating shared understanding through collaborative design.",
            "Creating creativity: user interfaces for supporting innovation.",
            "Supporting cognitive models as users.",
            "Distributed cognition: toward a new foundation for human-computer interaction research.",
            "On the effective use and reuse of HCI knowledge.",
            "Systems, interactions, and macrotheory.",
            "HCI in the global knowledge-based economy: designing to support worker adaptation.",
            "Exploiting space and location as a design framework for interactive mobile systems.",
            "Satchel: providing access to any document, any time, anywhere.",
            "Nomadic radio: speech and audio interaction for contextual messaging in nomadic environments.",
            "Improving selection performance on pen-based systems: a study of pen-based interaction for selection tasks.",
            "Using while moving: HCI issues in fieldwork environments.",
            "Introduction to the special issue on human-computer interaction and collaborative virtual environments.",
            "An experimental study on the role of touch in shared virtual environments.",
            "Supporting presence in collaborative environments by haptic force feedback.",
            "Object-focused interaction in collaborative virtual environments.",
            "Inhabited television: broadcasting interaction from within collaborative virtual environments."
        ]
    },
    {
        "name": "TOCHI",
        "year": "1999",
        "info": "Volume 6, 1999",
        "count": 14,
        "papers": [
            "A Software Model and Specification Language for Non-WIMP User Interfaces.",
            "A Partial Test of the Task-medium Fit Proposition in a Group Support System Environment.",
            "Constructing, Organizing, and Visualizing Collections of Topically Related Web Resources.",
            "Flexible collaboration transparency: supporting worker independence in replicated application-sharing systems.",
            "Presto: an experimental architecture for fluid interactive document spaces.",
            "Rotating virtual objects with real handles.",
            "Why are some diagrams easier to work with? Effects of diagrammatic representation on the cognitive intergration process of systems analysis and design.",
            "The relative contributions of stereo, lighting, and background scenes in promoting 3D depth visualization.",
            "The effects of workspace awareness support on the usability of real-time distributed groupware.",
            "At home with the technology: an ethnographic study of a set-top-box trial.",
            "Introduction to the special issue on interface issues and designs for safety-critical interactive systems: when there is no room for user error.",
            "Is paper safer? The role of paper flight strips in air traffic control.",
            "An impact analysis method for safety-critical user interface design.",
            "Comparing design options for allocating communication media in cooperative safety-critical contexts: a method and a case study."
        ]
    },
    {
        "name": "TOCHI",
        "year": "1998",
        "info": "Volume 5, 1998",
        "count": 10,
        "papers": [
            "Graphical Definitions: Expanding Spreadsheet Languages Through Direct Manipulation and Gestures.",
            "Controlling Access in Multiuser Interfaces.",
            "Achieving Convergence, Causality Preservation, and Intention Preservation in Real-Time Cooperative Editing Systems.",
            "Using Metalevel Techniques in a Flexible Toolkit for CSCW Applications.",
            "Hypertext versus Boolean Access to Biomedical Information: A Comparison of Effectiveness, Efficiency, and User Preferences.",
            "Understanding and Constructing Shared Spaces with Mixed-Reality Boundaries.",
            "Using Nonspeech Sounds to Provide Navigation Cues.",
            "Two-Handed Virtual Manipulation.",
            "The Integrality of Speech in Multimodal Interfaces.",
            "Manual and Cognitive Benefits of Two-Handed Input: An Experimental Study."
        ]
    },
    {
        "name": "TOCHI",
        "year": "1997",
        "info": "Volume 4, 1997",
        "count": 13,
        "papers": [
            "Introduction to the Special Issue on Speech as Data.",
            "SpeechSkimmer: A System for Interactively Skimming Recorded Speech.",
            "Hanging on the 'Wire: A Field Study of an Audio-Only Media Space.",
            "Working-Memory Failure in Phone-Based Interaction.",
            "Nanites: An Approach to Structure-Based Monitoring.",
            "TeleNotes: Managing Lightweight Interactions in the Desktop.",
            "Hands-on Practice in Learning to Use Software: A Comparison of Exercise, Exploration, and Combined Formats.",
            "Drawing Graphs to Convey Proximity: An Incremental Arrangement Method.",
            "Predictive Engineering Models Based on the EPIC Architecture for a Multimodal High-Performance Human-Computer Interaction Task.",
            "Graphical Representation of Programs in a Demonstrational Visual Shell - An Empirical Evaluation.",
            "Selection Using a One-Eyed Cursor in a Fish Tank VR Environment.",
            "Managing Level of Detail Through Peripheral Degradation: Effects on Search Performance with a Head-Mounted Display.",
            "Pavlov: An Interface Builder for Designing Animated Interfaces."
        ]
    },
    {
        "name": "TOCHI",
        "year": "1996",
        "info": "Volume 3, 1996",
        "count": 12,
        "papers": [
            "An Experimental Investigation of the Interactive Effects of Interface Style, Instructions, and Task Familiarity on User Performance.",
            "Creating Presentation Slides: A Study of User Preferences for Task-Specific versus Generic Application Software.",
            "Building Real-Time Groupware with GroupKit, a Groupware Toolkit.",
            "Browsing and Querying in Online Documentation: A Study of User Interfaces and the Interaction Process.",
            "High-Speed Visual Estimation Using Preattentive Processing.",
            "Navigating Hierarchically Clustered Networks Through Fisheye and Full-Zoom Methods.",
            "A Field Study of Exploratory Learning Strategies.",
            "The Reuse of Uses in Smalltalk Programming.",
            "The Partial-Occlusion Effect: Utilizing Semitransparency in 3D Human-Computer Interaction.",
            "Using GOMS for User Interface Design and Evaluation: Which Technique?",
            "The GOMS Family of User Interface Analysis Techniques: Comparison and Contrast.",
            "Predicting Document Access in Large Multimedia Repositories."
        ]
    },
    {
        "name": "TOCHI",
        "year": "1995",
        "info": "Volume 2, 1995",
        "count": 14,
        "papers": [
            "Coupling the User Interfaces of a Multiuser Program.",
            "Developing A Reflective Model of Collaborative Systems.",
            "User Interface Software Tools.",
            "Chiron-1: A Software Architecture for User Interface Development, Maintenance, and Run-Time Support.",
            "Relief from the Audio Interface Blues: Expanding the Spectrum of Menu, List, and Form Styles.",
            "Introduction to the Special Issue on Virtual Reality.",
            "An Approach to Natural Gesture in Virtual Environments.",
            "Taking Steps: The Influence of a Walking Technique on Presence in Virtual Reality.",
            "HoloSketch: A Virtual Reality Sketching/Animation Tool.",
            "MASSIVE: A Collaborative Virtual Environment for Teleconferencing.",
            "Evaluation of the CyberGlove as a Whole-Hand Input Device.",
            "Development and Evaluation of Hypermedia for Museum Education: Validation and Metrics.",
            "Demonstrational and Constraint-Based Techniques for Pictorially Specifying Application Objects and Boundaries.",
            "Internal Representation and Rule Development in Object-Oriented Design."
        ]
    },
    {
        "name": "TOCHI",
        "year": "1994",
        "info": "Volume 1, 1994",
        "count": 13,
        "papers": [
            "Editorial.",
            "Integrality and Separability of Input Devices.",
            "Split Menus: Effectively Using Selection Frequency to Organize Menus.",
            "Organizational Obstacles to Interface Design and Development: Two Participant Observer Studies.",
            "The Rendezvous Architecture and Language for Constructing Multi-User Applications.",
            "A Review and Taxonomy of Distortion-Oriented Presentation Techniques.",
            "Integrating Pointer Variables into One-Way Constraint Models.",
            "Toward Visual Debugging: Integrating Algorithm Animation Capabilities Within a Source Level Debugger.",
            "What do Groups Need? A Proposed Set of Generic Groupware Requirements.",
            "A Selective Undo Mechanism for Graphical User Interfaces Based on Command Objects.",
            "A Framework for Undoing Actions in Collaborative Systems.",
            "Reaching for Objects in VR Displays: Lag and Frame Rate.",
            "HyperActive: Extending an Open Hypermedia Architecture to Support Agency."
        ]
    }
]