[
    {
        "year": "2021",
        "name": "UIC/SmartWorld/SCALCOM/ATC/IOP/SCI 2021",
        "info": "Atlanta, GA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/uic/2021",
                "sub_name": "2021 IEEE SmartWorld, Ubiquitous Intelligence & Computing, Advanced & Trusted Computing, Scalable Computing & Communications, Internet of People and Smart City Innovation (SmartWorld/SCALCOM/UIC/ATC/IOP/SCI), Atlanta, GA, USA, October 18-21, 2021.",
                "count": 90,
                "papers": [
                    "MOOP4PD : A Multi-objective Optimization Approach for Package Delivery by the Crowd of Occupied Taxis.",
                    "iScreen: A Pure Software-based Screen Privacy Protection System for Mobile Devices.",
                    "A Tooled Method for Developing Knowledge-Based Activity Recognizers.",
                    "NEAT Activity Detection using Smartwatch at Low Sampling Frequency.",
                    "MCCR: Learning Multi-order Convolutional Correlations for Recommendation.",
                    "Finding the global optimal solution in Dynamic multiple TSPTW with data-driven ACO.",
                    "Lightweight Grouping-Proof for Post-Quantum RFID Security.",
                    "WiARGAN: A WiFi-Based Action Recognition Method with GANs.",
                    "A Dense Margin Network for Human Activity Recognition Based on Augmented Channel State Information.",
                    "Chinese Remainder Theorem-based Essential Secret Image Sharing.",
                    "CovidPass: A Contactless Check-in System for Keeping Social Distance in Public Health Crisis.",
                    "Feasibility Analysis of Machine Learning Optimization on GPU-based Low-cost Edges.",
                    "Train++: An Incremental ML Model Training Algorithm to Create Self-Learning IoT Devices.",
                    "Globe2Train: A Framework for Distributed ML Model Training using IoT Devices Across the Globe.",
                    "Implanting Domain Knowledge into Feature Selection for Effective Outlier Detection in Network Traffic Data.",
                    "Average AoI Minimization in UAV-Assisted IoT Backscatter Communication Systems with Updated Information.",
                    "Visual Navigation via Reinforcement Learning and Relational Reasoning.",
                    "Efficient Algorithms for Caregiver Routing and Scheduling in Home Health Care Services.",
                    "A Lane Changing Model Based on Imitation Learning and Gaussian Velocity Fields.",
                    "Speech Emotion Recognition using XGBoost and CNN BLSTM with Attention.",
                    "That phone charging hub knows your video playlist!",
                    "Can Learning-Based Hybrid DVFS Technique Adapt to Different Linux Embedded Platforms?",
                    "PALM: Platoons Based Adaptive Traffic Light Control System for Mixed Vehicular Traffic.",
                    "A Route Optimization Scheme based on Improved Simulated Annealing Algorithm.",
                    "Deep Personalized Prediction of MPA-AUC with Attentive Interactions in Kidney Transplantation.",
                    "DALU: Adaptive Learning Rate Update in Distributed Deep Learning.",
                    "User-centred privacy inference detection for smart home devices.",
                    "A Situation Calculus based approach to Cognitive Modelling for Responding to IoT Cyberattacks.",
                    "Research on Evaluation System of Recommendation System.",
                    "Efficient On-chip Communication for Neuromorphic Systems.",
                    "Scalable Mining of Big Data.",
                    "Bluetooth RSSI Signal Chaining for Mesh Network Analysis.",
                    "Latency of Trading Transactions in Brokered IoT Data Marketplace in Ethereum.",
                    "Finding Early Bursting Cohesive Subgraphs in Large Temporal Networks.",
                    "An Analysis of Interaction and Engagement in YouTube Live Streaming Chat.",
                    "Towards Online Continuous Reinforcement Learning on Industrial Internet of Things.",
                    "Designing a Smart Virtual Environment for Autism Spectrum Disorder Detection.",
                    "Human Activity Recognition from RGB Video Streams Using 1D-CNNs.",
                    "Traffic flow of connected and automated vehicles in Smart Cities: Human-Centric.",
                    "Biodynamic Lighting to Support the Wellbeing of People Living with Dementia in Care Facilities.",
                    "A Distributed Offloading Scheme With Flexible MEC Resource Scheduling.",
                    "Decentralized Aggregation Design and Study of Federated Learning.",
                    "Noise Generation GAN Based Identity Privacy Protection for Smart City.",
                    "A Blockchain-Based Fine-Grained Access Data Control Scheme With Attribute Change Function.",
                    "A Cloud Data Integrity Verification Scheme Based on Blockchain.",
                    "A Federated Recommendation System Based on Local Differential Privacy Clustering.",
                    "An improved social attribute inference scheme based on multi-attribute correlation.",
                    "Collaborative Decision Approach for Electricity Pricing-demand Response Stackelberg Game.",
                    "Concept and sizing of an e-bike sharing service for commuters to a major metropolitan area.",
                    "Deep Learning Based Link-Level Abstraction for mmWave Communications.",
                    "Exploiting Satellite Data in the Context of Smart City Applications.",
                    "Exploring The Security Issues in Home-Based IoT Devices Through Denial of Service Attacks.",
                    "Intelligent Traffic Based on Hybrid Control Policy of Connected Autonomous Vehicles in Multiple Unsignalized Intersections.",
                    "Monitoring the Smart City Sensor Data Using Thingsboard and Node-Red.",
                    "Predicting the Risks of Street Violent Crimes using Agent-based Modeling.",
                    "Secure Accountable Dynamic Storage Integrity Verification.",
                    "Smart City Power Allocation Based on Linear Feasibility Problem.",
                    "Smart City Transportation Data Analytics with Conceptual Models and Knowledge Graphs.",
                    "Towards Sustainable Food Security: An Interdisciplinary Approach.",
                    "User Motivation Based Privacy Preservation in Location Based Social Networks.",
                    "A Novel Neural Network for P300 Brain-Computer Interface Signal Recognition.",
                    "Boosting the Speed of Real-Time Multi-Object Trackers.",
                    "Credit Risk Prediction Based on DenseNet-BC of Fusion Focal Loss and Static restart SGD.",
                    "Indicator Diagram for Power Prediction of Pumping Unit Based on Machine Learning.",
                    "Interactive Reinforcement Learning Strategy.",
                    "Secure ADS-B protection scheme supporting query.",
                    "A Fast Head Reconstruction Algorithm based on Single Photo.",
                    "A Novel Internet of Things Architecture for Improving Fire Safety in High-rise Buildings.",
                    "A Resource-Efficient Smart Contract for Privacy Preserving Smart Home Systems.",
                    "An Improved Multi-scale Probabilistic Edge Detection for Urban remote sensing images.",
                    "Discussion of Airport Security Check Process Based on Circuit.",
                    "Eureka Labs: Enhancing Cybersecurity Education through Inquiry-based Hands-on Activities.",
                    "Integrated Image Processing Framework to Determine Nutrient Quantities from Guideline Daily Amount (GDA) Label.",
                    "Joint Pedestrian Detection and Attribute Recognition Feature Learning.",
                    "Key Frame Extraction Based on Frame Difference and Cluster for Person Re-identification.",
                    "LOROD: Fully Convolutional Network for Realtime Multi-scale Object Detection Algorithm.",
                    "Machine Learning based Floor-level Sensor Positioning in Smart Buildings.",
                    "Multi-scale Object Detection Algorithm in Smart City Based on Mixed Dilated Convolution Pyramid.",
                    "Peer Support in Smart Learning and Education.",
                    "Survey of Machine Learning and Deep Learning Techniques for Travel Demand Forecasting.",
                    "Towards An Adaptive Time-Triggered Protocol in Wireless Networks.",
                    "Wildfire Risk Prediction and Detection using Machine Learning in San Diego, California.",
                    "Email Classification and Forensics Analysis using Machine Learning.",
                    "On SolarWinds Orion Platform Security Breach.",
                    "Discovering COVID-19 Induced Shifts in Refined Petroleum Products Demand: A Sequence-based Time Series Mining Approach.",
                    "Proactive business process mining for end-state prediction using trace features.",
                    "Process Duration Modelling and Concept Drift Detection for Business Process Mining.",
                    "Process Visualization of Manufacturing Execution System (MES) Data.",
                    "Sequence Mining TV Viewing Data Using Embedded Markov Modelling.",
                    "Using Process Mining to Formalise Service Level Agreement (SLA) Allocation."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "UIC/SmartWorld/SCALCOM/ATC/CBDCom/IOP/SCI 2019",
        "info": "Leicester, UK",
        "venues": [
            {
                "sub_name_abbr": "conf/uic/2019",
                "sub_name": "2019 IEEE SmartWorld, Ubiquitous Intelligence & Computing, Advanced & Trusted Computing, Scalable Computing & Communications, Cloud & Big Data Computing, Internet of People and Smart City Innovation, SmartWorld/SCALCOM/UIC/ATC/CBDCom/IOP/SCI 2019, Leicester, United Kingdom, August 19-23, 2019.",
                "count": 300,
                "papers": [
                    "Stochastic Optimization of Electric Vehicle Charging Stations.",
                    "Software-Defined Edge Computing (SDEC): Principles, Open System Architecture and Challenges.",
                    "A Multi-modal Framework for Future Emergency Systems.",
                    "Dynamic Multiparty Authentication using Cryptographic Hardware for the Internet of Things.",
                    "Optimal Demand Side Management in Generation Constrained Power Systems.",
                    "Towards a Smart(er) Social Science Using High-Dimensional Continuous-Time Trajectories from the Open Dynamic Interaction Networks (ODIN) Platform.",
                    "Improving a 3-D Convolutional Neural Network Model Reinvented from VGG16 with Batch Normalization.",
                    "A Scalable and Reliable Model for Real-time Air Quality Prediction.",
                    "A Dynamic Grid-Based Algorithm for Taxi Ridesharing in Multiple Road Condition.",
                    "An Integrated Framework for Packing CAN-FD Frames and Assigning Offsets.",
                    "Leveraging Graph Neural Network with LSTM For Traffic Speed Prediction.",
                    "An Automatic Laser Scanning System for Objects with Unknown Model.",
                    "A Smart Gateway Enabling OPC UA and DDS Interoperability.",
                    "Fuzzy-Based Fine-Grained Human Activity Recognition within Smart Environments.",
                    "Prediction of Road Traffic Flow Based on Deep Recurrent Neural Networks.",
                    "Predicting Unethical Physician Behavior At Scale: A Distributed Computing Framework.",
                    "Happy Cows, Happy Milk: Smart Cows and Quality Factors.",
                    "Real-time Outlier Detection Over Streaming Data.",
                    "Visual Attention-Based Object Detection in Cluttered Environments.",
                    "Efficient BLE Fingerprinting through UWB Sensors for Indoor Localization.",
                    "Image-Based Text Classification using 2D Convolutional Neural Networks.",
                    "Object Handling of Cognitive Robots Using Deep Leaning Based Object Recognition.",
                    "Virtualisation as a Means for Dynamic Software Update within the Automotive E/E Architecture.",
                    "Autonomous System Design for Dam Surveillance Robots.",
                    "Multi-Robot Cooperation System Based on Wireless Network.",
                    "A Public Domain Dataset for Human Activity Recognition in Free-Living Conditions.",
                    "Effects of Task-Dependent Robot Errors on Trust in Human-Robot Interaction: A Pilot Study.",
                    "A Privacy Aware Architecture for IoT Enabled Systems.",
                    "Autonomus air Quality Management System Based on Web of Things Standard Architecture.",
                    "Best Practices on Personalization and Adaptive Interaction Techniques in the Scope of Smart Homes and Active Assisted Living.",
                    "Minimizing Errors in the Nursing Profession with Technology-Enhanced Education and Training.",
                    "Access Control for Physical Objects in Internet of Things.",
                    "Recognition of Similar Activities Based on Activity Relationship.",
                    "An Autonomous Navigation and Exploration System for Search and Rescue Robots in Mine Incidents.",
                    "Surface Exploration with a Robot-Trailer System for Autonomous Subsurface Scanning.",
                    "A New Shopfloor Orchestration Approach for Collaborative Human-Robot Device Disassembly.",
                    "Automatic Subsurface Map Generation Based on GPR Data Processing.",
                    "uSLAM Implementation for Autonomous Underground Robot.",
                    "Design and Implementation of a Control System for a Tunneling Robot.",
                    "External Manipulation of Autonomous Vehicles.",
                    "Man-Tracking and Sign Cutting by Surveillance UAV.",
                    "Towards a Framework for Monitoring and Analyzing High Performance Computing Environments Using Kubernetes and Prometheus.",
                    "Exploring Performance and Energy Consumption Differences between Recent Intel Processors.",
                    "Employing Blockchain Technology for Decentralized Crowdsourced Data Access and Management.",
                    "Puffle-Pod Marine Evacuation System (POMES).",
                    "FFMRA: A Fully Fair Multi-Resource Allocation Algorithm in Cloud Environments.",
                    "IoT in effective distance learning process.",
                    "Benefit and Cost of Cloud Computing Security.",
                    "Intelligent Algorithms in Home Energy Management Systems: A Survey.",
                    "A Survey on Demand-Response in HEMS: Algorithm Types, Objectives and Constraints.",
                    "Embedding Private Standards in AI and Mitigating Artificial Intelligence Risks.",
                    "Creating Companions for Senior Citizens with Technologies That Mimic People.",
                    "AI and Information Warfare in 2025.",
                    "Ethics and Design in the Smart Bikeshare Domain.",
                    "What if we Had Fair, People-Centred Data Economy Ecosystems?",
                    "Technofixing the Future: Ethical Side Effects of Using AI and Big Data to Meet the SDGs.",
                    "AI Management An Exploratory Survey of the Influence of GDPR and FAT Principles.",
                    "Automated Automobiles in Society.",
                    "Internet Filtering: A Solution to Harmful and Illegal Content?",
                    "Robotic Chinese Calligraphy with Human Preference.",
                    "Study of LSTM Model in Sea Surface Temperature Prediction of the Yellow Sea Cold Water Mass Area.",
                    "Multi-Level Similarity Learning for Low-Shot Recognition.",
                    "The BIDS Toolbox: A web Service to Manage Brain Imaging Datasets.",
                    "PhytoGAN: Unpaired Dead-to-Live Phytoplankton Translation.",
                    "Spatial-Temporal Skeleton Feature: An Unit-Level Feature for Temporal Action Proposal Generation.",
                    "Optimization Strategies for Real-Time Rendering of Virtual Scenes on Heterogeneous Mobile Devices.",
                    "Semi-Supervised Learning Based on Local Adaptive Kernels.",
                    "Leveraging an Instance Segmentation Method for Detection of Transparent Materials.",
                    "Catch the Shadow: Person Tracking Under Occlusion with a Single RGB-D Camera.",
                    "Leveraging Blowing as a Directly Controlled Interface.",
                    "DrowsyDet: A Mobile Application for Real-time Driver Drowsiness Detection.",
                    "Deep Neural Network Based Multiple Targets DOA Estimation for Millimeter-Wave Radar.",
                    "Indoor Trajectory Restoration Method Based on PoI Relation Constraints.",
                    "CoFINLo: Coarse to Fine Indoor Navigation and Localization System.",
                    "A Collaborative Multi-modality Selection Method Based on Data Utility Assessment.",
                    "Synchronous n-Step Method for Independent Q-Learning in Multi-Agent Deep Reinforcement Learning.",
                    "ViHand: Gesture Recognition with Ambient Light.",
                    "LWS: A LoRaWAN Wireless Underground Sensor Network Simulator for Agriculture Applications.",
                    "A Driving Attention Detection Method Based on Head Pose.",
                    "Differential Privacy-Based Indoor Localization Privacy Protection in Edge Computing.",
                    "Passive Embroidered Stretch Sensor Utilizing UHF RFID Antennas.",
                    "A Multi-database Hybrid Storage Method for Big Data of Power Dispatching and Control.",
                    "Study on Optimal Allocation of Inference Nodes for Distributed Inference in Smart Environment.",
                    "Network-Aware Data Transmission Scheduling for Saving Energy in Cellular Networks.",
                    "Traffic Speed Prediction with Missing Data Based on TGCN.",
                    "A Context-Aware Map Matching Method Based on Supported Degree.",
                    "Deep Spatial-Temporal Fusion Network for Fine-Grained Air Quality Prediction.",
                    "A LSTM Based Bus Arrival Time Prediction Method.",
                    "Decision-Making for Drone Services in Urban Environments: a Simulated Study on Clients' Satisfaction and Profit Maximisation.",
                    "A Scoring Method for Driving Safety Credit Using Trajectory Data.",
                    "Persistent Transportation Traffic Volume Estimation with Differential Privacy.",
                    "Varied Priority-Based Data Forwarding via NDN in VANET.",
                    "Short-Term Travel Time Prediction on Urban Road Networks using Massive ERI Data.",
                    "CNNLoc: Deep-Learning Based Indoor Localization with WiFi Fingerprinting.",
                    "Power Load Prediction Based On An Improved Clock-Work RNN.",
                    "CurveCluster: Automated Recognition of Hard Landing Patterns Based on QAR Curve Clustering.",
                    "Gaze-Based Assessment of Dyslexic Students' Motivation within an E-Learning Environment.",
                    "Enhancing Multi-hop Sensor Calibration with Uncertainty Estimates.",
                    "Multi-Source Data Integration-Based Urban Road GPS Environment Friendliness Estimation.",
                    "An Amplification DDoS Attack Defence Mechanism using Reinforcement Learning.",
                    "HumanFi: WiFi-Based Human Identification Using Recurrent Neural Network.",
                    "A Business Process Oriented Dynamic Cyber Threat Intelligence Model.",
                    "An Efficient Method for Tri-Axis Magnetometer Calibration.",
                    "Selecting Sensing Location Leveraging Spatial and Cross-Domain Correlations.",
                    "Fine-Grained Sleep-Wake Behaviour Analysis.",
                    "Diabetes Diagnosis and Treatment Research Based on Machine Learning.",
                    "Image Caption Generation with Local Semantic Information and Global Information.",
                    "BikeNet: Accurate Bike Demand Prediction Using Graph Neural Networks for Station Rebalancing.",
                    "Scalable Real-time Prediction and Analysis of San Francisco Fire Department Response Times.",
                    "iDrug: Pediatric Drug Interaction Modeling and Risk Evaluation Leveraging Prescription Big Data.",
                    "Fast Adaptation via Meta Learning in Multi-agent Cooperative Tasks.",
                    "Supervised Nonnegative Tucker Decomposition for Computational Phenotyping.",
                    "Probabilistic Analysis of Temporal and Sequential Aspects of Activities of Daily Living for Abnormal Behaviour Detection.",
                    "Two-Stream Network with 3D Common-Specific Framework for RGB-D Action Recognition.",
                    "Content and Network Aware Replication and Scheduling Mechanism for User Generated Content Videos.",
                    "Energy-Efficient Activation/Inactivation Strategy for Long-term IoT Network Operation.",
                    "Improving Fast Adaptation for Newcomers in Multi-Robot Reinforcement Learning System.",
                    "Dynamic No-Fly Zone for Drones.",
                    "An Event-Based User Experience Evaluation Method for Virtual Reality Applications.",
                    "MSAHTA: Mixed Spatial Attention and Hierarchical Temporal Aggregation for Action Recognition.",
                    "Learning to Track by Bi-Directional Long Short-Term Memory Networks.",
                    "Considerations on the Deployment of Heterogeneous IoT Devices For Smart Water Networks.",
                    "A Fast Action Recognition Method with Cascaded Networks.",
                    "Research on Road Condition Detection Based on Crowdsensing.",
                    "k-NN-Based EMG Recognition for Gestures Communication with Limited Hardware Resources.",
                    "Dynamic Allocation for Complex Mobile Crowdsourcing Task with Internal Dependencies.",
                    "An Online Computation Offloading Mechanism for Mobile Edge Computing in Ultra-Dense Small Cell Networks.",
                    "Your Pedometer Tells You: Attribute Inference via Daily Walking Step Count.",
                    "FEDet: Feature Enhancement Single Shot Detector.",
                    "CrowdTravel: Leveraging Cross-Modal CrowdSourced Data for Fine-Grained and Context-Based Travel Route Recommendation.",
                    "AI-Powered Text Generation for Harmonious Human-Machine Interaction: Current State and Future Directions.",
                    "Sentiment Analysis Based on Attention Mechanisms and Bi-Directional LSTM Fusion Model.",
                    "Characterizing Collective Knowledge Sharing Behaviors in Social Network.",
                    "Deep-WiID: WiFi-Based Contactless Human Identification via Deep Learning.",
                    "Energy-Aware Anomaly Detection in Industrial Multi-Modal IoT Applications.",
                    "Correlating MSM's Mental Health with Usage Behaviors on MSM-Specific Social Applications.",
                    "MUSEFood: Multi-Sensor-Based Food Volume Estimation on Smartphones.",
                    "Measures to Improve Outdoor Crowdsourcing Photo Collection on Smart Phones.",
                    "Using Eye Tracking to Gain Insight into TV Customer Experience by Markov Modelling.",
                    "Egocentric Hand Track and Object-Based Human Action Recognition.",
                    "Code Refactoring from OpenMP to MapReduce Model for Big Data Processing.",
                    "A New Image Classification Architecture Inspired by Working Memory.",
                    "CrackSense: A CrowdSourcing Based Urban Road Crack Detection System.",
                    "Wearable Sensors Based Automatic Box and Block Test System.",
                    "Comparing CNN and Human Crafted Features for Human Activity Recognition.",
                    "Ontological Modeling of Ubiquitous Accessible Learning Context for Disabled Learners.",
                    "An Improved ACO with First-job Restriction and P-ANT for Batch Scheduling Problem.",
                    "Urban Micro-Circulation Bus Planning Based on Temporal and Spatial Travel Demand.",
                    "Towards Deep Learning on Resource-Constrained Robots: A Crowdsourcing Approach with Model Partition.",
                    "Traffic Accident Prediction Based on Deep Spatio-Temporal Analysis.",
                    "HISMA: A Human-Machine Iterative Schema Matching Algorithm.",
                    "IFC: Your Invisible Fitness Coach Based on CSI Sensing.",
                    "Online Intelligent Resource Management for Power-Delay Tradeoff in Backhaul-Limited Mobile Edge Computing Systems.",
                    "Friend Recommendation Algorithm Based on Interest and Cognition Combined with Feedback Mechanism.",
                    "Assessing Mental Stress Based on Smartphone Sensing Data: An Empirical Study.",
                    "BDMF: A Biased Deep Matrix Factorization Model for Recommendation.",
                    "A Carpooling Service for Private Vehicles Using Electronic Registration Identification Data.",
                    "Personalized Preference Collaborative Filtering: Job Recommendation for Graduates.",
                    "Dynamic Ensemble Pruning Selection using Meta-Learning for Multi-Sensor Based Activity Recognition.",
                    "Device Free Human Activity Recognition using WiFi Channel State Information.",
                    "Modeling Chinese Input Interaction for Patients with Cloud Based Learning.",
                    "LISC: Location Inference Attack Enhanced by Spatial-Temporal-Social Correlations.",
                    "Projection-Induced Access Point Deployment for Fingerprint-Based Indoor Positioning.",
                    "Attributed Network Embedding via a Siamese Neural Network.",
                    "Handling Fingerprint Sparsity for Wi-Fi Based Indoor Localization in Complex Environments.",
                    "Mutual Graph Embedding in LBSN: Capturing Multi-Factor Influence for Point-of-Interest Prediction.",
                    "CoxRF: Employee Turnover Prediction Based on Survival Analysis.",
                    "Personal Trait Analysis Using Word2vec Based on User-Generated Text.",
                    "An Effective Deep Learning Approach for Dialogue Emotion Recognition in Car-Hailing Platform.",
                    "Optimal Bandwidth Allocation for Web Crawler Systems.",
                    "Game Theoretical Study on a Client-Controlled Deduplication Scheme.",
                    "Where to Build New Public Toilets? Multi-Source Urban Data Tell the Truth.",
                    "LSTM Based Semi-Supervised Attention Framework for Sentiment Analysis.",
                    "Attention-Based Adaptive Sampling for Continuous EMG Data Streams.",
                    "Interactive Design of Geofences for Proactive Location-Based Services in Smart Cities.",
                    "Enhanced Approach for Finger Vein Recognition using BLPOC.",
                    "Collaborating with Users in Proximity for Decentralized Mobile Recommender Systems.",
                    "Towards Autonomic Educational Cyber Physical Systems.",
                    "ILFS: Intelligent Lost and Found System using Multidimensional Matching Model.",
                    "Visualising the Invisible: Augmented Reality and Virtual Reality as Persuasive Technologies for Energy Feedback.",
                    "Exploring Mobile Phone Data for Urban Activity Analysis: Applications from Individual Activity Pattern to Group Activity Regularity.",
                    "Individual Risk Prediction of Gastric Cancer Using Fully Connected Neural Network with Weighted Neighborhood Feature.",
                    "Modeling Data-Driven Liver Cancer Prediction with Medical Knowledge on Chinese Population.",
                    "A Classification Method and Implementation of Trojan and BotNet Infected User Based on Threat Matrix Model.",
                    "A Practical Differentially Private Support Vector Machine.",
                    "Differential Attribute Desensitization System for Personal Information Protection.",
                    "PPSI: Practical Private Set Intersection Over Large-Scale Datasets.",
                    "Fast Algorithms on Primality Testing for Numbers 255 ⋅ 2^n ± 1.",
                    "Performance and Endurance Training for Equine Racing (PETER).",
                    "Data Science Tools for Crime Investigation, Archival, and Analysis.",
                    "Abstracting Syntactic Privacy Notions via Privacy Games.",
                    "Analysing and Evaluating Syntactic Privacy Games via a Recommender Systems Case Study.",
                    "A Privacy-Preserving Coalition Loyalty Program.",
                    "Segmental Symbolic Execution Based on Clustering.",
                    "Energy Optimization of Streaming Applications in IoT on NoC Based Heterogeneous MPSoCs using Re-Timing and DVFS.",
                    "Research on a Multi-Level Combination of Software Defect Localization Method.",
                    "Convolution Neural Network Development Support System using Approximation Methods to Evaluate Inference Accuracy and Memory Usage in an Embedded System.",
                    "My Voiceprint Is My Authenticator: A Two-Layer Authentication Approach Using Voiceprint for Voice Assistants.",
                    "Software Defect Prediction Model Based On KPCA-SVM.",
                    "Intelligent Resource Discovery in Inter-Cloud using Blockchain.",
                    "A Vulnerability Detection Model for Java Systems Based on Complex Networks.",
                    "Toward Interactional Trust for Humans and Automation: Extending Interdependence.",
                    "AAKA-D2D: Anonymous Authentication and Key Agreement Protocol in D2D Communications.",
                    "Analysis Space Reduction with State Merging for Ensuring Safety Properties of Self-Adaptive Systems.",
                    "Privacy and Security Aspects on a Smart City IoT Platform.",
                    "Joint Beacon Power and Rate Control for Vehicular Ad Hoc Networks.",
                    "Framework for Analysis and Prediction of NBA Basketball Plays: On-Ball Screens.",
                    "Learning Constraint-Based Model for Detecting Malicious Activities in Cyber Physical Systems.",
                    "Automatic Feature Extraction and Selection For Machine Learning Based Intrusion Detection.",
                    "Satellite Network Load Balancing Strategy for SDN/NFV Collaborative Deployment.",
                    "The Spread of Disinformation on the Web: An Examination of Memes on Social Networking.",
                    "Research on the Destructive Capability Metrics of Common Network Attacks.",
                    "A Security Formal Model for Multiple Channels Communication.",
                    "A Study and Enhancement to the Security of MANET AODV Protocol Against Black Hole Attacks.",
                    "Design Patterns for Compensating Controls for Securing Financial Sessions.",
                    "Security Analysis of Smart Home Based on Life Cycle.",
                    "Research on the Impact of Attacks on Security Characteristics.",
                    "Attack-Defense Utility Quantification And Security Risk Assessment.",
                    "An Experimental Online Judge System Based on Docker Container for Learning and Teaching Assistance.",
                    "Boosting Domestic Energy Efficiency Through Accurate Consumption Data Collection.",
                    "Cloud Computing in Government Organizations-Towards a New Comprehensive Model.",
                    "IoT-Based Fall and ECG Monitoring System: Wireless Communication System Based Firebase Realtime Database.",
                    "Review of Innovative Cyberspace Security Research Inspired by Bionics Computing Methods.",
                    "A Mobile Edge Computing Architecture for Safety in Mining Industry.",
                    "Research on User Behavioral Intention Based on Telecommunication Data.",
                    "Collision Evaluation in Low Power Wide Area Networks.",
                    "5G Wireless Networks Meet Big Data Challenges, Trends, and Applications.",
                    "Telecom Big Data Based Precise User Classification Scheme.",
                    "A Comprehensive Operation and Revenue Analysis Algorithm for LTE/5G Wireless System Based on Telecom Operator Data.",
                    "A Precise Pollution Prevention and Control Method Based on Telecom Operator Data.",
                    "Data Flow Management and Visual Analytic for Big Data Smart City/IOT.",
                    "Multiprocessor Task Programming and Flexible Load Balancing for Time-Stepping Methods on Heterogeneous Cloud Infrastructures.",
                    "A Novel Meta-Heuristic for Green Computing on VFI-NoC-HMPSoCs.",
                    "Integration of Apache Spark with Invasive Resource Manager.",
                    "Decentralized Parallel Any Colony Optimization for Distributed Memory Systems.",
                    "QARPF: A QoS-Aware Active Resource Provisioning Framework Based on OpenStack.",
                    "Graph Data Modelling for Genomic Variants.",
                    "A Novel Relationship Extraction Scheme Based on Negative Feedback Attention.",
                    "Based on Super-Pixels to Simulate Water Ripples from a Single Image.",
                    "Persistent Cooperative Monitoring System of Disaster Areas Using UAV Networks.",
                    "Improved Procedures for Training Primal Wasserstein GANs.",
                    "Unsupervised Domain Adaptation for Multi-Center Autism Spectrum Disorder Identification.",
                    "The Function Extension Method for SDN Controller Based on LightGBM.",
                    "Optimal RTS Threshold for IEEE 802.11 WLANs: Basic or RTS/CTS?",
                    "Towards Accurate and Robust Fall Detection for the Elderly in a Hybrid Cloud-Edge Architecture.",
                    "A Novel Task Offloading Framework to Support Wireless Body Area Networks with MEC.",
                    "LTE-LAA and WiFi in 5G NR Unlicensed: Fairness, Optimization and Win-Win Solution.",
                    "Energy-Efficient Base Station Deployment in Heterogeneous Communication Network.",
                    "Storage-Repair Tradeoff for Hierarchical Distributed Storage Systems.",
                    "QoE Oriented Adaptive Streaming Method for 360° Virtual Reality Videos.",
                    "Investigating Network Services Abstraction in 5G Enabled Device-to-Device (D2D) Communications.",
                    "Security and Forensics Challenges to The MK Smart Project.",
                    "Consideration and Research on Data Architecture for the Future Cyber Society.",
                    "Challenges in ROS Forensics.",
                    "Extracting Reliable Health Condition and Symptom Information to Support Machine Learning.",
                    "Autonomous Vehicles' Forensics in Smart Cities.",
                    "Computer Laws Consideration on Smart City Data Planning of Chongli 2022.",
                    "Finger-Drawn Signature Verification on Touch Devices Using Statistical Anomaly Detectors.",
                    "Analyzing the Validation Flaws of Online Shopping Systems Based on Coloured Petri Nets.",
                    "A Privacy-Preserved Probabilistic Routing Index Model for Decentralised Online Social Networks.",
                    "Data Aggregation Challenges in Fog Computing.",
                    "A Method of Chinese Tourism Named Entity Recognition Based on BBLC Model.",
                    "Discriminant Subspace Alignment for Cross-Project Defect Prediction.",
                    "Behavioural Smoking Identification via Hand-Movement Dynamics.",
                    "Persuade Me!: A User-Based Recommendation System Approach.",
                    "Decision Tree Model of Smoking Behaviour.",
                    "A Hybrid Human-Robot Collaborative Environment for Recycling Electrical and Electronic Equipment.",
                    "Towards a Human-Centered Model in SIoT -Enhancing the Interaction Behaviour of Things with Personality Traits.",
                    "eSports Pro-Players Behavior During the Game Events: Statistical Analysis of Data Obtained Using the Smart Chair.",
                    "AI-Powered Tangible Interfaces to Transform Children's Mental Well-Being.",
                    "Evaluation of an IoT Framework for a Workplace Wellbeing Application.",
                    "Dynamically Programmable Virtual Profiles as a Service.",
                    "Parameter Optimization for Deriving Bluetooth-Based Social Network Graphs.",
                    "Towards Understanding of eSports Athletes' Potentialities: The Sensing System for Data Collection and Analysis.",
                    "Redefining Micro-Moments for Improving Energy Behaviour: The SIT4Energy Approach.",
                    "A Socio-Economic Survey for Understanding Self-Perceived Effectiveness of Persuasive Strategies Towards Energy Efficiency in Tertiary Buildings.",
                    "Going Back for That One Last Thing in the House on Fire: How Fear, Attentiveness, Sadness, Joviality, and Other Lower Order Dimensions of Affect Influence Our Security and Privacy Behavior.",
                    "Facebook vs. Twitter: An Examination of Differences in Behavior Type and Substance Based on Psychological Factors.",
                    "Veterans and Their Inherent Cybersecurity Preparedness: Myth or Reality?",
                    "The People Perspective: Categorization and Controversial Information in Wikipedia.",
                    "Combining Human and Machine Intelligence to Foster Wider Adoption of e-Services.",
                    "IoT in Smart Cities: Exploring Information Theoretic and Deep Learning Models to Improve Parking Solutions.",
                    "Abductive Causal Reasoning for Internet of Things.",
                    "Extensible Environment for Monitoring and Detecting Symptoms of Depression.",
                    "Complementing Travel Itinerary Recommendation Using Location-Based Social Networks.",
                    "Development of Huffman Code for Lora Technology.",
                    "Road Traffic Event Detection Using Twitter Data, Machine Learning, and Apache Spark.",
                    "Millimeter-Wave Multi-Radar System for Ubiquitous Concealed Dangerous Object Detection.",
                    "SIVEQ: An Integrated System for the Valorization of Surplus Food.",
                    "Impact Analysis of Erroneous Data on IoT Reliability.",
                    "An Analysis of the Impact of Uncertainty on the Internet of Things: A Smart Home Case Study.",
                    "Building Smart City Drone for Graffiti Detection and Clean-up.",
                    "Health Zone Monitoring: A Passive Approach.",
                    "Follow-me Prefetching for Video Streaming Over Mobile Edge Computing Networks.",
                    "Swarm Wisdom for Smart Mobility - The Next Generation of Autonomous Vehicles.",
                    "The Impact of Bike-Sharing Ridership on Air Quality: A Scalable Data Science Framework.",
                    "Distributed Data Analytics Framework for Cluster Analysis of Parking Violation.",
                    "A Review of IoT Service Provision to Assess the Potential for System Interoperability in an Uncertain Ecosystem.",
                    "Recovering Decentralized Critical Archival Data From Tampering in Smart City Environment Using Blockchain.",
                    "Dynamic Cloud Service Management for Scalable Internet of Things Applications."
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "UIC/SmartWorld/SCALCOM/ATC/CBDCom/IOP/SCI 2018",
        "info": "Guangzhou, China",
        "venues": [
            {
                "sub_name_abbr": "conf/uic/2018",
                "sub_name": "2018 IEEE SmartWorld, Ubiquitous Intelligence & Computing, Advanced & Trusted Computing, Scalable Computing & Communications, Cloud & Big Data Computing, Internet of People and Smart City Innovation, SmartWorld/SCALCOM/UIC/ATC/CBDCom/IOP/SCI 2018, Guangzhou, China, October 8-12, 2018.",
                "count": 320,
                "papers": [
                    "Modeling Smart Cyber Physical Systems Based on ModelicaML.",
                    "A Secure Connectivity Model for Internet of Things Analytics Service Delivery.",
                    "A Scalable Model for Secure Multiparty Authentication.",
                    "Characteristics Analysis and Impact Cluster on Urban Rail Transit Perturbations: A Real Case in Beijing.",
                    "Graph CNNs for Urban Traffic Passenger Flows Prediction.",
                    "Individualized Smart Charging to Mitigate the Growing Electrical Peak Demand from EVs as Home Appliances.",
                    "Behavior Recognition of Moving Objects Using Deep Neural Networks.",
                    "Optimization of Bus Lines Based on Passenger Group Moving Behaviors.",
                    "An Abnormal Behavior Detection Based on Deep Learning.",
                    "Monitoring System to Strive against Fall Armyworm in Crops Case Study: Maize in Rwanda.",
                    "Designing Recommender System for Corporate Education WiP+32.",
                    "Multicast Tree Generation Technique Using Reinforcement Learning in SDN Environments.",
                    "Smart Vehicles: The Data Privacy Smog.",
                    "Smart Office System with Face Detection at the Edge.",
                    "An Ensemble Learning Framework for Credit Card Fraud Detection Based on Training Set Partitioning and Clustering.",
                    "An Improved Iterated Hybrid Search for DNA Codes Design.",
                    "An Item-Diversity-Based Collaborative Filtering Algorithm to Improve the Accuracy of Recommender System.",
                    "Wearable Ear Blood Oxygen Saturation and Pulse Measurement System Based on PPG.",
                    "Automated Segmentation of Esophagus Layers from OCT Images Using Fast Marching Method.",
                    "A Wearable High-Precision Skin Resistance Acquisition System.",
                    "Design of a Portable Physiological Signal Data Storage System.",
                    "Wearable Arteriovenous Fistula Murmur Monitoring System Based on Embedded Wi-Fi Technology.",
                    "Heartbeat Classification Using Convolution Neural Network and Wavelet Transform to Extract Features.",
                    "Design of Remote Database Service System for Wearable Devices.",
                    "Model-Based Active Impedance Controller Development of the Exoskeleton Rehabilitation Robot (ERRobot) for Lower-Extremity.",
                    "Maximum Frequent Itemsets Discovery Algorithm Based on Granular Computing.",
                    "A Naïve Construction Model of Membership Function.",
                    "Measuring Interestingness of Theorems in Automated Theorem Finding by Forward Reasoning: A Case Study in Tarski's Geometry.",
                    "Improvement of Data Portability of ENQUETE-BAISE: A General-Purpose E-Questionnaire Server for Ubiquitous Questionnaire.",
                    "FreeEnCal Web: A Web Service of Automated Forward Reasoning for General-Purpose.",
                    "An Implementation of Theory Grid with Linked Data Technologies.",
                    "Primitive Constituent Elements of Cryptographic Protocols.",
                    "Evaluation about the Descriptive Power of QSL: A Specification Language for E-Questionnaire, E-Testing, and E-Voting Systems.",
                    "Development of Supporting Environment for IT System Security Evaluation Based on ISO/IEC 15408 and ISO/IEC 18045.",
                    "A Study on Fine-Grained Security Properties of Cryptographic Protocols for Formal Analysis Method with Reasoning.",
                    "Deep Learning-Based Online Small Signal Stability Assessment of Power Systems with Renewable Generation.",
                    "An Epistemic Programming Approach for Automated Nonmonotonic Reasoning Based on Default Logic.",
                    "Stability Analysis and Hopf Bifurcation Research for DNA Strand Displacement with Time Delay.",
                    "An Undergraduate Curriculum Model for Intelligence Science and Technology.",
                    "Type Conversion Sequence Recommendation Based on Semantic Web Technology.",
                    "Managing Lifetime Healthcare Data on the Blockchain.",
                    "A Privacy-Preserving, Decentralized and Functional Bitcoin E-Voting Protocol.",
                    "Proof of Disease: A Blockchain Consensus Protocol for Accurate Medical Decisions and Reducing the Disease Burden.",
                    "Generate Public Randomness Based on Blockchain.",
                    "Blockchain-Based Ubiquitous Code Ownership Management System without Hierarchical Structure.",
                    "A Dynamic Multi-Objective Evolutionary Algorithm for Nontrivial Upper Bounds of Real-Time Tasks in Embedded System Design.",
                    "A Leakage-Resilient FPGA-Based IP Identity Authentication Protocol.",
                    "DopGest: Dual-Frequency Based Ultrasonic Gesture Recognition.",
                    "A Novel Bidirectional RFID Identity Authentication Protocol.",
                    "Executable Micro-Architecture Modeling and Automatic Verification of EtherCAT.",
                    "Mining the Critical Conditions for New Hypotheses of Materials from Historical Reaction Data.",
                    "A Wikipedia Two-Way Link Vector Model for Measuring Semantic Relatedness.",
                    "Dynamic Representation Learning for Video Action Recognition Using Temporal Residual Networks.",
                    "Environmentally Adaptive Real-Time Detection of RFID False Readings in a New Practical Scenario.",
                    "EmotionSense: Emotion Recognition Based on Wearable Wristband.",
                    "Scheduling Algorithm for Area Coverage Problem in Directional Sensor Networks.",
                    "A Two-Stage Incremental Update Method for Fall Detection with Wearable Device.",
                    "Alexa, My Love: Analyzing Reviews of Amazon Echo.",
                    "Resource-Aware Stream Processing in High Performance Cloud Environment.",
                    "Secure and Effective Geo-Data Transmission Scheme for Vehicle-to-Vehicle Communication.",
                    "Web Services Clustering Based on HDP and SOM Neural Network.",
                    "An Implicit Information Based Movie Recommendation Strategy.",
                    "Collatz Conjecture for 2^100000-1 Is True - Algorithms for Verifying Extremely Large Numbers.",
                    "A Synchronous Gossip Algorithm with Exponential Backoff.",
                    "APRNN: A New Active Propagation Training Algorithm for Distributed RNN.",
                    "Semantic Web-Based Approach to Support Rational Unified Process Software Development.",
                    "Embedding-Level Attention and Multi-Scale Convolutional Neural Networks for Behaviour Modelling.",
                    "A Smile Detection Method Based on Improved LeNet-5 and Support Vector Machine.",
                    "Enabling Efficient Stroke Prediction by Exploring Sleep Related Features.",
                    "Real-Time Data Processing Architecture for Multi-Robots Based on Differential Federated Learning.",
                    "A Synergistic Cloud Service Approach for Cold Start Problems.",
                    "A Domain-Specific Approach to Unifying the Many Dimensions of Context-Aware Home Service Development.",
                    "A Cloud Workflow Model Based on Resources Selection.",
                    "Research on Human Motion Recognition Based on Wi-Fi and Inertial Sensor Signal Fusion.",
                    "GPS Trajectories Based Personalized Safe Geofence for Elders with Dementia.",
                    "Improving Large Scale Real-Time Ridesharing with Heuristics for Road Networks.",
                    "CIGAN: A Novel GANs Model Based on Category Information.",
                    "WiFit: Ubiquitous Bodyweight Exercise Monitoring with Commodity Wi-Fi Devices.",
                    "An Efficient Method for Optimizing PETSc on the Sunway TaihuLight System.",
                    "Towards a Truthful Online Auction for Cooperative Mobile Task Execution.",
                    "Resource Demand Forecasting Approach Based on Generic Cloud Workload Model.",
                    "Optimizing the Performance-Cost Tradeoff in Cross-Edge Analytics.",
                    "Multi-Channel Lightweight Convolution Neural Network for Anterior Myocardial Infarction Detection.",
                    "Interrupt-Driven Fall Detection System Realized via a Kalman Filter and kNN Algorithm.",
                    "A Direction-Based Vehicular Network Model in Vehicular Fog Computing.",
                    "Wi-Fi Based Gesture Recognition Using Deep Transfer Learning.",
                    "Constructing Hierarchical Spatiotemporal Information for Action Recognition.",
                    "Weakly Secure Coded Distributed Computing.",
                    "Toward Ubiquitous Environment: An Scalable Framework for Autonomous Service Composition.",
                    "A Hybrid Data Collection Scheme for Wireless Sensor Networks Using Compressed Sensing.",
                    "Abnormal Hosts Monitor for City Wide Core Network by Real Time Super Points Cardinality Estimation.",
                    "A Body Simulator with Delayed Health State Transition.",
                    "Secure Online/Offline Multi-Authority Attribute-Based Encryption for Resource-Constrained Devices in Cloud Computing.",
                    "A QoE-Based Governor for Web Browsing on Heterogeneous Mobile Systems.",
                    "Stochastic Analysis on Fog Computing Empowered Mobile Crowdsensing with D2D Communications.",
                    "Towards Wi-Fi Radar in Collapsed Structures.",
                    "QoE Aware and Cell Capacity Enhanced Computation Offloading for Multi-Server Mobile Edge Computing Systems with Energy Harvesting Devices.",
                    "Accurately Counting Steps of the Pedestrian with Varying Walking Speeds.",
                    "A Dynamic Role Assignment Formation Control Algorithm Based on Hungarian Method.",
                    "Hierarchy Value Density - A Priority Algorithm for Task Scheduling on Cloud.",
                    "Clustering Large-Scale Origin-Destination Pairs: A Case Study for Public Transit in Beijing.",
                    "Crime Rate Inference Using Tensor Decomposition.",
                    "Multi-Depth-Camera Sensing and Interaction In Smart Space.",
                    "A Novel and Distributed Approach for Activity Recognition Inside Smart Homes.",
                    "CRNet: Corner Recognition from Trajectories Based on Convolutional and Recurrent Neural Networks.",
                    "Security OSIF: Toward Automatic Discovery and Analysis of Event Based Cyber Threat Intelligence.",
                    "SWATS: A Lightweight VANET Anonymous Traceback System Based on Random Superposition Watermarking.",
                    "Urban Road Traffic Congestion Detection Using RFID Data of Vehicles.",
                    "What Wrist Temperature Tells Us When We Sleep Late: A New Perspective of Sleep Health.",
                    "Performance Evaluation of Hypervisors and the Effect of Virtual CPU on Performance.",
                    "Multi-Resident Activity Recognition with Unseen Classes in Smart Homes.",
                    "A Cache Placement Strategy for Energy Savings in CCN.",
                    "Semi-Supervised Learning with Ensemble Self-Training for Cancer Classification.",
                    "RSU Controlled Named Data Networking for Traffic Information Dissemination in Vehicular Networks.",
                    "Traffic Flow Prediction for Road Intersection Safety.",
                    "A Lightweight Anonymous Mobile User Authentication Scheme for Smart Grid.",
                    "Continuous K Nearest Neighbor Query Scheme with Privacy and Security Guarantees in Road Networks.",
                    "Power Control in D2D-Based Vehicle Communication with Delayed CSI Feedback.",
                    "Mining and Analyzing User Feedback from App Reviews: An Econometric Approach.",
                    "Affective Content Analysis of Online Video Clips with Live Comments in Chinese.",
                    "An Offloading Approach in Fog Computing Environment.",
                    "Utility-Aware Trip Planning.",
                    "DeepAid: A Mobile Cognitive Aid System with Compacted Deep Learning.",
                    "An Efficient Privacy-Preserving Algorithm Based on Randomized Response in IoT-Based Smart Grid.",
                    "An Annulus Local Search Based Localization (ALSL) Algorithm in Indoor Wi-Fi Environments.",
                    "Attributed Community Search in Dynamic Networks.",
                    "Non-Intrusive Biometric Identification for Personalized Computing Using Wireless Big Data.",
                    "Deep Collaborative Filtering Incorporating Auxiliary Multi-Media Information.",
                    "Fast Online Map Matching for Recovering Travelling Routes from Low-Sampling GPS Data.",
                    "Exploiting Implicit Trust and Geo-Social Network for Recommendation.",
                    "A Workflow Scheduling Method for Cloudlet Management in Mobile Cloud.",
                    "Inspecting Influences on Likes and Comments of Photos in Instagram.",
                    "A Multi-Features Fusion Method Based on Convolutional Neural Network for Vehicle Recognition.",
                    "Generating Expert's Review from the Crowds': Integrating a Multi-Attention Mechanism with Encoder-Decoder Framework.",
                    "Personalized Search with Secure Updates in Educational Resources.",
                    "Low-Dimensional Vectors Learning for Influence Maximization.",
                    "Fine-Grained Task-Dependency Offloading in Mobile Cloud Computing.",
                    "Spatial-Aware Deep Recommender System.",
                    "Secure Data Provenance in Cloud-Centric Internet of Things via Blockchain Smart Contracts.",
                    "Group-Based Competitive Influence Maximization.",
                    "TNERec: Topic-Aware Network Embedding for Scientific Collaborator Recommendation.",
                    "Utilizing the Bidirectional Effect of Evolutive Trust-Rating for Recommendation in E-Commerce.",
                    "Coupled Collective Matrix Factorization.",
                    "Request Answering in Vehicular Ad-Hoc Networks Based on Adaptive Filters.",
                    "Sentiment Classification Based on Clause Polarity and Fusion via Convolutional Neural Network.",
                    "Multidimensional QoS Resource Scheduling Method with Stakeholder Perspective in Clouds.",
                    "A Comparison of Inertial Data Acquisition Methods for a Position-Independent Soil Types Recognition.",
                    "T-Suite: A RESTful Distributed Development and Runtime Environment on Things Devices.",
                    "An Adaptive Partition Method for Handling Skew in Spark Applications.",
                    "Simulation Verifications of ZND Control for Dynamics-Included Robot Systems Extended from One Link to Multiple Links.",
                    "Deep Optical Flow Feature Fusion Based on 3D Convolutional Networks for Video Action Recognition.",
                    "Vehicular Named Data Networking Based on Efficient Incremental Route Update.",
                    "An Operation-Level Collaborative Filtering Approach Based on Logistic Function for Web Services Recommendation.",
                    "A Control System Architecture with Cloud Platform for Multi-UAV Surveillance.",
                    "Detecting Transportation Modes with Low-Power-Consumption Sensors Using Recurrent Neural Network.",
                    "A Novel Text Classification Method for Emergency Event Detection on Social Media.",
                    "An Approach to Reducing Implicit Privacy Disclosure in Spatial-Temporal Big Data Publishing.",
                    "Catalyze Sharing Economy: Optimized Multi-Task Allocation for Urban Transport Crowdsourcing.",
                    "Compressed Sensing and Implicit Cooperativity Based Data Gathering Algorithm in Mobile Crowdsensing Systems.",
                    "A System Framework for Efficiently Recognizing Web Crawlers.",
                    "A Epilepsy Drug Recommendation System by Implicit Feedback and Crossing Recommendation.",
                    "SHAstor: A Scalable HDFS-Based Storage Framework for Small-Write Efficiency in Pervasive Computing.",
                    "GHHP: Genetic Hybrid Hierarchical Partitioning for Community Structure in Social Medias Networks.",
                    "An Efficient Recognition Method for Incomplete Iris Image Based on CNN Model.",
                    "Human Action Recognition: A Feature Point Trajectory and Space-Time Interest Point Based Approach.",
                    "Testbed for Wide-Area Environment Observation.",
                    "K-Means Based Edge Server Deployment Algorithm for Edge Computing Environments.",
                    "Mining Learning Styles for Personalised eLearning.",
                    "Autonomous Resource Scheduling for Real-Time and Stream Processing.",
                    "Bed-Exit Prediction Based on 3D Convolutional Neural Network.",
                    "POMon: From Simple Keyword Matching to Stream-Based Live Probabilistic Topic Matching.",
                    "Adaptive Optimization Design of Vector Error Diffusion Algorithm and IP Core for FPGA.",
                    "Energy-Aware Automatic Tuning of Many-Core Platform via Gradient Descent.",
                    "Women Safety Device Designed Using IoT and Machine Learning.",
                    "Study on Energy Minimization Data Transmission Strategy in Mobile Cloud Computing.",
                    "Location-Semantic Aware Privacy Protection Algorithms for Location-Based Services.",
                    "Theoretical Analyses and Results of Taylor-Zhang Discretization Formula and ZeaD4Ig2_Y Formula Generating Discrete-Time Solutions of ODE Dynamic Systems.",
                    "Research on Multi-Dimensional Opportunistic Communication Routing Protocol in Vehicular Ad-Hoc Networks.",
                    "A Lightweight Authentication Protocol for V2V Communication in VANETs.",
                    "A Human Flesh Search Algorithm Based on Information Puzzle.",
                    "Credit Card Fraud Detection via Kernel-Based Supervised Hashing.",
                    "A New Detection Method for Stack Overflow Vulnerability Based on Component Binary Code for Third-Party Component.",
                    "A New Cryptosystem Based on Positive Braids.",
                    "Resource Transaction Framework Based on Block Chain in Social Community.",
                    "Modeling Methods for Cloud Based Cyber Physical Systems.",
                    "A Privacy Preserving Outlier Detection Algorithm Based on Connected Domain.",
                    "Load Aware Management of Cloudlets for a Wireless Area Metropolitan Network.",
                    "The Performance Evaluation Model of Intel SGX-Based Data Protection.",
                    "Road Speed Fusion Model Based on Wavelet Neural Network Optimized by Genetic Algorithm.",
                    "VJournaling: Improving the Write Performance of a Virtualized Journaling File System.",
                    "Deep Convolutional Mesh RNN for Urban Traffic Passenger Flows Prediction.",
                    "An Academic Social Network Friend Recommendation Algorithm Based on Decision Tree.",
                    "Repurchase Prediction Based on Ensemble Learning.",
                    "Personalized App Recommendation Based on Hierarchical Embedding.",
                    "Aspect-Based Personalized Review Ranking.",
                    "Understanding the Evolution of Fine-Grained User Opinions in Product Reviews.",
                    "Water Level Estimation Based on Image of Staff Gauge in Smart City.",
                    "A Mokov Decision Process Approach to Optimizing Waiting for Taxis.",
                    "Cost Efficient State-Aware Function Placement and Flow Scheduling for NFV Networks.",
                    "A Low-Rate DoS Attack Detection Method Based on Hilbert Spectrum and Correlation.",
                    "Power Curtailment in Cloud Environment Utilising Load Balancing Machine Allocation.",
                    "Combing Fuzzy Clustering and PSO Algorithms to Optimize Energy Consumption in WSN Networks.",
                    "Speed Regulation of Overhead Catenary System Inspection Robot for High-Speed Railway through Reinforcement Learning.",
                    "Accelerating a Secure Programmable Edge Network System for Smart Classroom.",
                    "Ubiquitous Healthcare System Based on the Sensors Network and Android Internet of Things Gateway.",
                    "Using Data Till 1996, 2008 and 2017 via Full-Traversal Addition-Subtraction Frequency (ASF) Method with Consistent Analysis to Predict Possible M6.6-or-Above Earthquakes in Sichuan-Yunnan Region of China.",
                    "From Historical Data through ASF Method of Equal-Type Half Traversal to Predict USA Presidential Parties from 2021 to 2041.",
                    "Highway Traffic Volume Prediction via Stacking KNN, SVR, MLP, RNN.",
                    "Aggregating Author Profiles from Multiple Publisher Networks to Build Author Knowledge Graph.",
                    "An Efficient Cooperative Co-Evolutionary Gene Expression Programming.",
                    "Automated Optimization of Longitudinal Tensile Reinforcement in RC Beam Using Binary PSO Algorithm.",
                    "Ant Colony Optimization Based Salient Object Detection for Weak Light Images.",
                    "An Efficient Ant Colony Programming Approach.",
                    "A Kalman Filter Based Indoor Tracking System via Joint Wi-Fi/PDR Localization.",
                    "A Multiobjective RNA Secondary Structure Prediction Algorithm Based on NSGAII.",
                    "Task Scheduling for Cloud Based Cyber-Physical Systems.",
                    "An Optimization Strategy for Improving Security in Steganography.",
                    "Leaks or Not: A Framework for Evaluating Cache Timing Side Channel Attacks in SGX.",
                    "Calligraphy: A Mobile Device Based Annotation Tool Supporting Learner Crowdsourcing.",
                    "Data Offloading for Deadline-Varying Tasks in Mobile Edge Computing.",
                    "Generalized Nash Equilibrium Model of the Service Provisioning Problem in Multi-Cloud Competitions.",
                    "Toward an Efficient Cache Management Framework.",
                    "Distributed Data Collection in a Cyclic MobiSpace.",
                    "Mal-Warehouse: A Data Collection-as-a-Service of Mobile Malware Behavioral Patterns.",
                    "A Centralized and Conflict-Free Routing Table Update Method through Triplets' Lists Vector in SDN Architectures.",
                    "Verified Programs for Frequent Itemset Mining.",
                    "A Kalman Filter Based Hill-Climbing Strategy for Application Server Configuration.",
                    "MTF: Mitigating Link Flooding Attacks in Delay Tolerant Networks.",
                    "A Hybrid MIP-Based Heuristic for the Optimal Design of DVB-T2 Networks.",
                    "Software Defect Prediction Model Sharing Under Differential Privacy.",
                    "Crowdsensing Based Barometer Sensor Calibration Using Smartphones.",
                    "Monitoring and Predicating Accidents for Interlocking Systems Based on SHA.",
                    "Consideration on Propagation of Disaster Information Among Different Types of Terminals for Grass-Roots Information Distribution System Using MANET.",
                    "ALChecker: A Tool for Checking Mobile Ambients.",
                    "A Prefetching Scheme for Multi-Tiered Storage Systems.",
                    "Real-Time Push-Based Data Forwarding for Target Tracking in Vehicular Named Data Networking.",
                    "Interactive Bulk Synchronous Parallel Functional Programming in a Browser.",
                    "Development of Disaster Monitoring Techniques in the Grass-Root Information Distribution System for Detecting Landslide Dangers.",
                    "Adaptability Enhancement for Progressive Download Methods Based on Timer-Driven Requesting Schemes Using Multiple TCP Flows on Multiple Paths.",
                    "Arbitration-Based Deadlock Mitigation Mechanism for Fast Connection Establishment in Autonomous Self-Organized Bluetooth MANETs.",
                    "Structured Policy-Based Design Method for Cybersecurity of Automotive E/E System.",
                    "A Proposal and Evaluation of Mobility Model Which Derives Various Node Mobility Scenarios.",
                    "Optimizing Network I/O Virtualization for Scale-Out Processor.",
                    "Connectivity Probability Based Spray and Wait Routing Algorithm in Mobile Opportunistic Networks.",
                    "MiKANT: A Mirrored K-Ary N-Tree for Reducing Hardware Cost and Packet Latency of Fat-Tree and Clos Networks.",
                    "A Distributed Data Allocation Scheme for Autonomous Nodes.",
                    "Optimal Placement for Smart Mobile Access Points.",
                    "Performance Evaluation of In-Packet Membership Querying Algorithm for Large-Scale Networks.",
                    "An Autonomous Model Construction Mechanism in Dynamic Sensor Networks.",
                    "A Communication-Aware Energy-Efficient Graph-Coloring Algorithm for VM Placement in Clouds.",
                    "A Fast and Accurate Replica Selection Mechanism Using Explicit Multicast for CDNs.",
                    "Deploying Structured Media Server Cluster in Media Cloud Using Ant Colony Optimization.",
                    "Hypergraph Partitioning for Big Data Applications.",
                    "Mining Taxi Pick-Up Hotspots Based on Spatial Clustering.",
                    "Enhancing the Impression on Cities: Mining Relations of Attractions with Geo-Tagged Photos.",
                    "A Deep Convolutional Neural Network-Based Label Completion and Correction Strategy for Supervised Medical Image Learning.",
                    "Large Scale Spectral Clustering Using Sparse Representation Based on Hubness.",
                    "A Scalable and Efficient Multi-Label CNN-Based License Plate Recognition on Spark.",
                    "Joint Computation Offloading and Routing Optimization for UAV-Edge-Cloud Computing Environments.",
                    "Fast VM Startup by Cooperative Image Caching for Cloud Data Centers.",
                    "Detection Mechanism of FDI Attack Feature Based on Deep Learning.",
                    "Backward Mining Technology Research on Continuous Attacks in Wide Time Domain.",
                    "A Routing Protocol Considering Turning Behavior of Vehicles in VANETs.",
                    "R-PCNN Method to Rapidly Detect Objects on THz Images in Human Body Security Checks.",
                    "A Video Segmentation Strategy for Video Processing Applications on Hadoop Clusters.",
                    "Approximate Nearest Neighbor Search Based on Hierarchical Multi-Index Hashing.",
                    "An Improved Bloom Filter in Distributed Crawler.",
                    "A High-Performance Intrusion Detection Method Based on Combining Supervised and Unsupervised Learning.",
                    "Machine Vision-Based Segmentation and Classification Method for Intelligent Roller Surface Monitoring.",
                    "DNN-Based Image Classification for Software GUI Testing.",
                    "INDICS: An Industrial Internet Platform.",
                    "Data Mining from Haier Air-Conditioner Equipment Running Data for Fault Prediction.",
                    "Individual Analysis Model and Related Research in Social Networks.",
                    "Banking Comprehensive Risk Management System Based on Big Data Architecture of Hybrid Processing Engines and Databases.",
                    "Landscapes and Emerging Trends of Virtual Reality in Recent 30 Years: A Bibliometric Analysis.",
                    "Overdue Prediction of Bank Loans Based on LSTM-SVM.",
                    "New Generation Artificial Intelligence-Driven Intelligent Manufacturing (NGAIIM).",
                    "SDN-Based Handover Approach in IEEE 802.11p and LTE Hybrid Vehicular Networks.",
                    "A Prophet-Based DTN Protocol for VANETs.",
                    "Cyber-Enabled Human-Centric Smart Home Architecture.",
                    "Users' Privacy Concerns in IoT Based Applications.",
                    "A Deep Learning Approach to Detecting Engagement of Online Learners.",
                    "HMM of Telecommunication Big Data for Consumer Churn Prediction.",
                    "Web Behavior Detection Based on Deep Neural Network.",
                    "Automatic Detection of Optic Disc in Retina Image Using CNN and CRF.",
                    "Fast NTRU Encryption in GPU for Secure IoP Communication in Post-Quantum Era.",
                    "Data-Driven Intelligent Maintenance Planning of Smart Meter Reparations for Large-Scale Smart Electric Power Grid.",
                    "Comparison of Measurements by the Betweenness Centrality and Subjective Experiment on the Word Priority of Tweets.",
                    "Vote Parallel SVM: An Extension of Parallel Support Vector Machine.",
                    "Trust Model and Anti-Attack Analysis for Social Computing.",
                    "Learning Combinatorial Global and Local Features on 3D Point Clouds.",
                    "Robust GA Based Global Path Planning for IoP Oriented Mobil Robot.",
                    "Socially-Inspired Peer Discovery for D2D Communications.",
                    "Incentive Mechanism for User Collaboration on Trajectory Privacy Preservation.",
                    "A Succinct Provable Data Possession Mechanism for Lightweight Clients in Network Computing.",
                    "Hiding RFID in the Image Matching Based Access Control to a Smart Building.",
                    "Wear-I: A Multi-Wearable Organic System for Smarter Individual Services.",
                    "A Review of Multimodal Facial Biometric Authentication Methods in Mobile Devices and Their Application in Head Mounted Displays.",
                    "Everyday Life Approach for Smart Health: A People-Centered Design Process for Co-Creating Self-Tracking Systems.",
                    "Towards Developing an Effective Algorithm Visualization Tool for Online Learning.",
                    "Online Vocabulary QuizMASter Game for College English Test Band 4.",
                    "Design of Automatic Identification Gateway System for Different IoT Devices and Services.",
                    "A Representation Method and Optimization of Network Flow Based on Coalgebra.",
                    "A Fusion Information Embedding Method for User Identity Matching Across Social Networks.",
                    "A Dependability Modeling and Analysis Approach for an IoP-Based Service System.",
                    "Constructing the Community Assignment Matrix for Overlapping Community Detection.",
                    "A Dynamic Trust Model Based on Time Decay Factor.",
                    "Model Checking Instance Based on NuSMV.",
                    "An Online Data Deduplication Approach for Virtual Machine Clusters.",
                    "An Efficient Graph Data Processing Framework for Power Grid Systems.",
                    "A General Testing Framework Based on Veins for Securing VANET Applications.",
                    "Using Particle Swarm Optimization Method to Optimize the Carbon Sequestration Potential of Agricultural Afforestation in Beijing, China.",
                    "Towards a Standardized Identity Federation for Internet of Things in 5G Networks.",
                    "Security-Enhanced Wireless Multicast via Adaptive Fountain Codes over Distributed Caching Network.",
                    "A Quantitative Model of the Urban Rail Congestion Propagation under Oversaturated Conditions.",
                    "Improving the Station-Level Demand Prediction by Using Feature Engineering in Bike Sharing Systems.",
                    "Snap4City: A Scalable IOT/IOE Platform for Developing Smart City Applications.",
                    "Leveraging the Internet of Things for Smart Waters: Motivation, Enabling Technologies and Deployment Strategies for Pakistan.",
                    "Evaluation of Operation Status of Urban Rail Transit Stations Based on Historical Data.",
                    "A SVR-Based Passenger Route Choice Model in Urban Rail Transit Network."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "UIC/SmartWorld/SCALCOM/ATC/CBDCom/IOP/SCI 2017",
        "info": "San Francisco, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/uic/2017",
                "sub_name": "2017 IEEE SmartWorld, Ubiquitous Intelligence & Computing, Advanced & Trusted Computed, Scalable Computing & Communications, Cloud & Big Data Computing, Internet of People and Smart City Innovation, SmartWorld/SCALCOM/UIC/ATC/CBDCom/IOP/SCI 2017, San Francisco, CA, USA, August 4-8, 2017.",
                "count": 282,
                "papers": [
                    "Disaster scenario and record capture system.",
                    "Distributed geospatial data infrastructure for heterogeneous disaster data integration and application.",
                    "Data-driven IoT applications design for smart city and smart buildings.",
                    "Indoor trapp ed-victim detection system.",
                    "Tour planning for crowdsourcing sensor data collection.",
                    "Multidisciplinarity for biodiversity management on campus through citizen sciences.",
                    "Distribution networks as complex dynamic systems new perspective for monitoring them.",
                    "Pohang living lab: Utilizing modeling and simulation as a collaboration method.",
                    "From smart campus to smart cities issues of the smart revolution.",
                    "Impact of eco-feedback on the behavior of campus users.",
                    "Adaptable equivalent circuit model for electrochemical storage elements as a part of energy system modeling for ZEB.",
                    "Testing and evaluation of dynamic energy simulations for the development of an intelligent management of energy for the ADREAM smart building.",
                    "Designing the engaging energy-box: Bridging the gap between energy control systems and users' energy awareness.",
                    "New GPU-based swarm intelligence approach for reducing big association rules space.",
                    "A hybrid heuristic for the team orienteering problem.",
                    "Bringing SDN to the mobile edge.",
                    "SFP: Toward a scalable, efficient, stable protocol for federation of software defined networks.",
                    "Unicorn: Unified resource orchestration for multi-domain, geo-distributed data analytics.",
                    "Generative policy model for autonomic management.",
                    "Interpretability of deep learning models: A survey of results.",
                    "A conceptual framework of group evolution: Considerations for decision makers and analysts.",
                    "Next generation firewalls for dynamic coalitions.",
                    "Argumentation-based policy analysis for drone systems.",
                    "Verification techniques for policy based systems.",
                    "Opportunities and challenges for named data networking to increase the agility of military coalitions.",
                    "Data distribution and scheduling for distributed analytics tasks.",
                    "Physics-inspired models for agile code and data in federated edges.",
                    "Decision-making in policy governed human-autonomous systems teams.",
                    "Towards an architecture for policy-based management of software defined coalitions.",
                    "Parameterising the dynamics of inter-group conflict from real world data.",
                    "Influence maximisation beyond organisational boundaries.",
                    "Mathematical models for social group behavior.",
                    "Decentralized microservice workflows for coalition environments.",
                    "Distributed opportunistic sensing and fusion for traffic congestion detection.",
                    "Cognitive computing for coalition situational understanding.",
                    "Cyber-A(nima): Modelling, reasoning and applications.",
                    "Statistical-based method to determine the best hour of the day regarding GHG emissions for a smart home appliance.",
                    "Fine-grained acceleration control for autonomous intersection management using deep reinforcement learning.",
                    "Performance evaluation of smart systems under uncertainty.",
                    "Hybrid deep learning ensemble model for improved large-scale car recognition.",
                    "Optimization of vehicular node clustering process using evolutionary algorithms.",
                    "Goods recommendation based on retail knowledge in a Neo4j graph database combined with an inference mechanism implemented in jess.",
                    "BlueNet: BLE-based ad-hoc communications without predefined roles.",
                    "QoS-aware routing for real-time and reliable wireless sensor network based smart grid NAN communications.",
                    "Temperature management system to prevent heat shock in households for elderly people.",
                    "Dynamic imitation of human motion for humanoid robot.",
                    "Reliability improvements to healthcare patient RFID tracking with multiple tags.",
                    "Organic solar cell by inkjet printing - An overview.",
                    "On the performance of a deep learning-based anomaly detection system for 5G networks.",
                    "A comparative study on neural network-based prediction of smart community energy consumption.",
                    "Configuration, programming and implementation of 3 Smart Water network wireless sensor nodes for assessing the water quality.",
                    "An empirical study of PM2.5 forecasting using neural network.",
                    "A spectrum-based adaptive sampling algorithm for smart sensing.",
                    "Practical darknet traffic analysis: Methods and case studies.",
                    "Seamless service migration for human-centered computing in future Internet architecture.",
                    "Demonstrating a data access-based context ontology with an online racing game controller application.",
                    "Edge computing framework for distributed smart applications.",
                    "Naturalistic driving data for a smart cloud-based abnormal driving detector.",
                    "IoT-based OLED lighting control system for providing comfort space.",
                    "Non-contact collision avoidance with sensory servo control in real time for industrial automation.",
                    "Metafier - A tool for annotating and structuring building metadata.",
                    "Personal robot: Towards developing a complete humanoid robot assistant using the Internet of Things.",
                    "Smart depth of anesthesia monitoring with EEG sensors and agent-based technology.",
                    "Improved image denoising based on Haar wavelet transform.",
                    "Big data platform for public health policies.",
                    "Distributed graph database as base of smart world things.",
                    "Using asynchronous collaborative attestation to build a trusted computing environment for mobile applications.",
                    "UbiWheel: A simple context-aware universal control concept for smart home appliances that encourages active living.",
                    "Hostile behavior detection from multiple view points using RGB-D sensor.",
                    "Underwater image enhancement with encoding-decoding deep CNN networks.",
                    "A novel underwater de-scattering method based on sparse non-negative matrix factorization.",
                    "Augmenting depth estimation from deep convolutional neural network using multi-spectral photometric stereo.",
                    "Combining encoded structured light and photometric stereo for underwater 3D reconstruction.",
                    "Dynamic long short-term memory network for skeleton-based gait recognition.",
                    "An evaluation of convolutional neural networks on material recognition.",
                    "Face recognition algorithm based on multi-scale CLBP.",
                    "Diabetic retinopathy classification using deeply supervised ResNet.",
                    "Machine learning-based product recommendation using Apache Spark.",
                    "Detection of fake followers using feature ratio in self-organizing maps.",
                    "Image deblurring.",
                    "Application of hierarchical temporal memory theory for document categorization.",
                    "Parallel DNNs for users and items modeling and recommendation using comments.",
                    "A comparison of college faculty and student class activity in an online learning environment using course log data.",
                    "A unifying architecture model for developing context-aware systems.",
                    "A developed feature selection method for classification based on united information gain.",
                    "A context-aware recommendation system for improving the performance of targeted mobile advertising.",
                    "Configuring the relationships of organizational goals based on ontology framework.",
                    "SDN based QoS aware bandwidth management framework of ISP for smart homes.",
                    "Multimodal gait analysis based on wearable inertial and microphone sensors.",
                    "Application of Kalman filter and k-NN classifier in wearable fall detection device.",
                    "SonicOperator: Ultrasonic gesture recognition with deep neural network on mobiles.",
                    "Forecasting car rental demand based temporal and spatial travel patterns.",
                    "Spatiotemporal multi-task learning for citywide passenger flow prediction.",
                    "AlcoWear: Detecting blood alcohol levels from wearables.",
                    "Real-time sensor observation segmentation for complex activity recognition within smart environments.",
                    "Power hopping: An automatic power optimization method for ultrasonic motion sensors.",
                    "Audio-based event recognition system for smart homes.",
                    "CHIP: A children identification system based on mobile phone sensory data.",
                    "SHARE: Scalable hybrid adaptive routing for dynamic multi-hop environments.",
                    "An improved immune algorithm for node relocation to maximize confident information coverage in a hybrid sensor network.",
                    "Wireless indoor localisation for autonomous service robot with a single emitter.",
                    "Experiences from an e-mobility project in a local power grid with redox-flow energy storage system. Project report.",
                    "Discovering places of interest using sensor data from smartphones and wearables.",
                    "Classifying respiratory sounds using electronic stethoscope.",
                    "Building deep architectures for traditional chinese medicine diagnosis.",
                    "Level value density task scheduling algorithm for cyber physical systems on cloud.",
                    "High-level activity recognition based on analysis of spatio-temporal contexts.",
                    "Approach to develop innovative services through service networks by using ubiquitous infrastructures.",
                    "Estimating pressure distribution using pressure sensor array for weather forecasting.",
                    "DFSA: A classification capability quantification method for human action recognition.",
                    "Discover the fingerprint of electrical appliance: Online appliance behavior learning and detection in smart homes.",
                    "Visualizing Wi-Fi accesses from city-scale population for urban analysis.",
                    "Linked open data management in ambient assisted cities.",
                    "Poor performance discovery of college students based on behavior pattern.",
                    "On solving device diversity problem via fingerprint calibration and transformation for RSS-based indoor localization system.",
                    "The emergence of visual-based localization and navigation using smartphone sensing.",
                    "Pipelining user trajectory analysis and visual process maps for habit mining.",
                    "IEHouse: A non-intrusive household appliance state recognition system.",
                    "A position-independent method for soil types recognition using inertial data from a wearable device.",
                    "Transportable and scalable system for activities and exercises recognition in real-time.",
                    "Glioma grading based on gentle-adaboost algorithm and radiomics.",
                    "A precise grading method for glioma based on radiomics.",
                    "Fusing location data for depression prediction.",
                    "Exploring and understanding web search behavior with human activities.",
                    "Optimal patrol strategies against attacker's persistent attack with multiple resources.",
                    "Coverage and workload cost balancing in spatial crowdsourcing.",
                    "Mining location information from users' spatio-temporal data.",
                    "Scenario-based modeling of ontic personae for automatic personality perception.",
                    "Smartphone-collected mobile network events for mobility modeling.",
                    "CrowdSafe: Detecting extreme driving behaviors based on mobile crowdsensing.",
                    "Tippers and stiffers: An analysis of tipping behavior in taxi trips.",
                    "HDNN-CF: A hybrid deep neural networks collaborative filtering architecture for event recommendation.",
                    "Driving behavior modeling and evaluation for bus enter and leave stop process.",
                    "Complementary base station clustering for cost-effective and energy-efficient cloud-RAN.",
                    "Designing an accessible and engaging email application for aging in place.",
                    "Weak multipath effect identification for indoor distance estimation.",
                    "Rule-based integration of smart services using the manufacturing service bus.",
                    "Response time in mixed-critical pervasive systems.",
                    "Towards a provenance collection framework for Internet of Things devices.",
                    "A state-based approach to context modeling and computing.",
                    "Reality and perception: Activity monitoring and data collection within a real-world smart home.",
                    "A 3D simulator for intelligent environment experiments.",
                    "Edukas environment: Towards an integrated dashboard for education management in smart cities.",
                    "Facial expressions based error detection for smart environment using deep learning.",
                    "Data gathering solutions for dense RFID deployments.",
                    "Quantifying sensing quality of crowd sensing networks with confidence interval.",
                    "Long short-term memory based recurrent neural networks for collaborative filtering.",
                    "Exploit dynamic data flows to protect software against semantic attacks.",
                    "Exploring user topic influence for group recommendation on learning resources.",
                    "Citizenpedia: A human computation framework for the e-government domain.",
                    "Sensing language relationships from social media.",
                    "Mining relationships between mental health, academic performance and human behaviour.",
                    "A new method based on PCA contribution factors for road hotspot cause analysis.",
                    "VisualVital: An observation model for multiple sections of scenes.",
                    "Scalable indoor navigation system based on proximity Bluetooth beacons using tools of AI.",
                    "RFID based activities of daily living recognition.",
                    "Development of network node stations for intelligent local energy distribution.",
                    "A smart system for face detection with spatial correlation improvement in IoT environment.",
                    "Exploring what makes it a POI.",
                    "An optimal method for charging station location based on big data of the SOC and immune algorithm.",
                    "Implementation of improved S-3PAKE protocol based on verifier.",
                    "Data quality in big data processing: Issues, solutions and open problems.",
                    "Research on inventory forecasting based on BP neural network.",
                    "Data driven reference architecture for smart city ecosystems.",
                    "Bike sharing data analytics for silicon valley in USA.",
                    "Data-driven forest fire analysis.",
                    "Home appliance detection from aggregated energy consumption data on a single circuit.",
                    "Smart real estate assessments using structured deep neural networks.",
                    "Cell indicator system for pharmacies.",
                    "Optimal constrained wireless emergency network antenna placement.",
                    "Networking and communication for smart city systems.",
                    "A service-oriented middleware for cloud of things and fog computing supporting smart city applications.",
                    "Analyzing social media communications for correlation with freeway vehicular traffic.",
                    "UMAP: Urban mobility analysis platform to harvest car sharing data.",
                    "Automated quantitative analysis of open-ended survey responses for transportation planning.",
                    "Civic apps competitions: Preliminary findings on the longevity and quality of their outcomes.",
                    "A smart city development kit for designing Web and mobile Apps.",
                    "Graph-based anomaly detection for smart cities: A survey.",
                    "Tapping drone technology to acquire 21st century skills: A smart city approach.",
                    "Research on propagation of passenger flow in urban rail transit network for large-scale events.",
                    "Smart WDS management: Pipe burst detection using real-time monitoring data.",
                    "Smart services: A case study on smarter public safety by a mobile app for University of São Paulo.",
                    "An edge-based smart mobile service system for illegal dumping detection and monitoring in San Jose.",
                    "Hot spots for improvements: Where to implement new green spaces?",
                    "Multi-tenant network acceleration scheme for OpenStack.",
                    "Edge computing embedded platform with container migration.",
                    "Robotic assistant for visually impaired using sensor fusion.",
                    "Human factor evaluation of in-vehicle signal assistance system.",
                    "Integrating heterogeneous freight performance data for smart mobility.",
                    "Autonomous UAV forced graffiti detection and removal system based on machine learning.",
                    "Adaptive edge analytics for creating memorable customer experience and venue brand engagement, a scented case for Smart Cities.",
                    "Unsupervised learning techniques for HVAC terminal unit behaviour analysis.",
                    "Consensus-based anomaly detection for efficient heating management.",
                    "Feature engineering for crime hotspot detection.",
                    "Incident analysis and prediction using clustering and Bayesian network.",
                    "Location-aware smart campus security application.",
                    "Twitter vigilance: A multi-user platform for cross-domain Twitter data analytics, NLP and sentiment analysis.",
                    "Event detection for smarter cities.",
                    "Mining a MOOC to examine international views of the \"Smart City\".",
                    "Efficient vehicle visualization system for safe driving in VANETs.",
                    "Vibratory Haptic feedback assistive device for visually-impaired drivers.",
                    "A biometric usability evaluation of instrument cluster and infotainment systems in two hybrid cars.",
                    "Why functional safety experts worry about automotive systems having increasing autonomy.",
                    "Enabling real-time internet-of-people \"4D\" mobile applications.",
                    "Autonomous trucking: The interplay between design and business constraints.",
                    "Determinism in future cars: Why autonomous trucks are easier to design.",
                    "Undesign: Future consideration on end-of-life of driver cars.",
                    "The future of brain-computer interaction: How future cars will interact with their passengers.",
                    "Social dilemma of autonomous cars a critical analysis.",
                    "Rapid factorization of composite primes: An alternative to the sieve method.",
                    "Whitenoise encryption implementation with increased robustness to side-channel attacks.",
                    "Dynamic distributed key infrastructures (DDKI) and dynamic identity verification and authentication (DIVA).",
                    "Deterministic random number generation for one time pads: Creating a Whitenoise super key.",
                    "Enhancing transport layer security with Dynamic Identity Verification and Authentication (DIVA): Maintaining and enhancing SSL/TLS reliability.",
                    "A novel spoofing attack against electroencephalogram-based security systems.",
                    "Systematic analysis of liveness detection methods in biometrie security systems.",
                    "A cyber-physical approach to trustworthy operation of health monitoring systems.",
                    "SurgeScan: Enforcing security policies on untrusted third-party Android libraries.",
                    "Cloud-based buyer-seller watermarking protocols.",
                    "EPoW: Solving blockchain problems economically.",
                    "Assessing privacy behaviors of smartphone users in the context of data over-collection problem: An exploratory study.",
                    "Dependable and reliable cloud-based systems using multiple software spare components.",
                    "A chaos-based joint compression and encryption scheme for streaming data.",
                    "An electromagnetic approach to smart card instruction identification using machine learning techniques.",
                    "Secure intermittent-robust computation for energy harvesting device security and outage resilience.",
                    "Enhancement of probabilistic attack graphs for accurate cyber security monitoring.",
                    "Spare block cache (SprBlk): Fault resilience and reliability at low voltages.",
                    "SDN assisted middlebox synchronization mechanism for next generation mobile data management system.",
                    "Architectural refinements for enhancing trust and securing cyber-physical systems.",
                    "An anonymous mutual authentication scheme for healthcare RFID systems.",
                    "Secure and privacy preserving digital payment.",
                    "LS-SVM's no-reference video quality assessment model under the Internet of things.",
                    "High-performance computing for protein fold prediction.",
                    "Quantitative driving safety assessment using interaction design benchmarking.",
                    "Aggregation of elastic stack instruments for collecting, storing and processing of security information and events.",
                    "Design of a risk based authentication system using machine learning techniques.",
                    "The time-varying nature of cache utilization: A case study on the Mantevo and Apex benchmarks.",
                    "Local memory store (LMStr): A hardware controlled shared scratchpad for multicores.",
                    "Preventive maintenance for cloud-based software systems subject to non-constant failure rates.",
                    "An adaptive policy-driven middleware for mobile computing.",
                    "An application meta-model to support the execution and benchmarking of scientific applications in multi-cloud environments.",
                    "Research on highway passenger segmentation based on Canopy-kmeans clustering algorithm under parallel computing framework.",
                    "Research on optimization allocation of manufacturing resource services in the cloud environment.",
                    "K-sets+: A linear-time clustering algorithm for data points with a sparse similarity measure.",
                    "Non-functional requirements optimisation for multi-tier cloud applications: An early warning system case study.",
                    "Efficient distributed machine learning for large-scale models by reducing redundant communication.",
                    "MECCA offloading cloud model over wireless interfaces for optimal power reduction and processing time.",
                    "Secure and private cloud storage systems with random linear fountain codes.",
                    "HALA: Hive advanced lexical analyzer.",
                    "VIFI: Virtual information fabric infrastructure for data-driven discoveries from distributed earth science data.",
                    "Dynamic deadline-constraint scheduler for Hadoop YARN.",
                    "Researches on secure data transmission mechanisms in cloud Internet of Things architectures.",
                    "A geometric distributed probabilistic model to predict graduation rates.",
                    "Workload performance and interference on containers.",
                    "Developing a workflow approach for mining online social media data.",
                    "A CNN based bagging learning approach to short-term load forecasting in smart grid.",
                    "MapReduce-based techniques for multiple object tracking in video analytics.",
                    "MCSA: A multi-criteria shuffling algorithm for the MapReduce framework.",
                    "Intelligent offloading of reports processing in aging mobile devices.",
                    "DAdHTM: Low overhead dynamically adaptive hardware transactional memory for large graphs a scalability study.",
                    "Taguchi-enhanced binary differential evolution algorithm.",
                    "Optimizing scheduling for heterogeneous computing systems using combinatorial meta-heuristic solution.",
                    "Modeling functional behaviors of DDS.",
                    "UAVFog: A UAV-based fog computing for Internet of Things.",
                    "Ubiquitous fatigue tracking of implicit and explicit data of communters within smart hyperspaces.",
                    "Are you altruistic? Your mobile phone could tell.",
                    "DNN-based approach for identification of the level of attention of the TV-viewers using IoT network.",
                    "Interplay between video recommendations, categories, and popularity on YouTube.",
                    "Community detection in signed networks: An error-correcting code approach.",
                    "Situational context in the programmable world.",
                    "DiNAMAC: A disruption tolerant, reinforcement learning-based Mac protocol for implantable body sensor networks.",
                    "Towards collective hyperlocal contextual awareness among heterogeneous RFID systems.",
                    "First digital Tunisian Louage's transportation solution.",
                    "Dynamic intra-modal carpooling with transhipment: Formalization and first combinatorial exact solution.",
                    "Robust classification of city roadway objects for traffic related applications.",
                    "Street object detection / tracking for AI city traffic analysis.",
                    "Large vehicle recognition and classification for traffic management and flow optimization in narrow roads.",
                    "Effective object detection from traffic camera videos.",
                    "Region-based deformable fully convolutional networks for multi-class object detection at signalized traffic intersections: NVIDIA AICity challenge 2017 Track 1.",
                    "The NVIDIA AI City Challenge.",
                    "TPCAM: Real-time traffic pattern collection and analysis model based on deep learning.",
                    "Edge-based street object detection."
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "UIC/ATC/ScalCom/CBDCom/IoP/SmartWorld 2016",
        "info": "Toulouse, France",
        "venues": [
            {
                "sub_name_abbr": "conf/uic/2016",
                "sub_name": "2016 Intl IEEE Conferences on Ubiquitous Intelligence & Computing, Advanced and Trusted Computing, Scalable Computing and Communications, Cloud and Big Data Computing, Internet of People, and Smart World Congress (UIC/ATC/ScalCom/CBDCom/IoP/SmartWorld), Toulouse, France, July 18-21, 2016.",
                "count": 166,
                "papers": [
                    "Activity Recognition Based on the Dynamic Coordinate Transformation of Inertial Sensor Data.",
                    "Plogs: Materializing Datalog Programs with MapReduce for Scalable Reasoning.",
                    "Internet-of-Things in Motion: A Cooperative Data Muling Model for Public Safety.",
                    "Evaluating the Impact of Data Transfer Time and Mobility Patterns in Opportunistic Networks.",
                    "Toward QoS-Aware Cloud Robotic Applications: A Hybrid Architecture and Its Implementation.",
                    "Improving the Reliability of Pervasive Computing Applications by Continuous Checking of Sensor Readings.",
                    "A Navigation Cognitive System Driven by Hierarchical Spiking Neural Network.",
                    "Designing Parallel Data Processing for Large-Scale Sensor Orchestration.",
                    "SmartMTra: Put the Limit of the Inertial Sensor Based Indoor Motion Trajectory Tracing Using Smartphone.",
                    "Heterogeneous Data Driven Manifold Regularization Model for Fingerprint Calibration Reduction.",
                    "Towards Efficient Data Services in Vehicular Networks via Cooperative Infrastructure-to-Vehicle and Vehicle-to-Vehicle Communications.",
                    "IoT-Lite: A Lightweight Semantic Model for the Internet of Things.",
                    "Dynamic Domain Model for Micro Context-Aware Adaptation of Applications.",
                    "Improving Data Fusion in Big Data Stream Computing for Automotive Applications.",
                    "PublicSense: A Crowd Sensing Platform for Public Facility Management in Smart Cities.",
                    "Human Activity Recognition of Continuous Data Using Hidden Markov Models and the Aspect of Including Discrete Data.",
                    "Applied a Multi-scale Entropy Algorithm to Analyze Dynamic COP Signal via Accelerometer Sensor.",
                    "Build Smart Campus Using Human Behavioral Data.",
                    "Comparison of Detailed Occupancy Profile Generative Methods to Published Standard Diversity Profiles.",
                    "Process-Based Habit Mining: Experiments and Techniques.",
                    "Trust-Aware Opportunistic Dissemination Scheme for VANET Safety Applications.",
                    "Using Real Traffic Data for ITS Simulation: Procedure and Validation.",
                    "Fuzzy AHP for Learning Service Selection in Context-Aware Ubiquitous Learning Systems.",
                    "A Context-Aware Solution to Improve Web Service Discovery and User-Service Interaction.",
                    "Early Warning of City-Scale Unusual Social Event on Public Transportation Smartcard Data.",
                    "Event-Driven and District-Related Home Care: Networked Technical Building Equipment (TBE) as a Basis for Ambient Assisted Living.",
                    "A Convex Optimization Based Autonomous Intersection Control Strategy in Vehicular Cyber-Physical Systems.",
                    "Leveraging Declarations over the Lifecycle of Large-Scale Sensor Applications.",
                    "Bridging the Gap between Real and Simulated Environments: A Hybrid Agent-Based Smart Home Simulator Architecture for Complex Systems.",
                    "A Novel Random Walk and Scale Control Method for Event Recommendation.",
                    "A Graph-Based Method for Indoor Subarea Localization with Zero-Configuration.",
                    "Detecting Attacks Smartly in Vehicle Cloud Computing.",
                    "A Personalized Tweet Recommendation Approach Based on Concept Graphs.",
                    "Fine-Grained Delta Privacy Preservation for Hierarchical Contexts.",
                    "A Platform for Overcrowding Detection in Indoor Events Using Scalable Technologies.",
                    "VIPR: A Visual Interface Tool for Programming Semantic Web Rules.",
                    "Concealed in the Internet: A Novel Covert Channel with Normal Traffic Imitating.",
                    "A Context Modelling Approach Based on Temporal Euclidean Vector Space.",
                    "Novel Efficient and Privacy-Preserving Protocols for Sensor-Based Human Activity Recognition.",
                    "ROAT: Road-Network-Based Anonymization of Trajectories.",
                    "Towards Socially Intelligent Automated Tutors: Predicting Learning Style Dimensions from Conversational Dialogue.",
                    "Discovering Mass Activities Using Anomalies in Individual Mobility Motifs.",
                    "Less Annotation on Personalized Activity Recognition Using Context Data.",
                    "Hypervisor-Based Attestation of Virtual Environments.",
                    "Towards Early Detection of Novel Attack Patterns through the Lens of a Large-Scale Darknet.",
                    "A Novel Hybrid Flow-Based Handler with DDoS Attacks in Software-Defined Networking.",
                    "Timing Analysis for Inferring the Topology of the Bitcoin Peer-to-Peer Network.",
                    "The Unreasonable Effectiveness of Address Clustering.",
                    "Blockchain-Based Publishing Layer for the Keyless Signing Infrastructure.",
                    "Buy Your Coffee with Bitcoin: Real-World Deployment of a Bitcoin Point of Sale Terminal.",
                    "Building Privacy-Preserving Search Engine Query Logs for Data Monetization.",
                    "In Light of the Legal Debate over Personal Data Privacy at a Time of Globalized Big Data: Making Big Data Researchers Cooperating with Lawmakers to Find Solutions for the Future.",
                    "Employing Private Data in AMI Applications: Short Term Load Forecasting Using Differentially Private Aggregated Data.",
                    "Applying the Trustworthy Remote Entity to Privacy-Preserving Multiparty Computation: Requirements and Criteria for Large-Scale Applications.",
                    "Distributed Coverage of Ego Networks in F2F Online Social Networks.",
                    "A Timer Based Leader Election Algorithm.",
                    "RPiDS: Raspberry Pi IDS - A Fruitful Intrusion Detection System for IoT.",
                    "An Adaptive Replica Mechanism for Real-Time Stream Processing.",
                    "A Framework of Multiple Kernel Ensemble Learning for Hyperspectral Classification.",
                    "Multi-application Query Optimization for Shared WSNs Leveraging Caching Mechanism.",
                    "Hybrid Analysis of Audience Gaze and Constitutive Features of Slides for Extracting the Defective Portions from Presentation Slides.",
                    "Estimation of the Error Factors in Programming Exercises Based on Dynamic Revisions of Case-Bases.",
                    "A Method for Collecting Learners' Thinking Process in ER Modeling Exercises and Its Application Experiment.",
                    "A System for Facilitating Discussion in Business Simulation Exercises Based on the Dual-Advising Model.",
                    "Implementation of Collaborative E-Learning System for Unstable Environment.",
                    "Smart-Guard: Defending User Input from Malware.",
                    "A Quorum System for Distributing RFID Tags.",
                    "A Green Trust Management Scheme to Mitigate Trust-Distortion Attacks on MANETs.",
                    "Enabling Self-Configuration of QoC-Centric Fog Computing Entities.",
                    "Choosing Security Elements for the xAAL Home Automation System.",
                    "An Integrated Virtualized Strategy for Fault Tolerance in Cloud Computing Environment.",
                    "AGOCS - Accurate Google Cloud Simulator Framework.",
                    "A Cloud Solution for Multi-omics Data Integration.",
                    "On MAS-Based, Scalable Resource Allocation in Large-Scale, Dynamic Environments.",
                    "The Weekend Warrior: How to Build a Genomic Supercomputer in Your Spare Time Using Streams and Actors in Scala.",
                    "An Out-of-Core Method for Physical Simulations on a Multi-GPU Architecture Using Lattice Boltzmann Method.",
                    "An Efficient Load Balancing Method for Tree Algorithms.",
                    "Cost-Efficient Parallel RSA Decryption with Integrated GPGPU and OpenCL.",
                    "A Zero-Copy Shared Memory Framework for Host-Guest Data Sharing in KVM.",
                    "Parallel Monte-Carlo Simulations on GPU and Xeon Phi for Stratospheric Balloon Envelope Drift Descent Analysis.",
                    "Analysis and Evaluation of the Performance of CAPE.",
                    "Many-Thread Aware Compression in GPGPUs.",
                    "Accelerating Computation on an Android Phone with OpenCL Parallelism and Optimizing Workload Distribution between a Phone and a Cloud Service.",
                    "GPU Accelerated Robust-Laser Based Fast Simultaneous Localization and Mapping.",
                    "Simulation-Based Optimization Methods Applied to Large Scale Water Systems Control.",
                    "An Approach to Aggregation of Security Events in Internet-of-Things Networks Based on Genetic Optimization.",
                    "Artificial Neural Network and Monte Carlo Simulation in a Hybrid Method for Time Series Forecasting with Generation of L-Scenarios.",
                    "Adaptive and Power-Aware Resilience for Extreme-Scale Computing.",
                    "Placement of Smart Mobile Access Points in Wireless Sensor Networks and Cyber-Physical Systems Using Fog Computing.",
                    "Progress Estimation in Parallel Data Processing Systems.",
                    "When to Use a Distributed Dataflow Engine: Evaluating the Performance of Apache Flink.",
                    "ETSCH: Partition-Centric Graph Processing.",
                    "Classifying Very High-Dimensional and Large-Scale Multi-class Image Datasets with Latent-lSVM.",
                    "A Streaming Data Anomaly Detection Analytic Engine for Mobile Network Management.",
                    "Dynamic Temporal Policy Model for Online Social Networks.",
                    "Accelerating Apache Spark Big Data Analysis with FPGAs.",
                    "Little Big Data: Shaping Minds for the Cloud.",
                    "Towards an Adaptive Multi-agent System for Dynamic Big Data Analytics.",
                    "Big Data Quality: A Quality Dimensions Evaluation.",
                    "Energy-Efficient Data Mining Techniques for Emergency Detection in Wireless Sensor Networks.",
                    "SLA Specification and Negotiation Model for a Network of Federated Clouds: CloudLend.",
                    "A Performance and Profit Oriented Data Replication Strategy for Cloud Systems.",
                    "A Semantic-Agent Framework for PaaS Interoperability.",
                    "An Iterative Weighted KNN (IW-KNN) Based Indoor Localization Method in Bluetooth Low Energy (BLE) Environment.",
                    "Machine Learning-Based Framework for Resource Management and Modelling for Video Analytic in Cloud-Based Hadoop Environment.",
                    "Glowworm Swarm Optimisation Algorithm for Virtual Machine Placement in Cloud Computing.",
                    "How to Keep People Playing Mobile Games: An Experience Requirements Testing Approach.",
                    "Is There PAPA in Crowd Work?: A Literature Review on Ethical Dimensions in Crowdsourcing.",
                    "Crowd Sensing of Road Conditions and Its Monetary Implications on Vehicle Navigation.",
                    "Deep Learning Based Affective Model for Speech Emotion Recognition.",
                    "Increasing the Support to Humans in Factory Environments Using a Smart Glove: An Evaluation.",
                    "An Assessment Planner for MOOCs Based ODALA Approach.",
                    "Monitoring and Control Framework for Business Processes in Ubiquitous Environments.",
                    "Scalable Distributed Cloud Data Storage Service for Internet of Things.",
                    "Design of a New Fasten-Able Linear Motor for Smart Distributed Robot System.",
                    "Behaviour Analysis in Smart Spaces.",
                    "Towards a IoT Framework for the Matchmaking of Sensors' Interfaces.",
                    "Measuring Users Relationship Strength Using a Hierarchical Voting-Based Model.",
                    "A Novel Practical Method to Classify Scholars Based on Research Subjects.",
                    "Client-Side Partial File Caching for Cloud-Based Systems.",
                    "Mobility and the Internet of People: A Morphological Analysis.",
                    "A Quantity Based Aggregation Control Model for Graph Databases.",
                    "RpR: A Trust Computation Model for Social Internet of Things.",
                    "A Combined Solution for Conjunctive Keyword Search, Phrase Search and Auditing for Encrypted Cloud Storage.",
                    "Fuzzy Petri Net Method for Hesitant Decision Making.",
                    "A Policy-Driven Framework for Document Classification and Enterprise Security.",
                    "Scanning for Viruses on Encrypted Cloud Storage.",
                    "Towards Smart and Sustainable Multimodal Public Transports Based on a Participatory Ecosystem.",
                    "Urban Knowledge Extraction, Representation and Reasoning as a Bridge from Data City towards Smart City.",
                    "ADREAM: Energy Consumption Optimisation through Dynamic Energetic Simulations for an Intelligent Management of Energy.",
                    "Evaluation of Hemp Concrete Thermal Properties.",
                    "LVDC Grid Based on PV Energy Sources and Multiple Electrochemical Storage Technologies.",
                    "Opportunistic Composition of Human-Computer Interactions in Ambiant Spaces.",
                    "Trusted Access Control System for Smart Campus.",
                    "From Building Control to Eco-Feedback: Opportunities and Challenges.",
                    "Use Cases of Pervasive Artificial Intelligence for Smart Cities Challenges.",
                    "Formal Requirements Engineering for Smart Industries: Toward a Model-Based Graphical Language.",
                    "A Data Model for Supplying a Data Center with Several Energy Sources.",
                    "The Medical Experiential Service Design Based on Users.",
                    "Design of Emotional Construction-Based Life Service APP for Elderly People.",
                    "Bees Colonies for Meaningfull Communities Detection in Social Medias Network.",
                    "Using Real Option Model to Evaluate Movie Investments Based on Social Network.",
                    "Usability-Oriented Designing in Community Health Management App.",
                    "An Empirical Study on Preference Distribution of Facebook Users.",
                    "EnUp: Energy-Efficient Data Uploading for Mobile Crowd Sensing Applications.",
                    "Energy Efficient Trajectory Recording of Mobile Devices Using WiFi Scanning.",
                    "A Survey on Wi-Fi Based Contactless Activity Recognition.",
                    "A Novel Pavement Performance Prediction Framework in Smart City Based on Tensor Decomposition.",
                    "Children Playing with Robots Using Stigmergy on a Smart Floor.",
                    "Internet of Things in Motion: A Cooperative Data Muling Model Under Revisit Constraints.",
                    "Efficient Multisite Computation Offloading for Mobile Cloud Computing.",
                    "A Trust-Based Offloading for Mobile M2M Communications.",
                    "Mobility and Context-Aware Offloading in Mobile Cloud Computing.",
                    "CID: A Compile-Time Implementation Decider for Heterogeneous Platforms Based on C++ Attributes.",
                    "Detecting Kernels Suitable for C-Based High-Level Hardware Synthesis.",
                    "MyThOS - Scalable OS Design for Extremely Parallel Applications.",
                    "Enforcing Techniques and Transformation of C/C++ Source Code to Heterogeneous Hardware.",
                    "Efficient Dynamic Memory Allocation in Data Stream Processing Programs.",
                    "A Real-Time Embedded Heterogeneous GPU/FPGA Parallel System for Radar Signal Processing.",
                    "Topic Modeling and Visualization for Big Data in Social Sciences.",
                    "Tuning Active Sampling Techniques for Evolutionary Learner from Big Data Sets: Review and Discussion.",
                    "Dynamic Range Partitioning with Asynchronous Data Balancing.",
                    "Hierarchical Data Topology Based Selection for Large Scale Learning.",
                    "Spammer Detection for Real-Time Big Data Graphs.",
                    "Delta RAID to Enhance Recovery and Small-Write Performance of RAID Storages.",
                    "Big Data for Urban Studies: Opportunities and Challenges: A Comparative Perspective."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "UIC/ATC/ScalCom 2015",
        "info": "Beijing, China",
        "venues": [
            {
                "sub_name_abbr": "conf/uic/2015",
                "sub_name": "2015 IEEE 12th Intl Conf on Ubiquitous Intelligence and Computing and 2015 IEEE 12th Intl Conf on Autonomic and Trusted Computing and 2015 IEEE 15th Intl Conf on Scalable Computing and Communications and Its Associated Workshops (UIC-ATC-ScalCom), Beijing, China, August 10-14, 2015.",
                "count": 317,
                "papers": [
                    "Recognizing Gait Pattern of Parkinson's Disease Patients Based on Fine-Grained Movement Function Features.",
                    "SensorAct: A Decentralized and Scriptable Middleware for Smart Energy Buildings.",
                    "Hygeia: A Practical and Tailored Data Collection Platform for Mobile Health.",
                    "SAPM: Self-Adjusting Pipelining Mechanism for Efficient Bulk Data Dissemination in Smart Homes.",
                    "Monitoring Sleep and Detecting Irregular Nights through Unconstrained Smartphone Sensing.",
                    "Composite Activity Recognition in Smart Homes Using Markov Logic Network.",
                    "WSelector: A Multi-scenario and Multi-view Worker Selection Framework for Crowd-Sensing.",
                    "A Novel Graph-Based Method to Study Community Evolutions in Social Interactions.",
                    "CrowdPic: A Multi-coverage Picture Collection Framework for Mobile Crowd Photographing.",
                    "Heterogeneous Sparse Relational Data Co-clustering in Social Network.",
                    "A Context-Aware Spontaneous Mobile Social Network.",
                    "Detecting Urban Road Condition and Disseminating Traffic Information by VANETs.",
                    "A Novel Trace-Aided Data Dissemination Algorithm in Vehicular Networks.",
                    "A Hybrid Cellular Automaton Mechanism Inspired Approach for Dynamic and Real-Time Traffic Lights Scheduling.",
                    "Intelligent Taxi Service System Based on Carrier-Cloud-Client.",
                    "An Acoustic Traffic Monitoring System: Design and Implementation.",
                    "Taxi Operation Optimization Based on Big Traffic Data.",
                    "Sensing the Pulse of Urban Activity Centers Leveraging Bike Sharing Open Data.",
                    "An Interpretable Orientation and Placement Invariant Approach for Smartphone Based Activity Recognition.",
                    "On Improvement of the DV-RND Localization in Wireless Sensor Networks.",
                    "Characterising and Predicting Urban Mobility Dynamics by Mining Bike Sharing System Data.",
                    "Underground Magnetic Localization Method and Optimization Based on Simulated Annealing Algorithm.",
                    "Programming Method and Formalization for Activity-Oriented Context-Aware Applications.",
                    "An Adaptive Demodulation Structure for UHF RFID Readers Based on the Phase of Input Signal.",
                    "Intelligently Creating Contextual Tutorials for GUI Applications.",
                    "Super Rack: Reusing the Results of Queries in MapReduce Systems.",
                    "Flexible Management of Cloud-Connected Digital Signage.",
                    "Recognition of New and Old Banknotes Based on SMOTE and SVM.",
                    "Guardian Angel: A Smartphone Based Personal Security System for Emergency Alerting.",
                    "Deploying and Evaluating Pufferfish Privacy for Smart Meter Data.",
                    "HyCPK: Securing Identity Authentication in Ubiquitous Computing.",
                    "A Scheme for Activity Trajectory Dataset Publishing with Privacy Preserved.",
                    "Context-Aware Trust-Based Management of Vehicular Ad-Hoc Networks (VANETs).",
                    "Intelligent Reconfigurable Gateway for Heterogeneous Wireless Sensor and Actuator Networks.",
                    "Passively Testing Routing Protocols in Wireless Sensor Networks.",
                    "BWMesh: A Multi-hop Connectivity Framework on Android for Proximity Service.",
                    "The Bimodal Probability Density Distribution of the Survivability for Wireless Sensor Networks under Random Failures.",
                    "WiGroup: A Lightweight Cellular-Assisted Device-to-Device Network Formation Framework.",
                    "Vista Wearable: Seeing through Whole-Body Touch without Contact.",
                    "On Trajectory Prediction in Indoor Retail Environments for Mobile Advertising Using Selected Self-Histories.",
                    "FRID: Indoor Fine-Grained Real-Time Passive Human Motion Detection.",
                    "An Online Approach for Detecting Repackaged Android Applications Based on Multi-user Collaboration.",
                    "Collaborative Bicycle Sensing for Air Pollution on Roadway.",
                    "An Adaptive Memetic Algorithm for Designing Artificial Neural Networks.",
                    "Mobile Crowd Assisted Navigation for the Visually Impaired.",
                    "Robust Deployment for Data Collecting under Random Node Failures in Wireless Sensor Networks.",
                    "Sparse Multi-target Localization and Tracking in Wireless Sensor Network.",
                    "Multi-class Object Recognition and Segmentation Based on Multi-feature Fusion Modeling.",
                    "An Improved WC-RDV Localization Algorithm for WSNs.",
                    "Multi-link Passive Localization with Low Cost in Wireless Sensor Networks.",
                    "Energy Cost Optimization via Intelligent Cell Breathing in Green Heterogeneous Networks.",
                    "InCamShare: An Automatic Playlist Creator Employs Users' Shared Experience on Mobile Devices.",
                    "Discovering Urban Social Functional Regions Using Taxi Trajectories.",
                    "strDoctor: Indicate Stroke for Elderly through Body Sensing Game.",
                    "Discovering Spatial Contexts for Traffic Flow Prediction with Sparse Representation Based Variable Selection.",
                    "Perception Enhanced Robotic Arm.",
                    "The Future of Smart Dressing Mirror: An Open Innovation Concept Video.",
                    "iPri: Context-Aware Access Control and Privacy Policy Recommendation.",
                    "Flier Meet: Crowdsensing Enabled Urban Public Information Reposting and Sharing.",
                    "Smartworld: A Better World.",
                    "Discovering User Connections Using Their Shared Images on Social Media.",
                    "Ubiquitous Intelligent Computing in 10 Years VS Chinese Kungfu.",
                    "Exploring the User Response Time of Login Application Based on SOAE.",
                    "Fast Processing of Conversion Time Data Flow in Cloud Computing via Weighted FP-Tree Mining Algorithms.",
                    "An Efficient Dispatch and Decision-Making Model for Taxi-Booking Service.",
                    "A Heuristic Adaptive Threshold Algorithm on IaaS Clouds.",
                    "Semantic Security for E-Health: A Case Study in Enhanced Access Control.",
                    "Knowledge-Enhanced Multi-semantic Fusion for Concept Similarity Measurement in Continuous Vector Space.",
                    "Optimizing the Quality of Service for a Publish/Subscribe System.",
                    "Management of Unstructured Geological Data Based on Hadoop.",
                    "Research on Computational Experiment of the Service Operation Strategy in Collaborative Manufacturing.",
                    "Secure Network Bandwidth Provisioning for Quality of Services (QoS) Guarantees.",
                    "Towards Trustworthy Integrated Clinical Environments.",
                    "IMSet-SHA3-Tree: The Efficient Data Integrity Verification Based on SHA3 and MSet-XOR-Hash.",
                    "High Spatial Resolution Remote Sensing Data Computing Pattern Based on Feature Primitives.",
                    "Survivability Analysis with Border Effects for Power-Aware Mobile Ad Hoc Network.",
                    "A Fast Modified DOA Estimation Algorithm with Rotation Array for Vehicle Security in Intelligent Transportation System.",
                    "Verification for Security-Relevant Properties and Hyperproperties.",
                    "Predatory Search Strategy Aided Monte Carlo Localization for Cellular Networks.",
                    "2DMT Contrast Research for Symmetrical Anisotropic and Isotropic Bodies.",
                    "A Hybrid Vertex Outlier Detection Method Based on Distributed Representation and Local Outlier Factor.",
                    "Addressing Hardware Security Challenges in Internet of Things: Recent Trends and Possible Solutions.",
                    "Integrated Real-Time Self-Organized Control for Transmission Interval and Power in Autonomous Clustering of Mobile Ad Hoc Networks.",
                    "Optimal Power-Aware Design in a Cluster System: Markov Decision Process Approach.",
                    "Reliability Improvement of Multi-path Routing for Wireless Sensor Networks and Its Application to Wormhole Attack Avoidance.",
                    "Exploring a Uniform Framework for a Mobile Collaborative Work Support Platform.",
                    "An In-Depth Context-Awareness Framework for Pervasive Video Cloud.",
                    "A Trust-Based Usage Control Scheme for Resource Sharing.",
                    "Component-Based Framework for Digital Nautical Chart System.",
                    "An Automated Aero-Engine Thrust Detecting Method Based on Sound Recognition.",
                    "A High-Throughput Processor for Dual-Field Elliptic Curve Cryptography with Power Analysis Resistance.",
                    "The Research on Broadcast Television User Interest Model Based on Principal Component Analysis.",
                    "Designing Wireless Vibration Monitoring System for Petrochemical Units Fault Diagnosis.",
                    "A Study on Parallel Computation Based on Forward Modeling and Inversion Algorithm of 2D Magnetotelluric.",
                    "Mobile Surfing Pattern Analysis over Time and Location on a Big Access Record.",
                    "Parallel Implementation and Performance Comparison of BiCGStab for Massive Sparse Linear System of Equations on GPU Libraries.",
                    "A Generic Formulated KID Model for Pragmatic Processing of Data, Information, and Knowledge.",
                    "CDS - A Collaborative Dynamic Source Routing Protocol for Wireless Sensor Network.",
                    "Judging Subjective and Objective Sentence Based on 2-POS Subjective Models.",
                    "Analyze Login and Certification Time Based on SOA with EIP Architecture.",
                    "The Urban Villages' Topographic Database System Construction Based on Oracle Map Fusion Middleware.",
                    "A Microblog Data Acquisition Method Based on Follow-Group Mode.",
                    "A Job-Shop Scheduling Model with Real-Time Feedback for Physical Internet-Based Manufacturing Shopfloor.",
                    "Improving Near Surface Soil Moisture Retrieval Based on Radiative Transfer Model.",
                    "Hot Topics Extraction from Chinese Micro-blog Based on Sentence.",
                    "Big Data Transformation Testing Based on Data Reverse Engineering.",
                    "A Probabilistic Homomorphic Encryption Algorithm over Integers - Protecting Data Privacy in Clouds.",
                    "An Application Research of Unbiased Converted Measurement Kalman Filter.",
                    "Creating Multi-domain Query Plans on Data Services.",
                    "Research on Evolvable Hardware Based on Population Hybridization Monkey-King Genetic Algorithm.",
                    "An Energy Efficient Routing Protocol for Underwater WSNs.",
                    "API Sequences Based Malware Detection for Android.",
                    "The Assessment Strategy for Intelligent Algorithms Using Improved Osculating Value Method.",
                    "Study on Intelligent Logistics System: Based on Internet of Vehicles.",
                    "Efficiently Preserving the Privacy of the Semantic Routing in Named Data Network.",
                    "Food Image Recognition with Convolutional Neural Networks.",
                    "Enterprise Application Security in Android Devices Using Short Messaging Service under Unified Communication Framework.",
                    "Large Scale Distributed Information System Emulation Platform Based on Cloud Computing Technology.",
                    "Application Reliability Evaluation for Tactical Internet Based on OPNET.",
                    "Research on Tasks Satisfaction Type of Intelligent Planning Algorithm.",
                    "Modeling of Rectangular Periodic Impulsive Noise in Low-Voltage Power Line Channels.",
                    "CoGA: Extension of GA on Heterogeneous System.",
                    "Improved Chain Calculation for Sub-chain Dependencies in Layered Queueing Networks.",
                    "The Analysis of the Electromagnetic Performance of Planar Mesh Reflector Based on the Electrical Contact Model of Metallic Junction.",
                    "Review of Pitch Control for Variable Speed Wind Turbine.",
                    "Scalable Explicit Multicasting on Internet: A Topological-Aware Approach.",
                    "Visual Analysis of Harbor Hydrological Data in MANET.",
                    "Accuracy Enhanced Distributed Sparse Matrix Solver with Block-Based Pivoting for Large Linear Systems.",
                    "Fast Parallel Extract-Shift and Parallel Deposit-Shift in General-Purpose Processors.",
                    "A Trust-Level Based Authorization Model Using Signaling Games.",
                    "Server-Based Bitrate Allocation in Content Delivery Network.",
                    "Dynamic Resource Pricing and Scalable Cooperation for Mobile Cloud Computing.",
                    "Key Technology of Online Auditing Data Stream Processing.",
                    "An Integrated Approach for Vehicle Detection and Type Recognition.",
                    "Survey on Air Levitation Conveyors with Possible Scalability Properties.",
                    "Design and Application of Wireless Sensor Network Based on Signal Integrity Analysis.",
                    "EDAGF: Estimation & Direction Aware Greedy Forwarding for Urban Scenario in Vehicular Ad-Hoc Network.",
                    "Performance Improvement of Visible Light Communication System Using Reed-Solomon Code.",
                    "An Intrusion Detection System Based on Hadoop.",
                    "A Cloud Based Framework for Identification of Influential Health Experts from Twitter.",
                    "Optimal Relay Selection and Cooperative Power Allocation in Cognitive Radio Networks.",
                    "Research on Multicast Congestion Control.",
                    "Local Recovery of Wireless Multihop Infrastructure with the Autonomous Mobile Base Station.",
                    "Measurement Reliability Prediction for Passive Wireless Resonant SAW Sensor System.",
                    "Disease Diagnosis Supported by Hierarchical Temporal Memory.",
                    "Making Tagging Systems Resistant to Tricky Spam Attacks.",
                    "Modeling Network with Topic Model and Triangle Motif.",
                    "Combining Clustering Algorithm with Factorization Machine for Friend Recommendation in Social Network.",
                    "Detecting Crowdsourcing Click Fraud in Search Advertising Based on Clustering Analysis.",
                    "Exploring Cloud Monitoring Data Using Search Cluster and Semantic Media Wiki.",
                    "Software Defined Cities: A Novel Paradigm for Smart Cities through IoT Clouds.",
                    "An Empirical Comparison of Three Ensemble Methods for Medical Data Mining with Apache Spark.",
                    "Electricity Consumption Analysis and Applications Based on Smart Grid Big Data.",
                    "Fast Fine-Grained Air Quality Index Level Prediction Using Random Forest Algorithm on Cluster Computing of Spark.",
                    "Processing Skyline Groups on Data Streams.",
                    "A MapReduce Cluster Deployment Optimization Framework with Geo-distributed Data.",
                    "Experiences on a Video Management Cloud Based on Hadoop.",
                    "Dynamic Load Balancing Algorithm in Cloud.",
                    "Optimizing Data Partition for NoSQL Cluster.",
                    "Access Control for Cloud Applications.",
                    "Inspection of Hidden Dangers Based on Cloud Messaging Push Service.",
                    "CPN Based Validation on Pervasive Cloud Task Migration.",
                    "Formalizing Mobile Cloud Service Migration with Event-B.",
                    "An Improved Genetic-Based Approach to Task Scheduling in Inter-cloud Environment.",
                    "Tourist Service in Natural Scenic Area Based on RFID Technique.",
                    "GACA-VMP: Virtual Machine Placement Scheduling in Cloud Computing Based on Genetic Ant Colony Algorithm Approach.",
                    "Toward a Framework in Cloudlet-Based Architecture for a Real-Time Predictional Model.",
                    "Virtual Cloud Bank: Cloud Service Broker for Intermediating Services Based on Semantic Analysis Models.",
                    "Prediction of Hidden Dangers in Mine Production Using Timeliness Managing Extreme Learning Machine for Cloud Services.",
                    "Distributed State Monitoring for IaaS Cloud with Continuous Observation Sequence.",
                    "Towards a Deep Belief Network-Based Cloud Resource Demanding Prediction.",
                    "SDN-Based ARP Attack Detection for Cloud Centers.",
                    "Task Scheduling Algorithm Based on PSO in Cloud Environment.",
                    "Optimizing NoSQL DB on Flash: A Case Study of RocksDB.",
                    "Instruction Emulation and OS Supports of a Hybrid Binary Translator for x86 Instruction Set Architecture.",
                    "Enabling FPGAs in Hyperscale Data Centers.",
                    "Uniform Resource Identifier Encoded by Base62x.",
                    "Nash Bargaining Game Based Subcarrier Allocation for Physical Layer Security in Orthogonal Frequency Division Multiplexing System.",
                    "Utilizing Latent Semantic Word Representations for Automated Essay Scoring.",
                    "A Healthcare System for Detection and Analysis of Daily Activity Based on Wearable Sensor and Smartphone.",
                    "An Improved S-Box of Lightweight Hash Function SPOGENT.",
                    "Research on WiFi User Dwell Time Distribution.",
                    "Mobile Crowdsourcing: Architecture, Applications, and Challenges.",
                    "Digital Explosions and Digital Clones.",
                    "Knowledge Diffusion in Complex Networks.",
                    "Identify Influential Spreaders in Complex Real-World Networks.",
                    "Preference and Movement Pattern Similarity-Based Resource Discovery Enhancement Algorithm for Internet of People.",
                    "Prediction and Clustering of User Relationship in Social Network.",
                    "Threshold Factor Track Classification Algorithm Based on Target Motion Model.",
                    "Modeling of Research Topic Evolution Associated with Social Networks of Researchers.",
                    "Future Transport and the Internet of People.",
                    "Emotion Recognition in Speech Using Multi-classification SVM.",
                    "Prototyping and Experimental Comparison of IR-UWB Based High Precision Localization Technologies.",
                    "Creating Personal 3D Avatar from a Single Depth Sensor.",
                    "Buy4Me: A Delivery System via Mobility Prediction Based on Mobile Crowd Sensing.",
                    "A User-Side Intelligent Energy Decision Making Method Considering Grid-Load Interaction under Smart Grid.",
                    "Identification of Smart Home Potentials in Germany.",
                    "SASLL: A System Annotating Semantic Label of Location.",
                    "Controlling Smart TVs Using Touch Gestures on Mobile Devices.",
                    "Extracting Features for Cardiovascular Disease Classification Based on Ballistocardiography.",
                    "Real-Time Activity Recognition on Smartphones Using Deep Neural Networks.",
                    "Improving Energy Efficiency in M2M Healthcare Systems Using CP-ABE Schemes.",
                    "A Data Fusion Scheme for Modified EKF Banks Positioning Algorithm in Mixed LOS/NLOS Conditions.",
                    "Design of a Wearable Device for Monitoring SpO2 Continuously.",
                    "Anomaly Detection for User Behavior in Wireless Network Based on Cross Entropy.",
                    "Research on E-Learning in College Education: A Model on Personalized Resource Recommendation Based on Learning Situation.",
                    "Community Detecting Oriented Directed and Weighted Network in Mobile Crowd Sensing.",
                    "The Algorithm of Recognizing and Comprehending Vague Tasks Based on Fuzzy Mathematical Theory.",
                    "Towards Service Evaluation and Ranking Model for Cloud Infrastructure Selection.",
                    "(C, K)m-Anonymity: A Model to Resist Sub-trajectory Linkage Attacks.",
                    "A Modified Asynchronous PSO Algorithm.",
                    "A Modified Particle Swarm Optimization Based on Selective-Dimension Learning Model.",
                    "A New Compound Kernel Function for SVM.",
                    "Research on Uncertainty Intelligent Planning Algorithm.",
                    "Cloud Consumer Oriented Utility Model Research in Cloud Computing.",
                    "A Live Migration Algorithm for Virtual Machine in a Cloud Computing Environment.",
                    "DeDroid: A Mobile Botnet Detection Approach Based on Static Analysis.",
                    "A Text Clustering Algorithm Hybriding Invasive Weed Optimization with K-Means.",
                    "Vulnerabilities Scoring Approach for Cloud SaaS.",
                    "Similarity Based Hot Spot News Clustering.",
                    "Polarity Searching for MPRM Logic Circuit Based on Improved Adaptive Genetic Algorithm.",
                    "Parameters Optimization of Back Propagation Neural Network Based on Memetic Algorithm Coupled with Genetic Algorithm.",
                    "Research on Network of Networks Theory.",
                    "ARP Spoofing Based Access Control for DLNA Devices.",
                    "BER Analysis of BPSK Based Magneto-Inductive Communication System in Clay Channel.",
                    "The Simulation and Analysis of Image Change with Improved Cellular Automata and Optimization Methods.",
                    "Analysis and Evaluation of Spoofing Effect on GNSS Receiver.",
                    "Hardware-Assisted Monitoring for Code Security in Embedded System.",
                    "Optimization of Elliptic Curve Cryptography Resisting Power Attack Scalar Multiplication Algorithm in Security System on Chip.",
                    "Study on the Residents Tiered Pricing Model after the Sale of Electricity Liberalization.",
                    "Public Sense: Refined Urban Sensing and Public Facility Management with Crowdsourced Data.",
                    "A Cloud Computing Framework for Smarter District Heating Systems.",
                    "A Tutorial Survey on Delivery of Service Data in Vehicular Ad-Hoc Networks.",
                    "Design Concept Evaluation Based on Rough Number and Information Entropy Theory.",
                    "From Complex Event Processing to Cognitive Event Processing: Approaches, Challenges, and Opportunities.",
                    "On the Memory Wall and Performance of Symmetric Sparse Matrix Vector Multiplications In Different Data Structures on Shared Memory Machines.",
                    "A Fast Computing Algorithm on Optimal Energy Efficiency in Two-Way OFDM Relay System.",
                    "Instruction-Level Instantaneous Power Modeling for VLIW Processor.",
                    "Application of PETSc in the Linear Solver of OpenFOAM.",
                    "Application of Cache in P2P Systems.",
                    "A Novel Tunable Microwave Photonic Band-Pass Filter Based on Chirped Fiber Bragg Gratings.",
                    "Research on the High Penetration Alerting of GMR.",
                    "Design and Implementation of Cloud Server Remote Management System Based on IMPI Protocol.",
                    "The Symptoms and Pathogenesis Entity Recognition of TCM Medical Records Based on CRF.",
                    "Towards Continuous Certification of Infrastructure-as-a-Service Using Low-Level Metrics.",
                    "Detection Changes and Trends in China's Humanity & Social Field by Co-word Analysis: A Case Study on Huang Zongxi.",
                    "Adaptive Dynamic Programming for Multi-Point Scheduling in Energy Harvesting Wireless Sensor Networks.",
                    "A New Corrugated Horn with High Gain and Low Side Lobe.",
                    "Hypergraph Modeling Scheme with Joint Contact Schedule and Prioritized Data Traffic Constraint for Opportunistic Internet of Vehicles.",
                    "Research on Architecture On-Demands for Data Intensive Geoscience Product.",
                    "A Novel Sparse Representation Classification Face Recognition Based on Deep Learning.",
                    "A Real-Time Face Recognition System Based on IP Camera and Image Sets Algorithm.",
                    "Sparse Autoencoder for Facial Expression Recognition.",
                    "Imbalanced Data Classification Based on a Hybrid Resampling SVM Method.",
                    "Fast 3D Measurement Based on Colored Structured Light Projection.",
                    "Fourier Transform of Two Component Quasi-Periodic Optical Superlatticen.",
                    "Tunable Plasmon-Induced Transparency in Plasmonic Bus Waveguide with Side-Coupled Nano-cylinder Cavity.",
                    "Research on a New Power Supply for Electroplating.",
                    "Auxiliary Antenna for Spatial Modulation with Space-Time Block Code.",
                    "An Analytical Method of Inter-harmonic Detection.",
                    "A Survey and Application of Indoor Positioning Based on Scene Classification Optimization.",
                    "A Weak Password Cracker of UHF RFID Tags.",
                    "The Application of Data Mining Technology for the Judgment of Poisoning Cases.",
                    "High Quality Face Image Acquisition with Multi-cameras.",
                    "Analysis for Large Passenger Flow Area and Monitoring Technology.",
                    "Research on the Bistatic Scattering Characteristic of Metal Sphere.",
                    "Analysis of Design and Manufacturing Process of Compact Range Reflector Panel.",
                    "The Design of Multi-bandpass FSS.",
                    "Preparation and Electromagnetic Characteristics of Flake Shaped Carbonyl Iron-Zinc Oxide Nanocomposites.",
                    "A Method of PRF-Ambiguity Resolution Based on Range Frequency Domain.",
                    "Extended Modified Equivalent Current Approximation Method for Pure or Low Lossy Dielectric Objects.",
                    "An Evaluation Method of SAR Images Based on Kullback-Leiber Divergence.",
                    "Radar Target Precession Feature Extraction Based on Multi-view Fusion.",
                    "High Frequency RCS Representation of Trihedral Corner Reflectors with Scalene Triangle Aperture.",
                    "Highly Birefringent Octagonal Photonic Crystal Fibers.",
                    "A Study of Privacy Improvement Using a Randomized Blind Signature Scheme in Vehicular Networks.",
                    "YPAP: The Yoking-Proofs Based Authentication Protocol for Wearable Devices in Wireless Communications.",
                    "RFID System Mutual Authentication Protocols Based on ECC.",
                    "A Survey on the Integrity Checking of Outsourced Data in Cloud Computing.",
                    "The Vehicle Terminal Based on GPRS & CDMA Communication.",
                    "An Evaluation Model for Epidemic Routing in VANETs.",
                    "Cause Analysis of Traffic Accidents Based on Degrees of Attribute Importance of Rough Set.",
                    "Optimizing RSUs Network against Cascading Failure.",
                    "A Novel Approach for Decision Support in Uncertain Environments: The Case of Identifying Similar News Tickers in Natural Gas Trading.",
                    "Design and Implementation of Scalable QoS Policy Management System.",
                    "A Distributed Hybrid Recommendation Framework to Address the New-User Cold-Start Problem.",
                    "Fall Detection Using Plantar Inclinometer Sensor.",
                    "Using Self-Histories to Predict Store Visits in Indoor Retail Environments for Mobile Advertising: A Ranked-Based Technique.",
                    "A Bioinspired Feature-Projection-Based Approach to Electromyographic Pattern Recognition Based for High Dimensional Sparse Sensor Data.",
                    "Pervasive Healthcare Monitoring System.",
                    "Device-Free Passive Human Detection Using Wi-Fi Technology: Current State and Future Trend.",
                    "Towards Knowledge Driven Decision Support for Personalized Home-Based Self-Management of Chronic Diseases.",
                    "Unsupervised Human Activity Segmentation Applying Smartphone Sensor for Healthcare.",
                    "Predicting Dropout-Prone Students in E-Learning Education System.",
                    "Open Learning Platform Based on Personal and Social Analytics for Individualized Learning Support.",
                    "Task Coordination Mechanism Based on Softman Group in the Syncretic System.",
                    "A Wakeup Adapting Traffic and Receiver-Initiated Duty Cycle Protocol for WSN.",
                    "An Improved Collaborative Filtering Based on a Weighted Network and Triadic Closure.",
                    "Application Research of Ternary Optical Computer on Gaussian Elimination.",
                    "Research on Excellent Sequence of Period p^n over GF(q) with Genetic Algorithm.",
                    "An Event Ontology Description Framework Based on SKOS.",
                    "Query of Uncertain QoS of Web Service.",
                    "Multiple User Characteristic Models for Online Survey Based on FP-Tree Algorithm.",
                    "Online Survey Prediction Model for High Response Rate via Decision Tree.",
                    "Effective User Recommendation Model for Online Survey via BP Neural Network.",
                    "Analysis of MPICH Communication Interface and Optimization of Data Partitioning in Matrix Calculation.",
                    "Transformation of an E-R Model into HBase Tables: A Data Store Design for IHE-XDS Document Registry.",
                    "Efficient Frequency and Duty Cycle Control Method for Fast Pulse-Charging of Distributed Battery Packs by Sharing Cell Status.",
                    "Big Data Analytical Architecture Using Divide-and-Conquer Approach in Machine-to-Machine Communication.",
                    "Priority SDN Controlled Integrated Wireless and Powerline Wired for Smart-Home Internet of Things.",
                    "A Study on Hash Chain-Based Hadoop Security Scheme.",
                    "Path-Loss Based Power Efficient Relay Networking for WCE in Body Area Networks.",
                    "Direction Estimation Error Model of Embedded Magnetometer in Indoor Navigation Environment.",
                    "Ultrasound Ranging Method Based on Network-Level Synchronization.",
                    "CRLB for TOA Based Near-Ground Swarm Robotic Localization.",
                    "A Ray-Tracing Based Fingerprinting for Indoor Positioning.",
                    "An Object Reconstruction Algorithm for Moving Vehicle Detection Based on Three-Frame Differencing."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "UIC/ATC/ScalCom 2014",
        "info": "Bali, Indonesia",
        "venues": [
            {
                "sub_name_abbr": "conf/uic/2014",
                "sub_name": "2014 IEEE 11th Intl Conf on Ubiquitous Intelligence and Computing and 2014 IEEE 11th Intl Conf on Autonomic and Trusted Computing and 2014 IEEE 14th Intl Conf on Scalable Computing and Communications and Its Associated Workshops, Bali, Indonesia, December 9-12, 2014.",
                "count": 133,
                "papers": [
                    "IoT Link: An Internet of Things Prototyping Toolkit.",
                    "Situation Inference by Fusion of Opportunistically Available Contexts.",
                    "Detecting Cruising Flagged Taxis' Passenger-Refusal Behaviors Using Traffic Data and Crowdsourcing.",
                    "Handling Influence among Multiple Applications in a Smart Space.",
                    "Implementation of On-Demand Indoor Location-Based Service Using Ad Hoc Wireless Positioning Network.",
                    "Shutter: Preventing Information Leakage Based on Domain Gateway for Social Networks.",
                    "Scalable Security Analysis Using a Partition and Merge Approach in an Infrastructure as a Service Cloud.",
                    "RPC: A Localization Method Based on Regional Partition and Cooperation.",
                    "Recognizing Semantic Locations from Smartphone Log with Combined Machine Learning Techniques.",
                    "A Run-Time Generic Decision Framework for Power and Performance Management on Mobile Devices.",
                    "Muclouds: Parallel Simulator for Large-Scale Cloud Computing Systems.",
                    "A Management System for Cyber Individuals and Heterogeneous Data.",
                    "Nanonetwork Minimum Energy Coding.",
                    "Design of Lower Limb Chair Exercise Support System with Depth Sensor.",
                    "Indoor Localization Utilizing Tracking Scanners and Motion Sensors.",
                    "AR Go-Kon: A System for Facilitating a Smooth Communication in the First Meeting.",
                    "An Anypath Routing Protocol for Multi-hop Cognitive Radio Ad Hoc Networks.",
                    "Intuitive Appliance Control System Based on a High-Accuracy Indoor Positioning System.",
                    "Discovering Latent Structures for Activity Recognition in Smart Environments.",
                    "An Opportunistic Music Sharing System Based on Mobility Prediction and Preference Learning.",
                    "Who Move the Treasures: A RFID-based Approach for the Treasures.",
                    "Behaviors and Communications in Working Support through First Person Vision Communication.",
                    "Human-Assisted Rule Satisfaction in Partially Observable Environments.",
                    "A Cross-Space, Multi-interaction-Based Dynamic Incentive Mechanism for Mobile Crowd Sensing.",
                    "GFRT-chord: Flexible Structured Overlay Using Node Groups.",
                    "Influencing Factors Analysis of People's Answering Behaviours on Social Network Based Questions.",
                    "An Autonomic Approach to Real-Time Predictive Analytics Using Open Data and Internet of Things.",
                    "A Multi-armed Bandit Approach to Online Spatial Task Assignment.",
                    "Palantir: Crowdsourced Newsification Using Twitter.",
                    "Historical Trajectories Based Location Privacy Protection Query.",
                    "Near-Optimal Activity Prediction through Efficient Wavelet Modulus Maxima Partitioning and Conditional Random Fields.",
                    "Taxi Exp: A Novel Framework for City-Wide Package Express Shipping via Taxi Crowd Sourcing.",
                    "Towards Energy Optimization Based on Delay-Sensitive Traffic for WiFi Network.",
                    "BodyRC: Exploring Interaction Modalities Using Human Body as Lossy Signal Transmission Medium.",
                    "Multi-source Broadcast Scheduling Algorithm of Barrage Relay Network in Tactical MANET.",
                    "Discovering People's Life Patterns from Anonymized WiFi Scanlists.",
                    "uStitchHub: Stitching Multi-touch Trajectories on Tiled Very Large Tabletops.",
                    "Design of a Sensing Service Architecture for Internet of Things with Semantic Sensor Selection.",
                    "Identifying Hot Lines of Urban Spatial Structure Using Cellphone Call Detail Record Data.",
                    "Study on Complex Event Processing for CPS: An Event Model Perspective.",
                    "Model-Based Solution for Personalization of the User Interaction in Ubiquitous Computing.",
                    "Task Scheduling in Cyber-Physical Systems.",
                    "Data Collection Oriented Topology Control for Predictable Delay-Tolerant Networks.",
                    "A Novel Email Virus Propagation Model with Local Group.",
                    "Obstacle Avoidance for Visually Impaired Using Auto-Adaptive Thresholding on Kinect's Depth Image.",
                    "Making Business Environments Smarter: A Context-Adaptive Petri Net Approach.",
                    "Subtractive Clustering as ZUPT Detector.",
                    "An Indoor Location-Tracking Using Wireless Sensor Networks Cooperated with Relative Distance Finger Printing.",
                    "Defining and Analyzing a Gesture Set for Interactive TV Remote on Touchscreen Phones.",
                    "Privacy Perceptive Wireless Service Game Model.",
                    "Development of Collaborative Video Streaming for Mobile Networks: From Overview to Prototype.",
                    "MSR: Minimum-Stop Recharging Scheme for Wireless Rechargeable Sensor Networks.",
                    "Service Selection in Ubiquitous Environments: A Novel Approach Using CBR and Skyline Computing.",
                    "Remote Sensing of Forest Stand Parameters for Automated Selection of Trees in Real-Time Mode in the Process of Selective Cutting.",
                    "The Device Cloud - Applying Cloud Computing Concepts to the Internet of Things.",
                    "Studying Accessible States of User Interfaces on Tabletops.",
                    "Tailor-Made Gaussian Distribution for Intrusion Detection in Wireless Sensor Networks.",
                    "Segmentation of Urban Areas Using Vector-Based Model.",
                    "A Machine Learning Approach for Self-Diagnosing Multiprocessors Systems under the Generalized Comparison Model.",
                    "Failure Prediction for Cloud Datacenter by Hybrid Message Pattern Learning.",
                    "Self-Adaptive Containers: Interoperability Extensions and Cloud Integration.",
                    "Automatically Generating External OS Kernel Integrity Checkers for Detecting Hidden Rootkits.",
                    "A Privacy-Aware Architecture for Energy Management Systems in Smart Grids.",
                    "Awareness and Control of Personal Data Based on the Cyber-I Privacy Model.",
                    "SW-POR: A Novel POR Scheme Using Slepian-Wolf Coding for Cloud Storage.",
                    "Distributed Routing Protocol Based on Biologically-Inspired Attractor Selection with Active Stochastic Exploration and a Short-Term Memory.",
                    "Towards a Trust Model for Trust Establishment and Management in Business-to-Consumer E-Commerce.",
                    "An Efficient Trust-Oriented Trip Planning Method in Road Networks.",
                    "Trust-E: A Trusted Embedded Operating System Based on the ARM Trustzone.",
                    "An Adaptivity-Enhanced Multipath Routing Method for Secure Dispersed Data Transfer Method in Ad Hoc Networks with Varying Node Density.",
                    "Secure Third Party Auditor for Ensuring Data Integrity in Cloud Storage.",
                    "A Routing Scheme Based on Autonomous Clustering and P2P Overlay Network in MANETs.",
                    "Privacy Protection against Query Prediction in Location-Based Services.",
                    "Forwarding Impact Aware Routing Protocol for Delay Tolerant Network.",
                    "An Architecture for Virtualization-Based Trusted Execution Environment on Mobile Devices.",
                    "An Autonomic Container for the Management of Component-Based Applications in Pervasive Environments.",
                    "An Efficient Algorithm for Deriving Mobility Scenarios from New Mobility Model Representing Spatially and Temporally Biased Change of Node Mobility and Node Density for Mobile Ad Hoc Networks.",
                    "Compatibility in Service-Oriented Revision Control Systems.",
                    "International Center for Monitoring Cloud Computing Providers (ICMCCP) for Ensuring Trusted Clouds.",
                    "Virtual Machine Migration Methods for Heterogeneous Power Consumption.",
                    "Partial Least Squares Improvement and Research Principal Component Regression Extraction Methods.",
                    "Toward Data-Centric Software Architecture for Automotive Systems - Embedded Data Stream Processing Approach.",
                    "An Anonymous Remote Attestation Protocol to Prevent Masquerading Attack.",
                    "SecPlace: A Security-Aware Placement Model for Multi-tenant SaaS Environments.",
                    "Analysis of Virtual Machine Monitor as Trusted Dependable Systems.",
                    "On the Applicability of the Tree-Based Group ID Reassignment Routing Method for MANETs.",
                    "Delay- and Disruption-Tolerant Bluetooth MANET-Based Dual-Purpose Systems for Normal and Disaster Situations.",
                    "A Study on Providing the Reliable and Secure SMS Authentication Service.",
                    "Vacuuming XML.",
                    "A Discrete Time Financial Option Pricing Model for Cloud Services.",
                    "Proposal of a Distributed Cooperative M2M System for Flood Disaster Prevention.",
                    "Trust in Mobile Cloud Computing with LTE-based Deployment.",
                    "CAVE: Hybrid Approach for In-Network Content Caching.",
                    "Monitoring Hadoop by Using IEEE1888 in Implementing Energy-Aware Thread Scheduling.",
                    "Estimation of Sleep Quality of Residents in Nursing Homes Using an Internet-Based Automatic Monitoring System.",
                    "A Fine-Grained Cross-Domain Access Control Mechanism for Social Internet of Things.",
                    "Intelligent Human Fall Detection for Home Surveillance.",
                    "More than Meets the Eye in Smart City Information Security: Exploring Security Issues Far beyond Privacy Concerns.",
                    "Interactive Design and Simulation System for Deploying Wireless Sensor Networks Based on Centriod Multi-touch Screen.",
                    "Case Study of Constructing Weather Monitoring System in Difficult Environment.",
                    "Sensor Based Vehicle Environment Perception Information System.",
                    "Vision Based Mapping and Localization in Unknown Environment for Intelligent Mobile Robot.",
                    "Anti-copy of 2D Barcode Using Multi-encryption Technique.",
                    "A Novel Automated Software Test Technology with Cloud Technology.",
                    "Restful Design and Implementation of Smart Appliances for Smart Home.",
                    "The Latent Appreciation Effect of Interactive Design in Internet Communication.",
                    "The Key Features and Applications of Newmedia Interactive Design.",
                    "A Realtime Framework for Video Object Detection with Storm.",
                    "A Service Composition Environment Based on Enterprise Service Bus.",
                    "A Wearable Internet of Things Mote with Bare Metal 6LoWPAN Protocol for Pervasive Healthcare.",
                    "Private Smart Space: Cost-Effective ADLs (Activities of Daily Livings) Recognition Based on Superset Transformation.",
                    "A Proactive Approach for Information Sharing Strategies in an Environment of Multiple Connected Ubiquitous Devices.",
                    "Shadow VoD: Performance Evaluation as a Capability in Production P2P-CDN Hybrid VoD Networks.",
                    "Estimate Dynamic Road Travel Time Based on Uncertainty Feedback.",
                    "Mobiscan3D: A Low Cost Framework for Real Time Dense 3D Reconstruction on Mobile Devices.",
                    "Computing Realistic Images for Audience Interaction in Projection-Based Multi-view Display System.",
                    "Human Computer Interaction Advancement by Usage of Smart Phones for Motion Tracking and Remote Operation.",
                    "Motion Detection and Evaluation of Chair Exercise Support System with Depth Image Sensor.",
                    "Wireless Multihop Transmissions for Secret Sharing Communication.",
                    "DTN Data Message Transmission by Inter-vehicle Communication with Help of Road Map and Statistical Traffic Information in VANET.",
                    "BDMap: A Heuristic Application Mapping Algorithm for the Big Data Era.",
                    "Network Traffic Prediction Based on LSSVM Optimized by PSO.",
                    "Cloud Wave Smart Middleware for DevOps in Clouds.",
                    "Entity Linking and Name Disambiguation in Chinese Micro-Blogs.",
                    "Detecting Suicidal Ideation in Chinese Microblogs with Psychological Lexicons.",
                    "Personalized Activity Recognition Using Molecular Complex Detection Clustering.",
                    "Improving the Architecture of an Autoencoder for Dimension Reduction.",
                    "New Methods to Ensure Security to Increase User's Sense of Safety in Cloud Services.",
                    "A Trade Gap Scalability Model for the Forex Market.",
                    "Multi-tenant Oriented Elastic Data-Centric Cloud Service Based on Resource Meta-Model.",
                    "Composite Activity Recognition in Smart Homes Using Markov Logic Network.",
                    "Mobile Augmented Reality Mashup for Furture IoT Environment.",
                    "Futuring Digital Health and Wellness."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "UIC/ATC 2013",
        "info": "Vietri sul Mare, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/uic/2013",
                "sub_name": "2013 IEEE 10th International Conference on Ubiquitous Intelligence and Computing and 2013 IEEE 10th International Conference on Autonomic and Trusted Computing, UIC/ATC 2013, Vietri sul Mare, Sorrento Peninsula, Italy, December 18-21, 2013.",
                "count": 98,
                "papers": [
                    "Hybrid Localization for Ubiquitous Services.",
                    "DE2: Localization with the Rotating RSS Using a Single Beacon.",
                    "User Travelling Pattern Prediction via Indistinct Cellular Data Mining.",
                    "BodyGuards: A Clairvoyant Location Predictor Using Frequent Neighbors and Markov Model.",
                    "Privacy Preserving Path Recommendation for Moving User on Location Based Service.",
                    "Constructing Adaptive Indoor Radio Maps for Dynamic Wireless Environments.",
                    "Android Platform Based on Vehicle Embedded Data Stream Processing.",
                    "Exploring a New Dimension in Code Mobility for Ubiquitous Embedded Systems.",
                    "PathSim: A Tool for Finding Minimal Energy Device Operation Sequence for Reaching a Target Context in a Smart-Home.",
                    "Using Virtualization and Guacamole/VNC to Provide Adaptive User Interfaces to Disabled People in Cloud Computing.",
                    "Towards Physical Activity Recognition Using Smartphone Sensors.",
                    "uOS: A Resource Rerouting Middleware for Ubiquitous Games.",
                    "Fully Distributed Self Certified Key Management for Large-Scale MANETs.",
                    "Social Activity Recognition and Recommendation Based on Mobile Sound Sensing.",
                    "Tagpref: User Preference Modeling by Social Tagging.",
                    "Integrating Things and the Smart Mobile Phone Capabilities through the Wireless Web of Things.",
                    "Understand Group Travel Behaviors in an Urban Area Using Mobility Pattern Mining.",
                    "Socially-Aware Venue Recommendation for Conference Participants.",
                    "Using the Model of Markets with Intermediaries as an Incentive Scheme for Opportunistic Social Networks.",
                    "A Mobile Social Network-Based Group Touring Scheme with FEC Packet Loss Recovery.",
                    "Where is the Largest Market: Ranking Areas by Popularity from Location Based Social Networks.",
                    "An Automatic Face Annotation System Featuring High Accuracy for Online Social Networks.",
                    "Relationship between Physical Behaviors of Students and Their Scholastic Performance.",
                    "Private Map Matching: Realistic Private Route Cognition on Road Networks.",
                    "FCT4U - When Private Mobile Displays Meet Public Situated Displays to Enhance the User Experience.",
                    "Improving Thermal Comfort in Residential Buildings Using Artificial Immune System.",
                    "RoRo-LT: Social Routing with Next-Place Prediction from Self-Assessment of Spatiotemporal Routines.",
                    "The Case for Mobile Edge-Clouds.",
                    "Endless Flyer: A Continuous Flying Drone with Automatic Battery Replacement.",
                    "WeCare: An Intelligent Badge for Elderly Danger Detection and Alert.",
                    "An Intelligent Monitoring System for Cognitive Impaired People.",
                    "Combining Activity Recognition and AI Planning for Energy-Saving Offices.",
                    "Dynamicity to Save Energy in Microrobots Reconfiguration.",
                    "A Control and Decision System for Smart Buildings.",
                    "A Loosely Coupled and Distributed Bayesian Framework for Multi-context Recognition in Dynamic Ubiquitous Environments.",
                    "An Ontology-Based Model for Context Information Management in Smart Spaces.",
                    "Context-Driven Control Algorithms for Scalable Simulation of Human Activities in Smart Homes.",
                    "Dynamic Parameter Filling for Semantic Exceptions in Context-Aware Systems.",
                    "STRIPS Planning with Modular Behavior Selection Networks for Smart Home Agents.",
                    "Eye-Tracking Experiment Design for Extraction of Viewing Patterns in Social Media.",
                    "Developing Social Applications in SAPERE.",
                    "A Linked Data Approach to Electromagnetic Pollution Monitoring.",
                    "Supporting Personizable Virtual Internet of Things.",
                    "A Logic Framework for Flexible and Security-Aware Service Composition.",
                    "Can We Trust This User? Predicting Insider's Attitude via YouTube Usage Profiling.",
                    "It's All in the Cloud: Reviewing Cloud Security.",
                    "A Model for Multi-levels SLA Monitoring in Federated Cloud Environment.",
                    "AntiCheetah: An Autonomic Multi-round Approach for Reliable Computing.",
                    "Model-Driven Estimation of Distributed Vulnerability in Complex Railway Networks.",
                    "Ranking of Direct Trust, Confidence, and Reputation in an Abstract System with Unreliable Components.",
                    "Trusted Computing vs. Advanced Persistent Threats: Can a Defender Win This Game?",
                    "Linguistic Abstractions for Programming and Policing Autonomic Computing Systems.",
                    "Autonomic Agents for Real Time UAV Mission Planning.",
                    "A Smart Diagnostic Model for an Autonomic Service Bus Based on a Probabilistic Reasoning Approach.",
                    "An Autonomic Trust Management Framework for Secure Dynamic Coalition Cooperation.",
                    "Trustful Data Forwarding in Social Opportunistic Networks.",
                    "Towards Efficient Collaborative Behavioural Monitoring in a System-of-Systems.",
                    "Towards a Trusted Hadoop Storage Platform: Design Considerations of an AES Based Encryption Scheme with TPM Rooted Key Protections.",
                    "Security-Aware Scheduling of Mission Tasks under Temporal Constraints.",
                    "Formal Analysis of Security Metrics with Defensive Actions.",
                    "A Browser-Based Perceptual Experiment Platform for Visual Search Study in Augmented Reality System.",
                    "A Low-Cost and Light-Weight Motion Tracking Suit.",
                    "Energy Management in the Smart Home.",
                    "Human Sensing Using Computer Vision for Personalized Smart Spaces.",
                    "ARTHE: Experiencing Projected Augmented Reality with THings of the Everyday.",
                    "Time Machine: A Mobile Augmented Reality System for Tourism Based on Coded-Aperture Camera.",
                    "Novel Hybrid Approach to Content Recommendation Based on Predicted Profiles.",
                    "Distributed Semantic Service Discovery for MANET.",
                    "CrowdSMILE: A Crowdsourcing-Based Social and Mobile Integrated System for Learning by Exploration.",
                    "Agents Based Monitoring of Heterogeneous Cloud Infrastructures.",
                    "Adaptable Web Service Registry for Publishing Profile Annotation Description.",
                    "An Autonomous Fall Detection and Alerting System Based on Mobile and Ubiquitous Computing.",
                    "The Forensics Edge Management System: A Concept and Design.",
                    "CitiSafe: Adaptive Spatial Pattern Knowledge Using Fp-Growth Algorithm for Crime Situation Recognition.",
                    "Trust-Based Context Contract Models for the Internet of Things.",
                    "TrustedSIM: Towards Unified Mobile Security.",
                    "Privacy-Preserving Trajectory Publication against Parking Point Attacks.",
                    "Enhancing the Security of Mobile Applications by Using TEE and (U)SIM.",
                    "Improving Decision-Making for Fuzzy Logic-Based Routing in Wireless Sensor Networks.",
                    "On Neuro-inspired Wireless Sensor Networks.",
                    "Proposal and Evaluation of Attractor Selection-Based Adaptive Routing in Layered Networks.",
                    "Support Vector Regression Technique for Multimedia Quality Control in Multicast Networks.",
                    "The Analysis of Route Availability and Route Stability in Mobile Ad-hoc Wireless Networks.",
                    "On Constant-Time-Identification and Privacy-Preserving RFID Protocols: Trade-Off between Time and Memory.",
                    "A Non-invasive and Autonomous Physical Activity Measurement System for the Elderly.",
                    "Towards Context Consistency in a Rule-Based Activity Recognition Architecture.",
                    "Understanding User's Emotional Engagement to the Contents on a Smartphone Display: Psychiatric Prospective.",
                    "Using Adaptive Feedback for Promoting Awareness about Physical Activeness in Adults.",
                    "Smart End-to-End Infrastructural Solution for Monitoring Patients with Neurological Disorders.",
                    "Supporting Localized Interactions among Heterogeneous Smart Things with ThingWare.",
                    "A Mobile Object-Based Secret Key Distribution Scheme for Wireless Sensor Networks.",
                    "Analysis of Threshold-Based Event Detection Algorithms for Wireless Sensor Networks by Fault Injection.",
                    "Vehicle Type Recognition in WSN Based on ITESP Algorithm.",
                    "On the Impact of Fractal Organization on the Performance of Socio-technical Systems.",
                    "Monitoring Community Clouds: The Lightweight Network Management Protocol.",
                    "Automatic Face Annotation System Used Pyramid Database Architecture for Online Social Networks.",
                    "A Run Time Executable Task Model for Ambient Intelligent Environments.",
                    "An Energy-Efficient Context Management Framework for Ubiquitous Systems."
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "UIC/ATC 2012",
        "info": "Fukuoka, Japan",
        "venues": [
            {
                "sub_name_abbr": "conf/uic/2012",
                "sub_name": "9th International Conference on Ubiquitous Intelligence and Computing and 9th International Conference on Autonomic and Trusted Computing, UIC/ATC 2012, Fukuoka, Japan, September 4-7, 2012.",
                "count": 154,
                "papers": [
                    "Treatment of Missing Data in Intelligent Lighting Applications.",
                    "Development of the Smart Toilet Equipment with Measurements of Physiological Parameters.",
                    "Development of a Route Finding System for Manual Wheelchair Users Based on Actual Measurement Data.",
                    "A Lingustic Approach for Robustness in Context Aware Applications.",
                    "Downlink Scheduling and Resource Allocation in EPON-WiMAX Integrated Networks.",
                    "SocioTelematics: Leveraging Interaction-Relationships in Developing Telematics Systems to Support Cooperative Convoys.",
                    "Data Gathering in a Hybrid Wireless Sensor Network.",
                    "Anycast Routing Based on Connectivity Metric for Sensor and Ad Hoc Networks.",
                    "A Content-Based Publish/Subscribe System for Efficient Event Notification over Vehicular Ad Hoc Networks.",
                    "Performance Analysis of LTE Smartphones-Based Vehicle-to-Infrastrcuture Communication.",
                    "Improving the Estimation of Residual Delay based Forwarding Method in Opportunistic Vehicular Networks.",
                    "Exploiting Ultrasonic Reflections for Improving Accuracy of Indoor Location Tracking.",
                    "Routine Based Analysis for User Classification and Location Prediction.",
                    "MPIGate: A Solution to Use Heterogeneous Networks for Assisted Living Applications.",
                    "3D Modeling and Simulation of Human Activities in Smart Spaces.",
                    "Java Virtual Machine Based Infrastructure for Decent Wireless Sensor Network Development Environment.",
                    "Situation-Based Design: A Rapid Approach for Pervasive Application Development.",
                    "A Mobile Application Framework for Rapid Integration of Ubiquitous Web Services.",
                    "Study of a Conversational Agent System Encouraging \"Real\" Answers of Individuals in a Group of Acquaintances.",
                    "Intelligent Systems that Combine Pervasive Computing and Social Networking.",
                    "A Four-Stage Gate-Keeper Model of Social Service Engineering: Lessons from Golden Rules of Mobile Social Game Design.",
                    "Predicting Mobile Phone User Locations by Exploiting Collective Behavioral Patterns.",
                    "Contribution-Based User Reputation Modeling in Collaborative Recommender Systems.",
                    "Knowledge Transfer in Activity Recognition Using Sensor Profile.",
                    "Hybrid SN: Interlinking Opportunistic and Online Communities to Augment Information Dissemination.",
                    "Global Sensor Modeling and Constrained Application Methods Enabling Cloud-Based Open Space Smart Services.",
                    "A Battery-Aware Energy-Efficient Android Phone with Bayesian Networks.",
                    "An Energy-Efficient Data Collection Mechanism with a Mobile Sink for Wireless Sensor Networks.",
                    "Demand Response Control Strategies for On-campus Small Data Centers.",
                    "Hilbert-Chain Topology for Energy Conservation in Large-Scale Wireless Sensor Networks.",
                    "The Challenge of Preparational Behaviours in Preference Learning for Ubiquitous Systems.",
                    "Risk-Based Intelligent Software Release Planning.",
                    "Efficient Time Series Disaggregation for Non-intrusive Appliance Load Monitoring.",
                    "User Identification Based on Touch Dynamics.",
                    "Neighbor Selection Method Based on Sending Capacity for P2P Live Streaming with Layer Coding.",
                    "Using Dynamic Slots Collision Tracking Tree Technique Towards an Efficient Tag Anti-collision Algorithm in RFID Systems.",
                    "AB-Chord: An Efficient Approach for Resource Location in Structured P2P Networks.",
                    "Development of Industrial Safety Management System for Shipbuilding Industry Using RFID/USN.",
                    "A Transmission Scheduling for Data-Gathering Wireless Sensor Networks.",
                    "A Decentralized Quality Aware Adaptive Sampling Strategy in Wireless Sensor Networks.",
                    "Robust and Dynamic Data Aggregation in Wireless Sensor Networks: A Cross-Layer Approach.",
                    "The IG-Ferry Protocol to Support Efficient Controlled Replication in Vehicular Delay Tolerant Network.",
                    "Wireless Smart Home Sensor Networks: Mobile Agent Based Anomaly Detection.",
                    "An Efficient Method for Lane-Mark Extraction in Complex Conditions.",
                    "An Intelligent Accessing Control System Based on Human Intention Analysis.",
                    "Comparative Study on Advanced TV Interface Types in the Smart Media World.",
                    "A Novel Interval Grey Number and Entropy-based Solution for Multiple-Criteria Group Decision Making Problem.",
                    "An Overlap Aware Technique for Redundant Reader Elimination.",
                    "Backlog Bounds Analysis of Different On-chip Cache Coherence Policies: A Network Calculus-Based Approch.",
                    "Hydra: An Ubiquitous Application for Service Rerouting.",
                    "Confidential Enhancement with Multi-code Keying Reconfiguration over Time-Shifted CHPC-based 2D OCDMA Networks.",
                    "Fault Management for Smart Wireless Sensor Networks.",
                    "An Efficient Clustering Authentication Mechanism for Mobile Ad Hoc Networks.",
                    "A Fault Detection and Diagnosis Framework for Ambient Intelligent Systems.",
                    "Safe Driving Education System ASSIST - Education Anywhere, Anytime.",
                    "A New Generation Children Tracking System Using Bluetooth MANET Composed of Android Mobile Terminals.",
                    "Guaranteeing Asymptotic Stability of Clustering by Autonomous Decentralized Structure Formation.",
                    "Semantic Modeling and Reasoning at Runtime for Autonomous Systems Engineering.",
                    "Autonomic Activities in the Execution of Scientific Workflows: Evaluation of the AWARD Framework.",
                    "Automatic I/O Scheduler Selection through Online Workload Analysis.",
                    "Composite Trust Model for an Information Sharing Scenario.",
                    "Insuring Sensitive Processes through Process Mining.",
                    "On Enhancing Adaptive Random Testing for AADL Model.",
                    "Component Importance Analysis of Virtualized System.",
                    "Performance Analysis of Virtual Disk System for Transparent Computing.",
                    "Optimizing Software Rejuvenation Policies under Interval Reliability Criteria.",
                    "Combined Server Rejuvenation in a Virtualized Data Center.",
                    "Model-Based Performance Optimization of Generalized Snapshot Isolation in Database System.",
                    "Filesystem Layout Reorganization in Virtualized Environment.",
                    "An Availability-Aware Virtual Machine Placement Approach for Dynamic Scaling of Cloud Applications.",
                    "iSac: Intimacy Based Access Control for Social Network Sites.",
                    "PKU-STRAW-L: A Simulative Platform Evaluate the Power-Saving Rate of the Intelligent Street Lamp System.",
                    "Performance Management of Virtual Machines via Passive Measurement and Machine Learning.",
                    "A Self-Protection Mechanism against Stepping-Stone Attacks for IaaS Clouds.",
                    "Neighbor Similarity Trust against Sybil Attack in P2P E-commerce.",
                    "Accuracy of Privacy-Preserving Collaborative Filtering Based on Quasi-homomorphic Similarity.",
                    "A Two-Level Virtual Machine Self-Reconfiguration Mechanism for the Cloud Computing Platforms.",
                    "A Frame Rate Up-Conversion Algorithm for 3-D Video.",
                    "A Power Saving Method with Consideration of Performance in Android Terminals.",
                    "Dependability Modeling and Analysis of Random Port Hopping.",
                    "An Assurance Enhanced Route-Split Routing for Non-uniform Node Density in Mobile Ad Hoc Networks.",
                    "An Extension of Routing Tree Algorithm Considering Link Speed Change in IEEE 802.11n Protocol for Wireless Mesh Network.",
                    "Quasi-static Approach for Analyzing Interactions between Networks and Users Based on Decomposition of Timescales.",
                    "Toward Remote Service Invocation in Android.",
                    "Achieving High Availability of Consistent Data in the Presence of Network Partitions.",
                    "A Routing ID-based Node-disjoint Multipath Scheme for Ad Hoc Networks.",
                    "Privacy, Security and Trust in Cloud Computing: The Perspective of the Telecommunication Industry.",
                    "The Modulation Method Based on Reed-Solomon Code for Watermarking.",
                    "Dual-Watermarking by QR-code Applications in Image Processing.",
                    "Employing LSB and VQ for Undetectable Secret Data Hiding.",
                    "The Design and Realization of Video Phone System in Embedded Platform.",
                    "A Framework for Scalable Cloud Video Recorder System in Surveillance Environment.",
                    "An Architecture for Video Surveillance Service Based on P2P and Cloud Computing.",
                    "A Project-Based Curriculum for Teaching C++ Object-Oriented Programming.",
                    "An Expert System Application for Respiratory Infection Diagnostic.",
                    "Accelerating Computation of DCM for ERP with GPU-Based Parallel Strategy.",
                    "Applying Pervasive Computing in an Architecture for Homecare Environments.",
                    "Assessing the Relationships between IS Success with Intellectual Capital for International Medical Services Centers in Taiwan - The Perspective of Physicians.",
                    "Squareknot: A Flexible Framework for Actuators and Controllers in Smart Environment.",
                    "FOSS4G Based Mobile Web-GIS for Field Survey in Natural Environmental Studies.",
                    "Constructing Private Cloud Storage Using Network Attatched Storage.",
                    "Ubiquitous Computing and Evaluation of Water Quality by Grey Relational Analysis.",
                    "Design and Implementation of an Assisted Body Movement System for Visually Impaired Children.",
                    "Execution Time Prediction Using Rough Set Theory in Hybrid Cloud.",
                    "A Finite State Machine-Based Fall Detection Mechanism on Smartphones.",
                    "System Design of an Intelligent Nutrition Consultation and Recommendation Model.",
                    "An Enhanced IOT Gateway in a Broadcast System.",
                    "How Online Social Network Affects Offline Events: A Case Study on Douban.",
                    "Mixed-Style Print Advertising Combining Fashion Photography and Digital Illustrations: Examining the Print Advertising of Consumer Products in Taiwan.",
                    "Ubiquitous Smart Devices and Applications for Disaster Preparedness.",
                    "A Surveillance System Designed for the Correction of Sitting Posture in Writing.",
                    "Development of an Intelligent App for Obstructive Sleep Apnea Prediction on Android Smartphone Using Data Mining Approach.",
                    "Mining Distributed Frequent Itemsets Using a Gossip Based Protocol.",
                    "An Intelligent Virtual Fence Security System for the Detection of People Invading.",
                    "From User Experience to Social Experience: A New Perspective for Mobile Social Game Design.",
                    "A Distributed Integrated Fare Collection and Accounting System for Metropolitan Railway Transit.",
                    "Interval-Valued Cloud Model Based Personal Sub-health Status Diagnosing Prototype System on TCM Syndrome Data.",
                    "A New RFID Anti-collision Algorithm for the EPCglobal UHF Class-1 Generation-2 Standard.",
                    "Design and Implementation of an Auto-Configuration and Cooperation Generation of Web Service User Interface Based on TR-069 Protocol.",
                    "Enhancing Traditional Games with Augmented Reality Technologies.",
                    "Toward Efficient Detection of Semantic Exceptions in Context-Aware Systems.",
                    "A Vision-Based Vehicle Speed Warning System.",
                    "Recovery Mechanism for Diff-based Reprogramming in WSNs.",
                    "Compiler Optimization to Reduce Cache Power with Victim Cache.",
                    "F-VT: A Friendly Virtualization Framework.",
                    "HeapDefender: A Mechanism of Defending Embedded Systems against Heap Overflow via Hardware.",
                    "Smart Trend-Traversal Protocol with Shortcutting for Memory-less RFID Tag Collision Resolution.",
                    "Reverse Nearest Neighbors Search in Wireless Broadcast Environments.",
                    "SARM: A Congestion Control Algorithm for DTN.",
                    "Station Decision Problem in Bicycle Ad Hoc Networks.",
                    "Entropy-Based Distributed Fault-Tolerant Event Boundary Detection Algorithm for Wireless Sensor Networks.",
                    "The Design of Multisource Application Layer Multicast with Fast Route Recovery.",
                    "IRDT-GEDIR: Next-Hop Selection in Intermittent Wireless Multihop Sensor Networks.",
                    "DCSim: Design Analysis on Virtualization Data Center.",
                    "GreenTech: A Case Study for Using the Web of Things in Household Energy Conservation.",
                    "IdleCached: An Idle Resource Cached Dynamic Scheduling Algorithm in Cloud Computing.",
                    "Multi-periodic Data Aggregation Scheme Based on Interest for Energy Efficiency in Wireless Sensor Network.",
                    "Implementation of Smart Power Management and Service System on Cloud Computing.",
                    "WaterLady: A Case Study for Connecting Physical Devices into Social Networks.",
                    "PPCare: A Personal and Pervasive Health Care System for the Elderly.",
                    "Towards Scalable Processing for a Large-Scale Ride Sharing Service.",
                    "Context-Aware Mobile Web Browsing Based on HTML5.",
                    "Fall Detection on Mobile Phones Using Features from a Five-Phase Model.",
                    "UI Portals: Sharing Arbitrary Regions of User Interfaces on Traditional and Multi-user Interactive Devices.",
                    "A Universal Lightweight Authentication Scheme Based on Delegation Mechanism in Heterogeneous Networks.",
                    "A Patient Privacy-Aware E-health System Based on Passive RFID.",
                    "Efficiently Preserving Data Privacy Range Queries in Two-Tiered Wireless Sensor Networks.",
                    "Trusted Service Application Framework on Mobile Network.",
                    "Developing QR Code Based Augmented Reality Using SIFT Features.",
                    "A Web-Based Interaction Design Tool: Pattern Language Toolkit.",
                    "An Augmented Reality Environment for Learning OpenGL Programming.",
                    "Imperceptible Visible Watermarking Scheme Using Color Distribution Modulation.",
                    "A Self-Authentication Mechanism for a (3, 3)-threshold Secret Sharing Scheme.",
                    "Enhancement of Human-Preference Assisted Activity Recognition Using a Cooperative ADL Infrastructure."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "UIC 2011",
        "info": "Banff, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/uic/2011",
                "sub_name": "Ubiquitous Intelligence and Computing - 8th International Conference, UIC 2011, Banff, Canada, September 2-4, 2011. Proceedings.",
                "count": 46,
                "papers": [
                    "Internet of Things and Cloud Computing for Future Internet.",
                    "Networking of Vehicles - Applications, Challenges and Some Recent Results.",
                    "Ubiquitous Meeting Facilitator with Playful Real-Time User Interface.",
                    "An Application of the Wireless Sensor Network Technology for Foehn Monitoring in Real Time.",
                    "Proactive Ambient Social Media for Supporting Human Decision Making.",
                    "Social Interaction Mining in Small Group Discussion Using a Smart Meeting System.",
                    "Probabilistic Path Selection in Mobile Wireless Sensor Networks for Stochastic Events Detection.",
                    "Distributed Road Surface Condition Monitoring Using Mobile Phones.",
                    "Verifiable and Lossless Distributed Media Content Sharing.",
                    "NuNote: An Augmented Reality Social Note Posting Service.",
                    "A Context-Aware Seamless Handover Mechanism for Mass Rapid Transit System.",
                    "Individual Activity Data Mining and Appropriate Advice Giving towards Greener Lifestyles and Routines.",
                    "Adaptive Context Oriented Component-Based Application Middleware (COCA-Middleware).",
                    "Intelligent Toilet System for Health Screening.",
                    "An Efficient Earthquake Early Warning Message Delivery Algorithm Using an in Time Control-Theoretic Approach.",
                    "Dynamic Resource Management for a Cell-Based Distributed Mobile Computing Environment.",
                    "Automatic Birdsong Recognition with MFCC Based Syllable Feature Extraction.",
                    "Punishment or Reward: It Is a Problem in Anonymous, Dynamic and Autonomous Networking Environments.",
                    "event.Hub: An Event-Driven Information Hub for Mobile Devices.",
                    "A Non-functional Property Based Service Selection and Service Verification Model.",
                    "Exploring an Adaptive Architecture for Service Discovery over MANETs.",
                    "Web Quality Assessment Model: Trust in QA Social Networks.",
                    "Context-Aware Service Composition.",
                    "Implementation of a Green Power Management Algorithm for Virtual Machines on Cloud Computing.",
                    "AdPriRec: A Context-Aware Recommender System for User Privacy in MANET Services.",
                    "Ensuring Security and Availability through Model-Based Cross-Layer Adaptation.",
                    "Chameleon: A Model of Identification, Authorization and Accountability for Ubicomp.",
                    "The Safety Related Legal Issues and Privacy Protection for Intelligent Vehicle Telematics in the United States.",
                    "PreCon - Expressive Context Prediction Using Stochastic Model Checking.",
                    "A Virtual Channel Technique for Supporting P2P Streaming.",
                    "System-Level Power-Accuracy Trade-Off in Bluetooth Low Energy Networks.",
                    "Hidden Node and Interference Aware Channel Assignment for Multi-radio Multi-channel Wireless Mesh Networks.",
                    "uFlow: Dynamic Software Updating in Wireless Sensor Networks.",
                    "Energy-Balancing and Lifetime Enhancement of Wireless Sensor Network with Archimedes Spiral.",
                    "Bullet-Proof Verification (BPV) Method to Detect Black Hole Attack in Mobile Ad Hoc Networks.",
                    "The Coverage Problem in Directional Sensor Networks with Rotatable Sensors.",
                    "A Bayesian Approach to Blind Separation of Mixed Discrete Sources by Gibbs Sampling.",
                    "Image Data Hiding Schemes Based on Graph Coloring.",
                    "A Variable Weight Based Fuzzy Data Fusion Algorithm for WSN.",
                    "Threshold Selection for Ultra-Wideband TOA Estimation Based on Skewness Analysis.",
                    "Modeling Human Activity Semantics for Improved Recognition Performance.",
                    "A Two-Layer Steganography Scheme Using Sudoku for Digital Images.",
                    "Algorithms and Hardware Architectures for Variable Block Size Motion Estimation.",
                    "Reliability Comparison of Schedulability Test in Ubiquitous Computing.",
                    "A Practice Probability Frequent Pattern Mining Method over Transactional Uncertain Data Streams.",
                    "Reducing Total Energy for Reliability-Aware DVS Algorithms."
                ]
            }
        ]
    },
    {
        "year": "2010",
        "name": "UIC 2010",
        "info": "Xi'an, China",
        "venues": [
            {
                "sub_name_abbr": "conf/uic/2010",
                "sub_name": "Ubiquitous Intelligence and Computing - 7th International Conference, UIC 2010, Xi'an, China, October 26-29, 2010. Proceedings.",
                "count": 51,
                "papers": [
                    "Programming Pervasive Spaces.",
                    "Ubiquitous Experience Media.",
                    "The Operating System for the Computer of the 21st Century.",
                    "Extracting Social and Community Intelligence from Digital Footprints: An Emerging Research Area.",
                    "Smart Itinerary Recommendation Based on User-Generated GPS Trajectories.",
                    "Inferring User Search Intention Based on Situation Analysis of the Physical World.",
                    "GPS Calibrated Ad-Hoc Localization for Geosocial Networking.",
                    "Ontology-Enabled Activity Learning and Model Evolution in Smart Homes.",
                    "Support Vector Machines for Inhabitant Identification in Smart Houses.",
                    "Towards Non-intrusive Sleep Pattern Recognition in Elder Assistive Environment.",
                    "The Making of a Dataset for Smart Spaces.",
                    "Introduction to the Business Processes with Ambient Media - Challenges for Ubiquitous and Pervasive Systems.",
                    "A Steerable Tangible Interface and Its Evaluation.",
                    "Alerting Accidents with Ambiguity: A Tangible Tabletop Application for Safe and Independent Chemistry Experiments.",
                    "Dependency Relation Based Detection of Lexicalized User Goals.",
                    "Identification of Gait Patterns Related to Health Problems of Elderly.",
                    "An Energy Efficient Localization Strategy for Outdoor Objects Based on Intelligent Light-Intensity Sampling.",
                    "RESS: A Data Dissemination Protocol Using Residual Energy and Signal Strength for Wireless Sensor Networks.",
                    "Design and Implementation of Mobile Sink Node in SDMA Applications.",
                    "RCO: A Multi-channel MAC Protocol with Random Cooperation for Sensor Networks.",
                    "Power and Bandwidth Efficiency of IEEE 802.15.4 Wireless Sensor Networks.",
                    "Protecting Source Location Privacy in Wireless Sensor Networks with Data Aggregation.",
                    "A Middleware for Intelligent Environments and the Internet of Things.",
                    "An Infrastructure for Real Objects Augmentation with Additional Personalized Information Services.",
                    "A Low-Cost Ubiquitous Family Healthcare Framework.",
                    "A Lattice-Theoretic Approach to Runtime Property Detection for Pervasive Context.",
                    "Modeling Files with Context Streams.",
                    "CASPER: Mining Personalized Services.",
                    "A Simple Public-Goods Game Based Incentive Mechanism for Resource Provision in P2P Networks.",
                    "A Novel Framework for Service Description and Operations.",
                    "A Self-Adaptive Hardware/Software System Architecture for Ubiquitous Computing Applications.",
                    "Toward Distributed Declarative Control of Networked Cyber-Physical Systems.",
                    "AdContRep: A Privacy Enhanced Reputation System for MANET Content Services.",
                    "Context-Awareness Handoff Planning in Heterogeneous Wireless Networks.",
                    "On the Improving Strategies upon the Route Cache of DSR in MANETs.",
                    "LALO: A Link-Aware Lightweight Routing Protocol for Data Delivery in Vehicular Ad Hoc Networks.",
                    "POCOSIM: A Power Control and Scheduling Scheme in Multi-Rate Wireless Mesh Networks.",
                    "Modeling Contacts and Mobility for Wireless Mobile Networks.",
                    "A Method to Improve Adaptability of the Minstrel MAC Rate Control Algorithm.",
                    "A New Location-Aware Hierarchical Routing Protocol for MANETs.",
                    "Towards an Efficient and Accurate EEG Data Analysis in EEG-Based Individual Identification.",
                    "Activity Recognition on an Accelerometer Embedded Mobile Phone with Varying Positions and Orientations.",
                    "A Hybrid Content Delivery Approach for a Mixed Reality Web Service Platform.",
                    "Analyzing the Behavioral Structure Characteristics from Web Traffic.",
                    "A Smartphone-Based Obstacle Sensor for the Visually Impaired.",
                    "SSP: Smart Service Provider A Smart Environment Providing Contextual Services on Android Mobile Devices.",
                    "Using Cohesive Subgroups for Analyzing the Evolution of the Friend View Mobile Social Network.",
                    "Towards Topic-Based Trust in Social Networks.",
                    "Mlogger: An Automatic Blogging System by Mobile Sensing User Behaviors.",
                    "Managing Workplace Resources in Office Environments through Ephemeral Social Networks.",
                    "Contextual Biometric-Based Authentication for Ubiquitous Services."
                ]
            },
            {
                "sub_name_abbr": "conf/uic/2010w",
                "sub_name": "Symposia and Workshops on Ubiquitous, Autonomic and Trusted Computing: 7th International Conference on Ubiquitous Intelligence & Computing and 7th International Conference on Autonomic & Trusted Computing, UIC-ATC 2010, 26-29 October 2010, Xi'an, China.",
                "count": 95,
                "papers": [
                    "Pervasive Social Computing: Augmenting Five Facets of Human Intelligence.",
                    "Toward a Smart Home Environment for Elder People Based on Situation Analysis.",
                    "Providing Real-Time Guarantees to Smart Car.",
                    "MSOrgm©: Emergent Techniques for Kinetic Artifact.",
                    "A Comparison of Programming Skills by Genders of Hungarian Grammar School Students.",
                    "An Improved Multi-Scale Retinex Algorithm for Vehicle Shadow Elimination Based on Variational Kimmel.",
                    "Reliability Analysis of a Multiview Multi-description Video Streaming System.",
                    "QoS Control Framework for Ubiquitous Multimedia Computing.",
                    "A Walkthrough System with Improved Map Projection Panoramas from Omni Directional Images.",
                    "Toward a Programming Model for Safer Pervasive Spaces.",
                    "Multilevel Image Thresholding Selection Based on the Firefly Algorithm.",
                    "A Study of Video Coding by Reusing Compressive Sensing Measurements.",
                    "Water Quality Monitoring with Ubiquitous Computing.",
                    "A Mobile Agent-Based Software Intelligence Framework in Ubiquitous Environment.",
                    "Sweep Coverage Mechanism for Wireless Sensor Networks with Approximate Patrol Times.",
                    "Personal Smart Spaces as a Basis for Identifying Users in Pervasive Systems.",
                    "Performance on Adaptive Path Selection Scheme for Cooperative Communication Networks.",
                    "Ubiquitous Community Care Using Sensor Network and Mobile Agent Technology.",
                    "A Macro-observation Approach of Intelligence Video Surveillance for Real-Time Unusual Event Detection.",
                    "Research on Pervasive Computing Security.",
                    "An Advanced ECC ID-Based Remote Mutual Authentication Scheme for Mobile Devices.",
                    "Visual Scoping of Private Information Displayed on Shared Tabletop Surfaces.",
                    "Improved Identity Based Online/Offline Signature Scheme.",
                    "A Method of Privacy Preserving in Mobile Wireless Environments.",
                    "A New Image Registration Method Using Intensity Difference Data on Overlapped Image.",
                    "Adaptive Wireless Mesh Networks Routing Protocols.",
                    "Media Access Control Protocol Based on Hybrid Antennas in Ad Hoc Networks.",
                    "A Dynamic Risk Assessment Framework Using Principle Component Analysis with Projection Pursuit in Ad Hoc Networks.",
                    "Dynamic Adaptive Self-Configurable Network Processor.",
                    "An Adaptive Cross-Layer Mechanism of Multi-channel Multi-interface Wireless Networks for Real-Time Video Streaming.",
                    "An Trace Based Vehicular Mobility Model for Simulation of Vehicular Delay Tolerant Networks.",
                    "A Link Quality Prediction Mechanism for WSNs Based on Time Series Model.",
                    "Message Publish/Subscribe Scheme Based on Opportunistic Networks.",
                    "RANC: Opportunistic Multi-path Routing Protocol in WSNs Using Reality-Aware Network Coding.",
                    "Epidemic-Based Controlled Flooding and Adaptive Multicast for Delay Tolerant Networks.",
                    "BiBUBBLE: Social-based Forwarding in Pocket Switched Networks.",
                    "Energy-Efficient Clustering Rumor Routing Protocol for Wireless Sensor Networks.",
                    "Asymptotic Stability Criterion for the Networked Control Systems Based on Time-Delay System.",
                    "Hierarchical Probabilistic Network-Based System for Traffic Accident Detection at Intersections.",
                    "Seamless Mobility Support for Adaptive Applications in Heterogeneous Wireless Networks.",
                    "Heterogeneous Multi-layer Wireless Networking for Mobile CPS.",
                    "R-CA: A Routing-Based Dynamic Channel Assignment Algorithm in Wireless Mesh Networks.",
                    "An ECG-Based Signal Key Establishment Protocol in Body Area Networks.",
                    "Design and Implementation of a Wireless Sensor Network for Smart Homes.",
                    "A Mobile Context Sharing System Using Activity and Emotion Recognition with Bayesian Networks.",
                    "Net-in-Net: Interaction Modeling for Smart Community Cyber-Physical System.",
                    "DISG: Decentralized Inter-user Interference Suppression in Body Sensor Networks with Non-cooperative Game.",
                    "TouchInteract: An Interaction Technique with Large Displays Using Touchscreen-Phone.",
                    "Haptic u-Table: A Believable Feedback System with a Quasi-tangible Tabletop Interface.",
                    "Testing of Component-Based Software: A Metamorphic Testing Methodology.",
                    "Experiments on Test Case Reuse of Test Coverage Criteria.",
                    "A Measurement of Software Trustworthiness Based on Approximation Algorithms.",
                    "An Integrated PLC Smart Home System in Pervasive Computing.",
                    "Trustworthiness Expectation of Real-Time Web Services.",
                    "Security Model Oriented Attestation on Dynamically Reconfigurable Component-Based Systems.",
                    "Formal Definitions for Trust in Trusted Computing.",
                    "Assurance Networks: Concepts, Technologies, and Case Studies.",
                    "Sensitivity Analysis of Random Port Hopping.",
                    "Autonomous Community Construction Technology for Timely Transmitting Emergency Information.",
                    "File Diffusion Control on Super-Seed Mode Over BitTorrent-Like P2P Networks.",
                    "An Extended Micro Loop Routing for Adapting to Energy Consumption.",
                    "Improvement of the Security Against Node Capture Attacks Using Dispersed Data Transmission for Wireless Sensor Networks.",
                    "Architecture-Oriented Assurance Technology in Microgrid.",
                    "Application of Deterministic Annealing EM Algorithm to Markovian Arrival Process Parameter Estimation.",
                    "Dual-EigenRep: A Reputation-Based Trust Model for P2P File-Sharing Networks.",
                    "On Alternation and Information Sharing among Cooperating Autonomous Management Agents.",
                    "Autonomic Fault Identification for Ubiquitous Self Healing Systems.",
                    "An SVM Based Automatic Segmentation Method for Brain Magnetic Resonance Image Series.",
                    "Verification of a Sub-ontology Update Mechanism for the Semantic Grid.",
                    "A Framework of Organic Streams: Integrating Dynamically Diversified Contents into Ubiquitous Personal Study.",
                    "Making Architectural Decisions Based on Requirements: Analysis and Combination of Risk-Based and Quality Attribute-Based Methods.",
                    "Monitoring Spatially Referenced Entities in Wireless Sensor Networks.",
                    "An Idle-Time Eliminating Channel Transmission Scheme in EPON System.",
                    "Cloud Computing Landscape and Research Challenges Regarding Trust and Reputation.",
                    "A Flexible Multi-Source Web Service's QoS Acquisition Framework and Implementation.",
                    "Towards Trustworthy Composite Service Through Business Process Model Verification.",
                    "Formal Analysis of Behavioural Equivalence for Trustworthy and Composite Web Services.",
                    "DS Theory-Based Software Trustworthiness Classification Assessment.",
                    "Static Detection Unsafe Use of variables In Java.",
                    "Mining Frequent Development Patterns of roles in Open Source Software.",
                    "Checking Compliance to Coding Standards for x86 Executables.",
                    "User-Centered Trust Model Visibility of Trust Technologies.",
                    "MiniMASC: A Framework for Diverse Autonomic Adaptations of Web Service Compositions.",
                    "PCR-a Position-and-Connectivity-Based Routing Protocol for VANETs.",
                    "MiniMASC+MiniZinc: An Autonomic Business-Driven Decision Making Middleware for Adaptation of Web Service Compositions.",
                    "Exploration on Integrated Development Environment of Trusted Data Processing Oriented Software Product Line for WEB Application.",
                    "An Indoor Location-Based Social Network for Managing Office Resource and Connecting People.",
                    "Drive Smartly as a Taxi Driver.",
                    "HouseGenie: Universal Monitor and Controller of Networked Devices on Touchscreen Phone in Smart Home.",
                    "A-CUBE: A Tangible Tabletop Application to Support Safe and Independent Chemistry Experiments.",
                    "Fall Detecting and Alarming Based on Mobile Phone.",
                    "Taxi-Viewer: Around the Corner Taxis Are!",
                    "Directional Wi-Fi Based Indoor Location System for Emergency.",
                    "Speech and Auditory Interfaces for Ubiquitous, Immersive and Personalized Applications.",
                    "GeeAir: Waving in the Air to Control Home Appliances."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "UIC 2009",
        "info": "Brisbane, Australia",
        "venues": [
            {
                "sub_name_abbr": "conf/uic/2009",
                "sub_name": "Ubiquitous Intelligence and Computing, 6th International Conference, UIC 2009, Brisbane, Australia, July 7-9, 2009. Proceedings.",
                "count": 29,
                "papers": [
                    "Distributed Computing in Opportunistic Environments.",
                    "Web of Things as a Framework for Ubiquitous Intelligence and Computing.",
                    "Inferring Human Interactions in Meetings: A Multimodal Approach.",
                    "Gesture Recognition with a 3-D Accelerometer.",
                    "Context-Aware Activity Recognition through a Combination of Ontological and Statistical Reasoning.",
                    "Context-Aware Path Planning in Ubiquitous Network.",
                    "An Efficient Approach to Situation-Aware Service Discovery in Pervasive Service Computing Environments.",
                    "Printing in Ubiquitous Computing Environments.",
                    "The Å Publish/Subscribe Framework.",
                    "Mining and Visualizing Mobile Social Network Based on Bayesian Probabilistic Model.",
                    "SMSR: A Scalable Multipath Source Routing Protocol for Wireless Sensor Networks.",
                    "A Framework to Calibrate a MEMS Sensor Network.",
                    "Application Domain Driven Data Visualisation Framework for Wireless Sensor Networks.",
                    "Hybrid Bluetooth Scatternet Routing.",
                    "Self-estimation of Neighborhood Density for Mobile Wireless Nodes.",
                    "MeshVision: An Adaptive Wireless Mesh Network Video Surveillance System.",
                    "SDEC: A P2P Semantic Distance Embedding Based on Virtual Coordinate System.",
                    "Dynamic Integration of Zigbee Devices into Residential Gateways for Ubiquitous Home Services.",
                    "Fine-Grained Evaluation of Local Positioning Systems for Specific Target Applications.",
                    "Indoor Positioning System Using Beacon Devices for Practical Pedestrian Navigation on Mobile Phone.",
                    "NavTag: An Inter-Working Framework Based on Tags for Symbolic Location Coordinates for Smart Spaces.",
                    "Mobile Web 2.0-Oriented Five Senses Multimedia Technology with LBS-Based Intelligent Agent.",
                    "Conflicting-Set-Based Wormhole Attack Resistant Localization in Wireless Sensor Networks.",
                    "Novel and Efficient Identity-Based Authenticated Key Agreement Protocols from Weil Pairings.",
                    "Implicit User Re-authentication for Mobile Devices.",
                    "Lattice Based Privacy Negotiation Rule Generation for Context-Aware Service.",
                    "Using RFID to Overcome Inventory Control Challenges: A Proof of Concept.",
                    "Anticipative Wrap-Around Inquiry Method towards Efficient RFID Tag Identification.",
                    "A Probabilistic Semantic Based Mixture Collaborative Filtering."
                ]
            }
        ]
    },
    {
        "year": "2008",
        "name": "UIC 2008",
        "info": "Oslo, Norway",
        "venues": [
            {
                "sub_name_abbr": "conf/uic/2008",
                "sub_name": "Ubiquitous Intelligence and Computing, 5th International Conference, UIC 2008, Oslo, Norway, June 23-25, 2008, Proceedings.",
                "count": 59,
                "papers": [
                    "Challenges in the Design and Development of Context-Aware Applications.",
                    "The Importance of Including the Haptics Factor in Interaction Design.",
                    "Security Policy Integration and Conflict Reconciliation for Collaborations among Organizations in Ubiquitous Computing Environments.",
                    "Improved Weighted Centroid Localization in Smart Ubiquitous Environments.",
                    "A Formal Framework for Expressing Trust Negotiation in the Ubiquitous Computing Environment.",
                    "Pervasive Services on the Move: Smart Service Diffusion on the OSGi Framework.",
                    "Robots in Smart Spaces - A Case Study of a u-Object Finder Prototype -.",
                    "Biometrics Driven Smart Environments: Abstract Framework and Evaluation.",
                    "A Structured Methodology of Scenario Generation and System Analysis for Ubiquitous Smart Space Development.",
                    "Capturing Semantics for Information Security and Privacy Assurance.",
                    "A Framework for Context-Aware Home-Health Monitoring.",
                    "Semantic Learning Space: An Infrastructure for Context-Aware Ubiquitous Learning.",
                    "A Comprehensive Approach for Situation-Awareness Based on Sensing and Reasoning about Context.",
                    "Context-Adaptive User Interface in Ubiquitous Home Generated by Bayesian and Action Selection Networks.",
                    "Use Semantic Decision Tables to Improve Meaning Evolution Support Systems.",
                    "Combining User Profiles and Situation Contexts for Spontaneous Service Provision in Smart Assistive Environments.",
                    "Ubiquitous Phone System.",
                    "Utilizing RFIDs for Location Aware Computing.",
                    "A Component-Based Ambient Agent Model for Assessment of Driving Behaviour.",
                    "A Cartesian Robot for RFID Signal Distribution Model Verification.",
                    "Self-Localization in a Low Cost Bluetooth Environment.",
                    "Penetration Testing of OPC as Part of Process Control Systems.",
                    "Intersection Location Service for Vehicular Ad Hoc Networks with Cars in Manhattan Style Movement Patterns.",
                    "Ubiquitous and Robust Text-Independent Speaker Recognition for Home Automation Digital Life.",
                    "Energy Efficient In-Network Phase RFID Data Filtering Scheme.",
                    "Energy-Efficient Tracking of Continuous Objects in Wireless Sensor Networks.",
                    "Data Randomization for Lightweight Secure Data Aggregation in Sensor Network.",
                    "Mobile Sink Routing Protocol with Registering in Cluster-Based Wireless Sensor Networks.",
                    "Towards the Implementation of Reliable Data Transmission for 802.15.4-Based Wireless Sensor Networks.",
                    "An Energy-Efficient Query Processing Algorithm for Wireless Sensor Networks.",
                    "Rule Selection for Collaborative Ubiquitous Smart Device Development: Rough Set Based Approach.",
                    "An Object-Oriented Framework for Common Abstraction and the Comet-Based Interaction of Physical u-Objects and Digital Services.",
                    "Personalizing Threshold Values on Behavior Detection with Collaborative Filtering.",
                    "IP Traceback Using Digital Watermark and Honeypot.",
                    "Multi-priority Multi-path Selection for Video Streaming in Wireless Multimedia Sensor Networks.",
                    "Energy Constrained Multipath Routing in Wireless Sensor Networks.",
                    "Controlling Uncertainty in Personal Positioning at Minimal Measurement Cost.",
                    "RFID System Security Using Identity-Based Cryptography.",
                    "RFID: An Ideal Technology for Ubiquitous Computing?.",
                    "An Experimental Analysis of Undo in Ubiquitous Computing Environments.",
                    "Towards a Collaborative Reputation Based Service Provider Selection in Ubiquitous Computing Environments.",
                    "Petri Net-Based Episode Detection and Story Generation from Ubiquitous Life Log.",
                    "Protection Techniques of Secret Information in Non-tamper Proof Devices of Smart Home Network.",
                    "Universal Remote Control for the Smart World.",
                    "Mobile Navigation System for the Elderly - Preliminary Experiment and Evaluation.",
                    "Time Stamp Protocol for Smart Environment Services.",
                    "An Analysis of the Manufacturing Messaging Specification Protocol.",
                    "A Long-Distance Time Domain Sound Localization.",
                    "Towards Dataintegration from WITSML to ISO 15926.",
                    "A SIP-Based Session Mobility Management Framework for Ubiquitous Multimedia Services.",
                    "AwarePen - Classification Probability and Fuzziness in a Context Aware Application.",
                    "A Model Driven Development Method for Developing Context-Aware Pervasive Systems.",
                    "Intelligent System Architecture for Context-Awareness in Ubiquitous Computing.",
                    "User-Based Constraint Strategy in Ontology Matching.",
                    "RFID-Based Interactive Learning in Science Museums.",
                    "Real-Time Detection of Passing Objects Using Virtual Gate and Motion Vector Analysis.",
                    "A Ubiquitous Interactive Museum Guide.",
                    "Dynamic Probabilistic Packet Marking with Partial Non-Preemption.",
                    "Fractal Model Based Face Recognition for Ubiquitous Environments."
                ]
            }
        ]
    },
    {
        "year": "2007",
        "name": "UIC 2007",
        "info": "Hong Kong, China",
        "venues": [
            {
                "sub_name_abbr": "conf/uic/2007",
                "sub_name": "Ubiquitous Intelligence and Computing, 4th International Conference, UIC 2007, Hong Kong, China, July 11-13, 2007, Proceedings.",
                "count": 121,
                "papers": [
                    "Autonomic and Trusted Computing for Ubiquitous Intelligence.",
                    "Sensitivity Improvement of the Receiver Module in the Passive Tag Based RFID Reader.",
                    "Q+-Algorithm : An Enhanced RFID Tag Collision Arbitration Algorithm.",
                    "Surface-Embedded Passive RF Exteroception: Kepler, Greed, and Buffon's Needle.",
                    "Development of a Single 3-Axis Accelerometer Sensor Based Wearable Gesture Recognition Band.",
                    "An Enhanced Ubiquitous Identification System Using Fast Anti-collision Algorithm.",
                    "Certification Tools of Ubiquitous Mobile Platform.",
                    "Dynamic Binding Framework for Open Device Services.",
                    "Design and Evaluation of Multitasking-Based Software Communications Architecture for Real-Time Sensor Networking Platforms.",
                    "Automatic Partitioning Technique for Flash Memory on Linux-Based Embedded Systems.",
                    "Distributed Processing in Wireless Sensor Networks for Structural Health Monitoring.",
                    "An Improved Fusion and Fission Architecture Between Multi-modalities Based on Wearable Computing.",
                    "A Smart Space Architecture for Location-Based Spatial Audio Scenario Orchestration.",
                    "CHASE: Context-Aware Heterogenous Adaptive Smart Environments Using Optimal Tracking for Resident's Comfort.",
                    "A Methodology of Identifying Ubiquitous Smart Services for U-City Development.",
                    "Simulated Intersection Environment and Learning of Collision and Traffic Data in the U&I Aware Framework.",
                    "Dynamic Scheduling Protocol for Highly-Reliable, Real-Time Information Aggregation for Telematics Intersection Safety System(TISS).",
                    "Spontaneous Interaction Framework for Thin-Client Access to Services.",
                    "Towards a Model of Interaction for Mutual Aware Devices and Everyday Artifacts.",
                    "A Peer-to-Peer Semantic-Based Service Discovery Method for Pervasive Computing Environment.",
                    "Ubiquitous Healthcare Architecture Using SmartBidet and HomeServer with Embedded Urinalysis Agent.",
                    "Proactive Agriculture: An Integrated Framework for Developing Distributed Hybrid Systems.",
                    "Integrating RFID Services and Ubiquitous Smart Systems for Enabling Organizations to Automatically Monitor, Decide, and Take Actions.",
                    "Towards an RFID-Oriented Service Discovery System.",
                    "Activity Recognition Using an Egocentric Perspective of Everyday Objects.",
                    "A Novel Price Prediction Scheme of Grid Resources Based on Time Series Analysis.",
                    "Adaptive Multicast Trees on Static Ad Hoc Networks: Tradeoffs Between Delay and Energy Consumption.",
                    "Reliable Multicast MAC Protocol for Wireless Ad Hoc Networks.",
                    "Mobility Tracking for Mobile Ad Hoc Networks.",
                    "Handover Cost Optimization in Traffic Management for Multi-homed Mobile Networks.",
                    "2-Level Hierarchical Cluster-Based Address Auto-configuration Technique in Mobile Ad-Hoc Networks.",
                    "Replication in Intermittently Connected Mobile Ad Hoc Networks.",
                    "Rate-Adaption Channel Assignment and Routing Algorithm for Multi-channel WirelessMAN Mesh Networks.",
                    "Neighbor-Aware Optimizing Routing for Wireless Ad Hoc Networks.",
                    "Gateway Zone Multi-path Routing in Wireless Mesh Networks.",
                    "On Estimating Path Capacity in Wireless Mesh Networks.",
                    "A Meta Service Description Assisted Service Discovery Protocol for MANETs.",
                    "On Characterizing Economic-Based Incentive-Compatible Mechanisms to Solving Hidden Information and Hidden Action in Ad Hoc Network.",
                    "A Study on USN Technologies for Ships.",
                    "A New Modeling and Delay Analysis of IEEE 802.11 Distributed Coordination Function.",
                    "Proactive Data Delivery Scheme with Optimal Path for Dynamic Sensor Networks.",
                    "Low-Latency Routing for Energy-Harvesting Sensor Networks.",
                    "A Localized Link Quality-Aware Optimization Mechanism for Routing Protocols in Wireless Sensor Networks.",
                    "Minimum Energy and Latency MAC Protocol for Wireless Sensor Networks.",
                    "An Efficient Bi-Directional Flooding in Wireless Sensor Networks.",
                    "Maximizing Network Lifetime Under Reliability Constraints Using a Cross-Layer Design in Dense Wireless Sensor Networks.",
                    "Adaptive Data Aggregation for Clustered Wireless Sensor Networks.",
                    "Directed Diffusion Based on Link-Stabilizing Clustering for Wireless Sensor Networks.",
                    "Voronoi Tessellation Based Rapid Coverage Decision Algorithm for Wireless Sensor Networks.",
                    "A Clustering-Based Approximation Scheme for In-Network Aggregation over Sensor Networks.",
                    "Real-Time Data Delivery in Wireless Sensor Networks: A Data-Aggregated, Cluster-Based Adaptive Approach.",
                    "A Location-Unaware Connected Coverage Protocol in Wireless Sensor Networks.",
                    "Fuzzy-Based Reliable Data Delivery for Countering Selective Forwarding in Sensor Networks.",
                    "An Efficient Grid-Based Data Gathering Scheme in Wireless Sensor Networks.",
                    "Grid-Based Sense Schedule for Event Detection in Wireless Sensor Networks.",
                    "An Integrated and Flexible Scheduler for Sensor Grids.",
                    "A Lightweight Scheme for Node Scheduling in Wireless Sensor Networks.",
                    "A Multi-tier, Multimodal Wireless Sensor Network for Environmental Monitoring.",
                    "Wireless Sensor Networks, Making a Difference Tomorrow.",
                    "Enabling Distributed Messaging with Wireless Sensor Nodes Using TinySIP.",
                    "Localization and Synchronization for 3D Underwater Acoustic Sensor Networks.",
                    "An Energy-Efficient Framework for Wireless Sensor Networks with Multiple Gateways.",
                    "Self-configurable Structure for Tracking Moving Objects in Wireless Sensor Networks.",
                    "Secure Dynamic Network Reprogramming Using Supplementary Hash in Wireless Sensor Networks.",
                    "Self-deployment of Mobile Nodes in Hybrid Sensor Networks by AHP.",
                    "Data Synchronization in Distributed and Constrained Mobile Sensor Networks.",
                    "Reference Interpolation Protocol for Time Synchronization in Wireless Sensor Networks.",
                    "Mesh-Based Sensor Relocation for Coverage Maintenance in Mobile Sensor Networks.",
                    "Neighbor Position-Based Localization Algorithm for Wireless Sensor.",
                    "Location Estimation with Mobile Nodes in Wireless Sensor Networks.",
                    "A Novel Architecture for Hierarchically Nested Network Mobility.",
                    "Route Optimization Using Scalable Cache Management for Intra-NEMO Communication.",
                    "Content Aware Selecting Method for Reducing the Response Time of an Adaptive Mobile Web Service.",
                    "A Study of Speech Emotion Recognition and Its Application to Mobile Services.",
                    "Mobility Driven Vertical Handover for Mobile IPTV Traffic in Hybrid IEEE 802.11e/16e Networks.",
                    "An Efficient Scheme for Lifetime Setting in the MIPv6.",
                    "Bridging OSGi Islands Through SLP Protocol.",
                    "Selective Grid Access for Energy-Aware Mobile Computing.",
                    "Cognitive Computing Resource Management for a Ubiquitous Wireless Access.",
                    "Research of UWB Signal Propagation Attenuation Model in Coal Mine.",
                    "Context Script Language and Processor for Context-Awareness in Ubiquitous Intelligent Environment.",
                    "A Semantics-Based Framework for Context-Aware Services: Lessons Learned and Challenges.",
                    "Devising a Context Selection-Based Reasoning Engine for Context-Aware Ubiquitous Computing Middleware.",
                    "The u-Class Based on Context-Awareness.",
                    "Audio-Visual Fused Online Context Analysis Toward Smart Meeting Room.",
                    "An Offset Algorithm for Conflict Resolution in Context-Aware Computing.",
                    "UCIPE: Ubiquitous Context-Based Image Processing Engine for Medical Image Grid.",
                    "Ontology-Based Semantic Recommendation for Context-Aware E-Learning.",
                    "Deployment of Context-Aware Component-Based Applications Based on Middleware.",
                    "Identifying a Generic Model of Context for Context-Aware Multi-services.",
                    "Context Privacy and Obfuscation Supported by Dynamic Context Source Discovery and Processing in a Context Management System.",
                    "Context-Aware Service Composition for Mobile Network Environments.",
                    "A Context-Awareness Middleware Based on Service-Oriented Architecture.",
                    "On the Design, Deployment and Use of Ubiquitous Systems.",
                    "Performance Evaluation of 3-Hierarchical Resource Management Model with Grid Service Architecture.",
                    "A Study on Ubiquitous Intelligent Healthcare Systems in Home Service Aggregation Business Model.",
                    "Implementation and Quantitative Evaluation of UbiMDR Framework.",
                    "A Key-Index Based Distributed Mechanism for Component Registration.",
                    "BASCA: A Business Area-Oriented Service Component Adaptation Approach Suitable for Ubiquitous Environment.",
                    "A Pervasive Service Framework for Pervasive Computing Applications.",
                    "Symbiotic Computing: Concept, Architecture and Its Applications.",
                    "Multi-agent Software Control System with Hybrid Intelligence for Ubiquitous Intelligent Environments.",
                    "IUMELA: A Lightweight Multi-Agent Systems Based Mobile Learning Assistant Using the ABITS Messaging Service.",
                    "Towards Intuitive Spatiotemporal Communication Between Human and Ubiquitous Intelligence Based on Mental Image Directed Semantic Theory - A General Theory of Tempo-logical Connectives.",
                    "Graph-Based Semantic Description in Medical Knowledge Representation and 3D Coronary Vessels Recognition.",
                    "Persistent Storage System for Efficient Management of OWL Web Ontology.",
                    "Prediction-Based Dynamic Thread Pool Management of Agent Platform for Ubiquitous Computing.",
                    "A Ubiquitous Watch-Over System Based on Environmental Information and Social Knowledge.",
                    "Ubiquitous Intelligent Information Push-Delivery for Personalized Content Recommendation.",
                    "Location-Based Recommendation System Using Bayesian User's Preference Model in Mobile Devices.",
                    "Fuzzy-Smith Control for QoS-Adaptive Notification Service.",
                    "Petri Nets for the Verification of Ubiquitous Systems with Transient Secure Association.",
                    "An Approach of Trusted Program Generation for User-Responsible Privacy.",
                    "Self-updating: Strong Privacy Protection Protocol for RFID-Tagged Banknotes.",
                    "Intelligent Detection Computer Viruses Based on Multiple Classifiers.",
                    "Designated Verifier Signature: Definition, Framework and New Constructions.",
                    "Towards Secure Agent Computing for Ubiquitous Computing and Ambient Intelligence.",
                    "On the Analysis and Design of a Family Tree of Smart Card Based User Authentication Schemes.",
                    "Secret Key Revocation in Sensor Networks.",
                    "Hybrid Key Establishment Protocol Based on ECC for Wireless Sensor Network.",
                    "A Secure Pairwise Key Establishment Scheme in Wireless Ad Hoc Networks."
                ]
            }
        ]
    },
    {
        "year": "2006",
        "name": "UIC 2006",
        "info": "Wuhan, China",
        "venues": [
            {
                "sub_name_abbr": "conf/uic/2006",
                "sub_name": "Ubiquitous Intelligence and Computing, Third International Conference, UIC 2006, Wuhan, China, September 3-6, 2006, Proceedings.",
                "count": 118,
                "papers": [
                    "Transparent Computing: A New Paradigm for Pervasive Computing.",
                    "Drag and Drop by Laser Pointer: Seamless Interaction with Multiple Large Displays.",
                    "A Flexible Display by Integrating a Wall-Size Display and Steerable Projectors.",
                    "Design and Implementation of a Smart Tag System for IT-Based Port Logistics.",
                    "A Smart Schoolbag System for Reminding Pupils of the Forgotten Items.",
                    "Passive Radio Frequency Exteroception in Robot Assisted Shopping for the Blind.",
                    "A Smart Identification Card System Using Facial Biometric: From Architecture to Application.",
                    "Architectures and Functions of the TMO Kernels for Ubiquitous and Embedded Real-Time Distributed Computing.",
                    "An Embedded System Design for Ubiquitous Speech Interactive Applications Based on a Cost Effective SPCE061A Micro Controller.",
                    "Prototyping Object-Based Ubiquitous Multimedia Contents Storage for Mobile Devices.",
                    "CATA: A Garbage Collection Scheme for Flash Memory File Systems.",
                    "A Robust Location Tracking Using Ubiquitous RFID Wireless Network.",
                    "Hybrid Predictors for Next Location Prediction.",
                    "Psychology-Aware Video-Enabled Workplace.",
                    "Distributed Embedded Intelligence Room with Multi-agent Cooperative Learning.",
                    "Intelligent Pervasive Middleware Based on Biometrics.",
                    "An Arrival Time Anticipation Approach for Real-Time Tracking of Moving Object in Mobile Networks.",
                    "Behavior Analysis with Combined RFID and Video Information.",
                    "Well-Being Store: A New Channel in U-Commerce for Insurance Industry.",
                    "Real-Time License Plate Detection Under Various Conditions.",
                    "RUIS: Development of Regional Ubiquitous Information System and Its Applications: Towards a Universal Ubiquitous Information Society.",
                    "Adaptive Service Delivery for Mobile Users in Ubiquitous Computing Environments.",
                    "An Effective Message Flooding Method for Vehicle Safety Communication.",
                    "RDF: Stores - A Lightweight Approach on Managing Shared Knowledge.",
                    "Vision Based Automatic Surveillance Towards a Smart Application.",
                    "Handling Heterogeneous Device Interaction in Smart Spaces.",
                    "A New Model to Optimize the Cost Efficiency of Broadcast in Mobile Ad Hoc Networks.",
                    "Joint Power Control and Channel Assignment Algorithms for Wireless Ad Hoc Networks.",
                    "Fast IPv6 Addressing Technique for Mobile Ad Hoc Networks.",
                    "A Distributed Fairness Support Scheduling Algorithm in Wireless Ad Hoc Networks.",
                    "QoS Model for Improving End-to-End Service in 802.11e-Based Wireless Ad Hoc Networks.",
                    "Transmission Range Designation Broadcasting Methods for Wireless Ad Hoc Networks.",
                    "Bandwidth-Aware Multipath Routing Protocol for Mobile Ad Hoc Networks.",
                    "Adaptive Power-Aware Clustering and Multicasting Protocol for Mobile Ad Hoc Networks.",
                    "Backtracking Based Handoff Rerouting Algorithm for WiMAX Mesh Mode.",
                    "A Self-tuning Reliable Dynamic Scheme for Multicast Flow Control.",
                    "Intelligent Wireless Home Network Based on Cooperative DS-UWB System.",
                    "A New QoS Multicast Routing Model and Its Immune Optimization Algorithm.",
                    "A Novel Collaborative Tier Scheme for Multihop Inter-Vehicle Communication Networks.",
                    "Performance Computation Model for IEEE 802.11e EDCF Wireless LANs.",
                    "Opportunistic Packet Scheduling over IEEE 802.11 WLAN.",
                    "A Scalable, Efficient and Reliable Routing Protocol for Wireless Sensor Networks.",
                    "ACO Based QoS Routing Algorithm for Wireless Sensor Networks.",
                    "Cluster Number Variability Problem in LEACH.",
                    "A Multipath Routing Algorithm for Wireless Sensor Networks.",
                    "Improved Dynamic Power Management in Wireless Sensor Networks.",
                    "A Fast Traffic Planning Algorithm in Lifetime Optimization of Sensor Networks.",
                    "An Adaptive Coverage Algorithm for Large-Scale Mobile Sensor Networks.",
                    "Adaptive Sink Mobility Management Scheme for Wireless Sensor Networks.",
                    "A Congestion Control Technique for the Near-Sink Nodes in Wireless Sensor Networks.",
                    "Information-Driven Sensor Selection Algorithm for Kalman Filtering in Sensor Networks.",
                    "TwinsNet: A Cooperative MIMO Mobile Sensor Network.",
                    "Scalable and Low-Cost Acoustic Source Localization for Wireless Sensor Networks.",
                    "REDRP: Reactive Energy Decisive Routing Protocol for Wireless Sensor Networks.",
                    "Systolic Query Processing for Aggregation in Sensor Networks.",
                    "Adapted Listening in Wireless Sensor Network MAC Protocol.",
                    "Relay Shift Based Self-deployment for Mobility Limited Sensor Networks.",
                    "Energy-Efficient Data Dissemination in Wireless Sensor Networks.",
                    "Proposal of Visualization of Reasoning Processes in Sensor Network Environment.",
                    "Energy-Efficient, Traffic-Adaptive, Fast Collision Resolution MAC for WSNs.",
                    "Bidirectional Data Aggregation Scheme for Wireless Sensor Networks.",
                    "A Base Station-Coordinated Contention Resolution for IEEE 802.16 PMP Networks.",
                    "A Promise Theory Approach to Collaborative Power Reduction in a Pervasive Computing Environment.",
                    "CityVoyager: An Outdoor Recommendation System Based on User Location History.",
                    "Energy Saving of Mobile Devices Based on Component Migration and Replication in Pervasive Computing.",
                    "Mobile Agent Enabled Application Mobility for Pervasive Computing.",
                    "Towards Summarized Representation of Time Series Data in Pervasive Computing Systems.",
                    "Adaptive Bridging with Portable Interceptor for Efficient Integration of Reflective Middleware.",
                    "A Simulation Study Comparing the Performance of Two RFID Protocols.",
                    "FreeSpeech: A Novel Wireless Approach for Conference Projecting and Cooperating.",
                    "Performance Analysis of Unified Data Broadcast Model for Multi-channel Wireless Databases.",
                    "Real-Time Human Tracker Based Location and Motion Recognition for the Ubiquitous Smart Home.",
                    "Automatic Updating of a Book Storage Database in a Ubiquitous Library Information System.",
                    "Context-Aware Dynamic Personalised Service Re-composition in a Pervasive Service Environment.",
                    "A Context-Aware Multi-agent Service System for Assistive Home Applications.",
                    "Profile Processing and Evolution for Smart Environments.",
                    "A Context-Aware Smart Home Service System Based on uWDL.",
                    "Toward Context-Awareness: A Workflow Embedded Middleware.",
                    "Service Rendering Middleware (SRM) Based on the Intelligent LOD Algorithm.",
                    "Jini-Based Ubiquitous Computing Middleware Supporting Event and Context Management Services.",
                    "Building a Frame-Based Interaction and Learning Model for U-Learning.",
                    "A Novel Steganographic Technique Based on Image Morphing.",
                    "A Group-Oriented (t, n) Threshold Signature Scheme Against Replay Attacks.",
                    "Incorporating Data Mining Tools into a New Hybrid-IDS to Detect Known and Unknown Attacks.",
                    "A Further Approach on Hypercube-Based Pairwise Key Establishment in Sensor Networks.",
                    "Key Predistribution in Sensor Networks.",
                    "A Strong Key Pre-distribution Scheme for Wireless Sensor Networks.",
                    "Cooperative Public Key Authentication Protocol in Wireless Sensor Network.",
                    "Restricted Universal Designated Verifier Signature.",
                    "Research on Pairwise Key Establishment Model and Algorithm for Sensor Networks.",
                    "A DRBAC Model Based on Context for Smart and Secure Services in Intelligent Ubiquitous Home.",
                    "Investigating Authentication Mechanisms for Wireless Mobile Network.",
                    "M2AP: A Minimalist Mutual-Authentication Protocol for Low-Cost RFID Tags.",
                    "Context-Enhanced Authentication for Infrastructureless Network Environments.",
                    "Location Privacy in Mobile Computing Environments.",
                    "Utilizing Secure Three Hop Links to Agree Pairwise Keys in Wireless Sensor Networks.",
                    "ECGSC: Elliptic Curve Based Generalized Signcryption.",
                    "Effective Control of Abnormal Neighbor Discovery Congestion on IPv6 Local Area Network.",
                    "A Secure and Auto-configurable Environment for Mobile Agents in Ubiquitous Computing Scenarios.",
                    "Connectivity Preservation and Key Distribution in Wireless Sensor Networks Using Multi-deployment Scheme.",
                    "A Practical Solution to the (t, n) Threshold Untraceable Signature with (k, l) Verification Scheme.",
                    "On Studying P2P Topology Construction Based on Virtual Regions and Its Effect on Search Performance.",
                    "Scalable Resources Portfolio Selection with Fairness Based on Economical Methods.",
                    "Personalized u-Portal System with Ontology and Web Services.",
                    "Augmented Video Services and Its Applications in an Advanced Access Grid Environment.",
                    "RINDY: A Ring Based Overlay Network for Peer-to-Peer On-Demand Streaming.",
                    "A Multi-layered Assessment Model for Evaluating the Level of Ubiquitous Computing Services.",
                    "UPmP: A Component-Based Configurable Software Platform for Ubiquitous Personalized Multimedia Services.",
                    "An End User Tool for Customising Personal Spaces in Ubiquitous Computing Environments.",
                    "Distributed Personal Storage System with Flexible Selection and Replication Mechanism.",
                    "Object Oriented vs. Agent-Based Oriented Ubiquitous Intelligent Mobile Managed e-Learning Environment.",
                    "Evolution of Ubi-Autonomous Entities.",
                    "Towards a Universal Knowledge Representation Language for Ubiquitous Intelligence Based on Mental Image Directed Semantic Theory.",
                    "Resolving the Semantic Inconsistency Problem for Ubiquitous RFID Applications.",
                    "Location-Based Services for Tourism Industry: An Empirical Study.",
                    "Towards Affective Collages of Presences.",
                    "Automatic Trap Detection of Ubiquitous Learning on SCORM Sequencing.",
                    "Multi-agent Approach for Ubiquitous Group Decision Support Involving Emotions."
                ]
            }
        ]
    }
]