[
    {
        "year": "2021",
        "name": "34th UIST 2021",
        "info": "Virtual Event, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/uist/2021",
                "sub_name": "UIST '21: The 34th Annual ACM Symposium on User Interface Software and Technology, Virtual Event, USA, October 10-14, 2021.",
                "count": 95,
                "papers": [
                    "Idyll Studio: A Structured Editor forAuthoring Interactive & Data-Driven Articles.",
                    "LipNotif: Use of Lips as a Non-Contact Tactile Notification Interface Based on Ultrasonic Tactile Presentation.",
                    "SensiCut: Material-Aware Laser Cutting Using Speckle Sensing and Deep Learning.",
                    "Marcelle: Composing Interactive Machine Learning Workflows and Interfaces.",
                    "False Positives vs. False Negatives: The Effects of Recovery Time and Cognitive Costs on Input Error Preference.",
                    "KondoCloud: Improving Information Management in Cloud Storage via Recommendations Based on File Similarity.",
                    "Sporq: An Interactive Environment for Exploring Code using Query-by-Example.",
                    "ModularHMD: A Reconfigurable Mobile Head-Mounted Display Enabling Ad-hoc Peripheral Interactions with the Real World.",
                    "SoundsRide: Affordance-Synchronized Music Mixing for In-Car Audio Augmented Reality.",
                    "Assuage: Assembly Synthesis Using A Guided Exploration.",
                    "Bi-3D: Bi-Manual Pen-and-Touch Interaction for 3D Manipulation on Tablets.",
                    "Voice and Touch Based Error-tolerant Multimodal Text Editing and Correction for Smartphones.",
                    "Taming fNIRS-based BCI Input for Better Calibration and Broader Use.",
                    "Unravel: A Fluent Code Explorer for Data Wrangling.",
                    "Identifying Contact Fingers on Touch Sensitive Surfaces by Ring-Based Vibratory Communication.",
                    "Route Tapestries: Navigating 360° Virtual Tour Videos Using Slit-Scan Visualizations.",
                    "Chemical Haptics: Rendering Haptic Sensations via Topical Stimulants.",
                    "reCode : A Lightweight Find-and-Replace Interaction in the IDE for Transforming Code by Example.",
                    "Adroid: Augmenting Hands-on Making with a Collaborative Robot.",
                    "SemanticAdapt: Optimization-based Adaptation of Mixed Reality Layouts Leveraging Virtual-Physical Semantic Connections.",
                    "FabHydro: Printing Interactive Hydraulic Devices with an Affordable SLA 3D Printer.",
                    "Etna: Harvesting Action Graphs from Websites.",
                    "So Predictable! Continuous 3D Hand Trajectory Prediction in Virtual Reality.",
                    "Daedalus in the Dark: Designing for Non-Visual Accessible Construction of Laser-Cut Architecture.",
                    "Dynamic Guidance for Decluttering Photographic Compositions.",
                    "ScaffoldSketch: Accurate Industrial Design Drawing in VR.",
                    "SymbolFinder: Brainstorming Diverse Symbols Using Local Semantic Networks.",
                    "EIT-kit: An Electrical Impedance Tomography Toolkit for Health and Motion Sensing.",
                    "DextrEMS: Increasing Dexterity in Electrical Muscle Stimulation by Combining it with Brakes.",
                    "PneuSeries: 3D Shape Forming with Modularized Serial-Connected Inflatables.",
                    "HoloBoard: a Large-format Immersive Teaching Board based on pseudo HoloGraphics.",
                    "Per Garment Capture and Synthesis for Real-time Virtual Try-on.",
                    "Screen Parsing: Towards Reverse Engineering of UI Models from Screenshots.",
                    "Space, Time, and Choice: A Unified Approach to Flexible Personal Scheduling.",
                    "Screen2Words: Automatic Mobile UI Summarization with Multimodal Learning.",
                    "PocketView: Through-Fabric Information Displays.",
                    "Relevance and Applicability of Hardware-independent Pointing Transfer Functions.",
                    "NavStick: Making Video Games Blind-Accessible via the Ability to Look Around.",
                    "GesturAR: An Authoring System for Creating Freehand Interactive Augmented Reality Applications.",
                    "TypeBoard: Identifying Unintentional Touch on Pressure-Sensitive Touchscreen Keyboards.",
                    "Hierarchical Summarization for Longform Spoken Dialog.",
                    "VHP: Vibrotactile Haptics Platform for On-body Applications.",
                    "Situated Live Programming for Human-Robot Collaboration.",
                    "Rapido: Prototyping Interactive AR Experiences through Programming by Demonstration.",
                    "VEmotion: Using Driving Context for Indirect Emotion Prediction in Real-Time.",
                    "autoAssembler: Automatic Reconstruction of Laser-Cut 3D Models.",
                    "Tabs.do: Task-Centric Browser Tab Management.",
                    "Automatic Instructional Video Creation from a Markdown-Formatted Tutorial.",
                    "Taxon: a Language for Formal Reasoning with Digital Fabrication Machines.",
                    "GestuRING: A Web-based Tool for Designing Gesture Input with Rings, Ring-Like, and Ring-Ready Devices.",
                    "MotionRing: Creating Illusory Tactile Motion around the Head using 360° Vibrotactile Headbands.",
                    "X-Rings: A Hand-mounted 360° Shape Display for Grasping in Virtual Reality.",
                    "Do We Need a Faster Mouse? Empirical Evaluation of Asynchronicity-Induced Jitter.",
                    "An Aligned Rank Transform Procedure for Multifactor Contrast Tests.",
                    "GazeChat: Enhancing Virtual Conferences with Gaze-aware 3D Photos.",
                    "Midair Balloon Interface: A Soft and Lightweight Midair Object for Proximate Interactions.",
                    "Urban Brush: Intuitive and Controllable Urban Layout Editing.",
                    "iText: Hands-free Text Entry on an Imaginary Keyboard for Augmented Reality Systems.",
                    "SGToolkit: An Interactive Gesture Authoring Toolkit for Embodied Conversational Agents.",
                    "STRIVE: String-Based Force Feedback for Automotive Engineering.",
                    "SimpModeling: Sketching Implicit Field to Guide Mesh Modeling for 3D Animalmorphic Head Design.",
                    "Snowy: Recommending Utterances for Conversational Visual Analysis.",
                    "MoiréBoard: A Stable, Accurate and Low-cost Camera Tracking Method.",
                    "Planning Epidemic Interventions with EpiPolicy.",
                    "Just Speak It: Minimize Cognitive Load for Eyes-Free Text Editing with a Smart Voice Assistant.",
                    "Umitation: Retargeting UI Behavior Examples for Website Design.",
                    "Weirding Haptics: In-Situ Prototyping of Vibrotactile Feedback in Virtual Reality through Vocalization.",
                    "Capturing Tactile Properties of Real Surfaces for Haptic Reproduction.",
                    "Roadkill: Nesting Laser-Cut Objects for Fast Assembly.",
                    "Altering Perceived Softness of Real Rigid Objects by Restricting Fingerpad Deformation.",
                    "TouchPose: Hand Pose Prediction, Depth Estimation, and Touch Classification from Capacitive Images.",
                    "OmniFiber: Integrated Fluidic Fiber Actuators for Weaving Movement based Interactions into the 'Fabric of Everyday Life'.",
                    "FaraPy: An Augmented Reality Feedback System for Facial Paralysis using Action Unit Intensity Estimation.",
                    "Weaving Schematics and Code: Interactive Visual Editing for Hardware Description Languages.",
                    "ReflecTrack: Enabling 3D Acoustic Position Tracking Using Commodity Dual-Microphone Smartphones.",
                    "MetaSense: Integrating Sensing Capabilities into Mechanical Metamaterial.",
                    "Trusscillator: a System for Fabricating Human-Scale Human-Powered Oscillating Devices.",
                    "App-Based Task Shortcuts for Virtual Assistants.",
                    "Automated Accessory Rigs for Layered 2D Character Illustrations.",
                    "Retargeted Self-Haptics for Increased Immersion in VR without Instrumentation.",
                    "Variance and Distribution Models for Steering Tasks.",
                    "HelpViz: Automatic Generation of Contextual Visual Mobile Tutorials from Text-Based Instructions.",
                    "Tilt-Explore: Making Tilt Gestures Usable for Low-Vision Smartphone Users.",
                    "MedKnowts: Unified Documentation and Information Retrieval for Electronic Health Records.",
                    "Lenticular Objects: 3D Printed Objects with Lenticular Lens Surfaces That Can Change their Appearance Depending on the Viewpoint.",
                    "Modeling Touch Point Distribution with Rotational Dual Gaussian Model.",
                    "HandyTrak: Recognizing the Holding Hand on a Commodity Smartphone from Body Silhouette Images.",
                    "Evaluating the Effects of Saccade Types and Directions on Eye Pointing Tasks.",
                    "Ten Million Users and Ten Years Later: Python Tutor's Design Guidelines for Building Scalable and Sustainable Research Software in Academia.",
                    "AirConstellations: In-Air Device Formations for Cross-Device Interaction via Multiple Spatially-Aware Armatures.",
                    "HapticBots: Distributed Encountered-type Haptics for VR with Multiple Shape-changing Mobile Robots.",
                    "Shapir: Standardizing and Democratizing Access to Web APIs.",
                    "MARS: Nano-Power Battery-free Wireless Interfaces for Touch, Swipe and Speech Input.",
                    "Game Illusionization: A Workflow for Applying Optical Illusions to Video Games.",
                    "Bit Whisperer: Enabling Ad-hoc, Short-range, Walk-Up-and-Share Data Transmissions via Surface-restricted Acoustics."
                ]
            },
            {
                "sub_name_abbr": "conf/uist/2021a",
                "sub_name": "UIST '21: The Adjunct Publication of the 34th Annual ACM Symposium on User Interface Software and Technology, Virtual Event, USA, October 10-14, 2021.",
                "count": 55,
                "papers": [
                    "Towards Social Interaction between 1st and 2nd Person Perspectives on Bodily Play.",
                    "Interactive Color Manipulation with Natural Language Modifiers.",
                    "Bendable Color ePaper Displays for Novel Wearable Applications and Mobile Visualization.",
                    "Assisting with Voluntary Pinch Force Control by Using Electrical Muscle Stimulation and Active Bio-Acoustic Sensing.",
                    "IntoTheVideos: Exploration of Dynamic 3D Space Reconstruction From Single Sports Videos.",
                    "FaceMe: An Augmented Reality Social Agent Game for Facilitating Children's Learning about Emotional Expressions.",
                    "A Tool for Monitoring and Controlling Standalone Immersive HCI Experiments.",
                    "A Spatial Music Listening Experience in Augmented Reality.",
                    "Motion Improvisation: 3D Human Motion Synthesis with a Transformer.",
                    "Animating Various Characters using Arm Gestures in Virtual Reality Environment.",
                    "Multi-Window Web Browser with History Tree Visualization for Virtual Reality Environment.",
                    "2.5D Simulated Keyframe Animation in Blender.",
                    "TTTV (Taste the TV): Taste Presentation Display for \"Licking the Screen\" using a Rolling Transparent Sheet and a Mixture of Liquid Sprays.",
                    "Feeasy: An Interactive Crowd-Feedback System.",
                    "A Language Acquisition Support System that Presents Differences and Distances from Model Speech.",
                    "MathMap: Supporting Exploratory Problem Solving with Algebra.",
                    "Continuous Travel In Virtual Reality Using a 3D Portal.",
                    "infOrigami: A Computer-aided Design Method for Introducing Traditional Perforated Boneless Lantern Craft to Everyday Interfaces.",
                    "Flick Gesture Interaction in Augmented Reality: AR Carrom.",
                    "Rope X: Assistance and Guidance on Jumping Rope Frequency, based on Real-time, Heart Rate Feedback During Exercise.",
                    "Romadoro: Leveraging Nudge Techniques to Encourage Break-Taking.",
                    "4D Doodling: Free Creation of Shape-Changing Decoration with A 3D Printing Pen.",
                    "3DP-Ori: Bridging-Printing Based Origami Fabrication Method with Modifiable Haptic properties.",
                    "ViTT: Towards a Virtual Reality System that Supports the Learning of Ergonomic Patient Transfers.",
                    "ScenThread: Weaving Smell into Textiles.",
                    "ShiftTouch: Sheet-type Interface Extending Capacitive Touch Inputs with Minimal Screen Occlusion.",
                    "Towards a Generalized Acoustic Minimap for Visually Impaired Gamers.",
                    "Eloquent: Improving Text Editing for Mobile.",
                    "Demonstration of FabHydro: 3D Printing Techniques for Interactive Hydraulic Devices with an Affordable SLA 3D Printer.",
                    "ViObject: A Smartwatch-based Object Recognition System via Vibrations.",
                    "EIT-kit Demo: An Electrical Impedance Tomography Toolkit for Health and Motion Sensing.",
                    "VoLearn: An Operable Motor Learning System with Auditory Feedback.",
                    "Pronunciation Training through Articulation Motion Sensing.",
                    "Fabricating Wooden Circuit Boards by Laser Beam Machining.",
                    "Enhancing Model Assessment in Vision-based Interactive Machine Teaching through Real-time Saliency Map Visualization.",
                    "HMK: Head-Mounted-Keyboard for Text Inputin Virtual or Augmented Reality.",
                    "OpenNFCSense: Open-Source Library for NFCSense.",
                    "Programmable Polarities: Actuating Interactive Prototypes with Programmable Electromagnets.",
                    "Demonstration of GestuRING, a Web Tool for Ring Gesture Input.",
                    "Single-sided Multi-layer Electric Circuit by Hot Stamping with 3D Printer.",
                    "Deep Augmented Performers: A New Ensemble Performance System by Fusion of Melody Morphing and Body Movements.",
                    "Demonstrating HapticBots: Distributed Encountered-type Haptics for VR with Multiple Shape-changing Mobile Robots.",
                    "ProbMap: Automatically constructing design galleries through feature extraction and semantic clustering.",
                    "Designing Adaptive Tools for Motor Skill Training.",
                    "Post-plant3: The Third Type of a Series of Non-humanoid Robots with an Embedded Physical Interaction: The development of non-verbal human-robot interaction framework and interactive robot prototypes.",
                    "UPLIGHT: A Novel Portable Game Device with Omnidirectional Projection Display.",
                    "GenLine and GenForm: Two Tools for Interacting with Generative Language Models in a Code Editor.",
                    "Get the GIST: An Interactive Toolkit to Support Generative Design through Metaheuristic Optimization.",
                    "From Illusions to Beyond-Real Interactions in Virtual Reality.",
                    "Systems to Democratize and Standardize Access to Web APIs.",
                    "Human-Scale Personal Fabrication.",
                    "Enabling Ubiquitous Personal Fabrication by Deconstructing Established Notions of Artifact Modeling.",
                    "Harnessing Disagreement to Create AI-Powered Systems That Reflect Our Values.",
                    "Visual Design Reuse Through Style Recognition and Transfer.",
                    "Taking Digital Product Design Coordination to the Next Level by Elastic Zooming and Linecept."
                ]
            }
        ]
    },
    {
        "year": "2020",
        "name": "33rd UIST 2020",
        "info": "Virtual Event, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/uist/2020",
                "sub_name": "UIST '20: The 33rd Annual ACM Symposium on User Interface Software and Technology, Virtual Event, USA, October 20-23, 2020.",
                "count": 101,
                "papers": [
                    "UIST+CSCW: A Celebration of Systems Research in Collaborative and Social Computing.",
                    "The Augmented Conversation and the Amplified World.",
                    "Democratizing the Production of Interactive Hardware.",
                    "SurfaceFleet: Exploring Distributed Interactions Unbounded from Device, Application, User, and Time.",
                    "FileWeaver: Flexible File Management with Automatic Dependency Tracking.",
                    "DoThisHere: Multimodal Interaction to Improve Cross-Application Tasks on Mobile Devices.",
                    "E-seed: Shape-Changing Interfaces that Self Drill.",
                    "Pop-up Print: Rapidly 3D Printing Mechanically Reversible Objects in the Folded State.",
                    "SimuLearn: Fast and Accurate Simulator to Support Morphing Materials Design and Workflows.",
                    "OddEyeCam: A Sensing Technique for Body-Centric Peephole Interaction Using WFoV RGB and NFoV Depth Cameras.",
                    "MonoEye: Multimodal Human Motion Capture System Using A Single Ultra-Wide Fisheye Camera.",
                    "C-Face: Continuously Reconstructing Facial Expressions by Deep Learning Contours of the Face with Ear-mounted Miniature Cameras.",
                    "Skyline: Interactive In-Editor Computational Performance Profiling for Deep Neural Network Training.",
                    "mage: Fluid Moves Between Code and Graphical Work in Computational Notebooks.",
                    "B2: Bridging Code and Interactive Visualization in Computational Notebooks.",
                    "RealitySketch: Embedding Responsive Graphics and Visualizations in AR through Dynamic Sketching.",
                    "TransceiVR: Bridging Asymmetrical Communication Between VR Users and External Collaborators.",
                    "Reactive Video: Adaptive Video Playback Based on User Motion for Supporting Physical Activity.",
                    "CoVR: A Large-Scale Force-Feedback Robotic Interface for Non-Deterministic Scenarios in VR.",
                    "ZoomWalls: Dynamic Walls that Simulate Haptic Infrastructure for Room-scale VR World.",
                    "REACH+: Extending the Reachability of Encountered-type Haptics Devices through Dynamic Redirection in VR.",
                    "Predicting Visual Importance Across Graphic Design Types.",
                    "Design Adjectives: A Framework for Interactive Model-Guided Exploration of Parameterized Design Spaces.",
                    "Automatic Video Creation From a Web Page.",
                    "Kerf-Canceling Mechanisms: Making Laser-Cut Mechanisms Operate across Different Laser Cutters.",
                    "LamiFold: Fabricating Objects with Integrated Mechanisms Using a Laser cutter Lamination Workflow.",
                    "Tsugite: Interactive Design and Fabrication of Wood Joints.",
                    "CAPturAR: An Augmented Reality Tool for Authoring Human-Involved Context-Aware Applications.",
                    "FlowMatic: An Immersive Authoring Tool for Creating Interactive Scenes in Virtual Reality.",
                    "View-Dependent Effects for 360° Virtual Reality Video.",
                    "PolicyKit: Building Governance in Online Communities.",
                    "Learning from the Past - Do Historical Data Help to Improve Progress Indicators in Web Surveys?",
                    "Mesh: Scaffolding Comparison Tables for Online Decision Making.",
                    "Acustico: Surface Tap Detection and Localization using Wrist-based Acoustic TDOA Sensing.",
                    "Haptics with Input: Back-EMF in Linear Resonant Actuators to Enable Touch, Pressure and Environmental Awareness.",
                    "MechanoBeat: Monitoring Interactions with Everyday Objects using 3D Printed Harmonic Oscillators and Ultra-Wideband Radar.",
                    "AAR: Augmenting a Wearable Augmented Reality Display with an Actuated Head-Mounted Projector.",
                    "ShARe: Enabling Co-Located Asymmetric Multi-User Interaction for Augmented Reality Head-Mounted Displays.",
                    "HMD Light: Sharing In-VR Experience via Head-Mounted Projector for Asymmetric Interaction.",
                    "JustCorrect: Intelligent Post Hoc Text Correction Techniques on Smartphones.",
                    "Tilt-Responsive Techniques for Digital Drawing Boards.",
                    "Interaction Interferences: Implications of Last-Instant System State Changes.",
                    "Polymorphic Blocks: Unifying High-level Specification and Low-level Control for Circuit Board Design.",
                    "MorphSensor: A 3D Electronic Design Tool for Reforming Sensor Modules.",
                    "BodyPrinter: Fabricating Circuits Directly on the Skin at Arbitrary Locations Using a Wearable Compact Plotter.",
                    "HandMorph: a Passive Exoskeleton that Miniaturizes Grasp.",
                    "bARefoot: Generating Virtual Materials using Motion Coupled Vibration in Shoes.",
                    "Omni: Volumetric Sensing and Actuation of Passive Magnetic Tools for Dynamic Haptic Feedback.",
                    "Focused Live Programming with Loop Seeds.",
                    "Small-Step Live Programming by Example.",
                    "Interactive Program Synthesis by Augmented Examples.",
                    "Capacitivo: Contact-Based Object Recognition on Interactive Fabrics using Capacitive Sensing.",
                    "ZebraSense: A Double-sided Textile Touch Sensor for Smart Clothing.",
                    "Sonoflex: Embroidered Speakers Without Permanent Magnets.",
                    "Decoding Surface Touch Typing from Hand-Tracking.",
                    "GrabAR: Occlusion-aware Grabbing Virtual Objects in AR.",
                    "Iteratively Adapting Avatars using Task-Integrated Optimisation.",
                    "Crosspower: Bridging Graphics and Linguistics.",
                    "Crosscast: Adding Visuals to Audio Travel Podcasts.",
                    "Rescribe: Authoring and Automatically Editing Audio Descriptions.",
                    "Autocomplete Animated Sculpting.",
                    "Interactive Exploration and Refinement of Facial Expression using Manifold Learning.",
                    "PoseTween: Pose-driven Tween Animation.",
                    "Slice of Light: Transparent and Integrative Transition Among Realities in a Multi-HMD-User Environment.",
                    "DataHop: Spatial Data Exploration in Virtual Reality.",
                    "DepthLab: Real-time 3D Interaction with Depth Maps for Mobile Augmented Reality.",
                    "Servo-Gaussian Model to Predict Success Rates in Manual Tracking: Path Steering and Pursuit of 1D Moving Target.",
                    "Modeling Two Dimensional Touch Pointing.",
                    "Modeling and Reducing Spatial Jitter caused by Asynchronous Input and Output Rates.",
                    "HERMITS: Dynamically Reconfiguring the Interactivity of Self-propelled TUIs with Mechanical Shell Add-ons.",
                    "Romeo: A Design Tool for Embedding Transformable Parts in 3D Models to Robotically Augment Default Functionalities.",
                    "poimo: Portable and Inflatable Mobility Devices Customizable for Personal Physical Characteristics.",
                    "Augmenting Physical Buttons with Vibrotactile Feedback for Programmable Feels.",
                    "FS-Pad: Video Game Interactions Using Force Feedback Gamepad.",
                    "Optimal Control for Electromagnetic Haptic Guidance Systems.",
                    "Sneak Pique: Exploring Autocompletion as a Data Discovery Scaffold for Supporting Visual Analysis.",
                    "ReMap: Lowering the Barrier to Help-Seeking with Multimodal Search.",
                    "SchemaBoard: Supporting Correct Assembly of Schematic Circuits using Dynamic In-Situ Visualization.",
                    "WIKA: A Projected Augmented Reality Workbench for Interactive Kinetic Art.",
                    "Video-Annotated Augmented Reality Assembly Tutorials.",
                    "ElastiLinks: Force Feedback between VR Controllers with Dynamic Points of Application of Force.",
                    "ElaStick: A Handheld Variable Stiffness Display for Rendering Dynamic Haptic Response of Flexible Object.",
                    "Haptic PIVOT: On-Demand Handhelds in VR.",
                    "Brain Relevance Feedback for Interactive Image Generation.",
                    "MYND: Unsupervised Evaluation of Novel BCI Control Strategies on Consumer Hardware.",
                    "Taste Display that Reproduces Tastes Measured by a Taste Sensor.",
                    "Multi-Modal Repairs of Conversational Breakdowns in Task-Oriented Dialogs.",
                    "Wearable Subtitles: Augmenting Spoken Communication with Lightweight Eyewear for All-day Captioning.",
                    "Direction-of-Voice (DoV) Estimation for Intuitive Speech Interaction with Smart Devices Ecosystems.",
                    "DeepFisheye: Near-Surface Multi-Finger Tracking Technology Using Fisheye Camera.",
                    "Back-Hand-Pose: 3D Hand Pose Estimation for a Wrist-worn Camera via Dorsum Deformation Network.",
                    "TelemetRing: A Batteryless and Wireless Ring-shaped Keyboard using Passive Inductive Telemetry.",
                    "Geno: A Developer Tool for Authoring Multimodal Interaction on Existing Web Applications.",
                    "TileCode: Creation of Video Games on Gaming Handhelds.",
                    "Authr: A Task Authoring Environment for Human-Robot Teams.",
                    "Programmable Filament: Printed Filaments for Multi-material 3D Printing.",
                    "DefeXtiles: 3D Printing Quasi-Woven Fabric via Under-Extrusion.",
                    "KnitGIST: A Programming Synthesis Toolkit for Generating Functional Machine-Knitting Textures.",
                    "GyroSuite: General-Purpose Interactions for Handheld Perspective Corrected Displays.",
                    "HapLinkage: Prototyping Haptic Proxies for Virtual Hand Tools Using Linkage Mechanism.",
                    "Design Justice and User Interface Design."
                ]
            },
            {
                "sub_name_abbr": "conf/uist/2020a",
                "sub_name": "UIST '20 Adjunct: The 33rd Annual ACM Symposium on User Interface Software and Technology, Virtual Event, USA, October 20-23, 2020.",
                "count": 56,
                "papers": [
                    "Shifting & Warping: A Case for the Combined Use of Dynamic Passive Haptics and Haptic Retargeting in VR.",
                    "Adapting Usability Heuristics to the Context of Mobile Augmented Reality.",
                    "Towards Multi-Wheel Input Device for Non-Visual Interaction.",
                    "LightTouch: Passive Gadgets for Extending Interactions on Capacitive Touchscreens by Automating Touch Inputs.",
                    "Dynamic Difficulty Adjustment via Fast User Adaptation.",
                    "Ambre: Augmented Metaphor Based Representation System for Electricity.",
                    "Electrolysis Ion Display on Wet Surfaces.",
                    "ARcheoBox: Engaging with Historical Artefacts Through Augmented Reality and Tangible Interactions.",
                    "Situated Learning of Soft Skills with an Interactive Agent in Virtual Reality via Multimodal Feedback.",
                    "Let It Rip! Using Velcro for Acoustic Labeling.",
                    "FLAVA: Find, Localize, Adjust and Verify to Annotate LiDAR-based Point Clouds.",
                    "Shape Memory Alloy Haptic Compression Garment for Media Augmentation in Virtual Reality Environment.",
                    "Tangible Web Layout Design for Blind and Visually Impaired People: An Initial Investigation.",
                    "Actuation Plate for Multi-Layered in-Vehicle Control Panel.",
                    "Hydrauio: Extending Interaction Space on the Pen through Hydraulic Sensing and Haptic Output.",
                    "Scrapbook: Screenshot-based Bookmark for Effective Curation of Digital Resources.",
                    "Enhancing Vibrotactile Signal Propagation using Sub-Surface 3D-Printed Waveguides.",
                    "HaPouch: Soft and Wearable Haptic Display Devices using Liquid-to-gas Phase Change Actuator.",
                    "Pleasant Locomotion - Towards Reducing Cybersickness using fNIRS during Walking Events in VR.",
                    "Bubble Visualization Overlay in Online Communication for Increased Speed Awareness and Better Turn Taking.",
                    "ARCAR: On-Road Driving in Mixed Reality by Volvo Cars.",
                    "FlashAttention: Data-centric Interaction for Data Transformation Using Programming-by-Example.",
                    "The Virtual Reality Questionnaire Toolkit.",
                    "EasyEG: A 3D-printable Brain-Computer Interface.",
                    "Context-Based 3D Grids for Augmented Reality User Interfaces.",
                    "Papercode: Generating Paper-Based User Interfaces for Code Review, Annotation, and Teaching.",
                    "PViMat: A Self-Powered Portable and Rollable Large Area Gestural Interface Using Indoor Light.",
                    "Swipe&Switch: Text Entry Using Gaze Paths and Context Switching.",
                    "Remo: Generating Interactive Tutorials by Demonstration for Online Tasks.",
                    "Cody: An Interactive Machine Learning System for Qualitative Coding.",
                    "WireTruss: A Fast-Modifiable Prototyping Method Through 3D Printing.",
                    "Towards Enabling Eye Contact and Perspective Control in Video Conference.",
                    "FabricFit: Transforming Form-Fitting Fabrics.",
                    "IBUKI: Gesture Input Method Based on Breathing.",
                    "Demonstration of MorphSensor: A 3D Electronic Design Tool for Reforming Sensor Modules.",
                    "Experiencing Real-time 3D Interaction with Depth Maps for Mobile Augmented Reality in DepthLab.",
                    "Unmasked.",
                    "Haptic Reproduction by Pneumatic Control Method Based on Load-Displacement Profile.",
                    "Dual Phone AR: Using a Second Phone as a Controller for Mobile Augmented Reality.",
                    "Newspaper Navigator: Open Faceted Search for 1.5 Million Images.",
                    "Janus Screen: A Screen with Switchable Projection Surfaces Using Polarizers.",
                    "Designing Low-Cost Sports Prosthetics with Advanced 3D Printing Techniques.",
                    "Nimble: Mobile Interface for a Visual Question Answering Augmented by Gestures.",
                    "Counterweight: Diversifying News Consumption.",
                    "RealitySketch: Embedding Responsive Graphics and Visualizations in AR with Dynamic Sketching.",
                    "Toward Self-Directed Navigation for People with Visual Impairments.",
                    "Appliancizer: Transforming Web Pages into Electronic Gadgets.",
                    "Transmissive LED Touch Display for Engineered Marble.",
                    "PQual: Automating Web Pages Qualitative Evaluation.",
                    "Mechanical Shells: Physical Add-ons for Extending and Reconfiguring the Interactivities of Actuated TUIs.",
                    "Portable Laser Cutting.",
                    "Multi-Modal Interactive Task Learning from Demonstrations and Natural Language Instructions.",
                    "Designing, Controlling, and Fabricating In-Place Augmented Structures.",
                    "Designing Representations for Digital Documents.",
                    "Personalizing 3D Free-Hand Input for Intuitive Smartphone Augmented Reality Interactions.",
                    "IoT Stickers: Enabling Lightweight Modification of Everyday Objects."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "32nd UIST 2019",
        "info": "New Orleans, LA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/uist/2019",
                "sub_name": "Proceedings of the 32nd Annual ACM Symposium on User Interface Software and Technology, UIST 2019, New Orleans, LA, USA, October 20-23, 2019.",
                "count": 95,
                "papers": [
                    "How We Make Impact.",
                    "Virtual Conferences.",
                    "KnitPicking Textures: Programming and Modifying Complex Knitted Textures for Machine and Hand Knitting.",
                    "SensorSnaps: Integrating Wireless Sensor Nodes into Fabric Snap Fasteners for Textile Interfaces.",
                    "Tessutivo: Contextual Interactions on Interactive Fabrics with Inductive Sensing.",
                    "3D Printed Fabric: Techniques for Design and 3D Weaving Programmable Textiles.",
                    "Knitting Skeletons: A Computer-Aided Design Tool for Shaping and Patterning of Knitted Garments.",
                    "Unakite: Scaffolding Developers' Decision-Making Using the Web.",
                    "Mercury: Empowering Programmers' Mobile Work Practices with Microproductivity.",
                    "X-Droid: A Quick and Easy Android Prototyping Framework with a Single-App Illusion.",
                    "CircuitStyle: A System for Peripherally Reinforcing Best Practices in Hardware Computing.",
                    "Proxino: Enabling Prototyping of Virtual Circuits with Physical Proxies.",
                    "Portal-ble: Intuitive Free-hand Manipulation in Unbounded Smartphone-based Augmented Reality.",
                    "Context-Aware Online Adaptation of Mixed Reality Interfaces.",
                    "Loki: Facilitating Remote Instruction of Physical Tasks Using Bi-Directional Mixed-Reality Telepresence.",
                    "InfoLED: Augmenting LED Indicator Lights for Device Positioning and Communication.",
                    "LightAnchors: Appropriating Point Lights for Spatially-Anchored Augmented Reality Interfaces.",
                    "Learning Cooperative Personalized Policies from Gaze Data.",
                    "Sketchforme: Composing Sketched Scenes from Text Descriptions for Interactive Applications.",
                    "Optimizing Portrait Lighting at Capture-Time Using a 360 Camera as a Light Probe.",
                    "Videostrates: Collaborative, Distributed and Programmable Video Manipulation.",
                    "View-Dependent Video Textures for 360° Video.",
                    "HairBrush for Immersive Data-Driven Hair Modeling.",
                    "Sketch-n-Sketch: Output-Directed Programming for SVG.",
                    "Self-healing UI: Mechanically and Electrically Self-healing Materials for Sensing and Actuation Interfaces.",
                    "Skin-On Interfaces: A Bio-Driven Approach for Artificial Skin Design to Cover Interactive Devices.",
                    "M-Hair: Creating Novel Tactile Feedback by Augmenting the Body Hair to Respond to Magnetic Field.",
                    "Morphlour: Personalized Flour-based Morphing Food Induced by Dehydration or Hydration Method.",
                    "Soft Inkjet Circuits: Rapid Multi-Material Fabrication of Soft Circuits using a Commodity Inkjet Printer.",
                    "Supporting Elder Connectedness through Cognitively Sustainable Design Interactions with the Memory Music Box.",
                    "StateLens: A Reverse Engineering Solution for Making Existing Dynamic Touchscreens Accessible.",
                    "Designing AR Visualizations to Facilitate Stair Navigation for People with Low Vision.",
                    "GesturePod: Enabling On-device Gesture-based Interaction for White Cane Users.",
                    "FaceWidgets: Exploring Tangible Interaction on Face with Head-Mounted Displays.",
                    "ElastImpac: 2.5D Multilevel Instant Impact Using Elasticity on Head-Mounted Displays.",
                    "Masque: Exploring Lateral Skin Stretch Feedback on the Face with Head-Mounted Displays.",
                    "MeCap: Whole-Body Digitization for Low-Cost VR/AR Headsets.",
                    "MagicalHands: Mid-Air Hand Gestures for Animating in VR.",
                    "Bodystorming Human-Robot Interactions.",
                    "ShapeBots: Shape-changing Swarm Robots.",
                    "Third-Person Piloting: Increasing Situational Awareness using a Spatially Coupled Second Drone.",
                    "GhostAR: A Time-space Editor for Embodied Authoring of Human-Robot Collaborative Task with Augmented Reality.",
                    "A 3D Printer Head as a Robotic Manipulator.",
                    "Is this Real?: Generating Synthetic Data that Looks Real.",
                    "Bespoke: Interactively Synthesizing Custom GUIs from Command-Line Applications By Demonstration.",
                    "PUMICE: A Multi-Modal Agent that Learns Concepts and Conditionals from Natural Language and Demonstrations.",
                    "Tea: A High-level Language and Runtime System for Automating Statistical Analysis.",
                    "Mallard: Turn the Web into a Contextualized Prototyping Environment for Machine Learning.",
                    "BubBowl: Display Vessel Using Electrolysis Bubbles in Drinkable Beverages.",
                    "Interactive 360-Degree Glasses-Free Tabletop 3D Display.",
                    "TilePoP: Tile-type Pop-up Prop for Virtual Reality.",
                    "LeviProps: Animating Levitated Optimized Fabric Structures using Holographic Acoustic Tweezers.",
                    "milliMorph - Fluid-Driven Thin Film Shape-Change Materials for Interaction Design.",
                    "Robiot: A Design Tool for Actuating Everyday Objects with Automatically Generated 3D Printable Mechanisms.",
                    "StackMold: Rapid Prototyping of Functional Multi-Material Objects with Selective Levels of Surface Details.",
                    "Photo-Chromeleon: Re-Programmable Multi-Color Textures Using Photochromic Dyes.",
                    "Turn-by-Wire: Computationally Mediated Physical Fabrication.",
                    "SpringFit: Joints and Mounts that Fabricate on Any Laser Cutter.",
                    "Ondulé: Designing and Controlling 3D Printable Springs.",
                    "SWISH: A Shifting-Weight Interface of Simulated Hydrodynamics for Haptic Perception of Virtual Fluid Vessels.",
                    "Aero-plane: A Handheld Force-Feedback Device that Renders Weight Motion Illusion on a Virtual 2D Plane.",
                    "Mise-Unseen: Using Eye Tracking to Hide Virtual Reality Scene Changes in Plain Sight.",
                    "Pull-Ups: Enhancing Suspension Activities in Virtual Reality with Body-Scale Kinesthetic Force Feedback.",
                    "PseudoBend: Producing Haptic Illusions of Stretching, Bending, and Twisting Using Grain Vibrations.",
                    "CapstanCrunch: A Haptic VR Controller with User-supplied Force Feedback.",
                    "Beyond the Input Stream: Making Text Entry Evaluations More Flexible with Transcription Sequences.",
                    "Type, Then Correct: Intelligent Text Correction Techniques for Mobile Text Entry Using Neural Networks.",
                    "Gaze-Assisted Typing for Smart Glasses.",
                    "SpaceInk: Making Space for In-Context Annotations.",
                    "TipText: Eyes-Free Text Entry on a Fingertip Keyboard.",
                    "SCALE: Enhancing Force-based Interaction by Processing Load Data from Load Sensitive Modules.",
                    "Virtual Muscle Force: Communicating Kinesthetic Forces Through Pseudo-Haptic Feedback and Muscle Input.",
                    "Tactlets: Adding Tactile Feedback to 3D Objects Using Custom Printed Controls.",
                    "Mantis: A Scalable, Lightweight and Accessible Architecture to Build Multiform Force Feedback Systems.",
                    "HapSense: A Soft Haptic I/O Device with Uninterrupted Dual Functionalities of Force Sensing and Vibrotactile Actuation.",
                    "Opisthenar: Hand Poses and Finger Tapping Recognition by Observing Back of Hand Using Embedded Wrist Camera.",
                    "Sozu: Self-Powered Radio Tags for Building-Scale Activity Sensing.",
                    "LabelAR: A Spatial Guidance Interface for Fast Computer Vision Image Collection.",
                    "RFTouchPads: Batteryless and Wireless Modular Touch Sensor Pads Based on RFID.",
                    "PrivateTalk: Activating Voice Input with Hand-On-Mouth Gesture Detected by Bluetooth Earphones.",
                    "Ohmic-Sticker: Force-to-Motion Type Input Device that Extends Capacitive Touch Surface.",
                    "Modeling the Uncertainty in 2D Moving Target Selection.",
                    "Tip-Tap: Battery-free Discrete 2D Fingertip Input.",
                    "Accurate and Low-Latency Sensing of Touch Contact on Any Surface with Finger-Worn IMU Sensor.",
                    "Multi-Touch Kit: A Do-It-Yourself Technique for Capacitive Multi-Touch Sensing Using a Commodity Microcontroller.",
                    "Redirected Jumping: Perceptual Detection Rates for Curvature Gains.",
                    "DreamWalker: Substituting Real-World Walking Experiences with a Virtual Reality.",
                    "The Memory Palace: Exploring Visual-Spatial Paths for Strong, Memorable, Infrequent Authentication.",
                    "Drift-Correction Techniques for Scale-Adaptive VR Navigation.",
                    "CAVRN: An Exploration and Evaluation of a Collective Audience Virtual Reality Nexus Experience.",
                    "ActiTouch: Robust Touch Detection for On-Skin AR/VR Interfaces.",
                    "Eye&Head: Synergetic Eye and Head Movement for Gaze Pointing and Selection.",
                    "Resized Grasping in VR: Estimating Thresholds for Object Discrimination.",
                    "Plane, Ray, and Point: Enabling Precise Spatial Manipulations with Shape Constraints.",
                    "INVANER: INteractive VAscular Network Editing and Repair."
                ]
            },
            {
                "sub_name_abbr": "conf/uist/2019a",
                "sub_name": "Adjunct Proceedings of the 32nd Annual ACM Symposium on User Interface Software and Technology, UIST 2019, New Orleans, LA, USA, October 20-23, 2019.",
                "count": 56,
                "papers": [
                    "Cross-Ratio Based Gaze Estimation for Multiple Displays using a Polarization Camera.",
                    "Evaluating the Minimum Jerk Motion Model for Redirected Reach in Virtual Reality.",
                    "Gel-based Haptic Mediator for High-Definition Tactile Communication.",
                    "A New Approach to Studying Sleep in Autonomous Vehicles: Simulating the Waking Situation.",
                    "InteractivePaper: Minimalism in Document Editing UI Through the Handwriting Prism.",
                    "Towards Instantaneous Recovery from Autonomous System Failures via Predictive Crowdsourcing.",
                    "Plotshop: An Interactive System for Designing a 2D Data Distribution on a Scatter Plot.",
                    "Estimating Focused Object using Smooth Pursuit Eye Movements and Interest Points in the Real World.",
                    "Voice Input Interface Failures and Frustration: Developer and User Perspectives.",
                    "Say and Find it: A Multimodal Wearable Interface for People with Visual Impairment.",
                    "LiftTiles: Modular and Reconfigurable Room-scale Shape Displays through Retractable Inflatable Actuators.",
                    "TransVoice: Real-Time Voice Conversion for Augmenting Near-Field Speech Communication.",
                    "Pneu-Multi-Tools: Auto-Folding and Multi-Shapes Interface by Pneumatics in Virtual Reality.",
                    "BodyHub: A Reconfigurable Wearable System for Clothing.",
                    "Distance-driven User Interface for Collaborative Exhibit Viewing in Augmented Reality Museum.",
                    "ScreenTrack: Using Visual History for Self-tracking Computer Activities and Retrieving Working Context.",
                    "HeatMat: Designing Internal Structures for Supporting Hands-on Design Activity with Heated 3D Printed Objects.",
                    "Pre-screen: Assisting Material Screening in Early-stage of Video Editing.",
                    "What Did I Miss?",
                    "Aesop: Authoring Engaging Digital Storytelling Experiences.",
                    "Stick User Interface.",
                    "ARComposer: Authoring Augmented Reality Experiences through Text.",
                    "An Investigation of Electrode Design for Physical Touch Extensions on a Capacitive Touch Surface.",
                    "Towards Consistent Haptic Coupling with HaptiStrap: Doing Better than \"Tight yet Comfortable\".",
                    "CalliScan: On-device Privacy-Preserving Image-based Handwritten Text Recognition with Visual Hints.",
                    "Gaze-based Product Filtering: A System for Creating Adaptive User Interfaces to Personalize Stateless Point-of-Sale Machines.",
                    "Rapid Prototyping of Pneumatically Actuated Inflatable Structures.",
                    "Towards Universal Evaluation of Image Annotation Interfaces.",
                    "Choose a lift and walk into it: Manifesting Choice Blindness in Real-life Scenarios using Immersive Virtual Reality.",
                    "Audio Substituting Haptic System to Aware the Sound from Backwards.",
                    "Auditory Uta-KARUTA: Sonificated Card Game towards Inclusive Design.",
                    "Ardestan: A Visual Programming Language for Arduino.",
                    "ReMap: Multimodal Help-Seeking.",
                    "Rapid Prototyping of Paper Electronics Using a Metal Leaf and Laser Printer.",
                    "Optical See-Through Head-Mounted Display with Deep Depth of Field Using Pinhole Polarizing Plates.",
                    "Tangible Projection Mapping onto Deformable Moving Thin Plants via Markerless Tracking.",
                    "Visualizing Out-of-synchronization in Group Dancing.",
                    "A Demonstration on Dynamic Drawing Guidance via Electromagnetic Haptic Feedback.",
                    "Occlusion-aware Hand Posture Based Interaction on Tabletop Projector.",
                    "Extending AR Interaction through 3D Printed Tangible Interfaces in an Urban Planning Context.",
                    "Prismodule: Modular UI for Smartphones Using Internal Reflection.",
                    "Demo of AuraRing: Precise Electromagnetic Finger Tracking.",
                    "Proposal of Lens Shaping Method Using UV Printer.",
                    "Hot Stamping of Electric Circuits by 3D Printer.",
                    "VARiable HMD: Optical See-Through HMD for AR and VR.",
                    "Machine-o-Matic: A Programming Environment for Prototyping Digital Fabrication Workflows.",
                    "Demonstration of TORC: A Virtual Reality Controller for In-Hand High-Dexterity Finger Interaction.",
                    "A Match Made in Heaven: Streaming Real-time Imagery from a Lightfield Camera to a Lightfield Display.",
                    "Data Structures for Designing Interactions with Contextual Task Support.",
                    "Advancing Accessible 3D Design for the Blind and Visually-Impaired via Tactile Shape Displays.",
                    "Circuit Design Tools for Exploratory Understanding.",
                    "Collective Shape-changing Interfaces.",
                    "Designing Interactive Intelligent Systems for Human Learning, Creativity, and Sensemaking.",
                    "Improving Viewer Engagement and Communication Efficiency within Non-Entertainment Live Streaming.",
                    "Performance-based Expressive Character Animation.",
                    "Lucid Fabrication."
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "31st UIST 2018",
        "info": "Berlin, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/uist/2018",
                "sub_name": "The 31st Annual ACM Symposium on User Interface Software and Technology, UIST 2018, Berlin, Germany, October 14-17, 2018.",
                "count": 82,
                "papers": [
                    "The Science and Practice of Transitions.",
                    "Robots For Us: Organizational and Community Perspectives on the Collaborative Design of Ubiquitous Robots.",
                    "PuPoP: Pop-up Prop on Palm for Virtual Reality.",
                    "SynchronizAR: Instant Synchronization for Spontaneous and Spatial Collaborations in Augmented Reality.",
                    "Ownershift: Facilitating Overhead Interaction in Virtual Reality with an Ownership-Preserving Hand Space Shift.",
                    "Wall-based Space Manipulation Technique for Efficient Placement of Distant Objects in Augmented Reality.",
                    "MobiLimb: Augmenting Mobile Devices with a Robotic Limb.",
                    "MetaArms: Body Remapping Using Feet-Controlled Artificial Arms.",
                    "Authoring and Verifying Human-Robot Interactions.",
                    "GridDrones: A Self-Levitating Physical Voxel Lattice for Interactive 3D Surface Deformations.",
                    "Dynablock: Dynamic 3D Printing for Instant and Reconstructable Shape Formation.",
                    "TrussFormer: 3D Printing Large Kinetic Structures.",
                    "Shape-Aware Material: Interactive Fabrication with ShapeMe.",
                    "Wireless Analytics for 3D Printed Objects.",
                    "The Exploratory Labeling Assistant: Mixed-Initiative Label Curation with Large Document Collections.",
                    "Sprout: Crowd-Powered Task Design for Crowdsourcing.",
                    "Crowdsourcing Similarity Judgments for Agreement Analysis in End-User Elicitation Studies.",
                    "Believe it or not: Designing a Human-AI Partnership for Mixed-Initiative Fact-Checking.",
                    "Porta: Profiling Software Tutorials Using Operating-System-Wide Activity Tracing.",
                    "Ubicoustics: Plug-and-Play Acoustic Activity Recognition.",
                    "Vibrosight: Long-Range Vibrometry for Smart Environment Sensing.",
                    "SilentVoice: Unnoticeable Voice Input by Ingressive Speech.",
                    "SoundBender: Dynamic Acoustic Control Behind Obstacles.",
                    "Vizir: A Domain-Specific Graphical Language for Authoring and Operating Airport Automations.",
                    "MoSculp: Interactive Visualization of Shape and Time.",
                    "Maestro: Designing a System for Real-Time Orchestration of 3D Modeling Workshops.",
                    "Turbulence Ahead - A 3D Web-Based Aviation Weather Visualizer.",
                    "CamTrackPoint: Camera-Based Pointing Stick Using Transmitted Light through Finger.",
                    "Indutivo: Contact-Based, Object-Driven Interactions with Inductive Sensing.",
                    "Touch+Finger: Extending Touch-based User Interface Capabilities with \"Idle\" Finger Gestures in the Air.",
                    "FingerArc and FingerChord: Supporting Novice to Expert Transitions with Guided Finger-Aware Shortcuts.",
                    "Tacttoo: A Thin and Feel-Through Tattoo for On-Skin Tactile Output.",
                    "Extending a Reactive Expression Language with Data Update Actions for End-User Application Authoring.",
                    "Immersive Trip Reports.",
                    "Non-Linear Editing of Text-Based Screencasts.",
                    "Multitasking with Play Write, a Mobile Microproductivity Writing Tool.",
                    "Facilitating Document Reading by Linking Text and Tables.",
                    "ElectroTutor: Test-Driven Physical Computing Tutorials.",
                    "WiFröst: Bridging the Information Gap for Debugging of Networked Embedded Systems.",
                    "Assembly-aware Design of Printable Electromechanical Devices.",
                    "RFIMatch: Distributed Batteryless Near-Field Identification Using RFID-Tagged Magnet-Biased Reed Switches.",
                    "I/O Braid: Scalable Touch-Sensitive Lighted Cords Using Spiraling, Repeating Sensing Textiles and Fiber Optics.",
                    "ShareSpace: Facilitating Shared Use of the Physical Space by both VR Head-Mounted Display and External Users.",
                    "Scenograph: Fitting Real-Walking VR Experiences into Various Tracking Volumes.",
                    "Increasing Walking in VR using Redirected Teleportation.",
                    "Adasa: A Conversational In-Vehicle Digital Assistant for Advanced Driver Assistance Features.",
                    "Effects of an Adaptive Modality Selection Algorithm for Navigation Systems.",
                    "Ultra-Low-Power Mode for Screenless Mobile Interaction.",
                    "Learning Design Semantics for Mobile Apps.",
                    "Lip-Interact: Improving Mobile Device Interaction with Silent Speech Commands.",
                    "Self-Powered Gesture Recognition with Ambient Light.",
                    "Robust Annotation of Mobile Application Interfaces in Methods for Accessibility Repair and Enhancement.",
                    "4DMesh: 4D Printing Morphing Non-Developable Mesh Surfaces.",
                    "Blocks-to-CAD: A Cross-Application Bridge from Minecraft to 3D Modeling.",
                    "A Mixed-Initiative Interface for Animating Static Pictures.",
                    "TakeToons: Script-driven Performance Animation.",
                    "Montage: A Video Prototyping System to Reduce Re-Shooting and Increase Re-Usability.",
                    "Designing Groundless Body Channel Communication Systems: Performance and Implications.",
                    "Orecchio: Extending Body-Language through Actuated Static and Dynamic Auricular Postures.",
                    "Designing Socially Acceptable Hand-to-Face Input.",
                    "Asterisk and Obelisk: Motion Codes for Passive Tagging.",
                    "Magneto-Haptics: Embedding Magnetic Force Feedback for Physical Interactions.",
                    "RESi: A Highly Flexible, Pressure-Sensitive, Imperceptible Textile Interface Based on Resistive Yarns.",
                    "Haptic Feedback to the Palm and Fingers for Improved Tactile Perception of Large Objects.",
                    "ElectricItch: Skin Irritation as a Feedback Modality.",
                    "InfiniTouch: Finger-Aware Interaction on Fully Touch Sensitive Smartphones.",
                    "Next-Point Prediction for Direct Touch Using Finite-Time Derivative Estimation.",
                    "FDSense: Estimating Young's Modulus and Stiffness of End Effectors to Facilitate Kinetic Interaction on Touch Surfaces.",
                    "Unimanual Pen+Touch Input Using Variations of Precision Grip Postures.",
                    "RollingStone: Using Single Slip Taxel for Enhancing Active Finger Exploration with a Virtual Reality Controller.",
                    "Spacetime: Enabling Fluid Individual and Collaborative Editing in Virtual Reality.",
                    "Evaluation of Interaction Techniques for a Virtual Reality Reading Room in Diagnostic Radiology.",
                    "DualPanto: A Haptic Device that Enables Blind Users to Continuously Interact with Virtual Worlds.",
                    "VR Grabbers: Ungrounded Haptic Retargeting for Precision Grabbing Tools.",
                    "DextrES: Wearable Haptic Feedback for Grasping in VR via a Thin Form-Factor Electrostatic Brake.",
                    "HydroRing: Supporting Mixed Reality Haptics Using Liquid Flow.",
                    "FacePush: Introducing Normal Force on Face with Head-Mounted Displays.",
                    "Arboretum and Arbility: Improving Web Accessibility Through a Shared Browsing Architecture.",
                    "Fusion: Opportunistic Web Prototyping with UI Mashups.",
                    "Rousillon: Scraping Distributed Hierarchical Web Data.",
                    "Idyll: A Markup Language for Authoring and Publishing Interactive Articles on the Web.",
                    "Ply: A Visual Web Inspector for Learning from Professional Webpages."
                ]
            },
            {
                "sub_name_abbr": "conf/uist/2018a",
                "sub_name": "The 31st Annual ACM Symposium on User Interface Software and Technology Adjunct Proceedings, UIST 2018, Berlin, Germany, October 14-17, 2018.",
                "count": 77,
                "papers": [
                    "Pushables: A DIY Approach for Fabricating Customizable and Self-Contained Tactile Membrane Dome Switches.",
                    "Mindgame: Mediating People's EEG Alpha Band Power through Reinforcement Learning.",
                    "SweatSponse: Closing the Loop on Notification Delivery Using Skin Conductance Responses.",
                    "SurfaceStreams: A Content-Agnostic Streaming Toolkit for Interactive Surfaces.",
                    "Augmented Collaboration in Shared Space Design with Shared Attention and Manipulation.",
                    "Aalto Interface Metrics (AIM): A Service and Codebase for Computational GUI Evaluation.",
                    "Shared Autonomy for an Interactive AI System.",
                    "DynamicSlide: Reference-based Interaction Techniques for Slide-based Lecture Videos.",
                    "Gaze-guided Image Classification for Reflecting Perceptual Class Ambiguity.",
                    "Touch180: Finger Identification on Mobile Touchscreen using Fisheye Camera and Convolutional Neural Network.",
                    "OmniEyeball: Spherical Display Equipped With Omnidirectional Camera And Its Application For 360-Degree Video Communication.",
                    "AmbientLetter: Letter Presentation Method for Discreet Notification of Unknown Spelling when Handwriting.",
                    "Head Pose Classification by using Body-Conducted Sound.",
                    "cARe: An Augmented Reality Support System for Dementia Patients.",
                    "Scaling Notifications Beyond Alerts: From Subtly Drawing Attention up to Forcing the User to Take Action.",
                    "Companion - A Software Toolkit for Digitally Aided Pen-and-Paper Tabletop Roleplaying.",
                    "Post-literate Programming: Linking Discussion and Code in Software Development Teams.",
                    "Juggling 4.0: Learning Complex Motor Skills with Augmented Reality Through the Example of Juggling.",
                    "Wearable Kinesthetic I/O Device for Sharing Muscle Compliance.",
                    "Reversing Voice-Related Biases Through Haptic Reinforcement.",
                    "Mixed-Reality for Object-Focused Remote Collaboration.",
                    "Trans-scale Playground: An Immersive Visual Telexistence System for Human Adaptation.",
                    "Augmenting Human Hearing Through Interactive Auditory Mediated Reality.",
                    "Sense.Seat: Inducing Improved Mood and Cognition through Multisensorial Priming.",
                    "Kaleidoscope: An RDF-based Exploratory Data Analysis Tool for Ideation Outcomes.",
                    "Perceptual Switch for Gaze Selection.",
                    "ZEUSSS: Zero Energy Ubiquitous Sound Sensing Surface Leveraging Triboelectric Nanogenerator and Analog Backscatter Communication.",
                    "reMi: Translating Ambient Sounds of Moment into Tangible and Shareable Memories through Animated Paper.",
                    "Engagement Learning: Expanding Visual Knowledge by Engaging Online Participants.",
                    "A WOZ Study of Feedforward Information on an Ambient Display in Autonomous Cars.",
                    "CrowdMuse: An Adaptive Crowd Brainstorming System.",
                    "Active Authentication on Smartphone using Touch Pressure.",
                    "DisplayBowl: A Bowl-Shaped Display for Omnidirectional Videos.",
                    "Investigation into Natural Gestures Using EMG for \"SuperNatural\" Interaction in VR.",
                    "I Know What You Want: Using Gaze Metrics to Predict Personal Interest.",
                    "D-Aquarium: A Digital Aquarium to Reduce Perceived Waiting Time at Children's Hospital.",
                    "One Button to Rule Them All: Rendering Arbitrary Force-Displacement Curves.",
                    "Towards a Symbiotic Human-Machine Depth Sensor: Exploring 3D Gaze for Object Reconstruction.",
                    "Phonoscape: Auralization of Photographs using Stereophonic Auditory Icons.",
                    "DroneCTRL: A Tangible Remote Input Control for Quadcopters.",
                    "resources2city Explorer: A System for Generating Interactive Walkable Virtual Cities out of File Systems.",
                    "EyeExpress: Expanding Hands-free Input Vocabulary using Eye Expressions.",
                    "Game Design for Users with Constraint: Exergame for Older Adults with Cognitive Impairment.",
                    "Pop-up Robotics: Facilitating HRI in Public Spaces.",
                    "Scout: Mixed-Initiative Exploration of Design Variations through High-Level Design Constraints.",
                    "PrintMotion: Actuating Printed Objects Using Actuators Equipped in a 3D Printer.",
                    "MetaArms: Body Remapping Using Feet-Controlled Artificial Arms.",
                    "Interactive Tangrami: Rapid Prototyping with Modular Paper-folded Electronics.",
                    "Face/On: Actuating the Facial Contact Area of a Head-Mounted Display for Increased Immersion.",
                    "Transparent Mask: Face-Capturing Head-Mounted Display with IR Pass Filters.",
                    "Wearable Haptic Device that Presents the Haptics Sensation Corresponding to Three Fingers on the Forearm.",
                    "Haptopus: Haptic VR Experience Using Suction Mechanism Embedded in Head-mounted Display.",
                    "Unlimited Electric Gum: A Piezo-based Electric Taste Apparatus Activated by Chewing.",
                    "AccordionFab: Fabricating Inflatable 3D Objects by Laser Cutting and Welding Multi-Layered Sheets.",
                    "HoloRoyale: A Large Scale High Fidelity Augmented Reality Game.",
                    "Screen-Camera Communication via Matrix Barcode Utilizing Imperceptible Color Vibration.",
                    "OptRod: Constructing Interactive Surface with Multiple Functions and Flexible Shape by Projected Image.",
                    "Haptic Interface Using Tendon Electrical Stimulation.",
                    "FTIR-based Touch Pad for Smartphone-based HMD Enhancement.",
                    "The Immersive Bubble Chart: a Semantic and Virtual Reality Visualization for Big Data.",
                    "Collaborative Virtual Reality for Low-Latency Interaction.",
                    "Artificial Motion Guidance: an Intuitive Device based on Pneumatic Gel Muscle (PGM).",
                    "A Demonstration of VRSpinning: Exploring the Design Space of a 1D Rotation Platform to Increase the Perception of Self-Motion in VR.",
                    "An Interactive Pipeline for Creating Visual Blends.",
                    "A Stretch-Flexible Textile Multitouch Sensor for User Input on Inflatable Membrane Structures & Non-Planar Surfaces.",
                    "Demonstrating Gamepad with Programmable Haptic Texture Analog Buttons.",
                    "Knobology 2.0: Giving Shape to the Haptic Force Feedback of Interactive Knobs.",
                    "Hybrid Watch User Interfaces: Collaboration Between Electro-Mechanical Components and Analog Materials.",
                    "I/O Braid: Scalable Touch-Sensitive Lighted Cords Using Spiraling, Repeating Sensing Textiles and Fiber Optics.",
                    "Artistic Vision: Providing Contextual Guidance for Capture-Time Decisions.",
                    "The Right Content at the Right Time: Contextual Examples for Just-in-time Creative Learning.",
                    "Crowd-AI Systems for Non-Visual Information Access in the Real World.",
                    "Designing Inherent Interactions on Wearable Devices.",
                    "Fostering Design Process of Shape-Changing Interfaces.",
                    "Designing Interactive Behaviours Beyond the Desktop.",
                    "Comfortable and Efficient Travel Techniques in VR.",
                    "Enabling Single-Handed Interaction in Mobile and Wearable Computing."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "30th UIST 2017",
        "info": "Quebec City, QC, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/uist/2017",
                "sub_name": "Proceedings of the 30th Annual ACM Symposium on User Interface Software and Technology, UIST 2017, Quebec City, QC, Canada, October 22 - 25, 2017.",
                "count": 75,
                "papers": [
                    "Towards a Universal Knowledge Accelerator.",
                    "Hacking Computer Science History: A Cultural Intervention.",
                    "Dwell+: Multi-Level Mode Selection Using Vibrotactile Cues.",
                    "CommandBoard: Creating a General-Purpose Command Gesture Input Space for Soft Keyboard.",
                    "Characterizing Latency in Touch and Button-Equipped Interactive Systems.",
                    "WhichFingers: Identifying Fingers on Touch Surfaces and Keyboards using Vibration Sensors.",
                    "Carpacio: Repurposing Capacitive Sensors to Distinguish Driver and Passenger Touches on In-Vehicle Screens.",
                    "Learning Visual Importance for Graphic Designs and Data Visualizations.",
                    "ImAxes: Immersive Axes as Embodied Affordances for Interactive Multivariate Data Visualisation.",
                    "Triggering Artwork Swaps for Live Animation.",
                    "Secondary Motion for Performed 2D Animation.",
                    "HapticClench: Investigating Squeeze Sensations using Memory Alloys.",
                    "Grabity: A Wearable Haptic Interface for Simulating Weight and Grasping in Virtual Reality.",
                    "Frictio: Passive Kinesthetic Force Feedback for Smart Ring Output.",
                    "MagTics: Flexible and Thin Form Factor Magnetic Actuators for Dynamic and Wearable Haptic Feedback.",
                    "EyeScout: Active Eye Tracking for Position and Movement Independent Gaze Interaction with Large Public Displays.",
                    "SmoothMoves: Smooth Pursuits Head Movements for Augmented Reality.",
                    "MatchPoint: Spontaneous Spatial Coupling of Body Movement for Touchless Pointing.",
                    "Everyday Eye Contact Detection Using Unsupervised Gaze Target Discovery.",
                    "A Modular Smartphone for Lending.",
                    "You as a Puppet: Evaluation of Telepresence User Interface for Puppetry.",
                    "Reinventing the Wheel: Transforming Steering Wheel Systems for Autonomous Vehicles.",
                    "Thermal-Comfort Design of Personalized Casts.",
                    "Outside-In: Visualizing Out-of-Sight Regions-of-Interest in a 360° Video Using Spatial Picture-in-Picture Previews.",
                    "CollaVR: Collaborative In-Headset Review for VR Video.",
                    "Panning and Zooming High-Resolution Panoramas in Virtual Reality Devices.",
                    "Shot Orientation Controls for Interactive Cinematography with 360 Video.",
                    "Bifröst: Visualizing and Checking Behavior of Embedded Systems across Hardware and Software.",
                    "CircuitSense: Automatic Sensing of Physical Circuits and Generation of Virtual Circuits to Support Software Tools.",
                    "Scanalog: Interactive Design and Debugging of Analog Circuits with Programmable Hardware.",
                    "Trigger-Action-Circuits: Leveraging Generative Design to Enable Novices to Design and Build Circuitry.",
                    "CurrentViz: Sensing and Visualizing Electric Current Flows of Breadboarded Circuits.",
                    "Reflector: Distance-Independent, Private Pointing on a Reflective Screen.",
                    "DodecaPen: Accurate 6DoF Tracking of a Passive Stylus.",
                    "FlexStylus: Leveraging Bend Input for Pen Interaction.",
                    "SweepCanvas: Sketch-based 3D Prototyping on an RGB-D Image.",
                    "DreamSketch: Early Stage 3D Design Explorations with Sketching and Generative Design.",
                    "Interactive Room Capture on 3D-Aware Mobile Devices.",
                    "SceneCtrl: Mixed Reality Enhancement via Efficient Scene Editing.",
                    "FoamSense: Design of Three Dimensional Soft Sensors with Porous Materials.",
                    "AirCode: Unobtrusive Physical Tags for Digital Fabrication.",
                    "BlowFab: Rapid Prototyping for Rigid and Reusable Objects using Inflation of Laser-cut Surfaces.",
                    "StrutModeling: A Low-Fidelity Construction Kit to Iteratively Model, Test, and Adapt 3D Objects.",
                    "Designing and Evaluating Livefonts.",
                    "Markit and Talkit: A Low-Barrier Toolkit to Augment 3D Printed Models with Audio Annotations.",
                    "INVISO: A Cross-platform User Interface for Creating Virtual Sonic Environments.",
                    "Neuroanatomical Correlates of Perceived Usability.",
                    "AutoDub: Automatic Redubbing for Voiceover Editing.",
                    "RetroShape: Leveraging Rear-Surface Shape Displays for 2.5D Interaction on Smartwatches.",
                    "Pyro: Thumb-Tip Gesture Recognition Using Pyroelectric Infrared Sensing.",
                    "SmartSleeve: Real-time Sensing of Surface and Deformation Gestures on Flexible, Interactive Textiles, using a Hybrid Gesture Detection Pipeline.",
                    "SoundCraft: Enabling Spatial Interactions on Smartwatches using Hand Generated Acoustics.",
                    "SensIR: Detecting Hand Gestures with a Wearable Bracelet using Infrared Transmission and Reflection.",
                    "Qoom: An Interactive Omnidirectional Ball Display.",
                    "HeatSpace: Automatic Placement of Displays by Empirical Analysis of User Behavior.",
                    "Pepper's Cone: An Inexpensive Do-It-Yourself 3D Display.",
                    "iSphere: Self-Luminous Spherical Drone Display.",
                    "A Capacitive Touch Sensing Technique with Series-connected Sensing Electrodes.",
                    "Data Storage and Interaction using Magnetized Fabric.",
                    "iSoft: A Customizable Soft Sensor with Real-time Continuous Contact and Stretching Sensing.",
                    "CanalSense: Face-Related Movement Recognition System based on Sensing Air Pressure in Ear Canals.",
                    "DS.js: Turn Any Webpage into an Example-Centric Live Programming Environment for Learning Data Science.",
                    "Torta: Generating Mixed-Media GUI and Command-Line App Tutorials Using Operating-System-Wide Activity Tracing.",
                    "Codestrates: Literate Computing with Webstrates.",
                    "ZIPT: Zero-Integration Performance Testing of Mobile App Designs.",
                    "Omnicode: A Novice-Oriented Live Programming Environment with Always-On Run-Time Value Visualizations.",
                    "NaviFields: Relevance fields for adaptive VR navigation.",
                    "Erg-O: Ergonomic Optimization of Immersive Virtual Environments.",
                    "More than a Feeling: The MiFace Framework for Defining Facial Communication Mappings.",
                    "One Reality: Augmenting How the Physical World is Experienced by combining Multiple Mixed Reality Modalities.",
                    "Mutual Human Actuation.",
                    "WearMail: On-the-Go Access to Information in Your Email with a Privacy-Preserving Human Computation Workflow.",
                    "SketchExpress: Remixing Animations for More Effective Crowd-Powered Prototyping of Interactive Interfaces.",
                    "Crowd Research: Open and Scalable University Laboratories.",
                    "Rico: A Mobile App Dataset for Building Data-Driven Design Applications."
                ]
            },
            {
                "sub_name_abbr": "conf/uist/2017a",
                "sub_name": "Adjunct Publication of the 30th Annual ACM Symposium on User Interface Software and Technology, UIST 2017 Adjunct Volume, Quebec City, QC, Canada, October 22 - 25, 2017.",
                "count": 58,
                "papers": [
                    "Multiplanes: Assisted Freehand VR Drawing.",
                    "SkinBot: A Wearable Skin Climbing Robot.",
                    "CritiqueKit: A Mixed-Initiative, Real-Time Interface For Improving Feedback.",
                    "Designing Vibrotactile Widgets with Printed Actuators and Sensors.",
                    "Eye Tracking Using Built-in Camera for Smartphone-based HMD.",
                    "PhyShare: Sharing Physical Interaction in Virtual Reality.",
                    "Creating Haptic Illusion of Compliance for Tangential Force Input using Vibrotactile Actuator.",
                    "Mobile Brain-Computer Interface for Dance and Somatic Practice.",
                    "Hand Development Kit: Soft Robotic Fingers as Prosthetic Augmentation of the Hand.",
                    "Tactile Element with Double-sided Inkjet Printing to Generate Electrostatic Forces and Electrostimuli.",
                    "Printing System Reflecting User's Intent in Real Time Using a Handheld Printer.",
                    "Filum: A Sewing Technique to Alter Textile Shapes.",
                    "Demonstrating TrussFab's Editor: Designing Sturdy Large-Scale Structures.",
                    "Demonstrating Interactive Systems based on Electrical Muscle Stimulation.",
                    "Attaching Objects to Smartphones Back Side for a Modular Interface.",
                    "HaptI/O: Physical Node for the Internet of Haptics.",
                    "Sonoliards: Rendering Audible Sound Spots by Reflecting the Ultrasound Beams.",
                    "Atypical: A Type System for Live Performances.",
                    "AccelTag: A Passive Smart ID Tag with Acceleration Sensor for Interactive Applications.",
                    "Feeling Fireworks.",
                    "JDLED: Towards Visio-Tactile Displays Based on Electrochemical Locomotion of Liquid-Metal Janus Droplets.",
                    "Ultrasonic Cuisine: Proposal of Ultrasonic Non-contact Stirring Methods.",
                    "GestAKey: Get More Done with Just-a-Key on a Keyboard.",
                    "shapeShift: A Mobile Tabletop Shape Display for Tangible and Haptic Interaction.",
                    "Playful Interactions with Body Channel Communication: Conquer it!",
                    "Shall We Fabricate?: Collaborative, Bidirectional, Incremental Fabrication.",
                    "Fading into the Background: Unleashing Ubiquitous and Unobtrusive Context Sensing.",
                    "Wind Tactor: An Airflow-based Wearable Tactile Display.",
                    "Hybrid Use of Asynchronous and Synchronous Interaction for Collaborative Creation.",
                    "Interacting with Acoustic Simulation and Fabrication.",
                    "Enabling Sensing and Interaction with Everyday Objects.",
                    "Optically Dynamic Interfaces.",
                    "Systems for Improving Online Discussion.",
                    "HapticDrone: An Encountered-Type Kinesthetic Haptic Interface with Controllable Force Feedback: Initial Example for 1D Haptic Feedback.",
                    "Ani-Bot: A Mixed-Reality Modular Robotics System.",
                    "A Thermally Enhanced Weather Checking System in VR.",
                    "The Feedback Block Model for an Adaptive E-Book.",
                    "Jaguar: Indoor Navigation System for Organizations.",
                    "Contour: An Efficient Voice-enabled Workflow for Producing Text-to-Speech Content.",
                    "Raising the Heat: Electrical Muscle Stimulation for Simulated Heat Withdrawal Response.",
                    "Grip Force Estimation by Emitting Vibration.",
                    "Towards Intermanual Apparent Motion of Thermal Pulses.",
                    "GraspForm: Shape and Hardness Rendering on Handheld Device toward Universal Interface for 3D Haptic TV.",
                    "Designing 3D-Printed Deformation Behaviors Using Spring-Based Structures: An Initial Investigation.",
                    "Evorus: A Crowd-powered Conversational Assistant That Automates Itself Over Time.",
                    "Information Identification Support Method for Areas with Densely Located Signboards.",
                    "EYE DEAR: Smartphone Text Resizing Interaction for the Eye Health of the Presbyopia Population.",
                    "Automatically Visualizing Audio Travel Podcasts.",
                    "Projective Windows: Arranging Windows in Space Using Projective Geometry.",
                    "\"Smellization\" of Warnings against Overuse Power used to Promote Energy Saving Behavior.",
                    "Walk-In Music: Walking Experience with Synchronized Music and Its Effect of Pseudo-gravity.",
                    "Grouping Applications Using Geometrical Information of Applications on Tabletop Systems.",
                    "Non-Linear Editor for Text-Based Screencast.",
                    "Exploring of Simulating Passing through Feeling on the Wrist: Using Thermal Feedback.",
                    "A Digital Pen and Paper Email System for Older Adults.",
                    "Auditory Overview of Web Pages for Screen Reader Users.",
                    "An EEG-based Adaptive Training System for ASD Children.",
                    "KinToon: A Kinect Facial Projector for Communication Enhancement for ASD Children."
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "29th UIST 2016",
        "info": "Tokyo, Japan",
        "venues": [
            {
                "sub_name_abbr": "conf/uist/2016",
                "sub_name": "Proceedings of the 29th Annual Symposium on User Interface Software and Technology, UIST 2016, Tokyo, Japan, October 16-19, 2016.",
                "count": 81,
                "papers": [
                    "Smart Headlight: An Application of Projector-Camera Vision.",
                    "Mobile Fabrication.",
                    "Crowdsourced Fabrication.",
                    "Reprise: A Design Tool for Specifying, Generating, and Customizing 3D Printable Adaptations on Everyday Objects.",
                    "Exploring the Design Space for Energy-Harvesting Situated Displays.",
                    "FaceTouch: Enabling Touch Interaction in Display Fixed UIs for Mobile Virtual Reality.",
                    "Supporting Mobile Sensemaking Through Intentionally Uncertain Highlighting.",
                    "HoloFlex: A Flexible Light-Field Smartphone with a Microlens Array and a P-OLED Touchscreen.",
                    "AuraSense: Enabling Expressive Around-Smartwatch Interactions with Electric Field Sensing.",
                    "ChainFORM: A Linear Integrated Modular Hardware System for Shape Changing Interfaces.",
                    "Zooids: Building Blocks for Swarm User Interfaces.",
                    "Rovables: Miniature On-Body Robots as Mobile Wearables.",
                    "aeroMorph - Heat-sealing Inflatable Shape-change Materials for Interaction Design.",
                    "Beyond Snapping: Persistent, Tweakable Alignment and Distribution with StickyLines.",
                    "Porous Interfaces for Small Screen Multitasking using Finger Identification.",
                    "Mining Controller Inputs to Understand Gameplay.",
                    "TRing: Instant and Customizable Interactions with Objects Using an Embedded Magnet and a Finger-Worn Device.",
                    "Designing a Non-contact Wearable Tactile Display Using Airflows.",
                    "RealPen: Providing Realism in Handwriting Tasks on Touch Surfaces using Auditory-Tactile Feedback.",
                    "Muscle-plotter: An Interactive System based on Electrical Muscle Stimulation that Produces Spatial Output.",
                    "Haptic Learning of Semaphoric Finger Gestures.",
                    "GyroVR: Simulating Inertia in Virtual Reality using Head Worn Flywheels.",
                    "Telescope: Fine-Tuned Discovery of Interactive Web UI Feature Implementation.",
                    "CodeMend: Assisting Interactive Programming with Bimodal Embedding.",
                    "Meta: Enabling Programming Languages to Learn from the Crowd.",
                    "Next-Point Prediction Metrics for Perceived Spatial Errors.",
                    "Wearables as Context for Guiard-abiding Bimanual Touch.",
                    "Gaze and Touch Interaction on Tablets.",
                    "Predicting Finger-Touch Accuracy Based on the Dual Gaussian Distribution Model.",
                    "ViBand: High-Fidelity Bio-Acoustic Sensing Using Commodity Smartwatch Accelerometers.",
                    "proCover: Sensory Augmentation of Prosthetic Limbs Using Smart Textile Covers.",
                    "SleepCoacher: A Personalized Automated Self-Experimentation System for Sleep Recommendations.",
                    "Bootstrapping User-Defined Body Tapping Recognition with Offline-Learned Probabilistic Representation.",
                    "Eviza: A Natural Language Interface for Visual Analysis.",
                    "Semi-Automated SVG Programming via Direct Manipulation.",
                    "Reading and Learning Smartfonts.",
                    "Interactive Volume Segmentation with Threshold Field Painting.",
                    "SkyAnchor: Optical Design for Anchoring Mid-air Images onto Physical Objects.",
                    "Changing the Appearance of Physical Interfaces Through Controlled Transparency.",
                    "JOLED: A Mid-air Display based on Electrostatic Rotation of Levitated Janus Objects.",
                    "LIME: LIquid MEtal Interfaces for Non-Rigid Interaction.",
                    "Phyxel: Realistic Display of Shape and Appearance using Physical Objects with High-speed Pixelated Lighting.",
                    "Private Webmail 2.0: Simple and Easy-to-Use Secure Email.",
                    "CloakingNote: A Novel Desktop Interface for Subtle Writing Using Decoy Texts.",
                    "Mavo: Creating Interactive Data-Driven Web Applications by Authoring HTML.",
                    "QuickCut: An Interactive Tool for Editing Narrated Video.",
                    "Dynamic Authoring of Audio with Linked Scripts.",
                    "VidCrit: Video-based Asynchronous Video Review.",
                    "Metamaterial Mechanisms.",
                    "Digital Gastronomy: Methods & Recipes for Hybrid Cooking.",
                    "A 3D Printer for Interactive Electromagnetic Devices.",
                    "Foundry: Hierarchical Material Design for Multi-Material Fabrication.",
                    "DriftBoard: A Panning-Based Text Entry Technique for Ultra-Small Touchscreens.",
                    "Expressive Keyboards: Enriching Gesture-Typing on Mobile Devices.",
                    "EdgeVib: Effective Alphanumeric Character Output Using a Wrist-Worn Tactile Display.",
                    "On Suggesting Phrases vs. Predicting Words for Mobile Text Composition.",
                    "IdeaHound: Improving Large-scale Collaborative Ideation with Crowd-Powered Real-time Semantic Modeling.",
                    "Boomerang: Rebounding the Consequences of Reputation Feedback on Crowdsourcing Platforms.",
                    "Habitsourcing: Sensing the Environment through Immersive, Habit-Building Experiences.",
                    "VizLens: A Robust and Interactive Screen Reader for Interfaces in the Real World.",
                    "Aesthetic Electronics: Designing, Sketching, and Fabricating Circuits through Digital Exploration.",
                    "The Toastboard: Ubiquitous Instrumentation and Automated Checking of Breadboarded Circuits.",
                    "CircuitStack: Supporting Rapid Prototyping and Evolution of Electronic Circuits.",
                    "Stretchis: Fabricating Highly Stretchable User Interfaces.",
                    "Optical Marionette: Graphical Manipulation of Human's Walking Direction.",
                    "NormalTouch and TextureTouch: High-fidelity 3D Haptic Shape Rendering on Handheld Virtual Reality Controllers.",
                    "Immersive Scuba Diving Simulator Using Virtual Reality.",
                    "Holoportation: Virtual 3D Teleportation in Real-time.",
                    "Energy-Brushes: Interactive Tools for Illustrating Stylized Elemental Dynamics.",
                    "ERICA: Interaction Mining Mobile Apps.",
                    "The Elements of Fashion Style.",
                    "Multi-Device Storyboards for Cinematic Narratives in VR.",
                    "SketchingWithHands: 3D Sketching Handheld Products with First-Person Hand Posture.",
                    "Authoring Illustrations of Human Movements by Iterative Physical Demonstration.",
                    "AggreGaze: Collective Estimation of Audience Attention on Public Displays.",
                    "RadarCat: Radar Categorization for Input & Interaction.",
                    "Advancing Hand Gesture Recognition with High Resolution Electrical Impedance Tomography.",
                    "Interacting with Soli: Exploring Fine-Grained Dynamic Gesture Recognition in the Radio-Frequency Spectrum.",
                    "WristWhirl: One-handed Continuous Smartwatch Input using Wrist Gestures.",
                    "A Rapid Prototyping Approach to Synthetic Data Generation for Improved 2D Gesture Recognition.",
                    "ambient."
                ]
            },
            {
                "sub_name_abbr": "conf/uist/2016a",
                "sub_name": "Proceedings of the 29th Annual Symposium on User Interface Software and Technology, UIST 2016 Adjunct Volume, Tokyo, Japan, October 16 - 19, 2016.",
                "count": 81,
                "papers": [
                    "Computational Design Driven by Aesthetic Preference.",
                    "Promoting Natural Interactions Through Embedded Input Using Novel Sensing Techniques.",
                    "Nomadic Virtual Reality: Exploring New Interaction Concepts for Mobile Virtual Reality Head-Mounted Displays.",
                    "Object-Oriented Interaction: Enabling Direct Physical Manipulation of Abstract Content via Objectification.",
                    "Making Fabrication Real.",
                    "Data-driven Mobile App Design.",
                    "Physiological Signal-Driven Virtual Reality in Social Spaces.",
                    "Asymmetric Design Approach and Collision Avoidance Techniques For Room-scale Multiplayer Virtual Reality.",
                    "Luminescent Tentacles: A Scalable SMA Motion Display.",
                    "Rig Animation with a Tangible and Modular Input Device.",
                    "Watch Commander: A Gesture-based Invocation System for Rectangular Smartwatches using B2B-Swipe.",
                    "MagTacS: Delivering Tactile Sensation over an Object.",
                    "floatio: Floating Tangible User Interface Based on Animacy Perception.",
                    "3D Printed Physical Interfaces that can Extend Touch Devices.",
                    "Thickness Control Technique for Printing Tactile Sheets with Fused Deposition Modeling.",
                    "Sparkle: Towards Haptic Hover-Feedback with Electric Arcs.",
                    "The UIST Video Browser: Creating Shareable Playlists of Video Previews.",
                    "WithYou: An Interactive Shadowing Coach with Speech Recognition.",
                    "Representing Gaze Direction in Video Communication Using Eye-Shaped Display.",
                    "Gushed Diffusers: Fast-moving, Floating, and Lightweight Midair Display.",
                    "SoEs: Attachable Augmented Haptic on Gaming Controller for Immersive Interaction.",
                    "LaserStroke: Mid-air Tactile Experiences on Contours Using Indirect Laser Radiation.",
                    "M.Sketch: Prototyping Tool for Linkage-Based Mechanism Design.",
                    "Depth Based Shadow Pointing Interface for Public Displays.",
                    "A Tangible Interface to Realize Touch Operations on the Face of a Physical Object.",
                    "AmbioTherm: Simulating Ambient Temperatures and Wind Conditions in VR Environments.",
                    "Wrap & Sense: Grasp Capture by a Band Sensor.",
                    "Facial Expression Mapping inside Head Mounted Display by Embedded Optical Sensors.",
                    "An Input Switching Interface Using Carbon Copy Metaphor.",
                    "Designing a Haptic Feedback System for Hearing-Impaired to Experience Tap Dance.",
                    "Ballumiere: Real-Time Tracking and Projection for High-Speed Moving Balls.",
                    "ScalableBody: A Telepresence Robot Supporting Socially Acceptable Interactions and Human Augmentation through Vertical Actuation.",
                    "MlioLight: Multi-Layered Image Overlay using Multiple Flashlight Devices.",
                    "Polyspector™: An Interactive Visualization Platform Optimized for Visual Analysis of Big Data.",
                    "Hand Gesture and On-body Touch Recognition by Active Acoustic Sensing throughout the Human Body.",
                    "Wolverine: A Wearable Haptic Interface for Grasping in VR.",
                    "Phones on Wheels: Exploring Interaction for Smartphones with Kinetic Capabilities.",
                    "Applications of Switchable Permanent Magnetic Actuators in Shape Change and Tactile Display.",
                    "Virtual Sweet: Simulating Sweet Sensation Using Thermal Stimulation on the Tip of the Tongue.",
                    "Fitter: A System for Easily Printing Objects that Fit Real Objects.",
                    "RunPlay: Action Recognition Using Wearable Device Apply on Parkour Game.",
                    "Music Composition with Recommendation.",
                    "waveSense: Ultra Low Power Gesture Sensing Based on Selective Volumetric Illumination.",
                    "Expanding the Field-of-View of Head-Mounted Displays with Peripheral Blurred Images.",
                    "Reconstruction of Scene from Multiple Sketches.",
                    "2.5 Dimensional Panoramic Viewing Technique utilizing a Cylindrical Mirror Widget.",
                    "ExtendedHand on Wheelchair.",
                    "Synesthesia Suit.",
                    "Interaction Technique Using Acoustic Sensing for Different Squeak Sounds Caused by Number of Rubbing Fingers.",
                    "Fluxa: Body Movements as a Social Display.",
                    "WhammyPhone: Exploring Tangible Audio Manipulation Using Bend Input on a Flexible Smartphone.",
                    "UnlimitedHand: Input and Output Hand Gestures with Less Calibration Time.",
                    "Orchestrated Informal Care Coordination: Designing a Connected Network of Tools in Support of Collective Care Activities for Informal Caregivers.",
                    "Switch++: An Output Device of the Switches by the Finger Gestures.",
                    "Transparent Reality: Using Eye Gaze Focus Depth as Interaction Modality.",
                    "Toward a Compact Device to Interact with a Capacitive Touch Screen.",
                    "Initial Trials of ofxEpilog: From Real Time Operation to Dynamic Focus of Epilog Laser Cutter.",
                    "Design and Evaluation of EdgeWrite Alphabets for Round Face Smartwatches.",
                    "Touchscreen Overlay Augmented with the Stick-Slip Phenomenon to Generate Kinetic Energy.",
                    "Histogram: Spatiotemporal Photo-Displaying Interface.",
                    "AquaCAVE: Augmented Swimming Environment with Immersive Surround-Screen Virtual Reality.",
                    "Partial Bookmarking: A Structure-independent Mechanism of Transclusion for a Portion of any Web Page.",
                    "Thermocons: Evaluating the Thermal Haptic Perception of the Forehead.",
                    "Sidetap & Slingshot Gestures on Unmodified Smartwatches.",
                    "Developing fMRI-Compatible Interaction Systems through Air Pressure.",
                    "OmniEyeball: Spherical Display Embedded With Omnidirectional Camera Using Dynamic Spherical Mapping.",
                    "Estimating Contact Force of Fingertip and Providing Tactile Feedback Simultaneously.",
                    "Activity-Aware Video Stabilization for BallCam.",
                    "Study on Control Method of Virtual Food Texture by Electrical Muscle Stimulation.",
                    "Uniformity Based Haptic Alert Network.",
                    "Flying User Interface.",
                    "Prevention of Unintentional Input While Using Wrist Rotation for Device Configuration.",
                    "Peripersonal Space in Virtual Reality: Navigating 3D Space with Different Perspectives.",
                    "A Novel Real Time Monitor System of 3D Printing Layers for Better Slicing Parameter Setting.",
                    "Hilbert Curves: A Tool for Resolution Independent Haptic Texture.",
                    "Friend*Chip: A Bracelet with Digital Pet for Socially Inclusive Games for Children.",
                    "NeverMind: Using Augmented Reality for Memorization.",
                    "Analysis of Sequential Tasks in Use Context of Mobile Apps.",
                    "Towards Understanding Collaboration around Interactive Surfaces: Exploring Joint Visual Attention.",
                    "Resolving Spatial Variation And Allowing Spectator Participation In Multiplayer VR.",
                    "OctaRing: Examining Pressure-Sensitive Multi-Touch Input on a Finger Ring Device."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "28th UIST 2015",
        "info": "Charlotte, NC, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/uist/2015",
                "sub_name": "Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology, UIST 2015, Charlotte, NC, USA, November 8-11, 2015.",
                "count": 72,
                "papers": [
                    "Extreme Computational Photography.",
                    "GelTouch: Localized Tactile Feedback Through Thin, Programmable Gel.",
                    "Impacto: Simulating Physical Impact by Combining Tactile Stimulation with Electrical Muscle Stimulation.",
                    "Tactile Animation by Direct Manipulation of Grid Displays.",
                    "Improving Haptic Feedback on Wearable Devices through Accelerometer Measurements.",
                    "cLuster: Smart Clustering of Free-Hand Sketches on Large Interactive Surfaces.",
                    "GravitySpot: Guiding Users in Front of Public Displays Using On-Screen Visual Cues.",
                    "Tiltcasting: 3D Interaction on Large Displays using a Mobile Device.",
                    "Gunslinger: Subtle Arms-down Mid-air Interaction.",
                    "Encore: 3D Printed Augmentation of Everyday Objects with Printed-Over, Affixed and Interlocked Attachments.",
                    "Patching Physical Objects.",
                    "ReForm: Integrating Physical and Digital Design through Bidirectional Fabrication.",
                    "Makers' Marks: Physical Markup for Designing and Fabricating Functional Objects.",
                    "Procedural Modeling Using Autoencoder Networks.",
                    "SHOCam: A 3D Orbiting Algorithm.",
                    "FoveAR: Combining an Optically See-Through Near-Eye Display with Projector-Based Spatial Augmented Reality.",
                    "Projectibles: Optimizing Surface Color For Projection.",
                    "Tracko: Ad-hoc Mobile 3D Tracking Using Bluetooth Low Energy and Inaudible Signals for Cross-Device Interaction.",
                    "EM-Sense: Touch Recognition of Uninstrumented, Electrical and Electromechanical Objects.",
                    "Tomo: Wearable, Low-Cost Electrical Impedance Tomography for Hand Gesture Recognition.",
                    "Corona: Positioning Adjacent Device with Asymmetric Bluetooth Low Energy RSSI Distributions.",
                    "SceneSkim: Searching and Browsing Movies Using Synchronized Captions, Scripts and Plot Summaries.",
                    "Capture-Time Feedback for Recording Scripted Narration.",
                    "Improving Automated Email Tagging with Implicit Feedback.",
                    "Codo: Fundraising with Conditional Donations.",
                    "Foldio: Digital Fabrication of Interactive and Shape-Changing Objects With Foldable Printed Electronics.",
                    "uniMorph: Fabricating Thin Film Composites for Shape-Changing Interfaces.",
                    "Printem: Instant Printed Circuit Boards with Standard Office Printers & Inks.",
                    "Capricate: A Fabrication Pipeline to Design and 3D Print Capacitive Touch Sensors for Interactive Objects.",
                    "Explaining Visual Changes in Web Interfaces.",
                    "Unravel: Rapid Web Application Reverse Engineering via Interaction Recording, Source Tracing, and Library Detection.",
                    "Webstrates: Shareable Dynamic Media.",
                    "User Interaction Models for Disambiguation in Programming by Example.",
                    "Biometric Touch Sensing: Seamlessly Augmenting Each Touch with Continuous Authentication.",
                    "Push-Push: A Drag-like Operation Overlapped with a Page Transition Operation on Touch Interfaces.",
                    "Pin-and-Cross: A Unimanual Multitouch Technique Combining Static Touches with Crossing Selection.",
                    "LineFORM: Actuated Curve Interfaces for Display, Interaction, and Constraint.",
                    "Kinetic Blocks: Actuated Constructive Assembly for Interaction and Display.",
                    "PERCs: Persistently Trackable Tangibles on Capacitive Multi-Touch Displays.",
                    "SmartTokens: Embedding Motion and Grip Sensing in Small Tangible Objects.",
                    "Self-Calibrating Head-Mounted Eye Trackers Using Egocentric Visual Saliency.",
                    "Gaze-Shifting: Direct-Indirect Input with Pen and Touch Modulated by Gaze.",
                    "Gaze vs. Mouse: A Fast and Accurate Gaze-Only Click Alternative.",
                    "GazeProjector: Accurate Gaze Estimation and Seamless Gaze Interaction Across Multiple Displays.",
                    "Virtual Replicas for Remote Assistance in Virtual and Augmented Reality.",
                    "TurkDeck: Physical Virtual Reality Based on People.",
                    "Protopiper: Physically Sketching Room-Sized Objects at Actual Scale.",
                    "RevoMaker: Enabling Multi-directional and Functionally-embedded 3D printing using a Rotational Cuboidal Platform.",
                    "NanoStylus: Enhancing Input on Ultra-Small Displays with a Finger-Mounted Stylus.",
                    "Orbits: Gaze Interaction for Smart Watches using Smooth Pursuit Eye Movements.",
                    "Candid Interaction: Revealing Hidden Mobile and Wearable Computing Activities.",
                    "Sensing Tablet Grasp + Micro-mobility for Active Reading.",
                    "DataTone: Managing Ambiguity in Natural Language Interfaces for Data Visualization.",
                    "On Sounder Ground: CAAT, a Viable Widget for Affective Reaction Assessment.",
                    "Anger-based BCI Using fNIRS Neurofeedback.",
                    "Leveraging Dual-Observable Input for Fine-Grained Thumb Interaction Using Forearm EMG.",
                    "Improving Virtual Keyboards When All Finger Positions Are Known.",
                    "ATK: Enabling Ten-Finger Freehand Typing in Air Based on 3D Hand Tracking Data.",
                    "CyclopsRing: Enabling Whole-Hand and Context-Aware Interactions Through a Fisheye Ring.",
                    "BackHand: Sensing Hand Gestures via Back of the Hand.",
                    "MoveableMaker: Facilitating the Design, Generation, and Assembly of Moveable Papercraft.",
                    "LaserStacker: Fabricating 3D Objects by Laser Cutting and Welding.",
                    "HapticPrint: Designing Feel Aesthetics for Digital Fabrication.",
                    "3D Printed Hair: Fused Deposition Modeling of Soft Strands, Fibers, and Bristles.",
                    "Codeopticon: Real-Time, One-To-Many Human Tutoring for Computer Programming.",
                    "Foobaz: Variable Name Feedback for Student Code at Scale.",
                    "These Aren't the Commands You're Looking For: Addressing False Feedforward in Feature-Rich Software.",
                    "Looking through the Eye of the Mouse: A Simple Method for Measuring End-to-end Latency using an Optical Mouse.",
                    "Joint 5D Pen Input for Light Field Displays.",
                    "SensorTape: Modular and Programmable 3D-Aware Dense Sensor Network on a Tape.",
                    "FlexiBend: Enabling Interactivity of Multi-Part, Deformable Fabrications Using Single Shape-Sensing Strip.",
                    "Machine Intelligence and Human Intelligence."
                ]
            },
            {
                "sub_name_abbr": "conf/uist/2015a",
                "sub_name": "Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology, UIST 2015 Adjunct Volume, Charlotte, NC, USA, November 8-11, 2015.",
                "count": 44,
                "papers": [
                    "Responsive Facilitation of Experiential Learning Through Access to Attentional State.",
                    "Reconfiguring and Fabricating Special-Purpose Tangible Controls.",
                    "Supporting Collaborative Innovation at Scale.",
                    "Wait-Learning: Leveraging Wait Time for Education.",
                    "From Papercraft to Paper Mechatronics: Exploring a New Medium and Developing a Computational Design Tool.",
                    "Enriching Online Classroom Communication with Collaborative Multi-Modal Annotations.",
                    "Using Personal Devices to Facilitate Multi-user Interaction with Large Display Walls.",
                    "Graphical Passwords for Older Computer Users.",
                    "Scope+: A Stereoscopic Video See-Through Augmented Reality Microscope.",
                    "Creating a Mobile Head-mounted Display with Proprietary Controllers for Interactive Virtual Reality Content.",
                    "Spotlights: Facilitating Skim Reading with Attention-Optimized Highlights.",
                    "WearWrite: Orchestrating the Crowd to Complete Complex Tasks from Wearables.",
                    "Zensei: Augmenting Objects with Effortless User Recognition Capabilities through Bioimpedance Sensing.",
                    "Form Follows Function(): An IDE to Create Laser-cut Interfaces and Microcontroller Programs from Single Code Base.",
                    "RFlow: User Interaction Beyond Walls.",
                    "MetaSpace: Full-body Tracking for Immersive Multiperson Virtual Reality.",
                    "GaussStarter: Prototyping Analog Hall-Sensor Grids with Breadboards.",
                    "Enhanced Motion Robustness from ToF-based Depth Sensing Cameras.",
                    "Workload Assessment with eye Movement Monitoring Aided by Non-invasive and Unobtrusive Micro-fabricated Optical Sensors.",
                    "Multi-Modal Peer Discussion with RichReview on edX.",
                    "BitDrones: Towards Levitating Programmable Matter Using Interactive 3D Quadcopter Displays.",
                    "Methods of 3D Printing Micro-pillar Structures on Surfaces.",
                    "Dranimate: Rapid Real-time Gestural Rigging and Control of Animation.",
                    "Elastic Cursor and Elastic Edge: Applying Simulated Resistance to Interface Elements for Seamless Edge-scroll.",
                    "Hand Biometrics Using Capacitive Touchscreens.",
                    "A Study on Grasp Recognition Independent of Users' Situations Using Built-in Sensors of Smartphones.",
                    "TMotion: Embedded 3D Mobile Input using Magnetic Sensing Technique.",
                    "EMG Sensor-based Two-Hand Smart Watch Interaction.",
                    "Investigating the \"Wisdom of Crowds\" at Scale.",
                    "Effective Interactions for Personalizing Spatial Visualizations of Collections.",
                    "Fix and Slide: Caret Navigation with Movable Background.",
                    "LegionTools: A Toolkit + UI for Recruiting and Routing Crowds to Synchronous Real-Time Tasks.",
                    "KickSoul: A Wearable System for Feet Interactions with Digital Devices.",
                    "Capacitive Blocks: A Block System that Connects the Physical with the Virtual using Changes of Capacitance.",
                    "Haptic-enabled Active Bone-Conducted Sound Sensing.",
                    "Perspective-dependent Indirect Touch Input for 3D Polygon Extrusion.",
                    "FoldMecha: Design for Linkage-Based Paper Toys.",
                    "Juggling the Effects of Latency: Software Approaches to Minimizing Latency in Dynamic Projector-Camera Systems.",
                    "Color Sommelier: Interactive Color Recommendation System Based on Community-Generated Color Palettes.",
                    "AirFlip-Undo: Quick Undo using a Double Crossing In-Air Gesture in Hover Zone.",
                    "Remot-IO: a System for Reaching into the Environment of a Remote Collaborator.",
                    "Daemo: A Self-Governed Crowdsourcing Marketplace.",
                    "MagPad: A Near Surface Augmented Reading System for Physical Paper and Smartphone Coupling.",
                    "Adding Body Motion and Intonation to Instant Messaging with Animation."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "27th UIST 2014",
        "info": "Honolulu, HI, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/uist/2014",
                "sub_name": "The 27th Annual ACM Symposium on User Interface Software and Technology, UIST '14, Honolulu, HI, USA, October 5-8, 2014.",
                "count": 76,
                "papers": [
                    "Designing the user in user interfaces.",
                    "A series of tubes: adding interactivity to 3D prints using internal pipes.",
                    "FlatFitFab: interactive modeling with planar sections.",
                    "Paper3D: bringing casual 3D modeling to a multi-touch interface.",
                    "Cheaper by the dozen: group annotation of 3D data.",
                    "Microtask programming: building software with a crowd.",
                    "Situated crowdsourcing using a market model.",
                    "Crowd-powered parameter analysis for visual design exploration.",
                    "Expert crowdsourcing with flash teams.",
                    "Creating interactive web data applications with spreadsheets.",
                    "Spreadsheet driven web applications.",
                    "AttachMate: highlight extraction from email attachments.",
                    "Making the web easier to see with opportunistic accessibility improvement.",
                    "Content-aware kinetic scrolling for supporting web page navigation.",
                    "FlexSense: a transparent self-sensing deformable surface.",
                    "Hover Pad: interacting with autonomous and self-actuated displays in space.",
                    "Graffiti fur: turning your carpet into a computer display.",
                    "LightRing: always-available 2D input on any surface.",
                    "WristFlex: low-power gesture input with wrist-worn pressure sensors.",
                    "CommandSpace: modeling the relationships between tasks, descriptions and features.",
                    "Predictive translation memory: a mixed-initiative system for human language translation.",
                    "Tohme: detecting curb ramps in google street view using crowdsourcing, computer vision, and machine learning.",
                    "Zero-latency tapping: using hover information to predict touch locations and eliminate touchdown latency.",
                    "Detecting tapping motion on the side of mobile devices by probabilistically combining hand postures.",
                    "Prefab layers and prefab annotations: extensible pixel-based interpretation of graphical interfaces.",
                    "Programming by manipulation for layout.",
                    "Global beautification of layouts with interactive ambiguity resolution.",
                    "Deconstructing and restyling D3 visualizations.",
                    "InterState: a language and environment for expressing interface behavior.",
                    "WirePrint: 3D printed previews for fast prototyping.",
                    "PrintScreen: fabricating highly customizable thin-film touch-displays.",
                    "ShrinkyCircuits: sketching, shrinking, and formgiving for electronic circuits.",
                    "Teegi: tangible EEG interface.",
                    "Individual variation in susceptibility to cybersickness.",
                    "In-air gestures around unmodified mobile devices.",
                    "ParaFrustum: visualization techniques for guiding a user to a constrained set of viewing positions and orientations.",
                    "Through the combining glass.",
                    "Loupe: a handheld near-eye display.",
                    "High rate, low-latency multi-touch sensing with simultaneous orthogonal multiplexing.",
                    "GaussStones: shielded magnetic tangibles for multi-token interactions on portable displays.",
                    "Tag system with low-powered tag and depth sensing camera.",
                    "Trampoline: a double-sided elastic touch device for creating reliefs.",
                    "Skin buttons: cheap, small, low-powered and clickable fixed-icon laser projectors.",
                    "Kitty: sketching dynamic and interactive illustrations.",
                    "PortraitSketch: face sketching assistance for novices.",
                    "Painting with Bob: assisted creativity for novices.",
                    "InterTwine: creating interapplication information scent to support coordinated use of software.",
                    "Generating emotionally relevant musical scores for audio stories.",
                    "World-stabilized annotations and virtual scene navigation for remote collaboration.",
                    "Physical telepresence: shape capture and display for embodied, computer-mediated remote collaboration.",
                    "3D-board: a whole-body remote collaborative whiteboard.",
                    "RichReview: blending ink, speech, and gesture to support collaborative document review.",
                    "Sensory triptych: here, near, out there.",
                    "Going to the dogs: towards an interactive touchscreen interface for working dogs.",
                    "Gaze-touch: combining gaze with multi-touch for interaction on the same surface.",
                    "Air+touch: interweaving touch & in-air gestures.",
                    "SideSwipe: detecting in-air gestures around mobile devices using actual GSM signal.",
                    "Vibkinesis: notification by direct tap and 'dying message' using vibronic movement controllable smartphones.",
                    "Video lens: rapid playback and exploration of large video collections and associated metadata.",
                    "Glance: rapidly coding behavioral video with the crowd.",
                    "Data-driven interaction techniques for improving navigation of educational videos.",
                    "Video digests: a browsable, skimmable format for informational lecture videos.",
                    "Brain-based target expansion.",
                    "Pinch-to-zoom-plus: an enhanced pinch-to-zoom that reduces clutching and panning.",
                    "Sensing techniques for tablet+stylus interaction.",
                    "Swipeboard: a text entry technique for ultra-small interfaces that supports novice to expert transitions.",
                    "Improvements to keyboard optimization with integer programming.",
                    "Designer's augmented reality toolkit, ten years later: implications for new media authoring tools.",
                    "RoomAlive: magical experiences enabled by scalable, adaptive projector-camera units.",
                    "Dyadic projected spatial augmented reality.",
                    "Tracs: transparency-control for see-through displays.",
                    "HaptoMime: mid-air haptic interaction with a floating virtual screen.",
                    "Declarative interaction design for data visualization.",
                    "Laevo: a temporal desktop interface for integrated knowledge work.",
                    "Reflection: enabling event prediction as an on-device service for mobile interaction.",
                    "Humane representation of thought: a trail map for the 21st century."
                ]
            },
            {
                "sub_name_abbr": "conf/uist/2014a",
                "sub_name": "Proceedings of the adjunct publication of the 27th annual ACM symposium on User interface software and technology, UIST 2014 Adjunct Volume, Honolulu, Hawaii, USA, October 5-8, 2014.",
                "count": 57,
                "papers": [
                    "Scalable methods to collect and visualize sidewalk accessibility data for people with mobility impairments.",
                    "Depth based interaction and field of view manipulation for augmented reality.",
                    "Leveraging physical human actions in large interaction spaces.",
                    "Using brain-computer interfaces for implicit input.",
                    "Interacting with massive numbers of student solutions.",
                    "Powering interactive intelligent systems with the crowd.",
                    "Making distance matter: leveraging scale and diversity in massive online classes.",
                    "Matter matters: offloading machine computation to material computation for shape changing interfaces.",
                    "A three-step interaction pattern for improving discoverability in finger identification techniques.",
                    "A rapid prototyping toolkit for touch sensitive objects using active acoustic sensing.",
                    "Video text retouch: retouching text in videos with direct manipulation.",
                    "Inkantatory paper: dynamically color-changing prints with multiple functional inks.",
                    "StackBlock: block-shaped interface for flexible stacking.",
                    "A pen-based device for sketching with multi-directional traction forces.",
                    "Tangible and modular input device for character articulation.",
                    "Digital flavor interface.",
                    "Interactive exploration and selection in volumetric datasets with color tunneling.",
                    "FeelCraft: crafting tactile experiences for media using a feel effect library.",
                    "SikuliBot: automating physical interface using images.",
                    "THAW: tangible interaction with see-through augmentation for smartphones on computer screens.",
                    "Projectron mapping: the exercise and extension of augmented workspaces for learning electronic modeling through projection mapping.",
                    "Extension sticker: a method for transferring external touch input using a striped pattern sticker.",
                    "LiveSphere: immersive experience sharing with 360 degrees head-mounted cameras.",
                    "Nishanchi: CAD for hand-fabrication.",
                    "Enhancing virtual immersion through tactile feedback.",
                    "Ubisonus: spatial freeform interactive speakers.",
                    "Eyes-free text entry interface based on contact area for people with visual impairment.",
                    "Third surface: an augmented world wide web for the physical world.",
                    "Tactile cue presentation for vocabulary learning with keyboard.",
                    "Trainer: a motion-based interactive game for balance rehabilitation training.",
                    "SenseGlass: using google glass to sense daily emotions.",
                    "A text entry technique for wrist-worn watches with tiny touchscreens.",
                    "Understanding the design of a flying jogging companion.",
                    "AirPincher: a handheld device for recognizing delicate mid-air hand gestures.",
                    "Contelli: a user-controllable intelligent keyboard for watch-sized small touchscreens.",
                    "G-raffe: an elevating tangible block supporting 2.5D interaction in a tabletop computing environment.",
                    "Building implicit interfaces for wearable computers with physiological inputs: zero shutter camera and phylter.",
                    "PoliTel: mobile remote presence system that autonomously adjusts the interpersonal distance.",
                    "Riding the plane: bimanual, desktop 3D manipulation.",
                    "Hairlytop interface: a basic tool for active interfacing.",
                    "Speeda: adaptive speed-up for lecture videos.",
                    "Structured handoffs in expert crowdsourcing improve communication and work output.",
                    "LightWeight: wearable resistance visualizer for rehabilitation.",
                    "Push-push: a two-point touchscreen operation utilizing the pressed state and the hover state.",
                    "Slack-scroll: sharing sliding operations among scrolling and other GUI functions.",
                    "FlickBoard: enabling trackpad interaction with automatic mode switching on a capacitive-sensing keyboard.",
                    "Traceband: locating missing items by visual remembrance.",
                    "Tangential force input for touch panels using bezel-aligned elastic pillars and a transparent sheet.",
                    "Ethereal: a toolkit for spatially adaptive augmented reality content.",
                    "Reaching targets on discomfort region using tilting gesture.",
                    "Integrating optical waveguides for display and sensing on pneumatic soft shape changing interfaces.",
                    "Towards responsive retargeting of existing websites.",
                    "bioPrint: an automatic deposition system for bacteria spore actuators.",
                    "FatBelt: motivating behavior change through isomorphic feedback.",
                    "M-gesture: geometric gesture authoring framework for multi-device gestures using wearable devices.",
                    "Eugenie: gestural and tangible interaction with active tokens for bio-design.",
                    "OverCode: visualizing variation in student solutions to programming problems at scale."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "26th UIST 2013",
        "info": "St. Andrews, UK",
        "venues": [
            {
                "sub_name_abbr": "conf/uist/2013",
                "sub_name": "The 26th Annual ACM Symposium on User Interface Software and Technology, UIST'13, St. Andrews, United Kingdom, October 8-11, 2013.",
                "count": 63,
                "papers": [
                    "Humans and the coming machine revolution.",
                    "Lumitrack: low cost, high precision, high speed tracking with projected m-sequences.",
                    "PneUI: pneumatically actuated soft composite materials for shape changing interfaces.",
                    "Paper generators: harvesting energy from touching, rubbing and sliding.",
                    "Touch & activate: adding interactivity to existing objects using active acoustic sensing.",
                    "Fiberio: a touchscreen that senses fingerprints.",
                    "Bayesian touch: a statistical criterion of target selection with finger touch.",
                    "Touch scrolling transfer functions.",
                    "Controlling widgets with one power-up button.",
                    "Improving structured data entry on mobile devices.",
                    "DigiTaps: eyes-free number entry on touchscreens with minimal audio feedback.",
                    "Haptic feedback design for a virtual button along force-displacement curves.",
                    "Transmogrification: causal manipulation of visualizations.",
                    "TextTearing: opening white space for digital ink annotation.",
                    "Content-based tools for editing audio stories.",
                    "Panopticon: a parallel video overview system.",
                    "Video collections in panoramic contexts.",
                    "DemoCut: generating concise instructional videos for physical demonstrations.",
                    "Chorus: a crowd-powered conversational assistant.",
                    "CrowdLearner: rapidly creating mobile recognizers using crowdsourcing.",
                    "Cobi: a community-informed conference scheduling tool.",
                    "The drawing assistant: automated drawing guidance and feedback from photographs.",
                    "Attribit: content creation with semantic attributes.",
                    "dePEDd: augmented handwriting system using ferromagnetism of a ballpoint pen.",
                    "Mirage: exploring interaction modalities using off-body static electric field sensing.",
                    "StickEar: making everyday objects respond to sound.",
                    "Mime: compact, low power 3D gesture sensing for interaction with head mounted displays.",
                    "uTrack: 3D input using two magnetic sensors.",
                    "A cuttable multi-touch sensor.",
                    "FingerPad: private and subtle interaction using fingertips.",
                    "Pursuit calibration: making gaze calibration less tedious and more flexible.",
                    "Gaze locking: passive eye contact detection for human-object interaction.",
                    "Open project: a lightweight framework for remote sharing of mobile applications.",
                    "Surround-see: enabling peripheral vision on smartphones during active use.",
                    "GIST: a gestural interface for remote nonvisual spatial perception.",
                    "YouMove: enhancing movement training with an augmented reality mirror.",
                    "Skillometers: reflective widgets that motivate and help users to improve performance.",
                    "MenuOptimizer: interactive optimization of menu systems.",
                    "The auckland layout editor: an improved GUI layout specification process.",
                    "SeeSS: seeing what i broke - visualizing change impact of cascading style sheets (css).",
                    "Capturing on site laser annotations with smartphones to document construction work.",
                    "Crowd-scale interactive formal reasoning and analytics.",
                    "A tongue training system for children with down syndrome.",
                    "A mixed-initiative tool for designing level progressions in games.",
                    "BodyAvatar: creating freeform 3D avatars using first-person body gestures.",
                    "ViziCal: accurate energy expenditure prediction for playing exergames.",
                    "Imaginary reality gaming: ball games without a ball.",
                    "MagGetz: customizable passive tangible controllers on and around conventional mobile devices.",
                    "inFORM: dynamic physical affordances and constraints through shape and object actuation.",
                    "Traxion: a tactile interaction device with virtual force sensation.",
                    "Human-computer interaction for hybrid carving.",
                    "PacCAM: material capture and interactive 2D packing for efficient material usage on CNC cutting machines.",
                    "Sauron: embedded single-camera sensing of printed physical user interfaces.",
                    "PAPILLON: designing curved display surfaces with printed optics.",
                    "The dog programming language.",
                    "Interactive record/replay for web application debugging.",
                    "Authoring multi-stage code examples with editable code histories.",
                    "A colorful approach to text processing by example.",
                    "UltraHaptics: multi-point mid-air haptic feedback for touch surfaces.",
                    "Good vibrations: an evaluation of vibrotactile impedance matching for low power wearable applications.",
                    "The skweezee system: enabling the design and the programming of squeeze interactions.",
                    "Tactile rendering of 3D features on touch surfaces.",
                    "SenSkin: adapting skin as a soft interface."
                ]
            },
            {
                "sub_name_abbr": "conf/uist/2013a",
                "sub_name": "The 26th Annual ACM Symposium on User Interface Software and Technology, UIST'13, St. Andrews, United Kingdom, October 8-11, 2013 - Adjunct Volume.",
                "count": 49,
                "papers": [
                    "PUCs: detecting transparent, passive untouched capacitive widgets on unmodified multi-touch displays.",
                    "The nudging technique: input method without fine-grained pointing by pushing a segment.",
                    "QOOK: a new physical-virtual coupling experience for active reading.",
                    "Surface haptic interactions with a TPad tablet.",
                    "Physink: sketching physical behavior.",
                    "Foreign manga reader: learn grammar and pronunciation while reading comics.",
                    "Inkjet-printed conductive patterns for physical manipulation of audio signals.",
                    "Multi-touch gesture recognition by single photoreflector.",
                    "Flexkit: a rapid prototyping platform for flexible displays.",
                    "BoardLab: PCB as an interface to EDA software.",
                    "Glassified: an augmented ruler based on a transparent display for real-time interactions with paper.",
                    "FlexStroke: a jamming brush tip simulating multiple painting tools on digital platform.",
                    "AIRREAL: tactile interactive experiences in free air.",
                    "Ambient surface: enhancing interface capabilities of mobile objects aided by ambient environment.",
                    "Pixel-based reverse engineering of graphical interfaces.",
                    "Augmenting the input space of portable displays using add-on hall-sensor grid.",
                    "Cross-device eye-based interaction.",
                    "Enabling an ecosystem of personal behavioral data.",
                    "Exploring back-of-device interaction.",
                    "Sensor design and interaction techniques for gestural input to smart glasses and mobile devices.",
                    "Identifying emergent behaviours from longitudinal web use.",
                    "Integrated visual representations for programming with real-world input and output.",
                    "A cluster information navigate method by gaze tracking.",
                    "NailSense: fingertip force as a new input modality.",
                    "Multi-perspective multi-layer interaction on mobile device.",
                    "A touchless passive infrared gesture sensor.",
                    "DDMixer2.5D: drag and drop to mix 2.5D video objects.",
                    "Shape changing device for notification.",
                    "BitWear: a platform for small, connected, interactive devices.",
                    "Hanzi Lamp: an intelligent guide interface for Chinese character learning.",
                    "Detecting student frustration based on handwriting behavior.",
                    "eyeCan: affordable and versatile gaze interaction.",
                    "Augmenting braille input through multitouch feedback.",
                    "H-Studio: an authoring tool for adding haptic and motion effects to audiovisual content.",
                    "WebNexter: dynamic guided tours for screen readers.",
                    "An assembly of soft actuators for an organic user interface.",
                    "Crowdboard: an augmented whiteboard to support large-scale co-design.",
                    "Ta-Tap: consecutive distant tap operations for one-handed touch screen use.",
                    "Visimu: a game for music color label collection.",
                    "User created tangible controls using ForceForm: a dynamically deformable interactive surface.",
                    "Asymmetric cores for low power user interface systems.",
                    "Visualizing web browsing history with barcode chart.",
                    "Wheels in motion: inertia sensing in roller derby.",
                    "LivingClay: particle actuation to control display volume and stiffness.",
                    "Brainstorm, define, prototype: timing constraints to balance appropriate and novel design.",
                    "FingerSkate: making multi-touch operations less constrained and more continuous.",
                    "Obake: interactions on a 2.5D elastic display.",
                    "BackTap: robust four-point tapping on the back of an off-the-shelf smartphone.",
                    "Haptic props: semi-actuated tangible props for haptic interaction on the surface."
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "25th UIST 2012",
        "info": "Cambridge, MA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/uist/2012",
                "sub_name": "The 25th Annual ACM Symposium on User Interface Software and Technology, UIST '12, Cambridge, MA, USA, October 7-10, 2012.",
                "count": 63,
                "papers": [
                    "What art can tell us about the brain.",
                    "RevMiner: an extractive interface for navigating reviews on a smartphone.",
                    "Cross-device interaction via micro-mobility and f-formations.",
                    "Real-time captioning by groups of non-experts.",
                    "Carpus: a non-intrusive user identification technique for interactive surfaces.",
                    "Low-cost audience polling using computer vision.",
                    "CrowdScape: interactively visualizing user behavior and output.",
                    "Learning design patterns with bayesian grammar induction.",
                    "Adding structured data in unstructured web chat conversation.",
                    "Waken: reverse engineering usage information and interface structure from software videos.",
                    "MixT: automatic generation of step-by-step mixed media tutorials.",
                    "GamiCAD: a gamified tutorial system for first time autocad users.",
                    "Tutorial-based interfaces for cloud-enabled applications.",
                    "Facet: a multi-segment wrist worn system.",
                    "iRing: intelligent ring using infrared reflection.",
                    "Bimanual gesture keyboard.",
                    "Magic finger: always-available input through finger instrumentation.",
                    "YourGloves, hothands and hotmits: devices to hold hands at a distance.",
                    "Digits: freehand 3D interactions anywhere using a wrist-worn gloveless sensor.",
                    "Clui: a platform for handles to rich objects.",
                    "DejaVu: integrated support for developing interactive camera-based programs.",
                    "Homework: putting interaction into the infrastructure.",
                    "DataPlay: interactive tweaking and example-driven correction of graphical database queries.",
                    "SnipMatch: using source code context to enhance snippet retrieval and parameterization.",
                    "ConstraintJS: programming interactive behaviors for the web by integrating constraints and states.",
                    "User interface toolkit mechanisms for securing interface elements.",
                    "Cliplets: juxtaposing still and dynamic imagery.",
                    "JellyLens: content-aware adaptive lenses.",
                    "PiVOT: personalized view-overlays for tabletops.",
                    "Histomages: fully synchronized views for image editing.",
                    "Sketch-editing games: human-machine communication, game theory and applications.",
                    "Interpreting strokes on paper with a mobile assistant.",
                    "High-performance pen + touch modality interactions: a real-time strategy game eSports context.",
                    "GaussSense: attachable stylus sensing using magnetic sensor grid.",
                    "FlexAura: a flexible near-surface range sensor.",
                    "PhantomPen: virtualization of pen head for digital drawing free from pen occlusion & visual parallax.",
                    "Exposing and understanding scrolling transfer functions.",
                    "Giving a hand to the eyes: leveraging input accuracy for subpixel interaction.",
                    "UnderScore: musical underlays for audio stories.",
                    "Accessible skimming: faster screen reading of web pages.",
                    "PICOntrol: using a handheld projector for direct control of physical devices through visible light.",
                    "DuploTrack: a real-time system for authoring and guiding duplo block assembly.",
                    "Capturing indoor scenes with smartphones.",
                    "Steerable augmented reality with the beamatron.",
                    "3D puppetry: a kinect-based interface for 3D animation.",
                    "KinÊtre: animating the world with the human body.",
                    "Dynamic tactile guidance for visual search tasks.",
                    "Designing for low-latency direct-touch input.",
                    "A user-specific machine learning approach for improving touch accuracy on mobile devices.",
                    "Proton++: a customizable declarative multitouch framework.",
                    "Extended multitouch: recovering touch posture and differentiating users using a depth camera.",
                    "FlowBlocks: a multi-touch ui for crowd interaction.",
                    "PyzoFlex: printed piezoelectric pressure sensing foil.",
                    "Jamming user interfaces: programmable particle stiffness and sensing for malleable and shape-changing devices.",
                    "A thin stretchable interface for tangential force measurement.",
                    "Capacitive fingerprinting: exploring user differentiation by sensing electrical properties of the human body.",
                    "GripSense: using built-in sensors to detect hand posture and pressure on commodity mobile phones.",
                    "Pressages: augmenting phone calls with non-verbal messages.",
                    "Acoustic barcodes: passive, durable and inexpensive notched identification tags.",
                    "PICL: portable in-circuit learner.",
                    "Midas: fabricating custom capacitive touch sensors to prototype interactive objects.",
                    "Printed optics: 3D printing of embedded optical elements for interactive devices.",
                    "Interactive construction: interactive fabrication of functional mechanical devices."
                ]
            },
            {
                "sub_name_abbr": "conf/uist/2012a",
                "sub_name": "The 25th Annual ACM Symposium on User Interface Software and Technology, UIST '12, Cambridge, MA, USA, October 7-10, 2012 - Adjunct Volume.",
                "count": 43,
                "papers": [
                    "Needle user interface: a sewing interface using layered conductive fabrics.",
                    "The FreeD: a handheld digital milling device for craft and fabrication.",
                    "Sawtooth planar waves for haptic feedback.",
                    "Touch sensing by partial shadowing of PV module.",
                    "Spatial augmented reality for physical drawing.",
                    "Pebbles: an interactive configuration tool for indoor robot navigation.",
                    "TouchCast: an on-line platform for creation and sharing of tactile content based on tactile copy & paste.",
                    "iRotate grasp: automatic screen rotation based on grasp of mobile devices.",
                    "Enjoying virtual handcrafting with ToolDevice.",
                    "Elastic scroll for multi-focus interactions.",
                    "SlickFeel: sliding and clicking haptic feedback on a touchscreen.",
                    "Point and share: from paper to whiteboard.",
                    "Speaking with the crowd.",
                    "Closing the loop between intentions and actions.",
                    "Machine learning models for uncertain interaction.",
                    "Towards document engineering on pen and touch-operated interactive tabletops.",
                    "Interactions speak louder than words: shared user models and adaptive interfaces.",
                    "Spatial augmented reality to enhance physical artistic creation.",
                    "Medical operating documents: dynamic checklists improve crisis attention.",
                    "Data-driven interactions for web design.",
                    "An interface agent for non-visual, accessible web automation.",
                    "Directed social queries with transparent user models.",
                    "sleepyWhispers: sharing goodnights within distant relationships.",
                    "Synchrum: a tangible interface for rhythmic collaboration.",
                    "Follow-me!: conducting a virtual concert.",
                    "Videoink: a pen-based approach for video editing.",
                    "You can't force calm: designing and evaluating respiratory regulating interfaces for calming technology.",
                    "E-Block: a tangible programming tool for children.",
                    "Restorable backspace.",
                    "Development of a non-contact tongue-motion acquisition system.",
                    "Collision avoidance interface for safe piloting of unmanned vehicles using a mobile device.",
                    "Lost in the dark: emotion adaption.",
                    "mashpoint: browsing the web along structured lines.",
                    "Review explorer: an innovative interface for displaying and collecting categorized review information.",
                    "For novices playing music together, adding structural constraints leads to better music and may improve user experience.",
                    "BallCam!: dynamic view synthesis from spinning cameras.",
                    "A proposal for a MMG-based hand gesture recognition method.",
                    "Highly deformable interactive 3D surface display.",
                    "MISO: a context-sensitive multimodal interface for smart objects based on hand gestures and finger snaps.",
                    "A guidance technique for motion tracking with a handheld camera using auditory feedback.",
                    "Transparent display interaction without binocular parallax.",
                    "Crowd-based recognition of web interaction patterns.",
                    "Programming with everybody: tightening the copy-modify-publish feedback loop."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "24th UIST 2011",
        "info": "Santa Barbara, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/uist/2011",
                "sub_name": "Proceedings of the 24th Annual ACM Symposium on User Interface Software and Technology, Santa Barbara, CA, USA, October 16-19, 2011.",
                "count": 69,
                "papers": [
                    "Platemate: crowdsourcing nutritional analysis from food photographs.",
                    "Instrumenting the crowd: using implicit behavioral measures to predict task performance.",
                    "Real-time crowd control of existing interfaces.",
                    "Crowds in two seconds: enabling realtime crowd-powered interfaces.",
                    "CrowdForge: crowdsourcing complex work.",
                    "The jabberwocky programming environment for structured social computing.",
                    "Proactive wrangling: mixed-initiative end-user programming of data transformation scripts.",
                    "MUSE: reviving memories using email archives.",
                    "A design space analysis of availability-sharing systems.",
                    "Injured person information management during second triage.",
                    "Yelling in the hall: using sidetone to address a problem with mobile remote presence systems.",
                    "A tongue input device for creating conversations.",
                    "ShowMeHow: translating user interface instructions between applications.",
                    "Pause-and-play: automatically linking screencast video tutorials with applications.",
                    "Creating contextual help for GUIs using screenshots.",
                    "Real-time collaborative coding in a web IDE.",
                    "d.tour: style-based exploration of design example galleries.",
                    "IP-QAT: in-product questions, answers, & tips.",
                    "TwitApp: in-product micro-blogging for design sharing.",
                    "Searching for software learning resources using application context.",
                    "Breaking barriers with sound.",
                    "Query-feature graphs: bridging user vocabulary and system functionality.",
                    "Stacksplorer: call graph navigation helps increasing code maintenance efficiency.",
                    "Cracking the cocoa nut: user interface programming at runtime.",
                    "Monte carlo methods for managing interactive state, action and feedback under uncertainty.",
                    "Associating the visual representation of user interfaces with their internal structures and metadata.",
                    "Animating from markup code to rendered documents and vice versa.",
                    "RhythmLink: securely pairing I/O-constrained devices by tapping.",
                    "Access overlays: improving non-visual access to large touch screens for blind users.",
                    "Imaginary phone: learning imaginary interfaces by transferring spatial memory from a familiar device.",
                    "NaviRadar: a novel tactile information display for pedestrian navigation.",
                    "PocketTouch: through-fabric capacitive touch input.",
                    "Tap control for headphones without sensors.",
                    "The proximity toolkit: prototyping proxemic interactions in ubiquitous computing ecologies.",
                    "ZeroN: mid-air tangible interaction enabled by computer controlled magnetic levitation.",
                    "Medusa: a proximity-aware multi-touch tabletop.",
                    "Portico: tangible interaction on and around a tablet.",
                    "Conté: multimodal input inspired by an artist's crayon.",
                    "Clip-on gadgets: expanding multi-touch interaction area with unpowered tactile controls.",
                    "Sketch-sketch revolution: an engaging tutorial system for guided sketching and application learning.",
                    "Elasticurves: exploiting stroke dynamics and inertia for the real-time neatening of sketched 2D curves.",
                    "ReVision: automated classification, analysis and redesign of chart images.",
                    "Calibration games: making calibration tasks enjoyable by adding motivating game elements.",
                    "onNote: playing printed music scores as a musical instrument.",
                    "Peripheral paced respiration: influencing user physiology during information work.",
                    "Sex, food, and words: the hidden meanings behind everyday language.",
                    "SideBySide: ad-hoc multi-user interaction with handheld projectors.",
                    "OmniTouch: wearable multitouch interaction everywhere.",
                    "Visual separation in mobile multi-display environments.",
                    "The 1line keyboard: a QWERTY layout in a single line.",
                    "1 thumb, 4 buttons, 20 words per minute: design and evaluation of H4-writer.",
                    "Pub - point upon body: exploring eyes-free interaction and methods on an arm.",
                    "SpeckleSense: fast, precise, low-cost and compact motion sensing using laser speckle.",
                    "Area-based photo-plethysmographic sensing method for the surfaces of handheld devices.",
                    "Detecting shape deformation of soft objects using directional photoreflectivity measurement.",
                    "Modular and deformable touch-sensitive surfaces based on time domain reflectometry.",
                    "deForm: an interactive malleable surface for capturing 2.5D arbitrary objects, tools and touch.",
                    "A new angle on cheap LCDs: making positive use of optical distortion.",
                    "Direct and gestural interaction with relief: a 2.5D shape display.",
                    "6D hands: markerless hand-tracking for computer aided design.",
                    "KinectFusion: real-time 3D reconstruction and interaction using a moving depth camera.",
                    "Vermeer: direct interaction with a 360° viewable 3D display.",
                    "IrCube tracker: an optical 6-DOF tracker based on LED directivity.",
                    "Toucheo: multitouch and stereo combined in a seamless workspace.",
                    "Harpoon selection: efficient selections for ungrouped content on large pen-based surfaces.",
                    "No more bricolage!: methods and tools to characterize, replicate and compare pointing transfer functions.",
                    "FingerFlux: near-surface haptic feedback on tabletops.",
                    "Force gestures: augmenting touch screen gestures with normal and tangential forces.",
                    "TapSense: enhancing finger interaction on touch surfaces."
                ]
            },
            {
                "sub_name_abbr": "conf/uist/2011a",
                "sub_name": "Proceedings of the 24th Annual ACM Symposium on User Interface Software and Technology, Santa Barbara, CA, USA, October 16-19, 2011 - Adjunct Volume.",
                "count": 39,
                "papers": [
                    "PicoPet: \"Real World\" digital pet on a handheld projector.",
                    "Scopemate: a tracking inspection microscope.",
                    "SUAVE: sensor-based user-aware viewing enhancement for mobile device displays.",
                    "STIMTAC: a tactile input device with programmable friction.",
                    "Gesture keyboard requiring only one camera.",
                    "Digital taste interface.",
                    "MAI painting brush++: augmenting the feeling of painting with new visual and tactile feedback mechanisms.",
                    "ThickPad: a hover-tracking touchpad for a laptop.",
                    "TactileTape: low-cost touch sensing on curved surfaces.",
                    "Recognizing currency bills using a mobile phone: an assistive aid for the visually impaired.",
                    "Redprint: integrating API specific \"instant example\" and \"instant documentation\" display interface in IDEs.",
                    "Role-based interfaces for collaborative software development.",
                    "Using graphical representation of user interfaces as visual references.",
                    "Accessibility for individuals with color vision deficiency.",
                    "Augmenting the SCOPE of interactions with implicit and explicit graphical structures.",
                    "Mobile multi-display environments.",
                    "Advanced interaction with mobile projection interfaces.",
                    "Designing for effective end-user interaction with machine learning.",
                    "Dynamic ambient lighting for mobile devices.",
                    "Active bone-conducted sound sensing for wearable interfaces.",
                    "TOPS: television object promoting system.",
                    "Execution control for crowdsourcing.",
                    "Fit your hand: personalized user interface considering physical attributes of mobile device users.",
                    "Poke: emotional touch delivery through an inflatable surface over interpersonal mobile communications.",
                    "Scopemate: a robotic microscope.",
                    "Composition for conductor and audience: new uses for mobile devices in the concert hall.",
                    "MARBLS: a visual environment for building clinical alert rules.",
                    "Cloudtop: a workspace for the cloud.",
                    "Maintaining shared mental models in anesthesia crisis care with nurse tablet input and large-screen displays.",
                    "HaCHIStick: simulating haptic sensation on tablet pc for musical instruments application.",
                    "TouchString: a flexible linear multi-touch sensor for prototyping a freeform multi-touch surface.",
                    "MUST-D: multi-user see through display.",
                    "Digital taste for remote multisensory interactions.",
                    "Artisanship training using wearable egocentric display.",
                    "Tracking indoor location and motion for navigational assistance.",
                    "MoodMusic: a method for cooperative, generative music playlist creation.",
                    "An asymmetric communications platform for knowledge sharing with low-end mobile phones.",
                    "AdaptableGIMP: designing a socially-adaptable interface.",
                    "Embedding interface sketches in code."
                ]
            }
        ]
    },
    {
        "year": "2010",
        "name": "23rd UIST 2010",
        "info": "New York, NY, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/uist/2010",
                "sub_name": "Proceedings of the 23rd Annual ACM Symposium on User Interface Software and Technology, New York, NY, USA, October 3-6, 2010.",
                "count": 41,
                "papers": [
                    "Intimacy versus privacy.",
                    "Imaginary interfaces: spatial interaction with empty hands and without visual feedback.",
                    "PhoneTouch: a technique for direct phone interaction on surfaces.",
                    "Hands-on math: a page-based multi-touch and pen desktop for technical work and problem solving.",
                    "Pen + touch = new tools.",
                    "Gestalt: integrated support for implementation and analysis in machine learning.",
                    "A framework for robust and flexible handling of inputs with uncertainty.",
                    "TurKit: human computation algorithms on mechanical turk.",
                    "Mixture model based label association techniques for web accessibility.",
                    "Performance optimizations of virtual keyboards for stroke-based text entry on a touch-based tabletop.",
                    "Gesture search: a tool for fast mobile data access.",
                    "MAI painting brush: an interactive device that realizes the feeling of real painting.",
                    "SqueezeBlock: using virtual springs in mobile devices for eyes-free interaction.",
                    "Bringing the field into the lab: supporting capture and replay of contextual data for the design of context-aware applications.",
                    "Eden: supporting home network management through interactive visual tools.",
                    "TwinSpace: an infrastructure for cross-reality team spaces.",
                    "D-Macs: building multi-device user interfaces by demonstrating, sharing and replaying design actions.",
                    "Content-aware dynamic timeline for video browsing.",
                    "Chronicle: capture, exploration, and playback of document workflow histories.",
                    "Enhanced area cursors: reducing fine pointing demands for people with motor impairments.",
                    "The satellite cursor: achieving MAGIC pointing without gaze tracking using multiple cursors.",
                    "UIMarks: quick graphical interaction with specific targets.",
                    "Connected environments.",
                    "Gilded gait: reshaping the urban experience with augmented footsteps.",
                    "Jogging over a distance between Europe and Australia.",
                    "Sensing foot gestures from the pocket.",
                    "Multitoe: high-precision interaction with back-projected floors based on high-resolution multi-touch input.",
                    "Cosaliency: where people look when comparing images.",
                    "A conversational interface to web automation.",
                    "Designing adaptive feedback for improving data entry accuracy.",
                    "Creating collections with automatic suggestions and example-based refinement.",
                    "The IR ring: authenticating users' touches on a multi-touch display.",
                    "Enabling beyond-surface interactions for interactive surface with an invisible projection.",
                    "Combining multiple depth cameras and projectors for interactions on, above and between surfaces.",
                    "TeslaTouch: electrovibration for touch surfaces.",
                    "Madgets: actuating widgets on interactive tabletops.",
                    "Eddi: interactive topic-based browsing of social status streams.",
                    "Soylent: a word processor with a crowd inside.",
                    "Tag expression: tagging with feeling.",
                    "VizWiz: nearly real-time answers to visual questions.",
                    "The engineering of personhood."
                ]
            },
            {
                "sub_name_abbr": "conf/uist/2010a",
                "sub_name": "Adjunct proceedings of the 23nd annual ACM symposium on User interface software and technology, UIST '10, New York, New York, USA, October 3-6, 2010.",
                "count": 49,
                "papers": [
                    "Crowd-powered interfaces.",
                    "Supporting self-expression for informal communication.",
                    "Lowering the barrier to applying machine learning.",
                    "User interface models for the cloud.",
                    "Towards personalized surface computing.",
                    "Towards a unified framework for modeling, dispatching, and interpreting uncertain input.",
                    "Intelligent tagging interfaces: beyond folksonomy.",
                    "Bringing everyday applications to interactive surfaces.",
                    "OnObject: gestural play with tagged everyday objects.",
                    "CopyCAD: remixing physical objects with copy and paste from the real world.",
                    "Reflective haptics: haptic augmentation of GUIs through frictional actuation of stylus-based interactions.",
                    "MudPad: localized tactile feedback on touch surfaces.",
                    "Surfboard: keyboard with microphone as a low-cost interactive surface.",
                    "Animated paper: a moving prototyping platform.",
                    "A support to multi-devices web application.",
                    "Beyond: collapsible input device for direct 3D manipulation beyond the screen.",
                    "LuminAR: portable robotic augmented reality interface design and prototype.",
                    "Blinkbot: look at, blink and move.",
                    "RoboJockey: real-time, simultaneous, and continuous creation of robot actions for everyone.",
                    "ARmonica: a collaborative sonic environment.",
                    "IODisk: disk-type i/o interface for browsing digital contents.",
                    "Enabling social interactions through real-time sketch-based communication.",
                    "HIPerPaper: introducing pen and paper interfaces for ultra-scale wall displays.",
                    "EasySnap: real-time audio feedback for blind photography.",
                    "ImpAct: enabling direct touch and manipulation for surface computing.",
                    "The multiplayer: multi-perspective social video navigation.",
                    "The enhancement of hearing using a combination of sound and skin sensation to the pinna.",
                    "What can internet search engines \"suggest\" about the usage and usability of popular desktop applications?",
                    "Interacting with live preview frames: in-picture cues for a digital camera interface.",
                    "HyperSource: bridging the gap between source and code-related web sites.",
                    "Shoe-shaped i/o interface.",
                    "Development of the motion-controllable ball.",
                    "PETALS: a visual interface for landmine detection.",
                    "Pinstripe: eyes-free continuous input anywhere on interactive clothing.",
                    "Kinetic tiles: modular construction units for interactive kinetic surfaces.",
                    "Stacksplorer: understanding dynamic program behavior.",
                    "Memento: unifying content and context to aid webpage re-visitation.",
                    "Interactive calibration of a multi-projector system in a video-wall multi-touch environment.",
                    "CodeGraffiti: communication by sketching for pair programmers.",
                    "Mouseless.",
                    "Anywhere touchtyping: text input on arbitrary surface using depth sensing.",
                    "Using temporal video annotation as a navigational aid for video browsing.",
                    "Tweeting halo: clothing that tweets.",
                    "DoubleFlip: a motion gesture delimiter for interaction.",
                    "QWIC: performance heuristics for large scale exploratory user interfaces.",
                    "What interfaces mean: a history and sociology of computer windows.",
                    "Exploring pen and paper interaction with high-resolution wall displays.",
                    "Enabling tangible interaction on capacitive touch panels.",
                    "MobileSurface: interaction in the air for mobile computing."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "22nd UIST 2009",
        "info": "Victoria, BC, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/uist/2009",
                "sub_name": "Proceedings of the 22nd Annual ACM Symposium on User Interface Software and Technology, Victoria, BC, Canada, October 4-7, 2009.",
                "count": 35,
                "papers": [
                    "Interactive viscosity.",
                    "Ripples: utilizing per-contact visualizations to improve user interaction with touch displays.",
                    "Contact area interaction with sliding widgets.",
                    "Detecting and leveraging finger orientation for interaction with direct-touch surfaces.",
                    "Mouse 2.0: multi-touch meets the mouse.",
                    "PhotoelasticTouch: transparent rubbery tangible interface using an LCD and photoelasticity.",
                    "A reconfigurable ferromagnetic input device.",
                    "A practical pressure sensitive computer keyboard.",
                    "EverybodyLovesSketch: 3D sketching for a broader audience.",
                    "A screen-space formulation for 2D and 3D direct manipulation.",
                    "Activity analysis enabling real-time video communication on mobile phones for deaf users.",
                    "User guided audio selection from complex sound mixtures.",
                    "TapSongs: tapping rhythm-based passwords on a single binary sensor.",
                    "Collabio: a game for annotating people within social networks.",
                    "Disappearing mobile devices.",
                    "SemFeel: a user interface with semantic tactile feedback for mobile touch-screen devices.",
                    "Abracadabra: wireless, high-precision, and unpowered finger input for very small mobile devices.",
                    "Virtual shelves: interactions with orientation aware devices.",
                    "Bonfire: a nomadic system for hybrid laptop-tabletop interaction.",
                    "Interactions in the air: adding further depth to interactive tabletops.",
                    "Augmenting interactive tables with mice & keyboards.",
                    "ARC-Pad: absolute+relative cursor positioning for large displays with a mobile touchscreen.",
                    "Using fNIRS brain sensing in realistic HCI settings: experiments and guidelines.",
                    "Enabling always-available input with muscle-computer interfaces.",
                    "Optically sensing tongue gestures for computer input.",
                    "The rise of the expert amateur: DIY culture and citizen science.",
                    "Sikuli: using GUI screenshots for search and automation.",
                    "CommunityCommands: command recommendations for software applications.",
                    "Mining web interactions to automatically create mash-ups.",
                    "Relaxed selection techniques for querying time-series graphs.",
                    "Integrated videos and maps for driving directions.",
                    "Perceptual interpretation of ink annotations on line charts.",
                    "Changing how people view changes on the web.",
                    "Overview based example selection in end user interactive concept learning.",
                    "The web page as a WYSIWYG end-user customizable database-backed information management application."
                ]
            }
        ]
    },
    {
        "year": "2008",
        "name": "21st UIST 2008",
        "info": "Monterey, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/uist/2008",
                "sub_name": "Proceedings of the 21st Annual ACM Symposium on User Interface Software and Technology, Monterey, CA, USA, October 19-22, 2008.",
                "count": 36,
                "papers": [
                    "Interactive viscosity.",
                    "Video object annotation, navigation, and composition.",
                    "Creating map-based storyboards for browsing tour videos.",
                    "An application-independent system for visualizing user operation history.",
                    "Annotating gigapixel images.",
                    "OctoPocus: a dynamic guide for learning gesture-based command sets.",
                    "Kinematic templates: end-user tools for content-relative cursor manipulations.",
                    "Attribute gates.",
                    "Bringing physics to the surface.",
                    "Sphere: multi-touch interactions on a spherical display.",
                    "Extending 2D object arrangement with pressure-sensitive layering cues.",
                    "Design as exploration: creating interface alternatives through parallel authoring and runtime tuning.",
                    "An infrastructure for extending applications' user experiences across multiple personal devices.",
                    "Iterative design and evaluation of an event architecture for pen-and-paper interfaces.",
                    "Is the sky pure today? AwkChecker: an assistive tool for detecting and correcting collocation errors.",
                    "Inky: a sloppy command line for the web with rich visual feedback.",
                    "Search Vox: leveraging multimodal refinement and partial knowledge for mobile voice search.",
                    "ILoveSketch: as-natural-as-possible sketching system for creating 3d curve models.",
                    "Lineogrammer: creating diagrams by drawing.",
                    "Edge-respecting brushes.",
                    "Tapping and rubbing: exploring new dimensions of tactile feedback with voice coil motors.",
                    "An exploration of pen rolling for pen-based interaction.",
                    "SideSight: multi-\"touch\" interaction around small devices.",
                    "Scratch input: creating large, inexpensive, unpowered and mobile finger input surfaces.",
                    "Living better with robots.",
                    "Re-framing the desktop interface around the activities of knowledge work.",
                    "The ProD framework for proactive displays.",
                    "Taskposé: exploring fluid boundaries in an associative window visualization.",
                    "Backward highlighting: enhancing faceted search.",
                    "Zoetrope: interacting with the ephemeral web.",
                    "Highlight: a system for creating and deploying mobile web applications.",
                    "Browsing large HTML tables on small screens.",
                    "Going beyond the display: a surface technology with an electronically switchable diffuser.",
                    "Lightweight material detection for placement-aware mobile computing.",
                    "Towards more paper-like input: flexible input devices for foldable interaction styles.",
                    "Foldable interactive displays."
                ]
            }
        ]
    },
    {
        "year": "2007",
        "name": "20th UIST 2007",
        "info": "Newport, Rhode Island, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/uist/2007",
                "sub_name": "Proceedings of the 20th Annual ACM Symposium on User Interface Software and Technology, Newport, Rhode Island, USA, October 7-10, 2007.",
                "count": 36,
                "papers": [
                    "Measuring how design changes cognition at work.",
                    "SearchTogether: an interface for collaborative web search.",
                    "Assieme: finding and leveraging implicit references in a web search interface for programmers.",
                    "The re: search engine: simultaneous support for finding and re-finding.",
                    "Eyepatch: prototyping camera-based interaction through examples.",
                    "Multi-user interaction using handheld projectors.",
                    "Shadow reaching: a new perspective on interaction for large displays.",
                    "Hybrid infrared and visible light projection for location tracking.",
                    "Relations, cards, and search templates: user-guided web data integration and layout.",
                    "OPA browser: a web browser for cellular phone users.",
                    "Smart bookmarks: automatic retroactive macro recording on the web.",
                    "Socially augmenting employee profiles with people-tagging.",
                    "Continuum: designing timelines for hierarchies, relationships and scale.",
                    "QuME: a mechanism to support expertise finding in online help-seeking communities.",
                    "Rethinking the progress bar.",
                    "SketchWizard: Wizard of Oz prototyping of pen-based user interfaces.",
                    "RubberEdge: reducing clutching by combining position and rate control with elastic feedback.",
                    "Enabling efficient orienteering behavior in webmail clients.",
                    "Robust, low-cost, non-intrusive sensing and recognition of seated postures.",
                    "Gestures without libraries, toolkits or training: a $1 recognizer for user interface prototypes.",
                    "Two-finger input with a standard touch screen.",
                    "Bubble clusters: an interface for manipulating spatial aggregation of graphical objects.",
                    "Dirty desktops: using a patina of magnetic mouse dust to make common interactor targets easier to select.",
                    "Boomerang: suspendable drag-and-drop interactions based on a throw-and-catch metaphor.",
                    "Capturing the user's attention: insights from the study of human vision.",
                    "Gui --- phooey!: the case for text input.",
                    "Graphstract: minimal graphical help for computers.",
                    "Gaze-enhanced scrolling techniques.",
                    "Blui: low-cost localized blowable user interfaces.",
                    "Specifying label layout style by example.",
                    "Automatically generating user interfaces adapted to users' motor and vision capabilities.",
                    "Programming by a sample: rapidly creating web applications with d.mix.",
                    "Evaluating user interface systems research.",
                    "ThinSight: versatile multi-touch sensing for thin form-factor displays.",
                    "Lucid touch: a see-through mobile device.",
                    "E-conic: a perspective-aware interface for multi-display environments."
                ]
            }
        ]
    },
    {
        "year": "2006",
        "name": "19th UIST 2006",
        "info": "Montreux, Switzerland ",
        "venues": [
            {
                "sub_name_abbr": "conf/uist/2006",
                "sub_name": "Proceedings of the 19th Annual ACM Symposium on User Interface Software and Technology, Montreux, Switzerland, October 15-18, 2006.",
                "count": 42,
                "papers": [
                    "Computing versus human thinking.",
                    "The design and evaluation of selection techniques for 3D volumetric displays.",
                    "ModelCraft: capturing freehand annotations and edits on physical 3D models.",
                    "A direct texture placement and editing interface.",
                    "CINCH: a cooperatively designed marking interface for 3D pathway selection.",
                    "Soap: a pointing device that works in mid-air.",
                    "Comparing and managing multiple versions of slide presentations.",
                    "Viz: a visual analysis suite for explaining local search behavior.",
                    "From information visualization to direct manipulation: extending a generic visualization framework for the interactive editing of large datasets.",
                    "WindowScape: a task oriented window manager.",
                    "Using a low-cost electroencephalograph for task classification in HCI research.",
                    "Sensing from the basement: a feasibility study of unobtrusive and low-cost home activity recognition.",
                    "Camera phone based motion sensing: interaction techniques, applications and performance study.",
                    "Mobile interaction using paperweight metaphor.",
                    "Summarizing personal web browsing sessions.",
                    "Enabling web browsers to augment web sites' filtering and sorting functionalities.",
                    "Translating keyword commands into executable code.",
                    "RecipeSheet: creating, combining and controlling information processors.",
                    "Content-aware scrolling.",
                    "Mnemonic rendering: an image-based approach for exposing hidden changes in dynamic displays.",
                    "Phosphor: explaining transitions in the user interface using afterglow effects.",
                    "Procedural haptic texture.",
                    "Personalizing routes.",
                    "Quiet interfaces that help students think.",
                    "Pen-top feedback for paper-based interfaces.",
                    "HybridPointing: fluid switching between absolute and relative pointing with a direct input device.",
                    "Videotater: an approach for pen-based digital video segmentation and tagging.",
                    "Interacting with dynamically defined information spaces using a handheld projector and a pen.",
                    "Projector-guided painting.",
                    "Interactive environment-aware display bubbles.",
                    "Robust computer vision-based detection of pinching for one and two-handed gesture input.",
                    "Under the table interaction.",
                    "Multi-layer interaction for digital tables.",
                    "Multi-user, multi-display interaction with a single-user, single-display geospatial application.",
                    "Brain-computer interaction.",
                    "Huddle: automatically generating interfaces for systems of multiple connected appliances.",
                    "Rapid construction of functioning physical interfaces from cardboard, thumbtacks, tin foil and masking tape.",
                    "Reflective physical prototyping through integrated design, test, and analysis.",
                    "User interface façades: towards fully adaptable user interfaces.",
                    "SwingStates: adding state machines to the swing toolkit.",
                    "CueTIP: a mixed-initiative interface for correcting handwriting errors.",
                    "In-stroke word completion."
                ]
            }
        ]
    },
    {
        "year": "2005",
        "name": "18th UIST 2005",
        "info": "Seattle, WA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/uist/2005",
                "sub_name": "Proceedings of the 18th Annual ACM Symposium on User Interface Software and Technology, Seattle, WA, USA, October 23-26, 2005.",
                "count": 32,
                "papers": [
                    "Personal computing in the 21st century.",
                    "Citrus: a language and toolkit for simplifying the creation of structured editors for code and data.",
                    "Metisse is not a 3D desktop!",
                    "Role-based control of shared application views.",
                    "Distant freehand pointing and clicking on very large, high resolution displays.",
                    "Interacting with large displays from a distance with vision-tracked multi-finger gestural input.",
                    "ViewPointer: lightweight calibration-free eye tracking for ubiquitous handsfree deixis.",
                    "Moveable interactive projected displays using projector based tracking.",
                    "Zoom-and-pick: facilitating visual zooming and precision pointing with interactive handheld projectors.",
                    "PlayAnywhere: a compact interactive tabletop projection-vision system.",
                    "Sensing and visualizing spatial relations of mobile devices.",
                    "eyeLook: using attention to facilitate mobile media consumption.",
                    "Circle & identify: interactivity-augmented object recognition for handheld devices.",
                    "Supporting interaction in augmented reality in the presence of uncertain spatial knowledge.",
                    "Low-cost multi-touch sensing through frustrated total internal reflection.",
                    "DTLens: multi-user tabletop spatial data exploration.",
                    "Bimanual and unimanual image alignment: an evaluation of mouse-based techniques.",
                    "Predictive interaction using the delphian desktop.",
                    "Zliding: fluid zooming and sliding for high precision parameter manipulation.",
                    "Automatic image retargeting with fisheye-view warping.",
                    "Automation and customization of rendered web pages.",
                    "Preference elicitation for interface optimization.",
                    "Mediating photo collage authoring.",
                    "Dial and see: tackling the voice menu navigation problem with cross-device user experience integration.",
                    "DocWizards: a system for authoring follow-me documentation wizards.",
                    "Artistic resizing: a technique for rich scale-sensitive vector graphics.",
                    "A1: end-user programming for web-based system administration.",
                    "Informal prototyping of continuous graphical interactions by demonstration.",
                    "Physical embodiments for mobile communication agents.",
                    "PapierCraft: a command system for interactive paper.",
                    "DT controls: adding identity to physical interfaces.",
                    "Supporting interspecies social awareness: using peripheral displays for distributed pack awareness."
                ]
            }
        ]
    },
    {
        "year": "2004",
        "name": "17th UIST 2004",
        "info": "Santa Fe, NM, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/uist/2004",
                "sub_name": "Proceedings of the 17th Annual ACM Symposium on User Interface Software and Technology, Santa Fe, NM, USA, October 24-27, 2004.",
                "count": 39,
                "papers": [
                    "Bridging the gap from theory to practice: the path toward innovation in human-computer interaction.",
                    "CrossY: a crossing-based drawing application.",
                    "Hierarchical parsing and recognition of hand-sketched diagrams.",
                    "SketchREAD: a multi-domain sketch recognition engine.",
                    "Simple vs. compound mark hierarchical marking menus.",
                    "SHARK2: a large vocabulary shorthand writing system for pen-based computers.",
                    "The radial scroll tool: scrolling support for stylus- or touch-based document navigation.",
                    "Navigating documents with the virtual scroll ring.",
                    "Multi-finger gestural interaction with 3d volumetric displays.",
                    "Achieving higher magnification in context.",
                    "Tangible NURBS-curve manipulation techniques using graspable handles on a large display.",
                    "Collapse-to-zoom: viewing web pages on small screen devices by interactively removing irrelevant content.",
                    "The IBar: a perspective-based camera widget.",
                    "Video-based document tracking: unifying your physical and electronic desktops.",
                    "Who cares?: reflecting who is reading what on distributed community bulletin boards.",
                    "Visual tracking of bare fingers for interactive surfaces.",
                    "Automatic projector calibration with embedded light sensors.",
                    "A remote control interface for large displays.",
                    "Interactive public ambient displays: transitioning from implicit to explicit, public to personal, interaction with multiple users.",
                    "C-blink: a hue-difference-based light signal marker for large screen interaction via any mobile terminal.",
                    "A gesture-based authentication scheme for untrusted public terminals.",
                    "Physical user interfaces: what they are and how to build them.",
                    "Olfactory display.",
                    "ScreenCrayons: annotating anything.",
                    "Clip, connect, clone: combining application elements to build custom interfaces for information access.",
                    "Citrine: providing intelligent copy-and-paste.",
                    "Interacting with hidden content using content-aware free-space transparency.",
                    "Combining crossing-based and paper-based interaction paradigms for dragging and dropping between overlapping windows.",
                    "DART: a toolkit for rapid design exploration of augmented reality experiences.",
                    "An explanation-based, visual debugger for one-way constraints.",
                    "Topiary: a tool for prototyping location-enhanced applications.",
                    "An optimization-based approach to dynamic data content selection in intelligent multimedia interfaces.",
                    "Augmenting conversations using dual-purpose speech.",
                    "A toolkit for managing user attention in peripheral displays.",
                    "The MaggLite post-WIMP toolkit: draw it, connect it and run it.",
                    "Revisiting visual interface programming: creating GUI tools for designers and programmers.",
                    "\"Killer App\" of wearable computing: wireless force sensing body protectors for martial arts.",
                    "Using light emitting diode arrays as touch-sensitive input and output devices.",
                    "Haptic pen: a tactile feedback stylus for touch screens."
                ]
            }
        ]
    },
    {
        "year": "2003",
        "name": "16th UIST 2003",
        "info": "Vancouver, BC, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/uist/2003",
                "sub_name": "Proceedings of the 16th Annual ACM Symposium on User Interface Software and Technology, Vancouver, Canada, November 2-5, 2003.",
                "count": 25,
                "papers": [
                    "A widget framework for augmented interaction in SCAPE.",
                    "Rhythm modeling, visualizations and applications.",
                    "Classroom BRIDGE: using collaborative public and desktop timelines to support activity awareness.",
                    "SmartMusicKIOSK: music listening station with chorus-search function.",
                    "TalkBack: a conversational answering machine.",
                    "Paper augmented digital documents.",
                    "EdgeWrite: a stylus-based text entry method designed for high accuracy and stability of motion.",
                    "Tracking menus.",
                    "TiltText: using tilt for text input to mobile phones.",
                    "Considering the direction of cursor movement for efficient traversal of cascading menus.",
                    "Automatic thumbnail cropping and its effectiveness.",
                    "Fluid interaction techniques for the control and annotation of digital video.",
                    "Rapid serial visual presentation techniques for consumer digital video devices.",
                    "GADGET: a toolkit for optimization-based approaches to interface and display generation.",
                    "A molecular architecture for creating advanced GUIs.",
                    "User interface continuations.",
                    "Synchronous gestures for multiple persons and computers.",
                    "Dynamo: a public interactive surface supporting the cooperative sharing and exchange of media.",
                    "A fast, interactive 3D paper-flier metaphor for digital bulletin boards.",
                    "VisionWand: interaction techniques for large displays using a passive wand tracked in 3D.",
                    "Perceptually-supported image editing of text and graphics.",
                    "Multi-finger and whole hand gestural interaction techniques for multi-user tabletop displays.",
                    "PreSense: interaction techniques for finger sensing input devices.",
                    "Stylus input and editing without prior selection of mode.",
                    "Tactile interfaces for small touch screens."
                ]
            }
        ]
    },
    {
        "year": "2002",
        "name": "15th UIST 2002",
        "info": "Paris, France",
        "venues": [
            {
                "sub_name_abbr": "conf/uist/2002",
                "sub_name": "Proceedings of the 15th Annual ACM Symposium on User Interface Software and Technology, Paris, France, October 27-30, 2002.",
                "count": 26,
                "papers": [
                    "FLANNEL: adding computation to electronic mail during transmission.",
                    "Augmenting shared personal calendars.",
                    "Moving markup: repositioning freeform annotations.",
                    "Customizable physical interfaces for interacting with conventional applications.",
                    "The missing link: augmenting biology laboratory notebooks.",
                    "Ambient touch: designing tactile interfaces for handheld devices.",
                    "Specifying behavior and semantic meaning in an unmodified layered drawing package.",
                    "Side views: persistent, on-demand previews for open-ended tasks.",
                    "The kinetic typography engine: an extensible system for animating expressive text.",
                    "Clothing manipulation.",
                    "StyleCam: interactive stylized 3D navigation using integrated spatial & temporal controls.",
                    "Boom chameleon: simultaneous capture of 3D viewpoint, voice and gesture annotations on a spatially-aware display.",
                    "Distributed mediation of ambiguous context in aware environments.",
                    "Query-by-critique: spoken language access to large lists.",
                    "Mediated voice communication via mobile IP.",
                    "That one there! Pointing to establish device identity.",
                    "Generating remote control interfaces for complex appliances.",
                    "User interfaces when and where they are needed: an infrastructure for recombinant computing.",
                    "The actuated workbench: computer-controlled actuation in tabletop tangible interfaces.",
                    "Dynamic approximation of complex graphical constraints by linear constraints.",
                    "TiltType: accelerometer-supported text entry for very small devices.",
                    "WebThumb: interaction techniques for small-screen browsers.",
                    "The \"mighty mouse\" multi-screen collaboration tool.",
                    "An annotated situation-awareness aid for augmented reality.",
                    "Manipulating structured information in a visual workspace.",
                    "PointRight: experience with flexible input redirection in interactive workspaces."
                ]
            }
        ]
    },
    {
        "year": "2001",
        "name": "14th UIST 2001",
        "info": "Orlando, Florida, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/uist/2001",
                "sub_name": "Proceedings of the 14th Annual ACM Symposium on User Interface Software and Technology, UIST 2001, Disney's BoardWalk Inn Resort, Walt Disney World, Orlando, Florida, USA, November 11-14, 2001.",
                "count": 31,
                "papers": [
                    "The designers' outpost: a tangible interface for collaborative web site.",
                    "Connectables: dynamic coupling of displays for the flexible creation of shared workspaces.",
                    "Fluid interaction with high-resolution wall-size displays.",
                    "Focus plus context screens: combining display technology with visualization techniques.",
                    "Support for multitasking and background awareness using interactive peripheral displays.",
                    "Parallel bargrams for consumer-based information exploration and choice.",
                    "A framework for unifying presentation space.",
                    "PhotoMesa: a zoomable image browser using quantum treemaps and bubblemaps.",
                    "Outlier finding: focusing user attention on possible errors.",
                    "A modular geometric constraint solver for user interface applications.",
                    "View management for virtual and augmented reality.",
                    "LetterWise: prefix-based disambiguation for mobile text input.",
                    "From desktop to phonetop: a UI for web interaction on very small devices.",
                    "Join and capture: a model for nomadic interaction.",
                    "Aesthetic information collages: generating decorative displays that contain information.",
                    "Cursive: a novel interaction technique for controlling expressive avatar gesture.",
                    "Novel interaction techniques for overlapping windows.",
                    "Voice as sound: using non-verbal voice input for interactive control.",
                    "TSI (teething ring sound instrument): a design of the sound instrument for the baby.",
                    "Tools for expressive text-to-speech markup.",
                    "Conducting a realistic electronic orchestra.",
                    "Simplicial families of drawings.",
                    "A suggestive interface for 3D drawing.",
                    "Empirical measurements of intrabody communication performance under varied physical configurations.",
                    "Toward more sensitive mobile phones.",
                    "Real-time audio buffering for telephone applications.",
                    "Pop through mouse button interactions.",
                    "Guided gesture support in the paper PDA.",
                    "Haptic techniques for media control.",
                    "Phidgets: easy development of physical interfaces through physical widgets.",
                    "DiamondTouch: a multi-user touch technology."
                ]
            }
        ]
    },
    {
        "year": "2000",
        "name": "13th UIST 2000",
        "info": "San Diego, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/uist/2000",
                "sub_name": "Proceedings of the 13th Annual ACM Symposium on User Interface Software and Technology, UIST 2000, San Diego, California, USA, November 6-8, 2000.",
                "count": 28,
                "papers": [
                    "Suede: a Wizard of Oz prototyping tool for speech user interfaces.",
                    "Interaction techniques for ambiguity resolution in recognition-based interfaces.",
                    "Multimodal system processing in mobile environments.",
                    "A temporal model for multi-level undo and redo.",
                    "A programming model for active documents.",
                    "PicturePiper: using a re-configurable pipeline to find images on the Web.",
                    "SATIN: a toolkit for informal ink-based applications.",
                    "Fluid sketches: continuous recognition and morphing of simple hand-drawn shapes.",
                    "A semi-automatic approach to home video editing.",
                    "Sensing techniques for mobile interaction.",
                    "The reading assistant: eye gaze triggered auditory prompting for reading remediation.",
                    "ToolStone: effective use of the physical manipulation vocabularies of input devices.",
                    "The metropolis keyboard - an exploration of quantitative techniques for virtual keyboard design.",
                    "Dasher - a data entry interface using continuous gestures and language models.",
                    "Speed-dependent automatic zooming for browsing large documents.",
                    "The AHI: an audio and haptic interface for contact interactions.",
                    "Page detection using embedded tags.",
                    "System lag tests for augmented and virtual environments.",
                    "Jazz: an extensible zoomable user interface graphics toolkit in Java.",
                    "The architecture and implementation of CPN2000, a post-WIMP graphical application.",
                    "Cross-modal interaction using XWeb.",
                    "TopicShop: enhanced support for evaluating and organizing collections of Web sites.",
                    "Dual touch: a two-handed interface for pen-based PDAs.",
                    "FlowMenu: combining command, text, and data entry.",
                    "Fisheye menus.",
                    "Providing visually rich resizable images for user interface components.",
                    "Illusions of infinity: feedback for infinite worlds.",
                    "Dynamic space management for user interfaces."
                ]
            }
        ]
    },
    {
        "year": "1999",
        "name": "12th UIST 1999",
        "info": "Asheville, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/uist/1999",
                "sub_name": "Proceedings of the 12th Annual ACM Symposium on User Interface Software and Technology, UIST 1999, Asheville, North Carolina, USA, November 7-10, 1999.",
                "count": 26,
                "papers": [
                    "Generalized and Stationary Scrolling.",
                    "Nested User Interface Components.",
                    "Alternative Interfaces for Chat.",
                    "Supporting Awareness and Interaction Through Collaborative Virtual Interfaces.",
                    "PeopleGarden: Creating Data Portraits for Users.",
                    "Time-Machine Computing: A Time-Centric Approach for the Information Environment.",
                    "Using Properties for Uniform Interaction in the Presto Document System.",
                    "Synchronizing Clipboards of Multiple Computers.",
                    "Implementing Phicons: Combining Computer Vision with InfraRed Technology for Interactive Physical Icons.",
                    "Multimodal Agent Interface Based on Dynamical Dialogue Model.",
                    "Building Virtual Structures with Physical Blocks.",
                    "Constraint Cascading Style Sheets for the Web.",
                    "Reducing the Storage Requirements of Constraint Dataflow Graphs.",
                    "A Tool for Creating Predictive Performance Models from User Interface Demonstrations.",
                    "The Videomouse: A Camera-Based Multi-degree-of-freedom Input Device.",
                    "Real-world Interaction Using the FieldMouse.",
                    "Personalizing the Capture of Public Experiences.",
                    "ActiveText: A Method for Creating Dynamic and Interactive Texts.",
                    "The Information Percolator: Ambient Information Display in a Decorative Object.",
                    "Sketching with Projective 2D Strokes.",
                    "Integrated Manipulation: Context-Aware Manipulation of 2D Diagrams.",
                    "Digital Tape Drawing.",
                    "The Role of Kinesthetic Reference Frames in Two-Handed Input Performance.",
                    "Linking and Messaging from Real Paper in the Paper PDA.",
                    "WEST: A Web Browser for Small Terminals.",
                    "Design and Technology for Collaborage: Collaborative Collages of Information on Physical Walls."
                ]
            }
        ]
    },
    {
        "year": "1998",
        "name": "11th UIST 1998",
        "info": "San Francisco, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/uist/1998",
                "sub_name": "Proceedings of the 11th Annual ACM Symposium on User Interface Software and Technology, UIST 1998, San Francisco, CA, USA, November 1-4, 1998.",
                "count": 31,
                "papers": [
                    "Scratchpad: Mechanisms for Better Navigation in Directed Web Searching.",
                    "Internet Scrapbook: Automating Web Browsing Tasks by Demonstration.",
                    "Constant Density Visualizations of Non-Uniform Distributions of Data.",
                    "Interactive Visualization of Serial Periodic Data.",
                    "Popup Vernier: A Tool for Sub-Pixel-Pitch Dragging with Smooth Mode Transition.",
                    "Interaction and Modeling Techniques for Desktop Two-Handed Input.",
                    "An Insidious Haptic Invasion: Adding Force Feedback to the X Desktop.",
                    "Don't Click, Paint! Using Toggle Maps to Manipulate Sets of Toggle Switches.",
                    "Artists and Technologists Working Together (Panel).",
                    "A User Interface Using Fingerprint Recognition: Holding Commands and Data Objects on Fingers.",
                    "Informative Things: How to Attach Information to the Real World.",
                    "The Programmable Hinge: Toward Computationally Enhanced Crafts.",
                    "Critical Zones in Desert Fog: Aids to Multiscale Navigation.",
                    "MuSE: A Multiscale Editor.",
                    "A Multiple Timeline Editor for Developing Multi-Threaded Animated Interfaces.",
                    "A Framework for Sharing Handwritten Notes.",
                    "PadPrints: Graphical Multiscale Web Histories.",
                    "A Negotiation Architecture for Fluid Documents.",
                    "Supporting Worker Independence in Collaboration Transparency.",
                    "Graphical Query Specification and Dynamic Result Previews for a Digital Library.",
                    "Data Mountain: Using Spatial Memory for Document Management.",
                    "Audio Hallway: A Virtual Acoustic Environment for Browsing.",
                    "Of Vampire Mirrors and Privacy Lamps: Privacy Management in Multi-User Augmented Environments.",
                    "Path Drawing for 3D Walkthrough.",
                    "Spatial Interpretation of Domain Objects Integrated into a Freeform Electronic Whiteboard.",
                    "Automatic Construction of Intelligent Diagram Editors.",
                    "A Dynamic Grouping Technique for Ink and Audio Notes.",
                    "The Music Notepad.",
                    "Integrating Pen Operations for Composition by Example.",
                    "Cirrin: A Word-Level Unistroke Keyboard for Pen Input.",
                    "Quikwriting: Continuous Stylus-Based Text Entry."
                ]
            }
        ]
    },
    {
        "year": "1997",
        "name": "10th UIST 1997",
        "info": "Banff, Alberta, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/uist/1997",
                "sub_name": "Proceedings of the 10th Annual ACM Symposium on User Interface Software and Technology, UIST 1997, Banff, Alberta, Canada, October 14-17, 1997.",
                "count": 34,
                "papers": [
                    "Usability Analysis of 3D Rotation Techniques.",
                    "Immersion in Desktop Virtual Reality.",
                    "Worldlets - 3D Thumbnails for Wayfinding in Virtual Environments.",
                    "Pick-and-Drop: A Direct Manipulation Technique for Multiple Computer Environments.",
                    "A Finger-Mounted, Direct Pointing Device for Mobile Computing.",
                    "TimeSlider: An Interface to Specify Time Point.",
                    "Pen-Based Interaction Techniques for Organizing Material on an Electronic Whiteboard.",
                    "Transparent Sharing of Java Applets: A Replicated Approach.",
                    "Simplifying Component Development in an Integrated Groupware Environment.",
                    "A Shared Command Line in a Virtual Space: The Working Man's MOO.",
                    "CyberDesk: A Framework for Providing Self-Integrating Ubiquitous Software Services.",
                    "Alice: Easy to Use Interactive 3D Graphics.",
                    "A Spreadsheet Approach to Information Visualization.",
                    "Gamut: Demonstrating Whole Applications.",
                    "Orthogonal Extensions to the WWW User Interface Using Client-Side Technologies.",
                    "The CSLU Toolkit: Rapid Prototyping of Spoken Language Systems.",
                    "Solving Linear Arithmetic Constraints for User Interface Applications.",
                    "An Interactive Constraint-Based System for Drawing Graphs.",
                    "Interactive Beautification: A Technique for Rapid Geometric Design.",
                    "UIST'007: Where Will We Be Ten Years from Now? (Panel).",
                    "Designing and Implementing Asynchronous Collaborative Applications with Bayou.",
                    "Supporting Cooperative and Personal Surfing with a Desktop Assistant.",
                    "Flexible Conflict Detection and Management in Collaborative Applications.",
                    "Fix and Float: Object Movement by Egocentric Navigation.",
                    "Systematic Output Modification in a 2D User Interface Toolkit.",
                    "Supporting Dynamic Downloadable Appearances in an Extensible User Interface Toolkit.",
                    "Elastic Windows: A Hierarchical Multi-Window World-Wide Web Browser.",
                    "Debugging Lenses: A New Class of Transparent Tools for User Interface Debugging.",
                    "An Interactive Visual Query Environment for Exploring Data.",
                    "A Virtual Office Environment Based on a Shared Room Realizing Awareness Space and Transmitting Awareness Information.",
                    "HoloWall: Designing a Finger, Hand, Body, and Object Sensitive Wall.",
                    "Audio Aura: Light-Weight Audio Augmented Reality.",
                    "The Omni-Directional Treadmill: A Locomotion Device for Virtual Worlds.",
                    "The MetaDESK: Models and Prototypes for Tangible User Interfaces."
                ]
            }
        ]
    },
    {
        "year": "1996",
        "name": "9th UIST 1996",
        "info": "Seattle, WA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/uist/1996",
                "sub_name": "Proceedings of the 9th Annual ACM Symposium on User Interface Software and Technology, UIST 1996, Seattle, WA, USA, November 6-8, 1996.",
                "count": 29,
                "papers": [
                    "Efficient Distributed Implementation of Semi-Replicated Synchronous Groupware.",
                    "A Mechanism for Supporting Client Migration in a Shared Window System.",
                    "Adding a Collaborative Agent to Graphical User Interfaces.",
                    "A Viewer for PostScript Documents.",
                    "Adding Imageability Features to Information Displays.",
                    "FOCUS: The Interactive Table for Product Comparison and Selection.",
                    "3D Magic Lenses.",
                    "The VIEP System: Interacting with Collaborative Multimedia.",
                    "The \"Growing Up\" of HyperBraille - An Office Workspace for Blind People.",
                    "Where is Information Visualization Technology Going?",
                    "The Go-Go Interaction Technique: Non-Linear Mapping for Direct Manipulation in VR.",
                    "Head-Tracked Orbital Viewing: An Interaction Technique for Immersive Virtual Environments.",
                    "Language-Level Support for Exploratory Programming of Distributed Virtual Environments.",
                    "Aperture Based Selection for Immersive Virtual Environments.",
                    "The Lego Interface Toolkit.",
                    "XXL: A Dual Approach for Building User Interfaces.",
                    "Using the Multi-Layer Model for Building Interactive Graphical Applications.",
                    "Easily Adding Animations to Interfaces Using Constraints.",
                    "Indigo: A Local Propagation Algorithm for Inequality Constraints.",
                    "An Empirical Study of Constraint Usage in Graphical Applications.",
                    "Ultra-Lightweight Constraints.",
                    "A New Direct Manipulation Technique for Aligning Objects in Drawing Programs.",
                    "Penumbrae for 3D Interactions.",
                    "Tilting Operations for Small Screen Interfaces.",
                    "Local Tools: An Alternative to Tool Palettes.",
                    "The Cage: Efficient Construction in 3D Using a Cubic Adaptive Grid.",
                    "Simplifying Macro Definition in Programming by Demonstration.",
                    "Ambiguous Intentions: A Paper-like Interface for Creative Design.",
                    "Inductive Groups."
                ]
            }
        ]
    },
    {
        "year": "1995",
        "name": "8th UIST 1995",
        "info": "Pittsburgh, PA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/uist/1995",
                "sub_name": "Proceedings of the 8th Annual ACM Symposium on User Interface Software and Technology, UIST 1995, Pittsburgh, PA, USA, November 14-17, 1995.",
                "count": 33,
                "papers": [
                    "Animating Direct Manipulation Interfaces.",
                    "Amortizing 3D Graphics Optimization Across Multiple Frames.",
                    "Directness and Liveness in the Morphic User Interface Construction Environment.",
                    "The World Through the Computer: Computer Augmented Interaction with Real World Environments.",
                    "Retrieving Electronic Documents with Real-World Objects on InteractiveDESK.",
                    "The Virtual Tricorder: A Uniform Interface for Virtual Reality.",
                    "A 3D Tracking Experiment on Latency and Its Compensation Methods in Virtual Environments.",
                    "Visual Interfaces for Solids Modeling.",
                    "SDM: Selective Dynamic Manipulation of Visualizations.",
                    "Hands-on Demonstration: Interacting with SpeechSkimmer.",
                    "Using Information Murals in Visualization Applications.",
                    "Grizzly Bear: A Demonstrational Learning Tool for a User Interface Specification Language.",
                    "Demonstration of a Reading Coach that Listens.",
                    "Speech for Multimedia Information Retrieval.",
                    "An Experimental Evaluation of Transparent User Interface Tools and Information Content.",
                    "GLEAN: A Computer-Based Tool for Rapid GOMS Model Usability Evaluation of User Interface Designs.",
                    "AIDE: A Step Toward Metric-based Interface Development Tools.",
                    "High-Latency, Low-Bandwidth Windowing in the Jupiter Collaboration System.",
                    "Supporting Distributed, Concurrent, One-Way Constraints in User Interface Applications.",
                    "Migratory Applications.",
                    "Designing auditory interactions for PDAs.",
                    "Learning from TV Programs: Application of TV Presentation to a Videoconferencing System.",
                    "Pssst: Side Conversations in the Argo Telecollaboration System.",
                    "Argohalls: Adding Support for Group Awareness to the Argo Telecollaboration System.",
                    "Social Activity Indicators: Interface Components for CSCW Systems.",
                    "Proximal Sensing: Supporting Context Sensitive.",
                    "A Tool to Support Speech and Non-Speech Audio Feedback Generation in Audio Interfaces.",
                    "Automatic Generation of Task-Oriented Help.",
                    "Some Design Refinements and Principles on the Appearance and Behavior of Marking Menus.",
                    "Browsing the Web with a Mail/News Reader.",
                    "Multiple-View Approach for Smooth Information Retrieval.",
                    "The Continuous Zoom: A Constrained Fisheye Technique for Viewing and Navigating Large Information Spaces.",
                    "3-Dimensional Pliable Surfaces: For the Effective Presentation of Visual Information."
                ]
            }
        ]
    },
    {
        "year": "1994",
        "name": "7th UIST 1994",
        "info": "Marina del Rey, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/uist/1994",
                "sub_name": "Proceedings of the 7th Annual ACM Symposium on User Interface Software and Technology, UIST 1994, Marina del Rey, CA, USA, November 2-4, 1994.",
                "count": 31,
                "papers": [
                    "Creating the Invisible Interface (invited talk).",
                    "Galaxy of News: An Approach to Visualizing and Understanding Expansive News Landscapes.",
                    "Laying Out and Visualizing Large Trees Using a Hyperbolic Space.",
                    "Powers of Ten Thousand: Navigating in Large Information Spaces.",
                    "Pad++: A Zooming Graphical Interface for Exploring Alternate Interface Physics.",
                    "Reconnaissance Support for Juggling Multiple Processing Options.",
                    "Putting People First: Specifying Proper Names in Speech Interfaces.",
                    "An Architecture for Transforming Graphical Interfaces.",
                    "ENO: Synthesizing Structured Sound Spaces.",
                    "An Architecture for an Extensible 3D Interface Toolkit.",
                    "3D Widgets for Exploratory Scientific Visualization.",
                    "Building Distributed, Multi-User Applications by Direct Manipulation.",
                    "Ramonamap - an Example of Graphical Groupware.",
                    "Interactive Generation of Graphical User Interfaces by Multiple Visual Examples.",
                    "A Pure Reasoning Engine for Programming by Demonstration.",
                    "Evolutionary Learning of Graph Layout Constraints from Examples.",
                    "Developing Calendar Visualizers for the Information Visualizer.",
                    "Data Visualization Sliders.",
                    "Translucent Patches - Dissolving Windows.",
                    "Nova: Low-Cost Data Animation Using a Radar-Sweep Metaphor.",
                    "Model-Based User Interfaces: What are They and Why Should we Care?",
                    "Skyblue: A Multi-way Local Propagation Constraint Solver for User Interface Construction.",
                    "Dialing for Documents: An Experiment in Information Theory.",
                    "Optimizing Toolkit-generated Graphical Interfaces.",
                    "Blending Structured Graphics and Layout.",
                    "A Perceptually-Supported Sketch Editor.",
                    "A Mark-based Interaction Paradigm for Free-hand Drawing.",
                    "Trends in the Computer Industry: Life-long Subscriptions, Magical Cures, and Profits along the Information Highway (invited talk).",
                    "Extending a Graphical Toolkit for Two-handed Interaction.",
                    "Two-handed Polygonal Surface Design.",
                    "A Survey of Design Issues in Spatial Input."
                ]
            }
        ]
    },
    {
        "year": "1993",
        "name": "6th UIST 1993",
        "info": "Atlanta, GA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/uist/1993",
                "sub_name": "Proceedings of the Sixth ACM Symposium on User Interface Software and Technology, UIST 1993, Atlanta, GA, USA, November 3-5, 1993.",
                "count": 27,
                "papers": [
                    "User Interfaces for Symbolic Computation: A Case Study.",
                    "Concept Clustering in a Query Interface to an Image Database.",
                    "System Components for Embedded Information Retrieval from Multiple Disparate Information Sources.",
                    "Pacers: Time-elastic Objects.",
                    "Animation: From Cartoons to the User Interface.",
                    "Animation Support in a User Interface Toolkit: Flexible, Robust, and Reusable Abstractions.",
                    "Animating User Interfaces Using Animation Servers.",
                    "Stretching the Rubber Sheet: A Metaphor for Viewing Large Layouts on Small Screens.",
                    "Algorithm Animation Using 3D Interactive Graphics.",
                    "The Document Lens.",
                    "A Graphics Toolkit Based on Differential Constraints.",
                    "Recognizing Multistroke Geometric Shapes: An Experimental Evaluation.",
                    "Model-based User Interface Design by Example and by Interview.",
                    "From Research Prototypes to Usable, Useful Systems: Lessons Learned in the Trenches.",
                    "Windows on the World: 2D Windows for 3D Augmented Reality.",
                    "A Toolset for Navigation in Virtual Environments.",
                    "VB2: An Architecture for Interaction in Synthetic Worlds.",
                    "Video Widgets and Video Actors.",
                    "SpeechSkimmer: Interactively Skimming Recorded Speech.",
                    "Skeletal Strokes.",
                    "Converting an Existing User Interface to Use Constraints.",
                    "A Spreadsheet Based on Constraints.",
                    "The Rendezvous Constraint Maintenance System.",
                    "Platform Independent User Interface Builders: Where are we headed?",
                    "Window Real Objects: A Distributed Shared Memory for Distributed Implementation of GUI Applications.",
                    "A Framework for Shared Applications with a Replicated Architecture.",
                    "A Marking Based Interface for Collaborative Writing."
                ]
            }
        ]
    },
    {
        "year": "1992",
        "name": "5th UIST 1992",
        "info": "Monteray, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/uist/1992",
                "sub_name": "Proceedings of the Fifth ACM Symposium on User Interface Software and Technology, UIST 1992, Monteray, CA, USA, November 15-18, 1992.",
                "count": 23,
                "papers": [
                    "Interactive Shadows.",
                    "Two-handed Gesture in Multi-modal Natural Dialog.",
                    "A Testbed for Characterizing Dynamic Response of Virtual Environment Spatial Sensors.",
                    "The Information Grid: A Framework for Information Retrieval and Retrieval-centered Applications.",
                    "Frameworks for Interactive, Extensible, Information-Intensive Applications.",
                    "An Explanatory and \"Argumentative\" Interface for a Model-based Diagnostic System.",
                    "Techniques for Low Cost Spatial Audio.",
                    "Mapping GUIs to Auditory Interfaces.",
                    "Tools for Building Asynchronous Servers to Support Speech and Audio Applications.",
                    "Some Virtues and Limitations of Action Inferring Interfaces.",
                    "Adding Rule-Based Reasoning to a Demonstrational Interface Builder.",
                    "A History-Based Macro by Example System.",
                    "Declarative Programming of Graphical Interfaces by Visual Examples.",
                    "Graphical Styles for Building Interfaces by Demonstration.",
                    "Programming Time in Multimedia User Interfaces.",
                    "MediaMosaic - a Multimedia Editing Environment.",
                    "The Role of Natural Language in a Multimodal Interface.",
                    "TelePICTIVE: Computer-supported Collaborative GUI Design for Designers with Diverse Expertise.",
                    "Tools for Supporting the Collaborative Process.",
                    "Transparency and Awareness in a Real-Time Groupware System.",
                    "Progress in Building User Interface Toolkits: The World According to XIT.",
                    "Using Taps to Separate the User Interface from the Application Code.",
                    "Probabilistic State Machines: Dialog Management for Inputs with Uncertainty."
                ]
            }
        ]
    },
    {
        "year": "1991",
        "name": "4th UIST 1991",
        "info": "Hilton Head, South Carolina, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/uist/1991",
                "sub_name": "Proceedings of the 4th Annual ACM Symposium on User Interface Software and Technology, UIST 1991, Hilton Head, South Carolina, USA, November 11-13, 1991.",
                "count": 24,
                "papers": [
                    "Hybrid user interfaces: breeding virtually bigger interfaces for physically smaller computers.",
                    "On temporal-spatial realism in the virtual reality environment.",
                    "The DigitalDesk calculator: tangible manipulation on a desk top display.",
                    "Buttons as first class objects on an X desktop.",
                    "EmbeddedButtons: documents as user interfaces.",
                    "Interactive graph layout.",
                    "A nose gesture interface device: extending virtual realities.",
                    "Primitives for programming multi-user interfaces.",
                    "MMM: a user interface architecture for shared editors on a single screen.",
                    "Comparing the programming demands of single-user and multi-user applications.",
                    "The PICASSO applications framework.",
                    "An event-object recovery model for object-oriented user interfaces.",
                    "SUIT: the Pascal of user interface toolkits.",
                    "Stylus user interfaces for manipulating text.",
                    "Issues in combining marking and direct manipulation techniques.",
                    "Smoothly integrating rule-based techniques into a direct manipulation interface builder.",
                    "The importance of pointer variables in constraint models.",
                    "A general framework for Bi-directional translation between abstract and pictorial data.",
                    "A model for input and output of multilingual text in a windowing environment.",
                    "XJp system: an internationalized language interface for the X Window system.",
                    "A flexible Chinese character input scheme.",
                    "A unidraw-based user interface builder.",
                    "Separating application code from toolkits: eliminating the spaghetti of call-backs.",
                    "A demonstrational technique for developing interfaces with dynamically created objects."
                ]
            }
        ]
    },
    {
        "year": "1990",
        "name": "3rd UIST 1990",
        "info": "Snowbird, Utah, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/uist/1990",
                "sub_name": "Proceedings of the 3rd Annual ACM Symposium on User Interface Software and Technology, UIST 1990, Snowbird, Utah, USA, October 3-5, 1990.",
                "count": 19,
                "papers": [
                    "Template-based mapping of application data interactive displays.",
                    "DON: user interface presentation design assistant.",
                    "Generating user interfaces: principles and use of it style rules.",
                    "In search for ideal operating system for user interfacing.",
                    "VUIMS: a visual user interface management system.",
                    "Quick: a user-interface design kit for non-programmers.",
                    "A tour of suite user interface software.",
                    "Strategies for automatically incorporating metaphoric attributes in interface designs.",
                    "Worlds within worlds: metaphors for exploring n-dimensional virtual worlds.",
                    "Requirements for an extensible object-oriented tree/graph editor.",
                    "Glyphs: flyweight objects for user interfaces.",
                    "Creating interactive techniques by symbolically solving geometric constraints.",
                    "X toolkits: the lessons learned.",
                    "Integrating gesture and snapping into a user interface toolkit.",
                    "Tailor: creating custom user interfaces based on gesture.",
                    "Toto: a tool for selecting interaction techniques.",
                    "User control in cooperative computer-aided design.",
                    "Coupling a UI framework with automatic generation of context-sensitive animated help.",
                    "Druid: a system for demonstrational rapid user interface development."
                ]
            }
        ]
    },
    {
        "year": "1989",
        "name": "2nd UIST 1989",
        "info": "Williamsburg, West Virginia, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/uist/1989",
                "sub_name": "Proceedings of the 2nd Annual ACM Symposium on User Interface Software and Technology, UIST 1989, Williamsburg, West Virginia, USA, November 13-15, 1989.",
                "count": 21,
                "papers": [
                    "Specifying composite illustrations with communicative goals.",
                    "The cognitive coprocessor architecture for interactive user interfaces.",
                    "Hands-on interaction with virtual environments.",
                    "Separating user interface and functionality using a frame based data model.",
                    "Standardizing the interface between applications and UIM's.",
                    "An architecture for expert user interface and design management.",
                    "A procedure for evaluating human-computer interface development tools.",
                    "Improving usability by sharing knowledge.",
                    "Transformations on a dialog tree: rule-based maping of content to style.",
                    "Scope: automated generation of graphical interfaces.",
                    "Chisel: a system for creating highly interactive screen layouts.",
                    "Creating graphical interactive application objects by demonstration.",
                    "Graphical specification of flexible user interface displays.",
                    "Defining the presentation of application data by a graphical language.",
                    "Direct manipulation of programming: How should we design interfaces?",
                    "A gesture based user interface prototyping system.",
                    "An event language for building user interface frameworks.",
                    "A presentation manager based on application semantics.",
                    "Using GELO to visualize software systems.",
                    "Unidraw: a framework for building domain-specific.",
                    "Ensemble: a graphical user interface development system for the design and use of interactive toolkits."
                ]
            }
        ]
    },
    {
        "year": "1988",
        "name": "1st UIST 1988",
        "info": "Alberta, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/uist/1988",
                "sub_name": "Proceedings of the 1st Annual ACM Symposium on User Interface Software and Technology, UIST 1988, Alberta, Canada, October 17-19, 1988.",
                "count": 21,
                "papers": [
                    "EDGE - a Graph Based Tool for Specifying Interaction.",
                    "State Trees as Structured Finite State Machines for User Interfaces.",
                    "Extensions to C for Interface Programming.",
                    "An Overview of the C Toolkit.",
                    "The Architecture of a User Interface Toolkit.",
                    "Event-driven User Interfaces Based on Quasi-Parallelism.",
                    "The Mirage Rapid Interface Prototyping System.",
                    "Clue: A Common Lisp User Interface Environment.",
                    "UNIX Emacs: A Retrospective (lessons for flexible system design).",
                    "Interface Usage Measurements in a User Interface Management System.",
                    "Designing the Interface Designer's Interface.",
                    "ACE: A Color Expert System for User Interface Design.",
                    "XY-WINS: An Integraded Environment for Developing Graphical User Interfaces.",
                    "Building Interfaces Interactively.",
                    "Building User Interfaces by Direct Manipulation.",
                    "Using Active Data in a UIMS.",
                    "Applying a Theory of Graphical Presentation to the Graphic Design of User Interfaces.",
                    "Dynamic Construction of Animated Help from Application Context.",
                    "XVISION: A Comprehensive Software System for Image Processing Research, Education, and Applications.",
                    "A Portable User Interface for a Scientific Programming Environment.",
                    "JACK: A Toolkit for Manipulating Articulated Figures."
                ]
            }
        ]
    }
]