[
    {
        "name": "UMUAI",
        "year": "2021",
        "info": "Volume 31: 2021",
        "count": 31,
        "papers": [
            "Automatic generation and recommendation of personalized challenges for gamification.",
            "Effects of adapting to user pitch on rapport perception, behavior, and state with a social robotic learning companion.",
            "Toward neuroadaptive support technologies for improving digital reading: a passive BCI-based assessment of mental workload imposed by text difficulty and presentation speed during reading.",
            "From perception to action using observed actions to learn gestures.",
            "Personality expression and recognition in Chinese language usage.",
            "Empirical analysis of session-based recommendation algorithms.",
            "Using scaffolding to formalize digital coach support for low-literate learners.",
            "A serious game to extract Hofstede's cultural dimensions at the individual level.",
            "Meta-User2Vec model for addressing the user and item cold-start problem in recommender systems.",
            "BARGAIN: behavioral affective rule-based games adaptation interface-towards emotionally intelligent games: application on a virtual reality environment for socio-moral development.",
            "Modelling and predicting an individual's perception of advertising appeal.",
            "Preface to the special issue on fair, accountable, and transparent recommender systems.",
            "Exploring author gender in book rating and recommendation.",
            "Interplay between upsampling and regularization for provider fairness in recommender systems.",
            "A flexible framework for evaluating user and item fairness in recommender systems.",
            "The role of transparency in multi-stakeholder educational recommendations.",
            "Supporting users in finding successful matches in reciprocal recommender systems.",
            "The effects of controllability and explainability in a social recommender system.",
            "Generating post hoc review-based natural language justifications for recommender systems.",
            "Potential and effects of personalizing gameful fitness applications using behavior change intentions and Hexad user types.",
            "Multimodal modeling of collaborative problem-solving facets in triads.",
            "Personalized task difficulty adaptation based on reinforcement learning.",
            "Domain-based Latent Personal Analysis and its use for impersonation detection in social media.",
            "Personalized rehabilitation for children with cerebral palsy.",
            "Improving cold-start recommendations using item-based stereotypes.",
            "The relationship between user types and gamification designs.",
            "Improving accountability in recommender systems research through reproducibility.",
            "Device personalization for heterogeneous populations: leveraging physician expertise and national population data to identify medical device patient user groups.",
            "Acknowledgment to reviewers.",
            "Lifetime Achievement Award.",
            "James Chen Annual Award for Best Journal Article."
        ]
    },
    {
        "name": "UMUAI",
        "year": "2020",
        "info": "Volume 30: 2020",
        "count": 30,
        "papers": [
            "Learning to recommend similar items from human judgments.",
            "Going deeper: Automatic short-answer grading by combining student and question models.",
            "Creating user stereotypes for persona development from qualitative data through semi-automatic subspace clustering.",
            "Multistakeholder recommendation: Survey and research directions.",
            "Visualising alignment to support students' judgment of confidence in open learner models.",
            "Preface to the Special Issue on user modeling for personalized interaction with music.",
            "Effects of personal characteristics in control-oriented user interfaces for music recommender systems.",
            "An investigation on the user interaction modes of conversational recommender systems for the music domain.",
            "Effects of recommendations on the playlist creation behavior of users.",
            "Preface to the special issue on harnessing personal tracking data for personalization and sense-making.",
            "Sentient destination prediction.",
            "User-adaptive models for activity and emotion recognition using deep transfer learning and data augmentation.",
            "Modeling real-time data and contextual information from workouts in eCoaching platforms to predict users' sharing behavior on Facebook.",
            "Personalized support for well-being at work: an overview of the SWELL project.",
            "Personalized weight loss strategies by mining activity tracker data.",
            "Myrror: a platform for holistic user modeling.",
            "A recommendation approach for user privacy preferences in the fitness domain.",
            "Activity recognition using wearable sensors for tracking the elderly.",
            "Correction to: A case study of intended versus actual experience of adaptivity in a tangible storytelling system.",
            "Research directions in session-based and sequential recommendation.",
            "Using autoencoders for session-based job recommendations.",
            "Applying reranking strategies to route recommendation using sequence-aware evaluation.",
            "Session-aware news recommendations using random walks on time-evolving heterogeneous information networks.",
            "Acknowledgment to reviewers.",
            "Impact of inquiry interventions on students in e-learning and classroom environments using affective computing framework.",
            "Nonparametric user activity modelling and prediction.",
            "Better targeting of consumers: Modeling multifactorial gender and biological sex from Instagram posts.",
            "Beyond binary correctness: Classification of students' answers in learning systems.",
            "Modeling the behavior of persons with mild cognitive impairment or Alzheimer's for intelligent environment simulation.",
            "Development of measurement instrument for visual qualities of graphical user interface elements (VISQUAL): a test in the context of mobile game icons."
        ]
    },
    {
        "name": "UMUAI",
        "year": "2019",
        "info": "Volume 29: 2019",
        "count": 27,
        "papers": [
            "Preface to the UMUAI special issue on personalized delivery of cultural heritage content: perspectives on 7 years of progress in the field.",
            "A cognition-centered personalization framework for cultural-heritage content.",
            "Empowering cultural heritage professionals with tools for authoring and deploying personalised visitor experiences.",
            "Enhancing cultural recommendations through social and linked open data.",
            "An evolving museum metaphor applied to cultural heritage for personalized content delivery.",
            "Personalized and content adaptive cultural heritage path recommendation: an application to the Gournia and Çatalhöyük archaeological sites.",
            "Trends in content-based recommendation - Preface to the special issue on Recommender systems based on rich item descriptions.",
            "Content-based artwork recommendation: integrating painting metadata with neural and manually-engineered visual features.",
            "Movie genome: alleviating new item cold start in movie recommendation.",
            "Affective recommender systems in online news industry: how emotions influence reading choices.",
            "A comparative analysis of recommender systems based on item aspect opinions extracted from user reviews.",
            "Addressing the user cold start with cross-domain collaborative filtering: exploiting item metadata in matrix factorization.",
            "Connectionist recommendation in the wild: on the utility and scrutability of neural networks for personalized course guidance.",
            "Feature-combination hybrid recommender systems for automated music playlist continuation.",
            "A methodology for creating and validating psychological stories for conveying and measuring psychological traits.",
            "Gameful Experience Questionnaire (GAMEFULQUEST): an instrument for measuring the perceived gamefulness of system use.",
            "Subprofile-aware diversification of recommendations.",
            "Exploring user behavioral data for adaptive cybersecurity.",
            "Preface to the special issue on learning analytics and personalised support across spaces.",
            "Detecting students-at-risk in computer programming classes with learning analytics from students' digital footprints.",
            "Exploring emotional and cognitive dynamics of Knowledge Building in grades 1 and 2.",
            "Automated gaze-based mind wandering detection during computerized learning in classrooms.",
            "Data-informed design parameters for adaptive collaborative scripting in across-spaces learning situations.",
            "Acknowledgement to reviewers.",
            "Conflict resolution in group decision making: insights from a simulation study.",
            "Equipping the ACT-R cognitive architecture with a temporal ratio model of memory and using it in a new intelligent adaptive interface.",
            "Gaze analysis of user characteristics in magazine style narrative visualizations."
        ]
    },
    {
        "name": "UMUAI",
        "year": "2018",
        "info": "Volume 28: 2018",
        "count": 13,
        "papers": [
            "A computational model for designing energy behaviour change interventions.",
            "Gamification, quantified-self or social networking? Matching users' goals with motivational technology.",
            "Towards incorporating personality into the design of an interface: a method for facilitating users' interaction with the display.",
            "Coherence and inconsistencies in rating behavior: estimating the magic barrier of recommender systems.",
            "Student success prediction in MOOCs.",
            "James Chen Annual Award for Best Journal Article.",
            "The details matter: methodological nuances in the evaluation of student models.",
            "Personalizing recommendation diversity based on user personality.",
            "Inferring user interests in microblogging social networks: a survey.",
            "Evaluation of session-based recommendation algorithms.",
            "Identifying factors that influence the acceptability of smart devices: implications for recommendations.",
            "Validating gameplay activity inventory (GAIN) for modeling player profiles.",
            "Acknowledgment to reviewers."
        ]
    },
    {
        "name": "UMUAI",
        "year": "2017",
        "info": "Volume 27: 2017",
        "count": 13,
        "papers": [
            "Preface to the UMUAI special issue on the impact of learner modeling.",
            "Learner modeling for adaptive scaffolding in a Computational Thinking-based science learning environment.",
            "Enhancing learning outcomes through self-regulated learning support with an Open Learner Model.",
            "Elo-based learner modeling for the adaptive practice of facts.",
            "Affective learning: improving engagement and enhancing learning with affect-aware feedback.",
            "MobiGuide: a personalized and patient-centric decision-support system and its evaluation in the atrial fibrillation and gestational diabetes domains.",
            "A therapy-driven gamification framework for hand rehabilitation.",
            "Adaptive user modelling in car racing games using behavioural and physiological data.",
            "Bayesian knowledge tracing, logistic models, and beyond: an overview of learner modeling techniques.",
            "Session-based item recommendation in e-commerce: on short-term intents, reminders, trends and discounts.",
            "A systematic review and taxonomy of explanations in decision support and recommender systems.",
            "A knowledge-based approach to user interface adaptation from preferences and for special needs.",
            "James Chen annual award for best journal article."
        ]
    },
    {
        "name": "UMUAI",
        "year": "2016",
        "info": "Volume 26: 2016",
        "count": 17,
        "papers": [
            "Distributional semantic pre-filtering in context-aware recommender systems.",
            "Automatic gaze-based user-independent detection of mind wandering during computerized reading.",
            "Towards reproducibility in recommender-systems research.",
            "Preface to the special issue on personality in personalized systems.",
            "Computational personality recognition in social media.",
            "The role of personality in shaping social networks and mediating behavioral change.",
            "Examining the predictive relationship between personality and emotion traits and students' agent-directed emotions: towards emotionally-adaptive agent-based learning environments.",
            "Alleviating the new user problem in collaborative filtering by exploiting personality information.",
            "Behavlets: a method for practical player modelling using psychology-based player traits and domain specific features.",
            "Prediction of individual learning curves across information visualizations.",
            "Understanding the role of latent feature diversification on choice difficulty and satisfaction.",
            "James Chen Annual Award for Best Journal Article.",
            "Fostering parent-child dialog through automated discussion suggestions.",
            "A differential privacy framework for matrix factorization recommender systems.",
            "Learning with intelligent tutors and worked examples: selecting learning activities adaptively leads to better learning outcomes than a fixed curriculum.",
            "Extracting relevance and affect information from physiological text annotation.",
            "Editorial note."
        ]
    },
    {
        "name": "UMUAI",
        "year": "2015",
        "info": "Volume 25: 2015",
        "count": 13,
        "papers": [
            "An automatic methodology to evaluate personalized information retrieval systems.",
            "A supervised active learning framework for recommender systems based on decision trees.",
            "Adaptation in serious games for upper-limb rehabilitation: an approach to improve training outcomes.",
            "Recommender systems based on user reviews: the state of the art.",
            "Adapting virtual camera behaviour through player modelling.",
            "Preface to the special issue on ubiquitous user modeling and user-adapted interaction.",
            "When user modeling intersects software engineering: the info-bead user modeling approach.",
            "Statistical models for unobtrusively detecting abnormal periods of inactivity in older adults.",
            "Trust-based decision-making for smart and adaptive environments.",
            "Augmenting service recommender systems by incorporating contextual opinions from user reviews.",
            "Methods for web revisitation prediction: survey and experimentation.",
            "Evaluation of topic-based adaptation and student modeling in QuizGuide.",
            "What recommenders recommend: an analysis of recommendation biases and possible countermeasures."
        ]
    },
    {
        "name": "UMUAI",
        "year": "2014",
        "info": "Volume 24: 2014",
        "count": 15,
        "papers": [
            "Preface to the special issue on context-aware recommender systems.",
            "Experimental evaluation of context-dependent collaborative filtering using item splitting.",
            "Comparing context-aware recommender systems in terms of accuracy and diversity.",
            "Time-aware recommender systems: a comprehensive survey and analysis of existing evaluation protocols.",
            "Hybreed: A software framework for developing context-aware hybrid recommender systems.",
            "A case study of intended versus actual experience of adaptivity in a tangible storytelling system.",
            "A comparative study of collaboration-based reputation models for social recommender systems.",
            "James Chen Annual Award for Best Journal Article.",
            "Personalised viewing-time prediction in museums.",
            "Identification of human implicit visual search intention based on eye movement and pupillary analysis.",
            "Preface to the special issue on personalization and behavior change.",
            "Tailoring real-time physical activity coaching systems: a literature survey and model.",
            "The persuasive effects of personalization through: name mentioning in a smoking cessation message.",
            "A trace-based approach to identifying users' engagement and qualifying their engaged-behaviours in interactive systems: application to a social game.",
            "Modeling the efficacy of persuasive strategies for different gamer types in serious games for health."
        ]
    },
    {
        "name": "UMUAI",
        "year": "2013",
        "info": "Volume 23: 2013",
        "count": 14,
        "papers": [
            "Leveraging machine-learned detectors of systematic inquiry behavior to estimate and predict transfer of inquiry skill.",
            "A PLA-based privacy-enhancing user modeling framework and its evaluation.",
            "Preface to the Special Issue on Personalization in Social Web systems.",
            "The evaluation of a social adaptive website for cultural events.",
            "A knowledge-tracing model of learning from a social tagging system.",
            "Cross-system user modeling and personalization on the Social Web.",
            "Facebook single and cross domain data for recommendation systems.",
            "Exploring social tagging for personalized community recommendations.",
            "Adaptive notifications to support knowledge sharing in close-knit virtual communities.",
            "Creating a model of the dynamics of socio-technical groups.",
            "Personalised Information Retrieval: survey and classification.",
            "James Chen Annual Award for Best Journal Article.",
            "Recommending people to people: the nature of reciprocal recommenders with a case study in online dating.",
            "Real-time rule-based classification of player types in computer games."
        ]
    },
    {
        "name": "UMUAI",
        "year": "2012",
        "info": "Volume 22: 2012",
        "count": 18,
        "papers": [
            "Coming of age: celebrating a quarter century of user modeling and personalization: Guest editors' introduction.",
            "A review of recent advances in learner and skill modeling in intelligent learning environments.",
            "Fifteen years of constraint-based tutors: what we have achieved and where we are going.",
            "Personalization in cultural heritage: the road travelled and the one ahead.",
            "Recommender systems: from algorithms to user experience.",
            "Critiquing-based recommenders: survey and emerging trends.",
            "Discovery of Web user communities and their role in personalization.",
            "Motivating participation in social computing applications: a user modeling perspective.",
            "Personalization and privacy: a survey of privacy risks and remedies in personalization-based systems.",
            "James Chen annual award for best journal article.",
            "Context-dependent awareness support in open collaboration environments.",
            "Tune in to your emotions: a robust personalized affective music player.",
            "Modeling sequences of user actions for statistical goal recognition.",
            "Preface to the special issue on user interfaces for recommender systems.",
            "Evaluating recommender systems from the user's perspective: survey of the state of the art.",
            "Designing interfaces for explicit preference elicitation: a user-centered investigation of preference representation and elicitation process.",
            "Evaluating the effectiveness of explanations for recommender systems - Methodological issues and empirical studies on the impact of personalization.",
            "Explaining the user experience of recommender systems."
        ]
    },
    {
        "name": "UMUAI",
        "year": "2011",
        "info": "Volume 21: 2011",
        "count": 15,
        "papers": [
            "Preface to the special issue on data mining for personalised educational systems.",
            "A personalized learning content adaptation mechanism to meet diverse user needs in mobile learning environments.",
            "Activity sequence modelling and dynamic clustering for personalized e-learning.",
            "An analysis of students' gaming behaviors in an intelligent tutoring system: predictors and impacts.",
            "Empirically evaluating the application of reinforcement learning to the induction of effective and adaptive pedagogical strategies.",
            "Content-free collaborative learning modeling using data mining.",
            "A data mining approach to guide students through the enrollment process based on academic performance.",
            "Evaluating and improving adaptive educational systems with learning curves.",
            "User model interoperability: a survey.",
            "Preface to the special issue on personalization for e-health.",
            "Motivating reflection about health within the family: the use of goal setting and tailored feedback.",
            "Towards personalized decision support in the dementia domain based on clinical practice guidelines.",
            "Personalized emergency medical assistance for disabled people.",
            "A user modeling approach for reasoning about interaction sensitive to bother and its application to hospital decision scenarios.",
            "Design and implementation of a web-based Tailored Gymnasium to enhance self-management of Fibromyalgia."
        ]
    },
    {
        "name": "UMUAI",
        "year": "2010",
        "info": "Volume 20: 2010",
        "count": 12,
        "papers": [
            "PERSONAF: framework for personalised ontological reasoning in pervasive computing.",
            "A query expansion and user profile enrichment approach to improve the performance of recommender systems operating on a folksonomy.",
            "Exploring the feasibility of web form adaptation to users' cultural dimension scores.",
            "Automatic detection of users' skill levels using high-frequency user interface events.",
            "Multimodal semi-automated affect detection from conversational cues, gross body language, and facial features.",
            "User-adaptive explanatory program visualization: evaluation and insights from eye movements.",
            "Towards personality-based user adaptation: psychologically informed stylistic language generation.",
            "Using affective parameters in a content-based recommender system for images.",
            "Towards affective camera control in games.",
            "User preferences can drive facial expressions: evaluating an embodied conversational agent in a recommender dialogue system.",
            "Layered evaluation of interactive adaptive systems: framework and formative methods.",
            "Learners' navigation behavior identification based on trace analysis."
        ]
    },
    {
        "name": "UMUAI",
        "year": "2009",
        "info": "Volume 19: 2009",
        "count": 14,
        "papers": [
            "Preface to the special issue on data mining for personalization.",
            "Search personalization through query and page topical analysis.",
            "Cross-representation mediation of user models.",
            "Unsupervised strategies for shilling detection and robust collaborative filtering.",
            "An architecture for making recommendations to courseware authors using association rule mining and collaborative filtering.",
            "Case-studies on exploiting explicit customer requirements in recommender systems.",
            "Interaction design guidelines on critiquing-based recommender systems.",
            "Managing uncertainty in group recommending processes.",
            "Addressing the assessment challenge with an online system that tutors as it assesses.",
            "Empirically building and evaluating a probabilistic model of user affect.",
            "Can eyes reveal interest? Implicit queries from gaze patterns.",
            "Log file analysis for disengagement detection in e-Learning environments.",
            "CTRL: A research framework for providing adaptive collaborative learning support.",
            "Adaptive systems in the era of the semantic and social web, a survey."
        ]
    },
    {
        "name": "UMUAI",
        "year": "2008",
        "info": "Volume 18: 2008",
        "count": 16,
        "papers": [
            "Introduction to special Issue on 'Affective modeling and adaptation'.",
            "The relative impact of student affect on performance models in a spoken dialogue tutoring system.",
            "Automatic detection of learner's affect from conversational cues.",
            "Modeling self-efficacy in intelligent tutoring systems: An inductive approach.",
            "Diagnosing and acting on student affect: the tutor's perspective.",
            "Private emotions versus social interaction: a data-driven approach towards analysing emotion in speech.",
            "Entertainment capture through heart rate activity in physical interactive playgrounds.",
            "Mediation of user models for enhanced personalization in recommender systems.",
            "Developing a generalizable detector of when students game the system.",
            "MUSIPER: a system for modeling music similarity perception based on objective feature subset selection.",
            "A multifactor approach to student model evaluation.",
            "Preface.",
            "LISTEN: a user-adaptive audio-augmented museum guide.",
            "A stroll with Carletto: adaptation in drama-based tours with virtual characters.",
            "The effects of transparency on trust in and acceptance of a content-based art recommender.",
            "Tag-based user modeling for social multi-device adaptive guides."
        ]
    },
    {
        "name": "UMUAI",
        "year": "2007",
        "info": "Volume 17: 2007",
        "count": 17,
        "papers": [
            "Introduction to the special issue on statistical and probabilistic methods for user modeling.",
            "A hybrid approach for improving predictive accuracy of collaborative filtering algorithms.",
            "Efficient and non-parametric reasoning over user preferences.",
            "Personalizing influence diagrams: applying online learning strategies to dialogue management.",
            "Improving command and control speech recognition on mobile devices: using predictive user models for language modeling.",
            "Adaptive testing for hierarchical student models.",
            "Complementary computing: policies for transferring callers from dialog systems to human receptionists.",
            "Discovering stages in web navigation for problem-oriented navigation support.",
            "A content-collaborative recommender that exploits WordNet-based user profiles for neighborhood formation.",
            "Adaptive, intelligent presentation of information for the museum visitor in PEACH.",
            "The role of human factors in stereotyping behavior and perception of digital library users: a robust clustering approach.",
            "Navigation behavior models for link structure optimization.",
            "Adaptive feedback generation to support teachers in web-based distance education.",
            "Modeling the progression of Alzheimer's disease for cognitive assistance in smart homes.",
            "Inferences, suppositions and explanatory extensions in argument interpretation.",
            "Predicting time-sharing in mobile interaction.",
            "Editorial Note."
        ]
    },
    {
        "name": "UMUAI",
        "year": "2006",
        "info": "Volume 16: 2006",
        "count": 18,
        "papers": [
            "A Model of Perceptual Task Effort for Bar Charts and its Role in Recognizing Intention.",
            "The influence of personality factors on visitor attitudes towards adaptivity dimensions for mobile museum guides.",
            "TV Program Recommendation for Multiple Viewers Based on user Profile Merging.",
            "Using Dialogue Features to Predict Trouble During Collaborative Learning.",
            "User-centred Design of Flexible Hypermedia for a Mobile Guide: Reflections on the HyperAudio Experience.",
            "How do Experts Adapt their Explanations to a Layperson's Knowledge in Asynchronous Communication? An Experimental Study.",
            "An LDAP-based User Modeling Server and its Evaluation.",
            "Preface to the special issue on user modeling to support groups, communities and collaboration.",
            "Creating cognitive tutors for collaborative learning: steps toward realization.",
            "Modeling individual and collaborative problem-solving in medical problem-based learning.",
            "Using shared representations to improve coordination and intent inference.",
            "In pursuit of satisfaction and the prevention of embarrassment: affective state in group recommender systems.",
            "Design and evaluation of an adaptive incentive mechanism for sustained educational online communities.",
            "Coalescing individual and collaborative learning to model user linguistic competences.",
            "The impact of learning styles on student grouping for collaborative learning: a case study.",
            "Learned student models with item to item knowledge structures.",
            "MASHA: A multi-agent system handling user and device adaptivity of Web sites.",
            "Editorial Note."
        ]
    },
    {
        "name": "UMUAI",
        "year": "2005",
        "info": "Volume 15: 2005",
        "count": 16,
        "papers": [
            "Preface to the Special Issue on Language-Based Interaction.",
            "A Probabilistic Approach for Argument Interpretation.",
            "A Model to Disambiguate Natural Language Parses on the Basis of User Language Proficiency: Design and Evaluation.",
            "Using Dialogue Features to Predict Trouble During Collaborative Learning.",
            "Tailoring Automatically Generated Hypertext.",
            "User Modeling in Spoken Dialogue Systems to Generate Flexible Guidance.",
            "User Modeling and User-Adapted Interaction.",
            "Preface to the Special Issue on User Modeling in Ubiquitous Computing.",
            "Consistent Modelling of Users, Devices and Sensors in a Ubiquitous Computing Environment.",
            "Exploring Issues of User Model Transparency and Proactive Behaviour in an Office Environment Control System.",
            "Personalization and Context Management.",
            "User-Centred Design of Flexible Hypermedia for a Mobile Guide: Reflections on the HyperAudio Experience.",
            "Ontology-Based User Modeling in an Augmented Audio Reality System for Museums.",
            "Combining Experimental Observations and Modelling in Investigating Feedback and Emotions in Repeated Selection Tasks.",
            "Personal Content Recommender Based on a Hierarchical User Model for the Selection of TV Programmes.",
            "Modeling Elementary Cognitive Abilities for Adaptive Hypermedia Presentation."
        ]
    },
    {
        "name": "UMUAI",
        "year": "2004",
        "info": "Volume 14: 2004",
        "count": 19,
        "papers": [
            "Preface: Special Issue on User Modeling and Personalization for Television.",
            "Improving the Quality of the Personalized Electronic Program Guide.",
            "Group Modeling: Selecting a Sequence of Television Items to Suit a Group of Viewers.",
            "Categorization of Japanese TV Viewers Based on Program Genres They Watch.",
            "Personalcasting: Tailored Broadcast News.",
            "In Memoriam James R. Chen 1955-2001.",
            "Preface to Special Issue on User Modeling for Web Information Retrieval.",
            "Anatomy and Empirical Evaluation of an Adaptive Web-Based Information Filtering System.",
            "User Involvement in Automatic Filtering: An Experimental Study.",
            "User Modelling for News Web Sites with Word Sense Based Techniques.",
            "Interactive Information Retrieval Using Clustering and Spatial Proximity.",
            "A Framework for the Initialization of Student Models in Web-based Intelligent Tutoring Systems.",
            "Empirical Derivation of a Sequence of User Stereotypes for Language Learning.",
            "Computational Modeling and Analysis of Knowledge Sharing in Collaborative Distance Learning.",
            "Exploiting Query Repetition and Regularity in an Adaptive Community-Based Web Search Engine.",
            "Knowledge Discovery with Genetic Programming for Providing Feedback to Courseware Authors.",
            "James Chen Annual Award for Best Journal Article.",
            "Editorial Note.",
            "User Modeling and User-Adapted Interaction."
        ]
    },
    {
        "name": "UMUAI",
        "year": "2003",
        "info": "Volume 13: 2003",
        "count": 12,
        "papers": [
            "Editorial.",
            "A Movie Recommendation System - An Application of Voting Theory in User Modeling.",
            "A System for Building Intelligent Agents that Learn to Retrieve and Extract Information.",
            "Negotiated Collusion: Modeling Social Languageand its Relationship Effects in Intelligent Agents.",
            "Interactive Improvisational Music Companionship: A User-Modeling Approach.",
            "Multi-Agent Multi-User Modeling in I-Help.",
            "Personalizing the Interaction in a Web-based Educational Hypermedia System: the case of INSPIRE.",
            "Probabilistic Student Modelling to Improve Exploratory Behaviour.",
            "User Modeling and User-Adapted Interaction.",
            "Web Usage Mining as a Tool for Personalization: A Survey.",
            "User Attitudes Regarding a User-Adaptive eCommerce Web Site.",
            "Book Review: Building Natural Language Generation Systems."
        ]
    },
    {
        "name": "UMUAI",
        "year": "2002",
        "info": "Volume 12: 2002",
        "count": 14,
        "papers": [
            "Assessment of User Affective and Belief States for Interface Adaptation: Application to an Air Force Pilot Task.",
            "Modeling Multimodal Expression of User's Affective Subjective Experience.",
            "Rosalind Picard: Affective Computing.",
            "Ana Paiva (ed.): Affective Interactions: Towards a New Generation of Computer Interfaces.",
            "Introduction to the Special Issue on Empirical Evaluation of User Models and User Modeling Systems.",
            "Designing and Evaluating an Adaptive Spoken Dialogue System.",
            "User Models and User Physical Capability.",
            "Evaluating Comprehension-Based User Models: Predicting Individual User Planning and Action.",
            "The Use of a Co-operative Student Model of Learner Characteristics to Configure a Multimedia Application.",
            "Using Evaluation to Shape ITS Design: Results and Experiences with SQL-Tutor.",
            "A Bayesian Diagnostic Algorithm for Student Modeling and its Evaluation.",
            "Hybrid Recommender Systems: Survey and Experiments.",
            "Using Bayesian Networks to Manage Uncertainty in Student Modeling.",
            "Book Review: User Interfaces for All: Concepts, Methods and Tools."
        ]
    },
    {
        "name": "UMUAI",
        "year": "2001",
        "info": "Volume 11: 2001",
        "count": 16,
        "papers": [
            "Preface.",
            "Predictive Statistical Models for User Modeling.",
            "Machine Learning for User Modeling.",
            "Techniques for Plan Recognition.",
            "Generic User Modeling Systems.",
            "User Modeling in Human-Computer Interaction.",
            "Adaptive Hypermedia.",
            "Learner Control.",
            "Natural Language Processing and User Modeling: Synergies and Limitations.",
            "Adaptive Techniques for Universal Access.",
            "Empirical Evaluation of User Models and User-Adapted Systems.",
            "Information Filtering: Overview of Issues, Research and Systems.",
            "M. Kyng and L. Mathiassen (eds.), Computers and Design in Context.",
            "Preface: Towards Adaptation of Interaction to Affective Factors.",
            "How Convincing is Mr. Data's Smile: Affective Expressions of Machines.",
            "Modeling Emotion and Attitude in Speech by Means of Perceptually Based Parameter Values."
        ]
    },
    {
        "name": "UMUAI",
        "year": "2000",
        "info": "Volume 10: 2000",
        "count": 12,
        "papers": [
            "ADAPT: A Predictive Cognitive Model of User Visual Attention and Action Planning.",
            "The Evaluation of a Personalised Health Information System for Patients with Cancer.",
            "Mark Maybury (Author), Intelligent Multimedia Information Retrieval.",
            "Preface.",
            "Modeling Student Knowledge: Cognitive Tutors in High School and College.",
            "Minimalist User Modelling in a Complex Commercial Software System.",
            "User Modeling for Adaptive News Access.",
            "Recommender Systems for Learning: Building User and Expert Models through Long-Term Observation of Application Use.",
            "A Review and Analysis of Commercial User Modeling Servers for Personalization on the World Wide Web.",
            "Tailoring the Interaction with Users in Web Stores.",
            "Herbert Clarck, Using Language.",
            "Gillian Brown, Speakers, Listeners, and Communication: Explorations in Discourse Analysis."
        ]
    },
    {
        "name": "UMUAI",
        "year": "1999",
        "info": "Volume 9: 1999",
        "count": 10,
        "papers": [
            "Lifelike Pedagogical Agents for Mixed-initiative Problem Solving in Constructivist Learning Environments.",
            "Mixed-Initiative Issues in an Agent-Based Meeting Scheduler.",
            "Exploring Mixed-Initiative Dialogue Using Computer Dialogue Simulation.",
            "A Computational Mechanism for Initiative in Answer Generation.",
            "User-Tailored Planning of Mixed Initiative Information-Seeking Dialogues.",
            "An Approach to Mixed Initiative Spoken Information Retrieval Dialogue.",
            "Erratum.",
            "Logic-Based Representation and Reasoning for User Modeling Shell Systems.",
            "A Fuzzy-Based Approach to Stereotype Selection in Hypermedia.",
            "Human Plausible Reasoning for Intelligent Help."
        ]
    },
    {
        "name": "UMUAI",
        "year": "1998",
        "info": "Volume 8: 1998",
        "count": 13,
        "papers": [
            "Preface to UMUAI Special Issue on Machine Learning for User Modeling.",
            "Bayesian Models for Keyhole Plan Recognition in an Adventure Game.",
            "Bayesian Update of Recursive Agent Models.",
            "Exploring Versus Exploiting when Learning User Models for Text Recommendation.",
            "Discovering Error Classes from Discrepancies in Novice Behaviors Via Multistrategy Conceptual Clustering.",
            "Using Decision Trees for Agent Modeling: Improving Prediction Performance.",
            "Context and Consciousness: Activity Theory and Human Computer Interaction, Bonnie A. Nardi (ed.).",
            "Case Based Reasoning, by Janet Kolodner and Morgan Kaufmann.",
            "Preface.",
            "What is Initiative?",
            "An Evidential Model for Tracking Initiative in Collaborative Dialogue Interactions.",
            "An Analysis of Initiative Selection in Collaborative Task-Oriented Discourse.",
            "COLLAGEN: A Collaboration Manager for Software Interface Agents."
        ]
    },
    {
        "name": "UMUAI",
        "year": "1997",
        "info": "Volume 7: 1997",
        "count": 14,
        "papers": [
            "A Model for Adapting Explanations to the User's Likely Inferences.",
            "ABIS-96: GI Workshop on Adaptivity and User Modeling in Interactive Software Systems.",
            "Thomas K. Landauer / The Trouble with Computers: Usefulness, Usability, and Productivity.",
            "A Concurrent, Distributed Architecture for Diagnostic Reasoning.",
            "Plan Recognition and Evaluation for On-line Critiquing.",
            "The State of the Art in Text Filtering.",
            "A Feature-based Approach to Recommending Selections based on Past Preferences.",
            "Wiederverwendung von Plänen in deduktiven Planungssystemen (Reuse of Plans in Deductive Planning Systems), by Jana Köhler.",
            "User Models and Filtering Agents for Improved Internet Information Retrieval.",
            "Information Filtering Using User's Context on Browsing in Hypertext.",
            "Proficiency-Adapted Information Browsing and Filtering in Hypermedia Educational Systems.",
            "Feature-based and Clique-based User Models for Movie Selection: A Comparative Study.",
            "Bis-97: Gi Workshop on Adaptivity and User Modeling in Interactive Software Systems.",
            "Intelligent Scheduling: Monte Zweban, Mark S. Fox, Morgan Kaufmann."
        ]
    },
    {
        "name": "UMUAI",
        "year": "1996",
        "info": "Volume 6: 1996",
        "count": 10,
        "papers": [
            "Design and Evaluation of an Adaptive Icon Toolbar.",
            "Requirements for Belief Models in Cooperative Dialogue.",
            "ABIS-95 - GI Workshop an Adaptivity and User Modeling in Interactive Software Systems.",
            "Methods and Techniques of Adaptive Hypermedia.",
            "Hypadapter: An Adaptive Hypertext System for Exploratory Learning and Programming.",
            "A Glass Box Approach to Adaptive Hypermedia.",
            "A Task-Centered Approach for User Modeling in a Hypermedia Office Documentation System.",
            "User-Centered Indexing for Adaptive Information Access.",
            "INSTRUCT: Modeling Students by Asking Questions.",
            "Development of a Model of User Attributes and its Implementation within an Adaptive Tutoring System."
        ]
    },
    {
        "name": "UMUAI",
        "year": "1995",
        "info": "Volume 5: 1995",
        "count": 11,
        "papers": [
            "Smart: Student Modeling Approach for Responsive Tutoring.",
            "Extending the Scope of the Student Model.",
            "An Adaptive Student Centered Curriculum for an Intelligent Training System.",
            "Student Diagnosis in Practice; Bridging a Gap.",
            "Feature Based Modelling: A Methodology for Producing Coherent, Consistent, Dynamically Changing Models of Agents' Competencies.",
            "Using Dynamic User Models in the Recognition of the Plans of the User.",
            "Numerical Uncertainty Management in User and Student Modeling: An Overview of Systems and Issues.",
            "The Role of Probability-Based Inference in an Intelligent Tutoring System.",
            "User-Expertise Modeling with Empirically Derived Probabilistic Implication Networks.",
            "A Dempster-Shafer Approach to Modeling Agent Preferences for Plan Recognition.",
            "Fuzzy Techniques and User Modeling in Sales Assistants."
        ]
    },
    {
        "name": "UMUAI",
        "year": "1994",
        "info": "Volume 4: 1994/1995",
        "count": 10,
        "papers": [
            "Metadoc: An Adaptive Hypertext Reading System.",
            "User Modelling in the Interactive Anatomy Tutoring System ANATOM-TUTOR.",
            "The User Modeling Shell System BGP-MS.",
            "Heterogeneous Learning in the Doppelgänger User Modeling System.",
            "ABIS-94: GI Workshop an Adaptivity and User Modeling in Interactive Software Systems.",
            "The um Toolkit for Coopertive User Modeling.",
            "TAGUS - A User and Leamer Modeling Workbench.",
            "Modelling the Student in Pitagora 2.0.",
            "Knowledge Tracing: Modelling the Acquisition of Procedural Knowledge.",
            "A Cognitive Load Application in Tutoring."
        ]
    },
    {
        "name": "UMUAI",
        "year": "1993",
        "info": "Volume 3: 1993",
        "count": 12,
        "papers": [
            "A User Model Neural Network for a Personal News Service.",
            "Using Structural Descriptions of Interfaces to Automate the Modelling of User Cognition.",
            "Adaptive Systems: A Solution to Usability Problems.",
            "Model-Based Cognitive Diagnosis.",
            "Defining the Semantics of Extended Genetic Graphs.",
            "Consulting a User Model to Address a User's Inference during Content Planning.",
            "Adaptive Hypertext Navigation Based On User Goals and Context.",
            "User Modeling in Interactive Explanations.",
            "The Intelligent Help System COMFOHELP.",
            "User-Model-Driven Generation of Instructios.",
            "Forming User Models by Understanding User Feedback.",
            "Workshop an Adaptivity and User Modeling in Interactive Software Systems."
        ]
    },
    {
        "name": "UMUAI",
        "year": "1992",
        "info": "Volume 2: 1992",
        "count": 12,
        "papers": [
            "Weighted Abduction for Plan Ascription.",
            "A Meta-Rule Approach to Flexible Plan Recognition in Dialogue.",
            "Controlling Inference in Plan Recognition.",
            "On the Interaction between Plan Recognition and Intelligent Interfaces.",
            "Student Modeling to Support Multiple Instructional Approaches.",
            "Intention Structure and Extended Responses in a Portable Natural Language Interface.",
            "Generating Tailored Definitions Using a Multifaceted User Model.",
            "Generating Help for Users of Application Software.",
            "Modeling User Action Planning: A Comprehension Based Approach.",
            "Exploiting User Feedback to Compensate for the Unreliability of User Models.",
            "Interactive User Modeling: An Integrative Explicit-Implicit Approach.",
            "Modeling the User Knowledge by Belief Networks."
        ]
    },
    {
        "name": "UMUAI",
        "year": "1991",
        "info": "Volume 1: 1991",
        "count": 11,
        "papers": [
            "User Modelling and User Adapted Interaction in an Intelligent Tutoring System.",
            "Beliefs, Stereotypes and Dynamic Agent Modeling.",
            "Conversation with and through Computers.",
            "Revising Deductive Knowledge and Stereotypical Knowledge in a Student Model.",
            "Exploiting Temporal and Novel Information from the User in Plan Recognition.",
            "Active Acquisition of User Models: Implications for Decision-Theoretic Dialog Planning and Plan Recognition.",
            "Recognizing Intentions, Interactions, and Causes of Plan Failures.",
            "Building a User Model Implicitly from a Cooperative Advisory Dialog.",
            "Modeling Default Reasoning Using Defaults.",
            "Utilizing User Models to Handle Ambiguity and Misconceptions in Robust Plan Recognition.",
            "Generation and Selection of Likely Interpretations during Plan Recognition in Task-Oriented Consultation Systems."
        ]
    }
]