[
    {
        "year": "2021",
        "name": "13th ACML 2021",
        "info": "Virtual Event",
        "venues": [
            {
                "sub_name_abbr": "conf/acml/2021",
                "sub_name": "Asian Conference on Machine Learning, ACML 2021, 17-19 November 2021, Virtual Event.",
                "count": 115,
                "papers": [
                    "Preface / Frontmatter.",
                    "Vector Transport Free Riemannian LBFGS for Optimization on Symmetric Positive Definite Matrix Manifolds.",
                    "Understanding How Over-Parametrization Leads to Acceleration: A case of learning a single teacher neuron.",
                    "Hybrid Estimation for Open-Ended Questions with Early-Age Students' Block-Based Programming Answers.",
                    "The Power of Factorial Powers: New Parameter settings for (Stochastic) Optimization.",
                    "Local Aggressive Adversarial Attacks on 3D Point Cloud.",
                    "h-DBSCAN: A simple fast DBSCAN algorithm for big data.",
                    "CTAB-GAN: Effective Table Data Synthesizing.",
                    "Fairness constraint of Fuzzy C-means Clustering improves clustering fairness.",
                    "Meta-Model-Based Meta-Policy Optimization.",
                    "An Aligned Subgraph Kernel Based on Discrete-Time Quantum Walk.",
                    "On the Convex Combination of Determinantal Point Processes.",
                    "Encoder-decoder-based image transformation approach for integrating precipitation forecasts.",
                    "A Mutual Information Regularization for Adversarial Training.",
                    "BRAC+: Improved Behavior Regularized Actor Critic for Offline Reinforcement Learning.",
                    "Cautious Actor-Critic.",
                    "Quaternion Graph Neural Networks.",
                    "Expressive Neural Voice Cloning.",
                    "SPDE-Net: Neural Network based prediction of stabilization parameter for SUPG technique.",
                    "DDSAS: Dynamic and Differentiable Space-Architecture Search.",
                    "Sinusoidal Flow: A Fast Invertible Autoregressive Flow.",
                    "Uplift Modeling with High Class Imbalance.",
                    "Iterative Deep Model Compression and Acceleration in the Frequency Domain.",
                    "Penalty Method for Inversion-Free Deep Bilevel Optimization.",
                    "CTS2: Time Series Smoothing with Constrained Reinforcement Learning.",
                    "Open Images V5 Text Annotation and Yet Another Mask Text Spotter.",
                    "Language Representations for Generalization in Reinforcement Learning.",
                    "Temporal Relation based Attentive Prototype Network for Few-shot Action Recognition.",
                    "An Optimistic Acceleration of AMSGrad for Nonconvex Optimization.",
                    "Dynamic Coordination Graph for Cooperative Multi-Agent Reinforcement Learning.",
                    "S2TNet: Spatio-Temporal Transformer Networks for Trajectory Prediction in Autonomous Driving.",
                    "Solving Machine Learning Problems.",
                    "Pedestrian Wind Factor Estimation in Complex Urban Environments.",
                    "DPOQ: Dynamic Precision Onion Quantization.",
                    "A Causal Approach for Unfair Edge Prioritization and Discrimination Removal.",
                    "Spatial Temporal Enhanced Contrastive and Pretext Learning for Skeleton-based Action Representation.",
                    "QActor: Active Learning on Noisy Labels.",
                    "Max-Utility Based Arm Selection Strategy For Sequential Query Recommendations.",
                    "Multi-task Actor-Critic with Knowledge Transfer via a Shared Critic.",
                    "Contrastive Neural Processes for Self-Supervised Learning.",
                    "Pyramid Correlation based Deep Hough Voting for Visual Object Tracking.",
                    "calibrated adversarial training.",
                    "ASD-Conv: Monocular 3D object detection network based on Asymmetrical Segmentation Depth-aware Convolution.",
                    "Convolutional Hypercomplex Embeddings for Link Prediction.",
                    "Beyond Lp Clipping: Equalization based Psychoacoustic Attacks against ASRs.",
                    "Slice-sampling based 3D Object Classification.",
                    "Multi-Branch Network for Cross-Subject EEG-based Emotion Recognition.",
                    "Skew-symmetrically perturbed gradient flow for convex optimization.",
                    "Improving Gaussian mixture latent variable model convergence with Optimal Transport.",
                    "Generating Deep Networks Explanations with Robust Attribution Alignment.",
                    "Scalable gradient matching based on state space Gaussian Processes.",
                    "Domain Adaptive YOLO for One-Stage Cross-Domain Detection.",
                    "Hierarchical Semantic Segmentation using Psychometric Learning.",
                    "Improving Hashing Algorithms for Similarity Search \\textitvia MLE and the Control Variates Trick.",
                    "Feature Convolutional Networks.",
                    "Bias-tolerant Fair Classification.",
                    "Multi-factor Memory Attentive Model for Knowledge Tracing.",
                    "Asymptotically Exact and Fast Gaussian Copula Models for Imputation of Mixed Data Types.",
                    "Greedy Search Algorithm for Mixed Precision in Post-Training Quantization of Convolutional Neural Network Inspired by Submodular Optimization.",
                    "ExNN-SMOTE: Extended Natural Neighbors Based SMOTE to Deal with Imbalanced Data.",
                    "Geometric Value Iteration: Dynamic Error-Aware KL Regularization for Reinforcement Learning.",
                    "Collaborative Novelty Detection for Distributed Data by a Probabilistic Method.",
                    "Efficient Coreset Constructions via Sensitivity Sampling.",
                    "Dynamic Popularity-Aware Contrastive Learning for Recommendation.",
                    "Neural Graph Filtering for Context-aware Recommendation.",
                    "Lifelong Learning with Sketched Structural Regularization.",
                    "Robust Regression for Monocular Depth Estimation.",
                    "Transfer Learning with Adaptive Online TrAdaBoost for Data Streams.",
                    "Bridging Code-Text Representation Gap using Explanation.",
                    "ContriQ: Ally-Focused Cooperation and Enemy-Concentrated Confrontation in Multi-Agent Reinforcement Learning.",
                    "DAGSurv: Directed Ayclic Graph Based Survival Analysis Using Deep Neural Networks.",
                    "Modeling Risky Choices in Unknown Environments.",
                    "Expert advice problem with noisy low rank loss.",
                    "An online semi-definite programming with a generalised log-determinant regularizer and its applications.",
                    "Cross-structural Factor-topic Model: Document Analysis with Sophisticated Covariates.",
                    "Deep Structural Contrastive Subspace Clustering.",
                    "Lifelong Learning with Branching Experts.",
                    "Ensembling With a Fixed Parameter Budget: When Does It Help and Why?",
                    "Revisiting Weight Initialization of Deep Neural Networks.",
                    "Robust Model-based Reinforcement Learning for Autonomous Greenhouse Control.",
                    "Physics-inspired Learning for Structure-Aware Texture-Sensitive Underwater Image Enhancement.",
                    "Robust Domain Randomised Reinforcement Learning through Peer-to-Peer Distillation.",
                    "PFedAtt: Attention-based Personalized Federated Learning on Heterogeneous Clients.",
                    "Multi-stream based marked point process.",
                    "Bayesian Latent Factor Model for Higher-order Data.",
                    "Learning 3-opt heuristics for traveling salesman problem via deep reinforcement learning.",
                    "Time-Constrained Multi-Agent Path Finding in Non-Lattice Graphs with Deep Reinforcement Learning.",
                    "Exposing Cyber-Physical System Weaknesses by Implicitly Learning their Underlying Models.",
                    "NAS-HPO-Bench-II: A Benchmark Dataset on Joint Optimization of Convolutional Neural Network Architecture and Training Hyperparameters.",
                    "Metric Learning for comparison of HMMs using Graph Neural Networks.",
                    "Layer-Wise Neural Network Compression via Layer Fusion.",
                    "Bayesian neural network unit priors and generalized Weibull-tail property.",
                    "A Partial Label Metric Learning Algorithm for Class Imbalanced Data.",
                    "Scaling Average-Linkage via Sparse Cluster Embeddings.",
                    "Multi-scale Salient Instance Segmentation based on Encoder-Decoder.",
                    "A Two-Stage Training Framework with Feature-Label Matching Mechanism for Learning from Label Proportions.",
                    "K2-GNN: Multiple Users' Comments Integration with Probabilistic K-Hop Knowledge Graph Neural Networks.",
                    "Learn to Predict Vertical Track Irregularity with Extremely Imbalanced Data.",
                    "Semi-Open Attribute Extraction from Chinese Functional Description Text.",
                    "Regularized Mutual Learning for Personalized Federated Learning.",
                    "Relation Also Need Attention: Integrating Relation Information Into Image Captioning.",
                    "Learning to Switch Optimizers for Quadratic Programming.",
                    "Perturbing Eigenvalues with Residual Learning in Graph Convolutional Neural Networks.",
                    "Bayesian nonparametric model for arbitrary cubic partitioning.",
                    "Bayesian Inference for Optimal Transport with Stochastic Cost.",
                    "Multi-view Latent Subspace Clustering based on both Global and Local Structure.",
                    "Augmenting Imbalanced Time-series Data via Adversarial Perturbation in Latent Space.",
                    "Building Decision Tree for Imbalanced Classification via Deep Reinforcement Learning.",
                    "Speaker Diarization as a Fully Online Bandit Learning Problem in MiniVox.",
                    "Video Action Recognition with Neural Architecture Search.",
                    "Learning Maximum Margin Markov Networks from examples with missing labels.",
                    "Maximization of Monotone k-Submodular Functions with Bounded Curvature and Non-k-Submodular Functions.",
                    "Unsupervised Cycle-Consistent Network for Removing Susceptibility Artifacts in Single-shot EPI.",
                    "Hybrid Summarization with Semantic Weighting Reward and Latent Structure Detector.",
                    "Fast Rate Learning in Stochastic First Price Bidding."
                ]
            }
        ]
    },
    {
        "year": "2020",
        "name": "12th ACML 2020",
        "info": "Bangkok, Thailand",
        "venues": [
            {
                "sub_name_abbr": "conf/acml/2020",
                "sub_name": "Proceedings of The 12th Asian Conference on Machine Learning, ACML 2020, 18-20 November 2020, Bangkok, Thailand.",
                "count": 54,
                "papers": [
                    "A Distance-Weighted Class-Homogeneous Neighbourhood Ratio for Algorithm Selection.",
                    "Semantic-Guided Shared Feature Alignment for Occluded Person Re-IDentification.",
                    "Theory of Mind with Guilt Aversion Facilitates Cooperative Reinforcement Learning.",
                    "A Novel Higher-order Weisfeiler-Lehman Graph Convolution.",
                    "A One-step Approach to Covariate Shift Adaptation.",
                    "A State Aggregation Approach for Solving Knapsack Problem with Deep Reinforcement Learning.",
                    "AARM: Action Attention Recalibration Module for Action Recognition.",
                    "Atlas-aware ConvNet for Accurate yet Robust Anatomical Segmentation.",
                    "Bidirectional Dependency-Guided Attention for Relation Extraction.",
                    "Boosting-Based Reliable Model Reuse.",
                    "Bridging Ordinary-Label Learning and Complementary-Label Learning.",
                    "CCA-Flow: Deep Multi-view Subspace Learning with Inverse Autoregressive Flow.",
                    "Collaborative Exploration in Stochastic Multi-Player Bandits.",
                    "Constrained Reinforcement Learning via Policy Splitting.",
                    "Convergence Rates of a Momentum Algorithm with Bounded Adaptive Step Size for Nonconvex Optimization.",
                    "Data-Dependent Conversion to a Compact Integer-Weighted Representation of a Weighted Voting Classifier.",
                    "Deep Dynamic Boosted Forest.",
                    "Deep-n-Cheap: An Automated Search Framework for Low Complexity Deep Learning.",
                    "DFQF: Data Free Quantization-aware Fine-tuning.",
                    "Disentangled Representations for Sequence Data using Information Bottleneck Principle.",
                    "Dual Learning: Theoretical Study and an Algorithmic Extension.",
                    "Efficient Attention Calibration Network for Real-Time Semantic Segmentation.",
                    "Enhancing Topic Models by Incorporating Explicit and Implicit External Knowledge.",
                    "Exact Passive-Aggressive Algorithms for Multiclass Classification Using Bandit Feedbacks.",
                    "FIREPruning: Learning-based Filter Pruning for Convolutional Neural Network Compression.",
                    "Foolproof Cooperative Learning.",
                    "Geodesically-convex optimization for averaging partially observed covariance matrices.",
                    "Inferring Continuous Treatment Doses from Historical Data via Model-Based Entropy-Regularized Reinforcement Learning.",
                    "Inverse Visual Question Answering with Multi-Level Attentions.",
                    "Learning 2-opt Heuristics for the Traveling Salesman Problem via Deep Reinforcement Learning.",
                    "Learning Code Changes by Exploiting Bidirectional Converting Deviation.",
                    "Learning Dynamic Context Graph Embedding.",
                    "Learning from Label Proportions with Consistency Regularization.",
                    "Learning Interpretable Models using Soft Integrity Constraints.",
                    "Thompson Sampling for Unsupervised Sequential Selection.",
                    "{M.",
                    "Monte-Carlo Graph Search: the Value of Merging Similar States.",
                    "NENN: Incorporate Node and Edge Features in Graph Neural Networks.",
                    "Network Representation Learning Algorithm Based on Neighborhood Influence Sequence.",
                    "Polytime Decomposition of Generalized Submodular Base Polytopes with Efficient Sampling.",
                    "Partially Observable Markov Decision Process Modelling for Assessing Hierarchies.",
                    "Proxy Network for Few Shot Learning.",
                    "Scalable Inference on the Soft Affiliation Graph Model for Overlapping Community Detection.",
                    "Randomness Efficient Feature Hashing for Sparse Binary Data.",
                    "Scaling up Simhash.",
                    "Robust Document Distance with Wasserstein-Fisher-Rao metric.",
                    "Run2Survive: A Decision-theoretic Approach to Algorithm Selection based on Survival Analysis.",
                    "Scalable Calibration of Affinity Matrices from Incomplete Observations.",
                    "PSForest: Improving Deep Forest via Feature Pooling and Error Screening.",
                    "Robust Deep Ordinal Regression under Label Noise.",
                    "A foreground detection algorithm for Time-of-Flight cameras adapted dynamic integration time adjustment and multipath distortions.",
                    "A New Representation Learning Method for Individual Treatment Effect Estimation: Split Covariate Representation Network.",
                    "Localizing and Amortizing: Efficient Inference for Gaussian Processes.",
                    "Towards Understanding and Improving the Transferability of Adversarial Examples in Deep Neural Networks."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "11th ACML 2019",
        "info": "Nagoya, Japan",
        "venues": [
            {
                "sub_name_abbr": "conf/acml/2019",
                "sub_name": "Proceedings of The 11th Asian Conference on Machine Learning, ACML 2019, 17-19 November 2019, Nagoya, Japan.",
                "count": 79,
                "papers": [
                    "Asian Conference on Machine Learning: Preface.",
                    "Random Projection in Neural Episodic Control.",
                    "Differentially Private Community Detection in Attributed Social Networks.",
                    "Towards Governing Agent's Efficacy: Action-Conditional $β$-VAE for Deep Transparent Reinforcement Learning.",
                    "An Articulated Structure-aware Network for 3D Human Pose Estimation.",
                    "A Continuous Actor-Critic Reinforcement Learning Approach to Flocking with Fixed-Wing UAVs.",
                    "Multiple Empirical Kernel Learning with Discriminant Locality Preservation.",
                    "ResNet and Batch-normalization Improve Data Separability.",
                    "Variational Conditional GAN for Fine-grained Controllable Image Generation.",
                    "Deep Learning with a Rethinking Structure for Multi-label Classification.",
                    "Minimax Online Prediction of Varying Bernoulli Process under Variational Approximation.",
                    "Multivariate Time Series Prediction Based on Optimized Temporal Convolutional Networks with Stacked Auto-encoders.",
                    "Learning to Augment with Feature Side-information.",
                    "An Encoding Adversarial Network for Anomaly Detection.",
                    "Model-Based Reinforcement Learning Exploiting State-Action Equivalence.",
                    "A Model of Text-Enhanced Knowledge Graph Representation Learning with Collaborative Attention.",
                    "SPCDet: Enhancing Object Detection with Combined Feature Fusing.",
                    "$\\mathcal{X}$-Armed Bandits: Optimizing Quantiles, CVaR and Other Risks.",
                    "Optimal PAC-Bayesian Posteriors for Stochastic Classifiers and their use for Choice of SVM Regularization Parameter.",
                    "Realistic Image Generation using Region-phrase Attention.",
                    "Efficient Diversified Mini-Batch Selection using Variable High-layer Features.",
                    "Gradient-based Training of Slow Feature Analysis by Differentiable Approximate Whitening.",
                    "Functional Isolation Forest.",
                    "Latent Multi-view Semi-Supervised Classification.",
                    "Cascaded and Dual: Discrimination Oriented Network for Brain Tumor Classification.",
                    "FEARS: a Feature and Representation Selection approach for Time Series Classification.",
                    "Unified Policy Optimization for Robust Reinforcement Learning.",
                    "Multi-Label Learning with Regularization Enriched Label-Specific Features.",
                    "An Attentive Memory Network Integrated with Aspect Dependency for Document-Level Multi-Aspect Sentiment Classification.",
                    "Multi-modal Representation Learning for Successive POI Recommendation.",
                    "Forward and Backward Knowledge Transfer for Sentiment Classification.",
                    "Zero-shot Domain Adaptation Based on Attribute Information.",
                    "Capsule Networks Need an Improved Routing Algorithm.",
                    "Learning to Sample Hard Instances for Graph Algorithms.",
                    "Multi-branch Siamese Network for High Performance Online Visual Tracking.",
                    "Exemplar Based Mixture Models with Censored Data.",
                    "Canonical Soft Time Warping.",
                    "Self-Weighted Multi-View Clustering with Deep Matrix Factorization.",
                    "Real-time tree search with pessimistic scenarios: Winning the NeurIPS 2018 Pommerman Competition.",
                    "Variational Inference from Ranked Samples with Features.",
                    "Investigating the effect of novel classes in semi-supervised learning.",
                    "An Anchor-Free Oriented Text Detector with Connectionist Text Proposal Network.",
                    "Text Length Adaptation in Sentiment Classification.",
                    "A Generalization Bound for Online Variational Inference.",
                    "Regularizing Neural Networks via Stochastic Branch Layers.",
                    "SPoD-Net: Fast Recovery of Microscopic Images Using Learned ISTA.",
                    "Improving Statute Prediction via Mining Correlations between Statutes.",
                    "Convolutional Neural Collaborative Filtering with Stacked Embeddings.",
                    "A New Multi-choice Reading Comprehension Dataset for Curriculum Learning.",
                    "Prediction of Crowd Flow in City Complex with Missing Data.",
                    "Learning Weighted Top-$k$ Support Vector Machine.",
                    "Self-Paced Multi-Label Learning with Diversity.",
                    "Software Component Prediction for Bug Reports.",
                    "Focused Anchors Loss: cost-sensitive learning of discriminative features for imbalanced classification.",
                    "Efficient Learning of Restricted Boltzmann Machines Using Covariance Estimates.",
                    "Multi-width Activation and Multiple Receptive Field Networks for Dynamic Scene Deblurring.",
                    "Adaptive truncated residual regression for fine-grained regression problems.",
                    "Surface Reconstruction based on Self-Merging Octree with Deep Learning.",
                    "Separate Loss for Basic and Compound Facial Expression Recognition in the Wild.",
                    "LADet: A Light-weight and Adaptive Network for Multi-scale Object Detection.",
                    "Fusing Recalibrated Features and Depthwise Separable Convolution for the Mangrove Bird Sound Classification.",
                    "Multi-Scale Visual Semantics Aggregation with Self-Attention for End-to-End Image-Text Matching.",
                    "Kernel Learning for Data-Driven Spectral Analysis of Koopman Operators.",
                    "Nuclei segmentation by using convolutional network with distance map and contour information.",
                    "Unpaired Data based Cross-domain Synthesis and Segmentation Using Attention Neural Network.",
                    "Self-Supervised Deep Multi-View Subspace Clustering.",
                    "Active Change-Point Detection.",
                    "Trust Region Sequential Variational Inference.",
                    "SDC-causing Error Detection Based on Lightweight Vulnerability Prediction.",
                    "Hyperbolic Ordinal Embedding.",
                    "Effective Sentence Scoring Method Using BERT for Speech Recognition.",
                    "Stochastic Gradient Trees.",
                    "Learning to Aggregate: Tackling the Aggregation/Disaggregation Problem for OWA.",
                    "Geometry-Aware Maximum Likelihood Estimation of Intrinsic Dimension.",
                    "Forward-Backward Generative Adversarial Networks for Anomaly Detection.",
                    "Improving Relation Classification by Entity Pair Graph.",
                    "Cell-aware Stacked LSTMs for Modeling Sentences.",
                    "From Implicit to Explicit Feedback: A deep neural network for modeling the sequential behavior of online users.",
                    "G-UAP: Generic Universal Adversarial Perturbation that Fools RPN-based Detectors."
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "10th ACML 2018",
        "info": "Beijing, China",
        "venues": [
            {
                "sub_name_abbr": "conf/acml/2018",
                "sub_name": "Proceedings of The 10th Asian Conference on Machine Learning, ACML 2018, Beijing, China, November 14-16, 2018.",
                "count": 58,
                "papers": [
                    "Preface.",
                    "Deep Correlation Structure Preserved Label Space Embedding for Multi-label Classification.",
                    "Co-regularized Multi-view Subspace Clustering.",
                    "Feature-correlation-aware Gaussian Process Latent Variable Model.",
                    "RDEC: Integrating Regularization into Deep Embedded Clustering for Imbalanced Datasets.",
                    "Structured Gaussian Processes with Twin Multiple Kernel Learning.",
                    "End-to-End Learning of Multi-scale Convolutional Neural Network for Stereo Matching.",
                    "Multidimensional Time Series Anomaly Detection: A GRU-based Gaussian Mixture Variational Autoencoder Approach.",
                    "Learning Selfie-Friendly Abstraction from Artistic Style Images.",
                    "Clustering Induced Kernel Learning.",
                    "Joint Patch-Group Based Sparse Representation for Image Inpainting.",
                    "CHS-NET: A Cascaded Neural Network with Semi-Focal Loss for Mitosis Detection.",
                    "Hypernetwork-based Implicit Posterior Estimation and Model Averaging of CNN.",
                    "Distinguishing Question Subjectivity from Difficulty for Improved Crowdsourcing.",
                    "Discriminative Feature Representation for Person Re-identification by Batch-contrastive Loss.",
                    "Person Re-identification by Mid-level Attribute and Part-based Identity Learning.",
                    "Clustering Uncertain Graphs with Node Attributes.",
                    "End-to-End Time Series Imputation via Residual Short Paths.",
                    "A Scalable Heterogeneous Parallel SOM Based on MPI/CUDA.",
                    "Making Classifier Chains Resilient to Class Imbalance.",
                    "Underwater Image Restoration Based on Convolutional Neural Network.",
                    "Preconditioned Conjugate Gradient Methods in Truncated Newton Frameworks for Large-scale Linear Classification.",
                    "Deep Fully-Connected Part-Based Models for Human Pose Estimation.",
                    "A Faster Sampling Algorithm for Spherical $k$-means.",
                    "Batch Normalized Deep Boltzmann Machines.",
                    "Unsupervised Heterogeneous Domain Adaptation with Sparse Feature Transformation.",
                    "Adversarial TableQA: Attention Supervision for Question Answering on Tables.",
                    "Concorde: Morphological Agreement in Conversational Models.",
                    "ReSet: Learning Recurrent Dynamic Routing in ResNet-like Neural Networks.",
                    "Extracting Invariant Features From Images Using An Equivariant Autoencoder.",
                    "Stock Price Prediction Using Attention-based Multi-Input LSTM.",
                    "Who Are Raising Their Hands? Hand-Raiser Seeking Based on Object Detection and Pose Estimation.",
                    "ZoomNet: Deep Aggregation Learning for High-Performance Small Pedestrian Detection.",
                    "Collaboratively Weighting Deep and Classic Representation via $l_2$ Regularization for Image Classification.",
                    "Character-based BiLSTM-CRF Incorporating POS and Dictionaries for Chinese Opinion Target Extraction.",
                    "Adversarial Neural Machine Translation.",
                    "Deep Embedded Clustering with Data Augmentation.",
                    "Cartoon-to-Photo Facial Translation with Generative Adversarial Networks.",
                    "CCNet: Cluster-Coordinated Net for Learning Multi-agent Communication Protocols with Reinforcement Learning.",
                    "Construction of Incoherent Dictionaries via Direct Babel Function Minimization.",
                    "Optimization Algorithm Inspired Deep Neural Network Structure Design.",
                    "A Self-Attentive Hierarchical Model for Jointly Improving Text Summarization and Sentiment Classification.",
                    "SecureNets: Secure Inference of Deep Neural Networks on an Untrusted Cloud.",
                    "Deep Multi-instance Learning with Dynamic Pooling.",
                    "A Data Driven Approach to Predicting Rating Scores for New Restaurants.",
                    "Profitable Bandits.",
                    "Fast Randomized PCA for Sparse Data.",
                    "Boosting Dynamic Programming with Neural Networks for Solving NP-hard Problems.",
                    "Efficient Mechanisms for Peer Grading and Dueling Bandits.",
                    "A Joint Selective Mechanism for Abstractive Sentence Summarization.",
                    "Fast Dynamic Convolutional Neural Networks for Visual Tracking.",
                    "RICAP: Random Image Cropping and Patching Data Augmentation for Deep CNNs.",
                    "An Empirical Evaluation of Sketched SVD and its Application to Leverage Score Ordering.",
                    "ASVRG: Accelerated Proximal SVRG.",
                    "Knowledge Guided Multi-instance Multi-label Learning via Neural Networks in Medicines Prediction.",
                    "TVT: Two-View Transformer Network for Video Captioning.",
                    "Refining Synthetic Images with Semantic Layouts by Adversarial Training.",
                    "Relative Attribute Learning with Deep Attentive Cross-image Representation."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "9th ACML 2017",
        "info": "Seol, Korea",
        "venues": [
            {
                "sub_name_abbr": "conf/acml/2017",
                "sub_name": "Proceedings of The 9th Asian Conference on Machine Learning, ACML 2017, Seoul, Korea, November 15-17, 2017.",
                "count": 42,
                "papers": [
                    "Preface.",
                    "Learning Convolutional Neural Networks using Hybrid Orthogonal Projection and Estimation.",
                    "Limits of End-to-End Learning.",
                    "A Study on Trust Region Update Rules in Newton Methods for Large-scale Linear Classification.",
                    "Mini-batch Block-coordinate based Stochastic Average Adjusted Gradient Methods to Solve Big Data Problems.",
                    "Instance Specific Discriminative Modal Pursuit: A Serialized Approach.",
                    "A Quantum-Inspired Ensemble Method and Quantum-Inspired Forest Regressors.",
                    "Distributionally Robust Groupwise Regularization Estimator.",
                    "Multi-view Clustering with Adaptively Learned Graph.",
                    "Select-and-Evaluate: A Learning Framework for Large-Scale Knowledge Graph Search.",
                    "Probability Calibration Trees.",
                    "Learning Predictive Leading Indicators for Forecasting Time Series Systems with Unknown Clusters of Forecast Tasks.",
                    "Locally Smoothed Neural Networks.",
                    "Data sparse nonparametric regression with ε-insensitive losses.",
                    "Rate Optimal Estimation for High Dimensional Spatial Covariance Matrices.",
                    "PHD: A Probabilistic Model of Hybrid Deep Collaborative Filtering for Recommender Systems.",
                    "Adaptive Sampling Scheme for Learning in Severely Imbalanced Large Scale Data.",
                    "ST-GAN: Unsupervised Facial Image Semantic Transformation Using Generative Adversarial Networks.",
                    "Deep Competitive Pathway Networks.",
                    "Regret for Expected Improvement over the Best-Observed Value and Stopping Condition.",
                    "Scale-Invariant Recognition by Weight-Shared CNNs in Parallel.",
                    "Using Deep Neural Networks to Automate Large Scale Statistical Analysis for Big Data Applications.",
                    "Recognizing Art Style Automatically in Painting with Deep Learning.",
                    "One Class Splitting Criteria for Random Forests.",
                    "Computer Assisted Composition with Recurrent Neural Networks.",
                    "Whitening-Free Least-Squares Non-Gaussian Component Analysis.",
                    "Semi-supervised Convolutional Neural Networks for Identifying Wi-Fi Interference Sources.",
                    "Magnitude-Preserving Ranking for Structured Outputs.",
                    "A Word Embeddings Informed Focused Topic Model.",
                    "Accumulated Gradient Normalization.",
                    "A Mutually-Dependent Hadamard Kernel for Modelling Latent Variable Couplings.",
                    "Learning Deep Semantic Embeddings for Cross-Modal Retrieval.",
                    "Pyramid Person Matching Network for Person Re-identification.",
                    "Learning RBM with a DC programming Approach.",
                    "Multi-Task Structured Prediction for Entity Analysis: Search-Based Learning Algorithms.",
                    "Nested LSTMs.",
                    "On the Flatness of Loss Surface for Two-layered ReLU Networks.",
                    "Radical-level Ideograph Encoder for RNN-based Sentiment Analysis of Chinese and Japanese.",
                    "Recovering Probability Distributions from Missing Data.",
                    "Attentive Path Combination for Knowledge Graph Completion.",
                    "A Covariance Matrix Adaptation Evolution Strategy for Direct Policy Search in Reproducing Kernel Hilbert Space.",
                    "\\emphNeuralPower: Predict and Deploy Energy-Efficient Convolutional Neural Networks."
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "8th ACML 2016",
        "info": "Hamilton, New Zealand",
        "venues": [
            {
                "sub_name_abbr": "conf/acml/2016",
                "sub_name": "Proceedings of The 8th Asian Conference on Machine Learning, ACML 2016, Hamilton, New Zealand, November 16-18, 2016.",
                "count": 30,
                "papers": [
                    "Preface.",
                    "Non-Linear Smoothed Transductive Network Embedding with Text Information.",
                    "Long Short-term Memory Network over Rhetorical Structure Theory for Sentence-level Sentiment Analysis.",
                    "Enhancing Topic Modeling on Short Texts with Crowdsourcing.",
                    "Multiple Kernel Learning with Data Augmentation.",
                    "Cost Sensitive Online Multiple Kernel Classification.",
                    "Localized Multiple Kernel Learning - A Convex Approach.",
                    "Linearized Alternating Direction Method of Multipliers for Constrained Nonconvex Regularized Optimization.",
                    "Random Fourier Features For Operator-Valued Kernels.",
                    "Secure Approximation Guarantee for Cryptographically Private Empirical Risk Minimization.",
                    "Learning from Survey Training Samples: Rate Bounds for Horvitz-Thompson Risk Minimizers.",
                    "Learnability of Non-I.I.D.",
                    "Modelling Symbolic Music: Beyond the Piano Roll.",
                    "Improving Distributed Word Representation and Topic Model by Word-Topic Mixture Model.",
                    "Fast Collaborative Filtering from Implicit Feedback with Provable Guarantees.",
                    "Unifying Topic, Sentiment & Preference in an HDP-Based Rating Regression Model for Online Reviews.",
                    "Simulation and Calibration of a Fully Bayesian Marked Multidimensional Hawkes Process with Dissimilar Decays.",
                    "A Bayesian Nonparametric Approach for Multi-label Classification.",
                    "Hierarchical Probabilistic Matrix Factorization with Network Topology for Multi-relational Social Network.",
                    "Learning Feature Aware Metric.",
                    "Multitask Principal Component Analysis.",
                    "Learning Distance Metrics for Multi-Label Classification.",
                    "Bank of Weight Filters for Deep CNNs.",
                    "Deep Gate Recurrent Neural Network.",
                    "Collaborative Recurrent Neural Networks for Dynamic Recommender Systems.",
                    "Echo State Hoeffding Tree Learning.",
                    "Proper Inner Product with Mean Displacement for Gaussian Noise Invariant ICA.",
                    "An Efficient Approach for Multi-Sentence Compression.",
                    "Geometry-aware stationary subspace analysis.",
                    "EcoICA: Skewness-based ICA via Eigenvectors of Cumulant Operator."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "7th ACML 2015",
        "info": "Hong Kong",
        "venues": [
            {
                "sub_name_abbr": "conf/acml/2015",
                "sub_name": "Proceedings of The 7th Asian Conference on Machine Learning, ACML 2015, Hong Kong, November 20-22, 2015.",
                "count": 29,
                "papers": [
                    "Preface.",
                    "Geometry-Aware Principal Component Analysis for Symmetric Positive Definite Matrices.",
                    "Non-asymptotic Analysis of Compressive Fisher Discriminants in terms of the Effective Dimension.",
                    "Sufficient Dimension Reduction via Direct Estimation of the Gradients of Logarithmic Conditional Densities.",
                    "Bayesian Masking: Sparse Bayesian Estimation with Weaker Shrinkage Bias.",
                    "A New Look at Nearest Neighbours: Identifying Benign Input Geometries via Random Projections.",
                    "Consistency of structured output learning with missing labels.",
                    "Maximum Margin Partial Label Learning.",
                    "Robust Multivariate Regression with Grossly Corrupted Observations and Its Application to Personality Prediction.",
                    "Data-Guided Approach for Learning and Improving User Experience in Computer Networks.",
                    "A Unified Framework for Jointly Learning Distributed Representations of Word and Attributes.",
                    "Preference Relation-based Markov Random Fields for Recommender Systems.",
                    "Detecting Accounting Frauds in Publicly Traded U.S. Firms: A Machine Learning Approach.",
                    "Improving Sybil Detection via Graph Pruning and Regularization Techniques.",
                    "Proximal Average Approximated Incremental Gradient Method for Composite Penalty Regularized Empirical Risk Minimization.",
                    "Class-prior Estimation for Learning from Positive and Unlabeled Data.",
                    "Streaming Variational Inference for Dirichlet Process Mixtures.",
                    "Expectation Propagation for Rectified Linear Poisson Regression.",
                    "Curriculum Learning of Bayesian Network Structures.",
                    "Continuous Target Shift Adaptation in Supervised Learning.",
                    "Surrogate regret bounds for generalized classification performance metrics.",
                    "Budgeted Bandit Problems with Continuous Random Costs.",
                    "Regularized Policy Gradients: Direct Variance Reduction in Policy Gradient Estimation.",
                    "Statistical Unfolded Logic Learning.",
                    "Integration of Single-view Graphs with Diffusion of Tensor Product Graphs for Multi-view Spectral Clustering.",
                    "Autoencoder Trees.",
                    "Similarity-based Contrastive Divergence Methods for Energy-based Deep Learning Models.",
                    "One-Pass Multi-View Learning.",
                    "Largest Source Subset Selection for Instance Transfer."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "6th ACML 2014",
        "info": "Nha Trang City, Vietnam",
        "venues": [
            {
                "sub_name_abbr": "conf/acml/2014",
                "sub_name": "Proceedings of the Sixth Asian Conference on Machine Learning, ACML 2014, Nha Trang City, Vietnam, November 26-28, 2014.",
                "count": 26,
                "papers": [
                    "Preface.",
                    "Theoretical Analyses on Ensemble and Multiple Kernel Regressors.",
                    "Sparsity on Statistical Simplexes and Diversity in Social Ranking.",
                    "Support vector machines with indefinite kernels.",
                    "Efficient Sample Mining for Object Detection.",
                    "Sample Distillation for Object Detection and Image Classification.",
                    "Dual online inference for latent Dirichlet allocation.",
                    "Structured Denoising Autoencoder for Fault Detection and Analysis.",
                    "Polya-gamma augmentations for factor models.",
                    "A Fast Hierarchical Alternating Least Squares Algorithm for Orthogonal Nonnegative Matrix Factorization.",
                    "Bibliographic Analysis with the Citation Network Topic Model.",
                    "Quasi Newton Temporal Difference Learning.",
                    "Sparse binary zero-sum games.",
                    "Interval Insensitive Loss for Ordinal Classification.",
                    "Towards Maximum Likelihood: Learning Undirected Graphical Models using Persistent Sequential Monte Carlo.",
                    "Nonlinear Dimensionality Reduction of Data by Deep Distributed Random Samplings.",
                    "Learning with Augmented Multi-Instance View.",
                    "Online matrix prediction for sparse loss matrices.",
                    "Online Passive Aggressive Active Learning and Its Applications.",
                    "Ordinal Random Fields for Recommender Systems.",
                    "Reinforcement learning with value advice.",
                    "A UCB-Like Strategy of Collaborative Filtering.",
                    "Variational Gaussian Inference for Bilinear Models of Count Data.",
                    "Pseudo-reward Algorithms for Contextual Bandits with Linear Payoff Functions.",
                    "Ensembles for Time Series Forecasting.",
                    "Reduction from Cost-Sensitive Multiclass Classification to One-versus-One Binary Classification."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "5th ACML 2013",
        "info": "Canberra, Australia",
        "venues": [
            {
                "sub_name_abbr": "conf/acml/2013",
                "sub_name": "Asian Conference on Machine Learning, ACML 2013, Canberra, ACT, Australia, November 13-15, 2013.",
                "count": 33,
                "papers": [
                    "Preface.",
                    "Stability of Multi-Task Kernel Regression Algorithms.",
                    "Random Projections as Regularizers: Learning a Linear Discriminant Ensemble from Fewer Observations than Dimensions.",
                    "Guided Monte Carlo Tree Search for Planning in Learned Environments.",
                    "Linear Approximation to ADMM for MAP inference.",
                    "Polynomial Runtime Bounds for Fixed-Rank Unsupervised Least-Squares Classification.",
                    "Accelerated Coordinate Descent with Adaptive Coordinate Frequencies.",
                    "Novel Boosting Frameworks to Improve the Performance of Collaborative Filtering.",
                    "Multi-armed Bandit Problem with Lock-up Periods.",
                    "Linearized Alternating Direction Method with Parallel Splitting and Adaptive Penalty for Separable Convex Programs in Machine Learning.",
                    "Learning Parts-based Representations with Nonnegative Restricted Boltzmann Machine.",
                    "Predictive Simulation Framework of Stochastic Diffusion Model for Identifying Top-K Influential Nodes.",
                    "Information Retrieval Perspective to Meta-visualization.",
                    "Achievability of Asymptotic Minimax Regret in Online and Batch Prediction.",
                    "Multi-Label Classification with Unlabeled Data: An Inductive Approach.",
                    "Q-learning for history-based reinforcement learning.",
                    "Multiclass Latent Locally Linear Support Vector Machines.",
                    "Exploration vs Exploitation vs Safety: Risk-Aware Multi-Armed Bandits.",
                    "The Multi-Task Learning View of Multimodal Data.",
                    "On multi-class classification through the minimization of the confusion matrix norm.",
                    "Generalized Aitchison Embeddings for Histograms.",
                    "Unconfused Ultraconservative Multiclass Algorithms.",
                    "Second Order Online Collaborative Filtering.",
                    "Learning a Metric Space for Neighbourhood Topology Estimation: Application to Manifold Learning.",
                    "Coinciding Walk Kernels: Parallel Absorbing Random Walks for Learning with Graphs and Few Labels.",
                    "Aggregating Predictions via Sequential Mini-Trading.",
                    "Active Sampling of Pairs and Points for Large-scale Linear Bipartite Ranking.",
                    "Multilabel Classification through Random Graph Ensembles.",
                    "Improving Predictive Specificity of Description Logic Learners by Fortification.",
                    "Using Hyperbolic Cross Approximation to measure and compensate Covariate Shift.",
                    "Locally-Linear Learning Machines (L3M).",
                    "Co-Training with Insufficient Views.",
                    "EPMC: Every Visit Preference Monte Carlo for Reinforcement Learning."
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "4th ACML 2012",
        "info": "Singapore, Singapore",
        "venues": [
            {
                "sub_name_abbr": "conf/acml/2012",
                "sub_name": "Proceedings of the 4th Asian Conference on Machine Learning, ACML 2012, Singapore, Singapore, November 4-6, 2012.",
                "count": 37,
                "papers": [
                    "Preface.",
                    "A Note on Metric Properties for Some Divergence Measures: The Gaussian Case.",
                    "Multiresolution Mixture Modeling using Merging of Mixture Components.",
                    "Learning Latent Variable Models by Pairwise Cluster Comparison.",
                    "Local Kernel Density Ratio-Based Feature Selection for Outlier Detection.",
                    "A Coupled Indian Buffet Process Model for Collaborative Filtering.",
                    "A Ranking-based KNN Approach for Multi-Label Classification.",
                    "AIC and BIC based approaches for SVM parameter value estimation with RBF kernels.",
                    "Online Learning of a Dirichlet Process Mixture of Generalized Dirichlet Distributions for Simultaneous Clustering and Localized Feature Selection.",
                    "A stochastic bandit algorithm for scratch games.",
                    "Max-Margin Ratio Machine.",
                    "Learning Temporal Association Rules on Symbolic Time Sequences.",
                    "More Is Better: Large Scale Partially-supervised Sentiment Classication.",
                    "Frustratingly Simplified Deployment in WLAN Localization by Learning from Route Annotation.",
                    "Variational Bayesian Matching.",
                    "Active Learning with Hinted Support Vector Machine.",
                    "A Convex-Concave Relaxation Procedure Based Subgraph Matching Algorithm.",
                    "Key Instance Detection in Multi-Instance Learning.",
                    "On Using Nearly-Independent Feature Families for High Precision and Confidence.",
                    "Learning and Model-Checking Networks of I/O Automata.",
                    "Sparse Additive Matrix Factorization for Robust PCA and Its Generalization.",
                    "Statistical Models for Exploring Individual Email Communication Behavior.",
                    "QBoost: Large Scale Classifier Training with Adiabatic Quantum Optimization.",
                    "Recovering Networks from Distance Data.",
                    "Topographic Analysis of Correlated Components.",
                    "Improved sequence classification using adaptive segmental sequence alignment.",
                    "Supervised dimension reduction with topic models.",
                    "Cumulative Restricted Boltzmann Machines for Ordinal Matrix Data Analysis.",
                    "Learning From Ordered Sets and Applications in Collaborative Ranking.",
                    "Two-way Parallel Class Expression Learning.",
                    "Multi-Stage Classifier Design.",
                    "Conditional validity of inductive conformal predictors.",
                    "Spatial Locality-Aware Sparse Coding and Dictionary Learning.",
                    "Multi-objective Monte-Carlo Tree Search.",
                    "Practical Large Scale Classification with Additive Kernels.",
                    "Online Rank Aggregation.",
                    "Multi-view Positive and Unlabeled Learning."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "3rd ACML 2011",
        "info": "Taoyuan, Taiwan",
        "venues": [
            {
                "sub_name_abbr": "conf/acml/2011",
                "sub_name": "Proceedings of the 3rd Asian Conference on Machine Learning, ACML 2011, Taoyuan, Taiwan, November 13-15, 2011.",
                "count": 24,
                "papers": [
                    "Preface.",
                    "Improving Policy Gradient Estimates with Influence Information.",
                    "Continuous RAVE.",
                    "Nonlinear Online Classificatand Michion Algorithm with Probability Margin.",
                    "Learning to Locate Relative Outliers.",
                    "Microbagging Estimators: An Ensemble Approach to Distance-weighted Classifiers.",
                    "Bayesian inference for statistical abduction using Markov chain Monte Carlo.",
                    "Support Vector Machines Under Adversarial Label Noise.",
                    "A General Linear Non-Gaussian State-Space Model.",
                    "Unsupervised Multiple Kernel Learning.",
                    "QWA: Spectral Algorithm.",
                    "Approximate Model Selection for Large Scale LSSVM.",
                    "Learning low-rank output kernels.",
                    "Learning Rules from Incomplete Examples via Implicit Mention Models.",
                    "Mixed-Variate Restricted Boltzmann Machines.",
                    "Robust Generation of Dynamical Patterns in Human Motion by a Deep Belief Nets.",
                    "Suffcient Component Analysis.",
                    "Learning Attribute-weighted Voter Model over Social Networks.",
                    "Multi-label Classification with Error-correcting Codes.",
                    "Estimating Diffusion Probability Changes for AsIC-SIS Model.",
                    "Multi-label Active Learning with Auxiliary Learner.",
                    "Acceleration technique for boosting classification and its application to face detection.",
                    "Summarization of Yes/No Questions Using a Feature Function Model.",
                    "Mapping kernels for infinite mapping systems."
                ]
            }
        ]
    },
    {
        "year": "2010",
        "name": "2nd ACML 2010",
        "info": "Tokyo, Japan",
        "venues": [
            {
                "sub_name_abbr": "conf/acml/2010",
                "sub_name": "Proceedings of the 2nd Asian Conference on Machine Learning, ACML 2010, Tokyo, Japan, November 8-10, 2010.",
                "count": 23,
                "papers": [
                    "Preface.",
                    "Pairwise Measures of Causal Direction in Linear Non-Gaussian Acyclic Models.",
                    "Learning Polyhedral Classifiers Using Logistic Function.",
                    "Ellipsoidal Support Vector Machines.",
                    "Minimum Conditional Entropy Clustering: A Discriminative Framework for Clustering.",
                    "Efficient Collapsed Gibbs Sampling for Latent Dirichlet Allocation.",
                    "Variational Relevance Vector Machine for Tabular Data.",
                    "Hierarchical Gaussian Process Regression.",
                    "Content-based Image Retrieval with Multinomial Relevance Feedback.",
                    "The Coding Divergence for Measuring the Complexity of Separating Two Sets.",
                    "Single versus Multiple Sorting in All Pairs Similarity Search.",
                    "An EM Algorithm on BDDs with Order Encoding for Logic-based Probabilistic Models.",
                    "Exploiting the High Predictive Power of Multi-class Subgroups.",
                    "Generative Models of Information Diffusion with Asynchronous Timedelay.",
                    "Decision Tree for Dynamic and Uncertain Data Streams.",
                    "Accurate Ensembles for Data Streams: Combining Restricted Hoeffding Trees using Stacking.",
                    "Mining Recurring Concept Drifts with Limited Labeled Streaming Data.",
                    "Hierarchical Convex NMF for Clustering Massive Data.",
                    "Multi-task Learning for Recommender System.",
                    "Adaptive Step-size Policy Gradients with Average Reward Metric.",
                    "Finite-sample Analysis of Bellman Residual Minimization.",
                    "A Study of Approximate Inference in Probabilistic Relational Models.",
                    "Conceptual Imitation Learning: An Application to Human-robot Interaction."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "1st ACML 2009",
        "info": "Nanjing, China",
        "venues": [
            {
                "sub_name_abbr": "conf/acml/2009",
                "sub_name": "Advances in Machine Learning, First Asian Conference on Machine Learning, ACML 2009, Nanjing, China, November 2-4, 2009. Proceedings.",
                "count": 30,
                "papers": [
                    "Machine Learning and Ecosystem Informatics: Challenges and Opportunities.",
                    "Density Ratio Estimation: A New Versatile Tool for Machine Learning.",
                    "Transfer Learning beyond Text Classification.",
                    "Improving Adaptive Bagging Methods for Evolving Data Streams.",
                    "A Hierarchical Face Recognition Algorithm.",
                    "Estimating Likelihoods for Topic Models.",
                    "Conditional Density Estimation with Class Probability Estimators.",
                    "Linear Time Model Selection for Mixture of Heterogeneous Components.",
                    "Max-margin Multiple-Instance Learning via Semidefinite Programming.",
                    "A Reformulation of Support Vector Machines for General Confidence Functions.",
                    "Robust Discriminant Analysis Based on Nonparametric Maximum Entropy.",
                    "Context-Aware Online Commercial Intention Detection.",
                    "Feature Selection via Maximizing Neighborhood Soft Margin.",
                    "Accurate Probabilistic Error Bound for Eigenvalues of Kernel Matrix.",
                    "Community Detection on Weighted Networks: A Variational Bayesian Method.",
                    "Averaged Naive Bayes Trees: A New Extension of AODE.",
                    "Automatic Choice of Control Measurements.",
                    "Coupled Metric Learning for Face Recognition with Degraded Images.",
                    "Cost-Sensitive Boosting: Fitting an Additive Asymmetric Logistic Regression Model.",
                    "On Compressibility and Acceleration of Orthogonal NMF for POMDP Compression.",
                    "Building a Decision Cluster Forest Model to Classify High Dimensional Data with Multi-classes.",
                    "Query Selection via Weighted Entropy in Graph-Based Semi-supervised Classification.",
                    "Learning Algorithms for Domain Adaptation.",
                    "Mining Multi-label Concept-Drifting Data Streams Using Dynamic Classifier Ensemble.",
                    "Learning Continuous-Time Information Diffusion Model for Social Behavioral Data Analysis.",
                    "Privacy-Preserving Evaluation of Generalization Error and Its Application to Model and Attribute Selection.",
                    "Coping with Distribution Change in the Same Domain Using Similarity-Based Instance Weighting.",
                    "Monte-Carlo Tree Search in Poker Using Expected Reward Distributions.",
                    "Injecting Structured Data to Generative Topic Model in Enterprise Settings.",
                    "Weighted Nonnegative Matrix Co-Tri-Factorization for Collaborative Prediction."
                ]
            }
        ]
    }
]