[
    {
        "name": "AIM",
        "year": "2022",
        "info": "2022: Volumes\n123,\n124,",
        "count": 18,
        "papers": [
            "Revealing traces of depression through personal statements analysis in social media.",
            "ADHD classification using auto-encoding neural network and binary hypothesis testing.",
            "Tetromino pattern based accurate EEG emotion classification model.",
            "Missing data imputation on biomedical data using deeply learned clustering and L2 regularized regression based on symmetric uncertainty.",
            "Artificial intelligence (AI) in breast cancer care - leveraging multidisciplinary skills to improve care.",
            "Mapping twenty years of antimicrobial resistance research trends.",
            "DI++: A deep learning system for patient condition identification in clinical notes.",
            "Continuous action deep reinforcement learning for propofol dosing during general anesthesia.",
            "Gene selection for microarray data classification via multi-objective graph theoretic-based method.",
            "A dual-layer context-based architecture for the detection of anomalous instructions sent to medical devices.",
            "Training radiomics-based CNNs for clinical outcome prediction: Challenges, strategies and findings.",
            "The three ghosts of medical AI: Can the black-box present deliver?",
            "RMS-UNet: Residual multi-scale UNet for liver and lesion segmentation.",
            "A novel transfer learning model for traditional herbal medicine prescription generation from unstructured resources and knowledge.",
            "A multi-stage machine learning model for diagnosis of esophageal manometry.",
            "Predicting liver cancers using skewed epidemiological data.",
            "Enhancing dynamic ECG heartbeat classification with lightweight transformer model.",
            "ResAttenGAN: Simultaneous segmentation of multiple spinal structures on axial lumbar MRI image using residual attention and adversarial learning."
        ]
    },
    {
        "name": "AIM",
        "year": "2021",
        "info": "2021: Volumes\n111,\n112,\n113,\n114,\n115,\n116,\n117,\n118,\n119,\n120,\n121,\n122",
        "count": 139,
        "papers": [
            "Using interpretability approaches to update \"black-box\" clinical prediction models: an external validation study in nephrology.",
            "Detection-based prioritisation: Framework of multi-laboratory characteristics for asymptomatic COVID-19 carriers based on integrated Entropy-TOPSIS methods.",
            "Cartesian genetic programming for diagnosis of Parkinson disease through handwriting analysis: Performance vs. interpretability issues.",
            "EKNN: Ensemble classifier incorporating connectivity and density into kNN with application to cancer diagnosis.",
            "A Decision Tree-Initialised Neuro-fuzzy Approach for Clinical Decision Support.",
            "Overly optimistic prediction results on imbalanced data: a case study of flaws and benefits when applying over-sampling.",
            "Training data enhancements for improving colonic polyp detection using deep convolutional neural networks.",
            "Individual tooth detection and identification from dental panoramic X-ray images via point-wise localization and distance regularization.",
            "Multichannel mixture models for time-series analysis and classification of engagement with multiple health services: An application to psychology and physiotherapy utilization patterns after traffic accidents.",
            "Interactive medical image segmentation via a point-based interaction.",
            "EPTs-TL: A two-level approach for efficient event prediction in healthcare.",
            "DRNet: Segmentation and localization of optic disc and Fovea from diabetic retinopathy image.",
            "Estimating sparse functional connectivity networks via hyperparameter-free learning model.",
            "MitPlan: A planning approach to mitigating concurrently applied clinical practice guidelines.",
            "Transatlantic transferability of a new reinforcement learning model for optimizing haemodynamic treatment for critically ill patients with sepsis.",
            "A new framework for classification of multi-category hand grasps using EMG signals.",
            "A deep-learning-based unsupervised model on esophageal manometry using variational autoencoder.",
            "Objective and automated assessment of surgical technical skills with IoT systems: A systematic literature review.",
            "BertMCN: Mapping colloquial phrases to standard medical concepts using BERT and highway network.",
            "Medical analytics for healthcare intelligence - Recent advances and future directions.",
            "A novel computational method for assigning weights of importance to symptoms of COVID-19 patients.",
            "A method based on cardiopulmonary coupling analysis for sleep quality assessment with FPGA implementation.",
            "A survey of deep learning models in medical therapeutic areas.",
            "Modeling multivariate clinical event time-series with recurrent temporal mechanisms.",
            "Multiscale CNN with compound fusions for false positive reduction in lung nodule detection.",
            "Artificial intelligence for the diagnosis of lymph node metastases in patients with abdominopelvic malignancy: A systematic review and meta-analysis.",
            "Liver segmentation in abdominal CT images via auto-context neural network and self-supervised contour attention.",
            "Improving prediction for medical institution with limited patient data: Leveraging hospital-specific data based on multicenter collaborative research network.",
            "Multimodal tensor-based method for integrative and continuous patient monitoring during postoperative cardiac care.",
            "Improving sentiment analysis on clinical narratives by exploiting UMLS semantic types.",
            "AIRBP: Accurate identification of RNA-binding proteins using machine learning techniques.",
            "A multi-scale convolutional neural network with context for joint segmentation of optic disc and cup.",
            "DeepAISE - An interpretable and recurrent neural survival model for early prediction of sepsis.",
            "Publishing Artificial Intelligence Research Papers: A Tale of Three Journals.",
            "STQS: Interpretable multi-modal Spatial-Temporal-seQuential model for automatic Sleep scoring.",
            "Advanced EEG-based learning approaches to predict schizophrenia: Promises and pitfalls.",
            "A deep learning approach for mitosis detection: Application in tumor proliferation prediction from whole slide images.",
            "R-HEFS: Rough set based heterogeneous ensemble feature selection method for medical data classification.",
            "Video-based eye tracking performance for computer-assisted diagnostic support of diabetic neuropathy.",
            "Data imputation and compression for Parkinson's disease clinical questionnaires.",
            "A novel method for clinical risk prediction with low-quality data.",
            "NewsMeSH: A new classifier designed to annotate health news with MeSH headings.",
            "Survival in the Intensive Care Unit: A prognosis model based on Bayesian classifiers.",
            "Ethical evaluation of artificial intelligence applications in radiotherapy using the Four Topics Approach.",
            "Probabilistic domain-knowledge modeling of disorder pathogenesis for dynamics forecasting of acute onset.",
            "A novel approach for computerized quantitative image analysis of proximal femur bone shape deformities based on the hip joint symmetry.",
            "Preface: AIME 2019.",
            "CEFEs: A CNN Explainable Framework for ECG Signals.",
            "Machine learning in oral squamous cell carcinoma: Current status, clinical concerns and prospects for future - A systematic review.",
            "A machine learning perspective on the emotional content of Parkinsonian speech.",
            "A reinforcement learning based algorithm for personalization of digital, just-in-time, adaptive interventions.",
            "Automated emotion classification in the early stages of cortical processing: An MEG study.",
            "EAR-UNet: A deep learning-based approach for segmentation of tympanic membranes from otoscopic images.",
            "A data science approach to drug safety: Semantic and visual mining of adverse drug events from clinical trials of pain treatments.",
            "A hybrid deep learning approach for gland segmentation in prostate histopathological images.",
            "Coronary artery segmentation from intravascular optical coherence tomography using deep capsules.",
            "Uncertainty-aware temporal self-learning (UATS): Semi-supervised learning for segmentation of prostate zones and beyond.",
            "Evaluating diagnostic content of AI-generated radiology reports of chest X-rays.",
            "Fenchel duality of Cox partial likelihood with an application in survival kernel learning.",
            "Transfer learning in medical image segmentation: New insights from analysis of the dynamics of model parameters and learned representations.",
            "Bayesian networks in healthcare: What is preventing their adoption?",
            "Explaining heterogeneity of individual treatment causal effects by subgroup discovery: An observational case study in antibiotics treatment of acute rhino-sinusitis.",
            "Cost-effectiveness analysis with unordered decisions.",
            "Artificial intelligence in neurodegenerative diseases: A review of available tools with a focus on machine learning techniques.",
            "NIA-Network: Towards improving lung CT infection detection for COVID-19 diagnosis.",
            "Multi-domain clinical natural language processing with MedCAT: The Medical Concept Annotation Toolkit.",
            "Interpreting deep learning models for epileptic seizure detection on EEG signals.",
            "Application of substitution box of present cipher for automated detection of snoring sounds.",
            "Prediction of weaning from mechanical ventilation using Convolutional Neural Networks.",
            "Deep ensemble multitask classification of emergency medical call incidents combining multimodal data improves emergency medical dispatch.",
            "Evaluation of clustering and topic modeling methods over health-related tweets and emails.",
            "Simultaneous imputation and classification using Multigraph Geometric Matrix Completion (MGMC): Application to neurodegenerative disease classification.",
            "A predictive framework in healthcare: Case study on cardiac arrest prediction.",
            "A comprehensive scoping review of Bayesian networks in healthcare: Past, present and future.",
            "Abdominal multi-organ segmentation with cascaded convolutional and adversarial deep networks.",
            "A review of AI and Data Science support for cancer management.",
            "Improving clinical outcome predictions using convolution over medical entities with multimodal learning.",
            "A new approach for interpretability and reliability in clinical risk prediction: Acute coronary syndrome scenario.",
            "Med7: A transferable clinical natural language processing model for electronic health records.",
            "Enhancing evidence-based medicine with natural language argumentative analysis of clinical trials.",
            "Fully-channel regional attention network for disease-location recognition with tongue images.",
            "An explainable AI system for automated COVID-19 assessment and lesion categorization from CT-scans.",
            "MvKFN-MDA: Multi-view Kernel Fusion Network for miRNA-disease association prediction.",
            "Simultaneous segmentation and classification of the retinal arteries and veins from color fundus images.",
            "A progressive deep wavelet cascade classification model for epilepsy detection.",
            "The Physiological Deep Learner: First application of multitask deep learning to predict hypotension in critically ill patients.",
            "Health issue identification in social media based on multi-task hierarchical neural networks with topic attention.",
            "Data-based algorithms and models using diabetics real data for blood glucose and hypoglycaemia prediction - A systematic literature review.",
            "Decision support for comorbid conditions via execution-time integration of clinical guidelines using transaction-based semantics and temporal planning.",
            "Multi-feature representation for burn depth classification via burn images.",
            "Tracking leukocytes in intravital time lapse images using 3D cell association learning network.",
            "A framework to extract biomedical knowledge from gluten-related tweets: The case of dietary concerns in digital era.",
            "Circumpapillary OCT-focused hybrid learning for glaucoma grading using tailored prototypical neural networks.",
            "AIOSA: An approach to the automatic identification of obstructive sleep apnea events based on deep learning.",
            "Network differentiation: A computational method of pathogenesis diagnosis in traditional Chinese medicine based on systems science.",
            "A novel convolutional neural network for reconstructing surface electrocardiograms from intracardiac electrograms and vice versa.",
            "Practical fine-grained learning based anomaly classification for ECG image.",
            "Resolution-based distillation for efficient histology image classification.",
            "Deep Reinforcement Learning for Fractionated Radiotherapy in Non-Small Cell Lung Carcinoma.",
            "Aspect-based sentiment analysis with graph convolution over syntactic dependencies.",
            "Deep learning methods for screening patients' S-ICD implantation eligibility.",
            "Neural network-based left ventricle geometry prediction from CMR images with application in biomechanics.",
            "Multi-pathology detection and lesion localization in WCE videos by using the instance segmentation approach.",
            "Optimization assisted Kalman filter for cancer chemotherapy dosage estimation.",
            "TP-DDI: Transformer-based pipeline for the extraction of Drug-Drug Interactions.",
            "EMONAS-Net: Efficient multiobjective neural architecture search using surrogate-assisted evolutionary algorithm for 3D medical image segmentation.",
            "Tumor saliency estimation for breast ultrasound images via breast anatomy modeling.",
            "Hybrid COVID-19 segmentation and recognition framework (HMB-HCF) using deep learning and genetic algorithms.",
            "Dengue models based on machine learning techniques: A systematic literature review.",
            "Optimizing the setting of medical interactive rehabilitation assistant platform to improve the performance of the patients: A case study.",
            "Understanding patient reviews with minimum supervision.",
            "Finding reduced Raman spectroscopy fingerprint of skin samples for melanoma diagnosis through machine learning.",
            "Replication-based regularization approaches to diagnose Reinke's edema by using voice recordings.",
            "Low back pain expert systems: Clinical resolution through probabilistic considerations and poset.",
            "Artificial intelligence in gynecologic cancers: Current status and future challenges - A systematic review.",
            "Artificial intelligence applied to support medical decisions for the automatic analysis of echocardiogram images: A systematic review.",
            "Substituting clinical features using synthetic medical phrases: Medical text data augmentation techniques.",
            "Classification of diabetic retinopathy using unlabeled data and knowledge distillation.",
            "A keyphrase-based approach for interpretable ICD-10 code classification of Spanish medical reports.",
            "Automatic image and text-based description for colorectal polyps using BASIC classification.",
            "Real-time frequency-independent single-Lead and single-beat myocardial infarction detection.",
            "A novel deep learning model DDU-net using edge features to enhance brain tumor segmentation on MR images.",
            "Convolutional squeeze-and-excitation network for ECG arrhythmia detection.",
            "Fusing 2D and 3D convolutional neural networks for the segmentation of aorta and coronary arteries from CT images.",
            "A healthy debate: Exploring the views of medical doctors on the ethics of artificial intelligence.",
            "BCHisto-Net: Breast histopathological image classification by global and local feature aggregation.",
            "DeepMI: Deep multi-lead ECG fusion for identifying myocardial infarction and its occurrence-time.",
            "A reinforcement learning approach for finding optimal policy of adaptive radiation therapy considering uncertain tumor biological response.",
            "Multiple instance convolutional neural network with modality-based attention and contextual multi-instance learning pooling layer for effective differentiation between borderline and malignant epithelial ovarian tumors.",
            "PSA-Net: Deep learning-based physician style-aware segmentation network for postoperative prostate cancer clinical target volumes.",
            "Fine-tuning deep learning model parameters for improved super-resolution of dynamic MRI with prior-knowledge.",
            "An attention-based weakly supervised framework for spitzoid melanocytic lesion diagnosis in whole slide images.",
            "Machine learning in deep brain stimulation: A systematic review.",
            "Consensus clustering for case series identification and adverse event profiles in pharmacovigilance.",
            "Cardio-ML: Detection of malicious clinical programmings aimed at cardiac implantable electronic devices based on machine learning and a missing values resemblance framework.",
            "Seizure detection from multi-channel EEG using entropy-based dynamic graph embedding.",
            "Interpreting clinical latent representations using autoencoders and probabilistic models.",
            "TEDAR: Temporal dynamic signal detection of adverse reactions.",
            "Automated tibiofemoral joint segmentation based on deeply supervised 2D-3D ensemble U-Net: Data from the Osteoarthritis Initiative."
        ]
    },
    {
        "name": "AIM",
        "year": "2020",
        "info": "2020: Volumes\n101,\n102,\n103,\n104,\n105,\n106,\n107,\n108,\n108,\n109,\n110",
        "count": 199,
        "papers": [
            "Classifying cancer pathology reports with hierarchical self-attention networks.",
            "The social phenotype: Extracting a patient-centered perspective of diabetes from health-related blogs.",
            "Neural network methodology for real-time modelling of bio-heat transfer during thermo-therapeutic applications.",
            "A hybrid machine learning approach to cerebral stroke prediction based on imbalanced medical dataset.",
            "Motor imagery EEG recognition with KNN-based smooth auto-encoder.",
            "A predictive analytics framework for identifying patients at risk of developing multiple medical complications caused by chronic diseases.",
            "Compositional model based on factorial evolution for realizing multi-task learning in bacterial virulent protein prediction.",
            "A novel Chinese herbal medicine clustering algorithm via artificial bee colony optimization.",
            "Methods for algorithmic diagnosis of metabolic syndrome.",
            "Cosine similarity measures of bipolar neutrosophic set for diagnosis of bipolar disorder diseases.",
            "Study on miR-384-5p activates TGF-β signaling pathway to promote neuronal damage in abutment nucleus of rats based on deep learning.",
            "Automated classification of histopathology images using transfer learning.",
            "Automatic detection of epileptic seizure based on approximate entropy, recurrence quantification analysis and convolutional neural networks.",
            "Pressure injury image analysis with machine learning techniques: A systematic review on previous and possible future methods.",
            "Disease phenotype synonymous prediction through network representation learning from PubMed database.",
            "Using multi-layer perceptron with Laplacian edge detector for bladder cancer diagnosis.",
            "Prediction of fetal weight at varying gestational age in the absence of ultrasound examination using ensemble learning.",
            "A methodology based on multiple criteria decision analysis for combining antibiotics in empirical therapy.",
            "Artificial plant optimization algorithm to detect heart rate & presence of heart disease using machine learning.",
            "Artificial intelligence and the future of psychiatry: Insights from a global physician survey.",
            "Optimized artificial neural network based performance analysis of wheelchair movement for ALS patients.",
            "Signal identification system for developing rehabilitative device using deep learning algorithms.",
            "Skin cancer diagnosis based on optimized convolutional neural network.",
            "Ophthalmic diagnosis using deep learning with fundus images - A critical review.",
            "Multi-objective evolutionary design of antibiotic treatments.",
            "A modular cluster based collaborative recommender system for cardiac patients.",
            "Clinical Decision Support Systems for Triage in the Emergency Department using Intelligent Systems: a Review.",
            "State recognition of decompressive laminectomy with multiple information in robot-assisted surgery.",
            "Deep supervised learning with mixture of neural networks.",
            "Design and Development of Human Computer Interface Using Electrooculogram with Deep Learning.",
            "Electroencephalogram based communication system for locked in state person using mentally spelled tasks with optimized network model.",
            "SemBioNLQA: A semantic biomedical question answering system for retrieving exact and ideal answers to natural language questions.",
            "An improved fuzzy set-based multifactor dimensionality reduction for detecting epistasis.",
            "Fully-automated deep learning-powered system for DCE-MRI analysis of brain tumors.",
            "Evidence of the benefits, advantages and potentialities of the structured radiological report: An integrative review.",
            "Predicting dementia with routine care EMR data.",
            "An enhanced deep learning approach for brain cancer MRI images classification using residual networks.",
            "Implementation of artificial intelligence in medicine: Status analysis and development suggestions.",
            "Comprehensive analysis of rule formalisms to represent clinical guidelines: Selection criteria and case study on antibiotic clinical guidelines.",
            "Multi-resolution convolutional networks for chest X-ray radiograph based lung nodule detection.",
            "A multi-context CNN ensemble for small lesion detection.",
            "Medical knowledge embedding based on recursive neural network for multi-disease diagnosis.",
            "Multi-planar 3D breast segmentation in MRI via deep convolutional neural networks.",
            "A fusion framework to extract typical treatment patterns from electronic medical records.",
            "Topic-informed neural approach for biomedical event extraction.",
            "Semantic segmentation with DenseNets for carotid artery ultrasound plaque segmentation and CIMT estimation.",
            "The impact of machine learning on patient care: A systematic review.",
            "ADHD classification by dual subspace learning using resting-state functional connectivity.",
            "A novel method of motor imagery classification using eeg signal.",
            "An intelligent learning approach for improving ECG signal classification and arrhythmia analysis.",
            "Comprehensive electrocardiographic diagnosis based on deep learning.",
            "An effective approach for CT lung segmentation using mask region-based convolutional neural networks.",
            "Seven pillars of precision digital health and medicine.",
            "Gait characteristics and clinical relevance of hereditary spinocerebellar ataxia on deep learning.",
            "Retraction notice to \"Diagnosis Labeling with Disease-Specific Characteristics Mining\" [Artif. Intell. Med. 90 (2018) 25-33].",
            "Measuring the effects of confounders in medical supervised classification problems: the Confounding Index (CI).",
            "Batch Mode Active Learning on the Riemannian Manifold for Automated Scoring of Nuclear Pleomorphism in Breast Cancer.",
            "Mixed-integer optimization approach to learning association rules for unplanned ICU transfer.",
            "Prognostic factors of Rapid symptoms progression in patients with newly diagnosed parkinson's disease.",
            "Classification of glomerular hypercellularity using convolutional features and support vector machine.",
            "Scalogram based prediction model for respiratory disorders using optimized convolutional neural networks.",
            "Quantitative knowledge presentation models of traditional Chinese medicine (TCM): A review.",
            "Random Forest enhancement using improved Artificial Fish Swarm for the medial knee contact force prediction.",
            "An incremental explanation of inference in Bayesian networks for increasing model trustworthiness and supporting clinical decision making.",
            "A multicenter random forest model for effective prognosis prediction in collaborative clinical research network.",
            "Automatic computation of mandibular indices in dental panoramic radiographs for early osteoporosis detection.",
            "Real-world data medical knowledge graph: construction and applications.",
            "An improved multi-swarm particle swarm optimizer for optimizing the electric field distribution of multichannel transcranial magnetic stimulation.",
            "Optimisation and control of the supply of blood bags in hemotherapic centres via Markov decision process with discounted arrival rate.",
            "Multimodal data analysis of epileptic EEG and rs-fMRI via deep learning and edge computing.",
            "Efficient treatment of outliers and class imbalance for diabetes prediction.",
            "Feature selection based multivariate time series forecasting: An application to antibiotic resistance outbreaks prediction.",
            "Early detection of sepsis utilizing deep learning on electronic health record event sequences.",
            "A novel deep mining model for effective knowledge discovery from omics data.",
            "Automated machine learning: Review of the state-of-the-art and opportunities for healthcare.",
            "A recurrent neural network approach to predicting hemoglobin trajectories in patients with End-Stage Renal Disease.",
            "Wearable sensor-based evaluation of psychosocial stress in patients with metabolic syndrome.",
            "Reinforcement learning application in diabetes blood glucose control: A systematic review.",
            "Offline identification of surgical deviations in laparoscopic rectopexy.",
            "A neutrosophic-entropy based adaptive thresholding segmentation algorithm: A special application in MR images of Parkinson's disease.",
            "Detecting potential signals of adverse drug events from prescription data.",
            "Characterizing the critical features when personalizing antihypertensive drugs using spectrum analysis and machine learning methods.",
            "Modeling and processing up-to-dateness of patient information in probabilistic therapy decision support.",
            "Computerized decision support and machine learning applications for the prevention and treatment of childhood obesity: A systematic review of the literature.",
            "Explainable AI meets persuasiveness: Translating reasoning results into behavioral change advice.",
            "Fuzzy support vector machine-based personalizing method to address the inter-subject variance problem of physiological signals in a driver monitoring system.",
            "Breast cancer diagnosis from histopathological images using textural features and CBIR.",
            "Vessel Structure Extraction using Constrained Minimal Path Propagation.",
            "Early temporal prediction of Type 2 Diabetes Risk Condition from a General Practitioner Electronic Health Record: A Multiple Instance Boosting Approach.",
            "Automatic segmentation of knee menisci - A systematic review.",
            "On the use of pairwise distance learning for brain signal classification with limited observations.",
            "Personalized risk prediction for breast cancer pre-screening using artificial intelligence and thermal radiomics.",
            "Mining post-surgical care processes in breast cancer patients.",
            "Mining incomplete clinical data for the early assessment of Kawasaki disease based on feature clustering and convolutional neural networks.",
            "Reconstructing the patient's natural history from electronic health records.",
            "Deep neural network for semi-automatic classification of term and preterm uterine recordings.",
            "Fuzzy inference model based on triaxial signals for pronation and supination assessment in Parkinson's disease patients.",
            "Toward development of PreVoid alerting system for nocturnal enuresis patients: A fuzzy-based approach for determining the level of liquid encased in urinary bladder.",
            "Classification of myocardial infarction based on hybrid feature extraction and artificial intelligence tools by adopting tunable-Q wavelet transform (TQWT), variational mode decomposition (VMD) and neural networks.",
            "CT window trainable neural network for improving intracranial hemorrhage detection by combining multiple settings.",
            "A review on segmentation of knee articular cartilage: from conventional methods towards deep learning.",
            "ECG-based multi-class arrhythmia detection using spatio-temporal attention-based convolutional recurrent neural network.",
            "A trusted medical image super-resolution method based on feedback adaptive weighted dense network.",
            "Graph Fourier transform of fMRI temporal signals based on an averaged structural connectome for the classification of neuroimaging.",
            "Speckle reduction of OCT via super resolution reconstruction and its application on retinal layer segmentation.",
            "Regularized-Ncut: Robust and homogeneous functional parcellation of neonate and adult brain networks.",
            "FDSR: A new fuzzy discriminative sparse representation method for medical image classification.",
            "Upper-limb functional assessment after stroke using mirror contraction: A pilot study.",
            "Deep learning in generating radiology reports: A survey.",
            "How to identify and treat data inconsistencies when eliciting health-state utility values for patient-centered decision making.",
            "A framework to shift basins of attraction of gene regulatory networks through batch reinforcement learning.",
            "A case-based ensemble learning system for explainable breast cancer recurrence prediction.",
            "Integrating expert's knowledge constraint of time dependent exposures in structure learning for Bayesian networks.",
            "Missing data imputation and synthetic data simulation through modeling graphical probabilistic dependencies between variables (ModGraProDep): An application to breast cancer survival.",
            "A novel method for predicting the progression rate of ALS disease based on automatic generation of probabilistic causal chains.",
            "Breast ultrasound region of interest detection and lesion localisation.",
            "Pulmonary nodule detection on chest radiographs using balanced convolutional neural network and classic candidate detection.",
            "Temporal matrix completion with locally linear latent factors for medical applications.",
            "Data reduction and data visualization for automatic diagnosis using gene expression and clinical data.",
            "Integrative blockwise sparse analysis for tissue characterization and classification.",
            "Predicting the causative pathogen among children with osteomyelitis using Bayesian networks - improving antibiotic selection in clinical practice.",
            "A shape context fully convolutional neural network for segmentation and classification of cervical nuclei in Pap smear images.",
            "Enhanced prediction of hemoglobin concentration in a very large cohort of hemodialysis patients by means of deep recurrent neural networks.",
            "Fully convolutional attention network for biomedical image segmentation.",
            "The four dimensions of contestable AI diagnostics - A patient-centric approach to explainable AI.",
            "Automated hematoma segmentation and outcome prediction for patients with traumatic brain injury.",
            "Combining analysis of multi-parametric MR images into a convolutional neural network: Precise target delineation for vestibular schwannoma treatment planning.",
            "Bayesian networks in healthcare: Distribution by medical condition.",
            "Internet of things-inspired healthcare system for urine-based diabetes prediction.",
            "Multi-stage domain-specific pretraining for improved detection and localization of Barrett's neoplasia: A comprehensive clinically validated study.",
            "CCAE: Cross-field categorical attributes embedding for cancer clinical endpoint prediction.",
            "Learning personalized ADL recognition models from few raw data.",
            "Near-optimal insulin treatment for diabetes patients: A machine learning approach.",
            "Automated detection of dynamical change in EEG signals based on a new rhythm measure.",
            "Predicting postoperative non-small cell lung cancer prognosis via long short-term relational regularization.",
            "Detection of early stages of Alzheimer's disease based on MEG activity with a randomized convolutional neural network.",
            "Learning an expandable EMR-based medical knowledge network to enhance clinical diagnosis.",
            "A generic approach for cell segmentation based on Gabor filtering and area-constrained ultimate erosion.",
            "Temporal tree representation for similarity computation between medical patients.",
            "Rule-based automatic diagnosis of thyroid nodules from intraoperative frozen sections using deep learning.",
            "Continuous blood pressure measurement from one-channel electrocardiogram signal using deep-learning techniques.",
            "Implementation of an ontological reasoning to support the guideline-based management of primary breast cancer patients in the DESIREE project.",
            "Deep learning to find colorectal polyps in colonoscopy: A systematic literature review.",
            "Dealing with confounders and outliers in classification medical studies: The Autism Spectrum Disorders case study.",
            "Domain expertise-agnostic feature selection for the analysis of breast cancer data*.",
            "Using topological data analysis and pseudo time series to infer temporal phenotypes from electronic health records.",
            "Indoor location identification of patients for directing virtual care: An AI approach using machine learning and knowledge-based methods.",
            "Variable step dynamic threshold local binary pattern for classification of atrial fibrillation.",
            "Realistic hair simulator for skin lesion images: A novel benchemarking tool.",
            "Canada protocol: An ethical checklist for the use of artificial Intelligence in suicide prevention and mental health.",
            "Handling imbalanced medical image data: A deep-learning-based one-class classification approach.",
            "Coarse-to-fine classification for diabetic retinopathy grading using convolutional neural network.",
            "Automated ICD-10 code assignment of nonstandard diagnoses via a two-stage framework.",
            "Identification of Alzheimer's disease based on wavelet transformation energy feature of the structural MRI image and NN classifier.",
            "G-Forest: An ensemble method for cost-sensitive feature selection in gene expression microarrays.",
            "EBM+: Advancing Evidence-Based Medicine via two level automatic identification of Populations, Interventions, Outcomes in medical literature.",
            "A supervised machine learning-based methodology for analyzing dysregulation in splicing machinery: An application in cancer diagnosis.",
            "The natural language explanation algorithms for the lung cancer computer-aided diagnosis system.",
            "Editorial Board.",
            "Temporal tree representation for similarity computation between medical patients.",
            "Rule-based automatic diagnosis of thyroid nodules from intraoperative frozen sections using deep learning.",
            "Continuous blood pressure measurement from one-channel electrocardiogram signal using deep-learning techniques.",
            "Implementation of an ontological reasoning to support the guideline-based management of primary breast cancer patients in the DESIREE project.",
            "Deep learning to find colorectal polyps in colonoscopy: A systematic literature review.",
            "Dealing with confounders and outliers in classification medical studies: The Autism Spectrum Disorders case study.",
            "Domain expertise-agnostic feature selection for the analysis of breast cancer data*.",
            "Using topological data analysis and pseudo time series to infer temporal phenotypes from electronic health records.",
            "Indoor location identification of patients for directing virtual care: An AI approach using machine learning and knowledge-based methods.",
            "Variable step dynamic threshold local binary pattern for classification of atrial fibrillation.",
            "Realistic hair simulator for skin lesion images: A novel benchemarking tool.",
            "Canada protocol: An ethical checklist for the use of artificial Intelligence in suicide prevention and mental health.",
            "Handling imbalanced medical image data: A deep-learning-based one-class classification approach.",
            "Coarse-to-fine classification for diabetic retinopathy grading using convolutional neural network.",
            "Automated ICD-10 code assignment of nonstandard diagnoses via a two-stage framework.",
            "Identification of Alzheimer's disease based on wavelet transformation energy feature of the structural MRI image and NN classifier.",
            "G-Forest: An ensemble method for cost-sensitive feature selection in gene expression microarrays.",
            "EBM+: Advancing Evidence-Based Medicine via two level automatic identification of Populations, Interventions, Outcomes in medical literature.",
            "A supervised machine learning-based methodology for analyzing dysregulation in splicing machinery: An application in cancer diagnosis.",
            "The natural language explanation algorithms for the lung cancer computer-aided diagnosis system.",
            "Editorial Board.",
            "Extracting deep features from short ECG signals for early atrial fibrillation detection.",
            "Corrigendum to \"A neutrosophic-entropy based adaptive thresholding segmentation algorithm: A special application in MR images of Parkinson's disease\" [Artif Intell Med 104 (2020) 101838].",
            "A dynamic prediction engine to prevent chemotherapy-induced nausea and vomiting.",
            "GANs for medical image analysis.",
            "Exploiting complex medical data with interpretable deep learning for adverse drug event prediction.",
            "Grouping attributes zero-shot learning for tongue constitution recognition.",
            "Skeletal scintigraphy image enhancement based neutrosophic sets and salp swarm algorithm.",
            "Ensemble neural network approach detecting pain intensity from facial expressions.",
            "Recommendations for enhancing the usability and understandability of process mining in healthcare.",
            "Reinforcement learning for intelligent healthcare applications: A survey.",
            "Deep learning with attention supervision for automated motion artefact detection in quality control of cardiac T1-mapping.",
            "Predicting defibrillation success in out-of-hospital cardiac arrested patients: Moving beyond feature design.",
            "The automation of bias in medical Artificial Intelligence (AI): Decoding the past to create a better future.",
            "Supervised classification of bradykinesia in Parkinson's disease from smartphone videos.",
            "Neural collaborative filtering for unsupervised mitral valve segmentation in echocardiography.",
            "Autoencoded DNA methylation data to predict breast cancer recurrence: Machine learning models and gene-weight significance.",
            "Prediction of breast cancer distant recurrence using natural language processing and knowledge-guided convolutional neural network.",
            "A stochastic multi-agent approach for medical-image segmentation: Application to tumor segmentation in brain MR images.",
            "Sleep stage classification for child patients using DeConvolutional Neural Network."
        ]
    },
    {
        "name": "AIM",
        "year": "2019",
        "info": "2019: Volumes\n93,\n94,\n95,\n96,\n97,\n98,\n99,\n100,",
        "count": 99,
        "papers": [
            "Association measures for estimating semantic similarity and relatedness between biomedical concepts.",
            "Recent advances in extracting and processing rich semantics from medical texts.",
            "An architecture of open-source tools to combine textual information extraction, faceted search and information visualisation.",
            "Towards automatic encoding of medical procedures using convolutional neural networks and autoencoders.",
            "Classifying medical relations in clinical text via convolutional neural networks.",
            "How do we talk about doctors and drugs? Sentiment analysis in forums expressing opinions for medical domain.",
            "Denoising of low-dose CT images via low-rank tensor modeling and total variation regularization.",
            "A frame reduction system based on a color structural similarity (CSS) method and Bayer images analysis for capsule endoscopy.",
            "Antigenic: An improved prediction model of protective antigens.",
            "Explainable artificial intelligence for breast cancer: A visual case-based reasoning approach.",
            "Normal and pathological gait classification LSTM model.",
            "Active contour algorithm with discriminant analysis for delineating tumors in positron emission tomography.",
            "Predicting lab values for gastrointestinal bleeding patients in the intensive care unit: A comparative study on the impact of comorbidities and medications.",
            "Detection of abnormal behaviour for dementia sufferers using Convolutional Neural Networks.",
            "Joint segmentation and classification of retinal arteries/veins from fundus images.",
            "Machine learning models based on the dimensionality reduction of standard automated perimetry data for glaucoma diagnosis.",
            "Execution-time integration of clinical practice guidelines to provide decision support for comorbid conditions.",
            "Using classification techniques for statistical analysis of Anemia.",
            "Retinal blood vessel extraction employing effective image features and combination of supervised and unsupervised machine learning methods.",
            "A methodology for customizing clinical tests for esophageal cancer based on patient preferences.",
            "Predicting ICU readmission using grouped physiological and medication trends.",
            "Evaluation of the Tinetti score and fall risk assessment via accelerometry-based movement analysis.",
            "A survey on computer-assisted Parkinson's Disease diagnosis.",
            "Deep convolutional neural networks for brain image analysis on magnetic resonance imaging: a review.",
            "Pathological image compression for big data image analysis: Application to hotspot detection in breast cancer.",
            "Predicting hospital associated disability from imbalanced data using supervised learning.",
            "On predicting epithelial mesenchymal transition by integrating RNA-binding proteins and correlation data via L1/2-regularization method.",
            "A comparison between discrete and continuous time Bayesian networks in learning from clinical time series data with irregularity.",
            "Computational normalization of H&E-stained histological images: Progress, challenges and future potential.",
            "Computational methods for Gene Regulatory Networks reconstruction and analysis: A review.",
            "Fast density-peaks clustering for registration-free pediatric white matter tract analysis.",
            "Reliability-based robust multi-atlas label fusion for brain MRI segmentation.",
            "Dynamic thresholding networks for schizophrenia diagnosis.",
            "Prediction of fetal state from the cardiotocogram recordings using neural network models.",
            "Estimation of echocardiogram parameters with the aid of impedance cardiography and artificial neural networks.",
            "OntoSIDES: Ontology-based student progress monitoring on the national evaluation system of French Medical Schools.",
            "Feature-weighted survival learning machine for COPD failure prediction.",
            "Mining heterogeneous network for drug repositioning using phenotypic information extracted from social media and pharmaceutical databases.",
            "A data-driven approach to referable diabetic retinopathy detection.",
            "Detection of protein complexes from multiple protein interaction networks using graph embedding.",
            "Neural transfer learning for assigning diagnosis codes to EMRs.",
            "Complexity perception classification method for tongue constitution recognition.",
            "Sparse support vector machines with L0 approximation for ultra-high dimensional omics data.",
            "Autonomous agents and multi-agent systems applied in healthcare.",
            "Towards a modular decision support system for radiomics: A case study on rectal cancer.",
            "Indexing the Event Calculus: Towards practical human-readable Personal Health Systems.",
            "Personalized conciliation of clinical guidelines for comorbid patients through multi-agent planning.",
            "BDI personal medical assistant agents: The case of trauma tracking and alerting.",
            "Project INSIDE: towards autonomous semi-unstructured human-robot social interaction in autism therapy.",
            "Real-time multi-agent systems for telerehabilitation scenarios.",
            "Incorporated region detection and classification using deep convolutional networks for bone age assessment.",
            "Recurrent neural networks with segment attention and entity description for relation extraction from clinical texts.",
            "Texture descriptors and voxels for the early diagnosis of Alzheimer's disease.",
            "Combining clustering and classification ensembles: A novel pipeline to identify breast cancer profiles.",
            "Accurate prediction of blood culture outcome in the intensive care unit using long short-term memory neural networks.",
            "Segmentation of breast MR images using a generalised 2D mathematical model with inflation and deflation forces of active contours.",
            "Neural network modelling of soft tissue deformation for surgical simulation.",
            "A computer-aided diagnosis system for HEp-2 fluorescence intensity classification.",
            "Comparative effectiveness of convolutional neural network (CNN) and recurrent neural network (RNN) architectures for radiology text report classification.",
            "Optimal testing policies for diagnosing patients with intermediary probability of disease.",
            "Recursive model identification for the analysis of the autonomic response to exercise testing in Brugada syndrome.",
            "CT liver tumor segmentation hybrid approach using neutrosophic sets, fast fuzzy c-means and adaptive watershed algorithm.",
            "An efficient and fast computer-aided method for fully automated diagnosis of meniscal tears from magnetic resonance images.",
            "MRI denoising by NeighShrink based on chi-square unbiased risk estimation.",
            "A novel dynamical approach in continuous cuffless blood pressure estimation based on ECG and PPG signals.",
            "Profiling continuous sleep representations for better understanding of the dynamic character of normal sleep.",
            "Diabetic retinopathy techniques in retinal images: A review.",
            "Fuzzy logic based approaches for gene regulatory network inference.",
            "A survey of neural network-based cancer prediction models from microarray data.",
            "A deep survival analysis method based on ranking.",
            "3D-CNN based discrimination of schizophrenia using resting-state fMRI.",
            "Distant supervision for treatment relation extraction by leveraging MeSH subheadings.",
            "Deep multiphysics: Coupling discrete multiphysics with machine learning to attain self-learning in-silico models replicating human physiology.",
            "Accurate prediction of potential druggable proteins based on genetic algorithm and Bagging-SVM ensemble classifier.",
            "Convolutional neural networks for skull-stripping in brain MR imaging using silver standard masks.",
            "Optimizing neural networks for medical data sets: A case study on neonatal apnea prediction.",
            "Labeling images with facial emotion and the potential for pediatric healthcare.",
            "Supporting the distributed execution of clinical guidelines by multiple agents.",
            "Data-driven modeling and prediction of blood glucose dynamics: Machine learning applications in type 1 diabetes.",
            "Depression recognition using machine learning methods with different feature generation strategies.",
            "Using game theory and decision decomposition to effectively discern and characterise bi-locus diseases.",
            "Retinal image assessment using bi-level adaptive morphological component analysis.",
            "Referable diabetic retinopathy identification from eye fundus images with weighted path for convolutional neural network.",
            "Diabetic retinopathy detection through novel tetragonal local octa patterns and extreme learning machines.",
            "Personalized oncology with artificial intelligence: The case of temozolomide.",
            "Strategic room type allocation for nursing wards through Markov chain modeling.",
            "Multilayered rule-based expert system for diagnosing uveitis.",
            "Deep learning based computer-aided diagnosis systems for diabetic retinopathy: A survey.",
            "Machine learning and big data: Implications for disease modeling and therapeutic discovery in psychiatry.",
            "Prediction of progression in idiopathic pulmonary fibrosis using CT scans at baseline: A quantum particle swarm optimization - Random forest approach.",
            "On strategic choices faced by large pharmaceutical laboratories and their effect on innovation risk under fuzzy conditions.",
            "Leveraging implicit expert knowledge for non-circular machine learning in sepsis prediction.",
            "Multi-criterion mammographic risk analysis supported with multi-label fuzzy-rough feature selection.",
            "Ten years of knowledge representation for health care (2009-2018): Topics, trends, and challenges.",
            "The role of medical smartphone apps in clinical decision-support: A literature review.",
            "The virtual doctor: An interactive clinical-decision-support system based on deep learning for non-invasive prediction of diabetes.",
            "Automated detection of schizophrenia using nonlinear signal processing methods.",
            "A novel model for evaluation Hospital medical care systems based on plithogenic sets.",
            "Automated plaque classification using computed tomography angiography and Gabor transformations."
        ]
    },
    {
        "name": "AIM",
        "year": "2018",
        "info": "2018: Volumes\n84,\n85,\n86,\n87,\n88,\n89,\n90,\n91,\n92",
        "count": 74,
        "papers": [
            "Pronation and supination analysis based on biomechanical signals from Parkinson's disease patients.",
            "Chaotic genetic algorithm and Adaboost ensemble metamodeling approach for optimum resource planning in emergency departments.",
            "SSEL-ADE: A semi-supervised ensemble learning framework for extracting adverse drug events from social media.",
            "Development of an intelligent surgical training system for Thoracentesis.",
            "Image processing strategies based on saliency segmentation for object recognition under simulated prosthetic vision.",
            "An EEG-based functional connectivity measure for automatic detection of alcohol use disorder.",
            "isGPT: An optimized model to identify sub-Golgi protein types using SVM and Random Forest based feature selection.",
            "Different approaches for identifying important concepts in probabilistic biomedical text summarization.",
            "A novel method for predicting kidney stone type using ensemble learning.",
            "Spatiotemporal Bayesian networks for malaria prediction.",
            "Bayesian averaging over Decision Tree models for trauma severity scoring.",
            "Random ensemble learning for EEG classification.",
            "Improving the anesthetic process by a fuzzy rule based medical decision system.",
            "Personalized prediction of drug efficacy for diabetes treatment via patient-level sequential modeling with neural networks.",
            "Inflection point analysis: A machine learning approach for extraction of IEGM active intervals during atrial fibrillation.",
            "Approximate dynamic programming approaches for appointment scheduling with patient preferences.",
            "Special section on artificial intelligence for diabetes.",
            "Temporal case-based reasoning for type 1 diabetes mellitus bolus insulin decision support.",
            "Single Nucleotide Polymorphism relevance learning with Random Forests for Type 2 diabetes risk prediction.",
            "Learning ensemble classifiers for diabetic retinopathy assessment.",
            "Anytime multipurpose emotion recognition from EEG data using a Liquid State Machine based framework.",
            "Activities suggestion based on emotions in AAL environments.",
            "An ontology-driven clinical decision support system (IDDAP) for infectious disease diagnosis and antibiotic prescription.",
            "Representing and querying now-relative relational medical data.",
            "Using echo state networks for classification: A case study in Parkinson's disease diagnosis.",
            "Position-aware deep multi-task learning for drug-drug interaction extraction.",
            "Co-occurrence graphs for word sense disambiguation in the biomedical domain.",
            "Pharmacological therapy selection of type 2 diabetes based on the SWARA and modified MULTIMOORA methods under a fuzzy environment.",
            "A two-step approach for mining patient treatment pathways in administrative healthcare databases.",
            "EMR-based medical knowledge representation and inference via Markov random fields and distributed representation learning.",
            "What matters in a transferable neural network model for relation classification in the biomedical domain?",
            "Handwritten dynamics assessment through convolutional neural networks: An application to Parkinson's disease identification.",
            "Absolute cosine-based SVM-RFE feature selection method for prostate histopathological grading.",
            "Dictionary-based monitoring of premature ventricular contractions: An ultra-low-cost point-of-care service.",
            "Segmentation of corneal endothelium images using a U-Net-based convolutional neural network.",
            "MuDeRN: Multi-category classification of breast histopathological image using deep residual networks.",
            "An intelligent algorithm for identification of optimum mix of demographic features for trust in medical centers in Iran.",
            "Leveraging Wikipedia knowledge to classify multilingual biomedical documents.",
            "Lung sounds classification using convolutional neural networks.",
            "Identifying β-thalassemia carriers using a data mining approach: The case of the Gaza Strip, Palestine.",
            "Extracting cancer mortality statistics from death certificates: A hybrid machine learning and rule-based approach for common and rare cancers.",
            "An interoperable clinical decision-support system for early detection of SIRS in pediatric intensive care using openEHR.",
            "Using preference learning for detecting inconsistencies in clinical practice guidelines: Methods and application to antibiotherapy.",
            "A distance measure between intuitionistic fuzzy sets and its application in medical diagnosis.",
            "Modeling the connections of brain regions in children with autism using cellular neural networks and electroencephalography analysis.",
            "Heart disease diagnosis based on mediative fuzzy logic.",
            "Internet of Health Things: Toward intelligent vital signs monitoring in hospital wards.",
            "A review of statistical and machine learning methods for modeling cancer risk using structured clinical data.",
            "Decision support system for detection of hypertensive retinopathy using arteriovenous ratio.",
            "Abdominal, multi-organ, auto-contouring method for online adaptive magnetic resonance guided radiotherapy: An intelligent, multi-level fusion approach.",
            "Mining heterogeneous networks with topological features constructed from patient-contributed content for pharmacovigilance.",
            "Dependence between cognitive impairment and metabolic syndrome applied to a Brazilian elderly dataset.",
            "Preface: AIME 2017.",
            "Surgical motion analysis using discriminative interpretable patterns.",
            "Causality assessment of adverse drug reaction reports using an expert-defined Bayesian network.",
            "Process models of interrelated speech intentions from online health-related conversations.",
            "Detecting mental fatigue from eye-tracking data gathered while watching video: Evaluation in younger and older adults.",
            "Change-point detection method for clinical decision support system rule monitoring.",
            "Early anomaly detection in smart home: A causal association rule-based approach.",
            "Automatic classification of radiological reports for clinical care.",
            "Symptoms and medications change patterns for Parkinson's disease patients stratification.",
            "Arden Syntax: Then, now, and in the future.",
            "Origins of the Arden Syntax.",
            "Evolution of the Arden Syntax: Key Technical Issues from the Standards Development Organization Perspective.",
            "Pediatric decision support using adapted Arden Syntax.",
            "Clinical decision support systems at the Vienna General Hospital using Arden Syntax: Design, implementation, and integration.",
            "Assessing the feasibility of a mobile health-supported clinical decision support system for nutritional triage in oncology outpatients using Arden Syntax.",
            "Using Arden Syntax Medical Logic Modules to reduce overutilization of laboratory tests for detection of bacterial infections - Success or failure?",
            "Data-driven knowledge acquisition, validation, and transformation into HL7 Arden Syntax.",
            "Executable medical guidelines with Arden Syntax - Applications in dermatology and obstetrics.",
            "Transformation of Arden Syntax's medical logic modules into ArdenML for a business rules management system.",
            "Using Arden Syntax for the creation of a multi-patient surveillance dashboard.",
            "Accessing complex patient data from Arden Syntax Medical Logic Modules.",
            "User-defined functions in the Arden Syntax: An extension proposal."
        ]
    },
    {
        "name": "AIM",
        "year": "2017",
        "info": "2017: Volumes\n75,\n76,\n77,\n78,\n79,\n80,\n81,\n82,\n83",
        "count": 61,
        "papers": [
            "An algorithm for direct causal learning of influences on patient outcomes.",
            "A high-order representation and classification method for transcription factor binding sites recognition in Escherichia coli.",
            "Marvin Lee Minsky (1927-2016).",
            "Piecewise-linear criterion functions in oblique survival tree induction.",
            "The evaluation of trustworthiness to identify health insurance fraud in dentistry.",
            "Handling limited datasets with neural networks in medical applications: A small-data approach.",
            "Protein coding gene CRNKL1 as a potential prognostic biomarker in esophageal adenocarcinoma.",
            "Identification of adverse drug-drug interactions through causal association rule discovery from spontaneous adverse event reports.",
            "DisTeam: A decision support tool for surgical team selection.",
            "Analysis of cancer-related lncRNAs using gene ontology and KEGG pathways.",
            "Editorial from the new Editor-in-Chief: Artificial Intelligence in Medicine and the forthcoming challenges.",
            "Temporal detection and analysis of guideline interactions.",
            "Dynamically weighted evolutionary ordinal neural network for solving an imbalanced liver transplantation problem.",
            "Differential regulation analysis reveals dysfunctional regulatory mechanism involving transcription factors and microRNAs in gastric carcinogenesis.",
            "Updating Markov models to integrate cross-sectional and longitudinal studies.",
            "A case-based reasoning system based on weighted heterogeneous value distance metric for breast cancer diagnosis.",
            "Knowledge graph for TCM health preservation: Design, construction, and applications.",
            "Drug repositioning based on triangularly balanced structure for tissue-specific diseases in incomplete interactome.",
            "Modeling new immunoregulatory therapeutics as antimicrobial alternatives for treating Clostridium difficile infection.",
            "Intelligent computational model for classification of sub-Golgi protein using oversampling and fisher feature selection methods.",
            "Heart murmur detection based on wavelet transformation and a synergy between artificial neural network and modified neighbor annealing methods.",
            "Subcellular localization prediction of apoptosis proteins based on evolutionary information and support vector machine.",
            "Integration of data mining classification techniques and ensemble learning to identify risk factors and diagnose ovarian cancer recurrence.",
            "Automatic detection of surgical haemorrhage using computer vision.",
            "Machine learning based identification of protein-protein interactions using derived features of physiochemical properties and evolutionary profiles.",
            "Protein fold recognition based on sparse representation based classification.",
            "From SNOMED CT to Uberon: Transferability of evaluation methodology between similarly structured ontologies.",
            "A hybrid framework for reverse engineering of robust Gene Regulatory Networks.",
            "Fully automated breast boundary and pectoral muscle segmentation in mammograms.",
            "Premature ventricular contraction detection combining deep neural networks and rules inference.",
            "Random survival forest with space extensions for censored data.",
            "iACP-GAEnsC: Evolutionary genetic algorithm based ensemble classification of anticancer peptides by utilizing hybrid feature space.",
            "Medical image classification via multiscale representation learning.",
            "Personal sleep pattern visualization using sequence-based kernel self-organizing map on sound data.",
            "Owlready: Ontology-oriented programming in Python with automatic classification and high level constructs for biomedical ontologies.",
            "Detecting masses in dense breast using independent component analysis.",
            "A machine learning approach for real-time modelling of tissue deformation in image-guided neurosurgery.",
            "A new preprocessing parameter estimation based on geodesic active contour model for automatic vestibular neuritis diagnosis.",
            "Artificial Intelligence in Medicine AIME 2015.",
            "Automatic matching of surgeries to predict surgeons' next actions.",
            "Inter-labeler and intra-labeler variability of condition severity classification models using active and passive learning methods.",
            "Reprint of \"Updating Markov models to integrate cross-sectional and longitudinal studies\".",
            "Early prediction of radiotherapy-induced parotid shrinkage and toxicity based on CT radiomics and fuzzy classification.",
            "Feasibility of spirography features for objective assessment of motor function in Parkinson's disease.",
            "User recommendation in healthcare social media by assessing user similarity in heterogeneous network.",
            "Analyzing interactions on combining multiple clinical guidelines.",
            "A hierarchical classifier based on human blood plasma fluorescence for non-invasive colorectal cancer screening.",
            "Finding discriminative and interpretable patterns in sequences of surgical activities.",
            "Evaluation of an automated knowledge-based textual summarization system for longitudinal clinical data, in the intensive care domain.",
            "Gene2DisCo: Gene to disease using disease commonalities.",
            "Gaussian process classification of superparamagnetic relaxometry data: Phantom study.",
            "Machine learning and graph analytics in computational biomedicine.",
            "Extract critical factors affecting the length of hospital stay of pneumonia patient by data mining (case study: an Iranian hospital).",
            "Employing decomposable partially observable Markov decision processes to control gene regulatory networks.",
            "Prediction of synergistic anti-cancer drug combinations based on drug target network and drug induced gene expression profiles.",
            "Medical image classification based on multi-scale non-negative sparse coding.",
            "Identification of transcription factors that may reprogram lung adenocarcinoma.",
            "Automatic segmentation of liver tumors from multiphase contrast-enhanced CT images based on FCNs.",
            "Improved prediction of protein-protein interactions using novel negative samples, features, and an ensemble classifier.",
            "Identify and analysis crotonylation sites in histone by using support vector machines.",
            "A novel hierarchical selective ensemble classifier with bioinformatics application."
        ]
    },
    {
        "name": "AIM",
        "year": "2016",
        "info": "2016: Volumes\n66,\n67,\n68,\n69,\n70,\n71,\n72,\n73,\n74",
        "count": 53,
        "papers": [
            "Scalable gastroscopic video summarization via similar-inhibition dictionary selection.",
            "A generalized procedure for analyzing sustained and dynamic vocal fold vibrations from laryngeal high-speed videos using phonovibrograms.",
            "Information extraction from multi-institutional radiology reports.",
            "Value of information analysis for interventional and counterfactual Bayesian networks in forensic medical sciences.",
            "Analyzing depression tendency of web posts using an event-driven depression tendency warning model.",
            "The feature selection bias problem in relation to high-dimensional gene data.",
            "Pattern identification of biomedical images with time series: Contrasting THz pulse imaging with DCE-MRIs.",
            "Comparison of automatic summarisation methods for clinical free text notes.",
            "Evaluation of handwriting kinematics and pressure for differential diagnosis of Parkinson's disease.",
            "Dopaminergic-induced dyskinesia assessment based on a single belt-worn accelerometer.",
            "SmartFABER: Recognizing fine-grained abnormal behaviors for early detection of mild cognitive impairment.",
            "From complex questionnaire and interviewing data to intelligent Bayesian network models for medical decision support.",
            "Defocus-aware Dirichlet particle filter for stable endoscopic video frame recognition.",
            "Knowledge-light adaptation approaches in case-based reasoning for radiotherapy treatment planning.",
            "Evaluation of a machine learning capability for a clinical decision support system to enhance antimicrobial stewardship programs.",
            "Cardiorespiratory fitness estimation in free-living using wearable sensors.",
            "A method for the development of disease-specific reference standards vocabularies from textual biomedical literature resources.",
            "A hybrid genetic algorithm-queuing multi-compartment model for optimizing inpatient bed occupancy and associated costs.",
            "A novel method to use fuzzy soft sets in decision making based on ambiguity measure and Dempster-Shafer theory of evidence: An application in medical diagnosis.",
            "From frames to OWL2: Converting the Foundational Model of Anatomy.",
            "Evolving classification of intensive care patients from event data.",
            "Detecting borderline infection in an automated monitoring system for healthcare-associated infection using fuzzy logic.",
            "A wearable sensor system for medication adherence prediction.",
            "Utilizing uncoded consultation notes from electronic medical records for predictive modeling of colorectal cancer.",
            "Traveling on discrete embeddings of gene expression.",
            "Classification of auditory brainstem responses through symbolic pattern discovery.",
            "A framework for parameter estimation and model selection in kernel deep stacking networks.",
            "Effective gene expression data generation framework based on multi-model approach.",
            "An ensemble method for extracting adverse drug events from social media.",
            "Machine learning classification of surgical pathology reports and chunk recognition for information extraction noise reduction.",
            "On the early diagnosis of Alzheimer's Disease from multimodal signals: A survey.",
            "On the development of conjunctival hyperemia computer-assisted diagnosis tools: Influence of feature selection and class imbalance in automatic gradings.",
            "Detecting signals of detrimental prescribing cascades from social media.",
            "Clinical phenotyping in selected national networks: demonstrating the need for high-throughput, portable, and computational methods.",
            "Predicting overlapping protein complexes from weighted protein interaction graphs by gradually expanding dense neighborhoods.",
            "Survival analysis for high-dimensional, heterogeneous medical data: Exploring feature extraction as an alternative to feature selection.",
            "Building interpretable predictive models for pediatric hospital readmission using Tree-Lasso logistic regression.",
            "META-GLARE: A meta-system for defining your own computer interpretable guideline system - Architecture and acquisition.",
            "Prediction of lung cancer incidence on the low-dose computed tomography arm of the National Lung Screening Trial: A dynamic Bayesian network.",
            "Efficient processing of multiple nested event pattern queries over multi-dimensional event streams based on a triaxial hierarchical model.",
            "A mixed-ensemble model for hospital readmission.",
            "Corrigendum to \"Defocus-aware Dirichlet particle filter for stable endoscopic video frame recognition\" [Artif. Intell. Med. 68 (March 2016) 1-16].",
            "Brain tumor segmentation from multimodal magnetic resonance images via sparse representation.",
            "Automated segmentation of white matter fiber bundles using diffusion tensor imaging data and a new density based clustering algorithm.",
            "A comparative analysis of chaotic particle swarm optimizations for detecting single nucleotide polymorphism barcodes.",
            "Out of hours workload management: Bayesian inference for decision support in secondary care.",
            "A review on brain structures segmentation in magnetic resonance imaging.",
            "Prediction of anti-cancer drug response by kernelized multi-task learning.",
            "Non-obvious correlations to disease management unraveled by Bayesian artificial intelligence analyses of CMS data.",
            "Web-video-mining-supported workflow modeling for laparoscopic surgeries.",
            "An adaptive large neighborhood search procedure applied to the dynamic patient admission scheduling problem.",
            "Gesteme-free context-aware adaptation of robot behavior in human-robot cooperation.",
            "Analysis of correlation between pediatric asthma exacerbation and exposure to pollutant mixtures with association rule mining."
        ]
    },
    {
        "name": "AIM",
        "year": "2015",
        "info": "2015: Volumes\n63,\n64,\n65",
        "count": 59,
        "papers": [
            "Self-focusing therapeutic gene delivery with intelligent gene vector swarms: Intra-swarm signalling through receptor transgene expression in targeted cells.",
            "Brain-controlled applications using dynamic P300 speller matrices.",
            "Improving the Mann-Whitney statistical test for feature selection: An approach in breast cancer diagnosis on mammography.",
            "Adaptive dynamic programming algorithms for sequential appointment scheduling with patient preferences.",
            "DrugNet: Network-based drug-disease prioritization by integrating heterogeneous data.",
            "Predicting the risk of exacerbation in patients with chronic obstructive pulmonary disease using home telehealth measurement data.",
            "A systems approach to healthcare: Agent-based modeling, community mental health, and population well-being.",
            "Ontology for assessment studies of human-computer-interaction in surgery.",
            "Outcome quality assessment by surgical process compliance measures in laparoscopic surgery.",
            "A short-term operating room surgery scheduling problem integrating multiple nurses roster constraints.",
            "Development of electroencephalographic pattern classifiers for real and imaginary thumb and index finger movements of one hand.",
            "Application of a two-stage fuzzy neural network to a prostate cancer prognosis system.",
            "Machine learning in computational docking.",
            "Recognizing lexical and semantic change patterns in evolving life science ontologies to inform mapping adaptation.",
            "Improved cosine similarity measures of simplified neutrosophic sets for medical diagnoses.",
            "Predicting protein complexes from weighted protein-protein interaction graphs with a novel unsupervised methodology: Evolutionary enhanced Markov clustering.",
            "Predictive modelling of survival and length of stay in critically ill patients using sequential organ failure scores.",
            "Solving challenges in inter- and trans-disciplinary working teams: Lessons from the surgical technology field.",
            "Abstraction networks for terminologies: Supporting management of \"big knowledge\".",
            "Sentiment analysis in medical settings: New opportunities and challenges.",
            "A comparative analysis of the density of the SNOMED CT conceptual content for semantic harmonization.",
            "Automatic negation detection in narrative pathology reports.",
            "A semi-supervised learning framework for biomedical event extraction based on hidden topics.",
            "An improved I-FAST system for the diagnosis of Alzheimer's disease from unprocessed electroencephalograms by using robust invariant features.",
            "A review of segmentation and deformable registration methods applied to adaptive cervical cancer radiation therapy treatment planning.",
            "Automatic evidence quality prediction to support evidence-based decision making.",
            "Learning from healthy and stable eyes: A new approach for detection of glaucomatous progression.",
            "A label fusion method using conditional random fields with higher-order potentials: Application to hippocampal segmentation.",
            "An unsupervised feature learning framework for basal cell carcinoma image analysis.",
            "Assessment of surveys for the management of hospital clinical pharmacy services.",
            "Corrigendum to \"A computer vision framework for finger-tapping evaluation in Parkinson's disease\" [Artif. Intell. in Medicine 60 (2014) 27-40].",
            "An approach to fuzzy soft sets in decision making based on grey relational analysis and Dempster-Shafer theory of evidence: An application in medical diagnosis.",
            "A k-mer-based barcode DNA classification methodology based on spectral representation and a neural gas network.",
            "Protein-protein interaction identification using a hybrid model.",
            "Robust feature selection to predict tumor treatment outcome.",
            "Cardiac magnetic resonance image-based classification of the risk of arrhythmias in post-myocardial infarction patients.",
            "Semi-online patient scheduling in pathology laboratories.",
            "Corrigendum to \"A characterization of electrocardiogram signals through optimal allocation of information granularity\" [Artif. Intell. Med. 54(2012) 125-134].",
            "Artificial Intelligence in Medicine AIME 2013.",
            "Clinical time series prediction: Toward a hierarchical dynamical system framework.",
            "From decision to shared-decision: Introducing patients' preferences into clinical decision analysis.",
            "Intra-axiom redundancies in SNOMED CT.",
            "Approaching the axiomatic enrichment of the Gene Ontology from a lexical perspective.",
            "Classifying GABAergic interneurons with semi-supervised projected model-based clustering.",
            "Thirty years of artificial intelligence in medicine (AIME) conferences: A review of research themes.",
            "Intelligent healthcare informatics in big data era.",
            "Removing confounding factors via constraint-based clustering: An application to finding homogeneous groups of multiple sclerosis patients.",
            "Predicting readmission risk with institution-specific prediction models.",
            "Spatiotemporal data visualisation for homecare monitoring of elderly people.",
            "Synthesis of a high resolution social contact network for Delhi with application to pandemic planning.",
            "Multilingual event extraction for epidemic detection.",
            "Boosting drug named entity recognition using an aggregate classifier.",
            "An empirical evaluation of supervised learning approaches in assigning diagnosis codes to electronic medical records.",
            "On local anomaly detection and analysis for clinical pathways.",
            "A fuzzy-ontology-oriented case-based reasoning framework for semantic diabetes diagnosis.",
            "Interpretative reading of the antibiogram - a semi-naïve Bayesian approach.",
            "A hybrid cost-sensitive ensemble for imbalanced breast thermogram classification.",
            "Sparse deconvolution of higher order tensor for fiber orientation distribution estimation.",
            "Benchmarking human epithelial type 2 interphase cells classification methods on a very large dataset."
        ]
    },
    {
        "name": "AIM",
        "year": "2014",
        "info": "2014: Volumes\n60,\n61,\n62",
        "count": 54,
        "papers": [
            "Knowledge discovery in clinical decision support systems for pain management: A systematic review.",
            "Performance of a dermoscopy-based computer vision system for the diagnosis of pigmented skin lesions compared with visual evaluation by experienced dermatologists.",
            "A computer vision framework for finger-tapping evaluation in Parkinson's disease.",
            "Fuzzy model identification of dengue epidemic in Colombia based on multiresolution analysis.",
            "White box radial basis function classifiers with component selection for clinical prediction models.",
            "Classification of small lesions on dynamic breast MRI: Integrating dimension reduction and out-of-sample extension into CADx methodology.",
            "Employing heat maps to mine associations in structured routine care data.",
            "Detecting rare events using extreme value statistics applied to epileptic convulsions in children.",
            "Supervised machine learning-based classification of oral malodor based on the microbiota in saliva samples.",
            "Improving predictive models of glaucoma severity by incorporating quality indicators.",
            "Fuzzy logic-based diagnostic algorithm for implantable cardioverter defibrillators.",
            "Multi-agent model of hepatitis C virus infection.",
            "Temporal abstraction and temporal Bayesian networks in clinical domains: A survey.",
            "Intensity-based image registration using scatter search.",
            "Automatic detection of solitary lung nodules using quality threshold clustering, genetic algorithm and diversity index.",
            "Using a multi-agent system approach for microaneurysm detection in fundus images.",
            "Vicinal support vector classifier using supervised kernel-based clustering.",
            "Multi-objective evolutionary algorithms for fuzzy classification in survival prediction.",
            "Interval type-2 fuzzy neural network controller for a multivariable anesthesia system based on a hardware-in-the-loop simulation.",
            "A token centric part-of-speech tagger for biomedical text.",
            "Scalable approximate policies for Markov decision process models of hospital elective admissions.",
            "Multi-test decision tree and its application to microarray data classification.",
            "Sepsis mortality prediction with the Quotient Basis Kernel.",
            "Unsupervised tissue segmentation from dynamic contrast-enhanced magnetic resonance imaging.",
            "An extensive analysis of disease-gene associations using network integration and fast kernel-based gene prioritization methods.",
            "Automatic classification of epilepsy types using ontology-based and genetics-based machine learning.",
            "A methodology for the characterization and diagnosis of cognitive impairments - Application to specific language impairment.",
            "Noninvasive evaluation of mental stress using by a refined rough set technique based on biomedical signals.",
            "Scattering features for lung cancer detection in fibered confocal fluorescence microscopy images.",
            "Advanced portable remote monitoring system for the regulation of treadmill running exercises.",
            "Text mining and information analysis of health documents.",
            "Statistical parsing of varieties of clinical Finnish.",
            "Cue-based assertion classification for Swedish clinical text - Developing a lexicon for pyConTextSwe.",
            "De-identification of health records using Anonym: Effectiveness and robustness across datasets.",
            "Twitter mining for fine-grained syndromic surveillance.",
            "Adaptation of machine translation for multilingual information retrieval in the medical domain.",
            "Recommendations for the ethical use and design of artificial intelligent care providers.",
            "Cross-hospital portability of information extraction of cancer staging information.",
            "Cancer survival classification using integrated data sets and intermediate information.",
            "Improving structural medical process comparison by exploiting domain knowledge and mined information.",
            "Optimization of anemia treatment in hemodialysis patients via reinforcement learning.",
            "Interactive web service system for exploration of biological pathways.",
            "Elie Sanchez, 1944-2014.",
            "From spoken narratives to domain knowledge: Mining linguistic data for medical image understanding.",
            "Evaluating the effects of cognitive support on psychiatric clinical comprehension.",
            "Biomedical visual data analysis to build an intelligent diagnostic decision support system in medical genetics.",
            "Relationship between preparation of cells for therapy and cell quality using artificial neural network analysis.",
            "Parametric model of human body shape and ligaments for patient-specific epidural simulation.",
            "Fuzzy logic-based diagnostic algorithm plus ventricles depolarization morphology algorithm for implantable cardioverter-defibrillators.",
            "Non-linear temporal scaling of surgical processes.",
            "Operation room tool handling and miscommunication scenarios: An object-process methodology conceptual model.",
            "Transductive domain adaptive learning for epileptic electroencephalogram recognition.",
            "Leucocyte classification for leukaemia detection using image processing techniques.",
            "NICeSim: An open-source simulator based on machine learning techniques to support medical research on prenatal and perinatal care decision making."
        ]
    },
    {
        "name": "AIM",
        "year": "2013",
        "info": "2013: Volumes\n57,\n58,\n59",
        "count": 61,
        "papers": [
            "Robert S. Ledley, 1926-2012.",
            "Artificial intelligence framework for simulating clinical decision-making: A Markov decision process approach.",
            "Understanding the nature of information seeking behavior in critical care: Implications for the design of health information technology.",
            "A growth model of human papillomavirus type 16 designed from cellular automata and agent-based models.",
            "Mood recognition in bipolar patients through the PSYCHE platform: Preliminary evaluations and perspectives.",
            "Weighted spherical 1-mean with phase shift and its application in electrocardiogram discord detection.",
            "On the interplay of machine learning and background knowledge in image interpretation by Bayesian networks.",
            "Artificial intelligence in medicine AIME 2011.",
            "Automated generation of patient-tailored electronic care pathways by translating computer-interpretable guidelines into hierarchical task networks.",
            "Assessing and combining repeated prognosis of physicians and temporal models in the intensive care.",
            "The Foundational Model of Anatomy in OWL 2 and its use.",
            "Elicitation of neurological knowledge with argument-based machine learning.",
            "A system for the extraction and representation of summary of product characteristics content.",
            "Factors affecting the effectiveness of biomedical document indexing and retrieval based on terminologies.",
            "Probabilistic problem solving in biomedicine.",
            "Multilevel Bayesian networks for the analysis of hierarchical health care data.",
            "Discovering human immunodeficiency virus mutational pathways using temporal Bayesian networks.",
            "Impact of precision of Bayesian network parameters on accuracy of medical diagnostic systems.",
            "Identifying significant edges in graphical models of molecular networks.",
            "Predicting human immunodeficiency virus inhibitors using multi-dimensional Bayesian network classifiers.",
            "Argumentation-logic for creating and explaining medical hypotheses.",
            "A knowledge-based clinical toxicology consultant for diagnosing multiple exposures.",
            "Generating personalized advice for schizophrenia patients.",
            "Predicting patient survival after liver transplantation using evolutionary multi-objective artificial neural networks.",
            "Prediction of body mass index status from voice signals based on machine learning for automated medical applications.",
            "Missing data in medical databases: Impute, delete or classify?",
            "The readiness of SNOMED problem list concepts for meaningful use of electronic health records.",
            "Creating personalised clinical pathways by semantic interoperability with electronic health records.",
            "Artificial metaplasticity prediction model for cognitive rehabilitation outcome in acquired brain injury patients.",
            "Characterization of spatiotemporal changes for the classification of dynamic contrast-enhanced magnetic-resonance breast lesions.",
            "A preclustering-based ensemble learning technique for acute appendicitis diagnoses.",
            "Training artificial neural networks directly on the concordance index for censored data using genetic algorithms.",
            "Homer Richards Warner, 1922-2012.",
            "Discovering metric temporal constraint networks on temporal databases.",
            "Subpopulation-specific confidence designation for more informative biomedical classification.",
            "Computational intelligence for the Balanced Scorecard: Studying performance trends of hemodialysis clinics.",
            "A quantifier-based fuzzy classification system for breast cancer patients.",
            "An approach for Ewing test selection to support the clinical assessment of cardiac autonomic neuropathy.",
            "Unveiling relevant non-motor Parkinson's disease severity symptoms using a machine learning approach.",
            "Clinical decision support systems: Need for evidence, need for evaluation.",
            "From an expert-driven paper guideline to a user-centred decision support system: A usability comparison study.",
            "Evaluation of rule effectiveness and positive predictive value of clinical rules in a Dutch clinical decision support system in daily hospital pharmacy practice.",
            "Safety and usability evaluation of a web-based insulin self-titration system for patients with type 2 diabetes mellitus.",
            "Physicians' responses to clinical decision support on an intensive care unit - Comparison of four different alerting methods.",
            "Impact of four training conditions on physician use of a web-based clinical decision support system.",
            "A pilot study of distributed knowledge management and clinical decision support in the cloud.",
            "Facing the challenge: Bringing brain-computer interfaces to end-users.",
            "Asynchronous gaze-independent event-related potential-based brain-computer interface.",
            "User-centered design in brain-computer interfaces - A case study.",
            "The auditory P300-based single-switch brain-computer interface: Paradigm transition from healthy subjects to minimally conscious patients.",
            "Semantic conditioning of salivary pH for communication.",
            "Brain Painting: Usability testing according to the user-centered design in end users with severe motor paralysis.",
            "Brain-computer interface controlled gaming: Evaluation of usability by severely motor restricted end-users.",
            "Transferring brain-computer interfaces beyond the laboratory: Successful application control for motor-disabled users.",
            "Hybrid brain-computer interfaces and hybrid neuroprostheses for restoration of upper limb functions in individuals with high-level spinal cord injury.",
            "Describing disease processes using a probabilistic logic of qualitative time.",
            "Phased searching with NEAT in a Time-Scaled Framework: Experiments on a computer-aided detection system for lung nodules.",
            "Comparing the accuracy of syndrome surveillance systems in detecting influenza-like illness: GUARDIAN vs. RODS vs. electronic medical record reports.",
            "Comparative analysis of a-priori and a-posteriori dietary patterns using state-of-the-art classification algorithms: A case/case-control study.",
            "Image partitioning and illumination in image-based pose detection for teleoperated flexible endoscopes.",
            "Data structure-guided development of electrocardiographic signal characterization and classification."
        ]
    },
    {
        "name": "AIM",
        "year": "2012",
        "info": "2012: Volumes\n54,\n55,\n56",
        "count": 55,
        "papers": [
            "A formal approach to the analysis of clinical computer-interpretable guideline modeling languages.",
            "Similarity metrics for surgical process models.",
            "Static and dynamic pressure prediction for prosthetic socket fitting assessment utilising an inverse problem approach.",
            "Selection of effective features for ECG beat recognition based on nonlinear correlations.",
            "Analysis of nasopharyngeal carcinoma risk factors with Bayesian networks.",
            "Detecting disease genes based on semi-supervised learning and protein-protein interaction networks.",
            "Pattern-based analysis of computer-interpretable guidelines: Don't forget the context.",
            "Visually defining and querying consistent multi-granular clinical temporal abstractions.",
            "Improved modeling of clinical data with kernel methods.",
            "Bayesian tracking of intracranial pressure signal morphology.",
            "A characterization of electrocardiogram signals through optimal allocation of information granularity.",
            "Intelligent quotient estimation of mental retarded people from different psychometric instruments using artificial neural networks.",
            "Translation and localization of SNOMED CT in China: A pilot study.",
            "John McCarthy, 1927-2011.",
            "Developing a drug library for smart pumps in a pediatric intensive care unit.",
            "Predicting the need for CT imaging in children with minor head injury using an ensemble of Naive Bayes classifiers.",
            "Selective voting in convex-hull ensembles improves classification accuracy.",
            "An intelligent classifier for prognosis of cardiac resynchronization therapy based on speckle-tracking echocardiograms.",
            "Segmentation of nerve fibers using multi-level gradient watershed and fuzzy systems.",
            "Differences in examination characteristics of pigmented skin lesions: Results of an eye tracking study.",
            "Automated interviews on clinical case reports to elicit directed acyclic graphs.",
            "Collaboration-based medical knowledge recommendation.",
            "Machine learning for improved pathological staging of prostate cancer: A performance comparison on a range of classifiers.",
            "A classifier ensemble approach for the missing feature problem.",
            "Identifying a small set of marker genes using minimum expected cost of misclassification.",
            "Identifying malignant transformations in recurrent low grade gliomas using high resolution magic angle spinning spectroscopy.",
            "Detecting and resolving inconsistencies between domain experts' different perspectives on (classification) tasks.",
            "A knowledge-based clinical toxicology consultant for diagnosing single exposures.",
            "Pathway-based identification of a smoking associated 6-gene signature predictive of lung cancer risk and survival.",
            "Prediction of human major histocompatibility complex class II binding peptides by continuous kernel discrimination method.",
            "Channel selection and classification of electroencephalogram signals: An artificial neural network and genetic algorithm-based approach.",
            "An automated methodology for levodopa-induced dyskinesia: Assessment based on gyroscope and accelerometer signals.",
            "Inconsistency as a diagnostic tool in a society of intelligent agents.",
            "An implicit approach to deal with periodically repeated medical data.",
            "Acute leukemia classification by ensemble particle swarm model selection.",
            "Natural occurrence of nocturnal hypoglycemia detection using hybrid particle swarm optimized fuzzy reasoning model.",
            "Feasibility of an objective electrophysiological loudness scaling: A kernel-based novelty detection approach.",
            "Screening nonrandomized studies for medical systematic reviews: A comparative study of classifiers.",
            "Prediction of human major histocompatibility complex class II binding peptides: A frequent case of publication bias?",
            "Memetic algorithms for de novo motif-finding in biomedical sequences.",
            "Proactive screening for depression through metaphorical and automatic text analysis.",
            "Predicting warfarin dosage from clinical data: A supervised learning approach.",
            "On mining clinical pathway patterns from medical behaviors.",
            "Evaluation of a clinical decision support algorithm for patient-specific childhood immunization.",
            "Sequential decision tree using the analytic hierarchy process for decision support in rectal cancer.",
            "Computerized analysis of pigmented skin lesions: A review.",
            "Texture feature ranking with relevance learning to classify interstitial lung disease patterns.",
            "Non invasive classification system of scoliosis curve types using least-squares support vector machines.",
            "Case-based reasoning emulation of persons for wheelchair navigation.",
            "Predicting the impact of hospital health information technology adoption on patient satisfaction.",
            "Smart wearable systems: Current status and future challenges.",
            "Automatic generation of natural language nursing shift summaries in neonatal intensive care: BT-Nurse.",
            "Aggregating evidence about the positive and negative effects of treatments.",
            "Bilateral symmetry aspects in computer-aided Alzheimer's disease diagnosis by single-photon emission-computed tomography imaging.",
            "Modeling and solving the dynamic patient admission scheduling problem under uncertainty."
        ]
    },
    {
        "name": "AIM",
        "year": "2011",
        "info": "2011: Volumes\n51,\n52,\n53",
        "count": 57,
        "papers": [
            "An ontology-based comparative anatomy information system.",
            "Exploiting the systematic review protocol for classification of medical abstracts.",
            "Conceptual-driven classification for coding advise in health insurance reimbursement.",
            "Brain-computer interface analysis of a dynamic visuo-motor task.",
            "Evolutionary-driven support vector machines for determining the degree of liver fibrosis in chronic hepatitis C.",
            "A decision support system for Crithidia Luciliae image classification.",
            "Advances in case-based reasoning in the health sciences.",
            "eXiT*CBR: A framework for case-based medical diagnosis development and experimentation.",
            "Classification of melanomas in situ using knowledge discovery with explained case-based reasoning.",
            "A multi-module case-based biofeedback system for stress treatment.",
            "Integrating case-based reasoning with an electronic patient record system.",
            "How to use contextual knowledge in medical case-based reasoning systems: A survey on very recent trends.",
            "Cost-sensitive case-based reasoning using a genetic algorithm: Application to medical diagnosis.",
            "Modeling surgical processes: A four-level translational approach.",
            "Multiple kernel learning in protein-protein interaction extraction from biomedical literature.",
            "Electrocardiogram analysis using a combination of statistical, geometric, and nonlinear heart rate variability features.",
            "Investigating the enhancement of template-free activation detection of event-related fMRI data using wavelet shrinkage and figures of merit.",
            "An automated diagnostic system of polycystic ovary syndrome based on object growing.",
            "A modified artificial immune system based pattern recognition approach - An application to clinical diagnostics.",
            "Computer-aided small bowel tumor detection for capsule endoscopy.",
            "Classification of healthy and abnormal swallows based on accelerometry and nasal airflow signals.",
            "Identification of sympathetic and parasympathetic nerves function in cardiovascular regulation using ANFIS approximation.",
            "Suppressed fuzzy-soft learning vector quantization for MRI segmentation.",
            "A fuzzy-based data transformation for feature extraction to increase classification performance with small medical data sets.",
            "Mario Stefanelli, 1945-2010.",
            "Artificial Intelligence in Medicine AIME 2009.",
            "Conversational case-based reasoning in medical decision making.",
            "Feasibility of case-based beam generation for robotic radiosurgery.",
            "Modern parameterization and explanation techniques in diagnostic decision support system: A case study in diagnostics of coronary artery disease.",
            "Visual pattern mining in histology image collections using bag of features.",
            "Terminological resources for text mining over biomedical scientific literature.",
            "Intelligent dental training simulator with objective skill assessment and feedback.",
            "Instance-based classifiers applied to medical databases: Diagnosis and knowledge extraction.",
            "Resolution of redundant semantic type assignments for organic chemicals in the UMLS.",
            "Classification of infectious diseases based on chemiluminescent signatures of phagocytes in whole blood.",
            "Improving the accuracy of suicide attempter classification.",
            "Prediction of intraoperative complexity from preoperative patient data for laparoscopic cholecystectomy.",
            "Wheelchair collaborative control for disabled users navigating indoors.",
            "Bayesian network approach to detect laboratory errors: Focus on likelihood ratio and critical difference.",
            "A semantic graph-based approach to biomedical summarisation.",
            "Case-based reasoning support for liver disease diagnosis.",
            "Automatic sleep scoring: A search for an optimal combination of measures.",
            "A supervised method to assist the diagnosis and monitor progression of Alzheimer's disease using data from an fMRI experiment.",
            "Hybrid genetic algorithm-neural network: Feature extraction for unpreprocessed microarray data.",
            "Integration of gene signatures using biological knowledge.",
            "A Markov decision process approach to multi-category patient scheduling in a diagnostic facility.",
            "Kernel machines for epilepsy diagnosis via EEG signal classification: A comparative study.",
            "Comparative study of approximate entropy and sample entropy robustness to spikes.",
            "Support vector methods for survival analysis: a comparison between ranking and regression approaches.",
            "Classification of cancer cell death with spectral dimensionality reduction and generalized eigenvalues.",
            "Non-invasive estimate of blood glucose and blood pressure from a photoplethysmograph by means of machine learning techniques.",
            "Patterns for collaborative work in health care teams.",
            "Exploring a corpus-based approach for detecting language impairment in monolingual English-speaking children.",
            "Statistical semantic and clinician confidence analysis for correcting abbreviations and spelling errors in clinical progress notes.",
            "Incorporating expert knowledge when learning Bayesian network structure: A medical case study.",
            "Biomedical events extraction using the hidden vector state model.",
            "Automatic detection of epileptic seizures on the intra-cranial electroencephalogram of rats using reservoir computing."
        ]
    },
    {
        "name": "AIM",
        "year": "2010",
        "info": "2010: Volumes\n48,\n49,\n50",
        "count": 57,
        "papers": [
            "Adopting model checking techniques for clinical guidelines verification.",
            "Semantic SenseLab: Implementing the vision of the Semantic Web in neuroscience.",
            "Secure construction of k-unlinkable patient records from distributed providers.",
            "Coding of amino acids by texture descriptors.",
            "Scalable approach for effective control of gene regulatory networks.",
            "A hybrid tabu search algorithm for automatically assigning patients to beds.",
            "Artificial intelligence in biomedical engineering and informatics: An introduction and review.",
            "A GMM-IG framework for selecting genes as expression panel biomarkers.",
            "An MLP-based feature subset selection for HIV-1 protease cleavage site analysis.",
            "Clustering of high-dimensional gene expression data with feature filtering methods and diffusion maps.",
            "Gene- and evidence-based candidate gene selection for schizophrenia and gene feature analysis.",
            "Hierarchically organized layout for visualization of biochemical pathways.",
            "Method of regulatory network that can explore protein regulations for disease classification.",
            "Mixture classification model based on clinical markers for breast cancer prognosis.",
            "Development of traditional Chinese medicine clinical data warehouse for medical knowledge discovery and decision support.",
            "A new multiple regression approach for the construction of genetic regulatory networks.",
            "Analysis of adverse drug reactions using drug and drug target interactions and graph-based methods.",
            "Fuzzy Arden Syntax: A fuzzy programming language for medicine.",
            "Intelligent visualization and exploration of time-oriented data of multiple patients.",
            "A machine learning-based approach to prognostic analysis of thoracic transplantations.",
            "Combining image, voice, and the patient's questionnaire data to categorize laryngeal disorders.",
            "Classification of functional voice disorders based on phonovibrograms.",
            "Modified tabu search approach for variable selection in quantitative structure-activity relationship studies of toxicity of aromatic compounds.",
            "A knowledge-driven approach to biomedical document conceptualization.",
            "Classification integration and reclassification using constraint databases.",
            "Improving Bayesian credibility intervals for classifier error rates using maximum entropy empirical priors.",
            "Exploring the knowledge contained in neuroimages: Statistical discriminant analysis and automatic segmentation of the most significant changes.",
            "Local binary patterns variants as texture descriptors for medical image analysis.",
            "PMirP: A pre-microRNA prediction method based on structure-sequence hybrid features.",
            "Data mining for the study of disease genes and proteins.",
            "Figure classification in biomedical literature to elucidate disease mechanisms, based on pathways.",
            "Multi-way association extraction and visualization from biological text documents using hyper-graphs: Applications to genetic association studies for diseases.",
            "Document classification for mining host pathogen protein-protein interactions.",
            "Identifying regulatory relationships among genomic loci, biological pathways, and disease.",
            "Predicting malaria interactome classifications from time-course transcriptomic data along the intraerythrocytic developmental cycle.",
            "Functional proteomic pattern identification under low dose ionizing radiation.",
            "Machine learning of clinical performance in a pancreatic cancer database.",
            "Knowledge discovery and computer-based decision support in biomedicine.",
            "A segmentation framework for abdominal organs from CT scans.",
            "Fusing visual and clinical information for lung tissue classification in high-resolution computed tomography.",
            "A computer-aided detection system for clustered microcalcifications.",
            "Fusion of fuzzy statistical distributions for classification of thyroid ultrasound patterns.",
            "Computer-aided diagnosis of pulmonary nodules using a two-step approach for feature selection and classifier ensemble construction.",
            "Human movement onset detection from isometric force and torque measurements: A supervised pattern recognition approach.",
            "Semantic relations for problem-oriented medical records.",
            "Detecting 'wrong blood in tube' errors: Evaluation of a Bayesian network approach.",
            "Automatic image-based assessment of lesion development during hemangioma follow-up examinations.",
            "Decision support in heart failure through processing of electro- and echocardiograms.",
            "Missing data imputation using statistical and machine learning methods in a real breast cancer problem.",
            "Evolving fuzzy medical diagnosis of Pima Indians diabetes and of dermatological diseases.",
            "Quantitative prediction of MHC-II binding affinity using particle swarm optimization.",
            "A four stage approach for ontology-based health information system design.",
            "A decision support system for cost-effective diagnosis.",
            "Modeling and optimization of combined cytostatic and cytotoxic cancer chemotherapy.",
            "An evaluation of heuristics for rule ranking.",
            "Multi-step dimensionality reduction and semi-supervised graph-based tumor classification using gene expression data.",
            "Multi-marker tagging single nucleotide polymorphism selection using estimation of distribution algorithms."
        ]
    },
    {
        "name": "AIM",
        "year": "2009",
        "info": "2009: Volumes\n45,\n46,\n47",
        "count": 59,
        "papers": [
            "Classification tree modeling to identify severe and moderate vehicular injuries in young and middle-aged adults.",
            "Matching incomplete time series with dynamic time warping: an algorithm and an application to post-stroke rehabilitation.",
            "A hybrid hierarchical decision support system for cardiac surgical intensive care patients. Part I: Physiological modelling and decision support system design.",
            "A hybrid hierarchical decision support system for cardiac surgical intensive care patients. Part II. Clinical implementation and evaluation.",
            "Predicting the probability of survival in intensive care unit patients from a small number of variables and training examples.",
            "Efficient discovery of risk patterns in medical data.",
            "Computational intelligence and machine learning in bioinformatics.",
            "Formulating and testing hypotheses in functional genomics.",
            "Virtual genetic coding and time series analysis for alternative splicing prediction in C. elegans.",
            "Detecting conserved coding genomic regions through signal processing of nucleotide substitution patterns.",
            "Modeling adaptive kernels from probabilistic phylogenetic trees.",
            "Fully non-homogeneous hidden Markov model double net: A generative model for haplotype reconstruction and block discovery.",
            "Dataset complexity in gene expression based cancer classification using ensembles of k-nearest neighbors.",
            "Evaluating switching neural networks through artificial and real gene expression data.",
            "Fuzzy ensemble clustering based on random projections for DNA microarray data analysis.",
            "Liver segmentation from computed tomography scans: A survey and a new algorithm.",
            "Computational proteomics analysis of binding mechanisms and molecular signatures of the HIV-1 protease drugs.",
            "Adaptive bandwidth selection for biomarker discovery in mass spectrometry.",
            "Cancer informatics by prototype networks in mass spectrometry.",
            "A graph theoretic approach to protein structure selection.",
            "Artificial intelligence in medicine AIME'07.",
            "The coming of age of artificial intelligence in medicine.",
            "Using model checking for critiquing based on clinical guidelines.",
            "Temporal similarity measures for querying clinical workflows.",
            "Versioning computer-interpretable guidelines: Semi-automatic modeling of 'Living Guidelines' using an information extraction method.",
            "Adaptive resource allocation for efficient patient scheduling.",
            "Agentification of Markov model-based segmentation: Application to magnetic resonance brain scans.",
            "Using WordNet synonym substitution to enhance UMLS source integration.",
            "Situated cognition in clinical visualization: The role of transparency in GammaKnife neurosurgery planning.",
            "A decision aid for intensity-modulated radiation-therapy plan selection in prostate cancer based on a prognostic Bayesian network and a Markov model.",
            "Association of genetic profiles to Crohn's disease by linear combinations of single nucleotide polymorphisms.",
            "An application of methods for the probabilistic three-class classification of pregnancies of unknown location.",
            "An integrated scheme for feature selection and parameter setting in the support vector machine modeling and its application to the prediction of pharmacokinetic properties of drugs.",
            "Noise-tolerant electrocardiogram beat classification based on higher order statistics of subband components.",
            "Model of experts for decision support in the diagnosis of leukemia patients.",
            "Prediction of periventricular leukomalacia. Part I: Selection of hemodynamic features using logistic regression and decision tree algorithms.",
            "Prediction of periventricular leukomalacia. Part II: Selection of hemodynamic features using computational intelligence.",
            "Posterior probability profiles for the automated assessment of the recovery of patients with stroke from activity of daily living tasks.",
            "Modelling treatment effects in a clinical Bayesian network using Boolean threshold functions.",
            "A model-free ensemble method for class prediction with application to biomedical decision making.",
            "Design patterns for clinical guidelines.",
            "An interpretable fuzzy rule-based classification methodology for medical diagnosis.",
            "Intuitionistic fuzzy set vs. fuzzy set application in medical pattern recognition.",
            "An intelligent model for liver disease diagnosis.",
            "A comparison of three computational modelling methods for the prediction of virological response to combination HIV therapy.",
            "Morphometric analysis of brain images with reduced number of statistical tests: A study on the gender-related differentiation of the corpus callosum.",
            "An ontology-based approach to enhance querying capabilities of general practice medicine for better management of hypertension.",
            "Exploring ant-based algorithms for gene expression data analysis.",
            "Application of constrained independent component analysis algorithms in electrocardiogram arrhythmias.",
            "Combining clinical assessment scores and in vivo MR spectroscopy neurometabolites in very low birth weight adolescents.",
            "Differential automatic diagnosis between Alzheimer's disease and frontotemporal dementia based on perfusion SPECT images.",
            "Markov decision process applied to the control of hospital elective admissions.",
            "Prediction of organ failure in critical care.",
            "Effect of a limited-enforcement intelligent tutoring system in dermatopathology on student errors, goals and solution paths.",
            "Impact of censoring on learning Bayesian networks in survival modelling.",
            "Addressing the flaws of current critical alarms: a fuzzy constraint satisfaction approach.",
            "Adapted variable precision rough set approach for EEG analysis.",
            "Entropy and complexity measures for EEG signal classification of schizophrenic and control participants.",
            "An electromechanical based deformable model for soft tissue simulation."
        ]
    },
    {
        "name": "AIM",
        "year": "2008",
        "info": "2008: Volumes\n42, 43, 44",
        "count": 58,
        "papers": [
            "An automated cervical pre-cancerous diagnostic system.",
            "A de-identifier for medical discharge summaries.",
            "Application of irregular and unbalanced data to predict diabetic nephropathy using visualization and feature selection methods.",
            "Overnight features of transcutaneous carbon dioxide measurement as predictors of metabolic status.",
            "Novel network architecture and learning algorithm for the classification of mass abnormalities in digitized mammograms.",
            "An integrated algorithm for gene selection and classification applied to microarray data of ovarian cancer.",
            "Wearable computing and artificial intelligence for healthcare applications.",
            "Wearable electromyography measurement system using cable-free network system on conductive fabric.",
            "Home monitoring using wearable radio frequency transmitters.",
            "Recognition of dietary activity events using on-body sensors.",
            "MEDIC: Medical embedded device for individualized care.",
            "MOPET: A context-aware and user-adaptive wearable system for fitness training.",
            "An integrated framework for risk profiling of breast cancer patients following surgery.",
            "Dynamic decision support graph - Visualization of ANN-generated diagnostic indications of pathological conditions developing over time.",
            "Supporting diagnosis of attention-deficit hyperactive disorder with novelty detection.",
            "Nutri-Educ, a nutrition software application for balancing meals, using fuzzy arithmetic and heuristic search algorithms.",
            "Latent tree models and diagnosis in traditional Chinese medicine.",
            "A decision support system to facilitate management of patients with acute gastrointestinal bleeding.",
            "Autonomous virtual mobile robot for three-dimensional medical image exploration: Application to micro-CT cochlear images.",
            "Evaluation of an architecture for intelligent query and exploration of time-oriented clinical data.",
            "Pre-operative ordering of minimally invasive surgical tools: A fuzzy inference system approach.",
            "Discovery and integration of univariate patterns from daily individual organ-failure scores for intensive care mortality prediction.",
            "Supervised pattern recognition for the prediction of contrast-enhancement appearance in brain tumors from multivariate magnetic resonance imaging and spectroscopy.",
            "Assessment of classification improvement in patients with Alzheimer's disease based on magnetoencephalogram blind source separation.",
            "A reliable method for cell phenotype image classification.",
            "Identification of gene transcript signatures predictive for estrogen receptor and lymph node status using a stepwise forward selection artificial neural network modelling approach.",
            "A 2D approach to tomographic image reconstruction using a Hopfield-type neural network.",
            "Neuro-genetic non-invasive temperature estimation: Intensity and spatial prediction.",
            "Ensemble adaptive network-based fuzzy inference system with weighted arithmetical mean and application to diagnosis of optic nerve disease from visual-evoked potential signals.",
            "Complexity and spectral analysis of the heart rate variability dynamics for distant prediction of paroxysmal atrial fibrillation with artificial intelligence methods.",
            "Case-based estimation of the risk of enterobiasis.",
            "Rating organ failure via adverse events using data mining in the intensive care unit.",
            "Medical data mining by fuzzy modeling with selected features.",
            "Ovarian cancer diagnosis with complementary learning fuzzy neural network.",
            "Enhancing obstetric and gynecology ultrasound images by adaptation of the speckle reducing anisotropic diffusion filter.",
            "Identification of the optic nerve head with genetic algorithms.",
            "On alpha-divergence based nonnegative matrix factorization for clustering cancer gene expression data.",
            "CARSVM: A class association rule-based classification framework and its application to gene expression data.",
            "Evaluation of TELEDERM for dermatological services in rural and remote areas.",
            "Identification of the phase code in an EEG during gripping-force tasks: A possible alternative approach to the development of the brain-computer interfaces.",
            "Support vector machine-based arrhythmia classification using reduced features of heart rate variability signal.",
            "Application of complex discrete wavelet transform in classification of Doppler signals using complex-valued artificial neural network.",
            "Vincenzo Tagliasco.",
            "Artificial consciousness: Theoretical and practical issues.",
            "First, scale up to the robotic Turing test, then worry about feeling.",
            "Axioms, properties and criteria: Roles for synthesis in the science of consciousness.",
            "Artificial consciousness: A discipline between technological and theoretical obstacles.",
            "Philosophical foundations of artificial consciousness.",
            "Artificial consciousness: Hazardous questions (and answers).",
            "A cognitive architecture for robot self-consciousness.",
            "Drinking from the firehose of experience.",
            "Intelligent decision support systems for mechanical ventilation.",
            "Visual MRI: Merging information visualization and non-parametric clustering techniques for MRI dataset analysis.",
            "Model-based analysis of myocardial strain data acquired by tissue Doppler imaging.",
            "Using support vector regression to model the correlation between the clinical metastases time and gene expression profile for breast cancer.",
            "Artificial neural network-based equation for estimating VO2max from the 20 m shuttle run test in adolescents.",
            "Fusion of classic P300 detection methods' inferences in a framework of fuzzy labels.",
            "Discrimination ability of individual measures used in sleep stages classification."
        ]
    },
    {
        "name": "AIM",
        "year": "2007",
        "info": "2007: Volumes\n39, 40, 41",
        "count": 56,
        "papers": [
            "Temporal abstraction in intelligent clinical data analysis: A survey.",
            "Learning recurrent behaviors from heterogeneous multivariate time-series.",
            "Side chain placement using estimation of distribution algorithms.",
            "Advanced fuzzy cellular neural network: Application to CT liver images.",
            "Dynamic knowledge validation and verification for CBR teledermatology system.",
            "Artificial Intelligence in Medicine AIME '05.",
            "Automated detection of qualitative spatio-temporal features in electrocardiac activation maps.",
            "Extending temporal databases to deal with telic/atelic medical data.",
            "Mining of relations between proteins over biomedical scientific literature using a deep-linguistic approach.",
            "Extraction and use of linguistic patterns for modelling medical guidelines.",
            "How can information extraction ease formalizing treatment processes in clinical practice guidelines?: A method and its evaluation.",
            "Anatomical sketch understanding: Recognizing explicit and implicit structure.",
            "Ontological foundations for biomedical sciences.",
            "Investigating subsumption in SNOMED CT: An exploration into large description logic-based biomedical terminologies.",
            "Logical properties of foundational relations in bio-ontologies.",
            "Using semantic dependencies for consistency management of an ontology of brain-cortex anatomy.",
            "Comparing two approaches for aligning representations of anatomy.",
            "Towards the ontological foundations of symbolic biological theories.",
            "Auditory brainstem response classification: A hybrid model using time and frequency features.",
            "AutoNRTTM: An automated system that measures ECAP thresholds with the Nucleus® FreedomTM cochlear implant via machine intelligence.",
            "Selection of relevant genes in cancer diagnosis based on their prediction accuracy.",
            "Predicting carcinoid heart disease with the noisy-threshold classifier.",
            "A stochastic model of susceptibility to antibiotic therapy - The effects of cross-resistance and treatment history.",
            "Automated segmentation and quantification of inflammatory tissue of the hand in rheumatoid arthritis patients using magnetic resonance imaging data.",
            "A combined MRI and MRSI based multiclass system for brain tumour recognition using LS-SVMs with class probabilities and feature selection.",
            "Automated assessment of myocardial SPECT perfusion scintigraphy: A comparison of different approaches of case-based reasoning.",
            "Towards an intelligent medical system for the aesthetic evaluation of breast cancer conservative treatment.",
            "The IFAST model, a novel parallel nonlinear EEG analysis technique, distinguishes mild cognitive impairment and Alzheimer's disease patients with high degree of accuracy.",
            "Complex-valued wavelet artificial neural network for Doppler signals classifying.",
            "Development and comparison of four sleep spindle detection methods.",
            "Selecting treatment strategies with dynamic limited-memory influence diagrams.",
            "A methodology for the automated creation of fuzzy expert systems for ischaemic and arrhythmic beat classification based on a set of rules obtained by a decision tree.",
            "An fMRI framework for identifying statistical differences in blood oxygenated level dependent response levels: A brain injury demonstration.",
            "The use of artificial neural networks to stratify the length of stay of cardiac patients based on preoperative and initial postoperative factors.",
            "A computational model to protect patient data from location-based re-identification.",
            "Temporal abstraction for feature extraction: A comparative case study in prediction from intensive care monitoring data.",
            "Improving diagnostic ability of blood oxygen saturation from overnight pulse oximetry in obstructive sleep apnea detection by means of central tendency measure.",
            "Differential diagnosis of CT focal liver lesions using texture features, feature selection and ensemble driven classifiers.",
            "Multi-scaled morphological features for the characterization of mammographic masses using statistical classification schemes.",
            "Extension of mixture-of-experts networks for binary classification of hierarchical data.",
            "The fuzzy polynucleotide space revisited.",
            "Comments on \"The fuzzy polynucleotide space revisited\" by Kazem Sadegh-Zadeh.",
            "Integrative data mining in systems biology: from text to network mining.",
            "Integrative mining of traditional Chinese medicine literature and MEDLINE for functional gene networks.",
            "Gene Ontology analysis in multiple gene clusters under multiple hypothesis testing framework.",
            "Bridge and brick network motifs: Identifying significant building blocks from complex biological systems.",
            "A multi-layered approach to protein data integration for diabetes research.",
            "Robust effects of Tsr-CheBp and CheA-CheYp affinity in bacterial chemotaxis.",
            "A multi-approaches-guided genetic algorithm with application to operon prediction.",
            "A multiple kernel support vector machine scheme for feature selection and rule extraction from gene expression data of cancer tissue.",
            "Evaluation of rule interestingness measures in medical knowledge discovery in databases.",
            "Ensemble methods for classification of patients for personalized medicine with high-dimensional data.",
            "Semi-supervised learning of the hidden vector state model for extracting protein-protein interactions.",
            "On macroeconomic characteristics of pharmaceutical generics and the potential for manufacturing and consumption under fuzzy conditions.",
            "Multiscale analysis of short term heart beat interval, arterial blood pressure, and instantaneous lung volume time series.",
            "Feature selection and classification model construction on type 2 diabetic patients' data."
        ]
    },
    {
        "name": "AIM",
        "year": "2006",
        "info": "2006: Volumes\n36, 37, 38",
        "count": 55,
        "papers": [
            "A formal theory for spatial representation and reasoning in biomedical ontologies.",
            "Automatic identification of confusable drug names.",
            "The classification of cancer based on DNA microarray data that uses diverse ensemble genetic programming.",
            "Advanced soft computing diagnosis method for tumour grading.",
            "Towards a computer-aided diagnosis system for vocal cord diseases.",
            "An intelligent tutoring system for visual classification problem solving.",
            "A patient's perspective on medical records.",
            "Case-based reasoning in the health sciences.",
            "Case-based reasoning in the health sciences: What's next?",
            "Case-based object recognition for airborne fungi recognition.",
            "Clinical decision-support for diagnosing stress-related disorders by applying psychophysiological medical knowledge to an instance-based learning system.",
            "Mémoire: A framework for semantic interoperability of case-based reasoning systems in biology and medicine.",
            "Improving medical protocols by formal methods.",
            "Machine recognition and representation of neonatal facial displays of acute pain.",
            "Mortality assessment in intensive care units via adverse events using artificial neural networks.",
            "Integrating regression formulas and kernel functions into locally adaptive knowledge-based neural networks: A case study on renal function evaluation.",
            "Neural networks for longitudinal studies in Alzheimer's disease.",
            "An incremental EM-based learning approach for on-line prediction of hospital resource utilization.",
            "Intelligent data analysis in medicine - Recent advances.",
            "Learning from imbalanced data in surveillance of nosocomial infection.",
            "Semi-automatic learning of simple diagnostic scores utilizing complexity measures.",
            "Case-based retrieval to support the treatment of end stage renal failure patients.",
            "Knowledge-discovery incorporated evolutionary search for microcalcification detection in breast cancer diagnosis.",
            "A novel method for automated EMG decomposition and MUAP classification.",
            "Statistical analysis of combined dose effects for experiments with two agents.",
            "A cognitive blueprint of collaboration in context: Distributed cognition in the psychiatric emergency department.",
            "Randomized maps for assessing the reliability of patients clusters in DNA microarray data analyses.",
            "Oxygen saturation regularity analysis in the diagnosis of obstructive sleep apnea.",
            "Artificial neural network for the joint modelling of discrete cause-specific hazards.",
            "On the analysis of single versus multiple channels of electromagnetic brain signals.",
            "Mammographic masses characterization based on localized texture and dataset fractal analysis using linear, neural and support vector machine classifiers.",
            "Knowledge-based data analysis and interpretation.",
            "Using ontologies linked with geometric models to reason about penetrating injuries.",
            "Multiple hierarchical classification of free-text clinical guidelines.",
            "Constructing explanatory process models from biological data and knowledge.",
            "CareVis: Integrated visualization of computerized protocols and temporal patient data.",
            "Intelligent medical training systems.",
            "A Bayesian approach to generating tutorial hints in a collaborative medical problem-based learning system.",
            "An intelligent tutoring system that generates a natural language dialogue using dynamic multi-level planning.",
            "Challenges of biological realism and validation in simulation-based medical education.",
            "Web-based adaptive training simulator system for cardiac life support.",
            "Implementing tutoring strategies into a patient simulator for clinical reasoning learning.",
            "Temporal representation and reasoning in medicine.",
            "Temporal representation and reasoning in medicine: Research directions and challenges.",
            "Distributed, intelligent, interactive visualization and exploration of time-oriented clinical data and their abstractions.",
            "Extending the event calculus for tracking epidemic spread.",
            "Spatiotemporal reasoning about epidemiological data.",
            "Towards a comprehensive treatment of repetitions, periodicity and temporal constraints in clinical guidelines.",
            "Fuzzy theory approach for temporal model-based diagnosis: An application to medical domains.",
            "Knowledge discovery in traditional Chinese medicine: State of the art and perspectives.",
            "From vagueness in medical thought to the foundations of fuzzy reasoning in medical diagnosis.",
            "A closed-loop hybrid physiological model relating to subjects under physical stress.",
            "Using classification trees to assess low birth weight outcomes.",
            "Cell-nuclear data reduction and prognostic model selection in bladder tumor recurrence.",
            "Comparison between neural networks and multiple logistic regression to predict acute coronary syndrome in the emergency room."
        ]
    },
    {
        "name": "AIM",
        "year": "2005",
        "info": "2005: Volumes\n33, 34, 35",
        "count": 58,
        "papers": [
            "Temporal reasoning for decision support in medicine.",
            "Do physicians value decision support? A look at the effect of decision support systems on physician opinion.",
            "Classifying free-text triage chief complaints into syndromic categories with natural language processing.",
            "A lexical metaschema for the UMLS semantic network.",
            "GenSo-FDSS: a neural-fuzzy decision support system for pediatric ALL cancer subtype identification using gene expression data.",
            "An adaptive window width/center adjustment system with online training capabilities for MR images.",
            "Information extraction and summarization from medical documents.",
            "Automatic processing of multilingual medical terminology: applications to thesaurus enrichment and cross-language information retrieval.",
            "Bio-medical entity extraction using support vector machines.",
            "Comparative experiments on learning information extractors for proteins and their interactions.",
            "Summarization from medical documents: a survey.",
            "Customization in a unified framework for summarizing medical literature.",
            "A reliable probabilistic sleep stager based on a single EEG signal.",
            "A method for detection of Alzheimer's disease using ICA-enhanced EEG measurements.",
            "Applying instance-based techniques to prediction of final outcome in acute stroke.",
            "An arrhythmia classification system based on the RR-interval signal.",
            "A classifier based on the artificial neural network approach for cardiologic auscultation in pediatrics.",
            "Applying spatial distribution analysis techniques to classification of 3D medical images.",
            "Artificial Intelligence in Medicine in Europe AIME'03.",
            "A framework for distributed mediation of temporal-abstraction queries to clinical databases.",
            "Temporal data mining for the quality assessment of hemodialysis services.",
            "Generalised reliability characteristics for probabilistic networks.",
            "Decision support of inspired oxygen selection based on Bayesian learning of pulmonary gas exchange parameters.",
            "A new method for sleep apnea classification using wavelets and feedforward neural networks.",
            "Constraint reasoning in deep biomedical models.",
            "Merging multimedia presentations and semistructured temporal data: a graph-based model and its application to clinical information.",
            "Predicting breast cancer survivability: a comparison of three data mining methods.",
            "The UK MARIBS Breast Screening Study: Evaluation of radiological features for breast tumour classification in clinical screening with machine learning methods.",
            "Characterization of clustered microcalcifications in digitized mammograms using neural networks and support vector machines.",
            "Neural network predictions of significant coronary artery stenosis in men.",
            "A spatio-temporal Bayesian network classifier for understanding visual field deterioration.",
            "Part-whole representation and reasoning in formal biomedical ontologies.",
            "Description logic-based methods for auditing frame-based medical terminological systems.",
            "An expert study evaluating the UMLS lexical metaschema.",
            "Logical analysis of diffuse large B-cell lymphomas.",
            "Factors affecting automated syndromic surveillance.",
            "An optimized experimental protocol based on neuro-evolutionary algorithms: Application to the classification of dyspeptic patients and to the prediction of the effectiveness of their treatment.",
            "Computational intelligence in solving bioinformatics problems.",
            "Finding the biologically optimal alignment of multiple sequences.",
            "Highly accurate and consistent method for prediction of helix and strand content from primary protein sequences.",
            "Discovering reliable protein interactions from high-throughput experimental data using network topology.",
            "SiMCAL 1 algorithm for analysis of gene expression data related to the phosphatidylserine receptor.",
            "Efficient RNAi-based gene family knockdown via set cover optimization.",
            "A model of motor control of the nematode C. elegans with neuronal circuits.",
            "Fuzzy attributes of a DNA complex: Development of a fuzzy inference engine for codon-\"junk\" codon delineation.",
            "Computational modeling of oligonucleotide positional densities for human promoter prediction.",
            "Granular support vector machines with association rules mining for protein homology prediction.",
            "Application of tabu search strategy for finding low energy structure of protein.",
            "Prediction of MHC class II binders using the ant colony search strategy.",
            "A landmark extraction method for protein 2DE gel images based on multi-dimensional clustering.",
            "Knowledge-assisted recognition of cluster boundaries in gene expression data.",
            "Gene extraction for cancer diagnosis by support vector machines - An improvement.",
            "Modelling and multivariable control in anaesthesia using neural-fuzzy paradigms: Part I. Classification of depth of anaesthesia and development of a patient model.",
            "Modelling and multivariable control in anaesthesia using neural-fuzzy paradigms: Part II. Closed-loop control of simultaneous administration of propofol and remifentanil.",
            "Identification of signatures in biomedical spectra using domain knowledge.",
            "Genetic algorithm for analysis of mutations in Parkinson's disease.",
            "Using cognitive task analysis to facilitate the integration of decision support systems into the neonatal intensive care unit.",
            "Clinical benchmarking for the validation of AI medical diagnostic classifiers."
        ]
    },
    {
        "name": "AIM",
        "year": "2004",
        "info": "2004: Volumes\n30, 31, 32",
        "count": 52,
        "papers": [
            "Knowledge acquisition in the fuzzy knowledge representation framework of a medical consultation system.",
            "A constrained-syntax genetic programming system for discovering classification rules: application to medical data sets.",
            "WeAidU - a decision support system for myocardial perfusion images using artificial neural networks.",
            "Prediction of postoperative morbidity after lung resection using an artificial neural network ensemble.",
            "Use of genetic algorithms for neural networks to predict community-acquired pneumonia.",
            "Artificial intelligence in neuroimaging: four challenges to improve interpretation of brain images.",
            "Structural shape characterization via exploratory factor analysis.",
            "Cerebral modeling and dynamic Bayesian networks.",
            "Finding related functional neuroimaging volumes.",
            "Automated segmentation of human brain MR images using a multi-agent approach.",
            "Coordinate-based versus structural approaches to brain image analysis.",
            "Erratum to \"Transductive reliability estimation for medical diagnosis\" [Artif. Intell. Med. 29: 81-106(2003)].",
            "Bayesian networks in biomedicine and health-care.",
            "A comparison of learning algorithms for Bayesian networks: a case study based on data from an emergency medical service.",
            "Understanding tuberculosis epidemiology using structured statistical models.",
            "Using literature and data to learn Bayesian networks as clinical models of ovarian tumors.",
            "Latent variable discovery in classification models.",
            "Bayesian fluorescence in situ hybridisation signal classification.",
            "Approaches for creating computer-interpretable guidelines that facilitate decision support.",
            "Auditing concept categorizations in the UMLS.",
            "Prediction of diagnosis in patients with early arthritis using a combined Kohonen mapping and instance-based evaluation criterion.",
            "A quantitative comparison of functional MRI cluster analysis.",
            "Brain tumor classification based on long echo proton MRS signals.",
            "Filter versus wrapper gene selection approaches in DNA microarray domains.",
            "Structural proteomics of the poxvirus family.",
            "Bayesian network multi-classifiers for protein secondary structure prediction.",
            "Data mining of gene expression changes in Alzheimer brain.",
            "Multivariate selection of genetic markers in diagnostic classification.",
            "An evaluation of a system that recommends microarray experiments to perform to discover gene-regulation pathways.",
            "Data mining and genetic algorithm based gene/SNP selection.",
            "Foetal ECG recovery using dynamic neural networks.",
            "Comparison of neural network predictors in the classification of tracheal-bronchial breath sounds by respiratory auscultation.",
            "Automatic analysis of auditory nerve electrically evoked compound action potential with an artificial neural network.",
            "Diagnosis of gastric carcinoma by classification on feature projections.",
            "Selection of patients for clinical trials: an interactive web-based system.",
            "Artificial intelligence in medicine in China.",
            "Knowledge modeling and acquisition of traditional Chinese herbal drugs and formulae from text.",
            "Ontology development for unified traditional Chinese medical language system.",
            "Local fuzzy fractal dimension and its application in medical image processing.",
            "A novel kernelized fuzzy C-means algorithm with application in medical image segmentation.",
            "An efficient and scalable deformable model for virtual reality-based medical applications.",
            "Data mining techniques for cancer detection using serum proteomic profiling.",
            "Finding optimal decision scores by evolutionary strategies.",
            "Measuring performance in health care: case-mix adjustment by boosted decision trees.",
            "Genetic design of feature spaces for pattern classifiers.",
            "Detecting acute myocardial infarction in the 12-lead ECG using Hermite expansions and neural networks.",
            "Medical privacy protection based on granular computing.",
            "Adaptive systems and hybrid computational intelligence in medicine.",
            "Adaptive ventilator FiO2 advisor: use of non-invasive estimations of shunt.",
            "Evaluation of glucose controllers in virtual environment: methodology and sample application.",
            "Prediction of visual perceptions with artificial neural networks in a visual prosthesis for the blind.",
            "Evolving rule-based systems in two medical domains using genetic programming."
        ]
    },
    {
        "name": "AIM",
        "year": "2003",
        "info": "2003: Volumes\n27, 28, 29",
        "count": 53,
        "papers": [
            "Evaluation of inherent performance of intelligent medical decision support systems: utilising neural networks as an example.",
            "A multiple classifier system for early melanoma diagnosis.",
            "A combined neural network and decision trees model for prognosis of breast cancer relapse.",
            "Bagging tree classifiers for laser scanning images: a data- and simulation-based strategy.",
            "Midpoints for fuzzy sets and their application in medicine.",
            "Safe and Sound: Artificial Intelligence in Hazardous Applications - John Fox, Subrata Das, AAAI Press, Menlo Park, CA, and MIT Press, Cambridge, MA/London, UK, 2000, 326 pp., References, Index, Illus., ISBN 0-262-06211-9.",
            "Self-organizing map for cluster analysis of a breast cancer database.",
            "Evolutionary computing for knowledge discovery in medical diagnosis.",
            "Building a case-based diet recommendation system without a knowledge engineer.",
            "Decision support tools for clinical trial design.",
            "Characterization of medical time series using fuzzy similarity-based fractal dimensions.",
            "Clinical Applications of Artificial Neural Networks: Richard Dybowski, Vanya Gant (Eds.), Cambridge University Press, Cambridge, UK, New York, Oakleigh, Madrid, Cape Town, 2001, 378 pp., 55 figures, 25 tables, Hardcover, ISBN 0521662710.",
            "Erratum to \"Data mining a diabetic data warehouse\" [Artif. Intell. Med. 2002;26: 37-54].",
            "Software agents in health care.",
            "Formalizing an electronic institution for the distribution of human tissues.",
            "A multi-agent system approach for monitoring the prescription of restricted use antibiotics.",
            "Component-based mediation services for the integration of medical applications.",
            "Anthropic agency: a multiagent system for physiological processes.",
            "A multi-agent intelligent environment for medical knowledge.",
            "Automated monitoring of medical protocols: a secure and distributed architecture.",
            "Workflow Management - Models, Methods and Systems: Wil van der Aalst, Kees van Hee, MIT Press, Cambridge, MA/London, England, 2002.",
            "A Bayesian neural network approach for modelling censored data with an application to prognosis after surgery for breast cancer.",
            "Active subgroup mining: a case study in coronary heart disease risk group detection.",
            "Analyzing tumor gene expression profiles.",
            "An Epicurean learning approach to gene-expression data classification.",
            "Extracting multisource brain activity from a single electromagnetic channel.",
            "Linking clinical data using XML topic maps.",
            "Knowledge-based neurocomputing in medicine.",
            "Inductive bias strength in knowledge-based neural networks: application to magnetic resonance spectroscopy of breast tissues.",
            "A model for single and multiple knowledge based networks.",
            "Evolving connectionist systems for knowledge discovery from gene expression data of cancer tissue.",
            "Explaining the output of ensembles in medical decision support on a case by case basis.",
            "Knowledge-based approach to septic shock patient data using a neural network with trapezoidal activation functions.",
            "Temporal abstraction and inductive logic programming for arrhythmia recognition from electrocardiograms.",
            "Urinary nucleosides as potential tumor markers evaluated by learning vector quantization.",
            "Preoperative prediction of malignancy of ovarian tumors using least squares support vector machines.",
            "Brain volumes characterisation using hierarchical neural networks.",
            "Comparison of tree-based methods for prognostic stratification of survival data.",
            "Artificial Intelligence in Medicine Europe AIME '01.",
            "Integrating classification trees with local logistic regression in Intensive Care prognosis.",
            "Comprehensible evaluation of prognostic factors and prediction of wound healing.",
            "Bayesian applications of belief networks and multilayer perceptrons for ovarian tumor classification with rejection.",
            "Reliable diagnoses of dementia by the naive credal classifier inferred from incomplete cognitive data.",
            "Transductive reliability estimation for medical diagnosis.",
            "GenePath: a system for inference of genetic networks and proposal of genetic experiments.",
            "Integrating model-based decision support in a multi-modal reasoning system for managing type 1 diabetic patients.",
            "Using OncoDoc as a computer-based eligibility screening system to improve accrual onto breast cancer clinical trials.",
            "Using lexical disambiguation and named-entity recognition to improve spelling correction in the electronic patient record.",
            "Rule-base derivation for intensive care ventilator control using ANFIS.",
            "Fuzzy cluster analysis of high-field functional MRI data.",
            "The application of fuzzy-based methods to central nerve fiber imaging.",
            "Fuzzy epidemics.",
            "A fuzzy cognitive map approach to differential diagnosis of specific language impairment."
        ]
    },
    {
        "name": "AIM",
        "year": "2002",
        "info": "2002: Volumes\n24, 25, 26",
        "count": 54,
        "papers": [
            "Artificial-intelligence-augmented systems (Editorial).",
            "Predicting glaucomatous visual field deterioration through short multivariate time series modelling.",
            "Lung cancer cell identification based on artificial neural network ensembles.",
            "Artificial neural network assessment of substitutive pharmacological treatments in hospitalised intravenous drug users.",
            "The problem of bias in training data in regression problems in medical decision support.",
            "Empirical evaluation of a hybrid intelligent monitoring system using different measures of effectiveness.",
            "Knowledge Engineering and Management: The CommonKADS Methodology - G. Schreiber, H. Akkermans, A. Anjewierden, R. de Hoog, N. Shadbolt, W. van de Velde, B. Wielinga, The MIT Press, Cambridge, MA, 2000, ISBN: 0-262-19300-0.",
            "An interactive framework for an analysis of ECG signals.",
            "Fuzzy detection of EEG alpha without amplitude thresholding.",
            "Automatic detection of distorted plethysmogram pulses in neonates and paediatric patients using an adaptive-network-based fuzzy inference system.",
            "An ischemia detection method based on artificial neural networks.",
            "Bounded-depth threshold circuits for computer-assisted CT image classification.",
            "The Spoken Language Translator - M. Rayner, D. Carter, P. Bouillon, V. Digalakis, M. Wirn (Eds.), Studies in Natural Language Processing Series, Cambridge University Press, Cambridge, UK, 2000, ISBN 0521770777.",
            "Lessons learnt from bringing knowledge-based decision support into routine use.",
            "HepatoConsult: a knowledge-based second opinion and documentation system.",
            "Development and evaluation of VIE-PNN, a knowledge-based system for calculating the parenteral nutrition of newborn infants.",
            "Efficiency and safety of chemotherapy plans for children: CATIPOa nationwide approach.",
            "Integrated decision support in a hospital cancer registry.",
            "Abduction, Reason and Science: Processes of Discovery and Explanation - Lorenzo Magnani (Ed.), Kluwer Academic/Plenum Publishers, New York, 2001, ISBN 0-306-46514-0.",
            "Exploratory data analysis in functional neuroimaging.",
            "A novel, direct spatio-temporal approach for analyzing fMRI experiments.",
            "Node merging in Kohonen's self-organizing mapping of fMRI data.",
            "Exploring fMRI data for periodic signal components.",
            "Exploring regions of interest with cluster analysis (EROICA) using a spectral peak statistic for selecting and testing the significance of fMRI activation time-series.",
            "An evaluation of methods for detecting brain activations from functional neuroimages.",
            "The Logic of Knowledge Bases - Hector J. Levesque, Gerhard Lakemeyer (Eds.), MIT Press, Cambridge, MA, 2000, ISBN 0-262-12232-4.",
            "Verification of temporal scheduling constraints in clinical practice guidelines.",
            "Probabilities for a probabilistic network: a case study in oesophageal cancer.",
            "An automatic microcalcification detection system based on a hybrid neural network classifier.",
            "Automating the drug scheduling of cancer chemotherapy via evolutionary computation.",
            "An expert system for the evaluation of EDSS in multiple sclerosis.",
            "Artificial Neural Networks in Biomedicine - Paulo J.G. Lisboa, Emmanuel C. Ifeachor and Piotr S. Szczepaniak (Eds.), Springer-Verlag, London, 2000, ISBN 1-85233-005-8.",
            "Evaluation of two different models of semi-automatic knowledge acquisition for the medical consultant system CADIAG-II/RHEUMA.",
            "Combining biometric and symbolic models for customised, automated prosthesis design.",
            "NasoNet, modeling the spread of nasopharyngeal cancer with networks of probabilistic events in discrete time.",
            "An evolutionary artificial neural networks approach for breast cancer diagnosis.",
            "Objective detection of brainstem auditory evoked potentials with a priori information from higher presentation levels.",
            "Shape Analysis and Classification. Theory and Practice - Luciano da Fontoura Costa and Roberto Marcondes Cesar Jr.; CRC Press LLC, Boca Raton, 2001, ISBN 0-8493-3493-4.",
            "Uniqueness of medical data mining.",
            "Confidentiality issues for medical data miners.",
            "Data mining a diabetic data warehouse.",
            "Using dependency/association rules to find indications for computed tomography in a head trauma dataset.",
            "Analysis of respiratory pressure-volume curves in intensive care medicine using inductive machine learning.",
            "Logistic-based patient grouping for multi-disciplinary treatment.",
            "Bayesian learning for cardiac SPECT image interpretation.",
            "Syntactic reasoning and pattern recognition for analysis of coronary artery images.",
            "Mining knowledge for HEp-2 cell image classification.",
            "Principles of Data Mining - D. Hand, H. Mannila, P. Smyth (Eds.), MIT Press, Cambridge, MA, 2001, 546 pp. + xxxii, ISBN: 0-262-08290-X.",
            "Survey on the use of smart and adaptive engineering systems in medicine.",
            "Model-based interpretation of cardiac beats by evolutionary algorithms: signal and model interaction.",
            "Case-based distance measurements for the selection of controls in case-matched studies: application in coronary interventions.",
            "Visualization and simulation techniques for surgical simulators using actual patient's data.",
            "Gene expression data analysis of human lymphoma using support vector machines and output coding ensembles.",
            "Qualitative Methods for Reasoning under Uncertainty - Simon Parsons (Ed.), MIT Press, Cambridge, MA/London, 2001, 514 pp., 50 illustrations, hardcover."
        ]
    },
    {
        "name": "AIM",
        "year": "2001",
        "info": "2001: Volumes\n21, 22, 23",
        "count": 59,
        "papers": [
            "The Fuzzy Revolution: Goodbye to the Aristotelian Weltanschauung.",
            "A survey of fuzzy logic monitoring and control utilisation in medicine.",
            "Automatic segmentation of non-enhancing brain tumors in magnetic resonance images.",
            "Bleeding predisposition assessments in tonsillectomy/adenoidectomy patients using fuzzy interquartile encoded neural networks.",
            "Estimation of respiratory parameters via fuzzy clustering.",
            "Fuzzy methods in tremor assessment, prediction, and rehabilitation.",
            "On the use and usefulness of fuzzy sets in medical AI.",
            "The Section on Medical Expert and Knowledge-Based Systems at the Department of Medical Computer Sciences of the University of Vienna Medical School.",
            "Fuzzy sets in human anatomy.",
            "Renoir, Pneumon-IA and Terap-IA: three medical applications based on fuzzy logic.",
            "The fuzzy medical group in the centre for computational Intelligence.",
            "The Intelligent Systems in Biomedicine laboratory in the Department of Automatic Control and Systems Engineering at the University of Sheffield, UK.",
            "Report of research activities in fuzzy AI and medicine at USF CSE.",
            "Neuro-fuzzy closed-loop control of depth of anaesthesia.",
            "Fuzzy logic in a patient supervision system.",
            "Multicriteria fuzzy assignment method: a useful tool to assist medical diagnosis.",
            "Fuzzy logic for decision support in chronic care.",
            "Learning from biomedical time series through the integration of qualitative models and fuzzy systems.",
            "Tuning of myoelectric prostheses using fuzzy logic.",
            "A hybrid expert system for the diagnosis of epileptic crisis.",
            "Using fuzzy sets to analyze putative correlates between age, blood type, gender and/or race with bacterial infection.",
            "Mining association rules with improved semantics in medical databases.",
            "Computerised anaesthesia monitoring using fuzzy trend templates.",
            "Exploiting the advantages of symbolically interpretable continuous biomedical parameters with a fuzzyfied symbolic model.",
            "EvIdent(TM): a functional magnetic resonance image analysis system.",
            "A fuzzy approach to computer-assisted myocardial ischemia diagnosis.",
            "The application of ontologies and problem-solving methods for the development of shareable guidelines.",
            "Knowledge-based verification of clinical guidelines by detection of anomalies.",
            "ONCODOC: a successful experiment of computer-supported guideline development and implementation in the treatment of breast cancer.",
            "Flexible guideline-based patient careflow systems.",
            "Information visualization and its application to medicine.",
            "Exploring presentation methods for tomographic medical image viewing.",
            "Metaphors of movement: a visualization and user interface for time-oriented, skeletal plans.",
            "Information visualisation in clinical Odontology: multidimensional analysis and interactive data exploration.",
            "Visualization and interactive analysis of blood parameters with InfoZoom.",
            "The graphical presentation of decision support information in an intelligent anaesthesia monitor.",
            "A new virtual reality approach for planning of cardiac interventions.",
            "Data mining for indicators of early mortality in a database of clinical records.",
            "Using Bayesian networks in the construction of a bi-level multi-classifier. A case study using intensive care unit patients data.",
            "Logarithmic simulated annealing for X-ray diagnosis.",
            "A formal framework of knowledge to support rational psychoactive drug selection.",
            "Building Natural Language Generation Systems - Ehud Reiter and Robert Dale (Eds.), University of Aberdeen and Macquarie University, Cambridge University Press, 2000, ISBN 0-521-62036-8.",
            "AIM portraits: tracing the evolution of artificial intelligence in medicine and predicting its future in the new millennium.",
            "AI in medicine on its way from knowledge-intensive to data-intensive systems.",
            "Proactive health computing.",
            "The socio-organizational age of artificial intelligence in medicine.",
            "Multiple representations and multi-modal reasoning in medical diagnostic systems.",
            "Medical informatics: reasoning methods.",
            "Machine learning for medical diagnosis: history, state of the art and perspective.",
            "AIM: a personal view of where I have been and where we might be going.",
            "Managing uncertainty in diagnosis of acute coronaric ischemia.",
            "Knowledge discovery approach to automated cardiac SPECT diagnosis.",
            "Case-based reasoning for antibiotics therapy advice: an investigation of retrieval algorithms and prototypes.",
            "Feature subset selection by genetic algorithms and estimation of distribution algorithms - A case study in the survival of cirrhotic patients treated with TIPS.",
            "Foudations of Rational Agency - M. Wooldridge, A. Rao (Eds.), Kluwer Academic Publishers, 1999, ISBN 0-7923-5601-2.",
            "A method for automated temporal knowledge acquisition applied to sleep-related breathing disorders.",
            "A neural network approach to the outcome definition on first treatment with sertraline in a psychiatric population.",
            "A modular approach for representing and executing clinical guidelines.",
            "A sequential neural network model for diabetes prediction."
        ]
    },
    {
        "name": "AIM",
        "year": "2000",
        "info": "2000: Volumes\n18, 19, 20",
        "count": 46,
        "papers": [
            "Fuzzy genomes.",
            "Formal description of disease courses.",
            "A customisable framework for the assessment of therapies in the solution of therapy decision tasks.",
            "An object-oriented design for automated navigation of semantic networks inside a medical data dictionary.",
            "Intelligent Data Analysis in Medicine and Pharmacology, Edited by Nada Lavrac, Elpida Keravnou and Blaz Zupan, Kluwer, 1997.",
            "Erratum to \"Fundamentals of clinical methodology: 3. Nosology\".",
            "A genetic algorithm approach to multi-disorder diagnosis.",
            "Predicting the effectiveness of hydroxyurea in individual sickle cell anemia patients.",
            "Understanding of medico-technical reports.",
            "Automatic recognition of biological shapes with and without representations of shape.",
            "Predictions of coronary artery stenosis by artificial neural network.",
            "Generating concise and accurate classification rules for breast cancer diagnosis.",
            "Planning treatment of ischemic heart disease with partially observable Markov decision processes.",
            "Automatic analysis of signals with symbolic content.",
            "Functional Networks with Applications. A Neural-Based Paradigm, by E. Castillo, A. Cobo, J. M. Gutiérrez and R. E. Pruneda, Kluwer, 1998, ISBN 0-7923-8332-X.",
            "Evolutionary computation in medicine: an overview.",
            "Evolutionary weighting of image features for diagnosing of CNS tumors.",
            "Multi-objective optimization in radiotherapy: applications to stereotactic radiosurgery and prostate brachytherapy.",
            "The learning classifier system: an evolutionary computation approach to knowledge discovery in epidemiologic surveillance.",
            "Model-based spectral estimation of Doppler signals using parallel genetic algorithms.",
            "Data Mining: Methods for Knowledge Discovery, by Krzystof Cios, Witold Pedrycz, and Roman Swiniarski, Kluwer, 1998.",
            "A hierarchical neural network algorithm for robust and automatic windowing of MR images.",
            "Cooperation of fuzzy segmentation operators for correction aliasing phenomenon in 3D color Doppler imaging.",
            "Towards dynamic cardiac scenes interpretation based on spatial-temporal knowledge.",
            "Knowledge-based information management in intensive care and anesthesia.",
            "Multiple signal integration by decision tree induction to detect artifacts in the neonatal intensive care unit.",
            "Towards symbolization using data-driven extraction of local trends for ICU monitoring.",
            "Knowledge discovery and knowledge validation in intensive care.",
            "A probabilistic and decision-theoretic approach to the management of infectious disease at the ICU.",
            "Artificial intelligence in medicine and medical decision making Europe.",
            "Guideline-based careflow systems.",
            "Internet-based decision-support server for acute abdominal pain.",
            "Intelligent analysis of clinical time series: an application in the diabetes mellitus domain.",
            "Machine learning for survival analysis: a case study on recurrence of prostate cancer.",
            "A cooperative framework for segmentation of MRI brain scans.",
            "Knowledge Discovery and Data Mining, Volume 1 of IEE Professional Applications of Computing Series, Edited by M.A. Bramer, IEE, London, UK, 1999, ISBN 0-85296-767-5.",
            "AI planning and scheduling in the medical hospital environment.",
            "Toward interactive scheduling systems for managing medical resources.",
            "Continual planning and scheduling for managing patient tests in hospital laboratories.",
            "Hybrid optimization techniques for the workshift and rest assignment of nursing personnel.",
            "Erratum to Theme Issue on \"Evolutionary Computation in Medicine\".",
            "Erratum to \"Knowledge discovery and knowledge validation in intensive care\".",
            "Model selection for a medical diagnostic decision support system: a breast cancer detection case.",
            "A comparison between two neural network rule extraction techniques for the diagnosis of hepatobiliary disorders.",
            "Stability problems with artificial neural networks and the ensemble solution.",
            "Fundamentals of clinical methodology - 4. Diagnosis."
        ]
    },
    {
        "name": "AIM",
        "year": "1999",
        "info": "1999: Volumes\n15, 16, 17",
        "count": 43,
        "papers": [
            "Syntactic-semantic tagging as a mediator between linguistic representations and formal models: an exercise in linking SNOMED to GALEN.",
            "How knowledge drives understandingmatching medical ontologies with the needs of medical language processing.",
            "Representation of change in controlled medical terminologies.",
            "A methodology for partitioning a vocabulary hierarchy into trees.",
            "Using probabilistic and decision-theoretic methods in treatment and prognosis modeling.",
            "Explicit temporal models for decision-theoretic planning of clinical management.",
            "An evolutionary approach to constructing prognostic models.",
            "Modelling prognostic power of cardiac tests using rough sets.",
            "An evaluation of intelligent prognostic systems for colorectal cancer.",
            "Radial basis function neural networks for the characterization of heart rate variability dynamics.",
            "Using Boolean reasoning to anonymize databases.",
            "Case-based prediction in experimental medical studies.",
            "Predicting coronary disease risk based on short-term RR interval measurements: a neural network approach.",
            "A neural network approach to the diagnosis of morbidity outcomes in trauma care.",
            "Advances in fuzzy theory.",
            "Selected techniques for data mining in medicine.",
            "Analysing and improving the diagnosis of ischaemic heart disease with machine learning.",
            "Two-Stage Machine Learning model for guideline development.",
            "Medical data mining using evolutionary computation.",
            "Dynamic and static approaches to clinical data mining.",
            "Fuzzy diagnosis.",
            "A fuzzy clustering based segmentation system as support to diagnosis in medical imaging.",
            "Obtaining interpretable fuzzy classification rules from medical data.",
            "Fuzzy pre-processing of gold standards as applied to biomedical spectra classification.",
            "Diagnostic monitoring in anaesthesia using fuzzy trend templates for matching temporal patterns.",
            "An intelligent framework for the classification of the 12-lead ECG.",
            "A framework for building cooperative software agents in medical applications.",
            "Formal description of temporal knowledge in case reports.",
            "Feature selection for optimized skin tumor recognition using genetic algorithms.",
            "Use of artificial neural networks in modeling associations of discriminant factors: towards an intelligent selective breast cancer screening.",
            "Refining instructional text generation after evaluation.",
            "Applying statistical, uncertainty-based and connectionist approaches to the prediction of fetal outcome: a comparative study.",
            "Interhemispheric effects on map organization following simulated cortical lesions.",
            "Fundamentals of clinical methodology: 3. Nosology.",
            "The evaluation of an expert system for the analysis of umbilical cord blood.",
            "A fuzzy-genetic approach to breast cancer diagnosis.",
            "A problem-solving method for 'unprotocolised' therapy administration task in medicine.",
            "The determination of three subcutaneous adipose tissue compartments in non-insulin-dependent diabetes mellitus women with artificial neural networks and factor analysis.",
            "A study of PROforma, a development methodology for clinical procedures.",
            "Using sensitivity analysis for efficient quantification of a belief network.",
            "An intelligent system for pacemaker reprogramming.",
            "Abstraction on clinical data sequences: an object-oriented data model and a query language based on the event calculus.",
            "A qualitative process system for modeling NF-kB and AP-1 gene regulation in immune cell biology research."
        ]
    },
    {
        "name": "AIM",
        "year": "1998",
        "info": "1998: Volumes\n12, 13, 14",
        "count": 41,
        "papers": [
            "Case-based reasoning in IVF: prediction and knowledge mining.",
            "Case-based reasoning for medical decision support tasks: The Inreca approach.",
            "Disease diagnosis validation in TROPIX using CBR.",
            "Evaluating a case-based discovery system: a case-study in content-oriented evaluation.",
            "Dependency parsing for medical language and concept representation.",
            "A study of collaboration among medical informatics research laboratories.",
            "Development of systems for support of collaboration in health care: the design arenas.",
            "Electronic communication and collaboration in a health care practice.",
            "Distributed cognition and knowledge-based controlled medical terminologies.",
            "Designing computer-based frameworks that facilitate doctor-patient collaboration.",
            "AI in medical educationanother grand challenge for medical informatics.",
            "Fundamentals of clinical methodology: 2. Etiology.",
            "Neural networks for recognizing patterns in cardiotocograms.",
            "Seeking order in disorder: computational studies of neurologic and psychiatric diseases.",
            "Methodology and validity in the construction of computational models of cognitive deficits following brain damage.",
            "Striatal mechanisms in Parkinson's disease: new insights from computer modeling.",
            "Neural dynamics of short and medium-term motor control effects of levodopa therapy in Parkinson's disease.",
            "Computer models of hippocampal circuit changes of the kindling model of epilepsy.",
            "Neuromodulatory control of hippocampal function: towards a model of Alzheimer's disease.",
            "An artificial neural network stimulating performance of normal subjects and schizophrenics on the Wisconsin card sorting test.",
            "Treatment of missing data values in a neural network based decision support system for acute abdominal pain.",
            "Learning differential diagnosis of erythemato-squamous diseases using voting feature intervals.",
            "Computerised electrocardiology employing bi-group neural networks.",
            "The use of a computerized brain atlas to support knowledge-based training in radiology.",
            "Understanding coronary artery movement: a knowledge-based approach.",
            "Qualitative models and fuzzy systems: an integrated approach for learning from data.",
            "The Asgaard project: a task-specific framework for the application and critiquing of time-oriented clinical guidelines.",
            "Metareasoning and meta-level learning in a hybrid knowledge-based architecture.",
            "Computerized brain atlases as decision support systems: a methodological approach.",
            "Acquiring background knowledge for machine learning using function decomposition: a case study in rheumatology.",
            "Supporting tools for guideline development and dissemination.",
            "Scenario recognition for temporal reasoning in medical domains.",
            "Disseminating medical knowledge: the PROforma approach.",
            "A society of goal-oriented agents for the analysis of living cells.",
            "Medical dictionaries for patient encoding systems: a methodology.",
            "Predicting survival in malignant skin melanoma using Bayesian networks automatically induced by genetic algorithms. An empirical comparison between different approaches.",
            "A functional model of some Parkinson's Disease symptoms using a Guided Propagation Network.",
            "Modelling behavioral syndromes using Bayesian networks.",
            "A development environment for knowledge-based medical applications on the world-wide web.",
            "Web-based health care agents; the case of reminders and todos, too (R2Do2).",
            "Evolving artificial neural networks for screening features from mammograms."
        ]
    },
    {
        "name": "AIM",
        "year": "1997",
        "info": "1997: Volumes\n9, 10, 11",
        "count": 41,
        "papers": [
            "Case-based reasoning: opportunities and applications in health care.",
            "Combining a neural network with case-based reasoning in a diagnostic system.",
            "Case-based learning of plans and goal states in medical diagnosis.",
            "Feasibility analysis of a case-based reasoning system for automated detection of coronary heart disease from myocardial scintigrams.",
            "Retrieving cases for treatment advice in nursing using text representation and structured text retrieval.",
            "An evaluation of machine-learning methods for predicting pneumonia mortality.",
            "The GRAIL concept modelling language for medical terminology.",
            "A process-oriented reasoner about physiology.",
            "A model for integrating image processing into decision aids for diagnostic radiology.",
            "Feature subset selection for classification of histological images.",
            "CADIAG-2 and MYCIN-like systems.",
            "On-line quality [corrected] assurance in the initial definitive management of multiple trauma: evaluating system potential.",
            "Reasoning requirements for diagnosis of heart disease.",
            "Diagnosing congenital heart defects using the Fallot computational model.",
            "Spatio-temporal reasoning for multi-scale modeling in cardiology.",
            "DIAVAL, a Bayesian expert system for echocardiography.",
            "An expert system for diagnosis of acute myocardial infarction with ECG analysis.",
            "Artificial neural network analysis of noisy visual field data in glaucoma.",
            "Latency estimation of auditory brainstem response by neural networks.",
            "The development and implementation of an expert system for the analysis of umbilical cord blood.",
            "Applications of abduction: hypothesis testing of neuroendocrinological qualitative compartmental models.",
            "BANTER: a Bayesian network tutoring shell.",
            "Model-based diagnosis in medicine.",
            "Abstract temporal diagnosis in medical domains.",
            "A temporal extension to the parsimonious covering theory.",
            "INKBLOT: A neurological diagnostic decision support system integrating causal and anatomical knowledge.",
            "Avoiding premature closure in sequential diagnosis.",
            "Fuzzy set theory in medicine.",
            "Fuzzy logic for model adaptation of a pharmacokinetic-based closed loop delivery system for pancuronium.",
            "Design and validation of an intelligent patient monitoring and alarm system based on a fuzzy logic process model.",
            "Lightweight fuzzy processes in clinical computing.",
            "Fuzzy logic in computer-aided breast cancer diagnosis: analysis of lobulation.",
            "Decision support in the operating theatre and intensive care: A personal view.",
            "NéoGanesh: a working system for the automated control of assisted ventilation in ICUs.",
            "Evaluation of a medical diagnosis system using simulator test scenarios.",
            "A decision-driven design of a decision support system in anesthesia.",
            "Recognition of patient anaesthetic levels: neural network systems, principal components analysis, and canonical discriminant variates.",
            "The Colorectal Cancer Recurrence Support (CARES) System.",
            "Formalisation for decision support in anaesthesiology.",
            "Application of autonomous neural network systems to medical pattern classification tasks.",
            "Application of the fuzzy ART/MAP and MinMax/MAP neural network models to radiographic image classification."
        ]
    },
    {
        "name": "AIM",
        "year": "1996",
        "info": "1996: Volume\n8",
        "count": 30,
        "papers": [
            "On the interpretation of certainty factors in expert systems.",
            "Modifying an expert system construction to pattern recognition solution.",
            "Evaluation of automatic knowledge acquisition techniques in the diagnosis of acute abdominal pain - Acute Abdominal Pain Study Group.",
            "Extracting rules from pruned networks for breast cancer diagnosis.",
            "Determining and classifying the region of interest in ultrasonic images of the breast using neural networks.",
            "An expert system for the detection of cervical cancer cells using knowledge-based image analyzer.",
            "Introducing spatio-temporal reasoning into the inverse problem in electroencephalography.",
            "Generating recipient-centered explanations about drug prescription.",
            "Synthesis of an anaesthetic agent administration system using fuzzy inductive reasoning.",
            "An intelligent system for the diagnosis of complex images.",
            "Temporal reasoning in medicine.",
            "Temporal reasoning for diagnosis in a causal probabilistic knowledge base.",
            "Learning temporal probabilistic causal models from longitudinal data.",
            "Temporal diagnostic reasoning based on time-objects.",
            "Knowledge-based temporal abstraction in clinical domains.",
            "Managing temporal worlds for medical trend diagnosis.",
            "Machine learning techniques in early screening for gastric and oesophageal cancer.",
            "The interpretation of time-varying data with DIAMON-1.",
            "Retrieval of clinical science information using an interactive activation and competition network.",
            "Fuzzy gating and the problem of screening.",
            "Sleep classification in infants by decision tree-based neural networks.",
            "Application of the fuzzy ARTMAP neural network model to medical pattern classification tasks.",
            "Machine learning in prognosis of the femoral neck fracture recovery.",
            "Modelling ECG signals with hidden Markov models.",
            "Structure discovery in medical databases: a conceptual clustering approach.",
            "Concept formation vs. logistic regression: predicting death in trauma patients.",
            "Don't care values in induction.",
            "A computerized induction analysis of possible co-variations among different elements in human tooth enamel.",
            "Deep assessment of machine learning techniques using patient treatment in acute abdominal pain in children.",
            "Utilizing temporal data abstraction for data validation and therapy planning for artificially ventilated newborn infants."
        ]
    },
    {
        "name": "AIM",
        "year": "1995",
        "info": "1995: Volume\n7",
        "count": 27,
        "papers": [
            "Development and retrospective evaluation of Hepaxpert-I: a routinely-used expert system for interpretive analysis of hepatitis A and B serologic findings.",
            "NEUREX: a tutorial expert system for the diagnosis of neurogenic diseases of the lower limbs.",
            "Evaluation of a knowledge-based decision-support system for ventilator therapy management.",
            "Neural network assisted cardiac auscultation.",
            "Neural network classification of infrared spectra of control and Alzheimer's diseased tissue.",
            "An appraisal of INTERNIST-I.",
            "An intelligent interactive system for delivering individualized information to patients.",
            "Control theory as a conceptual framework for intensive care monitoring.",
            "Architectures for intelligent systems based on reusable components.",
            "One framework, two systems: flexible abductive methods in the problem-space paradigm applied to antibody identification and biopsy interpretation.",
            "A case study in ontology library construction.",
            "Ontology-based configuration of problem-solving methods and generation of knowledge-acquisition tools: application of PROTEGE-II to protocol-based decision support.",
            "The NST-EXPERT project: the need to evolve.",
            "Model-based diagnosis of brain disorders: a prototype framework.",
            "VIA-RAD: a blackboard-based system for diagnostic radiology. Visual Interaction Assistant for Radiology.",
            "An algorithm for complete enumeration of the mechanisms of supraventricular tachycardias that use multiple atrioventricular, AV nodal, and/or Mahaim pathways.",
            "Situated clinical cognition.",
            "Objects, contradictions and collaboration in medical cognition: an activity-theoretical perspective.",
            "Steering through the murky waters of a scientific conflict: situated and symbolic models of clinical cognition.",
            "Objectification and negotiation in interpreting clinical images: implications for computer-based patient records.",
            "A theoretical approach to artificial intelligence systems in medicine.",
            "Editorial.",
            "Clinical monitoring using regression-based trend templates.",
            "Use of data abstraction methods to simplify monitoring.",
            "Adaptive controllers for intelligent monitoring.",
            "An ignorant belief network to forecast glucose concentration from clinical databases.",
            "Causal inference from indirect experiments."
        ]
    },
    {
        "name": "AIM",
        "year": "1994",
        "info": "1994: Volume\n6",
        "count": 31,
        "papers": [
            "A causal and temporal reasoning model and its use in drug therapy applications.",
            "Integrating consultation and semi-automatic knowledge acquisition in a prototype-based architecture: experiences with dysmorphic syndromes.",
            "Polygenic trait analysis by neural network learning.",
            "A support for decision-making: cost-sensitive learning system.",
            "Fundamentals of clinical methodology: 1. Differential indication.",
            "A methodology for evaluation of knowledge-based systems in medicine.",
            "The evaluation of expert diagnostic systems. How to assess outcomes and quality parameters?",
            "Combining rule-based reasoning and mathematical modelling in diabetes care.",
            "Methodological issues in validating decision-support systems for insulin dosage adjustment.",
            "Refinement of the HEPAR expert system: tools and techniques.",
            "Information technology factors in transferability of knowledge based systems in medicine.",
            "Effective retrieval in Hospital Information Systems: the use of context in answering queries to Patient Discharge Summaries.",
            "Integration of quantitative and qualitative reasoning: an expert system for cardiosurgical patients.",
            "Learning and discovery from a clinical database: an incremental concept formation approach.",
            "Finding temporal patterns - a set-based approach.",
            "Virtual reality in medicine.",
            "Emerging medical applications of virtual reality: a surgeon's perspective.",
            "Augmenting reality in rehabilitation medicine.",
            "Methods in the Virtual Wetlab I: rule-based reasoning driven by nearest-neighbor lattice dynamics.",
            "Dynamic force feedback in a virtual knee palpation.",
            "A resource guide to VR in medicine.",
            "Neural computing in medicine.",
            "On the quality of neural net classifiers.",
            "A neural model of cortical map reorganization following a focal lesion.",
            "Identifying the measurement noise in glaucomatous testing: an artificial neural network approach.",
            "On using feedforward neural networks for clinical diagnostic tasks.",
            "Removing the assumption of conditional independence from Bayesian decision models by using artificial neural networks: some practical techniques and a case study.",
            "An object-oriented approach to knowledge representation in a biomedical domain.",
            "Reusable influence diagrams.",
            "Towards productive Knowledge-Based Systems in clinical organizations: a methods perspective.",
            "High-specificity neurological localization using a connectionist model."
        ]
    },
    {
        "name": "AIM",
        "year": "1993",
        "info": "1993: Volume\n5",
        "count": 30,
        "papers": [
            "Intelligent monitoring and control of dynamic physiological systems.",
            "Physiological applications of consistency-based diagnosis.",
            "Model-based diagnosis in intensive care monitoring: the YAQ approach.",
            "Guaranteeing real-time response with limited resources.",
            "The design and implementation of a ventilator-management advisor.",
            "Artificial intelligence in medicine: state-of-the-art and future prospects.",
            "The adolescence of AI in medicine: will the field come of age in the '90s?",
            "European research efforts in medical knowledge-based systems.",
            "Exploring the relationship between rationality and bounded rationality in medical knowledge-based systems.",
            "Neural computation in medicine.",
            "On the soundness and safety of expert systems.",
            "Graphical knowledge acquisition for medical diagnostic expert systems.",
            "Medical decision making based on inductive learning method.",
            "Automatic knowledge base refinement: learning from examples and deep knowledge in rheumatology.",
            "Consistency enforcement in medical knowledge base construction.",
            "Inferential knowledge acquisition.",
            "Specification of models in large expert systems based on causal probabilistic networks.",
            "Probabilistic and decision-theoretic systems in medicine.",
            "Multiply sectioned Bayesian networks for neuromuscular diagnosis.",
            "A tutorial introduction to stochastic simulation algorithms for belief networks.",
            "Computing the confidence in a medical decision obtained from an influence diagram.",
            "Bayesian inference for model-based segmentation of computed radiographs of the hand.",
            "The representation of medical reasoning models in resolution-based theorem provers.",
            "Symbolic decision support in medical care.",
            "Logic-based integrity constraints and the design of dental prostheses.",
            "A constraint logic programming framework for constructing DNA restriction maps.",
            "Multiple disorder diagnosis with adaptive competitive neural networks.",
            "Towards a statistically oriented decision support system for the management of septicaemia.",
            "Neural network based classification of single-trial EEG data.",
            "Connectionist expert systems as medical decision aid."
        ]
    },
    {
        "name": "AIM",
        "year": "1992",
        "info": "1992: Volume\n4",
        "count": 31,
        "papers": [
            "A model-based approach to the diagnosis of the cardiac arrhythmias.",
            "Certainty factor theory: Its probabilistic interpretations and problems.",
            "From certainty factors to belief networks.",
            "Qualitative simulation of dynamic physiological models using the KEE environment.",
            "A fuzzy expert system shell: From minicomputer to PC.",
            "Editorial.",
            "Knowledge-based flash evoked potential recognition system.",
            "M-HTP: A system for monitoring heart transplant patients.",
            "Qualitative modeling as a paradigm for diagnosis and prediction in critical care environments.",
            "Flexible support for trauma management through goal-directed reasoning and planning.",
            "Guardian: A prototype intelligent agent for intensive-care monitoring.",
            "Therapy planning and monitoring.",
            "Patient-specific explanation in models of chronic disease.",
            "Hybrid knowledge-based systems for therapy planning.",
            "Planning of therapy and tests in causal probabilistic networks.",
            "Bayesian networks for patient monitoring.",
            "Background knowledge in diagnosis.",
            "MENINGE: A medical consulting system for child's meningitis. Study on a series of consecutive cases.",
            "GAIT-ER-AID: An expert system for diagnosis of human gait.",
            "Handbook of theoretical computer science : J. van Leeuwen, ed., Vol. A: Algorithms and Complexity, Vol. B: Formal Methods and Semantics (Elsevier, Amsterdam, 1990), 2296 pp., hardcover, Dfl. 555.00.",
            "Knowledge acquisition for multi-channel electroencephalogram interpretation.",
            "Automated design of diagnostic systems.",
            "Indexing biomedical documents: From thesaural to knowledge-based retrieval systems.",
            "Extraction of diagnostic rules using recursive partitioning systems: A comparison of two approaches.",
            "Consistency checking of binary categorical relationships in a medical knowledge base.",
            "Artificial intelligence in medicine workshop: AAAI 1992 Spring Symposium Series Stanford University March 25-27, 1992 Workshop Summary.",
            "Representing knowledge in medical decision support systems.",
            "Inducing diagnostic rules for glomerular disease with the DLG machine learning algorithm.",
            "Intermediate depth representations.",
            "Modeling disturbance management in anesthesia: A preliminary report.",
            "Ripple down rules: Turning knowledge acquisition into knowledge maintenance."
        ]
    },
    {
        "name": "AIM",
        "year": "1991",
        "info": "1991: Volume\n3",
        "count": 38,
        "papers": [
            "Editorial.",
            "Flexible reasoning about patient management using multiple models.",
            "Utilizing detailed anatomical knowledge for hypothesis formation and hypothesis testing in rheumatological decision support.",
            "Using quantitative and qualitative constraints in models of cardiac electrophysiology.",
            "Heterogeneous knowledge representation using a finite automaton and first order logic: a case study in electromyography.",
            "Abductive localization of brain damage: incorporating spatial adjacency relations.",
            "A scheme of inference of regular grammars for the syntactic pattern recognition of saccadic eye movements.",
            "The DeSyGNER knowledge management architecture: a building block approach based on an extensible kernel.",
            "Methodological principles in medical knowledge programming: part I.",
            "Medical expert system user interface.",
            "Support of multilingual medical research.",
            "Transpro: natural language to Prolog translation of genealogy statements in USDVA file manager.",
            "Precedence logic in the development of a blood bank expert system.",
            "Solving quality assurance problems with object scripting languages.",
            "An introduction to programming in prolog: Patrick Saint-Dizier, (Springer-Verlag, New York, 1990) XI + 184 pp., 44 figures, softcover, DM 48.00.",
            "Programmieren in prolog: W.F. Clocksin and C.S. Mellish, (Springer-Verlag, Berlin, 1990) XIV + 331 pp., 43 figures, softcover, DM 48.00.",
            "PROLOG. Grundlagen und anwendungen, zweite überarbeitete und erweiterte auflage: H. Kleine Büning and S. Schmitgen, (B.G. Teubner, Stuttgart, 1988) 311 pp., softcover, DM 38.00.",
            "PROLOG. Fortgeschrittene programmiertechniken: Leon Sterling and Ehud Shapiro, (Addison-Wesley Publishing Company, Bonn, 1988) XXVII + 468 pp., 70 figures, hardcover, DM 78.00.",
            "Logische grundlagen der künstlichen intelligenz: Michael R. Genesereth and Nils J. Nilsson, (Vieweg & Sohn, Braunschweig, 1989) XXIV + 576 pp., softcover, DM 78.00.",
            "Temporal logics and their applications: Antony Galton (ed.), (Academic Press, Harcourt Brace Jovanovich Publishers, London, 1987) XII + 244 pp., hardcover, £ 24.00.",
            "AIME 89: Jim Hunter, John Cookson, and Jeremy Wyatt (eds.), (Springer-Verlag, Berlin, 1989) X + 330 pp., softcover, DM 81.00.",
            "Wörterbuch der medizinischen informatik: Hans Jürgen Seelos (ed.), (Walter de Gruyter, Berlin, 1990) XXII + 550 pp., 34 figures, hardcover, DM 148.00.",
            "The role of essential explanation in abduction.",
            "DIAGAID: a connectionist approach to determine the diagnostic value of clinical data.",
            "Teaching medicine using hypertexts: three years of experience at the Ancona Medical School.",
            "Classification of electrocardiographic signals: a fuzzy pattern matching approach.",
            "Diagnosis: Philosophical and medical perspectives : Nathaniel Laor and Joseph Agassi, (Kluwer, Dordrecht, 1990) XVIII + 262 pp., hardcover, US $ 68.00.",
            "Foundations of neural networks : Tarun Khanna, (Addison-Wesley, Reading, MA, 1990) XII + 196 pp., numerous figures, softcover, price not listed.",
            "The computer and the brain: Perspectives on human and artificial intelligence : Jean R. Brink, C. Roland Haden, eds., Chritopher Burawa, assistant ed., (North-Holland, Amsterdam, 1989) XVI + 263 pp., 38 figures, hardcover, US $ 58.00.",
            "A model of differential diagnosis in histopathology using the theory of hypergraphs and social choice.",
            "A Bayesian expert system for the analysis of an adverse drug reaction.",
            "An expert system for the interpretation of full blood counts and blood smears in a hematology laboratory.",
            "Medical temporal reasoning.",
            "On the co-operation between abductive and temporal reasoning in medical diagnosis.",
            "Automatically analyzing a steadily beating ventricle's iterative behavior over time.",
            "Temporal query processing with indefinite information.",
            "The visual display of temporal information.",
            "A history of medical informatics: Bruce I. Blum and Karen Duncan, eds., (Addison-Wesley, Reading, MA, 1990) 455 pp., US $ 49.50."
        ]
    },
    {
        "name": "AIM",
        "year": "1990",
        "info": "1990: Volume\n2",
        "count": 33,
        "papers": [
            "In dubio pro aegro.",
            "MKS: An expert system shell for HIS environment.",
            "Towards computer-assisted maintenance of medical knowledge bases.",
            "Expert system support for the therapeutic management of cerebrovascular disease.",
            "A report on medical expert systems research in Italy.",
            "Automation of cytogenetics: Claes Lundsteen and Jim Piper (eds.), Springer, Berlin, 1989, Xvi + 316 pages, 103 figures, hard cover, DM 128.00.",
            "A clinical information system for oncology: John P. Enterline, Raymond E. Lenhard and Bruce I. Blum, Springer, Berlin, 1989. Xvii + 268 pages, 103 figures, hard cover, DM 90.00.",
            "An introduction to formal language theory (with a contribution by James Pustejovsky): Robert N. Moll Michael A. Arbib, Springer, Berlin, 1988. X + 203 pages, 61 figures, hard cover, DM 68.00.",
            "Uncertainty and intelligent systems: B. Bouchon, L. Saitta and R.R. Yager (eds.), Springer, Berlin, 1988. Viii + 408 pages, soft cover, DM 55.00.",
            "Software review: Schindler and Partners, Expert System AUTOKLAS, Version 5.0, Riesweiler, FRG, 1989. DM 10500.",
            "Deep models for medical expert systems.",
            "Diagnostic efficiency of deep and surface knowledge in KARDIO.",
            "Qualitative models in medical diagnosis.",
            "Structure and significance of analogical reasoning.",
            "Knowledge acquisition for knowledge-based systems: B.R. Gaines and J.H. Boose (eds.), Academic Press, London, 1988. Xix + 355 pages, £ 16.95.",
            "Knowledge acquisition: James F. Brulé and Alexander Blount, McGraw Hill, New York/Hamburg, 1989. Xxvii + 253 pages, paperback, DM 75.33.",
            "Some causal models are deeper than others.",
            "Making deepness explicit.",
            "Monitoring diseases with empirical and model-generated histories.",
            "The qualitative criticism of circulatory models via bipartite teleological analysis.",
            "Editorial: Medical expertext.",
            "A hypermedia document collection for primary care: why, what, and how?",
            "LIMES: a hypertext interface to a cholesterol management expert system.",
            "Coupling hypertext to an object-oriented environment.",
            "Medical expertext as regularity in semantic nets.",
            "Medical informatics, computer applications in health care: E.H. Shortliffe and L.E. Perreault, eds., G. Wiederhold and L.M. Fagan, associate eds., (Addison-Wesley, Reading, MA, 1990) 715 pp., $45.25.",
            "A temporal reasoning framework used in the diagnosis of skeletal dysplasias.",
            "Automating the knowledge acquisition process in the construction of medical expert systems.",
            "The 1990 AAAI Spring Symposium on Artificial Intelligence in Medicine.",
            "Guides for hypertext: an overview.",
            "The construction of knowledge in neurology: implications for hypermedia system development.",
            "Logic engineering for knowledge engineering: design and implementation of the Oxford System of Medicine.",
            "Expertext for medical care and literature retrieval."
        ]
    },
    {
        "name": "AIM",
        "year": "1989",
        "info": "1989: Volume\n1",
        "count": 26,
        "papers": [
            "Machine over mind.",
            "Deep and shallow models in medical expert systems.",
            "'Deep' models and their relation to diagnosis.",
            "Medication ordering based on a predictive knowledge base.",
            "Parsimonious covering as a method for natural language interfaces to expert systems.",
            "Models for measuring performance of medical expert systems.",
            "CADIAG-2/GALL: An experimental expert system for the diagnosis of gallbladder and biliary tract diseases.",
            "Expert systems in laboratory medicine and pathology.",
            "Fuzzy decision-making in electrocardiography.",
            "FOETOS in clinical practice: A retrospective analysis of its performance.",
            "Communications.",
            "Computerized natural medical language processing for knowledge representation : J.R. Scherrer, R.A. Côté, and S.H. Mandil (eds.): North-Holland, Amsterdam, 1989, xvi + 296 pp., US$84.25 / Dfl, 160.00.",
            "Diagnostic problem solving. Combining heuristic, approximate and causal reasoning : Pietro Torasso and Luca Console: North Oxford Academic Publishers Ltd., London, 1989, 243 pp., £ 20.00.",
            "Dealing with uncertain knowledge in medical decision-making: A case study in hepatology.",
            "PC-KANDID: An expert system for electromyography.",
            "A consultation system for recognition of human body segments from tomograms.",
            "Computerized content analysis of natural language.",
            "Outline of an expert system for ECG diagnosis using fuzzy sets.",
            "Expert systems architectures: L. Johnson and E.T. Keravnou: Kogan Page Ltd., London, 1988, £ 25.00.",
            "Expert system applications: Leonard Bolc and Michael J. Coombs (eds.): Springer-Verlag, Berlin, 1988, VII + 471 pp., 84 figures, 12 tables, Hard cover, DM 134.00.",
            "Foundations of logic programming: John Wylie Lloyd: Springer-Verlag, Berlin, 1987, XII + 212 pp., Hard cover, DM 88.00.",
            "Prolog by example. How to learn, teach and use it: Helder Coelho and José C. Cotta: Springer-Verlag, Berlin, 1988, X + 382 pp., 68 figures, Hard cover, DM 64.00.",
            "Expert systems for experts: Kamran Parsaye and Mark Chignell: John Wiley & Sons, Inc., New York and Chichester, 1988, XVI + 462 pp., £ 19.50.",
            "TRANSOFT: Medical translation expert system.",
            "On treatment selection in the face of uncertainty in expert systems.",
            "Paraconsistent logics as a formalism for reasoning about inconsistent knowledge bases."
        ]
    }
]