[
    {
        "year": "2021",
        "name": "24th AISTATS 2021",
        "info": "Virtual Event",
        "venues": [
            {
                "sub_name_abbr": "conf/aistats/2021",
                "sub_name": "The 24th International Conference on Artificial Intelligence and Statistics, AISTATS 2021, April 13-15, 2021, Virtual Event.",
                "count": 455,
                "papers": [
                    "On the Effect of Auxiliary Tasks on Representation Dynamics.",
                    "LassoNet: Neural Networks with Feature Sparsity.",
                    "Projection-Free Optimization on Uniformly Convex Sets.",
                    "Differentiable Greedy Algorithm for Monotone Submodular Maximization: Guarantees, Gradient Estimators, and Applications.",
                    "Graphical Normalizing Flows.",
                    "One-Round Communication Efficient Distributed M-Estimation.",
                    "CWY Parametrization: a Solution for Parallelized Optimization of Orthogonal and Stiefel Matrices.",
                    "Regularized Policies are Reward Robust.",
                    "Semi-Supervised Learning with Meta-Gradient.",
                    "On Information Gain and Regret Bounds in Gaussian Process Bandits.",
                    "On the proliferation of support vectors in high dimensions.",
                    "Continual Learning using a Bayesian Nonparametric Dictionary of Weight Factors.",
                    "A Fast and Robust Method for Global Topological Functional Optimization.",
                    "Regression Discontinuity Design under Self-selection.",
                    "Decision Making Problems with Funnel Structure: A Multi-Task Learning Approach with Application to Email Marketing Campaigns.",
                    "When OT meets MoM: Robust estimation of Wasserstein Distance.",
                    "Learning Individually Fair Classifier with Path-Specific Causal-Effect Constraint.",
                    "Unconstrained MAP Inference, Exponentiated Determinantal Point Processes, and Exponential Inapproximability.",
                    "False Discovery Rates in Biological Networks.",
                    "Fourier Bases for Solving Permutation Puzzles.",
                    "Accelerating Metropolis-Hastings with Lightweight Inference Compilation.",
                    "Simultaneously Reconciled Quantile Forecasting of Hierarchically Related Time Series.",
                    "Fully Gap-Dependent Bounds for Multinomial Logit Bandit.",
                    "Alternating Direction Method of Multipliers for Quantization.",
                    "Online Forgetting Process for Linear Regression Models.",
                    "A Bayesian nonparametric approach to count-min sketch under power-law data streams.",
                    "Nonlinear Functional Output Regression: A Dictionary Approach.",
                    "When MAML Can Adapt Fast and How to Assist When It Cannot.",
                    "Learning Smooth and Fair Representations.",
                    "On Projection Robust Optimal Transport: Sample Complexity and Model Misspecification.",
                    "Contextual Blocking Bandits.",
                    "Kernel Distributionally Robust Optimization: Generalized Duality Theorem and Stochastic Approximation.",
                    "A comparative study on sampling with replacement vs Poisson sampling in optimal subsampling.",
                    "Robust Imitation Learning from Noisy Demonstrations.",
                    "Online Active Model Selection for Pre-trained Classifiers.",
                    "Online Sparse Reinforcement Learning.",
                    "A Contraction Approach to Model-based Reinforcement Learning.",
                    "The Spectrum of Fisher Information of Deep Networks Achieving Dynamical Isometry.",
                    "Benchmarking Simulation-Based Inference.",
                    "Fisher Auto-Encoders.",
                    "Deep Spectral Ranking.",
                    "Tight Regret Bounds for Infinite-armed Linear Contextual Bandits.",
                    "On the Absence of Spurious Local Minima in Nonlinear Low-Rank Matrix Recovery Problems.",
                    "Fast Learning in Reproducing Kernel Krein Spaces via Signed Measures.",
                    "Approximate Message Passing with Spectral Initialization for Generalized Linear Models.",
                    "Active Learning with Maximum Margin Sparse Gaussian Processes.",
                    "A Stein Goodness-of-test for Exponential Random Graph Models.",
                    "The Sample Complexity of Level Set Approximation.",
                    "Curriculum Learning by Optimizing Learning Dynamics.",
                    "Approximating Lipschitz continuous functions with GroupSort neural networks.",
                    "Learning GPLVM with arbitrary kernels using the unscented transformation.",
                    "Low-Rank Generalized Linear Bandit Problems.",
                    "On the convergence of the Metropolis algorithm with fixed-order updates for multivariate binary probability distributions.",
                    "Learning Partially Known Stochastic Dynamics with Empirical PAC Bayes.",
                    "SONIA: A Symmetric Blockwise Truncated Optimization Algorithm.",
                    "Predictive Power of Nearest Neighbors Algorithm under Random Perturbation.",
                    "On the Generalization Properties of Adversarial Training.",
                    "Adversarially Robust Estimate and Risk Analysis in Linear Regression.",
                    "Adaptive Approximate Policy Iteration.",
                    "Nearest Neighbour Based Estimates of Gradients: Sharp Nonasymptotic Bounds and Applications.",
                    "Foundations of Bayesian Learning from Synthetic Data.",
                    "Generalization of Quasi-Newton Methods: Application to Robust Symmetric Multisecant Updates.",
                    "Hierarchical Clustering via Sketches and Hierarchical Correlation Clustering.",
                    "Generalization Bounds for Stochastic Saddle Point Problems.",
                    "Learning to Defend by Learning to Attack.",
                    "A Deterministic Streaming Sketch for Ridge Regression.",
                    "Deep Probabilistic Accelerated Evaluation: A Robust Certifiable Rare-Event Simulation Methodology for Black-Box Safety-Critical Systems.",
                    "On the role of data in PAC-Bayes.",
                    "CADA: Communication-Adaptive Distributed Adam.",
                    "Bandit algorithms: Letting go of logarithmic regret for statistical robustness.",
                    "Geometrically Enriched Latent Spaces.",
                    "Confident Off-Policy Evaluation and Selection through Self-Normalized Importance Weighting.",
                    "Kernel regression in high dimensions: Refined analysis beyond double descent.",
                    "Self-Concordant Analysis of Generalized Linear Bandits with Forgetting.",
                    "Logical Team Q-learning: An approach towards factored policies in cooperative MARL.",
                    "Automatic structured variational inference.",
                    "Neural Enhanced Belief Propagation on Factor Graphs.",
                    "Predictive Complexity Priors.",
                    "Improving predictions of Bayesian neural nets via local linearization.",
                    "Generalized Spectral Clustering via Gromov-Wasserstein Learning.",
                    "Shapley Flow: A Graph-based Approach to Interpreting Model Predictions.",
                    "Scalable Constrained Bayesian Optimization.",
                    "Sample efficient learning of image-based diagnostic classifiers via probabilistic labels.",
                    "Nonparametric Variable Screening with Optimal Decision Stumps.",
                    "Sharp Analysis of a Simple Model for Random Forests.",
                    "Nested Barycentric Coordinate System as an Explicit Feature Map.",
                    "An Analysis of the Adaptation Speed of Causal Models.",
                    "Learning Fair Scoring Functions: Bipartite Ranking under ROC-based Fairness Constraints.",
                    "Efficient Computation and Analysis of Distributional Shapley Values.",
                    "A constrained risk inequality for general losses.",
                    "Sample Complexity Bounds for Two Timescale Value-based Reinforcement Learning Algorithms.",
                    "Learning Prediction Intervals for Regression: Generalization and Calibration.",
                    "Regularization Matters: A Nonparametric Perspective on Overparametrized Neural Network.",
                    "Revisiting Model-Agnostic Private Learning: Faster Rates and Active Learning.",
                    "Multi-Fidelity High-Order Gaussian Processes for Physical Simulation.",
                    "Deep Fourier Kernel for Self-Attentive Point Processes.",
                    "Robustness and scalability under heavy tails, without strong convexity.",
                    "Understanding the wiring evolution in differentiable neural architecture search.",
                    "Provable Hierarchical Imitation Learning via EM.",
                    "Learning with risk-averse feedback under potentially heavy tails.",
                    "Parametric Programming Approach for More Powerful and General Lasso Selective Inference.",
                    "On the High Accuracy Limitation of Adaptive Property Estimation.",
                    "Neural Function Modules with Sparse Arguments: A Dynamic Approach to Integrating Information across Layers.",
                    "Learning-to-Rank with Partitioned Preference: Fast Estimation for the Plackett-Luce Model.",
                    "Interpretable Random Forests via Rule Extraction.",
                    "Regret Minimization for Causal Inference on Large Treatment Space.",
                    "Bayesian Model Averaging for Causality Estimation and its Approximation based on Gaussian Scale Mixture Distributions.",
                    "Adaptive Sampling for Fast Constrained Maximization of Submodular Functions.",
                    "Mean-Variance Analysis in Bayesian Optimization under Uncertainty.",
                    "Hadamard Wirtinger Flow for Sparse Phase Retrieval.",
                    "Stochastic Linear Bandits Robust to Adversarial Attacks.",
                    "ATOL: Measure Vectorization for Automatic Topologically-Oriented Learning.",
                    "Optimizing Percentile Criterion using Robust MDPs.",
                    "On Riemannian Stochastic Approximation Schemes with Fixed Step-Size.",
                    "Optimal Quantisation of Probability Measures Using Maximum Mean Discrepancy.",
                    "Aligning Time Series on Incomparable Spaces.",
                    "The Unexpected Deterministic and Universal Behavior of Large Softmax Classifiers.",
                    "Measure Transport with Kernel Stein Discrepancy.",
                    "Unifying Clustered and Non-stationary Bandits.",
                    "A Theoretical Analysis of Catastrophic Forgetting through the NTK Overlap Matrix.",
                    "Transforming Gaussian Processes With Normalizing Flows.",
                    "Linearly Constrained Gaussian Processes with Boundary Conditions.",
                    "Noise Contrastive Meta-Learning for Conditional Density Estimation using Kernel Mean Embeddings.",
                    "Top-m identification for linear bandits.",
                    "When Will Generative Adversarial Imitation Learning Algorithms Attain Global Convergence.",
                    "Online k-means Clustering.",
                    "Consistent k-Median: Simpler, Better and Robust.",
                    "Algorithms for Fairness in Sequential Decision Making.",
                    "On Learning Continuous Pairwise Markov Random Fields.",
                    "Abstract Value Iteration for Hierarchical Reinforcement Learning.",
                    "Differentially Private Analysis on Graph Streams.",
                    "Learning with Hyperspherical Uniformity.",
                    "Finding First-Order Nash Equilibria of Zero-Sum Games with the Regularized Nikaido-Isoda Function.",
                    "Latent Derivative Bayesian Last Layer Networks.",
                    "Hogwild! over Distributed Local Data Sets with Linearly Increasing Mini-Batch Sizes.",
                    "Provably Safe PAC-MDP Exploration Using Analogies.",
                    "Maximal Couplings of the Metropolis-Hastings Algorithm.",
                    "Gaming Helps! Learning from Strategic Interactions in Natural Dynamics.",
                    "Goodness-of-Fit Test for Mismatched Self-Exciting Processes.",
                    "Dominate or Delete: Decentralized Competing Bandits in Serial Dictatorship.",
                    "A Study of Condition Numbers for First-Order Optimization.",
                    "Linear Regression Games: Convergence Guarantees to Approximate Out-of-Distribution Solutions.",
                    "Differentially Private Online Submodular Maximization.",
                    "Anderson acceleration of coordinate descent.",
                    "Inference in Stochastic Epidemic Models via Multinomial Approximations.",
                    "Stochastic Polyak Step-size for SGD: An Adaptive Learning Rate for Fast Convergence.",
                    "SGD for Structured Nonconvex Functions: Learning Rates, Minibatching and Interpolation.",
                    "Stable ResNet.",
                    "Latent variable modeling with random features.",
                    "Reaping the Benefits of Bundling under High Production Costs.",
                    "Momentum Improves Optimization on Riemannian Manifolds.",
                    "Quick Streaming Algorithms for Maximization of Monotone Submodular Functions in Linear Time.",
                    "On Data Efficiency of Meta-learning.",
                    "Hyperparameter Transfer Learning with Adaptive Complexity.",
                    "Local Stochastic Gradient Descent Ascent: Convergence Analysis and Communication Efficiency.",
                    "Problem-Complexity Adaptive Model Selection for Stochastic Linear Bandits.",
                    "On the Minimax Optimality of the EM Algorithm for Learning Two-Component Mixed Linear Regression.",
                    "Amortized Bayesian Prototype Meta-learning: A New Probabilistic Meta-learning Approach to Few-shot Image Classification.",
                    "Tractable contextual bandits beyond realizability.",
                    "Learning User Preferences in Non-Stationary Environments.",
                    "Last iterate convergence in no-regret learning: constrained min-max optimization for convex-concave landscapes.",
                    "Efficient Statistics for Sparse Graphical Models from Truncated Samples.",
                    "Have We Learned to Explain?: How Interpretability Methods Can Learn to Encode Predictions in their Interpretations.",
                    "Feedback Coding for Active Learning.",
                    "Shadow Manifold Hamiltonian Monte Carlo.",
                    "Towards Understanding the Behaviors of Optimal Deep Active Learning Algorithms.",
                    "Identification of Matrix Joint Block Diagonalization.",
                    "Understanding Gradient Clipping In Incremental Gradient Methods.",
                    "A Variational Information Bottleneck Approach to Multi-Omics Data Integration.",
                    "On the Privacy Properties of GAN-generated Samples.",
                    "Multitask Bandit Learning Through Heterogeneous Feedback Aggregation.",
                    "Learning Complexity of Simulated Annealing.",
                    "Independent Innovation Analysis for Nonlinear Vector Autoregressive Process.",
                    "Robust Mean Estimation on Highly Incomplete Data with Arbitrary Outliers.",
                    "Near-Optimal Provable Uniform Convergence in Offline Policy Evaluation for Reinforcement Learning.",
                    "Q-learning with Logarithmic Regret.",
                    "An Efficient Algorithm For Generalized Linear Bandit: Online Stochastic Gradient Descent and Thompson Sampling.",
                    "Communication Efficient Primal-Dual Algorithm for Nonconvex Nonsmooth Distributed Optimization.",
                    "Robust and Private Learning of Halfspaces.",
                    "Minimax Model Learning.",
                    "On the Faster Alternating Least-Squares for CCA.",
                    "Exploiting Equality Constraints in Causal Inference.",
                    "Collaborative Classification from Noisy Labels.",
                    "Fenchel-Young Losses with Skewed Entropies for Class-posterior Probability Estimation.",
                    "Maximizing Agreements for Ranking, Clustering and Hierarchical Clustering via MAX-CUT.",
                    "Why did the distribution change?",
                    "Non-Volume Preserving Hamiltonian Monte Carlo and No-U-TurnSamplers.",
                    "Iterative regularization for convex regularizers.",
                    "Competing AI: How does competition feedback affect machine learning?",
                    "Stability and Risk Bounds of Iterative Hard Thresholding.",
                    "Novel Change of Measure Inequalities with Applications to PAC-Bayesian Bounds and Monte Carlo Estimation.",
                    "On the Convergence of Gradient Descent in GANs: MMD GAN As a Gradient Flow.",
                    "Wasserstein Random Forests and Applications in Heterogeneous Treatment Effects.",
                    "Improved Complexity Bounds in Wasserstein Barycenter Problem.",
                    "Sparse Algorithms for Markovian Gaussian Processes.",
                    "Generating Interpretable Counterfactual Explanations By Implicit Minimisation of Epistemic and Aleatoric Uncertainties.",
                    "Deep Neural Networks Are Congestion Games: From Loss Landscape to Wardrop Equilibrium and Beyond.",
                    "All of the Fairness for Edge Prediction with Optimal Transport.",
                    "γ-ABC: Outlier-Robust Approximate Bayesian Computation Based on a Robust Divergence Estimator.",
                    "Understanding and Mitigating Exploding Inverses in Invertible Neural Networks.",
                    "Online probabilistic label trees.",
                    "Nonparametric Estimation of Heterogeneous Treatment Effects: From Theory to Learning Algorithms.",
                    "DP-MERF: Differentially Private Mean Embeddings with RandomFeatures for Practical Privacy-preserving Data Generation.",
                    "Fork or Fail: Cycle-Consistent Training with Many-to-One Mappings.",
                    "Sparse Gaussian Processes Revisited: Bayesian Approaches to Inducing-Variable Approximations.",
                    "Free-rider Attacks on Model Aggregation in Federated Learning.",
                    "Reinforcement Learning in Parametric MDPs with Exponential Families.",
                    "Thresholded Adaptive Validation: Tuning the Graphical Lasso for Graph Recovery.",
                    "No-regret Algorithms for Multi-task Bayesian Optimization.",
                    "Explicit Regularization of Stochastic Gradient Methods through Duality.",
                    "Noisy Gradient Descent Converges to Flat Minima for Nonconvex Matrix Factorization.",
                    "CONTRA: Contrarian statistics for controlled variable selection.",
                    "Approximately Solving Mean Field Games via Entropy-Regularized Deep Reinforcement Learning.",
                    "Moment-Based Variational Inference for Stochastic Differential Equations.",
                    "PClean: Bayesian Data Cleaning at Scale with Domain-Specific Probabilistic Programming.",
                    "Adaptive wavelet pooling for convolutional neural networks.",
                    "The Minecraft Kernel: Modelling correlated Gaussian Processes in the Fourier domain.",
                    "Exponential Convergence Rates of Classification Errors on Learning with SGD and Random Features.",
                    "High-Dimensional Multi-Task Averaging and Application to Kernel Mean Embedding.",
                    "Counterfactual Representation Learning with Balancing Weights.",
                    "Gradient Descent in RKHS with Importance Labeling.",
                    "Learning with Gradient Descent and Weakly Convex Losses.",
                    "Off-policy Evaluation in Infinite-Horizon Reinforcement Learning with Latent Confounders.",
                    "Approximate Data Deletion from Machine Learning Models.",
                    "Budgeted and Non-Budgeted Causal Bandits.",
                    "Stability and Differential Privacy of Stochastic Gradient Descent for Pairwise Learning with Non-Smooth Loss.",
                    "Equitable and Optimal Transport with Multiple Agents.",
                    "A Variational Inference Approach to Learning Multivariate Wold Processes.",
                    "Active Online Learning with Hidden Shifting Domains.",
                    "No-Regret Algorithms for Private Gaussian Process Bandit Optimization.",
                    "The Teaching Dimension of Kernel Perceptron.",
                    "Quantum Tensor Networks, Stochastic Processes, and Weighted Automata.",
                    "Localizing Changes in High-Dimensional Regression Models.",
                    "On the Suboptimality of Negative Momentum for Minimax Optimization.",
                    "Neural Empirical Bayes: Source Distribution Estimation and its Applications to Simulation-Based Inference.",
                    "Corralling Stochastic Bandit Algorithms.",
                    "Context-Specific Likelihood Weighting.",
                    "Learning Matching Representations for Individualized Organ Transplantation Allocation.",
                    "Stochastic Gradient Descent Meets Distribution Regression.",
                    "Learning Contact Dynamics using Physically Structured Neural Networks.",
                    "Misspecification in Prediction Problems and Robustness via Improper Learning.",
                    "Rate-improved inexact augmented Lagrangian method for constrained nonconvex optimization.",
                    "Selective Classification via One-Sided Prediction.",
                    "Distributionally Robust Optimization for Deep Kernel Multiple Instance Learning.",
                    "vqSGD: Vector Quantized Stochastic Gradient Descent.",
                    "Smooth Bandit Optimization: Generalization to Holder Space.",
                    "List Learning with Attribute Noise.",
                    "High-Dimensional Feature Selection for Sample Efficient Treatment Effect Estimation.",
                    "Fractional moment-preserving initialization schemes for training deep neural networks.",
                    "Inductive Mutual Information Estimation: A Convex Maximum-Entropy Copula Approach.",
                    "Federated f-Differential Privacy.",
                    "Clustering multilayer graphs with missing nodes.",
                    "Implicit Regularization via Neural Feature Alignment.",
                    "Aggregating Incomplete and Noisy Rankings.",
                    "Quantifying the Privacy Risks of Learning High-Dimensional Graphical Models.",
                    "Optimal query complexity for private sequential learning against eavesdropping.",
                    "Mirrorless Mirror Descent: A Natural Derivation of Mirror Descent.",
                    "Differentiable Causal Discovery Under Unmeasured Confounding.",
                    "The Sample Complexity of Meta Sparse Regression.",
                    "A Theory of Multiple-Source Adaptation with Limited Target Labeled Data.",
                    "Group testing for connected communities.",
                    "Federated Learning with Compression: Unified Analysis and Sharp Guarantees.",
                    "Variational Autoencoder with Learned Latent Structure.",
                    "RankDistil: Knowledge Distillation for Ranking.",
                    "Variational Selective Autoencoder: Learning from Partially-Observed Heterogeneous Data.",
                    "On the Linear Convergence of Policy Gradient Methods for Finite MDPs.",
                    "Minimal enumeration of all possible total effects in a Markov equivalence class.",
                    "Differentially Private Weighted Sampling.",
                    "Learning the Truth From Only One Side of the Story.",
                    "Convergence of Gaussian-smoothed optimal transport distance with sub-gamma distributions and dependent samples.",
                    "Bayesian Inference with Certifiable Adversarial Robustness.",
                    "Hierarchical Clustering in General Metric Spaces using Approximate Nearest Neighbors.",
                    "Statistical Guarantees for Transformation Based Models with applications to Implicit Variational Inference.",
                    "Reinforcement Learning for Mean Field Games with Strategic Complementarities.",
                    "Cluster Trellis: Data Structures & Algorithms for Exact Inference in Hierarchical Clustering.",
                    "Beyond Marginal Uncertainty: How Accurately can Bayesian Regression Models Estimate Posterior Predictive Correlations?",
                    "On the Consistency of Metric and Non-Metric K-Medoids.",
                    "Non-Stationary Off-Policy Optimization.",
                    "Efficient Interpolation of Density Estimators.",
                    "A Statistical Perspective on Coreset Density Estimation.",
                    "Shuffled Model of Differential Privacy in Federated Learning.",
                    "CLAR: Contrastive Learning of Auditory Representations.",
                    "Designing Transportable Experiments Under S-admissability.",
                    "A Limited-Capacity Minimax Theorem for Non-Convex Games or: How I Learned to Stop Worrying about Mixed-Nash and Love Neural Nets.",
                    "Private optimization without constraint violations.",
                    "Direct Loss Minimization for Sparse Gaussian Processes.",
                    "Convergence and Accuracy Trade-Offs in Federated Learning and Meta-Learning.",
                    "Linear Models are Robust Optimal Under Strategic Behavior.",
                    "Matérn Gaussian Processes on Graphs.",
                    "Minimax Optimal Regression over Sobolev Spaces via Laplacian Regularization on Neighborhood Graphs.",
                    "Evaluating Model Robustness and Stability to Dataset Shift.",
                    "Continuum-Armed Bandits: A Function Space Perspective.",
                    "Regret-Optimal Filtering.",
                    "Evading the Curse of Dimensionality in Unconstrained Private GLMs.",
                    "One-Sketch-for-All: Non-linear Random Features from Compressed Linear Measurements.",
                    "Reinforcement Learning for Constrained Markov Decision Processes.",
                    "Principal Component Regression with Semirandom Observations via Matrix Completion.",
                    "Ridge Regression with Over-parametrized Two-Layer Networks Converge to Ridgelet Spectrum.",
                    "Right Decisions from Wrong Predictions: A Mechanism Design Alternative to Individual Calibration.",
                    "Sample Elicitation.",
                    "Random Coordinate Underdamped Langevin Monte Carlo.",
                    "Influence Decompositions For Neural Network Attribution.",
                    "Variational inference for nonlinear ordinary differential equations.",
                    "Approximation Algorithms for Orthogonal Non-negative Matrix Factorization.",
                    "Fast Adaptation with Linearized Neural Networks.",
                    "Efficient Methods for Structured Nonconvex-Nonconcave Min-Max Optimization.",
                    "A Change of Variables Method For Rectangular Matrix-Vector Products.",
                    "Provably Efficient Actor-Critic for Risk-Sensitive and Robust Adversarial RL: A Linear-Quadratic Case.",
                    "Fundamental Limits of Ridge-Regularized Empirical Risk Minimization in High Dimensions.",
                    "Bayesian Coresets: Revisiting the Nonconvex Optimization Perspective.",
                    "Causal Inference with Selectively Deconfounded Data.",
                    "Animal pose estimation from video data with a hierarchical von Mises-Fisher-Gaussian model.",
                    "Mirror Descent View for Neural Network Quantization.",
                    "Power of Hints for Online Learning with Movement Costs.",
                    "Stochastic Bandits with Linear Constraints.",
                    "Significance of Gradient Information in Bayesian Optimization.",
                    "Improving Adversarial Robustness via Unlabeled Out-of-Domain Data.",
                    "DAG-Structured Clustering by Nearest Neighbors.",
                    "Hindsight Expectation Maximization for Goal-conditioned Reinforcement Learning.",
                    "Follow Your Star: New Frameworks for Online Stochastic Matching with Known and Unknown Patience.",
                    "Location Trace Privacy Under Conditional Priors.",
                    "Large Scale K-Median Clustering for Stable Clustering Instances.",
                    "An Optimal Reduction of TV-Denoising to Adaptive Online Learning.",
                    "Differentially Private Monotone Submodular Maximization Under Matroid and Knapsack Constraints.",
                    "Federated Multi-armed Bandits with Personalization.",
                    "Hierarchical Inducing Point Gaussian Process for Inter-domian Observations.",
                    "Fast Statistical Leverage Score Approximation in Kernel Ridge Regression.",
                    "Dual Principal Component Pursuit for Learning a Union of Hyperplanes: Theory and Algorithms.",
                    "Accumulations of Projections - A Unified Framework for Random Sketches in Kernel Ridge Regression.",
                    "Robust hypothesis testing and distribution estimation in Hellinger distance.",
                    "Faster Kernel Interpolation for Gaussian Processes.",
                    "SDF-Bayes: Cautious Optimism in Safe Dose-Finding Clinical Trials with Drug Combinations and Heterogeneous Patient Groups.",
                    "Detection and Defense of Topological Adversarial Attacks on Graphs.",
                    "Training a Single Bandit Arm.",
                    "Learning Infinite-horizon Average-reward MDPs with Linear Function Approximation.",
                    "Multi-Armed Bandits with Cost Subsidy.",
                    "Causal Modeling with Stochastic Confounders.",
                    "The Multiple Instance Learning Gaussian Process Probit Model.",
                    "Beyond Perturbation Stability: LP Recovery Guarantees for MAP Inference on Noisy Stable Instances.",
                    "Meta Learning in the Continuous Time Limit.",
                    "Fast and Smooth Interpolation on Wasserstein Space.",
                    "Efficient Balanced Treatment Assignments for Experimentation.",
                    "Tensor Networks for Probabilistic Sequence Modeling.",
                    "Experimental Design for Regret Minimization in Linear Bandits.",
                    "DebiNet: Debiasing Linear Models with Nonlinear Overparameterized Neural Networks.",
                    "Dynamic Cutset Networks.",
                    "Associative Convolutional Layers.",
                    "Variable Selection with Rigorous Uncertainty Quantification using Deep Bayesian Neural Networks: Posterior Concentration and Bernstein-von Mises Phenomenon.",
                    "Kernel Interpolation for Scalable Online Gaussian Processes.",
                    "Nonlinear Projection Based Gradient Estimation for Query Efficient Blackbox Attacks.",
                    "Contrastive learning of strong-mixing continuous-time stochastic processes.",
                    "TenIPS: Inverse Propensity Sampling for Tensor Completion.",
                    "Sketch based Memory for Neural Networks.",
                    "Uniform Consistency of Cross-Validation Estimators for High-Dimensional Ridge Regression.",
                    "A Dynamical View on Optimization Algorithms of Overparameterized Neural Networks.",
                    "Semi-Supervised Aggregation of Dependent Weak Supervision Sources With Performance Guarantees.",
                    "Principal Subspace Estimation Under Information Diffusion.",
                    "A Hybrid Approximation to the Marginal Likelihood.",
                    "Prediction with Finitely many Errors Almost Surely.",
                    "Density of States Estimation for Out of Distribution Detection.",
                    "Product Manifold Learning.",
                    "Automatic Differentiation Variational Inference with Mixtures.",
                    "Fair for All: Best-effort Fairness Guarantees for Classification.",
                    "Taming heavy-tailed features by shrinkage.",
                    "Efficient Designs Of SLOPE Penalty Sequences In Finite Dimension.",
                    "Comparing the Value of Labeled and Unlabeled Data in Method-of-Moments Latent Variable Estimation.",
                    "Homeomorphic-Invariance of EM: Non-Asymptotic Convergence in KL Divergence for Exponential Families via Mirror Descent.",
                    "Provably Efficient Safe Exploration via Primal-Dual Policy Optimization.",
                    "Understanding Robustness in Teacher-Student Setting: A New Perspective.",
                    "Non-asymptotic Performance Guarantees for Neural Estimation of f-Divergences.",
                    "Finite-Sample Regret Bound for Distributionally Robust Offline Tabular Reinforcement Learning.",
                    "Online Model Selection for Reinforcement Learning with Function Approximation.",
                    "Sampling in Combinatorial Spaces with SurVAE Flow Augmented MCMC.",
                    "Tight Differential Privacy for Discrete-Valued Mechanisms and for the Subsampled Gaussian Mechanism Using FFT.",
                    "A Parameter-Free Algorithm for Misspecified Linear Contextual Bandits.",
                    "Good Classifiers are Abundant in the Interpolating Regime.",
                    "No-Regret Reinforcement Learning with Heavy-Tailed Rewards.",
                    "A Spectral Analysis of Dot-product Kernels.",
                    "Towards Flexible Device Participation in Federated Learning.",
                    "Active Learning under Label Shift.",
                    "Tracking Regret Bounds for Online Submodular Optimization.",
                    "Offline detection of change-points in the mean for stationary graph signals.",
                    "Hyperbolic graph embedding with enhanced semi-implicit variational inference.",
                    "Rao-Blackwellised parallel MCMC.",
                    "Improving KernelSHAP: Practical Shapley Value Estimation Using Linear Regression.",
                    "Calibrated Adaptive Probabilistic ODE Solvers.",
                    "Online Robust Control of Nonlinear Systems with Large Uncertainty.",
                    "Probabilistic Sequential Matrix Factorization.",
                    "An Analysis of LIME for Text Data.",
                    "Wyner-Ziv Estimators: Efficient Distributed Mean Estimation with Side-Information.",
                    "Scalable Gaussian Process Variational Autoencoders.",
                    "Causal Autoregressive Flows.",
                    "Explore the Context: Optimal Data Collection for Context-Conditional Dynamics Models.",
                    "A Kernel-Based Approach to Non-Stationary Reinforcement Learning in Metric Spaces.",
                    "Spectral Tensor Train Parameterization of Deep Learning Layers.",
                    "Local SGD: Unified Theory and New Efficient Methods.",
                    "Towards a Theoretical Understanding of the Robustness of Variational Autoencoders.",
                    "Learn to Expect the Unexpected: Probably Approximately Correct Domain Generalization.",
                    "The Base Measure Problem and its Solution.",
                    "Revisiting Projection-free Online Learning: the Strongly Convex Case.",
                    "A Theoretical Characterization of Semi-supervised Learning with Self-training for Gaussian Mixture Models.",
                    "Logistic Q-Learning.",
                    "Graph Community Detection from Coarse Measurements: Recovery Conditions for the Coarsened Weighted Stochastic Block Model.",
                    "Sequential Random Sampling Revisited: Hidden Shuffle Method.",
                    "Dirichlet Pruning for Convolutional Neural Networks.",
                    "Couplings for Multinomial Hamiltonian Monte Carlo.",
                    "Learning Bijective Feature Maps for Linear ICA.",
                    "Diagnostic Uncertainty Calibration: Towards Reliable Machine Predictions in Medical Domain.",
                    "One-pass Stochastic Gradient Descent in overparametrized two-layer neural networks.",
                    "On the Memory Mechanism of Tensor-Power Recurrent Models.",
                    "Instance-Wise Minimax-Optimal Algorithms for Logistic Bandits.",
                    "Causal Inference under Networked Interference and Intervention Policy Enhancement.",
                    "GANs with Conditional Independence Graphs: On Subadditivity of Probability Divergences.",
                    "Latent Gaussian process with composite likelihoods and numerical quadrature.",
                    "Deep Generative Missingness Pattern-Set Mixture Models.",
                    "Minimax Estimation of Laplacian Constrained Precision Matrices.",
                    "A Scalable Gradient Free Method for Bayesian Experimental Design with Implicit Models.",
                    "Distribution Regression for Sequential Data.",
                    "Completing the Picture: Randomized Smoothing Suffers from the Curse of Dimensionality for a Large Family of Distributions.",
                    "Direct-Search for a Class of Stochastic Min-Max Problems.",
                    "Self-Supervised Steering Angle Prediction for Vehicle Control Using Visual Odometry.",
                    "Learning Temporal Point Processes with Intermittent Observations.",
                    "On the number of linear functions composing deep neural network: Towards a refined definition of neural networks complexity.",
                    "Robust Learning under Strong Noise via SQs.",
                    "Recovery Guarantees for Kernel-based Clustering under Non-parametric Mixture Models.",
                    "Convergence Properties of Stochastic Hypergradients.",
                    "Entropy Partial Transport with Tree Metrics: Theory and Practice.",
                    "Combinatorial Gaussian Process Bandits with Probabilistically Triggered Arms.",
                    "Differentiable Divergences Between Time Series.",
                    "Local Competition and Stochasticity for Adversarial Robustness in Deep Learning.",
                    "Differentiating the Value Function by using Convex Duality.",
                    "Rate-Regularization and Generalization in Variational Autoencoders.",
                    "Asymptotics of Ridge(less) Regression under General Source Condition.",
                    "Longitudinal Variational Autoencoder.",
                    "An Adaptive-MCMC Scheme for Setting Trajectory Lengths in Hamiltonian Monte Carlo.",
                    "Model updating after interventions paradoxically introduces bias.",
                    "On Multilevel Monte Carlo Unbiased Gradient Estimation for Deep Latent Variable Models.",
                    "Flow-based Alignment Approaches for Probability Measures in Different Spaces.",
                    "LENA: Communication-Efficient Distributed Learning with Self-Triggered Gradient Uploads.",
                    "Learning Shared Subgraphs in Ising Model Pairs.",
                    "Faster & More Reliable Tuning of Neural Networks: Bayesian Optimization with Importance Sampling.",
                    "Bayesian Active Learning by Soft Mean Objective Cost of Uncertainty.",
                    "Revisiting the Role of Euler Numerical Integration on Acceleration and Stability in Convex Optimization.",
                    "Improved Exploration in Factored Average-Reward MDPs.",
                    "Toward a General Theory of Online Selective Sampling: Trading Off Mistakes and Queries.",
                    "Regularized ERM on random subspaces.",
                    "On the Importance of Hyperparameter Optimization for Model-based Reinforcement Learning.",
                    "Meta-Learning Divergences for Variational Inference.",
                    "Hidden Cost of Randomized Smoothing.",
                    "Critical Parameters for Scalable Distributed Learning with Large Batches and Asynchronous Updates.",
                    "Improving Classifier Confidence using Lossy Label-Invariant Transformations.",
                    "Graph Gamma Process Linear Dynamical Systems.",
                    "Does Invariant Risk Minimization Capture Invariance?",
                    "A unified view of likelihood ratio and reparameterization gradients.",
                    "A Linearly Convergent Algorithm for Decentralized Optimization: Sending Less Bits for Free!"
                ]
            }
        ]
    },
    {
        "year": "2020",
        "name": "23rd AISTATS 2020",
        "info": "Online [Palermo, Sicily, Italy]",
        "venues": [
            {
                "sub_name_abbr": "conf/aistats/2020",
                "sub_name": "The 23rd International Conference on Artificial Intelligence and Statistics, AISTATS 2020, 26-28 August 2020, Online [Palermo, Sicily, Italy].",
                "count": 423,
                "papers": [
                    "Linearly Convergent Frank-Wolfe without Line-Search.",
                    "Guarantees of Stochastic Greedy Algorithms for Non-monotone Submodular Maximization with Cardinality Constraint.",
                    "On Maximization of Weakly Modular Functions: Guarantees of Multi-stage Algorithms, Tractability, and Hardness.",
                    "Adaptive Trade-Offs in Off-Policy Learning.",
                    "Conditional Importance Sampling for Off-Policy Learning.",
                    "Multiplicative Gaussian Particle Filter.",
                    "Stretching the Effectiveness of MLE from Accuracy to Bias for Pairwise Comparisons.",
                    "Fast and Accurate Ranking Regression.",
                    "Tight Analysis of Privacy and Utility Tradeoff in Approximate Differential Privacy.",
                    "Long-and Short-Term Forecasting for Portfolio Selection with Transaction Costs.",
                    "Nonparametric Sequential Prediction While Deep Learning the Kernel.",
                    "Improving Maximum Likelihood Training for Text Generation with Density Ratio Estimation.",
                    "A Double Residual Compression Algorithm for Efficient Distributed Learning.",
                    "Asynchronous Gibbs Sampling.",
                    "Learning Fair Representations for Kernel Models.",
                    "A Nonparametric Off-Policy Policy Gradient.",
                    "Non-Parametric Calibration for Classification.",
                    "Minimax Testing of Identity to a Reference Ergodic Markov Chain.",
                    "A Linear-time Independence Criterion Based on a Finite Basis Approximation.",
                    "Minimax Bounds for Structured Prediction Based on Factor Graphs.",
                    "On the Convergence of SARAH and Beyond.",
                    "Uncertainty in Neural Networks: Approximately Bayesian Ensembling.",
                    "LIBRE: Learning Interpretable Boolean Rule Ensembles.",
                    "Marginal Densities, Factor Graph Duality, and High-Temperature Series Expansions.",
                    "Neighborhood Growth Determines Geometric Priors for Relational Representation Learning.",
                    "Fair Decisions Despite Imperfect Predictions.",
                    "A Characterization of Mean Squared Error for Estimator with Bagging.",
                    "Uncertainty Quantification for Sparse Deep Learning.",
                    "Minimizing Dynamic Regret and Adaptive Regret Simultaneously.",
                    "A Stein Goodness-of-fit Test for Directional Distributions.",
                    "Unsupervised Neural Universal Denoiser for Finite-Input General-Output Noisy Channel.",
                    "Leave-One-Out Cross-Validation for Bayesian Model Comparison in Large Data.",
                    "Robust Importance Weighting for Covariate Shift.",
                    "Adaptive Online Kernel Sampling for Vertex Classification.",
                    "A Hybrid Stochastic Policy Gradient Algorithm for Reinforcement Learning.",
                    "Stopping criterion for active learning based on deterministic generalization bounds.",
                    "Ivy: Instrumental Variable Synthesis for Causal Inference.",
                    "High Dimensional Robust Sparse Regression.",
                    "Nested-Wasserstein Self-Imitation Learning for Sequence Generation.",
                    "Greed Meets Sparsity: Understanding and Improving Greedy Coordinate Descent for Sparse Optimization.",
                    "Recommendation on a Budget: Column Space Recovery from Partially Observed Entries with Random or Active Sampling.",
                    "Fast Noise Removal for k-Means Clustering.",
                    "Sketching Transformed Matrices with Applications to Natural Language Processing.",
                    "Unconditional Coresets for Regularized Loss Minimization.",
                    "ASAP: Architecture Search, Anneal and Prune.",
                    "Understanding Generalization in Deep Learning via Tensor Methods.",
                    "Accelerating Gradient Boosting Machines.",
                    "Online Binary Space Partitioning Forests.",
                    "Sparse Hilbert-Schmidt Independence Criterion Regression.",
                    "Sharp Thresholds of the Information Cascade Fragility Under a Mismatched Model.",
                    "Optimal sampling in unbiased active learning.",
                    "The Area of the Convex Hull of Sampled Curves: a Robust Functional Statistical Depth measure.",
                    "Diameter-based Interactive Structure Discovery.",
                    "Utility/Privacy Trade-off through the lens of Optimal Transport.",
                    "A Lyapunov analysis for accelerated gradient methods: from deterministic to stochastic case.",
                    "Interpretable Deep Gaussian Processes with Moments.",
                    "Approximate Inference in Discrete Distributions with Monte Carlo Tree Search and Value Functions.",
                    "Accelerated Bayesian Optimisation through Weight-Prior Tuning.",
                    "Variance Reduction for Evolution Strategies via Structured Control Variates.",
                    "Optimization of Graph Total Variation via Active-Set-based Combinatorial Reconditioning.",
                    "Ordered SGD: A New Stochastic Optimization Framework for Empirical Risk Minimization.",
                    "A Unified Theory of SGD: Variance Reduction, Sampling, Quantization and Coordinate Descent.",
                    "Entropy Weighted Power k-Means Clustering.",
                    "Identifying and Correcting Label Bias in Machine Learning.",
                    "AsyncQVI: Asynchronous-Parallel Q-Value Iteration for Discounted Markov Decision Processes with Near-Optimal Sample Complexity.",
                    "Active Community Detection with Maximal Expected Model Change.",
                    "RCD: Repetitive causal discovery of linear non-Gaussian acyclic models with latent confounders.",
                    "A Simple Approach for Non-stationary Linear Bandits.",
                    "Distributionally Robust Formulation and Model Selection for the Graphical Lasso.",
                    "Efficient Spectrum-Revealing CUR Matrix Decomposition.",
                    "Graph DNA: Deep Neighborhood Aware Graph Encoding for Collaborative Filtering.",
                    "Characterization of Overlap in Observational Studies.",
                    "Modular Block-diagonal Curvature Approximations for Feedforward Architectures.",
                    "A Unified Statistically Efficient Estimation Framework for Unnormalized Models.",
                    "More Powerful Selective Kernel Tests for Feature Selection.",
                    "Imputation estimators for unnormalized models with missing data.",
                    "Wasserstein Style Transfer.",
                    "Elimination of All Bad Local Minima in Deep Learning.",
                    "Fully Decentralized Joint Learning of Personalized Models and Collaboration Graphs.",
                    "Formal Limitations on the Measurement of Mutual Information.",
                    "Scalable Feature Selection for (Multitask) Gradient Boosted Trees.",
                    "Model-Agnostic Counterfactual Explanations for Consequential Decisions.",
                    "Obfuscation via Information Density Estimation.",
                    "Linear Dynamics: Clustering without identification.",
                    "Low-rank regularization and solution uniqueness in over-parameterized matrix sensing.",
                    "Robustness for Non-Parametric Classification: A Generic Attack and Defense.",
                    "Contextual Online False Discovery Rate Control.",
                    "Sequential no-Substitution k-Median-Clustering.",
                    "Robust Learning from Discriminative Feature Feedback.",
                    "Hermitian matrices for clustering directed graphs: insights and applications.",
                    "Kernel Conditional Density Operators.",
                    "Learning Overlapping Representations for the Estimation of Individualized Treatment Effects.",
                    "Additive Tree-Structured Covariance Function for Conditional Parameter Spaces in Bayesian Optimization.",
                    "Asymptotic Analysis of Sampling Estimators for Randomized Numerical Linear Algebra Algorithms.",
                    "The Fast Loaded Dice Roller: A Near-Optimal Exact Sampler for Discrete Probability Distributions.",
                    "A Fast Anderson-Chebyshev Acceleration for Nonlinear Optimization.",
                    "Black Box Submodular Maximization: Discrete and Continuous Settings.",
                    "Corruption-Tolerant Gaussian Process Bandit Optimization.",
                    "On the Convergence Theory of Gradient-Based Model-Agnostic Meta-Learning Algorithms.",
                    "Alternating Minimization Converges Super-Linearly for Mixed Linear Regression.",
                    "Learning Gaussian Graphical Models via Multiplicative Weights.",
                    "Mitigating Overfitting in Supervised Classification from Two Unlabeled Datasets: A Consistent Risk Correction Approach.",
                    "Infinitely deep neural networks as diffusion processes.",
                    "Stable behaviour of infinitely wide deep neural networks.",
                    "Neural Topic Model with Attention for Supervised Learning.",
                    "Causal Mosaic: Cause-Effect Inference via Nonlinear ICA and Ensemble Method.",
                    "Stochastic Bandits with Delay-Dependent Payoffs.",
                    "Risk Bounds for Learning Multiple Components with Permutation-Invariant Losses.",
                    "Balancing Learning Speed and Stability in Policy Gradient via Adaptive Exploration.",
                    "Independent Subspace Analysis for Unsupervised Learning of Disentangled Representations.",
                    "A Practical Algorithm for Multiplayer Bandits when Arm Means Vary Among Players.",
                    "Regularity as Regularization: Smooth and Strongly Convex Brenier Potentials in Optimal Transport.",
                    "On Generalization Bounds of a Family of Recurrent Neural Networks.",
                    "Simulator Calibration under Covariate Shift with Kernels.",
                    "Convergence Rates of Gradient Descent and MM Algorithms for Bradley-Terry Models.",
                    "A Locally Adaptive Bayesian Cubature Method.",
                    "Fast and Bayes-consistent nearest neighbors.",
                    "Explaining the Explainer: A First Theoretical Analysis of LIME.",
                    "A Continuous-time Perspective for Modeling Acceleration in Riemannian Optimization.",
                    "Deep Active Learning: Unified and Principled Method for Query and Training.",
                    "Sparse and Low-rank Tensor Estimation via Cubic Sketchings.",
                    "A nonasymptotic law of iterated logarithm for general M-estimators.",
                    "Robust Stackelberg buyers in repeated auctions.",
                    "Radial Bayesian Neural Networks: Beyond Discrete Support In Large-Scale Bayesian Deep Learning.",
                    "Practical Nonisotropic Monte Carlo Sampling in High Dimensions via Determinantal Point Processes.",
                    "Fast and Furious Convergence: Stochastic Second Order Methods under Interpolation.",
                    "Two-sample Testing Using Deep Learning.",
                    "RATQ: A Universal Fixed-Length Quantizer for Stochastic Optimization.",
                    "Rep the Set: Neural Networks for Learning Set Representations.",
                    "A Multiclass Classification Approach to Label Ranking.",
                    "Conservative Exploration in Reinforcement Learning.",
                    "A principled approach for generating adversarial images under non-smooth dissimilarity metrics.",
                    "Regularization via Structural Label Smoothing.",
                    "Communication-Efficient Asynchronous Stochastic Frank-Wolfe over Nuclear-norm Balls.",
                    "Linear Convergence of Adaptive Stochastic Gradient Descent.",
                    "Contextual Combinatorial Volatile Multi-armed Bandit with Adaptive Discretization.",
                    "A Unified Analysis of Extra-gradient and Optimistic Gradient Methods for Saddle Point Problems: Proximal Point Approach.",
                    "Bandit Convex Optimization in Non-stationary Environments.",
                    "Decentralized Multi-player Multi-armed Bandits with No Collision Information.",
                    "Bayesian Image Classification with Deep Convolutional Gaussian Processes.",
                    "Optimizing Millions of Hyperparameters by Implicit Differentiation.",
                    "A Topology Layer for Machine Learning.",
                    "Differentiable Feature Selection by Discrete Relaxation.",
                    "Private Protocols for U-Statistics in the Local Model and Beyond.",
                    "Automatic Differentiation of Some First-Order Methods in Parametric Optimization.",
                    "DYNOTEARS: Structure Learning from Time-Series Data.",
                    "Unsupervised Hierarchy Matching with Optimal Transport over Hyperbolic Spaces.",
                    "Competing Bandits in Matching Markets.",
                    "Revisiting the Landscape of Matrix Factorization.",
                    "Value Preserving State-Action Abstractions.",
                    "GP-VAE: Deep Probabilistic Time Series Imputation.",
                    "Communication-Efficient Distributed Optimization in Networks with Gradient Tracking and Variance Reduction.",
                    "Optimized Score Transformation for Fair Classification.",
                    "Variational Autoencoders for Sparse and Overdispersed Discrete Data.",
                    "Spatio-temporal alignments: Optimal transport through space and time.",
                    "Accelerating Smooth Games by Manipulating Spectral Shapes.",
                    "Langevin Monte Carlo without smoothness.",
                    "EM Converges for a Mixture of Many Linear Regressions.",
                    "Locally Accelerated Conditional Gradients.",
                    "Coping With Simulators That Don't Always Return.",
                    "Post-Estimation Smoothing: A Simple Baseline for Learning with Side Information.",
                    "Equalized odds postprocessing under imperfect group information.",
                    "The True Sample Complexity of Identifying Good Arms.",
                    "Validated Variational Inference via Practical Posterior Error Bounds.",
                    "A Rule for Gradient Estimator Selection, with an Application to Variational Inference.",
                    "Naive Feature Selection: Sparsity in Naive Bayes.",
                    "Fixed-confidence guarantees for Bayesian best-arm identification.",
                    "Learning Hierarchical Interactions at Scale: A Convex Optimization Approach.",
                    "OSOM: A simultaneously optimal algorithm for multi-armed and linear contextual bandits.",
                    "Optimization Methods for Interpretable Differentiable Decision Trees Applied to Reinforcement Learning.",
                    "Sharp Analysis of Expectation-Maximization for Weakly Identifiable Models.",
                    "Stochastic Particle-Optimization Sampling and the Non-Asymptotic Convergence Theory.",
                    "Dynamical Systems Theory for Causal Inference with Application to Synthetic Control Methods.",
                    "RelatIF: Identifying Explanatory Training Samples via Relative Influence.",
                    "Ensemble Gaussian Processes with Spectral Features for Online Interactive Learning with Scalability.",
                    "Distributionally Robust Bayesian Quadrature Optimization.",
                    "Sparse Orthogonal Variational Inference for Gaussian Processes.",
                    "The Sylvester Graphical Lasso (SyGlasso).",
                    "Frequentist Regret Bounds for Randomized Least-Squares Value Iteration.",
                    "DAve-QN: A Distributed Averaged Quasi-Newton Method with Local Superlinear Convergence Rate.",
                    "Discrete Action On-Policy Learning with Action-Value Critic.",
                    "Old Dog Learns New Tricks: Randomized UCB for Bandit Problems.",
                    "Thompson Sampling for Linearly Constrained Bandits.",
                    "Sample Complexity of Reinforcement Learning using Linearly Combined Model Ensembles.",
                    "FedPAQ: A Communication-Efficient Federated Learning Method with Periodic Averaging and Quantization.",
                    "Online Learning Using Only Peer Prediction.",
                    "Deontological Ethics By Monotonicity Shape Constraints.",
                    "On Random Subsampling of Gaussian Process Regression: A Graphon-Based Analysis.",
                    "Randomized Exploration in Generalized Linear Bandits.",
                    "Assessing Local Generalization Capability in Deep Models.",
                    "Fast Algorithms for Computational Optimal Transport and Wasserstein Barycenter.",
                    "Adaptive Discretization for Evaluation of Probabilistic Cost Functions.",
                    "Censored Quantile Regression Forest.",
                    "Choosing the Sample with Lowest Loss makes SGD Robust.",
                    "Learning with minibatch Wasserstein : asymptotic and gradient properties.",
                    "AMAGOLD: Amortized Metropolis Adjustment for Efficient Stochastic Gradient MCMC.",
                    "On casting importance weighted autoencoder to an EM algorithm to learn deep generative models.",
                    "Conditional Linear Regression.",
                    "Distributionally Robust Bayesian Optimization.",
                    "On the optimality of kernels for high-dimensional clustering.",
                    "Improved Regret Bounds for Projection-free Bandit Convex Optimization.",
                    "Variational Autoencoders and Nonlinear ICA: A Unifying Framework.",
                    "Online Learning with Continuous Variations: Dynamic Regret and Reductions.",
                    "An Optimal Algorithm for Bandit Convex Optimization with Strongly-Convex and Smooth Loss.",
                    "A Deep Generative Model for Fragment-Based Molecule Generation.",
                    "Deep Structured Mixtures of Gaussian Processes.",
                    "Noisy-Input Entropy Search for Efficient Robust Bayesian Optimization.",
                    "Dependent randomized rounding for clustering and partition systems with knapsack constraints.",
                    "Domain-Liftability of Relational Marginal Polytopes.",
                    "Derivative-Free & Order-Robust Optimisation.",
                    "Stepwise Model Selection for Sequence Prediction via Deep Kernel Learning.",
                    "Dynamic content based ranking.",
                    "Fairness Evaluation in Presence of Biased Noisy Labels.",
                    "Calibrated Surrogate Maximization of Linear-fractional Utility in Binary Classification.",
                    "Decentralized gradient methods: does topology matter?",
                    "Truly Batch Model-Free Inverse Reinforcement Learning about Multiple Intentions.",
                    "Beyond exploding and vanishing gradients: analysing RNN training using attractors and smoothness.",
                    "Accelerated Primal-Dual Algorithms for Distributed Smooth Convex Optimization over Networks.",
                    "Stochastic Linear Contextual Bandits with Diverse Contexts.",
                    "Purifying Interaction Effects with the Functional ANOVA: An Efficient Algorithm for Recovering Identifiable Additive Models.",
                    "Balanced Off-Policy Evaluation in General Action Spaces.",
                    "Approximate Cross-Validation in High Dimensions with Guarantees.",
                    "How fine can fine-tuning be? Learning efficient language models.",
                    "Interpretable Companions for Black-Box Models.",
                    "A PTAS for the Bayesian Thresholding Bandit Problem.",
                    "Learning Rate Adaptation for Differentially Private Learning.",
                    "Thresholding Graph Bandits with GrAPL.",
                    "Bandit optimisation of functions in the Matérn kernel RKHS.",
                    "Hypothesis Testing Interpretations and Renyi Differential Privacy.",
                    "Lipschitz Continuous Autoencoders in Application to Anomaly Detection.",
                    "Private k-Means Clustering with Stability Assumptions.",
                    "Momentum in Reinforcement Learning.",
                    "A Primal-Dual Solver for Large-Scale Tracking-by-Assignment.",
                    "Precision-Recall Curves Using Information Divergence Frontiers.",
                    "Computing Tight Differential Privacy Guarantees Using FFT.",
                    "Hyperbolic Manifold Regression.",
                    "Approximate Inference with Wasserstein Gradient Flows.",
                    "Thresholding Bandit Problem with Both Duels and Pulls.",
                    "GAIT: A Geometric Approach to Information Theory.",
                    "On Thompson Sampling for Smoother-than-Lipschitz Bandits.",
                    "Safe-Bayesian Generalized Linear Regression.",
                    "Efficient Distributed Hessian Free Algorithm for Large-scale Empirical Risk Minimization via Accumulating Sample Strategy.",
                    "Contextual Constrained Learning for Dose-Finding Clinical Trials.",
                    "Support recovery and sup-norm convergence rates for sparse pivotal estimation.",
                    "Learning Entangled Single-Sample Distributions via Iterative Trimming.",
                    "The Quantile Snapshot Scan: Comparing Quantiles of Spatial Data from Two Snapshots in Time.",
                    "Statistical guarantees for local graph clustering.",
                    "Learning High-dimensional Gaussian Graphical Models under Total Positivity without Adjustment of Tuning Parameters.",
                    "On Pruning for Score-Based Bayesian Network Structure Learning.",
                    "Statistical and Computational Rates in Graph Logistic Regression.",
                    "Kernels over Sets of Finite Sets using RKHS Embeddings, with Application to Bayesian (Combinatorial) Optimization.",
                    "Rk-means: Fast Clustering for Relational Data.",
                    "Statistical Estimation of the Poincaré constant and Application to Sampling Multimodal Distributions.",
                    "Integrals over Gaussians under Linear Domain Constraints.",
                    "Taxonomy of Dual Block-Coordinate Ascent Methods for Discrete Energy Minimization.",
                    "PersLay: A Neural Network Layer for Persistence Diagrams and New Graph Topological Signatures.",
                    "MAP Inference for Customized Determinantal Point Processes via Maximum Inner Product Search.",
                    "Why Non-myopic Bayesian Optimization is Promising and How Far Should We Look-ahead? A Study via Rollout.",
                    "Robust Optimisation Monte Carlo.",
                    "Guaranteed Validity for Empirical Approaches to Adaptive Data Analysis.",
                    "Fast Markov chain Monte Carlo algorithms via Lie groups.",
                    "Efficient Planning under Partial Observability with Unnormalized Q Functions and Spectral Learning.",
                    "A Tight and Unified Analysis of Gradient-Based Methods for a Whole Spectrum of Differentiable Games.",
                    "Doubly Sparse Variational Gaussian Processes.",
                    "Online Convex Optimization with Perturbed Constraints: Optimal Rates against Stronger Benchmarks.",
                    "Persistence Enhanced Graph Neural Network.",
                    "Feature relevance quantification in explainable AI: A causal problem.",
                    "Neural Decomposition: Functional ANOVA with Variational Autoencoders.",
                    "BasisVAE: Translation-invariant feature-level clustering with Variational Autoencoders.",
                    "How To Backdoor Federated Learning.",
                    "Exploiting Categorical Structure Using Tree-Based Methods.",
                    "A Unified Stochastic Gradient Approach to Designing Bayesian-Optimal Experiments.",
                    "Mixed Strategies for Robust Optimization of Unknown Objectives.",
                    "Functional Gradient Boosting for Learning Residual-like Networks with Statistical Guarantees.",
                    "Solving Discounted Stochastic Two-Player Games with Near-Optimal Time and Sample Complexity.",
                    "Convergence Rates of Smooth Message Passing with Rounding in Entropy-Regularized MAP Inference.",
                    "Finite-Time Error Bounds for Biased Stochastic Approximation with Applications to Q-Learning.",
                    "Automated Augmented Conjugate Inference for Non-conjugate Gaussian Process Models.",
                    "Bayesian Reinforcement Learning via Deep, Sparse Sampling.",
                    "Deterministic Decoding for Discrete Data in Variational Autoencoders.",
                    "Monotonic Gaussian Process Flows.",
                    "Flexible distribution-free conditional predictive bands using density estimators.",
                    "Variational Integrator Networks for Physically Structured Embeddings.",
                    "Black-Box Inference for Non-Linear Latent Force Models.",
                    "Importance Sampling via Local Sensitivity.",
                    "Convergence Analysis of Block Coordinate Algorithms with Determinantal Sampling.",
                    "Bisect and Conquer: Hierarchical Clustering via Max-Uncut Bisection.",
                    "Laplacian-Regularized Graph Bandits: Algorithms and Theoretical Analysis.",
                    "Enriched mixtures of generalised Gaussian process experts.",
                    "Causal Bayesian Optimization.",
                    "Linear predictor on linearly-generated data with missing values: non consistency and solutions.",
                    "A Novel Confidence-Based Algorithm for Structured Bandits.",
                    "Quantitative stability of optimal transport maps and linearization of the 2-Wasserstein space.",
                    "Bayesian experimental design using regularized determinantal point processes.",
                    "Non-exchangeable feature allocation models with sublinear growth of the feature sizes.",
                    "Calibrated Prediction with Covariate Shift via Unsupervised Domain Adaptation.",
                    "Inference of Dynamic Graph Changes for Functional Connectome.",
                    "An approximate KLD based experimental design for models with intractable likelihoods.",
                    "Almost-Matching-Exactly for Treatment Effect Estimation under Network Interference.",
                    "\"Bring Your Own Greedy\"+Max: Near-Optimal 1/2-Approximations for Submodular Knapsack.",
                    "Sample complexity bounds for localized sketching.",
                    "An Optimal Algorithm for Adversarial Bandits with Arbitrary Delays.",
                    "Learning Dynamic and Personalized Comorbidity Networks from Event Data using Deep Diffusion Processes.",
                    "Tensorized Random Projections.",
                    "Nonparametric Estimation in the Dynamic Bradley-Terry Model.",
                    "Gaussian-Smoothed Optimal Transport: Metric Structure and Statistical Efficiency.",
                    "Learning in Gated Neural Networks.",
                    "Validation of Approximate Likelihood and Emulator Models for Computationally Intensive Simulations.",
                    "Fenchel Lifted Networks: A Lagrange Relaxation of Neural Network Training.",
                    "Adversarial Robustness Guarantees for Classification with Gaussian Processes.",
                    "Causal inference in degenerate systems: An impossibility result.",
                    "ChemBO: Bayesian Optimization of Small Organic Molecules with Synthesizable Recommendations.",
                    "Local Differential Privacy for Sampling.",
                    "Learning Sparse Nonparametric DAGs.",
                    "Minimax Rank-$1$ Matrix Factorization.",
                    "Context Mover's Distance & Barycenters: Optimal Transport of Contexts for Building Representations.",
                    "Data Generation for Neural Programming by Example.",
                    "An Inverse-free Truncated Rayleigh-Ritz Method for Sparse Generalized Eigenvalue Problem.",
                    "The Gossiping Insert-Eliminate Algorithm for Multi-Agent Bandits.",
                    "Understanding the Effects of Batching in Online Active Learning.",
                    "Adaptive multi-fidelity optimization with fast learning rates.",
                    "On the interplay between noise and curvature and its effect on optimization and generalization.",
                    "A Reduction from Reinforcement Learning to No-Regret Online Learning.",
                    "The Implicit Regularization of Ordinary Least Squares Ensembles.",
                    "Adaptive Exploration in Linear Contextual Bandit.",
                    "A Three Sample Hypothesis Test for Evaluating Generative Models.",
                    "Learning Ising and Potts Models with Latent Variables.",
                    "Learning piecewise Lipschitz functions in changing environments.",
                    "POPCORN: Partially Observed Prediction Constrained Reinforcement Learning.",
                    "Optimal Approximation of Doubly Stochastic Matrices.",
                    "The Expressive Power of a Class of Normalizing Flow Models.",
                    "Screening Data Points in Empirical Risk Minimization via Ellipsoidal Regions and Safe Loss Functions.",
                    "An Empirical Study of Stochastic Gradient Descent with Structured Covariance Noise.",
                    "Amortized Inference of Variational Bounds for Learning Noisy-OR.",
                    "Gain with no Pain: Efficiency of Kernel-PCA by Nyström Sampling.",
                    "Logistic regression with peer-group effects via inference in higher-order Ising models.",
                    "An Asymptotic Rate for the LASSO Loss.",
                    "Constructing a provably adversarially-robust classifier from a high accuracy one.",
                    "Distributed, partially collapsed MCMC for Bayesian Nonparametrics.",
                    "Quantized Frank-Wolfe: Faster Optimization, Lower Communication, and Projection Free.",
                    "A Farewell to Arms: Sequential Reward Maximization on a Budget with a Giving Up Option.",
                    "Prophets, Secretaries, and Maximizing the Probability of Choosing the Best.",
                    "A Wasserstein Minimum Velocity Approach to Learning Unnormalized Models.",
                    "Sharp Asymptotics and Optimal Performance for Inference in Binary Models.",
                    "A Theoretical Case Study of Structured Variational Inference for Community Detection.",
                    "Orthogonal Gradient Descent for Continual Learning.",
                    "Hamiltonian Monte Carlo Swindles.",
                    "A single algorithm for both restless and rested rotting bandits.",
                    "Adversarial Robustness of Flow-Based Generative Models.",
                    "The Power of Batching in Multiple Hypothesis Testing.",
                    "Adversarial Risk Bounds through Sparsity based Compression.",
                    "Learning spectrograms with convolutional spectral kernels.",
                    "Federated Heavy Hitters Discovery with Differential Privacy.",
                    "Online Batch Decision-Making with High-Dimensional Covariates.",
                    "Sample Complexity of Estimating the Policy Gradient for Nearly Deterministic Dynamical Systems.",
                    "Scalable Gradients for Stochastic Differential Equations.",
                    "Understanding the Intrinsic Robustness of Image Distributions using Conditional Generative Models.",
                    "Uncertainty Quantification for Deep Context-Aware Mobile Activity Recognition and Unknown Context Discovery.",
                    "Learnable Bernoulli Dropout for Bayesian Deep Learning.",
                    "General Identification of Dynamic Treatment Regimes Under Interference.",
                    "Gaussian Sketching yields a J-L Lemma in RKHS.",
                    "Wasserstein Smoothing: Certified Robustness against Wasserstein Adversarial Attacks.",
                    "Asymptotically Efficient Off-Policy Evaluation for Tabular Reinforcement Learning.",
                    "Learning Dynamic Hierarchical Topic Graph with Graph Convolutional Network for Document Classification.",
                    "Differentiable Causal Backdoor Discovery.",
                    "Stochastic Recursive Variance-Reduced Cubic Regularization Methods.",
                    "Better Long-Range Dependency By Bootstrapping A Mutual Information Regularizer.",
                    "On the Completeness of Causal Discovery in the Presence of Latent Confounding with Tiered Background Knowledge.",
                    "One Sample Stochastic Frank-Wolfe.",
                    "Convex Geometry of Two-Layer ReLU Networks: Implicit Autoencoding and Interpretable Models.",
                    "A Robust Univariate Mean Estimator is All You Need.",
                    "Patient-Specific Effects of Medication Using Latent Force Models with Gaussian Processes.",
                    "Robust Variational Autoencoders for Outlier Detection and Repair of Mixed-Type Data.",
                    "Error bounds in estimating the out-of-sample prediction error using leave-one-out cross validation in high-dimensions.",
                    "A Diversity-aware Model for Majority Vote Ensemble Accuracy.",
                    "Scaling up Kernel Ridge Regression via Locality Sensitive Hashing.",
                    "Ordering-Based Causal Structure Learning in the Presence of Latent Variables.",
                    "Budget Learning via Bracketing.",
                    "Optimal Algorithms for Multiplayer Multi-Armed Bandits.",
                    "AP-Perf: Incorporating Generic Performance Metrics in Differentiable Learning.",
                    "Optimal Deterministic Coresets for Ridge Regression.",
                    "Expressiveness and Learning of Hidden Quantum Markov Models.",
                    "Solving the Robust Matrix Completion Problem via a System of Nonlinear Equations.",
                    "Explicit Mean-Square Error Bounds for Monte-Carlo and Linear Stochastic Approximation.",
                    "Stochastic Neural Network with Kronecker Flow.",
                    "Fair Correlation Clustering.",
                    "Towards Competitive N-gram Smoothing.",
                    "Multi-level Gaussian Graphical Models Conditional on Covariates.",
                    "Semi-Modular Inference: enhanced learning in multi-modular models by tempering the influence of components.",
                    "Invertible Generative Modeling using Linear Rational Splines.",
                    "LdSM: Logarithm-depth Streaming Multi-label Decision Trees.",
                    "Prior-aware Composition Inference for Spectral Topic Models.",
                    "Variational Optimization on Lie Groups, with Examples of Leading (Generalized) Eigenvalue Problems.",
                    "Best-item Learning in Random Utility Models with Subset Choices.",
                    "Regularized Autoencoders via Relaxed Injective Probability Flow.",
                    "Stochastic Variance-Reduced Algorithms for PCA with Arbitrary Mini-Batch Sizes.",
                    "Gradient Descent with Early Stopping is Provably Robust to Label Noise for Overparameterized Neural Networks.",
                    "Scalable Nonparametric Factorization for High-Order Interaction Events.",
                    "Gaussianization Flows.",
                    "Adaptive, Distribution-Free Prediction Intervals for Deep Networks.",
                    "A Distributional Analysis of Sampling-Based Reinforcement Learning Algorithms.",
                    "Automatic Differentiation of Sketched Regression.",
                    "Sublinear Optimal Policy Value Estimation in Contextual Bandits.",
                    "Budget-Constrained Bandits over General Cost and Reward Distributions.",
                    "Measuring Mutual Information Between All Pairs of Variables in Subquadratic Complexity.",
                    "Online Continuous DR-Submodular Maximization with Long-Term Budget Constraints.",
                    "Prediction Focused Topic Models via Feature Selection.",
                    "Accelerated Factored Gradient Descent for Low-Rank Matrix Factorization.",
                    "Structured Conditional Continuous Normalizing Flows for Efficient Amortized Inference in Graphical Models.",
                    "Graph Coarsening with Preserved Spectral Properties.",
                    "A Theoretical and Practical Framework for Regression and Classification from Truncated Samples.",
                    "Permutation Invariant Graph Generation via Score-Based Generative Modeling.",
                    "Finite-Time Analysis of Decentralized Temporal-Difference Learning with Linear Function Approximation.",
                    "Multi-attribute Bayesian optimization with interactive preference learning.",
                    "On the Sample Complexity of Learning Sum-Product Networks.",
                    "Tighter Theory for Local SGD on Identical and Heterogeneous Data.",
                    "Approximate Cross-validation: Guarantees for Model Assessment and Selection.",
                    "On Minimax Optimality of GANs for Robust Mean Estimation.",
                    "Auditing ML Models for Individual Bias and Unfairness.",
                    "Stein Variational Inference for Discrete Distributions.",
                    "Revisiting Stochastic Extragradient.",
                    "A Framework for Sample Efficient Interval Estimation with Control Variates.",
                    "Nonmyopic Gaussian Process Optimization with Macro-Actions."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "22nd AISTATS 2019",
        "info": "Naha, Okinawa, Japan",
        "venues": [
            {
                "sub_name_abbr": "conf/aistats/2019",
                "sub_name": "The 22nd International Conference on Artificial Intelligence and Statistics, AISTATS 2019, 16-18 April 2019, Naha, Okinawa, Japan.",
                "count": 360,
                "papers": [
                    "Proximal Splitting Meets Variance Reduction.",
                    "Optimal Noise-Adding Mechanism in Additive Differential Privacy.",
                    "Tossing Coins Under Monotonicity.",
                    "Gaussian Regression with Convex Constraints.",
                    "Risk-Averse Stochastic Convex Bandit.",
                    "Error bounds for sparse classifiers in high-dimensions.",
                    "Boosting Transfer Learning with Survival Data from Heterogeneous Domains.",
                    "Resampled Priors for Variational Autoencoders.",
                    "Scalable Bayesian Learning for State Space Models using Variational Inference with SMC Samplers.",
                    "Scalable Thompson Sampling via Optimal Transport.",
                    "Inferring Multidimensional Rates of Aging from Cross-Sectional Data.",
                    "Interaction Detection with Bayesian Decision Tree Ensembles.",
                    "On the Interaction Effects Between Prediction and Clustering.",
                    "Towards a Theoretical Understanding of Hashing-Based Neural Nets.",
                    "Faster First-Order Methods for Stochastic Non-Convex Optimization on Riemannian Manifolds.",
                    "LF-PPL: A Low-Level First Order Probabilistic Programming Language for Non-Differentiable Models.",
                    "Identifiability of Generalized Hypergeometric Distribution (GHD) Directed Acyclic Graphical Models.",
                    "Unbiased Implicit Variational Inference.",
                    "Efficient Linear Bandits through Matrix Sketching.",
                    "Orthogonal Estimation of Wasserstein Distances.",
                    "Linear Convergence of the Primal-Dual Gradient Method for Convex-Concave Saddle Point Problems without Strong Convexity.",
                    "Greedy and IHT Algorithms for Non-convex Optimization with Monotone Costs of Non-zeros.",
                    "Block Stability for MAP Inference.",
                    "A Stein-Papangelou Goodness-of-Fit Test for Point Processes.",
                    "KAMA-NNs: Low-dimensional Rotation Based Neural Networks.",
                    "Statistical Windows in Testing for the Initial Distribution of a Reversible Markov Chain.",
                    "Sketching for Latent Dirichlet-Categorical Models.",
                    "Adaptive Activity Monitoring with Uncertainty Quantification in Switching Gaussian Process Models.",
                    "Near Optimal Algorithms for Hard Submodular Programs with Discounted Cooperative Costs.",
                    "Fast Stochastic Algorithms for Low-rank and Nonsmooth Matrix Problems.",
                    "Logarithmic Regret for Online Gradient Descent Beyond Strong Convexity.",
                    "Accelerated Coordinate Descent with Arbitrary Sampling and Best Rates for Minibatches.",
                    "Globally-convergent Iteratively Reweighted Least Squares for Robust Regression Problems.",
                    "Modularity-based Sparse Soft Graph Clustering.",
                    "Pathwise Derivatives for Multivariate Distributions.",
                    "Distributed Inexact Newton-type Pursuit for Non-convex Sparse Learning.",
                    "Vine copula structure learning via Monte Carlo tree search.",
                    "Blind Demixing via Wirtinger Flow with Random Initialization.",
                    "Performance Metric Elicitation from Pairwise Classifier Comparisons.",
                    "Analysis of Network Lasso for Semi-Supervised Regression.",
                    "Learning Mixtures of Smooth Product Distributions: Identifiability and Algorithm.",
                    "Robust Matrix Completion from Quantized Observations.",
                    "Foundations of Sequence-to-Sequence Modeling for Time Series.",
                    "Nearly Optimal Adaptive Procedure with Change Detection for Piecewise-Stationary Bandit.",
                    "An Optimal Algorithm for Stochastic Three-Composite Optimization.",
                    "A Thompson Sampling Algorithm for Cascading Bandits.",
                    "Lifelong Optimization with Low Regret.",
                    "Sparse Multivariate Bernoulli Processes in High Dimensions.",
                    "An Optimal Algorithm for Stochastic and Adversarial Bandits.",
                    "Efficient Bayesian Experimental Design for Implicit Models.",
                    "Local Saddle Point Optimization: A Curvature Exploitation Approach.",
                    "Testing Conditional Independence on Discrete Data using Stochastic Complexity.",
                    "Distributionally Robust Submodular Maximization.",
                    "A Robust Zero-Sum Game Framework for Pool-based Active Learning.",
                    "Support and Invertibility in Domain-Invariant Representations.",
                    "Efficient Inference in Multi-task Cox Process Models.",
                    "Optimization of Inf-Convolution Regularized Nonconvex Composite Problems.",
                    "On Connecting Stochastic Gradient MCMC and Differential Privacy.",
                    "What made you do this? Understanding black-box decisions with sufficient input subsets.",
                    "Computation Efficient Coded Linear Transform.",
                    "Mixing of Hamiltonian Monte Carlo on strongly log-concave distributions 2: Numerical integrators.",
                    "Temporal Quilting for Survival Analysis.",
                    "Learning Classifiers with Fenchel-Young Losses: Generalized Entropies, Margins, and Algorithms.",
                    "On Target Shift in Adversarial Domain Adaptation.",
                    "Optimal Testing in the Experiment-rich Regime.",
                    "Reversible Jump Probabilistic Programming.",
                    "Graph Embedding with Shifted Inner Product Similarity and Its Improved Approximation Capability.",
                    "High-dimensional Mixed Graphical Model with Ordinal Data: Parameter Estimation and Statistical Inference.",
                    "Robust Graph Embedding with Noisy Link Weights.",
                    "Exploring Fast and Communication-Efficient Algorithms in Large-Scale Distributed Networks.",
                    "Defending against Whitebox Adversarial Attacks via Randomized Discretization.",
                    "Fisher Information and Natural Gradient Learning in Random Deep Networks.",
                    "Robust descent using smoothed multiplicative noise.",
                    "Classification using margin pursuit.",
                    "Linear Queries Estimation with Local Differential Privacy.",
                    "Bayesian Learning of Neural Network Architectures.",
                    "Nonlinear Acceleration of Primal-Dual Algorithms.",
                    "Gaussian Process Latent Variable Alignment Learning.",
                    "A Bayesian model for sparse graphs with flexible degree distribution and overlapping community structure.",
                    "Pseudo-Bayesian Learning with Kernel Fourier Transform as Prior.",
                    "Forward Amortized Inference for Likelihood-Free Variational Marginalization.",
                    "SpikeCaKe: Semi-Analytic Nonparametric Bayesian Inference for Spike-Spike Neuronal Connectivity.",
                    "Scalable Gaussian Process Inference with Finite-data Mean and Variance Guarantees.",
                    "Exponential convergence rates for Batch Normalization: The power of length-direction decoupling in non-convex optimization.",
                    "A new evaluation framework for topic modeling algorithms based on synthetic corpora.",
                    "On Kernel Derivative Approximation with Random Fourier Features.",
                    "Sequential Neural Likelihood: Fast Likelihood-free Inference with Autoregressive Flows.",
                    "Optimal Transport for Multi-source Domain Adaptation under Target Shift.",
                    "Nonlinear ICA Using Auxiliary Variables and Generalized Contrastive Learning.",
                    "Deep Neural Networks Learn Non-Smooth Functions Effectively.",
                    "Attenuating Bias in Word vectors.",
                    "Fisher-Rao Metric, Geometry, and Complexity of Neural Networks.",
                    "Accelerated Decentralized Optimization with Local Updates for Smooth and Strongly Convex Objectives.",
                    "Interaction Matters: A Note on Non-asymptotic Local Convergence of Generative Adversarial Networks.",
                    "On Constrained Nonconvex Stochastic Optimization: A Case Study for Generalized Eigenvalue Decomposition.",
                    "Generalized Boltzmann Machine with Deep Neural Structure.",
                    "Extreme Stochastic Variational Inference: Distributed Inference for Large Scale Mixture Models.",
                    "Correcting the bias in least squares regression with volume-rescaled sampling.",
                    "Conservative Exploration using Interleaving.",
                    "Conditionally Independent Multiresolution Gaussian Processes.",
                    "Active Exploration in Markov Decision Processes.",
                    "On the Convergence of Stochastic Gradient Descent with Adaptive Stepsizes.",
                    "Bandit Online Learning with Unknown Delays.",
                    "Learning Invariant Representations with Kernel Warping.",
                    "$β^3$-IRT: A New Item Response Model and its Applications.",
                    "Can You Trust This Prediction? Auditing Pointwise Reliability After Learning.",
                    "Universal Statistics of Fisher Information in Deep Neural Networks: Mean Field Approach.",
                    "Conditional Sparse $L_p$-norm Regression With Optimal Probability.",
                    "On the Connection Between Learning Two-Layer Neural Networks and Tensor Decomposition.",
                    "Autoencoding any Data through Kernel Autoencoders.",
                    "Towards Understanding the Generalization Bias of Two Layer Convolutional Linear Classifiers with Gradient Descent.",
                    "Learning to Optimize under Non-Stationarity.",
                    "SPONGE: A generalized eigenproblem for clustering signed networks.",
                    "Deep Neural Networks with Multi-Branch Architectures Are Intrinsically Less Non-Convex.",
                    "Are we there yet? Manifold identification of gradient-related proximal methods.",
                    "Hadamard Response: Estimating Distributions Privately, Efficiently, and with Little Communication.",
                    "XBART: Accelerated Bayesian Additive Regression Trees.",
                    "A Swiss Army Infinitesimal Jackknife.",
                    "Online Multiclass Boosting with Bandit Feedback.",
                    "Auto-Encoding Total Correlation Explanation.",
                    "Towards Efficient Data Valuation Based on the Shapley Value.",
                    "Bayesian optimisation under uncertain inputs.",
                    "Optimal Minimization of the Sum of Three Convex Functions with a Linear Operator.",
                    "Fast and Faster Convergence of SGD for Over-Parameterized Models and an Accelerated Perceptron.",
                    "No-regret algorithms for online $k$-submodular maximization.",
                    "Lagrange Coded Computing: Optimal Design for Resiliency, Security, and Privacy.",
                    "Subsampled Renyi Differential Privacy and Analytical Moments Accountant.",
                    "Model Consistency for Learning with Mirror-Stratifiable Regularizers.",
                    "From Cost-Sensitive to Tight F-measure Bounds.",
                    "Feature subset selection for the multinomial logit model via mixed-integer optimization.",
                    "Low-Precision Random Fourier Features for Memory-constrained Kernel Approximation.",
                    "Restarting Frank-Wolfe.",
                    "Adaptive Ensemble Prediction for Deep Neural Networks based on Confidence Level.",
                    "Infinite Task Learning in RKHSs.",
                    "Detection of Planted Solutions for Flat Satisfiability Problems.",
                    "Markov Properties of Discrete Determinantal Point Processes.",
                    "Analysis of Thompson Sampling for Combinatorial Multi-armed Bandit with Probabilistically Triggered Arms.",
                    "Distilling Policy Distillation.",
                    "Support Localization and the Fisher Metric for off-the-grid Sparse Regularization.",
                    "Fast Gaussian process based gradient matching for parameter identification in systems of nonlinear ODEs.",
                    "Semi-Generative Modelling: Covariate-Shift Adaptation with Cause and Effect Features.",
                    "A Continuous-Time View of Early Stopping for Least Squares Regression.",
                    "Towards Clustering High-dimensional Gaussian Mixture Clouds in Linear Running Time.",
                    "Classifying Signals on Irregular Domains via Convolutional Cluster Pooling.",
                    "Learning Rules-First Classifiers.",
                    "Wasserstein regularization for sparse multi-task regression.",
                    "Stochastic Gradient Descent with Exponential Convergence Rates of Expected Classification Errors.",
                    "Black Box Quantiles for Kernel Learning.",
                    "Adversarial Variational Optimization of Non-Differentiable Simulators.",
                    "Active Probabilistic Inference on Matrices for Pre-Conditioning in Stochastic Optimization.",
                    "Projection Free Online Learning over Smooth Sets.",
                    "Confidence Scoring Using Whitebox Meta-models with Linear Classifier Probes.",
                    "Learning Influence-Receptivity Network Structure with Guarantee.",
                    "Iterative Bayesian Learning for Crowdsourced Regression.",
                    "Nonconvex Matrix Factorization from Rank-One Measurements.",
                    "Fast and Robust Shortest Paths on Manifolds Learned from Data.",
                    "Training a Spiking Neural Network with Equilibrium Propagation.",
                    "Learning One-hidden-layer ReLU Networks via Gradient Descent.",
                    "Gain estimation of linear dynamical systems using Thompson Sampling.",
                    "Universal Hypothesis Testing with Kernels: Asymptotically Optimal Tests for Goodness of Fit.",
                    "Calibrating Deep Convolutional Gaussian Processes.",
                    "Stochastic algorithms with descent guarantees for ICA.",
                    "Sample Complexity of Sinkhorn Divergences.",
                    "Adaptive Gaussian Copula ABC.",
                    "Top Feasible Arm Identification.",
                    "Direct Acceleration of SAGA using Sampled Negative Momentum.",
                    "Does data interpolation contradict statistical optimality?",
                    "Inverting Supervised Representations with Autoregressive Neural Density Models.",
                    "Connecting Weighted Automata and Recurrent Neural Networks through Spectral Learning.",
                    "A Family of Exact Goodness-of-Fit Tests for High-Dimensional Discrete Distributions.",
                    "Differentially Private Online Submodular Minimization.",
                    "Semi-supervised clustering for de-duplication.",
                    "Finding the bandit in a graph: Sequential search-and-stop.",
                    "Statistical Learning under Nonstationary Mixing Processes.",
                    "On Structure Priors for Learning Bayesian Networks.",
                    "Partial Optimality of Dual Decomposition for MAP Inference in Pairwise MRFs.",
                    "Sparse Feature Selection in Kernel Discriminant Analysis via Optimal Scoring.",
                    "Learning Natural Programs from a Few Examples in Real-Time.",
                    "Truncated Back-propagation for Bilevel Optimization.",
                    "Empirical Risk Minimization and Stochastic Gradient Descent for Relational Data.",
                    "Variable selection for Gaussian processes via sensitivity analysis of the posterior predictive distribution.",
                    "Lifted Weight Learning of Markov Logic Networks Revisited.",
                    "Causal Discovery in the Presence of Missing Data.",
                    "Learning Tree Structures from Noisy Data.",
                    "Active multiple matrix completion with adaptive confidence sets.",
                    "Confidence-based Graph Convolutional Networks for Semi-Supervised Learning.",
                    "Negative Momentum for Improved Game Dynamics.",
                    "Deep learning with differential Gaussian process flows.",
                    "Data-dependent compression of random features for large-scale kernel approximation.",
                    "Large-Margin Classification in Hyperbolic Space.",
                    "Generalizing the theory of cooperative inference.",
                    "MaxHedge: Maximizing a Maximum Online.",
                    "The Gaussian Process Autoregressive Regression Model (GPAR).",
                    "Towards Optimal Transport with Global Invariances.",
                    "Unsupervised Alignment of Embeddings with Wasserstein Procrustes.",
                    "Sequential Patient Recruitment and Allocation for Adaptive Clinical Trials.",
                    "Probabilistic Forecasting with Spline Quantile Function RNNs.",
                    "Exponential Weights on the Hypercube in Polynomial Time.",
                    "Sharp Analysis of Learning with Discrete Losses.",
                    "Designing Optimal Binary Rating Systems.",
                    "Stochastic Negative Mining for Learning with Large Output Spaces.",
                    "Learning One-hidden-layer Neural Networks under General Input Distributions.",
                    "A Geometric Perspective on the Transferability of Adversarial Directions.",
                    "Non-linear process convolutions for multi-output Gaussian processes.",
                    "Lovasz Convolutional Networks.",
                    "Bridging the gap between regret minimization and best arm identification, with application to A/B tests.",
                    "Gaussian Process Modulated Cox Processes under Linear Inequality Constraints.",
                    "Implicit Kernel Learning.",
                    "Bounding Inefficiency of Equilibria in Continuous Actions Games using Submodularity and Curvature.",
                    "Variational Information Planning for Sequential Decision Making.",
                    "Renyi Differentially Private ERM for Smooth Objectives.",
                    "Projection-Free Bandit Convex Optimization.",
                    "Provable Robustness of ReLU networks via Maximization of Linear Regions.",
                    "Test without Trust: Optimal Locally Private Distribution Testing.",
                    "Distributed Maximization of \"Submodular plus Diversity\" Functions for Multi-label Feature Selection on Huge Datasets.",
                    "On Euclidean k-Means Clustering with alpha-Center Proximity.",
                    "Noisy Blackbox Optimization using Multi-fidelity Queries: A Tree Search Approach.",
                    "Safe Convex Learning under Uncertain Constraints.",
                    "The non-parametric bootstrap and spectral analysis in moderate and high-dimension.",
                    "Knockoffs for the Mass: New Feature Importance Statistics with False Discovery Guarantees.",
                    "Training Variational Autoencoders with Buffered Stochastic Variational Inference.",
                    "Regularized Contextual Bandits.",
                    "Risk-Sensitive Generative Adversarial Imitation Learning.",
                    "Learning Controllable Fair Representations.",
                    "Multi-Task Time Series Analysis applied to Drug Response Modelling.",
                    "Improving the Stability of the Knockoff Procedure: Multiple Simultaneous Knockoffs and Entropy Maximization.",
                    "Know Your Boundaries: Constraining Gaussian Processes by Variational Harmonic Features.",
                    "Distributional reinforcement learning with linear function approximation.",
                    "Matroids, Matchings, and Fairness.",
                    "Dynamical Isometry is Achieved in Residual Networks in a Universal Way for any Activation Function.",
                    "The Termination Critic.",
                    "Consistent Online Optimization: Convex and Submodular.",
                    "Learning Determinantal Point Processes by Corrective Negative Sampling.",
                    "Probabilistic Semantic Inpainting with Pixel Constrained CNNs.",
                    "Least Squares Estimation of Weakly Convex Functions.",
                    "Interval Estimation of Individual-Level Causal Effects Under Unobserved Confounding.",
                    "Amortized Variational Inference with Graph Convolutional Networks for Gaussian Processes.",
                    "Online Decentralized Leverage Score Sampling for Streaming Multidimensional Time Series.",
                    "Interpretable Cascade Classifiers with Abstention.",
                    "Kernel Exponential Family Estimation via Doubly Dual Embedding.",
                    "Revisiting Adversarial Risk.",
                    "A Memoization Framework for Scaling Submodular Optimization to Large Scale Problems.",
                    "Bernoulli Race Particle Filters.",
                    "Augmented Ensemble MCMC sampling in Factorial Hidden Markov Models.",
                    "Probabilistic Riemannian submanifold learning with wrapped Gaussian process latent variable models.",
                    "Unbiased Smoothing using Particle Independent Metropolis-Hastings.",
                    "Two-temperature logistic regression based on the Tsallis divergence.",
                    "Avoiding Latent Variable Collapse with Generative Skip Models.",
                    "SMOGS: Social Network Metrics of Game Success.",
                    "Fast Algorithms for Sparse Reduced-Rank Regression.",
                    "Modeling simple structures and geometry for better stochastic optimization algorithms.",
                    "Online learning with feedback graphs and switching costs.",
                    "Interpretable Almost-Exact Matching for Causal Inference.",
                    "Statistical Optimal Transport via Factored Couplings.",
                    "HS2: Active learning over hypergraphs with pointwise and pairwise queries.",
                    "Clustering Time Series with Nonlinear Dynamics: A Bayesian Non-Parametric and Particle-Based Approach.",
                    "Efficient Nonconvex Empirical Risk Minimization via Adaptive Sample Size Methods.",
                    "An Optimal Control Approach to Sequential Machine Teaching.",
                    "An Online Algorithm for Smoothed Regression and LQR Control.",
                    "Uncertainty Autoencoders: Learning Compressed Representations via Variational Information Maximization.",
                    "Structured Disentangled Representations.",
                    "Estimating Network Structure from Incomplete Event Data.",
                    "Locally Private Mean Estimation: $Z$-test and Tight Confidence Intervals.",
                    "Estimation of Non-Normalized Mixture Models.",
                    "Rotting bandits are no harder than stochastic ones.",
                    "A Topological Regularizer for Classifiers via Persistent Homology.",
                    "Overcomplete Independent Component Analysis via SDP.",
                    "Doubly Semi-Implicit Variational Inference.",
                    "Reducing training time by efficient localized kernel regression.",
                    "Scalable High-Order Gaussian Process Regression.",
                    "A Higher-Order Kolmogorov-Smirnov Test.",
                    "Bayesian Learning of Conditional Kernel Mean Embeddings for Automatic Likelihood-Free Inference.",
                    "Parallel Asynchronous Stochastic Coordinate Descent with Auxiliary Variables.",
                    "Credit Assignment Techniques in Stochastic Computation Graphs.",
                    "Efficient Bayesian Optimization for Target Vector Estimation.",
                    "Correspondence Analysis Using Neural Networks.",
                    "Interpolating between Optimal Transport and MMD using Sinkhorn Divergences.",
                    "Multi-Observation Regression.",
                    "Adaptive MCMC via Combining Local Samplers.",
                    "Variance reduction properties of the reparameterization trick.",
                    "Hierarchical Clustering for Euclidean Data.",
                    "Stochastic Variance-Reduced Cubic Regularization for Nonconvex Optimization.",
                    "Variational Noise-Contrastive Estimation.",
                    "Improving Quadrature for Constrained Integrands.",
                    "High Dimensional Inference in Partially Linear Models.",
                    "Cost aware Inference for IoT Devices.",
                    "Banded Matrix Operators for Gaussian Markov Models in the Automatic Differentiation Era.",
                    "A Unified Weight Learning Paradigm for Multi-view Learning.",
                    "Region-Based Active Learning.",
                    "Precision Matrix Estimation with Noisy and Missing Data.",
                    "Exploring $k$ out of Top $ρ$ Fraction of Arms in Stochastic Bandits.",
                    "AutoML from Service Provider's Perspective: Multi-device, Multi-tenant Model Selection with GP-EI.",
                    "On Theory for BART.",
                    "Deep Topic Models for Multi-label Learning.",
                    "On the Dynamics of Gradient Descent for Autoencoders.",
                    "Complexities in Projection-Free Stochastic Non-convex Minimization.",
                    "Differentiable Antithetic Sampling for Variance Reduction in Stochastic Variational Inference.",
                    "Efficient Greedy Coordinate Descent for Composite Problems.",
                    "Decentralized Gradient Tracking for Continuous DR-Submodular Maximization.",
                    "Adaptive Rao-Blackwellisation in Gibbs Sampling for Probabilistic Graphical Models.",
                    "Derivative-Free Methods for Policy Optimization: Guarantees for Linear Quadratic Systems.",
                    "Contrasting Exploration in Parameter and Action Space: A Zeroth-Order Optimization Perspective.",
                    "Sampling from Non-Log-Concave Distributions via Variance-Reduced Gradient Langevin Dynamics.",
                    "Graph to Graph: a Topology Aware Approach for Graph Structures Learning and Generation.",
                    "Imitation-Regularized Offline Learning.",
                    "A maximum-mean-discrepancy goodness-of-fit test for censored data.",
                    "Sobolev Descent.",
                    "Learning the Structure of a Nonstationary Vector Autoregression.",
                    "Theoretical Analysis of Efficiency and Robustness of Softmax and Gap-Increasing Operators in Reinforcement Learning.",
                    "A Fast Sampling Algorithm for Maximum Inner Product Search.",
                    "Minimum Volume Topic Modeling.",
                    "Binary Space Partitioning Forest.",
                    "Improved Semi-Supervised Learning with Multiple Graphs.",
                    "Optimizing over a Restricted Policy Class in MDPs.",
                    "Stochastic Gradient Descent on Separable Data: Exact Convergence with a Fixed Learning Rate.",
                    "Deep Switch Networks for Generating Discrete Data and Language.",
                    "A recurrent Markov state-space generative model for sequences.",
                    "A Potential Outcomes Calculus for Identifying Conditional Path-Specific Effects.",
                    "Adversarial Discrete Sequence Generation without Explicit NeuralNetworks as Discriminators.",
                    "Adaptive Estimation for Approximate $k$-Nearest-Neighbor Computations.",
                    "Model-Free Linear Quadratic Control via Reduction to Expert Prediction.",
                    "Preventing Failures Due to Dataset Shift: Learning Predictive Models That Transport.",
                    "Structured Robust Submodular Maximization: Offline and Online Algorithms.",
                    "Sample-Efficient Imitation Learning via Generative Adversarial Nets.",
                    "Probabilistic Multilevel Clustering via Composite Transportation Distance.",
                    "A General Framework for Multi-fidelity Bayesian Optimization with Gaussian Processes.",
                    "Online Algorithm for Unsupervised Sensor Selection.",
                    "Best of many worlds: Robust model selection for online supervised learning.",
                    "Accelerating Imitation Learning with Predictive Models.",
                    "Online Learning in Kernelized Markov Decision Processes.",
                    "Lifting high-dimensional non-linear models with Gaussian regressors.",
                    "Domain-Size Aware Markov Logic Networks.",
                    "Database Alignment with Gaussian Features.",
                    "Size of Interventional Markov Equivalence Classes in random DAG models.",
                    "Reparameterizing Distributions on Lie Groups.",
                    "Revisit Batch Normalization: New Understanding and Refinement via Composition Optimization.",
                    "Multi-Order Information for Working Set Selection of Sequential Minimal Optimization.",
                    "Harmonizable mixture kernels with variational Fourier features.",
                    "Multiscale Gaussian Process Level Set Estimation.",
                    "The LORACs Prior for VAEs: Letting the Trees Speak for the Data.",
                    "Adversarial Learning of a Sampler Based on an Unnormalized Distribution.",
                    "Active Ranking with Subset-wise Preferences.",
                    "Recovery Guarantees For Quadratic Tensors With Sparse Observations.",
                    "Sample Efficient Graph-Based Optimization with Noisy Observations.",
                    "Robustness Guarantees for Density Clustering.",
                    "Fixing Mini-batch Sequences with Hierarchical Robust Partitioning.",
                    "Multitask Metric Learning: Theory and Algorithm.",
                    "Efficient Bayes Risk Estimation for Cost-Sensitive Classification.",
                    "Interpreting Black Box Predictions using Fisher Kernels.",
                    "Representation Learning on Graphs: A Reinforcement Learning Application.",
                    "ABCD-Strategy: Budgeted Experimental Design for Targeted Causal Structure Discovery.",
                    "Batched Stochastic Bayesian Optimization via Combinatorial Constraints Design.",
                    "Convergence of Gradient Descent on Separable Data.",
                    "Structured Neural Topic Models for Reviews.",
                    "Adaptive Minimax Regret against Smooth Logarithmic Losses over High-Dimensional l1-Balls via Envelope Complexity.",
                    "Low-Dimensional Density Ratio Estimation for Covariate Shift Correction.",
                    "Evaluating model calibration in classification.",
                    "Towards Gradient Free and Projection Free Stochastic Optimization.",
                    "On Multi-Cause Approaches to Causal Inference with Unobserved Counfounding: Two Cautionary Failure Cases and A Promising Alternative.",
                    "Data-Driven Approach to Multiple-Source Domain Adaptation."
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "21st AISTATS 2018",
        "info": "Playa Blanca, Lanzarote, Canary Islands, Spain",
        "venues": [
            {
                "sub_name_abbr": "conf/aistats/2018",
                "sub_name": "International Conference on Artificial Intelligence and Statistics, AISTATS 2018, 9-11 April 2018, Playa Blanca, Lanzarote, Canary Islands, Spain.",
                "count": 216,
                "papers": [
                    "The Geometry of Random Features.",
                    "Gauged Mini-Bucket Elimination for Approximate Inference.",
                    "A Fast Algorithm for Separated Sparsity via Perturbed Lagrangians.",
                    "An Analysis of Categorical Distributional Reinforcement Learning.",
                    "Combinatorial Preconditioners for Proximal Algorithms on Graphs.",
                    "Growth-Optimal Portfolio Selection under CVaR Constraints.",
                    "Accelerated Stochastic Power Iteration.",
                    "Multi-scale Nystrom Method.",
                    "Making Tree Ensembles Interpretable: A Bayesian Model Selection Approach.",
                    "Mixed Membership Word Embeddings for Computational Social Science.",
                    "Fast Threshold Tests for Detecting Discrimination.",
                    "Iterative Supervised Principal Components.",
                    "Iterative Spectral Method for Alternative Clustering.",
                    "Can clustering scale sublinearly with its clusters? A variational EM acceleration of GMMs and k-means.",
                    "Parallelised Bayesian Optimisation via Thompson Sampling.",
                    "On the challenges of learning with inference networks on sparse, high-dimensional data.",
                    "Post Selection Inference with Kernels.",
                    "On how complexity affects the stability of a predictor.",
                    "On Truly Block Eigensolvers via Riemannian Optimization.",
                    "Layerwise Systematic Scan: Deep Boltzmann Machines and Beyond.",
                    "IHT dies hard: Provable accelerated Iterative Hard Thresholding.",
                    "Finding Global Optima in Nonconvex Stochastic Semidefinite Optimization with Variance Reduction.",
                    "Outlier Detection and Robust Estimation in Nonparametric Regression.",
                    "Integral Transforms from Finite Data: An Application of Gaussian Process Regression to Fourier Analysis.",
                    "AdaGeo: Adaptive Geometric Learning for Optimization and Sampling.",
                    "Online Learning with Non-Convex Losses and Non-Stationary Regret.",
                    "Learning Determinantal Point Processes in Sublinear Time.",
                    "Nonlinear Structured Signal Estimation in High Dimensions via Iterative Hard Thresholding.",
                    "Riemannian stochastic quasi-Newton algorithm with variance reduction and its convergence analysis.",
                    "Online Boosting Algorithms for Multi-label Ranking.",
                    "Zeroth-Order Online Alternating Direction Method of Multipliers: Convergence Analysis and Applications.",
                    "High-Dimensional Bayesian Optimization via Additive Models with Overlapping Groups.",
                    "Robust Active Label Correction.",
                    "Factorial HMMs with Collapsed Gibbs Sampling for Optimizing Long-term HIV Therapy.",
                    "Optimal Submodular Extensions for Marginal Estimation.",
                    "Semi-Supervised Learning with Competitive Infection Models.",
                    "Discriminative Learning of Prediction Intervals.",
                    "Topic Compositional Neural Language Model.",
                    "Learning Priors for Invariance.",
                    "Optimal Cooperative Inference.",
                    "Stochastic Multi-armed Bandits in Constant Space.",
                    "Matrix completability analysis via graph k-connectivity.",
                    "FLAG n' FLARE: Fast Linearly-Coupled Adaptive Gradient Methods.",
                    "Multi-view Metric Learning in Vector-valued Kernel Spaces.",
                    "Gaussian Process Subset Scanning for Anomalous Pattern Detection in Non-iid Data.",
                    "Dropout as a Low-Rank Regularizer for Matrix Factorization.",
                    "A Simple Analysis for Exp-concave Empirical Minimization with Arbitrary Convex Regularizer.",
                    "Independently Interpretable Lasso: A New Regularizer for Sparse Regression with Uncorrelated Variables.",
                    "Boosting Variational Inference: an Optimization Perspective.",
                    "Personalized and Private Peer-to-Peer Machine Learning.",
                    "Tensor Regression Meets Gaussian Processes.",
                    "A Nonconvex Proximal Splitting Algorithm under Moreau-Yosida Regularization.",
                    "Medoids in Almost-Linear Time via Multi-Armed Bandits.",
                    "Regional Multi-Armed Bandits.",
                    "Nearly second-order optimality of online joint detection and estimation via one-sample update schemes.",
                    "Sum-Product-Quotient Networks.",
                    "Exploiting Strategy-Space Diversity for Batch Bayesian Optimization.",
                    "Beating Monte Carlo Integration: a Nonasymptotic Study of Kernel Smoothing Methods.",
                    "Group invariance principles for causal generative models.",
                    "A Provable Algorithm for Learning Interpretable Scoring Systems.",
                    "Scaling up the Automatic Statistician: Scalable Structure Discovery using Gaussian Processes.",
                    "Efficient Bandit Combinatorial Optimization Algorithm with Zero-suppressed Binary Decision Diagrams.",
                    "Transfer Learning on fMRI Datasets.",
                    "An Optimization Approach to Learning Falling Rule Lists.",
                    "Catalyst for Gradient-based Nonconvex Optimization.",
                    "Benefits from Superposed Hawkes Processes.",
                    "Nonparametric Preference Completion.",
                    "Non-parametric estimation of Jensen-Shannon Divergence in Generative Adversarial Network training.",
                    "Efficient and principled score estimation with Nyström kernel exponential families.",
                    "Symmetric Variational Autoencoder and Connections to Adversarial Learning.",
                    "Few-shot Generative Modelling with Generative Matching Networks.",
                    "Nonlinear Weighted Finite Automata.",
                    "Natural Gradients in Practice: Non-Conjugate Variational Inference in Gaussian Process Models.",
                    "Variational inference for the multi-armed contextual bandit.",
                    "Tracking the gradients using the Hessian: A new look at variance reducing stochastic methods.",
                    "Subsampling for Ridge Regression via Regularized Volume Sampling.",
                    "Scalable Gaussian Processes with Billions of Inducing Inputs via Tensor Train Decomposition.",
                    "Batch-Expansion Training: An Efficient Optimization Framework.",
                    "Batched Large-scale Bayesian Optimization in High-dimensional Spaces.",
                    "Temporally-Reweighted Chinese Restaurant Process Mixtures for Clustering, Imputing, and Forecasting Multivariate Time Series.",
                    "Stochastic Three-Composite Convex Minimization with a Linear Operator.",
                    "Direct Learning to Rank And Rerank.",
                    "One-shot Coresets: The Case of k-Clustering.",
                    "Random Warping Series: A Random Features Method for Time-Series Embedding.",
                    "Slow and Stale Gradients Can Win the Race: Error-Runtime Trade-offs in Distributed SGD.",
                    "Variational Inference based on Robust Divergences.",
                    "Variational Rejection Sampling.",
                    "Best arm identification in multi-armed bandits with delayed feedback.",
                    "A fully adaptive algorithm for pure exploration in linear bandits.",
                    "Contextual Bandits with Stochastic Experts.",
                    "Human Interaction with Recommendation Systems.",
                    "Community Detection in Hypergraphs: Optimal Statistical Limit and Efficient Algorithms.",
                    "Smooth and Sparse Optimal Transport.",
                    "Robust Maximization of Non-Submodular Objectives.",
                    "Cause-Effect Inference by Comparing Regression Errors.",
                    "Tree-based Bayesian Mixture Model for Competing Risks.",
                    "Actor-Critic Fictitious Play in Simultaneous Move Multistage Games.",
                    "Random Subspace with Trees for Feature Selection Under Memory Constraints.",
                    "Conditional independence testing based on a nearest-neighbor estimator of conditional mutual information.",
                    "Quotient Normalized Maximum Likelihood Criterion for Learning Bayesian Network Structures.",
                    "Convex Optimization over Intersection of Simple Sets: improved Convergence Rate Guarantees via an Exact Penalty Approach.",
                    "Variational Sequential Monte Carlo.",
                    "Statistically Efficient Estimation for Non-Smooth Probability Densities.",
                    "SDCA-Powered Inexact Dual Augmented Lagrangian Method for Fast CRF Learning.",
                    "Generalized Concomitant Multi-Task Lasso for Sparse Multimodal Regression.",
                    "Gradient Layer: Enhancing the Convergence of Adversarial Training for Generative Models.",
                    "Statistical Sparse Online Regression: A Diffusion Approximation Perspective.",
                    "Guaranteed Sufficient Decrease for Stochastic Variance Reduced Gradient Optimization.",
                    "Delayed Sampling and Automatic Rao-Blackwellization of Probabilistic Programs.",
                    "Learning to Round for Discrete Labeling Problems.",
                    "Approximate ranking from pairwise comparisons.",
                    "Semi-Supervised Prediction-Constrained Topic Models.",
                    "A Stochastic Differential Equation Framework for Guiding Online User Activities in Closed Loop.",
                    "Accelerated Stochastic Mirror Descent: From Continuous-time Dynamics to Discrete-time Algorithms.",
                    "A Unified Framework for Nonconvex Low-Rank plus Sparse Matrix Recovery.",
                    "Bayesian Nonparametric Poisson-Process Allocation for Time-Sequence Modeling.",
                    "Factor Analysis on a Graph.",
                    "Crowdclustering with Partition Labels.",
                    "Learning Structural Weight Uncertainty for Sequential Decision-Making.",
                    "Towards Memory-Friendly Deterministic Incremental Gradient Method.",
                    "Optimality of Approximate Inference Algorithms on Stable Instances.",
                    "Bayesian Approaches to Distribution Regression.",
                    "Submodularity on Hypergraphs: From Sets to Sequences.",
                    "Provable Estimation of the Number of Blocks in Block Models.",
                    "Differentially Private Regression with Gaussian Processes.",
                    "Adaptive balancing of gradient and update computation times using global geometry and approximate subproblems.",
                    "VAE with a VampPrior.",
                    "Structured Factored Inference for Probabilistic Programming.",
                    "A Generic Approach for Escaping Saddle points.",
                    "Policy Evaluation and Optimization with Continuous Treatments.",
                    "Multiphase MCMC Sampling for Parameter Inference in Nonlinear Ordinary Differential Equations.",
                    "Why Adaptively Collected Data Have Negative Bias and How to Correct for It.",
                    "Sparse Linear Isotonic Models.",
                    "Robustness of classifiers to uniform $\\ell_p$ and Gaussian noise.",
                    "Nested CRP with Hawkes-Gaussian Processes.",
                    "Sketching for Kronecker Product Regression and P-splines.",
                    "Multimodal Prediction and Personalization of Photo Edits with Deep Generative Models.",
                    "Cheap Checking for Cloud Computing: Statistical Analysis via Annotated Data Streams.",
                    "Minimax Reconstruction Risk of Convolutional Sparse Dictionary Learning.",
                    "Kernel Conditional Exponential Family.",
                    "Linear Stochastic Approximation: How Far Does Constant Step-Size and Iterate Averaging Go?",
                    "Stochastic Zeroth-order Optimization in High Dimensions.",
                    "Teacher Improves Learning by Selecting a Training Subset.",
                    "Communication-Avoiding Optimization Methods for Distributed Massive-Scale Sparse Inverse Covariance Estimation.",
                    "Robust Vertex Enumeration for Convex Hulls in High Dimensions.",
                    "Fast generalization error bound of deep learning from a kernel perspective.",
                    "Product Kernel Interpolation for Scalable Gaussian Processes.",
                    "Towards Provable Learning of Polynomial Neural Networks Using Low-Rank Matrix Estimation.",
                    "Scalable Generalized Dynamic Topic Models.",
                    "Bayesian Structure Learning for Dynamic Brain Connectivity.",
                    "Large Scale Empirical Risk Minimization via Truncated Adaptive Newton Method.",
                    "Frank-Wolfe Splitting via Augmented Lagrangian Method.",
                    "Learning linear structural equation models in polynomial time and sample complexity.",
                    "Convergence diagnostics for stochastic gradient descent with constant learning rate.",
                    "Learning Sparse Polymatrix Games in Polynomial Time and Sample Complexity.",
                    "Nonparametric Sharpe Ratio Function Estimation in Heteroscedastic Regression Models via Convex Optimization.",
                    "Stochastic algorithms for entropy-regularized optimal transport problems.",
                    "Plug-in Estimators for Conditional Expectations and Probabilities.",
                    "Factorized Recurrent Neural Architectures for Longer Range Dependence.",
                    "On the Statistical Efficiency of Compositional Nonparametric Prediction.",
                    "Metrics for Deep Generative Models.",
                    "Combinatorial Penalties: Which structures are preserved by convex relaxations?",
                    "Generalized Binary Search For Split-Neighborly Problems.",
                    "Intersection-Validation: A Method for Evaluating Structure Learning without Ground Truth.",
                    "On Statistical Optimality of Variational Bayes.",
                    "Minimax-Optimal Privacy-Preserving Sparse PCA in Distributed Systems.",
                    "Online Regression with Partial Information: Generalization and Linear Projection.",
                    "Learning Generative Models with Sinkhorn Divergences.",
                    "Reparameterizing the Birkhoff Polytope for Variational Permutation Inference.",
                    "Achieving the time of 1-NN, but the accuracy of k-NN.",
                    "Efficient Weight Learning in High-Dimensional Untied MLNs.",
                    "Learning with Complex Loss Functions and Constraints.",
                    "Solving lp-norm regularization with tensor kernels.",
                    "Weighted Tensor Decomposition for Learning Latent Variables with Partial Data.",
                    "Multi-objective Contextual Bandit Problem with Similarity Information.",
                    "Turing: Composable inference for probabilistic programming.",
                    "Fast and Scalable Learning of Sparse Changes in High-Dimensional Gaussian Graphical Model Structure.",
                    "Data-Efficient Reinforcement Learning with Probabilistic Model Predictive Control.",
                    "Approximate Bayesian Computation with Kullback-Leibler Divergence as Data Discrepancy.",
                    "Practical Bayesian optimization in the presence of outliers.",
                    "Competing with Automata-based Expert Sequences.",
                    "Reducing Crowdsourcing to Graphon Estimation, Statistically.",
                    "Robust Locally-Linear Controllable Embedding.",
                    "Combinatorial Semi-Bandits with Knapsacks.",
                    "Structured Optimal Transport.",
                    "Graphical Models for Non-Negative Data Using Generalized Score Matching.",
                    "Asynchronous Doubly Stochastic Group Regularized Learning.",
                    "Convergence of Value Aggregation for Imitation Learning.",
                    "Inference in Sparse Graphs with Pairwise Measurements and Side Information.",
                    "Parallel and Distributed MCMC via Shepherding Distributions.",
                    "The Power Mean Laplacian for Multilayer Graph Clustering.",
                    "Adaptive Sampling for Coarse Ranking.",
                    "Comparison Based Learning from Weak Oracles.",
                    "The Binary Space Partitioning-Tree Process.",
                    "On denoising modulo 1 samples of a function.",
                    "Scalable Hash-Based Estimation of Divergence Measures.",
                    "Conditional Gradient Method for Stochastic Submodular Maximization: Closing the Gap.",
                    "Online Continuous Submodular Maximization.",
                    "Efficient Bayesian Methods for Counting Processes in Partially Observable Environments.",
                    "Matrix-normal models for fMRI analysis.",
                    "The emergence of spectral universality in deep networks.",
                    "Spectral Algorithms for Computing Fair Support Vector Machines.",
                    "Bayesian Multi-label Learning with Sparse Features and Labels, and Label Co-occurrences.",
                    "Nonparametric Bayesian sparse graph linear dynamical systems.",
                    "Proximity Variational Inference.",
                    "Near-Optimal Machine Teaching via Explanatory Teaching Sets.",
                    "Learning Hidden Quantum Markov Models.",
                    "Labeled Graph Clustering via Projected Gradient Descent.",
                    "Gradient Diversity: a Key Ingredient for Scalable Distributed Learning.",
                    "HONES: A Fast and Tuning-free Homotopy Method For Online Newton Step.",
                    "Probability-Revealing Samples.",
                    "Derivative Free Optimization Via Repeated Classification.",
                    "Online Ensemble Multi-kernel Learning Adaptive to Non-stationary and Adversarial Environments.",
                    "A Unified Dynamic Approach to Sparse Model Selection.",
                    "Bootstrapping EM via Power EM and Convergence in the Naive Bayes Model.",
                    "Dimensionality Reduced $\\ell^{0}$-Sparse Subspace Clustering."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "20th AISTATS 2017",
        "info": "Fort Lauderdale, FL, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/aistats/2017",
                "sub_name": "Proceedings of the 20th International Conference on Artificial Intelligence and Statistics, AISTATS 2017, 20-22 April 2017, Fort Lauderdale, FL, USA.",
                "count": 167,
                "papers": [
                    "Minimax Gaussian Classification & Clustering.",
                    "Conditions beyond treewidth for tightness of higher-order LP relaxations.",
                    "Large-Scale Data-Dependent Kernel Approximation.",
                    "Clustering from Multiple Uncertain Experts.",
                    "Online Nonnegative Matrix Factorization with General Divergences.",
                    "ASAGA: Asynchronous Parallel SAGA.",
                    "Lower Bounds on Active Learning for Graphical Model Selection.",
                    "Non-square matrix sensing without spurious local minima via the Burer-Monteiro approach.",
                    "Sparse Accelerated Exponential Weights.",
                    "On the Learnability of Fully-Connected Neural Networks.",
                    "An Information-Theoretic Route from Generalization in Expectation to Generalization in Probability.",
                    "Nearly Instance Optimal Sample Complexity Bounds for Top-k Arm Selection.",
                    "Guaranteed Non-convex Optimization: Submodular Maximization over Continuous Domains.",
                    "Tensor-Dictionary Learning with Deep Kruskal-Factor Analysis.",
                    "Consistent and Efficient Nonparametric Different-Feature Selection.",
                    "Annular Augmentation Sampling.",
                    "Less than a Single Pass: Stochastically Controlled Stochastic Gradient.",
                    "Learning Time Series Detection Models from Temporally Imprecise Labels.",
                    "Learning Cost-Effective and Interpretable Treatment Regimes.",
                    "Linear Thompson Sampling Revisited.",
                    "A Sub-Quadratic Exact Medoid Algorithm.",
                    "Minimax Density Estimation for Growing Dimension.",
                    "Estimating Density Ridges by Direct Estimation of Density-Derivative-Ratios.",
                    "Learning Theory for Conditional Risk Minimization.",
                    "Near-optimal Bayesian Active Learning with Correlated and Noisy Tests.",
                    "Learning Nash Equilibrium for General-Sum Markov Games from Batch Data.",
                    "Distance Covariance Analysis.",
                    "Phase Retrieval Meets Statistical Learning Theory: A Flexible Convex Relaxation.",
                    "Regret Bounds for Lifelong Learning.",
                    "Poisson intensity estimation with reproducing kernels.",
                    "Generalized Pseudolikelihood Methods for Inverse Covariance Estimation.",
                    "Removing Phase Transitions from Gibbs Measures.",
                    "Performance Bounds for Graphical Record Linkage.",
                    "Regret Bounds for Transfer Learning in Bayesian Optimisation.",
                    "Scaling Submodular Maximization via Pruned Submodularity Graphs.",
                    "Localized Lasso for High-Dimensional Regression.",
                    "Encrypted Accelerated Least Squares Regression.",
                    "Random Consensus Robust PCA.",
                    "Gray-box Inference for Structured Gaussian Process Models.",
                    "Frank-Wolfe Algorithms for Saddle Point Problems.",
                    "A Framework for Optimal Matching for Causal Inference.",
                    "Quantifying the accuracy of approximate diffusions and Markov chains.",
                    "Stochastic Rank-1 Bandits.",
                    "On the Troll-Trust Model for Edge Sign Prediction in Social Networks.",
                    "Online Optimization of Smoothed Piecewise Constant Functions.",
                    "Combinatorial Topic Models using Small-Variance Asymptotics.",
                    "ConvNets with Smooth Adaptive Activation Functions for Regression.",
                    "Rapid Mixing Swendsen-Wang Sampler for Stochastic Partitioned Attractive Models.",
                    "Efficient Rank Aggregation via Lehmer Codes.",
                    "Nonlinear ICA of Temporally Dependent Stationary Sources.",
                    "Stochastic Difference of Convex Algorithm and its Application to Training Deep Boltzmann Machines.",
                    "Global Convergence of Non-Convex Gradient Descent for Computing Matrix Squareroot.",
                    "Reparameterization Gradients through Acceptance-Rejection Sampling Algorithms.",
                    "Asymptotically exact inference in differentiable generative models.",
                    "Decentralized Collaborative Learning of Personalized Models over Networks.",
                    "Contextual Bandits with Latent Confounders: An NMF Approach.",
                    "Fast Bayesian Optimization of Machine Learning Hyperparameters on Large Datasets.",
                    "Least-Squares Log-Density Gradient Clustering for Riemannian Manifolds.",
                    "Fast column generation for atomic norm regularization.",
                    "Bayesian Hybrid Matrix Factorisation for Data Integration.",
                    "Co-Occurring Directions Sketching for Approximate Matrix Multiply.",
                    "Exploration-Exploitation in MDPs with Options.",
                    "Local Perturb-and-MAP for Structured Prediction.",
                    "Gradient Boosting on Stochastic Data Streams.",
                    "Online Learning and Blackwell Approachability with Partial Monitoring: Optimal Convergence Rates.",
                    "Tensor Decompositions via Two-Mode Higher-Order SVD (HOSVD).",
                    "Beta calibration: a well-founded and easily implemented improvement on logistic calibration for binary classifiers.",
                    "Detecting Dependencies in Sparse, Multivariate Databases Using Probabilistic Programming and Non-parametric Bayes.",
                    "High-dimensional Time Series Clustering via Cross-Predictability.",
                    "Minimax Approach to Variable Fidelity Data Interpolation.",
                    "Data Driven Resource Allocation for Distributed Learning.",
                    "Learning Nonparametric Forest Graphical Models with Prior Information.",
                    "Sparse Randomized Partition Trees for Nearest Neighbor Search.",
                    "Horde of Bandits using Gaussian Markov Random Fields.",
                    "Random projection design for scalable implicit smoothing of randomly observed stochastic processes.",
                    "Trading off Rewards and Errors in Multi-Armed Bandits.",
                    "Adaptive ADMM with Spectral Penalty Parameter Selection.",
                    "The End of Optimism? An Asymptotic Analysis of Finite-Armed Linear Bandits.",
                    "Dynamic Collaborative Filtering With Compound Poisson Factorization.",
                    "Rank Aggregation and Prediction with Item Features.",
                    "Robust and Efficient Computation of Eigenvectors in a Generalized Spectral Method for Constrained Clustering.",
                    "Information-theoretic limits of Bayesian network structure learning.",
                    "Markov Chain Truncation for Doubly-Intractable Inference.",
                    "Regression Uncertainty on the Grassmannian.",
                    "Attributing Hacks.",
                    "Unsupervised Sequential Sensor Acquisition.",
                    "A Stochastic Nonconvex Splitting Method for Symmetric Nonnegative Matrix Factorization.",
                    "Hierarchically-partitioned Gaussian Process Approximation.",
                    "Scalable Learning of Non-Decomposable Objectives.",
                    "CPSG-MCMC: Clustering-Based Preprocessing method for Stochastic Gradient MCMC.",
                    "Comparison-Based Nearest Neighbor Search.",
                    "A Unified Optimization View on Generalized Matching Pursuit and Frank-Wolfe.",
                    "Faster Coordinate Descent via Adaptive Importance Sampling.",
                    "Conjugate-Computation Variational Inference: Converting Variational Inference in Non-Conjugate Models to Inferences in Conjugate Models.",
                    "Hit-and-Run for Sampling and Planning in Non-Convex Spaces.",
                    "DP-EM: Differentially Private Expectation Maximization.",
                    "On the Hyperprior Choice for the Global Shrinkage Parameter in the Horseshoe Prior.",
                    "Bayesian Learning and Inference in Recurrent Switching Linear Dynamical Systems.",
                    "Efficient Algorithm for Sparse Tensor-variate Gaussian Graphical Models via Gradient Descent.",
                    "Minimax-optimal semi-supervised regression on unknown manifolds.",
                    "Improved Strongly Adaptive Online Learning using Coin Betting.",
                    "Black-box Importance Sampling.",
                    "Fairness Constraints: Mechanisms for Fair Classification.",
                    "Frequency Domain Predictive Modelling with Aggregated Data.",
                    "A Unified Computational and Statistical Framework for Nonconvex Low-rank Matrix Estimation.",
                    "A New Class of Private Chi-Square Hypothesis Tests.",
                    "A Learning Theory of Ranking Aggregation.",
                    "Anomaly Detection in Extreme Regions via Empirical MV-sets on the Sphere.",
                    "Structured adaptive and random spinners for fast machine learning computations.",
                    "Complementary Sum Sampling for Likelihood Approximation in Large Scale Classification.",
                    "Learning Optimal Interventions.",
                    "A Lower Bound on the Partition Function of Attractive Graphical Models in the Continuous Case.",
                    "Scalable Variational Inference for Super Resolution Microscopy.",
                    "Linear Convergence of Stochastic Frank Wolfe Variants.",
                    "Sequential Graph Matching with Sequential Monte Carlo.",
                    "Fast rates with high probability in exp-concave statistical learning.",
                    "Generalization Error of Invariant Classifiers.",
                    "Learning with Feature Feedback: from Theory to Practice.",
                    "Optimistic Planning for the Stochastic Knapsack Problem.",
                    "Identifying Groups of Strongly Correlated Variables through Smoothed Ordered Weighted L1-norms.",
                    "Tracking Objects with Higher Order Interactions via Delayed Column Generation.",
                    "Belief Propagation in Conditional RBMs for Structured Prediction.",
                    "Sketching Meets Random Projection in the Dual: A Provable Recovery Algorithm for Big and High-dimensional Data.",
                    "Finite-sum Composition Optimization via Variance Reduced Gradient Descent.",
                    "A Fast and Scalable Joint Estimator for Learning Multiple Related Sparse Gaussian Graphical Models.",
                    "Communication-efficient Distributed Sparse Linear Discriminant Analysis.",
                    "Sketchy Decisions: Convex Low-Rank Matrix Optimization with Optimal Storage.",
                    "Modal-set estimation with an application to clustering.",
                    "Compressed Least Squares Regression revisited.",
                    "Diverse Neural Network Learns True Target Functions.",
                    "Local Group Invariant Representations via Orbit Embeddings.",
                    "Relativistic Monte Carlo.",
                    "Thompson Sampling for Linear-Quadratic Control Problems.",
                    "Fast Classification with Binary Prototypes.",
                    "Prediction Performance After Learning in Gaussian Process Regression.",
                    "Communication-Efficient Learning of Deep Networks from Decentralized Data.",
                    "Learning Structured Weight Uncertainty in Bayesian Neural Networks.",
                    "Signal-based Bayesian Seismic Monitoring.",
                    "Learning the Network Structure of Heterogeneous Data via Pairwise Exponential Markov Random Fields.",
                    "Discovering and Exploiting Additive Structure for Bayesian Optimization.",
                    "Lipschitz Density-Ratios, Structured Data, and Data-driven Tuning.",
                    "Spatial Decompositions for Large Scale SVMs.",
                    "Inference Compilation and Universal Probabilistic Programming.",
                    "Active Positive Semidefinite Matrix Completion: Algorithms, Theory and Applications.",
                    "Information Projection and Approximate Inference for Structured Sparse Variables.",
                    "On the Interpretability of Conditional Probability Estimates in the Agnostic Setting.",
                    "Linking Micro Event History to Macro Prediction in Point Process Models.",
                    "Initialization and Coordinate Optimization for Multi-way Matching.",
                    "Optimal Recovery of Tensor Slices.",
                    "Efficient Online Multiclass Prediction on Graphs via Surrogate Losses.",
                    "Distribution of Gaussian Process Arc Lengths.",
                    "Distributed Adaptive Sampling for Kernel Matrix Approximation.",
                    "Binary and Multi-Bit Coding for Stable Random Projections.",
                    "Spectral Methods for Correlated Topic Models.",
                    "Label Filters for Large Scale Multilabel Classification.",
                    "Learning from Conditional Distributions via Dual Embeddings.",
                    "Sequential Multiple Hypothesis Testing with Type I Error Control.",
                    "A Maximum Matching Algorithm for Basis Selection in Spectral Learning.",
                    "Value-Aware Loss Function for Model-based Reinforcement Learning.",
                    "Convergence Rate of Stochastic k-means.",
                    "Automated Inference with Adaptive Batches.",
                    "Scalable Convex Multiple Sequence Alignment via Entropy-Regularized Dual Decomposition.",
                    "Robust Causal Estimation in the Large-Sample Limit without Strict Faithfulness.",
                    "Learning Graphical Games from Behavioral Data: Sufficient and Necessary Conditions.",
                    "Non-Count Symmetries in Boolean & Multi-Valued Prob. Graphical Models.",
                    "Greedy Direction Method of Multiplier for MAP Inference of Large Output Domain.",
                    "Scalable Greedy Feature Selection via Weak Submodularity."
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "19th AISTATS 2016",
        "info": "Cadiz, Spain",
        "venues": [
            {
                "sub_name_abbr": "conf/aistats/2016",
                "sub_name": "Proceedings of the 19th International Conference on Artificial Intelligence and Statistics, AISTATS 2016, Cadiz, Spain, May 9-11, 2016.",
                "count": 164,
                "papers": [
                    "Strong Coresets for Hard and Soft Bregman Clustering with Applications to Exponential Family Mixtures.",
                    "Revealing Graph Bandits for Maximizing Local Influence.",
                    "Convex Block-sparse Linear Regression with Expanders - Provably.",
                    "C3: Lightweight Incrementalized MCMC for Probabilistic Programs using Continuations and Callsite Caching.",
                    "Clamping Improves TRW and Mean Field Approximations.",
                    "Tightness of LP Relaxations for Almost Balanced Models.",
                    "Control Functionals for Quasi-Monte Carlo Integration.",
                    "Probability Inequalities for Kernel Embeddings in Sampling without Replacement.",
                    "Sparse Representation of Multivariate Extremes with Applications to Anomaly Ranking.",
                    "A Robust-Equitable Copula Dependence Measure for Feature Selection.",
                    "Random Forest for the Contextual Bandit Problem.",
                    "Inverse Reinforcement Learning with Simultaneous Estimation of Rewards and Dynamics.",
                    "Learning Sparse Additive Models with Interactions in High Dimensions.",
                    "Bipartite Correlation Clustering: Maximizing Agreements.",
                    "Breaking Sticks and Ambiguities with Adaptive Skip-gram.",
                    "Top Arm Identification in Multi-Armed Bandits with Batch Arm Pulls.",
                    "Limits on Sparse Support Recovery via Linear Sketching with Random Expander Matrices.",
                    "Maximum Likelihood for Variance Estimation in High-Dimensional Linear Models.",
                    "Scalable Gaussian Process Classification via Expectation Propagation.",
                    "Precision Matrix Estimation in High Dimensional Gaussian Graphical Models with Faster Rates.",
                    "On the Reducibility of Submodular Functions.",
                    "Accelerated Stochastic Gradient Descent for Minimizing Finite Sums.",
                    "Fast Convergence of Online Pairwise Learning Algorithms.",
                    "Computationally Efficient Bayesian Learning of Gaussian Process State Space Models.",
                    "Generalized Ideal Parent (GIP): Discovering non-Gaussian Hidden Variables.",
                    "On Sparse Variational Methods and the Kullback-Leibler Divergence between Stochastic Processes.",
                    "Non-stochastic Best Arm Identification and Hyperparameter Optimization.",
                    "A Linearly-Convergent Stochastic L-BFGS Algorithm.",
                    "No Regret Bound for Extreme Bandits.",
                    "Tensor vs. Matrix Methods: Robust Tensor Decomposition under Block Sparse Perturbations.",
                    "Online Learning to Rank with Feedback at the Top.",
                    "Survey Propagation beyond Constraint Satisfaction Problems.",
                    "Score Permutation Based Finite Sample Inference for Generalized AutoRegressive Conditional Heteroskedasticity (GARCH) Models.",
                    "CRAFT: ClusteR-specific Assorted Feature selecTion.",
                    "Time-Varying Gaussian Process Bandit Optimization.",
                    "Bayes-Optimal Effort Allocation in Crowdsourcing: Bounds and Index Policies.",
                    "Bayesian Markov Blanket Estimation.",
                    "Dreaming More Data: Class-dependent Distributions over Diffeomorphisms for Learned Data Augmentation.",
                    "Unsupervised Ensemble Learning with Dependent Classifiers.",
                    "Multi-Level Cause-Effect Systems.",
                    "Deep Kernel Learning.",
                    "Nearly Optimal Classification for Semimetrics.",
                    "Latent Point Process Allocation.",
                    "K2-ABC: Approximate Bayesian Computation with Kernel Embeddings.",
                    "Bayesian Generalised Ensemble Markov Chain Monte Carlo.",
                    "A Lasso-based Sparse Knowledge Gradient Policy for Sequential Optimal Learning.",
                    "Optimal Statistical and Computational Rates for One Bit Matrix Completion.",
                    "PAC-Bayesian Bounds based on the Rényi Divergence.",
                    "Simple and Scalable Constrained Clustering: a Generalized Spectral Method.",
                    "Geometry Aware Mappings for High Dimensional Sparse Factors.",
                    "Generalizing Pooling Functions in Convolutional Neural Networks: Mixed, Gated, and Tree.",
                    "Rivalry of Two Families of Algorithms for Memory-Restricted Streaming PCA.",
                    "Quantization based Fast Inner Product Search.",
                    "An Improved Convergence Analysis of Cyclic Block Coordinate Descent-type Methods for Strongly Convex Minimization.",
                    "Learning Structured Low-Rank Representation via Matrix Factorization.",
                    "A PAC RL Algorithm for Episodic POMDPs.",
                    "Large Scale Distributed Semi-Supervised Learning Using Streaming Approximation.",
                    "Large-Scale Optimization Algorithms for Sparse Conditional Gaussian Graphical Models.",
                    "Graph Connectivity in Noisy Sparse Subspace Clustering.",
                    "The Nonparametric Kernel Bayes Smoother.",
                    "Universal Models of Multivariate Temporal Point Processes.",
                    "Online Relative Entropy Policy Search using Reproducing Kernel Hilbert Space Embeddings.",
                    "Relationship between PreTraining and Maximum Likelihood Estimation in Deep Boltzmann Machines.",
                    "Enumerating Equivalence Classes of Bayesian Networks using EC Graphs.",
                    "Low-Rank and Sparse Structure Pursuit via Alternating Minimization.",
                    "NuC-MKL: A Convex Approach to Non Linear Multiple Kernel Learning.",
                    "Tractable and Scalable Schatten Quasi-Norm Approximations for Rank Minimization.",
                    "Fast Dictionary Learning with a Smoothed Wasserstein Loss.",
                    "New Resistance Distances with Global Information on Large Graphs.",
                    "Batch Bayesian Optimization via Local Penalization.",
                    "Nonparametric Budgeted Stochastic Gradient Descent.",
                    "Learning Relationships between Data Obtained Independently.",
                    "Fast and Scalable Structural SVM with Slack Rescaling.",
                    "Probabilistic Approximate Least-Squares.",
                    "Approximate Inference Using DC Programming For Collective Graphical Models.",
                    "Sequential Inference for Deep Gaussian Process.",
                    "Variational Tempering.",
                    "On Convergence of Model Parallel Proximal Gradient Algorithm for Stale Synchronous Parallel System.",
                    "Scalable MCMC for Mixed Membership Stochastic Blockmodels.",
                    "Non-Stationary Gaussian Process Regression with Hamiltonian Monte Carlo.",
                    "A Deep Generative Deconvolutional Image Model.",
                    "Distributed Multi-Task Learning.",
                    "A Fixed-Point Operator for Inference in Variational Bayesian Latent Gaussian Models.",
                    "Learning Probabilistic Submodular Diversity Models Via Noise Contrastive Estimation.",
                    "Fast Saddle-Point Algorithm for Generalized Dantzig Selector and FDR Control with Ordered L1-Norm.",
                    "GLASSES: Relieving The Myopia Of Bayesian Optimisation.",
                    "Stochastic Variational Inference for the HDP-HMM.",
                    "Stochastic Neural Networks with Monotonic Activation Functions.",
                    "(Bandit) Convex Optimization with Biased Noisy Gradient Oracles.",
                    "Variational Gaussian Copula Inference.",
                    "Low-Rank Approximation of Weighted Tree Automata.",
                    "Accelerating Online Convex Optimization via Adaptive Prediction.",
                    "Scalable geometric density estimation.",
                    "Model-based Co-clustering for High Dimensional Sparse Data.",
                    "DUAL-LOCO: Distributing Statistical Estimation Using Random Projections.",
                    "High Dimensional Bayesian Optimization via Restricted Projection Pursuit Models.",
                    "On the Use of Non-Stationary Strategies for Solving Two-Player Zero-Sum Markov Games.",
                    "Semi-Supervised Learning with Adaptive Spectral Transform.",
                    "Pseudo-Marginal Slice Sampling.",
                    "How to Learn a Graph from Smooth Signals.",
                    "Ordered Weighted L1 Regularized Regression with Strongly Correlated Covariates: Theoretical Aspects.",
                    "Pareto Front Identification from Stochastic Bandit Feedback.",
                    "Sketching, Embedding and Dimensionality Reduction in Information Theoretic Spaces.",
                    "AdaDelay: Delay Adaptive Distributed Stochastic Optimization.",
                    "Exponential Stochastic Cellular Automata for Massively Parallel Inference.",
                    "Globally Sparse Probabilistic PCA.",
                    "Provable Bayesian Inference via Particle Mirror Descent.",
                    "Unsupervised Feature Selection by Preserving Stochastic Neighbors.",
                    "Improved Learning Complexity in Combinatorial Pure Exploration Bandits.",
                    "Scalable Gaussian Processes for Characterizing Multidimensional Change Surfaces.",
                    "Optimization as Estimation with Gaussian Processes in Bandit Settings.",
                    "A Convex Surrogate Operator for General Non-Modular Loss Functions.",
                    "Inference for High-dimensional Exponential Family Graphical Models.",
                    "Bridging the Gap between Stochastic Gradient MCMC and Stochastic Optimization.",
                    "Fitting Spectral Decay with the k-Support Norm.",
                    "Early Stopping as Nonparametric Variational Inference.",
                    "Bayesian Nonparametric Kernel-Learning.",
                    "Tight Variational Bounds via Random Projections and I-Projections.",
                    "Bethe Learning of Graphical Models via MAP Decoding.",
                    "Determinantal Regularization for Ensemble Variable Selection.",
                    "Scalable and Sound Low-Rank Tensor Learning.",
                    "Non-negative Matrix Factorization for Discrete Data with Hierarchical Side-Information.",
                    "Topic-Based Embeddings for Learning from Large Knowledge Graphs.",
                    "Consistently Estimating Markov Chains with Noisy Aggregate Data.",
                    "Unwrapping ADMM: Efficient Distributed Computing via Transpose Reduction.",
                    "Improper Deep Kernels.",
                    "Unbounded Bayesian Optimization via Regularization.",
                    "Non-Gaussian Component Analysis with Log-Density Gradient Estimation.",
                    "Online Learning with Noisy Side Observations.",
                    "Black-Box Policy Search with Probabilistic Programs.",
                    "Efficient Bregman Projections onto the Permutahedron and Related Polytopes.",
                    "On Searching for Generalized Instrumental Variables.",
                    "Provable Tensor Methods for Learning Mixtures of Generalized Linear Models.",
                    "Controlling Bias in Adaptive Data Analysis Using Information Theory.",
                    "A Column Generation Bound Minimization Approach with PAC-Bayesian Generalization Guarantees.",
                    "Graph Sparsification Approaches for Laplacian Smoothing.",
                    "Scalable Exemplar Clustering and Facility Location via Augmented Block Coordinate Descent with Column Generation.",
                    "Robust Covariate Shift Regression.",
                    "On Lloyd's Algorithm: New Theoretical Insights for Clustering in Practice.",
                    "Towards Stability and Optimality in Stochastic Gradient Descent.",
                    "Communication Efficient Distributed Agnostic Boosting.",
                    "Private Causal Inference.",
                    "Parallel Markov Chain Monte Carlo via Spectral Clustering.",
                    "Efficient Sampling for k-Determinantal Point Processes.",
                    "A Fast and Reliable Policy Improvement Algorithm.",
                    "Learning Sigmoid Belief Networks via Monte Carlo Expectation Maximization.",
                    "Active Learning Algorithms for Graphical Model Selection.",
                    "Streaming Kernel Principal Component Analysis.",
                    "Back to the Future: Radial Basis Function Networks Revisited.",
                    "Cut Pursuit: Fast Algorithms to Learn Piecewise Constant Functions.",
                    "Loss Bounds and Time Complexity for Speed Priors.",
                    "NYTRO: When Subsampling Meets Early Stopping.",
                    "Randomization and The Pernicious Effects of Limited Budgets on Auction Experiments.",
                    "Spectral M-estimation with Applications to Hidden Markov Models.",
                    "Chained Gaussian Processes.",
                    "Multiresolution Matrix Compression.",
                    "Supervised Neighborhoods for Distributed Nonparametric Regression.",
                    "Global Convergence of a Grassmannian Gradient Descent Algorithm for Subspace Estimation.",
                    "Online and Distributed Bayesian Moment Matching for Parameter Learning in Sum-Product Networks.",
                    "Mondrian Forests for Large-Scale Regression when Uncertainty Matters.",
                    "Online (and Offline) Robust PCA: Novel Algorithms and Performance Guarantees.",
                    "Parallel Majorization Minimization with Dynamically Restricted Domains for Nonconvex Optimization.",
                    "Discriminative Structure Learning of Arithmetic Circuits.",
                    "One Scan 1-Bit Compressed Sensing."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "18th AISTATS 2015",
        "info": "San Diego, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/aistats/2015",
                "sub_name": "Proceedings of the Eighteenth International Conference on Artificial Intelligence and Statistics, AISTATS 2015, San Diego, California, USA, May 9-12, 2015.",
                "count": 127,
                "papers": [
                    "Preface.",
                    "Nonparametric Bayesian Factor Analysis for Dynamic Count Matrices.",
                    "Parameter Estimation of Generalized Linear Models without Assuming their Link Function.",
                    "Spectral Gap Error Bounds for Improving CUR Matrix Decomposition and the Nyström Method.",
                    "Global Multi-armed Bandits with Hölder Continuity.",
                    "Efficient Sparse Clustering of High-Dimensional Non-spherical Gaussian Mixtures.",
                    "Unifying Local Consistency and MAX SAT Relaxations for Scalable Inference with Rounding Guarantees.",
                    "Near-optimal max-affine estimators for convex regression.",
                    "Convex Multi-Task Learning by Clustering.",
                    "Gaussian Processes for Bayesian hypothesis tests on regression functions.",
                    "Sparse Solutions to Nonnegative Linear Systems and Applications.",
                    "Generalized Linear Models for Aggregated Data.",
                    "Accurate and conservative estimates of MRF log-likelihood using reverse annealing.",
                    "Stochastic Spectral Descent for Restricted Boltzmann Machines.",
                    "Implementable confidence sets in high dimensional regression.",
                    "Online Ranking with Top-1 Feedback.",
                    "One-bit Compressed Sensing with the k-Support Norm.",
                    "Efficient Second-Order Gradient Boosting for Conditional Random Fields.",
                    "Filtered Search for Submodular Maximization with Controllable Approximation Bounds.",
                    "Predictive Inverse Optimal Control for Linear-Quadratic-Gaussian Systems.",
                    "Exact Bayesian Learning of Ancestor Relations in Bayesian Networks.",
                    "Model Selection for Topic Models via Spectral Decomposition.",
                    "The Loss Surfaces of Multilayer Networks.",
                    "Averaged Least-Mean-Squares: Bias-Variance Trade-offs and Optimal Sampling Distributions.",
                    "A Topic Modeling Approach to Ranking.",
                    "A totally unimodular view of structured sparsity.",
                    "Back to the Past: Source Identification in Diffusion Networks from Partially Observed Cascades.",
                    "Graph Approximation and Clustering on a Budget.",
                    "A Sufficient Statistics Construction of Exponential Family Levy Measure Densities for Nonparametric Conjugate Models.",
                    "Computational Complexity of Linear Large Margin Classification With Ramp Loss.",
                    "Learning Deep Sigmoid Belief Networks with Data Augmentation.",
                    "Efficient Estimation of Mutual Information for Strongly Dependent Variables.",
                    "On Anomaly Ranking and Excess-Mass Curves.",
                    "Modeling Skill Acquisition Over Time with Sequence and Topic Modeling.",
                    "Consistent Collective Matrix Completion under Joint Low Rank Structure.",
                    "The Bayesian Echo Chamber: Modeling Social Influence via Linguistic Accommodation.",
                    "Preserving Privacy of Continuous High-dimensional Data with Minimax Filters.",
                    "A Consistent Method for Graph Based Anomaly Localization.",
                    "Metric recovery from directed unweighted graphs.",
                    "Scalable Variational Gaussian Process Classification.",
                    "Stochastic Structured Variational Inference.",
                    "Reliable and Scalable Variational Inference for the Hierarchical Dirichlet Process.",
                    "Cross-domain recommendation without shared users or items by sharing latent vector distributions.",
                    "Submodular Point Processes with Applications to Machine learning.",
                    "Online Optimization : Competing with Dynamic Comparators.",
                    "Estimating the accuracies of multiple classifiers without labeled data.",
                    "Sparse Dueling Bandits.",
                    "Consensus Message Passing for Layered Graphical Models.",
                    "Robust Cost Sensitive Support Vector Machine.",
                    "On Approximate Non-submodular Minimization via Tree-Structured Supermodularity.",
                    "Sparse Submodular Probabilistic PCA.",
                    "Latent feature regression for multivariate count data.",
                    "Dimensionality estimation without distances.",
                    "A Bayes consistent 1-NN classifier.",
                    "DART: Dropouts meet Multiple Additive Regression Trees.",
                    "On Estimating L22 Divergence.",
                    "Tensor Factorization via Matrix Factorization.",
                    "Low-Rank Spectral Learning with Weighted Loss Functions.",
                    "Symmetric Iterative Proportional Fitting.",
                    "Tight Regret Bounds for Stochastic Combinatorial Semi-Bandits.",
                    "Sequential Kernel Herding: Frank-Wolfe Optimization for Particle Filtering.",
                    "Particle Gibbs for Bayesian Additive Regression Trees.",
                    "Deeply-Supervised Nets.",
                    "Preferential Attachment in Graphs with Affinities.",
                    "Bayesian Hierarchical Clustering with Exponential Family: Small-Variance Asymptotics and Reducibility.",
                    "Modelling Policies in MDPs in Reproducing Kernel Hilbert Space.",
                    "Scalable Optimization of Randomized Operational Decisions in Adversarial Classification Settings.",
                    "Toward Minimax Off-policy Value Estimation.",
                    "Compressed Sensing with Very Sparse Gaussian Random Projections.",
                    "Max-Margin Zero-Shot Learning for Multi-class Classification.",
                    "Conditional Restricted Boltzmann Machines for Multi-label Learning with Incomplete Labels.",
                    "Sparsistency of 1-Regularized M-Estimators.",
                    "Similarity Learning for High-Dimensional Sparse Data.",
                    "Tradeoffs for Space, Time, Data and Risk in Unsupervised Learning.",
                    "Active Pointillistic Pattern Search.",
                    "The Security of Latent Dirichlet Allocation.",
                    "A Spectral Algorithm for Inference in Hidden semi-Markov Models.",
                    "Efficient Training of Structured SVMs via Soft Constraints.",
                    "Variance Reduction via Antithetic Markov Chains.",
                    "Fast Function to Function Regression.",
                    "Reactive bandits with attitude.",
                    "Feature Selection for Linear SVM with Provable Guarantees.",
                    "On Theoretical Properties of Sum-Product Networks.",
                    "Robust sketching for multiple square-root LASSO problems.",
                    "Deep Exponential Families.",
                    "On the High Dimensional Power of a Linear-Time Two Sample Test under Mean-shift Alternatives.",
                    "A Scalable Algorithm for Structured Kernel Feature Selection.",
                    "Learning Efficient Anomaly Detectors from K-NN Graphs.",
                    "Gamma Processes, Stick-Breaking, and Variational Inference.",
                    "Direct Density-Derivative Estimation and Its Application in KL-Divergence Approximation.",
                    "Non-Uniform Stochastic Average Gradient Method for Training Conditional Random Fields.",
                    "Sensor Selection for Crowdsensing Dynamical Systems.",
                    "A Rate of Convergence for Mixture Proportion Estimation, with Application to Learning from Noisy Labels.",
                    "Inference of Cause and Effect with Unsupervised Inverse Regression.",
                    "Estimation from Pairwise Comparisons: Sharp Minimax Bounds with Topology Dependence.",
                    "Exploiting Symmetries to Construct Efficient MCMC Algorithms With an Application to SLAM.",
                    "Learning Where to Sample in Structured Prediction.",
                    "State Space Methods for Efficient Inference in Student-t Process Regression.",
                    "Learning from Data with Heterogeneous Noise using SGD.",
                    "Data modeling with the elliptical gamma distribution.",
                    "WASP: Scalable Bayes via barycenters of subset posteriors.",
                    "Calibration of conditional composite likelihood for Bayesian inference on Gibbs random fields.",
                    "A Dirichlet Process Mixture Model for Spherical Data.",
                    "Inferring Block Structure of Graphical Models in Exponential Families.",
                    "Two-stage sampled learning theory on distributions.",
                    "Predicting Preference Reversals via Gaussian Process Uncertainty Aversion.",
                    "Streaming Variational Inference for Bayesian Nonparametric Mixture Models.",
                    "Missing at Random in Graphical Models.",
                    "Particle Gibbs with Ancestor Sampling for Probabilistic Programs.",
                    "Learning of Non-Parametric Control Policies with High-Dimensional State Features.",
                    "Maximally Informative Hierarchical Representations of High-Dimensional Data.",
                    "Falling Rule Lists.",
                    "Multi-Manifold Modeling in Non-Euclidean spaces.",
                    "Column Subset Selection with Missing Data via Active Sampling.",
                    "Trend Filtering on Graphs.",
                    "A Greedy Homotopy Method for Regression with Nonconvex Constraints.",
                    "Revisiting the Limits of MAP Inference by MWSS on Perfect Graphs.",
                    "Understanding and Evaluating Sparse Linear Discriminant Analysis.",
                    "Stochastic Block Transition Models for Dynamic Networks.",
                    "Majorization-Minimization for Manifold Embedding.",
                    "A la Carte - Learning Fast Kernels.",
                    "Minimizing Nonconvex Non-Separable Functions.",
                    "A Simple Homotopy Algorithm for Compressive Sensing.",
                    "Scalable Nonparametric Multiway Data Analysis.",
                    "Infinite Edge Partition Models for Overlapping Community Detection and Link Prediction.",
                    "Power-Law Graph Cuts.",
                    "The Log-Shift Penalty for Adaptive Estimation of Multiple Gaussian Graphical Models."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "17th AISTATS 2014",
        "info": "Reykjavik, Iceland",
        "venues": [
            {
                "sub_name_abbr": "conf/aistats/2014",
                "sub_name": "Proceedings of the Seventeenth International Conference on Artificial Intelligence and Statistics, AISTATS 2014, Reykjavik, Iceland, April 22-25, 2014.",
                "count": 122,
                "papers": [
                    "Preface.",
                    "Decontamination of Mutually Contaminated Models.",
                    "Distributed optimization of deeply nested systems.",
                    "Analysis of Empirical MAP and Empirical Partially Bayes: Can They be Alternatives to Variational Bayes?",
                    "Improved Bounds for Online Learning Over the Permutahedron and Other Ranking Polytopes.",
                    "Information-Theoretic Characterization of Sparse Recovery.",
                    "Hybrid Discriminative-Generative Approach with Gaussian Processes.",
                    "Average Case Analysis of High-Dimensional Block-Sparse Recovery and Regression for Arbitrary Designs.",
                    "A New Perspective on Learning Linear Separators with Large \\(L_qL_p\\) Margins.",
                    "A Non-parametric Conditional Factor Regression Model for Multi-Dimensional Input and Response.",
                    "Learning Optimal Bounded Treewidth Bayesian Networks via Maximum Satisfiability.",
                    "Online Passive-Aggressive Algorithms for Non-Negative Matrix Factorization and Completion.",
                    "PAC-Bayesian Theory for Transductive Learning.",
                    "Random Bayesian networks with bounded indegree.",
                    "Efficient Low-Rank Stochastic Gradient Descent Methods for Solving Semidefinite Programs.",
                    "Characterizing EVOI-Sufficient k-Response Query Sets in Decision Problems.",
                    "Doubly Aggressive Selective Sampling Algorithms for Classification.",
                    "Sparse Bayesian Variable Selection for the Identification of Antigenic Variability in the Foot-and-Mouth Disease Virus.",
                    "Sparsity and the truncated \\(l^2\\)-norm.",
                    "Efficient Distributed Topic Modeling with Provable Guarantees.",
                    "Pan-sharpening with a Bayesian nonparametric dictionary learning model.",
                    "Approximate Slice Sampling for Bayesian Posterior Inference.",
                    "Bayesian Logistic Gaussian Process Models for Dynamic Networks.",
                    "Avoiding pathologies in very deep networks.",
                    "Efficient Inference for Complex Queries on Complex Distributions.",
                    "Bayesian Switching Interaction Analysis Under Uncertainty.",
                    "Robust learning of inhomogeneous PMMs.",
                    "Fully-Automatic Bayesian Piecewise Sparse Linear Models.",
                    "Learning with Maximum A-Posteriori Perturbation Models.",
                    "Sketching the Support of a Probability Measure.",
                    "Robust Stochastic Principal Component Analysis.",
                    "Bayesian Nonparametric Poisson Factorization for Recommendation Systems.",
                    "Efficiently Enforcing Diversity in Multi-Output Structured Prediction.",
                    "Learning and Evaluation in Presence of Non-i.i.d. Label Noise.",
                    "Analytic Long-Term Forecasting with Periodic Gaussian Processes.",
                    "On Estimating Causal Effects based on Supplemental Variables.",
                    "Non-Asymptotic Analysis of Relational Learning with One Network.",
                    "Exploiting the Limits of Structure Learning via Inherent Symmetry.",
                    "A Statistical Model for Event Sequence Data.",
                    "Probabilistic Solutions to Differential Equations and their Application to Riemannian Statistics.",
                    "Tilted Variational Bayes.",
                    "On correlation and budget constraints in model-based bandit optimization with application to automatic machine learning.",
                    "Optimality of Thompson Sampling for Gaussian Bandits Depends on Priors.",
                    "Tight Bounds for the Expected Risk of Linear Classifiers and PAC-Bayes Finite-Sample Guarantees.",
                    "Latent Gaussian Models for Topic Modeling.",
                    "A Finite-Sample Generalization Bound for Semiparametric Regression: Partially Linear Models.",
                    "Global Optimization Methods for Extended Fisher Discriminant Analysis.",
                    "High-Dimensional Density Ratio Estimation with Extensions to Approximate Likelihood Computation.",
                    "Near Optimal Bayesian Active Learning for Decision Making.",
                    "A Level-set Hit-and-run Sampler for Quasi-Concave Distributions.",
                    "New Bounds on Compressive Linear Least Squares Regression.",
                    "Recovering Distributions from Gaussian RKHS Embeddings.",
                    "Collaborative Ranking for Local Preferences.",
                    "Scalable Collaborative Bayesian Preference Learning.",
                    "A Gaussian Latent Variable Model for Large Margin Classification of Labeled and Unlabeled Data.",
                    "Scalable Variational Bayesian Matrix Factorization with Side Information.",
                    "Algebraic Reconstruction Bounds and Explicit Inversion for Phase Retrieval at the Identifiability Threshold.",
                    "Visual Boundary Prediction: A Deep Neural Prediction Network and Quality Dissection.",
                    "Low-Rank Spectral Learning.",
                    "Fugue: Slow-Worker-Agnostic Distributed Learning for Big Models on Big Data.",
                    "Computational Education using Latent Structured Prediction.",
                    "Towards building a Crowd-Sourced Sky Map.",
                    "Incremental Tree-Based Inference with Dependent Normalized Random Measures.",
                    "Jointly Informative Feature Selection.",
                    "Learning Heterogeneous Hidden Markov Random Fields.",
                    "PAC-Bayesian Collective Stability.",
                    "Active Area Search via Bayesian Quadrature.",
                    "Active Boundary Annotation using Random MAP Perturbations.",
                    "Interpretable Sparse High-Order Boltzmann Machines.",
                    "Efficient Lifting of MAP LP Relaxations Using k-Locality.",
                    "A Geometric Algorithm for Scalable Multiple Kernel Learning.",
                    "On the Testability of Models with Missing Data.",
                    "Selective Sampling with Drift.",
                    "The Dependent Dirichlet Process Mixture of Objects for Detection-free Tracking and Object Modeling.",
                    "Bias Reduction and Metric Learning for Nearest-Neighbor Estimation of Kullback-Leibler Divergence.",
                    "Robust Forward Algorithms via PAC-Bayes and Laplace Distributions.",
                    "Joint Structure Learning of Multiple Non-Exchangeable Networks.",
                    "Scaling Nonparametric Bayesian Inference via Subsample-Annealing.",
                    "Fast Distribution To Real Regression.",
                    "FuSSO: Functional Shrinkage and Selection Operator.",
                    "To go deep or wide in learning?",
                    "LAMORE: A Stable, Scalable Approach to Latent Vector Autoregressive Modeling of Categorical Time Series.",
                    "Spoofing Large Probability Mass Functions to Improve Sampling Times and Reduce Memory Costs.",
                    "Learning Bounded Tree-width Bayesian Networks using Integer Linear Programming.",
                    "An Efficient Algorithm for Large Scale Compressive Feature Learning.",
                    "Expectation Propagation for Likelihoods Depending on an Inner Product of Two Multivariate Random Variables.",
                    "An inclusion optimal algorithm for chain graph structure learning.",
                    "A Stepwise uncertainty reduction approach to constrained global optimization.",
                    "Connected Sub-graph Detection.",
                    "An Analysis of Active Learning with Uniform Feature Noise.",
                    "Black Box Variational Inference.",
                    "Cluster Canonical Correlation Analysis.",
                    "Sequential crowdsourced labeling as an epsilon-greedy exploration in a Markov Decision Process.",
                    "Learning Structured Models with the AUC Loss and Its Generalizations.",
                    "Class Proportion Estimation with Application to Multiclass Anomaly Rejection.",
                    "Lifted MAP Inference for Markov Logic Networks.",
                    "Estimating Dependency Structures for non-Gaussian Components with Linear and Energy Correlations.",
                    "Student-t Processes as Alternatives to Gaussian Processes.",
                    "In Defense of Minhash over Simhash.",
                    "Loopy Belief Propagation in the Presence of Determinism.",
                    "Explicit Link Between Periodic Covariance Functions and State Space Models.",
                    "Bat Call Identification with Gaussian Process Multinomial Probit Regression and a Dynamic Time Warping Kernel.",
                    "SMERED: A Bayesian Approach to Graphical Record Linkage and De-duplication.",
                    "Adaptive Variable Clustering in Gaussian Graphical Models.",
                    "Scaling Graph-based Semi Supervised Learning to Large Number of Labels Using Count-Min Sketch.",
                    "Path Thresholding: Asymptotically Tuning-Free High-Dimensional Sparse Regression.",
                    "Active Learning for Undirected Graphical Model Selection.",
                    "Linear-time training of nonlinear low-dimensional embeddings.",
                    "Gaussian Copula Precision Estimation with Missing Values.",
                    "An LP for Sequential Learning Under Budgets.",
                    "Efficient Algorithms and Error Analysis for the Modified Nystrom Method.",
                    "Bayesian Multi-Scale Optimistic Optimization.",
                    "Accelerating ABC methods using Gaussian processes.",
                    "A New Approach to Probabilistic Programming Inference.",
                    "Dynamic Resource Allocation for Optimizing Population Diffusion.",
                    "Mixed Graphical Models via Exponential Families.",
                    "Context Aware Group Nearest Shrunken Centroids in Large-Scale Genomic Studies.",
                    "Nonparametric estimation and testing of exchangeable graph models.",
                    "Generating Efficient MCMC Kernels from Probabilistic Programs.",
                    "Efficient Transfer Learning Method for Automatic Hyperparameter Tuning.",
                    "Accelerated Stochastic Gradient Method for Composite Regularization.",
                    "Heterogeneous Domain Adaptation for Multiple Classes."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "16th AISTATS 2013",
        "info": "Scottsdale, AZ, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/aistats/2013",
                "sub_name": "Proceedings of the Sixteenth International Conference on Artificial Intelligence and Statistics, AISTATS 2013, Scottsdale, AZ, USA, April 29 - May 1, 2013.",
                "count": 71,
                "papers": [
                    "Bayesian learning of joint distributions of objects.",
                    "Permutation estimation and minimax rates of identifiability.",
                    "A unifying representation for a class of dependent random measures.",
                    "Diagonal Orthant Multinomial Probit Models.",
                    "Distributed Learning of Gaussian Graphical Models via Marginal Likelihoods.",
                    "Sparse Principal Component Analysis for High Dimensional Multivariate Time Series.",
                    "A Competitive Test for Uniformity of Monotone Distributions.",
                    "Clustering Oligarchies.",
                    "Reconstructing ecological networks with hierarchical Bayesian regression and Mondrian processes.",
                    "Nystrom Approximation for Large-Scale Determinantal Processes.",
                    "Further Optimal Regret Bounds for Thompson Sampling.",
                    "Distributed and Adaptive Darting Monte Carlo through Regenerations.",
                    "Consensus Ranking with Signed Permutations.",
                    "Ultrahigh Dimensional Feature Screening via RKHS Embeddings.",
                    "Meta-Transportability of Causal Effects: A Formal Approach.",
                    "Convex Collective Matrix Factorization.",
                    "Efficiently Sampling Probabilistic Programs via Program Analysis.",
                    "Computing the M Most Probable Modes of a Graphical Model.",
                    "A simple criterion for controlling selection bias.",
                    "Evidence Estimation for Bayesian Partially Observed MRFs.",
                    "Why Steiner-tree type algorithms work for community detection.",
                    "A simple sketching algorithm for entropy estimation over streaming data.",
                    "Deep Gaussian Processes.",
                    "ODE parameter inference using adaptive gradient matching with Gaussian processes.",
                    "Uncover Topic-Sensitive Information Diffusion Networks.",
                    "Stochastic blockmodeling of relational event dynamics.",
                    "Dynamic Copula Networks for Modeling Real-valued Time Series.",
                    "Data-driven covariate selection for nonparametric estimation of causal effects.",
                    "Learning to Top-K Search using Pairwise Comparisons.",
                    "Predictive Correlation Screening: Application to Two-stage Predictor Design in High Dimension.",
                    "Mixed LICORS: A Nonparametric Algorithm for Predictive State Reconstruction.",
                    "Unsupervised Link Selection in Networks.",
                    "Clustered Support Vector Machines.",
                    "DivMCuts: Faster Training of Structural SVMs with Diverse M-Best Cutting-Planes.",
                    "Recursive Karcher Expectation Estimators And Geometric Law of Large Numbers.",
                    "DYNACARE: Dynamic Cardiac Arrest Risk Estimation.",
                    "Active Learning for Interactive Visualization.",
                    "A Parallel, Block Greedy Method for Sparse Inverse Covariance Estimation for Ultra-high Dimensions.",
                    "Beyond Sentiment: The Manifold of Human Emotions.",
                    "Exact Learning of Bounded Tree-width Bayesian Networks.",
                    "Structural Expectation Propagation (SEP): Bayesian structure learning for networks with latent variables.",
                    "Structure Learning of Mixed Graphical Models.",
                    "Dynamic Scaled Sampling for Deterministic Constraints.",
                    "Learning Markov Networks With Arithmetic Circuits.",
                    "Texture Modeling with Convolutional Spike-and-Slab RBMs and Deep Extensions.",
                    "Fast Near-GRID Gaussian Process Regression.",
                    "Estimating the Partition Function of Graphical Models Using Langevin Importance Sampling.",
                    "Thompson Sampling in Switching Environments with Bayesian Online Change Detection.",
                    "A Last-Step Regression Algorithm for Non-Stationary Online Learning.",
                    "Competing with an Infinite Set of Models in Reinforcement Learning.",
                    "Efficient Variational Inference for Gaussian Process Regression Networks.",
                    "High-dimensional Inference via Lipschitz Sparsity-Yielding Regularizers.",
                    "Bayesian Structure Learning for Functional Neuroimaging.",
                    "Random Projections for Support Vector Machines.",
                    "Distribution-Free Distribution Regression.",
                    "Localization and Adaptation in Online Learning.",
                    "A recursive estimate for the predictive likelihood in a topic model.",
                    "Detecting Activations over Graphs using Spanning Tree Wavelet Bases.",
                    "Changepoint Detection over Graphs with the Spectral Scan Statistic.",
                    "Central Limit Theorems for Conditional Markov Chains.",
                    "Statistical Tests for Contagion in Observational Social Network Studies.",
                    "Completeness Results for Lifted Variable Elimination.",
                    "Supervised Sequential Classification Under Budget Constraints.",
                    "On the Asymptotic Optimality of Maximum Margin Bayesian Networks.",
                    "Collapsed Variational Bayesian Inference for Hidden Markov Models.",
                    "Block Regularized Lasso for Multivariate Multi-Response Linear Regression.",
                    "Bethe Bounds and Approximating the Global Optimum.",
                    "Dual Decomposition for Joint Discrete-Continuous Optimization.",
                    "Learning Social Infectivity in Sparse Low-rank Networks Using Multi-dimensional Hawkes Processes.",
                    "Greedy Bilateral Sketch, Completion & Smoothing.",
                    "Scoring anomalies: a M-estimation formulation."
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "15th AISTATS 2012",
        "info": "La Palma, Canary Islands",
        "venues": [
            {
                "sub_name_abbr": "conf/aistats/2012",
                "sub_name": "Proceedings of the Fifteenth International Conference on Artificial Intelligence and Statistics, AISTATS 2012, La Palma, Canary Islands, Spain, April 21-23, 2012.",
                "count": 158,
                "papers": [
                    "Preface.",
                    "Online-to-Confidence-Set Conversions and Application to Sparse Stochastic Bandits.",
                    "Discriminative Mixtures of Sparse Latent Fields for Risk Management.",
                    "Contextual Bandit Learning with Predictable Rewards.",
                    "Sparse Higher-Order Principal Components Analysis.",
                    "Factorized Diffusion Map Approximation.",
                    "Memory-efficient inference in dynamic graphical models using multiple cores.",
                    "Graphlet decomposition of a weighted network.",
                    "Minimax rates for homology inference.",
                    "Scalable Personalization of Long-Term Physiological Monitoring: Active Learning Methodologies for Epileptic Seizure Onset Detection.",
                    "A General Framework for Structured Sparsity via Proximal Optimization.",
                    "Adaptive Metropolis with Online Relabeling.",
                    "Controlling Selection Bias in Causal Inference.",
                    "CorrLog: Correlated Logistic Models for Joint Prediction of Multiple Labels.",
                    "History-alignment models for bias-aware prediction of virological response to HIV combination therapy.",
                    "Joint Learning of Words and Meaning Representations for Open-Text Semantic Parsing.",
                    "Sample Complexity of Composite Likelihood.",
                    "A Family of MCMC Methods on Implicitly Defined Manifolds.",
                    "On Sparse, Spectral and Other Parameterizations of Binary Probabilistic Models.",
                    "Optimistic planning for Markov decision processes.",
                    "Bandit Theory meets Compressed Sensing for high dimensional Stochastic Linear Bandit.",
                    "Structured Sparse Canonical Correlation Analysis.",
                    "A Two-Graph Guided Multi-task Lasso Approach for eQTL Mapping.",
                    "Classifier Cascade for Minimizing Feature Evaluation Cost.",
                    "Online Clustering with Experts.",
                    "Minimax hypothesis testing for curve registration.",
                    "Fast, Exact Model Selection and Permutation Testing for l2-Regularized Logistic Regression.",
                    "Gaussian Processes for time-marked time-series data.",
                    "Wilks' phenomenon and penalized likelihood-ratio test for nonparametric curve registration.",
                    "Hierarchical Relative Entropy Policy Search.",
                    "Protocols for Learning Classifiers on Distributed Data.",
                    "There's a Hole in My Data Space: Piecewise Predictors for Heterogeneous Learning Problems.",
                    "Deterministic Annealing for Semi-Supervised Structured Output Learning.",
                    "A metric learning perspective of SVM: on the relation of LMNN and SVM.",
                    "Generic Methods for Optimization-Based Modeling.",
                    "Lifted coordinate descent for learning with trace-norm regularization.",
                    "Error bounds for Kernel Fisher Linear Discriminant in Gaussian Hilbert space.",
                    "Copula Network Classifiers (CNCs).",
                    "Lightning-speed Structure Learning of Nonlinear Continuous Networks.",
                    "Statistical test for consistent estimation of causal effects in linear non-Gaussian models.",
                    "High-Rank Matrix Completion.",
                    "No Internal Regret via Neighborhood Watch.",
                    "Semiparametric Pseudo-Likelihood Estimation in Markov Random Fields.",
                    "Factorized Asymptotic Bayesian Inference for Mixture Modeling.",
                    "Hierarchical Latent Dictionaries for Models of Brain Activation.",
                    "UPAL: Unbiased Pool Based Active Learning.",
                    "Regularization Paths with Guarantees for Convex Semidefinite Optimization.",
                    "Scalable Inference on Kingman's Coalescent using Pair Similarity .",
                    "On Average Reward Policy Evaluation in Infinite-State Partially Observable Systems.",
                    "SpeedBoost: Anytime Prediction with Uniform Near-Optimality.",
                    "Bayesian regularization of non-homogeneous dynamic Bayesian networks by globally coupling interaction parameters.",
                    "Locality Preserving Feature Learning.",
                    "Evaluation of marginal likelihoods via the density of states.",
                    "Information Theoretic Model Validation for Spectral Clustering.",
                    "Exchangeability Characterizes Optimality of Sequential Normalized Maximum Likelihood and Bayesian Prediction with Jeffreys Prior.",
                    "Kernel Topic Models.",
                    "Maximum Margin Temporal Clustering.",
                    "Stochastic Bandit Based on Empirical Moments.",
                    "Variable Selection for Gaussian Graphical Models.",
                    "Subset Infinite Relational Models.",
                    "A Variance Minimization Criterion to Active Learning on Graphs.",
                    "Detecting Network Cliques with Radon Basis Pursuit.",
                    "High-dimensional Sparse Inverse Covariance Estimation using Greedy Methods.",
                    "Random Feature Maps for Dot Product Kernels.",
                    "On Bayesian Upper Confidence Bounds for Bandit Problems.",
                    "Online Clustering of Processes.",
                    "A Stick-Breaking Likelihood for Categorical Data Analysis with Latent Gaussian Models.",
                    "Bayesian Classifier Combination.",
                    "Regression for sets of polynomial equations.",
                    "Multiple Texture Boltzmann Machines.",
                    "Marginal Regression For Multitask Learning.",
                    "Message-Passing Algorithms for MAP Estimation Using DC Programming.",
                    "Bayesian Comparison of Machine Learning Algorithms on Single and Multiple Datasets.",
                    "Efficient Hypergraph Clustering.",
                    "Data dependent kernels in nearly-linear time.",
                    "Efficient Sampling from Combinatorial Space via Bridging.",
                    "Exact Subspace Segmentation and Outlier Detection by Low-Rank Representation.",
                    "High-Dimensional Structured Feature Screening Using Binary Markov Random Fields.",
                    "A Simple Geometric Interpretation of SVM using Stochastic Adversaries.",
                    "Closed-Form Entropy Limits - A Tool to Monitor Likelihood Optimization of Probabilistic Generative Models.",
                    "Efficient Gaussian Process Inference for Short-Scale Spatio-Temporal Modeling.",
                    "Adaptive MCMC with Bayesian Optimization.",
                    "Movement Segmentation and Recognition for Imitation Learning.",
                    "Globally Optimizing Graph Partitioning Problems Using Message Passing.",
                    "Max-Margin Min-Entropy Models.",
                    "Lifted Linear Programming.",
                    "Deep Boltzmann Machines as Feed-Forward Hierarchies.",
                    "The adversarial stochastic shortest path problem with unknown transition probabilities.",
                    "A Nonparametric Bayesian Model for Multiple Clustering with Overlapping Feature Views.",
                    "Beyond Logarithmic Bounds in Online Learning.",
                    "Bayesian Quadrature for Ratios.",
                    "Probabilistic acoustic tube: a probabilistic generative model of speech for speech analysis/synthesis.",
                    "Stick-Breaking Beta Processes and the Poisson Process.",
                    "On a Connection between Maximum Variance Unfolding, Shortest Path Problems and IsoMap.",
                    "Approximate Inference by Intersecting Semidefinite Bound and Local Polytope.",
                    "Part & Clamp: Efficient Structured Output Learning.",
                    "Learning Low-order Models for Enforcing High-order Statistics.",
                    "Fast interior-point inference in high-dimensional sparse, penalized state-space models.",
                    "Informative Priors for Markov Blanket Discovery.",
                    "Nonparametric Estimation of Conditional Information and Divergences.",
                    "Deep Learning Made Easier by Linear Transformations in Perceptrons.",
                    "A Differentially Private Stochastic Gradient Descent Algorithm for Multiparty Classification.",
                    "Universal Measurement Bounds for Structured Sparse Signal Recovery.",
                    "Exploiting Unrelated Tasks in Multi-Task Learning.",
                    "Domain Adaptation: A Small Sample Statistical Approach.",
                    "Local Anomaly Detection.",
                    "Age-Layered Expectation Maximization for Parameter Learning in Bayesian Networks.",
                    "Infinite-Dimensional Kalman Filtering Approach to Spatio-Temporal Gaussian Process Regression.",
                    "Markov Logic Mixtures of Gaussian Processes: Towards Machines Reading Regression Data.",
                    "Fast Variational Bayesian Inference for Non-Conjugate Matrix Factorization Models.",
                    "Using More Data to Speed-up Training Time.",
                    "Sparsistency of the Edge Lasso over Graphs.",
                    "Complexity of Bethe Approximation.",
                    "Multi-armed Bandit Problems with History.",
                    "On Bisubmodular Maximization.",
                    "Low rank continuous-space graphical models.",
                    "On Nonparametric Guidance for Learning Autoencoder Representations.",
                    "Joint Estimation of Structured Sparsity and Output Structure in Multiple-Output Regression via Inverse-Covariance Regularization.",
                    "Consistency and Rates for Clustering with DBSCAN.",
                    "Testing for Membership to the IFRA and the NBU Classes of Distributions.",
                    "Flexible Martingale Priors for Deep Hierarchies.",
                    "Bayesian Inference for Change Points in Dynamical Systems with Reusable States - a Chinese Restaurant Process Approach.",
                    "Learning Fourier Sparse Set Functions.",
                    "Efficient and Exact MAP-MRF Inference using Branch and Bound.",
                    "Constrained 1-Spectral Clustering.",
                    "Fast Learning Rate of Multiple Kernel Learning: Trade-Off between Sparsity and Smoothness.",
                    "On Estimation and Selection for Topic Models.",
                    "Lifted Variable Elimination with Arbitrary Constraints.",
                    "Multiresolution Deep Belief Networks.",
                    "Structured Output Learning with High Order Loss Functions.",
                    "Randomized Optimum Models for Structured Prediction.",
                    "Fast Variational Mode-Seeking.",
                    "A Bayesian Analysis of the Radioactive Releases of Fukushima.",
                    "Learning from Weak Teachers.",
                    "Krylov Subspace Descent for Deep Learning.",
                    "Bayesian Group Factor Analysis.",
                    "Minimax Rates of Estimation for Sparse PCA in High Dimensions.",
                    "A Hybrid Neural Network-Latent Topic Model.",
                    "Nonlinear low-dimensional regression using auxiliary coordinates.",
                    "Generalized Optimal Reverse Prediction.",
                    "Causality with Gates.",
                    "Primal-Dual methods for sparse constrained matrix completion.",
                    "Statistical Optimization in High Dimensions.",
                    "Robust Multi-task Regression with Grossly Corrupted Observations.",
                    "Active Learning from Multiple Knowledge Sources.",
                    "Perturbation based Large Margin Approach for Ranking.",
                    "Transductive Learning of Structural SVMs via Prior Knowledge Constraints.",
                    "Forward Basis Selection for Sparse Approximation over Dictionary.",
                    "Quilting Stochastic Kronecker Product Graphs to Generate Multiplicative Attribute Graphs.",
                    "Efficient Distributed Linear Classification Algorithms via the Alternating Direction Method of Multipliers.",
                    "A Composite Likelihood View for Multi-Label Classification.",
                    "An Autoregressive Approach to Nonparametric Hierarchical Dependent Modeling.",
                    "Scaling up Kernel SVM on Limited Resources: A Low-rank Linearization Approach.",
                    "Sparse Additive Machine.",
                    "Multi-label Subspace Ensemble.",
                    "Online Incremental Feature Learning with Denoising Autoencoders.",
                    "Beta-Negative Binomial Process and Poisson Factor Analysis.",
                    "Approximate Inference in Additive Factorial HMMs with Application to Energy Disaggregation."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "14th AISTATS 2011",
        "info": "Fort Lauderdale, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/aistats/2011",
                "sub_name": "Proceedings of the Fourteenth International Conference on Artificial Intelligence and Statistics, AISTATS 2011, Fort Lauderdale, USA, April 11-13, 2011.",
                "count": 107,
                "papers": [
                    "Preface.",
                    "Learning equivalence classes of acyclic models with latent and selection variables from multiple datasets with overlapping variables.",
                    "Discussion of \"Learning Equivalence Classes of Acyclic Models with Latent and Selection Variables from Multiple Datasets with Overlapping Variables\".",
                    "Contextual Bandit Algorithms with Supervised Learning Guarantees.",
                    "Discussion of \"Contextual Bandit Algorithms with Supervised Learning Guarantees\".",
                    "The Neural Autoregressive Distribution Estimator.",
                    "Discussion of \"The Neural Autoregressive Distribution Estimator\".",
                    "Learning Scale Free Networks by Reweighted L1 regularization.",
                    "Discussion of \"Learning Scale Free Networks by Reweighted L1 regularization\".",
                    "Spectral Dimensionality Reduction via Maximum Entropy.",
                    "Discussion of \"Spectral Dimensionality Reduction via Maximum Entropy\".",
                    "A conditional game for comparing approximations.",
                    "Discussion of \"A conditional game for comparing approximations\".",
                    "The Discrete Infinite Logistic Normal Distribution for Mixed-Membership Modeling.",
                    "Discussion of \"The Discrete Infinite Logistic Normal Distribution for Mixed-Membership Modeling\".",
                    "Generative Kernels for Exponential Families.",
                    "Linear-Time Estimators for Propensity Scores.",
                    "Online Inference for the Infinite Topic-Cluster Model: Storylines from Streaming Text.",
                    "Polytope samplers for inference in ill-posed inverse problems.",
                    "Dynamic Policy Programming with Function Approximation.",
                    "Statistical Optimization of Non-Negative Matrix Factorization.",
                    "Unsupervised Supervised Learning II: Margin-Based Classification without Labels.",
                    "Tighter Relaxations for MAP-MRF Inference: A Local Primal-Dual Gap based Separation Algorithm.",
                    "Active Diagnosis under Persistent Noise with Unknown Noise Distribution: A Rank-Based Approach.",
                    "Deep Learners Benefit More from Out-of-Distribution Examples.",
                    "Domain Adaptation with Coupled Subspaces.",
                    "Relative Entropy Inverse Reinforcement Learning.",
                    "Switch-Reset Models : Exact and Approximate Inference.",
                    "Concave Gaussian Variational Approximations for Inference in Large-Scale Bayesian Linear Models.",
                    "Contextual Bandits with Linear Payoff Functions.",
                    "An Analysis of Single-Layer Networks in Unsupervised Feature Learning.",
                    "Deep Learning for Efficient Discriminative Parsing.",
                    "A Spike and Slab Restricted Boltzmann Machine.",
                    "Optimal and Robust Price Experimentation: Learning by Lottery.",
                    "Bagged Structure Learning of Bayesian Network.",
                    "Active Clustering: Robust and Efficient Hierarchical Clustering using Adaptively Selected Similarities.",
                    "A novel greedy algorithm for Nyström approximation.",
                    "Revisiting MAP Estimation, Message Passing and Perfect Graphs.",
                    "A Dynamic Relational Infinite Feature Model for Longitudinal Social Networks.",
                    "Block-sparse Solutions using Kernel Block RIP and its Application to Group Lasso.",
                    "Learning from positive and unlabeled examples by enforcing statistical significance.",
                    "Deep Sparse Rectifier Neural Networks.",
                    "Parallel Gibbs Sampling: From Colored Fields to Thin Junction Trees.",
                    "Multiscale Community Blockmodel for Network Exploration.",
                    "Evolving Cluster Mixed-Membership Blockmodel for Time-Evolving Networks.",
                    "Optimal Distributed Market-Based Planning for Multi-Agent Systems with Shared Resources.",
                    "Fast b-matching via Sufficient Selection Belief Propagation.",
                    "Improved Loss Bounds For Multiple Kernel Learning.",
                    "On Learning Discrete Graphical Models using Group-Sparse Regularization.",
                    "Convergent Decomposition Solvers for Tree-reweighted Free Energies.",
                    "Convex envelopes of complexity controlling penalties: the case against premature envelopment.",
                    "On Time Varying Undirected Graphs.",
                    "Approximate inference for the loss-calibrated Bayesian.",
                    "Robust Bayesian Matrix Factorisation.",
                    "Confidence Weighted Mean Reversion Strategy for On-Line Portfolio Selection.",
                    "Bayesian Hierarchical Cross-Clustering.",
                    "Group Orthogonal Matching Pursuit for Logistic Regression.",
                    "A Fast Algorithm for Recovery of Jointly Sparse Vectors based on the Alternating Direction Methods.",
                    "Learning Class-relevant Features and Class-irrelevant Features via a Hybrid third-order RBM.",
                    "Hidden-Unit Conditional Random Fields.",
                    "Learning mixtures of Gaussians with maximum-a-posteriori oracle.",
                    "CAKE: Convex Adaptive Kernel Density Estimation.",
                    "Online Learning of Structured Predictors with Multiple Kernels.",
                    "Estimating beta-mixing coefficients.",
                    "Follow-the-Regularized-Leader and Mirror Descent: Equivalence Theorems and L1 Regularization.",
                    "Can matrix coherence be efficiently and accurately estimated?",
                    "TopicFlow Model: Unsupervised Learning of Topic-specific Influences of Hyperlinked Documents.",
                    "Dimensionality Reduction for Spectral Clustering.",
                    "Maximum Volume Clustering.",
                    "Adaptive Bandits: Towards the best history-dependent strategy.",
                    "Generative Modeling for Maximizing Precision and Recall in Information Visualization.",
                    "Faithfulness in Chain Graphs: The Gaussian Case.",
                    "Directional Statistics on Permutations.",
                    "On the Estimation of alpha-Divergences.",
                    "On NDCG Consistency of Listwise Ranking Methods.",
                    "A Reduction of Imitation Learning and Structured Prediction to No-Regret Online Learning.",
                    "Improved Regret Guarantees for Online Smooth Convex Optimization with Bandit Feedback.",
                    "Online Learning of Multiple Tasks and Their Relationships.",
                    "Fast Convergent Algorithms for Expectation Propagation Approximate Bayesian Inference.",
                    "Spectral Clustering on a Budget.",
                    "Mixed Cumulative Distribution Networks.",
                    "Asymptotic Theory for Linear-Chain Conditional Random Fields.",
                    "Assisting Main Task Learning by Heterogeneous Auxiliary Tasks with Applications to Skin Cancer Screening.",
                    "Spectral Chinese Restaurant Processes: Nonparametric Clustering Based on Similarities.",
                    "Kernel Belief Propagation.",
                    "Machine Learning Markets.",
                    "Empirical Risk Minimization of Graphical Model Parameters Given Approximate Inference, Decoding, and Model Structure.",
                    "Estimating Probabilities in Recommendation Systems.",
                    "Active Boosted Learning (ActBoost).",
                    "Online Variational Inference for the Hierarchical Dirichlet Process.",
                    "Information Theoretical Clustering via Semidefinite Programming.",
                    "Lightweight Implementations of Probabilistic Programming Languages Via Transformational Compilation.",
                    "Relational Learning with One Network: An Asymptotic Analysis.",
                    "Hierarchical Probabilistic Models for Group Anomaly Detection.",
                    "Multicore Gibbs Sampling in Dense, Unstructured Graphs.",
                    "Cross-Domain Object Matching with Model Selection.",
                    "The Sample Complexity of Self-Verifying Bayesian Active Learning.",
                    "Bridging the Language Gap: Topic Adaptation for Documents with Different Technicality.",
                    "Efficient variable selection in support vector machines via the alternating direction method of multipliers.",
                    "A Finite Newton Algorithm for Non-degenerate Piecewise Linear Systems.",
                    "An Instantiation-Based Theorem Prover for First-Order Programming.",
                    "Generalization Bound for Infinitely Divisible Empirical Process.",
                    "Multi-Label Output Codes using Canonical Correlation Analysis.",
                    "Dependent Hierarchical Beta Process for Image Interpolation and Denoising.",
                    "Semi-supervised Learning by Higher Order Regularization.",
                    "Error Analysis of Laplacian Eigenmaps for Semi-supervised Learning.",
                    "Two-Layer Multiple Kernel Learning."
                ]
            }
        ]
    },
    {
        "year": "2010",
        "name": "13th AISTATS 2010",
        "info": "Sardinia, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/aistats/2010",
                "sub_name": "Proceedings of the Thirteenth International Conference on Artificial Intelligence and Statistics, AISTATS 2010, Chia Laguna Resort, Sardinia, Italy, May 13-15, 2010.",
                "count": 126,
                "papers": [
                    "Preface.",
                    "Learning the Structure of Deep Sparse Graphical Models.",
                    "Optimal Allocation Strategies for the Dark Pool Problem.",
                    "Multitask Learning for Brain-Computer Interfaces.",
                    "Efficient Multioutput Gaussian Processes through Variational Inducing Kernels.",
                    "Learning with Blocks: Composite Likelihood and Contrastive Divergence.",
                    "Deterministic Bayesian inference for the p* model.",
                    "Half Transductive Ranking.",
                    "Kernel Partial Least Squares is Universally Consistent.",
                    "Towards Understanding Situated Natural Language.",
                    "Using Descendants as Instrumental Variables for the Identification of Direct Causal Effects in Linear SEMs.",
                    "Why are DBNs sparse?",
                    "Focused Belief Propagation for Query-Specific Inference.",
                    "Parametric Herding.",
                    "Mass Fatality Incident Identification based on nuclear DNA evidence.",
                    "On the Impact of Kernel Approximation on Learning Accuracy.",
                    "Improving posterior marginal approximations in latent Gaussian models.",
                    "Impossibility Theorems for Domain Adaptation.",
                    "Multiclass-Multilabel Classification with More Classes than Examples.",
                    "Tempered Markov Chain Monte Carlo for training of Restricted Boltzmann Machines.",
                    "Feature Selection using Multiple Streams.",
                    "Bayesian variable order Markov models.",
                    "Nonparametric Bayesian Matrix Factorization by Power-EP.",
                    "Neural conditional random fields.",
                    "Combining Experiments to Discover Linear Cyclic Models with Latent Variables.",
                    "Graphical Gaussian modelling of multivariate time series with latent variables.",
                    "Why Does Unsupervised Pre-training Help Deep Learning?",
                    "Semi-Supervised Learning via Generalized Maximum Entropy.",
                    "Model-Free Monte Carlo-like Policy Evaluation.",
                    "A Weighted Multi-Sequence Markov Model For Brain Lesion Segmentation.",
                    "Posterior distributions are computable from predictive distributions.",
                    "Variational methods for Reinforcement Learning.",
                    "Understanding the difficulty of training deep feedforward neural networks.",
                    "On Combining Graph-based Variance Reduction schemes.",
                    "Locally Linear Denoising on Image Manifolds.",
                    "Regret Bounds for Gaussian Process Bandit Problems.",
                    "Sufficient covariates and linear propensity analysis.",
                    "Real-time Multiattribute Bayesian Preference Elicitation with Pairwise Comparison Queries.",
                    "Noise-contrastive estimation: A new estimation principle for unnormalized statistical models.",
                    "Boosted Optimization for Network Classification.",
                    "Dirichlet Process Mixtures of Generalized Linear Models.",
                    "Negative Results for Active Learning with Convex Losses.",
                    "Coherent Inference on Optimal Play in Game Trees.",
                    "Collaborative Filtering via Rating Concentration.",
                    "Maximum-likelihood learning of cumulative distribution functions on graphs.",
                    "Learning Nonlinear Dynamic Models from Non-sequenced Data.",
                    "Learning Bayesian Network Structure using LP Relaxations.",
                    "Structured Sparse Principal Component Analysis.",
                    "Nonlinear functional regression: a functional RKHS approach.",
                    "Learning Exponential Families in High-Dimensions: Strong Convexity and Sparsity.",
                    "Collaborative Filtering on a Budget.",
                    "Fast Active-set-type Algorithms for L1-regularized Linear Regression.",
                    "Online Anomaly Detection under Adversarial Impact.",
                    "Ultra-high Dimensional Multiple Output Learning With Simultaneous Orthogonal Matching Pursuit: Screening Approach.",
                    "Semi-Supervised Learning with Max-Margin Graph Cuts.",
                    "Solving the Uncapacitated Facility Location Problem Using Message Passing Algorithms.",
                    "Relating Function Class Complexity and Cluster Structure in the Function Domain with Applications to Transduction.",
                    "The Feature Selection Path in Kernel Methods.",
                    "Simple Exponential Family PCA.",
                    "The Group Dantzig Selector.",
                    "Descent Methods for Tuning Parameter Refinement.",
                    "Exploiting Covariate Similarity in Sparse Regression via the Pairwise Elastic Net.",
                    "Contextual Multi-Armed Bandits.",
                    "Exploiting Feature Covariance in High-Dimensional Online Learning.",
                    "Supervised Dimension Reduction Using Bayesian Mixture Modeling.",
                    "Inductive Principles for Restricted Boltzmann Machine Learning.",
                    "Parallelizable Sampling of Markov Random Fields.",
                    "Exploiting Within-Clique Factorizations in Junction-Tree Algorithms.",
                    "Discriminative Topic Segmentation of Text and Speech.",
                    "Elliptical slice sampling.",
                    "Near-Optimal Evasion of Convex-Inducing Classifiers.",
                    "Incremental Sparsification for Real-time Online Model Learning.",
                    "Fluid Dynamics Models for Low Rank Discriminant Analysis.",
                    "Approximation of hidden Markov models by mixtures of experts with application to particle filtering.",
                    "A generalization of the Multiple-try Metropolis algorithm for Bayesian estimation and model selection.",
                    "Bayesian structure discovery in Bayesian networks with less space.",
                    "Identifying Cause and Effect on Discrete Data using Additive Noise Models.",
                    "REGO: Rank-based Estimation of Renyi Information using Euclidean Graph Optimization.",
                    "Infinite Predictor Subspace Models for Multitask Learning.",
                    "Factored 3-Way Restricted Boltzmann Machines For Modeling Natural Images.",
                    "Nonparametric prior for adaptive sparsity.",
                    "Convexity of Proper Composite Binary Losses.",
                    "Gaussian processes with monotonicity information.",
                    "A Regularization Approach to Nonlinear Variable Selection.",
                    "Efficient Reductions for Imitation Learning.",
                    "Approximate parameter inference in a stochastic reaction-diffusion model.",
                    "Active Sequential Learning with Tactile Feedback.",
                    "Reducing Label Complexity by Learning From Bags.",
                    "Efficient Learning of Deep Boltzmann Machines.",
                    "Factorized Orthogonal Latent Spaces.",
                    "Convex Structure Learning in Log-Linear Models: Beyond Pairwise Potentials.",
                    "Polynomial-Time Exact Inference in NP-Hard Binary MRFs via Reweighted Perfect Matching.",
                    "Dense Message Passing for Sparse Principal Component Analysis.",
                    "Empirical Bernstein Boosting.",
                    "Reduced-Rank Hidden Markov Models.",
                    "Detecting Weak but Hierarchically-Structured Patterns in Networks.",
                    "Inference of Sparse Networks with Unobserved Variables. Application to Gene Regulatory Networks.",
                    "Nonparametric Tree Graphical Models.",
                    "On the relation between universality, characteristic kernels and RKHS embedding of measures.",
                    "Conditional Density Estimation via Least-Squares Density Ratio Estimation.",
                    "On the Convergence Properties of Contrastive Divergence.",
                    "Inference and Learning in Networks of Queues.",
                    "Sufficient Dimension Reduction via Squared-loss Mutual Information Estimation.",
                    "HOP-MAP: Efficient Message Passing with High Order Potentials.",
                    "Hartigan's Method: k-means Clustering without Voronoi.",
                    "Learning Policy Improvements with Path Integrals.",
                    "Unsupervised Aggregation for Classification Problems with Large Numbers of Categories.",
                    "Bayesian Gaussian Process Latent Variable Model.",
                    "A Markov-Chain Monte Carlo Approach to Simultaneous Localization and Mapping.",
                    "Learning Causal Structure from Overlapping Variable Sets.",
                    "State-Space Inference and Learning with Gaussian Processes.",
                    "Sequential Monte Carlo Samplers for Dirichlet Process Mixtures.",
                    "Guarantees for Approximate Incremental SVMs.",
                    "An Alternative Prior Process for Nonparametric Bayesian Clustering.",
                    "A Potential-based Framework for Online Multi-class Learning with Partial Feedback.",
                    "Online Passive-Aggressive Algorithms on a Budget.",
                    "Structured Prediction Cascades.",
                    "Dependent Indian Buffet Processes.",
                    "Modeling annotator expertise: Learning when everybody knows a bit of something.",
                    "A highly efficient blocked Gibbs sampler reconstruction of multidimensional NMR spectra.",
                    "Risk Bounds for Levy Processes in the PAC-Learning Framework.",
                    "Bayesian Online Learning for Multi-label and Multi-variate Performance Measures.",
                    "Multi-Task Learning using Generalized t Process.",
                    "Bayesian Generalized Kernel Models.",
                    "Matrix-Variate Dirichlet Process Mixture Models.",
                    "Exclusive Lasso for Multi-task Feature Selection."
                ]
            },
            {
                "sub_name_abbr": "conf/aistats/2010w",
                "sub_name": "Active Learning and Experimental Design workshop, In conjunction with AISTATS 2010, Sardinia, Italy, May 16, 2010.",
                "count": 12,
                "papers": [
                    "From Theories to Queries.",
                    "Results of the Active Learning Challenge.",
                    "Baseline Methods for Active Learning.",
                    "Active Batch Learning with Tree Ensembles.",
                    "Active Learning and Experimental Design with SVMs.",
                    "Stochastic Semi-supervised Learning.",
                    "Active Learning Based on Parzen Window.",
                    "Active Learning for Unbalanced Data in the Challenge with Multiple Models and Biasing.",
                    "Active Learning with Clustering.",
                    "Autonomous Experimentation.",
                    "Managing Uncertainty within KTD.",
                    "Inspecting Sample Reusability for Active Learning."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "12th AISTATS 2009",
        "info": "Clearwater Beach, Florida, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/aistats/2009",
                "sub_name": "Proceedings of the Twelfth International Conference on Artificial Intelligence and Statistics, AISTATS 2009, Clearwater Beach, Florida, USA, April 16-18, 2009.",
                "count": 85,
                "papers": [
                    "Preface.",
                    "Clusterability: A Theoretical Study.",
                    "Latent Force Models.",
                    "Variational Bridge Regression.",
                    "Learning Low Density Separators.",
                    "Supervised Spectral Latent Variable Models.",
                    "Estimating Tree-Structured Covariance Matrices via Mixed-Integer Programming.",
                    "A New Perspective for Information Theoretic Feature Selection.",
                    "Structure Identification by Optimized Interventions.",
                    "Online Inference of Topics with Latent Dirichlet Allocation.",
                    "Handling Sparsity via the Horseshoe.",
                    "Relational Topic Models for Document Networks.",
                    "Probabilistic Models for Incomplete Multi-dimensional Arrays.",
                    "On Partitioning Rules for Bipartite Ranking.",
                    "Gaussian Margin Machines.",
                    "Learning Thin Junction Trees via Graph Cuts.",
                    "Matching Pursuit Kernel Fisher Discriminant Analysis.",
                    "Statistical and Computational Tradeoffs in Stochastic Composite Likelihood.",
                    "Variational Inference for the Indian Buffet Process.",
                    "Choosing a Variable to Clamp.",
                    "The Difficulty of Training Deep Architectures and the Effect of Unsupervised Pre-Training.",
                    "Semi-Supervised Affinity Propagation with Instance-Level Constraints.",
                    "Multi-Manifold Semi-Supervised Learning.",
                    "Residual Splash for Optimally Parallelizing Belief Propagation.",
                    "Sparse Probabilistic Principal Component Analysis.",
                    "Visualization Databases for the Analysis of Large Complex Datasets.",
                    "Active Learning as Non-Convex Optimization.",
                    "Network Completion and Survey Sampling.",
                    "Distilled sensing: selective sampling for sparse signal recovery.",
                    "Infinite Hierarchical Hidden Markov Models.",
                    "An Expectation Maximization Algorithm for Continuous Markov Decision Processes with Arbitrary Reward.",
                    "Maximum Entropy Density Estimation with Incomplete Presence-Only Data.",
                    "Exploiting Probabilistic Independence for Permutations.",
                    "Particle Belief Propagation.",
                    "Data Biased Robust Counter Strategies.",
                    "Sleeping Experts and Bandits with Stochastic Action Availability and Adversarial Rewards.",
                    "Covariance Operator Based Dimensionality Reduction with Extension to Semi-Supervised Settings.",
                    "Lanczos Approximations for the Speedup of Kernel Partial Least Squares Regression.",
                    "Convex Perturbations for Scalable Semidefinite Programming.",
                    "Sampling Techniques for the Nystrom Method.",
                    "Deep Learning using Robust Interdependent Codes.",
                    "Group Nonnegative Matrix Factorization for EEG Classification.",
                    "Kernel Learning by Unconstrained Optimization.",
                    "Latent Wishart Processes for Relational Kernel Learning.",
                    "Tighter and Convex Maximum Margin Clustering.",
                    "Learning Exercise Policies for American Options.",
                    "Learning Sparse Markov Network Structure via Ensemble-of-Trees Models.",
                    "A kernel method for unsupervised structured network inference.",
                    "Estimation Consistency of the Group Lasso and its Applications.",
                    "Learning a Parametric Embedding by Preserving Local Structure.",
                    "Tractable Search for Learning Exponential Models of Rankings.",
                    "Exact and Approximate Sampling by Systematic Stochastic Search.",
                    "Spanning Tree Approximations for Conditional Random Fields.",
                    "Chromatic PAC-Bayes Bounds for Non-IID Data.",
                    "Inverse Optimal Heuristic Control for Imitation Learning.",
                    "Learning the Switching Rate by Discretising Bernoulli Sources Online.",
                    "Sequential Learning of Classifiers for Structured Prediction Problems.",
                    "Deep Boltzmann Machines.",
                    "Optimizing Costly Functions with Simple Constraints: A Limited-Memory Projected Quasi-Newton Algorithm.",
                    "Novelty detection: Unlabeled data definitely help.",
                    "PAC-Bayesian Generalization Bound for Density Estimation with Application to Co-clustering.",
                    "PAC-Bayes Analysis Of Maximum Entropy Classification.",
                    "Efficient graphlet kernels for large graph comparison.",
                    "Hash Kernels.",
                    "Locally Minimax Optimal Predictive Modeling with Bayesian Networks.",
                    "MCMC Methods for Bayesian Mixtures of Copulas.",
                    "Factorial Mixture of Gaussians and the Marginal Independence Model.",
                    "Tractable Bayesian Inference of Time-Series Dependence Structure.",
                    "Relative Novelty Detection.",
                    "Tree Block Coordinate Descent for MAP in Graphical Models.",
                    "The Block Diagonal Infinite Hidden Markov Model.",
                    "Variable Metric Stochastic Approximation Theory.",
                    "Variational Learning of Inducing Variables in Sparse Gaussian Processes.",
                    "Non-Negative Semi-Supervised Learning.",
                    "Markov Topic Models.",
                    "An Information Geometry Approach for Distance Metric Learning.",
                    "Large-Margin Structured Prediction via Linear Programming.",
                    "A Hierarchical Nonparametric Bayesian Approach to Statistical Language Model Domain Adaptation.",
                    "Speed and Sparsity of Regularized Boosting.",
                    "Tree-Based Inference for Dirichlet Process Mixtures.",
                    "Dual Temporal Difference Learning.",
                    "Active Sensing.",
                    "Coherence Functions for Multicategory Margin-based Classification Methods.",
                    "Latent Variable Models for Dimensionality Reduction.",
                    "Reversible Jump MCMC for Non-Negative Matrix Factorization."
                ]
            }
        ]
    },
    {
        "year": "2007",
        "name": "11th AISTATS 2007",
        "info": "San Juan, Puerto Rico",
        "venues": [
            {
                "sub_name_abbr": "conf/aistats/2007",
                "sub_name": "Proceedings of the Eleventh International Conference on Artificial Intelligence and Statistics, AISTATS 2007, San Juan, Puerto Rico, March 21-24, 2007.",
                "count": 86,
                "papers": [
                    "Preface.",
                    "Policy-Gradients for PSRs and POMDPs.",
                    "Generalized Non-metric Multidimensional Scaling.",
                    "Seeking The Truly Correlated Topic Posterior - on tight approximate inference of logistic-normal admixture model.",
                    "A Boosting Algorithm for Label Covering in Multilabel Problems.",
                    "Mixture of Watson Distributions: A Generative Model for Hyperspherical Embeddings.",
                    "Kernel Multi-task Learning using Task-specific Features.",
                    "A Hybrid Pareto Model for Conditional Density Estimation of Asymmetric Fat-Tail Data.",
                    "The Laplacian Eigenmaps Latent Variable Model.",
                    "Visualizing Similarity Data with a Mixture of Maps.",
                    "Solving Markov Random Fields with Spectral Relaxation.",
                    "Fast search for Dirichlet process mixture models.",
                    "Large-Margin Classification in Banach Spaces.",
                    "Learning A* underestimates: Using inference to guide inference.",
                    "Exact Bayesian structure learning from uncertain interventions.",
                    "Online Learning of Search Heuristics.",
                    "Deterministic Annealing for Multiple-Instance Learning.",
                    "Approximate inference using conditional entropy decompositions.",
                    "Visualizing pairwise similarity via semidefinite programming.",
                    "SampleSearch: A Scheme that Searches for Consistent Samples.",
                    "Dissimilarity in Graph-Based Semi-Supervised Classification.",
                    "Hidden Topic Markov Models.",
                    "Space-Efficient Sampling.",
                    "Information Retrieval by Inferring Implicit Queries from Eye Movements.",
                    "A Nonparametric Bayesian Approach to Modeling Overlapping Clusters.",
                    "Loopy Belief Propagation for Bipartite Maximum Weight b-Matching.",
                    "Learning Markov Structure by Maximum Entropy Relaxation.",
                    "Multi-object tracking with representations of the symmetric group.",
                    "MDL Histogram Density Estimation.",
                    "Incorporating Prior Knowledge on Features into Learning.",
                    "Fast Low-Rank Semidefinite Programming for Embedding and Clustering.",
                    "Learning for Larger Datasets with the Gaussian Process Latent Variable Model.",
                    "Learning Nearest-Neighbor Quantizers from Labeled Data by Information Loss Minimization.",
                    "Treelets | A Tool for Dimensionality Reduction and Multi-Scale Analysis of Unstructured Data.",
                    "Efficient active learning with generalized linear models.",
                    "A Bayesian Divergence Prior for Classiffier Adaptation.",
                    "Sparse Nonparametric Density Estimation in High Dimensions Using the Rodeo.",
                    "Fisher Consistency of Multicategory Support Vector Machines.",
                    "Semi-supervised Clustering with Pairwise Constraints: A Discriminative Approach.",
                    "Recall Systems: Effcient Learning and Use of Category Indices.",
                    "AClass: A simple, online, parallelizable algorithm for probabilistic classification.",
                    "A Fast Bundle-based Anytime Algorithm for Poker and other Convex Games.",
                    "Loop Corrected Belief Propagation.",
                    "Inductive Transfer for Bayesian Network Structure Learning.",
                    "Maximum Entropy Correlated Equilibria.",
                    "Approximate Counting of Graphical Models Via MCMC.",
                    "Margin based Transductive Graph Cuts using Linear Programming.",
                    "A Unified Energy-Based Framework for Unsupervised Learning.",
                    "(Approximate) Subgradient Methods for Structured Prediction.",
                    "A fast algorithm for learning large scale preference relations.",
                    "The Rademacher Complexity of Co-Regularized Kernel Classes.",
                    "Continuous Neural Networks.",
                    "Learning a Nonlinear Embedding by Preserving Class Neighbourhood Structure.",
                    "A Latent Space Approach to Dynamic Embedding of Co-occurrence Data.",
                    "Memory-Effcient Orthogonal Least Squares Kernel Density Estimation using Enhanced Empirical Cumulative Distribution Functions.",
                    "A Stochastic Quasi-Newton Method for Online Convex Optimization.",
                    "Bayesian Inference and Optimal Design in the Sparse Linear Model.",
                    "A Unified Algorithmic Approach for Efficient Online Label Ranking.",
                    "Minimum Volume Embedding.",
                    "A Framework for Probability Density Estimation.",
                    "Fast Kernel ICA using an Approximate Newton Method.",
                    "Ellipsoidal Machines.",
                    "Fast State Discovery for HMM Model Selection and Learning.",
                    "Analogical Reasoning with Relational Bayesian Sets.",
                    "Dynamic Factorization Tests: Applications to Multi-modal Data Association.",
                    "Generalized Darting Monte Carlo.",
                    "Local and global sparse Gaussian process approximations.",
                    "Predictive Discretization during Model Selection.",
                    "Emerge and spread models and word burstiness.",
                    "Learning Multilevel Distributed Representations for High-Dimensional Sequences.",
                    "Stick-breaking Construction for the Indian Buffet Process.",
                    "Hierarchical Beta Processes and the Indian Buffet Process.",
                    "Nonlinear Dimensionality Reduction as Information Retrieval.",
                    "The Kernel Path in Kernelized LASSO.",
                    "Efficient large margin semisupervised learning.",
                    "Semi-Supervised Mean Fields.",
                    "Fast Mean Shift with Accurate and Stable Convergence.",
                    "Metric Learning for Kernel Regression.",
                    "Performance Guarantees for Information Theoretic Active Inference.",
                    "Transductive Classification via Local Learning Regularization.",
                    "How Powerful Can Any Regression Learning Procedure Be?.",
                    "SVM versus Least Squares SVM.",
                    "Importance Sampling for General Hybrid Bayesian Networks.",
                    "Nonnegative Garrote Component Selection in Functional ANOVA models.",
                    "Generalized Do-Calculus with Testable Causal Assumptions.",
                    "An Improved 1-norm SVM for Simultaneous Classification and Variable Selection."
                ]
            }
        ]
    },
    {
        "year": "2005",
        "name": "10th AISTATS 2005",
        "info": "Bridgetown, Barbados",
        "venues": [
            {
                "sub_name_abbr": "conf/aistats/2005",
                "sub_name": "Proceedings of the Tenth International Workshop on Artificial Intelligence and Statistics, AISTATS 2005, Bridgetown, Barbados, January 6-8, 2005.",
                "count": 57,
                "papers": [
                    "A Uniform Convergence Bound for the Area Under the ROC Curve.",
                    "On the Path to an Ideal ROC Curve: Considering Cost Asymmetry in Learning Classifiers.",
                    "On Manifold Regularization.",
                    "Distributed Latent Variable Models of Lexical Co-occurrences.",
                    "On Contrastive Divergence Learning.",
                    "OOBN for Forensic Identification through Searching a DNA profiles' Database.",
                    "Active Learning for Parzen Window Classifier.",
                    "Semi-Supervised Classification by Low Density Separation.",
                    "Learning spectral graph segmentation.",
                    "A Graphical Model for Simultaneous Partitioning and Labeling.",
                    "Restructuring Dynamic Causal Systems in Equilibrium.",
                    "Probability and Statistics in the Law.",
                    "Efficient Non-Parametric Function Induction in Semi-Supervised Learning.",
                    "Structured Variational Inference Procedures and their Realizations.",
                    "Kernel Constrained Covariance for Dependence Measurement.",
                    "Semisupervised alignment of manifolds.",
                    "Learning Causally Linked Markov Random Fields.",
                    "Hilbertian Metrics and Positive Definite Kernels on Probability Measures.",
                    "Fast Non-Parametric Bayesian Inference on Infinite Trees.",
                    "Restricted concentration models - graphical Gaussian models with concentration parameters restricted to being equal.",
                    "Fast maximum a-posteriori inference on Monte Carlo state spaces.",
                    "Generative Model for Layers of Appearance and Deformation.",
                    "Toward Question-Asking Machines: The Logic of Questions and the Inquiry Calculus.",
                    "Convergent tree-reweighted message passing for energy minimization.",
                    "Instrumental variable tests for Directed Acyclic Graph Models.",
                    "Estimating Class Membership Probabilities using Classifier Learners.",
                    "Loss Functions for Discriminative Training of Energy-Based Models.",
                    "Probabilistic Soft Interventions in Conditional Gaussian Networks.",
                    "Unsupervised Learning with Non-Ignorable Missing Data.",
                    "Regularized spectral learning.",
                    "Approximate Inference for Infinite Contingent Bayesian Networks.",
                    "Hierarchical Probabilistic Neural Network Language Model.",
                    "Greedy Spectral Embedding.",
                    "FastMap, MetricMap, and Landmark MDS are all Nystrom Algorithms.",
                    "Bayesian Conditional Random Fields.",
                    "Poisson-Networks: A Model for Structured Poisson Processes.",
                    "Deformable Spectrograms.",
                    "Variational Speech Separation of More Sources than Mixtures.",
                    "Learning Bayesian Network Models from Incomplete Data using Importance Sampling.",
                    "On the Behavior of MDL Denoising.",
                    "Focused Inference.",
                    "Kernel Methods for Missing Variables.",
                    "Semiparametric latent factor models.",
                    "Efficient Gradient Computation for Conditional Gaussian Models.",
                    "Very Large SVM Training using Core Vector Machines.",
                    "Streaming Feature Selection using IIC.",
                    "Defensive Forecasting.",
                    "Inadequacy of interval estimates corresponding to variational Bayesian approximations.",
                    "Nonlinear Dimensionality Reduction by Semidefinite Programming and Kernel Matrix Factorization.",
                    "An Expectation Maximization Algorithm for Inferring Offset-Normal Shape Distributions.",
                    "Learning in Markov Random Fields with Contrastive Free Energies.",
                    "Robust Higher Order Statistics.",
                    "Online (and Offline) on an Even Tighter Budget.",
                    "Approximations with Reweighted Generalized Belief Propagation.",
                    "Recursive Autonomy Identification for Bayesian Network Structure Learning.",
                    "Dirichlet Enhanced Latent Semantic Analysis.",
                    "Gaussian Quadrature Based Expectation Propagation."
                ]
            }
        ]
    },
    {
        "year": "2003",
        "name": "9th AISTATS 2003",
        "info": "Key West, Florida, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/aistats/2003",
                "sub_name": "Proceedings of the Ninth International Workshop on Artificial Intelligence and Statistics, AISTATS 2003, Key West, Florida, USA, January 3-6, 2003.",
                "count": 44,
                "papers": [
                    "Fast Marginal Likelihood Maximisation for Sparse Bayesian Models.",
                    "Combining Conjugate Direction Methods with Stochastic Approximation of Gradients.",
                    "Expectation Maximization of Forward Decoding Kernel Machines.",
                    "Generalized belief propagation for approximate inference in hybrid Bayesian networks.",
                    "Tree-reweighted belief propagation algorithms and approximate ML estimation by pseudo-moment matching.",
                    "Model Averaging with Bayesian Network Classifiers.",
                    "Fast Forward Selection to Speed Up Sparse Gaussian Process Regression.",
                    "On Improving the Efficiency of the Iterative Proportional Fitting Procedure.",
                    "Rapid Evaluation of Multiple Density Models.",
                    "A Bayesian Approach to Bergman's Minimal Model.",
                    "Bayesian Inference in the Presence of Determinism.",
                    "Convex Invariance Learning.",
                    "On Boosting and the Exponential Loss.",
                    "Solving Markov Random Fields using Semi Definite Programming.",
                    "The Sound of an Album Cover: A Probabilistic Approach to Multimedia.",
                    "A Generalized Linear Model for Principal Component Analysis of Binary Data.",
                    "Refining Kernels for Regression and Uneven Classification Problems.",
                    "Data centering in feature space.",
                    "Learning Bayesian Networks From Dependency Networks: A Preliminary Study.",
                    "Towards Principled Feature Selection: Relevancy, Filters and Wrappers.",
                    "The Joint Causal Effect in Linear Structural Equation Model and Its Application to Process Analysis.",
                    "Document Retrieval and Clustering: from Principal Component Analysis to Self-aggregation Networks.",
                    "Structured Variational Distributions in VIBES.",
                    "Reduced Rank Approximations of Transition Matrices.",
                    "Ensemble Coupled Hidden Markov Models for Joint Characterisation of Dynamic Signals.",
                    "Clustering Markov States into Equivalence Classes using SVD and Heuristic Search Algorithms.",
                    "Quick Training of Probabilistic Neural Nets by Importance Sampling.",
                    "On the Naive Bayes Model for Text Categorization.",
                    "Bayesian Feature Weighting for Unsupervised Learning, with Application to Object Recognition.",
                    "A Blessing of Dimensionality: Measure Concentration and Probabilistic Inference.",
                    "Latent Maximum Entropy Approach for Semantic N-gram Language Modeling.",
                    "An Active Approach to Collaborative Filtering.",
                    "Efficient Computing of Stochastic Complexity.",
                    "Fast Robust Logistic Regression for Large Sparse Datasets with Binary Outputs.",
                    "Curve Clustering with Random Effects Regression Mixtures.",
                    "Real-time On-line Learning of Transformed Hidden Markov Models from Video.",
                    "An object-oriented Bayesian network for estimating mutation rates.",
                    "A unifying theorem for spectral embedding and clustering.",
                    "On Retrieval Properties of Samples of Large Collections.",
                    "Sequential Importance Sampling for Visual Tracking Reconsidered.",
                    "Super-resolution Enhancement of Video.",
                    "Discriminative Model Selection for Density Models.",
                    "Planning by Probabilistic Inference.",
                    "Is Multinomial PCA Multi-faceted Clustering or Dimensionality Reduction?"
                ]
            }
        ]
    },
    {
        "year": "2001",
        "name": "8th AISTATS 2001",
        "info": "Key West, Florida, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/aistats/2001",
                "sub_name": "Proceedings of the Eighth International Workshop on Artificial Intelligence and Statistics, AISTATS 2001, Key West, Florida, USA, January 4-7, 2001.",
                "count": 46,
                "papers": [
                    "Models for Conditional Probability Tables in Educational Assessment.",
                    "Learning in high dimensions: modular mixture models.",
                    "Learning Bayesian networks with mixed variables.",
                    "Products of Hidden Markov Models.",
                    "Information-Theoretic Advisors in Invisible Chess.",
                    "A Non-Parametric EM-Style Algorithm for Imputing Missing Values.",
                    "Managing Multiple Models.",
                    "Solving Hidden-Mode Markov Decision Problems.",
                    "Bagging and the Bayesian Bootstrap.",
                    "Hyperparameters for Soft Bayesian Model Selection.",
                    "On searching for optimal classifiers among Bayesian networks.",
                    "Statistical Aspects of Stochastic Logic Programs.",
                    "Some variations on variation independence..",
                    "Are they really neighbors? A statistical analysis of the SOM algorithm output.",
                    "Monte-Carlo Algorithms for the Improvement of Finite-State Stochastic Controllers: Application to Bayes-Adaptive Markov Decision Processes.",
                    "Why averaging classifiers can protect against overfitting.",
                    "Dual perturb and combine algorithm.",
                    "Handling Missing and Unreliable Information in Speech Recognition.",
                    "Discriminant Analysis on Dissimilarity Data : a New Fast Gaussian like Algorithm.",
                    "Profile Likelihood in Directed Graphical Models from BUGS Output.",
                    "Is regularization unnecessary for boosting?.",
                    "Learning mixtures of smooth, nonuniform deformation models for probabilistic image matching.",
                    "Predicting with Variables Constructed from Temporal Sequences.",
                    "Another look at sensitivity of Bayesian networks to imprecise probabilities.",
                    "Comparing Prequential Model Selection Criteria in Supervised Learning of Mixture Models.",
                    "Bayesian Support Vector Regression.",
                    "Variational Learning for Multi-Layer Networks of Linear Threshold Units.",
                    "On the effectiveness of the skew divergence for statistical language analysis.",
                    "A Simulation Study of Three Related Causal Data Mining Algorithms.",
                    "Finding a path is harder than finding a tree.",
                    "The Learning Curve Method Applied to Clustering.",
                    "A Random Walks View of Spectral Segmentation.",
                    "An improved training algorithm for kernel Fisher discriminants.",
                    "Message Length as an Effective Ockham's Razor in Decision Tree Induction.",
                    "Using Unsupervised Learning to Guide Resampling in Imbalanced Data Sets.",
                    "Online Bagging and Boosting.",
                    "Geographical clustering of cancer incidence by means of Bayesian networks and conditional Gaussian networks.",
                    "Stochastic System Monitoring and Control.",
                    "Can the Computer Learn to Play Music Expressively?.",
                    "On Parameter Priors for Discrete DAG Models.",
                    "Piecewise Linear Instrumental Variable Estimation of Causal Influence.",
                    "The Efficient Propagation of Arbitrary Subsets of Beliefs in Discrete-Valued Bayesian Networks.",
                    "An Anytime Algorithm for Causal Inference.",
                    "Dynamic Positional Trees for Structural Image Analysis.",
                    "Temporal Matching under Uncertainty.",
                    "A Kernel Approach for Vector Quantization with Guaranteed Distortion Bounds."
                ]
            }
        ]
    },
    {
        "year": "1999",
        "name": "7th AISTATS 1999",
        "info": "Fort Lauderdale, Florida, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/aistats/1999",
                "sub_name": "Proceedings of the Seventh International Workshop on Artificial Intelligence and Statistics, AISTATS 1999, Fort Lauderdale, Florida, USA, January 3-6, 1999.",
                "count": 45,
                "papers": [
                    "Hierarchical IFA Belief Networks.",
                    "Pattern discovery via entropy minimization.",
                    "Causal Mechanisms and Classification Trees for Predicting Chemical Carcinogens.",
                    "Conditional products: An alternative approach to conditional independence.",
                    "Geometric modeling of a nuclear environment.",
                    "Process-oriented evaluation: The next step.",
                    "Modeling decision tree performance with the power law.",
                    "Efficient learning using constrained sufficient statistics.",
                    "On the geometry of DAG models with hidden variables.",
                    "Model choice: A minimum posterior predictive loss approach.",
                    "Mean field inference in a general probabilistic setting.",
                    "Probabilistic kernel regression models.",
                    "Hierarchical mixtures-of-experts for generalized linear models: some results on denseness and consistency.",
                    "Stochastic local search for Bayesian network.",
                    "Bayesian graphical models, intention-to-treat, and the rubin causal Model.",
                    "Efficient mining of statistical dependencies.",
                    "Tractable structure search in the presence of latent variables.",
                    "Boosting methodology for regression problems.",
                    "An experiment in causal discovery using a pneumona database.",
                    "A note on the comparison of polynomial selection methods.",
                    "Transfer of information between system and evidence models.",
                    "A bayesian model for collaborative filtering.",
                    "Parameter learning from incomplete data for Bayesian networks.",
                    "On the application of the bootstrap for computing confidence measures on features of induced Bayesian networks.",
                    "Relaxing the local independence assumption for quantitative learning in acyclic directed graphical models through hierarchical partition models.",
                    "The exploration of new methods for learning in binary Boltzmann machines.",
                    "Statistical challenges to inductive inference in linked data.",
                    "Mixture model clustering with the multimix program.",
                    "Learning augmented Bayesian classifiers: A comparison of distribution-based and classification-based approaches.",
                    "Exploring the robustness of Bayesian and information-theoretic methods for predictive inference.",
                    "Structure optimization of density estimation models applied to regression problems with dynamic noise.",
                    "A learning rule based method of feature extraction with application to acoustic signal classification.",
                    "Learning extensible multi-entity directed graphical models.",
                    "A latent variable model for multivariate discretization.",
                    "Testing regression models with fewer regressors.",
                    "Learning conditional probabilities from incomplete databases - An experimental comparison.",
                    "Local experts combination through density decomposition.",
                    "Entropy-driven inference and inconsistency.",
                    "Learned models for continuous planning.",
                    "Efficient optimization of large k real-time control algorithm.",
                    "Model folding for data subject to nonresponse.",
                    "Geometry, moments and Bayesian networks with hidden variables.",
                    "Joint probabilistic clustering of multivariate and sequential data.",
                    "Analysis of multivariate time series via a hidden graphical model.",
                    "Visual design support for probabilistic network application."
                ]
            }
        ]
    },
    {
        "year": "1995",
        "name": "5th AISTATS 1995",
        "info": "Fort Lauderdale, Florida, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/aistats/1995",
                "sub_name": "Learning from Data - Fifth International Workshop on Artificial Intelligence and Statistics, AISTATS 1995, Key West, Florida, USA, January, 1995. Proceedings.",
                "count": 42,
                "papers": [
                    "Two Algorithms for Inducing Structural Equation Models from Data.",
                    "Using Causal Knowledge to Learn More Useful Decision Rules From Data.",
                    "A Causal Calculus for Statistical Research.",
                    "Likelihood-based Causal Inference.",
                    "Ploxoma: Testbed for Uncertain Inference.",
                    "Solving Influence Diagrams Using Gibbs Sampling.",
                    "Modeling and Monitoring Dynamic Systems by Chain Graphs.",
                    "Propagation of Gaussian belief functions.",
                    "On Test Selection Strategies for Belief Networks.",
                    "Representing and Solving Asymmetric Decision Problems Using Valuation Networks.",
                    "A Hill-Climbing Approach for Optimizing Classification Trees.",
                    "Learning Bayesian Networks is NP-Complete.",
                    "Heuristic Search for Model Structure: the Benefits of Restraining Greed.",
                    "Learning Possibilistic Networks from Data.",
                    "Detecting Imperfect Patterns in Event Streams Using Local Search.",
                    "Structure Learning of Bayesian Networks by Hybrid Genetic Algorithms.",
                    "An Axiomatization of Loglinear Models with an Application to the Model-Search Problem.",
                    "Detecting Complex Dependencies in Categorical Data.",
                    "A Comparative Evaluation of Sequential Feature Selection Algorithms.",
                    "Classification Using Bayes Averaging of Multiple, Relational Rule-based Models.",
                    "Picking the Best Expert from a Sequence.",
                    "Hierarchical Clustering of Composite Objects with a Variable Number of Components.",
                    "Searching for Dependencies in Bayesian Classifiers.",
                    "Statistical Analysis of Complex Systems in Biomedicine.",
                    "Learning in Hybrid Noise Environments Using Statistical Queries.",
                    "On the Statistical Comparison of Inductive Learning Methods.",
                    "Dynamical Selection of Learning Algorithms.",
                    "Learning Bayesian Networks Using Feature Selection.",
                    "Data Representations in Learning.",
                    "Rule Induction as Exploratory Data Analysis.",
                    "Non-Linear Dimensionality Reduction: A Comparative Performance Analysis.",
                    "Omega-Stat: An Environment for Implementing Intelligent Modeling Strategies.",
                    "Framework for a Generic Knowledge Discovery Toolkit.",
                    "Control Representation in an EDA Assistant.",
                    "A Further Comparison of Simplification Methods for Decision-Tree Induction.",
                    "Robust Linear Discriminant Trees.",
                    "Tree Structured Interpretable Regression.",
                    "An Exact Probability Metric for Decision Tree Splitting.",
                    "Two Applications of Statistical Modelling to Natural Language Processing.",
                    "A Model for Part-of-Speech Prediction.",
                    "Viewpoint-Based Measurement of Semantic Similarity between Words.",
                    "Part-of-Speech Tagging from \"Small\" Data Sets."
                ]
            }
        ]
    }
]