[
    {
        "year": "2021",
        "name": "32nd ALT 2021",
        "info": "Virtual Event",
        "venues": [
            {
                "sub_name_abbr": "conf/alt/2021",
                "sub_name": "Algorithmic Learning Theory, 16-19 March 2021, Virtual Conference, Worldwide.",
                "count": 47,
                "papers": [
                    "Algorithmic Learning Theory 2021: Preface.",
                    "Last-Iterate Convergence Rates for Min-Max Optimization: Convergence of Hamiltonian Gradient Descent and Consensus Optimization.",
                    "Differentially Private Assouad, Fano, and Le Cam.",
                    "Estimating Sparse Discrete Distributions Under Privacy and Communication Constraints.",
                    "Efficient Algorithms for Stochastic Repeated Second-price Auctions.",
                    "Intervention Efficient Algorithms for Approximate Learning of Causal Graphs.",
                    "On the Sample Complexity of Privately Learning Unbounded High-Dimensional Gaussians.",
                    "Stochastic Dueling Bandits with Adversarial Corruption.",
                    "A Deep Conditioning Treatment of Neural Networks.",
                    "Stochastic Top-K Subset Bandits with Linear Space and Non-Linear Feedback.",
                    "Sequential prediction under log-loss with side information.",
                    "No-substitution k-means Clustering with Adversarial Order.",
                    "Testing Product Distributions: A Closer Look.",
                    "Online Boosting with Bandit Feedback.",
                    "Bounding, Concentrating, and Truncating: Unifying Privacy Loss Composition for Data Analytics.",
                    "Learning and Testing Irreducible Markov Chains via the k-Cover Time.",
                    "Learning a mixture of two subspaces over finite fields.",
                    "Asymptotically Optimal Strategies For Combinatorial Semi-Bandits in Polynomial Time.",
                    "An Efficient Algorithm for Cooperative Semi-Bandits.",
                    "Last Round Convergence and No-Dynamic Regret in Asymmetric Repeated Games.",
                    "Episodic Reinforcement Learning in Finite MDPs: Minimax Lower Bounds Revisited.",
                    "Adversarial Online Learning with Changing Action Sets: Efficient Algorithms with Approximate Regret Bounds.",
                    "A Technical Note on Non-Stationary Parametric Bandits: Existing Mistakes and Preliminary Solutions.",
                    "Subspace Embeddings under Nonlinear Transformations.",
                    "Efficient sampling from the Bingham distribution.",
                    "Near-tight closure b ounds for the Littlestone and threshold dimensions.",
                    "Stable Sample Compression Schemes: New Applications and an Optimal SVM Margin Bound.",
                    "Submodular combinatorial information measures with applications in machine learning.",
                    "Precise Minimax Regret for Logistic Regression with Categorical Feature Values.",
                    "Characterizing the implicit bias via a primal-dual analysis.",
                    "Efficient Pure Exploration for Combinatorial Bandits with Semi-Bandit Feedback.",
                    "Efficient Learning with Arbitrary Covariate Shift.",
                    "Adaptive Reward-Free Exploration.",
                    "Unexpected Effects of Online no-Substitution k-means Clustering.",
                    "Descent-to-Delete: Gradient-Based Methods for Machine Unlearning.",
                    "Uncertainty quantification using martingales for misspecified Gaussian processes.",
                    "Learning with Comparison Feedback: Online Estimation of Sample Statistics.",
                    "Online Learning of Facility Locations.",
                    "Statistical guarantees for generative models without domination.",
                    "Attribute-Efficient Learning of Halfspaces with Malicious Noise: Near-Optimal Label Complexity and Noise Tolerance.",
                    "Self-Tuning Bandits over Unknown Covariate-Shifts.",
                    "Sample Complexity Bounds for Stochastic Shortest Path with a Generative Model.",
                    "Contrastive learning, multi-view redundancy, and linear models.",
                    "Estimating Smooth GLM in Non-interactive Local Differential Privacy Model with Public Unlabeled Data.",
                    "A case where a spindly two-layer linear network decisively outperforms any neural network with a fully connected input layer.",
                    "Exponential Lower Bounds for Planning in MDPs With Linearly-Realizable Optimal Action-Value Functions.",
                    "Non-uniform Consistency of Online Learning with Random Sampling."
                ]
            }
        ]
    },
    {
        "year": "2020",
        "name": "31st ALT 2020",
        "info": "San Diego, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/alt/2020",
                "sub_name": "Algorithmic Learning Theory, ALT 2020, 8-11 February 2020, San Diego, CA, USA.",
                "count": 39,
                "papers": [
                    "Algorithmic Learning Theory 2020: Preface.",
                    "Optimal multiclass overfitting by sequence reconstruction from Hamming queries.",
                    "Leverage Score Sampling for Faster Accelerated Regression and ERM.",
                    "On Learnability wih Computable Learners.",
                    "Optimal $δ$-Correct Best-Arm Selection for Heavy-Tailed Distributions.",
                    "A Tight Convergence Analysis for Stochastic Gradient Descent with Delayed Updates.",
                    "Distribution Free Learning with Local Queries.",
                    "Robust Algorithms for Online k-means Clustering.",
                    "What relations are reliably embeddable in Euclidean space?",
                    "First-Order Bayesian Regret Analysis of Thompson Sampling.",
                    "Cooperative Online Learning: Keeping your Neighbors Updated.",
                    "Cautious Limit Learning.",
                    "Interactive Learning of a Dynamic Structure.",
                    "Sampling Without Compromising Accuracy in Adaptive Data Analysis.",
                    "An adaptive stochastic optimization algorithm for resource allocation.",
                    "Adversarially Robust Learning Could Leverage Computational Hardness.",
                    "Exponentiated Gradient Meets Gradient Descent.",
                    "The Nonstochastic Control Problem.",
                    "On the Expressive Power of Kernel Methods and the Efficiency of Kernel Learning by Association Schemes.",
                    "Don't Jump Through Hoops and Remove Those Loops: SVRG and Katyusha are Better Without the Outer Loop.",
                    "Algebraic and Analytic Approaches for Parameter Learning in Mixture Models.",
                    "Robust guarantees for learning an autoregressive filter.",
                    "Thompson Sampling for Adversarial Bit Prediction.",
                    "On Learning Causal Structures from Non-Experimental Data without Any Faithfulness Assumption.",
                    "On the Complexity of Proper Distribution-Free Learning of Linear Classifiers.",
                    "Feedback graph regret bounds for Thompson Sampling and UCB.",
                    "Toward universal testing of dynamic network models.",
                    "On the Analysis of EM for truncated mixtures of two Gaussians.",
                    "A Non-Trivial Algorithm Enumerating Relevant Features over Finite Fields.",
                    "Privately Answering Classification Queries in the Agnostic PAC Model.",
                    "Efficient Private Algorithms for Learning Large-Margin Halfspaces.",
                    "Finding Robust Nash equilibria.",
                    "Top-$k$ Combinatorial Bandits with Full-Bandit Feedback.",
                    "Bandit Algorithms Based on Thompson Sampling for Bounded Reward Distributions.",
                    "Approximate Representer Theorems in Non-reflexive Banach Spaces.",
                    "Online Non-Convex Learning: Following the Perturbed Leader is Optimal.",
                    "Solving Bernoulli Rank-One Bandits with Unimodal Thompson Sampling.",
                    "Mixing Time Estimation in Ergodic Markov Chains from a Single Trajectory with Contraction Methods.",
                    "Planning in Hierarchical Reinforcement Learning: Guarantees for Using Local Policies."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "30th ALT 2019",
        "info": "Chicago, Illinois, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/alt/2019",
                "sub_name": "Algorithmic Learning Theory, ALT 2019, 22-24 March 2019, Chicago, Illinois, USA.",
                "count": 38,
                "papers": [
                    "Algorithmic Learning Theory 2019: Preface.",
                    "On Learning Graphs with Edge-Detecting Queries.",
                    "An Exponential Tail bound for Lq Stable Learning Rules.",
                    "Dimensionality Reduction and (Bucket) Ranking: a Mass Transportation Approach.",
                    "A minimax near-optimal algorithm for adaptive rejection sampling.",
                    "Attribute-efficient learning of monomials over highly-correlated variables.",
                    "Improved Generalization Bounds for Robust Learning.",
                    "A simple parameter-free and adaptive approach to optimization under a minimal local smoothness assumption.",
                    "Adaptive Exact Learning of Decision Trees from Membership Queries.",
                    "Generalize Across Tasks: Efficient Algorithms for Linear Representation Learning.",
                    "Dynamic Pricing with Finitely Many Unknown Valuations.",
                    "Online Non-Additive Path Learning under Full and Partial Information.",
                    "Two-Player Games for Efficient Non-Convex Constrained Optimization.",
                    "Competitive ratio vs regret minimization: achieving the best of both worlds.",
                    "Hardness of Improper One-Sided Learning of Conjunctions For All Uniformly Falsifiable CSPs.",
                    "Limit Learning Equivalence Structures.",
                    "Uniform regret bounds over Rd for the sequential linear regression problem with the square loss.",
                    "A tight excess risk bound via a unified PAC-Bayesian-Rademacher-Shtarkov-MDL complexity.",
                    "Sample Compression for Real-Valued Learners.",
                    "A Sharp Lower Bound for Agnostic Learning with Sample Compression Schemes.",
                    "Optimal Collusion-Free Teaching.",
                    "Cleaning up the neighborhood: A full classification for adversarial partial monitoring.",
                    "Online Influence Maximization with Local Observations.",
                    "Can Adversarially Robust Learning LeverageComputational Hardness?",
                    "Sequential change-point detection: Laplace concentration of scan statistics and non-asymptotic delay bounds.",
                    "Average-Case Information Complexity of Learning.",
                    "Interplay of minimax estimation and minimax support recovery under sparsity.",
                    "Ising Models with Latent Conditional Gaussian Variables.",
                    "Exploiting geometric structure in mixture proportion estimation with generalised Blanchard-Lee-Scott estimators.",
                    "PAC Battling Bandits in the Plackett-Luce Model.",
                    "A Generalized Neyman-Pearson Criterion for Optimal Domain Adaptation.",
                    "General parallel optimization a without metric.",
                    "Old Techniques in Differentially Private Linear Regression.",
                    "PeerReview4All: Fair and Accurate Reviewer Assignment in Peer Review.",
                    "Stochastic Nonconvex Optimization with Large Minibatches.",
                    "Online Linear Optimization with Sparsity Constraints.",
                    "Noninteractive Locally Private Learning of Linear Models via Polynomial Approximations.",
                    "Minimax Learning of Ergodic Markov Chains."
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "29th ALT 2018",
        "info": "Lanzarote, Spain",
        "venues": [
            {
                "sub_name_abbr": "conf/alt/2018",
                "sub_name": "Algorithmic Learning Theory, ALT 2018, 7-9 April 2018, Lanzarote, Canary Islands, Spain.",
                "count": 34,
                "papers": [
                    "Algorithmic Learning Theory ALT 2017: Preface.",
                    "Pure Exploration in Infinitely-Armed Bandit Models with Fixed-Confidence.",
                    "Learners that Use Little Information.",
                    "{Multi-Player Bandits Revisited}.",
                    "Adaptive Group Testing Algorithms to Estimate the Number of Defectives.",
                    "Sparsity, variance and curvature in multi-armed bandits.",
                    "Bandit Regret Scaling with the Effective Loss Range.",
                    "Structure Learning of ${H}$-colorings.",
                    "Convergence of Langevin MCMC in KL-divergence.",
                    "Ranking Median Regression: Learning to Order through Local Consensus.",
                    "Coordinate Descent Faceoff: Primal or Dual?",
                    "A Better Resource Allocation Algorithm with Semi-Bandit Feedback.",
                    "Unperturbed: spectral analysis beyond Davis-Kahan.",
                    "Decision making with limited feedback.",
                    "Robust Inference for Multiclass Classification.",
                    "Corrupt Bandits for Preserving Local Privacy.",
                    "On the Help of Bounded Shot Verifiers, Comparators and Standardisers for Learnability in Inductive Inference.",
                    "Smooth Sensitivity Based Approach for Differentially Private PCA.",
                    "Dimension-free Information Concentration via Exp-Concavity.",
                    "Minimax Optimal Bayes Mixtures for Memoryless Sources over Large Alphabets.",
                    "Learning Decision Trees with Stochastic Linear Classifiers.",
                    "Instrument-Armed Bandits.",
                    "An Adaptive Strategy for Active Learning with Smooth Decision Boundary.",
                    "Learning under $p$-Tampering Attacks.",
                    "Markov Decision Processes with Continuous Side Information.",
                    "Clustering Algorithms for the Centralized and Local Models.",
                    "On Similarity Prediction and Pairwise Clustering.",
                    "Multi-task {K}ernel {L}earning Based on {P}robabilistic {L}ipschitzness.",
                    "Online Learning of Combinatorial Objects via Extended Formulation.",
                    "The K-Nearest Neighbour UCB Algorithm for Multi-Armed Bandits with Covariates.",
                    "Sequential prediction with coded side information under logarithmic loss.",
                    "Variance-Aware Regret Bounds for Undiscounted Reinforcement Learning in MDPs.",
                    "Efficient coordinate-wise leading eigenvector computation.",
                    "Minimax Rates and Efficient Algorithms for Noisy Sorting."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "28. ALT 2017",
        "info": "Kyoto, Japan",
        "venues": [
            {
                "sub_name_abbr": "conf/alt/2017",
                "sub_name": "International Conference on Algorithmic Learning Theory, ALT 2017, 15-17 October 2017, Kyoto University, Kyoto, Japan.",
                "count": 34,
                "papers": [
                    "Algorithmic Learning Theory (ALT) 2017: Preface.",
                    "New bounds on the price of bandit feedback for mistake-bounded online multiclass learning.",
                    "Minimax rates for cost-sensitive learning on manifolds with approximate nearest neighbours.",
                    "Universality of Bayesian mixture predictors.",
                    "Erasing Pattern Languages Distinguishable by a Finite Number of Strings.",
                    "Non-Adaptive Randomized Algorithm for Group Testing.",
                    "Automatic Learning from Repetitive Texts.",
                    "Boundary Crossing for General Exponential Families.",
                    "Preference-based Teaching of Unions of Geometric Objects.",
                    "Specifying a positive threshold function via extremal points.",
                    "A minimax and asymptotically optimal algorithm for stochastic bandits.",
                    "Graph Verification with a Betweenness Oracle.",
                    "Lifelong Learning in Costly Feature Spaces.",
                    "Collaborative Clustering: Sample Complexity and Efficient Algorithms.",
                    "Parameter identification in Markov chain choice models.",
                    "The Complexity of Explaining Neural Networks Through (group) Invariants.",
                    "An efficient query learning algorithm for zero-suppressed binary decision diagrams.",
                    "Soft-Bayes: Prod for Mixtures of Experts with Log-Loss.",
                    "Hypotheses testing on infinite random graphs.",
                    "Scale-Invariant Unconstrained Online Learning.",
                    "Learning MSO-definable hypotheses on strings.",
                    "The Power of Random Counterexamples.",
                    "A Strongly Quasiconvex PAC-Bayesian Bound.",
                    "Normal Forms in Semantic Language Identification.",
                    "Efficient tracking of a growing number of experts.",
                    "Tight Bounds on ℓ1 Approximation and Learning of Self-Bounding Functions.",
                    "Relative Error Embeddings of the Gaussian Kernel Distance.",
                    "Adaptive Submodularity with Varying Query Sets: An Application to Active Multi-label Learning.",
                    "Structured Best Arm Identification with Fixed Confidence.",
                    "On Compressive Ensemble Induced Regularisation: How Close is the Finite Ensemble Precision Matrix to the Infinite Ensemble?",
                    "Dealing with Range Anxiety in Mean Estimation via Statistical Queries.",
                    "Learning from Networked Examples.",
                    "PAC Learning Depth-3 $\\textrm{AC}^0$ Circuits of Bounded Top Fanin.",
                    "A Modular Analysis of Adaptive (Non-)Convex Optimization: Optimism, Composite Objectives, and Variational Bounds."
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "27. ALT 2016",
        "info": "Bari, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/alt/2016",
                "sub_name": "Algorithmic Learning Theory - 27th International Conference, ALT 2016, Bari, Italy, October 19-21, 2016, Proceedings.",
                "count": 24,
                "papers": [
                    "A Vector-Contraction Inequality for Rademacher Complexities.",
                    "Localization of VC Classes: Beyond Local Rademacher Complexities.",
                    "Labeled Compression Schemes for Extremal Classes.",
                    "On Version Space Compression.",
                    "Learning with Rejection.",
                    "Sparse Learning for Large-Scale and High-Dimensional Data: A Randomized Convex-Concave Optimization Approach.",
                    "On the Evolution of Monotone Conjunctions: Drilling for Best Approximations.",
                    "Exact Learning of Juntas from Membership Queries.",
                    "Submodular Learning and Covering with Response-Dependent Costs.",
                    "Classifying the Arithmetical Complexity of Teaching Models.",
                    "Learning Finite Variants of Single Languages from Informant.",
                    "Intrinsic Complexity of Partial Learning.",
                    "Learning Pattern Languages over Groups.",
                    "The Maximum Cosine Framework for Deriving Perceptron Based Linear Classifiers.",
                    "Structural Online Learning.",
                    "An Upper Bound for Aggregating Algorithm for Regression with Changing Dependencies.",
                    "Things Bayes Can't Do.",
                    "On Minimaxity of Follow the Leader Strategy in the Stochastic Setting.",
                    "A Combinatorial Metrical Task System Problem Under the Uniform Metric.",
                    "Competitive Portfolio Selection Using Stochastic Predictions.",
                    "Q(λ) with Off-Policy Corrections.",
                    "On the Prior Sensitivity of Thompson Sampling.",
                    "Finding Meaningful Cluster Structure Amidst Background Noise.",
                    "A Spectral Algorithm with Additive Clustering for the Recovery of Overlapping Communities in Networks."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "26. ALT 2015",
        "info": "Banff, AB, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/alt/2015",
                "sub_name": "Algorithmic Learning Theory - 26th International Conference, ALT 2015, Banff, AB, Canada, October 4-6, 2015, Proceedings.",
                "count": 25,
                "papers": [
                    "Efficient Matrix Sensing Using Rank-1 Gaussian Measurements.",
                    "Tensor Decompositions for Learning Latent Variable Models (A Survey for ALT).",
                    "Priced Learning.",
                    "Combining Models of Approximation with Partial Learning.",
                    "Exact Learning of Multivalued Dependencies.",
                    "Non-adaptive Learning of a Hidden Hypergraph.",
                    "On the Teaching Complexity of Linear Sets.",
                    "Learning a Random DFA from Uniform Strings and State Information.",
                    "Hierarchical Design of Fast Minimum Disagreement Algorithms.",
                    "Learning with a Drifting Target Concept.",
                    "Interactive Clustering of Linear Classes and Cryptographic Lower Bounds.",
                    "On the Rademacher Complexity of Weighted Automata.",
                    "Multi-task and Lifelong Learning of Kernels.",
                    "Permutational Rademacher Complexity - A New Complexity Measure for Transductive Learning.",
                    "Subsampling in Smoothed Range Spaces.",
                    "Information Preserving Dimensionality Reduction.",
                    "Learning with Deep Cascades.",
                    "Bounds on the Minimax Rate for Estimating a Prior over a VC Class from Independent Learning Tasks.",
                    "Scale-Free Algorithms for Online Linear Optimization.",
                    "Online Learning in Markov Decision Processes with Continuous Actions.",
                    "Adaptive Sampling for Incremental Optimization Using Stochastic Gradient Descent.",
                    "Online Linear Optimization for Job Scheduling Under Precedence Constraints.",
                    "Solomonoff Induction Violates Nicod's Criterion.",
                    "On the Computability of Solomonoff Induction and Knowledge-Seeking.",
                    "Two Problems for Sophistication."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "25. ALT 2014",
        "info": "Bled, Slovenia",
        "venues": [
            {
                "sub_name_abbr": "conf/alt/2014",
                "sub_name": "Algorithmic Learning Theory - 25th International Conference, ALT 2014, Bled, Slovenia, October 8-10, 2014. Proceedings.",
                "count": 24,
                "papers": [
                    "Editors' Introduction.",
                    "Cellular Tree Classifiers.",
                    "A Survey of Preference-Based Online Learning with Bandit Algorithms.",
                    "A Map of Update Constraints in Inductive Inference.",
                    "On the Role of Update Constraints and Text-Types in Iterative Learning.",
                    "Parallel Learning of Automatic Classes of Languages.",
                    "Algorithmic Identification of Probabilities Is Hard.",
                    "Learning Boolean Halfspaces with Small Weights from Membership Queries.",
                    "On Exact Learning Monotone DNF from Membership Queries.",
                    "Learning Regular Omega Languages.",
                    "Selecting Near-Optimal Approximate State Representations in Reinforcement Learning.",
                    "Policy Gradients for CVaR-Constrained MDPs.",
                    "Bayesian Reinforcement Learning with Exploration.",
                    "Extreme State Aggregation beyond MDPs.",
                    "On Learning the Optimal Waiting Time.",
                    "Bandit Online Optimization over the Permutahedron.",
                    "Offline to Online Conversion.",
                    "A Chain Rule for the Expected Suprema of Gaussian Processes.",
                    "Generalization Bounds for Time Series Prediction with Non-stationary Processes.",
                    "Generalizing Labeled and Unlabeled Sample Compression to Multi-label Concept Classes.",
                    "Robust and Private Bayesian Inference.",
                    "Clustering, Hamming Embedding, Generalized LSH and the Max Norm.",
                    "Indefinitely Oscillating Martingales.",
                    "A Safe Approximation for Kolmogorov Complexity."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "24. ALT 2013",
        "info": "Singapore",
        "venues": [
            {
                "sub_name_abbr": "conf/alt/2013",
                "sub_name": "Algorithmic Learning Theory - 24th International Conference, ALT 2013, Singapore, October 6-9, 2013. Proceedings.",
                "count": 27,
                "papers": [
                    "Editors' Introduction.",
                    "Learning and Optimizing with Preferences.",
                    "Efficient Algorithms for Combinatorial Online Prediction.",
                    "Exact Learning from Membership Queries: Some Techniques, Results and New Directions.",
                    "Universal Algorithm for Trading in Stock Market Based on the Method of Calibration.",
                    "Combinatorial Online Prediction via Metarounding.",
                    "On Competitive Recommendations.",
                    "Online PCA with Optimal Regrets.",
                    "Partial Learning of Recursively Enumerable Languages.",
                    "Topological Separations in Inductive Inference.",
                    "PAC Learning of Some Subclasses of Context-Free Grammars with Basic Distributional Properties from Positive Data.",
                    "Universal Knowledge-Seeking Agents for Stochastic Environments.",
                    "Order Compression Schemes.",
                    "Learning a Bounded-Degree Tree Using Separator Queries.",
                    "Faster Hoeffding Racing: Bernstein Races via Jackknife Estimates.",
                    "Robust Risk-Averse Stochastic Multi-armed Bandits.",
                    "An Efficient Algorithm for Learning with Semi-bandit Feedback.",
                    "Differentially-Private Learning of Low Dimensional Manifolds.",
                    "Generalization and Robustness of Batched Weighted Average Algorithm with V-Geometrically Ergodic Markov Data.",
                    "Adaptive Metric Dimensionality Reduction.",
                    "Dimension-Adaptive Bounds on Compressive FLD Classification.",
                    "Bayesian Methods for Low-Rank Matrix Estimation: Short Survey and Theoretical Study.",
                    "Concentration and Confidence for Discrete Bayesian Sequence Predictors.",
                    "Algorithmic Connections between Active Learning and Stochastic Convex Optimization.",
                    "Unsupervised Model-Free Representation Learning.",
                    "Fast Spectral Clustering via the Nyström Method.",
                    "Nonparametric Multiple Change Point Estimation in Highly Dependent Time Series."
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "23. ALT 2012",
        "info": "Lyon, France",
        "venues": [
            {
                "sub_name_abbr": "conf/alt/2012",
                "sub_name": "Algorithmic Learning Theory - 23rd International Conference, ALT 2012, Lyon, France, October 29-31, 2012. Proceedings.",
                "count": 29,
                "papers": [
                    "Editors' Introduction.",
                    "Declarative Modeling for Machine Learning and Data Mining.",
                    "Learnability beyond Uniform Convergence.",
                    "Some Rates of Convergence for the Selected Lasso Estimator.",
                    "Recent Developments in Pattern Mining.",
                    "Exploring Sequential Data.",
                    "Enlarging Learnable Classes.",
                    "Confident and Consistent Partial Learning of Recursive Functions.",
                    "Automatic Learning from Positive Data and Negative Counterexamples.",
                    "Regular Inference as Vertex Coloring.",
                    "Sauer's Bound for a Notion of Teaching Complexity.",
                    "On the Learnability of Shuffle Ideals.",
                    "New Analysis and Algorithm for Learning with Drifting Distributions.",
                    "On the Hardness of Domain Adaptation and the Utility of Unlabeled Target Samples.",
                    "Efficient Protocols for Distributed Classification and Optimization.",
                    "The Safe Bayesian - Learning the Learning Rate via the Mixability Gap.",
                    "Data Stability in Clustering: A Closer Look.",
                    "Thompson Sampling: An Asymptotically Optimal Finite-Time Analysis.",
                    "Regret Bounds for Restless Markov Bandits.",
                    "Minimax Number of Strata for Online Stratified Sampling Given Noisy Samples.",
                    "Weighted Last-Step Min-Max Algorithm with Improved Sub-logarithmic Regret.",
                    "Online Prediction under Submodular Constraints.",
                    "Lower Bounds on Individual Sequence Regret.",
                    "A Closer Look at Adaptive Regret.",
                    "Partial Monitoring with Side Information.",
                    "PAC Bounds for Discounted MDPs.",
                    "Buy Low, Sell High.",
                    "Kernelization of Matrix Updates, When and How?",
                    "Predictive Complexity and Generalized Entropy Rate of Stationary Ergodic Processes."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "22. ALT 2011",
        "info": "Espoo, Finland",
        "venues": [
            {
                "sub_name_abbr": "conf/alt/2011",
                "sub_name": "Algorithmic Learning Theory - 22nd International Conference, ALT 2011, Espoo, Finland, October 5-7, 2011. Proceedings.",
                "count": 35,
                "papers": [
                    "Editors' Introduction.",
                    "Models for Autonomously Motivated Exploration in Reinforcement Learning - (Extended Abstract).",
                    "On the Expressive Power of Deep Architectures.",
                    "Optimal Estimation.",
                    "Learning from Label Preferences.",
                    "Information Distance and Its Extensions.",
                    "Iterative Learning from Positive Data and Counters.",
                    "Robust Learning of Automatic Classes of Languages.",
                    "Learning and Classifying.",
                    "Learning Relational Patterns.",
                    "Adaptive and Optimal Online Linear Regression on ℓ1-Balls.",
                    "Re-adapting the Regularization of Weights for Non-stationary Regression.",
                    "Competing against the Best Nearest Neighbor Filter in Regression.",
                    "Lipschitz Bandits without the Lipschitz Constant.",
                    "Deviations of Stochastic Bandit Regret.",
                    "On Upper-Confidence Bound Policies for Switching Bandit Problems.",
                    "Upper-Confidence-Bound Algorithms for Active Learning in Multi-armed Bandits.",
                    "The Perceptron with Dynamic Margin.",
                    "Combining Initial Segments of Lists.",
                    "Regret Minimization Algorithms for Pricing Lookback Options.",
                    "Making Online Decisions with Bounded Memory.",
                    "Universal Prediction of Selected Bits.",
                    "Semantic Communication for Simple Goals Is Equivalent to On-line Learning.",
                    "Accelerated Training of Max-Margin Markov Networks with Kernels.",
                    "Domain Adaptation in Regression.",
                    "Approximate Reduction from AUC Maximization to 1-Norm Soft Margin Optimization.",
                    "Axioms for Rational Reinforcement Learning.",
                    "Universal Knowledge-Seeking Agents.",
                    "Asymptotically Optimal Agents.",
                    "Time Consistent Discounting.",
                    "Distributional Learning of Simple Context-Free Tree Grammars.",
                    "On Noise-Tolerant Learning of Sparse Parities and Related Problems.",
                    "Supervised Learning and Co-training.",
                    "Learning a Classifier when the Labeling Is Known.",
                    "Erratum: Learning without Coding."
                ]
            }
        ]
    },
    {
        "year": "2010",
        "name": "21. ALT 2010",
        "info": "Canberra, Australia",
        "venues": [
            {
                "sub_name_abbr": "conf/alt/2010",
                "sub_name": "Algorithmic Learning Theory, 21st International Conference, ALT 2010, Canberra, Australia, October 6-8, 2010. Proceedings.",
                "count": 32,
                "papers": [
                    "Editors' Introduction.",
                    "Towards General Algorithms for Grammatical Inference.",
                    "The Blessing and the Curse of the Multiplicative Updates.",
                    "Discovery of Abstract Concepts by a Robot.",
                    "Contrast Pattern Mining and Its Application for Building Robust Classifiers.",
                    "Optimal Online Prediction in Adversarial Environments.",
                    "An Algorithm for Iterative Selection of Blocks of Features.",
                    "Bayesian Active Learning Using Arbitrary Binary Valued Queries.",
                    "Approximation Stability and Boosting.",
                    "A Spectral Approach for Probabilistic Grammatical Inference on Trees.",
                    "PageRank Optimization in Polynomial Time by Stochastic Shortest Path Reformulation.",
                    "Inferring Social Networks from Outbreaks.",
                    "Distribution-Dependent PAC-Bayes Priors.",
                    "PAC Learnability of a Concept Class under Non-atomic Measures: A Problem by Vidyasagar.",
                    "A PAC-Bayes Bound for Tailored Density Estimation.",
                    "Compressed Learning with Regular Concept.",
                    "A Lower Bound for Learning Distributions Generated by Probabilistic Automata.",
                    "Lower Bounds on Learning Random Structures with Statistical Queries.",
                    "Recursive Teaching Dimension, Learning Complexity, and Maximum Classes.",
                    "Toward a Classification of Finite Partial-Monitoring Games.",
                    "Switching Investments.",
                    "Prediction with Expert Advice under Discounted Loss.",
                    "A Regularization Approach to Metrical Task Systems.",
                    "Solutions to Open Questions for Non-U-Shaped Learning with Memory Limitations.",
                    "Learning without Coding.",
                    "Learning Figures with the Hausdorff Metric by Fractals.",
                    "Inductive Inference of Languages from Samplings.",
                    "Optimality Issues of Universal Greedy Agents with Static Priors.",
                    "Consistency of Feature Markov Processes.",
                    "Algorithms for Adversarial Bandit Problems with Multiple Plays.",
                    "Online Multiple Kernel Learning: Algorithms and Mistake Bounds.",
                    "An Identity for Kernel Ridge Regression."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "20. ALT 2009",
        "info": "Porto, Portugal",
        "venues": [
            {
                "sub_name_abbr": "conf/alt/2009",
                "sub_name": "Algorithmic Learning Theory, 20th International Conference, ALT 2009, Porto, Portugal, October 3-5, 2009. Proceedings.",
                "count": 31,
                "papers": [
                    "The Two Faces of Active Learning.",
                    "Inference and Learning in Planning.",
                    "Mining Heterogeneous Information Networks by Exploring the Power of Links.",
                    "Learning and Domain Adaptation.",
                    "Learning on the Web.",
                    "Prediction with Expert Evaluators' Advice.",
                    "Pure Exploration in Multi-armed Bandits Problems.",
                    "The Follow Perturbed Leader Algorithm Protected from Unbounded One-Step Losses.",
                    "Computable Bayesian Compression for Uniformly Discretizable Statistical Models.",
                    "Calibration and Internal No-Regret with Random Signals.",
                    "St. Petersburg Portfolio Games.",
                    "Reconstructing Weighted Graphs with Minimal Query Complexity.",
                    "Learning Unknown Graphs.",
                    "Completing Networks Using Observed Data.",
                    "Average-Case Active Learning with Costs.",
                    "Canonical Horn Representations and Query Learning.",
                    "Learning Finite Automata Using Label Queries.",
                    "Characterizing Statistical Query Learning: Simplified Notions and Proofs.",
                    "An Algebraic Perspective on Boolean Function Learning.",
                    "Adaptive Estimation of the Optimal ROC Curve and a Bipartite Ranking Algorithm.",
                    "Complexity versus Agreement for Many Views.",
                    "Error-Correcting Tournaments.",
                    "Difficulties in Forcing Fairness of Polynomial Time Inductive Inference.",
                    "Learning Mildly Context-Sensitive Languages with Multidimensional Substitutability from Positive Data.",
                    "Uncountable Automatic Classes and Learning.",
                    "Iterative Learning from Texts and Counterexamples Using Additional Information.",
                    "Incremental Learning with Ordinal Bounded Example Memory.",
                    "Learning from Streams.",
                    "Smart PAC-Learners.",
                    "Approximation Algorithms for Tensor Clustering.",
                    "Agnostic Clustering."
                ]
            }
        ]
    },
    {
        "year": "2008",
        "name": "19. ALT 2008",
        "info": "Budapest, Hungary",
        "venues": [
            {
                "sub_name_abbr": "conf/alt/2008",
                "sub_name": "Algorithmic Learning Theory, 19th International Conference, ALT 2008, Budapest, Hungary, October 13-16, 2008. Proceedings.",
                "count": 37,
                "papers": [
                    "On Iterative Algorithms with an Information Geometry Background.",
                    "Visual Analytics: Combining Automated Discovery with Interactive Visualizations.",
                    "Some Mathematics behind Graph Property Testing.",
                    "Finding Total and Partial Orders from Data for Seriation.",
                    "Computational Models of Neural Representations in the Human Brain.",
                    "Generalization Bounds for Some Ordinal Regression Algorithms.",
                    "Approximation of the Optimal ROC Curve and a Tree-Based Ranking Algorithm.",
                    "Sample Selection Bias Correction Theory.",
                    "Exploiting Cluster-Structure to Predict the Labeling of a Graph.",
                    "A Uniform Lower Error Bound for Half-Space Learning.",
                    "Generalization Bounds for K-Dimensional Coding Schemes in Hilbert Spaces.",
                    "Learning and Generalization with the Information Bottleneck.",
                    "Growth Optimal Investment with Transaction Costs.",
                    "Online Regret Bounds for Markov Decision Processes with Deterministic Transitions.",
                    "On-Line Probability, Complexity and Randomness.",
                    "Prequential Randomness.",
                    "Some Sufficient Conditions on an Arbitrary Class of Stochastic Processes for the Existence of a Predictor.",
                    "Nonparametric Independence Tests: Space Partitioning and Kernel Approaches.",
                    "Supermartingales in Prediction with Expert Advice.",
                    "Aggregating Algorithm for a Space of Analytic Functions.",
                    "Smooth Boosting for Margin-Based Ranking.",
                    "Learning with Continuous Experts Using Drifting Games.",
                    "Entropy Regularized LPBoost.",
                    "Optimally Learning Social Networks with Activations and Suppressions.",
                    "Active Learning in Multi-armed Bandits.",
                    "Query Learning and Certificates in Lattices.",
                    "Clustering with Interactive Feedback.",
                    "Active Learning of Group-Structured Environments.",
                    "Finding the Rare Cube.",
                    "Iterative Learning of Simple External Contextual Languages.",
                    "Topological Properties of Concept Spaces.",
                    "Dynamically Delayed Postdictive Completeness and Consistency in Learning.",
                    "Dynamic Modeling in Inductive Inference.",
                    "Optimal Language Learning.",
                    "Numberings Optimal for Learning.",
                    "Learning with Temporary Memory.",
                    "Erratum: Constructing Multiclass Learners from Binary Learners: A Simple Black-Box Analysis of the Generalization Errors."
                ]
            }
        ]
    },
    {
        "year": "2007",
        "name": "18. ALT 2007",
        "info": "Sendai, Japan",
        "venues": [
            {
                "sub_name_abbr": "conf/alt/2007",
                "sub_name": "Algorithmic Learning Theory, 18th International Conference, ALT 2007, Sendai, Japan, October 1-4, 2007, Proceedings.",
                "count": 31,
                "papers": [
                    "Editors' Introduction.",
                    "A Theory of Similarity Functions for Learning and Clustering.",
                    "Machine Learning in Ecosystem Informatics.",
                    "Challenge for Info-plosion.",
                    "A Hilbert Space Embedding for Distributions.",
                    "Simple Algorithmic Principles of Discovery, Subjective Beauty, Selective Attention, Curiosity and Creativity.",
                    "Feasible Iteration of Feasible Learning Functionals.",
                    "Parallelism Increases Iterative Learning Power.",
                    "Prescribed Learning of R.E. Classes.",
                    "Learning in Friedberg Numberings.",
                    "Separating Models of Learning with Faulty Teachers.",
                    "Vapnik-Chervonenkis Dimension of Parallel Arithmetic Computations.",
                    "Parameterized Learnability of k -Juntas and Related Problems.",
                    "On Universal Transfer Learning.",
                    "Tuning Bandit Algorithms in Stochastic Environments.",
                    "Following the Perturbed Leader to Gamble at Multi-armed Bandits.",
                    "Online Regression Competitive with Changing Predictors.",
                    "Cluster Identification in Nearest-Neighbor Graphs.",
                    "Multiple Pass Streaming Algorithms for Learning Mixtures of Distributions in \\mathbb Rd.",
                    "Learning Efficiency of Very Simple Grammars from Positive Data.",
                    "Learning Rational Stochastic Tree Languages.",
                    "One-Shot Learners Using Negative Counterexamples and Nearest Positive Examples.",
                    "Polynomial Time Algorithms for Learning k -Reversible Languages and Pattern Languages with Correction Queries.",
                    "Learning and Verifying Graphs Using Queries with a Focus on Edge Counting.",
                    "Exact Learning of Finite Unions of Graph Patterns from Queries.",
                    "Polynomial Summaries of Positive Semidefinite Kernels.",
                    "Learning Kernel Perceptrons on Noisy Data Using Random Projections.",
                    "Continuity of Performance Metrics for Thin Feature Maps.",
                    "Multiclass Boosting Algorithms for Shrinkage Estimators of Class Probability.",
                    "Pseudometrics for State Aggregation in Average Reward Markov Decision Processes.",
                    "On Calibration Error of Randomized Forecasting Algorithms."
                ]
            }
        ]
    },
    {
        "year": "2006",
        "name": "17. ALT 2006",
        "info": "Barcelona, Spain",
        "venues": [
            {
                "sub_name_abbr": "conf/alt/2006",
                "sub_name": "Algorithmic Learning Theory, 17th International Conference, ALT 2006, Barcelona, Spain, October 7-10, 2006, Proceedings.",
                "count": 30,
                "papers": [
                    "Editors' Introduction.",
                    "Solving Semi-infinite Linear Programs Using Boosting-Like Methods.",
                    "e-Science and the Semantic Web: A Symbiotic Relationship.",
                    "Spectral Norm in Learning Theory: Some Selected Topics.",
                    "Data-Driven Discovery Using Probabilistic Hidden Variable Models.",
                    "Reinforcement Learning and Apprenticeship Learning for Robotic Control.",
                    "Learning Unions of omega(1)-Dimensional Rectangles.",
                    "On Exact Learning Halfspaces with Random Consistent Hypothesis Oracle.",
                    "Active Learning in the Non-realizable Case.",
                    "How Many Query Superpositions Are Needed to Learn?",
                    "Teaching Memoryless Randomized Learners Without Feedback.",
                    "The Complexity of Learning SUBSEQ (A).",
                    "Mind Change Complexity of Inferring Unbounded Unions of Pattern Languages from Positive Data.",
                    "Learning and Extending Sublanguages.",
                    "Iterative Learning from Positive Data and Negative Counterexamples.",
                    "Towards a Better Understanding of Incremental Learning.",
                    "On Exact Learning from Random Walk.",
                    "Risk-Sensitive Online Learning.",
                    "Leading Strategies in Competitive On-Line Prediction.",
                    "Hannan Consistency in On-Line Learning in Case of Unbounded Losses Under Partial Monitoring.",
                    "General Discounting Versus Average Reward.",
                    "The Missing Consistency Theorem for Bayesian Learning: Stochastic Model Selection.",
                    "Is There an Elegant Universal Theory of Prediction?",
                    "Learning Linearly Separable Languages.",
                    "Smooth Boosting Using an Information-Based Criterion.",
                    "Large-Margin Thresholded Ensembles for Ordinal Regression: Theory and Practice.",
                    "Asymptotic Learnability of Reinforcement Problems with Arbitrary Dependence.",
                    "Probabilistic Generalization of Simple Grammars and Its Application to Reinforcement Learning.",
                    "Unsupervised Slow Subspace-Learning from Stationary Processes.",
                    "Learning-Related Complexity of Linear Ranking Functions."
                ]
            }
        ]
    },
    {
        "year": "2005",
        "name": "16. ALT 2005",
        "info": "Singapore",
        "venues": [
            {
                "sub_name_abbr": "conf/alt/2005",
                "sub_name": "Algorithmic Learning Theory, 16th International Conference, ALT 2005, Singapore, October 8-11, 2005, Proceedings.",
                "count": 36,
                "papers": [
                    "Editors' Introduction.",
                    "Invention and Artificial Intelligence.",
                    "The Arrowsmith Project: 2005 Status Report.",
                    "The Robot Scientist Project.",
                    "Algorithms and Software for Collaborative Discovery from Autonomous, Semantically Heterogeneous, Distributed Information Sources.",
                    "Training Support Vector Machines via SMO-Type Decomposition Methods.",
                    "Measuring Statistical Dependence with Hilbert-Schmidt Norms.",
                    "An Analysis of the Anti-learning Phenomenon for the Class Symmetric Polyhedron.",
                    "Learning Causal Structures Based on Markov Equivalence Class.",
                    "Stochastic Complexity for Mixture of Exponential Families in Variational Bayes.",
                    "ACME: An Associative Classifier Based on Maximum Entropy Principle.",
                    "Constructing Multiclass Learners from Binary Learners: A Simple Black-Box Analysis of the Generalization Errors.",
                    "On Computability of Pattern Recognition Problems.",
                    "PAC-Learnability of Probabilistic Deterministic Finite State Automata in Terms of Variation Distance.",
                    "Learnability of Probabilistic Automata via Oracles.",
                    "Learning Attribute-Efficiently with Corrupt Oracles.",
                    "Learning DNF by Statistical and Proper Distance Queries Under the Uniform Distribution.",
                    "Learning of Elementary Formal Systems with Two Clauses Using Queries.",
                    "Gold-Style and Query Learning Under Various Constraints on the Target Class.",
                    "Non U-Shaped Vacillatory and Team Learning.",
                    "Learning Multiple Languages in Groups.",
                    "Inferring Unions of the Pattern Languages by the Most Fitting Covers.",
                    "Identification in the Limit of Substitutable Context-Free Languages.",
                    "Algorithms for Learning Regular Expressions.",
                    "A Class of Prolog Programs with Non-linear Outputs Inferable from Positive Data.",
                    "Absolute Versus Probabilistic Classification in a Logical Setting.",
                    "Online Allocation with Risk Information.",
                    "Defensive Universal Learning with Experts.",
                    "On Following the Perturbed Leader in the Bandit Setting.",
                    "Mixture of Vector Experts.",
                    "On-line Learning with Delayed Label Feedback.",
                    "Monotone Conditional Complexity Bounds on Future Prediction Errors.",
                    "Non-asymptotic Calibration and Resolution.",
                    "Defensive Prediction with Expert Advice.",
                    "Defensive Forecasting for Linear Protocols.",
                    "Teaching Learners with Restricted Mind Changes."
                ]
            }
        ]
    },
    {
        "year": "2004",
        "name": "15. ALT 2004",
        "info": "Padova, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/alt/2004",
                "sub_name": "Algorithmic Learning Theory, 15th International Conference, ALT 2004, Padova, Italy, October 2-5, 2004, Proceedings.",
                "count": 37,
                "papers": [
                    "String Pattern Discovery.",
                    "Applications of Regularized Least Squares to Classification Problems.",
                    "Probabilistic Inductive Logic Programming.",
                    "Hidden Markov Modelling Techniques for Haplotype Analysis.",
                    "Learning, Logic, and Probability: A Unified View.",
                    "Learning Languages from Positive Data and Negative Counterexamples.",
                    "Inductive Inference of Term Rewriting Systems from Positive Data.",
                    "On the Data Consumption Benefits of Accepting Increased Uncertainty.",
                    "Comparison of Query Learning and Gold-Style Learning in Dependence of the Hypothesis Space.",
                    "Learning r-of-k Functions by Boosting.",
                    "Boosting Based on Divide and Merge.",
                    "Learning Boolean Functions in AC0 on Attribute and Classification Noise.",
                    "Decision Trees: More Theoretical Justification for Practical Algorithms.",
                    "Application of Classical Nonparametric Predictors to Learning Conditionally I.I.D. Data.",
                    "Complexity of Pattern Classes and Lipschitz Property.",
                    "On Kernels, Margins, and Low-Dimensional Mappings.",
                    "Estimation of the Data Region Using Extreme-Value Distributions.",
                    "Maximum Entropy Principle in Non-ordered Setting.",
                    "Universal Convergence of Semimeasures on Individual Random Sequences.",
                    "A Criterion for the Existence of Predictive Complexity for Binary Games.",
                    "Full Information Game with Gains and Losses.",
                    "Prediction with Expert Advice by Following the Perturbed Leader for General Weights.",
                    "On the Convergence Speed of MDL Predictions for Bernoulli Sequences.",
                    "Relative Loss Bounds and Polynomial-Time Predictions for the k-lms-net Algorithm.",
                    "On the Complexity of Working Set Selection.",
                    "Convergence of a Generalized Gradient Selection Approach for the Decomposition Method.",
                    "Newton Diagram and Stochastic Complexity in Mixture of Binomial Distributions.",
                    "Learnability of Relatively Quantified Generalized Formulas.",
                    "Learning Languages Generated by Elementary Formal Systems and Its Application to SH Languages.",
                    "New Revision Algorithms.",
                    "The Subsumption Lattice and Query Learning.",
                    "Learning of Ordered Tree Languages with Height-Bounded Variables Using Queries.",
                    "Learning Tree Languages from Positive Examples and Membership Queries.",
                    "Learning Content Sequencing in an Educational Environment According to Student Needs.",
                    "Statistical Learning in Digital Wireless Communications.",
                    "A BP-Based Algorithm for Performing Bayesian Inference in Large Perceptron-Type Networks.",
                    "Approximate Inference in Probabilistic Models."
                ]
            }
        ]
    },
    {
        "year": "2003",
        "name": "14. ALT 2003",
        "info": "Sapporo, Japan",
        "venues": [
            {
                "sub_name_abbr": "conf/alt/2003",
                "sub_name": "Algorithmic Learning Theory, 14th International Conference, ALT 2003, Sapporo, Japan, October 17-19, 2003, Proceedings.",
                "count": 24,
                "papers": [
                    "Abduction and the Dualization Problem.",
                    "Signal Extraction and Knowledge Discovery Based on Statistical Modeling.",
                    "Association Computation for Information Access.",
                    "Efficient Data Representations That Preserve Information.",
                    "Can Learning in the Limit Be Done Efficiently?",
                    "Intrinsic Complexity of Uniform Learning.",
                    "On Ordinal VC-Dimension and Some Notions of Complexity.",
                    "Learning of Erasing Primitive Formal Systems from Positive Examples.",
                    "Changing the Inference Type - Keeping the Hypothesis Space.",
                    "Robust Inference of Relevant Attributes.",
                    "Efficient Learning of Ordered and Unordered Tree Patterns with Contractible Variables.",
                    "On the Learnability of Erasing Pattern Languages in the Query Model.",
                    "Learning of Finite Unions of Tree Patterns with Repeated Internal Structured Variables from Queries.",
                    "Kernel Trick Embedded Gaussian Mixture Model.",
                    "Efficiently Learning the Metric with Side-Information.",
                    "Learning Continuous Latent Variable Models with Bregman Divergences.",
                    "A Stochastic Gradient Descent Algorithm for Structural Risk Minimisation.",
                    "On the Complexity of Training a Single Perceptron with Programmable Synaptic Delays.",
                    "Learning a Subclass of Regular Patterns in Polynomial Time.",
                    "Identification with Probability One of Stochastic Deterministic Linear Languages.",
                    "Criterion of Calibration for Transductive Confidence Machine with Limited Feedback.",
                    "Well-Calibrated Predictions from Online Compression Models.",
                    "Transductive Confidence Machine Is Universal.",
                    "On the Existence and Convergence of Computable Universal Priors."
                ]
            }
        ]
    },
    {
        "year": "2002",
        "name": "13. ALT 2002",
        "info": "Lübeck, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/alt/2002",
                "sub_name": "Algorithmic Learning Theory, 13th International Conference, ALT 2002, Lübeck, Germany, November 24-26, 2002, Proceedings.",
                "count": 32,
                "papers": [
                    "Editors' Introduction.",
                    "Mathematics Based on Learning.",
                    "Data Mining with Graphical Models.",
                    "On the Eigenspectrum of the Gram Matrix and Its Relationship to the Operator Eigenspectrum.",
                    "In Search of the Horowitz Factor: Interim Report on a Musical Discovery Project.",
                    "Learning Structure from Sequences, with Applications in a Digital Library.",
                    "On Learning Monotone Boolean Functions under the Uniform Distribution.",
                    "On Learning Embedded Midbit Functions.",
                    "Maximizing Agreements and CoAgnostic Learning.",
                    "Optimally-Smooth Adaptive Boosting and Application to Agnostic Learning.",
                    "Large Margin Classification for Moving Targets.",
                    "On the Smallest Possible Dimension and the Largest Possible Margin of Linear Arrangements Representing Given Concept Classes Uniform Distribution.",
                    "A General Dimension for Approximately Learning Boolean Functions.",
                    "The Complexity of Learning Concept Classes with Polynomial General Dimension.",
                    "On the Absence of Predictive Complexity for Some Games.",
                    "Consistency Queries in Information Extraction.",
                    "Ordered Term Tree Languages which Are Polynomial Time Inductively Inferable from Positive Data.",
                    "Reflective Inductive Inference of Recursive Functions.",
                    "Classes with Easily Learnable Subclasses.",
                    "On the Learnability of Vector Spaces.",
                    "Learning, Logic, and Topology in a Common Framework.",
                    "A Pathology of Bottom-Up Hill-Climbing in Inductive Rule Learning.",
                    "Minimised Residue Hypotheses in Relevant Logic.",
                    "Compactness and Learning of Classes of Unions of Erasing Regular Pattern Languages.",
                    "A Negative Result on Inductive Inference of Extended Pattern Languages.",
                    "RBF Neural Networks and Descartes' Rule of Signs.",
                    "Asymptotic Optimality of Transductive Confidence Machine.",
                    "An Efficient PAC Algorithm for Reconstructing a Mixture of Lines.",
                    "Constraint Classification: A New Approach to Multiclass Classification.",
                    "How to Achieve Minimax Expected Kullback-Leibler Distance from an Unknown Finite Distribution.",
                    "Classification with Intersecting Rules.",
                    "Feedforward Neural Networks in Reinforcement Learning Applied to High-Dimensional Motor Control."
                ]
            }
        ]
    },
    {
        "year": "2001",
        "name": "12. ALT 2001",
        "info": "Washington, DC, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/alt/2001",
                "sub_name": "Algorithmic Learning Theory, 12th International Conference, ALT 2001, Washington, DC, USA, November 25-28, 2001, Proceedings.",
                "count": 27,
                "papers": [
                    "Editors' Introduction.",
                    "The Discovery Science Project in Japan.",
                    "Queries Revisited.",
                    "Robot Baby 2001.",
                    "Discovering Mechanisms: A Computational Philosophy of Science Perspective.",
                    "Inventing Discovery Tools: Combining Information Visualization with Data Mining.",
                    "On Learning Correlated Boolean Functions Using Statistical Queries.",
                    "A Simpler Analysis of the Multi-way Branching Decision Tree Boosting Algorithm.",
                    "Minimizing the Quadratic Training Error of a Sigmoid Neuron Is Hard.",
                    "Learning of Boolean Functions Using Support Vector Machines.",
                    "A Random Sampling Technique for Training Support Vector Machines.",
                    "Learning Coherent Concepts.",
                    "Learning Intermediate Concepts.",
                    "Real-Valued Multiple-Instance Learning with Queries.",
                    "Loss Functions, Complexities, and the Legendre Transformation.",
                    "Non-linear Inequalities between Predictive and Kolmogorov Complexities.",
                    "Learning by Switching Type of Information.",
                    "Learning How to Separate.",
                    "Learning Languages in a Union.",
                    "On the Comparison of Inductive Inference Criteria for Uniform Learning of Finite Classes.",
                    "Refutable Language Learning with a Neighbor System.",
                    "Learning Recursive Functions Refutably.",
                    "Refuting Learning Revisited.",
                    "Efficient Learning of Semi-structured Data from Queries.",
                    "Extending Elementary Formal Systems.",
                    "Learning Regular Languages Using RFSA.",
                    "Inference of omega-Languages from Prefixes."
                ]
            }
        ]
    },
    {
        "year": "2000",
        "name": "11. ALT 2000",
        "info": "Sydney, Australia",
        "venues": [
            {
                "sub_name_abbr": "conf/alt/2000",
                "sub_name": "Algorithmic Learning Theory, 11th International Conference, ALT 2000, Sydney, Australia, December 11-13, 2000, Proceedings.",
                "count": 25,
                "papers": [
                    "Extracting Information from the Web for Concept Learning and Collaborative Filtering.",
                    "The Divide-and-Conquer Manifesto.",
                    "Sequential Sampling Techniques for Algorithmic Learning Theory.",
                    "Towards an Algorithmic Statistics.",
                    "Minimum Message Length Grouping of Ordered Data.",
                    "Learning from Positive and Unlabeled Examples.",
                    "Learning Erasing Pattern Languages with Queries.",
                    "Learning Recursive Concepts with Anomalies.",
                    "Identification of Function Distinguishable Languages.",
                    "A Probabilistic Identification Result.",
                    "A New Framework for Discovering Knowledge from Two-Dimensional Structured Data Using Layout Formal Graph System.",
                    "Hypotheses Finding via Residue Hypotheses with the Resolution Principle.",
                    "Conceptual Classifications Guided by a Concept Hierarchy.",
                    "Learning Taxonomic Relation by Case-Based Reasoning.",
                    "Average-Case Analysis of Classification Algorithms for Boolean Functions and Decision Trees.",
                    "Self-Duality of Bounded Monotone Boolean Functions and Related Problems.",
                    "Sharper Bounds for the Hardness of Prototype and Feature Selection.",
                    "On the Hardness of Learning Acyclic Conjunctive Queries.",
                    "Dynamic Hand Gesture Recognition Based on Randomized Self-Organizing Map Algorithm.",
                    "On Approximate Learning by Multi-layered Feedforward Circuits.",
                    "The Last-Step Minimax Algorithm.",
                    "Rough Sets and Ordinal Classification.",
                    "A Note on the Generalization Performance of Kernel Classifiers with Margin.",
                    "On the Noise Model of Support Vector Machines Regression.",
                    "Computationally Efficient Transductive Machines."
                ]
            }
        ]
    },
    {
        "year": "1999",
        "name": "10. ALT 1999",
        "info": "Tokyo, Japan",
        "venues": [
            {
                "sub_name_abbr": "conf/alt/1999",
                "sub_name": "Algorithmic Learning Theory, 10th International Conference, ALT '99, Tokyo, Japan, December 6-8, 1999, Proceedings.",
                "count": 29,
                "papers": [
                    "Tailoring Representations to Different Requirements.",
                    "Theoretical Views of Boosting and Applications.",
                    "Extended Stochastic Complexity and Minimax Relative Loss Analysis.",
                    "Algebraic Analysis for Singular Statistical Estimation.",
                    "Generalization Error of Limear Neural Networks in Unidentifiable Cases.",
                    "The Computational Limits to the Cognitive Power of the Neuroidal Tabula Rasa.",
                    "The Consistency Dimension and Distribution-Dependent Learning from Queries (Extended Abstract).",
                    "The VC-Dimension of Subclasses of Pattern.",
                    "On the Vgamma Dimension for Regression in Reproducing Kernel Hilbert Spaces.",
                    "On the Strength of Incremental Learning.",
                    "Learning from Random Text.",
                    "Inductive Learning with Corroboration.",
                    "Flattening and Implication.",
                    "Induction of Logic Programs Based on psi-Terms.",
                    "Complexity in the Case against Accuracy: When Building one Function-Free Horn Clause is as Hard as Any.",
                    "A Method of Similarity-Driven Knowledge Revision for Type Specializations.",
                    "PAC Learning with Nasty Noise.",
                    "Positive and Unlabeled Examples Help Learning.",
                    "Learning Real Polynomials with a Turing Machine.",
                    "Faster Near-Optimal Reinforcement Learning: Adding Adaptiveness to the E3 Algorithm.",
                    "A Note on Support Vector Machine Degeneracy.",
                    "Learnability of Enumerable Classes of Recursive Functions from \"Typical\" Examples.",
                    "On the Uniform Learnability of Approximations to Non-Recursive Functions.",
                    "Learning Minimal Covers of Functional Dependencies with Queries.",
                    "Boolean Formulas are Hard to Learn for most Gate Bases.",
                    "Finding Relevant Variables in PAC Model with Membership Queries.",
                    "Genral Linear Relations among Different Types of Predictive Complexity.",
                    "Predicting Nearly as well as the best Pruning of a Planar Decision Graph.",
                    "On Learning Unions of Pattern Languages and Tree Patterns."
                ]
            }
        ]
    },
    {
        "year": "1998",
        "name": "9. ALT 1998",
        "info": "Otzenhausen, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/alt/1998",
                "sub_name": "Algorithmic Learning Theory, 9th International Conference, ALT '98, Otzenhausen, Germany, October 8-10, 1998, Proceedings.",
                "count": 30,
                "papers": [
                    "Editor's Introduction.",
                    "Scalability Issues in Inductive Logic Programming.",
                    "Learning to Win Process-Control Games Watching Game-Masters.",
                    "Closedness Properties in EX-Identification of Recursive Functions.",
                    "Lower Bounds for the Complexity of Learning Half-Spaces with Membership Queries.",
                    "Cryptographic Limitations on Parallelizing Membership and Equivalence Queries with Applications to Random Self-Reductions.",
                    "Learning Unary Output Two-Tape Automata from Multiplicity and Equivalence Queries.",
                    "Computational Aspects of Parallel Attribute-Efficient Learning.",
                    "PAC Learning from Positive Statistical Queries.",
                    "Structured Weight-Based Prediction Algorithms.",
                    "Learning from Entailment of Logic Programs with Local Variables.",
                    "Logical Aspects of Several Bottom-Up Fittings.",
                    "Learnability of Translations from Positive Examples.",
                    "Analysis of Case-Based Representability of Boolean Functions by Monotone Theory.",
                    "Locality, Reversibility, and Beyond: Learning Languages from Positive Data.",
                    "Synthesizing Learners Tolerating Computable Noisy Data.",
                    "Characteristic Sets for Unions of Regular Pattern Languages and Compactness.",
                    "Finding a One-Variable Pattern from Incomplete Data.",
                    "A Fast Algorithm for Discovering Optimal String Patterns in Large Text Databases.",
                    "A Comparison of Identification Criteria for Inductive Inference of Recursive Real-Valued Functions.",
                    "Predictive Learning Models for Concept Drift.",
                    "Learning with Refutation.",
                    "Comparing the Power of Probabilistic Learning and Oracle Identification Under Monotonicity Constraints.",
                    "Learning Algebraic Structures from Text Using Semantical Knowledge.",
                    "LIME: A System for Learning Relations.",
                    "On the Sample Complexity for Neural Trees.",
                    "Learning Sub-classes of Monotone DNF on the Uniform Distribution.",
                    "Using Attribute Grammars for Description of Inductive Inference Search Space.",
                    "Towards the Validation of Inductive Learning Systems.",
                    "Consistent Polynominal Identification in the Limit."
                ]
            }
        ]
    },
    {
        "year": "1997",
        "name": "8. ALT 1997",
        "info": "Sendai, Japan",
        "venues": [
            {
                "sub_name_abbr": "conf/alt/1997",
                "sub_name": "Algorithmic Learning Theory, 8th International Conference, ALT '97, Sendai, Japan, October 6-8, 1997, Proceedings.",
                "count": 30,
                "papers": [
                    "Program Error Detection/Correction: Turning PAC Learning into PERFECT Learning (Abstract).",
                    "Team Learning as a Game.",
                    "Inferability of Recursive Real-Valued Functions.",
                    "Learning of R.E. Languages from Good Examples.",
                    "Identifiability of Subspaces and Homomorphic Images of Zero-Reversible Languages.",
                    "On Exploiting Knowledge and Concept Use in Learning Theory.",
                    "Partial Occam's Razor and Its Applications.",
                    "Deranomized Learning of Boolean Functions.",
                    "Learning DFA from Simple Examples.",
                    "PAC Learning under Helpful Distributions.",
                    "PAC Learning Using Nadaraya-Watson Estimator Based on Orthonormal Systems.",
                    "Monotone Extensions of Boolean Data Sets.",
                    "Classical Brouwer-Heyting-Kolmogorov Interpretation.",
                    "Inferring a System from Examples with Time Passage.",
                    "Polynomial Time Inductive Inference of Regular Term Tree Languages from Positive Data.",
                    "Synthesizing Noise-Tolerant Language Learners.",
                    "Effects of Kolmogorov Complexity Present in Inductive Inference as Well.",
                    "Learning One-Variable Pattern Languages Very Efficiently on Average, in Parallel, and by Asking Queries.",
                    "Oracles in Sigmap2 are Sufficient for Exact Learning.",
                    "Exact Learning via Teaching Assistants (Extended Abstract).",
                    "An Efficient Exact Learning Algorithm for Ordered Binary Decision Diagrams.",
                    "Probability Theory for the Brier Game.",
                    "Learning and Revising Theories in Noisy Domains.",
                    "A Note on a Scale-Sensitive Dimension of Linear Bounded Functionals in Banach Spaces.",
                    "On the Relevance of Time in Neural Computation and Learning.",
                    "A Simple Algorithm for Predicting Nearly as Well as the Best Pruning Labeled with the Best Prediction Values of a Decision Tree.",
                    "Learning Disjunctions of Features.",
                    "Learning Simple Deterministic Finite-Memory Automata.",
                    "Learning Acyclic First-Order Horn Sentences from Entailment.",
                    "On Learning Disjunctions of Zero-One Treshold Functions with Queries."
                ]
            }
        ]
    },
    {
        "year": "1996",
        "name": "7. ALT 1996",
        "info": "Sydney, Australia",
        "venues": [
            {
                "sub_name_abbr": "conf/alt/1996",
                "sub_name": "Algorithmic Learning Theory, 7th International Workshop, ALT '96, Sydney, Australia, October 23-25, 1996, Proceedings.",
                "count": 28,
                "papers": [
                    "Managing Complexity in Neurodial Circuits.",
                    "Learnability of Exclusive-Or Expansion Based on Monotone DNF Formulas.",
                    "Improved Bounds about On-line Learning of Smooth Functions of a Single Variable.",
                    "Query Learning of Bounded-Width OBDDs.",
                    "Learning a Representation for Optimizable Formulas.",
                    "Limits of Exact Algorithms For Inference of Minimum Size Finite State Machines.",
                    "Genetic Fitness Optimization Using Rapidly Mixing Markov Chains.",
                    "The Kindest Cut: Minimum Message Length Segmentation.",
                    "Reducing Complexity of Decision Trees with Two Variable Tests.",
                    "The Complexity of Exactly Learning Algebraic Concepts. (Extended Abstract).",
                    "Efficient Learning of Real Time Two-Counter Automata (Extended Abstract).",
                    "Cost-Sensitive Feature Reduction Applied to a Hybrid Genetic Algorithm.",
                    "Effects of Feature Selection with 'Blurring' on NeuroFuzzy Systems.",
                    "Boosting First-Order Learning.",
                    "Incorporating Hypothetical Knowledge into the Process of Inductive Synthesis.",
                    "Induction of Constraint Logic Programs.",
                    "Constructive Learning of Translations Based on Dictionaries.",
                    "Inductive Logic Programming Beyond Logical Implication.",
                    "Noise Elimination in Inductive Concept Learning: A Case Study in Medical Diagnosois.",
                    "MML Estimation of the Parameters of the Sherical Fisher Distribution.",
                    "Learning by Erasing.",
                    "On Learning and Co-learning of Minimal Programs.",
                    "Inductive Inference of Unbounded Unions of Pattern Languages from Positive Data.",
                    "A Class of Prolog Programs Inferable from Positive Data.",
                    "Vacillatory and BC Learning on Noisy Data.",
                    "Transformations that Preserve Learnability.",
                    "Probabilitic Limit Identification up to \"Small\" Sets.",
                    "Reflecting Inductive Inference Machines and Its Improvement by Therapy."
                ]
            }
        ]
    },
    {
        "year": "1995",
        "name": "6. ALT 1995",
        "info": "Fukuoka, Japan",
        "venues": [
            {
                "sub_name_abbr": "conf/alt/1995",
                "sub_name": "Algorithmic Learning Theory, 6th International Conference, ALT '95, Fukuoka, Japan, October 18-20, 1995, Proceedings.",
                "count": 25,
                "papers": [
                    "Editor's Introduction.",
                    "Grammatical Inference: An Old and New Paradigm.",
                    "Efficient Learning of Real Time One-Counter Automata.",
                    "Learning Strongly Deterministic Even Linear Languages from Positive Examples.",
                    "Language Learning from Membership Queries and Characteristic Examples.",
                    "Learning Unions of Tree Patterns Using Queries.",
                    "Inductive Constraint Logic.",
                    "Incremental Learning of Logic Programs.",
                    "Learning Orthogonal F-Horn Formulas.",
                    "Learning Nested Differences in the Presence of Malicious Noise.",
                    "Learning Sparse Linear Combinations of Basis Functions over a Finite Domain.",
                    "Inferring a DNA Sequence from Erroneous Copies (Abstract).",
                    "Machine Induction Without Revolutionary Paradigm Shifts.",
                    "Probabilistic Language Learning Under Monotonicity Constraints.",
                    "Noisy Inference and Oracles.",
                    "Simulating Teams with Many Conjectures.",
                    "Complexity of Network Training for Classes of Neural Networks.",
                    "Learning Ordered Binary Decision Diagrams.",
                    "Simple PAC Learning of Simple Decision Lists.",
                    "The Complexity of Learning Minor Closed Graph Classes.",
                    "Technical and Scientific Issues of KDD (or: Is KDD a Science?).",
                    "Analogical Logic Program Synthesis Algorithm That Can Refute Inappropriate Similarities.",
                    "Reflecting and Self-Confident Inductive Inference Machines.",
                    "On Approximately Identifying Concept Classes in the Limit.",
                    "Application of Kolmogorov Complexity to Inductive Inference with Limited Memory."
                ]
            }
        ]
    },
    {
        "year": "1994",
        "name": "5. ALT/4. AII 1994",
        "info": "Reinhardsbrunn Castle, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/alt/1994",
                "sub_name": "Algorithmic Learning Theory, 4th International Workshop on Analogical and Inductive Inference, AII '94, 5th International Workshop on Algorithmic Learning Theory, ALT '94, Reinhardsbrunn Castle, Germany, October 10-15, 1994, Proceedings.",
                "count": 45,
                "papers": [
                    "Towards Efficient Inductive Synthesis from Input/Output Examples (Abstract).",
                    "Deductive Plan Generation.",
                    "From Specifications to Programs: Induction in the Service of Synthesis (Abstract).",
                    "Average Case Analysis of Pattern Language Learning Algorithms (Abstract).",
                    "Enumerable Classes of Total Recursive Functions: Complexity of Inductive Inference.",
                    "Derived Sets and Inductive Inference.",
                    "Therapy Plan Generation as Program Synthesis.",
                    "A Calculus for Logical Clustering.",
                    "Learning with Higher Order Additional Information.",
                    "Efficient Learning of Regular Expressions from Good Examples.",
                    "Identifying Nearly Minimal Gödel Numbers From Additional Information.",
                    "Co-learnability and FIN-identifiability of Enumerable Classes of Total Recursive Functions.",
                    "On Case-Based Representability and Learnability of Languages.",
                    "Rule-Generating Abduction for Recursive Prolog.",
                    "Fuzzy Analogy Based Reasoning and Classification of Fuzzy Analogies.",
                    "Explanation-Based Reuse of Prolog Programs.",
                    "Constructive Induction for Recursive Programs.",
                    "Training Diagraphs.",
                    "Towards Realistic Theories of Learning.",
                    "A Unified Approach to Inductive Logic and Case-Based Reasoning (Extended Abstract).",
                    "Three Decades of Team Learning.",
                    "On-line Learning with Malicious Noise and the Closure Algorithm.",
                    "Learnability with Restricted Focus of Attention guarantees Noise-Tolerance.",
                    "Efficient Algorithm for Learning Simple Regular Expressions from Noisy Examples.",
                    "A Note on Learning DNF Formulas Using Equivalence and Incomplete Membership Queries.",
                    "Identifying Regular Languages over Partially-Commutative Monoids.",
                    "Classification Using Information.",
                    "Learning from Examples with Typed Equational Programming.",
                    "Finding Tree Patterns Consistent with Positive and Negative Examples Using Queries.",
                    "Program Synthesis in the Presence of Infinite Number of Inaccuracies.",
                    "On Monotonic Strategies for Learning r.e. Languages.",
                    "Language Learning under Various Types of Constraint Combinations.",
                    "Synthesis Algorithm for Recursive Process by µ-calculus (Extended Abstract).",
                    "Monotonicity versus Efficiency for Learning Languages from Texts.",
                    "Learning Concatenations of Locally Testable Languages from Positive Data.",
                    "Language Learning from Good Examples.",
                    "Machine Discovery in the Presence of Incomplete or Ambiguous Data.",
                    "Set-Driven and Rearrangement-Independent Learning of Recursive Languages.",
                    "Refutably Probably Approximately Correct Learning.",
                    "Inductive Inference of an Approximate Concept from Positive Data.",
                    "Efficient Distribution-free Population Learning of Simple Concepts.",
                    "Constructing Predicate Mappings for Goal-Dependent Abstraction.",
                    "Learning Languages by Collecting Cases and Tuning Parameters.",
                    "Mutual Information Gaining Algorithm and Its Relation to PAC-Learning Algorithm.",
                    "Inductive Inference of Monogenic Pure Context-free Languages."
                ]
            }
        ]
    },
    {
        "year": "1993",
        "name": "4. ALT 1993",
        "info": "Tokyo, Japan",
        "venues": [
            {
                "sub_name_abbr": "conf/alt/1993",
                "sub_name": "Algorithmic Learning Theory, 4th International Workshop, ALT '93, Tokyo, Japan, November 8-10, 1993, Proceedings.",
                "count": 32,
                "papers": [
                    "Identifying and Using Patterns in Sequential Data.",
                    "Learning Theory Toward Genome Informatics.",
                    "Optimal Layered Learning: A PAC Approach to Incremental Sampling.",
                    "Reformulation of Explanation by Linear Logic: Toward Logic for Explanation.",
                    "Towards Efficient Inductive Synthesis of Expressions from Input/Output Examples.",
                    "A Typed Lambda-Calculus for Proving-by-Example and Bottom-Up Generalization Procedure.",
                    "Case-Based Representation and Learning of Pattern Languages.",
                    "Inductive Resolution.",
                    "Generalized Unification as Background Knowledge in Learning Logic Programs.",
                    "Inductive Inference Machines That Can Refute Hypothesis Spaces.",
                    "On the Duality Between Mechanistic Learners and What it is They Learn.",
                    "On Aggregating Teams of Learning Machines.",
                    "Learning With Growing Quality.",
                    "Use of Reduction Arguments in Determining Popperian FIN-Type Learning Capabilities.",
                    "Properties of Language Classes With Finite Elasticity.",
                    "Uniform Charakterizations of Various Kinds of Language Learning.",
                    "How to Invent Characterizable Inference Methods for Regular Languages.",
                    "Neural Discriminant Analysis.",
                    "A New Algorithm for Automatic Configuration of Hidden Markov Models.",
                    "On the VC-Dimension of Depth Four Threshold Circuits and the Complexity of Boolean-Valued Functions.",
                    "On the Sample Complexity of Consistent Learning with One-Sided Error.",
                    "Complexity of Computing Vapnik-Chervonenkis Dimension.",
                    "Epsilon-Approximations of k-label Spaces.",
                    "Exact Learning of Linear Combinations of Monotone Terms from Function Value Queries.",
                    "Thue Systems and DNA - A Learning Algorithm for a Subclass.",
                    "The VC-Dimensions of Finite Automata with n States.",
                    "Unifying Learning Methods by Colored Digraphs.",
                    "A Perceptual Criterion for Visually Controlling Learning.",
                    "Learning Strategies Using Decision Lists.",
                    "A Decomposition Based Induction Model for Discovering Concept Clusters from Databases.",
                    "Algebraic Structure of Some Learning Systems.",
                    "Induction of Probabilistic Rules Based on Rough Set Theory."
                ]
            }
        ]
    },
    {
        "year": "1992",
        "name": "3. ALT 1992",
        "info": "Tokyo, Japan",
        "venues": [
            {
                "sub_name_abbr": "conf/alt/1992",
                "sub_name": "Algorithmic Learning Theory, Third Workshop, ALT '92, Tokyo, Japan, October 20-22, 1992, Proceedings.",
                "count": 22,
                "papers": [
                    "Discovery Learning in Intelligent Tutoring Systems.",
                    "From Inductive Inference to Algorithmic Learning Theory.",
                    "A Stochastic Approach to Genetic Information Processing.",
                    "On Learning Systolic Languages.",
                    "A Note on the Query Complexity of Learning DFA (Extended Abstract).",
                    "Polynomial-Time MAT Learning of Multilinear Logic Programs.",
                    "Iterative Weighted Least Squares Algorithms for Neural Networks Classifiers.",
                    "Domains of Attraction in Autoassociative Memory Networks for Character Pattern Recognition.",
                    "Regularization Learning of Neural Networks for Generalization.",
                    "Competitive Learning by Entropy Minimization.",
                    "Inductive Inference with Bounded Mind Changes.",
                    "Efficient Inductive Inference of Primitive Prologs from Positive Data.",
                    "Monotonic Language Learning.",
                    "Prudence in Vacillatory Language Identification (Extended Abstract).",
                    "Implementation of Heuristic Problem Solving Process Including Analogical Reasoning.",
                    "Planning with Abstraction Based on Partial Predicate Mappings.",
                    "Learning k-Term Monotone Boolean Formulae.",
                    "Some Improved Sample Complexity Bounds in the Probabilistic PAC Learning Model.",
                    "An Application Of Bernstein Polynomials in PAC Model.",
                    "On PAC Learnability of Functional Dependencies.",
                    "Protein Secondary Structure Prediction Based on Stochastic-Rule Learning.",
                    "Notes on the PAC Learning of Geometric Concepts with Additional Information."
                ]
            }
        ]
    },
    {
        "year": "1991",
        "name": "2. ALT 1991",
        "info": "",
        "venues": []
    },
    {
        "year": "1990",
        "name": "1. ALT 1990",
        "info": "Tokyo, Japan",
        "venues": [
            {
                "sub_name_abbr": "conf/alt/1990",
                "sub_name": "Algorithmic Learning Theory, First International Workshop, ALT '90, Tokyo, Japan, October 8-10, 1990, Proceedings.",
                "count": 31,
                "papers": [
                    "Mathematical Theory of Neural Learning.",
                    "Decision Theoretic Generalizations of the PAC Learning Model.",
                    "Inductive Logic Programming.",
                    "Structured Neural Networks and Their Flash Learning.",
                    "A Self-Organizing Network Composed of Symbol Nodes With Location Parameter.",
                    "The Function-Acquisition Paradigm in a Knowledge-Based Concept-Synthesis Environment.",
                    "The Algorithms of Recognition of the Functional Sites in Genetic Texts.",
                    "On Inductive Learning for Three Kinds of Data Structures.",
                    "On Paraphrasing-Based Analogical Reasoning.",
                    "Analogical Reasoning Based on Higher-Order Unification.",
                    "Analog by Simulation - A Weak Justification Method (Preliminary Report).",
                    "On the Role of Interpretive Analogy in Learning.",
                    "Occam Algorithms for Learning From Noisy Examples.",
                    "Reliable and Useful Learning with Uniform Probability Distributions.",
                    "Learning Commutative Deterministic Finite State Automata in Polynomial Time.",
                    "Learning the Distribution in the Extended PAC Model.",
                    "Teachability in Computational Learning.",
                    "Approximate Inference and Scientific Method.",
                    "Monotonic and Non-Monotonic Inductive Inference.",
                    "Anomalous Learning Helps Succinctness (Extended Abstract).",
                    "Polynomial-Time Inference of Pattern Languages.",
                    "Learning Equal Matrix Grammers and Multitape Automata with Structural Information.",
                    "Exact Learning of Semilinear Sets.",
                    "Learning Locally Testable Languages in the Strict Sense.",
                    "Inductive Inference of Monotonic Formal Systems from Positive Data.",
                    "Model Inference of Constrained Recursive Figures.",
                    "Efficient Induction of Logic Programs.",
                    "Deciding What to Learn in Explanation-Based Macro-Rule Learning.",
                    "Synthesis of Rewrite Programs by Higher-Order and Semantic Unification.",
                    "Inductive Inference of Term Rewriting Systems Realizing Algebras.",
                    "EBG and Term-Rewriting Systems."
                ]
            }
        ]
    }
]