[
    {
        "year": "2021",
        "name": "34th COLT 2021",
        "info": "Boulder, Colorado, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/colt/2021",
                "sub_name": "Conference on Learning Theory, COLT 2021, 15-19 August 2021, Boulder, Colorado, USA.",
                "count": 140,
                "papers": [
                    "Stochastic block model entropy and broadcasting on trees with survey.",
                    "Regret Minimization in Heavy-Tailed Bandits.",
                    "SGD Generalizes Better Than GD (And Regularization Doesn't Help).",
                    "The Bethe and Sinkhorn Permanents of Low Rank Matrices and Implications for Profile Maximum Likelihood.",
                    "Learning in Matrix Games can be Arbitrarily Complex.",
                    "Functions with average smoothness: structure, algorithms, and learning.",
                    "Adversarially Robust Low Dimensional Representations.",
                    "The Last-Iterate Convergence Rate of Optimistic Mirror Descent in Stochastic Variational Inequalities.",
                    "Optimal Dynamic Regret in Exp-Concave Online Learning.",
                    "Spectral Planting and the Hardness of Refuting Cuts, Colorability, and Communities in Random Graphs.",
                    "Non-Euclidean Differentially Private Stochastic Convex Optimization.",
                    "Reconstructing weighted voting schemes from partial information about their power indices.",
                    "Deterministic Finite-Memory Bias Estimation.",
                    "Online Learning from Optimal Actions.",
                    "Majorizing Measures, Sequential Complexities, and Online Learning.",
                    "Robust learning under clean-label attack.",
                    "Rank-one matrix estimation: analytic time evolution of gradient descent dynamics.",
                    "Multiplayer Bandit Learning, from Competition to Cooperation.",
                    "Near Optimal Distributed Learning of Halfspaces with Two Parties.",
                    "Near-Optimal Entrywise Sampling of Numerically Sparse Matrices.",
                    "Statistical Query Algorithms and Low Degree Tests Are Almost Equivalent.",
                    "Exact Recovery of Clusters in Finite Metric Spaces Using Oracle Queries.",
                    "A Law of Robustness for Two-Layers Neural Networks.",
                    "Cooperative and Stochastic Multi-Player Multi-Armed Bandit: Optimal Regret With Neither Communication Nor Collisions.",
                    "Fast Rates for Structured Prediction.",
                    "Thinking Inside the Ball: Near-Optimal Minimization of the Maximal Loss.",
                    "Optimizing Optimizers: Regret-optimal gradient descent algorithms.",
                    "When does gradient descent with logistic loss interpolate using deep networks with smoothed ReLU activations?",
                    "Breaking The Dimension Dependence in Sparse Distribution Estimation under Communication Constraints.",
                    "Learning and testing junta distributions with sub cube conditioning.",
                    "Black-Box Control for Linear Dynamical Systems.",
                    "Query complexity of least absolute deviation regression via robust uniform convergence.",
                    "Minimax Regret for Stochastic Shortest Path with Adversarial Costs and Known Transition.",
                    "Impossible Tuning Made Possible: A New Expert Algorithm and Its Applications.",
                    "Optimal dimension dependence of the Metropolis-Adjusted Langevin Algorithm.",
                    "Online Markov Decision Processes with Aggregate Bandit Feedback.",
                    "Quantifying Variational Approximation for Log-Partition Function.",
                    "From Local Pseudorandom Generators to Hardness of Learning.",
                    "A Statistical Taylor Theorem and Extrapolation of Truncated Densities.",
                    "Weak learning convex sets under normal distributions.",
                    "Learning sparse mixtures of permutations from noisy information.",
                    "Sparse sketches with small inversion bias.",
                    "The Sample Complexity of Robust Covariance Testing.",
                    "Agnostic Proper Learning of Halfspaces under Gaussian Marginals.",
                    "The Optimality of Polynomial Regression for Agnostic Learning under Gaussian Marginals in the SQ Model.",
                    "Boosting in the Presence of Massart Noise.",
                    "Outlier-Robust Learning of Ising Models Under Dobrushin's Condition.",
                    "Random Coordinate Langevin Monte Carlo.",
                    "On the Stability of Random Matrix Product with Markovian Noise: Application to Linear Stochastic Approximation and TD Learning.",
                    "Kernel Thinning.",
                    "Non-asymptotic approximations of neural networks by Gaussian processes.",
                    "On the Convergence of Langevin Monte Carlo: The Interplay between Tail Growth and Smoothness.",
                    "Adaptivity in Adaptive Submodularity.",
                    "Concentration of Non-Isotropic Random Tensors with Applications to Learning and Empirical Risk Minimization.",
                    "Modeling from Features: a Mean-field Framework for Over-parameterized Deep Neural Networks.",
                    "Sequential prediction under log-loss and misspecification.",
                    "Convergence rates and approximation results for SGD and its continuous-time counterpart.",
                    "Instance-Dependent Complexity of Contextual Bandits and Reinforcement Learning: A Disagreement-Based Perspective.",
                    "Efficient Algorithms for Learning from Coarse Labels.",
                    "Impossibility of Partial Recovery in the Graph Alignment Problem.",
                    "Frank-Wolfe with a Nearest Extreme Point Oracle.",
                    "On Avoiding the Union Bound When Answering Multiple Differentially Private Queries.",
                    "Survival of the strictest: Stable and unstable equilibria under regularized learning with partial information.",
                    "Differentially Private Nonparametric Regression Under a Growth Condition.",
                    "Source Identification for Mixtures of Product Distributions.",
                    "PAC-Bayes, MAC-Bayes and Conditional Mutual Information: Fast rate bounds that handle general VC classes.",
                    "Generalizing Complex Hypotheses on Product Distributions: Auctions, Prophet Inequalities, and Pandora's Problem.",
                    "Online Learning with Simple Predictors and a Combinatorial Characterization of Minimax in 0/1 Games.",
                    "Shape Matters: Understanding the Implicit Bias of the Noise Covariance.",
                    "Bounded Memory Active Learning through Enriched Queries.",
                    "Adaptive Learning in Continuous Games: Optimal Regret Bounds and Convergence to Nash Equilibrium.",
                    "On the Approximation Power of Two-Layer Networks of Random ReLUs.",
                    "Fast Rates for the Regret of Offline Reinforcement Learning.",
                    "Streaming k-PCA: Efficient guarantees for Oja's algorithm, beyond rank-one updates.",
                    "Group testing and local search: is there a computational-statistical gap?",
                    "Parameter-Free Multi-Armed Bandit Algorithms with Hybrid Data-Dependent Regret Bounds.",
                    "Double Explore-then-Commit: Asymptotic Optimality and Beyond.",
                    "Moment Multicalibration for Uncertainty Estimation.",
                    "Reduced-Rank Regression with Operator Norm Error.",
                    "(Nearly) Dimension Independent Private ERM with AdaGrad Ratesvia Publicly Estimated Subspaces.",
                    "The Sparse Vector Technique, Revisited.",
                    "Asymptotically Optimal Information-Directed Sampling.",
                    "Hypothesis testing with low-degree polynomials in the Morris class of exponential families.",
                    "On the Minimal Error of Empirical Risk Minimization.",
                    "Nonparametric Regression with Shallow Overparameterized Neural Networks Trained by GD with Early Stopping.",
                    "Projected Stochastic Gradient Langevin Algorithms for Constrained Sampling and Non-Convex Learning.",
                    "Improved Regret for Zeroth-Order Stochastic Convex Bandits.",
                    "Mirror Descent and the Information Ratio.",
                    "Structured Logconcave Sampling with a Restricted Gaussian Oracle.",
                    "Stochastic Approximation for Online Tensorial Independent Component Analysis.",
                    "Softmax Policy Gradient Methods Can Take Exponential Time to Converge.",
                    "Exponentially Improved Dimensionality Reduction for l1: Subspace Embeddings and Independence Testing.",
                    "A Priori Generalization Analysis of the Deep Ritz Method for Solving High Dimensional Elliptic Partial Differential Equations.",
                    "Corruption-robust exploration in episodic reinforcement learning.",
                    "Approximation Algorithms for Socially Fair Clustering.",
                    "The Connection Between Approximation, Depth Separation and Learnability in Neural Networks.",
                    "Random Graph Matching with Improved Noise Robustness.",
                    "Improved Analysis of the Tsallis-INF Algorithm in Stochastically Constrained Adversarial Bandits and Stochastic Bandits with Adversarial Corruptions.",
                    "Learning with invariances in random features and kernel models.",
                    "Learning to Sample from Censored Markov Random Fields.",
                    "Adversarially Robust Learning with Unknown Perturbation Sets.",
                    "A Theory of Heuristic Learnability.",
                    "Information-Theoretic Generalization Bounds for Stochastic Gradient Descent.",
                    "It was \"all\" for \"nothing\": sharp phase transitions for noiseless discrete channels.",
                    "SGD in the Large: Average-case Analysis, Asymptotics, and Stepsize Criticality.",
                    "Provable Memorization via Deep Neural Networks using Sub-linear Parameters.",
                    "Towards a Query-Optimal and Time-Efficient Algorithm for Clustering with a Faulty Oracle.",
                    "Towards a Dimension-Free Understanding of Adaptive Linear Control.",
                    "Learning from Censored and Dependent Data: The case of Linear Dynamics.",
                    "Adaptive Discretization for Adversarial Lipschitz Bandits.",
                    "Exponential savings in agnostic active learning through abstention.",
                    "Exponential Weights Algorithms for Selective Learning.",
                    "Average-Case Communication Complexity of Statistical Problems.",
                    "Learning to Stop with Surprisingly Few Samples.",
                    "The Effects of Mild Over-parameterization on the Optimization Landscape of Shallow ReLU Neural Networks.",
                    "Almost sure convergence rates for Stochastic Gradient Descent and Stochastic Heavy Ball.",
                    "Lazy OCO: Online Convex Optimization on a Switching Budget.",
                    "Johnson-Lindenstrauss Transforms with Best Confidence.",
                    "Efficient Bandit Convex Optimization: Beyond Linear Losses.",
                    "On Empirical Bayes Variational Autoencoder: An Excess Risk Bound.",
                    "Machine Unlearning via Algorithmic Stability.",
                    "A Dimension-free Computational Upper-bound for Smooth Optimal Transport Estimation.",
                    "Robust Online Convex Optimization in the Presence of Outliers.",
                    "Size and Depth Separation in Approximating Benign Functions with Neural Networks.",
                    "Implicit Regularization in ReLU Networks with the Square Loss.",
                    "Last-iterate Convergence of Decentralized Optimistic Gradient Descent/Ascent in Infinite-horizon Competitive Markov Games.",
                    "Non-stationary Reinforcement Learning without Prior Knowledge: an Optimal Black-box Approach.",
                    "On Query-efficient Planning in MDPs under Linear Realizability of the Optimal State-value Function.",
                    "The Min-Max Complexity of Distributed Stochastic Convex Optimization with Intermittent Communication.",
                    "Fine-Grained Gap-Dependent Bounds for Tabular MDPs via Adaptive Multi-Step Bootstrap.",
                    "Cautiously Optimistic Policy Optimization and Exploration with Linear Function Approximation.",
                    "Improved Algorithms for Efficient Active Learning Halfspaces with Massart and Tsybakov Noise.",
                    "Is Reinforcement Learning More Difficult Than Bandits? A Near-optimal Algorithm Escaping the Curse of Horizon.",
                    "Nearly Minimax Optimal Reinforcement Learning for Linear Mixture Markov Decision Processes.",
                    "A Local Convergence Theory for Mildly Over-Parameterized Two-Layer Neural Network.",
                    "Benign Overfitting of Constant-Stepsize SGD for Linear Regression.",
                    "Open Problem: Are all VC-classes CPAC learnable?",
                    "Open Problem: Is There an Online Learning Algorithm That Learns Whenever Online Learning Is Possible?",
                    "Open Problem: Tight Online Confidence Intervals for RKHS Elements.",
                    "Open Problem: Can Single-Shuffle SGD be Better than Reshuffling SGD and GD?"
                ]
            }
        ]
    },
    {
        "year": "2020",
        "name": "33rd COLT 2020",
        "info": "Virtual Event [Graz, Austria]",
        "venues": [
            {
                "sub_name_abbr": "conf/colt/2020",
                "sub_name": "Conference on Learning Theory, COLT 2020, 9-12 July 2020, Virtual Event [Graz, Austria].",
                "count": 126,
                "papers": [
                    "Conference on Learning Theory 2020: Preface.",
                    "Domain Compression and its Application to Randomness-Optimal Distributed Goodness-of-Fit.",
                    "Distributed Signal Detection under Communication Constraints.",
                    "Optimality and Approximation with Policy Gradient Methods in Markov Decision Processes.",
                    "Model-Based Reinforcement Learning with a Generative Model is Minimax Optimal.",
                    "From Nesterov's Estimate Sequence to Riemannian Acceleration.",
                    "Closure Properties for Private Classification and Online Prediction.",
                    "Hierarchical Clustering: A 0.585 Revenue Approximation.",
                    "Winnowing with Gradient Descent.",
                    "Pan-Private Uniformity Testing.",
                    "Dimension-Free Bounds for Chasing Convex Functions.",
                    "Second-Order Information in Non-Convex Stochastic Optimization: Power and Limitations.",
                    "Data-driven confidence bands for distributed nonparametric regression.",
                    "Estimating Principal Components under Adversarial Perturbations.",
                    "Active Local Learning.",
                    "Finite Regret and Cycles with Fixed Step-Size via Alternating Gradient Descent-Ascent.",
                    "Calibrated Surrogate Losses for Adversarially Robust Classification.",
                    "Complexity Guarantees for Polyak Steps with Momentum.",
                    "Free Energy Wells and Overlap Gap Property in Sparse PCA.",
                    "Implicit regularization for deep neural networks driven by an Ornstein-Uhlenbeck like process.",
                    "Hardness of Identity Testing for Restricted Boltzmann Machines and Potts models.",
                    "Selfish Robustness and Equilibria in Multi-Player Bandits.",
                    "Proper Learning, Helly Number, and an Optimal SVM Bound.",
                    "Sharper Bounds for Uniformly Stable Algorithms.",
                    "The Gradient Complexity of Linear Regression.",
                    "Reducibility and Statistical-Computational Gaps from Secret Leakage.",
                    "A Corrective View of Neural Networks: Representation, Memorization and Learning.",
                    "ID3 Learns Juntas for Smoothed Product Distributions.",
                    "Coordination without communication: optimal regret in two players multi-armed bandits.",
                    "How to Trap a Gradient Flow.",
                    "Non-Stochastic Multi-Player Multi-Armed Bandits: Optimal Rate With Collision Information, Sublinear Without.",
                    "Highly smooth minimization of non-smooth problems.",
                    "Efficient, Noise-Tolerant, and Private Learning via Boosting.",
                    "The estimation error of general first order methods.",
                    "Bounds in query learning.",
                    "Learning Polynomials in Few Relevant Dimensions.",
                    "The Influence of Shape Constraints on the Thresholding Bandit Problem.",
                    "Gradient descent algorithms for Bures-Wasserstein barycenters.",
                    "Implicit Bias of Gradient Descent for Wide Two-layer Neural Networks Trained with the Logistic Loss.",
                    "ODE-Inspired Analysis for the Biological Version of Oja's Rule in Solving Streaming PCA.",
                    "Pessimism About Unknown Unknowns Inspires Conservatism.",
                    "Optimal Group Testing.",
                    "PAC learning with stable and private predictions.",
                    "High probability guarantees for stochastic convex optimization.",
                    "Halpern Iteration for Near-Optimal and Parameter-Free Monotone Inclusion and Strong Solutions to Variational Inequalities.",
                    "Approximation Schemes for ReLU Regression.",
                    "Learning Halfspaces with Massart Noise Under Structured Distributions.",
                    "Algorithms and SQ Lower Bounds for PAC Learning One-Hidden-Layer ReLU Networks.",
                    "Consistent recovery threshold of hidden nearest neighbor graphs.",
                    "Root-n-Regret for Learning in Markov Decision Processes with Function Approximation and Low Bellman Rank.",
                    "Embedding Dimension of Polyhedral Losses.",
                    "Efficient Parameter Estimation of Truncated Boolean Product Distributions.",
                    "Rigorous Guarantees for Tyler's M-Estimator via Quantum Expansion.",
                    "From tree matching to sparse graph alignment.",
                    "On the Convergence of Stochastic Gradient Descent with Low-Rank Projections for Convex Low-Rank Matrix Problems.",
                    "Asymptotic Errors for High-Dimensional Convex Penalized Linear Regression beyond Gaussian Matrices.",
                    "No-Regret Prediction in Marginally Stable Systems.",
                    "Last Iterate is Slower than Averaged Iterate in Smooth Convex-Concave Saddle Point Problems.",
                    "Locally Private Hypothesis Selection.",
                    "Bessel Smoothing and Multi-Distribution Property Estimation.",
                    "Faster Projection-free Online Learning.",
                    "Near-Optimal Methods for Minimizing Star-Convex Functions and Beyond.",
                    "A Greedy Anytime Algorithm for Sparse PCA.",
                    "Noise-tolerant, Reliable Active Classification with Comparison Queries.",
                    "Smooth Contextual Bandits: Bridging the Parametric and Non-differentiable Regret Regimes.",
                    "Extrapolating the profile of a finite population.",
                    "Precise Tradeoffs in Adversarial Training for Linear Regression.",
                    "Robust causal inference under covariate shift via worst-case subpopulation treatment effects.",
                    "Efficient improper learning for online logistic regression.",
                    "Gradient descent follows the regularization path for general losses.",
                    "Provably efficient reinforcement learning with linear function approximation.",
                    "Finite Time Analysis of Linear Two-timescale Stochastic Approximation with Markovian Noise.",
                    "Private Mean Estimation of Heavy-Tailed Distributions.",
                    "Approximate is Good Enough: Probabilistic Variants of Dimensional and Margin Complexity.",
                    "Privately Learning Thresholds: Closing the Exponential Gap.",
                    "Online Learning with Vector Costs and Bandits with Knapsacks.",
                    "Universal Approximation with Deep Narrow Networks.",
                    "Information Directed Sampling for Linear Partial Monitoring.",
                    "New Potential-Based Bounds for Prediction with Expert Advice.",
                    "On Suboptimality of Least Squares with Application to Estimation of Convex Bodies.",
                    "The EM Algorithm gives Sample-Optimality for Learning Mixtures of Well-Separated Gaussians.",
                    "Exploration by Optimisation in Partial Monitoring.",
                    "A Closer Look at Small-loss Bounds for Bandits with Graph Feedback.",
                    "Logsmooth Gradient Concentration and Tighter Runtimes for Metropolized Hamiltonian Monte Carlo.",
                    "A Fast Spectral Algorithm for Mean Estimation with Sub-Gaussian Rates.",
                    "Learning Over-Parametrized Two-Layer Neural Networks beyond NTK.",
                    "On the Multiple Descent of Minimum-Norm Interpolants and Restricted Lower Isometry of Kernels.",
                    "Learning Entangled Single-Sample Gaussians in the Subset-of-Signals Model.",
                    "Near-Optimal Algorithms for Minimax Optimization.",
                    "Better Algorithms for Estimating Non-Parametric Models in Crowd-Sourcing and Rank Aggregation.",
                    "Tight Lower Bounds for Combinatorial Multi-Armed Bandits.",
                    "Lipschitz and Comparator-Norm Adaptivity in Online Learning.",
                    "Information Theoretic Optimal Learning of Gaussian Graphical Models.",
                    "Parallels Between Phase Transitions and Circuit Complexity?",
                    "On Linear Stochastic Approximation: Fine-grained Polyak-Ruppert and Non-Asymptotic Concentration.",
                    "Extending Learnability to Auxiliary-Input Cryptographic Primitives and Meta-PAC Learning.",
                    "Fast Rates for Online Prediction with Abstention.",
                    "Efficient and robust algorithms for adversarial linear contextual bandits.",
                    "An $\\widetilde\\mathcalO(m/\\varepsilon^3.5)$-Cost Algorithm for Semidefinite Programs with Diagonal Constraints.",
                    "Costly Zero Order Oracles.",
                    "Adaptive Submodular Maximization under Stochastic Item Costs.",
                    "Covariance-adapting algorithm for semi-bandits with application to sparse outcomes.",
                    "Finite-Time Analysis of Asynchronous Stochastic Approximation and $Q$-Learning.",
                    "List Decodable Subspace Recovery.",
                    "Tsallis-INF for Decoupled Exploration and Exploitation in Multi-armed Bandits.",
                    "How Good is SGD with Random Shuffling?",
                    "A Nearly Optimal Variant of the Perceptron Algorithm for the Uniform Distribution on the Unit Sphere.",
                    "Logistic Regression Regret: What's the Catch?",
                    "Improper Learning for Non-Stochastic Control.",
                    "Reasoning About Generalization via Conditional Mutual Information.",
                    "Estimation and Inference with Trees and Forests in High Dimensions.",
                    "Balancing Gaussian vectors in high dimension.",
                    "Active Learning for Identification of Linear Dynamical Systems.",
                    "Taking a hint: How to leverage loss predictors in contextual bandits?",
                    "Kernel and Rich Regimes in Overparametrized Models.",
                    "Learning Zero-Sum Simultaneous-Move Markov Games Using Function Approximation and Correlated Equilibrium.",
                    "Tree-projected gradient descent for estimating gradient-sparse parameters on graphs.",
                    "Non-asymptotic Analysis for Nonparametric Testing.",
                    "Learning a Single Neuron with Gradient Methods.",
                    "Nearly Non-Expansive Bounds for Mahalanobis Hard Thresholding.",
                    "Wasserstein Control of Mirror Langevin Monte Carlo.",
                    "Open Problem: Model Selection for Contextual Bandits.",
                    "Open Problem: Tight Convergence of SGD in Constant Dimension.",
                    "Open Problem: Average-Case Hardness of Hypergraphic Planted Clique Detection.",
                    "Open Problem: Information Complexity of VC Learning.",
                    "Open Problem: Fast and Optimal Online Portfolio Selection."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "32nd COLT 2019",
        "info": "Phoenix, AZ, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/colt/2019",
                "sub_name": "Conference on Learning Theory, COLT 2019, 25-28 June 2019, Phoenix, AZ, USA.",
                "count": 127,
                "papers": [
                    "Preface.",
                    "Inference under Information Constraints: Lower Bounds from Chi-Square Contraction.",
                    "Learning in Non-convex Games with an Optimization Oracle.",
                    "Learning to Prune: Speeding up Repeated Computations.",
                    "Towards Testing Monotonicity of Distributions Over General Posets.",
                    "Testing Mixtures of Discrete Distributions.",
                    "Normal Approximation for Stochastic Gradient Descent via Non-Asymptotic Rates of Martingale CLT.",
                    "Adaptively Tracking the Best Bandit Arm with an Unknown Number of Distribution Changes.",
                    "Achieving Optimal Dynamic Regret for Non-stationary Bandits without Prior Information.",
                    "A Universal Algorithm for Variational Inequalities Adaptive to Smoothness and Noise.",
                    "Learning Two Layer Rectified Neural Networks in Polynomial Time.",
                    "Private Center Points and Learning of Halfspaces.",
                    "Lower bounds for testing graphical models: colorings and antiferromagnetic Ising models.",
                    "Approximate Guarantees for Dictionary Learning.",
                    "The Optimal Approximation Factor in Density Estimation.",
                    "Sorted Top-k in Rounds.",
                    "Multi-armed Bandit Problems with Strategic Arms.",
                    "Universality of Computational Lower Bounds for Submatrix Detection.",
                    "Optimal Average-Case Reductions to Sparse PCA: From Weak Assumptions to Strong Hardness.",
                    "Learning rates for Gaussian mixtures under group action.",
                    "Near-optimal method for highly smooth convex optimization.",
                    "Improved Path-length Regret Bounds for Bandits.",
                    "Optimal Learning of Mallows Block Model.",
                    "Gaussian Process Optimization with Adaptive Sketching: Scalable and No Regret.",
                    "Disagreement-Based Combinatorial Pure Exploration: Sample Complexity Bounds and an Efficient Algorithm.",
                    "A Rank-1 Sketch for Matrix Multiplicative Weights.",
                    "On the Computational Power of Online Gradient Descent.",
                    "Active Regression via Linear-Sample Sparsification.",
                    "A New Algorithm for Non-stationary Contextual Bandits: Efficient, Optimal and Parameter-free.",
                    "Faster Algorithms for High-Dimensional Robust Covariance Estimation.",
                    "Testing Symmetric Markov Chains Without Hitting.",
                    "Fast Mean Estimation with Sub-Gaussian Rates.",
                    "Vortices Instead of Equilibria in MinMax Optimization: Chaos and Butterfly Effects of Online Learning in Zero-Sum Games.",
                    "Pure entropic regularization for metrical task systems.",
                    "A near-optimal algorithm for approximating the John Ellipsoid.",
                    "Artificial Constraints and Hints for Unbounded Online Learning.",
                    "Combining Online Learning Guarantees.",
                    "Learning from Weakly Dependent Data under Dobrushin's Condition.",
                    "Space lower bounds for linear prediction in the streaming model.",
                    "Computationally and Statistically Efficient Truncated Regression.",
                    "Reconstructing Trees from Traces.",
                    "Is your function low dimensional?",
                    "Computational Limitations in Robust Classification and Win-Win Results.",
                    "Fast determinantal point processes via distortion-free intermediate sampling.",
                    "Minimax experimental design: Bridging the gap between statistical and worst-case approaches to least squares regression.",
                    "Communication and Memory Efficient Testing of Discrete Distributions.",
                    "Testing Identity of Multidimensional Histograms.",
                    "Lower Bounds for Parallel and Randomized Convex Optimization.",
                    "On the Performance of Thompson Sampling on Logistic Bandits.",
                    "Lower Bounds for Locally Private Estimation via Communication Complexity.",
                    "Sharp Analysis for Nonconvex SGD Escaping from Saddle Points.",
                    "Achieving the Bayes Error Rate in Stochastic Block Model by SDP, Robustly.",
                    "High probability generalization bounds for uniformly stable algorithms with nearly optimal rate.",
                    "Sum-of-squares meets square loss: Fast rates for agnostic tensor completion.",
                    "The Complexity of Making the Gradient Small in Stochastic Convex Optimization.",
                    "Statistical Learning with a Nuisance Component.",
                    "On the Regret Minimization of Nonconvex Online Gradient Ascent for Online PCA.",
                    "Optimal Tensor Methods in Smooth Convex and Uniformly ConvexOptimization.",
                    "Near Optimal Methods for Minimizing Convex Functions with Lipschitz $p$-th Derivatives.",
                    "Stabilized SVRG: Simple Variance Reduction for Nonconvex Optimization.",
                    "Learning Ising Models with Independent Failures.",
                    "Learning Neural Networks with Two Nonlinear Layers in Polynomial Time.",
                    "When can unlabeled data improve the learning rate?",
                    "Sampling and Optimization on Convex Sets in Riemannian Manifolds of Non-Negative Curvature.",
                    "Better Algorithms for Stochastic Bandits with Adversarial Corruptions.",
                    "Tight analyses for non-smooth stochastic gradient descent.",
                    "Reasoning in Bayesian Opinion Exchange Networks Is PSPACE-Hard.",
                    "How Hard is Robust Mean Estimation?",
                    "A Robust Spectral Algorithm for Overcomplete Tensor Decomposition.",
                    "Sample-Optimal Low-Rank Approximation of Distance Matrices.",
                    "Making the Last Iterate of SGD Information Theoretically Optimal.",
                    "Accuracy-Memory Tradeoffs and Phase Transitions in Belief Propagation.",
                    "The implicit bias of gradient descent on nonseparable data.",
                    "An Optimal High-Order Tensor Method for Convex Optimization.",
                    "Parameter-Free Online Convex Optimization with Sub-Exponential Noise.",
                    "Sample complexity of partition identification using multi-armed bandits.",
                    "Privately Learning High-Dimensional Distributions.",
                    "On Communication Complexity of Classification Problems.",
                    "Non-asymptotic Analysis of Biased Stochastic Approximation Scheme.",
                    "Discrepancy, Coresets, and Sketches in Machine Learning.",
                    "Bandit Principal Component Analysis.",
                    "Contextual bandits with continuous actions: Smoothing, zooming, and adapting.",
                    "Distribution-Dependent Analysis of Gibbs-ERM Principle.",
                    "Global Convergence of the EM Algorithm for Mixtures of Two Component Linear Regression.",
                    "An Information-Theoretic Approach to Minimax Regret in Partial Monitoring.",
                    "Solving Empirical Risk Minimization in the Current Matrix Multiplication Time.",
                    "On Mean Estimation for General Norms with Statistical Queries.",
                    "Nearly Minimax-Optimal Regret for Linearly Parameterized Bandits.",
                    "Sharp Theoretical Analysis for Nonparametric Testing under Random Projection.",
                    "Combinatorial Algorithms for Optimal Design.",
                    "Nonconvex sampling with the Metropolis-adjusted Langevin algorithm.",
                    "Beyond Least-Squares: Fast Rates for Regularized Empirical Risk Minimization through Self-Concordance.",
                    "Planting trees in graphs, and finding them back.",
                    "Uniform concentration and symmetrization for weak interactions.",
                    "Mean-field theory of two-layers neural networks: dimension-free bounds and kernel limit.",
                    "Batch-Size Independent Regret Bounds for the Combinatorial Multi-Armed Bandit Problem.",
                    "Lipschitz Adaptivity with Multiple Learning Rates in Online Learning.",
                    "VC Classes are Adversarially Robustly Learnable, but Only Improperly.",
                    "Affine Invariant Covariance Estimation for Heavy-Tailed Distributions.",
                    "Stochastic Gradient Descent Learns State Equations with Nonlinear Activations.",
                    "A Theory of Selective Prediction.",
                    "Consistency of Interpolation with Laplace Kernels is a High-Dimensional Phenomenon.",
                    "Classification with unknown class-conditional label noise on non-compact feature spaces.",
                    "The All-or-Nothing Phenomenon in Sparse Linear Regression.",
                    "Depth Separations in Neural Networks: What is Actually Being Separated?",
                    "How do infinite width bounded norm networks look in function space?",
                    "Exponential Convergence Time of Gradient Descent for One-Dimensional Deep Linear Neural Networks.",
                    "Learning Linear Dynamical Systems with Semi-Parametric Least Squares.",
                    "Finite-Time Error Bounds For Linear Stochastic Approximation andTD Learning.",
                    "Robustness of Spectral Methods for Community Detection.",
                    "Maximum Entropy Distributions: Bit Complexity and Stability.",
                    "Adaptive Hard Thresholding for Near-optimal Consistent Robust Regression.",
                    "Model-based RL in Contextual Decision Processes: PAC bounds and Exponential Improvements over Model-free Approaches.",
                    "Stochastic first-order methods: non-asymptotic and computer-aided analyses via potential functions.",
                    "The Relative Complexity of Maximum Likelihood Estimation, MAP Estimation, and Sampling.",
                    "The Gap Between Model-Based and Model-Free Methods on the Linear Quadratic Regulator: An Asymptotic Viewpoint.",
                    "Theoretical guarantees for sampling and inference in generative models with latent diffusions.",
                    "Gradient Descent for One-Hidden-Layer Neural Networks: Polynomial Convergence and SQ Lower Bounds.",
                    "Estimation of smooth densities in Wasserstein distance.",
                    "Estimating the Mixing Time of Ergodic Markov Chains.",
                    "Stochastic Approximation of Smooth and Strongly Convex Functions: Beyond the $O(1/T)$ Convergence Rate.",
                    "Open Problem: Is Margin Sufficient for Non-Interactive Private Distributed Learning?",
                    "Open Problem: How fast can a multiclass test set be overfit?",
                    "Open Problem: Do Good Algorithms Necessarily Query Bad Points?",
                    "Open Problem: Risk of Ruin in Multiarmed Bandits.",
                    "Open Problem: Monotonicity of Learning.",
                    "Open Problem: The Oracle Complexity of Convex Optimization with Limited Memory."
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "31st COLT 2018",
        "info": "Stockholm, Sweden",
        "venues": [
            {
                "sub_name_abbr": "conf/colt/2018",
                "sub_name": "Conference On Learning Theory, COLT 2018, Stockholm, Sweden, 6-9 July 2018.",
                "count": 94,
                "papers": [
                    "Conference on Learning Theory 2018: Preface.",
                    "Algorithmic Regularization in Over-parameterized Matrix Sensing and Neural Networks with Quadratic Activations.",
                    "Reducibility and Computational Lower Bounds for Problems with Planted Sparse Structure.",
                    "Logistic Regression: The Importance of Being Improper.",
                    "Actively Avoiding Nonsense in Generative Models.",
                    "A Faster Approximation Algorithm for the Gibbs Partition Function.",
                    "Exponential Convergence of Testing Error for Stochastic Gradient Methods.",
                    "Size-Independent Sample Complexity of Neural Networks.",
                    "Underdamped Langevin MCMC: A non-asymptotic analysis.",
                    "Online Variance Reduction for Stochastic Optimization.",
                    "Information Directed Sampling and Bandits with Heteroscedastic Noise.",
                    "Testing Symmetric Markov Chains From a Single Trajectory.",
                    "Detection limits in the high-dimensional spiked rectangular model.",
                    "Learning Without Mixing: Towards A Sharp Analysis of Linear System Identification.",
                    "Active Tolerant Testing.",
                    "Polynomial Time and Sample Complexity for Non-Gaussian Component Analysis: Spectral Methods.",
                    "Calibrating Noise to Variance in Adaptive Data Analysis.",
                    "Accelerating Stochastic Gradient Descent for Least Squares Regression.",
                    "Generalization Bounds of SGLD for Non-convex Learning: Two Theoretical Viewpoints.",
                    "Optimal approximation of continuous functions by very deep ReLU networks.",
                    "Averaging Stochastic Gradient Descent on Riemannian Manifolds.",
                    "Fitting a Putative Manifold to Noisy Data.",
                    "Private Sequential Learning.",
                    "Optimal Errors and Phase Transitions in High-Dimensional Generalized Linear Models.",
                    "Exact and Robust Conformal Inference Methods for Predictive Machine Learning with Dependent Data.",
                    "Nonstochastic Bandits with Composite Anonymous Feedback.",
                    "Lower Bounds for Higher-Order Convex Optimization.",
                    "Log-concave sampling: Metropolis-Hastings algorithms are fast!",
                    "Incentivizing Exploration by Heterogeneous Users.",
                    "Fast and Sample Near-Optimal Algorithms for Learning Multidimensional Histograms.",
                    "Time-Space Tradeoffs for Learning Finite Functions from Random Evaluations, with Applications to Polynomials.",
                    "Local Optimality and Generalization Guarantees for the Langevin Algorithm via Empirical Metastability.",
                    "Hardness of Learning Noisy Halfspaces using Polynomial Thresholds.",
                    "Best of both worlds: Stochastic & adversarial best-arm identification.",
                    "Learning Patterns for Detection with Multiscale Scan Statistics.",
                    "Global Guarantees for Enforcing Deep Generative Priors by Empirical Risk.",
                    "Small-loss bounds for online learning with partial information.",
                    "Empirical bounds for functions with weak interactions.",
                    "Restricted Eigenvalue from Stable Rank with Applications to Sparse Linear Regression.",
                    "Accelerated Gradient Descent Escapes Saddle Points Faster than Gradient Descent.",
                    "Convex Optimization with Unbounded Nonconvex Oracles using Simulated Annealing.",
                    "Learning Mixtures of Linear Regressions with Nearly Optimal Complexity.",
                    "Detecting Correlations with Little Memory and Communication.",
                    "Finite Sample Analysis of Two-Timescale Stochastic Approximation with Applications to Reinforcement Learning.",
                    "Near-Optimal Sample Complexity Bounds for Maximum Likelihood Estimation of Multivariate Log-concave Densities.",
                    "More Adaptive Algorithms for Adversarial Bandits.",
                    "Efficient Convex Optimization with Membership Oracles.",
                    "A General Approach to Multi-Armed Bandits Under Risk Criteria.",
                    "An Optimal Learning Algorithm for Online Unconstrained Submodular Maximization.",
                    "The Mean-Field Approximation: Information Inequalities, Algorithms, and Complexity.",
                    "Approximation beats concentration? An approximation view on inference with smooth radial kernels.",
                    "Non-Convex Matrix Completion Against a Semi-Random Adversary.",
                    "The Vertex Sample Complexity of Free Energy is Polynomial.",
                    "Efficient Algorithms for Outlier-Robust Regression.",
                    "Action-Constrained Markov Decision Processes With Kullback-Leibler Cost.",
                    "Fundamental Limits of Weak Recovery with Applications to Phase Retrieval.",
                    "Cutting plane methods can be extended into nonconvex optimization.",
                    "An Analysis of the t-SNE Algorithm for Data Visualization.",
                    "Adaptivity to Smoothness in X-armed bandits.",
                    "Black-Box Reductions for Parameter-free Online Learning in Banach Spaces.",
                    "A Data Prism: Semi-verified learning in the small-alpha regime.",
                    "A Direct Sum Result for the Information Complexity of Learning.",
                    "Online learning over a finite action set with limited switching.",
                    "Smoothed Online Convex Optimization in High Dimensions via Online Balanced Descent.",
                    "Faster Rates for Convex-Concave Games.",
                    "$\\ell_1$ Regression using Lewis Weights Preconditioning and Stochastic Gradient Descent.",
                    "Optimal Single Sample Tests for Structured versus Unstructured Network Data.",
                    "A Finite Time Analysis of Temporal Difference Learning With Linear Function Approximation.",
                    "Privacy-preserving Prediction.",
                    "An Estimate Sequence for Geodesically Convex Optimization.",
                    "The Externalities of Exploration and How Data Diversity Helps Exploitation.",
                    "Efficient Contextual Bandits in Non-stationary Worlds.",
                    "Langevin Monte Carlo and JKO splitting.",
                    "Subpolynomial trace reconstruction for random strings \\{and arbitrary deletion probability.",
                    "An explicit analysis of the entropic penalty in linear programming.",
                    "Efficient active learning of sparse halfspaces.",
                    "Marginal Singularity, and the Benefits of Labels in Covariate-Shift.",
                    "Learning Single-Index Models in Gaussian Space.",
                    "Hidden Integrality of SDP Relaxations for Sub-Gaussian Mixture Models.",
                    "Counting Motifs with Graph Sampling.",
                    "Approximate Nearest Neighbors in Limited Space.",
                    "Breaking the $1/\\sqrtn$ Barrier: Faster Rates for Permutation-based Models in Polynomial Time.",
                    "Unleashing Linear Optimizers for Group-Fair Learning and Optimization.",
                    "The Many Faces of Exponential Weights in Online Learning.",
                    "Sampling as optimization in the space of measures: The Langevin dynamics as a composite optimization problem.",
                    "Online Learning: Sufficient Statistics and the Burkholder Method.",
                    "Minimax Bounds on Stochastic Batched Convex Optimization.",
                    "Geometric Lower Bounds for Distributed Parameter Estimation under Communication Constraints.",
                    "Local moment matching: A unified methodology for symmetric functional estimation and distribution estimation under Wasserstein distance.",
                    "Iterate Averaging as Regularization for Stochastic Gradient Descent.",
                    "Smoothed analysis for low-rank solutions to semidefinite programs in quadratic penalty form.",
                    "Certified Computation from Unreliable Datasets.",
                    "Open Problem: The Dependence of Sample Complexity Lower Bounds on Planning Horizon.",
                    "Open problem: Improper learning of mixtures of Gaussians."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "30th COLT 2017",
        "info": "Amsterdam, The Netherlands",
        "venues": [
            {
                "sub_name_abbr": "conf/colt/2017",
                "sub_name": "Proceedings of the 30th Conference on Learning Theory, COLT 2017, Amsterdam, The Netherlands, 7-10 July 2017.",
                "count": 76,
                "papers": [
                    "Preface: Conference on Learning Theory (COLT), 2017.",
                    "Open Problem: First-Order Regret Bounds for Contextual Bandits.",
                    "Open Problem: Meeting Times for Learning Random Automata.",
                    "Corralling a Band of Bandit Algorithms.",
                    "Learning with Limited Rounds of Adaptivity: Coin Tossing, Multi-Armed Bandits, and Ranking from Pairwise Comparisons.",
                    "Thompson Sampling for the MNL-Bandit.",
                    "Homotopy Analysis for Tensor PCA.",
                    "Correspondence retrieval.",
                    "Efficient PAC Learning from the Crowd.",
                    "The Price of Selection in Differential Privacy.",
                    "Computationally Efficient Robust Sparse Estimation in High Dimensions.",
                    "Learning-Theoretic Foundations of Algorithm Configuration for Combinatorial Partitioning Problems.",
                    "The Sample Complexity of Optimizing a Convex Function.",
                    "Efficient Co-Training of Linear Separators under Weak Dependence.",
                    "Sampling from a log-concave distribution with compact support with proximal Langevin Monte Carlo.",
                    "Rates of estimation for determinantal point processes.",
                    "Learning Disjunctions of Predicates.",
                    "Testing Bayesian Networks.",
                    "Multi-Observation Elicitation.",
                    "Algorithmic Chaining and the Role of Partial Feedback in Online Nonparametric Learning.",
                    "Nearly Optimal Sampling Algorithms for Combinatorial Pure Exploration.",
                    "Towards Instance Optimal Bounds for Best Arm Identification.",
                    "Thresholding Based Outlier Robust PCA.",
                    "Tight Bounds for Bandit Combinatorial Optimization.",
                    "Online Learning Without Prior Information.",
                    "Further and stronger analogy between sampling and optimization: Langevin Monte Carlo and gradient descent.",
                    "Depth Separation for Neural Networks.",
                    "Square Hellinger Subadditivity for Bayesian Networks and its Applications to Identity Testing.",
                    "Ten Steps of EM Suffice for Mixtures of Two Gaussians.",
                    "Learning Multivariate Log-concave Distributions.",
                    "Generalization for Adaptively-chosen Estimators via Stable Median.",
                    "Greed Is Good: Near-Optimal Submodular Maximization via Greedy Optimization.",
                    "A General Characterization of the Statistical Query Complexity.",
                    "Stochastic Composite Least-Squares Regression with Convergence Rate $O(1/n)$.",
                    "ZigZag: A New Approach to Adaptive Online Learning.",
                    "Memoryless Sequences for Differentiable Losses.",
                    "Matrix Completion from $O(n)$ Samples in Linear Time.",
                    "High Dimensional Regression with Binary Coefficients. Estimating Squared Error and a Phase Transtition.",
                    "Two-Sample Tests for Large Random Graphs Using Network Statistics.",
                    "Effective Semisupervised Learning on Manifolds.",
                    "Reliably Learning the ReLU in Polynomial Time.",
                    "Fast Rates for Empirical Risk Minimization of Strict Saddle Problems.",
                    "Nearly-tight VC-dimension bounds for piecewise linear neural networks.",
                    "Submodular Optimization under Noise.",
                    "Surprising properties of dropout in deep networks.",
                    "Quadratic Upper Bound for Recursive Teaching Dimension of Finite VC Classes.",
                    "A Unified Analysis of Stochastic Optimization Methods Using Jump System Theory and Quadratic Constraints.",
                    "The Hidden Hubs Problem.",
                    "Predicting with Distributions.",
                    "Bandits with Movement Costs and Adaptive Pricing.",
                    "Sparse Stochastic Bandits.",
                    "On the Ability of Neural Nets to Express Distributions.",
                    "Fundamental limits of symmetric low-rank matrix estimation.",
                    "Robust and Proper Learning for Mixtures of Gaussians via Systems of Polynomial Inequalities.",
                    "Adaptivity to Noise Parameters in Nonparametric Active Learning.",
                    "Noisy Population Recovery from Unknown Noise.",
                    "Inapproximability of VC Dimension and Littlestone's Dimension.",
                    "A Second-order Look at Stability and Generalization.",
                    "Solving SDPs for synchronization and MaxCut problems via the Grothendieck inequality.",
                    "Mixing Implies Lower Bounds for Space Bounded Learning.",
                    "Fast rates for online learning in Linearly Solvable Markov Decision Processes.",
                    "Sample complexity of population recovery.",
                    "Exact tensor completion with sum-of-squares.",
                    "Non-convex learning via Stochastic Gradient Langevin Dynamics: a nonasymptotic analysis.",
                    "On Equivalence of Martingale Tail Bounds and Deterministic Regret Inequalities.",
                    "Lower Bounds on Regret for Noisy Gaussian Process Bandit Optimization.",
                    "An Improved Parametrization and Analysis of the EXP3++ Algorithm for Stochastic and Adversarial Bandits.",
                    "Fast and robust tensor decomposition with applications to dictionary learning.",
                    "The Simulator: Understanding Adaptive Sampling in the Moderate-Confidence Regime.",
                    "On Learning vs. Refutation.",
                    "Ignoring Is a Bliss: Learning with Large Noise Through Reweighting-Minimization.",
                    "Memory and Communication Efficient Distributed Stochastic Optimization with Minibatch Prox.",
                    "Learning Non-Discriminatory Predictors.",
                    "Empirical Risk Minimization for Stochastic Convex Optimization: $O(1/n)$- and $O(1/n^2)$-type of Risk Bounds.",
                    "A Hitting Time Analysis of Stochastic Gradient Langevin Dynamics.",
                    "Optimal learning via local entropies and sample compression."
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "29th COLT 2016",
        "info": "New York, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/colt/2016",
                "sub_name": "Proceedings of the 29th Conference on Learning Theory, COLT 2016, New York, USA, June 23-26, 2016.",
                "count": 70,
                "papers": [
                    "Conference on Learning Theory 2016: Preface.",
                    "An efficient algorithm for contextual bandits with knapsacks, and an extension to concave objectives.",
                    "Learning and Testing Junta Distributions.",
                    "Sign rank versus VC dimension.",
                    "Efficient approaches for escaping higher order saddle points in non-convex optimization.",
                    "Monte Carlo Markov Chain Algorithms for Sampling Strongly Rayleigh Distributions and Determinantal Point Processes.",
                    "An algorithm with nearly optimal pseudo-regret for both stochastic and adversarial bandits.",
                    "Policy Error Bounds for Model-Based Reinforcement Learning with Factored Linear Models.",
                    "Learning and 1-bit Compressed Sensing under Asymmetric Noise.",
                    "Reinforcement Learning of POMDPs using Spectral Methods.",
                    "Highly-Smooth Zero-th Order Online Optimization.",
                    "An Improved Gap-Dependency Analysis of the Noisy Power Method.",
                    "Learning Combinatorial Functions from Pairwise Comparisons.",
                    "Instance-dependent Regret Bounds for Dueling Bandits.",
                    "On the low-rank approach for semidefinite programs arising in synchronization and community detection.",
                    "Information-theoretic thresholds for community detection in sparse networks.",
                    "Noisy Tensor Completion via the Sum-of-Squares Hierarchy.",
                    "Basis Learning as an Algorithmic Primitive.",
                    "Aggregation of supports along the Lasso path.",
                    "Dropping Convexity for Faster Semi-definite Optimization.",
                    "Multi-scale exploration of convex functions and bandit convex optimization.",
                    "Tight (Lower) Bounds for the Fixed Budget Best Arm Identification Bandit Problem.",
                    "Delay and Cooperation in Nonstochastic Bandits.",
                    "On the Approximability of Sparse PCA.",
                    "Pure Exploration of Multi-armed Bandit Under Matroid Constraints.",
                    "Provably manipulation-resistant reputation systems.",
                    "On the Expressive Power of Deep Learning: A Tensor Analysis.",
                    "A Light Touch for Heavily Constrained SGD.",
                    "Adaptive Learning with Robust Generalization Guarantees.",
                    "Complexity Theoretic Limitations on Learning DNF's.",
                    "Optimal Learning via the Fourier Transform for Sums of Independent Integer Random Variables.",
                    "Properly Learning Poisson Binomial Distributions in Almost Polynomial Time.",
                    "Asymptotic behavior of \\(\\ell_p\\)-based Laplacian regularization in semi-supervised learning.",
                    "The Power of Depth for Feedforward Neural Networks.",
                    "Online Learning and Blackwell Approachability in Quitting Games.",
                    "Spectral thresholds in the bipartite stochastic block model.",
                    "Online Sparse Linear Regression.",
                    "Preference-based Teaching.",
                    "Optimal Best Arm Identification with Fixed Confidence.",
                    "Maximin Action Identification: A New Bandit Framework for Games.",
                    "Semidefinite Programs for Exact Recovery of a Hidden Community.",
                    "Online Learning with Low Rank Experts.",
                    "Optimal rates for total variation denoising.",
                    "Streaming PCA: Matching Matrix Bernstein and Near-Optimal Finite Sample Guarantees for Oja's Algorithm.",
                    "Online Isotonic Regression.",
                    "Time series prediction and online learning.",
                    "Regret Analysis of the Finite-Horizon Gittins Index Strategy for Multi-Armed Bandits.",
                    "Gradient Descent Only Converges to Minimizers.",
                    "Learning Communities in the Presence of Errors.",
                    "On the capacity of information processing systems.",
                    "Learning Simple Auctions.",
                    "Density Evolution in the Degree-correlated Stochastic Block Model.",
                    "Cortical Computation via Iterative Constructions.",
                    "When can we rank well from comparisons of \\(O(n\\log(n))\\) non-actively chosen pairs?",
                    "How to calculate partition functions using convex programming hierarchies: provable bounds for variational methods.",
                    "Simple Bayesian Algorithms for Best Arm Identification.",
                    "Interactive Algorithms: from Pool to Stream.",
                    "Best-of-K-bandits.",
                    "Memory, Communication, and Statistical Queries.",
                    "benefits of depth in neural networks.",
                    "A Guide to Learning Arithmetic Circuits.",
                    "Online learning in repeated auctions.",
                    "The Extended Littlestone's Dimension for Learning with Mistakes and Abstentions.",
                    "First-order Methods for Geodesically Convex Optimization.",
                    "Open Problem: Approximate Planning of POMDPs in the class of Memoryless Policies.",
                    "Open Problem: Best Arm Identification: Almost Instance-Wise Optimality and the Gap Entropy Conjecture.",
                    "Open Problem: Kernel methods on manifolds and metric spaces. What is the probability of a positive definite geodesic exponential kernel?",
                    "Open Problem: Second order regret bounds based on scaling time.",
                    "Open Problem: Property Elicitation and Elicitation Complexity.",
                    "Open Problem: Parameter-Free and Scale-Free Online Algorithms."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "28th COLT 2015",
        "info": "Paris, France",
        "venues": [
            {
                "sub_name_abbr": "conf/colt/2015",
                "sub_name": "Proceedings of The 28th Conference on Learning Theory, COLT 2015, Paris, France, July 3-6, 2015.",
                "count": 77,
                "papers": [
                    "Conference on Learning Theory 2015: Preface.",
                    "On Consistent Surrogate Risk Minimization and Property Elicitation.",
                    "Online Learning with Feedback Graphs: Beyond Bandits.",
                    "Learning Overcomplete Latent Variable Models through Tensor Methods.",
                    "Simple, Efficient, and Neural Algorithms for Sparse Coding.",
                    "Label optimal regret bounds for online local learning.",
                    "Efficient Learning of Linear Separators under Bounded Noise.",
                    "Efficient Representations for Lifelong Learning and Autoencoding.",
                    "Optimally Combining Classifiers Using Unlabeled Data.",
                    "Minimax Fixed-Design Linear Regression.",
                    "Escaping the Local Minima via Simulated Annealing: Optimization of Approximately Convex Functions.",
                    "Bandit Convex Optimization: \\(\\sqrt{T}\\) Regret in One Dimension.",
                    "The entropic barrier: a simple and optimal universal self-concordant barrier.",
                    "Optimum Statistical Estimation with Strategic Data Sources.",
                    "On the Complexity of Learning with Kernels.",
                    "Learnability of Solutions to Conjunctive Queries: The Full Dichotomy.",
                    "Sequential Information Maximization: When is Greedy Near-optimal?",
                    "Efficient Sampling for Gaussian Graphical Models via Spectral Sparsification.",
                    "Stochastic Block Model and Community Detection in Sparse Graphs: A spectral algorithm with optimal rate of recovery.",
                    "On-Line Learning Algorithms for Path Experts with Non-Additive Losses.",
                    "Truthful Linear Regression.",
                    "A PTAS for Agnostically Learning Halfspaces.",
                    "S2: An Efficient Graph Based Active Learning Algorithm with Application to Nonparametric Classification.",
                    "Improved Sum-of-Squares Lower Bounds for Hidden Clique and Hidden Submatrix Problems.",
                    "Contextual Dueling Bandits.",
                    "Beyond Hartigan Consistency: Merge Distortion Metric for Hierarchical Clustering.",
                    "Faster Algorithms for Testing under Conditional Sampling.",
                    "Learning and inference in the presence of corrupted inputs.",
                    "From Averaging to Acceleration, There is Only a Step-size.",
                    "Variable Selection is Hard.",
                    "Vector-Valued Property Elicitation.",
                    "Competing with the Empirical Risk Minimizer in a Single Pass.",
                    "A Chaining Algorithm for Online Nonparametric Regression.",
                    "Escaping From Saddle Points - Online Stochastic Gradient for Tensor Decomposition.",
                    "Learning the dependence structure of rare events: a non-asymptotic study.",
                    "Thompson Sampling for Learning Parameterized Markov Decision Processes.",
                    "Computational Lower Bounds for Community Detection on Random Graphs.",
                    "Adaptive Recovery of Signals by Convex Optimization.",
                    "Tensor principal component analysis via sum-of-square proofs.",
                    "Fast Exact Matrix Completion with Finite Samples.",
                    "Exp-Concavity of Proper Composite Losses.",
                    "On Learning Distributions from their Samples.",
                    "MCMC Learning.",
                    "Online with Spectral Bounds.",
                    "Regret Lower Bound and Optimal Algorithm in Dueling Bandit Problem.",
                    "Second-order Quantile Methods for Experts and Combinatorial Games.",
                    "Hierarchical Label Queries with Data-Dependent Partitions.",
                    "Algorithms for Lipschitz Learning on Graphs.",
                    "Low Rank Matrix Completion with Exponential Family Noise.",
                    "Bad Universal Priors and Notions of Optimality.",
                    "Learning with Square Loss: Localization through Offset Rademacher Complexity.",
                    "Achieving All with No Parameters: AdaNormalHedge.",
                    "Lower and Upper Bounds on the Generalization of Stochastic Exponentially Concave Optimization.",
                    "Correlation Clustering with Noisy Partial Information.",
                    "Online Density Estimation of Bradley-Terry Models.",
                    "First-order regret bounds for combinatorial semi-bandits.",
                    "Norm-Based Capacity Control in Neural Networks.",
                    "Cortical Learning via Prediction.",
                    "Partitioning Well-Clustered Graphs: Spectral Clustering Works!",
                    "Batched Bandit Problems.",
                    "Hierarchies of Relaxations for Online Prediction Problems with Evolving Constraints.",
                    "Fast Mixing for Discrete Point Processes.",
                    "Generalized Mixability via Entropic Duality.",
                    "On the Complexity of Bandit Linear Optimization.",
                    "An Almost Optimal PAC Algorithm.",
                    "Minimax rates for memory-bounded sparse linear regression.",
                    "Interactive Fingerprinting Codes and the Hardness of Preventing False Discovery.",
                    "Convex Risk Minimization and Conditional Probability Estimation.",
                    "Regularized Linear Regression: A Precise Analysis of the Estimation Error.",
                    "Max vs Min: Tensor Decomposition and ICA with nearly Linear Sample Complexity.",
                    "On Convergence of Emphatic Temporal-Difference Learning.",
                    "Open Problem: Restricted Eigenvalue Condition for Heavy Tailed Designs.",
                    "Open Problem: The landscape of the loss surfaces of multilayer networks.",
                    "Open Problem: The Oracle Complexity of Smooth Convex Optimization in Nonstandard Settings.",
                    "Open Problem: Online Sabotaged Shortest Path.",
                    "Open Problem: Learning Quantum Circuits with Queries.",
                    "Open Problem: Recursive Teaching Dimension Versus VC Dimension."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "27th COLT 2014",
        "info": "Barcelona, Spain",
        "venues": [
            {
                "sub_name_abbr": "conf/colt/2014",
                "sub_name": "Proceedings of The 27th Conference on Learning Theory, COLT 2014, Barcelona, Spain, June 13-15, 2014.",
                "count": 61,
                "papers": [
                    "Preface.",
                    "Distribution-independent Reliable Learning.",
                    "Learning without concentration.",
                    "Uniqueness of Ordinal Embedding.",
                    "Bayes-Optimal Scorers for Bipartite Ranking.",
                    "Multiarmed Bandits With Limited Expert Advice.",
                    "Learning Sparsely Used Overcomplete Dictionaries.",
                    "Community Detection via Random and Adaptive Sampling.",
                    "A second-order bound with excess losses.",
                    "Logistic Regression: Tight Bounds for Stochastic and Online Optimization.",
                    "Higher-Order Regret Bounds with Switching Costs.",
                    "The Complexity of Learning Halfspaces using Generalized Linear Methods.",
                    "Optimal learners for multiclass problems.",
                    "Stochastic Regret Minimization via Thompson Sampling.",
                    "Approachability in unknown games: Online learning meets multi-objective optimization.",
                    "Belief propagation, robust reconstruction and optimal recovery of block models.",
                    "Sample Compression for Multi-label Concept Classes.",
                    "Finding a most biased coin with fewest flips.",
                    "Volumetric Spanners: an Efficient Exploration Basis for Learning.",
                    "lil' UCB : An Optimal Exploration Algorithm for Multi-Armed Bandits.",
                    "An Inequality with Applications to Structured Sparsity and Multitask Dictionary Learning.",
                    "On the Complexity of A/B Testing.",
                    "Elicitation and Identification of Properties.",
                    "The sample complexity of agnostic learning under deterministic labels.",
                    "Density-preserving quantization with application to graph downsampling.",
                    "A Convex Formulation for Mixed Regression with Two Components: Minimax Optimal Rates.",
                    "Efficiency of conformalized ridge regression.",
                    "Most Correlated Arms Identification.",
                    "Fast matrix completion without the condition number.",
                    "Learning Coverage Functions and Private Release of Marginals.",
                    "Computational Limits for Matrix Completion.",
                    "Robust Multi-objective Learning with Mentor Feedback.",
                    "Uniqueness of Tensor Decompositions with Applications to Polynomial Identifiability.",
                    "New Algorithms for Learning Incoherent and Overcomplete Dictionaries.",
                    "Online Linear Optimization via Smoothing.",
                    "Learning Mixtures of Discrete Product Distributions using Spectral Decompositions.",
                    "Localized Complexities for Transductive Learning.",
                    "On the Consistency of Output Code Based Learning Algorithms for Multiclass Learning Problems.",
                    "Edge Label Inference in Generalized Stochastic Block Models: from Spectral Theory to Impossibility Results.",
                    "Lower bounds on the performance of polynomial-time algorithms for sparse linear regression.",
                    "Follow the Leader with Dropout Perturbations.",
                    "Lipschitz Bandits: Regret Lower Bound and Optimal Algorithms.",
                    "Sample Complexity Bounds on Differentially Private Learning via Communication Complexity.",
                    "Unconstrained Online Linear Learning in Hilbert Spaces: Minimax Algorithms and Normal Approximations.",
                    "Principal Component Analysis and Higher Correlations for Distributed Data.",
                    "Compressed Counting Meets Compressed Sensing.",
                    "The Geometry of Losses.",
                    "Resourceful Contextual Bandits.",
                    "The More, the Merrier: the Blessing of Dimensionality for Learning Large Gaussian Mixtures.",
                    "Near-Optimal Herding.",
                    "Faster and Sample Near-Optimal Algorithms for Proper Learning Mixtures of Gaussians.",
                    "Online Learning with Composite Loss Functions.",
                    "Online Non-Parametric Regression.",
                    "Open Problem: Tightness of maximum likelihood semidefinite relaxations.",
                    "Open Problem: A (missing) boosting-type convergence result for AdaBoost.MH with factorized multi-class classifiers.",
                    "Open Problem: Finding Good Cascade Sampling Processes for the Network Inference Problem.",
                    "Open Problem: Tensor Decompositions: Algorithms up to the Uniqueness Threshold?",
                    "Open Problem: The Statistical Query Complexity of Learning Sparse Halfspaces.",
                    "Open Problem: Online Local Learning.",
                    "Open Problem: Shifting Experts on Easy Data.",
                    "Open Problem: Efficient Online Sparse Regression."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "26th COLT 2013",
        "info": "Princeton University, NJ, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/colt/2013",
                "sub_name": "COLT 2013 - The 26th Annual Conference on Learning Theory, June 12-14, 2013, Princeton University, NJ, USA.",
                "count": 51,
                "papers": [
                    "Preface.",
                    "On the Complexity of Bandit and Derivative-Free Stochastic Convex Optimization.",
                    "A Theoretical Analysis of NDCG Type Ranking Measures.",
                    "Excess risk bounds for multitask learning with trace norm regularization.",
                    "Honest Compressions and Their Application to Compression Schemes.",
                    "The price of bandit information in multiclass online classification.",
                    "Estimation of Extreme Values and Associated Level Sets of a Regression Function via Selective Sampling.",
                    "Bounded regret in stochastic multi-armed bandits.",
                    "Recovering the Optimal Solution by Dual Random Projection.",
                    "Opportunistic Strategies for Generalized No-Regret Problems.",
                    "Online Learning for Time Series Prediction.",
                    "Sharp analysis of low-rank kernel matrix approximations.",
                    "Beating Bandits in Gradually Evolving Worlds.",
                    "Information Complexity in Bandit Subset Selection.",
                    "Passive Learning with Target Risk.",
                    "Blind Signal Separation in the Presence of Gaussian Noise.",
                    "Active and passive learning of linear separators under log-concave distributions.",
                    "Randomized partition trees for exact nearest neighbor search.",
                    "Surrogate Regret Bounds for the Area Under the ROC Curve via Strongly Proper Losses.",
                    "Algorithms and Hardness for Robust Subspace Recovery.",
                    "PLAL: Cluster-based active learning.",
                    "Learning Using Local Membership Queries.",
                    "Sparse Adaptive Dirichlet-Multinomial-like Processes.",
                    "Prediction by random-walk perturbation.",
                    "Approachability, fast and slow.",
                    "Classification with Asymmetric Label Noise: Consistency and Maximal Denoising.",
                    "General Oracle Inequalities for Gibbs Posterior with Application to Ranking.",
                    "Learning Halfspaces Under Log-Concave Densities: Polynomial Approximations and Moment Matching.",
                    "Subspace Embeddings and \\(\\ell_p\\)-Regression Using Exponential Random Variables.",
                    "Consistency of Robust Kernel Density Estimators.",
                    "Divide and Conquer Kernel Ridge Regression.",
                    "Regret Minimization for Branching Experts.",
                    "Horizon-Independent Optimal Prediction with Log-Loss in Exponential Families.",
                    "Online Similarity Prediction of Networked Data from Known and Unknown Graphs.",
                    "A near-optimal algorithm for finite partial-monitoring games against adversarial opponents.",
                    "Representation, Approximation and Learning of Submodular Functions Using Low-rank Decision Trees.",
                    "A Tale of Two Metrics: Simultaneous Bounds on Competitiveness and Regret.",
                    "Optimal Probability Estimation with Applications to Prediction and Classification.",
                    "Polynomial Time Optimal Query Algorithms for Finding Graphs with Arbitrary Real Weights.",
                    "Differentially Private Feature Selection via Stability Arguments, and the Robustness of the Lasso.",
                    "Learning a set of directions.",
                    "A Tensor Spectral Approach to Learning Mixed Membership Community Models.",
                    "Adaptive Crowdsourcing Algorithms for the Bandit Survey Problem.",
                    "Boosting with the Logistic Loss is Consistent.",
                    "Competing With Strategies.",
                    "Online Learning with Predictable Sequences.",
                    "Efficient Learning of Simplices.",
                    "Complexity Theoretic Lower Bounds for Sparse Principal Component Detection.",
                    "Open Problem: Adversarial Multiarmed Bandits with Limited Advice.",
                    "Open Problem: Fast Stochastic Exp-Concave Optimization.",
                    "Open Problem: Lower bounds for Boosting with Hadamard Matrices."
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "25th COLT 2012",
        "info": "Edinburgh, Scotland, UK",
        "venues": [
            {
                "sub_name_abbr": "conf/colt/2012",
                "sub_name": "COLT 2012 - The 25th Annual Conference on Learning Theory, June 25-27, 2012, Edinburgh, Scotland.",
                "count": 51,
                "papers": [
                    "Preface.",
                    "Unsupervised SVMs: On the Complexity of the Furthest Hyperplane Problem.",
                    "(weak) Calibration is Computationally Hard.",
                    "Learning Valuation Functions.",
                    "Unified Algorithms for Online Learning and Competitive Analysis.",
                    "Online Optimization with Gradual Variations.",
                    "Commentary on \"Online Optimization with Gradual Variations\".",
                    "The Optimality of Jeffreys Prior for Online Density Estimation and the Asymptotic Normality of Maximum Likelihood Estimators.",
                    "Commentary on \"The Optimality of Jeffreys Prior for Online Density Estimation and the Asymptotic Normality of Maximum Likelihood Estimators\".",
                    "PAC-Bayesian Bound for Gaussian Process Regression and Multiple Kernel Additive Model.",
                    "Random Design Analysis of Ridge Regression.",
                    "Reconstruction from Anisotropic Random Measurements.",
                    "Toward a Noncommutative Arithmetic-geometric Mean Inequality: Conjectures, Case-studies, and Consequences.",
                    "Commentary on \"Toward a Noncommutative Arithmetic-geometric Mean Inequality: Conjectures, Case-studies, and Consequences\".",
                    "L1 Covering Numbers for Uniformly Bounded Convex Functions.",
                    "Generalization Bounds for Online Learning Algorithms with Pairwise Loss Functions.",
                    "Attribute-Efficient Learning and Weight-Degree Tradeoffs for Polynomial Threshold Functions.",
                    "Learning Functions of Halfspaces using Prefix Covers.",
                    "Computational Bounds on Statistical Query Learning.",
                    "Learning DNF Expressions from Fourier Spectrum.",
                    "Consistency of Nearest Neighbor Classification under Selective Sampling.",
                    "Active Learning Using Smooth Relative Regret Approximations with Applications.",
                    "Robust Interactive Learning.",
                    "Rare Probability Estimation under Regularly Varying Heavy Tails.",
                    "Competitive Classification and Closeness Testing.",
                    "Kernels Based Tests with Non-asymptotic Bootstrap Approaches for Two-sample Problems.",
                    "Differentially Private Online Learning.",
                    "Private Convex Optimization for Empirical Risk Minimization with Applications to High-dimensional Regression.",
                    "Distributed Learning, Communication Complexity and Privacy.",
                    "A Characterization of Scoring Rules for Linear Properties.",
                    "Divergences and Risks for Multiclass Experiments.",
                    "A Conjugate Property between Loss Functions and Uncertainty Sets in Classification Problems.",
                    "New Bounds for Learning Intervals with Implications for Semi-Supervised Learning.",
                    "Tight Bounds on Proper Equivalence Query Learning of DNF.",
                    "Distance Preserving Embeddings for General n-Dimensional Manifolds.",
                    "A Method of Moments for Mixture Models and Hidden Markov Models.",
                    "A Correlation Clustering Approach to Link Classification in Signed Networks.",
                    "Spectral Clustering of Graphs with General Degrees in the Extended Planted Partition Model.",
                    "Toward Understanding Complex Spaces: Graph Laplacians on Manifolds with Singularities and Boundaries.",
                    "Exact Recovery of Sparsely-Used Dictionaries.",
                    "Near-Optimal Algorithms for Online Matrix Prediction.",
                    "Commentary on \"Near-Optimal Algorithms for Online Matrix Prediction\".",
                    "Analysis of Thompson Sampling for the Multi-armed Bandit Problem.",
                    "Autonomous Exploration For Navigating In MDPs.",
                    "Towards Minimax Policies for Online Linear Optimization with Bandit Feedback.",
                    "The Best of Both Worlds: Stochastic and Adversarial Bandits.",
                    "Open Problem: Regret Bounds for Thompson Sampling.",
                    "Open Problem: Better Bounds for Online Logistic Regression.",
                    "Open Problem: Learning Dynamic Network Models from a Static Snapshot.",
                    "Open Problem: Does AdaBoost Always Cycle?",
                    "Open Problem: Is Averaging Needed for Strongly Convex Stochastic Gradient Descent?"
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "24th COLT 2011",
        "info": "Budapest, Hungary",
        "venues": [
            {
                "sub_name_abbr": "conf/colt/2011",
                "sub_name": "COLT 2011 - The 24th Annual Conference on Learning Theory, June 9-11, 2011, Budapest, Hungary.",
                "count": 43,
                "papers": [
                    "Preface.",
                    "Regret Bounds for the Adaptive Control of Linear Quadratic Systems.",
                    "Blackwell Approachability and No-Regret Learning are Equivalent.",
                    "Competitive Closeness Testing.",
                    "Oracle inequalities for computationally budgeted model selection.",
                    "Bandits, Query Learning, and the Haystack Dimension.",
                    "Minimax Policies for Combinatorial Prediction Games.",
                    "Minimax Regret of Finite Partial-Monitoring Games in Stochastic Environments.",
                    "Sample Complexity Bounds for Differentially Private Learning.",
                    "Tight conditions for consistent variable selection in high dimensional nonparametric regression.",
                    "Multiclass Learnability and the ERM principle.",
                    "Mixability is Bayes Risk Curvature Relative to Log Loss.",
                    "Distribution-Independent Evolvability of Linear Threshold Functions.",
                    "Lower Bounds and Hardness Amplification for Learning Shallow Monotone Formulas.",
                    "Complexity-Based Approach to Calibration with Checking Rules.",
                    "Concentration-Based Guarantees for Low-Rank Matrix Reconstruction.",
                    "On the Consistency of Multi-Label Learning.",
                    "The KL-UCB Algorithm for Bounded Stochastic Bandits and Beyond.",
                    "Sparsity Regret Bounds for Individual Sequences in Online Linear Regression.",
                    "Safe Learning: bridging the gap between Bayes, MDL and statistical learning theory via empirical convexity.",
                    "Beyond the regret minimization barrier: an optimal algorithm for stochastic strongly-convex optimization.",
                    "A Close Look to Margin Complexity and Related Parameters.",
                    "Maximum Likelihood vs. Sequential Normalized Maximum Likelihood in On-line Density Estimation.",
                    "A New Algorithm for Compressed Counting with Applications in Shannon Entropy Estimation in Dynamic Data.",
                    "A Finite-Time Analysis of Multi-armed Bandits Problems with Kullback-Leibler Divergences.",
                    "Robust approachability and regret minimization in games with partial monitoring.",
                    "The Rate of Convergence of Adaboost.",
                    "Online Learning: Beyond Regret.",
                    "Neyman-Pearson classification under a strict constraint.",
                    "Sequential Event Prediction with Association Rules.",
                    "Optimal aggregation of affine estimators.",
                    "Collaborative Filtering with the Trace Norm: Learning, Bounding, and Transducing.",
                    "Contextual Bandits with Similarity Information.",
                    "Adaptive Density Level Set Clustering.",
                    "Agnostic KWIK learning and efficient approximate reinforcement learning.",
                    "The Sample Complexity of Dictionary Learning.",
                    "Identifiability of Priors from Bounded Sample Sizes with Applications to Transfer Learning.",
                    "Does an Efficient Calibrated Forecasting Strategy Exist?",
                    "Bounds on Individual Risk for Log-loss Predictors.",
                    "A simple multi-armed bandit algorithm with optimal variation-bounded regret.",
                    "Minimax Algorithm for Learning Rotations.",
                    "Missing Information Impediments to Learnability.",
                    "Monotone multi-armed bandit allocations."
                ]
            }
        ]
    },
    {
        "year": "2010",
        "name": "23rd COLT 2010",
        "info": "Haifa, Israel",
        "venues": [
            {
                "sub_name_abbr": "conf/colt/2010",
                "sub_name": "COLT 2010 - The 23rd Conference on Learning Theory, Haifa, Israel, June 27-29, 2010.",
                "count": 48,
                "papers": [
                    "Convex Games in Banach Spaces.",
                    "Composite Objective Mirror Descent.",
                    "Voting Paradoxes.",
                    "Optimal Algorithms for Online Convex Optimization with Multi-Point Bandit Feedback.",
                    "Best Arm Identification in Multi-Armed Bandits.",
                    "Nonparametric Bandits with Covariates.",
                    "An Asymptotically Optimal Bandit Algorithm for Bounded Support Models.",
                    "Learning with Global Cost in Stochastic Environments.",
                    "Hedging Structured Concepts.",
                    "Following the Flattened Leader.",
                    "Sequence Prediction in Realizable and Non-realizable Cases.",
                    "Regret Minimization for Online Buffering Problems Using the Weighted Majority Algorithm.",
                    "Learning Rotations with Little Regret.",
                    "Evolution with Drifting Targets.",
                    "Regret Minimization With Concept Drift.",
                    "Strongly Non-U-Shaped Learning Results by General Techniques.",
                    "Inferring Descriptive Generalisations of Formal Languages.",
                    "Quantum Predictive Learning and Communication Complexity with Single Input.",
                    "Online Learning of Noisy Data with Kernels.",
                    "The Online Loop-free Stochastic Shortest-Path Problem.",
                    "Adaptive Bound Optimization for Online Convex Optimization.",
                    "Adaptive Subgradient Methods for Online Learning and Stochastic Optimization.",
                    "Characterization of Linkage-based Clustering.",
                    "Robust Hierarchical Clustering.",
                    "Theoretical Justification of Popular Link Prediction Heuristics.",
                    "The Convergence Rate of AdaBoost.",
                    "Learning Talagrand DNF Formulas.",
                    "Open Problem: Analyzing Ant Robot Coverage.",
                    "On-line Variance Minimization in O(n2) per Trial?",
                    "Robust Efficient Conditional Probability Estimation.",
                    "Can We Learn to Gamble Efficiently?",
                    "Active Learning on Trees and Graphs.",
                    "Adaptive Submodularity: A New Approach to Active Learning and Stochastic Optimization.",
                    "Robust Selective Sampling from Single and Multiple Teachers.",
                    "Improved Guarantees for Agnostic Learning of Disjunctions.",
                    "Mansour's Conjecture is True for Random DNF Formulas.",
                    "Deterministic Sparse Fourier Approximation via Fooling Arithmetic Progressions.",
                    "Forest Density Estimation.",
                    "Toward Learning Gaussian Mixtures with Arbitrary Separation.",
                    "Sparse Recovery in Convex Hulls of Infinite Dictionaries.",
                    "Efficient Classification for Metric Data.",
                    "Learning Kernel-Based Halfspaces with the Zero-One Loss.",
                    "Ranking with Kernels in Fourier space.",
                    "Causal Markov Condition for Submodular Information Measures.",
                    "Open Loop Optimistic Planning.",
                    "Principal Component Analysis with Contaminated Data: The High Dimensional Case.",
                    "Robustness and Generalization.",
                    "Learning to Create is as Hard as Learning to Appreciate."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "22nd COLT 2009",
        "info": "Montreal, Quebec, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/colt/2009",
                "sub_name": "COLT 2009 - The 22nd Conference on Learning Theory, Montreal, Quebec, Canada, June 18-21, 2009.",
                "count": 44,
                "papers": [
                    "The Isotron Algorithm: High-Dimensional Isotonic Regression.",
                    "Linear Classifiers are Nearly Optimal When Hidden Variables Have Diverse Effect.",
                    "Domain Adaptation: Learning Bounds and Algorithms.",
                    "Optimal Algorithms for the Coin Weighing Problem with a Spring Scale.",
                    "Online Learning for Global Cost Functions.",
                    "The K-armed Dueling Bandits Problem.",
                    "Online Multi-task Learning with Hard Constraints.",
                    "Taking Advantage of Sparsity in Multi-Task Learning.",
                    "Sparse Regression Learning by Aggregation and Langevin Monte-Carlo.",
                    "Homogeneous Multi-Instance Learning with Arbitrary Dependence.",
                    "A Spectral Algorithm for Learning Hidden Markov Models.",
                    "Empirical Bernstein Bounds and Sample-Variance Penalization.",
                    "Generalised Pinsker Inequalities.",
                    "Consistent Partial Identification.",
                    "Fast and Optimal Prediction on a Labeled Tree.",
                    "Predicting the Labelling of a Graph via Minimum $p$-Seminorm Interpolation.",
                    "Finding Low Error Clusterings.",
                    "Stochastic Convex Optimization.",
                    "Escaping the Curse of Dimensionality with a Tree-based Regressor.",
                    "On the Sample Complexity of Learning Smooth Cuts on a Manifold.",
                    "SVM-Optimization and Steepest-Descent Line Search.",
                    "Minimax Policies for Adversarial and Stochastic Bandits.",
                    "Tighter Bounds for Multi-Armed Bandits with Expert Advice.",
                    "Combinatorial Bandits.",
                    "Beating the Adaptive Bandit with High Probability.",
                    "A Stochastic View of Optimal Regret through Minimax Duality.",
                    "New Results for Random Walk Learning.",
                    "Robustness of Evolvability.",
                    "Complexity of Teaching by a Restricted Number of Examples.",
                    "Learning Convex Bodies is Hard.",
                    "Reliable Agnostic Learning.",
                    "Agnostic Online Learning.",
                    "Hybrid Stochastic-Adversarial On-line Learning.",
                    "Active Learning for Smooth Problems.",
                    "Adaptive Rates of Convergence in Active Learning.",
                    "Learnability and Stability in the General Learning Setting.",
                    "Vox Populi: Collecting High-Quality Labels from a Crowd.",
                    "Optimal Rates for Regularized Least Squares Regression.",
                    "A Note on Learning with Integral Operators.",
                    "Generalization Bounds for Learning the Kernel Problem.",
                    "An Efficient Bandit Algorithm for sqrt(T) Regret in Online Multiclass Prediction?.",
                    "Better Guarantees for Sparsest Cut Clustering.",
                    "Minimax Games with Bandits.",
                    "The Complexity of Improperly Learning Large Margin Halfspaces."
                ]
            }
        ]
    },
    {
        "year": "2008",
        "name": "21st COLT 2008",
        "info": "Helsinki, Finland",
        "venues": [
            {
                "sub_name_abbr": "conf/colt/2008",
                "sub_name": "21st Annual Conference on Learning Theory - COLT 2008, Helsinki, Finland, July 9-12, 2008.",
                "count": 51,
                "papers": [
                    "The Catch-Up Phenomenon in Bayesian Inference.",
                    "Combinatorial Prediction Markets.",
                    "Unsupervised Learning for Natural Language Processing.",
                    "Concentration Inequalities.",
                    "Learning Mixtures of Product Distributions Using Correlations and Independence.",
                    "Beyond Gaussians: Spectral Methods for Learning Mixtures of Heavy-Tailed Distributions.",
                    "Does Unlabeled Data Provably Help? Worst-case Analysis of the Sample Complexity of Semi-Supervised Learning.",
                    "The True Sample Complexity of Active Learning.",
                    "Extracting Certainty from Uncertainty: Regret Bounded by Variation in Costs.",
                    "Online Learning of Maximum p-Norm Margin Classifiers with Bias.",
                    "Minimizing Wide Range Regret with Time Selection Functions.",
                    "An Efficient Reduction of Ranking to Classification.",
                    "Learning from Collective Behavior.",
                    "Injective Hilbert Space Embeddings of Probability Measures.",
                    "Almost Tight Upper Bound for Finding Fourier Coefficients of Bounded Pseudo- Boolean Functions.",
                    "Teaching Dimensions based on Cooperative Learning.",
                    "On the Power of Membership Queries in Agnostic Learning.",
                    "Dimension and Margin Bounds for Reflection-invariant Kernels.",
                    "Learning Acyclic Probabilistic Circuits Using Test Paths.",
                    "Learning Random Monotone DNF Under the Uniform Distribution.",
                    "Polynomial Regression under Arbitrary Product Distributions.",
                    "How Local Should a Learning Method Be?.",
                    "Learning Coordinate Gradients with Multi-Task Kernels.",
                    "Sparse Recovery in Large Ensembles of Kernel Machines On-Line Learning and Bandits.",
                    "More Efficient Internal-Regret-Minimizing Algorithms.",
                    "Linear Algorithms for Online Multitask Classification.",
                    "Competing in the Dark: An Efficient Algorithm for Bandit Linear Optimization.",
                    "Combining Expert Advice Efficiently.",
                    "Improved Guarantees for Learning via Similarity Functions.",
                    "Geometric & Topological Representations of Maximum Classes with Applications to Sample Compression.",
                    "On the Equivalence of Weak Learnability and Linear Separability: New Relaxations and Efficient Boosting Algorithms.",
                    "Adaptive Aggregation for Reinforcement Learning with Efficient Exploration: Deterministic Domains.",
                    "High-Probability Regret Bounds for Bandit Online Linear Optimization.",
                    "Adapting to a Changing Environment: the Brownian Restless Bandits.",
                    "Stochastic Linear Optimization under Bandit Feedback.",
                    "Model Selection and Stability in k-means Clustering.",
                    "Relating Clustering Stability to Properties of Cluster Boundaries.",
                    "Finding Metric Structure in Information Theoretic Clustering.",
                    "An Information Theoretic Framework for Multi-view Learning.",
                    "Optimal Stragies and Minimax Lower Bounds for Online Convex Games.",
                    "Regret Bounds for Sleeping Experts and Bandits.",
                    "When Random Play is Optimal Against an Adversary.",
                    "On-line Sequential Bin Packing.",
                    "Time Varying Undirected Graphs.",
                    "Learning in the Limit with Adversarial Disturbances.",
                    "On the Margin Explanation of Boosting Algorithms.",
                    "Adaptive Hausdorff Estimation of Density Level Sets.",
                    "Density Estimation in Linear Time.",
                    "The Learning Power of Evolution.",
                    "A Query Algorithm for Agnostically Learning DNF?.",
                    "Learning Rotations."
                ]
            }
        ]
    },
    {
        "year": "2007",
        "name": "20th COLT 2007",
        "info": "San Diego, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/colt/2007",
                "sub_name": "Learning Theory, 20th Annual Conference on Learning Theory, COLT 2007, San Diego, CA, USA, June 13-15, 2007, Proceedings.",
                "count": 48,
                "papers": [
                    "Property Testing: A Learning Theory Perspective.",
                    "Spectral Algorithms for Learning and Clustering.",
                    "Minimax Bounds for Active Learning.",
                    "Stability of k -Means Clustering.",
                    "Margin Based Active Learning.",
                    "Learning Large-Alphabet and Analog Circuits with Value Injection Queries.",
                    "Teaching Dimension and the Complexity of Active Learning.",
                    "Multi-view Regression Via Canonical Correlation Analysis.",
                    "Aggregation by Exponential Weighting and Sharp Oracle Inequalities.",
                    "Occam's Hammer.",
                    "Resampling-Based Confidence Regions and Multiple Tests for a Correlated Random Vector.",
                    "Suboptimality of Penalized Empirical Risk Minimization in Classification.",
                    "Transductive Rademacher Complexity and Its Applications.",
                    "U-Shaped, Iterative, and Iterative-with-Counter Learning.",
                    "Mind Change Optimal Learning of Bayes Net Structure.",
                    "Learning Correction Grammars.",
                    "Mitotic Classes.",
                    "Regret to the Best vs. Regret to the Average.",
                    "Strategies for Prediction Under Imperfect Monitoring.",
                    "Bounded Parameter Markov Decision Processes with Average Reward Criterion.",
                    "On-Line Estimation with the Multivariate Gaussian Distribution.",
                    "Generalised Entropy and Asymptotic Complexities of Languages.",
                    "Q -Learning with Linear Function Approximation.",
                    "How Good Is a Kernel When Used as a Similarity Measure?",
                    "Gaps in Support Vector Optimization.",
                    "Learning Languages with Rational Kernels.",
                    "Generalized SMO-Style Decomposition Algorithms.",
                    "Learning Nested Halfspaces and Uphill Decision Trees.",
                    "An Efficient Re-scaled Perceptron Algorithm for Conic Systems.",
                    "A Lower Bound for Agnostically Learning Disjunctions.",
                    "Sketching Information Divergences.",
                    "Competing with Stationary Prediction Strategies.",
                    "Improved Rates for the Stochastic Continuum-Armed Bandit Problem.",
                    "Learning Permutations with Exponential Weights.",
                    "Multitask Learning with Expert Advice.",
                    "Online Learning with Prior Knowledge.",
                    "Nonlinear Estimators and Tail Bounds for Dimension Reduction in l 1 Using Cauchy Random Projections.",
                    "Sparse Density Estimation with l1 Penalties.",
                    "l1 Regularization in Infinite Dimensional Feature Spaces.",
                    "Prediction by Categorical Features: Generalization Properties and Application to Feature Ranking.",
                    "Observational Learning in Random Networks.",
                    "The Loss Rank Principle for Model Selection.",
                    "Robust Reductions from Ranking to Classification.",
                    "Rademacher Margin Complexity.",
                    "Open Problems in Efficient Semi-supervised PAC Learning.",
                    "Resource-Bounded Information Gathering for Correlation Clustering.",
                    "Are There Local Maxima in the Infinite-Sample Likelihood of Gaussian Mixture Estimation?",
                    "When Is There a Free Matrix Lunch?"
                ]
            }
        ]
    },
    {
        "year": "2006",
        "name": "19th COLT 2006",
        "info": "Pittsburgh, PA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/colt/2006",
                "sub_name": "Learning Theory, 19th Annual Conference on Learning Theory, COLT 2006, Pittsburgh, PA, USA, June 22-25, 2006, Proceedings.",
                "count": 48,
                "papers": [
                    "Random Multivariate Search Trees.",
                    "On Learning and Logic.",
                    "Predictions as Statements and Decisions.",
                    "A Sober Look at Clustering Stability.",
                    "PAC Learning Axis-Aligned Mixtures of Gaussians with No Separation Assumption.",
                    "Stable Transductive Learning.",
                    "Uniform Convergence of Adaptive Graph-Based Regularization.",
                    "The Rademacher Complexity of Linear Transformation Classes.",
                    "Function Classes That Approximate the Bayes Risk.",
                    "Functional Classification with Margin Conditions.",
                    "Significance and Recovery of Block Structures in Binary Matrices with Noise.",
                    "Maximum Entropy Distribution Estimation with Generalized Regularization.",
                    "Unifying Divergence Minimization and Statistical Inference Via Convex Duality.",
                    "Mercer's Theorem, Feature Maps, and Smoothing.",
                    "Learning Bounds for Support Vector Machines with Learned Kernels.",
                    "On Optimal Learning Algorithms for Multiplicity Automata.",
                    "Exact Learning Composed Classes with a Small Number of Mistakes.",
                    "DNF Are Teachable in the Average Case.",
                    "Teaching Randomized Learners.",
                    "Memory-Limited U-Shaped Learning.",
                    "On Learning Languages from Positive Data and a Limited Number of Short Counterexamples.",
                    "Learning Rational Stochastic Languages.",
                    "Parent Assignment Is Hard for the MDL, AIC, and NML Costs.",
                    "Uniform-Distribution Learnability of Noisy Linear Threshold Functions with Restricted Focus of Attention.",
                    "Discriminative Learning Can Succeed Where Generative Learning Fails.",
                    "Improved Lower Bounds for Learning Intersections of Halfspaces.",
                    "Efficient Learning Algorithms Yield Circuit Lower Bounds.",
                    "Optimal Oracle Inequality for Aggregation of Classifiers Under Low Noise Condition.",
                    "Aggregation and Sparsity Via l1 Penalized Least Squares.",
                    "A Randomized Online Learning Algorithm for Better Variance Control.",
                    "Online Learning with Variable Stage Duration.",
                    "Online Learning Meets Optimization in the Dual.",
                    "Online Tracking of Linear Subspaces.",
                    "Online Multitask Learning.",
                    "The Shortest Path Problem Under Partial Monitoring.",
                    "Tracking the Best Hyperplane with a Simple Budget Perceptron.",
                    "Logarithmic Regret Algorithms for Online Convex Optimization.",
                    "Online Variance Minimization.",
                    "Online Learning with Constraints.",
                    "Continuous Experts and the Binning Algorithm.",
                    "Competing with Wild Prediction Rules.",
                    "Learning Near-Optimal Policies with Bellman-Residual Minimization Based Fitted Policy Iteration and a Single Sample Path.",
                    "Ranking with a P-Norm Push.",
                    "Subset Ranking Using Regression.",
                    "Active Sampling for Multiple Output Identification.",
                    "Improving Random Projections Using Marginal Information.",
                    "Efficient Algorithms for General Active Learning.",
                    "Can Entropic Regularization Be Replaced by Squared Euclidean Distance Plus Additional Linear Constraints."
                ]
            }
        ]
    },
    {
        "year": "2005",
        "name": "18th COLT 2005",
        "info": "Bertinoro, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/colt/2005",
                "sub_name": "Learning Theory, 18th Annual Conference on Learning Theory, COLT 2005, Bertinoro, Italy, June 27-30, 2005, Proceedings.",
                "count": 48,
                "papers": [
                    "Ranking and Scoring Using Empirical Risk Minimization.",
                    "Learnability of Bipartite Ranking Functions.",
                    "Stability and Generalization of Bipartite Ranking Algorithms.",
                    "Loss Bounds for Online Category Ranking.",
                    "Margin-Based Ranking Meets Boosting in the Middle.",
                    "Martingale Boosting.",
                    "The Value of Agreement, a New Boosting Algorithm.",
                    "A PAC-Style Model for Learning from Labeled and Unlabeled Data.",
                    "Generalization Error Bounds Using Unlabeled Data.",
                    "On the Consistency of Multiclass Classification Methods.",
                    "Sensitive Error Correcting Output Codes.",
                    "Data Dependent Concentration Bounds for Sequential Prediction Algorithms.",
                    "The Weak Aggregating Algorithm and Weak Mixability.",
                    "Tracking the Best of Many Experts.",
                    "Improved Second-Order Bounds for Prediction with Expert Advice.",
                    "Competitive Collaborative Learning.",
                    "Analysis of Perceptron-Based Active Learning.",
                    "A New Perspective on an Old Perceptron Algorithm.",
                    "Fast Rates for Support Vector Machines.",
                    "Exponential Convergence Rates in Classification.",
                    "General Polynomial Time Decomposition Algorithms.",
                    "Approximating a Gram Matrix for Improved Kernel-Based Learning.",
                    "Learning Convex Combinations of Continuously Parameterized Basic Kernels.",
                    "On the Limitations of Embedding Methods.",
                    "Leaving the Span.",
                    "Variations on U-Shaped Learning.",
                    "Mind Change Efficient Learning.",
                    "On a Syntactic Characterization of Classification with a Mind Change Bound.",
                    "Ellipsoid Approximation Using Random Vectors.",
                    "The Spectral Method for General Mixture Models.",
                    "On Spectral Learning of Mixtures of Distributions.",
                    "From Graphs to Manifolds - Weak and Strong Pointwise Consistency of Graph Laplacians.",
                    "Towards a Theoretical Foundation for Laplacian-Based Manifold Methods.",
                    "Permutation Tests for Classification.",
                    "Localized Upper and Lower Bounds for Some Estimation Problems.",
                    "Improved Minimax Bounds on the Test and Training Distortion of Empirically Designed Vector Quantizers.",
                    "Rank, Trace-Norm and Max-Norm.",
                    "Learning a Hidden Hypergraph.",
                    "On Attribute Efficient and Non-adaptive Learning of Parities and DNF Expressions.",
                    "Unlabeled Compression Schemes for Maximum Classes, .",
                    "Trading in Markovian Price Models.",
                    "From External to Internal Regret.",
                    "Separating Models of Learning from Correlated and Uncorrelated Data.",
                    "Asymptotic Log-Loss of Prequential Maximum Likelihood Codes.",
                    "Teaching Classes with High Teaching Dimension Using Few Examples.",
                    "Optimum Follow the Leader Algorithm.",
                    "The Cross Validation Problem.",
                    "Compute Inclusion Depth of a Pattern."
                ]
            }
        ]
    },
    {
        "year": "2004",
        "name": "17th COLT 2004",
        "info": "Banff, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/colt/2004",
                "sub_name": "Learning Theory, 17th Annual Conference on Learning Theory, COLT 2004, Banff, Canada, July 1-4, 2004, Proceedings.",
                "count": 46,
                "papers": [
                    "Towards a Characterization of Polynomial Preference Elicitation with Value Queries in Combinatorial Auctions (Extended Abstract).",
                    "Graphical Economics.",
                    "Deterministic Calibration and Nash Equilibrium.",
                    "Reinforcement Learning for Average Reward Zero-Sum Games.",
                    "Polynomial Time Prediction Strategy with Almost Optimal Mistake Probability.",
                    "Minimizing Regret with Label Efficient Prediction.",
                    "Regret Bounds for Hierarchical Classification with Linear-Threshold Functions.",
                    "Online Geometric Optimization in the Bandit Setting Against an Adaptive Adversary.",
                    "Learning Classes of Probabilistic Automata.",
                    "On the Learnability of E-pattern Languages over Small Alphabets.",
                    "Replacing Limit Learners with Equally Powerful One-Shot Query Learners.",
                    "Concentration Bounds for Unigrams Language Model.",
                    "Inferring Mixtures of Markov Chains.",
                    "PExact = Exact Learning.",
                    "Learning a Hidden Graph Using O(log n) Queries Per Edge.",
                    "Toward Attribute Efficient Learning of Decision Lists and Parities.",
                    "Learning Over Compact Metric Spaces.",
                    "A Function Representation for Learning in Banach Spaces.",
                    "Local Complexities for Empirical Risk Minimization.",
                    "Model Selection by Bootstrap Penalization for Classification.",
                    "Convergence of Discrete MDL for Sequential Prediction.",
                    "On the Convergence of MDL Density Estimation.",
                    "Suboptimal Behavior of Bayes and MDL in Classification Under Misspecification.",
                    "Learning Intersections of Halfspaces with a Margin.",
                    "A General Convergence Theorem for the Decomposition Method.",
                    "Oracle Bounds and Exact Algorithm for Dyadic Classification Trees.",
                    "An Improved VC Dimension Bound for Sparse Polynomials.",
                    "A New PAC Bound for Intersection-Closed Concept Classes.",
                    "A Framework for Statistical Clustering with a Constant Time Approximation Algorithms for K-Median Clustering.",
                    "Data Dependent Risk Bounds for Hierarchical Mixture of Experts Classifiers.",
                    "Consistency in Models for Communication Constrained Distributed Learning.",
                    "On the Convergence of Spectral Clustering on Random Samples: The Normalized Case.",
                    "Performance Guarantees for Regularized Maximum Entropy Density Estimation.",
                    "Learning Monotonic Linear Functions.",
                    "Boosting Based on a Smooth Margin.",
                    "Bayesian Networks and Inner Product Spaces.",
                    "An Inequality for Nearly Log-Concave Distributions with Applications to Learning.",
                    "Bayes and Tukey Meet at the Center Point.",
                    "Sparseness Versus Estimating Conditional Probabilities: Some Asymptotic Results.",
                    "A Statistical Mechanics Analysis of Gram Matrix Eigenvalue Spectra.",
                    "Statistical Properties of Kernel Principal Component Analysis.",
                    "Kernelizing Sorting, Permutation, and Alignment for Minimum Volume PCA.",
                    "Regularization and Semi-supervised Learning on Large Graphs.",
                    "Perceptron-Like Performance for Intersections of Halfspaces.",
                    "The Optimal PAC Algorithm.",
                    "The Budgeted Multi-armed Bandit Problem."
                ]
            }
        ]
    },
    {
        "year": "2003",
        "name": "16th COLT 2003",
        "info": "Washington, DC, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/colt/2003",
                "sub_name": "Computational Learning Theory and Kernel Machines, 16th Annual Conference on Computational Learning Theory and 7th Kernel Workshop, COLT/Kernel 2003, Washington, DC, USA, August 24-27, 2003, Proceedings.",
                "count": 60,
                "papers": [
                    "Tutorial: Learning Topics in Game-Theoretic Decision Making.",
                    "A General Class of No-Regret Learning Algorithms and Game-Theoretic Equilibria.",
                    "Preference Elicitation and Query Learning.",
                    "Efficient Algorithms for Online Decision Problems.",
                    "Positive Definite Rational Kernels.",
                    "Bhattacharyya Expected Likelihood Kernels.",
                    "Maximal Margin Classification for Metric Spaces.",
                    "Maximum Margin Algorithms with Boolean Kernels.",
                    "Knowledge-Based Nonlinear Kernel Classifiers.",
                    "Fast Kernels for Inexact String Matching.",
                    "On Graph Kernels: Hardness Results and Efficient Alternatives.",
                    "Kernels and Regularization on Graphs.",
                    "Data-Dependent Bounds for Multi-category Classification Based on Convex Losses.",
                    "Comparing Clusterings by the Variation of Information.",
                    "Multiplicative Updates for Large Margin Classifiers.",
                    "Simplified PAC-Bayesian Margin Bounds.",
                    "Sparse Kernel Partial Least Squares Regression.",
                    "Sparse Probability Regression by Label Partitioning.",
                    "Learning with Rigorous Support Vector Machines.",
                    "Robust Regression by Boosting the Median.",
                    "Boosting with Diverse Base Classifiers.",
                    "Reducing Kernel Matrix Diagonal Dominance Using Semi-definite Programming.",
                    "Optimal Rates of Aggregation.",
                    "Distance-Based Classification with Lipschitz Functions.",
                    "Random Subclass Bounds.",
                    "PAC-MDL Bounds.",
                    "Universal Well-Calibrated Algorithm for On-Line Classification.",
                    "Learning Probabilistic Linear-Threshold Classifiers via Selective Sampling.",
                    "Learning Algorithm for Enclosing Points in Bregmanian Spheres.",
                    "Internal Regret in On-Line Portfolio Selection.",
                    "Lower Bounds on the Sample Complexity of Exploration in the Multi-armed Bandit Problem.",
                    "Smooth e-Intensive Regression by Loss Symmetrization.",
                    "On Finding Large Conjunctive Clusters.",
                    "Learning Arithmetic Circuits via Partial Derivatives.",
                    "Using a Linear Fit to Determine Monotonicity Directions.",
                    "Generalization Bounds for Voting Classifiers Based on Sparsity and Clustering.",
                    "Sequence Prediction Based on Monotone Complexity.",
                    "How Many Strings Are Easy to Predict?",
                    "Polynomial Certificates for Propositional Classes.",
                    "On-Line Learning with Imperfect Monitoring.",
                    "Exploiting Task Relatedness for Mulitple Task Learning.",
                    "Approximate Equivalence of Markov Decision Processes.",
                    "An Information Theoretic Tradeoff between Complexity and Accuracy.",
                    "Learning Random Log-Depth Decision Trees under the Uniform Distribution.",
                    "Projective DNF Formulae and Their Revision.",
                    "Learning with Equivalence Constraints and the Relation to Multiclass Learning.",
                    "Tutorial: Machine Learning Methods in Natural Language Processing.",
                    "Learning from Uncertain Data.",
                    "Learning and Parsing Stochastic Unification-Based Grammars.",
                    "Generality's Price: Inescapable Deficiencies in Machine-Learned Programs.",
                    "On Learning to Coordinate: Random Bits Help, Insightful Normal Forms, and Competency Isomorphisms.",
                    "Learning All Subfunctions of a Function.",
                    "When Is Small Beautiful?",
                    "Learning a Function of r Relevant Variables.",
                    "Subspace Detection: A Robust Statistics Formulation.",
                    "How Fast Is k-Means?",
                    "Universal Coding of Zipf Distributions.",
                    "An Open Problem Regarding the Convergence of Universal A Priori Probability.",
                    "Entropy Bounds for Restricted Convex Hulls.",
                    "Compressing to VC Dimension Many Points."
                ]
            }
        ]
    },
    {
        "year": "2002",
        "name": "15th COLT 2002",
        "info": "Sydney, Australia",
        "venues": [
            {
                "sub_name_abbr": "conf/colt/2002",
                "sub_name": "Computational Learning Theory, 15th Annual Conference on Computational Learning Theory, COLT 2002, Sydney, Australia, July 8-10, 2002, Proceedings.",
                "count": 27,
                "papers": [
                    "Agnostic Learning Nonconvex Function Classes.",
                    "Entropy, Combinatorial Dimensions and Random Averages.",
                    "Geometric Parameters of Kernel Machines.",
                    "Localized Rademacher Complexities.",
                    "Some Local Measures of Complexity of Convex Hulls and Generalization Bounds.",
                    "Path Kernels and Multiplicative Updates.",
                    "Predictive Complexity and Information.",
                    "Mixability and the Existence of Weak Complexities.",
                    "A Second-Order Perceptron Algorithm.",
                    "Tracking Linear-Threshold Concepts with Winnow.",
                    "Learning Tree Languages from Text.",
                    "Polynomial Time Inductive Inference of Ordered Tree Patterns with Internal Structured Variables from Positive Data.",
                    "Inferring Deterministic Linear Languages.",
                    "Merging Uniform Inductive Learners.",
                    "The Speed Prior: A New Simplicity Measure Yielding Near-Optimal Computable Predictions.",
                    "New Lower Bounds for Statistical Query Learning.",
                    "Exploring Learnability between Exact and PAC.",
                    "PAC Bounds for Multi-armed Bandit and Markov Decision Processes.",
                    "Bounds for the Minimum Disagreement Problem with Applications to Learning Theory.",
                    "On the Proper Learning of Axis Parallel Concepts.",
                    "A Consistent Strategy for Boosting Algorithms.",
                    "The Consistency of Greedy Algorithms for Classification.",
                    "Maximizing the Margin with Boosting.",
                    "Performance Guarantees for Hierarchical Clustering.",
                    "Self-Optimizing and Pareto-Optimal Policies in General Environments Based on Bayes-Mixtures.",
                    "Prediction and Dimension.",
                    "Learning the Internet."
                ]
            }
        ]
    },
    {
        "year": "2001",
        "name": "14th COLT / 5. EuroCOLT 2001",
        "info": "Amsterdam, The Netherlands",
        "venues": [
            {
                "sub_name_abbr": "conf/colt/2001",
                "sub_name": "Computational Learning Theory, 14th Annual Conference on Computational Learning Theory, COLT 2001 and 5th European Conference on Computational Learning Theory, EuroCOLT 2001, Amsterdam, The Netherlands, July 16-19, 2001, Proceedings.",
                "count": 41,
                "papers": [
                    "How Many Queries Are Needed to Learn One Bit of Information?",
                    "Radial Basis Function Neural Networks Have Superlinear VC Dimension.",
                    "Tracking a Small Set of Experts by Mixing Past Posteriors.",
                    "Potential-Based Algorithms in Online Prediction and Game Theory.",
                    "A Sequential Approximation Bound for Some Sample-Dependent Convex Optimization Problems with Applications in Learning.",
                    "Efficiently Approximating Weighted Sums with Exponentially Many Terms.",
                    "Ultraconservative Online Algorithms for Multiclass Problems.",
                    "Estimating a Boolean Perceptron from Its Average Satisfying Assignment: A Bound on the Precision Required.",
                    "Adaptive Strategies and Regret Minimization in Arbitrarily Varying Markov Environments.",
                    "Robust Learning - Rich and Poor.",
                    "On the Synthesis of Strategies Identifying Recursive Functions.",
                    "Intrinsic Complexity of Learning Geometrical Concepts from Positive Data.",
                    "Toward a Computational Theory of Data Acquisition and Truthing.",
                    "Discrete Prediction Games with Arbitrary Feedback and Loss.",
                    "Rademacher and Gaussian Complexities: Risk Bounds and Structural Results.",
                    "Further Explanation of the Effectiveness of Voting Methods: The Game between Margins and Weights.",
                    "Geometric Methods in the Analysis of Glivenko-Cantelli Classes.",
                    "Learning Relatively Small Classes.",
                    "On Agnostic Learning with {0, *, 1}-Valued and Real-Valued Hypotheses.",
                    "When Can Two Unsupervised Learners Achieve PAC Separation?",
                    "Strong Entropy Concentration, Game Theory, and Algorithmic Randomness.",
                    "Pattern Recognition and Density Estimation under the General i.i.d. Assumption.",
                    "A General Dimension for Exact Learning.",
                    "Data-Dependent Margin-Based Generalization Bounds for Classification.",
                    "Limitations of Learning via Embeddings in Euclidean Half-Spaces.",
                    "Estimating the Optimal Margins of Embeddings in Euclidean Half Spaces.",
                    "A Generalized Representer Theorem.",
                    "A Leave-One-out Cross Validation Bound for Kernel Methods with Applications in Learning.",
                    "Learning Additive Models Online with Fast Evaluating Kernels.",
                    "Geometric Bounds for Generalization in Boosting.",
                    "Smooth Boosting and Learning with Malicious Noise.",
                    "On Boosting with Optimal Poly-Bounded Distributions.",
                    "Agnostic Boosting.",
                    "A Theoretical Analysis of Query Selection for Collaborative Filtering.",
                    "On Using Extended Statistical Queries to Avoid Membership Queries.",
                    "Learning Monotone DNF from a Teacher That Almost Does Not Answer Membership Queries.",
                    "On Learning Monotone DNF under Product Distributions.",
                    "Learning Regular Sets with an Incomplete Membership Oracle.",
                    "Learning Rates for Q-Learning.",
                    "Optimizing Average Reward Using Discounted Rewards.",
                    "Bounds on Sample Size for Policy Evaluation in Markov Environments."
                ]
            }
        ]
    },
    {
        "year": "2000",
        "name": "13th COLT 2000",
        "info": "Palo Alto, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/colt/2000",
                "sub_name": "Proceedings of the Thirteenth Annual Conference on Computational Learning Theory (COLT 2000), June 28 - July 1, 2000, Palo Alto, California, USA.",
                "count": 35,
                "papers": [
                    "On the Convergence Rate of Good-Turing Estimators.",
                    "On the Efficiency of Noise-Tolerant PAC Algorithms Derived from Statistical Queries.",
                    "Decision Tree Approximations of Boolean Functions.",
                    "Computable Shell Decomposition Bounds.",
                    "On the Learnability and Design of Output Codes for Multiclass Problems.",
                    "Language Learning From Texts: Degrees of Instrinsic Complexity and Their Characterizations.",
                    "Average-Case Complexity of Learning Polynomials.",
                    "Generalization Bounds for Decision Trees.",
                    "The Role of Critical Sets in Vapnik-Chervonenkis Theory.",
                    "Statistical Sufficiency for Classes in Empirical L2 Spaces.",
                    "Relative Expected Instantaneous Loss Bounds.",
                    "The Minimax Strategy for Gaussian Density Estimation. pp.",
                    "Adaptive and Self-Confident On-Line Learning Algorithms.",
                    "An Improved On-line Algorithm for Learning Linear Evaluation Functions.",
                    "Continuous Drifting Games.",
                    "Estimation and Approximation Bounds for Gradient-Based Reinforcement Learning.",
                    "Bias-Variance Error Bounds for Temporal Difference Updates.",
                    "PAC Analogues of Perceptron and Winnow via Boosting the Margin.",
                    "Logistic Regression, AdaBoost and Bregman Distances.",
                    "Barrier Boosting.",
                    "MadaBoost: A Modification of AdaBoost.",
                    "Localized Boosting.",
                    "Improving Algorithms for Boosting.",
                    "Leveraging for Regression.",
                    "Boosting Using Branching Programs.",
                    "The Precision of Query Points as a Resource for Learning Convex Polytopes with Membership Queries.",
                    "Improved Algorithms for Theory Revision with Queries.",
                    "Abstract Combinatorial Characterizations of Exact Learning via Queries.",
                    "The Computational Complexity of Densest Region Detection.",
                    "On the Difficulty of Approximately Maximizing Agreements.",
                    "Hardness Results for General Two-Layer Neural Networks.",
                    "Model Selection and Error Estimation.",
                    "Generalisation Error Bounds for Sparse Linear Classifiers.",
                    "Sparsity vs. Large Margins for Linear Classifiers.",
                    "Entropy Numbers of Linear Function Classes."
                ]
            }
        ]
    },
    {
        "year": "1999",
        "name": "12th COLT 1999",
        "info": "Santa Cruz, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/colt/1999",
                "sub_name": "Proceedings of the Twelfth Annual Conference on Computational Learning Theory, COLT 1999, Santa Cruz, CA, USA, July 7-9, 1999.",
                "count": 36,
                "papers": [
                    "The Robustness of the p-Norm Algorithms.",
                    "Minimax Regret Under log Loss for General Classes of Experts.",
                    "On Prediction of Individual Sequences Relative to a Set of Experts in the Presence of Noise.",
                    "Regret Bounds for Prediction Problems.",
                    "On Theory Revision with Queries.",
                    "Estimating a Mixture of Two Product Distributions.",
                    "An Apprentice Learning Model (extended abstract).",
                    "Uniform-Distribution Attribute Noise Learnability.",
                    "On Learning in the Presence of Unspecified Attribute Values.",
                    "Learning Fixed-Dimension Linear Thresholds from Fragmented Data.",
                    "Approximation Algorithms for Clustering Problems.",
                    "An Adaptive Version of the Boost by Majority Algorithm.",
                    "Drifting Games.",
                    "Additive Models, Boosting, and Inference for Generalized Divergences.",
                    "Boosting as Entropy Projection.",
                    "Multiclass Learning, Boosting, and Error-Correcting Codes.",
                    "Theoretical Analysis of a Class of Randomized Regularization Methods.",
                    "PAC-Bayesian Model Averaging.",
                    "Viewing all Models as \"Probabilistic\".",
                    "Reinforcement Learning and Mistake Bounded Algorithms.",
                    "Convergence Analysis of Temporal-Difference Learning Algorithms with Linear Function Approximation.",
                    "Beating the Hold-Out: Bounds for K-fold and Progressive Cross-Validation.",
                    "Microchoice Bounds and Self Bounding Learning Algorithms.",
                    "Learning Specialist Decision Lists.",
                    "Linear Relations between Square-Loss and Kolmogorov Complexity.",
                    "Individual Sequence Prediction - Upper Bounds and Application for Complexity.",
                    "Extensional Set Learning (extended abstract).",
                    "On a Generalized Notion of Mistake Bounds.",
                    "On the Intrinsic Complexity of Learning Recursive Functions.",
                    "Covering Numbers for Support Vector Machines.",
                    "Further Results on the Margin Distribution.",
                    "More Efficient PAC-Learning of DNF with Membership Queries Under the Uniform Distribution.",
                    "On PAC Learning Using Winnow, Perceptron, and a Perceptron-like Algorithm.",
                    "Extension of the PAC Framework to Finite and Countable Markov Chains.",
                    "Learning Threshold Functions with Small Weights Using Membership Queries.",
                    "Exact Learning of Unordered Tree Patterns from Queries."
                ]
            }
        ]
    },
    {
        "year": "1998",
        "name": "11th COLT 1998",
        "info": "Madison, Wisconsin, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/colt/1998",
                "sub_name": "Proceedings of the Eleventh Annual Conference on Computational Learning Theory, COLT 1998, Madison, Wisconsin, USA, July 24-26, 1998.",
                "count": 32,
                "papers": [
                    "On Sequential Prediction of Individual Sequences Relative to a Set of Experts.",
                    "Universal Portfolio Selection.",
                    "Tracking the Best Regressor.",
                    "Minimax Relative Loss Analysis for Sequential Prediction Algorithms Using Parametric Hypotheses.",
                    "Robust Learning Aided by Context.",
                    "Birds Can Fly.",
                    "Learnability of a Subclass of Extended Pattern Languages.",
                    "Aspects of Complexity of Conservative Probabilistic Learning.",
                    "Learning to Communicate via Unknown Channel (Abstract).",
                    "Improved Boosting Algorithms using Confidence-Rated Predictions.",
                    "Combining Labeled and Unlabeled Data with Co-Training.",
                    "Learning Agents for Uncertain Environments (Extended Abstract).",
                    "Improved Lower Bounds for Learning from Noisy Examples: An Information-Theoretic Approach.",
                    "The complexity of learning according to two models of a drifting environment.",
                    "On the Sample Complexity of Learning Functions with Bounded Variation.",
                    "Efficient Learning of Monotone Concepts via Quadratic Optimization.",
                    "Structural Results about Exact Learning with Unspecified Attribute Values.",
                    "Learning First Order Universal Horn Expressions.",
                    "Learning Atomic Formulas with Prescribed Properties.",
                    "Exact Learning of Tree Patterns from Queries and Counterexamples.",
                    "On the Power of Learning Robustly.",
                    "Learning One-Variable Pattern Languages in Linear Average Time.",
                    "Large Margin Classification Using the Perceptron Algorithm.",
                    "Cross-Validation for Binary Classification by Real-Valued Functions: Theoretical Analysis.",
                    "Some PAC-Bayesian Theorems.",
                    "Neural Networks and Efficient Associative Memory.",
                    "Self Bounding Learning Algorithms.",
                    "Sample Complexity of Model-Based Search.",
                    "Testing Problems with Sub-Learning Sample Complexity.",
                    "Polylogarithmic-Overhead Piecemeal Graph Exploration.",
                    "Projection Learning.",
                    "The Query Complexity of Finding Local Minima in the Lattice."
                ]
            }
        ]
    },
    {
        "year": "1997",
        "name": "10th COLT 1997",
        "info": "Nashville, Tennessee, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/colt/1997",
                "sub_name": "Proceedings of the Tenth Annual Conference on Computational Learning Theory, COLT 1997, Nashville, Tennessee, USA, July 6-9, 1997.",
                "count": 35,
                "papers": [
                    "Information Theory in Probability, Statistics, Learning, and Neural Nets (Abstract).",
                    "A PAC Analysis of a Bayesian Estimator.",
                    "Learning Logic Programs by Using the Product Homomorphism Method.",
                    "On-line Evaluation and Prediction using Linear Functions.",
                    "Derandomizing Stochastic Prediction Strategies.",
                    "On-line Learning and the Metrical Task System Problem.",
                    "On the Complexity of Learning for a Spiking Neuron (Extended Abstract).",
                    "Learning Probabilistically Consistent Linear Threshold Functions.",
                    "PAC Adaptive Control of Linear Systems.",
                    "FINite Learning Capabilities and Their Limits.",
                    "Asymmetric Team Learning.",
                    "Generalized Notions of Mind Change Complexity.",
                    "A Brief Look at Some Machine Learning Problems in Genomics.",
                    "An Efficient Extension to Mixture Techniques for Prediction and Decision Trees.",
                    "Performance Bounds for Nonlinear Time Series Prediction.",
                    "Computational Sample Complexity.",
                    "Dense Shattering and Teaching Dimensions for Differentiable Families (Extended Abstract).",
                    "Algorithmic Stability and Sanity-Check Bounds for Leave-one-Out Cross-Validation.",
                    "Analysis of Two Gradient-based Algorithms for On-line Regression.",
                    "General Convergence Results for Linear Discriminant Updates.",
                    "The Binary Exponentiated Gradient Algorithm for Learning Linear Functions.",
                    "A Dichotomy Theorem for Learning Quantified Boolean Formulas.",
                    "Learning with Maximum-Entropy Distributions.",
                    "Generating all Maximal Independent Sets of Bounded-Degree Hypergraphs.",
                    "Some Label Efficient Learning Results.",
                    "Learning from Examples with Unspecified Attribute Values (Extended Abstract).",
                    "Learning Distributions from Random Walks.",
                    "Distributed Cooperative Bayesian Learning Strategies.",
                    "Resource Bounded Next Value and Explanatory Identification: Learning Automata, Patterns and Polynomials On-Line.",
                    "Inferring Answers to Queries.",
                    "Teachers, Learners and Black Boxes.",
                    "Learning Markov Chains with Variable Memory Length from Noisy Output.",
                    "Universal Portfolios With and Without Transaction Costs.",
                    "Estimation of Time-Varying Parameters in Statistical Models: An Optimization Approach.",
                    "Agnostic Learning of Geometric Patterns (Extended Abstract)."
                ]
            }
        ]
    },
    {
        "year": "1996",
        "name": "9th COLT 1996",
        "info": "Desenzano del Garda, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/colt/1996",
                "sub_name": "Proceedings of the Ninth Annual Conference on Computational Learning Theory, COLT 1996, Desenzano del Garda, Italy, June 28-July 1, 1996.",
                "count": 37,
                "papers": [
                    "Challenges in Machine Learning for Text Classification.",
                    "Analysis of a Simple Learning Algorithm: Learning Foraging Thresholds for Lizards.",
                    "VC Dimension of an Integrate-and-Fire Neuron Model.",
                    "Graph Learning with a Nearest Neighbor Approach.",
                    "The Dual DFA Learning Problem: Hardness Results for Programming by Demonstration and Learning First-Order Representations (Extended Abstract).",
                    "PAC-Like Upper Bounds for the Sample Complexity of Leave-one-Out Cross-Validation.",
                    "A Data-Dependent Skeleton Estimate for Learning.",
                    "Towards Robust Model Selection Using Estimation and Approximation Error Bounds.",
                    "A Framework for Structural Risk Minimisation.",
                    "A Bayesian/Information Theoretic Model of Bias Learning.",
                    "Predicting a Binary Sequence Almost As Well As the Optimal Biased Coin.",
                    "A Randomized Approximation of the MDL for Stochastic Models with Hidden Variables.",
                    "Learning an Optimal Decision Strategy in an Influence Diagram with Latent Variables.",
                    "On the Complexity of Learning from Drifting Distributions.",
                    "Learning Changing Concepts by Exploiting the Structure of Change.",
                    "The Importance of Convexity in Learning with Squared Loss.",
                    "Learning Curve Bounds for a Markov Decision Process with Undiscounted Rewards.",
                    "Probabilistic and Team PFIN-Type Learning: General Properties.",
                    "Synthesizing Enumeration Techniques for Language Learning.",
                    "Elementary Formal Systems, Intrinsic Complexity, and Procrastination.",
                    "Angluin's Theorem for Indexed Families of r.e. Sets and Applications.",
                    "On Restricted-Focus-of-Attention Learnability of Boolean Functions.",
                    "Analysis of Greedy Expert Hiring and an Application to Memory-Based Learning (Extended Abstract).",
                    "On Learning width Two Branching Programs (Extended Abstract).",
                    "PAC Learning Axis-Aligned Rectangles with Respect to Product Distributions from Multiple-Instance Examples.",
                    "Attribute-Efficient Learning in Query and Mistake-Bound Models.",
                    "PAC Learning Intersections of Halfspaces with Membership Queries (Extended Abstract).",
                    "Learning Conjunctions of Two Unate DNF Formulas (Extended Abstract): Computational and Informational Results.",
                    "A Simple Algorithm for Learning O(log n)-Term DNF.",
                    "Trees and Learning.",
                    "Learning Branches and Learning to Win Closed Games.",
                    "A Competitive Approach to Game Learning.",
                    "Strong Minimax Lower Bounds for Learning.",
                    "On-Line Portfolio Selection.",
                    "On Bayes Methods for On-Line Boolean Prediction.",
                    "Game Theory, On-Line Prediction and Boosting.",
                    "Learning of Depth Two Neural Networks with Constant Fan-In at the Hidden Nodes (Extended Abstract)."
                ]
            }
        ]
    },
    {
        "year": "1995",
        "name": "8th COLT 1995",
        "info": "Santa Cruz, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/colt/1995",
                "sub_name": "Proceedings of the Eigth Annual Conference on Computational Learning Theory, COLT 1995, Santa Cruz, California, USA, July 5-8, 1995.",
                "count": 56,
                "papers": [
                    "Rationality.",
                    "Predictive Hebbian Learning.",
                    "An Experimental and Theoretical Comparison of Model Selection Methods.",
                    "On the Learnability and Usage of Acyclic Probabilistic Finite Automata.",
                    "Learning to Model Sequences Generated by Switching Distributions.",
                    "A Game of Prediction with Expert Advice.",
                    "Predicting Nearly as Well as the Best Pruning of a Decision Tree.",
                    "A Comparison of New and Old Algorithms for a Mixture Estimation Problem.",
                    "A Note on Learning Multivariate Polynomials Under the Uniform Distribution (Extended Abstract).",
                    "Randomized Approximate Aggregating Strategies and Their Applications to Prediction and Discrimination.",
                    "How to Use Expert Advice in the Case when Actual Values of Estimated Events Remain Unknown.",
                    "Learning with Unreliable Boundary Queries.",
                    "Generalized Teaching Dimensions and the Query Complexity of Learning.",
                    "Learning DNF over the Uniform Distribution using a Quantum Example Oracle.",
                    "Reducing the Number of Queries in Self-Directed Learning.",
                    "On Self-Directed Learning.",
                    "Being Taught can be Faster than Asking Questions.",
                    "Reductions for Learning via Queries.",
                    "Learning via Queries and Oracles.",
                    "On the Inductive Inference of Real Valued Functions.",
                    "Inductive Inference of Functions on the Rationals.",
                    "Language Learning from Texts: Mind Changes, Limited Memory and Monotonicity (Extended Abstract).",
                    "On Learning Decision Trees with Large Output Domains (Extended Abstract).",
                    "On the Learnability of Zn-DNF Formulas (Extended Abstract).",
                    "Proper Learning Algorithm for Functions of k Terms Under Smooth Distributions.",
                    "On-line Learning of Binary and n-ary Relations over Multi-dimensional Clusters.",
                    "DNF - If You Can't Learn'em, Teach'em: An Interactive Model of Teaching.",
                    "On Genetic Algorithms.",
                    "On the Optimal Capacity of Binary Neural Networks: Rigorous Combinatorial Approaches.",
                    "From Noise-Free to Noise-Tolerant and from On-line to Batch Learning.",
                    "Sample Sizes for Sigmoidal Neural Networks.",
                    "Online Learning via Congregational Gradient Descent.",
                    "Criteria for Specifying Machine Complexity in Learning.",
                    "Markov Decision Processes in Large State Spaces.",
                    "The Perceptron Algorithm vs. Winnow: Linear vs. Logarithmic Mistake Bounds when few Input Variables are Relevant.",
                    "Learning by a Population of Perceptrons.",
                    "Learning to Reason with a Restricted View.",
                    "Learning Internal Representations.",
                    "Piecemeal Graph Exploration by a Mobile Robot (Extended Abstract).",
                    "Concept Learning with Geometric Hypotheses.",
                    "More or Less Efficient Agnostic Learning of Convex Polygons.",
                    "Noise-Tolerant Parallel Learning of Geometric Concepts.",
                    "On Learning from Noisy and Incomplete Examples.",
                    "On Learning Bounded-Width Branching Programs.",
                    "On Efficient Agnostic Learning of Linear Combinations of Basis Functions.",
                    "Sequential PAC Learning.",
                    "Regression NSS: An Alternative to Cross Validation.",
                    "More Theorems about Scale-sensitive Dimensions and Learning.",
                    "General Bounds on the Mutual Information Between a Parameter and n Conditionally Independent Observations.",
                    "Learning from a Mixture of Labeled and Unlabeled Examples with Parametric Side Information.",
                    "Learning Using Group Representations (Extended Abstract).",
                    "Exactly Learning Automata with Small Cover Time.",
                    "Specification and Simulation of Statistical Query Algorithms for Efficiency and Noise Tolerance.",
                    "Simple Learning Algorithms Using Divide and Conquer.",
                    "A Note on VC-Dimension and Measures of Sets of Reals.",
                    "Corrigendum for \"Learnability of Description Logics\"."
                ]
            }
        ]
    },
    {
        "year": "1994",
        "name": "7th COLT 1994",
        "info": "New Brunswick, NJ, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/colt/1994",
                "sub_name": "Proceedings of the Seventh Annual ACM Conference on Computational Learning Theory, COLT 1994, New Brunswick, NJ, USA, July 12-15, 1994.",
                "count": 39,
                "papers": [
                    "Bayesian Inductive Logic Programming.",
                    "Frequencies vs Biases: Machine Learning Problems in Natural Language Processing (Extended Abstract).",
                    "A Statistical Approach to Decision Tree Modeling.",
                    "CLASSIC Learning.",
                    "Learning Probabilistic Automata with Variable Memory Length.",
                    "On a Learnability Question Associated to Neural Networks with Continuous Activations (Extended Abstract).",
                    "Learning with Malicious Membership Queries and Exceptions (Extended Abstract).",
                    "Efficient Agnostic PAC-Learning with Simple Hypothesis.",
                    "Rigorous Learning Curve Bounds from Statistical Mechanics.",
                    "Efficient Reinforcement Learning.",
                    "An Optimal-Control Application of Two Paradigms of On-Line Learning.",
                    "On Learning Read-k-Satisfy-j DNF.",
                    "On the Limits of Proper Learnability of Subclasses of DNF Formulas.",
                    "Oracles and Queries that are Sufficient for Exact Learning (Extended Abstract).",
                    "Learning Structurally Reversible Context-Free Grammars from Queries and Counterexamples in Polynomial Time.",
                    "Inference and Minimization of Hidden Markov Chains.",
                    "Playing the Matching-Shoulders Lob-Pass Game with Logarithmic Regret.",
                    "Learning Monotone Log-Term DNF Formulas.",
                    "The Minimum L-Complexity Algorithm and its Applications to Learning Non-Parametric Rules.",
                    "Approximate Methods for Sequential Decision Making Using Expert Advice.",
                    "Co-Learning of Total Recursive Functions.",
                    "Learning Unions of Boxes with Membership and Equivalence Queries.",
                    "An Optimal Parallel Algorithm for Learning DFA.",
                    "On Learning Counting Functions with Queries.",
                    "Geometrical Concept Learning and Convex Polytopes.",
                    "Learning with Queries but Incomplete Information (Extended Abstract).",
                    "Learning One-Dimensional Geometric Patterns Under One-Sided Random Misclassification Noise.",
                    "The Representation of Recursive Languages and Its Impact on the Efficiency of Learning.",
                    "The Strength of Noninclusions for Teams of Finite Learners (Extended Abstract).",
                    "On the Intrinsic Complexity of Language Identification.",
                    "Inclusion Problems in Parallel Learning and Games (Extended Abstract).",
                    "Fat-Shattering and the Learnability of Real-Valued Functions.",
                    "On Learning Arithmetic Read-Once Formulas with Exponentiation (Extended Abstract).",
                    "Exploiting Random Walks for Learning.",
                    "Learning from a Consistently Ignorant Teacher.",
                    "Learning Linear Threshold Functions in the Presence of Classification Noise.",
                    "Efficient Learning of Continuous Neural Networks.",
                    "Generalization in Partially Connected Layered Neural Networks.",
                    "Lower Bounds on the VC-Dimension of Smoothly Parametrized Function Classes."
                ]
            }
        ]
    },
    {
        "year": "1993",
        "name": "6th COLT 1993",
        "info": "Santa Cruz, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/colt/1993",
                "sub_name": "Proceedings of the Sixth Annual ACM Conference on Computational Learning Theory, COLT 1993, Santa Cruz, CA, USA, July 26-28, 1993.",
                "count": 55,
                "papers": [
                    "Genetic Algorithms and Machine Learning.",
                    "Keeping the Neural Networks Simple by Minimizing the Description Length of the Weights.",
                    "Learning Sparse Multivariate Polynomials over a Field with Queries and Counterexamples.",
                    "Learning µ-branching Programs with Queries.",
                    "Linear Time Deterministic Learning of k-Term DNF.",
                    "Asking Questions to Minimize Errors.",
                    "Parameterized Learning Complexity.",
                    "On the Query Complexity of Learning.",
                    "Teaching a Smart Learner.",
                    "Learning and Robust Learning of Product Distributions.",
                    "A Model of Sequence Extrapolation.",
                    "On Polynomial-Time Probably almost Discriminative Learnability.",
                    "Learning from a Population of Hypotheses.",
                    "On Probably Correct Classification of Concepts.",
                    "On the Structure of Degrees of Inferability.",
                    "Language Learning in Dependence on the Space of Hypotheses.",
                    "On the Power of Sigmoid Neural Networks.",
                    "Lower Bounds on the Vapnik-Chervonenkis Dimension of Multi-Layer Threshold Networks.",
                    "Average Case Analysis of the Clipped Hebb Rule for Nonoverlapping Perception Networks.",
                    "On the Power of Polynomial Discriminators and Radial Basis Function Networks.",
                    "On the Impact of Forgetting on Learning Machines.",
                    "On Learning Multiple Concepts in Parallel.",
                    "Capabilities of Probabilistic Learners with Bounded Mind Changes.",
                    "Probability is More Powerful Than Team for Language Identification from Positive Data.",
                    "Capabilities of fallible FINite Learning.",
                    "On Learning in the Limit and Non-Uniform (epsilon, delta)-Learning.",
                    "Learning Fallible Finite State Automata.",
                    "Learning Two-Tape Automata from Queries and Counterexamples.",
                    "Efficient Identification of Regular Expressions from Representative Examples.",
                    "Learning Unions of Two Rectangles in the Plane with Equivalence Queries.",
                    "On-Line Learning of Rectangles in Noisy Environments.",
                    "Statistical Queries and Faulty PAC Oracles.",
                    "Choosing a Reliable Hypothesis.",
                    "Piecemeal Learning of an Unknown Environment.",
                    "Learning with Restricted Focus of Attention.",
                    "Polynomial Learnability of Linear Threshold Approximations.",
                    "Rate of Approximation Results Motivated by Robust Neural Network Learning.",
                    "On the Average Tractability of Binary Integer Programming and the Curious Transition to Perfect Generalization in Learning Majority Functions.",
                    "On Learning Visual Concepts and DNF Formulae.",
                    "Localization vs. Identification of Semi-Algebraic Sets.",
                    "On Learning Embedded Symmetric Concepts.",
                    "Amplification of Weak Learning under the Uniform Distribution.",
                    "Learning kµ Decision Trees on the Uniform Distribution.",
                    "Bounding the Vapnik-Chervonenkis Dimension of Concept Classes Parameterized by Real Numbers.",
                    "Occam's Razor for Functions.",
                    "Conservativeness and Monotonicity for Learning Algorithms.",
                    "Lower Bounds for PAC Learning with Queries.",
                    "On the Complexity of Function Learning.",
                    "General Bounds on the Number of Examples Needed for Learning Probabilistic Concepts.",
                    "On-Line Learning with Linear Loss Constraints.",
                    "The \"lob-pass\" Problem and an On-line Learning Model of Rational Choice.",
                    "Worst-Case Quadratic Loss Bounds for a Generalization of the Widrow-Hoff Rule.",
                    "On-Line Learning of Functions of Bounded Variation under Various Sampling Schemes.",
                    "Acceleration of Learning in Binary Choice Problems.",
                    "Learning Binary Relations Using Weighted Majority Voting."
                ]
            }
        ]
    },
    {
        "year": "1992",
        "name": "5th COLT 1992",
        "info": "Pittsburgh, PA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/colt/1992",
                "sub_name": "Proceedings of the Fifth Annual ACM Conference on Computational Learning Theory, COLT 1992, Pittsburgh, PA, USA, July 27-29, 1992.",
                "count": 48,
                "papers": [
                    "Learning Boolean Read-Once Formulas with Arbitrary Symmetric and Constant Fan-in Gates.",
                    "On-line Learning of Rectangles.",
                    "Cryptographic Lower Bounds for Learnability of Boolean Functions on the Uniform Distribution.",
                    "Learning Hierarchical Rule Sets.",
                    "Random DFA's Can Be Approximately Learned from Sparse Uniform Examples.",
                    "An O(nlog log n) Learning Algorithm for DNF Under the Uniform Distribution.",
                    "A Technique for Upper Bounding the Spectral Norm with Applications to Learning.",
                    "Exact Learning of Read-k Disjoint DNF and Not-So-Disjoint DNF.",
                    "Learning k-Term DNF Formulas with an Incomplete Membership Oracle.",
                    "Learning DNF Formulae Under Classes of Probability Distributions.",
                    "Bellman Strikes Again! The Growth Rate of Sample Complexity with Dimension for the Nearest Neighbor Classifier.",
                    "A Theory for Memory-Based Learning.",
                    "Learnability of Description Logics.",
                    "PAC-Learnability of Determinate Logic Programs.",
                    "Polynomial Time Inference of a Subclass of Context-Free Transformations.",
                    "A Training Algorithm for Optimal Margin Classifiers.",
                    "The Learning Complexity of Smooth Functions of a Single Variable.",
                    "Absolute Error Bounds for Learning Linear Functions Online.",
                    "Probably Almost Discriminative Learning.",
                    "PAC Learning With Generalized Samples and an Application to Stochastic Geometry.",
                    "Degrees of Inferability.",
                    "On Learning Limiting Programs.",
                    "Breaking the Probability 1/2 Barrier in FIN-Type Learning.",
                    "Case-Based Learning in Inductive Inference.",
                    "Generalization versus Classification.",
                    "Learning Switching Concepts.",
                    "Learning With a Slowly Changing Distribution.",
                    "Dominating Distributions and Learnability.",
                    "Polynomial Iniform Convergence and Polynomial-Sample Learnability.",
                    "Learning Stochastic Functions by Smooth Simultaneous Estimation.",
                    "On Learning Noisy Threshold Functions with Finite Precision Weights.",
                    "Query by Committee.",
                    "A Noise Model on Learning Sets of Strings.",
                    "Language Learning from Stochastic Input.",
                    "On Exact Specification by Examples.",
                    "A Computational Model of Teaching.",
                    "Approximate Testing and Learnability.",
                    "Characterizations of Learnability for Classes of {O, ..., n}-Valued Functions.",
                    "Toward Efficient Agnostic Learning.",
                    "PAB-Decisions for Boolean and Real-Valued Features.",
                    "On the Role of Procrastination for Machine Learning.",
                    "Types of Monotonic Language Learning and Their Characterization.",
                    "An Improved Boosting Algorithm and Its Implications on Learning Complexity.",
                    "Some Weak Learning Results.",
                    "Universal Sequential Learning and Decision from Individual Data Sequences.",
                    "Robust Trainability of Single Neurons.",
                    "On the Computational Power of Neural Nets.",
                    "Corrigendum to Types of Noise in Data for Concept Learning."
                ]
            }
        ]
    },
    {
        "year": "1991",
        "name": "4th COLT 1991",
        "info": "Santa Cruz, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/colt/1991",
                "sub_name": "Proceedings of the Fourth Annual Workshop on Computational Learning Theory, COLT 1991, Santa Cruz, California, USA, August 5-7, 1991.",
                "count": 35,
                "papers": [
                    "Learning and Generalization.(Abstract).",
                    "The Role of Learning in Autonomous Robots.",
                    "Tracking Drifting Concepts Using Random Examples.",
                    "Investigating the Distribution Assumptions in the Pac Learning Model.",
                    "Simultaneous Learning of Concepts and Simultaneous Estimation of Probabilities.",
                    "Learning by Smoothing: A Morphological Approach.",
                    "Bounds on the Sample Complexity of Bayesian Learning Using Information Theory and the VC Dimension.",
                    "Calculation of the Learning Curve of Bayes Optimal Classification Algorithm for Learning a Perceptron With Noise.",
                    "Probably Almost Bayes Decisions.",
                    "A Geometric Approach to Threshold Circuit Complexity.",
                    "Learning Curves in Large Neural Networks.",
                    "On the Learnability of Infinitary Regular Sets.",
                    "Learning Monotone DNF with an Incomplete Membership Oracle.",
                    "Redundant Noisy Attributes, Attribute Errors, and Linear-Threshold Learning Using Winnow.",
                    "Learning in the Presence of Finitely or Infinitely Many Irrelevant Attributes.",
                    "On-Line Learning with an Oblivious Environment and the Power of Randomization.",
                    "Learning Monotone kµ DNF Formulas on Product Distributions.",
                    "Learning Probabilistic Read-Once Formulas on Product Distributions.",
                    "Learning 2µ DNF Formulas and kµ Decision Trees.",
                    "Polynomial-Time Learning of Very Simple Grammars from Positive Data.",
                    "Relations Between Probabilistic and Team One-Shot Learners (Extended Abstract).",
                    "Approximation and Estimation Bounds for Artificial Neural Networks.",
                    "The VC-Dimension vs. the Statistical Capacity for Two Layer Networks with Binary Weights.",
                    "On Learning Binary Weights for Majority Functions.",
                    "Evaluating the Performance of a Simple Inductive Procedure in the Presence of Overfitting Error.",
                    "Polynomial Learnability of Probabilistic Concepts with Respect to the Kullback-Leibler Divergence.",
                    "A Loss Bound Model for On-Line Stochastic Prediction Strategies.",
                    "On the Complexity of Teaching.",
                    "Improved Learning of AC0 Functions.",
                    "Learning Read-Once Formulas over Fields and Extended Bases.",
                    "Fast Identification of Geometric Objects with Membership Queries.",
                    "Bounded Degree Graph Inference from Walks.",
                    "On the Complexity of Learning Strings and Sequences.",
                    "The Correct Definition of Finite Elasticity: Corrigendum to Identification of Unions.",
                    "When Oracles Do Not Help."
                ]
            }
        ]
    },
    {
        "year": "1990",
        "name": "3rd COLT 1990",
        "info": "Rochester, NY, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/colt/1990",
                "sub_name": "Proceedings of the Third Annual Workshop on Computational Learning Theory, COLT 1990, University of Rochester, Rochester, NY, USA, August 6-8, 1990.",
                "count": 36,
                "papers": [
                    "Inductive Inference of Minimal Programs.",
                    "Identifying µ-Formula Decision Trees with Queries.",
                    "Learning Switch Configurations.",
                    "On the Computational Complexity of Approximating Distributions by Probabilistic Automata.",
                    "A Learning Criterion for Stochastic Rules.",
                    "On the Complexity of Learning Minimum Time-Bounded Turing Machines.",
                    "Inductive Inference from Positive Data is Powerful.",
                    "Inductive Identification of Pattern Languages Restricted Substitutions.",
                    "Pattern Languages are not Learnable.",
                    "On Learning Ring-Sum-Expansions.",
                    "Learning Functions of k Terms.",
                    "On the Sample Complexity of PAC-Learning Using Random and Chosen Examples.",
                    "Finite Learning by a \"Team\".",
                    "Some Problems of Learning with an Oracle.",
                    "A Mechanical Method of Successful Scientific Inquiry.",
                    "Boosting a Weak Learning Algorithm by Majority.",
                    "On the Sample Complexity of Weak Learning.",
                    "Learning by Distances.",
                    "The Learnability of Formal Concepts.",
                    "Polynomial Time Algorithms for Learning Neural Nets.",
                    "Composite Geometric Concepts and Polynomial Predictability.",
                    "Learning Integer Lattices.",
                    "On the Number of Examples and Stages Needed for Learning Decision Trees.",
                    "Learning DNF Under the Uniform Distribution in Quasi-Polynomial Time.",
                    "Learning Via Queries With Teams and Anomilies.",
                    "Learning Via Queries in [+, <].",
                    "On the Sample Complexity of Finding Good Search Strategies.",
                    "Inferring Graphs from Walks.",
                    "Aggregating Strategies.",
                    "Learning Conjunctions of Horn Clauses (Abstract).",
                    "Exact Identification of Circuits Using Fixed Points of Amplification Functions (Abstract).",
                    "Efficient Distribution-Free Learning of Probabilistic Concepts (Abstract).",
                    "On Threshold Circuits for Parity (Abstract).",
                    "On the Complexity of Learning from Counterexamples and Membership Queries (abstract).",
                    "Robust Separations in Inductive Inference (Abstract).",
                    "Separating PAC and Mistake-Bound Learning Models Over the Boolean Domain (Abstract)."
                ]
            }
        ]
    },
    {
        "year": "1989",
        "name": "2nd COLT 1989",
        "info": "Santa Cruz, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/colt/1989",
                "sub_name": "Proceedings of the Second Annual Workshop on Computational Learning Theory, COLT 1989, Santa Cruz, CA, USA, July 31 - August 2, 1989.",
                "count": 26,
                "papers": [
                    "Inductive Principles of the Search for Empirical Dependences (Methods Based on Weak Convergence of Probability Measures).",
                    "Polynomial Learnability of Semilinear Sets.",
                    "Learning Nested Differences of Intersection-Closed Concept Classes.",
                    "A Polynomial-Time Algorithm for Learning k-Variable Pattern Languages from Examples.",
                    "On Learning from Exercises.",
                    "On Approximate Truth.",
                    "Informed Parsimonious Inference of Prototypical Genetic Sequences.",
                    "Complexity Issues in Learning by Neural Nets.",
                    "Equivalence Queries and Approximate Fingerprints.",
                    "Learning Read-Once Formulas Using Membership Queries.",
                    "Learning Simple Deterministic Languages.",
                    "Learning in the Presence of Inaccurate Information.",
                    "Convergence to Nearly Minimal Size Grammars by Vacillating Learning Machines.",
                    "Inductive Inference with Bounded Number of Mind Changes.",
                    "Learning via Queries to an Oracle.",
                    "Learning Structure from Data: A Survey.",
                    "A Statistical Approach to Learning and Generalization in Layered Neural Networks.",
                    "The Light Bulb Problem.",
                    "From On-Line to Batch Learning.",
                    "A Parametrization Scheme for Classifying Models of Learnability.",
                    "On the Role of Search for Learning.",
                    "Elementary Formal System as a Unifying Framework for Language Learning.",
                    "Identification of Unions of Languages Drawn from an Identifiable Class.",
                    "Induction from the General to the More General.",
                    "Space-Bounded Learning and the Vapnik-Chervonenkis Dimension.",
                    "Reliable and Useful Learning."
                ]
            }
        ]
    },
    {
        "year": "1988",
        "name": "1st COLT 1988",
        "info": "MIT, MA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/colt/1988",
                "sub_name": "Proceedings of the First Annual Workshop on Computational Learning Theory, COLT '88, Cambridge, MA, USA, August 3-5, 1988.",
                "count": 31,
                "papers": [
                    "Learning in Neural Networks.",
                    "Training a 3-Node Neural Network is NP-Complete.",
                    "Learning in Threshold Networks.",
                    "Functionality in Neural Nets.",
                    "Equivalence of Models for Polynomial Learnability.",
                    "Results on Learnability and the Vapnick-Chervonenkis Dimension.",
                    "Learning Complicated Concepts Reliably and Usefully.",
                    "Learnability by Fixed Distributions.",
                    "Types of Noise in Data for Concept Learning.",
                    "Learning k-DNF with Noise in the Attributes.",
                    "Learning in Parallel.",
                    "Some Remarks About Space-Complexity of Learning, and Circuit Complexity of Recognizing.",
                    "A General Lower Bound on the Number of Examples Needed for Learning.",
                    "Non-Learnable Classes of Boolean Formulae That Are Closer Under Variable Permutation.",
                    "Learning With Hints.",
                    "Learning Decision Trees from Random Examples.",
                    "The Power of Vacillation.",
                    "Prudence in Language Learning.",
                    "Transformation of Probabilistic Learning Strategies into Deterministic Learning Strategies.",
                    "Learning via Queries.",
                    "Learning Programs with an Easy to Calculate Set of Errors.",
                    "Inductive Inference: An Abstract Approach.",
                    "Learning Theories in a Subset of a Polyadic Logic.",
                    "Predicting {0, 1}-Functions on Randomly Drawn Points.",
                    "Efficient Unsupervised Learning.",
                    "Learning Probabilistic Prediction Functions.",
                    "Learning Context-Free Grammars from Structural Data in Polynomial Time.",
                    "Learning Pattern Languages from a Single Initial Example and from Queries.",
                    "On the Learnability of Finite Automata.",
                    "Learning Regular Languages From Counterexamples.",
                    "Learning Automata from Ordered Examples."
                ]
            }
        ]
    }
]