[
    {
        "name": "Computational Linguistics",
        "year": "2021",
        "info": "Volume 47, 2021",
        "count": 29,
        "papers": [
            "Kathy McKeown Interviews Bonnie Webber.",
            "Formal Basis of a Language Universal.",
            "Comparing Knowledge-Intensive and Data-Intensive Models for English Resource Semantic Parsing.",
            "Semantic Data Set Construction from Human Clustering and Spatial Arrangement.",
            "Interpretability Analysis for Named Entity Recognition to Understand System Predictions and How They Can Improve.",
            "Supervised and Unsupervised Neural Approaches to Text Readability.",
            "Depth-Bounded Statistical PCFG Induction as a Model of Human Grammar Acquisition.",
            "Python for Linguists.",
            "Approximating Probabilistic Models as Weighted Finite Automata.",
            "Universal Dependencies.",
            "RYANSQL: Recursively Applying Sketch-based Slot Fillings for Complex Text-to-SQL in Cross-Domain Databases.",
            "CausaLM: Causal Model Explanation Through Counterfactual Language Models.",
            "Analysis and Evaluation of Language Models for Word Sense Disambiguation.",
            "Universal Discourse Representation Structure Parsing.",
            "The Taxonomy of Writing Systems: How to Measure How Logographic a System Is.",
            "Syntax Role for Neural Semantic Role Labeling.",
            "Generalizing Cross-Document Event Coreference Resolution Across Multiple Corpora.",
            "Toward Gender-Inclusive Coreference Resolution: An Analysis of Gender and Bias Throughout the Machine Learning Lifecycle.",
            "Decoding Word Embeddings with Brain-Based Semantic Features.",
            "Embeddings in Natural Language Processing: Theory and Advances in Vector Representations of Meaning.",
            "Understanding Dialogue: Language Use and Social Interaction.",
            "Natural Language Processing and Computational Linguistics.",
            "Detecting Local Insights from Global Labels: Supervised and Zero-Shot Sequence Labeling via a Convolutional Decomposition.",
            "Variational Deep Logic Network for Joint Inference of Entities and Relations.",
            "Abstractive Text Summarization: Enhancing Sequence-to-Sequence Models Using Word Sense Disambiguation and Semantic Content Generalization.",
            "The (Un)Suitability of Automatic Evaluation Metrics for Text Simplification.",
            "Sequence-Level Training for Non-Autoregressive Neural Machine Translation.",
            "Are Ellipses Important for Machine Translation?",
            "LFG Generation from Acyclic F-Structures is NP-Hard."
        ]
    },
    {
        "name": "Computational Linguistics",
        "year": "2020",
        "info": "Volume 46, 2020",
        "count": 26,
        "papers": [
            "On the Linguistic Representational Power of Neural Machine Translation Models.",
            "The Design and Implementation of XiaoIce, an Empathetic Social Chatbot.",
            "An Empirical Study on Crosslingual Transfer in Probabilistic Topic Models.",
            "Data-Driven Sentence Simplification: Survey and Benchmark.",
            "Corpora Annotated with Negation: An Overview.",
            "Cross-Lingual Word Embeddings.",
            "Multilingual and Interlingual Semantic Representations for Natural Language Processing: A Brief Introduction.",
            "Unsupervised Word Translation with Adversarial Autoencoder.",
            "LessLex: Linking Multilingual Embeddings to SenSe Representations of LEXical Items.",
            "LINSPECTOR: Multilingual Probing Tasks for Word Representations.",
            "A Systematic Study of Inner-Attention-Based Sentence Representations in Multilingual Neural Machine Translation.",
            "Abstract Syntax as Interlingua: Scaling Up the Grammatical Framework from Controlled Languages to Robust Pipelines.",
            "Fair Is Better than Sensational: Man Is to Doctor as Woman Is to Doctor.",
            "The Limitations of Stylometry for Detecting Machine-Generated Fake News.",
            "Linguistic Fundamentals for Natural Language Processing II: 100 Essentials from Semantics and Pragmatics.",
            "Tractable Lexical-Functional Grammar.",
            "Semantic Drift in Multilingual Representations.",
            "Sentence Meaning Representations Across Languages: What Can We Learn from Existing Frameworks?",
            "Predicting In-Game Actions from Interviews of NBA Players.",
            "Sparse Transcription.",
            "Efficient Outside Computation.",
            "What Should/Do/Can LSTMs Learn When Parsing Auxiliary Verb Constructions?",
            "A Graph-Based Framework for Structured Prediction Tasks in Sanskrit.",
            "Multi-SimLex: A Large-Scale Evaluation of Multilingual and Crosslingual Lexical Semantic Similarity.",
            "Deep Learning Approaches to Text Production.",
            "Statistical Significance Testing for Natural Language Processing."
        ]
    },
    {
        "name": "Computational Linguistics",
        "year": "2019",
        "info": "Volume 45, 2019",
        "count": 26,
        "papers": [
            "Unsupervised Compositionality Prediction of Nominal Compounds.",
            "Learning an Executable Neural Semantic Parser.",
            "Parsing Chinese Sentences with Grammatical Relations.",
            "Automatic Inference of Sound Correspondence Patterns across Multiple Languages.",
            "A Sequential Matching Framework for Multi-Turn Response Selection in Retrieval-Based Chatbots.",
            "Bayesian Learning of Latent Representations of Language Structures.",
            "Novel Event Detection and Classification for Historical Texts.",
            "Incorporating Source-Side Phrase Structures into Neural Machine Translation.",
            "Neural Models of Text Normalization for Speech Applications.",
            "Ordered Tree Decomposition for HRG Rule Extraction.",
            "What Do Language Representations Really Represent?",
            "Quality Estimation for Machine Translation.",
            "Contextualized Translations of Phrasal Verbs with Distributional Compositional Semantics and Monolingual Corpora.",
            "Watset.",
            "Evaluating Computational Language Models with Scaling Properties of Natural Language.",
            "Taking MT Evaluation Metrics to Extremes: Beyond Correlation with Human Judgments.",
            "Modeling Language Variation and Universals: A Survey on Typological Linguistics for Natural Language Processing.",
            "Argumentation Mining.",
            "Computational Psycholinguistics.",
            "Discourse in Multimedia: A Case Study in Extracting Geometry Knowledge from Textbooks.",
            "Automatic Identification and Production of Related Words for Historical Linguistics.",
            "Syntactically Meaningful and Transferable Recursive Neural Networks for Aspect and Opinion Extraction.",
            "Scalable Micro-planned Generation of Discourse from Structured Data.",
            "Argument Mining: A Survey.",
            "Negation and Speculation Detection.",
            "How to Distinguish Languages and Dialects."
        ]
    },
    {
        "name": "Computational Linguistics",
        "year": "2018",
        "info": "Volume 44, 2018",
        "count": 34,
        "papers": [
            "Smart Enough to Talk With Us? Foundations and Challenges for Dialogue Capable AI Systems.",
            "On the Derivational Entropy of Left-to-Right Probabilistic Finite-State Automata and Hidden Markov Models.",
            "A Notion of Semantic Coherence for Underspecified Semantic Representation.",
            "Cache Transition Systems for Graph Parsing.",
            "Weighted DAG Automata for Semantic Graphs.",
            "Bayesian Analysis in Natural Language Processing Shay Cohen (University of Edinburgh)Morgan & Claypool (Synthesis Lectures on Human Language Technologies, edited by Graeme Hirst, volume 35), 2016, xxvii+246 pp; paperback, ISBN 9781627058735, $85.00; ebook, ISBN 9781627054218, $68.00; doi: 10.2200/S00719ED1V01Y201605HLT035.",
            "Metaphor: A Computational Perspective Tony Veale, Ekaterina Shutova, and Beata Beigman Klebanov (University College Dublin, University of Cambridge, Educational Testing Service)Morgan & Claypool (Synthesis Lectures on Human Language Technologies, edited by Graeme Hirst, volume 31), 2016, xi+148 pp; paperback, ISBN 9781627058506, $55.00; ebook, ISBN 9781627058513; doi: 10.2200/S00694ED1V01Y201601HLT031.",
            "Neural Network Methods for Natural Language Processing Yoav Goldberg (Bar Ilan University)Morgan & Claypool (Synthesis Lectures on Human Language Technologies, edited by Graeme Hirst, volume 37), 2017, xxii+287 pp; paperback, ISBN 9781627052986, $74.95; ebook, ISBN 9781627052955, $59.96; doi: 10.2200/S00762ED1V01Y201703HLT037.",
            "A Dependency Perspective on RST Discourse Parsing and Evaluation.",
            "Unrestricted Bridging Resolution.",
            "Spurious Ambiguity and Focalization.",
            "The Influence of Context on the Learning of Metrical Stress Systems Using Finite-State Machines.",
            "Tree Structured Dirichlet Processes for Hierarchical Morphological Segmentation.",
            "Domain-Sensitive Temporal Tagging By Jannik Strötgen, Michael Gertz (Max Planck Institute for Informatics, Heidelberg University) Morgan & Claypool (Synthesis Lectures on Human Language Technologies, edited by Graeme Hirst, volume 36), 2016, xvii+133 pp; paperback, ISBN 978-1-62705-495-1; ebook, ISBN 978-1-62705-499-7; doi: 10.2200/S00721ED1V01Y201606HLT036, $55.00.",
            "Festina Lente: A Farewell from the Editor.",
            "Aravind K. Joshi.",
            "A Structured Review of the Validity of BLEU.",
            "Native Language Identification With Classifier Stacking and Ensembles.",
            "On the Complexity of CCG Parsing.",
            "Using Semantics for Granularities of Tokenization.",
            "Feature-Based Decipherment for Machine Translation.",
            "Anaphora With Non-nominal Antecedents in Computational Linguistics: a Survey.",
            "The Lost Combinator.",
            "The Language Resource Switchboard.",
            "Reproducibility in Computational Linguistics: Are We Willing to Share?",
            "What Can Be Accomplished with the State of the Art in Information Extraction? A Personal View.",
            "Automatic Text Simplification Horacio Saggion (Universitat Pompeu Fabra) Morgan & Claypool (Synthesis Lectures on Human Language Technologies, edited by Graeme Hirst, volume 37), 2017, xvi+121 pp; paperback, ISBN 978-1-62705-868-1; hardcover, ISBN 978-1-68173-214-5, $69.95; ebook, ISBN 978-1-62705-869-8, $39.96; doi: 10.2200/S00700ED1V01Y201602HLT032.",
            "Introduction to the Special Issue on Language in Social Media: Exploiting Discourse and Other Contextual Information.",
            "Interactional Stancetaking in Online Forums.",
            "A Joint Model of Conversational Discourse and Latent Topics on Microblogs.",
            "Sarcasm Analysis Using Conversation Context.",
            "We Usually Don't Like Going to the Dentist: Using Common Sense to Detect Irony on Twitter.",
            "Combining Deep Learning and Argumentative Reasoning for the Analysis of Social Media Textual Content Using Small Data Sets.",
            "Modeling Speech Acts in Asynchronous Conversations: A Neural-CRF Approach."
        ]
    },
    {
        "name": "Computational Linguistics",
        "year": "2017",
        "info": "Volume 43, 2017",
        "count": 28,
        "papers": [
            "A Statistical, Grammar-Based Approach to Microplanning.",
            "A Game-Theoretic Approach to Word Sense Disambiguation.",
            "Multilingual Metaphor Processing: Experiments with Semi-Supervised and Unsupervised Learning.",
            "Argumentation Mining in User-Generated Web Discourse.",
            "Hashtag Sense Clustering Based on Temporal Similarity.",
            "Evaluative Language Beyond Bags of Words: Linguistic Insights and Computational Applications.",
            "Biomedical Natural Language Processing.",
            "Automatic Detection of Verbal Deception.",
            "A Comprehensive Analysis of Bilingual Lexicon Induction.",
            "Greedy Transition-Based Dependency Parsing with Stack LSTMs.",
            "Statistical Models for Unsupervised, Semi-Supervised, and Supervised Transliteration Mining.",
            "Identifying and Avoiding Confusion in Dialogue with People with Alzheimer's Disease.",
            "Framing QA as Building and Ranking Intersentence Answer Justifications.",
            "Effects of Cognitive Effort on the Resolution of Overspecified Descriptions.",
            "Linked Lexical Knowledge Bases Foundations and Applications.",
            "Hybrid Grammars for Parsing of Discontinuous Phrase Structures and Non-Projective Dependency Structures.",
            "Translation Divergences in Chinese-English Machine Translation: An Empirical Investigation.",
            "A Kernel Independence Test for Geographical Language Variation.",
            "AutoExtend: Combining Word Embeddings with Semantic Resources.",
            "Parsing Argumentation Structures in Persuasive Essays.",
            "The Agreement Measure γcat a Complement to γ Focused on Categorization of a Continuum.",
            "Discourse Structure in Machine Translation Evaluation.",
            "Adapting to Learner Errors with Minimal Supervision.",
            "Representation of Linguistic Form and Function in Recurrent Neural Networks.",
            "HyperLex: A Large-Scale Evaluation of Graded Lexical Entailment.",
            "Multiword Expression Processing: A Survey.",
            "Syntax-Based Statistical Machine Translation Philip Williams, Rico Sennrich, Matt Post, Philipp Koehn (University of Edinburgh, University of Edinburgh, Johns Hopkins University, Johns Hopkins University), edited by Graeme Hirst, volume 33), 2016, xvii+190 pp; paperback, ISBN 978-1-62705-900-8; ebook, ISBN 978-1-62705-502-4; doi: 10.2200/S00716ED1V04Y201604HLT033, $70.",
            "Sharing Is Caring: The Future of Shared Tasks."
        ]
    },
    {
        "name": "Computational Linguistics",
        "year": "2016",
        "info": "Volume 42, 2016",
        "count": 31,
        "papers": [
            "Optimization for Statistical Machine Translation: A Survey.",
            "Integrating Selectional Constraints and Subcategorization Frames in a Dependency Parser.",
            "A Comparative Study of Minimally Supervised Morphological Segmentation.",
            "Online Learning for Statistical Machine Translation.",
            "A Survey of Word Reordering in Statistical Machine Translation: Computational Models and Language Phenomena.",
            "Synchronous Context-Free Grammars and Optimal Parsing Strategies.",
            "Word Sense Clustering and Clusterability.",
            "Source Language Adaptation Approaches for Resource-Poor Machine Translation.",
            "Mining Parallel Corpora from Sina Weibo and Twitter.",
            "When the Whole Is Less Than the Sum of Its Parts: How Composition Affects PMI Values in Distributional Semantic Vectors.",
            "In Memoriam: Susan Armstrong.",
            "Transition-Based Parsing for Deep Dependency Structures.",
            "Towards Accurate and Efficient Chinese Part-of-Speech Tagging.",
            "Parsing Linear Context-Free Rewriting Systems with Fast Matrix Multiplication.",
            "All Mixed Up? Finding the Optimal Feature Set for General Readability Prediction and Its Application to English and Dutch.",
            "String Kernels for Native Language Identification: Insights from Behind the Curtains.",
            "Expressive Power of Abstract Meaning Representations.",
            "Computational Sociolinguistics: A Survey.",
            "Sentiment Analysis: Mining Opinions, Sentiments, and Emotions.",
            "Linguistics: The Garden and the Bush.",
            "Formal Distributional Semantics: Introduction to the Special Issue.",
            "There Is No Logical Negation Here, But There Are Alternatives: Modeling Conversational Negation with Distributional Semantics.",
            "RELPRON: A Relative Clause Evaluation Data Set for Compositional Distributional Semantics.",
            "Integrating Type Theory and Distributional Semantics: A Case Study on Adjective-Noun Compositions.",
            "Aligning Packed Dependency Trees: A Theory of Composition for Distributional Semantics.",
            "Representing Meaning with a Combination of Logical and Distributional Models.",
            "Restricted Non-Projectivity: Coverage vs. Efficiency.",
            "Towards a Catalogue of Linguistic Graph Banks.",
            "Semantic Similarity from Natural Language and Ontology Analysis.",
            "Natural Language Processing for Social Media.",
            "Elements of Formal Semantics: An Introduction to the Mathematical Theory of Meaning in Natural Language."
        ]
    },
    {
        "name": "Computational Linguistics",
        "year": "2015",
        "info": "Volume 41, 2015",
        "count": 33,
        "papers": [
            "Towards Topic-to-Question Generation.",
            "Cross-lingual Sentiment Lexicon Learning With Bilingual Word Graph Label Propagation.",
            "Multiple Adjunction in Feature-Based Tree-Adjoining Grammar.",
            "Concrete Models and Empirical Evaluations for the Categorical Compositional Distributional Model of Meaning.",
            "Automatic Adaptation of Annotations.",
            "Automated Grammatical Error Detection for Language Learners, Second Edition Claudia Leacock1, Martin Chodorow2, Michael Gamon3, and Joel Tetreault4 (1CTB McGraw-Hill; 2Hunter College and the Graduate Center, City University of New York; 3Microsoft Research; 4Yahoo! Labs) Morgan & Claypool (Synthesis Lectures on Human Language Technologies, edited by Graeme Hirst, volume 25), 2014, xv+154pp; paperbound, ISBN 978-1-62705-013-5.",
            "Linguistic Fundamentals for Natural Language Processing: 100 Essentials from Morphology and Syntax Emily M. Bender (University of Washington) Morgan & Claypool (Synthesis Lectures on Human Language Technologies, edited by Graeme Hirst, volume 20), 2013, xvii+166 pp; paperbound, ISBN 978-1-62705-011-1, $40.00; e-book, ISBN 978-1-62705-012-8, $30.00 or by subscription.",
            "Recognizing Textual Entailment: Models and Applications Ido Dagan1, Dan Roth2, Mark Sammons2, and Fabio Massimo Zanzotto3 (1Bar-Ilan University, Israel, 2University of Illinois, Urbana, IL, and 3University of Rome \"Tor Vergata, \" Italy) Morgan & Claypool (Synthesis Lectures on Human Language Technologies, edited by Graeme Hirst, volume 23), 2013, xx+200 pp; paperbound, ISBN 978-1-59829-834-5; e-book, ISBN 978-1-59829-835-2.",
            "Web Corpus Construction Roland Schäfer and Felix Bildhauer (Freie Universität Berlin) Morgan & Claypool (Synthesis Lectures on Human Language Technologies, edited by Graeme Hirst, volume 22), 2013, 145 pages, paper-bound, ISBN 9781608459834, doi: 10.2200/S00508ED1V01Y201305HLT022.",
            "When the Whole Is Not Greater Than the Combination of Its Parts: A \"Decompositional\" Look at Compositional Distributional Semantics.",
            "Spelling Error Patterns in Brazilian Portuguese.",
            "The Operation Sequence Model - Combining N-Gram-Based and Phrase-Based Statistical Machine Translation.",
            "Lexicalization and Generative Power in CCG.",
            "Efficient Global Learning of Entailment Graphs.",
            "A Statistical Parsing Framework for Sentiment Classification.",
            "Evaluating Human Pairwise Preference Judgments.",
            "Ontology-Based Interpretation of Natural Language Philipp Cimiano, Christina Unger, and John McCrae (University of Arminia Bielefeld, Germany) Morgan & Claypool, Synthesis Lectures on Human Language Technologies, March 2014, 178 pages, (doi: 10.2200/S00561ED1V01Y201401HLT024) , $45.00.",
            "Robots that Talk and Listen Judith A. Markowitz (editor) (President of J. Markowitz, Consultants, Chicago, IL) Berlin/Boston/Munich: Walter de Gruyter, 2015, hardbound, ISBN 978-1-61451-603-3; PDF, e-ISBN 978-1-61451-440-4 EPUB; e-ISBN 978-1-61451-915-7.",
            "Large Linguistic Corpus Reduction with SCP Algorithms.",
            "CODRA: A Novel Discriminative Framework for Rhetorical Analysis.",
            "The Unified and Holistic Method Gamma (γ) for Inter-Annotator Agreement Measure and Alignment.",
            "Computational Constancy Measures of Texts - Yule's K and Rényi's Entropy.",
            "Discriminative Syntax-Based Word Ordering for Text Generation.",
            "Evaluation Methods for Statistically Dependent Text.",
            "Graph-Based Word Alignment for Clinical Language Evaluation.",
            "Design and Evaluation of Metaphor Processing Systems.",
            "Inducing Implicit Arguments from Comparable Texts: A Framework and Its Applications.",
            "SimLex-999: Evaluating Semantic Models With (Genuine) Similarity Estimation.",
            "Language Processing with Perl and Prolog: Theories, Implemetation, and Application Pierre M. Nugues (Lund University, Sweden) Springer (Cognitive technologies series, edited by A. Bundy et. al), 2014, Second Edition, xxv+662 pp; hardcover, ISBN 978-3-642-41463-3 $89.99; ebook, ISBN 978-3-642-41464-0, $69.99; doi 10.1007/978-3-642-41464-0.",
            "Computational Linguistics and Deep Learning.",
            "Translating Today into Tomorrow.",
            "Adam Kilgarriff.",
            "Jane J. Robinson."
        ]
    },
    {
        "name": "Computational Linguistics",
        "year": "2014",
        "info": "Volume 40, 2014",
        "count": 35,
        "papers": [
            "Ivan A. Sag.",
            "Frame-Semantic Parsing.",
            "Random Walks for Knowledge-Based Word Sense Disambiguation.",
            "Learning Representations for Weakly Supervised Natural Language Processing Tasks.",
            "A Survey and Classification of Controlled Natural Languages.",
            "Arabic Dialect Identification.",
            "Sampling Tree Fragments from Forests.",
            "Natural Language Processing for Historical Texts Michael Piotrowski (Leibniz Institute of European History) Morgan & Claypool (Synthesis Lectures on Human Language Technologies, edited by Graeme Hirst, volume 17), 2012, ix+157 pp; paperbound, ISBN 978-1608459469.",
            "On the Problem of Theoretical Terms in Empirical Computational Linguistics.",
            "Constrained Arc-Eager Dependency Parsing.",
            "Arc-Eager Parsing with the Tree Constraint.",
            "Authorship Attribution with Topic Models.",
            "Unsupervised Event Coreference Resolution.",
            "Phrase Dependency Machine Translation with Quasi-Synchronous Tree-to-Tree Features.",
            "Practical Linguistic Steganography using Contextual Synonym Substitution and a Novel Vertex Coding Method.",
            "Identification of Multiword Expressions by Combining Multiple Linguistic Information Sources.",
            "A Survey of Arabic Named Entity Recognition and Classification.",
            "Sentiment Analysis and Opinion Mining Bing Liu (University of Illinois at Chicago) Morgan & Claypool (Synthesis Lectures on Human Language Technologies, edited by Graeme Hirst, 5(1)), 2012, 167 pp; paperbound, ISBN 978-1-60845-884-4.",
            "Semantic Relations Between Nominals Vivi Nastase1, Preslav Nakov2, Diarmuid Ó Séaghdha3, and Stan Szpakowicz4 (1FBK, Trento; 2QCRI, Qatar Foundation; 3University of Cambridge; 4University of Ottawa) Morgan & Claypool (Synthesis Lectures on Human Language Technologies, edited by Graeme Hirst, volume 19), 2013, xvii+124 pp; paperbound, ISBN 978-1-60845-979-7, $40.00; e-book, ISBN 978-1-60845-980-3, $30.00 or by subscription.",
            "Semi-Supervised Learning and Domain Adaptation in Natural Language Processing Anders Søgaard University of Copenhagen Morgan & Claypool (Synthesis Lectures on Human Language Technologies, edited by Graeme Hirst, volume 21), 2013, x+93 pp; paperbound, ISBN 978-1-60845-985-8, $40.00; e-book, ISBN 978-1-60845-986-5, $30.00 or by subscription.",
            "Automatic Selection of HPSG-Parsed Sentences for Treebank Construction.",
            "On the Universal Generation Problem for Unification Grammars.",
            "A Random Walk-Based Model for Identifying Semantic Orientation.",
            "Feature-Frequency-Adaptive On-line Training for Fast and Accurate Natural Language Processing.",
            "Probabilistic Distributional Semantics with Latent Variable Models.",
            "Similarity-Driven Semantic Role Induction via Graph Partitioning.",
            "Improved Estimation of Entropy for Evaluation of Word Sense Induction.",
            "Pushdown Automata in Statistical Machine Translation.",
            "Charles J. Fillmore.",
            "Applications of Lexicographic Semirings to Problems in Speech and Language Processing.",
            "Stochastic Language Generation in Dialogue using Factored Language Models.",
            "Latent Trees for Coreference Resolution.",
            "A Large-Scale Pseudoword-Based Evaluation Framework for State-of-the-Art Word Sense Disambiguation.",
            "Adaptive Generation in Dialogue Systems Using Dynamic User Modeling.",
            "Reflections on the Penn Discourse TreeBank, Comparable Corpora, and Complementary Annotation."
        ]
    },
    {
        "name": "Computational Linguistics",
        "year": "2013",
        "info": "Volume 39, 2013",
        "count": 35,
        "papers": [
            "George A. Miller.",
            "Going to the Roots of Dependency Parsing.",
            "Parsing Morphologically Rich Languages: Introduction to the Special Issue.",
            "Morphological and Syntactic Case in Statistical Dependency Parsing.",
            "Knowledge Sources for Constituent Parsing of German, a Morphologically Rich and Less-Configurational Language.",
            "Data-Driven Parsing using Probabilistic Linear Context-Free Rewriting Systems.",
            "Word Segmentation, Unknown-word Resolution, and Morphological Agreement in a Hebrew Parsing System.",
            "Dependency Parsing of Modern Standard Arabic with Lexical and Inflectional Features.",
            "Parsing Models for Identifying Multiword Expressions.",
            "A Joint Model to Identify and Align Bilingual Named Entities.",
            "Automatically Assessing Machine Summary Content Without a Gold Standard.",
            "Statistical Metaphor Processing.",
            "Mildly Non-Projective Dependency Grammar.",
            "Learning Dependency-Based Compositional Semantics.",
            "Design Patterns in Fluid Construction Grammar Luc Steels (editor) Universitat Pompeu Fabra and Sony Computer Science Laboratory, Paris Amsterdam: John Benjamins Publishing Company (Constructional Approaches to Language series, edited by Mirjam Fried and Jan-Ola Östman, volume 11), 2012, xi+332 pp; hardbound, ISBN 978-90-272-0433-2, €99.00, $149.00.",
            "Interpreting Motion: Grounded Representations for Spatial Language Inderjeet Mani* and James Pustejovsky‡ (*Children's Organization of Southeast Asia and ‡Brandeis University) Oxford University Press (Explorations in Language and Space series, edited by Emile Van Der Zee), 2012, xiii+166 pp; hardbound, ISBN 978-0-19-960124-0, £60.00.",
            "What Is a Paraphrase?",
            "Relational Features in Fine-Grained Opinion Analysis.",
            "Measuring Word Meaning in Context.",
            "Computing Lexical Contrast.",
            "XMG: eXtensible MetaGrammar.",
            "Selectional Preferences for Semantic Role Classification.",
            "OntoLearn Reloaded: A Graph-Based Algorithm for Taxonomy Induction.",
            "Clustering and Diversifying Web Search Results with Graph-Based Word Sense Induction.",
            "Text Representations for Patent Classification.",
            "Language and Computers - Markus Dickinson*, Chris Brew‡, and Detmar Meurers¶ (*Indiana University, ‡Educational Testing Service, and ¶University of Tübingen) Wiley-Blackwell, 2013, xviii+232 pp; paperbound, ISBN 978-1-4051-8305-5, $34.95; hardbound, ISBN 978-4051-8306-2, $87.95; e-book, ISBN 978-1-1183-2316-8, $22.99.",
            "Influences and Inferences.",
            "Divisible Transition Systems and Multiplanar Dependency Parsing.",
            "A Constraint-Based Hypergraph Partitioning Approach to Coreference Resolution.",
            "Deterministic Coreference Resolution Based on Entity-Centric, Precision-Ranked Rules.",
            "Plagiarism Meets Paraphrasing: Insights for the Next Generation in Automatic Plagiarism Detection.",
            "Multilingual Joint Parsing of Syntactic and Semantic Dependencies with a Latent Variable Model.",
            "Improving Statistical Machine Translation by Adapting Translation Models to Translationese.",
            "Incremental, Predictive Parsing with Psycholinguistically Motivated Tree-Adjoining Grammar.",
            "Generation of Compound Words in Statistical Machine Translation into Compounding Languages."
        ]
    },
    {
        "name": "Computational Linguistics",
        "year": "2012",
        "info": "Volume 38, 2012",
        "count": 36,
        "papers": [
            "Affirmative Cue Words in Task-Oriented Dialogue.",
            "A Context-Theoretic Framework for Compositionality in Distributional Semantics.",
            "Learning Entailment Relations by Global Graph Structure Optimization.",
            "Generating Numerical Approximations.",
            "Semi-Supervised Semantic Role Labeling via Structural Alignment.",
            "Computational Generation of Referring Expressions: A Survey.",
            "Graph-Based Natural Language Processing and Information Retrieval Rada Mihalcea and Dragomir Radev (University of North Texas and University of Michigan) Cambridge, UK: Cambridge University Press, 2011, viii+192 pp; hardbound, ISBN 978-0-521-89613-9, $65.00.",
            "Modality and Negation: An Introduction to the Special Issue.",
            "Are You Sure That This Happened? Assessing the Factuality Degree of Events in Text.",
            "Did It Happen? The Pragmatic Complexity of Veridicality Assessment.",
            "Cross-Genre and Cross-Domain Detection of Semantic Uncertainty.",
            "Speculation and Negation: Rules, Rankers, and the Role of Syntax.",
            "Modality and Negation in SIMT Use of Modality and Negation in Semantically-Informed Syntactic MT.",
            "Bitext Alignment Jörg Tiedemann (Uppsala University) Morgan & Claypool (Synthesis Lectures on Human Language Technologies, edited by Graeme Hirst, volume 14), 2011, 153 pp; paperbound, ISBN 978-1-60845-510-2, $45.00; e-book, ISBN 978-1-60815-511-9, $30.00 or by subscription.",
            "Unification Grammars Nissim Francez* and Shuly Wintner‡ (*Technion-Israel Institute of Technology and ‡University of Haifa) Cambridge University Press, 2012, xii+312 pp; hardbound, ISBN 978-1-107-01417-6, $95.00.",
            "The Structure of Scientific Articles: Applications to Citation Indexing and Summarization Simone Teufel (University of Cambridge) Stanford, CA: CSLI Publications (CSLI Studies in Computational Linguistics), 2010, xii+518 pp; hardbound, ISBN 978-1-57586-555-3, $70.00; paperbound, ISBN 978-1-57586-556-0, $32.50.",
            "Computational Semantics with Functional Programming Jan van Eijck* and Christina Unger‡ (*CWI, Amsterdam and Utrecht University; ‡University of Bielefeld) Cambridge: Cambridge University Press, 2010, xv+405 pp; hardbound, ISBN 978-0-521-76030-0, $99.00; paperbound, ISBN 978-0-521-75760-7, $40.00.",
            "Interactive Multi-Modal Question-Answering Antal van den Bosch* and Gosse Bouma‡ (editors) (*Tilburg University and ‡University of Groningen) Berlin: Springer (Theory and Applications of Natural Language Processing series, edited by Eduard Hovy), 2011, xii+279 pp; hardbound, ISBN 978-3-642-17524-4, $124.00; e-book, ISBN 978-3-642-17525-1; paperbound, $24.95 or €24.95 to members of subscribing institutions.",
            "Linguistic Structure Prediction Noah A. Smith Carnegie Mellon University Morgan & Claypool (Synthesis Lectures on Human Language Technologies, edited by Graeme Hirst, volume 13), 2011, xx+248 pp; paperbound, ISBN 978-1-60845-405-1, $60.00; ebook, ISBN 978-1-60845-406-8, $30.00 or by subscription.",
            "Victor H. Yngve.",
            "Fruit Carts: A Domain and Corpus for Research in Dialogue Systems and Psycholinguistics.",
            "Empirical Risk Minimization for Probabilistic Grammars: Sample Complexity and Hardness of Learning.",
            "Summarizing Information Graphics Textually.",
            "Modeling Regular Polysemy: A Study on the Semantic Classification of Catalan Adjectives.",
            "Tree-Adjoining Grammars Are Not Closed Under Strong Lexicalization.",
            "A Scalable Distributed Syntactic, Semantic, and Lexical Language Model.",
            "On the String Translations Produced by Multi Bottom-Up Tree Transducers.",
            "Quantitative Syntax Analysis Reinhard Köhler (Trier University) Berlin and Boston: De Gruyter Mouton (Quantitative Linguistics series, edited by Reinhard Köhler, Gabriel Altmann, and Peter Grzybek, volume 65), 2012, x+224 pp, hardbound, ISBN 978-3-11-027219-2, €99.95, $140.00.",
            "Encounters with Language.",
            "Finite-State Chart Constraints for Reduced Complexity Context-Free Parsing Pipelines.",
            "Semantic Role Labeling of Implicit Arguments for Nominal Predicates.",
            "Language Models for Machine Translation: Original vs. Translated Texts.",
            "Empirical Methods for the Study of Denotation in Nominalizations in Spanish.",
            "LFG Generation by Grammar Specialization.",
            "Discourse Processing Manfred Stede University of Potsdam Morgan & Claypool (Synthesis Lectures on Human Language Technologies, edited by Graeme Hirst, volume 15), 2011, ix+155 pp; paperbound, ISBN 978-1-60845-734-2, $40.00; ebook, ISBN 978-1-60845-735-9, $30.00 or by subscription.",
            "discourse.cpp O.S. le Si (edited by Aurélie Herbelot) University of Cambridge Berlin: Peer Press, 2011, 55 pp; paperbound, ISBN 978-3-00-33516-7, €9.00, or free on-line at peerpress.de/discoursecpp.pdf."
        ]
    },
    {
        "name": "Computational Linguistics",
        "year": "2011",
        "info": "Volume 37, 2011",
        "count": 43,
        "papers": [
            "Nouveau-ROUGE: A Novelty Metric for Update Summarization.",
            "Opinion Word Expansion and Target Extraction through Double Propagation.",
            "Towards Modular Development of Typed Unification Grammars.",
            "An Investigation of Interruptions and Resumptions in Multi-Tasking Dialogues.",
            "Syntactic Processing Using the Generalized Perceptron and Beam Search.",
            "Learning and Evaluation of Dialogue Strategies for New Applications: Empirical Methods for Optimization from Small Data Sets.",
            "Analyzing and Integrating Dependency Parsers.",
            "Grammar Factorization by Tree Decomposition.",
            "Not Exactly: In Praise of Vagueness Kees van Deemter (University of Aberdeen) Oxford: Oxford University Press, 2010, xvi+341 pp; hardbound, ISBN 978-0-19-954590-2, $29.95.",
            "A Resource-Light Approach to Morpho-Syntactic Tagging Anna Feldman* and Jirka Hana‡ (*Montclair State University, ‡Charles University) Amsterdam: Rodopi (Language and computers: Studies in practical linguistics, volume 70), 2010, xiv+185 pp; hardbound, ISBN 978-90-420-2768-8, €40.00.",
            "Language, Technology, and Society Richard Sproat (Oregon Health & Science University) Oxford: Oxford University Press, 2010, xiii+286 pp; hardbound, ISBN 978-0-19-954938-2, £25.00.",
            "Improving Our Reviewing Processes.",
            "Lexicon-Based Methods for Sentiment Analysis.",
            "Unsupervised Learning of Morphology.",
            "Learning to Rank Answers to Non-Factoid Questions from Web Collections.",
            "Stable Classification of Text Genres.",
            "Handbook of Natural Language Processing (second edition) Nitin Indurkhya and Fred J. Damerau (editors) (University of New South Wales; IBM Thomas J. Watson Research Center)Boca Raton, FL: CRC Press, 2010, xxxiii+678 pp; hardbound, ISBN 978-1-4200-8592-1, $99.95.",
            "Close Engagements with Artificial Companions: Key Social, Psychological, Ethical, and Design Issues Yorick Wilks (editor) (University of Oxford) Amsterdam: John Benjamins Publishing Company (Natural Language Processing series, edited by Ruslan Mitkov, volume 8), 2010, xxii+315 pp; hardbound, ISBN 978-90-272-4994-4, $149.00, €99.00; e-book, ISBN 978-90-272-8840-0, $149.00, €99.00.",
            "A Way with Words: Recent Advances in Lexical Theory and Analysis: A Festschrift for Patrick Hanks Gilles-Maurice de Schryver (editor) (Ghent University and University of the Western Cape)Kampala: Menha Publishers, 2010, vii+375 pp; ISBN 978-9970-10-101-6, €59.95.",
            "Categorial Grammar: Logical Syntax, Semantics, and Processing Glyn V. Morrill (Universitat Politècnica de Catalunya)Oxford: Oxford University Press, 2011, xv+236 pp; hardbound, ISBN 978-0-19-958985-2, £ 80.00, $150.00; paperbound, ISBN 978-0-19-958986-9, £ 29.99, $55.00.",
            "Cross-Language Information Retrieval Jian-Yun Nie (University of Montreal) San Rafael, CA: Morgan & Claypool (Synthesis Lectures on Human Language Technologies, edited by Graeme Hirst, volume 8), 2010, xv+125 pp; paperbound, ISBN 978-1-59829-863-5, $40.00; ebook, ISBN 978-1-59829-864-3, $30.00 or by subscription.",
            "Amazon Mechanical Turk: Gold Mine or Coal Mine?",
            "A New Unsupervised Approach to Word Segmentation.",
            "Controlling User Perceptions of Linguistic Style: Trainable Generation of Personality Traits.",
            "A Strategy for Information Presentation in Spoken Dialog Systems.",
            "Dependency Parsing Schemata and Mildly Non-Projective Dependency Parsing.",
            "Bilingual Co-Training for Sentiment Classification of Chinese Product Reviews.",
            "Automated Grammatical Error Detection for Language Learners Claudia Leacock, Martin Chodorow, Michael Gamon, and Joel Tetreault (Butler Hill Group, Hunter College, Microsoft Research, Educational Testing Service) Morgan & Claypool (Synthesis lectures on human language technologies, edited by Graeme Hirst, volume 9), 2010, ix+122 pp; paperbound, ISBN 978-1-60845-470-9, $40; ebook, ISBN 978-1-60845-471-6, $30 or by subscription.",
            "Semantic Role Labeling Martha Palmer, * Daniel Gildea, ‡ and Nianwen Xue¶ (*University of Colorado, Boulder; ‡University of Rochester; ¶Brandeis University) Morgan & Claypool (Synthesis Lectures on Human Language Technologies, edited by Graeme Hirst, volume 6), 2010, ix+91 pp; paperbound, ISBN 978-1-59829-831-4, $30.00 or by subscription.",
            "Introduction to Arabic Natural Language Processing Nizar Y. Habash (Columbia University) Morgan & Claypool (Synthesis Lectures on Human Language Technologies, edited by Graeme Hirst, volume 10), 2010, xvii+167 pp; paperbound, ISBN 978-1-59829-795-9, $40.00; ebook, ISBN 978-1-59829-796-6, $30.00 or by subscription.",
            "Computational Modeling of Human Language Acquisition Afra Alishahi (University of the Saarland) Morgan & Claypool (Synthesis Lectures on Human Language Technologies, edited by Graeme Hirst, volume 11), 2010, xiv+93 pp; paperbound, ISBN 978-1-60845-339-9, $40.00; ebook, ISBN 978-1-60845-340-5, $30.00 or by subscription.",
            "Syntax-Based Collocation Extraction Violeta Seretan (University of Geneva) Berlin: Springer (Text, speech and language technology series, volume 44), 2011, xi+217 pp; hardbound, ISBN 978-94-007-0133-5, $139.00.",
            "Data-Intensive Text Processing with MapReduce Jimmy Lin and Chris Dyer (University of Maryland) Morgan & Claypool (Synthesis Lectures on Human Language Technologies, edited by Graeme Hirst, volume 7), 2010, xi+165 pp; paperbound, ISBN 978-1-60845-342-9, $40.00; ebook, ISBN 978-1-60845-343-6, $30.00 or by subscription.",
            "The Brain as a Statistical Inference Engine - and You Can Too.",
            "Towards Automatic Error Analysis of Machine Translation Output.",
            "Levenshtein Distances Fail to Identify Language Relationships Accurately.",
            "What Determines Inter-Coder Agreement in Manual Annotations? A Meta-Analytic Investigation.",
            "Annotating and Learning Event Durations in Text.",
            "Parsing Noun Phrases in the Penn Treebank.",
            "Information Status Distinctions and Referring Expressions: An Empirical Study of References to People in News Summaries.",
            "Half-Context Language Models.",
            "Splittability of Bilexical Context-Free Grammars is Undecidable.",
            "Parsing Schemata for Practical Text Analysis Carlos Gómez Rodríguez (University of A Coruña) London: Imperial College Press (Mathematics, computing, language, and life series, edited by Carlos Martin-Vide, volume 1), 2010, xiv+275 pp; hardbound, ISBN 978-1-84816-560-1, $89.00."
        ]
    },
    {
        "name": "Computational Linguistics",
        "year": "2010",
        "info": "Volume 36, 2010",
        "count": 43,
        "papers": [
            "Broad-Coverage Parsing Using Human-Like Memory Constraints.",
            "A Graph-Theoretic Framework for Semantic Distance.",
            "Summarizing Short Stories.",
            "The Noisy Channel Model for Unsupervised Word Sense Disambiguation.",
            "Automatically Identifying the Source Words of Lexical Blends in English.",
            "Representation and Management of Narrative Information: Theoretical Principles and Implementation - Gian Piero Zarri, Springer Verlag, 2009, x+301 pp; ISBN 978-1-84800-077-3.",
            "Dependency Parsing - Sandra Kübler, Ryan McDonald, and Joakim Nivre, Morgan & Claypool, 2009, xii+115 pp; ISBN 978-1-59829-596-2.",
            "Failure is an Orphan (Let's Adopt).",
            "Generating Tailored, Comparative Descriptions with Contextually Appropriate Intonation.",
            "Sorting Texts by Readability.",
            "What Is Not in the Bag of Words for Why-QA?",
            "Re-structuring, Re-labeling, and Re-aligning for Syntax-Based Machine Translation.",
            "Statistical Language Models for Information Retrieval - ChengXiang Zhai, Morgan & Claypool, 2008; xiii+125 pp, ISBN 978-1-59829-590-0.",
            "What Computational Linguists Can Learn from Psychologists (and Vice Versa).",
            "Does GIZA++ Make Search Errors?",
            "Discriminative Word Alignment by Linear Modeling.",
            "Generating Phrasal and Sentential Paraphrases: A Survey of Data-Driven Methods.",
            "Disentangling Chat.",
            "Discourse Constraints for Document Compression.",
            "Complexity, Parsing, and Factorization of Tree-Local Multi-Component Tree-Adjoining Grammar.",
            "Learning Tractable Word Alignment Models with Complex Constraints.",
            "Hierarchical Phrase-Based Translation with Weighted Finite-State Transducers and Shallow-n Grammars.",
            "Linguistically Annotated Reordering: Evaluation and Analysis.",
            "Query Rewriting Using Monolingual Statistical Machine Translation.",
            "Ancient Symbols, Computational Linguistics, and the Reviewing Practices of the General Science Journals.",
            "Fred Jelinek.",
            "The Right Tools: Reflections on Computation and Language.",
            "An Asymptotic Model for the English Hapax/Vocabulary Ratio.",
            "On Paraphrase and Coreference.",
            "String-to-Dependency Statistical Machine Translation.",
            "Distributional Memory: A General Framework for Corpus-Based Semantics.",
            "A Flexible, Corpus-Driven Model of Regular and Inverse Selectional Preferences.",
            "Introduction to Linguistic Annotation and Text Analytics Graham Wilcock (University of Helsinki) Princeton, NJ: Morgan & Claypool (Synthesis Lectures on Human Language Technologies, edited by Graeme Hirst, volume 2, No. 1), 2009, x+149 pp; paperbound, ISBN 978-1-59829-738-6, $40.00; ebook, ISBN 978-1-59829-739-3, $30.00 or by subscription.",
            "Natural Language Processing with Python Steven Bird, Ewan Klein, and Edward Loper (University of Melbourne, University of Edinburgh, and BBN Technologies) Sebastopol, CA: O'Reilly Media, 2009, xx+482 pp; paperbound, ISBN 978-0-596-51649-9, $44.99; on-line free of charge at nltk.org/book.",
            "Statistical Machine Translation Philipp Koehn (University of Edinburgh) Cambridge University Press, 2010, xii+433 pp; ISBN 978-0-521-87415-1, $60.00.",
            "Introduction to Chinese Natural Language Processing Kam-Fai Wong, Wenjie Li, Ruifeng Xu, and Zheng-sheng Zhang (Chinese University of Hong Kong, Hong Kong Polytechnic University, City University of Hong Kong, and San Diego State University) Princeton, NJ: Morgan & Claypool (Synthesis Lectures on Human Language Technologies, edited by Graeme Hirst, volume 4), 2010, x+148 pp; paperbound, ISBN 978-1-59829-932-8, $40.00; e-book, ISBN 978-1-59829-933-5, $30.00 or by subscription.",
            "Spoken Dialogue Systems Kristiina Jokinen and Michael McTear (University of Helsinki, University of Ulster) Princeton, NJ: Morgan & Claypool (Synthesis Lectures on Language Technologies, edited by Graeme Hirst, volume 5), 2009, xiv+151pp; paperback, ISBN 978-1-59829-599-3, $40.00; ebook, ISBN 978-1-59829-600-6, doi 10.2200/S00204ED1V01Y200910HLT005, $30.00 or by subscription.",
            "Machine-Aided Linguistic Discovery: An Introduction and Some Examples Vladimir Pericliev (Bulgarian Academy of Sciences) London: Equinox, 2010, ix+330 pp; hardbound, ISBN 978-1-84553-660-2, $90.00, GBP60.00.",
            "Essential Programming for Linguistics.",
            "A Response to Richard Sproat on Random Systems, Writing, and Entropy.",
            "Entropy, the Indus Script, and Language: A Reply to R. Sproat.",
            "Reply to Rao et al. and Lee et al.",
            "Are We Near the End of the Journal?"
        ]
    },
    {
        "name": "Computational Linguistics",
        "year": "2009",
        "info": "Volume 35, 2009",
        "count": 31,
        "papers": [
            "Letter to the Editor.",
            "Statistical Approaches to Computer-Assisted Translation.",
            "Evaluating Centering for Information Ordering Using Corpora.",
            "The Complexity of Ranking Hypotheses in Optimality Theory.",
            "Unsupervised Type and Token Identification of Idiomatic Expressions.",
            "Discourse on the Move: Using Corpus Analysis to Describe Discourse Structure Douglas Biber, Ulla Connor, and Thomas A. Upton, John Benjamins Publishing, 2007.",
            "That's Nice ... What Can You Do With It?",
            "Prepositions in Applications: A Survey and Introduction to the Special Issue.",
            "Exploiting Semantic Role Resources for Preposition Disambiguation.",
            "The Syntax and Semantics of Prepositions in the Task of Automatic Interpretation of Nominal Phrases and Compounds: A Cross-Linguistic Study.",
            "A Minimal Recursion Semantic Analysis of Locatives.",
            "Applying Computational Models of Spatial Prepositions to Visually Situated Dialog.",
            "Introduction to Information Retrieval Christopher D. Manning, Prabhakar Raghavan, and Hinrich Schütze, Cambridge University Press, 2008.",
            "A Framework for Fast Incremental Interpretation during Speech Decoding.",
            "Robust Understanding in Multimodal Interfaces.",
            "Recognizing Contextual Polarity: An Exploration of Features for Phrase-Level Sentiment Analysis.",
            "Bootstrapping Distributional Feature Vector Quality.",
            "Speech and Language Processing (second edition) Daniel Jurafsky and James H. Martin (Stanford University and University of Colorado at Boulder) Pearson Prentice Hall, 2009, hardbound, ISBN 978-0-13-187321-6.",
            "Natural Language Processing and Linguistic Fieldwork.",
            "Alison Cawsey.",
            "Janet Hitzeman.",
            "Hozumi Tanaka.",
            "The Dawn of Statistical ASR and MT.",
            "From Annotator Agreement to Noise Models.",
            "Punctuation as Implicit Annotations for Chinese Word Segmentation.",
            "Kernel Methods for Minimally Supervised WSD.",
            "An Investigation into the Validity of Some Metrics for Automatically Evaluating Natural Language Generation Systems.",
            "Binarization of Synchronous Context-Free Grammars.",
            "An Empirical Study of Corpus-Based Response Automation Methods for an E-mail-Based Help-Desk Domain.",
            "Learning Machine Translation - Cyril Goutte, Nicola Cancedda, Marc Dymetman, and George Foster (editors) The MIT Press, 2009, xii+316 pp; ISBN 978-0-262-07297-7.",
            "What Science Underlies Natural Language Engineering?"
        ]
    },
    {
        "name": "Computational Linguistics",
        "year": "2008",
        "info": "Volume 34, 2008",
        "count": 32,
        "papers": [
            "Modeling Local Coherence: An Entity-Based Approach.",
            "Feature Forest Models for Probabilistic HPSG Parsing.",
            "Wide-Coverage Deep Statistical Parsing Using Automatic Dependency Structure Annotation.",
            "The Text Mining Handbook: Advanced Approaches to Analyzing Unstructured Data Ronen Feldman and James Sanger (Bar-Ilan University and ABS Ventures) Cambridge, England: Cambridge University Press, 2007, xii+410 pp; hardbound, ISBN 0-521-83657-3.",
            "Incremental Conceptualization for Language Production Markus Guhe (University of Edinburgh) Mahwah, NJ: Lawrence Erlbaum Associates (distributed by Psychology Press), 2007, xii+260 pp; hardbound, ISBN 978-0-8058-5624-8.",
            "Errors and Intelligence in Computer-Assisted Language Learning: Parsers and Pedagogues Trude Heift and Mathias Schulze (Simon Fraser University and University of Waterloo) New York: Routledge (Routledge series in computer-assisted language learning, edited by Carol Chappelle), 2007, xviii+283 pp; hardbound, ISBN 978-0-415-36191-0.",
            "On Becoming a Discipline.",
            "Semantic Role Labeling: An Introduction to the Special Issue.",
            "A Global Joint Model for Semantic Role Labeling.",
            "Tree Kernels for Semantic Role Labeling.",
            "Labeling Chinese Predicates with Semantic Roles.",
            "The Importance of Syntactic Parsing and Inference in Semantic Role Labeling.",
            "Towards Robust Semantic Role Labeling.",
            "A Computational Model of Natural Language Communication Roland Hausser (Friedrich-Alexander-Universität Erlangen-Nürnberg) Springer, 2006, xii+365 pp; hardbound, ISBN 3-540-35476-X/978-3-540-35476-5, EUR69.50.",
            "Information Extraction: Algorithms and Prospects in a Retrieval Context Marie-Francine Moens (Katholieke Universiteit Leuven) Springer (Information retrieval series, edited by W. Bruce Croft), 2006, xiii+246 pp; ISBN 978-1-4020-4987-3.",
            "Reliability Measurement without Limits.",
            "A Twin-Candidate Model for Learning-Based Anaphora Resolution.",
            "Dependency Parsing of Turkish.",
            "Training Tree Transducers.",
            "Identifying Semitic Roots: Machine Learning with Linguistic Constraints.",
            "Semisupervised Learning for Computational Linguistics Steven Abney (University of Michigan) Boca Raton, FL: Chapman & Hall / CRC (Computer science and data analysis series, edited by David Madigan et al.), 2007, xi+308 pp; hardbound, ISBN 978-1-58488-559-7.",
            "Computational Approaches to Morphology and Syntax Brian Roark and Richard Sproat (Oregon Health and Science University and University of Illinois at Urbana-Champaign) Oxford: Oxford University Press (Oxford surveys in syntax and morphology, edited by Robert D. Van Valin Jr, volume 4), 2007, xx+316 pp; hardbound, ISBN 978-0-19-927477-2.",
            "Arabic Computational Morphology: Knowledge-Based and Empirical Methods Abdelhadi Soudi, Antal van den Bosch, and Günter Neumann (editors) (Ecole Nationale de l'Industrie Minérale, Morocco; Tilburg University; and Deutches Forschungszentrum für Künstliche Intelligenz) Springer (Text, Speech, and Language Technology series, edited by Nancy Ide and Jean Véronis, volume 38), 2007, viii+305 pp; hardbound, ISBN 978-1-4020-6045-8.",
            "Empiricism Is Not a Matter of Faith.",
            "On Whose Shoulders?",
            "Hybrid Reinforcement/Supervised Learning of Dialogue Policies from Fixed Data Sets.",
            "Algorithms for Deterministic Incremental Dependency Parsing.",
            "Inter-Coder Agreement for Computational Linguistics.",
            "Constructing Corpora for the Development and Evaluation of Paraphrase Systems.",
            "Mathematical Linguistics András Kornai (MetaCarta Inc.) Springer (Advanced information and knowledge processing series, edited by Lakhmi Jain), 2008, xiii+289 pp; ISBN 978-1-84628-985-9.",
            "What's the Future for Computational Linguistics?",
            "Dependency Parsing of Turkish."
        ]
    },
    {
        "name": "Computational Linguistics",
        "year": "2007",
        "info": "Volume 33, 2007",
        "count": 37,
        "papers": [
            "Letter to the Editor.",
            "Identifying Sources of Disagreement: Generalizability Theory in Manual Annotation Studies.",
            "Word-Level Confidence Estimation for Machine Translation.",
            "Question Answering in Restricted Domains: An Overview.",
            "Answering Clinical Questions with Knowledge-Based and Statistical Techniques.",
            "Composing Questions through Conceptual Authoring.",
            "Text Mining for Biology and Biomedicine Sophia Ananiadou and John McNaught (editors) (University of Manchester and UK National Centre for Text Mining) Boston and London: Artech House, 2006, xi+286 pp; hardbound, ISBN 1-58053-984-X, GBP53.00.",
            "Flexible Semantics for Reinterpretation Phenomena Markus Egg (University of Groningen) Stanford, CA: CSLI Publications (CSLI Studies in Computational Linguistics, edited by Ann Copestake), 2006, xxi+239 pp; paperbound, ISBN 1-57586-502-5.",
            "Commonsense Reasoning Erik T. Mueller (IBM Thomas J. Watson Research Center) San Francisco: Elsevier/Morgan Kaufmann Publishers, 2006, xxvi+404 pp; hardbound, ISBN 0-12-369388-8.",
            "Googleology is Bad Science.",
            "Maximal Consistent Subsets.",
            "Dependency-Based Construction of Semantic Space Models.",
            "Hierarchical Phrase-Based Translation.",
            "Generating Referring Expressions: Making Referents Easy to Identify.",
            "Word Sense Disambiguation: Algorithms and Applications Eneko Agirre and Philip Edmonds (editors) (University of the Basque Country and Sharp Laboratories of Europe) Dordrecht: Springer (Text, speech, and language technology series, edited by Nancy Ide and Jean Véronis, volume 33), 2006, xxii+364 pp; ISBN 1-4020-4804-4.",
            "From Molecule to Metaphor: A Neural Theory of Language Jerome A. Feldman (University of California, Berkeley) Cambridge, MA: The MIT Press (A Bradford book), 2006, xx+357 pp; hardbound, ISBN 0-262-06253-4.",
            "The Proper Treatment of Events Michiel van Lambalgen and Fritz Hamm (University of Amsterdam and University of Tübingen) Blackwell Publishing (Explorations in semantics series, edited by Susan Rothstein), 2005, xii+252 pp; hardbound, ISBN 1-4051-1213-1.",
            "Inductive Dependency Parsing Joakim Nivre (Växjö University) Dordrecht: Springer (Text, speech, and language technology series, edited by Nancy Ide and Jean Véronis, volume 34), 2006, xi+216 pp; hardbound, ISBN 1-4020-4888-2.",
            "Putting Linguistics into Speech Recognition: The Regulus Grammar Compiler Manny Rayner, Beth Ann Hockey, and Pierette Bouillon (NASA Ames Research Center and University of Geneva) Stanford, CA: CSLI Publications (CSLI studies in computational linguistics, edited by Ann Copestake), 2006, xiv+305 pp; hardbound, ISBN 1-57586-525-4.",
            "Computing Attitude and Affect in Text: Theory and Applications James G. Shanahan, Yan Qu, and Janyce Wiebe (editors) (Clairvoyance Corporation and University of Pittsburgh) Dordrecht: Springer (The information retrieval series, edited by W. Bruce Croft), 2006, xv+341 pp; hardbound, ISBN 1-4020-4026-1.",
            "Lingvisticeskie problemy komp'juternoj morfologii [Linguistic Issues in Computational Morphology] S. A. Koval' St. Petersburg: St. Petersburg University Press, 2005, 151 pp; paperbound, ISBN 5-288-03731-0.",
            "The Shrinking Horizons of Computational Linguistics.",
            "Karen Spärck Jones.",
            "Measuring Word Alignment Quality for Statistical Machine Translation.",
            "A Sketch Algorithm for Estimating Two-Way and Multi-Way Associations.",
            "CCGbank: A Corpus of CCG Derivations and Dependency Structures Extracted from the Penn Treebank.",
            "Classifying Non-Sentential Utterances in Dialogue: A Machine Learning Approach.",
            "The Computational Nature of Language Learning and Evolution Partha Niyogi (University of Chicago) The MIT Press, 2006, xviii+482 pp; hardbound, ISBN 0-262-14094-2.",
            "Computational Linguistics: What About the Linguistics?",
            "Word Play.",
            "Prepositional Phrase Attachment without Oracles.",
            "Weighted and Probabilistic Context-Free Grammars Are Equally Expressive.",
            "Wide-Coverage Efficient Statistical Parsing with CCG and Log-Linear Models.",
            "Unsupervised Acquisition of Predominant Word Senses.",
            "Coherence in Natural Language: Data Stuctures and Applications Florian Wolf and Edward Gibson (Massachusetts Institute of Technology) The MIT Press, 2006, vii+137 pp; hardbound, ISBN 0-262-23251-0.",
            "Advances in Open Domain Question Answering Tomek Strzalkowski and Sanda Harabagiu (editors) (SUNY Albany and University of Texas at Dallas) Springer (Text, speech and language technology series, edited by Nancy Ide and Jean Véronis, volume 32), 2006, xxvi+566 pp; hardbound, ISBN 978-1-4020-4744-2.",
            "Breaking News: Changing Attitudes and Practices."
        ]
    },
    {
        "name": "Computational Linguistics",
        "year": "2006",
        "info": "Volume 32, 2006",
        "count": 39,
        "papers": [
            "WordNet Nouns: Classes and Instances.",
            "Improving Text Segmentation Using Latent Semantic Analysis: A Reanalysis of Choi, Wiemer-Hastings, and Moore (2001).",
            "Evaluating WordNet-based Measures of Lexical Semantic Relatedness.",
            "Finite-State Registered Automata for Non-Concatenative Morphology.",
            "Automatic Discovery of Part-Whole Relations.",
            "Introducing Speech and Language Processing.",
            "Multilingualism and Electronic Language Management.",
            "Computational and Quantitative Studies.",
            "Corpus Linguistics: Readings in a Widening Discipline.",
            "Geometry and Meaning.",
            "Experiments on the Automatic Induction of German Semantic Verb Classes.",
            "Generating Referring Expressions that Involve Gradable Properties.",
            "Building and Using a Lexical Knowledge Base of Near-Synonym Differences.",
            "The PARADISE Evaluation Framework: Issues and Findings.",
            "Consistent Validation of Manual and Automatic Sense Annotations with the Aid of Semantic Graphs.",
            "Representation and Inference for Natural Language: A First Course in Computational Semantics.",
            "Building Coherence and Cohesion: Task-oriented Dialogue in English and Spanish.",
            "Foundations of Intensional Semantics.",
            "Orthographic Errors in Web Pages: Toward Cleaner Web Corpora.",
            "The Notion of Argument in Prepositional Phrase Attachment.",
            "Similarity of Semantic Relations.",
            "Characterizing and Predicting Corrections in Spoken Dialogue Systems.",
            "New Developments in Parsing Technology.",
            "Computational Linguistics: Models, Resources, Applications.",
            "The Language of Time: A Reader.",
            "Argument Realization.",
            "Wired for Speech: How Voice Activates and Advances the Human-Computer Relationship.",
            "Improving Text Segmentation Using Latent Semantic Analysis: A Reanalysis of Choi, Wiemer-Hastings, and Moore.",
            "Old Linguists Never Die, They Only Get Obligatorily Deleted.",
            "Automatic Evaluation of Information Ordering: Kendall's Tau.",
            "Unsupervised Multilingual Sentence Boundary Detection.",
            "N-gram-based Machine Translation.",
            "Language, Cohesion and Form Margaret Masterman (1910-1986) (Edited by Yorick Wilks, University of Sheffield), Cambridge University Press (Studies in natural language processing, edited by Steven Bird and Branimir Boguraev), 2005, x+312 pp; hardbound, ISBN 0-521-45489-1.",
            "One-on-One Tutoring by Humans and Computers Martha Evens and Joel Michael (Illinois Institute of Technology and Rush Medical College), Lawrence Erlbaum Associates, 2006, xix+475 pp; hardbound, ISBN 0-8058-4360-4.",
            "Memory-Based Language Processing Walter Daelemans and Antal van den Bosch (University of Antwerp and Tilburg University), Cambridge: Cambridge University Press, 2005, vii+189 pp; hardbound, ISBN 0-521-80890-1.",
            "TREC: Experiment and Evaluation in Information Retrieval Ellen M. Voorhees and Donna K. Harman (editors) (National Institute of Standards and Technology), Cambridge, MA: The MIT Press (Digital libraries and electronic publishing series, edited by William Y. Arms), 2005, x+462 pp; hardbound, ISBN 0-262-22073-3.",
            "Ontology Learning from Text: Methods, Evaluation and Applications Paul Buitelaar, Philipp Cimiano, and Bernado Magnini (editors) (DFKI Saarbrücken, University of Karlsruhe, and ITC-irst), Amsterdam: IOS Press (Frontiers in artificial intelligence and applications, edited by J. Breuker et al., volume 123), 2005, v+171 pp; hardbound, ISBN 1-58603-523-1.",
            "Mark-up Barking Up the Wrong Tree.",
            "Errata: Experiments on the Automatic Induction of German Semantic Verb Classes."
        ]
    },
    {
        "name": "Computational Linguistics",
        "year": "2005",
        "info": "Volume 31, 2005",
        "count": 27,
        "papers": [
            "Some Points in a Time.",
            "Real versus Template-Based Natural Language Generation: A False Opposition?",
            "Discriminative Reranking for Natural Language Parsing.",
            "The Proposition Bank: An Annotated Corpus of Semantic Roles.",
            "Clustering Syntactic Positions with Similar Semantic Requirements.",
            "Ontological Semantics Sergei Nirenburg by Victor Raskin.",
            "Argumentation Machines: New Frontiers in Argumentation and Computation edited by Chris ReedTimothy J. Norman.",
            "Speech and Human'Machine Dialog.",
            "Remembering Bill Mann.",
            "A General Technique to Train Language Models on Language Models.",
            "Tree-Local Multicomponent Tree-Adjoining Grammars with Shared Nodes.",
            "A Mathematical Model of Historical Semantics and the Grouping of Word Meanings into Concepts.",
            "Representing Discourse Coherence: A Corpus-Based Study.",
            "Evaluating Discourse and Dialogue Coding Schemes.",
            "Sentence Fusion for Multidocument News Summarization.",
            "Large-Scale Induction and Evaluation of Lexical Resources from the Penn-II and Penn-III Treebanks.",
            "Comparing Knowledge Sources for Nominal Anaphora Resolution.",
            "Spoken Dialogue Technology: Toward the Conversational User Interface by Michael F. McTear.",
            "The Turing Test: Verbal Behavior as the Hallmark of Intelligence edited by Stuart Shieber.",
            "New Directions in Question Answering Mark T. Maybury.",
            "Memory-Based Parsing.",
            "A Life of Language.",
            "Co-occurrence Retrieval: A Flexible Framework for Lexical Distributional Similarity.",
            "Improving Machine Translation Performance by Exploiting Non-Parallel Corpora.",
            "Induction of Word and Phrase Alignments for Automatic Document Summarization.",
            "Chinese Word Segmentation and Named Entity Recognition: A Pragmatic Approach.",
            "Reviewing the Reviewers."
        ]
    },
    {
        "name": "Computational Linguistics",
        "year": "2004",
        "info": "Volume 30, 2004",
        "count": 30,
        "papers": [
            "Word Translation Disambiguation Using Bilingual Bootstrapping.",
            "CorMet: A Computational, Corpus-Based Conventional Metaphor Extraction System.",
            "Verb Class Disambiguation Using Informative Priors.",
            "Accessor Variety Criteria for Chinese Word Extraction.",
            "The Kappa Statistic: A Second Look.",
            "The Oxford Handbook of Computational Linguistics edited by Ruslan Mitkov.",
            "Readings in Machine Translation edited by Sergei NirenburgHarold SomersYorick Wilks.",
            "Language Modeling for Information Retrieval edited by W. Bruce CroftJohn Lafferty.",
            "Probabilistic Linguistics edited by Rens BodJennifer HayStefanie Jannedy.",
            "The Turing Test: The Elusive Standard of Artificial Intelligence.",
            "Inferable Centers, Centering Transitions, and the Notion of Coherence.",
            "Learning Domain Ontologies from Document Warehouses and Dedicated Web Sites.",
            "Statistical Machine Translation with Scarce Resources Using Morpho-syntactic Information.",
            "Machine Translation with Inferred Stochastic Finite-State Transducers.",
            "Comments on \"Incremental Construction and Maintenance of Minimal Finite-State Automata, \" by Rafael C. Carrasco and Mikel L. Forcada.",
            "Finite State Morphology by Kenneth R. BeesleyLauri Karttunen.",
            "Data-Oriented Parsing edited by Rens BodRemko SchaRemko Scha.",
            "Automated Essay Scoring: A Cross-Disciplinary Perspective edited by Mark D. ShermisJill C. Burstein.",
            "Word Sense Disambiguation: The Case for Combinations of Knowledge Sources by Mark Stevenson.",
            "Sample Selection for Statistical Parsing.",
            "Learning Subjective Language.",
            "Centering: A Parametric Theory and Its Instantiations.",
            "Understanding the Yarowsky Algorithm.",
            "Handbook for Language Engineers edited by Ali Farghaly.",
            "Optimizing Referential Coherence in Text Generation.",
            "The Alignment Template Approach to Statistical Machine Translation.",
            "Fast Approximate Search in Large Dictionaries.",
            "Intricacies of Collins' Parsing Model.",
            "The Mathematics by of Language Marcus Kracht.",
            "Recent Advances in Example-Based Machine Translation edited by Michael CarlAndy Way."
        ]
    },
    {
        "name": "Computational Linguistics",
        "year": "2003",
        "info": "Volume 29, 2003",
        "count": 28,
        "papers": [
            "Optimization Models of Sound Systems Using Genetic Algorithms.",
            "A Systematic Comparison of Various Statistical Alignment Models.",
            "Graph-Based Generation of Referring Expressions.",
            "A Machine Learning Approach to Modeling Scope Preferences.",
            "Word Reordering and a Dynamic Programming Beam Search Algorithm for Statistical Machine Translation.",
            "Weighted Deductive Parsing and Knuth's Algorithm.",
            "A Model for Matching Semantic Maps between Languages (French/English, English/French).",
            "Implementing the Binding and Accommodation Theory for Anaphora Resolution and Presupposition Projection.",
            "Document Structure.",
            "A Probabilistic Account of Logical Metonymy.",
            "Lexicography and Natural Language Processing: A Festscrift in Honour of B. T. S. Atkins edited by Marie-Hélène Corréard.",
            "Multimodality in Language and Speech Systems edited by Björn Granström, David House, and Inger Karlsson.",
            "The Semantics of Relationships: An Interdisciplinary Perspective edited by Rebecca Green, Carol A. Bean, and Sung Hyon Myaeng.",
            "Recent Advances in Computational Terminology edited by Didier Bourigault, Christian Jacquemin, and Marie-Claude L'Homme.",
            "Introduction to the Special Issue on the Web as Corpus.",
            "The Web as a Parallel Corpus.",
            "Embedding Web-Based Statistical Translation Models in Cross-Language Information Retrieval.",
            "wEBMT: Developing and Validating an Example-Based Machine Translation System using the World Wide Web.",
            "Using the Web to Obtain Frequencies for Unseen Bigrams.",
            "Automatic Association of Web Directories to Word Senses.",
            "Linguistic Evolution through Language Acquisition: Formal and Computational Models, edited by Ted Briscoe.",
            "Implementing Typed Feature Structure Grammars By Ann Copestake.",
            "Dependency Parsing with an Extended Finite-State Approach.",
            "Anaphora and Discourse Structure.",
            "Head-Driven Statistical Models for Natural Language Parsing.",
            "Disambiguating Nouns, Verbs, and Adjectives Using Automatically Acquired Selectional Preferences.",
            "Learning to Classify Text Using Support Vector Machines: Methods, Theory, and Algorithms by Thorsten Joachims.",
            "Anaphora Resolution by Ruslan Mitkov."
        ]
    },
    {
        "name": "Computational Linguistics",
        "year": "2002",
        "info": "Volume 28, 2002",
        "count": 24,
        "papers": [
            "Binding Machines.",
            "A Critique and Improvement of an Evaluation Metric for Text Segmentation.",
            "Generating Referring Expressions: Boolean Extensions of the Incremental Algorithm.",
            "Syllable-Pattern-Based Unknown-Morpheme Segmentation and Estimation for Hybrid Part-of-Speech Tagging of Korean.",
            "The DOP Estimation Method Is Biased and Inconsistent.",
            "Tree Adjoining Grammars: Formalisms, Linguistic Analysis and Processing edited by Anne Abeillé and Owen Rambow.",
            "The Theory and Practice of Discourse Parsing and Summarization by Daniel Marcu.",
            "Near-Synonymy and Lexical Choice.",
            "The Combinatory Morphemic Lexicon.",
            "Class-Based Probability Estimation Using a Semantic Hierarchy.",
            "Incremental Construction and Maintenance of Minimal Finite-State Automata.",
            "Spotting and Discovering Terms through Natural Language Processing by Christian Jacquemin.",
            "Automatic Labeling of Semantic Roles.",
            "Periods, Capitalized Words, etc..",
            "Toward an Aposynthesis of Topic Continuity and Intrasentential Anaphora.",
            "The Disambiguation of Nominalizations.",
            "A Note on Typing Feature Structures.",
            "Introduction to the Special Issue on Summarization.",
            "Summarizing Scientific Articles: Experiments with Relevance and Rhetorical Status.",
            "Automatic Summarization of Open-Domain Multiparty Dialogues in Diverse Genres.",
            "Efficiently Computed Lexical Chains as an Intermediate Representation for Automatic Text Summarization.",
            "Generating Indicative-Informative Summaries with SumUM.",
            "Using Hidden Markov Modeling to Decompose Human-Written Summaries.",
            "Human Variation and Lexical Choice."
        ]
    },
    {
        "name": "Computational Linguistics",
        "year": "2001",
        "info": "Volume 27, 2001",
        "count": 21,
        "papers": [
            "Using Suffix Arrays to Compute Term Frequency and Document Frequency for All Substrings in a Corpus.",
            "Integrating Prosodic and Lexical Cues for Automatic Topic Segmentation.",
            "Bootstrapping Morphological Analyzers by Combining Human Elicitation and Machine Learning.",
            "D-Tree Substitution Grammars.",
            "Unsupervised Named Entity Recognition Using Syntatic and Semantic Contextual Evidence.",
            "Unsupervised Learning of the Morphology of a Natural Language.",
            "Improving Accuracy in NLP Through Combination of Machine Learning Systems.",
            "The Need for Accurate Alignment in Natural Language System Evaluation.",
            "Probabilistic Top-Down Parsing and Language Modeling.",
            "Nonminimal Derivations in Unification-Based Parsing.",
            "The Interaction of Knowledge Sources in Word Sense Disambiguation.",
            "A Statistical Model for Word Discovery in Transcribed Speech.",
            "Automatic Verb Classification Based on Statistical Distributions of Argument Structure.",
            "Towards Constructive Text, Diagram, and Layout Generation for Information Presentation.",
            "Introduction to the Special Issue on Computational Anaphora Resolution.",
            "Design and Enhanced Evaluation of a Robust Anaphor Resolution Algorithm.",
            "A Corpus-Based Evalutation of Centering and Pronoun Resolution.",
            "A Machine Learning Approach to Coreference Resolution of Noun Phrases.",
            "An Algorithm for Anaphora Resolution in Spanish Texts.",
            "The Uncommon Denominator: A Proposal for Consistent Reporting of Pronoun Resolution Results.",
            "A Reformulation of Rule 2 of Centering Theor."
        ]
    },
    {
        "name": "Computational Linguistics",
        "year": "2000",
        "info": "Volume 26, 2000",
        "count": 21,
        "papers": [
            "Introduction to the Special Issue on Finite State Methods in NLP.",
            "Incremental Construction of Minimal Acyclic Finite State Automata.",
            "Practical Experiments with Regular Approximation of Context-free Languages.",
            "Learning Dependency Translation Models as Collections of Finite State Head Transducers.",
            "Treatment of Epsilon Moves in Subset Construction.",
            "Multi-Tiered Nonlinear Morphology Using Multi-Tape Finite Automata: A Case Study on Syriac and Arabic.",
            "Integrating Text Planning and Linguistic Choice Without Abandoning Modularity: The IGEN Generator.",
            "A Model for Multimodal Reference Resolution.",
            "A Multi-Strategy Approach to Improving Pronunciation by Analogy.",
            "Models of Translational Equivalence among Words.",
            "Pipelines and Size Constraints.",
            "Extracting the Lowest Frequency Words: Pitfalls and Possibilities.",
            "Incremental Processing and Acceptability.",
            "Dialog Act Modeling for Automatic Tagging and Recognition of Conversational Speech.",
            "A compression-based algorithm for Chinese word segmentation.",
            "The Rhetorical Parsing of Unrestricted Texts: A Surface-Based Approach.",
            "Automatic Text Categorization In Terms Of Genre, Author.",
            "Bidirectional Contextual Resolution.",
            "An Empirically-based System for Processing Definite Descriptions.",
            "Learning Methods to Combine Linguistic Indicators: Improving Aspectual Classification and Revealing Linguistic Insights.",
            "On Coreferring: Coreference in MUC and Related Annotation Schemes."
        ]
    },
    {
        "name": "Computational Linguistics",
        "year": "1999",
        "info": "Volume 25, 1999",
        "count": 21,
        "papers": [
            "A Process Model for Recognizing Communicative Acts and Modeling Negotiation Subdialogues.",
            "Default Representation in Constraint-based Frameworks.",
            "Bitext Maps and Alignment via Pattern Recognition.",
            "Statistical Properties of Probabilistic Context-Free Grammars.",
            "A Methodology for Extending Focusing Frameworks.",
            "Decomposable Modeling in Natural Language Processing.",
            "Tree Adjoining Grammars in a Fragment of the Lambek Calculus.",
            "Supertagging: An Approach to Alsmost Parsing.",
            "Aligning Phonetic Segments for Children's Articulation Assessment.",
            "Semantic-driven Generation with LFG- and PATR-style Grammars.",
            "Learning Dependencies between Case Frame Slots.",
            "Functional Centering - Grounding Referential Coherence in Information Structure.",
            "The Computational Complexity of the Correct-Prefix Property for TAGs.",
            "Vector-based Natural Language Call Routing.",
            "Interpreting and Generating Indirect Answers.",
            "Completeness Conditions for Mixed Strategy Bidirectional Parsing.",
            "Lexical Rules in Constraint-based Grammar.",
            "Speech Repairs, Intonational Phrases and Discourse Markers: Modeling Speakers' Utterances in Spoken Dialog.",
            "Semiring Parsing.",
            "Decoding Complexity in Word-Replacement Translation Models.",
            "Conceptions of Limited Attention and Discourse Focus."
        ]
    },
    {
        "name": "Computational Linguistics",
        "year": "1998",
        "info": "Volume 24, 1998",
        "count": 22,
        "papers": [
            "Introduction to the Special Issue on Word Sense Disambiguation: The State of the Art.",
            "Similarity-based Word Sense Disambiguation.",
            "Topical Clustering of MRD Senses Based on Information Retrieval Techniques.",
            "Automatic Word Sense Discrimination.",
            "Disambiguating Highly Ambiguous Words.",
            "Using Corpus Statistics and WordNet Relations for Sense Identification.",
            "A Corpus-based Investigation of Definite Description Use.",
            "Generalizing Case Frames Using a Thesaurus and the MDL Principle.",
            "Contextual Grammars as Generative Models of Natural Languages.",
            "New Figures of Merit for Best-First Probabilistic Chart Parsing.",
            "Estimation of Probabilistic Context-Free Grammars.",
            "Optimality Theory and the Generative Complexity of Constraint Violability.",
            "Introduction to the Special Issue on Natural Language Generation.",
            "Collaborative Response Generation in Planning Dialogues.",
            "A Generative Perspective on Verb Alternations.",
            "Describing Complex Charts in Natural Language: A Caption Generation System.",
            "Generating Natural Language Summaries from Multiple On-Line Sources.",
            "Do the Right Thing ... but Expect the Unexpected.",
            "A Collaborative Planning Model of Intentional Structure.",
            "Selective Sampling for Example-based Word Sense Disambiguation.",
            "Machine Transliteration.",
            "PCFG Models of Linguistic Tree Representations."
        ]
    },
    {
        "name": "Computational Linguistics",
        "year": "1997",
        "info": "Volume 23, 1997",
        "count": 21,
        "papers": [
            "Empirical Studies in Discourse - Introduction.",
            "The Reliability of a Dialogue Structure Coding Scheme.",
            "TextTiling: Segmenting Text into Multi-paragraph Subtopic Passages.",
            "Developing and Empirically Evaluating Robust Explanation Generators: The KNIGHT Experiments.",
            "Discourse Segmentation by Human and Automated Means.",
            "Effects of Variable Initiative on Linguistic Behavior in Human-Computer Spoken Natural Language Dialogue.",
            "An Empirical Study on the Generation of Anaphora in Chinese.",
            "Floating Constraints in Lexical Choice.",
            "Adaptive Multilingual Sentence Boundary Disambiguation.",
            "Finite-State Transducers in Language and Speech Processing.",
            "A Class-based Approach to Word Alignment.",
            "A Delayed Syntactic-Encoding-based LFG Parsing Strategy for an Indian Language - Bangla.",
            "A Rule-based Hyphenator for Modern Greek.",
            "Stochastic Inversion Transduction Grammars and Bilingual Parsing of Parallel Corpora.",
            "Automatic Rule Induction for Unknown-Word Guessing.",
            "An Efficient Implementation of the Head-Corner Parser.",
            "Algorithms for Grapheme-Phoneme Translation for English and French: Applications for Database Searches and Speech Synthesis.",
            "An Empirical Approach to VP Ellipsis.",
            "A Computational Treatment of Lexical Rules in HPSG as Covariation in Lexical Entries.",
            "Critical Tokenization and its Properties.",
            "Stochastic Attribute-Value Grammars."
        ]
    },
    {
        "name": "Computational Linguistics",
        "year": "1996",
        "info": "Volume 22, 1996",
        "count": 22,
        "papers": [
            "Translating Collocations for Bilingual Lexicons: A Statistical Approach.",
            "A Maximum Entropy Approach to Natural Language Processing.",
            "Error-tolerant Finite-state Recognition with Applications to Morphological Analysis and Spelling Correction.",
            "From Conceptual Time to Linguistic Time.",
            "Estimating Lexical Priors for Low-Frequency Morphologically Ambiguous Forms.",
            "DATR: A Language for Lexical Knowledge Representation.",
            "Improving Statistical Language Model Performance with Automatically Generated Word Hierarchies.",
            "Assessing Agreement on Classification Tasks: The Kappa Statistic.",
            "Limited Attention and Discourse Structure.",
            "Unification Encodings of Grammatical Notations.",
            "Machine Learning Comprehension Grammars for Ten Languages.",
            "Efficient Multilingual Phoneme-to-Grapheme Conversion Based on HMM.",
            "A Stochastic Finite-State Word-Segmentation Algorithm for Chinese.",
            "Sethood and Situations.",
            "Toward a Synthesis of Two Accounts of Discourse Structure.",
            "A Chart Re-estimation Algorithm for a Probabilistic Recursive Transition Network.",
            "The Effects of Lexical Specialization on the Growth Curve of the Vocabulary.",
            "An Algorithm to Align Words for Historical Comparison.",
            "Learning Bias and Phonological-Rule Induction.",
            "A Statistically Emergent Approach for Language Processing: Application to Modeling Context Effects in Ambiguous Chinese Word Boundary Perception.",
            "Ambiguity-preserving Generation with LFG- and PATR-style Grammars.",
            "Integrating General-purpose and Corpus-based Verb Classification."
        ]
    },
    {
        "name": "Computational Linguistics",
        "year": "1995",
        "info": "Volume 21, 1995",
        "count": 20,
        "papers": [
            "Principled Disambiguation: Discriminating Adjective Senses with Modified Nouns.",
            "Expressing Rhetorical Relations in Instructional Text: A Case Study of the Purposes Relation.",
            "Automatic Referent Resolution of Deictic and Anaphoric Expressions.",
            "An Automatic Procedure for Topic-Focus Identification.",
            "Dependency Unification Grammar for PROLOG.",
            "Automatic Stochastic Tagging of Natural Language Texts.",
            "An Efficient Probabilistic Context-Free Parsing Algorithm that Computes Prefix Probabilities.",
            "Centering: A Framework for Modeling the Local Coherence of Discourse.",
            "Deterministic Part-of-Speech Tagging with Finite-State Transducers.",
            "Efficient Parsing for Korean and English: A Parameterized Message- Passing Approach.",
            "An Architecture for Voice Dialog Systems Based on Prolog-Style Theorem Proving.",
            "Robust Learning, Smoothing, and Parameter Tying on Syntactic Ambiguity Resolution.",
            "Collaborating on Referring Expressions.",
            "Learning Morpho-Lexical Probabilities from an Untagged Corpus with an Application to Hebrew.",
            "Memoization in Top-Down Parsing.",
            "The Repair of Speech Act Misunderstandings by Abductive Inference.",
            "Tree Insertion Grammar: Cubic-Time, Parsable Formalism that Lexicalizes Context-Free Grammar without Changing the Trees Produced.",
            "Modularity and Information Content Classes in Principle-based Parsing.",
            "Transformation-Based Error-Driven Learning and Natural Language Processing: A Case Study in Part-of-Speech Tagging.",
            "Developing a Nonsymbolic Phonetic Notation for Speech Synthesis."
        ]
    },
    {
        "name": "Computational Linguistics",
        "year": "1994",
        "info": "Volume 20, 1994",
        "count": 28,
        "papers": [
            "Computing with Features as Formulae.",
            "A Hierarchical Stochastic Model for Automatic Prediction of Prosodic Boundary Location.",
            "One-Level Phonology: Autosegmental Representations and Rules as Finite Automata.",
            "An Alternative Conception of Tree-Adjoining Derivation.",
            "Tagging English Text with a Probabilistic Model.",
            "Tree-Adjoining Grammar Parsing and Boolean Matrix Multiplication.",
            "Japanese Discourse and the Process of Centering.",
            "Tracking Point of View in Narrative.",
            "Parsing and Empty Nodes.",
            "RAFT/RAPR and Centering: A Comparison and Discussion of Problems Related to Processing Complex Sentences.",
            "Regular Models of Phonological Rule Systems.",
            "Commentary on Kaplan and Kay.",
            "Commentary on Kaplan and Kay.",
            "The Reconstruction Engine: A Computer Implementation of the Comparative Method.",
            "Commentary on Lowe and Mazaudon.",
            "Commentary on Lowe and Mazaudon.",
            "The Acquisition of Stress: A Data-Oriented Approach.",
            "Commentary on Daelemans, Gillis, and Durieux.",
            "Commentary on Daelemans, Gillis, and Durieux.",
            "Phonological Analysis in Typed Feature Systems.",
            "Commentary on Bird and Klein.",
            "Commentary on Bird and Klein.",
            "A Syntactic Analysis Method of Long Japanese Sentences Based on the Detection of Conjunctive Structures.",
            "An Algorithm for Pronominal Anaphora Resolution.",
            "Word Sense Disambiguation Using a Second Language Monolingual Corpus.",
            "Machine Translation Divergences: A Formal Description and Proposed Solution.",
            "Training and Scaling Preference Functions for Disambiguation.",
            "Storing Logical Form in a Shared-Packed Forest."
        ]
    },
    {
        "name": "Computational Linguistics",
        "year": "1993",
        "info": "Volume 19, 1993",
        "count": 23,
        "papers": [
            "Introduction to the Special Issue on Computational Linguistics Using Large Corpora.",
            "Generalized Probabilistic LR Parsing of Natural Language (Corpora) with Unification-Based Grammars.",
            "Accurate Methods for the Statistics of Surprise and Coincidence.",
            "A Program for Aligning Sentences in Bilingual Corpora.",
            "Structural Ambiguity and Lexical Relations.",
            "Text-Translation Alignment.",
            "Retrieving Collocations from Text: Xtract.",
            "The Problem of Logical-Form Equivalence.",
            "Issues in the Choice of a Source for Natural Language Generation.",
            "Using Register-Diversified Corpora for General Language Studies.",
            "From Grammar to Lexicon: Unsupervised Learning of Lexical Syntax.",
            "The Mathematics of Statistical Machine Translation: Parameter Estimation.",
            "Building a Large Annotated Corpus of English: The Penn Treebank.",
            "Lexical Semantic Techniques for Corpus Analysis.",
            "Coping with Ambiguity and Unknown Words through Probabilistic Models.",
            "Evaluating Message Understanding Systems: An Analysis of the Third Message Understanding Conference (MUC-3).",
            "A Computational Theory of Goal-Directed Style in Syntax.",
            "Empirical Studies on the Disambiguation of Cue Phrases.",
            "Co-Occurrrence Patterns among Collocations: A Tool for Corpus-Based Lexical Knowledge Acquisition.",
            "The Interface between Phrasal and Functional Constraints.",
            "Parsing Some Constrained Grammar Formalisms.",
            "Indexical Expressions in the Scope of Attitude Verbs.",
            "Planning Text for Advisory Dialogues: Capturing Intentional and Rhetorical Information."
        ]
    },
    {
        "name": "Computational Linguistics",
        "year": "1992",
        "info": "Volume 18, 1992",
        "count": 16,
        "papers": [
            "Using Multiple Knowledge Sources for Word Sense Discrimination.",
            "An Estimate of an Upper Bound for the Entropy of English.",
            "Languages Generated by Two-Level Morphological Rules.",
            "TINA: A Natural Language System for Spoken Language Applications.",
            "Inheritance in Word Grammar.",
            "Inheritance and Constraint-Based Grammar Formalisms.",
            "Feature Structures and Nonmonotonicity.",
            "Inheritance in Natural Language Processing.",
            "Incremental Processing and the Hierarchical Lexicon.",
            "Making DATR Work for Speech: Lexicon Compilation in SUNDIAL.",
            "Inheritance and Complementation: A Case Study of Easy Adjectives and Related Nouns.",
            "A Practical Approach to Multiple Default Inheritance for Unification-Based Lexicons.",
            "The Acquisition and Use of Context-Dependent Grammars for English.",
            "Ambiguous Noun Phrases in Logical Form.",
            "Class-Based n-gram Models of Natural Language.",
            "Using Descriptions of Trees in a Tree Adjoining Grammar."
        ]
    },
    {
        "name": "Computational Linguistics",
        "year": "1991",
        "info": "Volume 17, 1991",
        "count": 13,
        "papers": [
            "Co-Occurrences of Antonymous Adjectives and Their Contexts.",
            "Lexical Cohesion Computed by Thesaural Relations as an Indicator of the Structure of Text.",
            "met*: A Method for Discriminating Matonymy and Metaphor by Computer.",
            "Features and Formulae.",
            "How to Encode Semantic Knowledge: A Method for Meaning Representation and Computer-Aided Acquisition.",
            "Semantics of Paragraphs.",
            "An Algorithm for High Accuracy Name Pronunciation by Parametric Speech Synthesizer.",
            "Chinese Number-Names, Tree Adjoining Languages, and Mild Context-Sensitivity.",
            "The Generative Power of Categorial Grammars and Head-Driven Phrase Structure Grammars with Lexical Rules.",
            "Computation of the Probability of Initial Substring Generation by Stochastic Context-Free Grammars.",
            "An Efficient Natural Language Processing System Specially Designed for the Chinese Language.",
            "Systemic Classification and its Efficiency.",
            "The Generative Lexicon."
        ]
    },
    {
        "name": "Computational Linguistics",
        "year": "1990",
        "info": "Volume 16, 1990",
        "count": 14,
        "papers": [
            "Categorial Semantics and Scoping.",
            "An Interpretation of Negation in Feature Structure Descriptions.",
            "Word Association Norms, Mutual Information, and Lexicography.",
            "Semantic-Head-Driven Generation.",
            "Wide-Range Restructuring of Intermediate Representations in Machine Translation.",
            "A Statistical Approach to Machine Translation.",
            "An Implementable Semantics for Comparative Constructions.",
            "Resolving Quasi Logical Forms.",
            "An Editor for the Explanatory and Combinatory Dictionary of Contemporary French (DECFC).",
            "A Computational Grammar of Discourse-Neutral Prosodic Phrasing in English.",
            "Disjunction without Tears.",
            "Workshop on the Evaluation of Natural Language Processing Systems.",
            "Anaphora Resolution in Slot Grammar.",
            "Sentential Semantics for Propositional Attitudes."
        ]
    },
    {
        "name": "Computational Linguistics",
        "year": "1989",
        "info": "Volume 15, 1989",
        "count": 11,
        "papers": [
            "Parsing with Flexibility, Dynamic Strategies, and Idioms in Mind.",
            "Syntactic Graphs: A Representation for the Union of All Ambiguous Parse Trees.",
            "Design of LMT: A Prolog-Based Machine Translation System.",
            "A Pragmatics-Based Approach to Ellipsis Resolution.",
            "Parsing with a Small Dictionary for Applications such as Text to Speech.",
            "Practical Parsing of Generalized Phrase Structure Grammars.",
            "Knowledge Representation for Commonsense Reasoning with Text.",
            "Non-Singular Concepts in Natural Language Discourse.",
            "A Parsing Algorithm for Unification Grammar.",
            "Natural Language Generation from Plans.",
            "A Formal Model for Context-Free Languages Augmented with Reduplication."
        ]
    },
    {
        "name": "Computational Linguistics",
        "year": "1988",
        "info": "Volume 14, 1988",
        "count": 17,
        "papers": [
            "Category Structures.",
            "A Common Parsing Scheme for Left- and Right-Branching Languages.",
            "Grammatical Category Disambiguation by Statistical Optimization.",
            "Implementing Systemic Classification by Unification.",
            "Tense, Quantifiers, and Contexts.",
            "Temporal Ontology and Temporal Reference.",
            "Aspect, Aspectual Class, and the Temporal Structure of Narrative.",
            "A Computational Model of the Semantics of Tense and Aspect.",
            "Tense as Discourse Anaphor.",
            "Modeling the User in Natural Language Systems.",
            "Modeling the User's Plans and Goals.",
            "Recognizing and Responding to Plan-Oriented Misconceptions.",
            "Reasoning on a Highlighted User Model to Respond to Misconceptions.",
            "Tailoring Object Descriptions to a User's Level of Expertise.",
            "LFP A Logic for Linguistic Descriptions and an Analysis of its Complexity.",
            "Natural Language Querying of Historical Data Bases.",
            "The Berkeley UNIX Consultant Project."
        ]
    },
    {
        "name": "Computational Linguistics",
        "year": "1987",
        "info": "Volume 13, 1987",
        "count": 14,
        "papers": [
            "Restricting Logic Grammars with Government-Binding Theory.",
            "Analyzing the Structure of Argumentative Discourse.",
            "Simultaneous-Distributive Coordination and Context-Freeness.",
            "An Efficient Augmented-Context-Free Parsing Algorithm.",
            "An Algorithm for Generating Quantifier Scopings.",
            "Processing Dictionary Definitions with Phrasal Pattern Hierarchies.",
            "Large Lexicons for Natural Language Processing: Utilising the Grammar Coding System of LDOCE.",
            "Tools and Methods for Computational Lexicology.",
            "Commonsense Metaphysics and Lexical Semantics.",
            "Disambiguating Prepositional Phrase Attachments by Using On-Line Dictionary Definitions.",
            "A Formal Lexicon in the Meaning-Text Theory (or How to Do Lexica with Words).",
            "The Subworld Concept Lexicon and the Lexicon Management System.",
            "A Computational Framework for Lexical Description.",
            "The Self-Extending Phrasal Lexicon."
        ]
    },
    {
        "name": "Computational Linguistics",
        "year": "1986",
        "info": "Volume 12, 1986",
        "count": 8,
        "papers": [
            "Resolving Lexical Ambiguity in a Deterministc Parser.",
            "The Correction of Ill-Formed Input Using History-Based Expectation with Applications to Speech Understanding.",
            "Integrated Processing Produces Robust Understanding.",
            "Summarizing Natural Language Database Responses.",
            "Attention, Intentions, and the Structure of Discourse.",
            "Discovery Procedures for Sublanguage Selectional Patterns: Initial Experiments.",
            "Associative Model of Morphological Analysis: An Empirical Inquiry.",
            "Reference Identification and Reference Identification Failures."
        ]
    },
    {
        "name": "Computational Linguistics",
        "year": "1985",
        "info": "Volume 11, 1985",
        "count": 10,
        "papers": [
            "A Survey of Machine Translation: Its History, Current Status, and Future Prospects.",
            "TAUM-AVIATION: Its Technical Features and Some Experimental Results.",
            "Automated Translation at Grenoble University.",
            "The Japanese Government Project for Machine Translation.",
            "The LRC Machine Translation System.",
            "SPANAM and ENGSPAN: Machine Translation at the Pan American Health Organization.",
            "ASCOF - A Modular Multilevel System for French-German Translation.",
            "EUROTRA: A Multilingual System under Development.",
            "On the Complexity of ID/LP Parsing.",
            "PHRED: A Generator for Natural Language Interfaces."
        ]
    },
    {
        "name": "Computational Linguistics",
        "year": "1984",
        "info": "Volume 10, 1984",
        "count": 9,
        "papers": [
            "A Nowledge Representation Approach to Understanding Metaphors.",
            "A Formal Basis for Performance Evaluation of Natural Language Understanding Systems.",
            "A Phrase-Structured Grammatical Framework for Transportable Natural Language Processing.",
            "The Pragmatics of Referring and the Modality of Communication.",
            "On the Mathematical Properties of Linguistic Theories.",
            "English and the Class of Context-Free Languages.",
            "On Two Recent Attempts to Show that English is Not a CFL.",
            "Comments on Pullum's Criticisms.",
            "Strong Generative Capacity, Weak Generative Capacity, and Modern Linguistic Theories."
        ]
    }
]