[
    {
        "name": "Computer Speech and Language",
        "year": "2022",
        "info": "2022: Volumes\n71,\n72,\n73,",
        "count": 58,
        "papers": [
            "Local and non-local dependency learning and emergence of rule-like representations in speech data by deep convolutional generative adversarial networks.",
            "Bayesian HMM clustering of x-vector sequences (VBx) in speaker diarization: Theory, implementation and analysis on standard tasks.",
            "Spoken language interaction with robots: Recommendations for future research.",
            "Unsupervised sign language validation process based on hand-motion parameter clustering.",
            "Joint emotion label space modeling for affect lexica.",
            "A speaker verification backend with robust performance across conditions.",
            "A novel approach to unsupervised pattern discovery in speech using Convolutional Neural Network.",
            "BERT syntactic transfer: A computational experiment on Italian, French and English languages.",
            "Code-switched automatic speech recognition in five South African languages.",
            "Causal indicators for assessing the truthfulness of child speech in forensic interviews.",
            "Cross-lingual transfer learning for relation extraction using Universal Dependencies.",
            "Sentence transition matrix: An efficient approach that preserves sentence semantics.",
            "Language-independent extractive automatic text summarization based on automatic keyword extraction.",
            "Combining context-relevant features with multi-stage attention network for short text classification.",
            "Perceptions and reactions to conversational privacy initiated by a conversational user interface.",
            "Phase sensitive masking-based single channel speech enhancement using conditional generative adversarial network.",
            "Arabic speech recognition by end-to-end, modular systems and human.",
            "A classification benchmark for Arabic alphabet phonemes with diacritics in deep neural networks.",
            "Feature learning for efficient ASR-free keyword spotting in low-resource languages.",
            "Deep reinforcement and transfer learning for abstractive text summarization: A review.",
            "Exploring intrinsic information content models for addressing the issues of traditional semantic measures to evaluate verb similarity.",
            "Dereverberation of autoregressive envelopes for far-field speech recognition.",
            "Investigations on speech recognition systems for low-resource dialectal Arabic-English code-switching speech.",
            "Cross-language article linking with deep neural network based paragraph encoding.",
            "Improving the potential of Enhanced Teager Energy Cepstral Coefficients (ETECC) for replay attack detection.",
            "Improving low-resource machine transliteration by using 3-way transfer learning.",
            "Adjustable deterministic pseudonymization of speech.",
            "Combining background noise and artificial masking to achieve privacy in sound zones.",
            "Changes in facial expressions in patients with Parkinson's disease during the phonation test and their correlation with disease severity.",
            "Analysis and classification of speech sounds of children with autism spectrum disorder using acoustic features.",
            "End-to-end neural systems for automatic children speech recognition: An empirical study.",
            "Evaluating voice-assistant commands for dementia detection.",
            "An automatic Alzheimer's disease classifier based on spontaneous spoken English.",
            "Towards a unified assessment framework of speech pseudonymisation.",
            "Effectiveness of energy separation-based instantaneous frequency estimation for cochlear cepstral features for synthetic and voice-converted spoofed speech detection.",
            "Accentron: Foreign accent conversion to arbitrary non-native speakers using zero-shot learning.",
            "MS-Transformer: Introduce multiple structural priors into a unified transformer for encoding sentences.",
            "Symbolic and Statistical Learning Approaches to Speech Summarization: A Scoping Review.",
            "Overlapped Speech Detection and speaker counting using distant microphone arrays.",
            "Generative adversarial networks for speech processing: A review.",
            "DORA: Towards policy optimization for task-oriented dialogue system with efficient context.",
            "Natural language processing for under-resourced languages: Developing a Welsh natural language toolkit.",
            "Parameterisation of human speech after total laryngectomy surgery.",
            "Lightweight and irreversible speech pseudonymization based on data-driven optimization of cascaded voice modification modules.",
            "Joint speaker diarization and speech recognition based on region proposal networks.",
            "A review of speaker diarization: Recent advances with deep learning.",
            "Generating identities with mixture models for speaker anonymization.",
            "Corrigendum to 'Unsupervised sign language validation process based on hand-motion parameter clustering'.",
            "The phonetic footprint of Parkinson's disease.",
            "Empirical Mode Decomposition articulation feature extraction on Parkinson's Diadochokinesia.",
            "Towards sound based testing of COVID-19 - Summary of the first Diagnostics of COVID-19 using Acoustics (DiCOVA) Challenge.",
            "Unsupervised induction of inflectional families.",
            "Speaker anonymization by modifying fundamental frequency and x-vector singular value.",
            "An investigation of neural uncertainty estimation for target speaker extraction equipped RNN transducer.",
            "Exploring accidental triggers of smart speakers.",
            "A multi-label emoji classification method using balanced pointwise mutual information-based feature selection.",
            "Conversation Initiation of Mothers, Fathers, and Toddlers in their Natural Home Environment.",
            "Discriminating speech traits of Alzheimer's disease assessed through a corpus of reading task for Spanish language."
        ]
    },
    {
        "name": "Computer Speech and Language",
        "year": "2021",
        "info": "2021: Volumes\n66,\n67,\n68,\n69,\n70",
        "count": 66,
        "papers": [
            "Morphologically motivated word classes for very large vocabulary speech recognition of Finnish and Estonian.",
            "Low resource end-to-end spoken language understanding with capsule networks.",
            "An online multi-source summarization algorithm for text readability in topic-based search.",
            "Controlling contents in data-to-document generation with human-designed topic labels.",
            "MuST-C: A multilingual corpus for end-to-end speech translation.",
            "Acoustic and articulatory analysis and synthesis of shouted vowels.",
            "Neural candidate-aware language models for speech recognition.",
            "Advances in subword-based HMM-DNN speech recognition across languages.",
            "Gated dynamic convolutions with deep layer fusion for abstractive document summarization.",
            "A deep neural network based correction scheme for improved air-tissue boundary prediction in real-time magnetic resonance imaging video.",
            "Replay attack detection using variable-frequency resolution phase and magnitude features.",
            "An analysis of observation length requirements for machine understanding of human behaviors from spoken language.",
            "On the use of blind channel response estimation and a residual neural network to detect physical access attacks to speaker verification systems.",
            "Transfer fine-tuning of BERT with phrasal paraphrases.",
            "A label-oriented loss function for learning sentence representations.",
            "QBSUM: A large-scale query-based document summarization dataset from real-world applications.",
            "A Bayesian end-to-end model with estimated uncertainties for simple question answering over knowledge bases.",
            "A Spanish multispeaker database of esophageal speech.",
            "Human evaluation of automatically generated text: Current trends and best practice guidelines.",
            "BERT-hLSTMs: BERT and hierarchical LSTMs for visual storytelling.",
            "Turn-taking in Conversational Systems and Human-Robot Interaction: A Review.",
            "To what extent does content selection affect surface realization in the context of headline generation?",
            "Investigation of learning abilities on linguistic features in sequence-to-sequence text-to-speech synthesis.",
            "Learning to generate structured queries from natural language with indirect supervision.",
            "Hierarchical state recurrent neural network for social emotion ranking.",
            "Identification of related languages from spoken data: Moving from off-line to on-line scenario.",
            "Exploring neural models for predicting dementia from language.",
            "Attention-based BiLSTM fused CNN with gating mechanism model for Chinese long text classification.",
            "Generating unambiguous and diverse referring expressions.",
            "An unsupervised approach to detect review spam using duplicates of images, videos and Chinese texts.",
            "Novel textual entailment technique for the Arabic language using genetic algorithm.",
            "Verbal fluency in normal aging and cognitive decline: Results of a longitudinal study.",
            "An intention multiple-representation model with expanded information.",
            "GEPC: Global embeddings with PID control.",
            "Paralinguistic and linguistic fluency features for Alzheimer's disease detection.",
            "Adversarial attack and defense strategies for deep speaker recognition systems.",
            "Prosodic event detection in children's read speech.",
            "Deep ad-hoc beamforming.",
            "A combined syntactic-semantic embedding model based on lexicalized tree-adjoining grammar.",
            "Automatic detection of pharyngeal fricatives in cleft palate speech using acoustic features based on the vocal tract area spectrum.",
            "Representation transfer learning from deep end-to-end speech recognition networks for the classification of health states from speech.",
            "The automatic detection of heart failure using speech signals.",
            "Automatic speaker independent dysarthric speech intelligibility assessment system.",
            "A study of vowel nasalization using instantaneous spectra.",
            "Cross-lingual detection of mild cognitive impairment based on temporal parameters of spontaneous speech.",
            "Non-negative matrix factorization-based time-frequency feature extraction of voice signal for Parkinson's disease prediction.",
            "Comprehensive analysis of aspect term extraction methods using various text embeddings.",
            "Glimpse-based estimation of speech intelligibility from speech-in-noise using artificial neural networks.",
            "NUVA: A Naming Utterance Verifier for Aphasia Treatment.",
            "Enhancing Arabic aspect-based sentiment analysis using deep learning models.",
            "Stochastic models of glottal pulses from the Rosenberg and Liljencrants-Fant models with unified parameters.",
            "Automated grapheme-to-phoneme conversion for Central Kurdish based on optimality theory.",
            "Joint speaker separation and recognition using non-negative matrix deconvolution with adaptive dictionary.",
            "Unsupervised speech representation learning for behavior modeling using triplet enhanced contextualized networks.",
            "The predictive capabilities of mathematical models for the type-token relationship in English language corpora.",
            "Sequential routing framework: Fully capsule network-based speech recognition.",
            "Self-segmentation of pass-phrase utterances for deep feature learning in text-dependent speaker verification.",
            "Dialect Identification using Chroma-Spectral Shape Features with Ensemble Technique.",
            "Detection of vowel transition regions from Hindi language.",
            "Glottal features for classification of phonation type from speech and neck surface accelerometer signals.",
            "Comparison of rule-based and data-driven approaches for syllabification of simple syllable languages and the effect of orthography.",
            "Multi-level embeddings for processing Arabic social media contents.",
            "Siamese networks for large-scale author identification.",
            "Adversarial subsequences for unconditional text generation.",
            "MASS: Multi-task anthropomorphic speech synthesis framework.",
            "Adaptive line enhancer for nonstationary harmonic noise reduction."
        ]
    },
    {
        "name": "Computer Speech and Language",
        "year": "2020",
        "info": "2020: Volumes\n59,\n60,\n61,\n62,\n63,\n64,\n65",
        "count": 81,
        "papers": [
            "rVAD: An unsupervised segment-based robust voice activity detection method.",
            "End-to-end DNN based text-independent speaker recognition for long and short utterances.",
            "Voice Mimicry Attacks Assisted by Automatic Speaker Verification.",
            "IESC-Child: An Interactive Emotional Children's Speech Corpus.",
            "The impact of speaking rate on acoustic-to-articulatory inversion.",
            "Simple methods to overcome the limitations of general word representations in natural language processing tasks.",
            "Principal component analysis of the spectrogram of the speech signal: Interpretation and application to dysarthric speech.",
            "Evaluating the state-of-the-art of End-to-End Natural Language Generation: The E2E NLG challenge.",
            "Extending sparse text with induced domain-specific lexicons and embeddings: A case study on predicting donations.",
            "Adaptive scheduling for adaptive sampling in pos taggers construction.",
            "A question answering system in hadith using linguistic knowledge.",
            "A continuous vocoder for statistical parametric speech synthesis and its evaluation using an audio-visual phonetically annotated Arabic corpus.",
            "Combining a context aware neural network with a denoising autoencoder for measuring string similarities.",
            "Excitation modelling using epoch features for statistical parametric speech synthesis.",
            "Supervised I-vector modeling for language and accent recognition.",
            "Speaker-Informed time-and-Content-Aware attention for spoken language understanding.",
            "Learning chinese word embeddings from character structural information.",
            "Voice biometrics security: Extrapolating false alarm rate via hierarchical Bayesian modeling of speaker verification scores.",
            "State-of-the-art speaker recognition with neural network embeddings in NIST SRE18 and Speakers in the Wild evaluations.",
            "Voxceleb: Large-scale speaker verification in the wild.",
            "Two decades of speaker recognition evaluation at the national institute of standards and technology.",
            "Introduction to the special issue \"Speaker and language characterization and recognition: Voice modeling, conversion, synthesis and ethical aspects\".",
            "NEC-TT System for Mixed-Bandwidth and Multi-Domain Speaker Recognition.",
            "State gradients for analyzing memory in LSTM language models.",
            "Assessing Parkinson's disease severity using speech analysis in non-native speakers.",
            "Trajectory-based recognition of dynamic Persian sign language using hidden Markov model.",
            "Two decades into Speaker Recognition Evaluation - are we there yet?",
            "Sequence labeling to detect stuttering events in read speech.",
            "Towards the first Maithili part of speech tagger: Resource creation and system development.",
            "A survey on automatic speech recognition systems for Portuguese language and its variations.",
            "Low-resource text classification using domain-adversarial learning.",
            "Classification of aspirated and unaspirated sounds in speech using excitation and signal level information.",
            "Overview of the seventh Dialog System Technology Challenge: DSTC7.",
            "Context and knowledge aware conversational model and system combination for grounded response generation.",
            "Generating diverse conversation responses by creating and ranking multiple candidates.",
            "Sequential neural networks for noetic end-to-end response selection.",
            "Noetic end-to-end response selection with supervised neural network based classifiers and unsupervised similarity models.",
            "Recurrent neural network language generation for spoken dialogue systems.",
            "13 years of speaker recognition research at BUT, with longitudinal analysis of NIST SRE.",
            "Knowledge-Grounded Response Generation with Deep Attentional Latent-Variable Model.",
            "Learning Multi-Level Information for Dialogue Response Selection by Highway Recurrent Transformer.",
            "Multilingual stance detection in social media political debates.",
            "A low latency sequential model and its user-focused evaluation for automatic punctuation of ASR closed captions.",
            "Transfer learning from adult to children for speech recognition: Evaluation, analysis and recommendations.",
            "Optimization of the area under the ROC curve using neural network supervectors for text-dependent speaker verification.",
            "RAP-Net: Recurrent Attention Pooling Networks for Dialogue Response Selection.",
            "End-to-end response selection based on multi-level context response matching.",
            "Deep generative variational autoencoding for replay spoof detection in automatic speaker verification.",
            "Hierarchical multimodal attention for end-to-end audio-visual scene-aware dialogue response generation.",
            "Generalized end-to-end detection of spoofing attacks to automatic speaker recognizers.",
            "Leveraging Linguistic Context in Dyadic Interactions to Improve Automatic Speech Recognition for Children.",
            "Transfer learning for multimodal dialog.",
            "Cluster-based beam search for pointer-generator chatbot grounded by knowledge.",
            "Determination of glottal closure instants from clean and telephone quality speech signals using single frequency filtering.",
            "Novel textual features for language modeling of intra-sentential code-switching data.",
            "Vocal tract shaping of emotional speech.",
            "Investigating topics, audio representations and attention for multimodal scene-aware dialog.",
            "Hybrid-task learning for robust automatic speech recognition.",
            "Replay spoofing countermeasure using autoencoder and siamese networks on ASVspoof 2019 challenge.",
            "ASVspoof 2019: A large-scale public database of synthesized, converted and replayed speech.",
            "Replay anti-spoofing countermeasure based on data augmentation with post selection.",
            "Corrigendum to 'Extensions to Hybrid Code Networks for FAIR Dialog Data' Computer Speech & Language volume 53 (2019) Pages 80-91.",
            "Multilingual and unsupervised subword modeling for zero-resource languages.",
            "tax2vec: Constructing Interpretable Features from Taxonomies for Short Text Classification.",
            "Linguistic features and automatic classifiers for identifying mild cognitive impairment and dementia.",
            "TOP-Rank: A TopicalPostionRank for Extraction and Classification of Keyphrases in Text.",
            "Automatic assessment of intelligibility in speakers with dysarthria from coded telephone speech using glottal features.",
            "Analysis of gender and identity issues in depression detection on de-identified speech.",
            "Emotion recognition in low-resource settings: An evaluation of automatic feature selection methods.",
            "Variational model for low-resource natural language generation in spoken dialogue systems.",
            "Towards a speech therapy support system based on phonological processes early detection.",
            "LIS-Net: An end-to-end light interior search network for speech command recognition.",
            "Voice spoofing detection corpus for single and multi-order audio replays.",
            "Detection of speech playback attacks using robust harmonic trajectories.",
            "A Korean named entity recognition method using Bi-LSTM-CRF and masked self-attention.",
            "HSCJN: A holistic semantic constraint joint network for diverse response generation.",
            "Assessing the effect of visual servoing on the performance of linear microphone arrays in moving human-robot interaction scenarios.",
            "A neural network approach for speech activity detection for Apollo corpus.",
            "Part-of-speech tagging for Arabic tweets using CRF and Bi-LSTM.",
            "Speaker clustering quality estimation with logistic regression.",
            "Detection of replay spoof speech using teager energy feature cues."
        ]
    },
    {
        "name": "Computer Speech and Language",
        "year": "2019",
        "info": "2019: Volumes\n53,\n54,\n55,\n56,\n57,\n58",
        "count": 82,
        "papers": [
            "Vocal effort compensation for MFCC feature extraction in a shouted versus normal speaker recognition task.",
            "End-to-end task dependent recurrent entity network for goal-oriented dialog learning.",
            "Extracting parallel fragments from comparable documents using a generative model.",
            "Efficient estimation and model generalization for the totalvariability model.",
            "Dementia detection using automatic analysis of conversations.",
            "Extensions to hybrid code networks for FAIR dialog dataset.",
            "Situation awareness in the speech therapy domain: A systematic mapping study.",
            "Multilingual word embeddings for the assessment of narrative speech in mild cognitive impairment.",
            "An investigation of linguistic stress and articulatory vowel characteristics for automatic depression classification.",
            "Affective and behavioural computing: Lessons learnt from the First Computational Paralinguistics Challenge.",
            "Identifying Mild Cognitive Impairment and mild Alzheimer's disease based on spontaneous speech using ASR and linguistic features.",
            "Feature-space SVM adaptation for speaker adapted word prominence detection.",
            "A Bi-LSTM memory network for end-to-end goal-oriented dialog learning.",
            "Prosodic boundary detection using syntactic and acoustic information.",
            "Language models, surprisal and fantasy in Slavic intercomprehension.",
            "Searching for discriminative words in multidimensional continuous feature space.",
            "Modeling content and structure for abstractive review summarization.",
            "Associative knowledge feature vector inferred on external knowledge base for dialog state tracking.",
            "Quantized Dialog - A general approach for conversational systems.",
            "Dialogue breakdown detection robust to variations in annotators and dialogue systems.",
            "Building a supertagger for Spanish HPSG.",
            "A scalable wideband speech codec using the wavelet packet transform based on the internet low bitrate codec.",
            "Enhancing generative conversational service agents with dialog history and external knowledge.",
            "Spectral and temporal manipulations of SFF envelopes for enhancement of speech intelligibility in noise.",
            "Improving LSTM CRFs using character-based compositions for Korean named entity recognition.",
            "Adversarial training and decoding strategies for end-to-end neural conversation models.",
            "Empirical feature analysis for dialogue breakdown detection*.",
            "Synthesised bigrams using word embeddings for code-switched ASR of four South African language pairs.",
            "A unified framework and models for integrating translation memory into phrase-based statistical machine translation.",
            "Overview of the sixth dialog system technology challenge: DSTC6.",
            "Combining spectral and temporal modification techniques for speech intelligibility enhancement.",
            "Tracking depression severity from audio and video based on speech articulatory coordination.",
            "Exploiting social and local contexts propagation for inducing Chinese microblog-specific sentiment lexicons.",
            "DBMiP: A pre-training method for information propagation over deep networks.",
            "Synthesising visual speech using dynamic visemes and deep learning architectures.",
            "Estimating post-editing time using a gold-standard set of machine translation errors.",
            "Automatic classification of speech overlaps: Feature representation and algorithms.",
            "Language-independent acoustic cloning of HTS voices.",
            "System-independent ASR error detection and classification using Recurrent Neural Network.",
            "Automatic evaluation of end-to-end dialog systems with adequacy-fluency metrics.",
            "Corrigendum to 'A unified framework and models for integrating translation memory into phrase-based statistical machine translation' [Volume 54, March 2019, Pages 176-206].",
            "Vector sentences representation for data selection in statisticalmachine translation.",
            "Toward differential diagnosis of autism spectrum disorder using multimodal behavior descriptors and executive functions.",
            "Improving sentiment analysis performance on morphologically rich languages: Language and domain independent approach.",
            "Learning English-Chinese bilingual word representations from sentence-aligned parallel corpus.",
            "CV Retrieval System based on job description matching using hybrid word embeddings.",
            "An automated assessment framework for atypical prosody and stereotyped idiosyncratic phrases related to autism spectrum disorder.",
            "Empirical evaluation of compounds indexing for Turkish texts.",
            "Unsupervised sentence representations as word information series: Revisiting TF-IDF.",
            "Semantic vector learning for natural language understanding.",
            "Microblog summarization using Paragraph Vector and semantic structure.",
            "Automatic sub-word unit discovery and pronunciation lexicon induction for ASR with application to under-resourced languages.",
            "Improved vocal tract model for the elongation of segment lengths in a real time.",
            "On the feasibility of using a bispectral measure as a nonintrusive predictor of speech intelligibility.",
            "Nar-A-Viz: A methodology to visually extract the narrative structure of text.",
            "Single document keyword extraction via quantifying higher-order structural features of word co-occurrence graph.",
            "Joint dialog act segmentation and recognition in human conversations using attention to dialog context.",
            "Studying emotions in Romanian words using Formal Concept Analysis.",
            "A model of synesthetic metaphor interpretation based on cross-modality similarity.",
            "Third International Conference on Statistical Language and Speech Processing, SLSP 2015 Preface.",
            "Polysemy and brevity versus frequency in language.",
            "Making sense of kernel spaces in neural learning.",
            "Should one use term proximity or multi-word terms for Arabic information retrieval?",
            "Online learning for effort reduction in interactive neural machine translation.",
            "A novel approach to remove outliers for parallel voice conversion.",
            "A framework for speaker retrieval and identification through unsupervised learning.",
            "Vocal Tract Length Normalization using a Gaussian mixture model framework for query-by-example spoken term detection.",
            "Effects of sentence structure and word complexity on intelligibility in machine-to-human communications.",
            "Neural sentence fusion for diversity driven abstractive multi-document summarization.",
            "ALTIS: A new algorithm for adaptive long-term SNR estimation in multi-talker babble.",
            "Recurrent out-of-vocabulary word detection based on distribution of features.",
            "NSQM: A non-intrusive assessment of speech quality using normalized energies of the neurogram.",
            "Predicting emotional reactions to news articles in social networks.",
            "Unsupervised-learning-based keyphrase extraction from a single document by the effective combination of the graph-based model and the modified C-value method.",
            "Articulatory and bottleneck features for speaker-independent ASR of dysarthric speech.",
            "Character convolutions for Arabic Named Entity Recognition with Long Short-Term Memory Networks.",
            "Vocoder-free text-to-speech synthesis incorporating generative adversarial networks using low-/multi-frequency STFT amplitude spectra.",
            "Residual convolutional neural network with attentive feature pooling for end-to-end language identification from short-duration speech.",
            "Deep domain adaptation for anti-spoofing in speaker verification systems.",
            "Analysis of DNN Speech Signal Enhancement for Robust Speaker Recognition.",
            "Neural adversarial learning for speaker recognition.",
            "Preserving privacy in speaker and speech characterisation."
        ]
    },
    {
        "name": "Computer Speech and Language",
        "year": "2018",
        "info": "2018: Volumes\n47,\n48,\n49,\n50,\n51,\n52",
        "count": 60,
        "papers": [
            "Phonetic realization of English lexical stress by native (L1) Bengali speakers compared to native (L1) English speakers.",
            "Restricted Boltzmann machines for vector representation of speech in speaker recognition.",
            "Uncertainty weighting and propagation in DNN-HMM-based speech recognition.",
            "Dempster-Shafer theory for enhanced statistical model-based voice activity detection.",
            "Combining sentence similarities measures to identify paraphrases.",
            "Audio-visual synchronization in reading while listening to texts: Effects on visual behavior and verbal learning.",
            "A methodology for turn-taking capabilities enhancement in Spoken Dialogue Systems using Reinforcement Learning.",
            "RankUp: Enhancing graph-based keyphrase extraction methods with error-feedback propagation.",
            "Semi-supervised speech activity detection with an application to automatic speaker verification.",
            "Optimal sensor placement in electromagnetic articulography recording for speech production study.",
            "On the effects of using word2vec representations in neural networks for dialogue act recognition.",
            "Using Chinese radical parts for sentiment analysis and domain-dependent seed set extraction.",
            "Automatic quality estimation for ASR system combination.",
            "Improving PLDA speaker verification performance using domain mismatch compensation techniques.",
            "Incorporating pass-phrase dependent background models for text-dependent speaker verification.",
            "Speech understanding for spoken dialogue systems: From corpus harvesting to grammar rule induction.",
            "Improvements to harmonic model for extracting better speech features in clinical applications.",
            "Cepstral distance based channel selection for distant speech recognition.",
            "Sparse coding based features for speech units classification.",
            "Situated reference resolution using visual saliency and crowdsourcing-based priors for a spoken dialog system within vehicles.",
            "Audio-visual word prominence detection from clean and noisy speech.",
            "Synthetic speech detection using fundamental frequency variation and spectral features.",
            "Predicting speech intelligibility with deep neural networks.",
            "Application of the pairwise variability index of speech rhythm with particle swarm optimization to the classification of native and non-native accents.",
            "Prediction of a hotspot pattern in keyword search results.",
            "Assessment of pitch-adaptive front-end signal processing for children's speech recognition.",
            "Learning static spectral weightings for speech intelligibility enhancement in noise.",
            "Exploiting automatic speech recognition errors to enhance partial and synchronized caption for facilitating second language listening.",
            "Rank-1 constrained Multichannel Wiener Filter for speech recognition in noisy environments.",
            "Neural versus phrase-based MT quality: An in-depth analysis on English-German and English-French.",
            "Conversational telephone speech recognition for Lithuanian.",
            "Localizing speakers in multiple rooms by using Deep Neural Networks.",
            "Speaker and language recognition and characterization: Introduction to the CSL special issue.",
            "An empirical study on POS tagging for Vietnamese social media text.",
            "Automatic temporal ranking of children's engagement levels using multi-modal cues.",
            "Annotating and modeling empathy in spoken conversations.",
            "Automatic analysis of pronunciations for children with speech sound disorders.",
            "Inferring stance in news broadcasts from prosodic-feature configurations.",
            "Sequential use of spectral models to reduce deletion and insertion errors in vowel detection.",
            "Computer based speech prosody teaching system.",
            "Automatic speaker, age-group and gender identification from children's speech.",
            "One-on-one and small group conversations with an intelligent virtual science tutor.",
            "Using a PCA-based dataset similarity measure to improve cross-corpus emotion recognition.",
            "Reward estimation for dialogue policy optimisation.",
            "A hierarchical linguistic information-based model of English prosody: L2 data analysis and implications for computer-assisted language learning.",
            "A multilinear tongue model derived from speech related MRI data of the human vocal tract.",
            "A new proof of a contrast function for bounded component analysis and further analysis.",
            "A novel rule based machine translation scheme from Greek to Greek Sign Language: Production of different types of large corpora and Language Models evaluation.",
            "Analysis of speech production real-time MRI.",
            "Perception and prediction of speaker appeal - A single speaker study.",
            "Design of mixture of GMMs for Query-by-Example Spoken Term Detection.",
            "Automatic orthographic error tagging and classification for German texts.",
            "The translator's visibility: Detecting translatorial fingerprints in contemporaneous parallel translations.",
            "Nonparametrically trained PLDA for short duration i-vector speaker verification.",
            "Comparing human and automatic speech recognition in simple and complex acoustic scenes.",
            "Comparing heterogeneous visual gestures for measuring the diversity of visual speech signals.",
            "Reducing footprint of unit selection based text-to-speech system using compressed sensing and sparse representation.",
            "Automatic cohesive summarization with pronominal anaphora resolution.",
            "On the use of acoustic features for automatic disambiguation of homophones in spontaneous German.",
            "Combining evidences from magnitude and phase information using VTEO for person recognition using humming."
        ]
    },
    {
        "name": "Computer Speech and Language",
        "year": "2017",
        "info": "2017: Volumes\n41,\n42,\n43,\n44,\n45,\n46",
        "count": 92,
        "papers": [
            "Modeling of learning curves with applications to POS tagging.",
            "Automatic sentence stress feedback for non-native English learners.",
            "A simple generative model of incremental reference resolution for situated dialogue.",
            "Implicit processing of LP residual for language identification.",
            "Parametric representation of excitation source information for language identification.",
            "Manipulation of the prosodic features of vocal tract length, nasality and articulatory precision using articulatory synthesis.",
            "Improving selection of synsets from WordNet for domain-specific word sense disambiguation.",
            "Divergence-based fine pruning of phrase-based statistical translation model.",
            "Domain compensation based on phonetically discriminative features for speaker verification.",
            "Acoustic adaptation to dynamic background conditions with asynchronous transformations.",
            "Building DNN acoustic models for large vocabulary speech recognition.",
            "ATSSC: Development of an approach based on soft computing for text summarization.",
            "Estimating acoustic speech features in low signal-to-noise ratios using a statistical framework.",
            "Spoofing voice verification systems with statistical speech synthesis using limited adaptation data.",
            "Generation of creaky voice for improving the quality of HMM-based speech synthesis.",
            "A simplification-translation-restoration framework for domain adaptation in statistical machine translation: A case study in medical record translation.",
            "Unsupervised classification of speaker roles in multi-participant conversational speech.",
            "Speech vocoding for laboratory phonology.",
            "SVitchboard-II and FiSVer-I: Crafting high quality and low complexity conversational english speech corpora using submodular function optimization.",
            "Sparse coding over redundant dictionaries for fast adaptation of speech recognition system.",
            "Intonation classification for L2 English speech using multi-distribution deep neural networks.",
            "Multi-domain evaluation framework for named entity recognition tools.",
            "Parallel fragments : Measuring their impact on translation performance.",
            "Cross database audio visual speech adaptation for phonetic spoken term detection.",
            "Speech enhancement using sparse dictionary learning in wavelet packet transform domain.",
            "Regularization of neural network model with distance metric learning for i-vector based spoken language identification.",
            "Generalisation in named entity recognition: A quantitative analysis.",
            "Generalized Viterbi-based models for time-series segmentation and clustering applied to speaker diarization.",
            "On the relevance of auditory-based Gabor features for deep learning in robust speech recognition.",
            "Identifying characteristic prosodic patterns through the analysis of the information of Sp_ToBI label sequences.",
            "Partial matching and search space reduction for QbE-STD.",
            "Discriminative subspace modeling of SNR and duration variabilities for robust speaker verification.",
            "Fast i-vector denoising using MAP estimation and a noise distributions database for robust speaker recognition.",
            "Hierarchical representation and estimation of prosody using continuous wavelet transform.",
            "On integrating a language model into neural machine translation.",
            "Context-dependent word representation for neural machine translation.",
            "Domain adaptation using neural network joint model.",
            "Machine translation evaluation with neural networks.",
            "Interactive neural machine translation.",
            "Source sentence simplification for statistical machine translation.",
            "Multi-way, multilingual neural machine translation.",
            "Öhman returns: New horizons in the collection and analysis of imaging data in speech production research.",
            "Methods for eliciting, annotating, and analyzing databases for child speech development.",
            "Crowd-sourcing prosodic annotation.",
            "Multilingual processing of speech via web services.",
            "Toward a format-neutral annotation store.",
            "Supporting accessibility and reproducibility in language research in the Alveo virtual laboratory.",
            "EMU-SDMS: Advanced speech database management and analysis in R.",
            "PLDA-based mean shift speakers' short segments clustering.",
            "Fusion of auditory inspired amplitude modulation spectrum and cepstral features for whispered and normal speech speaker verification.",
            "A PLDA approach for language and text independent speaker recognition.",
            "Likelihood ratio-based forensic voice comparison with higher level features: research and reality.",
            "Fast scoring for PLDA with uncertainty propagation via i-vector grouping.",
            "Constant Q cepstral coefficients: A spoofing countermeasure for automatic speaker verification.",
            "Modeling the clarification potential of instructions: Predicting clarification requests and other reactions.",
            "Dialogue manager domain adaptation using Gaussian process reinforcement learning.",
            "Anomaly-based annotation error detection in speech-synthesis corpora.",
            "Reversible speaker de-identification using pre-trained transformation functions.",
            "Text-dependent speaker verification based on i-vectors, Neural Networks and Hidden Markov Models.",
            "Adaptive speaker diarization of broadcast news based on factor analysis.",
            "Constructing a Natural Language Inference dataset using generative neural networks.",
            "A time-sensitive historical thesaurus-based semantic tagger for deep semantic annotation.",
            "Estimation of glottal closure instants from degraded speech using a phase-difference-based algorithm.",
            "A segmental framework for fully-unsupervised large-vocabulary speech recognition.",
            "Towards the next generation of speech tools and corpora.",
            "Influence of speaker familiarity on blind and visually impaired children's and young adults' perception of synthetic voices.",
            "Characterisation of voice quality of Parkinson's disease using differential phonological posterior features.",
            "Lexicon-free fingerspelling recognition from video: Data, models, and signer adaptation.",
            "Scalable algorithms for unsupervised clustering of acoustic data for speech recognition.",
            "Spoken language understanding and interaction: machine learning for human-like conversational systems.",
            "Multilingually trained bottleneck features in spoken language recognition.",
            "Emotion, age, and gender classification in children's speech by humans and machines.",
            "Improving the understanding of spoken referring expressions through syntactic-semantic and contextual-phonetic error-correction.",
            "A Framework for pre-training hidden-unit conditional random fields and its extension to long short term memory networks.",
            "Unsupervised crosslingual adaptation of tokenisers for spoken language recognition.",
            "Using speech technology for quantifying behavioral characteristics in peer-led team learning sessions.",
            "Introduction to the special issue on deep learning approaches for machine translation.",
            "A generic neural acoustic beamforming architecture for robust multi-channel speech processing.",
            "Multi-microphone speech recognition in everyday environments.",
            "Robust coherence-based spectral enhancement for speech recognition in adverse real-world environments.",
            "Multi-microphone speech recognition integrating beamforming, robust feature extraction, and advanced DNN/RNN backend.",
            "Room-localized spoken command recognition in multi-room, multi-microphone environments.",
            "A combined evaluation of established and new approaches for speech recognition in varied reverberation conditions.",
            "Acoustic model training based on node-wise weight boundary model for fast and small-footprint deep neural networks.",
            "Multi-style learning with denoising autoencoders for acoustic modeling in the internet of things (IoT).",
            "Bayesian feature enhancement using independent vector analysis and reverberation parameter re-estimation for noisy reverberant speech recognition.",
            "An information fusion framework with multi-channel feature concatenation and multi-perspective system combination for the deep-learning-based robust recognition of microphone array speech.",
            "An analysis of environment, microphone and data simulation mismatches in robust speech recognition.",
            "Multi-Channel Speech Enhancement and Amplitude Modulation Analysis for Noise Robust Automatic Speech Recognition.",
            "Speech enhancement for robust automatic speech recognition: Evaluation using a baseline system and instrumental measures.",
            "DNN adaptation by automatic quality estimation of ASR hypotheses.",
            "The third 'CHiME' speech separation and recognition challenge: Analysis and outcomes."
        ]
    },
    {
        "name": "Computer Speech and Language",
        "year": "2016",
        "info": "2016: Volumes\n35,\n36,\n37,\n38,\n39,\n40",
        "count": 60,
        "papers": [
            "Parallel SRP-PHAT for GPUs.",
            "Comparing human and automatic speech recognition in a perceptual restoration experiment.",
            "Robust discriminative training against data insufficiency in PLDA-based speaker verification.",
            "Speech enhancement based on wavelet packet of an improved principal component analysis.",
            "Evaluating the predictions of objective intelligibility metrics for modified and synthetic speech.",
            "New features for speech enhancement using bivariate shrinkage based on redundant wavelet filter-banks.",
            "ALISA: An automatic lightly supervised speech segmentation and alignment tool.",
            "Coherent narrative summarization with a cognitive model.",
            "First International Conference on Statistical Language and Speech Processing, SLSP 2013.",
            "State of the art in statistical methods for language and speech processing.",
            "A unified framework for translation and understanding allowing discriminative joint decoding for multilingual speech semantic interpretation.",
            "Simplifying words in context. Experiments with two lexical resources in Spanish.",
            "Context-aware correction of spelling errors in Hungarian medical documents.",
            "Word segmentation and pronunciation extraction from phoneme sequences through cross-lingual word-to-phoneme alignment.",
            "Bounded cepstral marginalization of missing data for robust speech recognition.",
            "Differenced maximum mutual information criterion for robust unsupervised acoustic model adaptation.",
            "Detecting affective states from text based on a multi-component emotion model.",
            "Speech enhancement using Maximum A-Posteriori and Gaussian Mixture Models for speech and noise Periodogram estimation.",
            "Detecting paralinguistic events in audio stream using context in features and probabilistic decisions.",
            "Getting more from automatic transcripts for semi-supervised language modeling.",
            "Preprocessing for elderly speech recognition of smart devices.",
            "Automatic detection of stridence in speech using the auditory model.",
            "On the feasibility of character n-grams pseudo-translation for Cross-Language Information Retrieval tasks.",
            "Speech Production in Speech Technologies: Introduction to the CSL Special Issue.",
            "Integrating articulatory data in deep neural network-based acoustic modeling.",
            "Speaker verification based on the fusion of speech acoustics and inverted articulatory signals.",
            "Articulatory feature-based pronunciation modeling.",
            "Articulatory feature based continuous speech recognition using probabilistic lexical modeling.",
            "Data driven articulatory synthesis with deep neural networks.",
            "Statistical conversion of silent articulation into audible speech using full-covariance HMM.",
            "Principal differential analysis for detection of bilabial closure gestures from articulatory data.",
            "Quantitative systematic analysis of vocal tract data.",
            "Directly data-derived articulatory gesture-like representations retain discriminatory information about phone categories.",
            "Application of continuous state Hidden Markov Models to a classical problem in speech recognition.",
            "Nonlinear interactive source-filter models for speech.",
            "Computing scores of voice quality and speech intelligibility in tracheoesophageal speech for speech stimuli of varying lengths.",
            "Speaker-adapted confidence measures for speech recognition of video lectures.",
            "Weighted hierarchical archetypal analysis for multi-document summarization.",
            "Analysis of engagement behavior in children during dyadic interactions using prosodic cues.",
            "Capitalizing on musical rhythm for prosodic training in computer-aided language learning.",
            "Information density and overlap in spoken dialogue.",
            "Systematic review of virtual speech therapists for speech disorders.",
            "Ensemble of deep neural networks using acoustic environment classification for statistical model-based voice activity detection.",
            "Phrase-boundary model for statistical machine translation.",
            "Locally learning heterogeneous manifolds for phonetic classification.",
            "Concept-to-Speech generation with knowledge sharing for acoustic modelling and utterance filtering.",
            "Impact of Word Error Rate on theme identification task of highly imperfect human-human conversations.",
            "Multilingual Spoken Language Understanding using graphs and multiple translations.",
            "Sparse kernel machines with empirical kernel maps for PLDA speaker verification.",
            "Assessing sentence similarity through lexical, syntactic and semantic analysis.",
            "Prediction of Chinese word-formation patterns using the layer-weighted semantic graph-based KFP-MCO classifier.",
            "Unsupervised language identification based on Latent Dirichlet Allocation.",
            "A silent speech system based on permanent magnet articulography and direct synthesis.",
            "Sentence alignment using local and global information.",
            "Information theoretic optimal vocal tract region selection from real time magnetic resonance images for broad phonetic class recognition.",
            "Semantic language models with deep neural networks.",
            "A study of speaker clustering for speaker attribution in large telephone conversation datasets.",
            "On the use of deep feedforward neural networks for automatic language identification.",
            "Topic modeling of Chinese language beyond a bag-of-words.",
            "Integrated concept blending with vector space models."
        ]
    },
    {
        "name": "Computer Speech and Language",
        "year": "2015",
        "info": "2015: Volumes\n30,\n31,\n32,\n33,\n34",
        "count": 46,
        "papers": [
            "Non-Linear Speech Processing (NOLISP 2013).",
            "Interpretable parametric voice conversion functions based on Gaussian mixture models and constrained transformations.",
            "Tracheoesophageal speech: A dedicated objective acoustic assessment.",
            "Feature extraction based on the high-pass filtering of audio signals for Acoustic Event Classification.",
            "Feature selection for spontaneous speech analysis to aid in Alzheimer's disease diagnosis: A fractal dimension approach.",
            "A survey on the application of recurrent neural networks to statistical language modeling.",
            "Analysis of production characteristics of laughter.",
            "Relevance factor of maximum a posteriori adaptation for GMM-NAP-SVM in speaker and language recognition.",
            "Robust continuous digit recognition using Reservoir Computing.",
            "A perceptually-motivated low-complexity instantaneous linear channel normalization technique applied to speaker verification.",
            "Native and non-native class discrimination using speech rhythm- and auditory-based cues.",
            "Measuring the impact of translation on the accuracy and fluency of vocabulary acquisition of English.",
            "Environmentally robust ASR front-end for deep neural network acoustic models.",
            "From rule-based to data-driven lexical entrainment models in spoken dialog systems.",
            "Editorial.",
            "Latest trends in hybrid machine translation and its applications.",
            "Linguistically-augmented perplexity-based data selection for language models.",
            "A tree does not make a well-formed sentence: Improving syntactic string-to-tree statistical machine translation with more linguistic knowledge.",
            "A generalised alignment template formalism and its application to the inference of shallow-transfer machine translation rules from scarce bilingual corpora.",
            "Translating noun compounds using semantic relations.",
            "Translating without in-domain corpus: Machine translation post-editing with online learning techniques.",
            "Hybrid Arabic-French machine translation using syntactic re-ordering and morphological pre-processing.",
            "Using decision tree to hybrid morphology generation of Persian verb for English-Persian translation.",
            "Four-participant group conversation: A facilitation robot controlling engagement density as the fourth participant.",
            "Unsupervised segmentation of the vocal tract from real-time MRI sequences.",
            "Two dimensional featured one dimensional digital waveguide model for the vocal tract.",
            "Experimenting a discriminative possibilistic classifier with reweighting model for Arabic morphological disambiguation.",
            "Latent semantics in language models.",
            "Evaluation of speech-based HMI concepts for information exchange tasks: A driving simulator study.",
            "Recurrent neural network language model adaptation with curriculum learning.",
            "Improving translation quality stability using Bayesian predictive adaptation.",
            "Multiple topic identification in human/human conversations.",
            "Text-to-speech synthesis system with Arabic diacritic recognition system.",
            "Opinion summarization on spontaneous conversations.",
            "Introduction for Speech and language for interactive robots.",
            "A survey on sound source localization in robotics: From binaural to array processing methods.",
            "Subspace-based DOA with linear phase approximation and frequency bin selection preprocessing for interactive robots in noisy environments.",
            "Robust speaker localization for real-world robots.",
            "Employing distance-based semantics to interpret spoken referring expressions.",
            "Situated language understanding for a spoken dialog system within vehicles.",
            "The roles and recognition of Haptic-Ostensive actions in collaborative multimodal human-human dialogues.",
            "A hybrid approach to dialogue management based on probabilistic rules.",
            "Reinforcement-learning based dialogue system for human-robot interactions with socially-inspired rewards.",
            "Conversational system for information navigation based on POMDP with user focus tracking.",
            "Emotion transplantation through adaptation in HMM-based speech synthesis.",
            "HMM-based expressive singing voice synthesis with singing style control and robust pitch modeling."
        ]
    },
    {
        "name": "Computer Speech and Language",
        "year": "2015",
        "info": "Volume 29: 2015",
        "count": 14,
        "papers": [
            "Leveraging social Q&A collections for improving complex question answering.",
            "Unsupervised language model adaptation using LDA-based mixture models and latent semantic marginals.",
            "Random Indexing and Modified Random Indexing based approach for extractive text summarization.",
            "A swarm-inspired re-ranker system for statistical machine translation.",
            "Topic segmentation of TV-streams by watershed transform and vectorization.",
            "A hybrid refinement scheme for intra- and cross-corpora phonetic segmentation.",
            "Introduction.",
            "A Survey on perceived speaker traits: Personality, likability, pathology, and the first challenge.",
            "Automatic intelligibility classification of sentence-level pathological speech.",
            "Feature selection methods and their combinations in high-dimensional classification of speaker likability, intelligibility and personality traits.",
            "Fully automated assessment of the severity of Parkinson's disease from speech.",
            "Speaker-sensitive emotion recognition via ranking: Studies on acted and spontaneous speech.",
            "Acoustic and lexical representations for affect prediction in spontaneous conversations.",
            "Comparing the acoustic expression of emotion in the speaking and the singing voice."
        ]
    },
    {
        "name": "Computer Speech and Language",
        "year": "2014",
        "info": "Volume 28: 2014",
        "count": 77,
        "papers": [
            "Computational approaches to subjectivity and sentiment analysis: Present and envisaged methods and applications.",
            "Sense-level subjectivity in a multilingual setting.",
            "SAMAR: Subjectivity and sentiment analysis for Arabic social media.",
            "Automatically annotating a five-billion-word corpus of Japanese blogs for sentiment and affect analysis.",
            "Comparative experiments using supervised learning and machine translation for multilingual sentiment analysis.",
            "Prior and contextual emotion of words in sentential context.",
            "Ranked WordNet graph for Sentiment Polarity Classification in Twitter.",
            "Exploring high-level features for detecting cyberpedophilia.",
            "I-vector based speaker recognition using advanced channel compensation techniques.",
            "An improved two-stage mixed language model approach for handling out-of-vocabulary words in large vocabulary continuous speech recognition.",
            "An adaptive neural control scheme for articulatory synthesis of CV sequences.",
            "Direct construction of compact context-dependency transducers from data.",
            "Semantic spaces for improving language modeling.",
            "Unsupervised training of an HMM-based self-organizing unit recognizer with applications to topic classification and keyword discovery.",
            "Inferring social nature of conversations from words: Experiments on a corpus of everyday telephone conversations.",
            "Situated incremental natural language understanding using Markov Logic Networks.",
            "Normalization of informal text.",
            "Shape-based modeling of the fundamental frequency contour for emotion detection in speech.",
            "A study of voice activity detection techniques for NIST speaker recognition evaluations.",
            "Classification of social laughter in natural conversational speech.",
            "A fuzzy classifier to deal with similarity between labels on automatic prosodic labeling.",
            "Introduction to the Special Issue on Broadening the View on Speaker Analysis.",
            "Medium-term speaker states - A review on intoxication, sleepiness and the first challenge.",
            "Intoxicated speech detection: A fusion framework with speaker-normalized hierarchical functionals and GMM supervectors.",
            "Speaker state classification based on fusion of asymmetric simple partial least squares (SIMPLS) and support vector machines.",
            "Level of interest sensing in spoken dialog using decision-level fusion of acoustic and lexical evidence.",
            "Analysis of voice features related to obstructive sleep apnoea and their application in diagnosis support.",
            "Vocal fatigue induced by prolonged oral reading: Analysis and detection.",
            "Robust automatic intelligibility assessment techniques evaluated on speakers treated for head and neck cancer.",
            "Modeling phonetic pattern variability in favor of the creation of robust emotion classifiers for real-life applications.",
            "Automatic evaluation of singing enthusiasm for karaoke.",
            "Computing vocal entrainment: A signal-derived PCA-based quantification scheme with application to affect analysis in married couple interactions.",
            "Introduction to the Special Issue on The listening talker: context-dependent speech production and perception.",
            "The listening talker: A review of human and algorithmic context-induced modifications of speech.",
            "Does the signal-to-noise ratio of an interlocutor influence a speaker's vocal intensity?",
            "Speaking in noise: How does the Lombard effect improve acoustic contrasts between speech and ambient noise?",
            "Comparing the consistency and distinctiveness of speech produced in quiet and in noise.",
            "Animated Lombard speech: Motion capture, facial animation and visual intelligibility of speech produced in adverse conditions.",
            "An adaptive post-filtering method producing an artificial Lombard-like effect for intelligibility enhancement of narrowband telephone speech.",
            "Approaching speech intelligibility enhancement with inspiration from Lombard and Clear speaking styles.",
            "Synthesis and perception of breathy, normal, and Lombard speech in the presence of noise.",
            "Intelligibility enhancement of HMM-generated speech in additive noise by modifying Mel cepstral coefficients to increase the glimpse proportion.",
            "Analysis and HMM-based synthesis of hypo and hyperarticulated speech.",
            "Incorporating local information of the acoustic environments to MAP-based feature compensation and acoustic model adaptation.",
            "Class-specific multiple classifiers scheme to recognize emotions from speech signals.",
            "A domain-independent statistical methodology for dialog management in spoken dialog systems.",
            "Effect of acoustic and linguistic contexts on human and machine speech recognition.",
            "A rule-based translation from written Spanish to Spanish Sign Language glosses.",
            "Collecting and evaluating the CUNY ASL corpus for research on American Sign Language animation.",
            "Automatic scoring for answers to Arabic test questions.",
            "Speech energy redistribution for intelligibility improvement in noise based on a perceptual distortion measure.",
            "Real user evaluation of a POMDP spoken dialogue system using automatic belief compression.",
            "Feature enhancement by deep LSTM networks for ASR in reverberant multisource environments.",
            "Data-driven models for timing feedback responses in a Map Task dialogue system.",
            "Web-based possibilistic language models for automatic speech recognition.",
            "Simplified supervised i-vector modeling with application to robust and efficient language identification and speaker verification.",
            "Generation of a phonetic transcription for modern standard Arabic: A knowledge-based model.",
            "Improving recognition of proper nouns in ASR through generating and filtering phonetic transcriptions.",
            "Fast vocabulary acquisition in an NMF-based self-learning vocal user interface.",
            "Editorial for the special issue on spoken content retrieval.",
            "Exploring speech retrieval from meetings using the AMI corpus.",
            "Improved open-vocabulary spoken content retrieval with word and subword lattices using acoustic feature similarity.",
            "Language independent search in MediaEval's Spoken Web Search task.",
            "Feature analysis for discriminative confidence estimation in spoken term detection.",
            "Glottal source processing: From analysis to applications.",
            "Automatic glottal inverse filtering with the Markov chain Monte Carlo method.",
            "The glottaltopogram: A method of analyzing high-speed images of the vocal folds.",
            "On the use of voice descriptors for glottal source shape parameter estimation.",
            "Speaker adaptive voice source modeling with applications to speech coding and processing.",
            "On the impact of excitation and spectral parameters for expressive statistical parametric speech synthesis.",
            "Data-driven detection and analysis of the patterns of creaky voice.",
            "Capitalising on North American speech resources for the development of a South African English large vocabulary speech recognition system.",
            "An iterative longest matching segment approach to speech enhancement with additive noise and channel distortion.",
            "Efficient data selection for speech recognition based on prior confidence estimation using speech and monophone models.",
            "Paraphrastic language models.",
            "A lexicon of multiword expressions for linguistically precise, wide-coverage natural language processing.",
            "Linking bottom-up intonation stylization to discourse structure."
        ]
    },
    {
        "name": "Computer Speech and Language",
        "year": "2013",
        "info": "Volume 27: 2013",
        "count": 68,
        "papers": [
            "Introduction to the special issue on Paralinguistics in Naturalistic Speech and Language.",
            "Paralinguistics in speech and language - State-of-the-art and the challenge.",
            "Vocal markers of emotion: Comparing induction and acting elicitation.",
            "Human and computer recognition of regional accents and ethnic groups from British English speech.",
            "On the development of an automatic voice pleasantness classification and intensity estimation system.",
            "Detecting friendly, flirtatious, awkward, and assertive speech in speed-dates.",
            "Quantification of speech disfluency as a marker of medication-induced cognitive impairment: An application of computerized speech analysis in neuropharmacology.",
            "Speaker state recognition using an HMM-based feature extraction method.",
            "Automatic speaker age and gender recognition using acoustic and prosodic level information fusion.",
            "Automatic detection of speaker state: Lexical, prosodic, and phonetic approaches to level-of-interest and intoxication classification.",
            "A dynamic tonal perception model for optimal pitch stylization.",
            "Universal attribute characterization of spoken languages for automatic spoken language recognition.",
            "Hierarchical ANN system for stuttering identification.",
            "Towards incremental speech generation in conversational systems.",
            "Investigating fuzzy-input fuzzy-output support vector machines for robust voice quality classification.",
            "Analysis of the visual Lombard effect and automatic recognition experiments.",
            "Use of contexts in language model interpolation and adaptation.",
            "Importance sampling to compute likelihoods of noise-corrupted speech.",
            "Cluster-based dynamic variance adaptation for interconnecting speech enhancement pre-processor and speech recognizer.",
            "Fast unsupervised adaptation based on efficient statistics accumulation using frame independent confidence within monophone states.",
            "Automatic speech recognition performance in different room acoustic environments with and without dereverberation preprocessing.",
            "Batch-mode semi-supervised active learning for statistical machine translation.",
            "Stereo hidden Markov modeling for noise robust speech recognition.",
            "Personalising speech-to-speech translation: Unsupervised cross-lingual speaker adaptation for HMM-based speech synthesis.",
            "Unsupervised data processing for classifier-based speech translator.",
            "Training speech translation from audio recordings of interpreter-mediated communication.",
            "BBN TransTalk: Robust multilingual two-way speech-to-speech translation for mobile platforms.",
            "Enriching machine-mediated speech-to-speech translation using contextual information.",
            "A-STAR: Toward translating Asian spoken languages.",
            "Evaluation methodology and metrics employed to assess the TRANSTAC two-way, speech-to-speech translation systems.",
            "Enabling effective design of multimodal interfaces for speech-to-speech translation system: An empirical study of longitudinal user behaviors over time and user strategies for coping with errors.",
            "High-quality bilingual subtitle document alignments with application to spontaneous speech translation.",
            "The IBM speech-to-speech translation system for smartphone: Improvements for resource-constrained tasks.",
            "Special issue on speech separation and recognition in multisource environments.",
            "The PASCAL CHiME speech separation and recognition challenge.",
            "Auditory inspired methods for localization of multiple concurrent speakers.",
            "Tracking of multidimensional TDOA for multiple sources with distributed microphone pairs.",
            "Online blind speech separation using multiple acoustic speaker tracking and time-frequency masking.",
            "Blind source extraction for robust speech recognition in multisource noisy environments.",
            "A stereophonic acoustic signal extraction scheme for noisy and reverberant environments.",
            "Regularized nonnegative matrix factorization using Gaussian mixture priors for supervised single channel source separation.",
            "Modelling non-stationary noise with spectral factorisation in automatic speech recognition.",
            "Noise robust ASR in reverberated multisource environments applying convolutive NMF and Long Short-Term Memory.",
            "Mask estimation and imputation methods for missing data speech recognition in a multisource reverberant environment.",
            "A hearing-inspired approach for distant-microphone speech recognition in the presence of multiple sources.",
            "Integration of beamforming and uncertainty-of-observation techniques for robust ASR in multi-source environments.",
            "Speech recognition in living rooms: Integrated speech enhancement and recognition system based on spatial, spectral and temporal modeling of sounds.",
            "Uncertainty-based learning of acoustic models from noisy data.",
            "Dominant speaker identification for multipoint videoconferencing.",
            "Multiple cameras for audio-visual speech recognition in an automotive environment.",
            "Language model cross adaptation for LVCSR system combination.",
            "Employing hierarchical Bayesian networks in simple and complex emotion topic analysis.",
            "Joint training of non-negative Tucker decomposition and discrete density hidden Markov models.",
            "Phrase-level speech simulation with an airway modulation model of speech production.",
            "Eigenvoice modelling for cross likelihood ratio based speaker clustering: A Bayesian approach.",
            "Improved automatic detection of creak.",
            "A probabilistic approach to pronunciation by analogy.",
            "Speaker verification in score-ageing-quality classification space.",
            "Bridge the gap between statistical and hand-crafted grammars.",
            "Two-stage intonation modeling using feedforward neural networks for syllable based text-to-speech synthesis.",
            "ASR-based exercises for listening comprehension practice in European Portuguese.",
            "Speech and Language processing as assistive technologies.",
            "Acoustic model adaptation using in-domain background models for dysarthric speech recognition.",
            "Adjusting dysarthric speech signals to be more intelligible.",
            "Building personalised synthetic voices for individuals with severe speech impairment.",
            "Towards the improvement of Augmentative and Alternative Communication through the modelling of conversation.",
            "Huffman scanning: Using language models within fixed-grid keyboard emulation.",
            "Automatic word naming recognition for an on-line aphasia treatment system."
        ]
    },
    {
        "name": "Computer Speech and Language",
        "year": "2012",
        "info": "Volume 26: 2012",
        "count": 23,
        "papers": [
            "Joint reranking of parsing and word recognition with automatic segmentation.",
            "A comparative study of glottal source estimation techniques.",
            "A basis representation of constrained MLLR transforms for robust adaptation.",
            "The design and collection of COSINE, a multi-microphone in situ speech corpus recorded in noisy environments.",
            "Integrating imperfect transcripts into speech recognition systems for building high-quality corpora.",
            "Enhancing lexical cohesion measure with confidence measures, semantic relations and language model interpolation for multimedia spoken content topic segmentation.",
            "Mining methodologies from NLP publications: A case study in automatic terminology recognition.",
            "From English pitch accent detection to Mandarin stress detection, where is the difference?",
            "Automatic categorization for improving Spanish into Spanish Sign Language machine translation.",
            "Reinforcement learning for parameter estimation in statistical spoken dialogue systems.",
            "Question answering using statistical language modelling.",
            "Self-learning speaker identification for enhanced speech recognition.",
            "Morphological decomposition in Arabic ASR systems.",
            "A segmental non-parametric-based phoneme recognition approach at the acoustical level.",
            "A text summarizer for Arabic.",
            "Two-stage phone duration modelling with feature construction and feature vector extension for the needs of speech synthesis.",
            "Spotting glottal stop in Amharic in continuous speech.",
            "Factors that affect the accuracy of text-based language identification.",
            "Vocabulary expansion through automatic abbreviation generation for Chinese voice search.",
            "Bioinspired sparse spectro-temporal representation of speech for robust classification.",
            "A monotonic statistical machine translation approach to speaking style transformation.",
            "Language identification using multi-core processors.",
            "The latent words language model."
        ]
    },
    {
        "name": "Computer Speech and Language",
        "year": "2011",
        "info": "Volume 25: 2011",
        "count": 43,
        "papers": [
            "Special issue of computer speech and language on \"affective speech in real-life interactions\".",
            "Whodunnit - Searching for the most important feature types signalling emotion-related user states in speech.",
            "Detecting emotional state of a child in a conversational computer game.",
            "Automatic inference of complex affective states.",
            "Fiction support for realistic portrayals of fear-type emotional manifestations.",
            "Expression of affect in spontaneous speech: Acoustic correlates and automatic detection of irritation and resignation.",
            "Designing and evaluating a wizarded uncertainty-adaptive spoken dialogue tutoring system.",
            "Some background on dialogue management and conversational speech for dialogue systems.",
            "A prototype for a conversational companion for reminiscing about images.",
            "Planning Small Talk behavior with cultural influences for multiagent systems.",
            "The user model-based summarize and refine approach improves information presentation in spoken dialog systems.",
            "Multimodal and mobile conversational Health and Fitness Companions.",
            "Learning what to say and how to say it: Joint optimisation of spoken dialogue management and natural language generation.",
            "Multifunctionality in dialogue.",
            "Building an automated English sentence evaluation system for students learning English as a second language.",
            "Semi-supervised ranking for document retrieval.",
            "A three-stage approach to the automated scoring of spontaneous spoken responses.",
            "Hybrid user intention modeling to diversify dialog simulations.",
            "Applying SVMs and weight-based factor analysis to unsupervised adaptation for speaker verification.",
            "Usability assessment of text-to-speech synthesis for additional detail in an automated telephone banking system.",
            "Semantic and phonetic automatic reconstruction of medical dictations.",
            "Document sentiment classification by exploring description model of topical terms.",
            "The subspace Gaussian mixture model - A structured model for speech recognition.",
            "Topic tracking language model for speech recognition.",
            "Sparse imputation for large vocabulary noise robust ASR.",
            "Modeling nuisance variabilities with factor analysis for GMM-based audio pattern classification.",
            "Automatic identification of discourse markers in dialogues: An in-depth study of like and well.",
            "The efficient incorporation of MLP features into automatic speech recognition systems.",
            "The Vocal Joystick Engine v1.0.",
            "Spoken emotion recognition using hierarchical classifiers.",
            "Sub-band temporal modulation envelopes and their normalization for automatic speech recognition in reverberant environments.",
            "The use of phase in complex spectrum subtraction for robust speech recognition.",
            "Turn-taking cues in task-oriented dialogue.",
            "Network based models of cognitive and social dynamics of human languages.",
            "Network analysis of a corpus of undeciphered Indus civilization inscriptions indicates syntactic organization.",
            "Applications of graph theory to an English rhyming corpus.",
            "Geometric representations of language taxonomies.",
            "Bipartite spectral graph partitioning for clustering dialect varieties and detecting their linguistic features.",
            "Geography of social ontologies: Testing a variant of the Sapir-Whorf Hypothesis in the context of Wikipedia.",
            "RPLSA: A novel updating scheme for Probabilistic Latent Semantic Analysis.",
            "Syntax-based reordering for statistical machine translation.",
            "Social correlates of turn-taking style.",
            "Minimum Bayes Risk decoding and system combination based on a recursion for edit distance."
        ]
    },
    {
        "name": "Computer Speech and Language",
        "year": "2010",
        "info": "Volume 24: 2010",
        "count": 42,
        "papers": [
            "Monaural speech separation and recognition challenge.",
            "Speech separation using speaker-adapted eigenvoice speech models.",
            "Monaural speech separation based on MAXVQ and CASA for robust speech recognition.",
            "Super-human multi-talker speech recognition: A graphical modeling approach.",
            "Combining missing-feature theory, speech enhancement, and speaker-dependent/-independent modeling for speech separation.",
            "A computational auditory scene analysis system for speech segregation and robust speech recognition.",
            "Speech fragment decoding techniques for simultaneous speaker identification and speech recognition.",
            "Modelling text prediction systems in low- and high-inflected languages.",
            "Dynamic visual features for audio-visual speaker verification.",
            "The Hidden Information State model: A practical framework for POMDP-based spoken dialogue management.",
            "Initiative conflicts in task-oriented dialogue.",
            "Dynamic Bayesian networks and variable length genetic algorithm for designing cue-based model for dialogue act recognition.",
            "Study on pharyngeal and uvular consonants in foreign accented Arabic for ASR.",
            "Towards modeling user behavior in interactions mediated through an automated bidirectional speech translation system.",
            "A combination of data mining method with decision trees building for Speech/Music discrimination.",
            "Speech segmentation using regression fusion of boundary predictions.",
            "Cascaded model adaptation for dialog act segmentation and tagging.",
            "Joint evaluation of multiple speech patterns for speech recognition and training.",
            "A wavelet-based parameterization for speech/music discrimination.",
            "Spoken language understanding using weakly supervised learning.",
            "Extending lexical association measures for collocation extraction.",
            "Evaluation of a hierarchical reinforcement learning spoken dialogue system.",
            "Emergent artificial intelligence approaches for pattern recognition in speech and language processing.",
            "Active learning and semi-supervised learning for speech recognition: A unified framework using the global entropy reduction maximization criterion.",
            "Spoken emotion recognition through optimum-path forest classification using glottal features.",
            "Adaptively entropy-based weighting classifiers in combination using Dempster-Shafer theory for word sense disambiguation.",
            "Voice conversion by mapping the speaker-specific features using pitch synchronous approach.",
            "Improving supervised learning for meeting summarization using sampling and regression.",
            "Voice activity detection based on statistical models and machine learning approaches.",
            "Improved voice activity detection algorithm using wavelet and support vector machine.",
            "A real-time trained system for robust speaker verification using relative space of anchor models.",
            "Bayesian update of dialogue state: A POMDP framework for spoken dialogue systems.",
            "Discriminative training of HMMs for automatic speech recognition: A survey.",
            "Hybrid approach to robust dialog management using agenda and dialog examples.",
            "A gain factor adapted by masking property and SNR variation for speech enhancement in colored-noise corruptions.",
            "Discriminative classifiers with adaptive kernels for noise robust speech recognition.",
            "Morpho-syntactic post-processing of N-best lists for improved French automatic speech recognition.",
            "Graphical models for integrating syllabic information.",
            "Recursive n-gram hashing is pairwise independent, at best.",
            "Modeling and synthesis of English regional accents with pitch and duration correlates.",
            "A blog emotion corpus for emotional expression analysis in Chinese.",
            "Dynamic language modeling for European Portuguese."
        ]
    },
    {
        "name": "Computer Speech and Language",
        "year": "2009",
        "info": "Volume 23: 2009",
        "count": 28,
        "papers": [
            "Hybrid statistical pronunciation models designed to be trained by a medium-size corpus.",
            "Missing data mask estimation with frequency and temporal dependencies.",
            "Frequency warping for VTLN and speaker adaptation by linear transformation of standard MFCC.",
            "Automatic pronunciation scoring of words and sentences independent from the non-native's first language.",
            "A machine learning approach to reading level assessment.",
            "Natural language watermarking via morphosyntactic alterations.",
            "GA, MR, FFNN, PNN and GMM based models for automatic text summarization.",
            "Efficient likelihood evaluation and dynamic Gaussian selection for HMM-based speech recognition.",
            "Evolutionary minimization of the Rand index for speaker clustering.",
            "Improving robustness of MLLR adaptation with speaker-clustered regression class trees.",
            "Continuous speech recognition with sparse coding.",
            "Automatic discovery of topics and acoustic morphemes from speech.",
            "Intonation modeling for Indian languages.",
            "Arabic diacritic restoration approach based on maximum entropy models.",
            "An analysis of prosodic information for the recognition of dialogue acts in a multimodal corpus in Mexican Spanish.",
            "Learning-based pronoun resolution for Turkish with a comparative evaluation.",
            "The RavenClaw dialog management framework: Architecture and systems.",
            "An Ngram-based reordering model.",
            "Improving GMM-UBM speaker verification using discriminative feedback adaptation.",
            "A unified framework of HMM adaptation with joint compensation of additive and convolutive distortions.",
            "Combining lexical, syntactic and prosodic cues for improved online dialog act tagging.",
            "A data-driven grapheme-to-phoneme conversion method using dynamic contextual converting rules for Korean TTS systems.",
            "The effect of code-mixing on accent identification accuracy.",
            "Syllabification rules versus data-driven methods in a language with low syllabic complexity: The case of Italian.",
            "Label propagation via bootstrapped support vectors for semantic relation extraction between named entities.",
            "Data-driven user simulation for automated evaluation of spoken dialog systems.",
            "Harnessing graphics processors for the fast computation of acoustic likelihoods in speech recognition.",
            "IXIR: A statistical information distillation system."
        ]
    },
    {
        "name": "Computer Speech and Language",
        "year": "2008",
        "info": "Volume 22: 2008",
        "count": 23,
        "papers": [
            "Discovery of event entailment knowledge from text corpora.",
            "Explicit modelling of session variability for speaker verification.",
            "A modular holistic approach to prosody modelling for Standard Yorùbá speech synthesis.",
            "Kalman tracking of linear predictor and harmonic noise models for noisy speech enhancement.",
            "Towards including prosody in a text-to-speech system for modern standard Arabic.",
            "Applying an analysis of acted vocal emotions to improve the simulation of synthetic speech.",
            "On maximum mutual information speaker-adapted training.",
            "Practical use of non-local features for statistical spoken language understanding.",
            "Differences between acoustic characteristics of spontaneous and read speech and their effects on speech recognition performance.",
            "Cross-validation and aggregated EM training for robust parameter estimation.",
            "Acoustic speech unit segmentation for concatenative synthesis.",
            "On-line Stochastic Matching compensation for non-stationary noise.",
            "User simulation in a stochastic dialog system.",
            "MPE-based discriminative linear transforms for speaker adaptation.",
            "Design and evaluation of prosodically-sensitive concatenative units for a Korean TTS system.",
            "A stopping criterion for active learning.",
            "Phoneme analysis based on quantitative and qualitative entropy measurement.",
            "Semi-supervised learning integrated with classifier combination for word sense disambiguation.",
            "Estimating electropalatographic patterns from the speech signal.",
            "Tone-enhanced generalized character posterior probability (GCPP) for Cantonese LVCSR.",
            "Pronunciation prediction with Default&Refine.",
            "Automatic recognition of German news focusing on future-directed beliefs and intentions.",
            "Large-margin minimum classification error training: A theoretical risk minimization perspective."
        ]
    },
    {
        "name": "Computer Speech and Language",
        "year": "2007",
        "info": "Volume 21: 2007",
        "count": 35,
        "papers": [
            "A fast and memory-efficient N-gram language model lookup method for large vocabulary continuous speech recognition.",
            "Evaluating spoken dialogue systems according to de-facto standards: A case study.",
            "'Early recognition' of polysyllabic words in continuous speech.",
            "Speaker-adaptive learning of resonance targets in a hidden trajectory model of speech coarticulation.",
            "Backoff hierarchical class n-gram language models: effectiveness to model unseen events in speech recognition.",
            "Random forests and the data sparseness problem in language modeling.",
            "Reformulating the HMM as a trajectory model by imposing explicit relationships between static and dynamic feature vector sequences.",
            "Iterative reconstruction of speech from short-time Fourier transform phase and magnitude spectra.",
            "Features based on filtering and spectral peaks in autocorrelation domain for robust speech recognition.",
            "A two-pass approach for handling out-of-vocabulary words in a large vocabulary recognition task.",
            "Automatic pronunciation evaluation of foreign speakers using unknown text.",
            "Environment adaptation for robust speaker verification by cascading maximum likelihood linear regression and reinforced learning.",
            "Prior knowledge guided maximum expected likelihood based model selection and adaptation for nonnative speech recognition.",
            "The common vector approach and its comparison with other subspace methods in case of sufficient data.",
            "Modeling durations of syllables using neural networks.",
            "Accessing speech data using strategic fixation.",
            "A fuzzy decision tree-based duration model for Standard Yorùbá text-to-speech synthesis.",
            "Improving statistical machine translation using shallow linguistic knowledge.",
            "Discriminative n-gram language modeling.",
            "Partially observable Markov decision processes for spoken dialog systems.",
            "Ginisupport vector machines for segmental minimum Bayes risk decoding of continuous speech.",
            "On noise masking for automatic missing data speech recognition: A survey and discussion.",
            "Soft indexing of speech content for search in spoken documents.",
            "Analysing performance in a word prediction system with multiple prediction methods.",
            "Continuous space language models.",
            "Stochastic and syntactic techniques for predicting phrase breaks.",
            "Formant tracking linear prediction model using HMMs and Kalman filters for noisy speech processing.",
            "A segment-based interpretation of HMM/ANN hybrids.",
            "Turkish speech corpora and recognition tools developed by porting SONIC: Towards multilingual speech recognition.",
            "Sentence alignment using P-NNT and GMM.",
            "Learning model order from labeled and unlabeled data for partially supervised classification, with application to word sense disambiguation.",
            "Articulatory feature recognition using dynamic Bayesian networks.",
            "Synthesized speech intelligibility and persuasion: Speech rate and non-native listeners.",
            "Automatic phonetic transcription of large speech corpora.",
            "Discriminative semi-parametric trajectory model for speech recognition."
        ]
    },
    {
        "name": "Computer Speech and Language",
        "year": "2006",
        "info": "Volume 20: 2006",
        "count": 30,
        "papers": [
            "Editorial for computer speech and language.",
            "Multiple resolution analysis for robust automatic speech recognition.",
            "Product of Gaussians for speech recognition.",
            "MAP adaptation of stochastic grammars.",
            "A prosodic phrasing model for a Korean text-to-speech synthesis system.",
            "The architecture and the implementation of a finite state pronunciation lexicon for Turkish.",
            "Improved automatic speech recognition through speaker normalization.",
            "Editorial.",
            "NIST and NFI-TNO evaluations of automatic speaker recognition.",
            "Technical forensic speaker recognition: Evaluation, types and testing of evidence.",
            "Using quality measures for multilevel speaker recognition.",
            "Support vector machines for speaker and language recognition.",
            "Application-independent evaluation of speaker detection.",
            "A syllable-scale framework for language identification.",
            "Step-by-step and integrated approaches in broadcast news speaker diarization.",
            "Robust estimation, interpretation and assessment of likelihood ratios in forensic speaker recognition.",
            "A linguistically motivated approach to grapheme-to-phoneme conversion for Korean.",
            "Adaptation of maximum entropy capitalizer: Little data can help a lot.",
            "Adaptation of children's speech with limited data based on formant-like peak alignment.",
            "Combining language models in the input interface of a spoken dialogue system.",
            "Robust processing techniques for voice conversion.",
            "A study in machine learning from imbalanced data for sentence boundary detection in speech.",
            "Beyond ASR 1-best: Using word confusion networks in spoken language understanding.",
            "Unlimited vocabulary speech recognition with morph language models applied to Finnish.",
            "Articulatory-feature-based confidence measures.",
            "Intonation contour realisation for Standard Yorùbá text-to-speech synthesis: A fuzzy computational approach.",
            "Morphology-based language modeling for conversational Arabic speech recognition.",
            "Making sense of collocations.",
            "Algorithms for data-driven ASR parameter quantization.",
            "Unsupervised grammar induction using history based approach."
        ]
    },
    {
        "name": "Computer Speech and Language",
        "year": "2005",
        "info": "Volume 19: 2005",
        "count": 26,
        "papers": [
            "Recent advances in the multi-stream HMM/ANN hybrid approach to noise robust ASR.",
            "Additive background noise as a source of non-linear mismatch in the cepstral and log-energy domain.",
            "Measuring speech quality for text-to-speech systems: development and assessment of a modified mean opinion score (MOS) scale.",
            "Semantic processing using the Hidden Vector State model.",
            "Improving out-of-vocabulary name resolution.",
            "On-line experimental methods to evaluate text-to-speech (TTS) synthesis: effects of voice gender and signal quality on intelligibility, naturalness and preference.",
            "Evaluation of BIC-based algorithms for audio segmentation.",
            "Language modeling with probabilistic left corner parsing.",
            "A multiple-level linear/linear segmental HMM with a formant-based intermediate layer.",
            "Towards situated speech understanding: visual context priming of language models.",
            "Estimation of stochastic context-free grammars and their use as language models.",
            "A computational approach to the variations in Arabic verbal orthography.",
            "Efficient computation of the frame-based extended union model and its application in speech recognition against partial temporal corruptions.",
            "Using semantic analysis to improve speech recognition performance.",
            "Genericity and portability for task-independent speech recognition.",
            "Introduction to the special issue on multiword expressions: Having a crack at a hard nut.",
            "Comparing and combining a semantic tagger and a statistical tool for MWE extraction.",
            "Deep lexical acquisition of verb-particle constructions.",
            "The availability of verb-particle constructions in lexical resources: How much is enough?",
            "Multiword expressions in spoken language: An exploratory study on pronunciation variation.",
            "Using small random samples for the manual evaluation of statistical association measures.",
            "Learning about the meaning of verb-particle constructions from corpora.",
            "On the semantics of noun compounds.",
            "Disambiguating Japanese compound verbs.",
            "Creative discovery in the lexical \"validation gap\".",
            "A symbolic approach to automatic multiword term structuring."
        ]
    },
    {
        "name": "Computer Speech and Language",
        "year": "2004",
        "info": "Volume 18: 2004",
        "count": 21,
        "papers": [
            "Using rule-induction techniques to model pronunciation variation in Dutch.",
            "Some approaches to statistical and finite-state speech-to-speech translation.",
            "A mixed-level switching dynamic system for continuous speech recognition.",
            "Automatic capitalisation generation for speech input.",
            "A solution to the spurious ambiguity problem for practical Combinatory Categorial Grammar parsers.",
            "A derivation of minimum classification error from the theoretical classification risk using Parzen estimation.",
            "On automatic phonetic transcription quality: lower word error rates do not guarantee better transcriptions.",
            "Contemporaneous text as side-information in statistical language modeling.",
            "Mandarin-English Information (MEI): investigating translingual speech retrieval.",
            "Factor analysed hidden Markov models for speech recognition.",
            "Introduction to the special issue on word sense disambiguation.",
            "Lexical knowledge and human disagreement on a WSD task.",
            "HyperLex: lexical cartography for information retrieval.",
            "Unsupervised word sense disambiguation using WordNet relatives.",
            "Unsupervised and supervised exploitation of semantic domains in lexical disambiguation.",
            "Word sense disambiguation of WordNet glosses.",
            "Probabilistic word sense disambiguation.",
            "Phonetization of Arabic: rules and algorithms.",
            "Pronunciation change in conversational speech and its implications for automatic speech recognition.",
            "Arc minimization in finite-state decoding graphs with cross-word acoustic context.",
            "Broadcast news LM adaptation over time."
        ]
    },
    {
        "name": "Computer Speech and Language",
        "year": "2003",
        "info": "Volume 17: 2003",
        "count": 22,
        "papers": [
            "Classifier-based non-linear projection for adaptive endpointing of continuous speech.",
            "Statistical language modeling based on variable-length sequences.",
            "Topics in decision tree based speech synthesis.",
            "Pronunciation modeling for ASR - knowledge-based and data-derived methods.",
            "Language modelling for Russian and English using words and classes.",
            "Obituary: W. A. (Bill) Ainsworth.",
            "Introduction to the special issue on new computational paradigms for acoustic modeling in speech recognition.",
            "Non-parametric probability estimation for HMM-based automatic speech recognition.",
            "A probabilistic framework for segment-based speech recognition.",
            "Modelling the uncertainty in recovering articulation from acoustics.",
            "Bayesian network structures and inference techniques for automatic speech recognition.",
            "Robust speech recognition and feature extraction using HMM2.",
            "Buried Markov models: a graphical-modeling approach to automatic speech recognition.",
            "Parameter reduction schemes for loosely coupled HMMs.",
            "Dynamic Bayesian networks for multi-band automatic speech recognition.",
            "Speech recognition with unknown partial feature corruption - a review of the union model.",
            "Acoustic model clustering based on syllable structure.",
            "The effect of pruning and compression on graphical representations of the output of a speech recognizer.",
            "Modeling partial pronunciation variations for spontaneous Mandarin speech recognition.",
            "Non-linear feature extraction for robust speech recognition in stationary and non-stationary noise.",
            "Preliminary experiments in speaker verification using time-dependent largest Lyapunov exponents.",
            "Erratum: Language modelling for Russian and English using words and classes [Computer Speech and Language 17 (2003) 87-104]."
        ]
    },
    {
        "name": "Computer Speech and Language",
        "year": "2002",
        "info": "Volume 16: 2002",
        "count": 23,
        "papers": [
            "Advances in Large Vocabulary Speech Recognition.",
            "Structural maximum a posteriori linear regression for fast HMM adaptation.",
            "Large scale discriminative training of hidden Markov models for speech recognition.",
            "Recognition confidence scoring and its use in speech understanding systems.",
            "Weighted finite-state transducers in speech recognition.",
            "An overview of decoding techniques for large vocabulary continuous speech recognition.",
            "Lightly supervised and unsupervised acoustic model training.",
            "Theory and practice of acoustic confusability.",
            "Using phonologically-constrained morphological analysis in continuous speech recognition.",
            "Selection of the most significant parameters for duration modelling in a Spanish text-to-speech system using neural networks.",
            "Hidden Markov model training with contaminated speech material for distant-talking speech recognition.",
            "Transformation streams and the HMM error model.",
            "From within-word model search to across-word model search in large vocabulary continuous speech recognition.",
            "Spoken language generation.",
            "Response planning and generation in the MERCURY flight reservation system.",
            "A conversation acts model for generating spoken dialogue contributions.",
            "Learning visually grounded words and syntax for a scene description task.",
            "Stochastic natural language generation for spoken dialog systems.",
            "Training a sentence planner for spoken dialogue using boosting.",
            "Trainable approaches to surface natural language generation and their application to conversational dialog systems.",
            "Exploring features from natural language generation for prosody modeling.",
            "Contrast in concept-to-speech generation.",
            "Efficient integrated response generation from multiple targets using weighted finite state transducers."
        ]
    },
    {
        "name": "Computer Speech and Language",
        "year": "2001",
        "info": "Volume 15: 2001",
        "count": 20,
        "papers": [
            "An alternative scheme for perplexity estimation and its assessment for the evaluation of language models.",
            "Discounted likelihood linear regression for rapid speaker adaptation.",
            "Improved language modelling through better language model evaluation measures.",
            "Whole-sentence exponential language models: a vehicle for linguistic-statistical integration.",
            "Tree-based modeling of intonation.",
            "Call for Papers Special Issue on Spoken Language Generation.",
            "Speech enhancement using a Bayesian evidence approach.",
            "k-TSS language models in speech recognition systems.",
            "Multi-band automatic speech recognition.",
            "A statistical model for robust integration of narrowband cues in speech.",
            "Enhanced speech recognition using an articulatory production model trained on X-ray data.",
            "Union: a model for partial temporal corruption of speech.",
            "Applying dynamic context into MLP/HMM speech recognition system.",
            "Maximum likelihood stochastic transformation adaptation for medium and small data sets.",
            "Normalization of non-standard words.",
            "Obituary: M. W. Macon 1969-2001.",
            "Augmenting standard speech recognition features with energy gravity centres.",
            "Synthesis of Arabic from short sound clusters.",
            "Spectral stability based event localizing temporal decomposition.",
            "A bit of progress in language modeling."
        ]
    },
    {
        "name": "Computer Speech and Language",
        "year": "2000",
        "info": "Volume 14: 2000",
        "count": 20,
        "papers": [
            "A connectionist word production tool for Finnish nouns with a model for vowel harmony restrictions.",
            "Look-ahead techniques for fast beam search.",
            "Efficient speech recognition using subvector quantization and discrete-mixture HMMS.",
            "Memory-efficient LVCSR search using a one-pass stack decoder.",
            "Editorial: New developments at CSL.",
            "A fast algorithm for parallel model combination for noisy speech recognition.",
            "A path-stack algorithm for optimizing dynamic regimes in a statistical hidden dynamic model of speech.",
            "Minimum Bayes-risk automatic speech recognition.",
            "Pronunciation modeling by sharing Gaussian densities across phonetic models.",
            "The STAR system: an interactive pronunciation tutor for young children.",
            "ProSynth: an integrated prosodic approach to device-independent, natural-sounding speech synthesis.",
            "Incorporating lip protrusion and larynx lowering into a time domain model for articulatory speech synthesis.",
            "Tree-structured vector quantization for speech recognition.",
            "Multi-resolution sub-band features and models for HMM-based phonetic modelling.",
            "Statistical language modeling with a class-basedn-multigram model.",
            "Structured language modeling.",
            "Detection of phonological features in continuous speech using neural networks.",
            "Maximum entropy techniques for exploiting syntactic, semantic and collocational dependencies in language modeling.",
            "Finding consensus in speech recognition: word error minimization and other applications of confusion networks.",
            "Obituary: J. Allen 1934-2000."
        ]
    },
    {
        "name": "Computer Speech and Language",
        "year": "1999",
        "info": "Volume 13: 1999",
        "count": 19,
        "papers": [
            "Probabilistic-trajectory segmental HMMs.",
            "A layered neural network interfaced with a cochlear model for the study of speech encoding in the auditory system.",
            "New temporal features for robust speech recognition with emphasis on microphone variations.",
            "Automatic selection of phonetically distributed sentence sets for speaker adaptation with application to large vocabulary Mandarin speech recognition.",
            "Variable-length categoryn-gram language models.",
            "Interpolation of n-gram and mutual-information based trigger pair language models for Mandarin speech recognition.",
            "Multiple pronunciation dictionary using HMM-state confusion characteristics.",
            "Evaluating the pronunciation component of text-to-speech systems for English: a performance comparison of different approaches.",
            "Stochastically-based semantic analysis for machine translation.",
            "A Bayesian triphone model.",
            "Consonant/vowel segmentation for Mandarin syllable recognition.",
            "A hidden Markov-model-based trainable speech synthesizer.",
            "Low-cost implementation of open set keyword spotting.",
            "Relevance weighting for combining multi-domain data for n-gram language modeling.",
            "Integrated bias removal techniques for robust speech recognition.",
            "Evaluation of word confidence for speech recognition systems.",
            "The Bell Labs German text-to-speech system.",
            "An empirical study of smoothing techniques for language modeling.",
            "Confidence measures from local posterior probability estimates."
        ]
    },
    {
        "name": "Computer Speech and Language",
        "year": "1998",
        "info": "Volume 12: 1998",
        "count": 22,
        "papers": [
            "Language portability of a speech understanding system.",
            "Efficient training of high-order hidden Markov models using first-order representations.",
            "N-Best-based unsupervised speaker adaptation for speech recognition.",
            "Scaled random trajectory segment models.",
            "Maximum likelihood linear transformations for HMM-based speech recognition.",
            "Assigning phrase breaks from part-of-speech sequences.",
            "Phonemic transcription by analogy in text-to-speech synthesis: Novel word pronunciation and lexicon compression.",
            "A blackboard model of accenting.",
            "Improvement of noisy speech recognition using a proportional alignment decoding algorithm in the training phase.",
            "Language understanding and subsequential transducer learning.",
            "Model parameter estimation for mixture density polynomial segment models.",
            "Evaluation in language and speech technology.",
            "Speech recognition evaluation: a review of the U.S. CSR and LVCSR programmes.",
            "The Evolution of evaluation: Lessons from the Message Understanding Conferences.",
            "Some evaluation-based language engineering actions for French.",
            "Evaluating spoken dialogue agents with PARADISE: Two case studies.",
            "Evaluation in the context of natural language generation.",
            "Towards speech recognizer assessment using a human reference standard.",
            "Objective evaluation of grapheme to phoneme conversion for text-to-speech synthesis in French.",
            "Towards systematic grammar profiling.Test suite technology 10 years after.",
            "PURR - A method for prosody evaluation and investigation.",
            "Gold standard datasets for evaluating word sense disambiguation programs."
        ]
    },
    {
        "name": "Computer Speech and Language",
        "year": "1997",
        "info": "Volume 11: 1997",
        "count": 15,
        "papers": [
            "Language modeling using stochastic automata with variable length contexts.",
            "HMM topology design using maximum likelihood successive state splitting.",
            "A word graph algorithm for large vocabulary continuous speech recognition.",
            "Multilingual large vocabulary speech recognition: the European SQALE project.",
            "A practical methodology for speech source localization with microphone arrays.",
            "Vector-field-smoothed Bayesian learning for fast and incremental speaker/telephone-channel adaptation.",
            "String-based minimum verification error (SB-MVE) training for speech recognition.",
            "Frame-level phoneme classification using inductive inference.",
            "Combined Bayesian and predictive techniques for rapid speaker adaptation of continuous density hidden Markov models.",
            "Unconstrained keyword spotting using phone lattices with application to spoken document retrieval.",
            "Context-dependent probability adaptation in speech understanding.",
            "Hidden Markov model-based speech recognition with intermediate wavelet transform domains.",
            "On topic identification and dialogue move recognition.",
            "Probabilistic word classification based on a context-sensitive binary tree method.",
            "Training mixture density HMMs with SOM and LVQ."
        ]
    },
    {
        "name": "Computer Speech and Language",
        "year": "1996",
        "info": "Volume 10: 1996",
        "count": 15,
        "papers": [
            "Perceptual wavelet-representation of speech signals and its application to speech enhancement.",
            "Estimation of mixtures of stochastic dynamic trajectories: application to continuous speech recognition.",
            "Development of an approach to automatic language identification based on phone recognition.",
            "Speaker-independent speech recognition based on tree-structured speaker clustering.",
            "A numerical simulation of laryngeal flow in a forced-oscillation glottal model.",
            "A study on the use of bi-directional contextual dependence in Markov random field-based acoustic modelling for speech recognition.",
            "Speaker recognition using HMM composition in noisy environments.",
            "Speaker adaptation based on transfer vector field smoothing using maximum a posteriori probability estimation.",
            "Stochastic phonographic transduction for English.",
            "Prediction of abstract prosodic labels for speech synthesis.",
            "A maximum entropy approach to adaptive statistical language modelling.",
            "Modelling of the interframe dependence in an HMM using conditional Gaussian mixtures.",
            "Mean and variance adaptation within the MLLR framework.",
            "Stochastic automata for language modeling.",
            "Bi-directional graph search strategies for speech recognition."
        ]
    },
    {
        "name": "Computer Speech and Language",
        "year": "1995",
        "info": "Volume 9: 1995",
        "count": 17,
        "papers": [
            "Predictive speaker adaptation in speech recognition.",
            "Predicting spoken disfluencies during human-computer interaction.",
            "The effects of learning, parameter tying and model refinement for improving probabilistic tagging.",
            "A Markov model containing state-conditioned second-order non-stationarity: application to speech recognition.",
            "A phone-based approach to non-linguistic speech feature identification.",
            "Search and learning strategies for improving hidden Markov models.",
            "Contextual word similarity and estimation from sparse data.",
            "A practical time-delay estimator for localizing speech sources with a microphone array.",
            "Maximum likelihood linear regression for speaker adaptation of continuous density hidden Markov models.",
            "Extensions to constraint dependency parsing for spoken language processing.",
            "An inference approach to grammar construction.",
            "Automatic pitch contour stylization using a model of tonal perception.",
            "Robust speech recognition in additive and convolutional noise using parallel model combination.",
            "Keyword detection in conversational speech utterances using hidden Markov model based continuous speech recognition.",
            "Speech segment network approach for optimization of synthesis unit set.",
            "Language modelling for efficient beam-search.",
            "Topic discrimination using higher-order statistical models of spotted keywords."
        ]
    },
    {
        "name": "Computer Speech and Language",
        "year": "1994",
        "info": "Volume 8: 1994",
        "count": 20,
        "papers": [
            "On structuring probabilistic dependences in stochastic language modelling.",
            "The use of tree-trellis search for large-vocabulary Mandarin polysyllabic word speech recognition.",
            "Algebraic learning of statistical associations for language acquisition.",
            "English noun-phrase accent prediction for text-to-speech.",
            "Assignment of segmental duration in text-to-speech synthesis.",
            "High accuracy phone recognition using context clustering and quasi-triphonic models.",
            "Analysing a simple language model·some general conclusions for language models for speech recognition.",
            "Automatic speech recognition in machine-aided translation.",
            "A new neural network for articulatory speech recognition and its application to vowel identification.",
            "Context-dependent connectionist probability estimation in a hybrid hidden Markov model-neural net speech recognition system.",
            "The importance of cepstral parameter correlations in speech recognition.",
            "The linguistic knowledge in a morphological segmentation procedure for German.",
            "Modelling intonation contours at the phrase level using continuous density hidden Markov models.",
            "Welsh letter-to-sound rules: rewrite rules and two-level rules compared.",
            "Optimal transform coding for speech line spectrum pair parameters based on spectral-weighted error criterion.",
            "Computational auditory scene analysis.",
            "A weighted average n-gram model of natural language.",
            "Prototype-based minimum classification error/generalized probabilistic descent training for various speech units.",
            "State clustering in hidden Markov model-based continuous speech recognition.",
            "Quantitative description and differentiation of fundamental frequency contours."
        ]
    },
    {
        "name": "Computer Speech and Language",
        "year": "1993",
        "info": "Volume 7: 1993",
        "count": 19,
        "papers": [
            "A voice system for the computer entry of Chinese characters.",
            "Connected digit recognition based on improved acoustic resolution.",
            "Synthesizing natural-sounding intonation for Dutch: rules and perceptual evaluation.",
            "Perceptual experiments for diagnostic testing of text-to-speech systems.",
            "Hidden Markov models with templates as non-stationary states: an application to speech recognition.",
            "An information theoretical investigation into the distribution of phonetic information across the auditory spectrogram.",
            "The SPHINX-II speech recognition system: an overview.",
            "Speech Maker: a flexible and general framework for text-to-speech synthesis, and its application to Dutch.",
            "A knowledge-based system for stop consonant identification based on speech spectrogram reading.",
            "Parse scoring with prosodic information: an analysis/synthesis approach.",
            "Phoneme detection as a tool for comparing perception of natural and synthetic speech.",
            "Discriminative feature selection for speech recognition.",
            "Continuous hidden Markov models integrating transitional and instantaneous features for Mandarin syllable recognition.",
            "Hidden Markov model representation of quantized articulatory features for speech recognition.",
            "Intonation component of a text-to-speech system for Hindi.",
            "The mu + system for corpus based speech research.",
            "A feature-based formalism for two-level phonology: a description and implementation.",
            "A comparative study of discrete, semicontinuous, and continuous hidden Markov models.",
            "Speech Maker Formalism: a rule formalism operating on a multi-level, synchronized data structure."
        ]
    }
]