[
    {
        "name": "Computational Intelligence",
        "year": "2022",
        "info": "Volume 38: 2022",
        "count": 17,
        "papers": [
            "EDITORIAL.",
            "Multilayer weighted integrated self-learning algorithm for automatic diagnosis of epileptic electroencephalogram signals.",
            "Multi-angle face expression recognition based on generative adversarial networks.",
            "Test items of 3D printed copper alloy parts based on virtual reality technology.",
            "Realization of interactive animation creation based on artificial intelligence technology.",
            "Design of intervention APP for children with autism based on visual cue strategy.",
            "Animation of virtual medical system under the background of virtual reality technology.",
            "Point cloud computing algorithm on object surface based on virtual reality technology.",
            "Contrast-enhanced ultrasound combined with augmented reality medical technology in the treatment of rabbit liver cancer with high-energy focused knife.",
            "Brain-computer interface-based target recognition system using transfer learning: A deep learning approach.",
            "A comprehensive data-level investigation of cancer diagnosis on imbalanced data.",
            "Deep learning based six-dimensional pose estimation in virtual reality.",
            "Text segmentation for patent claim simplification via Bidirectional Long-Short Term Memory and Conditional Random Field.",
            "To assess the multiperiod market risk with deep learning method taking the boosting additive quantile regression as an example.",
            "Telemedicine virtual reality based skin image in children's dermatology medical system.",
            "A direct classification approach to recognize stress levels in virtual reality therapy for patients with multiple sclerosis.",
            "An IoT assisted clinical decision support system for wound healthcare monitoring."
        ]
    },
    {
        "name": "Computational Intelligence",
        "year": "2021",
        "info": "Volume 37: 2021",
        "count": 93,
        "papers": [
            "Evolutionary Fuzzy-based gravitational search algorithm for query optimization in crowdsourcing system to minimize cost and latency.",
            "Faults diagnosis of a centrifugal pump using multilayer perceptron genetic algorithm back propagation and support vector machine with discrete wavelet transform-based feature extraction.",
            "Development of intuitionistic fuzzy special embedded convolutional neural network for mammography enhancement.",
            "Handwritten Meitei Mayek recognition using three-channel convolution neural network of gradients and gray.",
            "A dictionary for translation from natural to formal data model language.",
            "Defending Against Child Death: Deep learning-based diagnosis method for abnormal identification of fetus ultrasound Images.",
            "Blood glucose level prediction for diabetes based on modified fuzzy time series and particle swarm optimization.",
            "A novel hybrid whale optimization algorithm with flower pollination algorithm for feature selection: Case study Email spam detection.",
            "Group recommendation with noisy subjective preferences.",
            "Accuracy improvement in air-quality forecasting using regressor combination with missing data imputation.",
            "An improved vertical fragmentation, allocation and replication for enhancing e-learning in distributed database environment.",
            "A machine learning approach for optimizing heuristic decision-making in Web Ontology Language reasoners.",
            "A hybrid recurrent neural network-logistic chaos-based whale optimization framework for heart disease prediction with electronic health records.",
            "Integration of recurrent convolutional neural network and optimal encryption scheme for intrusion detection with secure data storage in the cloud.",
            "Learning to rank by using multivariate adaptive regression splines and conic multivariate adaptive regression splines.",
            "Sentiment analysis of tweets using a unified convolutional neural network-long short-term memory network model.",
            "An integrated methodology to control the risk of cardiovascular disease in patients with hypertension and type 1 diabetes.",
            "Multiperson interaction recognition in images: A body keypoint based feature image analysis.",
            "LPX: Overlapping community detection based on X-means and label propagation algorithm in attributed networks.",
            "Classifying and clustering malicious advertisement uniform resource locators using deep learning.",
            "Traffic video-based intelligent traffic control system for smart cities using modified ant colony optimizer.",
            "Fuzzy local ternary pattern and skin texture properties based countermeasure against face spoofing in biometric systems.",
            "Deep learning for vision-based fall detection system: Enhanced optical dynamic flow.",
            "Mixture-based clustering for count data using approximated Fisher Scoring and Minorization-Maximization approaches.",
            "Multiobjective optimization on adhesive bonding of aluminum-carbon fiber laminate.",
            "Incremental learning framework for real-world fraud detection environment.",
            "Special issue on computational intelligence for social media data mining and knowledge discovery.",
            "Supervised shift k-means based machine learning approach for link prediction using inherent structural properties of large online social network.",
            "Distance dynamics based overlapping semantic community detection for node-attributed networks.",
            "Estimating uncertainty in deep learning for reporting confidence to clinicians in medical image segmentation and diseases detection.",
            "Hybrid convolutional bidirectional recurrent neural network based sentiment analysis on movie reviews.",
            "Intention classification in multiturn dialogue systems with key sentences mining.",
            "Sentiment classification with adversarial learning and attention mechanism.",
            "Simulation and performance analysis of 15 Nm FinFET based carry skip adder.",
            "Generating and evaluating cross-sectional synthetic electronic healthcare data: Preserving data utility and patient privacy.",
            "Solution of intuitionistic fuzzy linear programming problem by dual simplex algorithm and sensitivity analysis.",
            "Variable population-sized particle swarm optimization for highly imbalanced dataset classification.",
            "Ant colony optimization-evolutionary hybrid optimization with translation of problem representation.",
            "Review prognosis system to predict employees job satisfaction using deep neural network.",
            "A systematic review on machine learning for fall detection system.",
            "Mixed pixel removal in north Tamil Nadu region for accurate area measurement.",
            "A truss-based approach for densest homogeneous subgraph mining in node-attributed graphs.",
            "Editorial.",
            "Enhanced constrained application protocol for secured medical data transmission model for internet of things.",
            "Artificial intelligence-based wind forecasting using variational mode decomposition.",
            "Machine learning-based charge scheduling of electric vehicles with minimum waiting time.",
            "High-speed and area-efficient Sobel edge detector on field-programmable gate array for artificial intelligence and machine learning applications.",
            "Integration of AI with reduced order generalized integrator controller for power system harmonic reduction.",
            "Analysis of real-time heartbeat monitoring using wearable device Internet of Things system in sports environment.",
            "Machine learning approach to handle data-driven model for simulation and forecasting of the cone crusher output in the stone crushing plant.",
            "An empirical model in intrusion detection systems using principal component analysis and deep learning models.",
            "Physical education teaching for saving energy in basketball sports athletics using Hidden Markov and Motion Model.",
            "Efficient signal selection using supervised learning model for enhanced state restoration.",
            "Design of area efficient VLSI architecture for carry select adder using logic optimization technique.",
            "Design of online intelligent English teaching platform based on artificial intelligence techniques.",
            "Application of computer information technology in college physical education using fuzzy evaluation theory.",
            "Improved fuzzy-assisted hierarchical neural network system for design of computer-aided English teaching system.",
            "Cycling environment investigation and optimization of urban central road in Qingdao.",
            "Service quality evaluation of satellite data distribution system based on BP-IPA.",
            "Research on the integration of heterogeneous information resources in university management informatization based on data mining algorithms.",
            "Sustainable achievement efficiency of transport energy consumption based on indicator analysis.",
            "Performance enhancement of safety message communication via designing dynamic power control mechanisms in vehicular ad hoc networks.",
            "Machine learning approach for power consumption model based on monsoon data for smart cities applications.",
            "Internet of Things assisted radio frequency identification based mine safety management platform.",
            "Artificial intelligence-based novel scheme for location area planning in cellular networks.",
            "Strength prediction of paste filling material based on convolutional neural network.",
            "Advanced metameric dimension framework for heterogeneous industrial Internet of things.",
            "Relationship quality and supply chain quality performance: The effect of supply chain integration in hotel industry.",
            "Digitized droop control of a high gain primitive converter - General performance analysis for smart city lighting application.",
            "Implementation analysis of pixel-level image processing based on multiscale transforms.",
            "IoT cloud platform for information processing in smart city.",
            "Smart contract for distributed energy trading in virtual power plants based on blockchain.",
            "EDITORIAL.",
            "Opening the black box: Personalizing type 2 diabetes patients based on their latent phenotype and temporal associated complication rules.",
            "Co-occurrence patterns in diagnostic data.",
            "Towards an approach using grammars for automatic classification of masses in mammograms.",
            "A semantically enriched text mining system for clinical decision support.",
            "Feature selection inspired by human intelligence for improving classification accuracy of cancer types.",
            "Toward classifying small lung nodules with hyperparameter optimization of convolutional neural networks.",
            "A clinical support system for classification and prediction of depression using machine learning methods.",
            "Interpretability in healthcare: A comparative study of local machine learning interpretability techniques.",
            "Light chain consensus reinforcement machine learning: An effective blockchain model for Internet of Things using for its advancement and challenges.",
            "Optimal sizing and placement of multiple renewable distribution generation and DSTATCOM in radial distribution systems using hybrid lightning search algorithm-simplex method optimization algorithm.",
            "Static localization for underwater acoustics sensor networks using Nelder-Mead algorithm for smart cities.",
            "Improving stochastic local search for uniform k-SAT by generating appropriate initial assignment.",
            "A recent survey on the applications of genetic programming in image processing.",
            "FAIMCS: A fast and accurate influence maximization algorithm in social networks based on community structures.",
            "Multi-lingual text detection and identification using agile convolutional neural network.",
            "Novel principal component analysis-based feature selection mechanism for classroom sound classification.",
            "A novel embedded system design for the detection and classification of cardiac disorders.",
            "A novel dissimilarity metric based on feature-to-feature scatter frequencies for clustering-based feature selection in biomedical data.",
            "Advanced extreme learning machine-based ensemble classification scheme with enhanced data perturbation for human DNA sequences.",
            "NIC: An innovative supervised machine learning computational framework having network-based interactional connections."
        ]
    },
    {
        "name": "Computational Intelligence",
        "year": "2020",
        "info": "Volume 36: 2020",
        "count": 83,
        "papers": [
            "Editorial.",
            "Multiobjective fuzzy mathematical model for a financially constrained closed-loop supply chain with labor employment.",
            "An approximate optimization strategy using refined hybrid metamodel.",
            "New optimization method based on energy management in microgrids based on energy storage systems and combined heat and power.",
            "A robust green traffic-based routing problem for perishable products distribution.",
            "Identification of cancerous gene groups from microarray data by employing adaptive genetic and support vector machine technique.",
            "A novel hybridized metaheuristic technique in enhancing the diagnosis of cross-sectional dent damaged offshore platform members.",
            "An intelligent optimization-based traffic information acquirement approach to software-defined networking.",
            "Efficiency analysis for stochastic dynamic facility layout problem using meta-heuristic, data envelopment analysis and machine learning.",
            "IntelliHome: An internet of things-based system for electrical energy saving in smart home environment.",
            "Employing a Gaussian Particle Swarm Optimization method for tuning Multi Input Multi Output-fuzzy system as an integrated controller of a micro-grid with stability analysis.",
            "Brain tumor diagnosis based on artificial neural network and a chaos whale optimization algorithm.",
            "A multiobjective integrated multiproject scheduling and multiskilled workforce assignment model considering learning effect under uncertainty.",
            "Ensemble cluster pruning via convex-concave programming.",
            "Improved spotted hyena optimizer with space transformational search for training pi-sigma higher order neural network.",
            "Artificial bee colony algorithm for content-based image retrieval.",
            "Detection and classification of lung nodules in chest X-ray images using deep convolutional neural networks.",
            "Credit score classification using spiking extreme learning machine.",
            "Intelligent methodologies for cardiac sound signals analysis and characterization in cepstrum and time-scale domains.",
            "Proportional data modeling via selection and estimation of a finite mixture of scaled Dirichlet distributions.",
            "A topic-based term frequency normalization framework to enhance probabilistic information retrieval.",
            "CSBF: A static ensemble fusion method based on the centrality score of complex networks.",
            "A steganographic method based on optimized audio embedding technique for secure data communication in the internet of things.",
            "Evolutionary subspace clustering using variable genome length.",
            "Optimization of material removal rate in wire EDM by polynomial neural network models.",
            "Lie detection using extreme learning machine: A concealed information test based on short-time Fourier transform and binary bat optimization using a novel fitness function.",
            "Elite artificial bees' colony algorithm to solve robot's fuzzy constrained routing problem.",
            "Routing using reinforcement learning in vehicular ad hoc networks.",
            "Antiperiodic dynamical behaviors of discontinuous neutral-type Cohen-Grossberg neural networks with mixed time delays.",
            "Distributed autonomy and trade-offs in online multiobject k-coverage.",
            "Leveraging active learning to reduce human effort in the generation of ground-truth for entity resolution.",
            "Improved fuzzy weighted-iterative association rule based ontology postprocessing in data mining for query recommendation applications.",
            "The combination of term relations analysis and weighted frequent itemset model for multidocument summarization.",
            "Improvement of battery lifetime in software-defined network using particle swarm optimization based cluster-head gateway switch routing protocol with fuzzy rules.",
            "Detecting community structure in complex networks using genetic algorithm based on object migrating automata.",
            "Multi-level feature optimization and multimodal contextual fusion for sentiment analysis and emotion classification.",
            "A hybrid multi-objective tour route optimization algorithm based on particle swarm optimization and artificial bee colony optimization.",
            "Reduced-gate convolutional long short-term memory using predictive coding for spatiotemporal prediction.",
            "Taylor-AMS features and deep convolutional neural network for converting nonaudible murmur to normal speech.",
            "An improved long short-term memory networks with Takagi-Sugeno fuzzy for traffic speed prediction considering abnormal traffic situation.",
            "Computationally efficient and secure anonymous authentication scheme for IoT-based mobile pay-TV systems.",
            "Modified online Newton step based on elementwise multiplication.",
            "The long road from performing word sense disambiguation to successfully using it in information retrieval: An overview of the unsupervised approach.",
            "Novel recommendation system based on long-term composition for adaptive web services.",
            "Multiobjective optimal power flow using interior search algorithm: A case study on a real-time electrical network.",
            "On viability of detecting malwares online using ensemble classification method with performance metrics.",
            "A study of deep neural networks for human activity recognition.",
            "Selecting effective features on prediction of delay in servicing ships arriving to ports using a combination of Clonal Selection and Grey Wolf Optimization algorithms - Case study: Shahid Rajaee port in Bandar Abbas.",
            "Aspect category detection using statistical and semantic association.",
            "Automatic traditional Chinese painting classification: A benchmarking analysis.",
            "A two-level authentication scheme for clone node detection in smart cities using Internet of things.",
            "Bio-PUF-MAC authenticated encryption for iris biometrics.",
            "Water-body segmentation from satellite images using Kapur's entropy-based thresholding method.",
            "Improved gait recognition through gait energy image partitioning.",
            "A robust image steganography using teaching learning based optimization based edge detection model for smart cities.",
            "A robust similarity based deep siamese convolutional neural network for gait recognition across views.",
            "Capacitated single-allocation hub location model for a flood relief distribution network.",
            "Research on personalized recommendation hybrid algorithm for interactive experience equipment.",
            "Fault diagnosis in wireless sensor network using negative selection algorithm and support vector machine.",
            "Intelligent forecasting of time series based on evolving distributed Neuro-Fuzzy network.",
            "Conditional Preference Networks with User's Genuine Decisions.",
            "Usha Moorthy, Usha Devi Gandhi: Forest optimization algorithm-based feature selection using classifier ensemble.",
            "Intelligent document-filling system on mobile devices by document classification and electronization.",
            "Feature selection and classification using support vector machine and decision tree.",
            "A computational algorithm based on biogeography-based optimization method for computing power system security constrains with multi FACTS devices.",
            "A computing method-based rearrangement of network protocols to improvise quality factors of FACTS devices and sensors using Newton-Raphson technique.",
            "Improving quality-of-service in fog computing through efficient resource allocation.",
            "Neural network prediction of bioleaching of metals from waste computer printed circuit boards using Levenberg-Marquardt algorithm.",
            "L1 norm based pedestrian detection using video analytics technique.",
            "Security challenges in internet of things: Distributed denial of service attack detection using support vector machine-based expert systems.",
            "Energy-efficient routing technique for reliable data transmission under the background of big data for disaster region.",
            "Research on the clustering algorithm of ocean big data based on self-organizing neural network.",
            "Parallel genetic algorithm for N-Queens problem based on message passing interface-compute unified device architecture.",
            "Integrated kitchen design and optimization based on the improved particle swarm intelligent algorithm.",
            "Web service composition on IoT reliability test based on cross entropy.",
            "Study on the algorithm for smart community sensor network routing with adaptive optimization via cluster head election.",
            "Lossless data transmission for Internet of things application over wireless multimedia sensor networks using enhanced and optimal path scheduling approach to maximizing the quality of service.",
            "Knowledge mapping of supply chain risk research based on CiteSpace.",
            "Sequence recommendation based on deep learning.",
            "A computational method based on Gustafson-Kessel fuzzy clustering for a novel islanding detection for grid connected devices and sensors.",
            "Internet of things assisted condition-based support for smart manufacturing industry using learning technique.",
            "Traffic wave model based on vehicle-infrastructure cooperative and vehicle communication data.",
            "Smart grid data access control scheme based on blockchain."
        ]
    },
    {
        "name": "Computational Intelligence",
        "year": "2019",
        "info": "Volume 35: 2019",
        "count": 45,
        "papers": [
            "A new unsupervised feature selection algorithm using similarity-based feature clustering.",
            "A new unsupervised feature selection algorithm using similarity-based feature clustering.",
            "A simulated annealing-based maximum-margin clustering algorithm.",
            "Some node ordering methods for the K2 algorithm.",
            "A probabilistic model for state sequence analysis in hidden Markov model for hand gesture recognition.",
            "Exploring deep neural networks for multitarget stance detection.",
            "MaDHS: Many-objective discrete harmony search to improve existing package design.",
            "Allocating structured tasks in heterogeneous agent teams.",
            "An adaptive memetic algorithm for feature selection using proximity graphs.",
            "Bagged ensembles with tunable parameters.",
            "Fuzzy spatio-temporal ontologies and formal construction based on fuzzy Petri nets.",
            "Semantic network management for next-generation networks.",
            "A general model for fuzzy decision tree and fuzzy random forest.",
            "Using text mining for personalization and recommendation for an enriched hybrid learning experience.",
            "A novel hybrid credit scoring model based on ensemble feature selection and multilayer ensemble classification.",
            "Inner entanglements: Narrowing the search in classical planning by problem reformulation.",
            "On sampling inside obstacles for boosted sampling of narrow corridors.",
            "Analysis of crowds' movement using Twitter.",
            "Editorial.",
            "Multiobjective computation offloading for workflow management in cloudlet-based mobile cloud using NSGA-II.",
            "A hierarchical recurrent approach to predict scene graphs from a visual-attention-oriented perspective.",
            "Fabric defect detection based on saliency histogram features.",
            "Deep spatiotemporal LSTM network with temporal pattern feature for 3D human action recognition.",
            "Efficient solution to the millionaires' problem based on asymmetric commutative encryption scheme.",
            "A fault-tolerant dynamic scheduling method on hierarchical mobile edge cloud computing.",
            "Identifying biomarker candidates of influenza infection based on scalable time-course big data of gene expression.",
            "Ground object recognition and segmentation from aerial image-based 3D point cloud.",
            "Investigating effects of interactive signage-based stimulation for promoting behavior change.",
            "Experimenting with prequential variations for data stream learning evaluation.",
            "Relational database security using digital watermarking and evolutionary techniques.",
            "Nonconvex/nonsmooth economic load dispatch using modified time-varying particle swarm optimization.",
            "On the predictability of domain-independent temporal planners.",
            "Reducing correlation of random forest-based learning-to-rank algorithms using subsample size.",
            "An innovative hybrid approach for extracting named entities from unstructured text data.",
            "An evolutionary-based approach for dealing with numerical and categorical attributes in ILP.",
            "Swat: A system for detecting salient Wikipedia entities in texts.",
            "Active learning Rotation Forest for multiclass classification.",
            "Empirical study on multiclass classification-based network intrusion detection.",
            "An automated approach for the recognition of intended messages in grouped bar charts.",
            "A novel modified undersampling (MUS) technique for software defect prediction.",
            "Parameter derivation of a proton exchange membrane fuel cell based on coevolutionary ribonucleic acid genetic algorithm.",
            "Stance detection and mobile app recommendation discourse on tweets.",
            "An ambient intelligence approach for learning in smart robotic environments.",
            "Adaptive transfer learning in deep neural networks: Wind power prediction using knowledge transfer from region to region and between different task domains.",
            "An interval type-2 fuzzy trust evaluation model in social commerce."
        ]
    },
    {
        "name": "Computational Intelligence",
        "year": "2018",
        "info": "Volume 34: 2018",
        "count": 53,
        "papers": [
            "SEL: A unified algorithm for salient entity linking.",
            "Automated classification of content components in technical communication.",
            "Leximin Asymmetric Multiple Objective Distributed Constraint Optimization Problem.",
            "Compromising Adjustment Strategy Based on TKI Conflict Mode for Multi-Times Bilateral Closed Negotiations.",
            "A Hierarchical Approach to Judgment Aggregation with Abstentions.",
            "Finding Diachronic Like-Minded Users.",
            "One-class SVM for biometric authentication by keystroke dynamics for remote evaluation.",
            "Logistic regression in large rare events and imbalanced data: A performance comparison of prior correction and weighting methods.",
            "Development of a coupled wavelet transform and evolutionary Levenberg-Marquardt neural networks for hydrological process modeling.",
            "An open source and modular search engine for biomedical literature retrieval.",
            "NAT model-based compression of Bayesian network CPTs over multivalued variables.",
            "Solar energy forecasting based on hybrid neural network and improved metaheuristic algorithm.",
            "Threaded ensembles of autoencoders for stream learning.",
            "Balancing exploration and exploitation in memetic algorithms: A learning automata approach.",
            "The ANNS approach to DEM reconstruction.",
            "Modeling multiple interactions with a Markov random field in query expansion for session search.",
            "A Naive Bayes approach for URL classification with supervised feature selection and rejection framework.",
            "Multimodality, interactivity, and crowdsourcing for document transcription.",
            "From French Wikipedia to Erudit: A test case for cross-domain open information extraction.",
            "Learning over subconcepts: Strategies for 1-class classification.",
            "Toward personalized and adaptive QoS assessments via context awareness.",
            "Improving evolutionary decision tree induction with multi-interval discretization.",
            "A hybrid trust model using reinforcement learning and fuzzy logic.",
            "Avoiding game-tree pathology in 2-player adversarial search.",
            "A hybrid FAM-CART model for online data classification.",
            "SupAUTH: A new approach to supply chain authentication for the IoT.",
            "Cognitive agents and machine learning by example: Representation with conceptual graphs.",
            "A values-driven self-organization mechanism for automating multiagent coordination.",
            "Complementary-based coalition formation for energy microgrids.",
            "A parallel computational approach for similarity search using Bloom filters.",
            "Adaptable image segmentation via simple pixel classification.",
            "Universality and prediction in business rules.",
            "EDITORIAL.",
            "On a simple method for testing independencies in Bayesian networks.",
            "Optimal data aggregation tree in wireless sensor networks based on improved river formation dynamics.",
            "Design and evaluation of planning and mathematical models for generating learning paths.",
            "Correlation-based classifier combination in the field of pattern recognition.",
            "Big data regression with parallel enhanced and convex incremental extreme learning machines.",
            "Determining significance of input neurons for probabilistic neural network by sensitivity analysis procedure.",
            "Improved infrared small target detection and tracking method based on new intelligence particle filter.",
            "Improving text relatedness by incorporating phrase relatedness with word relatedness.",
            "Isolation-based anomaly detection using nearest-neighbor ensembles.",
            "A dynamic fuzzy-based dance mechanism for the bee colony optimization algorithm.",
            "Random walk grey wolf optimizer for constrained engineering optimization problems.",
            "Player profiling and quality assessment of dynamic car racing tracks using entertainment quantifier technique.",
            "Optimal path planning for mobile robots using oppositional invasive weed optimization.",
            "Unified forms of the CDR method of approximate reasoning on Antanassov's intuitionistic fuzzy sets and its property analysis.",
            "A multimetric and multideme multiagent system for multiobjective optimization.",
            "Group behavior diffusion model of social hotspots based on triadic structure and factor graphs.",
            "A target image-oriented dictionary learning-based method for fully automated latent fingerprint forensic.",
            "Detecting semantic-based communities in node-attributed graphs.",
            "A dynamic adaptive deviation registration algorithm for heterogeneous sensors.",
            "An immune multiagent system to monitor and control public bus transportation systems."
        ]
    },
    {
        "name": "Computational Intelligence",
        "year": "2017",
        "info": "Volume 33: 2017",
        "count": 40,
        "papers": [
            "Deconstructing Computer Poets: Making Selected Processes Available as Services.",
            "Computational Technique for an Efficient Classification of Protein Sequences With Distance-Based Sequence Encoding Algorithm.",
            "Evolutionary Algorithm-Based Radial Basis Function Neural Network Training for Industrial Personal Computer Sales Forecasting.",
            "A Community Structure-Based Approach for Network Immunization.",
            "Swallow: Resource and Tag Recommender System Based on Heat Diffusion Algorithm in Social Annotation Systems.",
            "Multiobjective Optimization Techniques for Selecting Important Metrics in the Design of Ensemble Systems.",
            "Mining Evolving Data Streams with Particle Filters.",
            "Evolutionary Clustering for Mining and Tracking Dynamic Multilayer Networks.",
            "Improving the Local Search Ability of Spider Monkey Optimization Algorithm Using Quadratic Approximation for Unconstrained Optimization.",
            "Forecasting Financial Time Series with Grammar-Guided Feature Generation.",
            "Efficient Particle Swarm Optimized Particle Filter Based Improved Multiple Model Tracking Algorithm.",
            "Exploring Trading Strategies and Their Effects in the Foreign Exchange Market.",
            "LinkLPA: A Link-Based Label Propagation Algorithm for Overlapping Community Detection in Networks.",
            "Word Sense Induction with Closed Frequent Termsets.",
            "An Empirical Comparison of Search Approaches for Moving Agents.",
            "ECOOP: Applying Dynamic Coalition Formation to the Power Regulation Problem in Smart Grids.",
            "Improving Shift-Reduce Phrase-Structure Parsing with Constituent Boundary Information.",
            "Relationship Identification Across Heterogeneous Online Social Networks.",
            "False-Name Manipulation in Weighted Voting Games: Empirical and Theoretical Analysis.",
            "Bagged Subspaces for Unsupervised Outlier Detection.",
            "Exact and Heuristic Algorithms for Risk-Aware Stochastic Physical Search.",
            "On Taxonomy and Evaluation of Feature Selection-Based Learning Classifier System Ensemble Approaches for Data Mining Problems.",
            "Correction for Closeness: Adjusting Normalized Mutual Information Measure for Clustering Comparison.",
            "Simulated Perceptions for Emergent Storytelling.",
            "On Darwinian Networks.",
            "FISER: A Feature-Based Detection System for Person Interactions.",
            "Access and Sharing Contents Through the Social Network: A POMDP Approach.",
            "Assumption-Based Argumentation Equipped with Preferences and its Application to Decision Making, Practical Reasoning, and Epistemic Reasoning.",
            "Task Scheduling in Distributed Systems Using Heap Intelligent Discrete Particle Swarm Optimization.",
            "Modeling the High-Frequency FX Market: An Agent-Based Approach.",
            "Traffic Simulation in Urban Networks Using Stochastic Cell Transmission Model.",
            "Real-Time Gesture-Based Communication Using Possibility Theory-Based Hidden Markov Model.",
            "Discrimination Structure Complementarity-Based Feature Selection.",
            "Agent-oriented activity recognition in the event calculus: An application for diabetic patients.",
            "Structural plan similarity based on refinements in the space of partial plans.",
            "Conceptual annotation of text patterns.",
            "Multiobjective approach for detecting communities in heterogeneous networks.",
            "Detection and classification of sleep apnea using genetic algorithms and SVM-based classification of thoracic respiratory effort and oximetric signal features.",
            "Electrochemical machining process parameter optimization using particle swarm optimization.",
            "A two-phase harmony search algorithm for continuous optimization."
        ]
    },
    {
        "name": "Computational Intelligence",
        "year": "2016",
        "info": "Volume 32: 2016",
        "count": 27,
        "papers": [
            "Learning Hierarchical Task Models from Input Traces.",
            "User Activities Outliers Detection; Integration of Statistical and Computational Intelligence Techniques.",
            "Stage: Stereotypical Trust Assessment Through Graph Extraction.",
            "Efficient Mining of Discriminating Relationships Among Attributes Involving Arithmetic Operations.",
            "zTrust: Adaptive Decentralized Trust Model for Quality of Service Selection in Electronic Marketplaces.",
            "A Comparative Evaluation of Curriculum Learning with Filtering and Boosting in Supervised Classification Problems.",
            "Missing Value Imputation with Unsupervised Backpropagation.",
            "Creating Decision Trees from Rules using RBDT-1.",
            "From Mobile Phone Sensing to Human Geo-Social Behavior Understanding.",
            "Symbolic Configuration for Interactive Container Ship Stowage Planning.",
            "Crystal Energy Optimization Algorithm.",
            "Information Ordering with an Event-Enriched Vector Space Model for Multi-Document News Summarization.",
            "Multi-Unit Bayesian Auction with Demand or Budget Constraints.",
            "Applying Dynamic Training-Subset Selection Methods Using Genetic Programming for Forecasting Implied Volatility.",
            "A Rolling Grey Model Optimized by Particle Swarm Optimization in Economic Prediction.",
            "Concurrent Individual And Social Learning In Robot Teams.",
            "An Algorithm for Clustering Using L1-Norm Based on Hyperbolic Smoothing Technique.",
            "A Generic Ensemble Approach to Estimate Multidimensional Likelihood in Bayesian Classifier Learning.",
            "Document Clustering With Dual Supervision Through Feature Reweighting.",
            "A New Weighting Approach Based on Rough Set Theory and Granular Computing for Road Safety Indicator Analysis.",
            "Automatic Detection of Words Associations in Texts Based on Joint Distribution of Words Occurrences.",
            "New Recommender Framework: Combining Semantic Similarity Fusion and Bicluster Collaborative Filtering.",
            "A Multiagent Evolutionary Method for Detecting Communities in Complex Networks.",
            "A Multicriteria Weighted Vote-Based Classifier Ensemble for Heart Disease Prediction.",
            "A Fast and Accurate Feature Selection Algorithm Based on Binary Consistency Measure.",
            "To Plan or to Simply React? An Experimental Study of Action Planning in a Game Environment.",
            "Service Composition and Execution Plan Generation of Composite Semantic WEB Services Using Abductive Event Calculus."
        ]
    },
    {
        "name": "Computational Intelligence",
        "year": "2015",
        "info": "Volume 31: 2015",
        "count": 27,
        "papers": [
            "An Extensive Evaluation of Decision Tree-Based Hierarchical Multilabel Classification Methods and Performance Measures.",
            "Privacy-Preserving Naïve Bayesian Classifier-Based Recommendations on Distributed Data.",
            "A Computational Framework for Practical Social Reasoning.",
            "Pattern-Similarity-Based Model for Time Series Prediction.",
            "A Survey of Techniques for Event Detection in Twitter.",
            "Expert Recommendations Based on Opinion Mining of User-Generated Product Reviews.",
            "Long Chains or Stable Communities? The Role of Emotional Stability in Twitter Conversations.",
            "Genetic Algorithm Classifier System for Semi-Supervised Learning.",
            "Planning with Multistep Forward Search with Forced Goal-Ordering Constraints.",
            "Attitude Sensing in Text Based on A Compositional Linguistic Approach.",
            "Using Hashtags to Capture Fine Emotion Categories from Tweets.",
            "Understanding Perceived Trust to Reduce Regret.",
            "Undirected Dependency Parsing.",
            "Toward Self-Motivated, Cognitive, Continually Planning Agents.",
            "An Infrastructure for Argumentative Agents.",
            "A Novel Clonal Selection Algorithm for Community Detection in Complex Networks.",
            "Automated Testing of Physical Security: Red Teaming Through Machine Learning.",
            "Training Multiagent Systems by Q-Learning: Approaches and Empirical Results.",
            "Swarm Intelligent Compressive Routing in Wireless Sensor Networks.",
            "Analyzing the Semantics of Point Spaces through the Topological Weighted Centroid and Other Mathematical Quantities: The Hidden Geometry of the Global Economic Order.",
            "Robust Reputation in Decentralized Markets.",
            "Building a Language-Independent Discourse Parser using Universal Networking Language.",
            "Robust Support Vector Machines with Low Test Time.",
            "Behavior-Based Propagation of Trust in Social Networks with Restricted and Anonymous Participation.",
            "Mocking Ads through Mobile Web Services.",
            "A Hybrid Color Quantization Algorithm Incorporating a Human Visual Perception Model.",
            "Incorporating Intra-Query Term Dependencies in an Aspect Query Language Model."
        ]
    },
    {
        "name": "Computational Intelligence",
        "year": "2014",
        "info": "Volume 30: 2014",
        "count": 29,
        "papers": [
            "Addressing Utility Space Complexity in Negotiations involving Highly Uncorrelated, Constraint-Based Utility Spaces.",
            "An Approach to Scalable Multi-Issue Negotiation: Decomposing the Contract Space.",
            "Genius: an Integrated Environment for Supporting the Design of Generic Automated Negotiators.",
            "Maintenance Goals in Intelligent Agents.",
            "Investigation of Combinational Clustering Indices in Artificial Immune Multi-objective Clustering.",
            "The MFFP-Tree fuzzy Mining Algorithm to Discover Complete Linguistic Frequent Itemsets.",
            "Robustness instead of accuracy Should be the Primary objective for Subjective Pattern Recognition Research: stability Analysis on multicandidate electoral College versus Direct Popular Vote.",
            "Eliminating Concepts and Roles from Ontologies in Expressive Descriptive Logics.",
            "Quadratic Tsallis Entropy Bias and generalized Maximum Entropy Models.",
            "A Graph-Based Approach for Semisupervised Clustering.",
            "Discovering robust Embeddings in (DIS)Similarity Space for High-Dimensional Linguistic Features.",
            "An Integrated Clustering-Based Approach to Filtering Unfair Multi-Nominal Testimonies.",
            "A New Supervised Feature Selection Method for Pattern Classification.",
            "Designing Protocols for Abductive Hypothesis Refinement in Dynamic Multiagent Environments.",
            "Solving Abstract Cooperative Path-Finding in Densely Populated Environments.",
            "A Unified Framework of Targeted Marketing using Customer Preferences.",
            "Bridging the Gap between Distance and Generalization.",
            "Privacy Leakage in Health Social Networks.",
            "Improving Multilabel Classification by Avoiding Implicit Negativity with Incomplete Data.",
            "Comparison and Selection of objective Functions in multiobjective Community Detection.",
            "A bi-Level Decision Model for Customer Churn Analysis.",
            "Exploring a Subgraph Matching Approach for Extracting Biological Events from literature.",
            "Feature Selection Based on compactness and Separability: Comparison with filter-Based Methods.",
            "Efficient Abstraction Selection in Reinforcement Learning.",
            "A Generic Trust Framework for Large-Scale Open Systems using Machine Learning.",
            "A Super-Agent-Based Framework for Reputation Management and Community Formation in Decentralized Systems.",
            "Privacy Preservation for Associative Classification.",
            "Using Identity Premium for Honesty Enforcement and whitewashing Prevention.",
            "Automatic Design of Noncryptographic Hash Functions using Genetic Programming."
        ]
    },
    {
        "name": "Computational Intelligence",
        "year": "2013",
        "info": "Volume 29: 2013",
        "count": 26,
        "papers": [
            "Integrating Planning, Execution, and Learning to Improve Plan Execution.",
            "A Web-Based Personalized Business Partner Recommendation System using Fuzzy Semantic Techniques.",
            "Semisupervised Multimodal Dimensionality Reduction.",
            "Managing Temporal cycles in Planning Problems Requiring Concurrency.",
            "An Optimization Approach to Automatic Generic Document Summarization.",
            "A Lattice-Based Approach to the Problem of Recruitment in Multiagent Systems.",
            "Goal-Driven Autonomy for Responding to Unexpected Events in Strategy Simulations.",
            "Aggregate Certainty estimators.",
            "Action Failure Recovery via Model-Based Diagnosis and Conformant Planning.",
            "Decentralized Supply Chain Formation using Max-Sum Loopy Belief Propagation.",
            "Z-Bag: a Classification Ensemble System with posterior Probabilistic outputs.",
            "Local Models - the Key to Boosting Stable Learners Successfully.",
            "Theoretical Foundations and Experimental Results for a Hierarchical Classifier with Overlapping Clusters.",
            "Computational Approaches to the Analysis of Emotion in Text.",
            "Detecting Emotion Causes with a Linguistic Rule-Based Approach.",
            "A Bootstrapping Method for Extracting Paraphrases of Emotion Expressions from Texts.",
            "Crowdsourcing a Word-Emotion Association Lexicon.",
            "A Computational Model for Plot Units.",
            "Emotion Detection in Email Customer Care.",
            "Data-Driven Analysis of Emotion in Text using Latent Affective Folding and Embedding.",
            "Emotions in Text: Dimensional and Categorical Models.",
            "Multi-Document Summarization of Evaluative Text.",
            "A Two-Stage Win-Win Multiattribute Negotiation Model: Optimization and then Concession.",
            "Subtopic-Based Multimodality Ranking for Topic-Focused Multidocument Summarization.",
            "Exploiting Syntactic, Semantic, and Lexical Regularities in Language Modeling via Directed Markov Random Fields.",
            "Emotag: an Approach to Automated Markup of Emotions in Texts."
        ]
    },
    {
        "name": "Computational Intelligence",
        "year": "2012",
        "info": "Volume 28: 2012",
        "count": 24,
        "papers": [
            "An Aspect Query Language Model Based on Query Decomposition and High-Order Contextual Term Associations.",
            "Fairness in Recurrent Auctions with Competing Markets and Supply fluctuations.",
            "Kemnad: a Knowledge Engineering Methodology for Negotiating Agent Development.",
            "Similarity-Based Retrieval with Structure-Sensitive Sparse Binary Distributed Representations.",
            "Scheduling in Heterogeneous Computing and Grid Environments Using a Parallel CHC Evolutionary Algorithm.",
            "Evolutionary Shallow Natural Language Parsing.",
            "Automatic Algorithm Development Using New Reinforcement Programming Techniques.",
            "Probabilistic Heuristics for Hierarchical Web Data Clustering.",
            "Performance Improvement Using Adaptive Learning Itineraries.",
            "Detonation Classification from acoustic Signature with the Restricted Boltzmann Machine.",
            "Probabilistic Models for Focused Web Crawling.",
            "Learning and Verifying Safety Constraints for Planners in a Knowledge-Impoverished System.",
            "A Review of Tree Convex Sets Test.",
            "An Efficient Representation Model of Distance Distribution between uncertain Objects.",
            "Automatic Annotation of Ambiguous Personal Names on the Web.",
            "Exploiting Subtrees in Auto-Parsed Data to Improve Dependency Parsing.",
            "Dempster's Rule as Seen by Little Colored Balls.",
            "Optimonotone Measures for Optimal Rule Discovery.",
            "Machine Learning Methods for Detecting Patterns of Management Fraud.",
            "Contextual Language Models for Ranking Answers to Natural Language Definition Questions.",
            "Combining Trust Modeling and Mechanism Design for promoting Honesty in E-Marketplaces.",
            "Reasoning with Topological and Directional Spatial Information.",
            "Declarative Specification of Fault Tolerant Auction Protocols: the English Auction Case Study.",
            "Dart: a Distributed Analysis of Reputation and Trust Framework."
        ]
    },
    {
        "name": "Computational Intelligence",
        "year": "2011",
        "info": "Volume 27: 2011",
        "count": 30,
        "papers": [
            "Scheduling and planning applications: Selected papers from the SPARK Workshop Series.",
            "Efficient grid scheduling through the incremental schedule-based approach.",
            "Experiences with planning for natural language generation.",
            "Deployment and evaluation of Selfplanner, an automated individual task management system.",
            "Monitoring elderly people with the Robocare Domestic Environment: Interaction synthesis and user evaluation.",
            "MrSPOCK - Steps in developing an end-to-end space application.",
            "Supporting clinical processes and decisions by hierarchical planning and scheduling.",
            "Feasibility of autonomous decision making on board an agile earth-observing satellite.",
            "Combining Multi-Agent Paradigm and Memetic Computing for Personalized and Adaptive Learning Experiences.",
            "A Region-Based Multi-Issue Negotiation Protocol for Nonmonotonic Utility Spaces.",
            "An Evolutionary Strategy for a Computer Team Game.",
            "An Algorithm for Solving Rule Sets-Based Bilevel Decision Problems.",
            "A new E-Learning Achievement Evaluation Model Based on Rough Set and Similarity Filter.",
            "Semantic Mapping from Natural Language Questions to OWL Queries.",
            "Feature Transformation: A Genetic-Based Feature Construction Method for Data Summarization.",
            "Mining Approximate Repeating Patterns from Sequence Data with Gap Constraints.",
            "Trust by Association: A Meta-Reputation System for Peer-to-Peer Networks.",
            "Coordination Diagnostic Algorithms for Teams of Situated Agents: Scaling up.",
            "Propositional Dynamic Logic for Reasoning about First-Class Agent Interaction Protocols.",
            "SPEAR: Spamming-Resistant Expertise Analysis and Ranking in Collaborative Tagging Systems.",
            "An Extended Hierarchical Linguistic Model for Decision-Making Problems.",
            "Extracting Bio-molecular Events from literature - the BioNLP'09 Shared Task.",
            "Extracting Contextualized Complex Biological Events with Rich Graph-Based Feature Sets.",
            "Bio-molecular Event Extraction with Markov Logic.",
            "Effective Bio-Event Extraction Using Trigger Words and Syntactic Dependencies.",
            "Syntactic Simplification and Semantic Enrichment - Trimming Dependency Graphs for Event Extraction.",
            "High-Precision Bio-molecular Event Extraction from Text Using Parallel Binary Classifiers.",
            "Molecular Event Extraction from Link Grammar Parse Trees in the BioNLP'09 Shared Task.",
            "High-Precision Biological Event Extraction: Effects of System and of Data.",
            "Extracting Secondary Bio-Event Arguments with Extraction Constraints."
        ]
    },
    {
        "name": "Computational Intelligence",
        "year": "2010",
        "info": "Volume 26: 2010",
        "count": 19,
        "papers": [
            "Automatic Complexity Reduction in Reinforcement Learning.",
            "DIPKIP: A Connectionist Knowledge Management System to Identify Knowledge Deficits in Practical Cases.",
            "Multi-Agent Cooperation via Reasoning about the Behavior of Others.",
            "On-Line Case-Based Planning.",
            "Efficient Personalization of E-Learning Activities Using a Multi-Device Decentralized Recommender System.",
            "Cognitive and Behavioral Model Ensembles for Autonomous Virtual Characters.",
            "Trust as a Tradable Commodity: a Foundation for Safe Electronic Marketplaces.",
            "Drama Management and Player Modeling for Interactive Fiction Games.",
            "Introduction to the Special Issue of Advanced Data Mining and Applications.",
            "An Efficient Model for Enhancing Text Categorization Using Sentence Semantics.",
            "On Multi-Class Cost-Sensitive Learning.",
            "Selecting Effective Features and Relations for Efficient Multi-Relational Classification.",
            "Pattern Space Maintenance for Data Updates and Interactive Mining.",
            "Mining User Goals for Indoor Location-Based Services with Low Energy and High QoS.",
            "Feature Transformation: a Genetic-Based Feature Construction Method for Data Summarization.",
            "Adaptive ranks clone and k-nearest neighbor list-based immune multi-objective optimization.",
            "Heuristic search under contract.",
            "Clustering techniques and discrete particle swarm optimization algorithm for multi-document summarization.",
            "Decision trees do not generalize to new variations."
        ]
    },
    {
        "name": "Computational Intelligence",
        "year": "2009",
        "info": "Volume 25: 2009",
        "count": 18,
        "papers": [
            "Fault-Tolerant Multi-Agent Exact Belief Propagation.",
            "Analyzing Myopic Approaches for Multi-Agent Communication.",
            "Fuzzy Trust Aggregation and Personalized Trust Inference in Virtual Social Networks.",
            "Adaptive Multi-Objective Optimization Based on Nondominated Solutions.",
            "Guest Editorial: Marco Somalvico Memorial Issue.",
            "Clustering Very Large Data Sets Using a low Memory Matrix Factored Representation.",
            "Communication Languages for Multiagent Systems.",
            "Introduction to the Special Issue on Case-Based Reasoning in the Health Sciences.",
            "Toward Case-Based Reasoning for Diabetes Management: A Preliminary Clinical Study and Decision Support System Prototype.",
            "A Case-Based Decision Support System for Individual Stress Diagnosis Using Fuzzy Similarity Matching.",
            "Case-Based Reasoning for Managing Noncompliance with Clinical Guidelines.",
            "Prototypical Cases for Retrieval, Reuse, and Knowledge Maintenance in Biomedical Case-Based Reasoning.",
            "A CBR-Based, Closed-Loop Architecture for Temporal Abstractions Configuration.",
            "Novelty Detection and In-Line Learning of Novel Concepts According to a Case-Based Reasoning Process Schema for High-Content Image Analysis in System Biology and Medicine.",
            "Metaphor Recognition: CHMETA, A Pattern-Based System.",
            "A Penalty-Logic Simple-Transition Model for Structured Sequences.",
            "POYRAZ: Context-Aware Service Selection under Deception.",
            "Efficient Markov Network Discovery Using Particle Filters."
        ]
    },
    {
        "name": "Computational Intelligence",
        "year": "2008",
        "info": "Volume 24: 2008",
        "count": 11,
        "papers": [
            "Learning Structured Bayesian Networks: Combining Abstraction Hierarchies and Tree-Structured Conditional Probability Tables.",
            "Dynamic Search Space Transformations for Software Test Data Generation.",
            "Design of an Iterative Multi-Item Double-Auction Mechanism.",
            "Replanning Mechanism for Deliberative Agents in Dynamic Changing Environments.",
            "A New Agent Matching Scheme Using an Ordered Fuzzy Similarity Measure and Game Theory.",
            "The Effect of Network Structure on Dynamic Team Formation in Multi-Agent Systems.",
            "An Interactive Search Assistant Architecture Based on Intrinsic Query Stream Characteristics.",
            "A Two-Layer Agent-Based System for Large-Scale Distributed Computation.",
            "Self-Organizing Peer-to-Peer Social Networks.",
            "Demonstration-Based Behavior Programming for Embodied Virtual Agents.",
            "Learning to Solve Problems from Exercises."
        ]
    },
    {
        "name": "Computational Intelligence",
        "year": "2007",
        "info": "Volume 23: 2007",
        "count": 29,
        "papers": [
            "Introduction to the Special Issue on Recent PACLING Meetings.",
            "Searching for Explanatory Web Pages Using Automatic Query Expansion.",
            "Sortal Anaphora Resolution in Medline Abstracts.",
            "Keyword Extraction Strategy for Item Banks Text Categorization.",
            "Speech Understanding Based on Keyword Extraction and Relations between Words.",
            "Computational Logics and Agents: A Road Map of Current Technologies and Future Trends.",
            "Market-Based Approaches to Optimization.",
            "Applied Computational Intelligence for Finance and Economics.",
            "Predicting the Impact of Anticipatory Action on U.S. Stock Market - An Event Study Using ANFIS (a neural fuzzy model).",
            "From Discrete-Time Models to Continuous-Time, Asynchronous Modeling of Financial Markets.",
            "On Social Learning and Robust Evolutionary Algorithm Design in the Cournot Oligopoly Game.",
            "Price Dynamics, Informational Efficiency, and Wealth Distribution in Continuous Double-Auction Markets.",
            "Learning Oligopolistic Competition in Electricity Auctions.",
            "Effects of a Rationing Rule on the AUSUBEL Auction: A Genetic Algorithm Implementation.",
            "Biological Brain-Inspired Genetic Complementary Learning for Stock Market and Bank Failure Prediction.",
            "Comparing Pronoun Resolution Algorithms.",
            "Introduction to the Special Issue on Canadian Semantic Web.",
            "A Comprehensive Approach for Sharing Semantic Web Trust Ratings.",
            "A Rule-Based Approach for Semantic Annotation Evolution.",
            "Contextualizing Learning Objects Using Ontologies.",
            "The DATALOGDL Combination of Deduction Rules and Description Logics.",
            "Using Patterns to Explain Inferences in.",
            "Artificial Intelligence Methods for Ambient Intelligence.",
            "DCOP for Smart Homes: A Case Study.",
            "Monitoring Behavior with an Array of Sensors.",
            "Planning in Reactive Environments.",
            "IPRA - Enhancing the Sensing Abilities of Ambient Intelligence.",
            "Recognizing Simple Human Actions Using 3D Head Movement.",
            "A Training Simulation System with Realistic Autonomous Ship Control."
        ]
    },
    {
        "name": "Computational Intelligence",
        "year": "2006",
        "info": "Volume 22: 2006",
        "count": 18,
        "papers": [
            "Against Optimality: Logical Foundations for Decision-Theoretic Planning in Autonomous Agents.",
            "Nonmonotonic Logic and Statistical Inference.",
            "Coalitions Among Intelligent Agents: A Tractable Case.",
            "Word from the Guest Editors.",
            "Recognizing Strong and Weak Opinion Clauses.",
            "The Importance of Neutral Examples for Learning Sentiment.",
            "Sentiment Classification of Movie Reviews Using Contextual Valence Shifters.",
            "Learning to Laugh (automatically): Computational Models for Humor Recognition.",
            "Introduction to the Special Issue on Case-Based Reasoning in the Health Sciences.",
            "Memory Organization as the Missing Link Between Case-Based Reasoning and Information Retrieval in Biomedicine.",
            "Adaptation Knowledge Acquisition: A Case Study for Case-Based Decision Support in Oncology.",
            "Conceptual Clustering and Case Generalization of Two-Dimensional Forms.",
            "Visio-Spatial Case-Based Reasoning: A Case Study in Prediction of Protein Structure.",
            "Accounting for the Temporal Dimension in Case-Based Retrieval: A Framework for Medical Applications.",
            "Predicting Influenza Waves with Health Insurance Data.",
            "Case-Based Reasoning and Knowledge Discovery in Medical Applications with Time Series.",
            "gene-CBR: A Case-Based Reasonig Tool for Cancer Diagnosis Using Microarray Data Sets.",
            "An Evaluation of the Usefulness of Explanation in a Case-Based Reasoning System for Decision Support in Bronchiolitis Treatment."
        ]
    },
    {
        "name": "Computational Intelligence",
        "year": "2005",
        "info": "Volume 21: 2005",
        "count": 21,
        "papers": [
            "Strategic Interactions in a Supply Chain Game.",
            "Compact Diagnoses Representation in Diagnostic Problem Solving.",
            "Feature-Based Korean Grammar Utilizing Learned Constraint Rules.",
            "Fast and Robust Incremental Action Prediction for Interactive Agents.",
            "On Knowledge Grid and Grid Intelligence: A Survey.",
            "XML Declarative Description with First-Order Logical Constraints.",
            "Semantics-Assisted Problem Solving on the Semantic Grid.",
            "Building a Data-Mining Grid for Multiple Human Brain Data Analysis.",
            "Query Routing in a Peer-to-Peer Semantic Link Network.",
            "Using Reinforcement Learning to Coordinate Better.",
            "Automatically Generating Tree Adjoining Grammars from Abstract Specifications.",
            "Preprocessing Rules for Triangulation of Probabilistic Networks.",
            "Hybrid ACE: Combining Search Directions for Heuristic Planning.",
            "Learning to Improve Reasoning.",
            "Learning to Support Constraint Programmers.",
            "Applying Machine Learning to Low-Knowledge Control of Optimization Algorithms.",
            "Learning Preconditions for Planning from Plan Traces and HTN Structure.",
            "Incremental Learning of Procedural Planning Knowledge in Challenging Environments.",
            "Learning to Improve Plan Quality.",
            "The Disciple-RKF Learning and Reasoning Agent.",
            "A Constrained Architecture for Learning and Problem Solving."
        ]
    },
    {
        "name": "Computational Intelligence",
        "year": "2004",
        "info": "Volume 20: 2004",
        "count": 34,
        "papers": [
            "Inter-agent Dialogues in Electronic Marketplaces.",
            "A Multiple Resampling Method for Learning from Imbalanced Data Sets.",
            "Iterated Belief Change.",
            "Reasoning with Sets of Defaults in Default Logic.",
            "System LS: A Three-Tiered Nonmonotonic Reasoning System.",
            "Prospects for Preferences.",
            "Preference-Based Constrained Optimization with CP-Nets.",
            "Utility Functions for Ceteris Paribus Preferences.",
            "Extended Semantics and Optimization Algorithms for CP-Networks.",
            "Solution Generation with Qualitative Models of Preferences.",
            "Multi-Agent Constraint Systems with Preferences: Efficiency, Solution Quality, and Privacy Loss.",
            "Soft Constraint Propagation and Solving in Constraint Handling Rules.",
            "A Classification and Survey of Preference Handling Approaches in Nonmonotonic Reasoning.",
            "Logic Programs with Ordered Disjunction.",
            "Reasoning about Actions and Planning with Preferences Using Prioritized Default Theory.",
            "CBPOP: A Domain-Independent Multi-Case Reuse Planner.",
            "Introduction to the Applications of Evolutionary Computation in Computer Security and Cryptography.",
            "Almost Boolean Functions: The Design of Boolean Functions by Spectral Inversion.",
            "New Concepts in Evolutionary Search for Boolean Functions in Cryptology.",
            "Detecting New Forms of Network Intrusion Using Genetic Programming.",
            "Design of Montgomery Multiplication Architecture Based on Programmable Cellular Automata.",
            "Automated Design of Security Protocols.",
            "Finding Efficient Distinguishers for Cryptographic Mappings, with an Application to the Block Cipher TEA.",
            "Introduction to Special Issue on Agent Technologies for Electronic Business.",
            "The Advantages of Designing Adaptive Business Agents Using Reputation Modeling Compared to the Approach of Recursive Modeling.",
            "Purpose-Based Expert Finding in a Portfolio Management System.",
            "Empowering Automated Trading in Multi-Agent Environments.",
            "A Weighted-Tree Similarity Algorithm for Multi-Agent Systems in E-Business Environments.",
            "A Hybrid Intelligent Multiagent System for E-Business.",
            "Modeling Agent Negotiation Via Fuzzy Constraints in E-Business.",
            "Negotiation Agents that Make Prudent Compromises and are Slightly Flexible in Reaching Consensus.",
            "Negotiating Exchanges of P3p-Labeled Information for Compensation.",
            "Agent-Based Web Services Framework and Development Environment.",
            "A Conversational Approach to the Interaction With Web Services."
        ]
    },
    {
        "name": "Computational Intelligence",
        "year": "2003",
        "info": "Volume 19: 2003",
        "count": 15,
        "papers": [
            "In Memoriam: Raymond Reiter.",
            "Strategic Negotiation for Sharing a Resource Between two Agents.",
            "High-Dimensional Learning Framework for Adaptive Document Filtering.",
            "The Design of a Statistical Algorithm for Resolving Structural Ambiguity IN \"V NP1 usde NP0\".",
            "Semantic-Based Information Retrieval for Content Management and Security.",
            "Blasting Open a Choice Space: Learning Inflectional Morphology for NLP.",
            "Web Discovery and Filtering Based on Textual Relevance Feedback Learning.",
            "Inductive Inference by Using Information Compression.",
            "A Study of AdaBoost with Naive Bayesian Classifiers: Weakness and Improvement.",
            "Belief, Logic, and Partial Truth.",
            "Mining Short-Rule Covers in Relational Databases.",
            "Can Computers Deliberately Deceive? A Simulation Tool and Its Application to Turing's Imitation Game.",
            "Evaluation Metrics in Classification: A Quantification of Distance-Bias.",
            "A Constructive Graphical Model Approach for Knowledge-Based Systems: A Vehicle Monitoring Case Study.",
            "Microplanning with Communicative Intentions: The SPUD System."
        ]
    },
    {
        "name": "Computational Intelligence",
        "year": "2002",
        "info": "Volume 18: 2002",
        "count": 36,
        "papers": [
            "Control and Cross-Domain Mental Computation: Evidence from Language Breakdown.",
            "Control and Communication in Mental Computation.",
            "The Road Not Taken: A Metaphor Not a Model (Response to Frawley).",
            "Comments on Frawley.",
            "SLI and Deficits in the Computational Syntactic System: A Comment on W. Frawley's \"Control and Cross-Domain Mental Computation: Evidence from Language Breakdown\".",
            "Reach Exceeds Grasp: Comments on Frawley's \"Control and Cross-Domain Mental Computation: Evidence from Language Breakdown\".",
            "Sequencing of Information Versus Interfacing Between Processing Levels.",
            "Development as a Cause in Developmental Disorders: (Commentary on \"Control and Cross-Domain Mental Computation: Evidence from Language Breakdown\" by William Frawley).",
            "Implicit Versus Explicit Representation and Intra- Versus Inter-Modular Processing.",
            "Mental Computation and Language Breakdown: Clarifications, Extensions, and Responses.",
            "Trends in Agent Communication Language.",
            "An ACL for a Dynamic System of Agents.",
            "To Commit or Not to Commit: Modeling Agent Conversations for Action.",
            "Toward A Formalism for Conversation Protocols Using Joint Intention Theory.",
            "Negotiating the Semantics of Agent Communication Languages.",
            "Introduction to the Special Issue.",
            "Generate and Repair Machine Translation.",
            "Handwritten Thai Character Recognition Using Fourier Descriptors and Genetic Neural Network.",
            "English-Thai Structure-Based Machine Translation.",
            "A Method for Isolated Thai Tone Recognition Using a Combination of Neural Networks.",
            "Toward a Unifying Ontology Dealing with Both User-Defined Periodicity and Temporal Constraints About Repeated Events.",
            "On the Hybrid Propositional Encodings of Planning.",
            "Topological Spatio-Temporal Reasoning and Representation.",
            "A Shallow Text Processing Core Engine.",
            "Introduction to the Special Issue on Agent Technologies for Electronic Commerce.",
            "Automated Negotiation from Declarative Contract Descriptions.",
            "Contracting With Uncertain Level Of Trust.",
            "Reputation Formalization for an Information-Sharing Multi-Agent System.",
            "Distributed Reputation Management for Electronic Commerce.",
            "A Reputation-Oriented Reinforcement Learning Strategy for Agents in Electronic Marketplaces.",
            "Model Selection in an Information Economy: Choosing What to Learn.",
            "Agent Reasoning Mechanism for Long-Term Coalitions Based on Decision Making and Trust.",
            "Design of a Multi-Unit Double Auction E-Market.",
            "A Market-Driven Model for Designing Negotiation Agents.",
            "Architectural Components of Information-Sharing Societies.",
            "eMediator: A Next Generation Electronic Commerce Server."
        ]
    },
    {
        "name": "Computational Intelligence",
        "year": "2001",
        "info": "Volume 17: 2001",
        "count": 38,
        "papers": [
            "Wishful: A Discourse Planning System That Considers a User's Inferences.",
            "Defeasible Inheritance Through Specialization.",
            "Abductive Diagnosis Using Time-Objects: Criteria for the Evaluation of Solutions.",
            "Architectural Methodology Based on Intentional Configuration of Behaviors.",
            "Choices for Lexical Semantics.",
            "The Reasonableness of Possibility From the Perspective of Cox.",
            "Introduction to the Special Issue on Maintaining Case-Based Reasoning Systems.",
            "Maintaining Cased-Based Reasoners: Dimensions and Directions.",
            "Review and Restore for Case-Based Maintenance.",
            "Competence Models and the Maintenance Problem.",
            "Case-Base Maintenance in a Multimodal Reasoning System.",
            "Case-Base Maintenance by Integrating Case-Index Revision and Case-Retention Policies in a Derivational Replay Framework.",
            "Transferring Case Knowledge to Adaptation Knowledge: An Approach for Case-Base Maintenance.",
            "Distributing Case-Base Maintenance: The Collaborative Maintenance Approach.",
            "Intelligent Case-Authoring Support in CaseMaker-2.",
            "Maintaining Retrieval Knowledge in a Case-Base Reasoning System.",
            "Systematic Maintenance of Corporate Experince Repositories.",
            "A Case Study of Maintenance of a Commercially Fielded Case-Based Reasoning System.",
            "Combining Rough Sets and Bayes' Rules.",
            "Rule Quality Measures for Rule Induction Systems: Description and Evaluation.",
            "Coping with Missing Attribute Values Based on Closest Fit in Preterm Birth Data: A Rough Set Approach.",
            "Application of Rough Genetic Algorithms.",
            "Rough Problem Settings for ILP Dealing with Imperfect Data.",
            "The Variable Precision Rough Set Inductive Logic Programming Model and Strings.",
            "Rough Mereological Calculi of Granules: A Rough Set Approach to Computation.",
            "Rough Neural Computing in Signal Analysis.",
            "Granular Computing: A Rough Set Approach.",
            "Incomplete Information Tables and Rough Classification.",
            "Interval Evaluations in the Analytic Hierarchy Process by Possibility Analysis.",
            "Evolving Granules for Classification for Discovering Difference in the Usage of Words.",
            "Probabilistic Decision Tables in the Variable Precision Rough Set Model.",
            "A Complexity-Level Analysis of the Sensor Planning Task for Object Search.",
            "Control States and Complete Agent Architectures.",
            "Semantic Forcing in Disjunctive Logic Programs.",
            "Discovering Maximal Generalized Decision Rules Through Horixontal and Vertical Data Reduction.",
            "Granularity in Relational Formalisms - With Application to Time and Space Representation.",
            "Social Mental Shaping: Modelling the Impact of Sociality on the Mental States of Autonomous Agents.",
            "A Pattern-Weight Formulation of Search Knowledge."
        ]
    },
    {
        "name": "Computational Intelligence",
        "year": "2000",
        "info": "Volume 16: 2000",
        "count": 28,
        "papers": [
            "An Integrated Instance-Based Learning Algorithm.",
            "Updates with Disjunctive Information: From Syntactical and Semantical Perspectives.",
            "A Complexity Model and a Polynomial Algorithm for Decision-Tree-Based Feature Construction.",
            "Semantic Distance Measures.",
            "Integrating Web-Based Documents, Shared Knowledge Bases, and Information Retrieval for User Help.",
            "Noisy Time-Series Prediction Using Pattern Recognition Techniques.",
            "Introduction to the Special issue on Time and Temporal Reasoning.",
            "A Qualitative Model for Time Granularity.",
            "Tackling the Qualification Problem Using Fluent Dependency Constraints.",
            "Integrated Temporal Reasoning with Periodic Events.",
            "Constraint Reasoning about Repeating Events: Satisfaction and Optimization.",
            "Model-Based Visualization of Temporal Abstractions.",
            "A Guided Tour through Some Extensions of the Event Calculus.",
            "Temporal Reasoning, Bayesian Networks.",
            "Parsing and Interpretation in the Minimalist Paradigm.",
            "Choosing Rhetorical Structures to Plan Instructional Texts.",
            "Strategies in Human Nonmonotonic Reasoning.",
            "On resolving Conflicts between Arguments.",
            "Introduction To the Special Issue on the 1999 Pacific Association for Computational Linguistics Conference.",
            "An Algorithmic Framework for Specifying the Semantics of Discourse Relations.",
            "Second-Order Cohesion.",
            "Realizing Presuppositions in a Montague Grammar-Like Fragment of English.",
            "Probability-Based Chinese Text Processing and Retrieval.",
            "Construction of Deliberation Structure in E-Mail Communication.",
            "Query-Biased Summarization Based on Lexical Chaining.",
            "Applying Machine Learning for High-Performance Named-Entity Extraction.",
            "Using Images As a Foundation for Natural Language Processing.",
            "Interactive, Text-Based Summarization of Multiple Documents."
        ]
    },
    {
        "name": "Computational Intelligence",
        "year": "1999",
        "info": "Volume 15: 1999",
        "count": 18,
        "papers": [
            "Knowledge Retrieval, Use and Storage for Efficiency.",
            "Scalability in Formal Concept Analysis.",
            "Knowledge Discovery in Complex Objects.",
            "Encoding of Multiple Inheritance Hierarchies and Partial Orders.",
            "An Algorthm for Minimal Insertion in a Type Lattice.",
            "Efficient Implementation of Semantic Relations in Lexical Databases.",
            "Introduction to the Special Issue on PACLING'97.",
            "Retrieving Domain-Specific Collocations by Co-occurrences and Word Order Constraints.",
            "Resolving Ambiguious Segmentation of Korean Compound Nouns Using Statistics and Rules.",
            "A Pattern-Based Approach Uding Compound Unit Recognition and Its Hybridization with Rule-Based Translation.",
            "English-Thai Translation: Initial Experiments with a Multiphase Translation System.",
            "Cooperative Understanding of Utterances and Gestures in a Dialogue-Based Problem Solving System.",
            "Time Series Prediction with Genetic-Algorithm Designed Neural Networks: An Empirical Comparison with Modern Statistical Models.",
            "Constructing and Utilizing a Model of User Preferences in Collaborative Consultation Dialogues.",
            "Feasible Formation of Coalitions among Autonomous Agents in Nonsuperadditve Environments.",
            "Experimentation-Driven Knowledge Acquisition for Planning.",
            "Compiling Ramification Constraints into Effect Axioms.",
            "Integrating Case-Based and Rule-Based Reasoning to Meet Multiple Design Constraints."
        ]
    },
    {
        "name": "Computational Intelligence",
        "year": "1998",
        "info": "Volume 14: 1998",
        "count": 21,
        "papers": [
            "Process and Policy: Resource-Bounded Nondemonstrative Reasoning.",
            "Integrating Discrete and Continuous Change in a Logical Framework.",
            "An Action Representation Formalism to Interpret Natural Language Instructions.",
            "A Many-Sorted Natural Deduction.",
            "Reasoning about Locations in Theory and Practice.",
            "Depth-First Branch-and-Bound vs. Depth-Bounded IDA*.",
            "Representing and Reasoning about Motion in a Two-Dimensional World.",
            "Using Diagrams to Understand Geometry.",
            "The 6-49 Lottery Paradox.",
            "Toward a Model Theory of Actions: How Agents do it in Branching Time.",
            "Pattern Databases.",
            "Logic for Nested Graphs.",
            "An Approach for Merging Plans Hierarchically in Decomposable Domains.",
            "Utility Models for Goal-Directed, Decision-Theoretic Planners.",
            "Analysis of Heuristics for Number Partitioning.",
            "On the Correctness and Reasonableness of Cox's Theorem for Finite Domains.",
            "Utilizing Moment Invariants and Grobner Bases to Reason about Shapes.",
            "Probabilistic Inference in Influence Diagrams.",
            "Perceiving and Reasoning about a Changing World.",
            "Expressing Time Intervals and Repetition within a Formalization of Calendars.",
            "The Foundations of Taxonomic Encoding."
        ]
    },
    {
        "name": "Computational Intelligence",
        "year": "1997",
        "info": "Volume 13: 1997",
        "count": 21,
        "papers": [
            "Determining Prepositional Attachment, Prepositional Meaning, Verb Meaning, and Thematic Roles.",
            "Abstractional Concept Mapping: A Foundational Model for Analogical Reasoning.",
            "An Informal Semantic Analysis of Motion Verbs Based on Physical Primitives.",
            "Discounted Reinforcement Learning Does Not Scale.",
            "A Critical Reexamination of Default Logic, Autoepistemic Logic, and Only Knowing.",
            "What Should Default Reasoning Be, by Default?",
            "A Formal Model for Experience-Aided Diagnosis.",
            "Combinatorial Semantics: Semantics for Frequent Validity.",
            "Extending Conceptual Definitions with Default Knowledge.",
            "Introduction to the Special Issue on Context in Natural Language Processing.",
            "Conversational Actions and Discourse Situations.",
            "Reasoning with Intensional Negative Adjectivals: Semantics, Pragmatics, and Context.",
            "Interpreting Presuppositions Using Active Logic: From Contexts to Utterances.",
            "Types of Contexts and Their Role in Multimodal Communication.",
            "The Use of Situation Theory in Context Modeling.",
            "Multimodel Interaction for Information Access: Exploiting Cohesion.",
            "A Temporal Knowledge Representation Approach Based on Elementary Calculus.",
            "Decomposing and Solving Timetabling Constraint Networks.",
            "Default Reasoning and Generics.",
            "Simulated Annealing and the Generation of the Objective Function: A Model of Learning During Problem Solving.",
            "Regularity-based Perceptual Grouping."
        ]
    },
    {
        "name": "Computational Intelligence",
        "year": "1996",
        "info": "Volume 12: 1996",
        "count": 28,
        "papers": [
            "Introduction to the Special Issue on Games: Structure and Learning.",
            "Go-Moku Solved by New Search Techniques.",
            "Solving Nine Men's Morris.",
            "Knowledge-Based Feature Discovery for Evaluation Functions.",
            "Learning Playing Strategies in Chess.",
            "Learning of Resource Allocation Strategies for Game Playing.",
            "A Planning Approach to Declarer Play in Contract Bridge.",
            "Perfect Recall and Pruning in Games with Imperfect Information.",
            "General Game-Playing and Reinforcement Learning.",
            "A Strategic Metagame Player for General Chess-Like Games.",
            "Pattern-Based Learning and Spatially Oriented Concept Formation in a Multi-Agent, Decision-Making Expert.",
            "A Method for Computing All Maximally General Rules in Attribute-Value Systems.",
            "On Temporal Deductive Databases.",
            "Learning Monotonic-Concave Interval Concepts Using the Back-Propagation Neural Networks.",
            "Interactive Semantic Analysis of Technical Texts.",
            "On the Implenentation and Evaluation of ABTWEAK.",
            "A Strengthened Algorithm for Temporal Reasoning about Plans.",
            "It's About Time: An Introduction to the Special Issue on Temporal Representation and Reasoning.",
            "Efficient Temporal Reasoning in the Cached Event Calculus.",
            "Constrained Resolution and Abductive Temporal Reasoning.",
            "Temporal Reasoning with the Modal Logic Z.",
            "Localized Temporal Reasoning Using Subgoals and Abstract Events.",
            "Domain-Independent Temporal Reasoning with Recurring Events.",
            "Hypothetical Reasoning about Actions: From Situation Calculus to Event Calculus.",
            "Event Tracking in a Dynamic Multiagent Environment.",
            "Validation of First-Order Rule-Based Systems.",
            "Computation of Best Bounds of Probabilities from Uncertain Data.",
            "Recurrent Neural Networks and Finite Automata."
        ]
    },
    {
        "name": "Computational Intelligence",
        "year": "1995",
        "info": "Volume 11: 1995",
        "count": 31,
        "papers": [
            "Simpson's Paradox in Artificial Intelligence and in Real Life.",
            "A Logical Characterization for Truth Maintenance Systems with Dependency-Directed Backtracking.",
            "A Framework for Logics of Explicit Belief.",
            "Computing Perfect and Stable Model Using Ordered Model Trees.",
            "A Logic of Argumentation for Reasoning under Uncertainty.",
            "Designing and Building a Negotiating Automated Agent.",
            "On the Construction of a Prolog-Based Verifier for Systolic Array Designs.",
            "Introduction to the Special Issue on Rough Sets and Knowledge Discovery.",
            "Extension of the Relational Database and its Algebra with Rough Set Techniques.",
            "Incremental Concept Formation Algorithms Based on Galois (Concept) Lattices.",
            "The Usefulness of a Machine Learning Approach to Knowledge Acquisition.",
            "Vagueness and Uncertainty: A Rough Set Perspective.",
            "Estimating DBLEARN's Potential for Knowledge Discovery in Databases.",
            "Handling Information Logics in a Graphical Proof Editor.",
            "Learning in Relational Databases: A Rough Set Approach.",
            "Rough Set Reduction of Attributes and their Domains for Neural Networks.",
            "Rule-Based Stabilization of the Inverted Pendulum.",
            "Data-Based Acqusition and Incremental Modification of Classification Rules.",
            "Extracting Laws from Decision Tables: A Rough Set Approach.",
            "PRIMEROSE: Probabilistic Rule Induction Method based on Rough Sets and Resampling Methods.",
            "On Modeling Uncertainty with Interval Structures.",
            "Quantification of Unvertainty in Classification Rules Discovered from Databases.",
            "On Computing the Minimal Labels in Time Point Algebra Networks.",
            "An Intuitive Motivation of Bayesian Belief Models.",
            "An Epistemic Logic with Quantification over Names.",
            "A New Method for Influence Diagram Evaluation.",
            "Time, Action-Types, Causation: An Integrated Analysis.",
            "Intractability in the Allen and Koomen Planner.",
            "Intelligent Behavior in Machines Emerging from a Collection of Interactive Control Structures.",
            "Planning to Find the Referents of Noun Phrases.",
            "Complexity Results for SAS+ Planning."
        ]
    },
    {
        "name": "Computational Intelligence",
        "year": "1994",
        "info": "Volume 10: 1994",
        "count": 48,
        "papers": [
            "Guest Editor's Introduction: Here's the AI.",
            "Believing on the Basis of the Evidence.",
            "A Response to \"Believing on the Basis of the Evidence\".",
            "Believing on the Basis of Qualitative Rules: Commentary on Kyburg.",
            "On Accepting Acceptance.",
            "On a General Approach to Hedged Reasoning.",
            "Inference and Acceptance: Comment on Kyburg's \"Believing on the Basis ofthe Evidence\".",
            "Evidential Probabilities Are Not Enough.",
            "Hedges, Background Knowledge, and Evidence: A Reply to Kyburg's\" Believing on the Basis of the Evidence\".",
            "Contribution to the Discussion of Henry E.",
            "Justification, Probability, and Consistency.",
            "Commentary on Kyburg.",
            "Hedging Acceptance.",
            "Kyburg and Volkswagens.",
            "Evidence, Belief, and Inference.",
            "The Role of Probability in Epistemology.",
            "Discussion of Kyburg's \"Believing on the Basis of Evidence\".",
            "Believing on the Basis of the Evidence: Answer to Kyburg's Paper.",
            "Philosophy as Engineering.",
            "Kyburgian Acceptance: A Rejection, Hedged.",
            "Logic, Science, and Engineering.",
            "The Scope of Dimensional Analysis in Qualitative Reasoning.",
            "MetaBank: A Knowledge-Base of Metaphoric Language Conventions.",
            "Reasoning with Background Knowledge - A Three-Level Theory.",
            "Correcting Real-Word Spelling Errors Using a Model of the Problem-SolvingContext.",
            "Exploiting Causal Structure to Control Retrieval and Refitting during Plan Reuse.",
            "An Evaluation of the Temporal Coherence Heuristic in Partial-Order Planning.",
            "Learning Bayesian Belief Networks: An Approach Based on the MDL Principle.",
            "Abduction and Explanation-Based Learning: Case Studies in Diverse Domains.",
            "Default Logics: A Unified View.",
            "Restricting the Weak-Generative Capacity of Synchronous Tree-Adjoining Grammars .",
            "Word Order Variation and Tree-Adjoining Grammar.",
            "Obtaining Trees from their Descriptions: An Application to Tree-Adjoining Grammars.",
            "A New Automaton Model for TAGs: 2-SA.",
            "Linear Iterated Pushdowns.",
            "The Computational Complexity of the Universal Recognition Problem for Parallel Multiple Context-Free Grammars.",
            "Nominal Structures and Structural Recursion.",
            "Syntax or Semantics? Handling Nonlocal Dependencies with MCTAGs or Synchronous TAGs.",
            "Recognition can Be Harder Than Parsing.",
            "Logical Embedded Push-Down Automata in Tree-Adjoining Grammar Parsing.",
            "Left to Right Parsing of Lexicalized Tree-Adjoining Grammars.",
            "Head-Corner Parsing for TAG.",
            "Predictive Left-to-Right Parsing of a Restricted Variant of TAG (LD/LP).",
            "Incremental Parsing with LD/TLP-TAGs.",
            "LL(k) e-Parsing on Coupled-Context-Free Grammars.",
            "Toward an Integrated Generation Approach with Tree-Adjoining Grammars.",
            "Using UTAGS for Incremental and Parallel Generation.",
            "A Semantic Head-Driven Generation System for Feature Structure Tree-Adjoining Grammars."
        ]
    },
    {
        "name": "Computational Intelligence",
        "year": "1993",
        "info": "Volume 9: 1993",
        "count": 12,
        "papers": [
            "The Relation between Ordinal Problem Space Sizes and the Maximum Number of Ordinal Classification Rules.",
            "Clause Management Systems.",
            "Semantical and Ontological Consideration in Telos: A Language for Knowledge Representation.",
            "On the Semantics of Stable Inheritance Reasoning.",
            "Using a Functional Language for Parsing and Semantic Processing.",
            "From Plan Critiquing to Clarification Dialogue for Cooperative ResponseGeneration.",
            "Polynomial Time Algorithms for Learning Neural Nets of NonoverlappingPerceptrons.",
            "Multiply Sectioned Bayesian Networks and Junction Forests for Large Knowledge-Based Systems.",
            "The Typicality of Phase Transitions in Search.",
            "The LazyRMS: Avoiding Work in the ATMS.",
            "An Argument-Based Approach to Nonmonotonic Reasoning.",
            "Hybrid Algorithms for the Constraint Satisfaction Problem."
        ]
    },
    {
        "name": "Computational Intelligence",
        "year": "1992",
        "info": "Volume 8: 1992",
        "count": 48,
        "papers": [
            "Assumption-Based Reasoning and Clause Management Systems.",
            "Structure Recognition by Connectionist Relaxation: Formal Analysis.",
            "Combining Knowledge Bases Consisting of First-Order Analysis.",
            "Introduction.",
            "Toward a Theory of Compilation for Natural Language Generation.",
            "Story Generation Based on Dynamics of the Mind.",
            "Some Neglected Aspects of the Generation Task.",
            "Qualitative Physics: Albatross or Eagle?",
            "Prolegomena to Any Future Qualitative Physics.",
            "Narrow Views, Old Talks, New Beginnings.",
            "QP is more than SPQR and Dynamical Systems Theory: Response to Sacks and Doyle.",
            "Comments on Prolegomena to Any Future Qualitative Physics.",
            "From Qualitative to Quantitative Physics.",
            "Response to Prolegomena to Any Future Qualitative Physics.",
            "The Physics of Future Past: A Response to Sacks and Doyle.",
            "Prolegomena to Any Future Prolegomena.",
            "Straw Men: A Response to Sacks and Doyle.",
            "The Qualitative Reasoning Hypothesis: A Response to Sacks and Doyles' Prolegomena.",
            "On Shooting Flies with Cannonballs and Elephants with Rubber Bands.",
            "A Strategy for Research Model Formulation.",
            "Whither Qualitative Reasoning? A Response to Sacks and Doyle.",
            "Qualitative Physics Beyond Automated Mathematics.",
            "Reply to Sacks and Doyle's, Prolegomena to Any Future Qualitative Physics.",
            "Real Physics for Real Engineers: Response to Prolegomena to Any Future Qualitative Physics.",
            "Guaranteed Coverage Versus Intelligent Sampling: A Reply to Sacks and Doyle.",
            "Comments on Prolegomena e by Sacks and Doyle.",
            "Three Radical Quibbles with the Prolegomena.",
            "Whose Expertise is it Anyway?",
            "Some Comments on the Sacks-Doyle Prolegomena Article.",
            "Directions for Qualitative Reasoning.",
            "Response to Prolegomena to Any Future Qualitative Physics e by Elisha Sacks and Jon Doyle.",
            "Mechanical Engineering is more than Differential Equations.",
            "Some Features of Expert Reasoning in Qualitative Physics.",
            "Epilegomenon.",
            "Using Distribution-Free Learning Theory to Analyze Solution Path Caching Mechan isms.",
            "Rationality and its Roles in Reasoning.",
            "Introduction to the Special Issue on Non-Literal Language.",
            "The Role of Literal Meaning in the Comprehension of Non-Literal Constructions.",
            "Idioms, Non-Literal Language and Knowledge Representation.",
            "PAU: Parsing and Understanding with Uniform Syntactic, Semantic, and Idiomatic Representations.",
            "Metallel: An Integrated Approach to Non-Literal Phrase Interpretation.",
            "Conceptual Scaffolding: A Spatially Founded Meaning Representation for Metaphor Comprehension.",
            "Belief in Metaphor: Taking Commonsense Psychology Seriously.",
            "Metaphoric Coherence: Distinguishing Verbal Metaphor from \"Anomaly\".",
            "Conversation Acts in Task-Oriented Spoken Dialogue.",
            "Hierarchical Arc Consistency for Disjoint Real Intervals in Constraint Logic Programming.",
            "Construction of Belief and Decision Networks.",
            "Merging Separately Generated Plans with Restricted Interactions."
        ]
    },
    {
        "name": "Computational Intelligence",
        "year": "1991",
        "info": "Volume 7: 1991",
        "count": 15,
        "papers": [
            "Markov analysis of qualitative dynamics.",
            "Using crucial literals to select better theories.",
            "Denkprothesen e: on programs that reason.",
            "Egomotion perception using visual tracking.",
            "The NIKL experience.",
            "The role of the user's domain knowledge in generation.",
            "Logic, probability theory, and artificial intelligence - Part I: the probabilistic foundations of logic.",
            "Determining intended evidence relations in natural language arguments.",
            "Learning in relational databases: an attribute-oriented approach.",
            "A spectrum of logical definitions of model-based diagnosis.",
            "Making default inferences from logic programs.",
            "Notes on Ginsberg's multivalued logics.",
            "Uncertainty, belief, and probability.",
            "Self-learning inductive inference machines.",
            "Planning in polynomial time: the SAS-PUBS class."
        ]
    },
    {
        "name": "Computational Intelligence",
        "year": "1990",
        "info": "Volume 6: 1990",
        "count": 20,
        "papers": [
            "Empirical results with conspiracy numbers.",
            "Formalizing planning knowledge for hierarchical planning.",
            "A predictive approach for the generation of rhetorical devices.",
            "A basic agent.",
            "A logic programming approach to cartographic map overlay.",
            "DISLOG: programming in logic with discontinuities.",
            "Intelligent computer-aided-design systems: a synergical approach of artificial intelligence and engineering.",
            "Building geometric world models with graph synthesis for sensor fusion in mobil e robots.",
            "Time revisited.",
            "APACS: a system for the automatic analysis and classification of conceptual pat terns.",
            "Exact and approximate reasoning about temporal relations.",
            "Reversible logic grammars for natural language parsing and generation.",
            "Feature grammars for semantic analysis.",
            "Probability and logic: a reply to Cheeseman.",
            "Let many flowers bloom: a response to An inquiry into computer understanding e.",
            "On the importance of evidence: a response to Halpern.",
            "Modeling the user's conceptual knowledge in BGP-MS, a user modeling shell system.",
            "Lp, a logic for representing and reasoning with statistical knowledge.",
            "Can AI planners solve practical problems?",
            "Learning hard concepts through constructive induction: framework and rationale."
        ]
    },
    {
        "name": "Computational Intelligence",
        "year": "1989",
        "info": "Volume 5: 1989",
        "count": 14,
        "papers": [
            "Constructive belief and rational representation.",
            "Compiling general linear recursions by variable connection graph analysis.",
            "Representing defaults with epistemic concepts.",
            "Learning, classification of monotonic ordinal concepts.",
            "Instance-based prediction of real-valued attributes.",
            "Knowledge acquisition by incremental learning from problem-solution pairs.",
            "Explicitly biased generalization.",
            "An investigation of modal structures as an alternative semantic basis for epistemic logics.",
            "Explanation, prediction: an architecture for default, abductive reasoning.",
            "Qualitative data modeling: application of a mechanism for interpreting graphical data.",
            "Discontinuous grammars.",
            "A note on evidence, confirmation in machine learning.",
            "Constraint satisfaction algorithms.",
            "Moments, points in an interval-based temporal logic."
        ]
    },
    {
        "name": "Computational Intelligence",
        "year": "1988",
        "info": "Volume 4: 1988",
        "count": 49,
        "papers": [
            "Considerations on default logic: an alternative approach.",
            "Logical omniscience, semantics, and models of belief.",
            "The consistency of syntactical treatments of knowledge.",
            "Learning and discovery: one system's search for mathematical knowledge.",
            "An inquiry into computer understanding.",
            "Comments on Peter Cheeseman's An inquiry into computer understanding.",
            "Probability, truth, and logic: reply to Cheeseman.",
            "Comments on An inquiry into computer understanding by Peter Cheeseman.",
            "Comments on An inquiry into computer understanding by Peter Cheeseman.",
            "Comments on An inquiry into computer understanding.",
            "Reply to Cheeseman's An inquiry into computer understanding.",
            "Against the unjustified use of probabilities.",
            "Comments on Peter Cheeseman's An inquiry into computer understanding.",
            "On Cheeseman.",
            "Discussion of Cheeseman's An inquiry into computer understanding.",
            "Liberty, license, and reason.",
            "Comments on Cheeseman: why plausible reasoning.",
            "In praise of Bayes.",
            "Probability theory versus procedural pessimism.",
            "Combining logic and probability.",
            "On logic and probability.",
            "Reply to An inquiry into computer understanding.",
            "Intelligent understanding and wishful thinking: the dangers of epistemological alchemy.",
            "Cheeseman: a travesty of truth.",
            "Comments on An inquiry into computer understanding by Peter Cheeseman.",
            "Comments on An inquiry into computer understanding by Peter Cheeseman.",
            "An inquiry into computer understanding: a partial dissent.",
            "In defense of An inquiry into computer understanding.",
            "A glance at artificial intelligence in France: editorial.",
            "OBADE: cognitive modelling with objects.",
            "What kind of thing is a concept?",
            "On the consistency of knowledge bases: the COVADIS system.",
            "On fuzzy syllogisms.",
            "Towards and analyzer (parser) in a machine translation system based on ideas from expert systems.",
            "A question-answering system for the French Yellow Pages.",
            "Processing of unknown words in a natural language question-answering system.",
            "Machine learning research at the Laboratoire de Recherche en Informatique at Orsay, France.",
            "Reasoning about knowledge and belief: a survey.",
            "Representation and combination of uncertainty with belief functions and possibility measures.",
            "Multivalued logics: a uniform approach to reasoning in artificial intelligence.",
            "Special issue on planning: an introduction.",
            "Localized event-based reasoning for multiagent domains.",
            "Exploiting temporal coherence in nonlinear plan construction.",
            "Plans and resource-bounded practical reasoning.",
            "Synthesizing plans that contain actions with context-dependent effects.",
            "Casual reasoning in planning.",
            "Hierarchical planning involving deadlines, travel time, and resources.",
            "Exhuming the criticism of the logicist.",
            "FIAT LUX: A reply to McDermott's A critiwue of pure reason."
        ]
    },
    {
        "name": "Computational Intelligence",
        "year": "1987",
        "info": "Volume 3: 1987",
        "count": 21,
        "papers": [
            "Automatic program debugging for intelligent tutoring systems.",
            "An architecture for a self-improving instructional planner for intelligent tutoring systems.",
            "LIY: learn-it-yourself software interfaces.",
            "Meaning representation in Montague grammar and situation semantics.",
            "Representing complex knowledge in an intelligent machine tutor.",
            "Gödel, Lucas, and mechanical models of the mind.",
            "A hybrid, decidable, logic-based knowledge representation system.",
            "Expressiveness and tractability in knowledge representation and reasoning.",
            "Domain circumscription: a reevaluation.",
            "Defeat among arguments: a system of defeasible inference.",
            "Patterns of interaction in rule-based expert system programming.",
            "The papers of this issue on machine learning: editorial.",
            "Similarity-based learning and its extensions.",
            "Cohesion methods in inductive learning.",
            "Learning in artificial neural systems.",
            "A discussion of a report by Ehud Shapiro.",
            "Inductive ambiguity and the limits of artificial intelligence.",
            "A foundational approach to autonomous knowledge acquisition.",
            "Learning to control a dynamic physical system.",
            "A computational theory of motor learning.",
            "A reasoning-based approach to machine learning."
        ]
    },
    {
        "name": "Computational Intelligence",
        "year": "1986",
        "info": "Volume 2: 1986",
        "count": 19,
        "papers": [
            "Expression of syntactic and semantic features in logic-based grammars.",
            "Toward a computational interpretation of situation semantics.",
            "Unrestricted gapping grammars.",
            "Natural language understanding and Montague grammar.",
            "AI approaches to education: editorial.",
            "Formative evaluation in the development and validation of expert systems in edu cation.",
            "A programming language for learning environments.",
            "The design of the SCENT automated advisor.",
            "The role of native grammars in correcting errors in second language learning.",
            "Student modelling by a knowledge-based system.",
            "COACH: A tutor based on active schemas.",
            "Knowledge sources for an intelligent algebra tutor.",
            "Recognition algorithms for the connection machine.",
            "An explanation shell for expert systems.",
            "Parsing with restricted quantification: an initial demonstration.",
            "Using knowledge generated in heuristic search for nonchronological backtracking.",
            "A framework for computing extrasentential references.",
            "On the consistency of commonsense reasoning.",
            "Learning rules for graph transformations by induction from examples."
        ]
    },
    {
        "name": "Computational Intelligence",
        "year": "1985",
        "info": "Volume 1: 1985",
        "count": 4,
        "papers": [
            "Plan parsing for intended response recognition in discourse.",
            "On the adequacy of predicate circumscription for closed-world reasoning.",
            "Knowledge organization and its role in representation and interpretation for time-varying data: the ALVEN system.",
            "Recovering from execution errors in SIPE."
        ]
    }
]