[
    {
        "year": "2020",
        "name": "24th CoNLL 2020",
        "info": "Online",
        "venues": [
            {
                "sub_name_abbr": "conf/conll/2020",
                "sub_name": "Proceedings of the 24th Conference on Computational Natural Language Learning, CoNLL 2020, Online, November 19-20, 2020.",
                "count": 53,
                "papers": [
                    "Enriching Word Embeddings with Temporal and Spatial Information.",
                    "Interpreting Attention Models with Human Visual Attention in Machine Reading Comprehension.",
                    "Neural Proof Nets.",
                    "TaxiNLI: Taking a Ride up the NLU Hill.",
                    "Modeling Subjective Assessments of Guilt in Newspaper Crime Narratives.",
                    "On the Frailty of Universal POS Tags for Neural UD Parsers.",
                    "Classifying Syntactic Errors in Learner Language.",
                    "How to Probe Sentence Embeddings in Low-Resource Languages: On Structural Design Choices for Probing Task Evaluation.",
                    "Understanding the Source of Semantic Regularities in Word Embeddings.",
                    "Finding The Right One and Resolving it.",
                    "Bridging Information-Seeking Human Gaze and Machine Reading Comprehension.",
                    "A Corpus of Very Short Scientific Summaries.",
                    "Recurrent babbling: evaluating the acquisition of grammar from limited input data.",
                    "A simple repair mechanism can alleviate computational demands of pragmatic reasoning: simulations and complexity analysis.",
                    "Acquiring language from speech by learning to remember and predict.",
                    "Identifying Incorrect Labels in the CoNLL-2003 Corpus.",
                    "When is a bishop not like a rook? When it's like a rabbi! Multi-prototype BERT embeddings for estimating semantic relationships.",
                    "Processing effort is a poor predictor of cross-linguistic word order frequency.",
                    "Relations between comprehensibility and adequacy errors in machine translation output.",
                    "Cross-lingual Embeddings Reveal Universal and Lineage-Specific Patterns in Grammatical Gender Assignment.",
                    "Modelling Lexical Ambiguity with Density Matrices.",
                    "Catplayinginthesnow: Impact of Prior Segmentation on a Model of Visually Grounded Speech.",
                    "Learning to ground medical text in a 3D human atlas.",
                    "Representation Learning for Type-Driven Composition.",
                    "Word Representations Concentrate and This is Good News!",
                    "\"LazImpa\": Lazy and Impatient neural agents learn to communicate efficiently.",
                    "Re-solve it: simulating the acquisition of core semantic competences from small data.",
                    "In Media Res: A Corpus for Evaluating Named Entity Linking with Creative Works.",
                    "Analogies minus analogy test: measuring regularities in word embeddings.",
                    "Word associations and the distance properties of context-aware word embeddings.",
                    "TrClaim-19: The First Collection for Turkish Check-Worthy Claim Detection with Annotator Rationales.",
                    "Discourse structure interacts with reference but not syntax in neural language models.",
                    "Continual Adaptation for Efficient Machine Communication.",
                    "Diverse and Relevant Visual Storytelling with Scene Graph Embeddings.",
                    "Alleviating Digitization Errors in Named Entity Recognition for Historical Documents.",
                    "Analysing Word Representation from the Input and Output Embeddings in Neural Network Language Models.",
                    "On the Computational Power of Transformers and Its Implications in Sequence Modeling.",
                    "An Expectation Maximisation Algorithm for Automated Cognate Detection.",
                    "Filler-gaps that neural networks fail to generalize.",
                    "Don't Parse, Insert: Multilingual Semantic Parsing with Insertion Based Decoding.",
                    "Learning Context-free Languages with Nondeterministic Stack RNNs.",
                    "Generating Narrative Text in a Switching Dynamical System.",
                    "What Are You Trying to Do? Semantic Typing of Event Processes.",
                    "A Corpus for Outbreak Detection of Diseases Prevalent in Latin America.",
                    "Are Pretrained Language Models Symbolic Reasoners over Knowledge?",
                    "Understanding Linguistic Accommodation in Code-Switched Human-Machine Dialogues.",
                    "Identifying robust markers of Parkinson's disease in typing behaviour using a CNN-LSTM network.",
                    "An Empirical Study on Model-agnostic Debiasing Strategies for Robust Natural Language Inference.",
                    "Cloze Distillation: Improving Neural Language Models with Human Next-Word Prediction.",
                    "Disentangling dialects: a neural approach to Indo-Aryan historical phonology and subgrouping.",
                    "A Dataset for Linguistic Understanding, Visual Evaluation, and Recognition of Sign Languages: The K-RSL.",
                    "From Dataset Recycling to Multi-Property Extraction and Beyond.",
                    "How well does surprisal explain N400 amplitude under different experimental conditions?"
                ]
            },
            {
                "sub_name_abbr": "conf/conll/2020st",
                "sub_name": "Proceedings of the CoNLL 2020 Shared Task: Cross-Framework Meaning Representation Parsing, CoNLL Shared Task 2020, Online, November 19-20, 2020.",
                "count": 8,
                "papers": [
                    "MRP 2020: The Second Shared Task on Cross-Framework and Cross-Lingual Meaning Representation Parsing.",
                    "DRS at MRP 2020: Dressing up Discourse Representation Structures as Graphs.",
                    "FGD at MRP 2020: Prague Tectogrammatical Graphs.",
                    "Hitachi at MRP 2020: Text-to-Graph-Notation Transducer.",
                    "ÚFAL at MRP 2020: Permutation-invariant Semantic Parsing in PERIN.",
                    "HIT-SCIR at MRP 2020: Transition-based Parser and Iterative Inference Parser.",
                    "HUJI-KU at MRP 2020: Two Transition-based Neural Parsers.",
                    "JBNU at MRP 2020: AMR Parsing Using a Joint State Model for Graph-Sequence Iterative Inference."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "23rd CoNLL 2019",
        "info": "Hong Kong, China",
        "venues": [
            {
                "sub_name_abbr": "conf/conll/2019",
                "sub_name": "Proceedings of the 23rd Conference on Computational Natural Language Learning, CoNLL 2019, Hong Kong, China, November 3-4, 2019.",
                "count": 97,
                "papers": [
                    "Analysing Neural Language Models: Contextual Decomposition Reveals Default Reasoning in Number and Gender Assignment.",
                    "Deconstructing Supertagging into Multi-Task Sequence Prediction.",
                    "Multilingual Model Using Cross-Task Embedding Projection.",
                    "Investigating Cross-Lingual Alignment Methods for Contextualized Embeddings with Token-Level Evaluation.",
                    "Large-Scale, Diverse, Paraphrastic Bitexts via Sampling and Clustering.",
                    "Large-Scale Representation Learning from Visually Grounded Untranscribed Speech.",
                    "Using Priming to Uncover the Organization of Syntactic Representations in Neural Language Models.",
                    "Say Anything: Automatic Semantic Infelicity Detection in L2 English Indefinite Pronouns.",
                    "Compositional Generalization in Image Captioning.",
                    "Representing Movie Characters in Dialogues.",
                    "Cross-Lingual Word Embeddings and the Structure of the Human Bilingual Lexicon.",
                    "Federated Learning of N-Gram Language Models.",
                    "Learning Conceptual Spaces with Disentangled Facets.",
                    "Weird Inflects but OK: Making Sense of Morphological Generation Errors.",
                    "Learning to Represent Bilingual Dictionaries.",
                    "Improving Natural Language Understanding by Reverse Mapping Bytepair Encoding.",
                    "Made for Each Other: Broad-Coverage Semantic Structures Meet Preposition Supersenses.",
                    "Generating Timelines by Modeling Semantic Change.",
                    "Diversify Your Datasets: Analyzing Generalization via Controlled Variance in Adversarial Datasets.",
                    "Fully Unsupervised Crosslingual Semantic Textual Similarity Metric Based on BERT for Identifying Parallel Data.",
                    "On the Importance of Subword Information for Morphological Tasks in Truly Low-Resource Languages.",
                    "Comparing Top-Down and Bottom-Up Neural Generative Dependency Models.",
                    "Representation Learning and Dynamic Programming for Arc-Hybrid Parsing.",
                    "Policy Preference Detection in Parliamentary Debate Motions.",
                    "Improving Neural Machine Translation by Achieving Knowledge Transfer with Sentence Alignment Learning.",
                    "Code-Switched Language Models Using Neural Based Synthetic Data from Parallel Sentences.",
                    "Unsupervised Neural Machine Translation with Future Rewarding.",
                    "Automatically Extracting Challenge Sets for Non-Local Phenomena in Neural Machine Translation.",
                    "Low-Resource Parsing with Crosslingual Contextualized Representations.",
                    "Improving Pre-Trained Multilingual Model with Vocabulary Expansion.",
                    "On the Relation between Position Information and Sentence Length in Neural Machine Translation.",
                    "Word Recognition, Competition, and Activation in a Model of Visually Grounded Speech.",
                    "EQUATE: A Benchmark Evaluation Framework for Quantitative Reasoning in Natural Language Inference.",
                    "Linguistic Analysis Improves Neural Metaphor Detection.",
                    "Cross-Lingual Dependency Parsing with Unlabeled Auxiliary Languages.",
                    "A Dual-Attention Hierarchical Recurrent Neural Network for Dialogue Act Classification.",
                    "Mimic and Rephrase: Reflective Listening in Open-Ended Dialogue.",
                    "Automated Pyramid Summarization Evaluation.",
                    "A Case Study on Combining ASR and Visual Features for Generating Instructional Video Captions.",
                    "Leveraging Past References for Robust Language Grounding.",
                    "Procedural Reasoning Networks for Understanding Multimodal Procedures.",
                    "On the Limits of Learning to Actively Learn Semantic Representations.",
                    "How Does Grammatical Gender Affect Noun Representations in Gender-Marking Languages?",
                    "Active Learning via Membership Query Synthesis for Semi-Supervised Sentence Classification.",
                    "A General-Purpose Algorithm for Constrained Sequential Inference.",
                    "A Richly Annotated Corpus for Different Tasks in Automated Fact-Checking.",
                    "Detecting Frames in News Headlines and Its Application to Analyzing News Framing Trends Surrounding U.S. Gun Violence.",
                    "Learning a Unified Named Entity Tagger from Multiple Partially Annotated Corpora for Efficient Adaptation.",
                    "Learning Dense Representations for Entity Retrieval.",
                    "CogniVal: A Framework for Cognitive Word Embedding Evaluation.",
                    "KnowSemLM: A Knowledge Infused Semantic Language Model.",
                    "Neural Attentive Bag-of-Entities Model for Text Classification.",
                    "Roll Call Vote Prediction with Knowledge Augmented Models.",
                    "BeamSeg: A Joint Model for Multi-Document Segmentation and Topic Identification.",
                    "MrMep: Joint Extraction of Multiple Relations and Multiple Entity Pairs Based on Triplet Attention.",
                    "Effective Attention Modeling for Neural Relation Extraction.",
                    "Exploiting the Entity Type Sequence to Benefit Event Detection.",
                    "Named Entity Recognition - Is There a Glass Ceiling?",
                    "Low-Rank Approximations of Second-Order Document Representations.",
                    "Named Entity Recognition with Partially Annotated Training Data.",
                    "Contextualized Cross-Lingual Event Trigger Extraction with Minimal Resources.",
                    "Deep Structured Neural Network for Event Temporal Relation Extraction.",
                    "Investigating Entity Knowledge in BERT with Simple Neural End-To-End Entity Linking.",
                    "Unsupervised Adversarial Domain Adaptation for Implicit Discourse Relation Classification.",
                    "Evidence Sentence Extraction for Machine Reading Comprehension.",
                    "SimVecs: Similarity-Based Vectors for Utterance Representation in Conversational AI Systems.",
                    "Incorporating Interlocutor-Aware Context into Response Generation on Multi-Party Chatbots.",
                    "Memory Graph Networks for Explainable Memory-grounded Question Answering.",
                    "TripleNet: Triple Attention Network for Multi-Turn Response Selection in Retrieval-Based Chatbots.",
                    "Relation Module for Non-Answerable Predictions on Reading Comprehension.",
                    "Slot Tagging for Task Oriented Spoken Language Understanding in Human-to-Human Conversation Scenarios.",
                    "Window-Based Neural Tagging for Shallow Discourse Argument Labeling.",
                    "TILM: Neural Language Models with Evolving Topical Influence.",
                    "Pretraining-Based Natural Language Generation for Text Summarization.",
                    "Goal-Embedded Dual Hierarchical Model for Task-Oriented Dialogue Generation.",
                    "Putting the Horse before the Cart: A Generator-Evaluator Framework for Question Generation from Text.",
                    "In Conclusion Not Repetition: Comprehensive Abstractive Summarization with Diversified Attention Based on Determinantal Point Processes.",
                    "Generating Formality-Tuned Summaries Using Input-Dependent Rewards.",
                    "Do Massively Pretrained Language Models Make Better Storytellers?",
                    "Self-Adaptive Scaling for Learnable Residual Structure.",
                    "BIOfid Dataset: Publishing a German Gold Standard for Named Entity Recognition in Historical Biodiversity Literature.",
                    "Slang Detection and Identification.",
                    "Alleviating Sequence Information Loss with Data Overlapping and Prime Batch Sizes.",
                    "Global Autoregressive Models for Data-Efficient Sequence Learning.",
                    "Learning Analogy-Preserving Sentence Embeddings for Answer Selection.",
                    "A Simple and Effective Method for Injecting Word-Level Information into Character-Aware Neural Language Models.",
                    "On Model Stability as a Function of Random Seed.",
                    "Studying Generalisability across Abusive Language Detection Datasets.",
                    "Reduce & Attribute: Two-Step Authorship Attribution for Large-Scale Problems.",
                    "Variational Semi-Supervised Aspect-Term Sentiment Analysis via Transformer.",
                    "Learning to Detect Opinion Snippet for Aspect-Based Sentiment Analysis.",
                    "Multi-Level Sentiment Analysis of PolEmo 2.0: Extended Corpus of Multi-Domain Consumer Reviews.",
                    "A Personalized Sentiment Model with Textual and Contextual Information.",
                    "Cluster-Gated Convolutional Neural Network for Short Text Classification.",
                    "Coherence-based Modeling of Clinical Concepts Inferred from Heterogeneous Clinical Notes for ICU Patient Risk Stratification.",
                    "Predicting the Role of Political Trolls in Social Media.",
                    "Towards a Unified End-to-End Approach for Fully Unsupervised Cross-Lingual Sentiment Analysis."
                ]
            },
            {
                "sub_name_abbr": "conf/conll/2019st",
                "sub_name": "Proceedings of the Shared Task on Cross-Framework Meaning Representation Parsing at the 2019 Conference on Natural Language Learning, CoNLL 2019, Hong Kong, Novemer 3, 2019.",
                "count": 16,
                "papers": [
                    "MRP 2019: Cross-Framework Meaning Representation Parsing.",
                    "TUPA at MRP 2019: A Multi-Task Baseline System.",
                    "The ERG at MRP 2019: Radically Compositional Semantic Dependencies.",
                    "SJTU-NICT at MRP 2019: Multi-Task Learning for End-to-End Uniform Semantic Graph Parsing.",
                    "ShanghaiTech at MRP 2019: Sequence-to-Graph Transduction with Second-Order Edge Inference for Cross-Framework Meaning Representation Parsing.",
                    "Saarland at MRP 2019: Compositional parsing across all graphbanks.",
                    "HIT-SCIR at MRP 2019: A Unified Pipeline for Meaning Representation Parsing via Efficient Training and Effective Encoding.",
                    "SJTU at MRP 2019: A Transition-Based Multi-Task Parser for Cross-Framework Meaning Representation Parsing.",
                    "JBNU at MRP 2019: Multi-level Biaffine Attention for Semantic Dependency Parsing.",
                    "CUHK at MRP 2019: Transition-Based Parser with Cross-Framework Variable-Arity Resolve Action.",
                    "Hitachi at MRP 2019: Unified Encoder-to-Biaffine Network for Cross-Framework Meaning Representation Parsing.",
                    "ÚFAL MRPipe at MRP 2019: UDPipe Goes Semantic in the Meaning Representation Parsing Shared Task.",
                    "Amazon at MRP 2019: Parsing Meaning Representations with Lexical and Phrasal Anchoring.",
                    "SUDA-Alibaba at MRP 2019: Graph-Based Models with BERT.",
                    "ÚFAL-Oslo at MRP 2019: Garage Sale Semantic Parsing.",
                    "Peking at MRP 2019: Factorization- and Composition-Based Parsing for Elementary Dependency Structures."
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "22nd CoNLL 2018",
        "info": "Brussels, Belgium",
        "venues": [
            {
                "sub_name_abbr": "conf/conll/2018",
                "sub_name": "Proceedings of the 22nd Conference on Computational Natural Language Learning, CoNLL 2018, Brussels, Belgium, October 31 - November 1, 2018.",
                "count": 56,
                "papers": [
                    "Embedded-State Latent Conditional Random Fields for Sequence Labeling.",
                    "Continuous Word Embedding Fusion via Spectral Decomposition.",
                    "Dual Latent Variable Model for Low-Resource Natural Language Generation in Dialogue Systems.",
                    "A Trio Neural Model for Dynamic Entity Relatedness Ranking.",
                    "A Unified Neural Network Model for Geolocating Twitter Users.",
                    "Corpus-Driven Thematic Hierarchy Induction.",
                    "Adversarially Regularising Neural NLI Models to Integrate Logical Background Knowledge.",
                    "From Strings to Other Things: Linking the Neighborhood and Transposition Effects in Word Reading.",
                    "Global Attention for Name Tagging.",
                    "Pervasive Attention: 2D Convolutional Neural Networks for Sequence-to-Sequence Prediction.",
                    "Comparing Attention-Based Convolutional and Recurrent Neural Networks: Success and Limitations in Machine Reading Comprehension.",
                    "Uncovering Code-Mixed Challenges: A Framework for Linguistically Driven Question Generation and Neural Based Question Answering.",
                    "Learning to Embed Semantic Correspondence for Natural Language Understanding.",
                    "Commonsense Knowledge Base Completion and Generation.",
                    "Active Learning for Interactive Neural Machine Translation of Data Streams.",
                    "Churn Intent Detection in Multilingual Chatbot Conversations and Social Media.",
                    "Learning Text Representations for 500K Classification Tasks on Named Entity Disambiguation.",
                    "Hierarchical Attention Based Position-Aware Network for Aspect-Level Sentiment Analysis.",
                    "Bidirectional Generative Adversarial Networks for Neural Machine Translation.",
                    "Latent Entities Extraction: How to Extract Entities that Do Not Appear in the Text?",
                    "Generalizing Procrustes Analysis for Better Bilingual Dictionary Induction.",
                    "Simple Unsupervised Keyphrase Extraction using Sentence Embeddings.",
                    "A Temporally Sensitive Submodularity Framework for Timeline Summarization.",
                    "Chinese Poetry Generation with a Salient-Clue Mechanism.",
                    "Multi-Modal Sequence Fusion via Recursive Attention for Emotion Recognition.",
                    "Using Sparse Semantic Embeddings Learned from Multimodal Text and Image Data to Model Human Conceptual Knowledge.",
                    "Similarity Dependent Chinese Restaurant Process for Cognate Identification in Multilingual Wordlists.",
                    "Uncovering Divergent Linguistic Information in Word Embeddings with Lessons for Intrinsic and Extrinsic Evaluation.",
                    "Comparing Models of Associative Meaning: An Empirical Investigation of Reference in Simple Language Games.",
                    "Sequence Classification with Human Attention.",
                    "Sentence-Level Fluency Evaluation: References Help, But Can Be Spared!",
                    "Predefined Sparseness in Recurrent Sequence Models.",
                    "Learning to Actively Learn Neural Machine Translation.",
                    "Upcycle Your OCR: Reusing OCRs for Post-OCR Text Correction in Romanised Sanskrit.",
                    "Weakly-Supervised Neural Semantic Parsing with a Generative Ranker.",
                    "Modeling Composite Labels for Neural Morphological Tagging.",
                    "Evolutionary Data Measures: Understanding the Difficulty of Text Classification Tasks.",
                    "Vectorial Semantic Spaces Do Not Encode Human Judgments of Intervention Similarity.",
                    "Lessons Learned in Multilingual Grounded Language Learning.",
                    "Unsupervised Sentence Compression using Denoising Auto-Encoders.",
                    "Resources to Examine the Quality of Word Embedding Models Trained on n-Gram Data.",
                    "Linguistically-Based Deep Unstructured Question Answering.",
                    "DIMSIM: An Accurate Chinese Phonetic Similarity Algorithm Based on Learned High Dimensional Encoding.",
                    "Challenge or Empower: Revisiting Argumentation Quality in a News Editorial Corpus.",
                    "Bringing Order to Neural Word Embeddings with Embeddings Augmented by Random Permutations (EARP).",
                    "Aggregated Semantic Matching for Short Text Entity Linking.",
                    "Adversarial Over-Sensitivity and Over-Stability Strategies for Dialogue Models.",
                    "Improving Response Selection in Multi-Turn Dialogue Systems by Incorporating Domain Knowledge.",
                    "The Lifted Matrix-Space Model for Semantic Composition.",
                    "End-to-End Neural Entity Linking.",
                    "Modelling Salient Features as Directions in Fine-Tuned Semantic Spaces.",
                    "Model Transfer with Explicit Knowledge of the Relation between Class Definitions.",
                    "Aiming to Know You Better Perhaps Makes Me a More Engaging Dialogue Partner.",
                    "Neural Maximum Subgraph Parsing for Cross-Domain Semantic Dependency Analysis.",
                    "From Random to Supervised: A Novel Dropout Mechanism Integrated with Global Information.",
                    "Sequence to Sequence Mixture Model for Diverse Machine Translation."
                ]
            },
            {
                "sub_name_abbr": "conf/conll/2018st",
                "sub_name": "Proceedings of the CoNLL 2018 Shared Task: Multilingual Parsing from Raw Text to Universal Dependencies, Brussels, Belgium, October 31 - November 1, 2018.",
                "count": 26,
                "papers": [
                    "CoNLL 2018 Shared Task: Multilingual Parsing from Raw Text to Universal Dependencies.",
                    "The 2018 Shared Task on Extrinsic Parser Evaluation: On the Downstream Utility of English Universal Dependency Parsers.",
                    "CEA LIST: Processing Low-Resource Languages for CoNLL 2018.",
                    "Semi-Supervised Neural System for Tagging, Parsing and Lematization.",
                    "Towards Better UD Parsing: Deep Contextualized Word Embeddings, Ensemble, and Treebank Concatenation.",
                    "Joint Learning of POS and Dependencies for Multilingual Universal Dependency Parsing.",
                    "Multilingual Universal Dependency Parsing from Raw Text with Low-Resource Language Enhancement.",
                    "An Improved Neural Network Model for Joint POS Tagging and Dependency Parsing.",
                    "IBM Research at the CoNLL 2018 Shared Task on Multilingual Parsing.",
                    "Universal Dependency Parsing with a General Transition-Based DAG Parser.",
                    "82 Treebanks, 34 Models: Universal Dependency Parsing with Multi-Treebank Models.",
                    "Tree-Stack LSTM in Transition Based Dependency Parsing.",
                    "Turku Neural Parser Pipeline: An End-to-End System for the CoNLL 2018 Shared Task.",
                    "SEx BiST: A Multi-Source Trainable Parser with Deep Contextualized Lexical Representations.",
                    "The SLT-Interactions Parsing System at the CoNLL 2018 Shared Task.",
                    "Universal Dependency Parsing from Scratch.",
                    "NLP-Cube: End-to-End Raw Text Processing With Neural Networks.",
                    "Towards JointUD: Part-of-speech Tagging and Lemmatization using Recurrent Neural Networks.",
                    "CUNI x-ling: Parsing Under-Resourced Languages in CoNLL 2018 UD Shared Task.",
                    "UDPipe 2.0 Prototype at CoNLL 2018 UD Shared Task.",
                    "Universal Morpho-Syntactic Parsing and the Contribution of Lexica: Analyzing the ONLP Lab Submission to the CoNLL 2018 Shared Task.",
                    "SParse: Koç University Graph-Based Parsing System for the CoNLL 2018 Shared Task.",
                    "ELMoLex: Connecting ELMo and Lexicon Features for Dependency Parsing.",
                    "A Morphology-Based Representation Model for LSTM-Based Dependency Parsing of Agglutinative Languages.",
                    "AntNLP at CoNLL 2018 Shared Task: A Graph-Based Parser for Universal Dependency Parsing.",
                    "A Simple yet Effective Joint Training Method for Cross-Lingual Universal Dependency Parsing."
                ]
            },
            {
                "sub_name_abbr": "conf/conll/2018st1",
                "sub_name": "Proceedings of the CoNLL SIGMORPHON 2018 Shared Task: Universal Morphological Reinflection, Brussels, October 31 - November 1, 2018.",
                "count": 16,
                "papers": [
                    "The CoNLL-SIGMORPHON 2018 Shared Task: Universal Morphological Reinflection.",
                    "KU-CST at CoNLL-SIGMORPHON 2018 Shared Task: a Tridirectional Model.",
                    "IPS-WASEDA system at CoNLL-SIGMORPHON 2018 Shared Task on morphological inflection.",
                    "AX Semantics' Submission to the CoNLL-SIGMORPHON 2018 Shared Task.",
                    "Experiments on Morphological Reinflection: CoNLL-2018 Shared Task.",
                    "The NYU System for the CoNLL-SIGMORPHON 2018 Shared Task on Universal Morphological Reinflection.",
                    "Attention-free encoder decoder for morphological processing.",
                    "UZH at CoNLL-SIGMORPHON 2018 Shared Task on Universal Morphological Reinflection.",
                    "Finding the way from ä to a: Sub-character morphological inflection for the SIGMORPHON 2018 shared task.",
                    "Morphological Reinflection in Context: CU Boulder's Submission to CoNLL-SIGMORPHON 2018 Shared Task.",
                    "Copenhagen at CoNLL-SIGMORPHON 2018: Multilingual Inflection in Context with Explicit Morphosyntactic Decoding.",
                    "What can we gain from language models for morphological inflection?",
                    "IIT(BHU)-IIITH at CoNLL-SIGMORPHON 2018 Shared Task on Universal Morphological Reinflection.",
                    "Tübingen-Oslo system at SIGMORPHON shared task on morphological inflection. A multi-tasking multilingual sequence to sequence model.",
                    "Combining Neural and Non-Neural Methods for Low-Resource Morphological Reinflection.",
                    "BME-HAS System for CoNLL-SIGMORPHON 2018 Shared Task: Universal Morphological Reinflection."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "21st CoNLL 2017",
        "info": "Vancouver, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/conll/2017",
                "sub_name": "Proceedings of the 21st Conference on Computational Natural Language Learning (CoNLL 2017), Vancouver, Canada, August 3-4, 2017.",
                "count": 45,
                "papers": [
                    "Should Neural Network Architecture Reflect Linguistic Structure?",
                    "Rational Distortions of Learners' Linguistic Input.",
                    "Exploring the Syntactic Abilities of RNNs with Multi-task Learning.",
                    "The Effect of Different Writing Tasks on Linguistic Style: A Case Study of the ROC Story Cloze Task.",
                    "Parsing for Grammatical Relations via Graph Merging.",
                    "Leveraging Eventive Information for Better Metaphor Detection and Classification.",
                    "Collaborative Partitioning for Coreference Resolution.",
                    "Named Entity Disambiguation for Noisy Text.",
                    "Tell Me Why: Using Question Answering as Distant Supervision for Answer Justification.",
                    "Learning What is Essential in Questions.",
                    "Top-Rank Enhanced Listwise Optimization for Statistical Machine Translation.",
                    "Embedding Words and Senses Together via Joint Knowledge-Enhanced Training.",
                    "Automatic Selection of Context Configurations for Improved Class-Specific Word Representations.",
                    "Modeling Context Words as Regions: An Ordinal Regression Approach to Word Embedding.",
                    "An Artificial Language Evaluation of Distributional Semantic Models.",
                    "Learning Word Representations with Regularization from Prior Knowledge.",
                    "Attention-based Recurrent Convolutional Neural Network for Automatic Essay Scoring.",
                    "Feature Selection as Causal Inference: Experiments with Text Classification.",
                    "A Joint Model for Semantic Sequences: Frames, Entities, Sentiments.",
                    "Neural Sequence-to-sequence Learning of Internal Word Structure.",
                    "A Supervised Approach to Extractive Summarisation of Scientific Papers.",
                    "An Automatic Approach for Document-level Topic Model Evaluation.",
                    "Robust Coreference Resolution and Entity Linking on Dialogues: Character Identification on TV Show Transcripts.",
                    "Cross-language Learning with Adversarial Neural Networks.",
                    "Knowledge Tracing in Sequential Learning of Inflected Vocabulary.",
                    "A Probabilistic Generative Grammar for Semantic Parsing.",
                    "Learning Contextual Embeddings for Structural Semantic Similarity using Categorical Information.",
                    "Making Neural QA as Simple as Possible but not Simpler.",
                    "Neural Domain Adaptation for Biomedical Question Answering.",
                    "A phoneme clustering algorithm based on the obligatory contour principle.",
                    "Learning Stock Market Sentiment Lexicon and Sentiment-Oriented Word Vector from StockTwits.",
                    "Learning local and global contexts using a convolutional recurrent network model for relation classification in biomedical text.",
                    "Idea density for predicting Alzheimer's disease from transcribed speech.",
                    "Zero-Shot Relation Extraction via Reading Comprehension.",
                    "The Covert Helps Parse the Overt.",
                    "German in Flux: Detecting Metaphoric Change via Word Entropy.",
                    "Encoding of phonology in a recurrent neural model of grounded speech.",
                    "Multilingual Semantic Parsing And Code-Switching.",
                    "Optimizing Differentiable Relaxations of Coreference Evaluation Metrics.",
                    "Neural Structural Correspondence Learning for Domain Adaptation.",
                    "A Simple and Accurate Syntax-Agnostic Neural Model for Dependency-based Semantic Role Labeling.",
                    "Joint Prediction of Morphosyntactic Categories for Fine-Grained Arabic Part-of-Speech Tagging Exploiting Tag Dictionary Information.",
                    "Learning from Relatives: Unified Dialectal Arabic Segmentation.",
                    "Natural Language Generation for Spoken Dialogue System using RNN Encoder-Decoder Networks.",
                    "Graph-based Neural Multi-Document Summarization."
                ]
            },
            {
                "sub_name_abbr": "conf/conll/2017st1",
                "sub_name": "Proceedings of the CoNLL SIGMORPHON 2017 Shared Task: Universal Morphological Reinflection, Vancouver, BC, Canada, August 3-4, 2017.",
                "count": 12,
                "papers": [
                    "CoNLL-SIGMORPHON 2017 Shared Task: Universal Morphological Reinflection in 52 Languages.",
                    "Training Data Augmentation for Low-Resource Morphological Inflection.",
                    "The LMU System for the CoNLL-SIGMORPHON 2017 Shared Task on Universal Morphological Reinflection.",
                    "Align and Copy: UZH at SIGMORPHON 2017 Shared Task for Morphological Reinflection.",
                    "Morphological Inflection Generation with Multi-space Variational Encoder-Decoders.",
                    "ISI at the SIGMORPHON 2017 Shared Task on Morphological Reinflection.",
                    "Experiments on Morphological Reinflection: CoNLL-2017 Shared Task.",
                    "If you can't beat them, join them: the University of Alberta system description.",
                    "Character Sequence-to-Sequence Model with Global Attention for Universal Morphological Reinflection.",
                    "Data Augmentation for Morphological Reinflection.",
                    "Seq2seq for Morphological Reinflection: When Deep Learning Fails.",
                    "SU-RUG at the CoNLL-SIGMORPHON 2017 shared task: Morphological Inflection with Attentional Sequence-to-Sequence Models."
                ]
            },
            {
                "sub_name_abbr": "conf/conll/2017st2",
                "sub_name": "Proceedings of the CoNLL 2017 Shared Task: Multilingual Parsing from Raw Text to Universal Dependencies, Vancouver, Canada, August 3-4, 2017.",
                "count": 29,
                "papers": [
                    "CoNLL 2017 Shared Task: Multilingual Parsing from Raw Text to Universal Dependencies.",
                    "Stanford's Graph-based Neural Dependency Parser at the CoNLL 2017 Shared Task.",
                    "Combining Global Models for Parsing Universal Dependencies.",
                    "IMS at the CoNLL 2017 UD Shared Task: CRFs and Perceptrons Meet Neural Networks.",
                    "The HIT-SCIR System for End-to-End Parsing of Universal Dependencies.",
                    "A System for Multilingual Dependency Parsing based on Bidirectional LSTM Feature Representations.",
                    "Adversarial Training for Cross-Domain Universal Dependency Parsing.",
                    "Parsing with Context Embeddings.",
                    "Tokenizing, POS Tagging, Lemmatizing and Parsing UD 2.0 with UDPipe.",
                    "UParse: the Edinburgh system for the CoNLL 2017 UD shared task.",
                    "Multi-Model and Crosslingual Dependency Analysis.",
                    "TurkuNLP: Delexicalized Pre-training of Word Embeddings for Dependency Parsing.",
                    "The parse is darc and full of errors: Universal dependency parsing with transition-based and graph-based algorithms.",
                    "A Novel Neural Network Model for Joint POS Tagging and Graph-based Dependency Parsing.",
                    "A non-DNN Feature Engineering Approach to Dependency Parsing - FBAML at CoNLL 2017 Shared Task.",
                    "A non-projective greedy dependency parser with bidirectional LSTMs.",
                    "LIMSI$@$CoNLL'17: UD Shared Task.",
                    "RACAI's Natural Language Processing pipeline for Universal Dependencies.",
                    "Delexicalized transfer parsing for low-resource languages using transformed and combined treebanks.",
                    "A Transition-based System for Universal Dependency Parsing.",
                    "Corpus Selection Approaches for Multilingual Parsing from Raw Text to Universal Dependencies.",
                    "From Raw Text to Universal Dependencies - Look, No Tags!",
                    "Initial Explorations of CCG Supertagging for Universal Dependency Parsing.",
                    "CLCL (Geneva) DINN Parser: a Neural Network Dependency Parser Ten Years Later.",
                    "A Fast and Lightweight System for Multilingual Dependency Parsing.",
                    "The ParisNLP entry at the ConLL UD Shared Task 2017: A Tale of a #ParsingTragedy.",
                    "Universal Joint Morph-Syntactic Processing: The Open University of Israel's Submission to The CoNLL 2017 Shared Task.",
                    "A Semi-universal Pipelined Approach to the CoNLL 2017 UD Shared Task.",
                    "A rule-based system for cross-lingual parsing of Romance languages with Universal Dependencies."
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "20th CoNLL 2016",
        "info": "Berlin, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/conll/2016",
                "sub_name": "Proceedings of the 20th SIGNLL Conference on Computational Natural Language Learning, CoNLL 2016, Berlin, Germany, August 11-12, 2016.",
                "count": 31,
                "papers": [
                    "Computational Natural Language Learning: +-20years +-Data +-Features +-Multimodal +-Bioplausible.",
                    "Generating Sentences from a Continuous Space.",
                    "Identifying Temporal Orientation of Word Senses.",
                    "Semi-supervised Clustering for Short Text via Deep Representation Learning.",
                    "Neighborhood Mixture Model for Knowledge Base Completion.",
                    "context2vec: Learning Generic Context Embedding with Bidirectional LSTM.",
                    "Learning to Jointly Predict Ellipsis and Comparison Structures.",
                    "Event Embeddings for Semantic Script Modeling.",
                    "Beyond Centrality and Structural Features: Learning Information Importance for Text Summarization.",
                    "Incremental Prediction of Sentence-final Verbs: Humans versus Machines.",
                    "A Data-driven Investigation of Corrective Feedback on Subject Omission Errors in First Language Acquisition.",
                    "Redefining part-of-speech classes with distributional semantic models.",
                    "Analyzing Learner Understanding of Novel L2 Vocabulary.",
                    "Modeling language evolution with codes that utilize context and phonetic features.",
                    "Harnessing Sequence Labeling for Sarcasm Detection in Dialogue from TV Series 'Friends'.",
                    "Leveraging Cognitive Features for Sentiment Analysis.",
                    "Modelling Context with User Embeddings for Sarcasm Detection in Social Media.",
                    "Learning when to trust distant supervision: An application to low-resource POS tagging using cross-lingual projection.",
                    "Greedy, Joint Syntactic-Semantic Parsing with Stack LSTMs.",
                    "Beyond Prefix-Based Interactive Translation Prediction.",
                    "Exploring Prediction Uncertainty in Machine Translation Quality Estimation.",
                    "Cross-Lingual Named Entity Recognition via Wikification.",
                    "Coreference in Wikipedia: Main Concept Resolution.",
                    "Event Linking with Sentential Features from Convolutional Neural Networks.",
                    "Joint Learning of the Embedding of Words and Entities for Named Entity Disambiguation.",
                    "Entity Disambiguation by Knowledge and Text Jointly Embedding.",
                    "Substring-based unsupervised transliteration with phonetic and contextual knowledge.",
                    "Abstractive Text Summarization using Sequence-to-sequence RNNs and Beyond.",
                    "Compression of Neural Machine Translation Models via Pruning.",
                    "Modelling the Usage of Discourse Connectives as Rational Speech Acts.",
                    "Semi-supervised Convolutional Networks for Translation Adaptation with Tiny Amount of In-domain Data."
                ]
            },
            {
                "sub_name_abbr": "conf/conll/2016st",
                "sub_name": "Proceedings of the 20th SIGNLL Conference on Computational Natural Language Learning: Shared Task, CoNLL 2016, Berlin, Germany, August 7-12, 2016.",
                "count": 22,
                "papers": [
                    "CoNLL 2016 Shared Task on Multilingual Shallow Discourse Parsing.",
                    "OPT: Oslo-Potsdam-Teesside. Pipelining Rules, Rankers, and Classifier Ensembles for Shallow Discourse Parsing.",
                    "An End-to-End Chinese Discourse Parser with Adaptation to Explicit and Non-explicit Relation Recognition.",
                    "Two End-to-end Shallow Discourse Parsers for English and Chinese in CoNLL-2016 Shared Task.",
                    "Do We Really Need All Those Rich Linguistic Features? A Neural Network-Based Approach to Implicit Sense Labeling.",
                    "Discourse Sense Classification from Scratch using Focused RNNs.",
                    "Robust Non-Explicit Neural Discourse Parser in English and Chinese.",
                    "A Constituent Syntactic Parse Tree Based Discourse Parser.",
                    "SoNLP-DP System for ConLL-2016 English Shallow Discourse Parsing.",
                    "Shallow Discourse Parsing Using Convolutional Neural Network.",
                    "SoNLP-DP System for ConLL-2016 Chinese Shallow Discourse Parsing.",
                    "UniTN End-to-End Discourse Parser for CoNLL 2016 Shared Task.",
                    "The CLaC Discourse Parser at CoNLL-2016.",
                    "Discourse Relation Sense Classification Using Cross-argument Semantic Similarity Based on Word Embeddings.",
                    "IIT (BHU) Submission on the CoNLL-2016 Shared Task: Shallow Discourse Parsing using Semantic Lexicons.",
                    "The Virginia Tech System at CoNLL-2016 Shared Task on Shallow Discourse Parsing.",
                    "DA-IICT Submission for PDTB-styled Discourse Parser.",
                    "Discourse Relation Sense Classification with Two-Step Classifiers.",
                    "Adapting Event Embedding for Implicit Discourse Relation Recognition.",
                    "SDP-JAIST: A Shallow Discourse Parsing system $@$ CoNLL 2016 Shared Task.",
                    "Finding Arguments as Sequence Labeling in Discourse Parsing.",
                    "Discourse Relation Sense Classification Systems for CoNLL-2016 Shared Task."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "19th CoNLL 2015",
        "info": "Beijing, China",
        "venues": [
            {
                "sub_name_abbr": "conf/conll/2015",
                "sub_name": "Proceedings of the 19th Conference on Computational Natural Language Learning, CoNLL 2015, Beijing, China, July 30-31, 2015.",
                "count": 38,
                "papers": [
                    "A Coactive Learning View of Online Structured Prediction in Statistical Machine Translation.",
                    "A Joint Framework for Coreference Resolution and Mention Head Detection.",
                    "A Supertag-Context Model for Weakly-Supervised CCG Parser Learning.",
                    "A Synchronous Hyperedge Replacement Grammar based approach for AMR parsing.",
                    "AIDA2: A Hybrid Approach for Token and Sentence Level Dialect Identification in Arabic.",
                    "An Iterative Similarity based Adaptation Technique for Cross-domain Text Classification.",
                    "Analyzing Optimization for Statistical Machine Translation: MERT Learns Verbosity, PRO Learns Length.",
                    "Annotation Projection-based Representation Learning for Cross-lingual Dependency Parsing.",
                    "Big Data Small Data, In Domain Out-of Domain, Known Word Unknown Word: The Impact of Word Representations on Sequence Labelling Tasks.",
                    "Contrastive Analysis with Predictive Power: Typology Driven Estimation of Grammatical Error Distributions in ESL.",
                    "Cross-lingual syntactic variation over age and gender.",
                    "Cross-lingual Transfer for Unsupervised Dependency Parsing Without Parallel Data.",
                    "Detecting Semantically Equivalent Questions in Online User Forums.",
                    "Entity Linking Korean Text: An Unsupervised Learning Approach using Semantic Relations.",
                    "Incremental Recurrent Neural Network Dependency Parser with Search-based Discriminative Training.",
                    "Instance Selection Improves Cross-Lingual Model Training for Fine-Grained Sentiment Analysis.",
                    "Labeled Morphological Segmentation with Semi-Markov Models.",
                    "Learning to Exploit Structured Resources for Lexical Inference.",
                    "Linking Entities Across Images and Text.",
                    "Making the Most of Crowdsourced Document Annotations: Confused Supervised LDA.",
                    "Multichannel Variable-Size Convolution for Sentence Classification.",
                    "Opinion Holder and Target Extraction based on the Induction of Verbal Categories.",
                    "Quantity, Contrast, and Convention in Cross-Situated Language Comprehension.",
                    "Recovering Traceability Links in Requirements Documents.",
                    "Structural and lexical factors in adjective placement in complex noun phrases across Romance languages.",
                    "Symmetric Pattern Based Word Embeddings for Improved Word Similarity Prediction.",
                    "Task-Oriented Learning of Word Embeddings for Semantic Relation Classification.",
                    "Temporal Information Extraction from Korean Texts.",
                    "Transition-based Spinal Parsing.",
                    "Accurate Cross-lingual Projection between Count-based Word Vectors by Exploiting Translatable Context Pairs.",
                    "Deep Neural Language Models for Machine Translation.",
                    "Finding Opinion Manipulation Trolls in News Community Forums.",
                    "Do dependency parsing metrics correlate with human judgments?",
                    "Feature Selection for Short Text Classification using Wavelet Packet Transform.",
                    "Learning Adjective Meanings with a Tensor-Based Skip-Gram Model.",
                    "Model Selection for Type-Supervised Learning with Application to POS Tagging.",
                    "One Million Sense-Tagged Instances for Word Sense Disambiguation and Induction.",
                    "Reading behavior predicts syntactic categories."
                ]
            },
            {
                "sub_name_abbr": "conf/conll/2015st",
                "sub_name": "Proceedings of the 19th Conference on Computational Natural Language Learning: Shared Task, CoNLL 2015, Beijing, China, July 30-31, 2015.",
                "count": 15,
                "papers": [
                    "The CoNLL-2015 Shared Task on Shallow Discourse Parsing.",
                    "A Refined End-to-End Discourse Parser.",
                    "The UniTN Discourse Parser in CoNLL 2015 Shared Task: Token-level Sequence Labeling with Argument-specific Models.",
                    "The SoNLP-DP System in the CoNLL-2015 shared Task.",
                    "Shallow Discourse Parsing Using Constituent Parsing Tree.",
                    "A Minimalist Approach to Shallow Discourse Parsing and Implicit Relation Recognition.",
                    "A Hybrid Discourse Relation Parser in CoNLL 2015.",
                    "The CLaC Discourse Parser at CoNLL-2015.",
                    "Shallow Discourse Parsing with Syntactic and (a Few) Semantic Features.",
                    "JAIST: A two-phase machine learning approach for identifying discourse relations in newswire texts.",
                    "The DCU Discourse Parser: A Sense Classification Task.",
                    "Improving a Pipeline Architecture for Shallow Discourse Parsing.",
                    "A Shallow Discourse Parsing System Based On Maximum Entropy Model.",
                    "The DCU Discourse Parser for Connective, Argument Identification and Explicit Sense Classification.",
                    "Hybrid Approach to PDTB-styled Discourse Parsing for CoNLL-2015."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "18th CoNLL 2014",
        "info": "Baltimore, Maryland, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/conll/2014",
                "sub_name": "Proceedings of the Eighteenth Conference on Computational Natural Language Learning, CoNLL 2014, Baltimore, Maryland, USA, June 26-27, 2014.",
                "count": 20,
                "papers": [
                    "What's in a p-value in NLP?",
                    "Domain-Specific Image Captioning.",
                    "Reconstructing Native Language Typology from Foreign Language Usage.",
                    "Automatic Transliteration of Romanized Dialectal Arabic.",
                    "Learning to Rank Answer Candidates for Automatic Resolution of Crossword Puzzles.",
                    "Inducing Neural Models of Script Knowledge.",
                    "Grounding Language with Points and Paths in Continuous Spaces.",
                    "Looking for Hyponyms in Vector Space.",
                    "Lexicon Infused Phrase Embeddings for Named Entity Resolution.",
                    "Focused Entailment Graphs for Open IE Propositions.",
                    "Improved Pattern Learning for Bootstrapped Entity Extraction.",
                    "Towards Temporal Scoping of Relational Facts based on Wikipedia Data.",
                    "Distributed Word Representation Learning for Cross-Lingual Dependency Parsing.",
                    "Treebank Translation for Cross-Lingual Parser Induction.",
                    "Weakly-Supervised Bayesian Learning of a CCG Supertagger.",
                    "Factored Markov Translation with Robust Modeling.",
                    "Hallucinating Phrase Translations for Low Resource MT.",
                    "Linguistic Regularities in Sparse and Explicit Word Representations.",
                    "Probabilistic Modeling of Joint-context in Distributional Similarity.",
                    "A Rudimentary Lexicon and Semantics Help Bootstrap Phoneme Acquisition."
                ]
            },
            {
                "sub_name_abbr": "conf/conll/2014st",
                "sub_name": "Proceedings of the Eighteenth Conference on Computational Natural Language Learning: Shared Task, CoNLL 2014, Baltimore, Maryland, USA, June 26-27, 2014.",
                "count": 13,
                "papers": [
                    "The CoNLL-2014 Shared Task on Grammatical Error Correction.",
                    "Grammatical error correction using hybrid systems and type filtering.",
                    "The AMU System in the CoNLL-2014 Shared Task: Grammatical Error Correction by Data-Intensive and Feature-Rich Statistical Machine Translation.",
                    "The Illinois-Columbia System in the CoNLL-2014 Shared Task.",
                    "RACAI GEC - A hybrid approach to Grammatical Error Correction.",
                    "Grammatical Error Detection Using Tagger Disagreement.",
                    "CoNLL 2014 Shared Task: Grammatical Error Correction with a Syntactic N-gram Language Model from a Big Corpora.",
                    "Tuning a Grammar Correction System for Increased Precision.",
                    "POSTECH Grammatical Error Correction System in the CoNLL-2014 Shared Task.",
                    "Grammatical Error Detection and Correction using a Single Maximum Entropy Model.",
                    "Factored Statistical Machine Translation for Grammatical Error Correction.",
                    "NTHU at the CoNLL-2014 Shared Task.",
                    "A Unified Framework for Grammar Error Correction."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "17th CoNLL 2013",
        "info": "Sofia, Bulgaria",
        "venues": [
            {
                "sub_name_abbr": "conf/conll/2013",
                "sub_name": "Proceedings of the Seventeenth Conference on Computational Natural Language Learning, CoNLL 2013, Sofia, Bulgaria, August 8-9, 2013.",
                "count": 25,
                "papers": [
                    "Online Active Learning for Cost Sensitive Domain Adaptation.",
                    "Analysis of Stopping Active Learning based on Stabilizing Predictions.",
                    "Improving Pointwise Mutual Information (PMI) by Incorporating Significant Co-occurrence.",
                    "Supervised Morphological Segmentation in a Low-Resource Learning Setting using Conditional Random Fields.",
                    "Graph-Based Posterior Regularization for Semi-Supervised Structured Prediction.",
                    "A Boosted Semi-Markov Perceptron.",
                    "Spectral Learning of Refinement HMMs.",
                    "Sentence Compression with Joint Structural Inference.",
                    "Learning Adaptable Patterns for Passage Reranking.",
                    "Documents and Dependencies: an Exploration of Vector Space Models for Semantic Composition.",
                    "Hidden Markov tree models for semantic class induction.",
                    "Better Word Representations with Recursive Neural Networks for Morphology.",
                    "Separating Disambiguation from Composition in Distributional Semantics.",
                    "Frame Semantics for Stance Classification.",
                    "Philosophers are Mortal: Inferring the Truth of Unseen Facts.",
                    "Towards Robust Linguistic Analysis using OntoNotes.",
                    "Dynamic Knowledge-Base Alignment for Coreference Resolution.",
                    "A Non-Monotonic Arc-Eager Transition System for Dependency Parsing.",
                    "Collapsed Variational Bayesian Inference for PCFGs.",
                    "Polyglot: Distributed Word Representations for Multilingual NLP.",
                    "Exploiting multiple hypotheses for Multilingual Spoken Language Understanding.",
                    "Multilingual WSD-like Constraints for Paraphrase Extraction.",
                    "Topic Models + Word Alignment = A Flexible Framework for Extracting Bilingual Dictionary from Comparable Corpus.",
                    "Terminology Extraction Approaches for Product Aspect Detection in Customer Reviews.",
                    "Acquisition of Desires before Beliefs: A Computional Investigation."
                ]
            },
            {
                "sub_name_abbr": "conf/conll/2013st",
                "sub_name": "Proceedings of the Seventeenth Conference on Computational Natural Language Learning: Shared Task, CoNLL 2013, Sofia, Bulgaria, August 8-9, 2013.",
                "count": 17,
                "papers": [
                    "The CoNLL-2013 Shared Task on Grammatical Error Correction.",
                    "The University of Illinois System in the CoNLL-2013 Shared Task.",
                    "CoNLL-2013 Shared Task: Grammatical Error Correction NTHU System Description.",
                    "NAIST at 2013 CoNLL Grammatical Error Correction Shared Task.",
                    "UM-Checker: A Hybrid System for English Grammatical Error Correction.",
                    "A Tree Transducer Model for Grammatical Error Correction.",
                    "Constrained Grammatical Error Correction using Statistical Machine Translation.",
                    "LFG-based Features for Noun Number and Article Grammatical Errors.",
                    "Toward More Precision in Correction of Grammatical Errors.",
                    "Grammatical Error Correction as Multiclass Classification with Single Model.",
                    "IITB System for CoNLL 2013 Shared Task: A Hybrid Approach to Grammatical Error Correction.",
                    "UdS at CoNLL 2013 Shared Task.",
                    "Rule-based System for Automatic Grammar Correction Using Syntactic N-grams for English Language Learning (L2).",
                    "Memory-based Grammatical Error Correction.",
                    "A Noisy Channel Model Framework for Grammatical Correction.",
                    "A Hybrid Model For Grammatical Error Correction.",
                    "KUNLP Grammatical Error Correction System For CoNLL-2013 Shared Task."
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "EMNLP-CoNLL 2012",
        "info": "Jeju Island, Korea",
        "venues": [
            {
                "sub_name_abbr": "conf/emnlp/2012",
                "sub_name": "Proceedings of the 2012 Joint Conference on Empirical Methods in Natural Language Processing and Computational Natural Language Learning, EMNLP-CoNLL 2012, July 12-14, 2012, Jeju Island, Korea.",
                "count": 139,
                "papers": [
                    "Syntactic Transfer Using a Bilingual Lexicon.",
                    "Regularized Interlingual Projections: Evaluation on Multilingual Transliteration.",
                    "Bilingual Lexicon Extraction from Comparable Corpora Using Label Propagation.",
                    "Lexical Differences in Autobiographical Narratives from Schizophrenic Patients and Healthy Controls.",
                    "Streaming Analysis of Discourse Participants.",
                    "Detecting Subgroups in Online Discussions by Modeling Positive and Negative Relations among Participants.",
                    "Generative Goal-Driven User Simulation for Dialog Management.",
                    "Optimising Incremental Dialogue Decisions Using Information Density for Interactive Systems.",
                    "Mixed Membership Markov Models for Unsupervised Conversation Modeling.",
                    "An Entity-Topic Model for Entity Linking.",
                    "Linking Named Entities to Any Database.",
                    "Towards Efficient Named-Entity Rule Induction for Customizability.",
                    "Active Learning for Imbalanced Sentiment Classification.",
                    "A Weakly Supervised Model for Sentence-Level Semantic Orientation Analysis with Multiple Experts.",
                    "Collocation Polarity Disambiguation Using Web-based Pseudo Contexts.",
                    "Aligning Predicates across Monolingual Comparable Texts using Graph-based Clustering.",
                    "Local and Global Context for Supervised and Unsupervised Metonymy Resolution.",
                    "Learning Verb Inference Rules from Linguistically-Motivated Evidence.",
                    "Spectral Dependency Parsing with Latent Variables.",
                    "A Phrase-Discovering Topic Model Using Hierarchical Pitman-Yor Processes.",
                    "A Bayesian Model for Learning SCFGs with Discontiguous Rules.",
                    "Multiple Aspect Summarization Using Integer Linear Programming.",
                    "Minimal Dependency Length in Realization Ranking.",
                    "Framework of Automatic Text Summarization Using Reinforcement Learning.",
                    "Large Scale Decipherment for Out-of-Domain Machine Translation.",
                    "N-gram-based Tense Models for Statistical Machine Translation.",
                    "Source Language Adaptation for Resource-Poor Machine Translation.",
                    "Exploiting Reducibility in Unsupervised Dependency Parsing.",
                    "Improving Transition-Based Dependency Parsing with Buffer Transitions.",
                    "Generalized Higher-Order Dependency Parsing with Cube Pruning.",
                    "Universal Grapheme-to-Phoneme Prediction Over Latin Alphabets.",
                    "Name Phylogeny: A Generative Model of String Variation.",
                    "Syntactic Surprisal Affects Spoken Word Duration in Conversational Contexts.",
                    "Why Question Answering using Sentiment Analysis and Word Classes.",
                    "Natural Language Questions for the Web of Data.",
                    "Answering Opinion Questions on Products by Exploiting Hierarchical Organization of Consumer Reviews.",
                    "Locally Training the Log-Linear Model for SMT.",
                    "Iterative Annotation Transformation with Predict-Self Reestimation for Chinese Word Segmentation.",
                    "Automatically Constructing a Normalisation Dictionary for Microblogs.",
                    "Unsupervised PCFG Induction for Grounded Language Learning with Highly Ambiguous Supervision.",
                    "Forced Derivation Tree based Model Training to Statistical Machine Translation.",
                    "Multi-instance Multi-label Learning for Relation Extraction.",
                    "An \"AI readability\" Formula for French as a Foreign Language.",
                    "Dynamic Programming for Higher Order Parsing of Gap-Minding Trees.",
                    "Joint Entity and Event Coreference Resolution across Documents.",
                    "Joint Chinese Word Segmentation, POS Tagging and Parsing.",
                    "Translation Model Based Cross-Lingual Language Model Adaptation: from Word Models to Phrase Models.",
                    "Open Language Learning for Information Extraction.",
                    "Modelling Sequential Text with an Adaptive Topic Model.",
                    "A Comparison of Vector-based Representations for Semantic Composition.",
                    "Exploiting Chunk-level Features to Improve Phrase Chunking.",
                    "A Beam-Search Decoder for Grammatical Error Correction.",
                    "A Statistical Relational Learning Approach to Identifying Evidence Based Medicine Categories.",
                    "Lyrics, Music, and Emotions.",
                    "Assessment of ESL Learners' Syntactic Competence Based on Similarity Measures.",
                    "A Unified Approach to Transliteration-based Text Input with Online Spelling Correction.",
                    "Excitatory or Inhibitory: A New Semantic Orientation Extracts Contradiction and Causality from the Web.",
                    "Enlarging Paraphrase Collections through Generalization and Instantiation.",
                    "Concurrent Acquisition of Word Meaning and Lexical Categories.",
                    "Do Neighbours Help? An Exploration of Graph-based Algorithms for Cross-domain Sentiment Classification.",
                    "Learning Lexicon Models from Search Logs for Query Expansion.",
                    "Joint Inference for Event Timeline Construction.",
                    "Three Dependency-and-Boundary Models for Grammar Induction.",
                    "Exploring Adaptor Grammars for Native Language Identification.",
                    "Discovering Diverse and Salient Threads in Document Collections.",
                    "Generalizing Sub-sentential Paraphrase Acquisition across Original Signal Type of Text Pairs.",
                    "Parse, Price and Cut--Delayed Column and Row Generation for Graph Based Parsers.",
                    "Domain Adaptation for Coreference Resolution: An Adaptive Ensemble Approach.",
                    "Weakly Supervised Training of Semantic Parsers.",
                    "Cross-Lingual Language Modeling with Syntactic Reordering for Low-Resource Speech Recognition.",
                    "Resolving Complex Cases of Definite Pronouns: The Winograd Schema Challenge.",
                    "A Sequence Labelling Approach to Quote Attribution.",
                    "SSHLDA: A Semi-Supervised Hierarchical Topic Model.",
                    "Improving NLP through Marginalization of Hidden Syntactic Structure.",
                    "Type-Supervised Hidden Markov Models for Part-of-Speech Tagging with Incomplete Tag Dictionaries.",
                    "Explore Person Specific Evidence in Web Person Name Disambiguation.",
                    "Inducing a Discriminative Parser to Optimize Machine Translation Reordering.",
                    "Re-training Monolingual Parser Bilingually for Syntactic SMT.",
                    "Transforming Trees to Improve Syntactic Convergence.",
                    "Learning Constraints for Consistent Timeline Extraction.",
                    "Identifying Constant and Unique Relations by using Time-Series Text.",
                    "No Noun Phrase Left Behind: Detecting and Typing Unlinkable Entities.",
                    "A Novel Discriminative Framework for Sentence-Level Discourse Analysis.",
                    "Using Discourse Information for Paraphrase Extraction.",
                    "Generating Non-Projective Word Order in Statistical Linearization.",
                    "Learning Syntactic Categories Using Paradigmatic Representations of Word Context.",
                    "Exploring Topic Coherence over Many Models and Many Topics.",
                    "Entropy-based Pruning for Phrase-based Machine Translation.",
                    "A Systematic Comparison of Phrase Table Pruning Techniques.",
                    "Probabilistic Finite State Machines for Regression-based MT Evaluation.",
                    "An Empirical Investigation of Statistical Significance in NLP.",
                    "Employing Compositional Semantics and Discourse Consistency in Chinese Event Extraction.",
                    "Reading The Web with Learned Syntactic-Semantic Inference Rules.",
                    "Ensemble Semantics for Large-scale Unsupervised Relation Extraction.",
                    "Forest Reranking through Subtree Ranking.",
                    "Parser Showdown at the Wall Street Corral: An Empirical Investigation of Error Types in Parser Output.",
                    "Extending Machine Translation Evaluation Metrics with Lexical Cohesion to Document Level.",
                    "Fast Large-Scale Approximate Graph Construction for NLP.",
                    "Building a Lightweight Semantic Model for Unsupervised Information Extraction on Short Listings.",
                    "Sketch Algorithms for Estimating Point Queries in NLP.",
                    "Monte Carlo MCMC: Efficient Inference by Approximate Sampling.",
                    "On Amortizing Inference Cost for Structured Prediction.",
                    "Exact Sampling and Decoding in High-Order Hidden Markov Models.",
                    "PATTY: A Taxonomy of Relational Patterns with Semantic Types.",
                    "Training Factored PCFGs with Expectation Propagation.",
                    "A Coherence Model Based on Syntactic Patterns.",
                    "Language Model Rest Costs and Space-Efficient Storage.",
                    "Document-Wide Decoding for Phrase-Based Statistical Machine Translation.",
                    "Left-to-Right Tree-to-String Decoding with Prediction.",
                    "Semantic Compositionality through Recursive Matrix-Vector Spaces.",
                    "Polarity Inducing Latent Semantic Analysis.",
                    "First Order vs. Higher Order Modification in Distributional Semantics.",
                    "Learning-based Multi-Sieve Co-reference Resolution with Knowledge.",
                    "Joint Learning for Coreference Resolution with Markov Logic.",
                    "Resolving \"This-issue\" Anaphora.",
                    "Entity based Q&A Retrieval.",
                    "Constructing Task-Specific Taxonomies for Document Collection Browsing.",
                    "Besting the Quiz Master: Crowdsourcing Incremental Classification Games.",
                    "Multi-Domain Learning: When Do Domains Matter?",
                    "Biased Representation Learning for Domain Adaptation.",
                    "Unambiguity Regularization for Unsupervised Learning of Probabilistic Grammars.",
                    "Extracting Opinion Expressions with semi-Markov Conditional Random Fields.",
                    "Opinion Target Extraction Using Word-Based Translation Model.",
                    "Word Salad: Relating Food Prices and Descriptions.",
                    "Learning to Map into a Universal POS Tagset.",
                    "Part-of-Speech Tagging for Chinese-English Mixed Texts with Dynamic Features.",
                    "Wiki-ly Supervised Part-of-Speech Tagging.",
                    "Joining Forces Pays Off: Multilingual Joint Word Sense Disambiguation.",
                    "A New Minimally-Supervised Framework for Domain Word Sense Disambiguation.",
                    "Grounded Models of Semantic Representation.",
                    "Improved Parsing and POS Tagging Using Inter-Sentence Consistency Constraints.",
                    "Unified Dependency Parsing of Chinese Morphological and Syntactic Structures.",
                    "A Transition-Based System for Joint Part-of-Speech Tagging and Labeled Non-Projective Dependency Parsing.",
                    "Identifying Event-related Bursts via Social Media Activities.",
                    "User Demographics and Language in an Implicit Social Network.",
                    "Revisiting the Predictability of Language: Response Completion in Social Media.",
                    "Supervised Text-based Geolocation Using Language Models on an Adaptive Grid.",
                    "A Discriminative Model for Query Spelling Correction with Latent Structural SVM.",
                    "Characterizing Stylistic Elements in Syntactic Structure."
                ]
            },
            {
                "sub_name_abbr": "conf/conll/2012st",
                "sub_name": "Joint Conference on Empirical Methods in Natural Language Processing and Computational Natural Language Learning - Proceedings of the Shared Task: Modeling Multilingual Unrestricted Coreference in OntoNotes, EMNLP-CoNLL 2012, July 13, 2012, Jeju Island, Korea.",
                "count": 16,
                "papers": [
                    "CoNLL-2012 Shared Task: Modeling Multilingual Unrestricted Coreference in OntoNotes.",
                    "Latent Structure Perceptron with Feature Induction for Unrestricted Coreference Resolution.",
                    "Data-driven Multilingual Coreference Resolution using Resolver Stacking.",
                    "Combining the Best of Two Worlds: A Hybrid Approach to Multilingual Coreference Resolution.",
                    "Using Syntactic Dependencies to Solve Coreferences.",
                    "ICT: System Description for CoNLL-2012.",
                    "A Mixed Deterministic Model for Coreference Resolution.",
                    "Simple Maximum Entropy Models for Multilingual Coreference Resolution.",
                    "UBIU for Multilingual Coreference Resolution in OntoNotes.",
                    "Chinese Coreference Resolution via Ordered Filtering.",
                    "A Multigraph Model for Coreference Resolution.",
                    "Incorporating Rule-based and Statistic-based Techniques for Coreference Resolution.",
                    "Illinois-Coref: The UI System in the CoNLL-2012 Shared Task.",
                    "System paper for CoNLL-2012 shared task: Hybrid Rule-based Algorithm for Coreference Resolution.",
                    "BART goes multilingual: The UniTN / Essex submission to the CoNLL-2012 Shared Task.",
                    "Learning to Model Multilingual Unrestricted Coreference in OntoNotes."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "15th CoNLL 2011",
        "info": "Portland, Oregon, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/conll/2011",
                "sub_name": "Proceedings of the Fifteenth Conference on Computational Natural Language Learning, CoNLL 2011, Portland, Oregon, USA, June 23-24, 2011.",
                "count": 29,
                "papers": [
                    "Modeling Syntactic Context Improves Morphological Segmentation.",
                    "The Effect of Automatic Tokenization, Vocalization, Stemming, and {POS} Tagging on {A}rabic Dependency Parsing.",
                    "Punctuation: Making a Point in Unsupervised Dependency Parsing.",
                    "Modeling Infant Word Segmentation.",
                    "Word Segmentation as General Chunking.",
                    "(Invited talk) Computational Linguistics for Studying Language in People: Principles, Applications and Research Problems.",
                    "Search-based Structured Prediction applied to Biomedical Event Extraction.",
                    "Using Sequence Kernels to identify Opinion Entities in Urdu.",
                    "Subword and Spatiotemporal Models for Identifying Actionable Information in {H}aitian {K}reyol.",
                    "Gender Attribution: Tracing Stylometric Evidence Beyond Topic and Genre.",
                    "Improving the Impact of Subjectivity Word Sense Disambiguation on Contextual Opinion Analysis.",
                    "Effects of Meaning-Preserving Corrections on Language Learning.",
                    "Assessing Benefit from Feature Feedback in Active Learning for Text Classification.",
                    "ULISSE: an Unsupervised Algorithm for Detecting Reliable Dependency Parses.",
                    "Language Models as Representations for Weakly Supervised NLP Tasks.",
                    "Automatic Keyphrase Extraction by Bridging Vocabulary Gap.",
                    "Using Second-order Vectors in a Knowledge-based Method for Acronym Disambiguation.",
                    "Using the Mutual k-Nearest Neighbor Graphs for Semi-supervised Classification on Natural Language Data.",
                    "Automatically Building Training Examples for Entity Extraction.",
                    "Probabilistic Word Alignment under the $L_0$-norm.",
                    "Authorship Attribution with Latent Dirichlet Allocation.",
                    "Evaluating a Semantic Network Automatically Constructed from Lexical Co-occurrence on a Word Sense Disambiguation Task.",
                    "Filling the Gap: Semi-Supervised Learning for Opinion Detection Across Domains.",
                    "A Normalized-Cut Alignment Model for Mapping Hierarchical Semantic Structures onto Spoken Documents.",
                    "(Invited talk) Bayesian Tools for Natural Language Learning.",
                    "Composing Simple Image Descriptions using Web-scale N-grams.",
                    "Adapting Text instead of the Model: An Open Domain Approach.",
                    "Learning with Lookahead: Can History-Based Models Rival Globally Optimized Models?",
                    "Learning Discriminative Projections for Text Similarity Measures."
                ]
            },
            {
                "sub_name_abbr": "conf/conll/2011st",
                "sub_name": "Proceedings of the Fifteenth Conference on Computational Natural Language Learning: Shared Task, CoNLL 2011, Portland, Oregon, USA, June 23-24, 2011.",
                "count": 22,
                "papers": [
                    "CoNLL-2011 Shared Task: Modeling Unrestricted Coreference in OntoNotes.",
                    "Stanford's Multi-Pass Sieve Coreference Resolution System at the CoNLL-2011 Shared Task.",
                    "RelaxCor Participation in CoNLL Shared Task on Coreference Resolution.",
                    "Inference Protocols for Coreference Resolution.",
                    "Exploring Lexicalized Features for Coreference Resolution.",
                    "Rule and Tree Ensembles for Unrestricted Coreference Resolution.",
                    "Unrestricted Coreference Resolution via Global Hypergraph Partitioning.",
                    "Multi-metric optimization for coreference: The UniTN / IITP / Essex submission to the 2011 CONLL Shared Task.",
                    "Combining Syntactic and Semantic Features by SVM for Unrestricted Coreference Resolution.",
                    "Supervised Coreference Resolution with SUCRE.",
                    "ETS: An Error Tolerable System for Coreference Resolution.",
                    "An Incremental Model for Coreference Resolution with Restrictive Antecedent Accessibility.",
                    "Narrative Schema as World Knowledge for Coreference Resolution.",
                    "Hybrid Approach for Coreference Resolution.",
                    "Poly-co: a multilayer perceptron approach for coreference detection.",
                    "Mention Detection: Heuristics for the OntoNotes annotations.",
                    "Coreference Resolution with Loose Transitivity Constraints.",
                    "UBIU: A Robust System for Resolving Unrestricted Coreference.",
                    "A Machine Learning-Based Coreference Detection System for OntoNotes.",
                    "Reconciling OntoNotes: Unrestricted Coreference Resolution in OntoNotes with Reconcile.",
                    "Coreference Resolution System using Maximum Entropy Classifier.",
                    "Link Type Based Pre-Cluster Pair Model for Coreference Resolution."
                ]
            }
        ]
    },
    {
        "year": "2010",
        "name": "14th CoNLL 2010",
        "info": "Uppsala, Sweden",
        "venues": [
            {
                "sub_name_abbr": "conf/conll/2010",
                "sub_name": "Proceedings of the Fourteenth Conference on Computational Natural Language Learning, CoNLL 2010, Uppsala, Sweden, July 15-16, 2010.",
                "count": 27,
                "papers": [
                    "Improvements in Unsupervised Co-Occurrence Based Parsing.",
                    "Viterbi Training Improves Unsupervised Dependency Parsing.",
                    "Driving Semantic Parsing from the World's Response.",
                    "Efficient, Correct, Unsupervised Learning for Context-Sensitive Languages.",
                    "Identifying Patterns for Unsupervised Grammar Induction.",
                    "Learning Better Monolingual Models with Unannotated Bilingual Text.",
                    "(Invited Talk) Clueless: Explorations in Unsupervised, Knowledge-Lean Extraction of Lexical-Semantic Information.",
                    "(Invited Talk) Bayesian Hidden Markov Models and Extensions.",
                    "Improved Unsupervised POS Induction Using Intrinsic Clustering Quality and a Zipfian Constraint.",
                    "Syntactic and Semantic Structure for Opinion Expression Detection.",
                    "Type Level Clustering Evaluation: New Measures and a POS Induction Case Study.",
                    "Recession Segmentation: Simpler Online Word Segmentation Using Limited Resources.",
                    "Computing Optimal Alignments for the IBM-3 Translation Model.",
                    "Semi-Supervised Recognition of Sarcasm in Twitter and Amazon.",
                    "Learning Probabilistic Synchronous CFGs for Phrase-Based Translation.",
                    "A Semi-Supervised Batch-Mode Active Learning Strategy for Improved Statistical Machine Translation.",
                    "Improving Word Alignment by Semi-Supervised Ensemble.",
                    "A Comparative Study of Bayesian Models for Unsupervised Sentiment Detection.",
                    "A Hybrid Approach to Emotional Sentence Polarity and Intensity Classification.",
                    "Cross-Caption Coreference Resolution for Automatic Image Understanding.",
                    "Improved Natural Language Learning via Variance-Regularization Support Vector Machines.",
                    "Online Entropy-Based Model of Lexical Category Acquisition.",
                    "Tagging and Linking Web Forum Posts.",
                    "Joint Entity and Relation Extraction Using Card-Pyramid Parsing.",
                    "Distributed Asynchronous Online Learning for Natural Language Processing.",
                    "On Reverse Feature Engineering of Syntactic Tree Kernels.",
                    "Inspecting the Structural Biases of Dependency Parsing Algorithms."
                ]
            },
            {
                "sub_name_abbr": "conf/conll/2010st",
                "sub_name": "Proceedings of the Fourteenth Conference on Computational Natural Language Learning: Shared Task, CoNLL 2010, Uppsala, Sweden, July 15-16, 2010.",
                "count": 23,
                "papers": [
                    "The CoNLL-2010 Shared Task: Learning to Detect Hedges and their Scope in Natural Language Text.",
                    "A Cascade Method for Detecting Hedges and their Scope in Natural Language Text.",
                    "Detecting Speculative Language Using Syntactic Dependencies and Logistic Regression.",
                    "A Hedgehop over a Max-Margin Framework Using Hedge Cues.",
                    "Detecting Hedge Cues and their Scopes with Average Perceptron.",
                    "Memory-Based Resolution of In-Sentence Scopes of Hedge Cues.",
                    "Resolving Speculation: MaxEnt Cue Classification and Dependency-Based Scope Rules.",
                    "Combining Manual Rules and Supervised Learning for Hedge Cue and Scope Detection.",
                    "Hedge Detection Using the RelHunter Approach.",
                    "A High-Precision Approach to Detecting Hedges and their Scopes.",
                    "Exploiting Rich Features for Detecting Hedges and their Scope.",
                    "Uncertainty Detection as Approximate Max-Margin Sequence Labelling.",
                    "Hedge Detection and Scope Finding by Sequence Labeling with Procedural Feature Selection.",
                    "Learning to Detect Hedges and their Scope Using CRF.",
                    "Exploiting Multi-Features to Detect Hedges and their Scope in Biomedical Texts.",
                    "A Lucene and Maximum Entropy Model Based Hedge Detection System.",
                    "HedgeHunter: A System for Hedge Detection and Uncertainty Classification.",
                    "Exploiting CCG Structures with Tree Kernels for Speculation Detection.",
                    "Uncertainty Learning Using SVMs and CRFs.",
                    "Features for Detecting Hedge Cues.",
                    "A Simple Ensemble Method for Hedge Identification.",
                    "A Baseline Approach for Detecting Sentences Containing Uncertainty.",
                    "Hedge Classification with Syntactic Dependency Features Based on an Ensemble Classifier."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "13th CoNLL 2009",
        "info": "Boulder, Colorado, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/conll/2009",
                "sub_name": "Proceedings of the Thirteenth Conference on Computational Natural Language Learning, CoNLL 2009, Boulder, Colorado, USA, June 4-5, 2009.",
                "count": 27,
                "papers": [
                    "Joint Inference for Natural Language Processing.",
                    "Modeling Word Learning As Communicative Inference.",
                    "Sample Selection for Statistical Parsers: Cognitively Driven Algorithms and Evaluation Measures.",
                    "Data-Driven Dependency Parsing of New Languages Using Incomplete and Noisy Training Data.",
                    "A Metalearning Approach to Processing the Scope of Negation.",
                    "Efficient Linearization of Tree Kernel Functions.",
                    "A Method for Stopping Active Learning Based on Stabilizing Predictions and the Need for User-Adjustable Stopping.",
                    "Superior and Efficient Fully Unsupervised Pattern-based Concept Acquisition Using an Unsupervised Parser.",
                    "Representing words as regions in vector space.",
                    "Interactive Feature Space Construction using Semantic Information.",
                    "Mining the Web for Reciprocal Relationships.",
                    "Minimally Supervised Model of Early Language Acquisition.",
                    "Learning Where to Look: Modeling Eye Movements in Reading.",
                    "Monte Carlo inference and maximization for phrase-based translation.",
                    "Investigating Automatic Alignment Methods for Slide Generation from Academic Papers.",
                    "Glen, Glenda or Glendale: Unsupervised and Semi-supervised Learning of English Noun Gender.",
                    "Improving Translation Lexicon Induction from Monolingual Corpora via Dependency Contexts and Part-of-Speech Equivalences.",
                    "An Intrinsic Stopping Criterion for Committee-Based Active Learning.",
                    "Design Challenges and Misconceptions in Named Entity Recognition.",
                    "Automatic Selection of High Quality Parses Created By a Fully Unsupervised Parser.",
                    "The NVI Clustering Evaluation Measure.",
                    "Lexical Patterns or Dependency Patterns: Which Is Better for Hypernym Extraction?",
                    "Improving Text Classification by a Sense Spectrum Approach to Term Expansion.",
                    "A simple feature-copying approach for long-distance dependencies.",
                    "Fine-Grained Classification of Named Entities Exploiting Latent Semantic Kernels.",
                    "Using Encyclopedic Knowledge for Automatic Topic Identification.",
                    "New Features for FrameNet - WordNet Mapping."
                ]
            },
            {
                "sub_name_abbr": "conf/conll/2009st",
                "sub_name": "Proceedings of the Thirteenth Conference on Computational Natural Language Learning: Shared Task, CoNLL 2009, Boulder, Colorado, USA, June 4, 2009.",
                "count": 19,
                "papers": [
                    "The CoNLL-2009 Shared Task: Syntactic and Semantic Dependencies in Multiple Languages.",
                    "An Iterative Approach for Joint Dependency Parsing and Semantic Role Labeling.",
                    "Joint Memory-Based Learning of Syntactic and Semantic Dependencies in Multiple Languages.",
                    "Hybrid Multilingual Parsing with HPSG for SRL.",
                    "A Latent Variable Model of Synchronous Syntactic-Semantic Parsing for Multiple Languages.",
                    "Multilingual Semantic Role Labeling.",
                    "Multilingual Dependency-based Syntactic and Semantic Parsing.",
                    "Multilingual Dependency Learning: A Huge Feature Engineering Method to Semantic Dependency Parsing.",
                    "Multilingual Dependency Learning: Exploiting Rich Features for Tagging Syntactic and Semantic Dependencies.",
                    "Efficient Parsing of Syntactic and Semantic Dependency Structures.",
                    "Exploring Multilingual Semantic Role Labeling.",
                    "A Second-Order Joint Eisner Model for Syntactic and Semantic Dependency Parsing.",
                    "Multilingual Semantic Role Labelling with Markov Logic.",
                    "The Crotal SRL System : a Generic Tool Based on Tree-structured CRF.",
                    "Parsing Syntactic and Semantic Dependencies for Multiple Languages with A Pipeline Approach.",
                    "Multilingual Semantic Parsing with a Pipeline of Linear Classifiers.",
                    "A Joint Syntactic and Semantic Dependency Parsing System based on Maximum Entropy Models.",
                    "Multilingual Syntactic-Semantic Dependency Parsing with Three-Stage Approximate Max-Margin Linear Models.",
                    "A Simple Generative Pipeline Approach to Dependency Parsing and Semantic Role Labeling."
                ]
            }
        ]
    },
    {
        "year": "2008",
        "name": "12th CoNLL 2008",
        "info": "Manchester, UK",
        "venues": [
            {
                "sub_name_abbr": "conf/conll/2008",
                "sub_name": "Proceedings of the Twelfth Conference on Computational Natural Language Learning, CoNLL 2008, Manchester, UK, August 16-17, 2008.",
                "count": 40,
                "papers": [
                    "Semantic Parsing for High-Precision Semantic Role Labelling.",
                    "TAG, Dynamic Programming, and the Perceptron for Efficient, Feature-Rich Parsing.",
                    "A Fast Boosting-based Learner for Feature-Rich Tagging and Chunking.",
                    "Linguistic features in data-driven dependency parsing.",
                    "Transforming Meaning Representation Grammars to Improve Semantic Parsing.",
                    "Using LDA to detect semantically incoherent documents.",
                    "Picking them up and Figuring them out: Verb-Particle Constructions, Noise and Idiomaticity.",
                    "Fast Mapping in Word Learning: What Probabilities Tell Us.",
                    "Improving Word Segmentation by Simultaneously Learning Phonotactics.",
                    "A MDL-based Model of Gender Knowledge Acquisition.",
                    "Baby SRL: Modeling Early Language Acquisition.",
                    "An Incremental Bayesian Model for Learning Syntactic Categories.",
                    "Fully Unsupervised Graph-Based Discovery of General-Specific Noun Relationships from Web Corpora Frequency Counts.",
                    "Acquiring Knowledge from the Web to be used as Selectors for Noun Sense Disambiguation.",
                    "Automatic Chinese Catchword Extraction Based on Time Series Analysis.",
                    "Easy as ABC? Facilitating Pictorial Communication via Semantically Enhanced Layout.",
                    "A Nearest-Neighbor Approach to the Automatic Analysis of Ancient Greek Morphology.",
                    "Context-based Arabic Morphological Analysis for Machine Translation.",
                    "A Tree-to-String Phrase-based Model for Statistical Machine Translation.",
                    "Trainable Speaker-Based Referring Expression Generation.",
                    "The CoNLL 2008 Shared Task on Joint Parsing of Syntactic and Semantic Dependencies.",
                    "A Latent Variable Model of Synchronous Parsing for Syntactic and Semantic Dependencies.",
                    "Dependency-based Syntactic-Semantic Analysis with PropBank and NomBank.",
                    "A Joint Model for Parsing Syntactic and Semantic Dependencies.",
                    "Collective Semantic Role Labelling with Markov Logic.",
                    "Hybrid Learning of Dependency Structures from Heterogeneous Linguistic Resources.",
                    "Parsing Syntactic and Semantic Dependencies with Two Single-Stage Maximum Entropy Models.",
                    "A Combined Memory-Based Semantic Role Labeler of English.",
                    "A Puristic Approach for Joint Dependency Parsing and Semantic Role Labeling.",
                    "Discriminative Learning of Syntactic and Semantic Dependencies.",
                    "Discriminative vs. Generative Approaches in Semantic Role Labeling.",
                    "A Pipeline Approach for Syntactic and Semantic Dependency Parsing.",
                    "Semantic Dependency Parsing using N-best Semantic Role Sequences and Roleset Information.",
                    "A Cascaded Syntactic and Semantic Dependency Parsing System.",
                    "The Integration of Dependency Relation Classification and Semantic Role Labeling Using Bilayer Maximum Entropy Markov Models.",
                    "Mixing and Blending Syntactic and Semantic Dependencies.",
                    "Dependency Tree-based SRL with Proper Pruning and Extensive Feature Engineering.",
                    "DeSRL: A Linear-Time Semantic Role Labeling System.",
                    "Probabilistic Model for Syntactic and Semantic Dependency Parsing.",
                    "Applying Sentence Simplification to the CoNLL-2008 Shared Task."
                ]
            }
        ]
    },
    {
        "year": "2007",
        "name": "EMNLP-CoNLL 2007",
        "info": "Prague, Czech Republic",
        "venues": [
            {
                "sub_name_abbr": "conf/emnlp/2007",
                "sub_name": "EMNLP-CoNLL 2007, Proceedings of the 2007 Joint Conference on Empirical Methods in Natural Language Processing and Computational Natural Language Learning, June 28-30, 2007, Prague, Czech Republic.",
                "count": 131,
                "papers": [
                    "Modelling Compression with Discourse Constraints.",
                    "Using Semantic Roles to Improve Question Answering.",
                    "What is the Jeopardy Model? A Quasi-Synchronous Grammar for QA.",
                    "Learning Unsupervised SVM Classifier for Answer Selection in Web Question Answering.",
                    "Improving Word Alignment with Bridge Languages.",
                    "Getting the Structure Right for Word Alignment: LEAF.",
                    "Improving Statistical Machine Translation Using Word Sense Disambiguation.",
                    "Large Margin Synchronous Generation and its Application to Sentence Compression.",
                    "Incremental Text Structuring with Online Hierarchical Ranking.",
                    "Automatically Identifying the Arguments of Discourse Connectives.",
                    "Incremental Generation of Plural Descriptions: Similarity and Partitioning.",
                    "A Comparative Evaluation of Deep and Shallow Approaches to the Automatic Detection of Common Grammatical Errors.",
                    "Characterizing the Errors of Data-Driven Dependency Parsing Models.",
                    "Probabilistic Models of Nonprojective Dependency Trees.",
                    "Structured Prediction Models via the Matrix-Tree Theorem.",
                    "Using Foreign Inclusion Detection to Improve Parsing Performance.",
                    "LEDIR: An Unsupervised Algorithm for Learning Directionality of Inference Rules.",
                    "Modelling Polysemy in Adjective Classes by Multi-Label Classification.",
                    "Improving Query Spelling Correction Using Web Search Results.",
                    "Towards Robust Unsupervised Personal Name Disambiguation.",
                    "Compressing Trigram Language Models With Golomb Coding.",
                    "Joint Morphological and Syntactic Disambiguation.",
                    "Unsupervised Part-of-Speech Acquisition for Resource-Scarce Languages.",
                    "Semi-Supervised Classification for Extracting Protein Interaction Sentences using Dependency Parsing.",
                    "A Sequence Alignment Model Based on the Averaged Perceptron.",
                    "Instance Based Lexical Entailment for Ontology Population.",
                    "Recovering Non-Local Dependencies for Chinese.",
                    "Exploiting Multi-Word Units in History-Based Probabilistic Generation.",
                    "Hierarchical System Combination for Machine Translation.",
                    "Using RBMT Systems to Produce Bilingual Corpus for SMT.",
                    "Why Doesn't EM Find Good HMM POS-Taggers?",
                    "Probabilistic Coordination Disambiguation in a Fully-Lexicalized Japanese Parser.",
                    "A New Perceptron Algorithm for Sequence Labeling with Non-Local Features.",
                    "Extending a Thesaurus in the Pan-Chinese Context.",
                    "Low-Quality Product Review Detection in Opinion Summarization.",
                    "Improving Statistical Machine Translation Performance by Training Data Selection and Optimization.",
                    "Topic Segmentation with Hybrid Document Indexing.",
                    "Syntactic Re-Alignment Models for Machine Translation.",
                    "Detecting Compositionality of Verb-Object Combinations using Selectional Preferences.",
                    "Explorations in Automatic Book Summarization.",
                    "Part-of-Speech Tagging for Middle English through Alignment and Projection of Parallel Diachronic Texts.",
                    "Flexible, Corpus-Based Modelling of Human Plausibility Judgements.",
                    "V-Measure: A Conditional Entropy-Based External Cluster Evaluation Measure.",
                    "Bayesian Document Generative Model with Explicit Multiple Topics.",
                    "Smooth Bilingual N-Gram Translation.",
                    "Morphological Disambiguation of Hebrew: A Case Study in Classifier Combination.",
                    "Enhancing Single-Document Summarization by Combining RankNet and Third-Party Sources.",
                    "Automatic Identification of Important Segments and Expressions for Mining of Business-Oriented Conversations at Contact Centers.",
                    "Smoothed Bloom Filter Language Models: Tera-Scale LMs on the Cheap.",
                    "Word Sense Disambiguation Incorporating Lexical and Structural Semantic Information.",
                    "An Approach to Text Corpus Construction which Cuts Annotation Costs and Maintains Reusability of Annotated Data.",
                    "Antecedent Selection Techniques for High-Recall Coreference Resolution.",
                    "Methods to Integrate a Language Model with Semantic Information for a Word Prediction Component.",
                    "Bilingual Cluster Based Models for Statistical Machine Translation.",
                    "A Systematic Comparison of Training Criteria for Statistical Machine Translation.",
                    "Phrase Reordering Model Integrating Syntactic Knowledge for SMT.",
                    "Identification and Resolution of Chinese Zero Pronouns: A Machine Learning Approach.",
                    "Parsimonious Data-Oriented Parsing.",
                    "Generating Lexical Analogies Using Dependency Relations.",
                    "Cross-Lingual Distributional Profiles of Concepts for Measuring Semantic Distance.",
                    "Lexical Semantic Relatedness with Random Graph Walks.",
                    "Experimental Evaluation of LTAG-Based Features for Semantic Role Labeling.",
                    "Japanese Dependency Analysis Using the Ancestor-Descendant Relation.",
                    "A Discriminative Learning Model for Coordinate Conjunctions.",
                    "Recovery of Empty Nodes in Parse Structures.",
                    "Treebank Annotation Schemes and Parser Evaluation for German.",
                    "Semi-Markov Models for Sequence Segmentation.",
                    "A Graph-Based Approach to Named Entity Categorization in Wikipedia Using Conditional Random Fields.",
                    "MavenRank: Identifying Influential Members of the US Senate Using Lexical Centrality.",
                    "Bootstrapping Feature-Rich Dependency Parsers with Entropic Priors.",
                    "Online Learning of Relaxed CCG Grammars for Parsing to Logical Form.",
                    "The Infinite PCFG Using Hierarchical Dirichlet Processes.",
                    "Exploiting Wikipedia as External Knowledge for Named Entity Recognition.",
                    "Large-Scale Named Entity Disambiguation Based on Wikipedia Data.",
                    "Effective Information Extraction with Semantic Affinity Patterns and Relevant Regions.",
                    "Tree Kernel-Based Relation Extraction with Context-Sensitive Structured Parse Tree Information.",
                    "Chinese Syntactic Reordering for Statistical Machine Translation.",
                    "Binarizing Syntax Trees to Improve Syntax-Based Machine Translation Accuracy.",
                    "What Can Syntax-Based MT Learn from Phrase-Based MT?",
                    "Online Large-Margin Training for Statistical Machine Translation.",
                    "Scalable Term Selection for Text Categorization.",
                    "Active Learning for Word Sense Disambiguation with Methods for Addressing the Class Imbalance Problem.",
                    "Semi-Supervised Structured Output Learning Based on a Hybrid Generative and Discriminative Approach.",
                    "Finding Good Sequential Model Structures using Output Transformations.",
                    "A Statistical Language Modeling Approach to Lattice-Based Spoken Document Retrieval.",
                    "Learning Noun Phrase Query Segmentation.",
                    "Bootstrapping Information Extraction from Field Books.",
                    "Extracting Data Records from Unstructured Biomedical Full Text.",
                    "Multiple Alignment of Citation Sentences with Conditional Random Fields and Posterior Decoding.",
                    "Large Language Models in Machine Translation.",
                    "Factored Translation Models.",
                    "Translating Unknown Words by Analogical Learning.",
                    "A Probabilistic Approach to Diachronic Phonology.",
                    "Learning Structured Models for Phone Recognition.",
                    "Inducing Search Keys for Name Filtering.",
                    "The CoNLL 2007 Shared Task on Dependency Parsing.",
                    "Single Malt or Blended? A Study in Multilingual Parser Optimization.",
                    "Probabilistic Parsing Action Models for Multi-Lingual Dependency Parsing.",
                    "Fast and Robust Multilingual Dependency Parsing with a Generative Latent Variable Model.",
                    "Multilingual Dependency Parsing Using Global Features.",
                    "Experiments with a Higher-Order Projective Dependency Parser.",
                    "Log-Linear Models of Non-Projective Trees, $k$-best MST Parsing and Tree-Ranking.",
                    "Improving Translation Quality by Discarding Most of the Phrasetable.",
                    "Hierarchical Phrase-Based Translation with Suffix Arrays.",
                    "An Empirical Study on Computing Consensus Translations from Multiple Machine Translation Systems.",
                    "Learning to Find English to Chinese Transliterations on the Web.",
                    "Learning to Merge Word Senses.",
                    "Improving Word Sense Disambiguation Using Topic Features.",
                    "A Topic Model for Word Sense Disambiguation.",
                    "Validation and Evaluation of Automatically Acquired Multiword Expressions for Grammar Engineering.",
                    "Dependency Parsing and Domain Adaptation with LR Models and Parser Ensembles.",
                    "Frustratingly Hard Domain Adaptation for Dependency Parsing.",
                    "Crystal: Analyzing Predictive Opinions on the Web.",
                    "Extracting Aspect-Evaluation and Aspect-Of Relations in Opinion Mining.",
                    "Building Lexicon for Sentiment Analysis from Massive Collection of HTML Documents.",
                    "Determining Case in Arabic: Learning Complex Linguistic Behavior Requires Complex Linguistic Features.",
                    "Mandarin Part-of-Speech Tagging and Discriminative Reranking.",
                    "Building Domain-Specific Taggers without Annotated (Domain) Data.",
                    "Multilingual Dependency Parsing and Domain Adaptation using DeSR.",
                    "Hybrid Ways to Improve Domain Independence in an ML Dependency Parser.",
                    "A Constraint Satisfaction Approach to Dependency Parsing.",
                    "A Two-Stage Parser for Multilingual Dependency Parsing.",
                    "Incremental Dependency Parsing Using Online Learning.",
                    "Online Learning for Deterministic Dependency Parsing.",
                    "Covington Variations.",
                    "A Multilingual Dependency Analysis System Using Online Passive-Aggressive Learning.",
                    "Global Learning of Labeled Dependency Trees.",
                    "Pro3Gres Parser in the CoNLL Domain Adaptation Shared Task.",
                    "Structural Correspondence Learning for Dependency Parsing.",
                    "Adapting the RASP System for the CoNLL07 Domain-Adaptation Task.",
                    "Multilingual Deterministic Dependency Parsing Framework using Modified Finite Newton Method Support Vector Machines."
                ]
            }
        ]
    },
    {
        "year": "2006",
        "name": "10th CoNLL 2006",
        "info": "New York City, NY, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/conll/2006",
                "sub_name": "Proceedings of the Tenth Conference on Computational Natural Language Learning, CoNLL 2006, New York City, USA, June 8-9, 2006.",
                "count": 38,
                "papers": [
                    "A Mission for Computational Natural Language Learning.",
                    "Porting Statistical Parsers with Data-Defined Kernels.",
                    "Non-Local Modeling with a Mixture of PCFGs.",
                    "Improved Large Margin Dependency Parsing via Local Constraints and Laplacian Regularization.",
                    "What are the Productive Units of Natural Language Grammar? A DOP Approach to the Automatic Identification of Constructions.",
                    "Resolving and Generating Definite Anaphora by Modeling Hypernymy using Unlabeled Corpora.",
                    "Investigating Lexical Substitution Scoring for Subtitle Generation.",
                    "Semantic Role Recognition Using Kernels on Weighted Marked Ordered Labeled Trees.",
                    "Semantic Role Labeling via Tree Kernel Joint Inference.",
                    "Can Human Verb Associations Help Identify Salient Features for Semantic Verb Classification?",
                    "Applying Alternating Structure Optimization to Word Sense Disambiguation.",
                    "Unsupervised Parsing with U-DOP.",
                    "A Lattice-Based Framework for Enhancing Statistical Parsers with Information from Unlabeled Corpora.",
                    "Word Distributions for Thematic Segmentation in a Support Vector Machine Approach.",
                    "Which Side are You on? Identifying Perspectives at the Document and Sentence Levels.",
                    "Unsupervised Grammar Induction by Distribution and Attachment.",
                    "Learning Auxiliary Fronting with Grammatical Inference.",
                    "Using Gazetteers in Discriminative Information Extraction.",
                    "A Context Pattern Induction Method for Named Entity Extraction.",
                    "CoNLL-X Shared Task on Multilingual Dependency Parsing.",
                    "The Treebanks Used in the Shared Task.",
                    "Experiments with a Multilanguage Non-Projective Dependency Parser.",
                    "LingPars, a Linguistically Inspired, Language-Independent Machine Learner for Dependency Treebanks.",
                    "Dependency Parsing by Inference over High-recall Dependency Predictions.",
                    "Projective Dependency Parsing with Perceptron.",
                    "A Pipeline Model for Bottom-Up Dependency Parsing.",
                    "Multi-lingual Dependency Parsing at NAIST.",
                    "Dependency Parsing with Reference to Slovene, Spanish and Swedish.",
                    "Vine Parsing and Minimum Risk Reranking for Speed and Precision.",
                    "Investigating Multilingual Dependency Parsing.",
                    "Dependency Parsing Based on Dynamic Local Optimization.",
                    "Multilingual Dependency Analysis with a Two-Stage Discriminative Parser.",
                    "Labeled Pseudo-Projective Dependency Parsing with Support Vector Machines.",
                    "Multi-lingual Dependency Parsing with Incremental Integer Linear Programming.",
                    "Language Independent Probabilistic Context-Free Parsing Bolstered by Machine Learning.",
                    "Maximum Spanning Tree Algorithm for Non-projective Labeled Dependency Parsing.",
                    "The Exploration of Deterministic and Efficient Dependency Parsing.",
                    "Dependency Parsing as a Classication Problem."
                ]
            }
        ]
    },
    {
        "year": "2005",
        "name": "9th CoNLL 2005",
        "info": "Ann Arbor, Michigan, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/conll/2005",
                "sub_name": "Proceedings of the Ninth Conference on Computational Natural Language Learning, CoNLL 2005, Ann Arbor, Michigan, USA, June 29-30, 2005.",
                "count": 39,
                "papers": [
                    "Effective use of WordNet Semantics via Kernel-Based Learning.",
                    "A Statistical Semantic Parser that Integrates Syntax and Semantics.",
                    "Search Engine Statistics Beyond the n-Gram: Application to Noun Compound Bracketing.",
                    "New Experiments in Distributional Representations of Synonymy.",
                    "Word Independent Context Pair Classification Model for Word Sense Disambiguation.",
                    "Computing Word Similarity and Identifying Cognates with Pair Hidden Markov Models.",
                    "A Bayesian Mixture Model for Term Re-occurrence and Burstiness.",
                    "Domain Kernels for Text Categorization.",
                    "Discriminative Training of Clustering Functions: Theory and Experiments with Entity Identification.",
                    "Using Uneven Margins SVM and Perceptron for Information Extraction.",
                    "Improving Sequence Segmentation Learning by Predicting Trigrams.",
                    "An Expectation Maximization Approach to Pronoun Resolution.",
                    "Probabilistic Head-Driven Parsing for Discourse Structure.",
                    "Intentional Context in Situated Natural Language Learning.",
                    "Representational Bias in Unsupervised Learning of Syllable Structure.",
                    "An Analogical Learner for Morphological Analysis.",
                    "Morphology Induction from Term Clusters.",
                    "Beyond the Pipeline: Discrete Optimization in NLP.",
                    "Investigating the Effects of Selective Sampling on the Annotation Task.",
                    "Introduction to the CoNLL-2005 Shared Task: Semantic Role Labeling.",
                    "Inferring Semantic Roles Using Sub-Categorization Frames and Maximum Entropy Model.",
                    "Semantic Role Labelling with Tree Conditional Random Fields.",
                    "A Joint Model for Semantic Role Labeling.",
                    "Sparse Bayesian Classification of Predicate Arguments.",
                    "Generalized Inference with Multiple Semantic Role Labeling Systems.",
                    "Semantic Role Labeling via Consensus in Pattern-Matching.",
                    "Semantic Role Labeling System Using Maximum Entropy Classifier.",
                    "Semantic Role Labeling as Sequential Tagging.",
                    "Semantic Role Labeling Using Support Vector Machines.",
                    "Hierarchical Semantic Role Labeling.",
                    "Semantic Role Labeling Using libSVM.",
                    "Maximum Entropy Based Semantic Role Labeling.",
                    "Semantic Role Labeling Using Lexical Statistical Information.",
                    "Semantic Role Chunking Combining Complementary Syntactic Views.",
                    "Semantic Role Labeling Using Complete Syntactic Analysis.",
                    "Joint Parsing and Semantic Role Labeling.",
                    "Applying Spelling Error Correction Techniques for Improving Semantic Role Labelling.",
                    "Exploiting Full Parsing Information to Label Semantic Roles Using an Ensemble of ME and SVM via Integer Linear Programming.",
                    "The Integration of Syntactic Parsing and Semantic Role Labeling."
                ]
            }
        ]
    },
    {
        "year": "2004",
        "name": "8th CoNLL 2004",
        "info": "Boston, Massachusetts, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/conll/2004",
                "sub_name": "Proceedings of the Eighth Conference on Computational Natural Language Learning, CoNLL 2004, Held in cooperation with HLT-NAACL 2004, Boston, Massachusetts, USA, May 6-7, 2004.",
                "count": 24,
                "papers": [
                    "A Linear Programming Formulation for Global Inference in Natural Language Tasks.",
                    "Semantic Lexicon Construction: Learning from Unlabeled Data via Spectral Analysis.",
                    "A Semantic Kernel for Predicate Argument Classification.",
                    "Combining Lexical and Syntactic Features for Supervised Word Sense Disambiguation.",
                    "Co-training and Self-training for Word Sense Disambiguation.",
                    "Word Sense Discrimination by Clustering Contexts in Vector and Similarity Spaces.",
                    "Memory-Based Dependency Parsing.",
                    "Modeling Category Structures with a Kernel Function.",
                    "A Comparison of Manual and Automatic Constructions of Category Hierarchy for Classifying Large Corpora.",
                    "Thesauruses for Prepositional Phrase Attachment.",
                    "Calculating Semantic Distance between Word Sense Probability Distributions.",
                    "Introduction to the CoNLL-2004 Shared Task: Semantic Role Labeling.",
                    "Semantic Role Labelling With Chunk Sequences.",
                    "Memory-based semantic role labeling: Optimizing features, algorithm, and output.",
                    "Hierarchical Recognition of Propositional Arguments with Perceptrons.",
                    "Semantic Role Labeling by Tagging Syntactic Chunks.",
                    "A transformation-based approach to argument labeling.",
                    "A Memory-Based Approach for Semantic Role Labeling.",
                    "Semantic Role Labeling using Maximum Entropy Model.",
                    "Two-Phase Semantic Role Labeling based on Support Vector Machines.",
                    "Semantic Role Labeling Via Generalized Inference Over Classifiers.",
                    "Learning Transformation Rules for Semantic Role Labeling.",
                    "Language Learning: Beyond Thunderdome.",
                    "Putting Meaning into Your Trees."
                ]
            }
        ]
    },
    {
        "year": "2003",
        "name": "7th CoNLL 2003",
        "info": "Edmonton, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/conll/2003",
                "sub_name": "Proceedings of the Seventh Conference on Natural Language Learning, CoNLL 2003, Held in cooperation with HLT-NAACL 2003, Edmonton, Canada, May 31 - June 1, 2003.",
                "count": 35,
                "papers": [
                    "A model of syntactic disambiguation based on lexicalized grammars.",
                    "An SVM-based voting algorithm with application to parse reranking.",
                    "Active learning for HPSG parse selection.",
                    "Learning subjective nouns using extraction pattern bootstrapping.",
                    "Unsupervised Personal Name Disambiguation.",
                    "Unsupervised learning of word sense disambiguation rules by estimating an optimum iteration number in the EM algorithm.",
                    "Bootstrapping POS-taggers using unlabelled data.",
                    "Updating an NLP system to fit new domains: an empirical study on the sentence segmentation problem.",
                    "Exceptionality and Natural Language Learning.",
                    "Semi-supervised Verb Class Discovery Using Noisy Features.",
                    "Preposition Semantic Classification via Treebank and FrameNet.",
                    "Phrasenet: towards context sensitive lexical semantics.",
                    "Confidence estimation for translation prediction.",
                    "Using 'smart' bilingual projection to feature-tag a monolingual dictionary.",
                    "Using LSA and Noun Coordination Information to Improve the Recall and Precision of Automatic Hyponymy Extraction.",
                    "An efficient clustering algorithm for class-based language models.",
                    "Training a Naive Bayes Classifier via the EM Algorithm with a Class Distribution Constraint.",
                    "Identifying Events using Similarity and Context.",
                    "Introduction to the CoNLL-2003 Shared Task: Language-Independent Named Entity Recognition.",
                    "Maximum Entropy Models for Named Entity Recognition.",
                    "A Simple Named Entity Extractor using AdaBoost.",
                    "Learning a Perceptron-Based Named Entity Chunker via Online Recognition Feedback.",
                    "Named Entity Recognition with a Maximum Entropy Approach.",
                    "Language Independent NER using a Maximum Entropy Tagger.",
                    "Named Entity Recognition through Classifier Combination.",
                    "Named Entity Recognition with Long Short-Term Memory.",
                    "Memory-based one-step named-entity recognition: Effects of seed list features, classifier stacking, and unannotated data.",
                    "Named Entity Recognition with Character-Level Models.",
                    "Named Entity Recognition using Hundreds of Thousands of Features.",
                    "Early results for Named Entity Recognition with Conditional Random Fields, Feature Induction and Web-Enhanced Lexicons.",
                    "Meta-Learning Orthographic and Contextual Models for Language Independent Named Entity Recognition.",
                    "Named Entity Recognition Using a Character-based Probabilistic Approach.",
                    "A Stacked, Voted, Stacked Model for Named Entity Recognition.",
                    "A Robust Risk Minimization based Named Entity Recognition System.",
                    "Memory-Based Named Entity Recognition using Unannotated Data."
                ]
            }
        ]
    },
    {
        "year": "2002",
        "name": "6th CoNLL 2002",
        "info": "Taipei, Taiwan",
        "venues": [
            {
                "sub_name_abbr": "conf/conll/2002",
                "sub_name": "Proceedings of the 6th Conference on Natural Language Learning, CoNLL 2002, Held in cooperation with COLING 2002, Taipei, Taiwan, 2002.",
                "count": 35,
                "papers": [
                    "Extracting the Unextractable: A Case Study on Verb-particles.",
                    "Language Independent Named Entity Classification by modified Transformation-based Learning and by Decision Tree Induction.",
                    "Statistical Named Entity Recognizer Adaptation.",
                    "Named Entity Extraction using AdaBoost.",
                    "Learning Attribute Values in Typed-unification Grammars: On Generalised Rule Reduction.",
                    "Bootstrapping a Multilingual Part-of-speech Tagger in One Person-day.",
                    "Language Independent NER using a Unified Model of Internal and Contextual Evidence.",
                    "A Very Very Large Corpus Doesn't Always Yield Reliable Estimates.",
                    "Cross-dataset Clustering: Revealing Corresponding Themes across Multiple Corpora.",
                    "Named Entity Recognition as a House of Cards: Classifier Stacking.",
                    "Combining Labelled and Unlabelled Data: A Case Study on Fisher Kernels and Transductive Inference for Biological Entity Recognition.",
                    "GraSp: Grammar Learning from Unlabelled Speech Corpora.",
                    "Named Entity Extraction with Conditional Markov Models and Classifiers.",
                    "On the Robustness of Entropy-Based Similarity Measures in Evaluation of Subcategorization Acquisition Systems.",
                    "Distinguishing Easy and Hard Instances.",
                    "Japanese Dependency Analysis using Cascaded Chunking.",
                    "Backward Machine Transliteration by Learning Phonetic Similarity.",
                    "A Comparison of Algorithms for Maximum Entropy Parameter Estimation.",
                    "Markov Models for Language-independent Named Entity Recognition.",
                    "Entity Extraction without Language-Specific Resources.",
                    "Letter Level Learning for Language Independent Diacritics Restoration.",
                    "SLINERC: The Sydney Language-Independent Named Entity Recogniser and Classifier.",
                    "Named Entity Learning and Verification: Expectation Maximization in Large Corpora.",
                    "Introduction to the CoNLL-2002 Shared Task: Language-Independent Named Entity Recognition.",
                    "Memory-Based Named Entity Recognition.",
                    "Inducing Translation Lexicons via Diverse Similarity Measures and Bridge Languages.",
                    "Features for Unsupervised Document Classification.",
                    "Two-dimensional Clustering for Text Categorization.",
                    "Use of Support Vector Machines in Extended Named Entity Recognition.",
                    "Feature Selection for a Rich HPSG Grammar Using Decision Trees.",
                    "Learning with Multiple Stacking for Named Entity Recognition.",
                    "Topological Field Chunking for German.",
                    "Learning to Distinguish PP Arguments from Adjuncts.",
                    "Learning to Disambiguate Potentially Subjective Expressions.",
                    "Boosting for Named Entity Recognition."
                ]
            }
        ]
    },
    {
        "year": "2001",
        "name": "5th CoNLL 2001",
        "info": "Toulouse, France",
        "venues": [
            {
                "sub_name_abbr": "conf/conll/2001",
                "sub_name": "Proceedings of the ACL 2001 Workshop on Computational Natural Language Learning, CoNLL 2001, Toulouse, France, July 6-7, 2001.",
                "count": 26,
                "papers": [
                    "Multidimensional transformation-based learning.",
                    "Combining a self-organising map with memory-based learning.",
                    "Learning class-to-class selectional preferences.",
                    "Semantic pattern learning through maximum entropy-based WSD technique.",
                    "Automatic verb classification using multilingual resources.",
                    "Exploring evidence for shallow parsing.",
                    "Probabilistic models for PP-attachment resolution and NP analysis.",
                    "Introduction to the CoNLL-2001 shared task: clause identification.",
                    "A mixture-of-experts framework for text classification.",
                    "On minimizing training corpus for parser acquisition.",
                    "Morpholog: Constrained and Supervised Learning of Morphology.",
                    "Learning Computational Grammars.",
                    "Unsupervised induction of stochastic context-free grammars using distributional clustering.",
                    "Distributional phrase structure induction.",
                    "Automatic distinction of arguments and modifiers: the case of prepositional phrases.",
                    "Learning to identify animate references.",
                    "Coreference resolution with syntactico-semantic rules and corpus statistics.",
                    "Inducing probabilistic invertible translation grammars from aligned texts.",
                    "Combining linguistic and machine learning techniques for email summarization.",
                    "A psychologically plausible and computationally effective approach to learning syntax.",
                    "Boosted decision graphs for NLP learning tasks.",
                    "Clause identification with long short-term memory.",
                    "Using ALLiS for clausing.",
                    "Memory-based clause identification.",
                    "Clause detection using HMM.",
                    "Boosting trees for clause splitting."
                ]
            }
        ]
    },
    {
        "year": "2000",
        "name": "4th CoNLL/LLL 2000",
        "info": "Lisbon, Portugal",
        "venues": [
            {
                "sub_name_abbr": "conf/conll/2000",
                "sub_name": "Fourth Conference on Computational Natural Language Learning, CoNLL 2000, and the Second Learning Language in Logic Workshop, LLL 2000, Held in cooperation with ICGI-2000, Lisbon, Portugal, September 13-14, 2000.",
                "count": 44,
                "papers": [
                    "Learning in Natural Language: Theory and Algorithmic Approaches.",
                    "Corpus-Based Grammar Specialization.",
                    "Pronunciation by Analogy in Normal and Impaired Readers.",
                    "The Role of Algorithm Bias vs Information Source in Learning Algorithms for Morphosyntactic Disambiguation.",
                    "Increasing our Ignorance' of Language: Identifying Language Structure in an Unknown 'Signal'.",
                    "A Comparison between Supervised Learning Algorithms for Word Sense Disambiguation.",
                    "Incorporating Position Information into a Maximum Entropy/Minimum Divergence Translation Model.",
                    "Memory-Based Learning for Article Generation.",
                    "Overfitting Avoidance for Stochastic Modeling of Attribute-Value Grammars.",
                    "Learning Distributed Linguistic Classes.",
                    "Modeling the Effect of Cross-Language Ambiguity on Human Syntax Acquisition.",
                    "Knowledge-Free Induction of Morphology Using Latent Semantic Analysis.",
                    "Using Induced Rules as Complex Features in Memory-Based Language Learning.",
                    "Using Perfect Sampling in Parameter Estimation of a Whole Sentence Maximum Entropy Language Model.",
                    "Experiments on Unsupervised Learning for Extracting Relevant Fragments from Spoken Dialog Corpus.",
                    "Generating Synthetic Speech Prosody with Lazy Learning in Tree Structures.",
                    "Inducing Syntactic Categories by Context Distribution Clustering.",
                    "ALLiS: a Symbolic Learning System for Natural Language Learning.",
                    "Combining Text and Heuristics for Cost-Sensitive Spam Filtering.",
                    "Genetic Algorithms for Feature Relevance Assignment in Memory-Based Language Processing.",
                    "Shallow Parsing by Inferencing with Classifiers.",
                    "Minimal Commitment and Full Lexical Disambiguation: Balancing Rules and Hidden Markov Models.",
                    "Learning IE Rules for a Set of Related Concepts.",
                    "A Default First Order Family Weight Determination Procedure for WPDV Models.",
                    "A Comparison of PCFG Models.",
                    "Introduction to the CoNLL-2000 Shared Task Chunking.",
                    "Learning Syntactic Structures with XML.",
                    "A Context Sensitive Maximum Likelihood Approach to Chunking.",
                    "Chunking with Maximum Entropy Models.",
                    "Use of Support Vector Learning for Chunk Identification.",
                    "Shallow Parsing as Part-of-Speech Tagging.",
                    "Improving Chunking by Means of Lexical-Contextual Information in Statistical Language Models.",
                    "Text Chunking by System Combination.",
                    "Chunking with WPDV Models.",
                    "Single-Classifier Memory-Based Phrase Chunking.",
                    "Phrase Parsing with Rule Sequence Processors: an Application to the Shared CoNLL Task.",
                    "Hybrid Text Chunking.",
                    "Extracting a Domain-Specific Ontology from a Corporate Intranet.",
                    "Learning from a Substructural Perspective.",
                    "Incorporating Linguistics Constraints into Inductive Logic Programming.",
                    "Learning from Parsed Sentences with INTHELEX.",
                    "Inductive Logic Programming for Corpus-Based Acquisition of Semantic Lexicons.",
                    "The Acquisition of Word Order by a Computational Learning System.",
                    "Recognition and Tagging of Compound Verb Groups in Czech."
                ]
            }
        ]
    },
    {
        "year": "1999",
        "name": "3rd CoNLL 1999",
        "info": "Bergen, Norway",
        "venues": [
            {
                "sub_name_abbr": "conf/conll/1999",
                "sub_name": "Proceedings of the 1999 Workshop on Computational Natural Language Learning, CoNLL-99, Held in cooperation with EACL'99, Bergen, Norway, June 12, 1999.",
                "count": 8,
                "papers": [
                    "Unsupervised Learning of Word Boundary with Description Length Gain.",
                    "Experiments in Unsupervised Entropy-Based Corpus Segmentation.",
                    "Practical Bootstrapping of Morphological Analyzers.",
                    "Finding Representations for Memory-Based Language Learning.",
                    "The µ-TBL System: Logic Programming Tools for Transformation-Based Learning.",
                    "Learning Transformation Rules to Find Grammatical Relations.",
                    "Memory-Based Shallow Parsing.",
                    "MDL-based DCG Induction for NP Identification."
                ]
            }
        ]
    },
    {
        "year": "1998",
        "name": "2nd CoNLL 1998",
        "info": "Sydney, NSW, Australia",
        "venues": [
            {
                "sub_name_abbr": "conf/conll/1998",
                "sub_name": "Proceedings of the Joint Conference on New Methods in Language Processing and Computational Natural Language Learning, NeMLaP/CoNLL 1998, Macquarie University, Sydney, NSW, Australia, January 11-17, 1998.",
                "count": 42,
                "papers": [
                    "Abstraction is Harmful in Language Learning.",
                    "Natural Language Learning by Recurrent Neural Networks: A Comparison with probabilistic approaches.",
                    "Learning a Lexicalized Grammar for German.",
                    "A Lexically-Intensive Algorithm for Domain-Specific Knowlegde Acquisition.",
                    "Look-Back and Look-Ahead in the Conversion of Hidden Markov Models into Finite State Transducers.",
                    "The effect of alternative tree epresentatmns on tree bank grammars.",
                    "Automation of Treebank Annotation.",
                    "Implementing a Sense Tagger in a General Architecture for Text Engineering.",
                    "Knowledge Extraction and Recurrent Neural Networks: An Analysis of an Elman Network trained on a Natural Language Learning Task.",
                    "Finding Structure via Compression.",
                    "Linguistic Theory in Statistical Language Learning.",
                    "A Bayesian Approach to Automating Argumentation.",
                    "Automatically generating hypertext in newspaper articles by computing semantic relatedness.",
                    "Choosing a Distance Metric for Automatic Word Categorization.",
                    "Sense Variation and Lexical Semantics Generative Operations.",
                    "An Attempt to Use Weighted Cusums to Identify Sublanguages.",
                    "Cross-Entropy and Linguistic Typology.",
                    "Applications and Explanations of Zipf's Law.",
                    "Proper Name Classification in an Information Extraction Toolset.",
                    "Evolution and Evaluation of Document Retrieval Queries.",
                    "Generatlon of Simple Turkish Sentences with Systemic-Functional Grammar.",
                    "Extracting Phoneme Pronunciation Information from Corpora.",
                    "Modularity in Inductively-Learned Word Pronunciation Systems.",
                    "Do Not Forget: Full Memory in Memory-Based Learning of Word Pronunciation.",
                    "Natural Language Concept Analysis.",
                    "The Present Use of Statistics in the Evaluation of NLP Parsers.",
                    "A Method of Incorporating Bigram Constraints into an LR Table and Its Effectiveness in Natural Language Processing.",
                    "Selective Attention and the Acquisition of Spatial Semantics.",
                    "Towards Language Acquisition by an Attention-Sharing Robot.",
                    "A Constructivist Approach to Machine Translation.",
                    "Shallow Post Morphological Processing with KURD.",
                    "Induction of a Stem Lexicon for Two-level Morphological Analysis.",
                    "Introducing MegaHAL.",
                    "Methods and tricks used in an attempt to pass the Turing Test.",
                    "The Total Turing Test and the Loebner Prize.",
                    "Language Model and Sentence Structure Manipulations for Natural Language Application Systems.",
                    "Position Paper on Appropriate Audio/Visual Turing Test.",
                    "Learning Feature-Value Grammars from Plain Text.",
                    "Morphemes as Necessary Concept for Structures Discovery from Untagged Corpora.",
                    "The segmentation problem in morphology learning.",
                    "Reconciliation of Unsupervised Clustering, Segmentation and Cohesion.",
                    "Syntactico-Semantic Learning of Categorial Grammars."
                ]
            }
        ]
    },
    {
        "year": "1997",
        "name": "1st CoNLL 1997",
        "info": "Madrid, Spain",
        "venues": [
            {
                "sub_name_abbr": "conf/conll/1997",
                "sub_name": "Proceedings of the 1997 Meeting of the ACL Special Interest Group in Natural Language Learning: Computational Natural Language Learning, CoNLL'97, Held in conjunction with the 1997 meeting of the Association for Computational Linguistics, Madrid, Spain, July 11, 1997.",
                "count": 16,
                "papers": [
                    "A Trainable Message Understanding System.",
                    "Relational Learning of Pattern-Match Rules for Information Extraction.",
                    "A Preliminary Study of Word Clustering Based on Syntactic Behavior.",
                    "Learning New Compositions from Given Ones.",
                    "A Statistical Decision Making Method: A Case Study on Prepositional Phrase Attachment.",
                    "Method for Improving Automatic Word Categorization.",
                    "From Psycholinguistic Modelling of Interlanguage in Second Language Acquisition to a Computational Model.",
                    "What makes a word: Learning base units in Japanese for speech recognition.",
                    "Evolution of a Rapidly Learned Representation for Speech.",
                    "Learning Stochastic Categorial Grammars.",
                    "Learning and Application of Differential Grammars.",
                    "Recurrent Neural-Network Learning of Phonological Regularities in Turkish.",
                    "Explanation-Based Learning of Data-Oriented Parsing.",
                    "Word Triggers and the EM Algorithm.",
                    "A Comparative Study of the Application of Different Learning Techniques to Natural Language Interfaces.",
                    "Resolving PP attachment Ambiguities with Memory-Based Learning."
                ]
            }
        ]
    }
]