[
    {
        "name": "Connection Science",
        "year": "2021",
        "info": "Volume 33: 2021",
        "count": 20,
        "papers": [
            "A sigmoid attractiveness based improved firefly algorithm and its applications in IIR filter design.",
            "Using machine learning techniques for DSP software performance prediction at source code level.",
            "A community partitioning algorithm based on network enhancement.",
            "Securing top-k query processing in two-tiered sensor networks.",
            "Analysing rumours spreading considering self-purification mechanism.",
            "Multi-Keyword ranked search based on mapping set matching in cloud ciphertext storage system.",
            "CASH: correlation-aware scheduling to mitigate soft error impact on heterogeneous multicores.",
            "A novel data representation framework based on nonnegative manifold regularisation.",
            "Extending emotional lexicon for improving the classification accuracy of Chinese film reviews.",
            "An edge streaming data processing framework for autonomous driving.",
            "The identification of influential nodes based on structure similarity.",
            "A novel image compression technology based on vector quantisation and linear regression prediction.",
            "Tyre pattern image retrieval - current status and challenges.",
            "ARP: asexual reproduction programming.",
            "Extracting road maps from high-resolution satellite imagery using refined DSE-LinkNet.",
            "Evolutionary computation for bottom-up hypothesis generation on emotion and communication.",
            "What is beautiful is not always good: influence of machine learning-derived photo attractiveness on intention to initiate social interactions in mobile dating applications.",
            "ClothGAN: generation of fashionable Dunhuang clothes using generative adversarial networks.",
            "An adaptive defense mechanism to prevent advanced persistent threats.",
            "Towards the cognitive and psychological perspectives of crowd behaviour: a vision-based analysis."
        ]
    },
    {
        "name": "Connection Science",
        "year": "2020",
        "info": "Volume 32: 2020",
        "count": 21,
        "papers": [
            "A modified deep neural network enables identification of foliage under complex background.",
            "Hybrid self-inertia weight adaptive particle swarm optimisation with local search using C4.5 decision tree classifier for feature selection problems.",
            "A fuzzy irregular cellular automata-based method for the vertex colouring problem.",
            "Fractional power series neural network for solving delay fractional optimal control problems.",
            "A methodology to forecast some attributes of an automatic storyteller's outputs.",
            "CNN-based salient features in HSI image semantic target prediction.",
            "An improved water wave optimisation algorithm enhanced by CMA-ES and opposition-based learning.",
            "Hand segmentation pipeline from depth map: an integrated approach of histogram threshold selection and shallow CNN classification.",
            "Improving collective interpretation by extended potentiality assimilation for multi-layered neural networks.",
            "Sexbots: a case for artificial ethical agents.",
            "Feature extraction method based on point pair hierarchical clustering.",
            "A note on the exclusion operator in multi-swarm PSO algorithms for dynamic environments.",
            "Cognitive instabilities under contention, friction, and the fog-of-war challenge the AI revolution.",
            "Digital Confucius? Exploring the implications of artificial intelligence in spiritual education.",
            "Conditions for cognitive self-organisation implied by visual-word processing.",
            "A novel particle swarm optimisation with mutation breeding.",
            "Synchronisation of 6D hyper-chaotic system with unknown parameters in the presence of disturbance and parametric uncertainty with unknown bounds.",
            "A connectionist account of the relational shift and context sensitivity in the development of generalisation.",
            "CG-Art: demystifying the anthropocentric bias of artistic creativity.",
            "Binary atom search optimisation approaches for feature selection.",
            "Content-based image retrieval using block truncation coding based on edge quantization."
        ]
    },
    {
        "name": "Connection Science",
        "year": "2019",
        "info": "Volume 31: 2019",
        "count": 18,
        "papers": [
            "Editorial.",
            "Towards transformational creation of novel songs.",
            "Dynamic emphatical narration for reduced authorial burden and increased user freedom in interactive storytelling.",
            "Experience evaluations for human-computer co-creative processes - planning and conducting an evaluation in practice.",
            "Information management in interactive and non-interactive suspenseful storytelling.",
            "Learning from data streams and class imbalance.",
            "Learning in presence of class imbalance and class overlapping by using one-class SVM and undersampling technique.",
            "A weighted pattern matching approach for classification of imbalanced data with a fireworks-based algorithm for feature selection.",
            "Semantic segmentation of high-resolution remote sensing images using fully convolutional network with adaptive threshold.",
            "Adaptive learning on mobile network traffic data.",
            "TS-WRSVM: twin structural weighted relaxed support vector machine.",
            "Novel fruit fly algorithm for global optimisation and its application to short-term wind forecasting.",
            "Combining evolutionary computation with the variable neighbourhood search in creating an artificial music composer.",
            "Multi-objective clustering: a kernel based approach using Differential Evolution.",
            "Fuzzy kernel feature selection with multi-objective differential evolution algorithm.",
            "Solving optimal control problems of the time-delayed systems by a neural network framework.",
            "Event-triggered H∞ anti-synchronisation for delayed neural networks with discontinuous neuron activations via non-fragile control strategy.",
            "Exploring the usability of the text-based CAPTCHA on tablet computers."
        ]
    },
    {
        "name": "Connection Science",
        "year": "2018",
        "info": "Volume 30: 2018",
        "count": 19,
        "papers": [
            "Learning and adaptation: neural and behavioural mechanisms behind behaviour change.",
            "A computational model of pupil dilation.",
            "A unified dynamic neural field model of goal directed eye movements.",
            "How infants' reaches reveal principles of sensorimotor decision making.",
            "Socially grounded game strategy enhances bonding and perceived smartness of a humanoid robot.",
            "Interactive natural language acquisition in a multi-modal recurrent neural architecture.",
            "The importance of situation-specific encodings: analysis of a simple connectionist model of letter transposition effects.",
            "Navigation through unknown and dynamic open spaces using topological notions.",
            "Signalling chains with probe and adjust learning.",
            "Two analogy strategies: the cases of mind metaphors and introspection.",
            "Improving harmony search algorithms by using tonal variation: the case of Sudoku and MKP.",
            "An Interleaved Artificial Bee Colony algorithm for dynamic optimisation problems.",
            "A spiking half-cognitive model for classification.",
            "Improving interactive reinforcement learning: What makes a good teacher?",
            "Optimisation of engineering system using a novel search algorithm: the Spacing Multi-Objective Genetic Algorithm.",
            "The effects of robot facial emotional expressions and gender on child-robot interaction in a field study.",
            "Elitism-based multi-objective differential evolution with extreme learning machine for feature selection: a novel searching technique.",
            "Simplified cerebellum-like spiking neural network as short-range timing function for the talking robot.",
            "Enriching the random subspace method with margin theory - a solution for the high-dimensional classification task."
        ]
    },
    {
        "name": "Connection Science",
        "year": "2017",
        "info": "Volume 29: 2017",
        "count": 36,
        "papers": [
            "Preface to the special issue: embodied cognition, acting and performance.",
            "Transdisciplinary and interdisciplinary exchanges between embodied cognition and performance practice: working across disciplines in a climate of divisive knowledge cultures.",
            "Autopoiesis, creativity and dance.",
            "Embodiment: a cross-disciplinary provocation.",
            "Stanislavsky's system as an enactive guide to embodied cognition?",
            "Reverse engineering the human: artificial intelligence and acting theory.",
            "An earned presence: studying the effect of multi-task improvisation systems on cognitive and learning capacity.",
            "The embodied performance pedagogy of Jacques Lecoq.",
            "Theory, practice and performance.",
            "Ethical principles of robotics.",
            "Principles of robotics: regulating robots in the real world.",
            "The meaning of the EPSRC principles of robotics.",
            "Legal vs. ethical obligations - a comment on the EPSRC's principles for robotics.",
            "Robots are not just tools.",
            "EPSRC Principles of Robotics: defending an obsolete human(ism)?",
            "Reflections on the EPSRC Principles of Robotics from the new far-side of the law.",
            "EPSRC Principles of Robotics: commentary on safety, robots as products, and responsibility.",
            "Why robots should not be delegated with the decision to kill.",
            "Editorial: Ethical Principles of Robotics.",
            "Autonomous intelligent cars: proof that the EPSRC Principles are future-proof.",
            "\"I spy, with my little sensor\": fair data handling practices for robots between privacy, copyright and security.",
            "Can robots be responsible moral agents? And why should we care?",
            "Second thoughts about privacy, safety and deception.",
            "Vulnerable users: deceptive robotics.",
            "Designing and implementing transparency for real time inspection of autonomous robots.",
            "Robot transparency, trust and utility.",
            "Analysis of the EPSRC Principles of Robotics in regard to key research topics.",
            "Rapporteur's report.",
            "Editorial.",
            "Is deep dreaming the new collage?",
            "Swarmic autopoiesis and computational creativity.",
            "A computational model of the cognitive impact of decorative elements on the perception of suspense.",
            "Sparks Will Fly: engineering creative script conflicts.",
            "Has computational creativity successfully made it \"Beyond the Fence\" in musical theatre?",
            "Towards a computational- and algorithmic-level account of concept blending using analogies and amalgams.",
            "Editorial Board."
        ]
    },
    {
        "name": "Connection Science",
        "year": "2016",
        "info": "Volume 28: 2016",
        "count": 23,
        "papers": [
            "Self-organised manifold learning and heuristic charting via adaptive metrics.",
            "Driver's drowsiness detection using an enhanced image processing technique inspired by the human visual system.",
            "Artificial immune system based on adaptive clonal selection for feature selection and parameters optimisation of support vector machines.",
            "Game level layout generation using evolved cellular automata.",
            "What makes virtual agents believable?",
            "Editorial.",
            "Constrained creation of poetic forms during theme-driven exploration of a domain defined by an N-gram model.",
            "Skills and the appreciation of computer art.",
            "Grounded for life: creative symbol-grounding for lexical invention.",
            "Analysis of information gain and Kolmogorov complexity for structural evaluation of cellular automata configurations.",
            "On evil and computational creativity.",
            "Four PPPPerspectives on computational creativity in theory and in practice.",
            "Visceral obesity and psychosocial stress: a generalised control theory model.",
            "Word sense disambiguation in evolutionary manner.",
            "Merging subsets of attributes to improve a hybrid consistency-based filter: a case of study in product unit neural networks.",
            "Maximum saliency bias in binocular fusion.",
            "Investigation on particle swarm optimisation for feature selection on high-dimensional data: local search and selection bias.",
            "Construction of a pulse-coupled dipole network capable of fear-like and relief-like responses.",
            "A ganglion-cell-based primary image representation method and its contribution to object recognition.",
            "Connected word recognition using a cascaded neuro-computational model.",
            "A neural implementation of Bayesian inference based on predictive coding.",
            "An encounter between 4e cognition and attachment theory.",
            "Musicking, embodiment and participatory enaction of music: outline and key points."
        ]
    },
    {
        "name": "Connection Science",
        "year": "2015",
        "info": "Volume 27: 2015",
        "count": 27,
        "papers": [
            "Editorial.",
            "Editorial.",
            "Solving scheduling tournament problems using a new version of CLONALG.",
            "Global-local population memetic algorithm for solving the forward kinematics of parallel manipulators.",
            "Improving visualisation and prediction performance of supervised self-organising map by modified contradiction resolution.",
            "Anticipation by multi-modal association through an artificial mental imagery process.",
            "Evolution of cooperation driven by the diversity of emotions.",
            "Introduction to cognitive artificial systems.",
            "Using a cognitive architecture for general purpose service robot control.",
            "Discriminating and simulating actions with the associative self-organising map.",
            "A knowledge-based system for prototypical reasoning.",
            "Approaching neuropsychological tasks through adaptive neurorobots.",
            "Crowd dynamics of behavioural intention: train station and museum case studies.",
            "Towards oscillations-based simulation of social systems: a neurodynamic approach.",
            "Preface to the special issue: Adaptive Learning Agents Part 3.",
            "A reinforcement learning model of joy, distress, hope and fear.",
            "Distributed reinforcement learning for adaptive and robust network intrusion response.",
            "Trading in markets with noisy information: an evolutionary analysis.",
            "Simulation of the introduction of new technologies in air traffic management.",
            "Evolving effective behaviours to interact with tag-based populations.",
            "A new fuzzy C-means method for magnetic resonance image brain segmentation.",
            "Active glass-type human augmented cognition system considering attention and intention.",
            "Structure and weights optimisation of a modified Elman network emotion classifier using hybrid computational intelligence algorithms: a comparative study.",
            "Modeling development of natural multi-sensory integration using neural self-organisation and probabilistic population codes.",
            "Nature-inspired computing approach for solving non-linear singular Emden-Fowler problem arising in electromagnetic theory.",
            "Evolving unipolar memristor spiking neural networks.",
            "Promotion of cooperation in social dilemma games via generalised indirect reciprocity."
        ]
    },
    {
        "name": "Connection Science",
        "year": "2014",
        "info": "Volume 26: 2014",
        "count": 25,
        "papers": [
            "Editorial.",
            "Preface to the special issue: Adaptive Learning Agents, Part 1.",
            "A parallel framework for Bayesian reinforcement learning.",
            "Design and optimisation of a (FA)Q-learning-based HTTP adaptive streaming client.",
            "Reinforcement learning agents providing advice in complex video games.",
            "Distributed learning and multi-objectivity in traffic light control.",
            "A comparison of plan-based and abstract MDP reward shaping.",
            "Preface to the special issue: Adaptive Learning Agents Part 2.",
            "A framework for learning and planning against switching strategies in repeated games.",
            "Discovery, utilisation and analysis of credible threats for 2×2 incomplete information games in the Theory of Moves framework.",
            "On the rationality of cycling in the Theory of Moves framework.",
            "The limits and robustness of reinforcement learning in Lewis signalling games.",
            "Theoretical results on the effect of 'shortcut' actions in MDPs.",
            "Solution of the one-dimensional Bratu equation arising in the fuel ignition model using ANN optimised with PSO and SQP.",
            "Improving feature ranking for biomarker discovery in proteomics mass spectrometry data using genetic programming.",
            "Enhanced risk management by an emerging multi-agent architecture.",
            "On the identification and establishment of topological spatial relations by autonomous systems.",
            "Can the revolution be optimised? Oh yes it can! But, maybe not. Report on the one day symposium on \"Varieties of Enactivism\".",
            "In search of intelligence: evolving a developmental neuron capable of learning.",
            "Imbalanced data classification via support vector machines and genetic algorithms.",
            "Multi-objective optimal design of online PID controllers using model predictive control based on the group method of data handling-type neural networks.",
            "Direct back propagation neural dynamic programming-based particle swarm optimisation.",
            "The role of selective attention and action selection in the development of multiple action capabilities.",
            "A new design for reconfigurable XOR function based on cellular neural networks.",
            "Dynamic statistical models of biological cognition: insights from communications theory."
        ]
    },
    {
        "name": "Connection Science",
        "year": "2013",
        "info": "Volume 25: 2013",
        "count": 10,
        "papers": [
            "Computational models of location-invariant orthographic processing.",
            "An emergent approach to analogical inference.",
            "The role of perceived interactivity in virtual communities: building trust and increasing stickiness.",
            "A novel artificial immune clonal selection classification and rule mining with swarm learning model.",
            "A novel graph computation technique for multi-dimensional curve fitting.",
            "Tracking control of two-wheel driven mobile robot using compound sine function neural networks.",
            "Using modified fruit fly optimisation algorithm to perform the function test and case studies.",
            "Sentiment analysis of Chinese microblogging based on sentiment ontology: a case study of '7.23 Wenzhou Train Collision'.",
            "Probabilistic region growing method for improving magnetic resonance image segmentation.",
            "Hybrid evolutionary techniques in feed forward neural network with distributed error for classification of handwritten Hindi 'SWARS'."
        ]
    },
    {
        "name": "Connection Science",
        "year": "2012",
        "info": "Volume 24: 2012",
        "count": 9,
        "papers": [
            "Processing of nested and cross-serial dependencies: an automaton perspective on SRN behaviour.",
            "Strong systematicity through sensorimotor conceptual grounding: an unsupervised, developmental approach to connectionist sentence processing.",
            "Robust manifold learning with CycleCut.",
            "Programming in the brain: a neural network theoretical framework.",
            "A multi-objective particle swarm optimisation for filter-based feature selection in classification problems.",
            "Genetic programming for detecting target motions.",
            "Sensorimotor coordination and metastability in a situated HKB model.",
            "Macroscopic definition of distributed swarm morphogenesis.",
            "Emergent latent symbol systems in recurrent neural networks."
        ]
    },
    {
        "name": "Connection Science",
        "year": "2011",
        "info": "Volume 23: 2011",
        "count": 18,
        "papers": [
            "Can self-organisation emerge through dynamic neural fields computation?",
            "New algorithm for efficient pattern recall using a static threshold with the Steinbuch Lernmatrix.",
            "An evolutionary performance-enhanced PSO approach by using a BP neural-learning-based PID controller.",
            "Using unsupervised incremental learning to cope with gradual concept drift.",
            "Compositional connectionism in cognitive science II: the localist/distributed dimension.",
            "What is a grandmother cell? And how would you know if you found one?",
            "Compositional connectionist structures based on in situ grounded representations.",
            "Getting symbols out of a neural architecture.",
            "Generalisation benefits of output gating in a model of prefrontal cortex.",
            "Preventing combinatorial explosion in a localist, neural network architecture using temporal synchrony.",
            "Neural representations of compositional structures: representing and manipulating vector spaces with spiking neurons.",
            "Local or distributed activation? The view from biology.",
            "A PDP model of the simultaneous perception of multiple objects.",
            "Analysis and synthesis of Cohen-Grossberg networks with asymmetric connections.",
            "Using genetic programming for context-sensitive feature scoring in classification problems.",
            "An old-fashioned connectionist approach to a Cajun chord change problem.",
            "Multiple-resolution classification with combination of density estimators.",
            "Kinematic motor learning."
        ]
    },
    {
        "name": "Connection Science",
        "year": "2010",
        "info": "Volume 22: 2010",
        "count": 19,
        "papers": [
            "The classification game: combining supervised learning and language evolution.",
            "Learning location-invariant orthographic representations for printed words.",
            "Modelling social interaction as perceptual crossing: an investigation into the dynamics of the interaction process.",
            "A simulation study exploring the role of cultural transmission in language evolution.",
            "A cascaded neuro-computational model for spoken word recognition.",
            "Drum-mate: interaction dynamics and gestures in human-humanoid drumming experiments.",
            "Sentence-processing in echo state networks: a qualitative analysis by finite state machine extraction.",
            "An attention-gating recurrent working memory architecture for emergent speech representation.",
            "The role of cue information in the outcome-density effect: evidence from neural network simulations and a causal learning experiment.",
            "Affective robotics - modelling emotion and motivation.",
            "Periodic activations of behaviours and emotional adaptation in behaviour-based robotics.",
            "The roles of the amygdala in the affective regulation of body, brain, and behaviour.",
            "Towards a cognitive robotics methodology for reward-based decision-making: dynamical systems modelling of the Iowa Gambling Task.",
            "Incremental learning of Bayesian sensorimotor models: from low-level behaviours to large-scale structure of the environment.",
            "A model of primate visual cortex based on category-specific redundancies in natural images.",
            "Categorisation through evidence accumulation in an active vision system.",
            "Support-vector-based emergent self-organising approach for emotional understanding.",
            "An efficient MLP-learning algorithm using parallel tangent gradient and improved adaptive learning rates.",
            "The sad loss of an editorial board member."
        ]
    },
    {
        "name": "Connection Science",
        "year": "2009",
        "info": "Volume 21: 2009",
        "count": 21,
        "papers": [
            "Connection Science gets the key of the door.",
            "Place cognition and active perception: a study with evolved robots.",
            "The dual-route hypothesis: evaluating a neurocomputational model of fear conditioning in rats.",
            "Predictive models in the brain.",
            "The importance of low spatial frequency information for recognising fearful facial expressions.",
            "Trends and perspectives in music cognition research and technology.",
            "Information dynamics: patterns of expectation and surprise in the perception of music.",
            "What/when causal expectation modelling applied to audio signals.",
            "Genre classification using chords and stochastic language models.",
            "GLM and SVM analyses of neural response to tonal and atonal stimuli: new techniques and a comparison.",
            "From frequency to pitch, and from pitch class to musical key: shared principles of learning and perception.",
            "Model cortical responses for the detection of perceptual onsets and beat tracking in singing.",
            "Analysing musical performance through functional data analysis: rhythmic structure in Schumann's Träumerei.",
            "Exploiting functional relationships in musical composition.",
            "Predictive models for music.",
            "Manipulating space: modelling the role of transient dynamics in inattentional blindness.",
            "DiPRA: a layered agent architecture which integrates practical reasoning and sensorimotor schemas.",
            "Variable binding by synaptic strength change.",
            "Artificial neural networks whispering to the brain: nonlinear system attractors induce familiarity with never seen items.",
            "Mathematical theology.",
            "GLM and SVM analyses of neural response to tonal and atonal stimuli: new techniques and a comparison."
        ]
    },
    {
        "name": "Connection Science",
        "year": "2008",
        "info": "Volume 20: 2008",
        "count": 19,
        "papers": [
            "A constrained neural learning rule for eliminating the border effect in online self-organising maps.",
            "Computational memory architectures for autobiographic agents interacting in a complex virtual environment: a working model.",
            "Social learning in embodied agents.",
            "Social coordination in toddler's word learning: interacting systems of perception and action.",
            "Experiments in socially guided exploration: lessons learned in building robots that learn with and without human teachers.",
            "Teaching robot companions: the role of scaffolding and event structuring.",
            "Exploring social structure effect on language evolution based on a computational model.",
            "Joint attention and language evolution.",
            "Flexible word meaning in embodied agents.",
            "Optimisation of a honeybee-colony's energetics via social learning based on queuing delays.",
            "On the design of neuro-controllers for individual and social learning behaviour in autonomous robots: an evolutionary approach.",
            "Beyond the individual: new insights on language, cognition and robots.",
            "Circuit sharing and the implementation of intelligent systems.",
            "Object schemas for grounding language in a responsive robot.",
            "Open-ended category learning for language acquisition.",
            "Spoken language interaction with model uncertainty: an adaptive human-robot interaction system.",
            "Towards an investigation of speech energetics using 'AnTon': an animatronic model of a human tongue and vocal tract.",
            "The robot in the mirror.",
            "Robots - the new linguistic informants?"
        ]
    },
    {
        "name": "Connection Science",
        "year": "2007",
        "info": "Volume 19: 2007",
        "count": 19,
        "papers": [
            "Creating hierarchical categories using cell assemblies.",
            "Automated cross-modal mapping in robotic eye/hand systems using plastic radial basis function networks.",
            "Emergence of communication in embodied agents evolved for the ability to solve a collective navigation problem.",
            "Neuroscientific implications for situated and embodied artificial intelligence.",
            "Synchronous versus conjunctive binding: a false dichotomy?",
            "Prosodic alignment in human-computer interaction.",
            "How contingent should a lifelike robot be? The relationship between contingency and complexity.",
            "Efficient architectures for sparsely-connected high capacity associative memory models.",
            "Variations of the two-spiral task.",
            "A computational approach to negative priming.",
            "A systematic comparison of flat and standard cascade-correlation using a student-teacher network approximation task.",
            "Swarm robotics and minimalism.",
            "Analysis-adjustment-synthesis networks.",
            "Special Issue on Evolutionary Learning and Optimisation.",
            "A novel and practicable on-chip adaptive lossless image compression scheme using intrinsic evolvable hardware.",
            "Combining Bayesian classifiers and estimation of distribution algorithms for optimization in continuous domains.",
            "Learning classifier system ensemble and compact rule set.",
            "Towards unbiased benchmarking of evolutionary and hybrid algorithms for real-valued optimisation.",
            "A linear structured approach and a refined fitness function in genetic programming for multi-class object classification."
        ]
    },
    {
        "name": "Connection Science",
        "year": "2006",
        "info": "Volume 18: 2006",
        "count": 27,
        "papers": [
            "Temporal sequence detection with spiking neurons: towards recognizing robot language instructions.",
            "Stack-like and queue-like dynamics in recurrent neural networks.",
            "Reuse of information in multi-layer sigma-pi neural networks.",
            "Phase plot manifestations in globally coupled maps: effects of scale.",
            "Synaptic noise as a means of implementing weight-perturbation learning.",
            "Introduction to developmental robotics.",
            "Towards autonomous sensor and actuator model induction on a mobile robot.",
            "From unknown sensors and actuators to actions grounded in sensorimotor perceptions.",
            "Bootstrap learning of foundational representations.",
            "Developing navigation behavior through self-organizing distinctive-state abstraction.",
            "Developmental robotics, optimal artificial curiosity, creativity, music, and the fine arts.",
            "Discovering communication.",
            "Decomposing infants' object representations: A dual-route processing account.",
            "Learning acceptable windows of contingency.",
            "Learning through experience: an emergent connectionist account of letter production behaviour.",
            "High capacity, small world associative memory models.",
            "Lexical and syntactic structures in a connectionist model of reading multi-digit numbers.",
            "Learn more by training less: systematicity in sentence processing by recurrent networks.",
            "Introduction to the special issue on android science.",
            "Android science: conscious and subconscious recognition.",
            "The social body in motion: cognitive development in infants and androids.",
            "Relational artifacts with children and elders: the complexities of cybercompanionship.",
            "What baboons, babies and Tetris players tell us about interaction: a biosocial view of norm-based social learning.",
            "Humanlike conversation with gestures and verbal cues based on a three-layer attention-drawing model.",
            "Android science and animal rights, does an analogy exist?",
            "Empathy, androids and 'authentic experience'.",
            "Exploratory studies on social spaces between humans and a mechanical-looking robot."
        ]
    },
    {
        "name": "Connection Science",
        "year": "2005",
        "info": "Volume 17: 2005",
        "count": 21,
        "papers": [
            "Computational and biological perspectives on the problem of navigation.",
            "Reflections on geometry and navigation.",
            "Featureless robot navigation using optical flow.",
            "Biologically plausible visual homing methods based on optical flow techniques.",
            "Beyond familiar landmarks and integrated routes: goal-oriented navigation by birds.",
            "Navigation without landmarks: Can rats use a sense of direction to return to a home site?",
            "A biophysical implementation of a bidirectional graph search algorithm to solve multiple goal navigation tasks.",
            "Lost in time: rats are unable to return to a start location that varies.",
            "Competition between cue response and place response: a model of rat navigation behaviour.",
            "The emergence of language: neural and adaptive agent models.",
            "The emergence of linguistic form in time.",
            "The emergence and evolution of linguistic structure: from lexical to grammatical communication systems.",
            "Emergence of communication in embodied agents: co-adapting communicative and non-communicative behaviours.",
            "Simple models of distributed co-ordination.",
            "The origins of syntax: from navigation to language.",
            "Emergence of grammatical constructions: evidence from simulation and grounded agent experiments.",
            "How can we explain the emergence of a language that benefits the hearer but not the speaker?",
            "The self-organization of combinatoriality and phonotactics in vocalization systems.",
            "Static mental representations in recurrent neural networks for the control of dynamic behavioural sequences.",
            "Modelling language development and evolution with the benefit of hindsight.",
            "The emergence of links between lexical acquisition and object categorization: a computational study."
        ]
    },
    {
        "name": "Connection Science",
        "year": "2004",
        "info": "Volume 16: 2004",
        "count": 24,
        "papers": [
            "Spatial navigation model based on chaotic attractor networks.",
            "Lack of combinatorial productivity in language processing with simple recurrent networks.",
            "High capacity associative memories and connection constraints.",
            "A categorical approach to affective gesture recognition.",
            "Self-refreshing memory in artificial neural networks: learning temporal sequences without catastrophic forgetting.",
            "Differential retroactive interference in humans following exposure to structured or unstructured learning material: a single distributed neural network account.",
            "Conducting banding analysis with trained networks of sigmoid units.",
            "Improving feature extraction performance of greedy network-growing algorithm by inverse euclidean distance.",
            "Where infants look when impossible things happen: simulating and testing a gaze-direction model.",
            "A special issue on 'Navigation'.",
            "A special issue on 'the emergence of language: neural and adaptive agent models'.",
            "A real-time robotic model of human reference resolution using visual constraints.",
            "Macroscopic analysis of robot foraging behaviour.",
            "Evolving internal memory for T-maze tasks in noisy environments.",
            "Multiple instantiation and rule mediation in SHRUTI.",
            "Book review.",
            "Editorial: Evolutionary robotics: looking forward.",
            "Toward open-ended evolutionary robotics: evolving elementary robotic units able to self-assemble and self-reproduce.",
            "Structure and function of evolved neuro-controllers for autonomous robots.",
            "Evolving an action-based mechanism for the interpretation of geometrical clues during robot navigation.",
            "Simulating autonomous coupling in discrimination of light frequencies.",
            "'Feeling' the flow of time through sensorimotor co-ordination.",
            "Internal robotics.",
            "Evolving cognitive scaffolding and environment adaptation: a new research direction for evolutionary robotics."
        ]
    },
    {
        "name": "Connection Science",
        "year": "2003",
        "info": "Volume 15: 2003",
        "count": 16,
        "papers": [
            "Editorial.",
            "Information theoretic competitive learning in self-adaptive multi-layered networks.",
            "redefining the rules: providing race models with a connectionist learning rule.",
            "Control of consolidation in neural networks: avoiding runaway effects.",
            "improved self-organization with an alternative inhibition gradient in calmmap networks.",
            "A modular approach to self-organization of robot control based on language instruction.",
            "A defence of functional modularity.",
            "Teacher-directed learning: information-theoretic competitive learning in supervised multi-layered networks.",
            "Epigenetic robotics - modelling cognitive development in robotic systems.",
            "Developmental robotics: a survey.",
            "What should a robot learn from an infant? Mechanisms of action interpretation and observational learning in infancy.",
            "A constructive model for the development of joint attention.",
            "Distributed, predictive perception of actions: a biologically inspired robotics architecture for imitation and learning.",
            "A constructivist approach to infants' vowel acquisition through mother-infant interaction.",
            "A categorical approach to affective gesture recognition.",
            "Where infants look when impossible things happen: simulating and testing a gaze-direction model."
        ]
    },
    {
        "name": "Connection Science",
        "year": "2002",
        "info": "Volume 14: 2002",
        "count": 18,
        "papers": [
            "A connectionist approach to processing dimensional interaction.",
            "Connectionist learning: a comparison of neural networks and an optical thin-film multilayer model.",
            "The cultural evolution of communication in a population of neural networks.",
            "A corpus-based connectionist architecture for large-scale natural language parsing.",
            "Dynamic interaction of attractors across multiple cortical networks as a neural basis for intersensory facilitation.",
            "Greedy information acquisition algorithm: a new information theoretic approach to dynamic information acquisition in neural networks.",
            "Swarm Intelligence: From Natural to Artificial Systems.",
            "Introduction to the special issue on agent autonomy in groups.",
            "Issues of trust and control on agent autonomy.",
            "Quantifying the search space for multi-agent system decision-making organizations.",
            "Respective demands of task and function allocation on human-machine co-operation design: a psychological approach.",
            "On the use of the multimodal clues in human behaviour for the modelling of agent co-operative behaviour.",
            "Providing social scaffolding for effective agent communities.",
            "A model of absolute autonomy and power: toward group effects.",
            "Effect of individual opinions on group interactions.",
            "Self-organization and adjustable autonomy: two sides of the same coin?",
            "Supporting group interaction among humans and autonomous agents.",
            "A large-scale multi-agent system for navy personnel distribution."
        ]
    },
    {
        "name": "Connection Science",
        "year": "2001",
        "info": "Volume 13: 2001",
        "count": 11,
        "papers": [
            "Pictorial reasoning with cell assemblies.",
            "Knowledge-based cascade-correlation: using knowledge to speed learning.",
            "Syntactic systematicity arising from semantic predictions in a Hebbian-competitive network.",
            "Binding and multiple instantiation in a distributed network of spiking nodes.",
            "Shaping: a multiple contingencies analysis and its relevance to behaviour-based robotics.",
            "Position-specific effects within the SERIOL framework of letter-position coding.",
            "Retroactive interference in neural networks and in humans: the effect of pattern-based learning.",
            "A critique of connectionist semantics.",
            "Novelty-dependent learning and topological mapping.",
            "Flexible feature discovery and structural information control.",
            "Activation and coherence in memory processes: revisiting the Parallel Distributed Processing approach to retrieval."
        ]
    },
    {
        "name": "Connection Science",
        "year": "2000",
        "info": "Volume 12: 2000",
        "count": 14,
        "papers": [
            "Neural networks with a self-refreshing memory: knowledge transfer in sequential learning tasks without catastrophic forgetting.",
            "A behaviour instantiation agent architecture.",
            "Constituent similarity and systematicity: the limits of first-order connectionism.",
            "An exploration of a new paradigm for weightless RAM-based neural networks.",
            "Turning the tables on the Turing test: the Spivey test.",
            "Cognition and the computational power of connectionist networks.",
            "Semantic systematicity and context in connectionist networks.",
            "From robotic toil to symbolic theft: grounding transfer from entry-level to higher-level categories1.",
            "The foundations of connectionist computation.",
            "Context-free and context-sensitive dynamics in recurrent neural networks.",
            "Artificial motives: a review of motivation in artificial creatures.",
            "Visual illusions, solid/outline invariance and non-stationary activity patterns.",
            "Distributed representations for extended syntactic transformation.",
            "The use of confidence measures to enhance combination strategies in multi-network neuro-fuzzy systems."
        ]
    },
    {
        "name": "Connection Science",
        "year": "1999",
        "info": "Volume 11: 1999",
        "count": 16,
        "papers": [
            "A Recurrent Neural Network that Learns to Count.",
            "B-RAAM: A Connectionist Model which Develops Holistic Internal Representations of Symbolic Structures.",
            "Single Neuron Rational Model of Arithmetic and Logic Operations.",
            "A Topological Semantics for Rule Extraction with Neural Networks.",
            "Extracting Regularities in Space and Time Through a Cascade of Prediction Networks: The Case of a Mobile Robot Navigating in a Structured Environment.",
            "Development of Children's Seriation: A Connectionist Approach.",
            "Meter as Mechanism: A Neural Network Model that Learns Metrical Patterns.",
            "Guest Editorial: On Adaptive Robots.",
            "Evolution of Neural Controllers for Locomotion and Obstacle Avoidance in a Six-legged Robot.",
            "Learning Perception for Indoor Robot Navigation with a Hybrid Hidden Markov Model/Recurrent Neural Networks Approach.",
            "Dynamic Update of the Reinforcement Function During Learning.",
            "A Neural Gripper for Arbitrary Object Grasping.",
            "Towards Genetically Evolved Dynamic Control for Quadruped Locomotion.",
            "Elegant Stepping: A Model of Visually Triggered Gait Adaptation.",
            "Competitive Learning and its Application in Adaptive Vision for Autonomous Mobile Robots.",
            "A Multi-robot System for Adaptive Exploration of a Fast-changing Environment: Probabilistic Modeling and Experimental Study."
        ]
    },
    {
        "name": "Connection Science",
        "year": "1998",
        "info": "Volume 10: 1998",
        "count": 19,
        "papers": [
            "Holistic Computation: Reconstructing a Muddled Concept.",
            "Analysis of Hidden Representations by Greedy Clustering.",
            "Internal Sigmoid Dynamics in Feedforward Neural Networks.",
            "The Emergence of a 'Language' in an Evolving Population of Neural Networks.",
            "Recovery of Unrehearsed Items in Connectionist Models.",
            "Catastrophic Forgetting and the Pseudorehearsal Solution in Hopfield-type Networks.",
            "Are Feedforward and Recurrent Networks Systematic? Analysis and Implications for a Connectionist Cognitive Architecture.",
            "Editorial: Biorobotics.",
            "Evolutionary Robotics: Exploiting the Full Power of Self-organization.",
            "Better Living Through Chemistry: Evolving GasNets for Robot Control.",
            "Evolution and Development of Modular Control Architectures for 1D Locomotion in Six-legged Animats.",
            "Construction of a Hexapod Robot with Cockroach Kinematics Benefits both Robotics and Biology.",
            "Rapid Navigational Learning in Insects with a Short Lifespan.",
            "Mammalian Navigation, Neural Models and Biorobotics.",
            "Using a Mobile Robot to Test a Model of the Rat Hippocampus.",
            "Cerebellar Control of Robot Arms.",
            "Shaping: The Link Between Rats and Robots.",
            "Incremental Robot Shaping.",
            "A Consideration of the Biological and Psychological Foundations of Autonomous Robotics."
        ]
    },
    {
        "name": "Connection Science",
        "year": "1997",
        "info": "Volume 9: 1997",
        "count": 20,
        "papers": [
            "Modularity, Combining and Artificial Neural Nets.",
            "Self-organization of Multiple Winner-take-all Neural Networks.",
            "Speaker Normalization and Model Selection of Combined Neural Networks.",
            "Hybridization and Specialization of Real-time Recurrent Learning-based Neural Networks.",
            "Modular Neural Networks for Medical Prognosis: Quantifying the Benefits of Combining Neural Networks for Survival Prediction.",
            "Adaptive Resonance Theory-based Modular Networks for Incremental Learning of Hierarchical Clusterings.",
            "Combining Neural Network Forecasts on Wavelet-transformed Time Series.",
            "Adaptation of Learning Rule Parameters Using a Meta Neural Network.",
            "(S)RAAM: An Analytical Technique for Fast and Reliable Derivation of Connectionist Symbol Structure Representations.",
            "Visual Schemas in Neural Networks for Object Recognition and Scene Analysis.",
            "Complex Connectionist Dynamics and the Limited Complexity of the Resulting Functions.",
            "Coding the Output of a Feedforward Neural Net.",
            "Behavioural Aspects of Combining Backpropagation Learning and Self-organizing Maps.",
            "Does Rotation of Neuronal Population Vectors Equal Mental Rotation?",
            "Confluent Preorder Parsing of Deterministic Grammars.",
            "The Production of Finnish Nouns: A Psycholinguistically Motivated Connectionist Model.",
            "The Connectionist Construction of Psychological Spaces.",
            "Pseudo-recurrent Connectionist Networks: An Approach to the 'Sensitivity-Stability' Dilemma.",
            "Dynamics of Noisy Neural Nets with Chemical Markers and Gaussian-distributed Connectivities.",
            "Combining Boolean Neural Architectures for Image Recognition."
        ]
    },
    {
        "name": "Connection Science",
        "year": "1996",
        "info": "Volume 8: 1996",
        "count": 22,
        "papers": [
            "Cryptotype, Overgeneralization and Competition: A Connectionist Model of the Learning of English Reversive Prefixes.",
            "A New Theory of Cerebellar Function.",
            "A Dynamic Neural Substrate and Automatic Perception Switching.",
            "Csiszar's Generalized Error Measures for Gradient-descent-based Optimizations in Neural Networks Using the Backpropagation Algorithm.",
            "Are Rule-based Neural Networks Biologically Plausible?",
            "HUMOUR: Degenerative Grammar: The Story of Outa.",
            "HUMOUR: Integrating Neural and Fuzzy Reasoning.",
            "A Survey of Transfer Between Connectionist Networks.",
            "Transfer in Cognition.",
            "Making a Low-dimensional Representation Suitable for Diverse Tasks.",
            "Dimensional Relevance Shifts in Category Learning.",
            "Hypertransfer in Neural Networks.",
            "Consolidation in Neural Networks and in the Sleeping Brain.",
            "The Parallel Transfer of Task Knowledge Using Dynamic Learning Rates Based on a Measure of Relatedness.",
            "On Combining Artificial Neural Nets.",
            "Effects of Collinearity on Combining Neural Networks.",
            "Actively Searching for an Effective Neural Network Ensemble.",
            "Bootstrapping with Noise: An Effective Regularization Technique.",
            "Ensemble Learning Using Decorrelated Neural Networks.",
            "Error Correlation and Error Reduction in Ensemble Classifiers.",
            "Reducing Variance of Committee Prediction with Resampling Techniques.",
            "Application of Several Methods of Classification Fusion to Magnetic Resonance Spectra."
        ]
    },
    {
        "name": "Connection Science",
        "year": "1995",
        "info": "Volume 7: 1995",
        "count": 11,
        "papers": [
            "Neural Network Learning from Ambiguous Training Data.",
            "Catastrophic Forgetting, Rehearsal and Pseudorehearsal.",
            "A Neural Network Construction Algorithm which Maximizes the Likelihood Function.",
            "Density Plots of Hidden Value Unit Activations Reveal Interpretable Bands.",
            "Discovering Complex Othello Strategies through Evolutionary Neural Networks.",
            "Recognizing Handwritten Digit Strings Using Modular Spatio-temporal Connectionist Networks.",
            "Symbol Manipulation with Neural Networks: Production of a Context-free Language Using a Modifiable Working Memory.",
            "A Neural Architecture for Content as well as Address-based Storage and Recall: Theory and Applications.",
            "An Analysis of Catastrophic Interference.",
            "A Gaussian Approach to Neural Nets with Multiple Memory Domains.",
            "Programming the User-friendly Dog."
        ]
    },
    {
        "name": "Connection Science",
        "year": "1994",
        "info": "Volume 6: 1994",
        "count": 27,
        "papers": [
            "Perceptually Grounded Language Learning: Part 2 - DETE: A Neural/Procedural Model.",
            "Semantic Transparency, Brain Monitoring and Evaluation of Hybrid Cognitive Architectures.",
            "Tests of an Adaptive Network Model for the Identification and Categorization of Continuous-dimension Stimuli.",
            "Information Content in Neural Net Optimization.",
            "Simplifying Neural Network Soft Weight-sharing Measures by Soft Weight-measure Soft Weight Sharing.",
            "Human and Machine Thinking P. N. Johnson-Laird, 1993 Hillsdale, NJ: Lawrence Erlbaum AssociatesISBN 0-8058-0921, £19.95.",
            "Conceptualizing How DETE Conceptualizes (or, 'More DETE-tales, Please!').",
            "Why Connectionism and Language Modelling Need DETE.",
            "Sounds Good, Could You Elaborate on That?",
            "Grounding or Association?",
            "Methodological Assumptions of DETE Project Revisited: Association-based Learning Requires Complex Architectures.",
            "Editorial: Process and Representation in Connectionist Models of Musical Structure.",
            "Modelling Pitch Perception with Adaptive Resonance Theory Artificial Neural Networks.",
            "Development of Tonal Centres and Abstract Pitch as Categorizations of Pitch Use.",
            "Resonance and the Perception of Musical Meter.",
            "Modelling Musical Perception: A Critical View.",
            "Modelling the Perception of Musical Sequences with Self-organizing Neural Networks.",
            "Neural Network Music Composition by Prediction: Exploring the Benefits of Psychoacoustic Constraints and Multi-scale Processing.",
            "Harmonizing Music the Boltzmann Way.",
            "An Ear for Melody.",
            "Towards Automated Artificial Evolution for Computer-generated Images.",
            "Understanding Musical Sound with Forward Models and Physical Models.",
            "Acquiring the Mapping from Meaning to Sounds.",
            "A Distributed Memory Model of the Associative Boost in Semantic Priming.",
            "Labelling Recursive Auto-associative Memory.",
            "Minimally Connective, Auto-associative, Neural Networks.",
            "A review of: \"Neurons and Symbols: The Stuff That Mind is Made Of \"I. Aleksander & H. Morton, 1993 London: Chapman & Hall."
        ]
    }
]