[
    {
        "name": "CVIU",
        "year": "2022",
        "info": "2022: Volumes\n214,\n215,\n216,",
        "count": 20,
        "papers": [
            "Deep structural information fusion for 3D object detection on LiDAR-camera system.",
            "Multiple instance learning on deep features for weakly supervised object detection with extreme domain shifts.",
            "Simultaneous multi-person tracking and activity recognition based on cohesive cluster search.",
            "MTCD: Cataract detection via near infrared eye images.",
            "HSGAN: Reducing mode collapse in GANs by the latent code distance of homogeneous samples.",
            "Facial landmark points detection using knowledge distillation-based neural networks.",
            "Dissected 3D CNNs: Temporal skip connections for efficient online video processing.",
            "Pros and cons of GAN evaluation measures: New developments.",
            "SdcNet for object recognition.",
            "The semantic typology of visually grounded paraphrases.",
            "Hallucinating uncertain motion and future for static image action recognition.",
            "Anti-jamming heart rate estimation using a spatial-temporal fusion network.",
            "SnapshotNet: Self-supervised feature learning for point cloud data segmentation using minimal labeled data.",
            "Light-weight shadow detection via GCN-based annotation strategy and knowledge distillation.",
            "Automatic detection and localization of thighbone fractures in X-ray based on improved deep learning method.",
            "Enhanced discriminative graph convolutional network with adaptive temporal modelling for skeleton-based action recognition.",
            "Superclass-aware network for few-shot learning.",
            "Cross-modal distillation for RGB-depth person re-identification.",
            "Dynamic mode decomposition via convolutional autoencoders for dynamics modeling in videos.",
            "Plug-and-Play video super-resolution using edge-preserving filtering."
        ]
    },
    {
        "name": "CVIU",
        "year": "2021",
        "info": "2021: Volumes\n202,\n203,\n204,\n205,\n206,\n207,\n208-209,\n210,\n211,\n212,\n213",
        "count": 98,
        "papers": [
            "On the exact recovery conditions of 3D human motion from 2D landmark motion with sparse articulated motion.",
            "Controlling biases and diversity in diverse image-to-image translation.",
            "Multi-modal semantic image segmentation.",
            "Nighttime image dehazing based on Retinex and dark channel prior using Taylor series expansion.",
            "A convergent framework with learnable feasibility for Hadamard-based image recovery.",
            "FIFNET: A convolutional neural network for motion-based multiframe super-resolution using fusion of interpolated frames.",
            "Bi-branch network for dynamic scene deblurring.",
            "Comprehensive comparative evaluation of background subtraction algorithms in open sea environments.",
            "Detection of Face Recognition Adversarial Attacks.",
            "Single image rain removal via multi-module deep grid network.",
            "A comprehensive survey of procedural video datasets.",
            "Adversarial feature distribution alignment for semi-supervised learning.",
            "Investigating the significance of adversarial attacks and their relation to interpretability for radar-based human activity recognition systems.",
            "A spacetime model for one-shot active contour extraction scheme for human detection in image sequences.",
            "Pose invariant age estimation of face images in the wild.",
            "Small and accurate heatmap-based face alignment via distillation strategy and cascaded architecture.",
            "Embedding group and obstacle information in LSTM networks for human trajectory prediction in crowded scenes.",
            "ICycleGAN: Single image dehazing based on iterative dehazing model and CycleGAN.",
            "Single-image deblurring with neural networks: A comparative survey.",
            "Video Deblurring via Spatiotemporal Pyramid Network and Adversarial Gradient Prior.",
            "A comprehensive review of past and present image inpainting methods.",
            "Task dependent deep LDA pruning of neural networks.",
            "Multi-scale attention network for image inpainting.",
            "Multi-perspective cross-class domain adaptation for open logo detection.",
            "Curriculum self-paced learning for cross-domain object detection.",
            "DenseNet-CTC: An end-to-end RNN-free architecture for context-free string recognition.",
            "Fake face detection via adaptive manipulation traces extraction network.",
            "Knowledge distillation for incremental learning in semantic segmentation.",
            "Attentive deep network for blind motion deblurring on dynamic scenes.",
            "Facial landmarks localization using cascaded neural networks.",
            "Person re-identification with part prediction alignment.",
            "Physics-based shading reconstruction for intrinsic image decomposition.",
            "Detail preserving image denoising with patch-based structure similarity via sparse representation and SVD.",
            "Learning to locate for fine-grained image recognition.",
            "Model-image registration of a building's facade based on dense semantic segmentation.",
            "Human action recognition in drone videos using a few aerial training examples.",
            "Video action detection by learning graph-based spatio-temporal interactions.",
            "Real-time and accurate object detection in compressed video by long short-term feature aggregation.",
            "Single image super-resolution via hybrid resolution NSST prediction.",
            "Evaluate and improve the quality of neural style transfer.",
            "Image retrieval with mixed initiative and multimodal feedback.",
            "Image style disentangling for instance-level facial attribute transfer.",
            "Class knowledge overlay to visual feature learning for zero-shot image classification.",
            "Instance-level salient object segmentation.",
            "High frame rate optical flow estimation from event sensors via intensity estimation.",
            "Towards closing the gap in weakly supervised semantic segmentation with DCNNs: Combining local and global models.",
            "Sejong face database: A multi-modal disguise face database.",
            "Skeleton-based action recognition via spatial and temporal transformer networks.",
            "Pruning CNN filters via quantifying the importance of deep visual representations.",
            "Deep-STaR: Classification of image time series based on spatio-temporal representations.",
            "Editorial for CVIU_DL for image restoration.",
            "Stacked Capsule Graph Autoencoders for geometry-aware 3D head pose estimation.",
            "Guest Editorial: Adversarial Deep Learning in Biometrics & Forensics.",
            "A linear method for camera pair self-calibration.",
            "Deep 3D human pose estimation: A review.",
            "One-class anomaly detection via novelty normalization.",
            "Multi-focus image fusion approach based on CNP systems in NSCT domain.",
            "SID: Incremental learning for anchor-free object detection via Selective and Inter-related Distillation.",
            "Prediction and Description of Near-Future Activities in Video.",
            "MAIN: Multi-Attention Instance Network for video segmentation.",
            "A novel shape matching descriptor for real-time static hand gesture recognition.",
            "Long term spatio-temporal modeling for action detection.",
            "Near-convex decomposition of 2D shape using visibility range.",
            "A distribution independence based method for 3D face shape decomposition.",
            "AC-VRNN: Attentive Conditional-VRNN for multi-future trajectory prediction.",
            "Unifying frame rate and temporal dilations for improved remote pulse detection.",
            "Deep learning-based single image face depth data enhancement.",
            "High-level prior-based loss functions for medical image segmentation: A survey.",
            "Decoupled appearance and motion learning for efficient anomaly detection in surveillance video.",
            "Few-shot action recognition with implicit temporal alignment and pair similarity optimization.",
            "Semantic segmentation from remote sensor data and the exploitation of latent learning for classification of auxiliary tasks.",
            "Multimodal attention networks for low-level vision-and-language navigation.",
            "SAPS: Self-Attentive Pathway Search for weakly-supervised action localization with background-action augmentation.",
            "Predicting the future from first person (egocentric) vision: A survey.",
            "Dehazing cost volume for deep multi-view stereo in scattering media with airlight and scattering coefficient estimation.",
            "Lightweight adaptive weighted network for single image super-resolution.",
            "Pick-Object-Attack: Type-specific adversarial attack for object detection.",
            "Diversified text-to-image generation via deep mutual information estimation.",
            "Image editing with varying intensities of processing.",
            "Weakly supervised instance segmentation using multi-prior fusion.",
            "Handling new target classes in semantic segmentation with domain adaptation.",
            "Learning to teach and learn for semi-supervised few-shot image classification.",
            "Lookahead adversarial learning for near real-time semantic segmentation.",
            "Subspace reconstruction based correlation filter for object tracking.",
            "Margin-based discriminant embedding guided sparse matrix regression for image supervised feature selection.",
            "Automatic generation of dense non-rigid optical flow.",
            "A review of 3D human pose estimation algorithms for markerless motion capture.",
            "MetaVD: A Meta Video Dataset for enhancing human action recognition datasets.",
            "Mutual calibration training: Training deep neural networks with noisy labels using dual-models.",
            "Monocular 3D multi-person pose estimation via predicting factorized correction factors.",
            "A semantically driven self-supervised algorithm for detecting anomalies in image sets.",
            "Rolling-Shutter-stereo-aware motion estimation and image correction.",
            "Report on UG2+ challenge Track 1: Assessing algorithms to improve video object detection and classification from unconstrained mobility platforms.",
            "Weakly supervised action segmentation with effective use of attention and self-attention.",
            "Reliable shot identification for complex event detection via visual-semantic embedding.",
            "TransRPN: Towards the Transferable Adversarial Perturbations using Region Proposal Networks and Beyond.",
            "TMF: Temporal Motion and Fusion for action recognition.",
            "Self-attentive 3D human pose and shape estimation from videos."
        ]
    },
    {
        "name": "CVIU",
        "year": "2020",
        "info": "2020: Volumes\n190,\n191,\n192,\n193,\n194,\n195,\n196,\n197-198,\n199,\n200,\n201",
        "count": 93,
        "papers": [
            "Registration with probabilistic correspondences - Accurate and robust registration for pathological and inhomogeneous medical data.",
            "Video captioning using boosted and parallel Long Short-Term Memory networks.",
            "A quantitative evaluation of comprehensive 3D local descriptors generated with spatial and geometrical features.",
            "Deep sensorimotor learning for RGB-D object recognition.",
            "On the benefit of adversarial training for monocular depth estimation.",
            "Efficient multi-output scene coordinate prediction for fast and accurate camera relocalization from a single RGB image.",
            "Descriptor extraction based on a multilayer dictionary architecture for classification of natural images.",
            "Identifying motion pathways in highly crowded scenes: A non-parametric tracklet clustering approach.",
            "A novel algebraic solution to the perspective-three-line pose problem.",
            "Weakly supervised semantic segmentation using distinct class specific saliency maps.",
            "CompactNets: Compact Hierarchical Compositional Networks for Visual Recognition.",
            "Simultaneous compression and quantization: A joint approach for efficient unsupervised hashing.",
            "An efficient EM-ICP algorithm for non-linear registration of large 3D point sets.",
            "An Entropic Optimal Transport loss for learning deep neural networks under label noise in remote sensing images.",
            "CRF with deep class embedding for large scale classification.",
            "Registration and matching method for directed point set with orientation attributes and local information.",
            "Comparison of monocular depth estimation methods using geometrically relevant metrics on the IBims-1 dataset.",
            "Human Visual System vs Convolution Neural Networks in food recognition task: An empirical comparison.",
            "Horizon line detection using supervised learning and edge cues.",
            "Automating RTI: Automatic light direction detection and correcting non-uniform lighting for more accurate surface normals.",
            "Learning feature aggregation in temporal domain for re-identification.",
            "Guess where? Actor-supervision for spatiotemporal action localization.",
            "Photometric camera characterization from a single image with invariance to light intensity and vignetting.",
            "Monocular human pose estimation: A survey of deep learning-based methods.",
            "Cascade multi-head attention networks for action recognition.",
            "Graph-matching-based correspondence search for nonrigid point cloud registration.",
            "Triplanar convolution with shared 2D kernels for 3D classification and shape retrieval.",
            "A progressive learning framework based on single-instance annotation for weakly supervised object detection.",
            "Learning a confidence measure in the disparity domain from O(1) features.",
            "UA-DETRAC: A new benchmark and protocol for multi-object detection and tracking.",
            "Deep code operation network for multi-label image retrieval.",
            "Adversarial autoencoders for compact representations of 3D point clouds.",
            "Multi-exposure photomontage with hand-held cameras.",
            "Graph convolutional neural network for multi-scale feature learning.",
            "Momental directional patterns for dynamic texture recognition.",
            "Efficient distance transformation for path-based metrics.",
            "Protuberance of depth : Detecting interest points from a depth image.",
            "Rotation invariant features based on three dimensional Gaussian Markov random fields for volumetric texture classification.",
            "Image dehazing based on a transmission fusion strategy by automatic image matting.",
            "A spatial-spectral semisupervised deep learning framework using siamese networks and angular loss.",
            "ALCN: Adaptive Local Contrast Normalization.",
            "Video anomaly detection and localization via Gaussian Mixture Fully Convolutional Variational Autoencoder.",
            "LSTM guided ensemble correlation filter tracking with appearance model pool.",
            "Visual complexity analysis using deep intermediate-layer features.",
            "Two motion models for improving video object tracking performance.",
            "Probabilistic object detection and shape extraction in remote sensing data.",
            "Age estimation from faces using deep learning: A comparative analysis.",
            "Product image recognition with guidance learning and noisy supervision.",
            "Intelligent video analysis: A Pedestrian trajectory extraction method for the whole indoor space without blind areas.",
            "Classifier-agnostic saliency map extraction.",
            "Study of naturalness in tone-mapped images.",
            "Color edge preserving image colorization with a coupled natural vectorial total variation.",
            "Self-supervised on-line cumulative learning from video streams.",
            "Visual BMI estimation from face images using a label distribution based method.",
            "Adversarial examples for replay attacks against CNN-based face recognition with anti-spoofing capability.",
            "Joint identification-verification for person re-identification: A four stream deep learning approach with improved quartet loss function.",
            "An attention recurrent model for human cooperation detection.",
            "A minimum barrier distance for multivariate images with applications.",
            "Pyramid Channel-based Feature Attention Network for image dehazing.",
            "Hyperspectral image restoration via CNN denoiser prior regularized low-rank tensor recovery.",
            "Learning lightweight Multi-Scale Feedback Residual network for single image super-resolution.",
            "Scalable learning for bridging the species gap in image-based plant phenotyping.",
            "High-speed multi-person pose estimation with deep feature transfer.",
            "JSNet: A simulation network of JPEG lossy compression and restoration for robust image watermarking against JPEG attack.",
            "Infrared and visible image fusion via gradientlet filter.",
            "Residual network with detail perception loss for single image super-resolution.",
            "Partial domain adaptation based on shared class oriented adversarial network.",
            "Dynamic mode decomposition via dictionary learning for foreground modeling in videos.",
            "End-to-end deep learning-based fringe projection framework for 3D profiling of objects.",
            "Representation learning of image composition for aesthetic prediction.",
            "Low-level multiscale image segmentation and a benchmark for its evaluation.",
            "Task differentiation: Constructing robust branches for precise object detection.",
            "Refining high-frequencies for sharper super-resolution and deblurring.",
            "Two-stream deep sparse network for accurate and efficient image restoration.",
            "Texture collinearity foreground segmentation for night videos.",
            "Fine-grained facial landmark detection exploiting intermediate feature representations.",
            "E-ProSRNet: An enhanced progressive single image super-resolution approach.",
            "Pointly-supervised scene parsing with uncertainty mixture.",
            "Learning deep edge prior for image denoising.",
            "Open cross-domain visual search.",
            "Cross-spectral stereo matching for facial disparity estimation in the dark.",
            "NCMS: Towards accurate anchor free object detection through ℓ2 norm calibration and multi-feature selection.",
            "Deep online classification using pseudo-generative models.",
            "Learning instance-aware object detection using determinantal point processes.",
            "PS-DeVCEM: Pathology-sensitive deep learning model for video capsule endoscopy based on weakly labeled data.",
            "Effective crowd counting using multi-resolution context and image quality assessment-guided training.",
            "MTRNet++: One-stage mask-based scene text eraser.",
            "The synergy of double attention: Combine sentence-level and word-level attention for image captioning.",
            "A comparison of methods for 3D scene shape retrieval.",
            "Accurate MR image super-resolution via lightweight lateral inhibition network.",
            "Video scene parsing: An overview of deep learning methods and datasets.",
            "Ghost Removal via Channel Attention in Exposure Fusion.",
            "Photometric stereo with central panoramic cameras."
        ]
    },
    {
        "name": "CVIU",
        "year": "2019",
        "info": "2019: Volumes\n178,\n179,\n180,\n181,\n182,\n183,\n184,\n185,\n186,\n187,\n188,\n189",
        "count": 82,
        "papers": [
            "Toward analyzing mutual interference on infrared-enabled depth cameras.",
            "Visual graph mining for graph matching.",
            "Getting to know low-light images with the Exclusively Dark dataset.",
            "Encoding pairwise Hamming distances of Local Binary Patterns for visual smoke recognition.",
            "On illumination-invariant variational optical flow for weakly textured scenes.",
            "Dynamic topology and relevance learning SOM-based algorithm for image clustering tasks.",
            "Diffusion and inpainting of reflectance and height LiDAR orthoimages.",
            "Pros and cons of GAN evaluation measures.",
            "Revisiting the medial axis for planar shape decomposition.",
            "Unsupervised learning from videos using temporal coherency deep networks.",
            "Probabilistic moving least squares with spatial constraints for nonlinear color transfer between images.",
            "Robust and accurate 2D-tracking-based 3D positioning method: Application to head pose estimation.",
            "DeepShoe: An improved Multi-Task View-invariant CNN for street-to-shop shoe retrieval.",
            "Joint person re-identification and camera network topology inference in multiple cameras.",
            "A flexible calibration method for the intrinsic and mechanical parameters of panoramic line-scan cameras.",
            "Holistic and local patch framework for 6D object pose estimation in RGB-D images.",
            "Image-speech combination for interactive computer assisted transcription of handwritten documents.",
            "Holistic object detection and image understanding.",
            "Taking visual motion prediction to new heightfields.",
            "Video synopsis: A survey.",
            "L2 Divergence for robust colour transfer.",
            "As-planar-as-possible depth map estimation.",
            "Heterogeneous hand gesture recognition using 3D dynamic skeletal data.",
            "Geometry in active learning for binary and multi-class image segmentation.",
            "Registration-free Face-SSD: Single shot analysis of smiles, facial attributes, and affect in the wild.",
            "Image rectification for prism-based stereoscopic optical systems.",
            "Infimal convolution type regularization of TGV and shearlet transform for image restoration.",
            "A survey of advances in vision-based vehicle re-identification.",
            "Deep pose consensus networks.",
            "Can adversarial networks hallucinate occluded people with a plausible aspect?",
            "Domain invariant hierarchical embedding for grocery products recognition.",
            "Sub-hypergraph matching based on adjacency tensor.",
            "Cross-modality motion parameterization for fine-grained video prediction.",
            "Least-squares registration of point sets over SE(d) using closed-form projections.",
            "Probability hypothesis density filter using determinantal point processes for multi object tracking.",
            "TAB: Temporally aggregated bag-of-discriminant-words for temporal action proposals.",
            "Automotive radar and camera fusion using Generative Adversarial Networks.",
            "Discriminant Deep Feature Learning based on joint supervision Loss and Multi-layer Feature Fusion for heterogeneous face recognition.",
            "Siamese graph convolutional network for content based remote sensing image retrieval.",
            "k-SLAM: A fast RGB-D SLAM approach for large indoor environments.",
            "Anabranch network for camouflaged object segmentation.",
            "Informative sample generation using class aware generative adversarial networks for classification of chest Xrays.",
            "Learn to synthesize and synthesize to learn.",
            "Multi-person 3D pose estimation from 3D cloud data using 3D convolutional neural networks.",
            "DRAU: Dual Recurrent Attention Units for Visual Question Answering.",
            "Deep 3D morphable model refinement via progressive growing of conditional Generative Adversarial Networks.",
            "Generalizing semi-supervised generative adversarial networks to regression using feature contrasting.",
            "Weighted Patch-based Manifold Regularization Dictionary Pair Learning model for facial expression recognition using Iterative Optimization Classification Strategy.",
            "A two-streamed network for estimating fine-scaled depth maps from single RGB images.",
            "GeoSay: A geometric saliency for extracting buildings in remote sensing images.",
            "Single image rain removal via a deep decomposition-composition network.",
            "Performance analysis of single-query 6-DoF camera pose estimation in self-driving setups.",
            "Attentive matching network for few-shot learning.",
            "Multitask learning for large-scale semantic change detection.",
            "Cross-domain mapping learning for transductive zero-shot learning.",
            "Flow-guided feature propagation with occlusion aware detail enhancement for hand segmentation in egocentric videos.",
            "Exploring weight symmetry in deep neural networks.",
            "Cross-view image synthesis using geometry-guided conditional GANs.",
            "Smartphone picture organization: A hierarchical approach.",
            "Visual search over billions of aerial and satellite images.",
            "Attention with structure regularization for action recognition.",
            "Urban surface reconstruction in SAR tomography by graph-cuts.",
            "Non-ideal iris segmentation using Polar Spline RANSAC and illumination compensation.",
            "A label noise tolerant random forest for the classification of remote sensing data based on outdated maps for training.",
            "Faster training of Mask R-CNN by focusing on instance boundaries.",
            "Texture-driven parametric snakes for semi-automatic image segmentation.",
            "3D articulated skeleton extraction using a single consumer-grade depth camera.",
            "Spatial-spectral feature based approach towards convolutional sparse coding of hyperspectral images.",
            "Classification of hyperspectral images with convolutional neural networks and probabilistic relaxation.",
            "Analyzing human-human interactions: A survey.",
            "IterGANs: Iterative GANs to learn and control 3D object transformation.",
            "A survey on deep learning based face recognition.",
            "Diffusion-based isometric depth correspondence.",
            "Distance transform regression for spatially-aware deep semantic segmentation.",
            "Coupled dictionary learning for unsupervised change detection between multimodal remote sensing images.",
            "Visual Skeleton and Reparative Attention for Part-of-Speech image captioning system.",
            "Residual attention unit for action recognition.",
            "Linear programming-based submodular extensions for marginal estimation.",
            "Region-based image registration for remote sensing imagery.",
            "ASSD: Attentive single shot multibox detector.",
            "Triple attention network for sentimental visual question answering.",
            "Face alignment using a 3D deeply-initialized ensemble of regression trees."
        ]
    },
    {
        "name": "CVIU",
        "year": "2018",
        "info": "2018: Volumes\n166,\n167,\n168,\n169,\n170,\n171,\n172,\n173,\n174,\n175,\n176-177",
        "count": 106,
        "papers": [
            "Superpixels: An evaluation of the state-of-the-art.",
            "Vide-omics: A genomics-inspired paradigm for video analysis.",
            "VideoLSTM convolves, attends and flows for action recognition.",
            "Unified optimization framework for localization and tracking of multiple targets with multiple cameras.",
            "A performance evaluation of point pair features.",
            "An efficient solution to the perspective-three-point pose problem.",
            "Proximal robust factorization for piecewise planar reconstruction.",
            "Learning part-in-whole relation of 3D shapes for part-based 3D model retrieval.",
            "Biometric recognition by gait: A survey of modalities and features.",
            "Kinship verification using multiview hybrid distance learning.",
            "DAAL: Deep activation-based attribute learning for action recognition in depth videos.",
            "Looking beyond appearances: Synthetic training data for deep CNNs in re-identification.",
            "Structured deep hashing with convolutional neural networks for fast person re-identification.",
            "A study on topological descriptors for the analysis of 3D surface texture.",
            "A 3D deformable model-based framework for the retrieval of near-isometric flattenable objects using Bag-of-Visual-Words.",
            "A Novel perspective invariant feature transform for RGB-D images.",
            "A scalable, efficient, and accurate solution to non-rigid structure from motion.",
            "Fitting line projections in non-central catadioptric cameras with revolution symmetry.",
            "Guest Editorial: Vision and Computational Photography and Graphics.",
            "Towards an automatic correction of over-exposure in photographs: Application to tone-mapping.",
            "A bio-inspired synergistic virtual retina model for tone mapping.",
            "Clustering based content and color adaptive tone mapping.",
            "Simultaneous deconvolution and denoising using a second order variational approach applied to image super resolution.",
            "Modified non-local means for super-resolution of hybrid videos.",
            "Video super-resolution based on spatial-temporal recurrent residual networks.",
            "Optimized sampling for view interpolation in light fields using local dictionaries.",
            "Depth range accuracy for plenoptic cameras.",
            "A novel framework for highlight reflectance transformation imaging.",
            "Specular highlight reduction with known surface geometry.",
            "Underwater image and video dehazing with pure haze region segmentation.",
            "Blind image deblurring using elastic-net based rank prior.",
            "A bi-directional evaluation-based approach for image retargeting quality assessment.",
            "Blind video denoising via texture-aware noise estimation.",
            "Local directional ternary pattern: A New texture descriptor for texture classification.",
            "Multiple Hierarchical Dirichlet Processes for anomaly detection in traffic.",
            "Hierarchical semantic image matching using CNN feature pyramid.",
            "2D-3D pose consistency-based conditional random fields for 3D human pose estimation.",
            "Ensemble convolutional neural networks for pose estimation.",
            "Viewpoint refinement and estimation with adapted synthetic data.",
            "A differential geometry approach to camera-independent image correspondence.",
            "Surface reconstruction from unorganized points with l0 gradient minimization.",
            "3D non-rigid registration using color: Color Coherent Point Drift.",
            "Robust superpixels using color and contour features along linear path.",
            "PA-Search: Predicting units adaptive motion search for surveillance video coding.",
            "Subpixel phase-based image registration using Savitzky-Golay differentiators in gradient-correlation.",
            "PuRe: Robust pupil detection for real-time pervasive eye tracking.",
            "Exploiting deep residual networks for human action recognition from skeletal data.",
            "Semi- and weakly-supervised human pose estimation.",
            "Minimal solutions for the rotational alignment of IMU-camera systems using homography constraints.",
            "Active learning for designing detectors for infrequently occurring objects in wide-area satellite imagery.",
            "Spatially sensitive statistical shape analysis for pedestrian recognition from LIDAR data.",
            "Real-time visual tracking by deep reinforced decision making.",
            "Generating high quality pan-shots from motion blurred videos.",
            "Multiple view image denoising using 3D focus image stacks.",
            "Structure preserving image denoising based on low-rank reconstruction and gradient histograms.",
            "An exocentric look at egocentric actions and vice versa.",
            "Model-based active learning to detect an isometric deformable object in the wild with a deep architecture.",
            "Shape measurement using LIP-signature.",
            "Exemplar-based Cascaded Stacked Auto-Encoder Networks for robust face alignment.",
            "Towards social pattern characterization in egocentric photo-streams.",
            "RGB-D-based human motion recognition with deep learning: A survey.",
            "Single color image photometric stereo for multi-colored surfaces.",
            "Curvature-based spectral signatures for non-rigid shape retrieval.",
            "A survey of exemplar-based texture synthesis methods.",
            "Object tracking via Online Multiple Instance Learning with reliable components.",
            "A dual-source approach for 3D human pose estimation from single images.",
            "Direct pose estimation for planar objects.",
            "Top-down saliency detection driven by visual classification.",
            "Lightweight convolutional neural networks for player detection and classification.",
            "Deep-anomaly: Fully convolutional neural network for fast anomaly detection in crowded scenes.",
            "A multi-agent system for the classification of gender and age from images.",
            "Single-View Reconstruction using orthogonal line-pairs.",
            "Factorization based structure from motion with object priors.",
            "Guest Editorial.",
            "Large-scale image retrieval using transductive support vector machines.",
            "Set2Model networks: Learning discriminatively to learn generative models.",
            "Learning without prejudice: Avoiding bias in webly-supervised action recognition.",
            "Image Understanding using vision and reasoning through Scene Description Graph.",
            "Editorial for ACCV'16 award papers.",
            "Generalized fusion moves for continuous label optimization.",
            "A universal, closed-form approach for absolute pose problems.",
            "Learning to lip read words by watching videos.",
            "Cascade residuals guided nonlinear dictionary learning.",
            "Context proposals for saliency detection.",
            "Graph based over-segmentation methods for 3D point clouds.",
            "Ordinal space projection learning via neighbor classes representation.",
            "Deep spatio-temporal feature fusion with compact bilinear pooling for multimodal emotion recognition.",
            "Text effects transfer via distribution-aware texture synthesis.",
            "CuDi3D: Curvilinear displacement based approach for online 3D action detection.",
            "Efficient energy-based topological outlier rejection.",
            "Robust visual data segmentation: Sampling from distribution of model parameters.",
            "Robust synchronization in SO(3) and SE(3) via low-rank and sparse matrix decomposition.",
            "Hierarchical coherency sensitive hashing and interpolation with RANSAC for large displacement optical flow.",
            "Active target tracking: A simplified view aligning method for binocular camera model.",
            "Back to the beginning: Starting point detection for early recognition of ongoing human actions.",
            "An extension of kernel learning methods using a modified Log-Euclidean distance for fast and accurate skeleton-based Human Action Recognition.",
            "A resample strategy and artificial bee colony optimization-based 3d range imaging registration.",
            "Surface reconstruction from a sparse point cloud by enforcing visibility consistency and topology constraints.",
            "Compositional Human Pose Regression.",
            "Sparse weakly supervised models for object localization in road environment.",
            "Pushing the boundaries of audiovisual word recognition using Residual Networks and LSTMs.",
            "Mining deep And-Or object structures via cost-sensitive question-answer-based active annotations.",
            "Detection and localization of spatially correlated point landmarks in medical images using an automatically learned conditional random field.",
            "Generic spatial-color metric for scale-space processing of catadioptric images.",
            "CNN-based features for retrieval and classification of food images.",
            "Eye blink completeness detection."
        ]
    },
    {
        "name": "CVIU",
        "year": "2017",
        "info": "2017: Volumes\n154,\n155,\n156,\n157,\n158,\n159,\n160,\n161,\n162,\n163,\n164,\n165",
        "count": 158,
        "papers": [
            "Computer vision for assistive technologies.",
            "Non-blind image deconvolution using a regularization based on re-blurring process.",
            "Pair-wisely optimized clustering tree for feature indexing.",
            "A support vector approach for cross-modal search of images and texts.",
            "Segmentation of clusters by template rotation expectation maximization.",
            "Left/right hand segmentation in egocentric videos.",
            "Recognising complex activities with histograms of relative tracklets.",
            "Online multi-object tracking via robust collaborative model and sample selection.",
            "Cross-view human action recognition from depth maps using spectral graph sequences.",
            "Unsupervised object region proposals for RGB-D indoor scenes.",
            "3D-2D face recognition with pose and illumination normalization.",
            "Efficient guided hypothesis generation for multi-structure epipolar geometry estimation.",
            "Combined segmentation, reconstruction, and tracking of multiple targets in multi-view video sequences.",
            "Water detection through spatio-temporal invariant descriptors.",
            "Stairs detection with odometry-aided traversal from a wearable RGB-D camera.",
            "The THUMOS challenge on action recognition for videos \"in the wild\".",
            "Removal of curtaining effects by a variational model with directional forward differences.",
            "Human skin detection through correlation rules between the YCb and YCr subspaces based on dynamic color clustering.",
            "Object co-segmentation via weakly supervised data fusion.",
            "SR-clustering: Semantic regularized clustering for egocentric photo streams segmentation.",
            "Frequency domain subpixel registration using HOG phase correlation.",
            "A new composite multi-constrained differential-radon warping approach for digital video affine motion stabilization.",
            "Dual soft assignment clustering algorithm for human action video clustering.",
            "A new framework with multiple tasks for detecting and locating pain events in video.",
            "Guided optimisation through classification and regression for hand pose estimation.",
            "A dynamic gesture recognition and prediction system using the convexity approach.",
            "Single image 3D human pose estimation using a procrustean normal distribution mixture model and model transformation.",
            "Accurate vessel segmentation using maximum entropy incorporating line detection and phase-preserving denoising.",
            "Simultaneous tumor segmentation, image restoration, and blur kernel estimation in PET using multiple regularizations.",
            "Image and Video Understanding in Big Data.",
            "MEG: Texture operators for multi-expert gender classification.",
            "Boosting Hankel matrices for face emotion recognition and pain detection.",
            "Social profiling through image understanding: Personality inference using convolutional neural networks.",
            "Structured learning of metric ensembles with application to person re-identification.",
            "Continuous adaptation of multi-camera person identification models through sparse non-redundant representative selection.",
            "A bag-of-words equivalent recurrent neural network for action recognition.",
            "Improved scene identification and object detection on egocentric vision of daily activities.",
            "Fast action retrieval from videos via feature disaggregation.",
            "Detecting anomalous events in videos by learning deep representations of appearance and motion.",
            "Deep active object recognition by joint label and action prediction.",
            "Weak supervision for detecting object classes from activities.",
            "Efficient large-scale multi-class image classification by learning balanced trees.",
            "Online supervised hashing.",
            "Scalable greedy algorithms for transfer learning.",
            "Special Issue on Large-Scale 3D Modeling of Urban Indoor or Outdoor Scenes from Images and Range Scans.",
            "Efficient edge-aware surface mesh reconstruction for urban scenes.",
            "Automatic large-scale three dimensional modeling using cooperative multiple robots.",
            "Error-aware construction and rendering of multi-scan panoramas from massive point clouds.",
            "Temporal city modeling using street level imagery.",
            "6DOF decoupled roto-translation alignment of large-scale indoor point clouds.",
            "Fine scale image registration in large-scale urban LIDAR point sets.",
            "Modeling large-scale indoor scenes with rigid fragments using RGB-D cameras.",
            "A generalised framework for saliency-based point feature detection.",
            "Large scale and long standing simultaneous reconstruction and segmentation.",
            "Large-scale outdoor 3D reconstruction on a mobile device.",
            "Efficient 3D scene abstraction using line segments.",
            "Efficient tree-structured SfM by RANSAC generalized Procrustes analysis.",
            "Divide and conquer: A hierarchical approach to large-scale structure-from-motion.",
            "Stereo reconstruction using top-down cues.",
            "Indoor Manhattan spatial layout recovery from monocular videos via line matching.",
            "Autocalibration for Structure from Motion.",
            "Evaluations on multi-scale camera networks for precise and geo-accurate reconstructions from aerial and terrestrial images with user guidance.",
            "Video registration in egocentric vision under day and night illumination changes.",
            "ASIST: Automatic semantically invariant scene transformation.",
            "Efficient architectural structural element decomposition.",
            "Learning a no-reference quality metric for single-image super-resolution.",
            "Detecting sudden moving objects in a series of digital images with different exposure times.",
            "Specularity removal: A global energy minimization approach based on polarization imaging.",
            "Segmentation models diversity for object proposals.",
            "Enhancing textural differences using wavelet-based texture characteristics morphological component analysis: A preprocessing method for improving image segmentation.",
            "Leveraging observation uncertainty for robust visual tracking.",
            "Image and video mining through online learning.",
            "Space-time representation of people based on 3D skeletal data: A review.",
            "Locality regularized group sparse coding for action recognition.",
            "COnfusion REduction (CORE) algorithm for local descriptors, floating-point and binary cases.",
            "Non-convex online robust PCA: Enhance sparsity via ℓp-norm minimization.",
            "An edge-based method for effective abandoned luggage detection in complex surveillance videos.",
            "Computer Vision in Sports.",
            "Computer vision for sports: Current applications and research topics.",
            "A survey on player tracking in soccer videos.",
            "The S-Hock dataset: A new benchmark for spectator crowd analysis.",
            "Where should cameras look at soccer games: Improving smoothness using the overlapped hidden Markov model.",
            "Scene-specific classifier for effective and efficient team sport players detection from a single calibrated camera.",
            "Exploring structure for long-term tracking of multiple objects in sports videos.",
            "Soccer player recognition using spatial constellation features and jersey number recognition.",
            "Automated detection and tracking of slalom paddlers from broadcast image sequences using cascade classifiers and discriminative correlation filters.",
            "Understanding and localizing activities from correspondences of clustered trajectories.",
            "Fine-grained action recognition of boxing punches from depth imagery.",
            "Real-time gymnast detection and performance analysis with a portable 3D camera.",
            "A technology platform for automatic high-level tennis game analysis.",
            "Survey: How good are the current advances in image set based face identification? - Experiments on three popular benchmarks with a naïve approach.",
            "Evaluation of periocular features for kinship verification in the wild.",
            "Detecting moving regions in CrowdCam images.",
            "Model-based motion blur estimation for the improvement of motion tracking.",
            "Online hash tracking with spatio-temporal saliency auxiliary.",
            "Mining discriminative descriptors for goal-based activity detection.",
            "Multiple metric learning with query adaptive weights and multi-task re-weighting for person re-identification.",
            "Context-based object viewpoint estimation: A 2D relational approach.",
            "Multi-view face recognition from single RGBD models of the faces.",
            "Rotational contour signatures for both real-valued and binary feature representations of 3D local shape.",
            "Part-based 3D object retrieval via multi-label optimization.",
            "Polarisation photometric stereo.",
            "Automatic correction of perspective and optical distortions.",
            "Systematic evaluation of convolution neural network advances on the Imagenet.",
            "Shot boundary detection via adaptive low rank and svd-updating.",
            "Face inpainting based on high-level facial attributes.",
            "Unsupervised action proposal ranking through proposal recombination.",
            "Salient object detection based on super-pixel clustering and unified low-rank representation.",
            "Riemannian manifold-valued part-based features and geodesic-induced kernel machine for activity classification dedicated to assisted living.",
            "Automatic action annotation in weakly labeled videos.",
            "Traffic surveillance camera calibration by 3D model bounding box alignment for accurate vehicle speed measurement.",
            "Predictive RANSAC: Effective model fitting and tracking approach under heavy noise and outliers.",
            "SPORE: Staged Probabilistic Regression for Hand Orientation Inference.",
            "Absolute pose estimation from line correspondences using direct linear transformation.",
            "Indoor localization via multi-view images and videos.",
            "Face alignment in-the-wild: A Survey.",
            "Efficient single image dehazing and denoising: An efficient multi-scale correlated wavelet approach.",
            "Three-layer graph framework with the sumD feature for alpha matting.",
            "Naturally combined shape-color moment invariants under affine transformations.",
            "A local feature with multiple line descriptors and its speeded-up matching algorithm.",
            "mdBRIEF - a fast online-adaptable, distorted binary descriptor for real-time applications using calibrated wide-angle or fisheye cameras.",
            "Stand-alone quality estimation of background subtraction algorithms.",
            "Multi-object tracking through learning relational appearance features and motion patterns.",
            "Cluster-based adaptive SVM: A latent subdomains discovery method for domain adaptation problems.",
            "Stylizing face images via multiple exemplars.",
            "Non-rigid registration based model-free 3D facial expression recognition.",
            "Self-calibration of omnidirectional multi-cameras including synchronization and rolling shutter.",
            "Guest Editorial: Language in Vision.",
            "Visual question answering: Datasets, algorithms, and future challenges.",
            "Visual question answering: A survey of methods and datasets.",
            "Vision-language integration using constrained local semantic features.",
            "Recognizing semantic correlation in image-text weibo via feature space mapping.",
            "Simple to complex cross-modal learning to rank.",
            "Weakly supervised learning of actions from transcripts.",
            "Human Attention in Visual Question Answering: Do Humans and Deep Networks Look at the Same Regions?",
            "Resolving vision and language ambiguities together: Joint segmentation & prepositional attachment resolution in captioned scenes.",
            "Hierarchical & multimodal video captioning: Discovering and transferring multimodal knowledge for vision to language.",
            "Learning explicit video attributes from mid-level representation for video captioning.",
            "Editorial- Deep Learning for Computer Vision.",
            "SMC faster R-CNN: Toward a scene-specialized multi-object detector.",
            "Speedup of deep learning ensembles for semantic segmentation using a model compression technique.",
            "Compact descriptors for sketch-based image retrieval using a triplet loss convolutional neural network.",
            "Deep compare: A study on using convolutional neural networks to compare image patches.",
            "Hand pose estimation through semi-supervised and weakly-supervised learning.",
            "Harnessing noisy Web images for deep representation.",
            "Saliency Driven Object recognition in egocentric videos with deep CNN: toward application in assistance to Neuroprostheses.",
            "Hough-CNN: Deep learning for segmentation of deep brain regions in MRI and ultrasound.",
            "Improved gait recognition based on specialized deep convolutional neural network.",
            "Multiple hypothesis colorization and its application to image compression.",
            "A study of the effect of noise and occlusion on the accuracy of convolutional neural networks applied to 3D object recognition.",
            "Haze visibility enhancement: A Survey and quantitative benchmarking.",
            "Image dehazing using adaptive bi-channel priors on superpixels.",
            "Atmospheric light estimation in hazy images based on color-plane model.",
            "A geometric approach for color image regularization.",
            "Ultimate levelings.",
            "A new primal-dual algorithm for multilabel graph-cuts problems with approximate moves.",
            "Spatiotemporal lacunarity spectrum for dynamic texture classification.",
            "Automatic segmentation of cross-sectional coronary arterial images."
        ]
    },
    {
        "name": "CVIU",
        "year": "2016",
        "info": "2016: Volumes\n142,\n143,\n144,\n145,\n146,\n147,\n148,\n149,\n150,\n151,\n152,\n153",
        "count": 170,
        "papers": [
            "Semantic super-resolution: When and where is it useful?",
            "Local Higher-Order Statistics (LHS) describing images with statistics of local non-binarized pixel patterns.",
            "Image segmentation via multi-scale stochastic regional texture appearance models.",
            "An efficient feature descriptor based on synthetic basis functions and uniqueness matching strategy.",
            "Consensus of multiple correspondences between sets of elements.",
            "Fixed-point Gaussian Mixture Model for analysis-friendly surveillance video coding.",
            "Covariance based point cloud descriptors for object detection and recognition.",
            "Localizing scene texts by fuzzy inference systems and low rank matrix recovery model.",
            "Statistical 3D face shape estimation from occluding contours.",
            "Interdigital palm region for biometric identification.",
            "A novel double-layer sparse representation approach for unsupervised dictionary learning.",
            "Detecting conversational groups in images and sequences: A robust game-theoretic approach.",
            "Global optimization for coupled detection and data association in multiple object tracking.",
            "Fisher Kernel Temporal Variation-based Relevance Feedback for video retrieval.",
            "Inference and Learning of Graphical Models: Theory and Applications in Computer Vision and Image Analysis.",
            "Higher order maximum persistency and comparison theorems.",
            "Lazy Generic Cuts.",
            "Oriented boundary graph: An efficient structuring model for segmentation of 3D images.",
            "Higher-order segmentation via multicuts.",
            "Texture modelling with nested high-order Markov-Gibbs random fields.",
            "Learnable high-order MGRF models for contrast-invariant texture recognition.",
            "Sequential Interval Network for parsing complex structured activity.",
            "Primary object discovery and segmentation in videos via graph-based transductive inference.",
            "Learning weighted part models for object tracking.",
            "Learning object-specific DAGs for multi-label material recognition.",
            "Scene parsing by nonparametric label transfer of content-adaptive windows.",
            "Special Issue on Individual and Group Activities in Video Event Analysis.",
            "Action recognition by using kernels on aclets sequences.",
            "Learning hierarchical 3D kernel descriptors for RGB-D action recognition.",
            "Incremental learning of human activity models from videos.",
            "Recognising occluded multi-view actions using local nearest neighbour embedding.",
            "Activity detection using Sequential Statistical Boundary Detection (SSBD).",
            "Hierarchical transfer learning for online recognition of compound actions.",
            "From pose to activity: Surveying datasets and introducing CONVERSE.",
            "Multi-modal human aggression detection.",
            "RIMOC, a feature to discriminate unstructured motions: Application to violence detection for video-surveillance.",
            "Localizing activity groups in videos.",
            "Affective interaction recognition using spatio-temporal features and context.",
            "Online real-time crowd behavior detection in video sequences.",
            "Spatio-temporal texture modelling for real-time crowd anomaly detection.",
            "On detecting the playing/non-playing activity of musicians in symphonic music videos.",
            "Efficient multi-target tracking via discovering dense subgraphs.",
            "PSTG-based multi-label optimization for multi-target tracking.",
            "People re-identification across non-overlapping cameras using group features.",
            "Temporal mapping of surveillance video for indexing and summarization.",
            "A scalable and flexible framework for smart video surveillance.",
            "Evidential event inference in transport video surveillance.",
            "A dense subgraph based algorithm for compact salient image region detection.",
            "CURL: Image Classification using co-training and Unsupervised Representation Learning.",
            "Enhancing energy minimization framework for scene text recognition with top-down cues.",
            "Invariant multi-scale descriptor for shape representation, matching and retrieval.",
            "A bioinformatics approach to 2D shape classification.",
            "Scene parsing using graph matching on street-view data.",
            "Aggregation of local parametric candidates with exemplar-based occlusion handling for optical flow.",
            "Illumination invariant optical flow using neighborhood descriptors.",
            "Triangulation and metric of lines based on geometric error.",
            "Height from photometric ratio with model-based light source selection.",
            "Editorial.",
            "Stepwise calibration of focused plenoptic cameras.",
            "Robust depth estimation for light field via spinning parallelogram operator.",
            "Simple change detection from mobile light field cameras.",
            "Tensor low-rank and sparse light field photography.",
            "Subsampling-based acceleration of simple linear iterative clustering for superpixel segmentation.",
            "Semantic video labeling by developmental visual agents.",
            "COROLA: A sequential solution to moving object detection using low-rank approximation.",
            "Randomized low-rank Dynamic Mode Decomposition for motion detection.",
            "12th Asian conference on computer vision.",
            "Stereo fusion: Combining refractive and binocular disparity.",
            "Cosegmentation of multiple image groups.",
            "Separation of reflection components by sparse non-negative matrix factorization.",
            "Hybrid macro-micro visual analysis for city-scale state estimation.",
            "State of the Journal.",
            "A variance-based Bayesian framework for improving Land-Cover classification through wide-area learning from large geographic regions.",
            "Rejection based multipath reconstruction for background estimation in video sequences with stationary objects.",
            "Enhancement of dynamic depth scenes by upsampling for precise super-resolution (UP-SR).",
            "Editorial of special issue on spontaneous facial behaviour analysis.",
            "Does \"lie to me\" lie to you? An evaluation of facial clues to high-stakes deception.",
            "Capturing global spatial patterns for distinguishing posed and spontaneous expressions.",
            "Multiview Distance Metric Learning on facial feature descriptors for automatic pain intensity detection.",
            "Spontaneous micro-expression spotting via geometric deformation modeling.",
            "Learning prototypes and similes on Grassmann manifold for spontaneous expression recognition.",
            "Crowdsourcing facial expressions for affective-interaction.",
            "Multi-modal emotion analysis from facial expressions and electroencephalogram.",
            "Special issue on Assistive Computer Vision and Robotics - Part I.",
            "Wize Mirror - a smart, multisensory cardio-metabolic risk monitoring system.",
            "Eye blink detection based on motion vectors analysis.",
            "Toothbrush motion analysis to help children learn proper tooth brushing.",
            "Purely vision-based segmentation of web pages for assistive technology.",
            "A supervised extreme learning committee for food recognition.",
            "Spatio-Temporal Hough Forest for efficient detection-localisation-recognition of fingerwriting in egocentric camera.",
            "Improving posture classification accuracy for depth sensor-based human activity monitoring in smart environments.",
            "Human fall detection in videos via boosting and fusing statistical features of appearance, shape and motion dynamics on Riemannian manifolds with applications to assisted living.",
            "Robust traffic lights detection on mobile devices for pedestrians with visual impairment.",
            "A comparative study of pose representation and dynamics modelling for online motion quality assessment.",
            "Lip event detection using oriented histograms of regional optical flow and low rank affinity pursuit.",
            "Geodesic pixel neighborhoods for 2D and 3D scene understanding.",
            "Characterizing everyday activities from visual lifelogs based on enhancing concept representation.",
            "Expressive visual text-to-speech as an assistive technology for individuals with autism spectrum conditions.",
            "A novel 2D/3D database with automatic face annotation for head tracking and pose estimation.",
            "Special Issue on Assistive Computer Vision and Robotics - \"Assistive Solutions for Mobility, Communication and HMI\".",
            "RGB-D camera based wearable navigation system for the visually impaired.",
            "Enhanced control of a wheelchair-mounted robotic manipulator using 3-D vision and multimodal interaction.",
            "Gender and gaze gesture recognition for human-computer interaction.",
            "Interactive multiple object learning with scanty human supervision.",
            "A real-time Human-Robot Interaction system based on gestures for assistive scenarios.",
            "A multi-modal perception based assistive robotic system for the elderly.",
            "You-Do, I-Learn: Egocentric unsupervised discovery of objects and their modes of interaction towards video-based guidance.",
            "Semantic labeling for prosthetic vision.",
            "An assistive haptic interface for appearance-based indoor navigation.",
            "Multi-face tracking by extended bag-of-tracklets in egocentric photo-streams.",
            "Model-based head pose-free gaze estimation for assistive communication.",
            "Vision-based adaptive assistance and haptic guidance for safe wheelchair corridor following.",
            "Pedestrian lane detection in unstructured scenes for assistive navigation.",
            "Localization and tracking in known large environments using portable real-time 3D sensors.",
            "An integrated artificial vision framework for assisting visually impaired users.",
            "Robust multi-dimensional motion features for first-person vision activity recognition.",
            "Bio-inspired computer vision: Towards a synergistic approach of artificial and biological vision.",
            "Robust Bayesian non-parametric dictionary learning with heterogeneous Gaussian noise.",
            "A generalized graph reduction framework for interactive segmentation of large images.",
            "A novel scheme based on local binary pattern for dynamic texture recognition.",
            "Multi-reference combinatorial strategy towards longer long-term dense motion estimation.",
            "An occlusion-aware particle filter tracker to handle complex and persistent occlusions.",
            "Large scale Gaussian Process for overlap-based object proposal scoring.",
            "Bag of visual words and fusion methods for action recognition: Comprehensive study and good practice.",
            "Model effectiveness prediction and system adaptation for photometric stereo in murky water.",
            "Online algorithms for factorization-based structure from motion.",
            "Editorial on Special Issue on Probabilistic Models for Biomedical Image Analysis.",
            "Modeling 4D pathological changes by leveraging normative models.",
            "Variational inference for medical image segmentation.",
            "Adaptive particle filtering for coronary artery segmentation from 3D CT angiograms.",
            "Probabilistic model for 3D interactive segmentation.",
            "Medical image modality classification using discrete Bayesian networks.",
            "Entropy-based correspondence improvement of interpolated skeletal models.",
            "A detection-driven and sparsity-constrained deformable model for fascia lata labeling and thigh inter-muscular adipose quantification.",
            "Non-parametric Bayesian models of response function in dynamic image sequences.",
            "3D freehand ultrasound reconstruction using a piecewise smooth Markov random field.",
            "Combining multiple expert annotations using semi-supervised learning and graph cuts for medical image segmentation.",
            "Clinically inspired analysis of dermoscopy images using a generative model.",
            "Modeling eye movement patterns to characterize perceptual skill in image-based diagnostic reasoning processes.",
            "3D Human pose estimation: A review of the literature and analysis of covariates.",
            "Semi global boundary detection.",
            "Image segmentation using the level set and improved-variation smoothing.",
            "Detection of stationary foreground objects: A survey.",
            "Adaptive maintenance scheme for codebook-based dynamic background subtraction.",
            "A mutual local-ternary-pattern based method for aligning differently exposed images.",
            "Video Classification via Weakly Supervised Sequence Modeling.",
            "Online multi-object tracking by detection based on generative appearance models.",
            "Labeled dataset for integral evaluation of moving object detection algorithms: LASIESTA.",
            "Recovering hard-to-find object instances by sampling context-based object proposals.",
            "No spare parts: Sharing part detectors for image categorization.",
            "LBO-Shape densities: A unified framework for 2D and 3D shape classification on the hypersphere of wavelet densities.",
            "R3DG features: Relative 3D geometry-based skeletal representations for human action recognition.",
            "Historical manuscript dating based on temporal pattern codebook.",
            "Application of Monte Carlo simulation with block-spin transformation based on the Mumford-Shah segmentation model to three-dimensional biomedical images.",
            "Special Issue on Visual Tracking.",
            "Visual object trapping.",
            "Temporal dynamic appearance modeling for online multi-person tracking.",
            "Tracking by switching state space models.",
            "Real-time 3D reconstruction of non-rigid shapes with a single moving camera.",
            "Clustering based ensemble correlation tracking.",
            "An on-line variational Bayesian model for multi-person tracking from cluttered scenes.",
            "Multi-object tracking via discriminative appearance modeling.",
            "Object-guided motion estimation.",
            "Robust object tracking by online Fisher discrimination boosting feature selection.",
            "Online adaptive hidden Markov model for multi-tracker fusion.",
            "Convolutional neural net bagging for online visual tracking.",
            "High-order framewise smoothness-constrained globally-optimal tracking.",
            "Human running detection: Benchmark and baseline.",
            "PICASO: PIxel correspondences and SOft match selection for real-time tracking.",
            "A local-global coupled-layer puppet model for robust online human pose tracking."
        ]
    },
    {
        "name": "CVIU",
        "year": "2015",
        "info": "2015: Volumes\n130,\n131,\n132,\n133,\n134,\n135,\n136,\n137,\n138,\n139,\n140,\n141",
        "count": 124,
        "papers": [
            "An evaluation of crowd counting methods, features and regression models.",
            "Covariance estimation for minimal geometry solvers via scaled unscented transformation.",
            "New Gradient-Spatial-Structural Features for video script identification.",
            "A new method to analyse mosaics based on Symmetry Group theory applied to Islamic Geometric Patterns.",
            "Improving label fusion in multi-atlas based segmentation by locally combining atlas selection and performance estimation.",
            "A graph based approach to hierarchical image over-segmentation.",
            "A comparison of 3D shape retrieval methods based on a large-scale benchmark supporting multimodal queries.",
            "Discovering salient regions on 3D photo-textured maps: Crowdsourcing interaction data from multitouch smartphones and tablets.",
            "Temporal validation of Particle Filters for video tracking.",
            "Semantically-driven automatic creation of training sets for object recognition.",
            "Gesture recognition corpora and tools: A scripted ground truthing method.",
            "An interactive tool for manual, semi-automatic and automatic video annotation.",
            "3D faces in motion: Fully automatic registration and statistical analysis.",
            "Nonparametric label propagation using mutual local similarity in nearest neighbors.",
            "Hierarchical Bayesian models for unsupervised scene understanding.",
            "Corrigendum to \"Mathematical morphology on hypergraphs, application to similarity and positive kernel\" [Comput. Vis. Image Understanding 117 (2013) 342-354].",
            "Large margin learning of hierarchical semantic similarity for image classification.",
            "Image super-resolution via 2D tensor regression learning.",
            "On performance limits of image segmentation algorithms.",
            "Matching-constrained active contours with affine-invariant shape prior.",
            "3-D object modeling from 2-D occluding contour correspondences by opti-acoustic stereo imaging.",
            "Efficient tracking of human poses using a manifold hierarchy.",
            "Continuous rotation invariant features for gradient-based texture classification.",
            "Spatial histograms of soft pairwise similar patches to improve the bag-of-visual-words model.",
            "Connected image processing with multivariate attributes: An unsupervised Markovian classification approach.",
            "A framework for estimating relative depth in video.",
            "Features for stochastic approximation based foreground detection.",
            "Real time non-rigid 3D surface tracking using particle filter.",
            "Focus-aided scene segmentation.",
            "Post-processing approaches for improving people detection performance.",
            "Evidence theory for high dynamic range reconstruction with linear digital cameras.",
            "Geometric leaf classification.",
            "Optical flow modeling and computation: A survey.",
            "GOLD: Gaussians of Local Descriptors for image representation.",
            "Efficient modeling of visual saliency based on local sparse representation and the use of hamming distance.",
            "Editorial introduction to the special issue on \"Image Understanding for Real-World Distributed Video Networks\" - Computer Vision and Image Understanding Journal.",
            "Analysis-by-synthesis: Pedestrian tracking with crowd simulation models in a multi-camera video network.",
            "Tracking multiple interacting targets in a camera network.",
            "Non-myopic information theoretic sensor management of a single pan-tilt-zoom camera for multiple object detection and tracking.",
            "Dynamic task decomposition for decentralized object tracking in complex scenes.",
            "Cross-calibration of time-of-flight and colour cameras.",
            "Scene shape estimation from multiple partly cloudy days.",
            "On surveillance for safety critical events: In-vehicle video networks for predictive driver assistance systems.",
            "Visual landmark recognition from Internet photo collections: A large-scale evaluation.",
            "Discriminative key-component models for interaction detection and recognition.",
            "Combine color and shape in real-time detection of texture-less objects.",
            "A comprehensive overview of methodologies and performance evaluation frameworks in 3D mesh segmentation.",
            "Two dimensional hashing for visual tracking.",
            "Adaptive stereo similarity fusion using confidence measures.",
            "Learning ramp transformation for single image super-resolution.",
            "Kernel regression in mixed feature spaces for spatio-temporal saliency detection.",
            "Metric corrections of the affine camera.",
            "Convergence analysis of multidimensional parametric deformable models.",
            "Editorial introduction to the CVIU special issue on \"Generative models in computer vision and medical imaging\".",
            "Visual Topic Network: Building better image representations for images in social media.",
            "A generative restricted Boltzmann machine based method for high-dimensional motion data modeling.",
            "Learning representative and discriminative image representation by deep appearance and spatial coding.",
            "The informed sampler: A discriminative approach to Bayesian inference in generative computer vision models.",
            "Fast convergence of regularised Region-based Mixture of Gaussians for dynamic background modelling.",
            "Discriminative structured dictionary learning with hierarchical group sparsity.",
            "Multiple-concept feature generative models for multi-label image classification.",
            "A simulation based method for vehicle motion prediction.",
            "From circle to 3-sphere: Head pose estimation by instance parameterization.",
            "Identifying multiple objects from their appearance in inaccurate detections.",
            "Background modeling for generative image models.",
            "Hierarchical temporal graphical model for head pose estimation and subsequent attribute classification in real-world videos.",
            "Free-hand sketch recognition by multi-kernel feature learning.",
            "Identifying visual attributes for object recognition from text and taxonomy.",
            "On rendering synthetic images for training an object detector.",
            "Head detection using motion features and multi level pyramid architecture.",
            "On the effectiveness of soft biometrics for increasing face verification rates.",
            "Selection of optimized features and weights on face-iris fusion using distance images.",
            "Phase correlation with sub-pixel accuracy: A comparative study in 1D and 2D.",
            "Collaborative part-based tracking using salient local predictors.",
            "Practical and accurate calibration of RGB-D cameras using spheres.",
            "Three-dimensional volume reconstruction from slice data using phase-field models.",
            "A survey on face detection in the wild: Past, present and future.",
            "Reweighted sparse subspace clustering.",
            "High order structural image decomposition by using non-linear and non-convex regularizing objectives.",
            "Efficient height measurements in single images based on the detection of vanishing points.",
            "A statistical method for line segment detection.",
            "Bundle adjustment using aerial images with two-stage geometric verification.",
            "Introduction to the CVIU special issue on \"Parts and Attributes: Mid-level representation for object recognition, scene classification and object detection\".",
            "Improving scene attribute recognition using web-scale object detectors.",
            "Factorized appearances for object detection.",
            "Adding discriminative power to a generative hierarchical compositional model using histograms of compositions.",
            "Part level transfer regularization for enhancing exemplar SVMs.",
            "Kinect range sensing: Structured-light versus Time-of-Flight Kinect.",
            "Location recognition over large time lags.",
            "Histogram of 3D Facets: A depth descriptor for human action and hand gesture recognition.",
            "Sparsity-driven bandwidth-efficient decentralized tracking in visual sensor networks.",
            "Accurate eye localization in the Short Waved Infrared Spectrum through summation range filters.",
            "Part-based deformable object detection with a single sketch.",
            "Factorization of view-object manifolds for joint object recognition and pose estimation.",
            "Block world reconstruction from spherical stereo image pairs.",
            "Light field distortion feature for transparent object classification.",
            "Landmark localization on 3D/4D range data using a shape index-based statistical shape model with global and local constraints.",
            "Semi-supervised learning and feature evaluation for RGB-D object recognition.",
            "Local binary patterns on triangular meshes: Concept and applications.",
            "Color constancy by combining low-mid-high level image cues.",
            "Rotation and translation covariant match kernels for image retrieval.",
            "Spectral gradient fields embedding for nonrigid shape matching.",
            "Weakly supervised motion segmentation with particle matching.",
            "Visual tracking using spatially weighted likelihood of Gaussian mixtures.",
            "A data-driven approach for tag refinement and localization in web videos.",
            "Recognizing complex instrumental activities of daily living using scene information and fuzzy logic.",
            "An efficient multimodal 2D + 3D feature-based approach to automatic facial expression recognition.",
            "Adaptive facial point detection and emotion recognition for a humanoid robot.",
            "Uncertainty analysis of the DLT-Lines calibration algorithm for cameras with radial distortion.",
            "Hierarchical structure-and-motion recovery from uncalibrated images.",
            "Incremental learning to segment micrographs.",
            "Computational caricaturization of surfaces.",
            "Optimizing the decomposition for multiple foreground cosegmentation.",
            "Discriminative part model for visual recognition.",
            "Real-time pose estimation of rigid objects in heavily cluttered environments.",
            "Object motion analysis description in stereo video content.",
            "A robust non-rigid point set registration method based on asymmetric gaussian representation.",
            "MODS: Fast and robust method for two-view matching.",
            "Editorial.",
            "Structured forests for pixel-level hand detection and hand part labelling.",
            "Continuous sign language recognition: Towards large vocabulary statistical recognition systems handling multiple signers.",
            "Human-computer interaction based on visual hand-gesture recognition using volumetric spatiograms of local binary patterns.",
            "A framework for live and cross platform fingerspelling recognition using modified shape matrix variants on depth silhouettes.",
            "Recent methods and databases in vision-based hand gesture recognition: A review."
        ]
    },
    {
        "name": "CVIU",
        "year": "2014",
        "info": "2014: Volumes\n118,\n119,\n120,\n121,\n122,\n123,\n124,\n125,\n126,\n127,\n128,\n129",
        "count": 130,
        "papers": [
            "Special section on learning from multiple evidences for large scale multimedia analysis.",
            "Automatic extraction of relevant video shots of specific actions exploiting Web data.",
            "ObjectPatchNet: Towards scalable and semantic image annotation and retrieval.",
            "Social-oriented visual image search.",
            "Tag-Saliency: Combining bottom-up and top-down information for saliency detection.",
            "Multiview Hessian discriminative sparse coding for image annotation.",
            "Combining histogram-wise and pixel-wise matchings for kernel tracking through constrained optimization.",
            "Spatio-temporal weighting in local patches for direct estimation of camera motion in video stabilization.",
            "Bayesian perspective for the registration of multiple 3D views.",
            "Efficient keyframe-based real-time camera tracking.",
            "Detecting, segmenting and tracking unknown objects using multi-label MRF inference.",
            "Object tracking using learned feature manifolds.",
            "Coarse-to-fine skeleton extraction for high resolution 3D meshes.",
            "Face recognition for web-scale datasets.",
            "A visualization framework for team sports captured using multiple static cameras.",
            "Adaptive estimation of visual smoke detection parameters based on spatial data and fire risk index.",
            "ChESS - Quick and robust detection of chess-board features.",
            "Joint view-identity manifold for infrared target tracking and recognition.",
            "Facial expression recognition based on anatomy.",
            "Comparison of multi-label graph cuts method and Monte Carlo simulation with block-spin transformation for the piecewise constant Mumford-Shah segmentation model.",
            "Matching mixtures of curves for human action recognition.",
            "Co-trained generative and discriminative trackers with cascade particle filter.",
            "A comparison of methods for sketch-based 3D shape retrieval.",
            "A method for the evaluation of projective geometric consistency in weakly calibrated stereo with application to point matching.",
            "Take your eyes off the ball: Improving ball-tracking by focusing on team play.",
            "Orthogonal locally discriminant spline embedding for plant leaf recognition.",
            "Visual estimation of pointed targets for robot guidance via fusion of face pose and hand orientation.",
            "TouchCut: Fast image and video segmentation using single-touch interaction.",
            "Towards large-scale geometry indexing by feature selection.",
            "Macrofeature layout selection for pedestrian localization and its acceleration using GPU.",
            "Real-time facial shape recovery from a single image under general, unknown lighting by rank relaxation.",
            "Efficient and robust multi-template tracking using multi-start interactive hybrid search.",
            "Efficient semantic image segmentation with multi-class ranking prior.",
            "Random walks in directed hypergraphs and application to semi-supervised image segmentation.",
            "Boosting masked dominant orientation templates for efficient object detection.",
            "A new descriptor resistant to affine transformation and monotonic intensity change.",
            "Exploiting projective geometry for view-invariant monocular human motion analysis in man-made environments.",
            "Persistent tracking of static scene features using geometry.",
            "Special section on computational topology in image context.",
            "Topological modifications and hierarchical representation of cell complexes in arbitrary dimensions.",
            "Suspension models for testing shape similarity methods.",
            "Towards topological analysis of high-dimensional feature spaces.",
            "Topological evaluation of volume reconstructions by voxel carving.",
            "Classification of hepatic lesions using the matching metric.",
            "Comparing shapes through multi-scale approximations of the matching distance.",
            "Identifying the writer of ancient inscriptions and Byzantine codices. A novel approach.",
            "Estimating scene flow using an interconnected patch surface model with belief-propagation inference.",
            "Soft label based Linear Discriminant Analysis for image recognition and retrieval.",
            "Surface embedding narrow volume reconstruction from unorganized points.",
            "Automatic detection of calibration grids in time-of-flight images.",
            "Special section on background models comparison.",
            "A comprehensive review of background subtraction algorithms evaluated with synthetic and real videos.",
            "Robust PCA via Principal Component Pursuit: A review for a comparative evaluation in video surveillance.",
            "A self-adaptive Gaussian mixture model.",
            "Biologically-inspired robust motion segmentation using mutual information.",
            "The 3dSOBS+ algorithm for moving object detection.",
            "A texton-based kernel density estimation approach for background modeling under extreme conditions.",
            "Object detection based on spatiotemporal background models.",
            "SnooperText: A text detection system for automatic indexing of urban scenes.",
            "Conic epipolar constraints from affine correspondences.",
            "A performance evaluation of statistical tests for edge detection in textured images.",
            "Unsupervised edge map scoring: A statistical complexity approach.",
            "Exploiting relationship between attributes for improved face verification.",
            "On the use of supervised features for unsupervised image categorization: An evaluation.",
            "Semantic video scene segmentation and transfer.",
            "Recursive head reconstruction from multi-view video sequences.",
            "Action recognition using global spatio-temporal features derived from sparse representations.",
            "Image classification by non-negative sparse coding, correlation constrained low-rank and sparse decomposition.",
            "Robust obstacle detection based on a novel disparity calculation method and G-disparity.",
            "View invariant action recognition using projective depth.",
            "Efficient algorithm for finding the exact minimum barrier distance.",
            "Guest Editorial: Special issue on large scale multimedia semantic indexing.",
            "FSpH: Fitted spectral hashing for efficient similarity search.",
            "Semi-supervised multi-graph hashing for scalable similarity search.",
            "Statistical quantization for similarity search.",
            "Fast and accurate near-duplicate image search with affinity propagation on the ImageWeb.",
            "Image tag completion via dual-view linear sparse reconstructions.",
            "Image tag refinement by regularized latent Dirichlet allocation.",
            "Projective Matrix Factorization with unified embedding for social image tagging.",
            "Collaborative error reduction for hierarchical classification.",
            "Efficient dictionary learning for visual categorization.",
            "GLocal tells you more: Coupling GLocal structural for feature selection with sparsity for image and video classification.",
            "Recommendations for recognizing video events by concept vocabularies.",
            "Cross-modal domain adaptation for text-based regularization of image semantics in image retrieval systems.",
            "Visual object tracking using spatial Context Information and Global tracking skills.",
            "Optimal illumination directions for faces and rough surfaces for single and multiple light imaging using class-specific prior knowledge.",
            "An integrated neuromimetic architecture for direct motion interpretation in the log-polar domain.",
            "Unsupervised visual hull extraction in space, time and light domains.",
            "Active subclustering.",
            "Hybrid structural and texture distinctiveness vector field convolution for region segmentation.",
            "Online domain-shift learning and object tracking based on nonlinear dynamic models and particle filters on Riemannian manifolds.",
            "On the relevance of sparsity for image classification.",
            "Rao-Blackwellized particle filtering with Gaussian mixture models for robust visual tracking.",
            "Monocular template-based 3D surface reconstruction: Convex inextensible and nonconvex isometric methods.",
            "Capturing relative motion and finding modes for action recognition in the wild.",
            "3D to 2D bijection for spherical objects under equidistant fisheye projection.",
            "Computer analysis of face beauty: A survey.",
            "Sampson distance based joint estimation of multiple homographies with uncalibrated cameras.",
            "Quadra-embedding: Binary code embedding with low quantization error.",
            "Stereo reconstruction using high-order likelihoods.",
            "Fast and globally convex multiphase active contours for brain MRI segmentation.",
            "SHOT: Unique signatures of histograms for surface and texture description.",
            "Multiview feature distributions for object detection and continuous pose estimation.",
            "Using image segmentation for evaluating 3D statistical shape models built with groupwise correspondence optimization.",
            "Fully automatic segmentation of AP pelvis X-rays via random forest regression with efficient feature selection and hierarchical sparse shape composition.",
            "Radial distortion invariants and lens evaluation under a single-optical-axis omnidirectional camera.",
            "The reconstructed residual error: A novel segmentation evaluation measure for reconstructed images in tomography.",
            "Gait recognition by fluctuations.",
            "Scale recovery in multicamera cluster SLAM with non-overlapping fields of view.",
            "Unitary torus model for conical mirror based catadioptric system.",
            "The Zeta-image, illuminant estimation, and specularity manipulation.",
            "Evaluation of video activity localizations integrating quality and quantity measurements.",
            "Estimation of human body shape and posture under clothing.",
            "HTS and HTSn: New shape descriptors based on Hough transform statistics.",
            "Tracking object poses in the context of robust body pose estimates.",
            "Background subtraction for the moving camera: A geometric approach.",
            "Review of statistical shape spaces for 3D data with comparative analysis for human faces.",
            "Slice representation of range data for head pose estimation.",
            "Joint multi-person detection and tracking from overlapping cameras.",
            "Exploiting local linear geometric structure for identifying correct matches.",
            "Refinement of human silhouette segmentation in omni-directional indoor videos.",
            "A statistical feature based approach to distinguish PRCG from photographs.",
            "Augmenting analytic SFM filters with frame-to-frame features.",
            "Online action recognition using covariance of shape and motion.",
            "Multigrid convergent principal curvature estimators in digital geometry.",
            "From skeleton branches to object parts.",
            "Local and global uncertainty in binary tomographic reconstruction.",
            "SDART: An algorithm for discrete tomography from noisy projections.",
            "On the family of shortest isothetic paths in a digital object - An algorithm with applications.",
            "Scale filtered Euclidean medial axis and its hierarchy."
        ]
    },
    {
        "name": "CVIU",
        "year": "2013",
        "info": "2013: Volume 117",
        "count": 132,
        "papers": [
            "Modeling dynamic swarms.",
            "Efficient and accurate face detection using heterogeneous feature descriptors and feature selection.",
            "Adaptive Census Transform: A novel hardware-oriented stereovision algorithm.",
            "Occlusion cues for image scene layering.",
            "Continuous rotation invariant local descriptors for texton dictionary-based texture classification.",
            "Biologically inspired task oriented gist model for scene classification.",
            "Unbiased extraction of lines with parabolic and Gaussian profiles.",
            "Joint estimation of segmentation and structure from motion.",
            "Symmetry-driven accumulation of local features for human characterization and re-identification.",
            "A multiple object geometric deformable model for image segmentation.",
            "meshSIFT: Local surface features for 3D face recognition under expression variations and partial data.",
            "Human eyebrow recognition in the matching-recognizing framework.",
            "Text extraction from scene images by character appearance and structure modeling.",
            "Presmoothing effects in Artificial Color image segmentation.",
            "Fuzzy-rough feature selection aided support vector machines for Mars image classification.",
            "Information-theoretic selection of high-dimensional spectral features for structural recognition.",
            "Track based relevance feedback for tracing persons in surveillance videos.",
            "Tumor growth parameters estimation and source localization from a unique time point: Application to low-grade gliomas.",
            "Generative face alignment through 2.5D active appearance models.",
            "A learning framework for the optimization and automation of document binarization methods.",
            "Detecting end-effectors on 2.5D data using geometric deformable models: Application to human pose estimation.",
            "Window annealing for pixel-labeling problems.",
            "Special Issue on Discrete Geometry for Computer Imagery.",
            "Dynamic angle selection in binary tomography.",
            "A decomposition theorem for homogeneous sets with respect to diamond probes.",
            "Approximate partitioning of 2D objects into orthogonally convex components.",
            "Mathematical morphology on hypergraphs, application to similarity and positive kernel.",
            "Topological maps and robust hierarchical Euclidean skeletons in cubical complexes.",
            "Morphological filtering on graphs.",
            "Recursive computation of minimum-length polygons.",
            "Combinatorial structure of rigid transformations in 2D digital images.",
            "Minimal-delay distance transform for neighborhood-sequence distances in 2D and 3D.",
            "Multi-resolutive sparse approximations of d-dimensional data.",
            "The minimum barrier distance.",
            "A combined multi-scale/irregular algorithm for the vectorization of noisy digital contours.",
            "Special issue on visual concept detection in the MIRFLICKR/ImageCLEF benchmark.",
            "Pooling in image representation: The visual codeword point of view.",
            "Enhanced representation and multi-task learning for image annotation.",
            "Comparison of mid-level feature coding approaches and pooling strategies in visual concept detection.",
            "Multimodal recognition of visual concepts using histograms of textual concepts and selective weighted late fusion scheme.",
            "GC-ASM: Synergistic integration of graph-cut and active shape model strategies for medical image segmentation.",
            "Feature extraction using two-dimensional neighborhood margin and variation embedding.",
            "Sensitivity analysis for biometric systems: A methodology based on orthogonal experiment designs.",
            "Alternative search techniques for face detection using location estimation and binary features.",
            "Segmentation-based tracking by support fusion.",
            "View invariant action recognition using weighted fundamental ratios.",
            "Adjustable linear models for optic flow based obstacle avoidance.",
            "Secrets of adaptive support weight techniques for local stereo matching.",
            "A survey of video datasets for human action and activity recognition.",
            "A spatio-temporal pyramid matching for video retrieval.",
            "Robust image retrieval with hidden classes.",
            "Efficient image signatures and similarities using tensor products of local descriptors.",
            "Occlusion filling in stereo: Theory and experiments.",
            "Regional appearance modeling based on the clustering of intensity profiles.",
            "Interactive object modelling based on piecewise planar surface patches.",
            "Effective elliptic fitting for iris normalization.",
            "Color texture analysis using CFA chromatic co-occurrence matrices.",
            "Tracking in object action space.",
            "A performance evaluation of gradient field HOG descriptor for sketch based image retrieval.",
            "AVCD-FRA: A novel solution to automatic video cut detection using fuzzy-rule-based approach.",
            "Conciliating syntactic and semantic constraints for multi-phase and multi-channel region segmentation.",
            "50 Years of object recognition: Directions forward.",
            "A real time algorithm for people tracking using contextual reasoning.",
            "Calibration of mirror position and extrinsic parameters in axial non-central catadioptric systems.",
            "Particle filters and occlusion handling for rigid 2D-3D pose tracking.",
            "Unified Dictionary Learning and Region Tagging with Hierarchical Sparse Representation.",
            "Determining shape and motion from non-overlapping multi-camera rig: A direct approach using normal flows.",
            "Special issue on Shape Modeling in Medical Image Analysis.",
            "A survey of shaped-based registration and segmentation techniques for cardiac images.",
            "Segmentation of the left ventricle in cardiac cine MRI using a shape-constrained snake model.",
            "Mean shift based gradient vector flow for image segmentation.",
            "Global structure constrained local shape prior estimation for medical image segmentation.",
            "Graph cut segmentation with a statistical shape model in cardiac MRI.",
            "Statistical analysis of manual segmentations of structures in medical images.",
            "Simultaneous segmentation of prostatic zones using Active Appearance Models with multiple coupled levelsets.",
            "3D anatomical shape atlas construction using mesh quality preserved deformable models.",
            "Hierarchical segmentation and identification of thoracic vertebra using learning-based edge detection and coarse-to-fine deformable model.",
            "Multiphase segmentation using an implicit dual shape prior: Application to detection of left ventricle in cardiac MRI.",
            "2D/3D image registration using regression learning.",
            "Ricci flow-based spherical parameterization and surface registration.",
            "Free-form image registration regularized by a statistical shape model: application to organ segmentation in cervical MR.",
            "Robust measurement of individual localized changes to the aging hippocampus.",
            "Statistical shape model for manifold regularization: Gleason grading of prostate histology.",
            "Multi-agent stochastic level set method in image segmentation.",
            "Dynamic texture segmentation based on deterministic partially self-avoiding walks.",
            "Structure preserving non-negative matrix factorization for dimensionality reduction.",
            "Object detection, shape recovery, and 3D modelling by depth-encoded hough voting.",
            "Special Section in Celebration of Professor J.K. Aggarwal.",
            "Junction assisted 3D pose retrieval of untextured 3D models in monocular images.",
            "Tracking with a mixed continuous-discrete Conditional Random Field.",
            "Cooperative passers-by tracking with a mobile robot and external cameras.",
            "Hough-based tracking of non-rigid objects.",
            "Multi-target tracking on confidence maps: An application to people tracking.",
            "TRASMIL: A local anomaly detection framework based on trajectory segmentation and multi-instance learning.",
            "Recursive non-rigid structure from motion with online learned shape prior.",
            "Personal driving diary: Automated recognition of driving events from first-person videos.",
            "Modeling multi-object interactions using \"string of feature graphs\".",
            "Hierarchical multi-channel hidden semi Markov graphical models for activity recognition.",
            "A unified tree-based framework for joint action localization, recognition and segmentation.",
            "Large scale continuous visual event recognition using max-margin Hough transformation framework.",
            "Learning and parsing video events with goal and intent prediction.",
            "Using objective ground-truth labels created by multiple annotators for improved video classification: A comparative study.",
            "Attention selection using global topological properties based on pulse coupled neural network.",
            "An adaptive spatial information-theoretic fuzzy clustering algorithm for image segmentation.",
            "Adaptive diffusion flow active contours for image segmentation.",
            "An on-line, real-time learning method for detecting anomalies in videos using spatio-temporal compositions.",
            "Geodesic voting for the automatic extraction of tree structures. Methods and applications.",
            "Flexible calibration of structured-light systems projecting point patterns.",
            "Understanding leaves in natural images - A model-based approach for tree species identification.",
            "Head direction estimation from low resolution images with scene adaptation.",
            "Iris image reconstruction from binary templates: An efficient probabilistic approach based on genetic algorithms.",
            "Feature-domain super-resolution for iris recognition.",
            "Camera and light calibration from reflections on a sphere.",
            "EM-GPA: Generalized Procrustes analysis with hidden variables for 3D shape modeling.",
            "Cooperative estimation of human motion and surfaces using multiview videos.",
            "Multi-object reconstruction from dynamic scenes: An object-centered approach.",
            "A novel background subtraction method based on color invariants.",
            "Invariant representation of facial expressions for blended expression recognition on unknown subjects.",
            "Markov Random Field modeling, inference & learning in computer vision & image understanding: A survey.",
            "Manifold surface reconstruction of an environment from sparse Structure-from-Motion data.",
            "Special section on Advances in Machine Vision Beyond the Visible Spectrum (BVS).",
            "A coarse-to-fine IP-driven registration for pose estimation from single ultrasound image.",
            "Finite asymmetric generalized Gaussian mixture models learning for infrared object detection.",
            "An optimisation approach to the recovery of reflection parameters from a single hyperspectral image.",
            "Face recognition in low resolution thermal images.",
            "Elastic shapes models for improving segmentation of object boundaries in synthetic aperture sonar images.",
            "Tracking hand rotation and various grasping gestures from an IR camera using extended cylindrical manifold embedding.",
            "A multimodal temporal panorama approach for moving vehicle detection, reconstruction and classification.",
            "A LSS-based registration of stereo thermal-visible videos of multiple people using belief propagation.",
            "Multi-spectral dataset and its application in saliency detection.",
            "A simultaneous sample-and-filter strategy for robust multi-structure model fitting.",
            "Gait recognition based on shape and motion analysis of silhouette contours."
        ]
    },
    {
        "name": "CVIU",
        "year": "2012",
        "info": "2012: Volume 116",
        "count": 90,
        "papers": [
            "Special issue on Virtual Representations and Modeling of Large-scale environments (VRML).",
            "Large-scale, dense city reconstruction from user-contributed photos.",
            "Improving sub-pixel accuracy for long range stereo.",
            "A systematic approach for 2D-image to 3D-range registration in urban environments.",
            "Optimal pixel aspect ratio for enhanced 3D TV visualization.",
            "Low-dimensional and comprehensive color texture description.",
            "Images as sets of locally weighted features.",
            "Improved feature extraction and matching in urban environments based on 3D viewpoint normalization.",
            "Intrinsic nonlinear multiscale image decomposition: A 2D empirical mode decomposition-like tool.",
            "Calibration of omnidirectional cameras in practice: A comparison of methods.",
            "Combining algorithms for automatic detection of optic disc and macula in fundus images.",
            "Sequential model-based segmentation and recognition of image structures driven by visual features and spatial relations.",
            "Fusing color and shape descriptors in the recognition of degraded iris images acquired at visible wavelengths.",
            "Robust moving object detection against fast illumination change.",
            "A suspicious behaviour detection using a context space model for smart surveillance systems.",
            "An iterative integrated framework for thermal-visible image registration, sensor fusion, and people tracking for video surveillance applications.",
            "Aperture access and manipulation for computational imaging.",
            "Visual synonyms for landmark image retrieval.",
            "Improving sub-pixel correspondence through upsampling.",
            "A simple boundary extraction technique for irregular pupil localization with orthogonal polynomials.",
            "IFTrace: Video segmentation of deformable objects using the Image Foresting Transform.",
            "A new graph matching method for point-set correspondence using the EM algorithm and Softassign.",
            "Semantic Understanding of Human Behaviors in Image Sequences: From video-surveillance to video-hermeneutics.",
            "Loveparade 2010: Automatic video analysis of a crowd disaster.",
            "Multi-scale and real-time non-parametric approach for anomaly detection and localization.",
            "Estimating pose of articulated objects using low-level motion.",
            "Multi-view human movement recognition based on fuzzy distances and linear discriminant analysis.",
            "Learning semantic features for action recognition via diffusion maps.",
            "Integrating local action elements for action analysis.",
            "Selective spatio-temporal interest points.",
            "Spatiotemporal analysis of human activities for biometric authentication.",
            "Bayesian filter based behavior recognition in workflows allowing for user feedback.",
            "Modeling and prediction of driver behavior by foot gesture analysis.",
            "Building semantic scene models from unconstrained video.",
            "Cognitive visual tracking and camera control.",
            "Commute time guided transformation for feature extraction.",
            "Collective-reward based approach for detection of semi-transparent objects in single images.",
            "Gaussian process motion graph models for smooth transitions among multiple actions.",
            "Incorporating multiple distance spaces in optimum-path forest classification to improve feedback-based learning.",
            "A sparse curvature-based detector of affine invariant blobs.",
            "Composed complex-cue histograms: An investigation of the information content in receptive field based image descriptors for object recognition.",
            "Adaptive colour constancy algorithm using discrete wavelet transform.",
            "Range map superresolution-inpainting, and reconstruction from sparse data.",
            "Action recognition via bio-inspired features: The richness of center-surround interaction.",
            "A review and evaluation of methods estimating ego-motion.",
            "Multiple people tracking and pose estimation with occlusion estimation.",
            "Human attributes from 3D pose tracking.",
            "A local spectral distribution approach to face recognition.",
            "A large margin framework for single camera offline tracking with hybrid cues.",
            "ADR shape descriptor - Distance between shape centroids versus shape diameter.",
            "A model for the qualitative description of images based on visual and spatial features.",
            "Self-calibration of hybrid central catadioptric and perspective cameras.",
            "Class consistent k-means: Application to face and action recognition.",
            "Efficient multi-camera vehicle detection, tracking, and identification in a tunnel surveillance application.",
            "Visual motion ambiguities of a plane in 2-D FS sonar motion sequences.",
            "Translational photometric alignment of single-view image sequences.",
            "Pose robust face tracking by combining view-based AAMs and temporal filters.",
            "Surface reflectance and normal estimation from photometric stereo.",
            "Algorithms for computing the maximum weight region decomposable into elementary shapes.",
            "Reconstructing and analyzing periodic human motion from stationary monocular views.",
            "Fragments based tracking with adaptive cue integration.",
            "Discovering hierarchical object models from captioned images.",
            "Object recognition using discriminative parts.",
            "Reference consistent reconstruction of 3D cloth surface.",
            "A robust multi-scale integration method to obtain the depth from gradient maps.",
            "A study on local photometric models and their application to robust tracking.",
            "Stereo matching using weighted dynamic programming on a single-direction four-connected tree.",
            "Semi-supervised facial landmark annotation.",
            "A semantic-based probabilistic approach for real-time video event recognition.",
            "Improving the robustness of variational optical flow through tensor voting.",
            "Backtracking: Retrospective multi-target tracking.",
            "MDS-based segmentation model for the fusion of contour and texture cues in natural images.",
            "Probabilistic cost model for nearest neighbor search in image retrieval.",
            "Scale-space texture description on SIFT-like textons.",
            "Higher-order SVD analysis for crowd density estimation.",
            "Two dimensional synthetic face generation and verification using set estimation technique.",
            "Self-calibration of wireless cameras with restricted degrees of freedom.",
            "Brain tissue MR-image segmentation via optimum-path forest clustering.",
            "Tensor scale: An analytic approach with efficient computation and applications.",
            "Fuzzy spatial constraints and ranked partitioned sampling approach for multiple object tracking.",
            "Robust pose invariant face recognition using coupled latent space discriminant analysis.",
            "Evaluating a color-based active basis model for object recognition.",
            "Non-rigid 3D shape tracking from multiview video.",
            "A novel framework for motion segmentation and tracking by clustering incomplete trajectories.",
            "Evolutionary Hough Games for coherent object detection.",
            "Fast and accurate approximation of digital shape thickness distribution in arbitrary dimension.",
            "A distance measure between labeled combinatorial maps.",
            "The active geometric shape model: A new robust deformable shape model and its applications.",
            "3D reconstruction of cultural heritages: Challenges and advances on precise mesh integration.",
            "An adaptive sample count particle filter."
        ]
    },
    {
        "name": "CVIU",
        "year": "2011",
        "info": "2011: Volume 115",
        "count": 136,
        "papers": [
            "Metric reconstruction of planes utilizing off-the-plane features.",
            "Unscented feature tracking.",
            "Behaviour of SFM algorithms with erroneous calibration.",
            "Adaptive learning of multi-subspace for foreground detection under illumination changes.",
            "On affine registration of planar point sets using complex numbers.",
            "JPEG2000 ROI coding through component priority for digital mammography.",
            "Combined feature evaluation for adaptive visual object tracking.",
            "Visual object-action recognition: Inferring object affordances from human demonstration.",
            "Shape-based image segmentation through photometric stereo.",
            "Unsupervised learning of background modeling parameters in multicamera systems.",
            "Bayesian discounting of camera parameter uncertainty for optimal 3D reconstruction from images.",
            "Learning a nonlinear distance metric for supervised region-merging image segmentation.",
            "A new pose-based representation for recognizing actions from multiple cameras.",
            "Advanced Radon transform using generalized interpolated Fourier method for straight line detection.",
            "Shape reconstruction and texture sampling by active rectification and virtual view synthesis.",
            "Robust sequence alignment for actor-object interaction recognition: Discovering actor-object states.",
            "Automatic face interpretation using fast 3D illumination-based AAM models.",
            "Fast multiple-view L2 triangulation with occlusion handling.",
            "A survey of vision-based methods for action representation, segmentation and recognition.",
            "Integration of bottom-up/top-down approaches for 2D pose estimation using probabilistic Gaussian modelling.",
            "Kernel feature selection to fuse multi-spectral MRI images for brain tumor segmentation.",
            "6DOF entropy minimization SLAM for stereo-based wearable devices.",
            "Corrigendum to \"Narrow band region-based active contours and surfaces for 2D and 3D segmentation\" [Computer Vision and Image Understanding 113 (2009) 946-965].",
            "Corrigendum to \"Accurate hardware-based stereo vision\" [Computer Vision and Image Understanding 114 (2010) 1303-1316.",
            "Special issue on feature-oriented image and video computing for extracting contexts and semantics.",
            "3D human pose recovery from image by efficient visual feature selection.",
            "Tensor-based locally maximum margin classifier for image and video classification.",
            "A unified context assessing model for object categorization.",
            "Anomalous video event detection using spatiotemporal context.",
            "Learning spatio-temporal dependency of local patches for complex motion segmentation.",
            "Summarizing tourist destinations by mining user-generated travelogues and photos.",
            "Boosting part-sense multi-feature learners toward effective object detection.",
            "Multifactor feature extraction for human movement recognition.",
            "Aurora image segmentation by combining patch and texture thresholding.",
            "Modeling spatial and semantic cues for large-scale near-duplicated image retrieval.",
            "Towards a more discriminative and semantic visual vocabulary.",
            "Action recognition with appearance-motion features and fast search trees.",
            "Silhouette-based gesture and action recognition via modeling trajectories on Riemannian shape manifolds.",
            "Dynamic soft encoded patterns for facial event analysis.",
            "Algebraic error analysis of collinear feature points for camera parameter estimation.",
            "A wearable gaze tracking system for children in unconstrained environments.",
            "On guided model-based analysis for ear biometrics.",
            "Dimensionality reduction using a Gaussian Process Annealed Particle Filter for tracking and classification of articulated body motions.",
            "Diffusion maps as a framework for shape modeling.",
            "Optimal-flow minimum-cost correspondence assignment in particle flow tracking.",
            "Local binary patterns for multi-view facial expression recognition.",
            "Special issue on 3D imaging and modelling.",
            "Optical signal processing with illumination-encoded filters.",
            "Reliable camera pose and calibration from a small set of point and line correspondences: A probabilistic approach.",
            "Single and sparse view 3D reconstruction by learning shape priors.",
            "Single viewpoint model completion of symmetric objects for digital inspection.",
            "Disparity map refinement and 3D surface smoothing via directed anisotropic diffusion.",
            "GPU-friendly multi-view stereo reconstruction using surfel representation and graph cuts.",
            "Online loop closure for real-time interactive 3D scanning.",
            "Robustly registering range images using local distribution of albedo.",
            "Markerless reconstruction and synthesis of dynamic facial expressions.",
            "Local shape descriptor selection for object recognition in range data.",
            "Sampled medial loci for 3D shape representation.",
            "Measuring 3D shape similarity by graph-based matching of the medial scaffolds.",
            "A framework for comparing different image segmentation methods and its use in studying equivalences between level set and fuzzy connectedness frameworks.",
            "Stochastic approximation for background modelling.",
            "Exploiting local dependencies with spatial-scale space (S-Cube) for near-duplicate retrieval.",
            "Markov random field based phase demodulation of interferometric images.",
            "Particle filter-based visual tracking with a first order dynamic model and uncertainty adaptation.",
            "An energy-based model for region-labeling.",
            "Iris recognition by fusing different representations of multi-scale Taylor expansion.",
            "Matching 2D and 3D articulated shapes using the eccentricity transform.",
            "Display-camera calibration using eye reflections and geometry constraints.",
            "Wide-area augmented reality using camera tracking and mapping in multiple regions.",
            "Toward automated evaluation of interactive segmentation.",
            "Hierarchical Kalman-particle filter with adaptation to motion changes for object tracking.",
            "Special issue on Graph-Based Representations in Computer Vision.",
            "Learning graph prototypes for shape recognition.",
            "A generic framework for median graph computation based on a recursive embedding approach.",
            "Models and algorithms for computing the common labelling of a set of attributed graphs.",
            "Graph quantization.",
            "Graph attribute embedding via Riemannian submersion learning.",
            "Efficient many-to-many feature matching under the l1 norm.",
            "Graph-based quadratic optimization: A fast evolutionary approach.",
            "Polynomial algorithms for subisomorphism of nD open combinatorial maps.",
            "Invariant representative cocycles of cohomology generators using irregular graph pyramids.",
            "Learning invariant structure for object identification by using graph methods.",
            "Graph-based markerless registration of city maps using geometric hashing.",
            "Bone graphs: Medial shape parsing and abstraction.",
            "2.5D Elastic graph matching.",
            "Pose-invariant face recognition by matching on multi-resolution MRFs linked by supercoupling transform.",
            "Tracking by means of geodesic region models applied to multidimensional and complex medical images.",
            "Detecting anomalies in people's trajectories using spectral graph analysis.",
            "Automatic registration and fast volume reconstruction from serial histology sections.",
            "Unsupervised texture-based image segmentation through pattern discovery.",
            "Color texture image segmentation based on neutrosophic set and wavelet transformation.",
            "An M-estimator for high breakdown robust estimation in computer vision.",
            "Deformable probability maps: Probabilistic shape and appearance-based object segmentation.",
            "The Global-Local transformation for noise resistant shape representation.",
            "Object categorization using bone graphs.",
            "Robust line detection using two-orthogonal direction image scanning.",
            "Robust real-time multi-user pupil detection and tracking under various illumination and large-scale head motion.",
            "Iris recognition based on elastic graph matching and Gabor wavelets.",
            "Parametric models of linear prediction error distribution for color texture and satellite image segmentation.",
            "Optical flow estimation from multichannel spherical image decomposition.",
            "Real-time adaptive obstacle detection based on an image database.",
            "A comparative study of object-level spatial context techniques for semantic image analysis.",
            "Region-based tampering detection and recovery using homogeneity analysis in quality-sensitive imaging.",
            "Grouping/degrouping point process, a point process driven by geometrical and topological properties of a partition in regions.",
            "A comparative study of state-of-the-art evolutionary image registration methods for 3D modeling.",
            "Comparing two sets of corresponding six degree of freedom data.",
            "Human motion capture using scalable body models.",
            "Markov surfaces: A probabilistic framework for user-assisted three-dimensional image segmentation.",
            "Multiscale illumination normalization for face recognition using dual-tree complex wavelet transform in logarithm domain.",
            "Multi-camera active surveillance of an articulated human form - An implementation strategy.",
            "Fast human detection from joint appearance and foreground feature subset covariances.",
            "An experimental study of four variants of pose clustering from dense range data.",
            "Bootstrap optical flow confidence and uncertainty measure.",
            "Road tracking using particle filters with partition sampling and auxiliary variables.",
            "Segmentation of objects in a detection window by Nonparametric Inhomogeneous CRFs.",
            "Nearest-Neighbor based Metric Functions for indoor scene recognition.",
            "Genetically identical irises have texture similarity that is not detected by iris biometrics.",
            "Analysis and evaluation of a general camera model.",
            "A semi-interactive panorama based 3D reconstruction framework for indoor scenes.",
            "Planar shape representation and matching under projective transformation.",
            "Edge-preserving color image denoising through tensor voting.",
            "Graph theory based segmentation of traced boundary into open and closed sub-sections.",
            "3D Human model adaptation by frame selection and shape-texture optimization.",
            "Generating fuzzy edge images from gradient magnitudes.",
            "3D Scene interpretation by combining probability theory and logic: The tower of knowledge.",
            "Special issue on Optimization for vision, graphics and medical imaging: Theory and applications.",
            "Stochastic global optimization for robust point set registration.",
            "Composite splitting algorithms for convex optimization.",
            "A hybrid approach for MRF optimization problems: Combination of stochastic sampling and deterministic algorithms.",
            "Combinatorial preconditioners and multilevel solvers for problems in computer vision and image processing.",
            "A framework for intrinsic image processing on surfaces.",
            "Content aware video manipulation.",
            "Global optimization for estimating a multiple-lobe analytical BRDF.",
            "A combined segmentation and registration framework with a nonlinear elasticity smoother.",
            "Optimization of local shape and appearance probabilities for segmentation of knee cartilage in 3-D MR images.",
            "Parallel and distributed vision algorithms using dual decomposition."
        ]
    },
    {
        "name": "CVIU",
        "year": "2010",
        "info": "2010: Volume 114",
        "count": 117,
        "papers": [
            "A 3-D Search engine based on Fourier series.",
            "On the sensitivity analysis of camera calibration from images of spheres.",
            "Parasite detection and identification for automated thin blood film malaria diagnosis.",
            "Automated assessment of breast tissue density in digital mammograms.",
            "Invariant texture classification for biomedical cell specimens via non-linear polar map filtering.",
            "Non-Gaussian model-based fusion of noisy images in the wavelet domain.",
            "Content-based retrieval of logo and trademarks in unconstrained color image databases using Color Edge Gradient Co-occurrence Histograms.",
            "Synergistic arc-weight estimation for interactive image segmentation using graphs.",
            "Dynamic visual attention on the sphere.",
            "Adapting indexing trees to data distribution in feature spaces.",
            "Fuzzy color histogram-based video segmentation.",
            "Comparing and combining lighting insensitive approaches for face recognition.",
            "Affinity functions in fuzzy connectedness based image segmentation I: Equivalence of affinities.",
            "Affinity functions in fuzzy connectedness based image segmentation II: Defining and recognizing truly novel affinities.",
            "Special issue on omnidirectional vision, camera networks and non-conventional cameras.",
            "A hemispherical imaging camera.",
            "Camera handoff and placement for automated tracking systems with multiple omnidirectional cameras.",
            "Discrete camera calibration from pixel streams.",
            "Generic self-calibration of central cameras.",
            "Efficient generic calibration method for general cameras with single centre of projection.",
            "Fast and robust numerical solutions to minimal problems for cameras with radial distortion.",
            "Estimation of the epipole using optical flow at antipodal points.",
            "Motion estimation by decoupling rotation and translation in catadioptric vision.",
            "Horizon matching for localizing unordered panoramic images.",
            "Probabilistic structure matching for visual SLAM with a multi-camera rig.",
            "Online adaptive radial basis function networks for robust object tracking.",
            "Multi-view face segmentation using fusion of statistical shape and appearance models.",
            "A quadratic programming based cluster correspondence projection algorithm for fast point matching.",
            "Coarse-to-fine surface reconstruction from silhouettes and range data using mesh deformation.",
            "Progressive randomization: Seeing the unseen.",
            "A variational approach to monocular hand-pose estimation.",
            "An optimization on pictogram identification for the road-sign recognition task using SVMs.",
            "Detection of the non-topology preservation of Ma and Sonka's algorithm, by the use of P-simple points.",
            "Mean Shift tracking with multiple reference color histograms.",
            "Special issue on image and video retrieval evaluation.",
            "Video shot boundary detection: Seven years of TRECVid activity.",
            "The segmented and annotated IAPR TC-12 benchmark.",
            "Learning automatic concept detectors from online video.",
            "Towards correct and informative evaluation methodology for texture classification under varying viewpoint and illumination.",
            "Comparing compact codebooks for visual categorization.",
            "Adaptive online camera coordination for multi-camera multi-target surveillance.",
            "Range segmentation of large building exteriors: A hierarchical robust approach.",
            "Omnidirectional texturing based on robust 3D registration through Euclidean reconstruction from two spherical images.",
            "Special issue on intelligent vision systems.",
            "Automated handwashing assistance for persons with dementia using video and a partially observable Markov decision process.",
            "A task-driven intelligent workspace system to provide guidance feedback.",
            "Visual search for an object in a 3D environment using a mobile robot.",
            "A biologically-inspired vision architecture for resource-constrained intelligent vehicles.",
            "Tutor-based learning of visual categories using different levels of supervision.",
            "Joint radiometric calibration and feature tracking system with an application to stereo.",
            "2D-3D-based on-board pedestrian detection system.",
            "A video-based door monitoring system using local appearance-based face models.",
            "Special issue on multi-camera and multi-modal sensor fusion.",
            "Exploiting distinctive visual landmark maps in pan-tilt-zoom camera networks.",
            "Cascade of descriptors to detect and track objects across any network of cameras.",
            "Vision and RFID data fusion for tracking people in crowds by a mobile robot.",
            "Pose estimation from multiple cameras based on Sylvester's equation.",
            "Personalized production of basketball videos from multi-sensored data under limited display resolution.",
            "A compact harmonic code for early vision based on anisotropic frequency channels.",
            "A framework for visual-context-aware object detection in still images.",
            "Context based object categorization: A critical survey.",
            "Using shorelines for autonomous air vehicle guidance.",
            "Generalizing edge detection to contour detection for image segmentation.",
            "A content based image retrieval system for a biological specimen collection.",
            "Using Human Visual System modeling for bio-inspired low level image processing.",
            "Fusing bio-inspired vision data for simplified high level scene interpretation: Application to face motion analysis.",
            "Image processing using 3-state cellular automata.",
            "Euclidean structure from confocal conics: Theory and application to camera calibration.",
            "Unsupervised colour image segmentation using dual-tree complex wavelet transform.",
            "Contour based object detection using part bundles.",
            "Multiple objects tracking in the presence of long-term occlusions.",
            "Image restoration based on the fast marching method and block based sampling.",
            "Action categorization by structural probabilistic latent semantic analysis.",
            "Subspace methods for retrieval of general 3D models.",
            "Photometric stereo with an arbitrary number of illuminants.",
            "Online visual tracking with histograms and articulating blocks.",
            "Camera calibration and geo-location estimation from two shadow trajectories.",
            "3-D motion estimation by integrating visual cues in 2-D multi-modal opti-acoustic stereo sequences.",
            "3D face reconstructions from photometric stereo using near infrared and visible light.",
            "An automatic calibration method for stereo-based 3D distributed smart camera networks.",
            "Study of parameterizations for the rigid body transformations of the scan registration problem.",
            "Histogram similarity measure using variable bin size distance.",
            "GPS coordinates estimation and camera calibration from solar shadows.",
            "Free form shape registration using the barrier method.",
            "Adaptive shadow estimator for removing shadow of moving object.",
            "Degradation of iris recognition performance due to non-cosmetic prescription contact lenses.",
            "Low-resolution color-based visual tracking with state-space model identification.",
            "Detecting object boundaries using low-, mid-, and high-level information.",
            "Spherical approximation for multiple cameras in motion estimation: Its applicability and advantages.",
            "Successively alternate least square for low-rank matrix factorization with bounded missing data.",
            "Shape recognition based on Kernel-edit distance.",
            "Illumination-robust variational optical flow using cross-correlation.",
            "Special issue on embedded vision.",
            "AdaBoost-based face detection for embedded systems.",
            "Leveraging cost matrix structure for hardware implementation of stereo disparity computation using dynamic programming.",
            "On implementing motion-based Region of Interest detection on multi-core CELL.",
            "An efficient, chromatic clustering-based background model for embedded vision platforms.",
            "A real-time versatile roadway path extraction and tracking on an FPGA platform.",
            "A fast stereo matching algorithm suitable for embedded real-time systems.",
            "Design and implementation of embedded computer vision systems based on particle filters.",
            "Wireless smart camera network for real-time human 3D pose reconstruction.",
            "Light-weight salient foreground detection for embedded smart cameras.",
            "A modified model for the Lobula Giant Movement Detector and its FPGA implementation.",
            "Multi-view scans alignment for 3D spherical mosaicing in large-scale unstructured environments.",
            "A parallel histogram-based particle filter for object tracking on SIMD-based smart cameras.",
            "Highly optimized implementation of OpenCV for the Cell Broadband Engine.",
            "Accelerated hardware video object segmentation: From foreground detection to connected components labelling.",
            "Performance evaluation of an intelligent video surveillance system - A case study.",
            "Accurate hardware-based stereo vision.",
            "Special issue on Time-of-Flight camera based computer vision.",
            "Time-of-Flight sensor calibration for accurate range sensing.",
            "Shading constraint improves accuracy of time-of-flight measurements.",
            "Fusion of range and color images for denoising and resolution enhancement with a non-local filter.",
            "Pose-insensitive nose detection in TOF-scans.",
            "View-invariant gesture recognition using 3D optical flow and harmonic motion context.",
            "Kinematic self retargeting: A framework for human pose estimation.",
            "Improved 3D reconstruction in smart-room environments using ToF imaging."
        ]
    },
    {
        "name": "CVIU",
        "year": "2009",
        "info": "2009: Volume 113",
        "count": 100,
        "papers": [
            "Camera calibration based on arbitrary parallelograms.",
            "Estimating parameters of noncentral catadioptric systems using bundle adjustment.",
            "Fast nonparametric belief propagation for real-time stereo articulated body tracking.",
            "Performance evaluation of local colour invariants.",
            "Scene modeling and change detection in dynamic scenes: A subspace approach.",
            "Linguistic summarization of video for fall detection using voxel person and fuzzy logic.",
            "Real-time joint disparity and disparity flow estimation on programmable graphics hardware.",
            "Vessel enhancement filter using directional filter bank.",
            "A pose-wise linear illumination manifold model for face recognition using video.",
            "An iterative multi-scale tensor voting scheme for perceptual grouping of natural shapes in cluttered backgrounds.",
            "Pupil dilation degrades iris biometric performance.",
            "A methodology for rapid illumination-invariant face recognition using image processing filters.",
            "A mapping and localization framework for scalable appearance-based navigation.",
            "Morphological multiscale decomposition of connected regions with emphasis on cell clusters.",
            "3D reconstruction of a femoral shape using a parametric model and two 2D fluoroscopic images.",
            "Motion estimation, segmentation and separation, using hypercomplex phase correlation, clustering techniques and graph-based optimization.",
            "Resolution analysis for Gradient Direction Matching of object model edges to overhead images.",
            "Manifold models for signals and images.",
            "Estimating 3D shape from degenerate sequences with missing data.",
            "A motion observable representation using color correlogram and its applications to tracking.",
            "Detecting motion patterns via direction maps with application to surveillance.",
            "Accurately estimating reflectance parameters for color and gloss reproduction.",
            "Introduction to computer vision and image understanding the special issue on video analysis.",
            "Attention-from-motion: A factorization approach for detecting attention objects in motion.",
            "Dynamic shape outlier detection for human locomotion.",
            "Object tracking using SIFT features and mean shift.",
            "Unsupervised view and rate invariant clustering of video sequences.",
            "Discriminative optical flow tensor for video semantic analysis.",
            "Semi-supervised kernel density estimation for video annotation.",
            "Video retrieval based on object discovery.",
            "Visual word proximity and linguistics for semantic video indexing and near-duplicate retrieval.",
            "A framework for flexible summarization of racquet sports video using multiple modalities.",
            "Fast analysis of scalable video for adaptive browsing interfaces.",
            "Probabilistic fusion-based parameter estimation for visual tracking.",
            "Image description with features that summarize.",
            "Detection and segmentation of moving objects in complex scenes.",
            "Hand-based verification and identification using palm-finger segmentation and fusion.",
            "Unsupervised multiphase segmentation: A recursive approach.",
            "Optical-flow based on an edge-avoidance procedure.",
            "A comparative study of two state-of-the-art sequence processing techniques for hand gesture recognition.",
            "Accurate appearance-based Bayesian tracking for maneuvering targets.",
            "Omnidirectional edge detection.",
            "Illumination robust interest point detection.",
            "Mosaicing of camera-captured document images.",
            "Target tracking with incomplete detection.",
            "Corrigendum to \"Discrete optimization in computer vision\" [Comput. Vis. Image Understanding 112 (2008) 1-2].",
            "Computer vision based analysis in sport environments.",
            "Recovering ball motion from a single motion-blurred image.",
            "Closed-world tracking of multiple interacting targets for indoor-sports applications.",
            "A trajectory-based analysis of coordinated team activity in a basketball game.",
            "A visual system for real time detection of goal events during soccer matches.",
            "Tracking the soccer ball using multiple fixed cameras.",
            "Automatic camera calibration of broadcast tennis video with applications to 3D virtual content insertion and ball detection and tracking.",
            "Ball route estimation under heavy occlusion in broadcast soccer video.",
            "Coupled grouping and matching for sign and gesture recognition.",
            "Integrated vision system for the semantic interpretation of activities where a person handles objects.",
            "FReBIR: An image retrieval system based on fuzzy region matching.",
            "Integrated detection and tracking of multiple faces using particle filtering and optical flow-based elastic matching.",
            "Robust feature point matching by preserving local geometric consistency.",
            "Approximate Bayesian methods for kernel-based object tracking.",
            "Factors that influence algorithm performance in the Face Recognition Grand Challenge.",
            "Fast curvilinear structure extraction and delineation using density estimation.",
            "A generative model for graph matching and embedding.",
            "Generalized least squares-based parametric motion estimation.",
            "A new energy-based method for 3D motion estimation of incompressible PIV flows.",
            "Partition-distance methods for assessing spatial segmentations of images and videos.",
            "Object localisation using the Generative Template of Features.",
            "A fast estimation method for the generalized Gaussian mixture distribution on complex images.",
            "Object separation by polarimetric and spectral imagery fusion.",
            "Is there a best color space for color image characterization or representation based on Multivariate Gaussian Mixture Model?",
            "A fast and automatic stereotactic registration with a single CT-slice.",
            "Video synchronization from human motion using rank constraints.",
            "Mean field approach for tracking similar objects.",
            "Eye localization in low and standard definition content with application to face matching.",
            "The triangulation tensor.",
            "Narrow band region-based active contours and surfaces for 2D and 3D segmentation.",
            "Difference sphere: An approach to near light source estimation.",
            "Minutiae-based template synthesis and matching for fingerprint authentication.",
            "A sequential Bayesian approach to color constancy using non-uniform filters.",
            "A feature analysis for dimension reduction based on a data generation model with class factors and environment factors.",
            "Classification of silhouettes using contour fragments.",
            "Connectivity-preserving transformations of binary images.",
            "Dynamic edge tracing: Boundary identification in medical images.",
            "Search strategies for shape regularized active contour.",
            "Human motion recognition using support vector machines.",
            "Unsupervised and simultaneous training of multiple object detectors from unlabeled surveillance video.",
            "Intensity standardization simplifies brain MR image segmentation.",
            "Special issue on new advances in 3D imaging and modeling.",
            "Surround structured lighting: 3-D scanning with orthographic illumination.",
            "Laser range scanner based on self-calibration techniques using coplanarities and metric constraints.",
            "Surface reconstruction from point clouds by transforming the medial scaffold.",
            "Stabilizing 3D modeling with geometric constraints propagation.",
            "Log-polar height maps for multiple range image registration.",
            "Correction of color information of a 3D model using a range intensity image.",
            "Special issue on 3D representation for object and scene recognition.",
            "Learning to generate novel views of objects for class recognition.",
            "Spatio-temporal constraints for on-line 3D object recognition in videos.",
            "Representing images of a rotating object with cyclic permutation for view-based pose estimation.",
            "Shape-from-recognition: Recognition enables meta-data transfer.",
            "Local feature extraction and matching on range images: 2.5D SIFT."
        ]
    },
    {
        "name": "CVIU",
        "year": "2008",
        "info": "2008: Volumes\n109, 110, 111, 112",
        "count": 101,
        "papers": [
            "Vision based data fusion for autonomous vehicles target tracking using interacting multiple dynamic models.",
            "Numerical methods for shape-from-shading: A new survey with benchmarks.",
            "Multimodal person authentication using speech, face and visual speech.",
            "A feature-based metric for the quantitative evaluation of pixel-level image fusion.",
            "Model-based analysis of Chinese calligraphy images.",
            "Robust information clustering incorporating spatial information for breast mass detection in digitized mammograms.",
            "Reducing drift in differential tracking.",
            "Real-time 3-D human body tracking using learnt models of behaviour.",
            "Independent increment processes for human motion recognition.",
            "Image compression: Maxshift ROI encoding options in JPEG2000.",
            "Modeling inter-camera space-time and appearance relationships for tracking across non-overlapping views.",
            "A multilevel automatic thresholding method based on a genetic algorithm for a fast image segmentation.",
            "A two-component rectilinearity measure.",
            "Automatic scene structure and camera motion using a catadioptric system.",
            "Dense height map estimation from oblique aerial image sequences.",
            "A fractal-based relaxation algorithm for shape from terrain image.",
            "Global parametric image alignment via high-order approximation.",
            "Topological model for 3D image representation: Definition and incremental extraction algorithm.",
            "Shape matching and registration by data-driven EM.",
            "Performance characterization in computer vision: A guide to best practices.",
            "A differential geometric approach to representing the human actions.",
            "Automatic skin decomposition based on single image.",
            "The visual hull of piecewise smooth objects.",
            "Trajectory fusion for three-dimensional volume reconstruction.",
            "An evaluation of area morphology scale-spaces for colour images.",
            "Estimating pedestrian counts in groups.",
            "Incremental discovery of object parts in video sequences.",
            "Multi-scale 3D scene flow from binocular stereo sequences.",
            "Two-stage optimal component analysis.",
            "Isolating impulsive noise pixels in color images by peer group techniques.",
            "Qualitative similarity measures - The case of two-dimensional outlines.",
            "Accurate and precise 2D-3D registration based on X-ray intensity.",
            "Visual learning and recognition of sequential data manifolds with applications to human movement analysis.",
            "Learning function-based object classification from 3D imagery.",
            "Narrow directional steerable filters in motion estimation.",
            "Unsupervised segmentation of natural images via lossy data compression.",
            "Registration of combined range-intensity scans: Initialization through verification.",
            "A similarity-based leaf image retrieval scheme: Joining shape and venation features.",
            "Image segmentation evaluation: A survey of unsupervised methods.",
            "Image understanding for iris biometrics: A survey.",
            "Similarity Matching in Computer Vision and Multimedia.",
            "Indexing through laplacian spectra.",
            "Strategies for shape matching using skeletons.",
            "Speeded-Up Robust Features (SURF).",
            "Content based video matching using spatiotemporal volumes.",
            "Anytime similarity measures for faster alignment.",
            "Locally adaptive subspace and similarity metric learning for visual data clustering and retrieval.",
            "Combining visual dictionary, kernel-based similarity and learning strategy for image category retrieval.",
            "Measuring novelty and redundancy with multiple modalities in cross-lingual broadcast news.",
            "Special issue on Intelligent Visual Surveillance.",
            "Understanding human interactions with track and body synergies (TBS) captured from multiple views.",
            "HECOL: Homography and epipolar-based consistent labeling for outdoor park surveillance.",
            "Incremental, scalable tracking of objects inter camera.",
            "Incremental and adaptive abnormal behaviour detection.",
            "An object-based comparative methodology for motion detection based on the F-Measure.",
            "Object recognition and segmentation in videos by connecting heterogeneous visual features.",
            "Improving long range and high magnification face recognition: Database acquisition, evaluation, and enhancement.",
            "Two-dimensional BRDF estimation from polarisation.",
            "Audiovisual integration with Segment Models for tennis video parsing.",
            "An adaptive window mechanism for image smoothing.",
            "Identification and sizing of the entirely visible rocks from a 3D surface data segmentation of laboratory rock piles.",
            "Model-based human shape reconstruction from multiple views.",
            "Teacher-directed learning in view-independent face recognition with mixture of experts using overlapping eigenspaces.",
            "Retrieving multiple light sources in the presence of specular reflections and texture.",
            "Content-based image retrieval with the normalized information distance.",
            "Facial feature extraction using complex dual-tree wavelet transform.",
            "Fusion of the complementary Discrete Cosine Features in the YIQ color space for face recognition.",
            "Physics-based elastic registration using non-radial basis functions and including landmark localization uncertainties.",
            "Using specularities in comparing 3D models and 2D images.",
            "2D Image-based reconstruction of shape deformation of biological structures using a level-set representation.",
            "Epiflow - A paradigm for tracking stereo correspondences.",
            "Reliable face recognition using adaptive and robust correlation filters.",
            "On geometric variational models for inpainting surface holes.",
            "Discrete optimization in computer vision.",
            "Improved spectral relaxation methods for binary quadratic optimization problems.",
            "Performance vs computational efficiency for optimizing single and dynamic MRFs: Setting the state of the art with primal-dual strategies.",
            "Measuring uncertainty in graph cut solutions.",
            "Efficient belief propagation for higher-order cliques using linear constraint nodes.",
            "Canonical subsets of image features.",
            "Limited view CT reconstruction and segmentation via constrained metric labeling.",
            "Topology cuts: A novel min-cut/max-flow algorithm for topology preserving segmentation in N-D images.",
            "Efficient MRF deformation model for non-rigid image matching.",
            "Adaptive image retrieval based on the spatial organization of colors.",
            "Using multi-instance enrollment to improve performance of 3D face recognition.",
            "A computer vision model for visual-object-based attention and eye movements.",
            "Image segmentation algorithm development using ground truth image data sets.",
            "Image registration based on kernel-predictability.",
            "Distinctive Similarity Measure for stereo matching under point ambiguity.",
            "Stereo vision using two PTZ cameras.",
            "Recovering epipolar direction from two affine views of a planar object.",
            "Shape from inconsistent silhouette.",
            "Focal length and registration correction for building panorama from photographs.",
            "Change detection using a statistical model in an optimally selected color space.",
            "Corner validation based on extracted corner properties.",
            "Superpipelined high-performance optical-flow computation architecture.",
            "Fast PDE approach to surface reconstruction from large cloud of points.",
            "ICA-based neighborhood preserving analysis for face recognition.",
            "Robust object tracking with background-weighted local kernels.",
            "Optimising dynamic graphical models for video content analysis.",
            "A general shape context framework for object identification.",
            "Exploring and exploiting the structure of saddle points in Gaussian scale space."
        ]
    },
    {
        "name": "CVIU",
        "year": "2007",
        "info": "2007: Volumes\n105, 106, 107, 108",
        "count": 80,
        "papers": [
            "Face detection in gray scale images using locally linear embeddings.",
            "An optical navigation sensor for micro aerial vehicles.",
            "A volumetric fusion technique for surface reconstruction from silhouettes and range data.",
            "A random sampling strategy for piecewise planar scene segmentation.",
            "Camera calibration and light source orientation from solar shadows.",
            "Visual terrain mapping for Mars exploration.",
            "Generalized optical flow in the scale space.",
            "Locating object contours in complex background using improved snakes.",
            "Multi-view face and eye detection using discriminant features.",
            "A variational approach to blending based on warping for non-overlapped images.",
            "Shape from silhouette outlines using an adaptive dandelion model.",
            "A method of reactive zoom control from uncertainty in tracking.",
            "Towards direct recovery of shape and motion parameters from image sequences.",
            "Robust model-based scene interpretation by multilayered context information.",
            "Topological analysis of shapes using Morse theory.",
            "Efficient search and verification for function based classification from real range images.",
            "Robot-vision architecture for real-time 6-DOF object localization.",
            "Generative model based vision.",
            "Primal sketch: Integrating structure and texture.",
            "Texture enhanced appearance models.",
            "Nonlinear manifold learning for dynamic shape and dynamic appearance.",
            "Dynamic quantization for belief propagation in sparse spaces.",
            "Learning generative visual models from few training examples: An incremental Bayesian approach tested on 101 object categories.",
            "Interpretation of complex scenes using dynamic tree-structure Bayesian networks.",
            "Bayesian stereo matching.",
            "Large deformation diffeomorphisms with application to optic flow.",
            "Optical flow based super-resolution: A probabilistic approach.",
            "Smart particle filtering for high-dimensional tracking.",
            "On the computational rationale for generative models.",
            "Advances in vision algorithms and systems beyond the visible spectrum.",
            "Background estimation under rapid gain change in thermal imagery.",
            "Background-subtraction using contour-based fusion of thermal and visible imagery.",
            "Precise acquisition and unsupervised segmentation of multi-spectral images.",
            "Pedestrian detection by means of far-infrared stereo vision.",
            "Coalitional tracking.",
            "An improved likelihood model for eye tracking.",
            "Traffic monitoring with spaceborne SAR - Theory, simulations, and experiments.",
            "Multi-spectral and multi-perspective video arrays for driver body tracking and activity analysis.",
            "Visual learning of texture descriptors for facial expression recognition in thermal imagery.",
            "Mutual information based registration of multimodal stereo videos for person tracking.",
            "Pedestrian detection and tracking in infrared imagery using shape and appearance.",
            "Laser-based detection and tracking of multiple people in crowds.",
            "Color image processing.",
            "Practical implementation of LMMSE demosaicing using luminance and chrominance spaces.",
            "A joint demosaicking-zooming scheme for single chip digital color cameras.",
            "Fuzzy vector partition filtering technique for color image restoration.",
            "Graph regularization for color image processing.",
            "Morphological colour operators in totally ordered lattices based on distances: Application to image filtering, enhancement and analysis.",
            "Spatial and spectral quaternionic approaches for colour images.",
            "Quaternion color texture segmentation.",
            "Color text extraction with selective metric-based clustering.",
            "Color image histogram equalization by absolute discounting back-off.",
            "Automated colour grading using colour distribution transfer.",
            "A comparison of Gaussian and mean curvature estimation methods on triangular meshes of range image data.",
            "Iterative relative fuzzy connectedness for multiple objects with multiple seeds.",
            "A new steganographic method for color and grayscale image hiding.",
            "A fast algorithm for ICP-based 3D shape biometrics.",
            "Intelligent LIDAR scanning region selection for satellite pose estimation.",
            "Object segmentation using graph cuts based active contours.",
            "Special issue on vision for human-computer interaction.",
            "Vision-based human motion analysis: An overview.",
            "Static topographic modeling for facial expression recognition and analysis.",
            "Face as mouse through visual face tracking.",
            "Objective evaluation of approaches of skin detection using ROC analysis.",
            "Vision-based hand pose estimation: A review.",
            "MAP ZDF segmentation and tracking using active stereo vision: Hand tracking case study.",
            "Viewpoint invariant sign language recognition.",
            "A real-time hand tracker using variable-length Markov models of behaviour.",
            "Multimodal human-computer interaction: A survey.",
            "Coordinating interactive vision behaviors for cognitive assistance.",
            "Interacting with human physiology.",
            "Computer-based system for the virtual-endoscopic guidance of bronchoscopy.",
            "Vision-based motion estimation for interaction with mobile devices.",
            "Robust real-time vision for a personal service robot.",
            "Special issue on spatial coherence for visual motion analysis.",
            "Local velocity-adapted motion events for spatio-temporal recognition.",
            "Segregation of moving objects using elastic matching.",
            "Combining object and feature dynamics in probabilistic tracking.",
            "Incorporating non-motion cues into 3D motion segmentation.",
            "A decentralized probabilistic approach to articulated body tracking."
        ]
    },
    {
        "name": "CVIU",
        "year": "2006",
        "info": "2006: Volumes\n101, 102, 103, 104",
        "count": 70,
        "papers": [
            "A survey of approaches and challenges in 3D and multi-modal 3D + 2D face recognition.",
            "Joint registration and averaging of multiple 3D anatomical surface models.",
            "Simultaneous estimation of super-resolved depth map and intensity field using photometric cue.",
            "Tracking based motion segmentation under relaxed statistical assumptions.",
            "A paintbrush laser range scanner.",
            "Sequential mean field variational analysis of structured deformable shapes.",
            "Generalized scale: Theory, algorithms, and application to image inhomogeneity correction.",
            "Tracking soccer players aiming their kinematical motion analysis.",
            "Multiregion competition: A level set extension of region competition to multiple region image partitioning.",
            "Fitting conics to paracatadioptric projections of lines.",
            "A column-space approach to projective reconstruction.",
            "Vectorial scale-based fuzzy-connected image segmentation.",
            "Stereo and motion correspondences using nonlinear optimization method.",
            "Simultaneous tracking of multiple body parts of interacting persons.",
            "Unsupervised scene analysis: A hidden Markov model approach.",
            "A new shape descriptor defined on the Radon transform.",
            "Automatic measurement of industrial sheetmetal parts with CAD data and non-metric image sequence.",
            "Hierarchical shadow detection for color aerial images.",
            "Homeostatic image perception: An artificial system.",
            "Performance evaluation of corner detectors using consistency and accuracy measures.",
            "Texture recognition from sparsely and irregularly sampled data.",
            "Color image segmentation by analysis of subset connectedness and color homogeneity properties.",
            "How effective are landmarks and their geometry for face recognition?",
            "Topological properties of closed digital spaces: One method of constructing digital models of closed continuous surfaces by using covers.",
            "Testing new variants of the Beckmann-Kirchhoff model against radiance data.",
            "High security Iris verification system based on random secret integration.",
            "Multispectral image data fusion using POCS and super-resolution.",
            "Form representions and means for landmarks: A survey and comparative study.",
            "Automatic selection of edge detector parameters based on spatial and statistical measures.",
            "Parametric model-based motion segmentation using surface selection criterion.",
            "Self-calibration from turn-table sequences in presence of zoom and focus.",
            "An object detection and recognition system for weld bead extraction from digital radiographs.",
            "Combining self-organizing neural nets with multivariate statistics for efficient color image retrieval.",
            "Erratum to \"A multi-Kalman filtering approach for video tracking of human-delineated objects in cluttered environments\" [Comput. Vision Image Understanding 99 (2005) 1-57].",
            "A multi-Kalman filtering approach for video tracking of human-delineated objects in cluttered environments.",
            "Accuracy of the straight line Hough Transform: The non-voting approach.",
            "Boundary matting for view synthesis.",
            "Integrating multiple levels of zoom to enable activity analysis.",
            "Natural color image enhancement and evaluation algorithm based on human visual system.",
            "Acquiring height data from a single image of a face using local shape indicators.",
            "Finding and identifying unknown commercials using repeated video sequence detection.",
            "Joint optical flow estimation, segmentation, and 3D interpretation with level sets.",
            "A symmetric convexity measure.",
            "Graph image language techniques supporting radiological, hand image interpretations.",
            "Robust target detection and tracking through integration of motion, color, and geometry.",
            "The representation and matching of categorical shape.",
            "Special issue: Omnidirectional vision and camera networks.",
            "Automated camera layout to satisfy task-specific and floor plan-specific coverage requirements.",
            "Pan-tilt-zoom camera calibration and high-resolution mosaic generation.",
            "Matching scale-space features in 1D panoramas.",
            "Geometry and construction of straight lines in log-polar images.",
            "A unifying geometric representation for central projection systems.",
            "A generic structure-from-motion framework.",
            "Face recognition subject to variations in facial expression, illumination and pose using correlation filters.",
            "Non-parametric and light-field deformable models.",
            "Edge affinity for pose-contour matching.",
            "Visual motion pattern extraction and fusion for collision detection in complex dynamic scenes.",
            "On robustness and localization accuracy of optical flow computation for underwater color images.",
            "Optimal instantaneous rigid motion estimation insensitive to local minima.",
            "Modeling people: Vision-based understanding of a person's shape, appearance, movement, and behaviour.",
            "A survey of advances in vision-based human motion capture and analysis.",
            "Human body pose detection using Bayesian spatio-temporal templates.",
            "Learning-based dynamic coupling of discrete and continuous trackers.",
            "Temporal motion models for monocular and multiview 3D human body tracking.",
            "Viewpoint invariant exemplar-based 3D human tracking.",
            "Markerless tracking of complex human motions from multiple views.",
            "Conditional models for contextual human motion recognition.",
            "Matching actions in presence of camera motion.",
            "A general method for human activity recognition in video.",
            "Free viewpoint action recognition using motion history volumes."
        ]
    },
    {
        "name": "CVIU",
        "year": "2005",
        "info": "2005: Volumes\n97, 98, 99, 100",
        "count": 75,
        "papers": [
            "Scene-consistent detection of feature points in video sequences.",
            "A 3-D space-time motion detection for an invariant image registration approach in digital subtraction angiography.",
            "Extracting layers and analyzing their specular properties using epipolar-plane-image analysis.",
            "The geometric error for homographies.",
            "Recent advances in visual and infrared face recognition - a review.",
            "Real-time cooperative multi-target tracking by communicating active vision agents.",
            "On the gray-level central and absolute central moments and the mass center of the gray-level variability in low-level image processing.",
            "Similarity motion estimation and active tracking through spatial-domain projections on log-polar images.",
            "Improved range image segmentation by analyzing surface fit patterns.",
            "Geodesic active regions and level set methods for motion estimation and tracking.",
            "Reconstructing camera projection matrices from multiple pairwise overlapping views.",
            "A granulometric analysis of specular microscopy images of human corneal endothelia.",
            "Accurate optical flow computation under non-uniform brightness variations.",
            "The correspondence framework for 3D surface matching algorithms.",
            "Special issue: eye detection and tracking.",
            "Eye gaze tracking techniques for interactive applications.",
            "A novel non-intrusive eye gaze estimation using cross-ratio under large head motion.",
            "A non-contact device for tracking gaze in a human computer interface.",
            "Estimating the eye gaze from one eye.",
            "An embedded system for an eye-detection sensor.",
            "Robust real-time eye detection and tracking under variable lighting conditions and various face orientations.",
            "Eye tracking in the wild.",
            "A generative framework for real time object detection and classification.",
            "Reflectance from locally glossy thoroughly pitted surfaces.",
            "The geometry of dynamic scenes - On coplanar and convergent linear motions embedded in 3D static scenes.",
            "Identifying, visualizing, and comparing regions in irregularly spaced 3D surface data.",
            "Efficient partial-surface registration for 3D objects.",
            "Human action-recognition using mutual invariants.",
            "Reillumination-driven shape from shading.",
            "Analyzing magnetic resonance images of Iberian pork loin to predict its sensorial characteristics.",
            "Panoramic stereo reconstruction using non-SVP optics.",
            "Fast acquisition of dense depth data by a new structured light scheme.",
            "A system to detect houses and residential street networks in multispectral satellite images.",
            "Hardware implementation of optical flow constraint equation using FPGAs.",
            "Force field feature extraction for ear biometrics.",
            "A multi-Kalman filtering approach for video tracking of human-delineated objects in cluttered environments.",
            "Focal length calibration from two views: method and analysis of singular cases.",
            "Gray skeletons and segmentation of shapes.",
            "Extending anisotropic operators to recover smooth shapes.",
            "Constructing multiscale connectivities.",
            "Least-squares 3D reconstruction from one or more views and geometric clues.",
            "Measuring rectilinearity.",
            "Hierarchical implicit surface joint limits for human body tracking.",
            "Symmetry-based 3-D reconstruction from perspective images.",
            "Object recognition with uncertain geometry and uncertain part detection.",
            "Efficient, causal camera tracking in unprepared environments.",
            "Decomposition of binary morphological structuring elements based on genetic algorithms.",
            "Visual tracking and recognition using probabilistic appearance manifolds.",
            "IR and visible light face recognition.",
            "A lane-departure identification based on LBPE, Hough transform, and linear regression.",
            "Tensor scale: A local morphometric parameter with applications to computer vision and image processing.",
            "Fast connected-component labelling in three-dimensional binary images based on iterative recursion.",
            "Robust anisotropic diffusion to produce enhanced statistical parametric map from noisy fMRI.",
            "Deformable model with a complexity independent from image resolution.",
            "Unsupervised image segmentation using triplet Markov fields.",
            "Amodal volume completion: 3D visual completion.",
            "Special issue: Attention and performance in computer vision.",
            "Attending to visual motion.",
            "Selective visual attention enables learning and recognition of multiple objects in cluttered scenes.",
            "The emergence of attention by population-based inference and its role in distributed processing and cognitive control of vision.",
            "Assessing the contribution of color in visual attention.",
            "A Bimodal Laser-Based Attention System.",
            "Evaluation of selective attention under similarity transformations.",
            "Selective Attention for Identification Model: Simulating visual neglect.",
            "Selective perception policies for guiding sensing and computation in multimodal systems: A comparative analysis.",
            "Target tracking with distributed sensors: The focus of attention problem.",
            "Distinguishing paintings from photographs.",
            "Extraction, matching, and pose recovery based on dominant rectangular structures.",
            "Distance transforms for three-dimensional grids with non-cubic voxels.",
            "Segmentation of tissue boundary evolution from brain MR image sequences using multi-phase level sets.",
            "Detecting and removing specularities in facial images.",
            "Finger surface as a biometric identifier.",
            "Task oriented facial behavior recognition with selective sensing.",
            "Structure-from-motion using lines: Representation, triangulation, and bundle adjustment.",
            "The influence of perceptual grouping on motion detection."
        ]
    },
    {
        "name": "CVIU",
        "year": "2004",
        "info": "2004: Volumes\n93, 94, 95, 96",
        "count": 66,
        "papers": [
            "Error analysis of pattern recognition systems - the subsets bootstrap.",
            "Shape matching of partially occluded curves invariant under projective transformation.",
            "3-D reconstruction of static human body shape from image sequence.",
            "Context-dependent segmentation and matching in image databases.",
            "Topological model for two-dimensional image representation: definition and optimal extraction algorithm.",
            "Hierarchical Markovian segmentation of multispectral images for the reconstruction of water depth maps.",
            "Image matching with scale adjustment.",
            "Fast Euclidean distance transformation in two scans using a 3 × 3 neighborhood.",
            "A linear-time component-labeling algorithm using contour tracing technique.",
            "Depth distortion under calibration uncertainty.",
            "Efficient detection under varying illumination conditions and image plane rotations.",
            "An efficient set estimator in high dimensions: consistency and applications to fast data visualization.",
            "Detection and characterization of junctions in a 2D image.",
            "Real time repeated video sequence identification.",
            "Detecting image orientation based on low-level visual content.",
            "Color for Image Indexing and Retrieval.",
            "Moment invariants for recognition under changing viewpoint and illumination.",
            "Spectral gradients for color-based object recognition and indexing.",
            "Image retrieval using color histograms generated by Gauss mixture vector quantization.",
            "The analysis and applications of adaptive-binning color histograms.",
            "Induction operators for a computational colour-texture representation.",
            "Linear color segmentation and its implementation.",
            "Selection weighted vector directional filters.",
            "FOCUS: A system for searching for multi-colored objects in a diverse image database.",
            "Region-based image retrieval using integrated color, shape, and location index.",
            "Combining spatial and colour information for content based image retrieval.",
            "Object of interest-based visual navigation, retrieval, and semantic content identification system.",
            "Classifying offensive sites based on image content.",
            "A skeletal measure of 2D shape similarity.",
            "Eliminating extrapolation using point distribution criteria in scattered data interpolation.",
            "Registration without ICP.",
            "On combining graph-partitioning with non-parametric clustering for image segmentation.",
            "Illumination insensitive recognition using eigenspaces.",
            "Part-level object recognition using superquadrics.",
            "Erratum to \"Shape matching of partially occluded curves invariant under projective transformation\" [Comp. Vision Image Understanding 93 (2004) 34-64].",
            "A multiscale elastic registration scheme for retinal angiograms.",
            "A two-step method for preprocessing volume data.",
            "The MPM-MAP algorithm for motion segmentation.",
            "Robust real-time face tracker for cluttered environments.",
            "Video summaries and cross-referencing through mosaic-based representation.",
            "Cast shadow segmentation using invariant color features.",
            "Dynamic mutual calibration and view planning for cooperative mobile robots with panoramic virtual stereo vision.",
            "Bayesian self-calibration of a moving camera.",
            "The \"dead reckoning\" signed distance transform.",
            "Dynamic learning from multiple examples for semantic object segmentation and search.",
            "Adaptive dual-point Hough transform for object recognition.",
            "The impact of radial distortion on the self-calibration of rotating cameras.",
            "Synchronization of oscillations for machine perception of gaits.",
            "Automatic description of complex buildings from multiple images.",
            "CVIU special issue on event detection in video.",
            "Temporal spatio-velocity transform and its application to tracking and interaction.",
            "Video-based event recognition: activity representation and probabilistic recognition methods.",
            "Layered representations for learning and inferring office activity from multiple sensory channels.",
            "Maximum entropy model-based baseball highlight detection and classification.",
            "Differential video coding of face and gesture events in presentation videos.",
            "A multi-modal system for the retrieval of semantic video events.",
            "An automatic road sign recognition system based on a computational model of human recognition processing.",
            "Model-based and image-based 3D scene representation for interactive visualization.",
            "A hierarchy of cameras for 3D photography.",
            "LAMP: 3D layered, adaptive-resolution, and multi-perspective panorama - a new scene representation.",
            "Data compression with spherical wavelets and wavelets for the image-based relighting.",
            "Tri-view morphing.",
            "Silhouette and stereo fusion for 3D object modeling.",
            "Real-time 3D shape reconstruction, dynamic 3D mesh deformation, and high fidelity visualization for 3D video.",
            "Volumetric video compression for interactive playback.",
            "Reconstructing 3D trajectories of independently moving objects using generic constraints."
        ]
    },
    {
        "name": "CVIU",
        "year": "2003",
        "info": "2003: Volumes\n89, 90, 91, 92",
        "count": 52,
        "papers": [
            "Linear-time connected-component labeling based on sequential local operations.",
            "Rotation-invariant texture feature for image retrieval.",
            "Robust tracking of human body parts for collaborative human computer interaction.",
            "A multiscale approach to connectivity.",
            "Nonrigid image registration: guest editors' introduction.",
            "A new point matching algorithm for non-rigid registration.",
            "Non-rigid registration using distance functions.",
            "A new Image Registration technique with free boundary constraints: application to mammography.",
            "Active blobs: region-based, deformable appearance models.",
            "An integrated range-sensing, segmentation and registration framework for the characterization of intra-surgical brain deformations in image-guided surgery.",
            "3D Brain surface matching based on geodesics and local geometry.",
            "Iconic feature based nonrigid registration: the PASHA algorithm.",
            "Nonrigid brain registration: synthesizing full volume deformation fields from model basis solutions constrained by partial volume intraoperative data.",
            "Automatic extraction and description of human gait models for recognition purposes.",
            "Multi-class relevance feedback content-based image retrieval.",
            "Recognition and reconstruction of buildings from multiple aerial images.",
            "Motion and structure from multiple cues; image motion, shading flow, and stereo disparity.",
            "Multiple motion analysis: in spatial or in spectral domain?",
            "Spline-based elastic image registration: integration of landmark errors and orientation attributes.",
            "On discrete triangles characterization.",
            "Color image segmentation by pixel classification in an adapted hybrid color space. Application to soccer image analysis.",
            "Recognition of partially occluded objects using probabilistic ARG (attributed relational graph)-based matching.",
            "Simplifying curve skeletons in volume images.",
            "Implementation techniques for geometric branch-and-bound matching methods.",
            "Topologies for the digital spaces Z2 and Z3.",
            "Special issue on face recognition.",
            "Face recognition: component-based versus global approaches.",
            "Unsupervised recognition of multi-view face sequences based on pairwise clustering with attraction and repulsion.",
            "Robust parameterized component analysis: theory and applications to 2D facial appearance models.",
            "Face recognition with visible and thermal infrared imagery.",
            "Recognizing faces with PCA and ICA.",
            "Facial asymmetry quantification for expression invariant human identification.",
            "Facial expression recognition from video sequences: temporal and static modeling.",
            "Face reconstruction from monocular video using uncertainty analysis and a generic model.",
            "Probabilistic recognition of human faces from video.",
            "Locating human faces within images.",
            "Obtaining complete 2.5D view representation of polyhedra using concept of seedling single-view area.",
            "Object-level structured contour map extraction.",
            "A framework for heading-guided recognition of human activity.",
            "Accurate and robust line segment extraction by analyzing distribution around peaks in Hough space.",
            "A unified framework for alignment and correspondence.",
            "A volumetric approach for interactive 3D modeling.",
            "Reconstructing discontinuous surfaces from a given gradient field using partial integrability.",
            "Point similarity measures for non-rigid registration of multi-modal data.",
            "Video retrieval and summarization.",
            "Fast video segment retrieval by Sort-Merge feature selection, boundary refinement, and lazy evaluation.",
            "Content-based analysis for video from snooker broadcasts.",
            "Object-based analysis and interpretation of human motion in sports video sequences by dynamic bayesian networks.",
            "Evaluation of key frame-based retrieval techniques for video.",
            "Automated location matching in movies.",
            "3D motion retrieval with motion index tree.",
            "Semantic annotation of soccer videos: automatic highlights identification."
        ]
    },
    {
        "name": "CVIU",
        "year": "2002",
        "info": "2002: Volumes\n85, 86, 87, 88",
        "count": 36,
        "papers": [
            "Fast Retrieval of Isolated Visual Shapes.",
            "Connectivity on Complete Lattices: New Results.",
            "Fuzzy Markovian Segmentation in Application of Magnetic Resonance Images.",
            "Color Models for Outdoor Machine Vision.",
            "Image Thresholding by Maximizing the Index of Nonfuzziness of the 2-D Grayscale Histogram.",
            "A New Approach to Automatic Reconstruction of a 3-D World Using Active Stereo Vision.",
            "Spatial-Feature Parametric Clustering Applied to Motion-Based Segmentation in Camouflage.",
            "An Exhaustive Study of Particular Cases Leading to Robust and Accurate Motion Estimation.",
            "A Real-Time Approach to the Spotting, Representation, and Recognition of Hand Gestures for Human-Computer Interaction.",
            "Range Flow Estimation.",
            "Relative Viewing Distance: A Correspondence Invariance under Paraperspective Projection.",
            "Recovering a Polygon from Noisy Data.",
            "A Machine Vision System for Lane-Departure Detection.",
            "Thresholding for Change Detection.",
            "Necklaces: Inhomogeneous and Point-Enhanced Deformable Models.",
            "Evaluation of 3D Operators for the Detection of Anatomical Point Landmarks in MR and CT Images.",
            "Corrigendum to \"Efficient Computation of the Euclidean Distance Transform\".",
            "Perceptual Organization Based Computational Model for Robust Segmentation of Moving Objects.",
            "Fuzzy Distance Transform: Theory, Algorithms, and Applications.",
            "Special Issue on Registration and Fusion of Range Images.",
            "Automatic Crude Patch Registration: Toward Automatic 3D Model Building.",
            "Differential Invariants as the Base of Triangulated Surface Registration.",
            "Parallel Evolutionary Registration of Range Data.",
            "Registration and Integration of Multiple Range Images by Matching Signed Distance Fields for Object Shape Modeling.",
            "A Method for Fine Registration of Multiple View Range Images Considering the Measurement Error Properties.",
            "Registration of Multiple Acoustic Range Views for Underwater Scene Reconstruction.",
            "Model-Based Registration of Front- and Backviews of Rotationally Symmetric Objects.",
            "Pair-Wise Range Image Registration: A Study in Outlier Classification.",
            "Compression of Dynamic 3D Geometry Data Using Iterative Closest Point Algorithm.",
            "The Multimodal Neighborhood Signature for Modeling Object Color Appearance and Applications in Object Recognition and Image Retrieval.",
            "Digital Distance Transforms in 3D Images Using Information from Neighbourhoods up to 5×5×5.",
            "Interactive Content-Based Image Retrieval Using Relevance Feedback.",
            "Adaptive Rest Condition Potentials: First and Second Order Edge-Preserving Regularization.",
            "Geometry and Texture Recovery of Scenes of Large Scale.",
            "Using Human Perceptual Categories for Content-Based Retrieval from a Medical Image Database.",
            "Saliency Sequential Surface Organization for Free-Form Object Recognition."
        ]
    },
    {
        "name": "CVIU",
        "year": "2001",
        "info": "2001: Volumes\n81, 82, 83, 84",
        "count": 64,
        "papers": [
            "Conversions between Parametric and Implicit Forms Using Polar/Spherical Coordinate Representations.",
            "Tracking Deformable Templates Using a Shortest Path Algorithm.",
            "Progressive Linear Search for Stereo Matching and Its Application to Interframe Interpolation.",
            "A Frequency Domain Technique Based on Energy Radial Projections for Robust Estimation of Global 2D Affine Transformations.",
            "Simultaneous Registration of Multiple Corresponding Point Sets.",
            "Depth from Defocus Estimation in Spatial Domain.",
            "A Survey Of Free-Form Object Representation and Recognition Techniques.",
            "On Uniqueness of Solutions of the Three-Light-Source Photometric Stereo: Conditions on Illumination Configuration and Surface Reflectance.",
            "Modeling People Toward Vision-Based Understanding of a Person's Shape, Appearance, and Movement.",
            "A Survey of Computer Vision-Based Human Motion Capture.",
            "Estimating Anthropometry and Pose from a Single Uncalibrated Image.",
            "Tracking and Modeling People in Video Sequences.",
            "Monocular Perception of Biological Motion in Johansson Displays.",
            "3D Articulated Models and Multiview Tracking with Physical Forces.",
            "A Framework for Recognizing the Simultaneous Aspects of American Sign Language.",
            "Backpack: Detection of People Carrying Objects Using Silhouettes.",
            "Learning Variable-Length Markov Models of Behavior.",
            "Recognizing Planned, Multiperson Action.",
            "The Statistics of Optical Flow.",
            "Comparability Graphs and Digital Topology.",
            "Relative Fuzzy Connectedness among Multiple Objects: Theory, Algorithms, and Applications in Image Segmentation.",
            "Linear Fitting with Missing Data for Structure-from-Motion.",
            "A Frequency Domain Technique Based on Energy Radial Projections for Robust Estimation of Global 2D Affine Transformations: Volume 81(1): 72-116 (2001).",
            "Smoothing and Edge Detection by Time-Varying Coupled Nonlinear Diffusion Equations.",
            "Deformable Shape Recovery by Factorization Based on a Spatiotemporal Measurement Matrix.",
            "Error Characterization of the Factorization Method.",
            "Accurate Building Structure Recovery from High Resolution Aerial Imagery.",
            "Estimating the Fundamental Matrix by Transforming Image Points in Projective Space.",
            "Building Detection from Multiple Aerial Images in Dense Urban Areas.",
            "Convexity-Based Visual Camouflage Breaking.",
            "Vector-City Vector Distance Transform.",
            "Surface Texture and Microstructure Extraction from Multiple Aerial Images.",
            "Correspondence between Different View Breast X Rays Using Curved Epipolar Lines.",
            "Robust and Efficient Fourier-Mellin Transform Approximations for Gray-Level Image Reconstruction and Complete Invariant Description.",
            "A Silhouette Based Technique for the Reconstruction of Human Movement.",
            "Disparity Estimation on Log-Polar Images and Vergence Control.",
            "Curvature Computation on Free-Form 3-D Meshes at Multiple Scales.",
            "Shape and Topology Constraints on Parametric Active Contours.",
            "An Efficient Randomized Algorithm for Detecting Circles.",
            "An Algebraic Approach to Camera Self-Calibration.",
            "Categorization of Image Databases for Efficient Retrieval Using Robust Mixture Decomposition.",
            "Face Detection: A Survey.",
            "Fuzzy Connected Object Delineation: Axiomatic Path Strength Definition and the Case of Multiple Seeds.",
            "Special Issue on Empirical Evaluation of Computer Vision Algorithms.",
            "Experimental Evaluation of FLIR ATR Approaches - A Comparative Study.",
            "Empirical Evaluation of Dissimilarity Measures for Color and Texture.",
            "Measuring the Performance of Shape Similarity Retrieval Methods.",
            "Analysis of Irregularly Shaped Texture Regions.",
            "Edge Detector Evaluation Using Empirical ROC Curves.",
            "Performance Prediction Analysis of a Point Feature Tracker Based on Different Motion Models.",
            "On Benchmarking Optical Flow.",
            "Performance Evaluation of Document Structure Extraction Algorithms.",
            "Comparison of Edge Detector Performance through Use in an Object Recognition Task.",
            "Evaluating 2D Image Comparison Metrics for 3D Scene Interpretation.",
            "Generating Realistic Facial Expressions with Wrinkles for Model-Based Coding.",
            "Crease Enhancement Diffusion.",
            "Set Descriptors for Visual Evaluation of Human Corneal Endothelia.",
            "Face Detection Using Multimodal Density Models.",
            "Spatial Models for Fuzzy Clustering.",
            "From Image Analysis to Computer Vision: An Annotated Bibliography, 1955-1979.",
            "Reconstruction Based Recognition of Scenes with Multiple Repeated Components.",
            "Model-Based Object Recognition Using Geometric Invariants of Points and Lines.",
            "A Continuous Probabilistic Framework for Image Matching.",
            "A Critique of Structure-from-Motion Algorithms: Volume 80, Number 2 (2000), pages 172-214."
        ]
    },
    {
        "name": "CVIU",
        "year": "2000",
        "info": "2000: Volumes\n77, 78, 79, 80",
        "count": 71,
        "papers": [
            "Segmentation and Interpretation of Multicolored Objects with Highlights.",
            "Bias-Variance Analysis for Controlling Adaptive Surface Meshes.",
            "ORASSYLL: Object Recognition with Autonomously Learned and Sparse Symbolic Representations Based on Metrically Organized Local Line Detectors.",
            "Analysis of Volumetric Images.",
            "Directional 3D Edge Detection in Anisotropic Data: Detector Design and Performance Assessment.",
            "Multilocal Creaseness Based on the Level-Set Extrinsic Curvature.",
            "Scale-Based Fuzzy Connected Image Segmentation: Theory, Algorithms, and Validation.",
            "Generation of Point-Based 3D Statistical Shape Models for Anatomical Objects.",
            "Average Brain Models: A Convergence Study.",
            "Interpolation Artefacts in Mutual Information-Based Image Registration.",
            "Elastic Matching of Diffusion Tensor Images.",
            "Cue-Based Segmentation of 4D Cardiac Image Sequences.",
            "A Line Feature Matching Technique Based on an Eigenvector Approach.",
            "Invariance Signatures: Characterizing Contours by Their Departures from Invariance.",
            "Watershed-Based Segmentation and Region Merging.",
            "Use of IFS Codes for Learning 2D Isolated-Object Classification Systems.",
            "Robust Computer Vision: An Interdisciplinary Challenge.",
            "Robustly Estimating Changes in Image Appearance.",
            "Real-Time Motion Analysis with Linear Programming.",
            "Motion-Egomotion Discrimination and Motion Segmentation from Image-Pair Streams.",
            "Heteroscedastic Hough Transform (HtHT): An Efficient Method for Robust Line Fitting in the 'Errors in the Variables' Problem.",
            "Robust Image Matching under Partial Occlusion and Spatially Varying Illumination Change.",
            "Robust Recognition Using Eigenimages.",
            "Robust Detection of Lines Using the Progressive Probabilistic Hough Transform.",
            "MLESAC: A New Robust Estimator with Application to Estimating Image Geometry.",
            "Appearance-Based Hand Sign Recognition from Intensity Image Sequences.",
            "Hough Transform Algorithm for Three-Dimensional Segment Extraction and its Parallel Hardware Implementation.",
            "Subpixel Estimation of Circle Parameters Using Orthogonal Circular Detector.",
            "Image Analysis and Computer Vision: 1999.",
            "Efficient Deformable Template Detection and Localization without User Initialization.",
            "Specularities on Surfaces with Tangential Hairs or Grooves.",
            "Gray-Level Reduction Using Local Spatial Features.",
            "Attentional Scene Segmentation: Integrating Depth and Motion.",
            "Underwater Computer Vision and Pattern Recognition.",
            "Markov Random Field and Fuzzy Logic Modeling in Sonar Imagery: Application to the Classification of Underwater Floor.",
            "Optical and Sonar Image Classification: Wavelet Packet Transform vs Fourier Transform.",
            "Dynamic Stabilization of a Pan and Tilt Camera for Submarine Image Visualization.",
            "Underwater Video Mosaics as Visual Navigation Maps.",
            "Feature Tracking in Video and Sonar Subsea Sequences with Applications.",
            "Estimating Dimensions of Free-Swimming Fish Using 3D Point Distribution Models.",
            "Microbathymetric Mapping from Underwater Vehicles in the Deep Ocean.",
            "Motion-Based Compression of Underwater Video Imagery for the Operations of Unmanned Submersible Vehicles.",
            "Modeling Parameter Space Behavior of Vision Systems Using Bayesian Networks.",
            "Scene-Based Shot Change Detection and Comparative Evaluation.",
            "Color Measurement by Imaging Spectrometry.",
            "Camera Calibration for Road Applications.",
            "Nested Local Symmetry Set.",
            "Modeling Wave Set: Definition and Application of a New Topological Organization for 3D Object Modeling.",
            "Classifying the Literature Related to Computer Vision and Image Analysis.",
            "Computing the Cost of Occlusion.",
            "The Visual Looming Navigation Cue: A Unified Approach.",
            "3D Object Recognition and Pose with Relational Indexing.",
            "Cooperative Stereo-Motion: Matching and Reconstruction.",
            "Polyhedral Representation and Adjacency Graph in n-dimensional Digital Images.",
            "Anatomical Modeling with Fuzzy Implicit Surface Templates: Application to Automated Localization of the Heart and Lungs in Thoracic MR Volumes.",
            "A Fuzzy Rule-Based Approach to Scene Description Involving Spatial Relationships.",
            "Tracking Groups of People.",
            "The First Absolute Central Moment in Low-Level Image Processing.",
            "Using Shape and Layout Information to Find Signatures, Text, and Graphics.",
            "Localized Scene Interpretation from 3D Models, Range, and Optical Data.",
            "Model-Based Detection of Tubular Structures in 3D Images.",
            "A Critique of Structure-from-Motion Algorithms.",
            "Model Selection Techniques and Merging Rules for Range Data Segmentation Algorithms.",
            "Recovering Estimates of Fluid Flow from Image Sequence Data.",
            "Analyzing the Mallat Wavelet Transform to Delineate Contour and Textural Features.",
            "Recognizing Hand-Printed Digits with a Distance Quasi-Metric.",
            "Implicit and Nonparametric Shape Reconstruction from Unorganized Data Using a Variational Level Set Method.",
            "Learning Task-Specific Object Recognition and Scene Understanding.",
            "Reconstruction of Articulated Objects from Point Correspondences in a Single Uncalibrated Image.",
            "Parallel Thinning Algorithms on 3D (18, 6) Binary Images.",
            "Efficient Computation of the Euclidean Distance Transform."
        ]
    },
    {
        "name": "CVIU",
        "year": "1999",
        "info": "1999: Volumes\n73, 74, 75, 76",
        "count": 87,
        "papers": [
            "Genetic Algorithm for the Extraction of Nonanalytic Objects from Multiple Dimensional Parameter Space.",
            "A Coarse to Fine 3D Registration Method Based on Robust Fuzzy Clustering.",
            "Extracting Group Transformations from Image Moments.",
            "Simultaneous Surface Approximation and Segmentation of Complex Objects.",
            "Feature-Based Object Recognition and Localization in 3D-Space, Using a Single Video Image.",
            "The Visual Analysis of Human Movement: A Survey.",
            "Connected Morphological Operators for Binary Images.",
            "Structural Shape Indexing with Feature Generation Models.",
            "Iterative Pose Computation from Line Correspondences.",
            "Sensor Planning for 3D Object Search, .",
            "Novel Active Vision-Based Visual Threat Cue for Autonomous Navigation Tasks.",
            "Edge Detection in Range Images Based on Scan Line Approximation.",
            "A Constraint-Satisfaction Approach for 3-D Object Recognition by Integrating 2-D and 3-D Data, .",
            "Optimal Pose Estimation in Two and Three Dimensions.",
            "Parameterized Modeling and Recognition of Activities.",
            "Thin Nets Extraction Using a Multi-scale Approach.",
            "Robust Motion Estimation for Calibrated Cameras from Monocular Image Sequences, .",
            "Characterization of Errors in Compositing Panoramic Images.",
            "Image Contrast Enhancement by Constrained Local Histogram Equalization.",
            "Measuring Corner Properties.",
            "Motion Analysis by Random Sampling and Voting Process.",
            "Constrained Hough Transforms for Curve Detection.",
            "The Velocity Snake: Deformable Contour for Tracking in Spatio-Velocity Space.",
            "Solution of the Simultaneous Pose and Correspondence Problem Using Gaussian Error Model.",
            "Optimal Computing the Chessboard Distance Transform on Parallel Processing Systems, .",
            "Interactively Matching Hand-Drawings Using Induction.",
            "Euclidean Ordering via Chamfer Distance Calculations.",
            "Parametric Model of the Perspective Projection of a Road with Applications to Lane Keeping and 3D Road Reconstruction.",
            "Human Motion Analysis: A Review.",
            "Convexity Rule for Shape Decomposition Based on Discrete Contour Evolution.",
            "Age Classification from Facial Images.",
            "Pattern Matching as a Correlation on the Discrete Motion Group.",
            "Image Analysis and Computer Vision: 1998.",
            "An Implementation of the Hough Transformation for the Identification and Labelling of Fixed Period Sinusoidal Curves.",
            "Detection of Independent Motion Using Directional Motion Estimation.",
            "Binocular Shape Reconstruction: Psychological Plausibility of the 8-Point Algorithm.",
            "Automatic Object Extraction from Aerial Imagery - A Survey Focusing on Buildings.",
            "Distance Transform Algorithm for Bit-Serial SIMD Architectures.",
            "On Estimating the Uncertainty in the Location of Image Points in 3D Recognition from Match Sets of Different Sizes.",
            "Tracking Persons in Monocular Image Sequences.",
            "Alternative Tilings for Improved Surface Area Estimates by Local Counting Algorithms.",
            "Grammatical Inference of Dashed Lines.",
            "The Use of Boolean Model for Texture Analysis of Grey Images.",
            "GUEST EDITORS' INTRODUCTION: Content-Based Access of Image and Video Libraries.",
            "A Stochastic Framework for Optimal Key Frame Extraction from MPEG Video Databases.",
            "A Distance Measure for Video Sequences.",
            "A Novel Vector-Based Approach to Color Image Retrieval Using a Vector Angular-Based Distance Measure.",
            "Dimensionality Reduction for Similarity Searching in Dynamic Databases.",
            "Finding Salient Regions in Images: Nonparametric Clustering for Image Segmentation and Grouping.",
            "Unifying Textual and Visual Cues for Content-Based Image Retrieval on the World Wide Web.",
            "Fast Wavelet Histogram Techniques for Image Indexing.",
            "ASSERT: A Physician-in-the-Loop Content-Based Retrieval System for HRCT Image Databases.",
            "Features and Classification Methods to Locate Deciduous Trees in Images.",
            "Probabilistic Feature Relevance Learning for Content-Based Image Retrieval.",
            "Image Classification and Querying Using Composite Region Templates.",
            "A Flexible Image Database System for Content-Based Retrieval.",
            "A Hierarchical Multiresolution Video Shot Transition Detection Scheme.",
            "Connected Filtering and Segmentation Using Component Trees.",
            "Tracking of Human Limbs by Multiocular Vision.",
            "Animated Heads from Ordinary Images: A Least-Squares Approach.",
            "Finding the Collineation between Two Projective Reconstructions.",
            "A Region-Based Scheme Using RKLT and Predictive Classified Vector Quantization.",
            "The Motion Analysis of Nonrigid Membranes.",
            "The Euler Characteristics of Discrete Objects and Discrete Quasi-Objects.",
            "Guest Editors' Introduction: Perceptual Organization in Computer Vision: Status, Challenges, and Potential.",
            "Ground from Figure Discrimination.",
            "Beyond the Uniqueness Assumption: Ambiguity Representation and Redundancy Elimination in the Computation of a Covering Sample of Salient Contour Cycles.",
            "A Probabilistic Method for Extracting Chains of Collinear Segments.",
            "Grouping ., -, ->, [formula], into Regions, Curves, and Junctions.",
            "Perceptual Organization of Occluding Contours of Opaque Surfaces.",
            "A Perceptual Grouping Hierarchy for Appearance-Based 3D Object Recognition.",
            "Detecting Perceptually Salient Texture Regions in Images.",
            "Dealing with Noise in Multiframe Structure from Motion.",
            "Computation of the Sign of the Gaussian Curvature of a Surface from Multiple Unknown Illumination Images without Knowledge of the Reflectance Property.",
            "Recognition of Planar Objects Using the Density of Affine Shape.",
            "Contour Fragment Grouping and Shared, Simple Occluders.",
            "Fast Euclidean Distance Transformation by Propagation Using Multiple Neighborhoods.",
            "Wavelet-Based Off-Line Handwritten Signature Verification.",
            "Three-Class Markovian Segmentation of High-Resolution Sonar Images.",
            "A Probabilistic Model for Recovering Camera Translation.",
            "Multiscale Annealing for Grouping and Unsupervised Texture Segmentation.",
            "Ligature Instabilities in the Perceptual Organization of Shape.",
            "3-D Reconstruction of Urban Scenes from Aerial Stereo Imagery: A Focusing Strategy.",
            "General Ribbons: A Model for Stylus-Generated Images.",
            "General Ribbon-Based Thinning Algorithms for Stylus-Generated Images.",
            "Uncertain Reasoning and Learning for Feature Grouping.",
            "Computing Stochastic Completion Fields in Linear-Time Using a Resolution Pyramid."
        ]
    },
    {
        "name": "CVIU",
        "year": "1998",
        "info": "1998: Volumes\n69, 70, 71, 72",
        "count": 103,
        "papers": [
            "The What-and-Where Filter: A Spatial Mapping Neural Network for Object Recognition and Image Understanding.",
            "X Vision: A Portable Substrate for Real-Time Vision Applications.",
            "Comparison of Edge Detectors: A Methodology and Initial Study.",
            "Zoom-Invariant Vision of Figural Shape: The Mathematics of Cores.",
            "Zoom-Invariant Vision of Figural Shape: Effects on Cores of Image Disturbances.",
            "Model-Based 3D Object Recognition Using Bayesian Indexing.",
            "Two Fast Euclidean Distance Transformations in Z2Based on Sufficient Propagation.",
            "Guaranteed Convergence of the Hough Transform.",
            "Using Local Planar Geometric Invariants to Match and Model Images of Line Segments.",
            "Pruning Medial Axes.",
            "A Review of Biologically Motivated Space-Variant Data Reduction Models for Robotic Vision.",
            "A Fast Surface-Based Procedure for Object Reconstruction from 3D Scattered Points.",
            "Segmentation and Recognition of Dimensioning Text from Engineering Drawings.",
            "Parameterizing Arbitrary Shapes via Fourier Descriptors for Evidence-Gathering Extraction.",
            "Dense Structure from a Dense Optical Flow Sequence.",
            "Matching 2D Polygonal Arcs by Using a Subgroup of the Unit Quaternions.",
            "Recent Progress in CAD-Based Computer Vision: An Introduction to the Special Issue.",
            "Simultaneous Registration of Multiple Range Views for Use in Reverse Engineering of CAD Models.",
            "Implicit Surface-Based Geometric Fusion.",
            "3-D Reconstruction of Urban Scenes from Image Sequences.",
            "The Space Envelope: A Representation for 3D Scenes.",
            "Efficient Nonlinear Finite Element Modeling of Nonrigid Objects via Optimization of Mesh Models.",
            "Affine Matching of Planar Sets.",
            "Detection and Characterization of Isolated and Overlapping Spots.",
            "Extended Attributed String Matching for Shape Recognition.",
            "A Subpattern Level Inspection System for Printed Circuit Boards.",
            "A Dynamic and Multiresolution Model of Visual Attention and Its Application to Facial Landmark Detection.",
            "Segmentation of Printed Circuit Board Images into Basic Patterns.",
            "Motion-Model-Based Boundary Extraction and a Real-Time Implementation.",
            "Pattern Classification with Compact Distribution Maps.",
            "Joint Invariants of a Triplet of Coplanar Conics: Stability and Discriminating Power for Object Recognition.",
            "Morphological Scale Space for 2D Shape Smoothing.",
            "Nonrigid Motion Analysis: Articulated and Elastic Motion.",
            "Efficient Multiresolution Counterparts to Variational Methods for Surface Reconstruction.",
            "Modelbase Partitioning Using Property Matrix Spectra.",
            "Complete Shape from Imperfect Contour: A Rule-Based Approach.",
            "3D Road Reconstruction from a Single View.",
            "A Fully Projective Formulation to Improve the Accuracy of Lowe's Pose-Estimation Algorithm.",
            "Image Analysis and Computer Vision: 1997.",
            "Special Issue on Document Image Understanding and Retrieval.",
            "The Indexing and Retrieval of Document Images: A Survey.",
            "Categorizing Paper Documents: A Generic System for Domain and Language Independent Text Categorization.",
            "Summarization of Imaged Documents without OCR.",
            "Analysis of Compressed Document Images for Dominant Skew, Multiple Skew, and Logotype Detection.",
            "Symbolic Compression and Processing of Document Images.",
            "Page Segmentation Using the Description of the Background.",
            "Segmentation of Page Images Using the Area Voronoi Diagram.",
            "A Model-Based Segmentation Method for Handwritten Numeral Strings.",
            "Hidden Markov Model Based Word Recognition and Its Application to Legal Amount Reading on French Checks.",
            "A Generic Integrated Line Detection Algorithm and Its Object-Process Specification.",
            "Multilevel Approach and Distributed Consistency for Technical Map Interpretation: Application to Cadastral Maps.",
            "On the Determination of Epipoles Using Cross-Ratios.",
            "Recognition of Off-Line Cursive Handwriting.",
            "A Parametric Deformable Model to Fit Unstructured 3D Data.",
            "Multiscale Contour Segmentation and Approximation: An Algorithm Based on the Geometry of Regular Inscribed Polygons.",
            "Using Photometric Invariants for 3D Object Recognition.",
            "Segmentation of Video by Clustering and Graph Analysis.",
            "Quantitative Measures of Change Based on Feature Organization: Eigenvalues and Eigenvectors.",
            "Modeling the Ground Plane Transformation for Real-Time Obstacle Detection.",
            "Telepresence by Real-Time View-Dependent Image Generation from Omnidirectional Video Streams.",
            "Efficient Scene Change Detection and Camera Motion Annotation for Video Classification.",
            "Invariant-Based Shape Retrieval in Pictorial Databases.",
            "Progressive Content-Based Shape Compression for Retrieval of Binary Images.",
            "Human Face Image Recognition: An Evidence Aggregation Approach.",
            "Image Analysis for 3D Modeling, Rendering, and Virtual View Generation.",
            "Texture Classification and Segmentation by Cellular Neural Networks Using Genetic Learning.",
            "Analyzing a Scene's Picture Set under Varying Lighting.",
            "Boundary Extraction of Discrete Objects.",
            "Hidden Deletable Pixel Detection Using Vector Analysis in Parallel Thinning to Obtain Bias-Reduced Skeletons.",
            "Robust Detection of Degenerate Configurations while Estimating the Fundamental Matrix.",
            "3D Free-Form Object Recognition Using Indexing by Contour Features.",
            "Effects of Errors in the Viewing Geometry on Shape Estimation.",
            "Analysis of Mixed Korean Documents Using the Branch and Bound Algorithm Based on DP Matching.",
            "Feature Tracking with Automatic Selection of Spatial Scales.",
            "Optimal Speed-Up Parallel Image Template Matching Algorithms on Processor Arrays with a Reconfigurable Bus System.",
            "Preprocessing of Face Images: Detection of Features and Pose Normalization.",
            "Area-Based Matching for Simultaneous Registration of Multiple 3-D Profile Maps.",
            "Fast Binary Image Processing Using Binary Decision Diagrams.",
            "Recursive Estimation of Illuminant Motion from Flow Field and Simultaneous Recovery of Shape.",
            "Structural Matching with Active Triangulations.",
            "On Accurate and Robust Estimation of Fundamental Matrix.",
            "Constrained Active Region Models for Fast Tracking in Color Image Sequences.",
            "Stability of Corner Points in Scale Space: The Effects of Small Nonrigid Deformations.",
            "Geometric, Algebraic, and Thermophysical Techniques for Object Recognition in IR Imagery.",
            "Automatic Building Extraction from Aerial Images.",
            "Building Detection and Description from a Single Intensity Image.",
            "Building Detection and Reconstruction from Mid- and High-Resolution Aerial Imagery.",
            "The Ascender System: Automated Site Modeling from Multiple Aerial Images.",
            "The Role of Color Attributes and Similarity Grouping in 3-D Building Reconstruction.",
            "Extracting Buildings from Aerial Images Using Hierarchical Aggregation in 2D and 3D.",
            "Interpretation of Urban Surface Models Using 2D Building Information.",
            "From the Hough Transform to a New Approach for the Detection and Approximation of Elliptical Arcs.",
            "Generating Dynamic Projection Images for Scene Representation and Understanding.",
            "Discontinuity-Preserving Surface Reconstruction Using Stochastic Differential Equations.",
            "Accuracy vs Efficiency Trade-offs in Optical Flow Algorithms.",
            "Invariant-Based Recognition of Complex Curved 3D Objects from Image Contours.",
            "Object Location by Parallel Pose Clustering.",
            "Direct Visible Surface Interpolation.",
            "3D Shape Matching and Inspection Using Geometric Features and Relational Learning.",
            "Image Warping for Shape Recovery and Recognition.",
            "Indexing Based on Algebraic Functions of Views.",
            "Support Function Representation of Convex Bodies, Its Application in Geometric Computing, and Some Related Representations.",
            "Distance-Ordered Homotopic Thinning: A Skeletonization Algorithm for 3D Digital Images."
        ]
    },
    {
        "name": "CVIU",
        "year": "1997",
        "info": "1997: Volumes\n65, 66, 67, 68",
        "count": 102,
        "papers": [
            "Surface Recovery from Range Images Using Curvature and Motion Consistency.",
            "A Two-Stage Algorithm for Motion Discontinuity-Preserving Optical Flow Estimation.",
            "Adaptive Vectorization of Line Drawing Images.",
            "Constraint, Optimization, and Hierarchy: Reviewing Stereoscopic Correspondence of Complex Features.",
            "Model-Based Joint Motion and Structure Estimation from Stereo Images.",
            "Deformation Invariants in Object Recognition.",
            "Guest Editors' Introduction.",
            "The Computational Perception of Scene Dynamics.",
            "Inferring 2D Object Structure from the Deformation of Apparent Contours.",
            "Imposing Hard Constraints on Deformable Models through Optimization in Orthogonal Subspaces.",
            "Speechreading using Probabilistic Models.",
            "Flexible Images: Matching and Recognition Using Learned Deformations.",
            "Physics-Based Visual Understanding.",
            "Influence of an Explicitly Modelled 3D Scene on the Tracking of Partially Occluded Vehicles.",
            "Analysis of the Pulmonary Vascular Tree Using Differential Geometry Based Vector Fields.",
            "Velcro Surfaces: Fast Initialization of Deformable Models.",
            "Volumetric Segmentation of Medical Images by Three-Dimensional Bubbles.",
            "Multiscale Approach to Image Sequence Analysis.",
            "Physics-Based Segmentation of Complex Objects Using Multiple Hypotheses of Image Formation.",
            "Recovering the Shape of Polyhedra Using Line-Drawing Analysis and Complex Reflectance Models.",
            "Color Constancy for Scenes with Varying Illumination.",
            "Casting Light on Illumination: A Computational Model and Dimensional Analysis of Sources.",
            "Detection of Specularity Using Stereo in Color and Polarization Space.",
            "Surface Curvature and Shape Reconstruction from Unknown Multiple Illumination and Integrability.",
            "Shape from Radiological Density.",
            "Heuristic Linking Models in Multiscale Image Segmentation.",
            "3D-2D Projective Registration of Free-Form Curves and Surfaces.",
            "The Geometry of Visual Space: About the Incompatibility between Science and Mathematics.",
            "Reply to Pizlo, Rosenfeld, and Weiss.",
            "Reply to Pizlo, Rosenfeld, and Weiss.",
            "There Is More to Vision than Geometry - Reply to Pizlo, Rosenfeld, and Weiss.",
            "How Useful is Projective Geometry?",
            "Constancy and Similarity.",
            "Visual Space: Mathematics, Engineering, and Science.",
            "Asynchronous Perceptual Grouping: From Contours to Relevant 2-D Structures.",
            "Optical-Model-Based Analysis of Consecutive Images.",
            "Image Analysis and Computer Vision: 1996.",
            "Biomedical Image Analysis.",
            "Shape and the Information in Medical Images: A Decade of the Morphometric Synthesis.",
            "Shape Reconstruction from an Endoscope Image by Shape from Shading Technique for a Point Light Source at the Projection Center.",
            "Extraction of Shape Skeletons from Grayscale Images.",
            "3D Voronoi Skeletons and Their Usage for the Characterization and Recognition of 3D Organ Shape.",
            "Deformable B-Solids and Implicit Snakes for 3D Localization and Tracking of SPAMM MRI Data.",
            "On Computing Aspect Graphs of Smooth Shapes from Volumetric Data.",
            "Extension of the ICP Algorithm to Nonrigid Intensity-Based Registration of 3D Volumes.",
            "Spatial Transformation and Registration of Brain Images Using Elastically Deformable Models.",
            "Deformations Incorporating Rigid Structures.",
            "Nonlinear Multiscale Representations for Image Segmentation.",
            "Aq-Series Approach to Deblurring the Discrete Gaussian.",
            "Shape from Shading and Photometric Stereo Using Surface Approximation by Legendre Polynomials.",
            "Matching Feature Points in Image Sequences through a Region-Based Method.",
            "Designing Fourier Descriptor-Based Geometric Models for Object Interpretation in Medical Images Using Genetic Algorithms.",
            "Implicit Reconstruction by Zooming.",
            "Discrete Convexity, Straightness, and the 16-Neighborhood.",
            "Structural Indexing for Character Recognition.",
            "An Optimizing Line Finder Using a Hough Transform Algorithm.",
            "From Volume Medical Images to Quadratic Surface Patches.",
            "Using Consensus Sequence Voting to Correct OCR Errors.",
            "Using Bilateral Symmetry to Improve 3D Reconstruction from Image Sequences.",
            "A Nonlinear Gauss-Seidel Algorithm for Noncoplanar and Coplanar Camera Calibration with Convergence Analysis.",
            "How Many 2D Silhouettes Does It Take to Reconstruct a 3D Object?",
            "Segmentation and Classification of Edges Using Minimum Description Length Approximation and Complementary Junction Cues.",
            "Preservation of Topological Properties of a Simple Closed Curve under Digitalization.",
            "Image Registration Using a New Edge-Based Approach.",
            "A Realistic Digitization Model of Straight Lines.",
            "Shape from Shading with a Generalized Reflectance Map Model.",
            "Knowledge-Based Image Understanding Systems: A Survey.",
            "Line Correspondences from Cooperating Spatial and Temporal Grouping Processes for a Sequence of Images.",
            "A Tighter Lower Bound on the Spetsakis-Aloimonos Trilinear Constraints.",
            "Data- and Model-Driven Selection Using Parallel Line Groups.",
            "Visual Behaviors for Docking.",
            "Active Object Recognition Integrating Attention and Viewpoint Control.",
            "Computing and Simplifying 2D and 3D Continuous Skeletons.",
            "Image Processing for Planetary Limb/Terminator Extraction.",
            "Thin Nets and Crest Lines: Application to Satellite Data and Medical Images.",
            "A Parallel Feature Tracker for Extended Image Sequences.",
            "Circular Arcs Fitted on a Riemann Sphere.",
            "Reply to Pizlo, Rosenfeld, and Weiss.",
            "Reply to Pizlo, Rosenfeld, and Weiss.",
            "A Theory of Multiscale, Torsion-Based Shape Representation for Space Curves.",
            "Characterizing the Uncertainty of the Fundamental Matrix.",
            "A Comparison of Projective Reconstruction Methods for Pairs of Views.",
            "Analysis and Synthesis of Deformed Patterns Based on Structural Models.",
            "Image Segmentation from Consensus Information.",
            "Recognition and Integration of Dimension Sets in Vectorized Engineering Drawings.",
            "Parallel Computation of the Euclidean Distance Transform on the Mesh of Trees and the Hypercube Computer.",
            "Instantiating Deformable Models with a Neural Net.",
            "Feature Identification from Vectorized Mechanical Drawings.",
            "Triangulation.",
            "Fixation Simplifies 3D Motion Estimation.",
            "Shape Representation and Recognition from Multiscale Curvature.",
            "Detecting Perceptually Parallel Curves: Criteria and Force-Driven Optimization.",
            "Hypothesis Verification Using Parametric Models and Active Vision Strategies.",
            "Finding Point Correspondences in Motion Sequences Preserving Affine Structure.",
            "Color Snakes.",
            "Tribute.",
            "A Novel Approach to Computation of the Shape of a Dot Pattern and Extraction of Its Perceptual Border.",
            "Optical Flow Estimation Using Discontinuity Conforming Filters.",
            "Pattern Recognition in Images by Symmetries and Coordinate Transformations.",
            "Space-Variant Approaches to Recovery of Depth from Defocused Images.",
            "Digital Connectivity and Extended Well-Composed Sets for Gray Images.",
            "Motion from Color."
        ]
    },
    {
        "name": "CVIU",
        "year": "1996",
        "info": "1996: Volumes\n63, 64",
        "count": 66,
        "papers": [
            "Multiresolution Surface Modeling Based on Hierarchical Triangulation.",
            "A Parallel Euclidean Distance Transformation Algorithm.",
            "Data- and Model-Driven Multiresolution Processing.",
            "An Active Foveated Vision System: Attentional Mechanisms and Scan Path Covergence Measures.",
            "Font and Function Word Identification in Document Recognition.",
            "The Robust Estimation of Multiple Motions: Parametric and Piecewise-Smooth Flow Fields.",
            "Knowledge-Based Interpretation of Utility Maps.",
            "Contour Tracking by Enhancing Corners and Junctions.",
            "Parameterized Feasible Boundaries in Gradient Vector Fields.",
            "Analyzing Nonconvex 2D and 3D Patterns.",
            "Representing 3-D Objects in Range Images Using Geons.",
            "Dynamic Updating of Planar Structure and Motion: The Case of Constant Motion.",
            "A Probabilistic Approach to Geometric Hashing Using Line Features.",
            "Analysis of Affine Invariants as Approximate Perspective Invariants.",
            "A Hierarchical Approach to Efficient Curvilinear Object Searching.",
            "Photomotion.",
            "Surface Correspondence and Motion Computation from a Pair of Range Images.",
            "Piecewise-Linear Interpolation between Polygonal Slices.",
            "Perfecting Vectorized Mechanical Drawings.",
            "Automatic PCB Inspection Algorithms: A Survey.",
            "Camera Calibration without Feature Extraction.",
            "Characterizing Digital Convexity and Straightness in Terms of \"Length\" and \"Total Absolute Curvature\".",
            "Recognition of Partial Circular Shapes from Segmented Contours.",
            "Hierarchical Representation of Chain-Encoded Binary Image Contours.",
            "Reconstruction and Boundary Detection of Range and Intensity Images Using Multiscale MRF Representations.",
            "The Curve Axis.",
            "An Active Lattice Model in a Bayesian Framework.",
            "An Algorithm for a 3D Simplicity Test.",
            "Digital Topology on Graphs.",
            "Grouping Symmetrical Structures for Object Segmentation and Description.",
            "3D Digital Topology under Binary Transformation with Applications.",
            "Recovering the Three-Dimensional Motion and Structure of Multiple Moving Objects from Binocular Image Flows.",
            "Analysis of Error in Depth Perception with Vergence and Spatially Varying Sensing.",
            "Voronoi Pyramids Controlled by Hopfield Neural Networks.",
            "A Performance Measure for Boundary Detection Algorithms.",
            "Iterative Pose Estimation Using Coplanar Feature Points.",
            "Deriving Stopping Rules for the Probabilistic Hough Transform by Sequential Analysis.",
            "A Hybrid Hyperquadric Model for 2-D and 3-D Data Fitting.",
            "A Maximum Likelihood Stereo Algorithm.",
            "Image Analysis and Computer Vision: 1995.",
            "Perceptual Completion of Occluded Surfaces.",
            "Computing Egomotion and Detecting Independent Motion from Image Motion Using Collinear Points.",
            "On the Area of Overlap of Translated Polygons.",
            "Global Three-Dimensional Surface Reconstruction from Occluding Contours.",
            "High-Speed Extraction of 3D Structure of Selectable Quality Using a Translating Camera.",
            "Taking Advantage of Image-Based and Geometry-Based Constraints to Recover 3-D Surfaces.",
            "The First Order Expansion of Motion Equations in the Uncalibrated Case.",
            "A 3D Surface Tracking Algorithm.",
            "Grouping as a Searching Process for Minimum-Energy Configurations of Labelled Random Fields.",
            "Detecting Planar and Curved Symmetries of 3D Shapes from a Range Image.",
            "Global Shape from Shading.",
            "Canonical Representations for the Geometries of Multiple Projective Views.",
            "Finding the Parts of Objects in Range Images.",
            "Shape Recognition by Integrating Structural Descriptions and Geometrical/Statistical Transforms.",
            "Line Symmetry of Convex Digital Regions.",
            "Direct Solution of Orientation-from-Color Problem Using a Modification of Pentland's Light Source Direction Estimator.",
            "Fast Noise Variance Estimation.",
            "Geometric Heat Equation and Nonlinear Diffusion of Shapes and Images.",
            "Direct Computation of the FOE with Confidence Measures.",
            "Programming a Pipelined Image Processor.",
            "On Digital Distance Transforms in Three Dimensions.",
            "Attribute Openings, Thinnings, and Granulometries.",
            "Regularity Properties of Distance Transformations in Image Analysis.",
            "A Probabilistic Approach to Perceptual Grouping.",
            "A Fully Parallel 3D Thinning Algorithm and Its Applications.",
            "Recursive Estimation of Motion Parameters."
        ]
    },
    {
        "name": "CVIU",
        "year": "1995",
        "info": "1995: Volumes\n61, 62",
        "count": 58,
        "papers": [
            "Registering Range Views of Multipart Objects.",
            "A Systolic Approach for Real Time Connected Component Labeling.",
            "A Game Strategy Approach for Image Labeling.",
            "Active Shape Models-Their Training and Application.",
            "Parallel Simulated Annealing for Shape Detection.",
            "Well-Composed Sets.",
            "Planning for Complete Sensor Coverage in Inspection.",
            "Using Affine Invariants on Perspective Projections of Plane Curves.",
            "Optimal Sensor and Light Source Positioning for Machine Vision.",
            "The Characterization and Detection of Skewed Symmetry.",
            "Editorial.",
            "Parametrization of Closed Surfaces for 3-D Shape Description.",
            "Using Partial Derivatives of 3D Images to Extract Typical Surface Features.",
            "Computing the Differential Characteristics of Isointensity Surfaces.",
            "A Framework for Constructing Probability Distributions on the Space of Image Segmentations.",
            "A Survey of Automated Visual Inspection.",
            "Detection of Regions Matching Specified Chromatic Features.",
            "High Speed Image Rotation in Embedded Systems.",
            "Hough Transform on Reconfigurable Meshes.",
            "Recovering Range Using Virtual Multicamera Stereo.",
            "Recent Progress in CAD-Based Vision.",
            "A Robust Method for Registration and Segmentation of Multiple Range Images.",
            "Building Three-Dimensional Object Models from Image Sequences.",
            "Description of Complex Objects from Multiple Range Images Using an Inflating Balloon Model.",
            "Accuracy-Based Sampling and Reconstruction with Adaptive Meshes for Parallel Hierarchical Triangulation.",
            "Optimal Geometric Model Matching under Full 3D Perspective.",
            "Aspect-Trees: Generation and Interpretation.",
            "Interactive Learning of a Multiple-Attribute Hash Table Classifier for Fast Object Recognition.",
            "An Investigation into the Use of Physical Modeling for the Prediction of Various Feature Types Visible from Different Viewpoints.",
            "IVIS: An Integrated Volumetric Inspection System.",
            "Planning Focus of Attention for Multifingered Hand with Consideration of Time-Varying Aspects.",
            "Automatic Sensor Placement for Accurate Dimensional Inspection.",
            "Industrial Inspection and Reverse Engineering.",
            "Hypercube Algorithms for Parallel Processing of Pointer-Based Quadtrees.",
            "A Bayesian Approach to Model Matching with Geometric Hashing.",
            "Using Perceptual Inference Networks to Manage Vision Processes.",
            "Tracking Level Sets by Level Sets: A Method for Solving the Shape from Shading Problem.",
            "A Robust Algorithm for Optical Flow Estimation.",
            "New Single-Pass Algorithm for Parallel Thinning.",
            "Structural Feature Extraction Using Multiple Bases.",
            "Image Analysis and Computer Vision: 1994.",
            "Functionality in Object Recognition: Guest Editor's Introduction.",
            "Functional and Physical Object Characteristics and Object Recognition in Improvisation.",
            "Recognition by Functional Parts.",
            "Generic Recognition of Articulated Objects through Reasoning about Potential Function.",
            "Interactive Recognition and Representation of Functionality.",
            "Causal Scene Understanding.",
            "Navigational Functionalities.",
            "Use of Monocular Groupings and Occlusion Analysis in a Hierarchical Stereo System.",
            "The Robust Algorithms for Finding the Center of an Arc.",
            "Integrated Matching and Segmentation of Multiple Features in Two Views.",
            "Robust Vergence with Concurrent Identification of Occlusion and Specular Highlights.",
            "Integration of Multiple Feature Groups and Multiple Views into a 3D Object Recognition System.",
            "Morphological Operators for Image Sequences.",
            "Error Analysis of Camera Movements in Stereo Vehicle Tracking Systems.",
            "Global Shape from Shading.",
            "Digitizations Preserving Topological and Differential Geometric Properties.",
            "Skeletonization via Distance Maps and Level Sets."
        ]
    }
]