[
    {
        "name": "Evolutionary Computation",
        "year": "2022",
        "info": "Volume 30, 2022",
        "count": 5,
        "papers": [
            "Runtime Analysis of Restricted Tournament Selection for Bimodal Optimisation.",
            "Convergence Analysis of the Hessian Estimation Evolution Strategy.",
            "An Analysis of the Influence of Noneffective Instructions in Linear Genetic Programming.",
            "Shape-Constrained Symbolic Regression - Improving Extrapolation with Prior Knowledge.",
            "High-Dimensional Unbalanced Binary Classification by Genetic Programming with Multi-Criterion Fitness Evaluation and Selection."
        ]
    },
    {
        "name": "Evolutionary Computation",
        "year": "2021",
        "info": "Volume 29, 2021",
        "count": 19,
        "papers": [
            "A Systematic Literature Review of the Successors of \"NeuroEvolution of Augmenting Topologies\".",
            "Genetic Programming with Delayed Routing for Multiobjective Dynamic Flexible Job Shop Scheduling.",
            "Feature-Based Diversity Optimization for Problem Instance Classification.",
            "Achieving Highly Scalable Evolutionary Real-Valued Optimization by Exploiting Partial Evaluations.",
            "Effect of Objective Normalization and Penalty Parameter on Penalty Boundary Intersection Decomposition-Based Evolutionary Many-Objective Optimization Algorithms.",
            "Offline Learning with a Selection Hyper-Heuristic: An Application to Water Distribution Network Optimisation.",
            "Improving Model-Based Genetic Programming for Symbolic Regression of Small Expressions.",
            "Probabilistic Contextual and Structural Dependencies Learning in Grammar-Based Genetic Programming.",
            "A Decomposition-Based Evolutionary Algorithm with Correlative Selection Mechanism for Many-Objective Optimization.",
            "Lower Bounds for Non-Elitist Evolutionary Algorithms via Negative Multiplicative Drift.",
            "Automatically Evolving Texture Image Descriptors Using the Multitree Representation in Genetic Programming Using Few Instances.",
            "Interaction-Transformation Evolutionary Algorithm for Symbolic Regression.",
            "Evolving Plasticity for Autonomous Learning under Changing Environmental Conditions.",
            "Iterated Local Search and Other Algorithms for Buffered Two-Machine Permutation Flow Shops with Constant Processing Times on One Machine.",
            "Environmental Adaptation of Robot Morphology and Control Through Real-World Evolution.",
            "Multiobjective Evolutionary Algorithms Are Still Good: Maximizing Monotone Approximately Submodular Minus Modular Functions.",
            "A Self-Adaptive Response Strategy for Dynamic Multiobjective Evolutionary Optimization Based on Objective Space Decomposition.",
            "Maximizing Drift Is Not Optimal for Solving OneMax.",
            "The Univariate Marginal Distribution Algorithm Copes Well with Deception and Epistasis."
        ]
    },
    {
        "name": "Evolutionary Computation",
        "year": "2020",
        "info": "Volume 28, 2020",
        "count": 25,
        "papers": [
            "A Meta-Objective Approach for Many-Objective Evolutionary Optimization.",
            "Global Convergence of the (1 + 1) Evolution Strategy to a Critical Point.",
            "A Revisit of Infinite Population Models for Evolutionary Algorithms on Continuous Optimization Problems.",
            "A Tandem Evolutionary Algorithm for Identifying Causal Rules from Complex Data.",
            "Guiding Neuroevolution with Structural Objectives.",
            "Evolution of Deep Convolutional Neural Networks Using Cartesian Genetic Programming.",
            "Multioracle Coevolutionary Learning of Requirements Specifications from Examples in On-The-Fly Markets.",
            "Automatically Designing State-of-the-Art Multi- and Many-Objective Evolutionary Algorithms.",
            "What Weights Work for You? Adapting Weights for Any Pareto Front Shape in Decomposition-Based Evolutionary Multiobjective Optimisation.",
            "A New Generalized Partition Crossover for the Traveling Salesman Problem: Tunneling between Local Optima.",
            "A Predictive-Reactive Approach with Genetic Programming and Cooperative Coevolution for the Uncertain Capacitated Arc Routing Problem.",
            "Learning and Searching Pseudo-Boolean Surrogate Functions from Small Samples.",
            "Difficulty Adjustable and Scalable Constrained Multiobjective Test Problem Toolkit.",
            "Generating New Space-Filling Test Instances for Continuous Black-Box Optimization.",
            "Diagonal Acceleration for Covariance Matrix Adaptation Evolution Strategies.",
            "Simple Hyper-Heuristics Control the Neighbourhood Size of Randomised Local Search Optimally for LeadingOnes*.",
            "Analysis of the (μ/μI, λ)-CSA-ES with Repair by Projection Applied to a Conically Constrained Problem.",
            "EvoComposer: An Evolutionary Algorithm for 4-Voice Music Compositions.",
            "Genetic Programming for Evolving Similarity Functions for Clustering: Representations and Analysis.",
            "Genetic Programming Hyper-Heuristics with Vehicle Collaboration for Uncertain Capacitated Arc Routing Problems.",
            "High-Order Entropy-Based Population Diversity Measures in the Traveling Salesman Problem.",
            "Inferring Future Landscapes: Sampling the Local Optima Level.",
            "Evolutionary Image Transition and Painting Using Random Walks.",
            "Evolved Transistor Array Robot Controllers.",
            "Errata: Convergence Analysis of Evolutionary Algorithms That Are Based on the Paradigm of Information Geometry."
        ]
    },
    {
        "name": "Evolutionary Computation",
        "year": "2019",
        "info": "Volume 27, 2019",
        "count": 26,
        "papers": [
            "Foreword.",
            "Automated Algorithm Selection: Survey and Perspectives.",
            "Landscape Analysis of a Class of NP-Hard Binary Packing Problems.",
            "Direct Feature Evaluation in Black-Box Optimization Using Problem Transformations.",
            "Automated Algorithm Selection on Continuous Black-Box Problems by Combining Exploratory Landscape Analysis and Machine Learning.",
            "Latin Hypercube Designs with Branching and Nested Factors for Initialization of Automatic Algorithm Configuration.",
            "Automatic Configuration of Multi-Objective Local Search Algorithms for Permutation Problems.",
            "Extending the \"Open-Closed Principle\" to Automated Algorithm Configuration.",
            "A New Framework for Analysis of Coevolutionary Systems - Directed Graph Representation and Random Walks.",
            "Opposition-Based Memetic Algorithm and Hybrid Approach for Sorting Permutations by Reversals.",
            "Constraint Handling Guided by Landscape Analysis in Combinatorial and Continuous Search Spaces.",
            "Multi-Objectivising Combinatorial Optimisation Problems by Means of Elementary Landscape Decompositions.",
            "Hyperplane-Approximation-Based Method for Many-Objective Optimization Problems with Redundant Objectives.",
            "Towards Automation and Augmentation of the Design of Schedulers for Cellular Communications Networks.",
            "A Probabilistic and Multi-Objective Analysis of Lexicase Selection and ε-Lexicase Selection.",
            "On the Runtime Analysis of the Clearing Diversity-Preserving Mechanism.",
            "Anatomy of the Attraction Basins: Breaking with the Intuition.",
            "A Hybrid Genetic Programming Algorithm for Automated Design of Dispatching Rules.",
            "Adaptive Fitness Predictors in Coevolutionary Cartesian Genetic Programming.",
            "Theoretical Analysis of Local Search and Simple Evolutionary Algorithms for the Generalized Travelling Salesperson Problem.",
            "Parameterized Analysis of Multiobjective Evolutionary Algorithms and the Weighted Vertex Cover Problem.",
            "Search Dynamics on Multimodal Multiobjective Problems.",
            "Hypervolume Subset Selection with Small Subsets.",
            "Neuroevolution of a Modular Memory-Augmented Neural Network for Deep Memory Problems.",
            "Gaussian Process Surrogate Models for the CMA Evolution Strategy.",
            "Mirrored Orthogonal Sampling for Covariance Matrix Adaptation Evolution Strategies."
        ]
    },
    {
        "name": "Evolutionary Computation",
        "year": "2018",
        "info": "Volume 26, 2018",
        "count": 22,
        "papers": [
            "Analyzing Evolutionary Optimization in Noisy Environments.",
            "Theoretical and Empirical Analysis of a Spatial EA Parallel Boosting Algorithm.",
            "On Constructing Ensembles for Combinatorial Optimisation.",
            "A New Algorithm Using the Non-Dominated Tree to Improve Non-Dominated Sorting.",
            "GAMBIT: A Parameterless Model-Based Evolutionary Algorithm for Mixed-Integer Problems.",
            "Co-Optimization Free Lunches: Tractability of Optimal Black-Box Algorithms for Maximizing Expected Utility.",
            "Competent Geometric Semantic Genetic Programming for Symbolic Regression and Boolean Function Synthesis.",
            "Quantifying Selection Pressure.",
            "On the Effectiveness of Sampling for Evolutionary Optimization in Noisy Environments.",
            "On Proportions of Fit Individuals in Population of Mutation-Based Evolutionary Algorithm with Tournament Selection.",
            "Probabilistic Analysis of the (1+1)-Evolutionary Algorithm.",
            "Emergent Solutions to High-Dimensional Multitask Reinforcement Learning.",
            "Data-Efficient Design Exploration through Surrogate-Assisted Illumination.",
            "How to Specify a Reference Point in Hypervolume Calculation for Fair Performance Comparison.",
            "Counterexample-Driven Genetic Programming: Heuristic Program Synthesis from Formal Specifications.",
            "Exploiting Linkage Information and Problem-Specific Knowledge in Evolutionary Distribution Network Expansion Planning.",
            "Decomposition Algorithms for a Multi-Hard Problem.",
            "Using Hadoop MapReduce for Parallel Genetic Algorithms: A Comparison of the Global, Grid and Island Models.",
            "Cooperative Coevolution with Formula-Based Variable Grouping for Large-Scale Global Optimization.",
            "Leveraging TSP Solver Complementarity through Machine Learning.",
            "A Large-Scale Experimental Evaluation of High-Performing Multi- and Many-Objective Evolutionary Algorithms.",
            "Modelling Evolutionary Algorithms with Stochastic Differential Equations."
        ]
    },
    {
        "name": "Evolutionary Computation",
        "year": "2017",
        "info": "Volume 25, 2017",
        "count": 23,
        "papers": [
            "Particle Swarm Optimization for Single Objective Continuous Space Problems: A Review.",
            "Evolutionary Visual Exploration: Evaluation of an IEC Framework for Guided Visual Search.",
            "An Effective Evolutionary Hybrid for Solving the Permutation Flowshop Scheduling Problem.",
            "MOTA: A Many-Objective Tuning Algorithm Specialized for Tuning under Multiple Objective Function Evaluation Budgets.",
            "LM-CMA: An Alternative to L-BFGS for Large-Scale Black Box Optimization.",
            "Extending XCS with Cyclic Graphs for Scalability on Complex Boolean Problems.",
            "Principled Design and Runtime Analysis of Abstract Convex Evolutionary Search.",
            "How Crossover Speeds up Building Block Assembly in Genetic Algorithms.",
            "Novelty-Driven Cooperative Coevolution.",
            "Global WASF-GA: An Evolutionary Algorithm in Multiobjective Optimization to Approximate the Whole Pareto Optimal Front.",
            "Evolving a Nelder-Mead Algorithm for Optimization with Genetic Programming.",
            "Online Discovery of Search Objectives for Test-Based Problems.",
            "Identifying Features of Fitness Landscapes and Relating Them to Problem Difficulty.",
            "Multimodal Optimization by Covariance Matrix Self-Adaptation Evolution Strategy with Repelling Subpopulations.",
            "A Hidden Markov Model Approach to the Problem of Heuristic Selection in Hyper-Heuristics with a Case Study in High School Timetabling Problems.",
            "A Probabilistic Reformulation of No Free Lunch: Continuous Lunches Are Not Free.",
            "Performance Analysis of Continuous Black-Box Optimization Algorithms via Footprints in Instance Space.",
            "Problem Features versus Algorithm Performance on Rugged Multiobjective Combinatorial Fitness Landscapes.",
            "Introducing Elitist Black-Box Models: When Does Elitist Behavior Weaken the Performance of Evolutionary Algorithms?",
            "An Enhanced Memetic Algorithm for Single-Objective Bilevel Optimization Problems.",
            "Evolutionary Design of Classifiers Made of Droplets Containing a Nonlinear Chemical Medium.",
            "Expected Fitness Gains of Randomized Search Heuristics for the Traveling Salesperson Problem.",
            "Performance Analysis of Evolutionary Algorithms for Steiner Tree Problems."
        ]
    },
    {
        "name": "Evolutionary Computation",
        "year": "2016",
        "info": "Volume 24, 2016",
        "count": 27,
        "papers": [
            "Comparison of Constraint-Handling Mechanisms for the (1, λ)-ES on a Simple Constrained Problem.",
            "The Dynamics of Cumulative Step Size Adaptation on the Ellipsoid Model.",
            "Evolving a Behavioral Repertoire for a Walking Robot.",
            "Design Mining Interacting Wind Turbines.",
            "A Case Study of Controlling Crossover in a Selection Hyper-heuristic Framework Using the Multidimensional Knapsack Problem.",
            "Binary Image Classification: A Genetic Programming Approach to the Problem of Limited Training Instances.",
            "A Parameterised Complexity Analysis of Bi-level Optimisation with Evolutionary Algorithms.",
            "Open Issues in Evolutionary Robotics.",
            "Robustness of Ant Colony Optimization to Noise.",
            "Toward Large-Scale Continuous EDA: A Random Matrix Theory Perspective.",
            "Evolving Gaussian Mixture Models with Splitting and Merging Mutation Operators.",
            "Deterministic Agent-Based Path Optimization by Mimicking the Spreading of Ripples.",
            "An Analysis of the Fitness Landscape of Travelling Salesman Problem.",
            "Improving the Interpretability of Classification Rules Discovered by an Ant Colony Algorithm: Extended Results.",
            "Hypervolume Subset Selection in Two Dimensions: Formulations and Algorithms.",
            "Statistical Mechanics Approximation of Biogeography-Based Optimization.",
            "Solving Multiple Isolated, Interleaved, and Blended Tasks through Modular Neuroevolution.",
            "Gray Box Optimization for Mk Landscapes (NK Landscapes and MAX-kSAT).",
            "Greedy Hypervolume Subset Selection in Low Dimensions.",
            "Understanding Innovation Engines: Automated Creativity and Improved Stochastic Optimization via Deep Learning.",
            "Editorial for the Special Issue on Combinatorial Optimization Problems.",
            "Generating, Maintaining, and Exploiting Diversity in a Memetic Algorithm for Protein Structure Prediction.",
            "A Hyper-Heuristic Ensemble Method for Static Job-Shop Scheduling.",
            "Hybrid Self-Adaptive Evolution Strategies Guided by Neighborhood Structures for Combinatorial Optimization Problems.",
            "Evolutionary Algorithms for Boolean Functions in Diverse Domains of Cryptography.",
            "A New Cost Function for Evolution of S-Boxes.",
            "The Unrestricted Black-Box Complexity of Jump Functions."
        ]
    },
    {
        "name": "Evolutionary Computation",
        "year": "2015",
        "info": "Volume 23, 2015",
        "count": 24,
        "papers": [
            "General Subpopulation Framework and Taming the Conflict Inside Populations.",
            "A Lifelong Learning Hyper-heuristic Method for Bin Packing.",
            "A Memetic Optimization Strategy Based on Dimension Reduction in Decision Space.",
            "Constrained Novelty Search: A Study on Game Content Generation.",
            "Multiplicative Approximations, Optimal Hypervolume Distributions, and the Choice of the Reference Point.",
            "Analyzing the BBOB Results by Means of Benchmarking Concepts.",
            "Order-2 Stability Analysis of Particle Swarm Optimization.",
            "Fitness Probability Distribution of Bit-Flip Mutation.",
            "Hyper-heuristic Evolution of Dispatching Rules: A Comparison of Rule Representations.",
            "Biased Random-Key Genetic Algorithms for the Winner Determination Problem in Combinatorial Auctions.",
            "Determining Relative Importance and Effective Settings for Genetic Algorithm Control Parameters.",
            "On Using Surrogates with Genetic Programming.",
            "2 Indicator-Based Multiobjective Search.",
            "Adaptive Parent Population Sizing in Evolution Strategies.",
            "odNEAT: An Algorithm for Decentralised Online Evolution of Robotic Controllers.",
            "Fast and Efficient Black Box Optimization Using the Parameter-less Population Pyramid.",
            "Hybrid Evolutionary Approaches to Maximum Lifetime Routing and Energy Efficiency in Sensor Mesh Networks.",
            "Editorial for the Special Issue on Theory of Evolutionary Algorithms 2014.",
            "Analysis of Randomised Search Heuristics for Dynamic Optimisation.",
            "Maximizing Submodular Functions under Matroid Constraints by Evolutionary Algorithms.",
            "Design and Analysis of Schemes for Adapting Migration Intervals in Parallel Evolutionary Algorithms.",
            "On the Performance of Different Genetic Programming Approaches for the SORTING Problem.",
            "Markov Chain Analysis of Cumulative Step-Size Adaptation on a Linear Constrained Problem.",
            "Unbiased Black-Box Complexities of Jump Functions."
        ]
    },
    {
        "name": "Evolutionary Computation",
        "year": "2014",
        "info": "Volume 22, 2014",
        "count": 23,
        "papers": [
            "A Scalable Memetic Algorithm for Simultaneous Instance and Feature Selection.",
            "D2MOPSO: MOPSO Based on Decomposition and Dominance with Archiving Using Crowding Distance in Objective and Solution Spaces.",
            "Evolving Spiking Networks with Variable Resistive Memories.",
            "Genetic Programming for Evolving Due-Date Assignment Models in Job Shop Environments.",
            "Filtering Sensory Information with XCSF: Improving Learning Robustness and Robot Arm Control Performance.",
            "A Model for Analysing the Collective Dynamic Behaviour and Characterising the Exploitation of Population-Based Algorithms.",
            "ETEA: A Euclidean Minimum Spanning Tree-Based Evolutionary Algorithm for Multi-Objective Optimization.",
            "MOEA/D with Adaptive Weight Adjustment.",
            "Genetic Programming and Serial Processing for Time Series Classification.",
            "A Simple Approach to Lifetime Learning in Genetic Programming-Based Symbolic Regression.",
            "Choosing the Appropriate Forecasting Model for Predictive Parameter Control.",
            "A Note on Bound Constraints Handling for the IEEE CEC'05 Benchmark Function Suite.",
            "On a Vector Space Representation in Genetic Algorithms for Sensor Scheduling in Wireless Sensor Networks.",
            "General Upper Bounds on the Runtime of Parallel Evolutionary Algorithms.",
            "Test Problem Construction for Single-Objective Bilevel Optimization.",
            "Life on the Edge: Characterising the Edges of Mutually Non-dominating Sets.",
            "On the Behaviour of the (1, λ)-ES for Conically Constrained Linear Problems.",
            "An Evolutionary Approach for Image Segmentation.",
            "An Adaptive Multi-Swarm Optimizer for Dynamic Optimization Problems.",
            "Parameterized Runtime Analyses of Evolutionary Algorithms for the Planar Euclidean Traveling Salesperson Problem.",
            "Human-Interpretable Feature Pattern Classification System Using Learning Classifier Systems.",
            "Pareto Front Estimation for Decision Making.",
            "Convergence Analysis of Evolutionary Algorithms That Are Based on the Paradigm of Information Geometry."
        ]
    },
    {
        "name": "Evolutionary Computation",
        "year": "2013",
        "info": "Volume 21, 2013",
        "count": 24,
        "papers": [
            "Mutation Rate Matters Even When Optimizing Monotonic Functions.",
            "Mixed Integer Evolution Strategies for Parameter Optimization.",
            "Optimum Oil Production Planning Using Infeasibility Driven Evolutionary Algorithm.",
            "Evolving Fisher Kernels for Biological Sequence Classification.",
            "An Intelligent Multi-Restart Memetic Algorithm for Box Constrained Global Optimisation.",
            "Multi-Objective Optimization with Estimation of Distribution Algorithm in a Noisy Environment.",
            "On Local Search for Bi-objective Knapsack Problems.",
            "A Novel Mating Approach for Genetic Algorithms.",
            "Borg: An Auto-Adaptive Many-Objective Evolutionary Computing Framework.",
            "Asynchronous Master-Slave Parallelization of Differential Evolution for Multi-Objective Optimization.",
            "No Free Lunch and Benchmarks.",
            "Evolution by Adapting Surrogates.",
            "Integrating Iterative Crossover Capability in Orthogonal Neighborhoods for Scheduling Resource-Constrained Projects.",
            "Dynamical Genetic Programming in XCSF.",
            "Resampling versus Repair in Evolution Strategies Applied to a Constrained Linear Problem.",
            "A Study of Redundancy and Neutrality in Evolutionary Optimization.",
            "Benchmarking Parameter-Free AMaLGaM on Functions With and Without Noise.",
            "On the Taxonomy of Optimization Problems Under Estimation of Distribution Algorithms.",
            "On Handling Ephemeral Resource Constraints in Evolutionary Search.",
            "Models of Performance of Evolutionary Program Induction Algorithms Based on Indicators of Problem Difficulty.",
            "Fitness Function Distributions over Generalized Search Neighborhoods in the q-ary Hypercube.",
            "Geometric Differential Evolution for Combinatorial and Programs Spaces.",
            "An Evaluation of Methods for Estimating the Number of Local Optima in Combinatorial Optimization Problems.",
            "Automatic Design of Decision-Tree Algorithms with Evolutionary Algorithms."
        ]
    },
    {
        "name": "Evolutionary Computation",
        "year": "2012",
        "info": "Volume 20, 2012",
        "count": 24,
        "papers": [
            "Deductive Sort and Climbing Sort: New Methods for Non-Dominated Sorting.",
            "Multimodal Optimization Using a Bi-Objective Evolutionary Algorithm.",
            "Automating the Packing Heuristic Design Process with Genetic Programming.",
            "Encouraging Behavioral Diversity in Evolutionary Robotics: An Empirical Study.",
            "Using Previous Models to Bias Structural Learning in the Hierarchical BOA.",
            "Editorial for the Special Issue on Automated Design and Assessment of Heuristic Search Methods.",
            "Estimating Meme Fitness in Adaptive Memetic Algorithms for Combinatorial Problems.",
            "Hyper-Heuristics with Low Level Parameter Adaptation.",
            "On the Effect of Response Transformations in Sequential Parameter Optimization.",
            "Resampling Methods for Meta-Model Validation with Recommendations for Evolutionary Computation.",
            "Using Landscape Topology to Compare Continuous Metaheuristics: A Framework and Case Study on EDAs and Ridge Structure.",
            "Punishment Leads to Cooperative Behavior in Structured Societies.",
            "Motif Difficulty (MD): A Predictive Measure of Problem Difficulty for Evolutionary Algorithms Using Network Motifs.",
            "Quantum-Behaved Particle Swarm Optimization: Analysis of Individual Particle Behavior and Parameter Selection.",
            "Runtime Analysis of an Evolutionary Algorithm for Stochastic Multi-Objective Combinatorial Optimization.",
            "Diagnostic Assessment of Search Controls and Failure Modes in Many-Objective Evolutionary Optimization.",
            "A Study on Scalable Representations for Evolutionary Optimization of Ground Structures.",
            "Benchmarking of Continuous Black Box Optimization Algorithms.",
            "Experimental Comparison of Six Population-Based Algorithms for Continuous Black Box Optimization.",
            "A Comparison of Global Search Algorithms for Continuous Black Box Optimization.",
            "Energy Landscapes of Atomic Clusters as Black Box Optimization Benchmarks.",
            "Restarted Local Search Algorithms for Continuous Black Box Optimization.",
            "Black Box Optimization Benchmarking of the GLOBAL Method.",
            "A Multilevel Memetic Algorithm for Large SAT-Encoded Problems."
        ]
    },
    {
        "name": "Evolutionary Computation",
        "year": "2011",
        "info": "Volume 19, 2011",
        "count": 23,
        "papers": [
            "Computer-Automated Evolution of an X-Band Antenna for NASA's Space Technology 5 Mission.",
            "Evolutionary Dynamics of Tag Mediated Cooperation with Multilevel Selection.",
            "HypE: An Algorithm for Fast Hypervolume-Based Many-Objective Optimization.",
            "A Ripple-Spreading Genetic Algorithm for the Aircraft Sequencing Problem.",
            "Modeling the Performance of Evolutionary Algorithms on the Root Identification Problem: A Case Study with PBIL and CHC Algorithms.",
            "Classification as Clustering: A Pareto Cooperative-Competitive GP Approach.",
            "A Probabilistic Analysis of a Simplified Biogeography-Based Optimization Algorithm.",
            "Abandoning Objectives: Evolution Through the Search for Novelty Alone.",
            "On the Optimal Convergence Probability of Univariate Estimation of Distribution Algorithms.",
            "Constrained Evolutionary Optimization by Means of (μ + λ)-Differential Evolution and Improved Adaptive Trade-Off Model.",
            "Analysis of (1+1) Evolutionary Algorithm and Randomized Local Search with Memory.",
            "Finding Mount Everest and Handling Voids.",
            "A New Approach to Population Sizing for Memetic Algorithms: A Case Study for the Multidimensional Assignment Problem.",
            "Picbreeder: A Case Study in Collaborative Evolutionary Exploration of Design Space.",
            "Evolutionary Squeaky Wheel Optimization: A New Framework for Analysis.",
            "Representations and Evolutionary Operators for the Scheduling of Pump Operations in Water Distribution Networks.",
            "Evolution of Cartesian Genetic Programs for Development of Learning Neural Architecture.",
            "Multi-Objective Reliability-Based Optimization with Stochastic Metamodels.",
            "An Adaptive Evolutionary Multi-Objective Approach Based on Simulated Annealing.",
            "A Methodology to Find the Elementary Landscape Decomposition of Combinatorial Optimization Problems.",
            "Formal Analysis, Hardness, and Algorithms for Extracting Internal Structure of Test-Based Problems.",
            "Tight Analysis of the (1+1)-EA for the Single Source Shortest Path Problem.",
            "Revisiting the Restricted Growth Function Genetic Algorithm for Grouping Problems."
        ]
    },
    {
        "name": "Evolutionary Computation",
        "year": "2010",
        "info": "Volume 18, 2010",
        "count": 25,
        "papers": [
            "Analysis of an Asymmetric Mutation Operator.",
            "Memetic Algorithms for Continuous Optimisation Based on Local Search Chains.",
            "Computing Gap Free Pareto Front Approximations with Stochastic Search Algorithms.",
            "Adaptive Niche Radii and Niche Shapes Approaches for Niching with the CMA-ES.",
            "Strength Pareto Particle Swarm Optimization and Hybrid EA-PSO for Multi-Objective Optimization.",
            "Geometrical Recombination Operators for Real-Coded Evolutionary MCMCs.",
            "Enabling the Extended Compact Genetic Algorithm for Real-Parameter Optimization by Using Adaptive Discretization.",
            "Static and Dynamic Selection Thresholds Governing the Accumulation of Information in Genetic Algorithms Using Ranked Populations.",
            "On Potential Energy Models for EA-based Ab Initio Protein Structure Prediction.",
            "Interactive EC Control of Synthesized Timbre.",
            "Bloat Control Operators and Diversity in Genetic Programming: A Comparative Study.",
            "Editorial for the Special Issue on Theoretical Aspects of Evolutionary Multi-Objective Optimization.",
            "On the Effect of Populations in Evolutionary Multi-Objective Optimisation.",
            "Exploring the Runtime of an Evolutionary Algorithm for the Multi-Objective Shortest Path Problem.",
            "An Efficient Algorithm for Computing Hypervolume Contributions.",
            "An Efficient and Accurate Solution Methodology for Bilevel Multi-Objective Programming Problems Using a Hybrid Evolutionary-Local-Search Algorithm.",
            "A New Method for Modeling the Behavior of Finite Population Evolutionary Algorithms.",
            "Self-Adaptation of Mutation Operator and Probability for Permutation Representations in Genetic Algorithms.",
            "Editorial Introduction.",
            "Learning Factorizations in Estimation of Distribution Algorithms Using Affinity Propagation.",
            "Sensibility of Linkage Information and Effectiveness of Estimated Distributions.",
            "Theoretical Convergence Guarantees for Cooperative Coevolutionary Algorithms.",
            "Approximating Covering Problems by Randomized Search Heuristics Using Multi-Objective Models.",
            "Representation Invariant Genetic Operators.",
            "On the Behaviour of Evolution Strategies Optimising Cigar Functions."
        ]
    },
    {
        "name": "Evolutionary Computation",
        "year": "2009",
        "info": "Volume 17, 2009",
        "count": 30,
        "papers": [
            "Ingo Wegener.",
            "Analyses of Simple Hybrid Algorithms for the Vertex Cover Problem.",
            "Solving the Multiple Competitive Facilities Location and Design Problem on the Plane.",
            "Constraint Handling Using Tournament Selection: Abductive Inference in Partly Deterministic Bayesian Networks.",
            "A Generic Multi-dimensional Feature Extraction Method Using Multiobjective Genetic Programming.",
            "Reinterpreting No Free Lunch.",
            "Corrections on the Box Plots of the Coverage Metric in \"Multiobjective Immune Algorithm with Nondominated Neighbor-based Selection\".",
            "Editorial Introduction.",
            "Objective Reduction in Evolutionary Multiobjective Optimization: Theory and Applications.",
            "A Genetic System Based on Simulated Crossover: Stability Analysis and Relationships with Neural Nets.",
            "Pair Approximations of Takeover Dynamics in Regular Population Structures.",
            "Adaptive Cellular Memetic Algorithms.",
            "A Strategy with Novel Evolutionary Features for the Iterated Prisoner's Dilemma.",
            "Evolutionary Undersampling for Classification with Imbalanced Datasets: Proposals and Taxonomy.",
            "Performance and Efficiency of Memetic Pittsburgh Learning Classifier Systems.",
            "Estimating the Ratios of the Stationary Distribution Values for Markov Chains Modeling Evolutionary Algorithms.",
            "Localization for Solving Noisy Multi-Objective Optimization Problems.",
            "A Preference-Based Evolutionary Algorithm for Multi-Objective Optimization.",
            "Locating and Characterizing the Stationary Points of the Extended Rosenbrock Function.",
            "Editorial Introduction.",
            "Editorial Introduction to the Special Issue: Evolutionary Computing in the Collaborative Research Centre on Computational Intelligence at Technische Universität (TU) Dortmund.",
            "Analysis of Diversity-Preserving Mechanisms for Global Exploration.",
            "S-Metric Calculation by Considering Dominated Hypervolume as Klee's Measure Problem.",
            "Statistical Methods for Convergence Detection of Multi-Objective Evolutionary Algorithms.",
            "Hybrid Evolutionary Optimization of Two-Stage Stochastic Integer Programming Problems: An Empirical Investigation.",
            "On the Use of Problem-Specific Candidate Generators for the Hybrid Optimization of Multi-Objective Production Engineering Problems.",
            "Competitive Coevolutionary Learning of Fuzzy Systems for Job Exchange in Computational Grids.",
            "Increasing the Production Accuracy of Profile Bending with Methods of Computational Intelligence.",
            "Multi-Objective Optimization with Controlled Model Assisted Evolution Strategies.",
            "Dependency Structure Matrix, Genetic Algorithms, and Effective Recombination."
        ]
    },
    {
        "name": "Evolutionary Computation",
        "year": "2008",
        "info": "Volume 16, 2008",
        "count": 22,
        "papers": [
            "Editorial Introduction.",
            "Tracking Moving Optima Using Kalman-Based Predictions.",
            "Automated Discovery of Local Search Heuristics for Satisfiability Testing.",
            "Finding Alternatives and Reduced Formulations for Process-Based Models.",
            "Genetic Algorithms for Data-Driven Web Question Answering.",
            "On Complexity of Optimal Recombination for Binary Representations of Solutions.",
            "Step Length Adaptation on Ridge Functions.",
            "Local Search with Quadratic Approximations into Memetic Algorithms for Optimization with Multiple Criteria.",
            "Multiobjective Immune Algorithm with Nondominated Neighbor-Based Selection.",
            "Efficient Evaluation Functions for Evolving Coordination.",
            "A Graphical Model for Evolutionary Optimization.",
            "The Crowding Approach to Niching in Genetic Algorithms.",
            "An Efficient Non-dominated Sorting Method for Evolutionary Algorithms.",
            "Genetic Algorithms with Memory- and Elitism-Based Immigrants in Dynamic Environments.",
            "A Memetic Genetic Algorithm for the Vertex p-center Problem.",
            "Editorial Introduction to the Special Issue on Evolutionary Computer Vision.",
            "Multitask Visual Learning Using Genetic Programming.",
            "Texture Segmentation by Genetic Programming.",
            "Automated Design of Image Operators that Detect Interest Points.",
            "Human Body Pose Estimation with Particle Swarm Optimisation.",
            "An Enhanced Memetic Differential Evolution in Filter Design for Defect Detection in Paper Production.",
            "On the Choice of the Parent Population Size."
        ]
    },
    {
        "name": "Evolutionary Computation",
        "year": "2007",
        "info": "Volume 15, 2007",
        "count": 22,
        "papers": [
            "Editorial Introduction.",
            "Covariance Matrix Adaptation for Multi-objective Optimization.",
            "On Replacement Strategies in Steady State Evolutionary Algorithms.",
            "A Monotonic Archive for Pareto-Coevolution.",
            "Understanding the Biases of Generalised Recombination: Part II.",
            "In Memoriam Laurence J. Fogel.",
            "Generalization in the XCSF Classifier System: Analysis, Improvement, and Extension.",
            "An Information-Theoretic Analysis on the Interactions of Variables in Combinatorial Optimization Problems.",
            "Reducing the Number of Fitness Evaluations in Graph Genetic Programming Using a Canonical Graph Indexed Database.",
            "Revisiting Negative Selection Algorithms.",
            "Editorial Introduction.",
            "Agent-Based Model of Genotype Editing.",
            "Covariant Genetic Dynamics.",
            "Crossover and Evolutionary Stability in the Prisoner's Dilemma.",
            "A New Approach of Data Clustering Using a Flock of Agents.",
            "A Graph-Based Evolutionary Algorithm: Genetic Network Programming (GNP) and Its Extension Using Reinforcement Learning.",
            "Speeding Up Evolutionary Algorithms through Asymmetric Mutation Operators.",
            "Comparison-Based Algorithms Are Robust and Randomized Algorithms Are Anytime.",
            "A Note on Problem Difficulty Measures in Black-Box Optimization: Classification, Realizations and Predictability.",
            "Geometric Crossovers for Multiway Graph Partitioning.",
            "On the Hardness of Offline Multi-objective Optimization.",
            "Pareto-adaptive epsilon-dominance."
        ]
    },
    {
        "name": "Evolutionary Computation",
        "year": "2006",
        "info": "Volume 14, 2006",
        "count": 24,
        "papers": [
            "Editorial Introduction.",
            "Editorial for the Special Issue on the Best of GECCO 2004.",
            "A Study of Structural and Parametric Learning in XCS.",
            "Human-Competitive Evolution of Quantum Computing Artefacts by Genetic Programming.",
            "Evolutionary Testing Using an Extended Chaining Approach.",
            "Runtime Analysis of the (mu + 1) EA on Simple Pseudo-Boolean Functions.",
            "An Extension of Geiringer's Theorem for a Wide Class of Evolutionary Search Algorithms.",
            "A Note on the Extended Rosenbrock Function.",
            "Editorial Introduction.",
            "Genetic Parallel Programming: Design and Implementation.",
            "Error Thresholds in Genetic Algorithms.",
            "A Probabilistic Classifier System and Its Application in Data Mining.",
            "GASAT: A Genetic Local Search Algorithm for the Satisfiability Problem.",
            "Editorial Introduction.",
            "An Analysis of Mutative sigma-Self-Adaptation on Linear Fitness Functions.",
            "A Step Forward in Studying the Compact Genetic Algorithm.",
            "Optimum Tracking with Evolution Strategies.",
            "A Comparison of Bloat Control Methods for Genetic Programming.",
            "Automated Global Structure Extraction for Effective Local Building Block Processing in XCS.",
            "Editorial Introduction.",
            "Linkage Identification by Fitness Difference Clustering.",
            "Understanding the Biases of Generalised Recombination: Part I.",
            "Evolving Combinatorial Problem Instances That Are Difficult to Solve.",
            "Introducing Robustness in Multi-Objective Optimization."
        ]
    },
    {
        "name": "Evolutionary Computation",
        "year": "2005",
        "info": "Volume 13, 2005",
        "count": 25,
        "papers": [
            "Editorial Introduction.",
            "Editorial Introduction Special Issue on Estimation of Distribution Algorithms.",
            "The Estimation of Distributions and the Minimum Relative Entropy Principle.",
            "Population-Based Continuous Optimization, Probabilistic Modelling and Mean Shift.",
            "Globally Multimodal Problem Optimization Via an Estimation of Distribution Algorithm Based on Unsupervised Learning of Bayesian Networks.",
            "Estimation of Distribution Algorithms with Kikuchi Approximations.",
            "Drift and Scaling in Estimation of Distribution Algorithms.",
            "Space Complexity of Estimation of Distribution Algorithms.",
            "Editorial Introduction.",
            "How Do We Evaluate Artificial Immune Systems?",
            "A Machine Learning Evaluation of an Artificial Immune System.",
            "A Study of Fitness Distance Correlation as a Difficulty Measure in Genetic Programming.",
            "The Hierarchical Fair Competition (HFC) Framework for Sustainable Evolutionary Algorithms.",
            "Editorial Introduction.",
            "Convergence Time for the Linkage Learning Genetic Algorithm.",
            "Self-Organized Modularization in Evolutionary Algorithms.",
            "A Filter-Based Evolutionary Algorithm for Constrained Optimization.",
            "Efficient Genetic Algorithms Using Discretization Scheduling.",
            "Evolving Evolutionary Algorithms Using Linear Genetic Programming.",
            "On the Choice of the Offspring Population Size in Evolutionary Algorithms.",
            "Empirical Analysis of Locality, Heritability and Heuristic Bias in Evolutionary Algorithms: A Case Study for the Multidimensional Knapsack Problem.",
            "RGFGA: An Efficient Representation and Crossover for Grouping Genetic Algorithms.",
            "Evaluating the epsilon-Domination Based Multi-Objective Evolutionary Algorithm for a Quick Computation of Pareto-Optimal Solutions.",
            "Active Vision and Receptive Field Development in Evolutionary Robots.",
            "Conference Review: Evolvable Hardware 2005."
        ]
    },
    {
        "name": "Evolutionary Computation",
        "year": "2004",
        "info": "Volume 12, 2004",
        "count": 26,
        "papers": [
            "Exact Solutions for Evolutionary Strategies on Harmonic Landscapes.",
            "Crossover Invariant Subsets of the Search Space for Evolutionary Algorithms.",
            "Properties of Gray and Binary Representations.",
            "An Orthogonal Multi-objective Evolutionary Algorithm for Multi-objective Optimization Problems with Constraints.",
            "Rule Fitness and Pathology in Learning Classifier Systems.",
            "Editorial Introduction.",
            "At the Crossroads of Evolutionary Computation and Music: Self-Programming Synthesizers, Swarm Orchestras and the Origins of Melody.",
            "Ideal Evaluation from Coevolution.",
            "Combating Coevolutionary Disengagement by Reducing Parasite Virulence.",
            "Dynamic Subset Selection Based on a Fitness Case Topology.",
            "On the Design and Analysis of Competent Selecto-recombinative GAs.",
            "Introduction to Evolutionary Computing.",
            "Editorial Introduction.",
            "Editorial Introduction Special Issue on Memetic Algorithms.",
            "Real-Coded Memetic Algorithms with Crossover Hill-Climbing.",
            "Advanced Fitness Landscape Analysis and the Performance of Memetic Algorithms.",
            "Effective Memetic Algorithms for VLSI Design = Genetic Algorithms + Local Search + Multi-Level Clustering.",
            "Automatic Generation of Controllers for Embodied Legged Organisms: A Pareto Evolutionary Multi-Objective Approach.",
            "Authors' Answer to the Book Review of Introduction to Evolutionary Computing Published in Issue 12: 2.",
            "Conference Review: Evolvable Hardware 2004. The 2004 NASA/DoD Conference on Evolvable Hardware. Ricardo S. Zebulum, David Gwaltney, Gregory Hornby, Didier Keymeulen, Jason Lohn, Adrian Stoica, eds., Seattle, Washington, USA. IEEE Computer Society Press, 2004, ISBN 0-7695-2145-2, pp 352).",
            "Editorial Introduction.",
            "The Cooperative Coevolutionary (1+1) EA.",
            "LARES: An Artificial Chemical Process Approach for Optimization.",
            "Structural Search Spaces and Genetic Operators.",
            "Measures of Diversity for Populations and Distances Between Individuals with Highly Reorganizable Genomes.",
            "Efficient Linkage Discovery by Limited Probing."
        ]
    },
    {
        "name": "Evolutionary Computation",
        "year": "2003",
        "info": "Volume 11, 2003",
        "count": 21,
        "papers": [
            "Reducing the Time Complexity of the Derandomized Evolution Strategy with Covariance Matrix Adaptation (CMA-ES).",
            "Qualms Regarding the Optimality of Cumulative Path Length Control in CSA/CMA-Evolution Strategies.",
            "Locally-Adaptive and Memetic Evolutionary Pattern Search Algorithms.",
            "General Schema Theory for Genetic Programming with Subtree-Swapping Crossover: Part I.",
            "Modification Point Depth and Genome Growth in Genetic Programming.",
            "Erratum: A Species Conserving Genetic Algorithm for Multimodal Function Optimization.",
            "On the Benefits of Populations for Noisy Optimization.",
            "Mapping the Royal Road and other Hierarchical Functions.",
            "Genetic Diversity as an Objective in Multi-Objective Evolutionary Algorithms.",
            "General Schema Theory for Genetic Programming with Subtree-Swapping Crossover: Part II.",
            "Editorial Introduction - Learning Classifier Systems.",
            "Accuracy-Based Learning Classifier Systems: Models, Analysis and Applications to Classification Tasks.",
            "Analysis and Improvement of Fitness Exploitation in XCS: Bounding Models, Tournament Selection, and Bilateral Accuracy.",
            "Bounding the effect of noise in Multiobjective Learning Classifier Systems.",
            "For Real! XCS with Continuous-Valued Inputs.",
            "Editorial Introduction.",
            "A Derived Markov Process for Modeling Reaction Networks.",
            "Analysis of convergence of an evolutionary algorithm with self-adaptation using a stochastic Lyapunov function.",
            "Redundant Representations in Evolutionary Computation.",
            "An Adaptive Sharing Elitist Evolution Strategy for Multiobjective Optimization.",
            "Evolutionary Local Search of Fuzzy Rules through a novel Neuro-Fuzzy encoding method."
        ]
    },
    {
        "name": "Evolutionary Computation",
        "year": "2002",
        "info": "Volume 10, 2002",
        "count": 17,
        "papers": [
            "Fitness Landscapes and Evolvability.",
            "Evolutionary Algorithms for the Satisfiability Problem.",
            "Genetic Programming over Context-Free Languages with Linear Constraints for the Knapsack Problem: First Results.",
            "Network Random Keys-A Tree Representation Scheme for Genetic and Evolutionary Algorithms.",
            "Evolving Neural Network through Augmenting Topologies.",
            "A Methodology for Missle Countermeasures Optimization under Uncertainty.",
            "Group Properties of Crossover and Mutation.",
            "ZCS Redux.",
            "A Species Conserving Genetic Algorithm for Multimodal Function Optimization.",
            "Modeling the Dynamics of Ant Colony Optimization.",
            "Combining Convergence and Diversity in Evolutionary Multiobjective Optimization.",
            "Improved Sampling of the Pareto-Front in Multiobjective Genetic Optimizations by Steady-State Evolution: A Pareto Converging Genetic Algorithm.",
            "Spin-Flip Symmetry and Synchronization.",
            "Embedded Landscapes.",
            "A Computationally Efficient Evolutionary Algorithm for Real-Parameter Optimization.",
            "Calculating the Expected Loss of Diversity of Selection Schemes.",
            "Electronic Calendar and Other EC-Related Resources."
        ]
    },
    {
        "name": "Evolutionary Computation",
        "year": "2001",
        "info": "Volume 9, 2001",
        "count": 23,
        "papers": [
            "A Convergence Analysis of Unconstrained and Bound Constrained Evolutionary Pattern Search.",
            "A Normed Space of Genetic Operators with Applications to Scalability Issues.",
            "Gene Expression and Fast Construction of Distributed Evolutionary Representation.",
            "A Genetic Engineering Approach to Genetic Algorithms.",
            "Where Genetic Algorithms Excel.",
            "Theoretical Analysis of Mutation-Adaptive Evolutionary Algorithms.",
            "Convergence in Evolutionary Programs with Self-Adaptation in Evolution Strategies.",
            "Completely Derandomized Self-Adaptation in Evolution Strategies.",
            "Self-Adaptive Genetic Algorithms with Simulated Binary Crossover.",
            "A Comparison Study of Self-Adaptation in Evolution Strategies and Real-Coded Genetic Algorithms.",
            "Looking Beyond Selection Probabilities: Adaptation of the X2Measure for the Performance Analysis of Selection Methods in GAs.",
            "Local Reinforcement and Recombination in Classifier Systems.",
            "An Analysis of Two-Parent Recombinations for Real-Valued Chromosomes in an Infinite Population.",
            "Constructive Genetic Algorithm for Clustering Problems.",
            "Design of Graph-Based Evolutionary Algorithms: A Case Study for Chemical Process Networks.",
            "Adversarial Search by Evolutionary Computation.",
            "Electronic Calendar and Other EC-Related Activities.",
            "Learning to Solve Planning Problems Efficiently by Means of Genetic Programming.",
            "Optical Coating Designs Using the Family Competition Evolutionary Algorithm.",
            "Evolutionary Driver Scheduling with Relief Chains.",
            "Empirical Modelling of Genetic Algorithms.",
            "Evolution of Adaptive Synapses: Robots with Fast Adaptive Behavior in New Environments.",
            "Electronic Calendar and Other EC-Related Resources."
        ]
    },
    {
        "name": "Evolutionary Computation",
        "year": "2000",
        "info": "Volume 8, 2000",
        "count": 19,
        "papers": [
            "Cooperative Coevolution: An Architecture for Evolving Coadapted Subcomponents.",
            "Information Characteristics and the Structure of Landscapes.",
            "Fitness Landscapes, Memetic Algorithms, and Greedy Operators for Graph Bipartitioning.",
            "Variable Length Representation in Evolutionary Electronics.",
            "Multiobjective Evolutionary Algorithms: Analyzing the State-of-the-Art.",
            "Approximating the Nondominated Front Using the Pareto Archived Evolution Strategy.",
            "Comparison of Multiobjective Evolutionary Algorithms: Empirical Results.",
            "Multiobjective Satisfaction within an Interactive Evolutionary Design Environment.",
            "Efficient and Scalable Pareto Optimization by Evolutionary Local Selection Algorithms.",
            "Analysis of the (1, lambda)-ES on the Parabolic Ridge.",
            "Analysis of the (µ/µ, lambda)-ES on the Parabolic Ridge.",
            "A Genetic Model: Analysis and Application to MAXSAT.",
            "Linkage Problem, Distribution Estimation, and Bayesian Networks.",
            "Adaptive Linkage Crossover.",
            "Building Blocks, Cohort Genetic Algorithms, and Hyperplane-Defined Functions.",
            "Toward Optimal Classifier System Performance in Non-Markov Environments.",
            "Is Echo a Complex Adaptive System?",
            "Architecture for an Artificial Immune System.",
            "Embodiment of Evolutionary Computation in General Agents."
        ]
    },
    {
        "name": "Evolutionary Computation",
        "year": "1999",
        "info": "Volume 7, 1999",
        "count": 19,
        "papers": [
            "Production Scheduling and Rescheduling with Genetic Algorithms.",
            "Evolutionary Algorithms, Homomorphous Mappings, and Constrained Parameter Optimization.",
            "FOX-GA: A Genetic Algorithm for Generating and Analyzing Battlefield Courses of Action.",
            "Predicting Epistasis from Mathematical Models.",
            "An Evolutionary Algorithm for Interval Solid Transportation Problems.",
            "Schemata Evolution and Building Blocks.",
            "An Analysis of Generalization in the XCS Classifier System.",
            "Evolution Determined by Trajectory of Expected Populations: Sufficient Conditions, with Application to Crossover.",
            "Rigorous Hitting Times for Binary Mutations.",
            "Multi-objective Genetic Algorithms: Problem Difficulties and Construction of Test Problems.",
            "The Gambler's Ruin Problem, Genetic Algorithms, and the Sizing of Populations.",
            "A Statistical Study of a Class of Cellular Evolutionary Algorithms.",
            "Crossover Accelerates Evolution in GAs with a Babel-like Fitness Landscape: Mathematical Analyses.",
            "Scheduling of Water Distribution System Rehabilitation Using Structured Messy Genetic Algorithms.",
            "Scalability Problems of Simple Genetic Algorithms.",
            "FDA - A Scalable Evolutionary Algorithm for the Optimization of Additively Decomposed Functions.",
            "Linkage Identification by Non-monotonicity Detection for Overlapping Functions.",
            "Scaling of Program Fitness Spaces.",
            "On the Scalability of Parallel Genetic Algorithms."
        ]
    },
    {
        "name": "Evolutionary Computation",
        "year": "1998",
        "info": "Volume 6, 1998",
        "count": 18,
        "papers": [
            "Time Scheduling of Transit Systems With Transfer Considerations Using Genetic Algorithms.",
            "Genetic Forma Recombination in Permutation Flowshop Problems.",
            "Genetic Algorithms, Path Relinking, and the Flowshop Sequencing Problem.",
            "Solving a Real-World Problem Using an Evolving Heuristically Driven Schedule Builder.",
            "Initialization Strategies and Diversity in Evolutionary Timetabling.",
            "On the Futility of Blind Search: An Algorithmic View of \"No Free Lunch\".",
            "Conjugate Schema and Basis Representation of Crossover and Mutation Operators.",
            "Adapting Operator Settings in Genetic Algorithms.",
            "A Rigorous Complexity Analysis of the (1 + 1) Evolutionary Algorithm for Separable Functions with Boolean Inputs.",
            "DNA Computation: Theory, Practice, and Prospects.",
            "Schema Theory for Genetic Programming with One-Point Crossover and Point Mutation.",
            "The Simple Genetic Algorithm and the Walsh Transform: Part I, Theory.",
            "The Simple Genetic Algorithm and the Walsh Transform: Part II, The Inverse.",
            "Effects of Code Growth and Parsimony Pressure on Populations in Genetic Programming.",
            "Collective Adaptation: The Exchange of Coding Segments.",
            "Code Growth, Explicitly Defined Introns, and Alternative Selection Schemes.",
            "ptGAs - Genetic Algorithms Evolving Noncoding Segments by Means of Promoter/Terminator Sequences.",
            "Putting More Genetics into Genetic Algorithms."
        ]
    },
    {
        "name": "Evolutionary Computation",
        "year": "1997",
        "info": "Volume 5, 1997",
        "count": 17,
        "papers": [
            "New Methods for Competitive Coevolution.",
            "Empirical Investigation of the Benefits of Partial Lamarckianism.",
            "Forking Genetic Algorithms: GAs with Search Space Division Schemes.",
            "Multimodal Function Optimization Using Minimal Representation Size Clustering and Its Application to Planning Multipaths.",
            "Recent Advances in Evolvable Systems - ICES 96 (International Conference on Evolvable Systems).",
            "Probabilistic Incremental Program Evolution.",
            "Evolutionary Program Induction Directed by Logic Grammars.",
            "Learning to Control the Program Evolution Process with Cultural Algorithms.",
            "Evolutionary Induction of Sparse Neural Trees.",
            "Algebraic Theory of Recombination Spaces.",
            "Implicit Representation in Genetic Algorithms Using Redundancy.",
            "The Equation for Response to Selection and Its Use for Prediction.",
            "Empirical Investigation of Multiparent Recombination Operators in Evolution Strategies.",
            "Forming Neural Networks Through Efficient and Adaptive Coevolution.",
            "Evolutionary Consequences of Coevolving Targets.",
            "Optimization of Road Networks Using Evolutionary Strategies.",
            "General Cardinality Genetic Algorithms."
        ]
    },
    {
        "name": "Evolutionary Computation",
        "year": "1996",
        "info": "Volume 4, 1996",
        "count": 17,
        "papers": [
            "Evolutionary Algorithms for Constrained Parameter Optimization Problems.",
            "Resource Allocation as an Evolving Strategy.",
            "An Evolutionary Computing Approach to Probabilistic Reasoning on Bayesian Networks.",
            "An Analysis of the \"Universal Suffrage\" Selection Operator.",
            "Genetic Algorithms, Selection Schemes, and the Varying Effects of Noise.",
            "Analysis of Selection Algorithms: A Markov Chain Approach.",
            "A Comparison of the Fixed and Floating Building Block Representation in the Genetic Algorithm.",
            "How Mutation and Selection solve Long Path Problems in Polynomial Expected Time.",
            "Landscapes, Learning Costs, and Genetic Assimilation: Modeling the Evolution of Motivation.",
            "Modeling the Evolution of Motivation.",
            "How to Shift Bias: Lessons from the Baldwin Effect.",
            "Using Learning to Facilitate the Evolution of Features for Recognizing Visual Concepts.",
            "Is There Another New Factor in Evolution?",
            "A Measure of Landscapes.",
            "A Comparison of Selection Schemes used in Evolutionary Algorithms.",
            "Logarithmic Convergence of Random Heuristic Search.",
            "Some Comments on Evolutionary Algorithm Theory."
        ]
    },
    {
        "name": "Evolutionary Computation",
        "year": "1995",
        "info": "Volume 3, 1995",
        "count": 18,
        "papers": [
            "An Overview of Evolutionary Algorithms in Multiobjective Optimization.",
            "Balancing Accuracy and Parsimony in Genetic Programming.",
            "Genetic Algorithms as Global Random Search Methods.",
            "Toward a Theory of Evolution Strategies: On the Benefit of Sex - the (mu/mu, lambda)-Theory.",
            "Empirical Studies of the Genetic Algorithm with Non-Coding Segments.",
            "Classifier Fitness Based on Accuracy.",
            "Adaptive Learning of Process Control and Profit Optimisation using a Classifier System.",
            "Strongly Typed Genetic Programming.",
            "Solving Pattern Nesting Problems with Genetic Algorithms Employing Task Decomposition and Contact Detection.",
            "Tackling Car Sequencing Problems Using a Generic Genetic Algorithm Strategy.",
            "Finiteness of the Fixed Point Set for the Simple Genetic Algorithm.",
            "Towards a Theory of Evolution Strategies: Self-Adaptation.",
            "On the Relationship between the Duration of an Encounter and the Evaluation of Cooperation in the Iterated Prisoner's Dilemma.",
            "Search-Intensive Concept Induction.",
            "A Numerical Approach to Genetic Programming for System Identification.",
            "Modeling Simple Genetic Algorithms.",
            "Analyzing the (1, λ) Evolution Strategy via Stochastic Approximation Methods.",
            "A Note on the Empirical Evaluation of Intermediate Recombination."
        ]
    },
    {
        "name": "Evolutionary Computation",
        "year": "1994",
        "info": "Volume 2, 1994",
        "count": 18,
        "papers": [
            "ZCS: A Zeroth Level Classifier System.",
            "Is a Learning Classifier System a Type of Neural Network?",
            "Implicit Niching in a Learning Classifier System: Nature's Way.",
            "Using Coverage as a Model Building Constraint in Learning Classifier Systems.",
            "Scheduling of Genetic Algorithms in a Noisy Environment.",
            "A New Representation and Operators for Genetic Algorithms Applied to Grouping Problems.",
            "Genetic Algorithms for Soft-Decision Decoding of Linear Block Codes.",
            "The Genetic Algorithm Fractal.",
            "Book Review: Proceedings of the Fifth International Conference on Genetic Algorithms.",
            "Memory Exploitation in Learning Classifier Systems.",
            "Multiobjective Optimization Using Nondominated Sorting in Genetic Algorithms.",
            "Changing Representations During Search: A Comparative Study of Delta Coding.",
            "Mutation-Crossover Isomorphisms and the Construction of Discriminating Functions.",
            "Multi-Niche Crowding in Genetic Algorithms and its Application to the Assembly of DNA Restriction-Fragments.",
            "Simple Genetic Algorithms with Linear Fitness.",
            "A Derandomized Approach to Self Adaptation of Evolution Strategies.",
            "Toward a Theory of Evolution Strategies: The (mue, lambda)-Theory.",
            "A Description of Holland's Royal Road Function."
        ]
    },
    {
        "name": "Evolutionary Computation",
        "year": "1993",
        "info": "Volume 1, 1993",
        "count": 16,
        "papers": [
            "An Overview of Evolutionary Algorithms for Parameter Optimization.",
            "Predictive Models for the Breeder Genetic Algorithm, I: Continuous Parameter Optimization.",
            "A Hierarchy of Evolution Programs: An Experimental Study.",
            "Evolving Behaviors in the Iterated Prisoner's Dilemma.",
            "A Sequential Niche Technique for Multimodal Function Optimization.",
            "Searching for Diverse, Cooperative Populations with Genetic Algorithms.",
            "Genetic and Non-Genetic Operators in ALECSYS.",
            "Toward a Theory of Evolution Strategies: Some Asymptotical Results from the (1, +lambda)-Theory.",
            "Using Genetic Algorithms to Explore Pattern Recognition in the Immune System.",
            "Adding Learning to the Cellular Development of Neural Networks: Evolution and the Baldwin Effect.",
            "Physically Realistic Motion Synthesis in Animation.",
            "A Markov Chain Framework for the Simple Genetic Algorithm.",
            "A Genetic Algorithm for Channel Routing in VLSI Circuits.",
            "Evolutionary Divide and Conquer (I): A Novel Genetic Approach to the TSP.",
            "The Science of Breeding and Its Application to the Breeder Genetic Algorithm (BGA).",
            "Massively Parallel Simulated Annealing and Its Relation to Evolutionary Algorithms."
        ]
    }
]