[
    {
        "name": "Expert Systems",
        "year": "2022",
        "info": "Volume 39: 2022",
        "count": 79,
        "papers": [
            "High performance accelerators for deep neural networks: A review.",
            "Image super resolution model enabled by wavelet lifting with optimized deep convolutional neural network.",
            "Sparsity-aware support vector data description reinforced by expectation maximization.",
            "Sequential credit card fraud detection: A joint deep neural network and probabilistic graphical model approach.",
            "VIRDOCD: A VIRtual DOCtor to predict dengue fatality.",
            "An end-to-end framework for the detection of mathematical expressions in scientific document images.",
            "A multi-criteria decision making approach for strategy formulation using Pythagorean fuzzy logic.",
            "A sparse coded composite descriptor for human activity recognition.",
            "A hybrid optimization algorithm-based feature selection for thyroid disease classifier with rough type-2 fuzzy support vector machine.",
            "Evolutionary state-based novel multi-objective periodic bacterial foraging optimization algorithm for data clustering.",
            "Analysing stable feature selection through an augmented marine predator algorithm based on opposition-based learning.",
            "Training and assessing numerical abilities across the lifespan with intelligent systems: The example of Baldo.",
            "Eliciting symptom-diagnosis knowledge from online medical Q&A.",
            "Segmentation of malignant tumours in mammogram images: A hybrid approach using convolutional neural networks and connected component analysis.",
            "MapReduce paradigm: DNA sequence clustering based on repeats as features.",
            "Multi-start iterated local search metaheuristic for the multi-mode resource-constrained project scheduling problem.",
            "Weight attention layer-based document classification incorporating information gain.",
            "HTE 3.0: Knowledge-based systems in cascade for familial hypercholesterolemia detection and dyslipidemia treatment.",
            "An intelligent system for monitoring students' engagement in large classroom teaching through facial expression recognition.",
            "Expert systems and risk analytics in service engineering.",
            "A comparison analysis for credit scoring using bagging ensembles.",
            "Multi-objective optimization for stochastic failure-prone job shop scheduling problem via hybrid of NSGA-II and simulation method.",
            "An efficient adaptive genetic algorithm for energy saving in the hybrid flow shop scheduling with batch production at last stage.",
            "China's high-tech industry efficiency measurement with virtual frontier data envelopment analysis and Malmquist productivity index.",
            "Special issue on big data in transportation.",
            "A horizontal partitioning-based method for frequent pattern mining in transport timetable.",
            "Regional-based multi-module spatial-temporal networks predicting city-wide taxi pickup/dropoff demand from origin to destination.",
            "Spherical fuzzy extension of AHP-ARAS methods integrated with modified k-means clustering for logistics hub location problem.",
            "Improved detection of small objects in road network sequences using CNN and super resolution.",
            "Productivity measurement of industrial sector in China regarding air pollution.",
            "Goal programming and multiple criteria data envelopment analysis combined with optimization and Monte Carlo simulation: An application in railway components.",
            "A novel equilibrium optimizer based on levy flight and iterative cosine operator for engineering optimization problems.",
            "The demand effect analysis of head books and tail books in book recommendation networks.",
            "Development methodologies for ontology-based knowledge management systems: A review.",
            "Golden sine cosine SALP swarm algorithm for shape matching using atomic potential function.",
            "Multi-view rank-based random forest: A new algorithm for prediction in eSports.",
            "RDOF: An outlier detection algorithm based on relative density.",
            "Attention deep learning-based large-scale learning classifier for Cassava leaf disease classification.",
            "Improved multi-criteria group decision-making method considering hesitant fuzzy preference relations with self-confidence behaviours for environmental pollution emergency response process evaluation.",
            "Special issue on deep neural networks for biomedical data and imaging.",
            "DC-GAN-based synthetic X-ray images augmentation for increasing the performance of EfficientNet for COVID-19 detection.",
            "HSV model-based segmentation driven facial acne detection using deep learning.",
            "Decision support system for major depression detection using spectrogram and convolution neural network with EEG signals.",
            "Blockchain technology: A DNN token-based approach in healthcare and COVID-19 to generate extracted data.",
            "Optimal deep learning based fusion model for biomedical image classification.",
            "Predictive effect of computed tomography imaging omics features under deep learning on metastatic lymph nodes of nasopharyngeal carcinoma.",
            "COVID-19 special issue: Intelligent solutions for computer communication-assisted infectious disease diagnosis.",
            "Prediction of COVID-19 active cases using exponential and non-linear growth models.",
            "Value of medical imaging artificial intelligence in the diagnosis and treatment of new coronavirus pneumonia.",
            "Endoscopic image recognition method of gastric cancer based on deep learning model.",
            "Fuzzy logic control theory in clinical anesthesia.",
            "Medical image analysis of multiple myeloma based on convolutional neural network.",
            "Image segmentation algorithm of lung cancer based on neural network model.",
            "Clinical study of serum procalcitonin in the early diagnosis of burns and sepsis under the background of healthy clouds.",
            "P-SCADA - A novel area and energy efficient FPGA architectures for LSTM prediction of heart arrthymias in biot applications.",
            "An impact study of COVID-19 on six different industries: Automobile, energy and power, agriculture, education, travel and tourism and consumer electronics.",
            "Fruit category classification by fractional Fourier entropy with rotation angle vector grid and stacked sparse autoencoder.",
            "A scalable framework for smart COVID surveillance in the workplace using Deep Neural Networks and cloud computing.",
            "Pandemic coronavirus disease (Covid-19): World effects analysis and prediction using machine-learning techniques.",
            "A knowledge-based self-pre-diagnosis system to predict Covid-19 in smartphone users using personal data and observed symptoms.",
            "Deep learning-based scheme to diagnose Parkinson's disease.",
            "Automated COVID-19 detection in chest X-ray images using fine-tuned deep learning architectures.",
            "Review on COVID-19 diagnosis models based on machine learning and deep learning approaches.",
            "COVID-19 diagnosis system by deep learning approaches.",
            "Medical informatization of management system for admission office under convolutional neural network.",
            "Hybrid diabetes disease prediction framework based on data imputation and outlier detection techniques.",
            "A hybrid feature selection model based on butterfly optimization algorithm: COVID-19 as a case study.",
            "Efficient detection of Parkinson's disease using deep learning techniques over medical data.",
            "Fully-automatic identification of gynaecological abnormality using a new adaptive frequency filter and histogram of oriented gradients (HOG).",
            "A study on specific learning algorithms pertaining to classify lung cancer disease.",
            "Early prediction and monitoring of sepsis using sequential long short term memory model.",
            "Traditional and deep-based techniques for end-to-end automated karyotyping: A review.",
            "Autism diagnosis via correlation between vectors of direct quadrature instantaneous frequency of EEG analytic normalized intrinsic mode functions.",
            "PTXNet: An extended UNet model based segmentation of pneumothorax from chest radiography images.",
            "A novel quantum-inspired binary bat algorithm for leukocytes classification in blood smear.",
            "Local binary pattern and deep learning feature extraction fusion for COVID-19 detection on computed tomography images.",
            "Internet of healthcare things security vulnerabilities and jamming attack analysis.",
            "Intelligent grey forecasting model based on periodic aggregation generating operator and its application in forecasting clean energy.",
            "Multi-source BERT stack ensemble for cross-domain author profiling."
        ]
    },
    {
        "name": "Expert Systems",
        "year": "2021",
        "info": "Volume 38: 2021",
        "count": 149,
        "papers": [
            "Parameter reductions in N-soft sets and their applications in decision-making.",
            "Common set of weights in data envelopment analysis under prospect theory.",
            "Improving answer selection with global features.",
            "Authority updating: An expert authority evaluation algorithm considering post-evaluation and power indices in social networks.",
            "CoGCN: Combining co-attention with graph convolutional network for entity linking with knowledge graphs.",
            "Automating test oracles from restricted natural language agile requirements.",
            "Algorithms for complex interval-valued q-rung orthopair fuzzy sets in decision making based on aggregation operators, AHP, and TOPSIS.",
            "Special issue on intelligent biomedical data analysis and processing.",
            "Toc-Tum mini-games: An educational game accessible for deaf culture based on virtual reality.",
            "An intelligent hybrid approach for task scheduling in cluster computing environments as an infrastructure for biomedical applications.",
            "An intelligent hybrid approach for hepatitis disease diagnosis: Combining enhanced k-means clustering and improved ensemble learning.",
            "Creation of original Tamil character dataset through segregation of ancient palm leaf manuscripts in medicine.",
            "Selection of optimized features for fusion of palm print and finger knuckle-based person authentication.",
            "Dynamic decision support framework for production scheduling using a combined genetic algorithm and multiagent model.",
            "Performance-enhanced modified self-organising map for iris data classification.",
            "Android application behavioural analysis for data leakage.",
            "An evolutionary lion optimization algorithm-based image compression technique for biomedical applications.",
            "Hybrid particle swarm optimization for rule discovery in the diagnosis of coronary artery disease.",
            "A novel method for the classification of Alzheimer's disease from normal controls using magnetic resonance imaging.",
            "Designing Proportional Integral Controller for a Solar Powered DC-DC Converter Using PIPSO Algorithm and Deep Learning approach in Intelligent Bio-Medical Applications.",
            "Novel applications of soft computing techniques for industrial and environmental enterprises.",
            "Detection of anomalous episodes in urban Ozone maps.",
            "Optimizing a bi-objective vehicle routing problem that appears in industrial enterprises.",
            "Are you sure? Prediction revision in automated decision-making.",
            "Real time detection of acoustic anomalies in industrial processes using sequential autoencoders.",
            "Modelling material flow using the Milk run and Kanban systems in the automotive industry.",
            "Adaptive dialogue management using intent clustering and fuzzy rules.",
            "Serial and parallel memetic algorithms for the bounded diameter minimum spanning tree problem.",
            "Error prediction and structure determination for CMAC neural network based on the uniform design method.",
            "Positioning push-pull boundary in a hesitant fuzzy environment.",
            "A hybrid MCDM model combining DANP with TODIM to evaluate the information quality of community question answering in a two-dimensional linguistic environment.",
            "A dog food recommendation system based on nutrient suitability.",
            "Building an expert system for printer forensics: A new printer identification model based on niching genetic algorithm.",
            "A smartly designed automated map based clustering algorithm for the enhanced diagnosis of pathologies in brain MR images.",
            "Complex Pythagorean Dombi fuzzy operators using aggregation operators and their decision-making.",
            "A semantic-enabled and context-aware monitoring system for the internet of medical things.",
            "Knowledge based approach to ground refuelling optimization of commercial airplanes.",
            "A hybrid model for financial time-series forecasting based on mixed methodologies.",
            "Recommendation of users in social networks: A semantic and social based classification approach.",
            "NetHALOC: A learned global image descriptor for loop closing in underwater visual SLAM.",
            "Nested variational autoencoder for topic modelling on microtexts with word vectors.",
            "A modified butterfly optimization algorithm: An adaptive algorithm for global optimization and the support vector machine.",
            "Mining specific and representative information by the attribute-oriented induction method.",
            "Addressing the New Item problem in video recommender systems by incorporation of visual features with restricted Boltzmann machines.",
            "Pairs trading on different portfolios based on machine learning.",
            "A novel disturbance rejection factor based stable direct adaptive fuzzy control strategy for a class of nonlinear systems.",
            "An intelligent control strategy for cancer cells reduction in patients with chronic myelogenous leukaemia using the reinforcement learning and considering side effects of the drug.",
            "Semi-supervised, knowledge-integrated pattern learning approach for fact extraction from judicial text.",
            "A novel data clustering approach based on whale optimization algorithm.",
            "HFS-LightGBM: A machine learning model based on hybrid feature selection for classifying ICU patient readmissions.",
            "An overlap graph model for large-scale group decision making with social trust information considering the multiple roles of experts.",
            "Knowledge representation and acquisition using R-numbers Petri nets considering conflict opinions.",
            "Two-level pruning based ensemble with abstained learners for concept drift in data streams.",
            "Influence of codebook patterns on writer recognition: An experimental study.",
            "Privacy preservation of data using modified rider optimization algorithm: Optimal data sanitization and restoration model.",
            "Classification of cardiac disorders using 1D local ternary patterns based on pulse plethysmograph signals.",
            "Solving the Rubik's cube with stepwise deep learning.",
            "Robust design of a robot gripper mechanism using new hybrid grasshopper optimization algorithm.",
            "Effects of artificial intelligence on English speaking anxiety and speaking performance: A case study.",
            "Development of some techniques for solving system of linear and nonlinear equations via hybrid algorithm.",
            "Evolutionary fusion of classifiers trained on linear prediction based features for replay attack detection.",
            "Classification of Parkinson disease using binary Rao optimization algorithms.",
            "Project performance prediction model linking agility and flexibility demands to project type.",
            "A novel cost-sensitive algorithm and new evaluation strategies for regression in imbalanced domains.",
            "Extended TODIM-PROMETHEE II method with hesitant probabilistic information for solving potential risk evaluation problems of water resource carrying capacity.",
            "An attention-driven videogame based on steady-state motion visual evoked potentials.",
            "Flexible integrated scheduling algorithm based on remaining work probability selection coding.",
            "An approach for constructing expert yellow pages for community question answering sites.",
            "Temperature dependent optimal power flow using chaotic whale optimization algorithm.",
            "Special section on mining knowledge from scientific data.",
            "On the identification and analysis of citation pattern irregularities among journals.",
            "A neural approach for detecting inline mathematical expressions from scientific documents.",
            "A co-training-based approach for the hierarchical multi-label classification of research papers.",
            "The journal of knowledge engineering special issue on WorldCist'19 - Seventh World Conference on Information Systems and Technologies.",
            "Using Virtual Programming Lab to improve learning programming: The case of Algorithms and Programming.",
            "Rational, emotional, and attentional models for recommender systems.",
            "An integrated information systems architecture for the agri-food industry.",
            "Integrity verification and behavioral classification of a large dataset applications pertaining smart OS via blockchain and generative models.",
            "Biometrics and quality of life of lymphoma patients: A longitudinal mixed-model approach.",
            "An expert system for low-power and lossy indoor sensor networks.",
            "Multivariate-bounded Gaussian mixture model with minimum message length criterion for model selection.",
            "Learning from mistakes: Improving spelling correction performance with automatic generation of realistic misspellings.",
            "On-line modelling and planning for urban traffic control.",
            "Ranking range models under incomplete attribute weight information in the selected six MADM methods.",
            "Neutrosophic game pricing methods with risk aversion for pricing of data products.",
            "Special Issue: WorldCist18.",
            "Authoring tools for creating 360 multisensory videos - Evaluation of different interfaces.",
            "Enhancing decision making by providing a unified system for computer-interpretable guideline management.",
            "Evaluation of user interface design metrics by generating realistic-looking dashboard samples.",
            "The use of a weighted affective lexicon in a tutoring system to improve student motivation to learn.",
            "A sentiment analysis approach to improve authorship identification.",
            "Special issue on recent advances in data science and systems.",
            "Efficient weighted probabilistic frequent itemset mining in uncertain databases.",
            "Multi-label learning on principles of reverse k-nearest neighbourhood.",
            "What makes trading strategies based on chart pattern recognition profitable?",
            "An adaptive stacked hourglass network with Kalman filter for estimating 2D human pose in video.",
            "Building a cognizant honeypot for detecting active fingerprinting attacks using dynamic fuzzy rule interpolation.",
            "Hand gesture recognition using multimodal data fusion and multiscale parallel convolutional neural network for human-robot interaction.",
            "Residents' perceptions of smart energy meters.",
            "The boundary node method for multi-robot multi-goal path planning problems.",
            "A new feature extraction approach for script invariant handwritten numeral recognition.",
            "Inmplode: A framework to interpret multiple related rule-based models.",
            "A hybrid decision-making framework under complex spherical fuzzy prioritized weighted aggregation operators.",
            "Special issue on future hybrid artificial intelligence and machine learning for smart expert systems.",
            "2DSM vs FFDM: A computeraided diagnosis based comparative study for the early detection of breast cancer.",
            "Artificial plant optimization algorithm to detect infected leaves using machine learning.",
            "ResNet-Attention model for human authentication using ECG signals.",
            "Decision support system on credit operation using linear and logistic regression.",
            "Breast ultrasound tumour classification: A Machine Learning - Radiomics based approach.",
            "Constriction coefficient based particle swarm optimization and gravitational search algorithm for multilevel image thresholding.",
            "Window data envelopment analysis approach: A review and bibliometric analysis.",
            "Tuning structural parameters of neural networks using genetic algorithm: A credit scoring application.",
            "A fixed structure learning automata-based optimization algorithm for structure learning of Bayesian networks.",
            "Online one pass clustering of data streams based on growing neural gas and fuzzy inference systems.",
            "Evaluation of 3D design lower limb exoskeleton on human musculoskeletal with various loads.",
            "Business analytics in Industry 4.0: A systematic review.",
            "Cassava disease recognition from low-quality images using enhanced data augmentation model and deep learning.",
            "Automated detection of orofacial pain from thermograms using machine learning and deep learning approaches.",
            "Guest Editorial.",
            "Improving e-learning recommendation by using background knowledge.",
            "Estimating the square root of probability density function on Riemannian manifold.",
            "Emotion-aware polarity lexicons for Twitter sentiment analysis.",
            "Formal ways for measuring relations between concepts in conceptual spaces†.",
            "SEMAFLEX: A novel approach for implementing workflow flexibility by deviation based on constraint satisfaction problem solving.",
            "Increasing sample efficiency in deep reinforcement learning using generative environment modelling.",
            "GEP-based classifiers with drift-detection.",
            "Secure third-party data clustering using SecureCL, Φ-data and multi-user order preserving encryption.",
            "A multi-label cascaded neural network classification algorithm for automatic training and evolution of deep cascaded architecture.",
            "Engineering Data- & Model-Driven Applications: EDMA-2017 special issue editorial.",
            "An ordered sparse subspace clustering algorithm based on p-Norm.",
            "Analysis and prediction of high-speed train wheel wear based on SIMPACK and backpropagation neural networks.",
            "Job shop planning and scheduling for manufacturers with manual operations.",
            "Using semantic annotations on political debate videos for building open government based lawmaking.",
            "A double moral hazard model for inter-organizational knowledge sharing.",
            "Sentiment analysis for Urdu online reviews using deep learning models.",
            "Flight scheduling incorporating bad weather conditions through big data analytics: A comparison of metaheuristics.",
            "RQCSNet: A deep learning approach to quantized compressed sensing of remote sensing images.",
            "Rule-based preprocessing for data stream mining using complex event processing.",
            "Applying the peak-end rule to decision-making regarding similar products: A case-based decision approach.",
            "Meta-heuristic optimization algorithm for predicting software defects.",
            "Fermatean fuzzy set extensions of SAW, ARAS, and VIKOR with applications in COVID-19 testing laboratory selection problem.",
            "Requirement prioritization framework using case-based reasoning: A mining-based approach.",
            "On correlated information for learning predictive models under the Choquet integral.",
            "Multi-swarm and chaotic whale-particle swarm optimization algorithm with a selection method based on roulette wheel.",
            "Recurrent knowledge tracing machine based on the knowledge state of students.",
            "MCGDM with complex Pythagorean fuzzy -soft model.",
            "Diffusion strategies for face swiping medical service using evolutionary game theory.",
            "Response surface methodology to tune artificial neural network hyper-parameters.",
            "Integrating structural control, health monitoring, and energy harvesting for smart cities."
        ]
    },
    {
        "name": "Expert Systems",
        "year": "2020",
        "info": "Volume 37: 2020",
        "count": 119,
        "papers": [
            "A secure mHealth application for attention deficit and hyperactivity disorder.",
            "On the use of ear and profile faces for distinguishing identical twins and nontwins.",
            "AUDIT: AnomaloUs data Detection and Isolation approach for mobile healThcare systems.",
            "Ontology-Based Smart Medical Solutions.",
            "Improving privacy in health care with an ontology-based provenance management system.",
            "Frame Logic-based specification and discovery of semantic web services with application to medical appointments.",
            "Onyx: A new Canvas-based tool for visualizing biomedical and health ontologies.",
            "Converness: Ontology-driven conversational awareness and context understanding in multimodal dialogue systems.",
            "A knowledge construction methodology to automate case-based learning using clinical documents.",
            "Predicting and reducing \"hospital-acquired infections\" using a knowledge-based e-surveillance system.",
            "Disease Classification for Smart Health.",
            "A hybrid knowledge and ensemble classification approach for prediction of venous thromboembolism.",
            "Wearable ECG signal processing for automated cardiac arrhythmia classification using CFASE-based feature selection.",
            "Architecture and implementation of a smart-pregnancy monitoring system using web-based application.",
            "Situation-centered goal reinforcement of activities of daily living in smart home environments.",
            "Parameterizing neural networks for disease classification.",
            "Head mouse control system for people with disabilities.",
            "ArA*summarizer: An Arabic text summarization system based on subtopic segmentation and using an A* algorithm for reduction.",
            "A new clustering method based on the bio-inspired cuttlefish optimization algorithm.",
            "Distance-based intuitionistic multiplicative multiple criteria decision-making methods for healthcare management in West China Hospital.",
            "A multi-agent affective interactive MAGDM approach and its applications.",
            "Emergency decision making with extended axiomatic design approach under picture fuzzy environment.",
            "Improving the risk management of Type 2 diabetes mellitus in China from the perspective of social relationships.",
            "Building bagging on critical instances.",
            "A novel optimal PID controller autotuning design based on the SLP algorithm.",
            "Toxicity modelling of nanomaterials by origin evaluation of their physicochemical descriptors using a combination of principal component analysis and support vector machine methods.",
            "Advanced social media sentiment analysis for short-term cryptocurrency price prediction.",
            "Iwinac 2017: Assistive intelligence for the elderly.",
            "Fuzzy-description logic for supporting the rehabilitation of the elderly.",
            "Modelling hospital readmissions under frailty conditions for healthy aging.",
            "A multimodal conversational coach for active ageing based on sentient computing and m-health.",
            "A context-awareness model for activity recognition in robot-assisted scenarios.",
            "Film mood induction and emotion classification using physiological signals for health and wellness promotion in older adults living alone.",
            "EBNO: Evolution of cost-sensitive Bayesian networks.",
            "A fuzzy-clustering-based hierarchical i-vector/probabilistic linear discriminant analysis system for text-dependent speaker verification.",
            "An efficient neurodynamic model to solve nonconvex nonlinear optimization problems and its applications.",
            "A homogeneous ensemble method for predicting gastric cancer based on gastroscopy reports.",
            "Assessing stationarity in web analytics: A study of bounce rates.",
            "A robust and efficient convolutional deep learning framework for age-invariant face recognition.",
            "Endoscopy report mining for intelligent gastric cancer screening.",
            "Assessment of text coherence using an ontology-based relatedness measurement method.",
            "A class of monotone kernelized classifiers on the basis of the Choquet integral.",
            "BlockU: Extended usage control in and for Blockchain.",
            "Qualitative hesitant fuzzy group decision making: An additively consistent probability and consensus-based perspective.",
            "Air pollution forecasting based on attention-based LSTM neural network and ensemble learning.",
            "An outranking method for multicriteria decision making with probabilistic hesitant information.",
            "New data envelopment analysis models for assessing sustainability Part 1: A dynamic data envelopment analysis approach.",
            "Analysis of the environmental efficiency in China based on the DEA cross-efficiency approach under different policy objectives.",
            "Sustainability assessment of Iranian petrochemical companies in stock exchange: A data envelopment analysis-based approach.",
            "How does environmental regulation affect environmental performance? A case study of China's regional energy efficiency.",
            "Sustainability of Chinese airlines: A modified slack-based measure model for CO2 emissions.",
            "Sustainability assessment in the presence of undesirable factors over time: A case on gas companies.",
            "Dynamic efficiency evaluation of state-level business incubators in China by using a slacks-based measure approach.",
            "A survey on semanticized and personalized health recommender systems.",
            "Data envelopment analysis and robust optimization: A review.",
            "Trend following deep Q-Learning strategy for stock trading.",
            "A simplified neutrosophic multiplicative set-based TODIM using water-filling algorithm for the determination of weights.",
            "Simulating and modelling the DAX index and the USO Etf financial time series by using a simple agent-based learning architecture.",
            "A supervised learning approach for heading detection.",
            "Enriched Latent Dirichlet Allocation for Sentiment Analysis.",
            "A novel completeness definition of event logs and corresponding generation algorithm.",
            "Design of highly effective multilayer feedforward neural network by using genetic algorithm.",
            "Special issue on \"Machine Learning Challenges and Applications for Industry 4.0\".",
            "Special issue on internet of things and artificial intelligence in smart vehicle revolution.",
            "Tribute to Professor Miltos Petridis.",
            "New data envelopment analysis models for assessing sustainability Part 2: A static data envelopment analysis approach.",
            "Study of haze emission efficiency based on new co-opetition data envelopment analysis.",
            "A hybrid data envelopment analysis and multi-attribute decision making approach to sustainability assessment.",
            "Cross-efficiency evaluation method based on the conservative point of view.",
            "Measuring environmental sustainability performance of freight transportation seaports in C hina: A data envelopment analysis approach based on the closest targets.",
            "The global system-ranking efficiency model and calculating examples with consideration of the nonhomogeneity of decision-making units.",
            "A proposal for a 360° information system model for private health care organizations.",
            "Allocating the fixed cost based on data envelopment analysis in view of the Shapley value.",
            "Neutrosophic structured element.",
            "An objective and interactive-information-based feedback mechanism for the consensus-reaching process considering a non-support degree for minority opinions.",
            "Cascade convolutional neural network-long short-term memory recurrent neural networks for automatic tonal and nontonal preclassification-based Indian language identification.",
            "Contracting in Brazilian public administration: A machine learning approach.",
            "Ensemble feature selection in medical datasets: Combining filter, wrapper, and embedded feature selection results.",
            "Investigations on adaptive connectivity and shape prior based fuzzy graph-cut colour image segmentation.",
            "Fast and improved backpropagation learning of multi-layer artificial neural network using adaptive activation function.",
            "Uncertain location-allocation decisions for a bi-objective two-stage supply chain network design problem with environmental impacts.",
            "Modelling the vibration response of a gas turbine using machine learning.",
            "Assessing the importance of autistic attributes for autism screening.",
            "Implementation of an optimized binary classification by GMDH-type neural network algorithm for predicting the blast produced ground vibration.",
            "Deep OCR for Arabic script-based language like Pastho.",
            "Solving predictive control problem of fast-varying multivariable systems by incorporating unknown active dynamics generated by real-time adaptive learning machine.",
            "Development of optimal water supply plan using integrated fuzzy Delphi and fuzzy ELECTRE III methods - Case study of the Gamasiab basin.",
            "Evaluation of an interactive educational system in urban knowledge acquisition and representation based on students' profiles.",
            "Towards an automatic coding of observational studies: Coding neurofeedback therapies of children with autism.",
            "Developing a novel inverse data envelopment analysis (DEA) model for evaluating after-sales units.",
            "Domain problem-solving expert identification in community question answering.",
            "Special issue on \"advances in visual analytics and mining visual data\".",
            "Mobile phone data statistics as a dynamic proxy indicator in assessing regional economic activity and human commuting patterns.",
            "Dynamic framework to mining Internet of Things for multimedia services.",
            "A method for outlier detection based on cluster analysis and visual expert criteria.",
            "Online eigenvector transformation reflecting concept drift for improving network intrusion detection.",
            "An efficient hybrid similarity measure based on user interests for recommender systems.",
            "A machine learning approach for imputation and anomaly detection in IoT environment.",
            "The impact engineer - Weaving the Golden Braid.",
            "Deep learning techniques for recommender systems based on collaborative filtering.",
            "The use of machine learning and deep learning algorithms in functional magnetic resonance imaging - A systematic review.",
            "Bone age estimation from carpal radiography images using deep learning.",
            "An integrated probabilistic linguistic projection method for MCGDM based on ELECTRE III and the weighted convex median voting rule.",
            "Face similarity linkage: A novel biometric approach to sexually motivated serial killer victims.",
            "Special issue on new trends and challenges of bio-inspired computational intelligence algorithms in massively complex systems.",
            "StarTroper, a film trope rating optimizer using machine learning and evolutionary algorithms.",
            "The fixed set search applied to the power dominating set problem.",
            "Finding weaknesses in networks using Greedy Randomized Adaptive Search Procedure and Path Relinking.",
            "A new system for automatic analysis and quality adjustment in audiovisual subtitled-based contents by means of genetic algorithms.",
            "On the design of hybrid bio-inspired meta-heuristics for complex multiattribute vehicle routing problems.",
            "Distributed artificial bee colony approach for connected appliances in smart home energy management system.",
            "Transfer learning and information retrieval applied to fall detection.",
            "Fifth special issue on knowledge discovery and business intelligence.",
            "Semantic segmentation and colorization of grayscale aerial imagery with W-Net models.",
            "Sibilant consonants classification comparison with multi- and single-class neural networks.",
            "From mobility data to habits and common pathways.",
            "A context-aware recommender method based on text and opinion mining.",
            "Visual interpretation of regression error.",
            "A bi-objective procedure to deliver actionable knowledge in sport services."
        ]
    },
    {
        "name": "Expert Systems",
        "year": "2019",
        "info": "Volume 36: 2019",
        "count": 104,
        "papers": [
            "A comprehensive study on evolutionary algorithm-based multilayer perceptron for real-world data classification under uncertainty.",
            "HEARTDROID - Rule engine for mobile and context-aware expert systems.",
            "A modified slacks-based ranking method handling negative data in data envelopment analysis.",
            "A particle swarm optimizer with modified velocity update and adaptive diversity regulation.",
            "Discovering the associations between test items in an examination.",
            "Feature selection in single and ensemble learning-based bankruptcy prediction models.",
            "Classification of electroencephalogram signal for the detection of epilepsy using Innovative Genetic Programming.",
            "Implementing a fuzzy expert system for ensuring information technology supply chain.",
            "COSUM: Text summarization based on clustering and optimization.",
            "A hybrid solution approach for fuzzy multiobjective dual supplier and material selection problem of carton box production systems.",
            "A novel hybrid method for selecting soccer players during the transfer season.",
            "A comprehensive search for expert classification methods in disease diagnosis and prediction.",
            "Identification of I-equivalent subnetworks in Bayesian networks to incorporate experts' knowledge.",
            "Signed distance-based ORESTE for multicriteria group decision-making with multigranular unbalanced hesitant fuzzy linguistic information.",
            "Estimating time and score uncertainty in generating successful learning paths under time constraints.",
            "Distance-based multicriteria group decision-making approach with probabilistic linguistic term sets.",
            "Efficient management and storage of a multiversion OWL 2 DL domain ontology.",
            "A scheduling algorithm for applications in a cloud computing system with communication changes.",
            "Automatically solving two-variable linear algebraic word problems using text mining.",
            "Path planning of humanoids based on artificial potential field method in unknown environments.",
            "The use of data mining to classify Carménère and Merlot wines from Chile.",
            "An improved MULTIMOORA method with combined weights and its application in assessing the innovative ability of universities.",
            "Credit scoring for a microcredit data set using the synthetic minority oversampling technique and ensemble classifiers.",
            "Rough-fuzzy quadratic minimum spanning tree problem.",
            "A social recommendation system for academic collaboration in undergraduate research.",
            "Multi-objective robust fuzzy fractional order proportional-integral-derivative controller design for nonlinear hydraulic turbine governing system using evolutionary computation techniques.",
            "An adaptive clinical decision support system for serving the elderly with chronic diseases in healthcare industry.",
            "An integrated approach for aircraft turbofan engine fault detection based on data mining techniques.",
            "Multiaspect-based opinion classification model for tourist reviews.",
            "Time-selective integrated scheduling algorithm with backtracking adaptation strategy.",
            "Improving the SVM gender classification accuracy using clustering and incremental learning.",
            "Developing a personal value analysis method of social media to support customer segmentation and business model innovation.",
            "Multiobjective evolutionary feature selection and fuzzy classification of contact centre data.",
            "A geographic information system-based model for economical and eco-friendly high-speed railway route determination using analytic hierarchy process and least-cost-path analysis.",
            "A multiperiod hybrid decision support model for medical diagnosis and treatment based on similarities and three-way decision theory.",
            "Performance evaluation of various classifiers for predicting knee angle from electromyography signals.",
            "Typicality-based collaborative filtering for book recommendation.",
            "Metaheuristic algorithm to train product and sigmoid neural network classifiers.",
            "Churn prediction and social neighbour influences for different types of user groups in virtual worlds.",
            "Performance evaluation of multilayer perceptron, radial basis function, fuzzy inference system, and an adaptively tuned fuzzy wavelet neural network in parameter prediction of multiphase flow measurement instrumentation.",
            "A fast algorithm for local feature selection in data classification.",
            "A model to predict the survivability of cancer comorbidity through ensemble learning approach.",
            "Pareto-Koopmans efficiency in two-stage network data envelopment analysis in the presence of undesirable intermediate products and nondiscretionary factors.",
            "Classification of congestive heart failure with different New York Heart Association functional classes based on heart rate variability indices and machine learning.",
            "Creating sentiment lexicon for sentiment analysis in Urdu: The case of a resource-poor language.",
            "A systematic review on deep learning architectures and applications.",
            "The journal of knowledge engineering special issue on WorldCist'17 - fifth world conference on information systems and technologies.",
            "OWL-based acquisition and editing of computer-interpretable guidelines with the CompGuide editor.",
            "How cognitive and affective aspects can influence the outcome of the group decision-making process.",
            "Analysis of data trust through an intelligent-transparent-trust triangulation model.",
            "Boccia game simulator: Serious game adapted for people with disabilities.",
            "An empirical study on evolutionary feature selection in intelligent tutors for learning concept detection.",
            "The AppVox mobile application, a tool for speech and language training sessions.",
            "Cuckoo and krill herd-based k-means++ hybrid algorithms for clustering.",
            "Automatic assignment of reviewers in an online peer assessment task based on social interactions.",
            "The presence of governance: A system assessment based on innovative core regulatory principles for Brazilian regulators.",
            "An improved TOPSIS approach for the competitiveness analysis of provincial information resource industries in China.",
            "Target setting with minimum improving costs in data envelopment analysis: A mixed integer linear programming approach.",
            "Prediction of postpartum depression using machine learning techniques from social media text.",
            "Adaptive neuro-fuzzy inference modelling and sensitivity analysis for capacity estimation of fiber reinforced polymer-strengthened circular reinforced concrete columns.",
            "Novel neutrosophic Dombi Bonferroni mean operators with mobile cloud computing industry evaluation.",
            "Identifying mortality risk factors amongst acute coronary syndrome patients admitted to Arabian Gulf hospitals using machine-learning methods.",
            "Quantum-inspired genetic programming model with application to predict toxicity degree for chemical compounds.",
            "Group multigranular linguistic QFD for prioritizing service designs with combined weighting method.",
            "Grid quorum-based spatial coverage in mobile wireless sensor networks using nature-inspired firefly algorithm.",
            "Passenger travel behaviour on Chinese high-speed railways using machine learning based on revealed-preference data.",
            "Multi-criteria group decision-making method based on TODIM with probabilistic interval-valued hesitant fuzzy information.",
            "A stochastic multicriteria acceptability analysis-evidential reasoning method for uncertain multiattribute decision-making problems.",
            "Multiattribute decision making based on power operators for linguistic intuitionistic fuzzy set using set pair analysis.",
            "Music genre recognition using convolutional recurrent neural network architecture.",
            "Gathering and evaluating innovation ideas using crowdsourcing: Impact of the idea title and the description on the number of votes in each phase of a two-phase crowdsourcing project.",
            "A scheduling algorithm based on the singular value decomposition heuristic method in a distributed manufacturing system.",
            "Soft computing applications in the field of industrial and environmental enterprises.",
            "A fault detection system based on unsupervised techniques for industrial control loops.",
            "Big data solar power forecasting based on deep learning and multiple data sources.",
            "Predicting repayment of borrows in peer-to-peer social lending with deep dense convolutional network.",
            "Estimation of forest biomass from light detection and ranging data by using machine learning.",
            "Hybrid job offer recommender system in a social network.",
            "Bargains in the diamond market? How to take advantage from online information.",
            "A robust hybrid artificial neural network double frontier data envelopment analysis approach for assessing sustainability of power plants under uncertainty.",
            "Cloud data analysis using a genetic algorithm-based job scheduling process.",
            "Expert system for problem solving in distance university education: The successful case of the subject \"operations management\".",
            "MarCHGen: A framework for generating a malware concept hierarchy.",
            "An stochastic multiattribute acceptability analysis-based method for the multiattribute project portfolio selection problem with rank-level information.",
            "Extended vertical lists for temporal pattern mining from multivariate time series.",
            "Special issue on \"Multi-modal information learning and analytics of cross-media big data\".",
            "Research on the mechanism of knowledge and intelligence sharing in enterprises under big data: From the perspective of status-striving motivation and opinion dynamics.",
            "The parallel corpus for information extraction based on natural language processing and machine translation.",
            "Modular configuration of service elements based on the improved K-means algorithm.",
            "Dynamic analysis and simulation study of knowledge flow under the perspective of industrial transfer.",
            "Variable weight semantic graph-based ontology mapping method.",
            "Study on the mechanism of customers' participation in knowledge sharing.",
            "Allocating natural resource reduction amounts: A data envelopment analysis based-approach considering production technology heterogeneity.",
            "Ranking manufacturing processes from the quality management perspective in the automotive industry.",
            "Evaluating the short-term effect of cross-market discounts in purchases using neural networks: A case in retail sector.",
            "Data envelopment analysis with neutrosophic inputs and outputs.",
            "Stability analysis in identification of interval type-2 adaptive neuro-fuzzy inference system: Contribution to a novel Lyapunov function.",
            "A cumulative belief degree approach for group decision-making problems with heterogeneous information.",
            "A clustering-based feature selection framework for handwritten Indic script classification.",
            "A embedding model for text classification.",
            "Alternating optimization to solve penalized regression-based clustering model.",
            "Text analytics for big data using rough-fuzzy soft computing techniques.",
            "Cluster validation in clustering-based one-class classification.",
            "A novel end-to-end deep learning scheme for classifying multi-class motor imagery electroencephalography signals."
        ]
    },
    {
        "name": "Expert Systems",
        "year": "2018",
        "info": "Volume 35: 2018",
        "count": 75,
        "papers": [
            "Generalization of parity space to fault detection based on Takagi-Sugeno fuzzy models for non-linear dynamic systems.",
            "Correlation clustering methodologies and their fundamental results.",
            "Adapting the CMIM algorithm for multilabel feature selection. A comparison with existing methods.",
            "Expert finding by the Dempster-Shafer theory for evidence combination.",
            "Evaluation and selection of medical tourism sites: A rough analytic hierarchy process based multi-attributive border approximation area comparison approach.",
            "T-SAF: Twitter sentiment analysis framework using a hybrid classification scheme.",
            "Expert systems: The journal of knowledge engineering special issue on WorldCist'16 - 4th world conference on information systems and technologies.",
            "A bio-inspired tool for managing resilience in enterprise networks with embedded intelligent formulation.",
            "Content-based image retrieval based on binary signatures cluster graph.",
            "Automated email answering by text-pattern matching: Performance and error analysis.",
            "Information technology outsourcing relationship integration: a critical success factors study based on ranking problems (P.γ) and correlation analysis.",
            "An approach based on risk to dimensioning virtual organizations.",
            "Knowledge-based reasoning and recommendation framework for intelligent decision making.",
            "Decomposition and recompilation of mammograms for breast tumour detection.",
            "Personalized question recommendation for English grammar learning.",
            "An inference model for combustion diagnostics in an experimental oil furnace.",
            "Analysis and balance survey of discrete input-output systems under random environment.",
            "Expert systems: Special issue on \"Machine Learning Methods Neural Networks applied to Vision and Robotics (MLMVR)\".",
            "Learning deep representation for trajectory clustering.",
            "A long short-term memory based Schaeffer gesture recognition system.",
            "A cellular automata-based filtering approach to multi-temporal image denoising.",
            "Panorama construction for PTZ camera surveillance with the neural gas network.",
            "Insights from a text mining survey on Expert Systems research from 2000 to 2016.",
            "Learning adaptivity in support of flipped learning: An ontological problem-solving approach.",
            "Forecasting the volatility of a combined multi-country stock index using GWMA algorithms.",
            "Clustering short temporal behaviour sequences for customer segmentation using LDA.",
            "A divide-and-conquer strategy using feature relevance and expert knowledge for enhancing a data mining approach to bank telemarketing.",
            "Increasing the speed of fuzzy k-nearest neighbours algorithm.",
            "Improving quality of software product line by analysing inconsistencies in feature models using an ontological rule-based approach.",
            "Evaluation of the benefits of using a backward chaining decision support expert system for local flood forecasting and warning.",
            "A knowledge-based genetic algorithm for a capacitated fuzzy p-hub centre network under uncertain information.",
            "Uncertainty based genetic algorithm with varying population for random fuzzy maximum flow problem.",
            "Revisiting the Wang-Mendel algorithm for fuzzy classification.",
            "Advances in multisensor information fusion: A Markov-Kalman viscosity fuzzy statistical predictor for analysis of oxygen flow, diffusion, speed, temperature, and time metrics in CPAP.",
            "Fuzzy time series model based on weighted association rule for financial market forecasting.",
            "Neuromuscular disease detection by neural networks and fuzzy entropy on time-frequency analysis of electromyography signals.",
            "Decision-making under uncertainty through extending influence diagrams with interval-valued parameters.",
            "Processing technique of ratings for ranking of alternatives (PROTERRA).",
            "Identification of architectural distortions in mammograms using local binary patterns and radial lengths through an exhaustive evaluation framework.",
            "FNLP-ONT: A feasible ontology for improving NLP tasks in Persian.",
            "A combined fuzzy logic and artificial neural network approach for non-linear identification of IPMC actuators with hysteresis modification.",
            "An Arabic expert system for voice synthesis.",
            "Fuzzy adaptive cat swarm algorithm and Borda method for solving dynamic multi-objective problems.",
            "Fourth special issue on knowledge discovery and business intelligence.",
            "Analysis of a token density metric for concern detection in Matlab sources using UbiSOM.",
            "A biobjective feature selection algorithm for large omics datasets.",
            "Enhancing multilabel classification for food truck recommendation.",
            "Online bagging for recommender systems.",
            "Resampling with neighbourhood bias on imbalanced domains.",
            "Incremental one-class classification on stationary data stream using two-quarter sphere.",
            "Sentiment analysis in organizational work: Towards an ontology of people analytics.",
            "Information structures in set-valued information systems from granular computing viewpoint.",
            "Designing rule-based expert systems with the aid of the model-driven development approach.",
            "Ranking intuitionistic fuzzy numbers at levels of decision-making and its application.",
            "Expert systems: Special issue on \"New trends and Innovations in Intelligent Distributed Computing\".",
            "A heuristic approach to the multicriteria design of IaaS cloud infrastructures for Big Data applications.",
            "Game-theoretic approach for the optimal configuration computing of an interoperable fleet of unmanned vehicles.",
            "Multi-agent modelling and simulation of graph-based predator-prey dynamic systems: A BDI approach.",
            "Modelling a smart environment for nonintrusive analysis of attention in the workplace.",
            "Spatial Tuples: Augmenting reality with tuples.",
            "Control methodologies for vibration control of smart civil and mechanical structures.",
            "Development of a cost-optimization model to reduce bottlenecks: A health service case study.",
            "PFCA: An influence-based parallel fuzzy clustering algorithm for large complex networks.",
            "Mining of high-utility itemsets with negative utility.",
            "Improving the prediction of learning outcomes in educational platforms including higher level interaction indicators.",
            "Requirements-based approach for the diagnostic systems design process.",
            "À-trous wavelet transform-based hybrid image fusion for face recognition using region classifiers.",
            "Genetic algorithm supported by expert system to solve land redistribution problem.",
            "A data-driven method for rating management information systems journals in the same scale of the Association of Business Schools Journal Guide.",
            "A learning automata-based clustering algorithm using ant swarm intelligence.",
            "Knowledge discovery using maximization of the spread of influence in an expert system.",
            "Identification and handling of intensifiers for enhancing accuracy of Urdu sentiment analysis.",
            "A geodesic distance-based approach for shape-independent data clustering using coalitional game.",
            "Complex intuitionistic fuzzy power aggregation operators and their applications in multicriteria decision-making.",
            "Smart bacteria-foraging algorithm-based customized kernel support vector regression and enhanced probabilistic neural network for compaction quality assessment and control of earth-rock dam."
        ]
    },
    {
        "name": "Expert Systems",
        "year": "2017",
        "info": "Volume 34: 2017",
        "count": 52,
        "papers": [
            "Third special issue on knowledge discovery and business intelligence.",
            "Label Ranking Forests.",
            "A comparative study of approaches to forecast the correct trading actions.",
            "Ramex-Forum: a tool for displaying and analysing complex sequential patterns of financial products.",
            "Aggressive pruning strategy for time series retrieval using a multi-resolution representation based on vector quantization coupled with discrete wavelet transform.",
            "Visual analytics of educational time-dependent data using interactive dynamic visualization.",
            "On the specification of extract, transform, and load patterns behavior: A domain-specific language approach.",
            "Recent advances in control algorithms for smart structures and machines.",
            "A methodology for assessing the effect of portfolio management on NPD performance based on Bayesian network scenarios.",
            "Exploiting organizer influence and geographical preference for new event recommendation.",
            "Hybrid approaches for detecting credit card fraud.",
            "Determination of evidence correction factors based on the neural network.",
            "Gerontechnologies - Current achievements and future trends.",
            "Ontological modelling and rule-based reasoning for the provision of personalized patient education.",
            "Advances and trends for the development of ambient-assisted living platforms.",
            "Contextualized behavior patterns for change reasoning in Ambient Assisted Living: A formal model.",
            "A convolutional neural network to classify American Sign Language fingerspelling from depth and colour images.",
            "Decision-tree-based methods for differential diagnosis of β-thalassemia trait from iron deficiency anemia.",
            "Construction of families of probability boxes and corresponding membership functions at different fractiles.",
            "Determination of the appropriate parameters for K-means clustering using selection of region clusters based on density DBSCAN (SRCD-DBSCAN).",
            "Development of a multiprobe electrical resistivity tomography prototype system and robust underground clustering.",
            "Intelligent heart disease prediction in cloud environment through ensembling.",
            "A design for a common-sense knowledge-enhanced decision-support system: Integration of high-frequency market data and real-time news.",
            "Fuzzy logic and differential evolution-based hybrid system for gesture recognition using Kinect sensor.",
            "Electroencephalography-based feature extraction using complex network for automated epileptic seizure detection.",
            "Intelligence in educational environments.",
            "Incorporating android conversational agents in m-learning apps.",
            "Unsupervised feature selection for interpretable classification in behavioral assessment of children.",
            "Setting accessibility preferences about learning objects within adaptive elearning systems: User experience and organizational aspects.",
            "Predicting academic success by using context variables and probabilistic classification.",
            "A case study of duplications detection for educational domain thorough ad hoc search and identification NLP-based method.",
            "An adaptive hypermedia model based on student's lexicon.",
            "An agent-based modelling approach to build up educational digital games for kindergarten and primary schools.",
            "Enriching conflict resolution environments with the provision of context information.",
            "SCR: simulated concept recurrence - a non-supervised tool for dealing with shifting concept.",
            "An intelligent system to monitor refrigeration devices.",
            "CT ;lt;DT>: Extending the application of the consolidation methodology even further.",
            "An ontology to document a quality scheme specification of a software product.",
            "Special issue on innovative techniques and applications of artificial intelligence guest editorial.",
            "Speaker verification inspired by the physiology of hearing using spiking self-organising map.",
            "Genetic programming for the minimum time swing up and balance control acrobot problem.",
            "A hybrid model for business process event and outcome prediction.",
            "Pulmonary nodule diagnosis using dual-modal supervised autoencoder based on extreme learning machine.",
            "Meta-heuristic multi- and many-objective optimization techniques for solution of machine learning problems.",
            "Comparative assessment of statistical and machine learning techniques towards estimating the risk of developing type 2 diabetes and cardiovascular complications.",
            "Comparative analysis on the application of neuro-fuzzy models for complex engineered systems: Case study from a landfill and a boiler.",
            "A feature selection enabled hybrid-bagging algorithm for credit risk evaluation.",
            "Performance evaluation of rule-based expert systems: An example from medical billing domain.",
            "Heartbeats classification using QRS and T waves autoregressive features and RR interval features.",
            "Analysis and recognition of operations using SEMG from upper arm muscles.",
            "Fusion of artificial neural networks for learning capability enhancement: Application to medical image classification.",
            "Modified sequential k-means clustering by utilizing response: A case study for fashion products."
        ]
    },
    {
        "name": "Expert Systems",
        "year": "2016",
        "info": "Volume 33: 2016",
        "count": 44,
        "papers": [
            "A rule-based approach to detect and prevent inconsistency in the domain-engineering process.",
            "A cloud-based responsive replenishment system in a franchise business model using a fuzzy logic approach.",
            "An adaptive fuzzy handover triggering approach for Long-Term Evolution network.",
            "Classification by clustering using an extended saliency measure.",
            "Petroleum demand forecasting for Taiwan using modified fuzzy-grey algorithms.",
            "Gradient-based back-propagation dynamical iterative learning scheme for the neuro-fuzzy inference system.",
            "A mood- and situation-based model for developing intuitive Pop music recommendation systems.",
            "Conceptual feature generation for textual information using a conceptual network constructed from Wikipedia.",
            "Early dropout prediction using data mining: a case study with high school students.",
            "Context-based email classification model.",
            "Assessment of life insurance applications: an approach integrating neuro-symbolic rule-based with case-based reasoning.",
            "Ordinal regression by a gravitational model in the field of educational data mining.",
            "An approach for community detection in social networks based on cooperative games theory.",
            "Using Fourier coefficients in time series analysis for student performance prediction in blended learning environments.",
            "Nutrition for Elder Care: a nutritional semantic recommender system for the elderly.",
            "Predicting performance in ASEAN banks: an integrated fuzzy MCDM-neural network approach.",
            "Fuzzy risk assessment of mortality after coronary surgery using combination of adaptive neuro-fuzzy inference system and K-means clustering.",
            "Fruit classification by biogeography-based optimization and feedforward neural network.",
            "Risk prediction of product-harm events using rough sets and multiple classifier fusion: an experimental study of listed companies in China.",
            "Random subspace method with class separability weighting.",
            "Multi-level reranking approach for bug localization.",
            "Usability and acceptability assessment of an empathic virtual agent to prevent major depression.",
            "Operation-based approach for documenting software architecture knowledge.",
            "Followee recommendation in Twitter using fuzzy link prediction.",
            "Big Data trends: Modelling, Management and Visualization.",
            "Big data and data science: what should we teach?",
            "The improvement of analytics in massive open online courses by applying data mining techniques.",
            "A query language for multi-version data web archives.",
            "Eliciting and structuring business indicators in data warehouse requirements engineering.",
            "Ranking Fuzzy Cognitive Map based scenarios using ELECTRE III: Applied on housing market.",
            "Data preprocessing issues for incomplete medical datasets.",
            "Efficient representative pattern mining based on weight and maximality conditions.",
            "Identifying recommendation opportunities for computer-supported collaborative environments.",
            "Automatic Schaeffer's gestures recognition system.",
            "Senti-CS: Building a lexical resource for sentiment analysis using subjective feature selection and normalized Chi-Square-based feature weight generation.",
            "Forecasting financial time series using a methodology based on autoregressive integrated moving average and Taylor expansion.",
            "Automating maintenance for a one-way transmitting blackboard system used for autonomous multi-tier control.",
            "A semantic interoperability approach to health-care data: Resolving data-level conflicts.",
            "A new expert system for learning management systems evaluation based on neutrosophic sets.",
            "Nonlinear identification of a spark ignition engine torque based on ANFIS with NARX method.",
            "Automatic estimation of exercises' difficulty levels in a tutoring system for teaching the conversion of natural language into first-order logic.",
            "Knowledge structures in a knowledge base.",
            "An integrated method for real time and offline web robot detection.",
            "Physics-based search and optimization: Inspirations from nature."
        ]
    },
    {
        "name": "Expert Systems",
        "year": "2015",
        "info": "Volume 32: 2015",
        "count": 53,
        "papers": [
            "Architecture-driven assistance for fault-localization tasks.",
            "Providing decision support for replenishment operations using a genetic algorithms based fuzzy system.",
            "A reinforcement learning approach to competitive ordering and pricing problem.",
            "Application of temporal difference learning rules in short-term traffic flow prediction.",
            "Customer segmentation issues and strategies for an automobile dealership with two clustering techniques.",
            "SAaaS: a cloud computing service model using semantic-based agent.",
            "Facility layout design using a multi-objective interactive genetic algorithm to support the DM.",
            "Neural skyline filter for accelerating skyline search algorithms.",
            "A dual-tree complex wavelet transform-based approach for recognition of power system transients.",
            "Investigating the impact of training influence on employee retention in small and medium enterprises: a regression-type classification and ranking believe simplex analysis on sparse data.",
            "Computer-aided classification of breast masses in mammogram images based on spherical wavelet transform and support vector machines.",
            "Case-based reasoning for predicting the success of therapy.",
            "A proposed expert system for word sense disambiguation: deductive ambiguity resolution based on data mining and forward chaining.",
            "Contextual reliability discounting in welding process diagnostic based on DSmT.",
            "Fault prediction considering threshold effects of object-oriented metrics.",
            "Variable precision intuitionistic fuzzy rough set model and applications based on conflict distance.",
            "A new methodology for carbon price forecasting in EU ETS.",
            "Improving efficiency of merging symbolic rules into integrated rules: splitting methods and mergability criteria.",
            "Recommender systems in social and online learning environments.",
            "e-Learning recommender system for a group of learners based on the unified learner profile approach.",
            "Leveraging social semantic components in executable environments for learning.",
            "User-centred design and educational data mining support during the recommendations elicitation process in social online learning environments.",
            "Predicting teamwork results from social network analysis.",
            "A belief-desire-intention agent architecture for partner selection in peer-to-peer live video streaming applications.",
            "Bayesian network construction using a fuzzy rule based approach for medical decision support.",
            "RGB-D assistive technologies for acquired brain injury: description and assessment of user experience.",
            "Developing network data envelopment analysis model for supply chain performance measurement in the presence of zero data.",
            "Assessing the competitiveness of insurance corporations using fuzzy correlation analysis and improved fuzzy modified TOPSIS.",
            "Getting the environmental information across: from the Web to the user.",
            "Recent advances on knowledge discovery and business intelligence.",
            "Contrast set mining in temporal databases.",
            "Feature selection for clustering categorical data with an embedded modelling approach.",
            "Eigenspace method for spatiotemporal hotspot detection.",
            "Resampling strategies for regression.",
            "Learning to rank academic experts in the DBLP dataset.",
            "Determination of the effectiveness of the realization of enterprise business objectives and improvement strategies in an uncertain environment.",
            "Fuzzy rough set on probabilistic approximation space over two universes and its application to emergency decision-making.",
            "Automated emotion recognition employing a novel modified binary quantum-behaved gravitational search algorithm with differential mutation.",
            "Surrogate assisted-hybrid differential evolution algorithm using diversity control.",
            "Case-based approach for supporting strategy decision making.",
            "A two-level detector of short-term unique changes in time series based on a similarity method.",
            "Belief-rule-based expert systems for evaluation of e-government: a case study.",
            "A review of performance criteria to validate simulation models.",
            "A new data envelopment analysis method for ranking decision making units: an application in industrial parks.",
            "Rule-based approach for topic maps learning from relational databases.",
            "Linear models for cost-sensitive classification.",
            "Knowledge sourcing and knowledge reuse in the virtual product prototyping: an exploratory study in a large automotive supplier of R&D.",
            "Methods for ranking college sports coaches based on data envelopment analysis and PageRank.",
            "IWINAC 2O13 special section: editorial on intelligent systems for neural disorders and emotional state identification.",
            "A simulation tool for monitoring elderly who suffer from disorientation in a smart home.",
            "Spectral and cepstral analyses for Parkinson's disease detection in Spanish vowels and words.",
            "Long-term LEGO therapy with humanoid robot for children with ASD.",
            "Towards the search of detection in speech-relevant features for stress."
        ]
    },
    {
        "name": "Expert Systems",
        "year": "2014",
        "info": "Volume 31: 2014",
        "count": 42,
        "papers": [
            "Forward stage-wise ensemble regression algorithm to improve base regressors prediction ability: an empirical study.",
            "A genetic tango attack against the David-Prasad RFID ultra-lightweight authentication protocol.",
            "Towards a framework for multiple artificial neural network topologies validation by means of statistics.",
            "Higher order spectra analysis of breast thermograms for the automated identification of breast cancer.",
            "Neurofuzzy models to automate the grading of old-age depression.",
            "Development of a fuzzy decision support framework for complex multi-attribute decision problems: A case study for the selection of skilful basketball players.",
            "Identification of transcription factor binding sites using Gaussian mixture models.",
            "Data mining based storage assignment heuristics for travel distance reduction.",
            "Signal processing evaluation of myoelectric sensor placement in low-level gestures: sensitivity analysis using independent component analysis.",
            "Optimal direct mailing modelling based on data envelopment analysis.",
            "Electrocardiogram-based emotion recognition system using empirical mode decomposition and discrete Fourier transform.",
            "The strongest does not attract all but it does attract the most - evaluating the criminal attractiveness of shopping malls using fuzzy logic.",
            "A novel two-stage model for cloud service trustworthiness evaluation.",
            "On reactive routing protocols in ZigBee wireless sensor networks.",
            "Combining domain knowledge and machine learning for robust fall detection.",
            "Evaluating the performance of banking under risk regulations: a slacks-based Data Envelopment Analysis assessment framework.",
            "Dominance-based rough set theory over interval-valued information systems.",
            "Model-to-model and model-to-text: looking for the automation of VigilAgent.",
            "Using the genetic algorithm to enhance nonnegative matrix factorization initialization.",
            "Extracting grey relational systems from incomplete road traffic accidents data: the case of Gauteng Province in South Africa.",
            "Knowledge engineering in global software development environments.",
            "Managing knowledge on communication and information flow in global software projects.",
            "Knowledge-related challenges and solutions in GSD.",
            "Integration by communication: knowledge exchange in global outsourcing of product software development.",
            "Knowledge transfer in offshore outsourcing software development projects: an analysis of the challenges and solutions from German clients.",
            "Indicators of expert judgement and their significance: an empirical investigation in the area of cyber security.",
            "Qualitative bifurcation diagrams.",
            "Data envelopment analysis with discrete-valued inputs and outputs.",
            "Intelligent monitoring for people assistance and safety.",
            "Human activity recognition based on kinematic features.",
            "Human action recognition with sparse classification and multiple-view learning.",
            "Learning routines over long-term sensor data using topic models.",
            "Ambient assisted living system with capacitive occupancy sensor.",
            "A new adaptive support vector machine for diagnosis of diseases.",
            "A novel maritime risk assessment model incorporating a fuzzy rule-based approach.",
            "Special issue on innovative techniques and applications of artificial intelligence.",
            "Random Prism: a noise-tolerant alternative to Random Forests.",
            "Progressive heuristic search for probabilistic planning based on interaction estimates.",
            "Speaker verification using heterogeneous neural network architecture with linear correlation speech activity detection.",
            "Extracting knowledge from web communities and linked data for case-based reasoning systems.",
            "Trend mining in social networks: from trend identification to visualization.",
            "DenGraph-HO: a density-based hierarchical graph clustering algorithm."
        ]
    },
    {
        "name": "Expert Systems",
        "year": "2013",
        "info": "Volume 30: 2013",
        "count": 41,
        "papers": [
            "Editorial.",
            "Combining open-source natural language processing tools to parse clinical practice guidelines.",
            "A Case-Based Reasoning system for complex medical diagnosis.",
            "A Novel mCAD for pediatric metabolic brain diseases incorporating DW imaging and MR spectroscopy.",
            "Knowledge representation of the software architecture design process based on situation calculus.",
            "An association model based reasoning method for individualized service recommender.",
            "Multi-expression programming based model for prediction of formation enthalpies of nitro-energetic materials.",
            "Tracking a benchmark index - using a spreadsheet-based decision support system as the driver.",
            "A Universal neighbourhood rough sets model for knowledge discovering from incomplete heterogeneous data.",
            "Editorial to the 'pattern recognition and artificial intelligence for human behaviour analysis' special section.",
            "Human action recognition using an ensemble of body-part detectors.",
            "Social interactions by visual focus of attention in a three-dimensional environment.",
            "Is tangled the new wicked?",
            "Eliciting and prioritizing quality requirements supported by ontologies: a case study using the ElicitO framework and tool.",
            "Approximated fuzzy logic controlled shunt active power filter for improved power quality.",
            "Association rule mining using genetic programming to provide feedback to instructors from multiple-choice quiz data.",
            "Exploring the relationship between system development life cycle and knowledge accumulation in Taiwan's IT industry.",
            "Special section on advances and applications of problem orientation.",
            "Reusing knowledge in embedded systems modelling.",
            "Deriving problem frames from business process and object analysis models.",
            "Business goals, user needs, and requirements: A problem frame-based view.",
            "Security-level classification for confidential documents by using adaptive neuro-fuzzy inference systems.",
            "A hybrid neural network/genetic algorithm applied to breast cancer detection and recurrence.",
            "Using simple scenarios for wheelchair driving assistance.",
            "Cluster-based ensemble of classifiers.",
            "Knowledge Discovery and Business Intelligence.",
            "WiMAX traffic analysis and base stations classification in terms of LRD.",
            "Laplacian normalization for deriving thematic fuzzy clusters with an additive spectral approach.",
            "Visualization of evolving social networks using actor-level and community-level trajectories.",
            "Towards the automatic enrichment of a thesaurus with information in dictionaries.",
            "Neural network classification of aggregates by means of line laser based 3D acquisition.",
            "Game theory-based influence diagrams.",
            "Fuzzy machine vision based clip detection.",
            "Effect of Southern Oscillation Index and spatially distributed climate data on improving the accuracy of Artificial Neural Network, Adaptive Neuro-Fuzzy Inference System and K-Nearest Neighbour streamflow forecasting models.",
            "Forecasting business failure using two-stage ensemble of multivariate discriminant analysis and logistic regression.",
            "Flood forecasting at the Dadu River in China based on ANN.",
            "Classification of fuzzy data based on the support vector machines.",
            "Effects of the correlation model, the trend model, and the number of training points on the accuracy of Kriging metamodels.",
            "Application of generally weighted moving average method to tracking signal state space model.",
            "Developing a tool for intellectual capital assessment: an individual-level perspective.",
            "The data warehouse virtualization framework for operational business intelligence."
        ]
    },
    {
        "name": "Expert Systems",
        "year": "2012",
        "info": "Volume 29: 2012",
        "count": 35,
        "papers": [
            "Partial ordering of information granulations: a further investigation.",
            "A fuzzy self-organizing map algorithm for biological pattern recognition.",
            "A new hybrid recommendation algorithm with privacy.",
            "Expert system design for credit risk evaluation using neuro-fuzzy logic.",
            "CARR: a scalable solution for network packet classification.",
            "Classifiers sensitive to external context - theory and applications to video sequences.",
            "The cult of the (so-called) Expert System.",
            "Hybrid recommendations for mobile commerce based on mobile phone features.",
            "A computational intelligence-based approach for short-term traffic flow prediction.",
            "Multi-scale Internet traffic forecasting using neural networks and time series methods.",
            "Hybrid flowshop scheduling with sequence-dependent setup times by hybridizing max-min ant system, simulated annealing and variable neighbourhood search.",
            "Pattern filtering and classification for market basket analysis with profit-based measures.",
            "Robust genetic programming-based detection of atrial fibrillation using RR intervals.",
            "An improved protein fold recognition with support vector machines.",
            "Computing education that doesn't compute.",
            "Gaussian mixture decomposition in the analysis of MALDI-TOF spectra.",
            "Statistical and signal-based network traffic recognition for anomaly detection.",
            "Evaluating the quality of airport service using the fuzzy multi-criteria decision-making method: a case study of Taiwanese airports.",
            "Supporting activity modelling from activity traces.",
            "Optimizing the operating conditions in a high precision industrial process using soft computing techniques.",
            "SDF classifier revisited.",
            "The knowledge engineers' oath.",
            "A complete chronicle discovery approach: application to activity analysis.",
            "On application of input data partitioning to Bayesian weighted averaging of biomedical signals.",
            "A decision support system for fund raising management based on the Choquet integral methodology.",
            "Combining classifiers under probabilistic models: experimental comparative analysis of methods.",
            "Modified Smith predictor with a robust disturbance reduction scheme for linear systems with small time delays.",
            "Discovering patterns of online purchasing behaviour and a new-product-launch strategy.",
            "Engineering knowledge engineering.",
            "A differential evolution algorithm for joint replenishment problem using direct grouping and its application.",
            "A multi-resolution multi-classifier system for speaker verification.",
            "Feature selection for classification of oscillating time series.",
            "An improved procedure for detection of heart arrhythmias with novel pre-processing techniques.",
            "A distributed problem-solving framework for probabilistic software effort estimation.",
            "Relaxed constraints support vector machine."
        ]
    },
    {
        "name": "Expert Systems",
        "year": "2011",
        "info": "Volume 28: 2011",
        "count": 30,
        "papers": [
            "Neuronomics: connectionist economics.",
            "Experimental evaluations of proportional-integral-derivative type fuzzy controllers with parameter adaptive methods for an active magnetic bearing system.",
            "Semi-supervised classification of facial expression using a mixture of multivariate t distributions.",
            "Competitive/collaborative neural computing system for medical diagnosis in pancreatic cancer detection.",
            "Heuristic particle filter: applying abstraction techniques to the design of visual tracking algorithms.",
            "Multiple scale neural architecture for enhancing regions in the colour image segmentation process.",
            "Neural network applications for automatic new topic identification of FAST and Excite search engine transaction logs.",
            "Dissolved gases forecast to enhance oil-immersed transformer fault diagnosis with grey prediction-clustering analysis.",
            "A philosophy-driven entity classification and enrichment for ontology mapping.",
            "Evolution of superFeatures through genetic programming.",
            "A hybrid neural network approach for credit scoring.",
            "Special issue: business decision support systems.",
            "Optimization of joint maintenance strategy for safety-critical systems with different reliability degrees.",
            "Towards the prediction of business failure via computational intelligence techniques.",
            "An empirical comparison of cost-sensitive decision tree induction algorithms.",
            "Lag-ℓ forecasting and machine-learning algorithms.",
            "Building the knowledge society begins with breakfast.",
            "New perspectives on the application of expert systems.",
            "Communication in distributed tracking systems: an ontology-based approach to improve cooperation.",
            "Knowledge modeling through computational agents: application to surveillance systems.",
            "T-CARE: temporal case retrieval system.",
            "Adaptive fuzzy knowledge-based systems for control metabots' mobility on virtual environments.",
            "ARDIS: knowledge-based architecture for visual system configuration in dynamic surface inspection.",
            "A relationship-aware methodology for context-aware service selection.",
            "Improving the k-nearest neighbour rule: using geometrical neighbourhoods and manifold-based metrics.",
            "Introduction to the special issue on engineering semantic agent systems.",
            "Applying intelligent agents and semantic web services in eGovernment environments.",
            "An autonomous service-platform to support distributed ontology-based context-aware agents.",
            "Multi-agent collaboration based on enhanced cognitive awareness: an architecture for agents' profiling on the semantic web.",
            "Multi-agent system for knowledge-based event recognition and composition."
        ]
    },
    {
        "name": "Expert Systems",
        "year": "2010",
        "info": "Volume 27: 2010",
        "count": 31,
        "papers": [
            "Welcome to Volume 27, Issue 1.",
            "Computer recognition systems.",
            "An iris recognition approach through structural pattern analysis methods.",
            "Open architecture computer-aided diagnosis system.",
            "Combining knowledge from different sources.",
            "Human-machine interface in bioprosthesis control using EMG signal classification.",
            "Thinking inside the box.",
            "Identification and resolution of conflicts during ontological integration using rules.",
            "Discovering hidden knowledge in data classification via multivariate analysis.",
            "Extraction of media and plaque boundaries in intravascular ultrasound images by level sets and min/max flow.",
            "Method of classifier selection using the genetic approach.",
            "Knowledge acquisition in vague objective information systems based on rough sets.",
            "Cost-sensitive methods of constructing hierarchical classifiers.",
            "A study on non-invasive detection of blood glucose concentration from human palm perspiration by using artificial neural networks.",
            "A hybrid swarm intelligence algorithm for the travelling salesman problem.",
            "A fast expert system for electrocardiogram arrhythmia detection.",
            "Cascade of genetic algorithm and decision tree for cancer classification on gene expression data.",
            "Fuzzy adaptive anisotropic filter for medical images.",
            "Data envelopment analysis with classification and regression tree - a case of banking efficiency.",
            "Integrating computer vision with web-based knowledge for medical diagnostic assistance.",
            "Automatic diagnosis of diabetes using adaptive neuro-fuzzy inference systems.",
            "A case-based reasoning approach to derive object-oriented models from software architectures.",
            "Influence diagrams and multiple experts: a preliminary model.",
            "Feature selection for support vector machine in financial crisis prediction: a case study in China.",
            "On tangling.",
            "Real-time smart surveillance using motion analysis.",
            "Iterative support vector machine with guaranteed accuracy and run time.",
            "A study of the relative efficiency of Chinese ports: a financial ratio-based data envelopment analysis approach.",
            "A new DEA-based method for fully ranking all decision-making units.",
            "Measurement of enterprise knowledge by state characterization.",
            "A model-driven decision support system for product risk analysis."
        ]
    },
    {
        "name": "Expert Systems",
        "year": "2009",
        "info": "Volume 26: 2009",
        "count": 36,
        "papers": [
            "1983 and all that.",
            "Advances in medical decision support systems.",
            "Augmentation of a nearest neighbour clustering algorithm with a partial supervision strategy for biomedical data classification.",
            "Comparison of different classifier algorithms for diagnosing macular and optic nerve diseases.",
            "Electromyography signal analysis using wavelet transform and higher order statistics to determine muscle contraction.",
            "Differentiating types of muscle movements using a wavelet based fuzzy clustering neural network.",
            "A study on application of single nucleotide polymorphism and machine learning techniques to diagnosis of chronic hepatitis.",
            "Feasibility of probabilistic neural networks, Kohonen self-organizing maps and fuzzy clustering for source localization of ventricular focal arrhythmias from intravenous catheter measurements.",
            "A theoretic framework for intelligent expert systems in medical encounter evaluation.",
            "Analysis of cancer data: a data mining approach.",
            "Gene subset selection in microarray data using entropic filtering for cancer classification.",
            "Detection and delineation of P and T waves in 12-lead electrocardiograms.",
            "Beachbrains.",
            "Probabilistic neural networks combined with wavelet coefficients for analysis of electroencephalogram signals.",
            "Automatic tuning of L2-SVM parameters employing the extended Kalman filter.",
            "Estimating the uniaxial compressive strength of some clay-bearing rocks selected from Turkey by nonlinear multivariable regression and rule-based fuzzy models.",
            "Qualitative analysis of goat and sheep production data using self-organizing maps.",
            "An automated hierarchical gait pattern identification tool employing cross-correlation-based feature extraction and recurrent neural network based classification.",
            "Axiom-based ontology matching.",
            "A singular intelligence.",
            "Analysis of electrocardiographic changes in partial epileptic patients by combining eigenvector methods and support vector machines.",
            "An early warning system for financial crisis using a stock market instability index.",
            "Hybrid expert-fuzzy approach for evaluation of complex systems.",
            "Fuzzy sliding mode control of a finger of a humanoid robot hand.",
            "34957+70764=105621.",
            "Fuzzy based fast dynamic programming solution of unit commitment with ramp constraints.",
            "Preliminary evaluation of electroencephalographic entrainment using thalamocortical modelling.",
            "Modified mixture of experts employing eigenvector methods and Lyapunov exponents for analysis of electroencephalogram signals.",
            "Adaptive local hyperplane algorithm for learning small medical data sets.",
            "The polychronic economy.",
            "Extracting new patterns for cardiovascular disease prognosis.",
            "Colon segmentation and colonic polyp detection using cellular neural networks and three-dimensional template matching.",
            "Applying a belief rule-base inference methodology to a guideline-based clinical decision support system.",
            "Ontology integration within a service-oriented architecture for expert system applications using sensor networks.",
            "Intelligent and nature inspired optimization methods in medicine: the Pap smear cell classification problem.",
            "Unlabelled extra data do not always mean extra performance for semi-supervised fault prediction."
        ]
    },
    {
        "name": "Expert Systems",
        "year": "2008",
        "info": "Volume 25: 2008",
        "count": 34,
        "papers": [
            "2008 changes to the Editorial Board of Expert Systems.",
            "Special issue on applications and advances in problem frames.",
            "Problem frames and software engineering.",
            "The essential synthesis of problem frames and assurance cases.",
            "Enhancing problem frames with scenarios and histories in UML-based software development.",
            "Coloured Petri nets and graphical animation: a proposal for a means to address problem frame concerns.",
            "Towards aspectual problem frames: an example.",
            "Providing developmental feedback to individuals from different ethnic minority groups using expert systems.",
            "Environment classification using Kohonen self-organizing maps.",
            "Online expert systems for fault diagnosis in technical processes.",
            "Combining wavelet-based feature extractions with relevance vector machines for stock index forecasting.",
            "Implementing wavelet transform/mixture of experts network for analysis of electrocardiogram beats.",
            "Data mining technique for medical informatics: detecting gastric cancer using case-based reasoning and single nucleotide polymorphisms.",
            "Introduction to the special issue on advances in ontologies.",
            "Approaches for semantic interoperability between domain ontologies.",
            "Agent-based ontology mapping and integration towards interoperability.",
            "Evolutionary coincidence-based ontology mapping extraction.",
            "Trust-annotated ontology integration using social modelling.",
            "Meaningful web annotations for humans and machines using controlled natural language.",
            "The design of a semantic web compatible content language for agent communication.",
            "An empirical comparison of scalable part-whole ontology engineering patterns.",
            "A knowledge acquisition methodology to ontology construction for information retrieval from medical documents.",
            "Datacab: a geographical-information-system-based expert system for the design of cable networks.",
            "Examination of static and 50 Hz electric field effects on tissues by using a hybrid genetic algorithm and neural network.",
            "Feature extraction by autoregressive spectral analysis using maximum likelihood estimation: internal carotid arterial Doppler signals.",
            "Financial decision support using neural networks and support vector machines.",
            "Differential evolution and sparse neural networks.",
            "Automating construction of a domain ontology using a projective adaptive resonance theory neural network and Bayesian network.",
            "Signal-to-noise ratios for measuring saliency of features extracted by eigenvector methods from ophthalmic arterial Doppler signals.",
            "Feature extraction and dimensionality reduction by genetic programming based on the Fisher criterion.",
            "Detecting intrusion transactions in databases using data item dependencies and anomaly analysis.",
            "Soft ontologies, spatial representations and multi-perspective explorability.",
            "Towards ontological engineering: a process for building a domain ontology from scratch in public administration.",
            "A new approach based on a discrete hidden Markov model using the Rocchio algorithm for the diagnosis of heart valve diseases."
        ]
    },
    {
        "name": "Expert Systems",
        "year": "2007",
        "info": "Volume 24: 2007",
        "count": 23,
        "papers": [
            "Temporal support in the identification of e-learning efficacy: an example of object classification in the presence of ignorance.",
            "Comparison of different classification algorithms in clinical decision-making.",
            "MCORE: a context-sensitive recommendation system for the mobile Web.",
            "On fault isolation by neural-networks-based parameter estimation techniques.",
            "A comparison of gradient ascent, gradient descent and genetic-algorithm-based artificial neural networks for the binary classification problem.",
            "Detection of electrocardiogram beats using a fuzzy similarity index.",
            "Categorizing approaches combining rule-based and case-based reasoning.",
            "Application of an adaptive neuro-fuzzy inference system for classification of Behcet disease using the fast Fourier transform method.",
            "Assessment of the performances of multilayer perceptron neural networks in comparison with recurrent neural networks and two statistical methods for diagnosing coronary artery disease.",
            "Monitoring water quality through a telematic sensor network and a fuzzy expert system.",
            "Acquiring knowledge with limited experience.",
            "Decision-making method using a visual approach for cluster analysis problems; indicative classification algorithms and grouping scope.",
            "Evolutionary-based heuristic generators for checkers and give-away checkers.",
            "Incrementally updating a hybrid rule base based on empirical data.",
            "Knowledge-based treatment planning for adolescent early intervention of mental healthcare: a hybrid case-based reasoning approach.",
            "An improved approach to medical data sets classification: artificial immune recognition system with fuzzy resource allocation mechanism.",
            "Artificial intelligence applications in the telecommunications industry.",
            "Expert environments: machine intelligence methods for ambient intelligence.",
            "Understanding intention of movement from electroencephalograms.",
            "Context-aware environments: from specification to implementation.",
            "Knowledge representation for ambient security.",
            "A multi-camera vision system for fall detection and alarm generation.",
            "Collection, storage and application of human knowledge in expert system development."
        ]
    },
    {
        "name": "Expert Systems",
        "year": "2006",
        "info": "Volume 23: 2006",
        "count": 26,
        "papers": [
            "EIC Editorial: A time of change.",
            "New knowledge extraction technique using probability for case-based reasoning: application to medical diagnosis.",
            "User profiling on the Web based on deep knowledge and sequential questioning.",
            "An expert system for the selection of software design patterns.",
            "Genetic tuning of fuzzy inference within fuzzy classifier systems.",
            "An early warning system for detection of financial crisis using financial market volatility.",
            "Memetic evolutionary training for recurrent neural networks: an application to time-series prediction.",
            "The design process of expert systems development: some concerns.",
            "Hybrid genetic algorithms and case-based reasoning systems for customer classification.",
            "A case of rule-based heuristics for scheduling hot rolling seamless steel tube production.",
            "Combined neural network model to compute wavelet coefficients.",
            "Stages of knowledge management technology in the value shop: the case of police investigation performance.",
            "An expert system for lighting energy management in public school facilities.",
            "Mining fuzzy quantitative association rules.",
            "Fuzzy sliding-mode control with rule adaptation for nonlinear systems.",
            "Advances in intelligent information processing.",
            "A genetic algorithm approach to solving the anti-covering location problem.",
            "A heterogeneous computing system for data mining workflows in multi-agent environments.",
            "Distributed fuzzy discrete event system for robotic sensory information processing.",
            "Global optimization of feature weights and the number of neighbors that combine in a case-based reasoning system.",
            "Modeling uncertainties involved with software development with a stochastic Petri net.",
            "A fuzzy aggregation approach to group decision-making based on centroid measurement.",
            "Fuzzy modeling of the medical treatment effects of superoxide dismutase.",
            "Recent trends in knowledge and data integration for the life sciences.",
            "A different paradigm for expert systems: an introduction to logic programming and related knowledge representation issues.",
            "Intelligent information processing in human resource management: an implementation case in China."
        ]
    },
    {
        "name": "Expert Systems",
        "year": "2005",
        "info": "Volume 22: 2005",
        "count": 23,
        "papers": [
            "A knowledge-based system for the recycling of non-hazardous industrial residuals in civil engineering applications.",
            "Design and implementation of a process optimizer: a case study on monitoring molding operations.",
            "On procedures.",
            "Associative diagnosis.",
            "Knowledge management for administrative knowledge.",
            "An expert system for detection of electrocardiographic changes in patients with partial epilepsy using wavelet-based neural networks.",
            "A reasoning method for a ship design expert system.",
            "Flexible flow shop scheduling: optimum, heuristics and artificial intelligence solutions.",
            "Making sense of card sorting data.",
            "The sorting techniques: a tutorial paper on card sorts, picture sorts and item sorts.",
            "Women's working wardrobes: a study using card sorts.",
            "That site looks 88.46% familiar: quantifying similarity of Web page design.",
            "A multi-institutional, multinational study of programming concepts using card sort data.",
            "Using edit distance to analyze card sorts.",
            "Measuring card sort orthogonality.",
            "What do successful computer science students know? An integrative analysis using card sort measures and content analysis to evaluate graduating students' knowledge of programming concepts.",
            "Design of a case-based logistics strategy system - an integrated approach.",
            "Detecting the change of customer behavior based on decision tree analysis.",
            "Inducing safer oblique trees without costs.",
            "An adaptive learning algorithm for a wavelet neural network.",
            "A Web-enabled product definition and customization system for product conceptualization.",
            "Developments of fuzzy PID controllers.",
            "Strategies for preventing defection based on the mean time to defection and their implementations on a self-organizing map."
        ]
    },
    {
        "name": "Expert Systems",
        "year": "2004",
        "info": "Volume 21: 2004",
        "count": 20,
        "papers": [
            "The application of a fuzzy-rule-based system in an exposition of the antecedents of sedge warbler song flight.",
            "An agent-oriented and knowledge-based system for strategic e-procurement.",
            "CRAS-CBR: Internal control risk assessment system using case-based reasoning.",
            "Categorial expert systems.",
            "Genetic doping algorithm (GenD): theory and applications.",
            "The analysis and performance evaluation of the pheromone-Q-learning algorithm.",
            "Putting value of information theory into practice: a methodology for building sequential decision support systems.",
            "The impact of problem size on decision processes: an experimental investigation on very large choice problems with support of decision support systems.",
            "An intelligent information infrastructure to support the streamlining of integrated logistics workflow.",
            "Applying domain knowledge and social information to product analysis and recommendations: an agent-based decision support system.",
            "A framework of knowledge versioning management.",
            "Short-term electric power load forecasting using feedforward neural networks.",
            "An expert system on design of liquid-retaining structures with blackboard architecture.",
            "Automated generation of new knowledge to support managerial decision-making: case study in forecasting a stock market.",
            "Evolving modular networks with genetic algorithms: application to nonlinear time series.",
            "Expressing inter-link constraints in OWL knowledge bases.",
            "Integrated approach of cognitive maps and neural networks using qualitative information on the World Wide Web: the KBNMiner.",
            "An intelligent logistics support system for enhancing the airfreight forwarding business.",
            "A fuzzy approach to active usage parameter control in IEEE 802.11b wireless networks.",
            "Neural network ensembles: combining multiple models for enhanced performance using a multistage approach."
        ]
    },
    {
        "name": "Expert Systems",
        "year": "2003",
        "info": "Volume 20: 2003",
        "count": 27,
        "papers": [
            "A wavelet neural network for the detection of heart valve diseases.",
            "Providing Websites with capabilities of one-to-one marketing.",
            "On a responsive replenishment system: a fuzzy logic approach.",
            "Intelligent systems research in China.",
            "Feature space theory in data mining: transformations between extensions and intensions in knowledge representation.",
            "Automating application software generation.",
            "A programmable agent for knowledge discovery on the Web.",
            "Solving a class of facility location problems using genetic algorithms.",
            "Scenario-based knowledge representation in case-based reasoning systems.",
            "An experiment for showing some kind of artificial understanding.",
            "Data mining for selection of insurance sales agents.",
            "A computer-based system for road selection.",
            "A logic-based approach to rule induction in expert systems.",
            "A variational approach to intensity approximation for remote sensing images using dynamic neural networks.",
            "An intelligent agent with layered architecture for operating systems resource management.",
            "A new and efficient ant-based heuristic method for solving the traveling salesman problem.",
            "A knowledge processing method for intelligent systems based on inclusion degree.",
            "A model of a decision support system based on case-based reasoning for third-party logistics evaluation.",
            "Design of efficient hybrid neural networks for flexible flow shop scheduling.",
            "Rough sets: current and future developments.",
            "A rough set theory based method for anomaly intrusion detection in computer network systems.",
            "Intuitionistic fuzzy rough sets: at the crossroads of imperfect knowledge.",
            "Rough sets and maintenance in a production line.",
            "Knowledge acquisition in incomplete fuzzy information systems via the rough set approach.",
            "Probabilistic approaches to rough sets.",
            "A rough set approach to knowledge reduction based on inclusion degree and evidence reasoning theory.",
            "Acquisition of hierarchy-structured probabilistic decision tables and rules from data."
        ]
    },
    {
        "name": "Expert Systems",
        "year": "2002",
        "info": "Volume 19: 2002",
        "count": 26,
        "papers": [
            "Editorial.",
            "Guest Editorial: Fuzzy Control Systems.",
            "Fuzzy torque distribution control for a parallel hybrid vehicle.",
            "The design of supervisory rule-based control in the operating theatre via an anaesthesia simulator.",
            "Fuzzy predictive PI control for processes with large time delays.",
            "Adaptive hierarchical tuning of fuzzy controllers.",
            "Reasoning under uncertainty for plant disease diagnosis.",
            "From process experts to a real-time knowledge-based system.",
            "Coordination of intelligent agents in real-time search.",
            "A knowledge-based approach to maintenance project planning.",
            "Sequential decision-theoretic models and expert systems.",
            "A case-based reasoning approach for building a decision model.",
            "Overview of ship-design expert systems.",
            "Describing generic expertise models as object-oriented analysis patterns: the heuristic multi-attribute decision pattern.",
            "Guest Editorial: Fuzzy logic applications.",
            "Rule-based reasoning and neural network perception for safe off-road robot mobility.",
            "Expert system for nuclear power plant accident diagnosis using a fuzzy inference method.",
            "Some applications of fuzzy logic in rule-based expert systems.",
            "Mining clusters and corresponding interpretable descriptions - a three-stage approach.",
            "Monitoring the supply of products in a supply chain environment: a fuzzy neural approach.",
            "News feature and call for papers.",
            "Editorial.",
            "Chaotic analysis of predictability versus knowledge discovery techniques: case study of the Polish stock market.",
            "A prototype store choice and location modelling system using Dempster-Shafer theory.",
            "Modelling for an expert system and a parameter validation method.",
            "The perverse horrors of user-centric design."
        ]
    },
    {
        "name": "Expert Systems",
        "year": "2001",
        "info": "Volume 18: 2001",
        "count": 21,
        "papers": [
            "Editorial: Another millennium, another editorial...",
            "Intelligent interaction design: the role of human-computer interaction research in the design of intelligent systems.",
            "The Kohonen self-organizing map: an application to the study of strategic groups in the UK hotel industry.",
            "A fuzzy analytic hierarchy process approach in modular product design.",
            "I-DSS: an intelligent diagnostic support system.",
            "Selection of knowledge acquisition techniques based upon the problem domain characteristics of production and operations management expert systems.",
            "Modeling expert problem solving in a game of chance: a Yahtzee© case study.",
            "A metagenetic algorithm for information filtering and collection from the World Wide Web.",
            "Editorial.",
            "Development of an Expert System Shell Based on Genetic Algorithms for the Selection of the Energy Best Available Technologies and their Optimal Operating Conditions for the Process Industry.",
            "The Dialoguer: An Interactive Bilingual Interface to a Network Operating System.",
            "A Model-Based Method for an Online Diagnostic Knowledge-Based System.",
            "Foreword.",
            "Guest Editorial.",
            "Development of an Intelligent Data-Mining System for a Dispersed Manufacturing Network.",
            "Study of Learning Fuzzy Controllers.",
            "The Extraction of Trading Rules From Stock Market Data Using Rough Sets.",
            "An Efficient Expert System for Air Compressor Troubleshooting.",
            "A Radial Basis Function Neural Network Multicultural Factors Evaluation Engine For Product Concept Development.",
            "Knowledge Issues Raised in Modelling Trust in a Public Key Infrastructure.",
            "Integrating E-Business XML Business Forms and Rule-Based Agent Technologies."
        ]
    },
    {
        "name": "Expert Systems",
        "year": "2000",
        "info": "Volume 17: 2000",
        "count": 19,
        "papers": [
            "Editorial: Symbol processing in connectionist systems.",
            "A connectionist production system which can perform both modus ponens and modus tollens simultaneously.",
            "Connectionist symbolic rule encoding using a generalized phase-locking mechanism.",
            "Analogy retrieval and processing with distributed vector representations.",
            "Fractal encoding of context-free grammars in connectionist networks.",
            "Knowledge-based system for telecontrol of anaerobic wastewater treatment plants.",
            "A hybrid system applied to epidemic screening.",
            "GDKAT: A goal-driven knowledge acquisition tool for knowledge base development.",
            "A connectionist inference model for pattern-directed knowledge representation.",
            "Internet-based expert systems.",
            "Classification and rule induction using rough set theory.",
            "Feedforward networks in financial predictions: the future that modifies the present.",
            "Developing a neural network approach for intelligent scheduling in GUESS.",
            "Neural network analysis and the characteristics of market sentiment in the financial markets.",
            "Diagnostic expert systems: a method for engineering knowledge used in sequential diagnosis.",
            "Comparing response latency and self-report methods for estimating levels of certainty in knowledge elicitation for rule-based expert systems.",
            "Knowledge representation in an activated sludge plant diagnosis system.",
            "A knowledge-based system for preventive maintenance.",
            "Method fragments."
        ]
    },
    {
        "name": "Expert Systems",
        "year": "1999",
        "info": "Volume 16: 1999",
        "count": 26,
        "papers": [
            "Editorial.",
            "An interactive tool for knowledge base refinement.",
            "An actor model for rule-based systems.",
            "ICADS: Intelligent Car Audio Design System for product planning.",
            "Déjà vu all over again: AAAI '98 Madison, Wisconsin, USA 26-30 July 1998.",
            "Foreword.",
            "Symbol processing - a challenge for neural networks?",
            "Comparing neural network approximations for different functional forms.",
            "Extending CLIPS to support temporal representation and reasoning.",
            "Facilitating the use of multi-attribute utility theory in expert systems: an aid for identifying the right relative importance weights of attributes.",
            "Development of a fuzzy push delivery scheme for Internet sites.",
            "An online expert system for fault diagnosis in hydraulic systems.",
            "AI in the next millennium.",
            "Expert knowledge acquisition and the unwilling expert: a knowledge engineering perspective.",
            "A function-centered framework for reasoning about system failure at multiple levels of abstraction.",
            "A knowledge sorting process for a product design expert system.",
            "The rise and 'fall' of expert systems in medicine.",
            "Connectionist variable binding.",
            "The Department of Trade and Industry's Smart Systems for Decision Makers initiative.",
            "Editorial.",
            "Integrating symbolic and numerical features for fault prediction and diagnosis by an expert system.",
            "Dynamic recurrent neural networks for a hybrid intelligent decision support system for the metallurgical industry.",
            "Hybrid artificial intelligence approach to urban planning.",
            "A hybrid knowledge-based system applied to epidemic screening.",
            "Representing diverse mathematical problems using neural networks in hybrid intelligent systems.",
            "Proposing an architectural framework of a hybrid knowledge-based system for production rescheduling."
        ]
    }
]